{
  "title": "Episode 59: &#8220;Whole Lotta Shakin&#8217; Goin&#8217; On&#8221; by Jerry Lee Lewis",
  "link": "https://500songs.com/podcast/episode-59-whole-lotta-shakin-goin-on-by-jerry-lee-lewis/",
  "pubDate": "Mon, 02 Dec 2019 16:39:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=560",
  "description": "Episode fifty-nine of A History of Rock Music in Five Hundred Songs looks at \"Whole Lotta Shakin' Goin' On\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/32023341\"> on \"So Long I'm Gone\"</a> by Warren Smith.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-59-whole-lotta-shakin/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI'm relying heavily on <em><a href=\"https://amzn.to/2VDGeeo\">Sam Phillips: the Man Who Invented Rock and Roll</a> </em>by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. <a href=\"https://amzn.to/2IImoLJ\">This one by Rick Bragg</a> is better than most.\n\nThe episode of Cocaine and Rhinestones I mention in the episode is <a href=\"https://cocaineandrhinestones.com/ralph-mooney-country-music-sound\">here</a>.\n\nThere are many budget CDs containing Lewis' pre-1962 work. <a href=\"https://amzn.to/2OFartv\">This set</a> seems as good an option as any.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n<strong>Transcript</strong>\n\nWe're in an odd position with this episode, really. The first time we looked at Jerry Lee Lewis, it was as part of the Million Dollar Quartet, yet at the time of the actual Million Dollar Quartet session, Lewis was basically an unknown, and we didn't have time to cover his career up to that point -- even though the Million Dollar Quartet recordings prove that he considered himself a peer of Elvis and Carl Perkins right from the start. And we also talked about Lewis a fortnight ago, when we were dealing with Billy Lee Riley, but again, the focus was on someone other than Lewis.\n\nThe problem is that Jerry Lee Lewis is just the kind of figure who demands discussion, even before he became a famous musician. He's someone who just dominates other people's stories, and pushes in to them and takes over.\n\nSo now we've got to the point where he's about to have his first hit, but we haven't really looked at how he got to that point, just at him interacting with other people. So now we're going to have to back up, and look at the first hit record from the last great artist to be discovered by Sun Records.\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin' Going On\"]\n\nJerry Lee Lewis was a young piano player from Ferriday, Louisiana, who loved music more than anything. He loved Gene Autry, and Hank Williams -- and he loved Al Jolson. He would later tell a story about going on a date to the cinema. Before the show they were playing records, and one record that came on was Jolson singing \"Toot Toot Tootsie Goodbye\":\n\n[Excerpt: Al Jolson, \"Toot Toot Tootsie Goodbye\"]\n\nLewis immediately got out of his seat, told his girlfriend he needed to use the toilet, cycled home, worked out how to play the song on the piano, cycled back, and rejoined his date for the film. She asked why he'd been gone so long, and he said he'd picked up some popcorn as well.\n\nSam Phillips would often say later that Jerry Lee Lewis was the most naturally talented musician he ever worked with. Elvis was the most charismatic, Johnny Cash had the most commanding presence, and Howlin' Wolf was the most profound artist, but Lewis was the one who had the greatest obsession with his music, the greatest drive to create, and the greatest sheer knowledge of music, in all different genres. Lewis would play piano for eight hours a day, and while in other matters he was surprisingly ignorant -- other than the Bible, the only things he ever read were comics -- he could talk with a huge amount of authority about the musical techniques of everyone from B.B. King to Frank Sinatra, and he could hear a song once and remember it and play it years later. And whatever music he learned, from whatever source, he would somehow transmute it and turn it into a Jerry Lee Lewis song. Nothing he played sounded like anyone else.\n\nHe'd started playing music when he was four years old. He'd been walking past a piano in the house of his rich uncle, Lee Calhoun, and had felt the urge to play it. He'd almost instantly figured out how to play the beginning of \"Silent Night\", and his parents -- who always doted on him and tried to give him everything he wanted, after the tragically young death of his older brother -- realised that they might have a child prodigy on their hands. When his father finally got into a position where he could buy his own farm, the first thing he did was remortgage it so he could buy his son his own piano. They didn't have electricity in the house -- until Elmo Lewis decided to wire the house for electricity, so his boy Jerry Lee could listen to the radio and learn more songs. What Jerry Lee wanted, he got.\n\nAs a kid, Jerry Lee was always the one who would get his relatives into trouble. He would go to the cinema -- a sin in the strict Pentecostal religion of his family -- and one time he dragged in Jimmy Swaggart, who was his \"double first cousin\" -- Swaggart's father was Lewis' father's nephew, while Swaggart's mother was Lewis' mother's sister. Swaggart ran out of the cinema crying, convinced he had damned himself to hell. Jerry Lee stayed and watched the cowboys.\n\nBut while he loved the cinema, the piano was his true love. He and Swaggart, and their other cousin Mickey Gilley, would all play piano together, as well as separately. But Jerry Lee was undoubtedly the most talented, and he was also the biggest music lover, and he would spend his time trying to adapt the styles of the musicians he liked to the piano.\n\nEven though Jerry Lee was in Louisiana, which is the home of great piano playing, most of his musical influences were guitarists. His favourite musician was Jimmie Rodgers, and Jerry Lee would play his \"Waiting For a Train\":\n\n[Excerpt: Jimmie Rodgers, \"Waiting For a Train\"]\n\nHis favourite song to play, though, was \"Drinking Wine Spo-De-O-Dee\", the Sticks McGhee record that some credit as the first rock and roll record ever:\n\n[Excerpt: Sticks McGhee: \"Drinking Wine Spo-De-O-Dee\"]\n\nBut he had two bigger influences -- two people who could actually play the piano the way that Jerry Lee thought it should be played. The first was Moon Mullican, who we talked about back in the episode on Hank Williams. Mullican was another Louisiana piano player, and another musician who combined bits of everything -- Western Swing, hillbilly boogie, blues, R&B, gospel, Cajun music -- into a unique melange of styles all his own:\n\n[Excerpt: Moon Mullican, \"Piano Breakdown\"]\n\nThe other big influence on young Jerry Lee was his uncle, Carl McVoy. McVoy never became famous, but he made a couple of records after his nephew became famous, and listening to this one, made in 1957 with much of the same group of musicians who worked on Elvis' hits, including Chet Atkins and the Jordanaires, it's spooky how much it sounds like Jerry Lee himself:\n\n[Excerpt: Carl McVoy: \"You Are My Sunshine\"]\n\nBut young Jerry Lee was torn between two worlds. On the one hand, as a kid he would regularly sneak into a local blues club with an otherwise entirely black clientele, and hide under the tables to watch people like Fats Domino, Charles Brown, B.B. King, and Big Joe Turner, until he was kicked out by the owner -- who, understandably, was not keen on having underaged white kids in his black drinking and gambling club in the segregated South.\n\nOn the other, he was deeply, deeply, religious, and for a while he studied at the Southwestern Bible Institute in Waxahachie, Texas, in the hope of becoming a priest. Unfortunately, he was kicked out after playing the hymn \"My God is Real\" with a boogie feel, which according to the people in charge was inciting lust among the other students.\n\nThis tension between religion and the secular world would recur throughout Lewis' life, but by the time he signed to Sun Records, aged twenty-one, he was firmly on the side of the Devil. He'd been making a living as a sewing machine salesman, conning women into signing up to buy one on credit by telling them they'd won the machine in a contest. He'd already got married twice, and hadn't actually got around to divorcing his first wife before marrying the second – and he'd also decided it was about time he moved on from the second wife as well.\n\nHe'd been touring with a blind musician called Paul Whitehead. Whitehead could play violin, accordion, and piano, and Jerry Lee would play piano while Mr. Paul, as he was always called, played the fiddle, and move on to the drums when Mr. Paul played the piano. Sometimes they would also add a bass player, Johnny Littlejohn (not the same person as the Chicago blues guitarist of the same name). Littlejohn had something of the style of Elvis, and Jerry Lee was jealous of him.\n\nThere's only one recording available of Lewis' mentor Mr. Paul -- his piano part on an obscure rockabilly song, \"Right Now\", by Gray Montgomery:\n\n[Excerpt: Gray Montgomery, \"Right Now\"]\n\nBut while he needed a mentor for a while, Jerry Lee Lewis knew he was destined to be great on his own. The big break came when he read in a magazine about how it was Sam Phillips who had made Elvis into a star. He'd already tried RCA Records, the label Elvis was now on -- they'd told him he needed to play a guitar. He'd blagged his way into an audition at the Grand Ole Opry, and the same thing had happened -- he'd been told to come back when he played guitar, not piano. The only person in the country establishment who was kind to him was another piano player, Del Wood, who thought this young man reminded her of herself:\n\n[Excerpt: Del Wood, \"Down Yonder\"]\n\nMaybe Phillips would have more sense in him, and would see the greatness of a man who had been known to refer to himself, blasphemously, as \"The Great I AM\". Jerry Lee knew that if he just got the right break he could be the greatest star of all time.\n\nHe and his father drove down to Memphis, and got themselves a hotel room, which was the first time they'd ever stayed anywhere with running water. They saved the money from selling hundreds of eggs from Jerry Lee's father's henhouse to a local supermarket, and they couldn't afford to stay there very long.\n\nAnd then, when they went into the Sun studio to meet this Mr. Phillips, the person to whom Jerry Lee had pinned all his dreams, they were told that Phillips was out of town. They were welcome to come back later, of course -- but they couldn't afford to just travel back to Memphis later and book another hotel room. It was now or never, and Jerry Lee was just going to stay there until someone listened to him play the piano.\n\nThe person who eventually agreed to listen to him was Cowboy Jack Clement, who became intrigued when Jerry Lee told him that he could play piano and make it sound like Chet Atkins did when he was playing guitar -- except that, no, he was better at piano than Chet Atkins was on guitar. Jerry Lee played for Clement for three or four hours, and when Clement played the tape for Sam Phillips when he got back from his trip, Phillips agreed -- they needed to get this man in.\n\nLewis' first single was recorded almost as a joke. We talked a little about his recording of \"Crazy Arms\" a couple of weeks back, in the episode on Billy Lee Riley, but there's more to say about the song than we covered there.\n\n[Excerpt: Jerry Lee Lewis, \"Crazy Arms\"]\n\n\"Crazy Arms\" is a song with a disputed history. There are claims that the song was actually written by a man from Kentucky named Paul Gilley, who died in 1957 and is also considered by some to have secretly ghostwritten a number of Hank Williams' hits, including \"Cold Cold Heart\" and \"I'm So Lonesome I Could Cry\".\n\nUnfortunately, the bulk of the evidence for this is only available in a self-published book, which can't even be bought from Amazon but has to be purchased directly from the author via Craigslist, so I have no way of assessing the accuracy of these claims. It seems unlikely to me, but not impossible, and so I'm going to go here with the conventional narrative, that the song was written by the great pedal steel guitar player Ralph Mooney, in 1949, but had remained unrecorded until a demo by Mooney's frequent collaborator, Wynn Stewart, in 1954.\n\nThe first release of the song was by a very minor country singer called Marilyn Kaye, and while it wasn't a hit for her, it got enough response from radio listeners that a DJ played it to the singer Ray Price, who recorded his own version as a result:\n\n[Excerpt: Ray Price, \"Crazy Arms\"]\n\nThat became the biggest country hit of 1956, and while it doesn't sound hugely revolutionary these days, it totally changed the sound of honky-tonk music from that point on, thanks largely to the bass player playing four notes to the bar rather than the more usual two. We don't have time in this episode to look into just how much this changed country music, but I'll link an episode of the great country podcast Cocaine and Rhinestones, all about Ralph Mooney, and which talks about the song in more detail, in the notes to this episode.\n\nBut the important thing is that Ray Price's version of \"Crazy Arms\" was *everywhere* in 1956, and so it's unsurprising that at the end of Jerry Lee Lewis' first solo session for Sun, he started busking his way through the song, which he'd also played on his audition tape:\n\n[Excerpt: Jerry Lee Lewis, \"Crazy Arms\"]\n\n\"Crazy Arms\" would always be a bit of a disappointment to Jerry Lee, not because it wasn't a massive hit -- that didn't bother him, he knew he'd have to make a few records before he became the star he knew he should be -- but because his father didn't seem very impressed with it. Elmo Lewis had always wanted to be a musician himself, but he'd given up playing the piano when Jerry Lee was a small child.\n\nJerry Lee had been trying to teach himself a song, and after he'd been trying for a while, Elmo had sat down and played the song himself. Little Jerry Lee had cried because his dad could do something he couldn't, and so Elmo had never again touched a piano, to avoid demoralising his young son.\n\nAnd so Jerry Lee believes to this day that the reason his dad wasn't hugely impressed by Jerry Lee's first record was just that -- that seeing his son achieve an ambition he'd given up on himself was at best bittersweet.\n\nJerry Lee's next record, though, didn't disappoint anyone.\n\nIt took him quite a while to find exactly the right song for his second single. He kept popping back into the studio, in between tour dates, and when he wasn't recording with Carl Perkins or Billy Lee Riley or whoever, he'd cut a few more songs as himself. He'd play old Gene Autry songs, and Big Joe Turner's \"Honey Hush\", which had just been cut by Johnny Burnette, and old folk songs of the kind the Everly Brothers were soon to do on their second album, and a few songs he wrote himself, even, but nothing seemed suitable for the record that would make him into a star. Until he decided to just cut the highlight of his live show.\n\n\"Whole Lotta Shakin'\" is another song whose authorship is disputed. It was originally recorded by Big Maybelle, a blues singer, in an arrangement by Quincy Jones:\n\n[Excerpt: Big Maybelle, \"Whole Lotta Shakin' Goin' On\"]\n\nTwo people both claimed to have written the song -- a black singer called Dave \"Curlee\" Williams, and a white pianist called Roy Hall, both of whom knew each other, and both of whom are now credited as the song's writers (though Hall is credited under the pseudonym \"Sunny David\"). They were supposedly inspired when on holiday together, in Pahokee Florida, where according to Hall they spent their days milking rattlesnakes while drunk. When it was dinnertime, someone would ring a big bell for everyone to come in, and Hall remembered someone saying about it \"We got twenty-one drums, we got an old bass horn, an' they even keepin' time on a ding-dong.\"\n\nThat became, according to Hall, the inspiration for the opening line of the song. Curlee Williams, though, always claimed that he was the sole writer of the song, and many have speculated that Hall probably bought a share of the song from Williams -- something that happened quite a lot in those days.\n\nHall recorded his own version of the song, on Decca, a few months after Big Maybelle recorded her version:\n\n[Excerpt: Roy Hall, \"Whole Lotta Shakin' Goin' On\"]\n\nIf Hall did buy his share of the song, rather than writing it, then it was a bad deal for him -- as soon as the song became a hit, Hall's ex-wife sued him, and was awarded all of his share of the song's royalties.\n\nNeither Big Maybelle's version of the song, nor Roy Hall's, had been the inspiration for Jerry Lee Lewis, though. Instead, his inspiration had been that bass player we mentioned earlier, Johnny Littlejohn.\n\nJerry Lee had turned up late to a gig with Littlejohn and Mr. Paul, back when they were playing together, and had found them already on stage, with Littlejohn singing lead on a version of \"Whole Lotta Shakin'\" that was very different from either version that had already come out -- they were playing the song faster, and Littlejohn included a spoken section, where he'd tell the audience that all they needed to do was stand in one spot and wiggle around just a little bit, and that's when you've got it. When Jerry Lee got on stage after the song, Littlejohn had said to him, \"You're a bit late, aren't you?\" \"No,\" Jerry Lee had replied, \"I'm right on time\".\n\nThat spoken section was probably inspired by this similar passage in \"Pine Top's Boogie Woogie\", a song that Jerry Lee knew well:\n\n[Excerpt: Pine Top Smith, \"Pine Top's Boogie Woogie\"]\n\nWhen that group had split up, Jerry Lee had taken that song and that performance, exactly as Littlejohn had done it, and started doing it himself. He later said “I done it just like Johnny done it. Maybe I should have felt guilty about that.”\n\nHe didn't feel guilty, though. He felt many things, especially when it got the women in the audience dancing and wiggling, but he didn't feel guilty.\n\nJerry Lee took his version of the song into Sun, convinced that this was going to be his big hit... and neither Sam Phillips nor Jack Clement believed in it. They thought that the song was probably too vulgar to get played on the radio, and that anyway it sounded too much like Elvis -- there wasn't room for someone else who sounded like that in the charts.\n\nNo, they were going to have Jerry Lee record a nice, sensible, country song that Clement had written. A song inspired by going to the toilet, and by reincarnation. Clement was on the toilet, thinking about a breakup he'd had, and how he'd like to come back as a turd in his ex's toilet bowl, so she'd look down and see him in there winking up at her. He'd taken that idea, cleaned it up a little, and turned it into \"It'll Be Me\":\n\n[Excerpt: Jerry Lee Lewis, \"It'll Be Me\", single version]\n\nThat was going to be the A-side, of course, but they'd let Jerry Lee cut this \"Shakin'\" thing for the B-side if he wanted.\n\nThere are different stories about the recording of \"Whole Lotta Shakin' Goin' On\" -- Cowboy Jack Clement, for example, would always claim that they'd recorded it in just one take, with just three minutes of tape left on the reel, right at the end of the session. The reality seems, sadly, slightly more prosaic -- they took several takes, with both Clement and Phillips throwing in ideas, and changed the instrumentation around a bit during the session, lowering the bass in the mix and adding some slapback echo to the piano. However much time they spent on it, though, the result still *sounded* spontaneous:\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin'\"]\n\nWhen it was finished, everyone knew that that would have to be the A-side of the single. Before it came out, Jerry Lee went out on tour with Johnny Cash, Carl Perkins, Wanda Jackson, and a couple of other acts -- the only things Jerry Lee and his band brought with them on the tour, other than their clothes and instruments, were whiskey, comic books, and cherry bombs. He started out as the third billed act, with Perkins and Cash following him, but soon they started to insist he go on last, even though he'd not had a hit yet, because nobody could follow him. The three men became friends, but Perkins and Cash were already starting to resent the fact that Jerry Lee was clearly Sam Phillips' new golden boy, and plotting ways to get out of their contract with Sun, and go somewhere that they'd not be overshadowed by this wild kid.\n\nThe tour zig-zagged across much of North America -- at one point Jerry Lee insisted on a detour on the way to Buffalo, to see Niagara Falls. When he got there, he got out of the car, stood there for thirty seconds, said “Jerry Lee Lewis has seen the Niagara Falls. Now let’s go home, boys\", and got back into the car.\n\nOn an early date on the tour, Jerry Lee met Sam Phillips' brother Jud for the first time. Jud did a lot of the promotion work for Sun, and he saw something in Jerry Lee -- in the way he looked, the way he performed, the way the slicked-back hair he had at the start of a performance would soon fall over his face in wild blond shocks. He knew that anyone who saw Jerry Lee perform live would see the same thing. He knew that Jerry Lee needed to be on TV.\n\nSpecifically, he had to go on either the Ed Sullivan or the Steve Allen show -- the two big variety shows that between them could make an artist. Jud persuaded Sam to let him take Jerry Lee to New York, to try to persuade the bookers for those shows to give the boy a shot. Jud and Jerry Lee travelled up to meet Steve Allen's manager and the head of talent for NBC -- they were squeezed in to a fifteen minute meeting on a Friday evening. They went in to the meeting with none of the usual things that someone trying to book an artist on the Steve Allen show would bring -- no photos, no records, nothing -- and Jerry Lee sat in the meeting reading a Superman comic and blowing bubbles with his bubblegum while the businessmen talked. Jud Phillips eventually persuaded them to let Jerry show them what he could do on the piano, explaining that records couldn't capture his performance.\n\nWhen Jerry Lee did show them his stuff, they said to Jud \"I'll give you five hundred dollars if you don't show him to anyone else. And bring him back on Monday morning. I want Steve to see him.\"\n\nSo Jerry Lee got to spend the weekend in New York, and ride the rollercoasters at Coney Island, before heading back in on the Monday to play the piano for Steve Allen, who despite his general contempt for rock and roll was as impressed as everyone else. They booked him in for an appearance on the Steve Allen Show in a month's time.\n\nThat performance is available online, if you go looking for it. I'll excerpt some of the music, but the sound alone doesn't capture it. It really needs the video:\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin' Goin' On\", Steve Allen Show 1957]\n\nAt that moment, when Jerry Lee screamed \"shake\", he kicked the piano stool away and it went flying across the stage and out of shot. A few seconds later it came flying back across the stage, as Steve Allen, the host who'd made Elvis wear a dinner jacket and sing to a real hound dog, and who'd mocked Fats Domino and Gene Vincent's lyrics, got into the spirit of the thing and threw the stool right back.\n\nThat was the moment when Jerry Lee Lewis became a star. But when you're someone like Jerry Lee Lewis, the only reason to rise up is to fall down again, and we'll find out about Jerry Lee's fall in a few weeks' time.",
  "itunes:subtitle": "Episode fifty-nine of A History of Rock Music in Five Hundred Songs looks at Whole Lotta Shakin Goin On by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ",
  "itunes:keywords": "Big Maybelle,Carl Perkins,country and western,Grand Ole Opry,Jack Clement,Jerry Lee Lewis,Jimmy Swaggart,Johnny Cash,Jud Phillips,Moon Mullican,Quincy Jones,rockabilly,Sam Phillips,Steve Allen,Sun Records,Wanda Jackson,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 59,
  "content:encoded": "Episode fifty-nine of A History of Rock Music in Five Hundred Songs looks at \"Whole Lotta Shakin' Goin' On\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/32023341\"> on \"So Long I'm Gone\"</a> by Warren Smith.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-59-whole-lotta-shakin/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI'm relying heavily on <em><a href=\"https://amzn.to/2VDGeeo\">Sam Phillips: the Man Who Invented Rock and Roll</a> </em>by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. <a href=\"https://amzn.to/2IImoLJ\">This one by Rick Bragg</a> is better than most.\n\nThe episode of Cocaine and Rhinestones I mention in the episode is <a href=\"https://cocaineandrhinestones.com/ralph-mooney-country-music-sound\">here</a>.\n\nThere are many budget CDs containing Lewis' pre-1962 work. <a href=\"https://amzn.to/2OFartv\">This set</a> seems as good an option as any.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n<strong>Transcript</strong>\n\nWe're in an odd position with this episode, really. The first time we looked at Jerry Lee Lewis, it was as part of the Million Dollar Quartet, yet at the time of the actual Million Dollar Quartet session, Lewis was basically an unknown, and we didn't have time to cover his career up to that point -- even though the Million Dollar Quartet recordings prove that he considered himself a peer of Elvis and Carl Perkins right from the start. And we also talked about Lewis a fortnight ago, when we were dealing with Billy Lee Riley, but again, the focus was on someone other than Lewis.\n\nThe problem is that Jerry Lee Lewis is just the kind of figure who demands discussion, even before he became a famous musician. He's someone who just dominates other people's stories, and pushes in to them and takes over.\n\nSo now we've got to the point where he's about to have his first hit, but we haven't really looked at how he got to that point, just at him interacting with other people. So now we're going to have to back up, and look at the first hit record from the last great artist to be discovered by Sun Records.\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin' Going On\"]\n\nJerry Lee Lewis was a young piano player from Ferriday, Louisiana, who loved music more than anything. He loved Gene Autry, and Hank Williams -- and he loved Al Jolson. He would later tell a story about going on a date to the cinema. Before the show they were playing records, and one record that came on was Jolson singing \"Toot Toot Tootsie Goodbye\":\n\n[Excerpt: Al Jolson, \"Toot Toot Tootsie Goodbye\"]\n\nLewis immediately got out of his seat, told his girlfriend he needed to use the toilet, cycled home, worked out how to play the song on the piano, cycled back, and rejoined his date for the film. She asked why he'd been gone so long, and he said he'd picked up some popcorn as well.\n\nSam Phillips would often say later that Jerry Lee Lewis was the most naturally talented musician he ever worked with. Elvis was the most charismatic, Johnny Cash had the most commanding presence, and Howlin' Wolf was the most profound artist, but Lewis was the one who had the greatest obsession with his music, the greatest drive to create, and the greatest sheer knowledge of music, in all different genres. Lewis would play piano for eight hours a day, and while in other matters he was surprisingly ignorant -- other than the Bible, the only things he ever read were comics -- he could talk with a huge amount of authority about the musical techniques of everyone from B.B. King to Frank Sinatra, and he could hear a song once and remember it and play it years later. And whatever music he learned, from whatever source, he would somehow transmute it and turn it into a Jerry Lee Lewis song. Nothing he played sounded like anyone else.\n\nHe'd started playing music when he was four years old. He'd been walking past a piano in the house of his rich uncle, Lee Calhoun, and had felt the urge to play it. He'd almost instantly figured out how to play the beginning of \"Silent Night\", and his parents -- who always doted on him and tried to give him everything he wanted, after the tragically young death of his older brother -- realised that they might have a child prodigy on their hands. When his father finally got into a position where he could buy his own farm, the first thing he did was remortgage it so he could buy his son his own piano. They didn't have electricity in the house -- until Elmo Lewis decided to wire the house for electricity, so his boy Jerry Lee could listen to the radio and learn more songs. What Jerry Lee wanted, he got.\n\nAs a kid, Jerry Lee was always the one who would get his relatives into trouble. He would go to the cinema -- a sin in the strict Pentecostal religion of his family -- and one time he dragged in Jimmy Swaggart, who was his \"double first cousin\" -- Swaggart's father was Lewis' father's nephew, while Swaggart's mother was Lewis' mother's sister. Swaggart ran out of the cinema crying, convinced he had damned himself to hell. Jerry Lee stayed and watched the cowboys.\n\nBut while he loved the cinema, the piano was his true love. He and Swaggart, and their other cousin Mickey Gilley, would all play piano together, as well as separately. But Jerry Lee was undoubtedly the most talented, and he was also the biggest music lover, and he would spend his time trying to adapt the styles of the musicians he liked to the piano.\n\nEven though Jerry Lee was in Louisiana, which is the home of great piano playing, most of his musical influences were guitarists. His favourite musician was Jimmie Rodgers, and Jerry Lee would play his \"Waiting For a Train\":\n\n[Excerpt: Jimmie Rodgers, \"Waiting For a Train\"]\n\nHis favourite song to play, though, was \"Drinking Wine Spo-De-O-Dee\", the Sticks McGhee record that some credit as the first rock and roll record ever:\n\n[Excerpt: Sticks McGhee: \"Drinking Wine Spo-De-O-Dee\"]\n\nBut he had two bigger influences -- two people who could actually play the piano the way that Jerry Lee thought it should be played. The first was Moon Mullican, who we talked about back in the episode on Hank Williams. Mullican was another Louisiana piano player, and another musician who combined bits of everything -- Western Swing, hillbilly boogie, blues, R&B, gospel, Cajun music -- into a unique melange of styles all his own:\n\n[Excerpt: Moon Mullican, \"Piano Breakdown\"]\n\nThe other big influence on young Jerry Lee was his uncle, Carl McVoy. McVoy never became famous, but he made a couple of records after his nephew became famous, and listening to this one, made in 1957 with much of the same group of musicians who worked on Elvis' hits, including Chet Atkins and the Jordanaires, it's spooky how much it sounds like Jerry Lee himself:\n\n[Excerpt: Carl McVoy: \"You Are My Sunshine\"]\n\nBut young Jerry Lee was torn between two worlds. On the one hand, as a kid he would regularly sneak into a local blues club with an otherwise entirely black clientele, and hide under the tables to watch people like Fats Domino, Charles Brown, B.B. King, and Big Joe Turner, until he was kicked out by the owner -- who, understandably, was not keen on having underaged white kids in his black drinking and gambling club in the segregated South.\n\nOn the other, he was deeply, deeply, religious, and for a while he studied at the Southwestern Bible Institute in Waxahachie, Texas, in the hope of becoming a priest. Unfortunately, he was kicked out after playing the hymn \"My God is Real\" with a boogie feel, which according to the people in charge was inciting lust among the other students.\n\nThis tension between religion and the secular world would recur throughout Lewis' life, but by the time he signed to Sun Records, aged twenty-one, he was firmly on the side of the Devil. He'd been making a living as a sewing machine salesman, conning women into signing up to buy one on credit by telling them they'd won the machine in a contest. He'd already got married twice, and hadn't actually got around to divorcing his first wife before marrying the second – and he'd also decided it was about time he moved on from the second wife as well.\n\nHe'd been touring with a blind musician called Paul Whitehead. Whitehead could play violin, accordion, and piano, and Jerry Lee would play piano while Mr. Paul, as he was always called, played the fiddle, and move on to the drums when Mr. Paul played the piano. Sometimes they would also add a bass player, Johnny Littlejohn (not the same person as the Chicago blues guitarist of the same name). Littlejohn had something of the style of Elvis, and Jerry Lee was jealous of him.\n\nThere's only one recording available of Lewis' mentor Mr. Paul -- his piano part on an obscure rockabilly song, \"Right Now\", by Gray Montgomery:\n\n[Excerpt: Gray Montgomery, \"Right Now\"]\n\nBut while he needed a mentor for a while, Jerry Lee Lewis knew he was destined to be great on his own. The big break came when he read in a magazine about how it was Sam Phillips who had made Elvis into a star. He'd already tried RCA Records, the label Elvis was now on -- they'd told him he needed to play a guitar. He'd blagged his way into an audition at the Grand Ole Opry, and the same thing had happened -- he'd been told to come back when he played guitar, not piano. The only person in the country establishment who was kind to him was another piano player, Del Wood, who thought this young man reminded her of herself:\n\n[Excerpt: Del Wood, \"Down Yonder\"]\n\nMaybe Phillips would have more sense in him, and would see the greatness of a man who had been known to refer to himself, blasphemously, as \"The Great I AM\". Jerry Lee knew that if he just got the right break he could be the greatest star of all time.\n\nHe and his father drove down to Memphis, and got themselves a hotel room, which was the first time they'd ever stayed anywhere with running water. They saved the money from selling hundreds of eggs from Jerry Lee's father's henhouse to a local supermarket, and they couldn't afford to stay there very long.\n\nAnd then, when they went into the Sun studio to meet this Mr. Phillips, the person to whom Jerry Lee had pinned all his dreams, they were told that Phillips was out of town. They were welcome to come back later, of course -- but they couldn't afford to just travel back to Memphis later and book another hotel room. It was now or never, and Jerry Lee was just going to stay there until someone listened to him play the piano.\n\nThe person who eventually agreed to listen to him was Cowboy Jack Clement, who became intrigued when Jerry Lee told him that he could play piano and make it sound like Chet Atkins did when he was playing guitar -- except that, no, he was better at piano than Chet Atkins was on guitar. Jerry Lee played for Clement for three or four hours, and when Clement played the tape for Sam Phillips when he got back from his trip, Phillips agreed -- they needed to get this man in.\n\nLewis' first single was recorded almost as a joke. We talked a little about his recording of \"Crazy Arms\" a couple of weeks back, in the episode on Billy Lee Riley, but there's more to say about the song than we covered there.\n\n[Excerpt: Jerry Lee Lewis, \"Crazy Arms\"]\n\n\"Crazy Arms\" is a song with a disputed history. There are claims that the song was actually written by a man from Kentucky named Paul Gilley, who died in 1957 and is also considered by some to have secretly ghostwritten a number of Hank Williams' hits, including \"Cold Cold Heart\" and \"I'm So Lonesome I Could Cry\".\n\nUnfortunately, the bulk of the evidence for this is only available in a self-published book, which can't even be bought from Amazon but has to be purchased directly from the author via Craigslist, so I have no way of assessing the accuracy of these claims. It seems unlikely to me, but not impossible, and so I'm going to go here with the conventional narrative, that the song was written by the great pedal steel guitar player Ralph Mooney, in 1949, but had remained unrecorded until a demo by Mooney's frequent collaborator, Wynn Stewart, in 1954.\n\nThe first release of the song was by a very minor country singer called Marilyn Kaye, and while it wasn't a hit for her, it got enough response from radio listeners that a DJ played it to the singer Ray Price, who recorded his own version as a result:\n\n[Excerpt: Ray Price, \"Crazy Arms\"]\n\nThat became the biggest country hit of 1956, and while it doesn't sound hugely revolutionary these days, it totally changed the sound of honky-tonk music from that point on, thanks largely to the bass player playing four notes to the bar rather than the more usual two. We don't have time in this episode to look into just how much this changed country music, but I'll link an episode of the great country podcast Cocaine and Rhinestones, all about Ralph Mooney, and which talks about the song in more detail, in the notes to this episode.\n\nBut the important thing is that Ray Price's version of \"Crazy Arms\" was *everywhere* in 1956, and so it's unsurprising that at the end of Jerry Lee Lewis' first solo session for Sun, he started busking his way through the song, which he'd also played on his audition tape:\n\n[Excerpt: Jerry Lee Lewis, \"Crazy Arms\"]\n\n\"Crazy Arms\" would always be a bit of a disappointment to Jerry Lee, not because it wasn't a massive hit -- that didn't bother him, he knew he'd have to make a few records before he became the star he knew he should be -- but because his father didn't seem very impressed with it. Elmo Lewis had always wanted to be a musician himself, but he'd given up playing the piano when Jerry Lee was a small child.\n\nJerry Lee had been trying to teach himself a song, and after he'd been trying for a while, Elmo had sat down and played the song himself. Little Jerry Lee had cried because his dad could do something he couldn't, and so Elmo had never again touched a piano, to avoid demoralising his young son.\n\nAnd so Jerry Lee believes to this day that the reason his dad wasn't hugely impressed by Jerry Lee's first record was just that -- that seeing his son achieve an ambition he'd given up on himself was at best bittersweet.\n\nJerry Lee's next record, though, didn't disappoint anyone.\n\nIt took him quite a while to find exactly the right song for his second single. He kept popping back into the studio, in between tour dates, and when he wasn't recording with Carl Perkins or Billy Lee Riley or whoever, he'd cut a few more songs as himself. He'd play old Gene Autry songs, and Big Joe Turner's \"Honey Hush\", which had just been cut by Johnny Burnette, and old folk songs of the kind the Everly Brothers were soon to do on their second album, and a few songs he wrote himself, even, but nothing seemed suitable for the record that would make him into a star. Until he decided to just cut the highlight of his live show.\n\n\"Whole Lotta Shakin'\" is another song whose authorship is disputed. It was originally recorded by Big Maybelle, a blues singer, in an arrangement by Quincy Jones:\n\n[Excerpt: Big Maybelle, \"Whole Lotta Shakin' Goin' On\"]\n\nTwo people both claimed to have written the song -- a black singer called Dave \"Curlee\" Williams, and a white pianist called Roy Hall, both of whom knew each other, and both of whom are now credited as the song's writers (though Hall is credited under the pseudonym \"Sunny David\"). They were supposedly inspired when on holiday together, in Pahokee Florida, where according to Hall they spent their days milking rattlesnakes while drunk. When it was dinnertime, someone would ring a big bell for everyone to come in, and Hall remembered someone saying about it \"We got twenty-one drums, we got an old bass horn, an' they even keepin' time on a ding-dong.\"\n\nThat became, according to Hall, the inspiration for the opening line of the song. Curlee Williams, though, always claimed that he was the sole writer of the song, and many have speculated that Hall probably bought a share of the song from Williams -- something that happened quite a lot in those days.\n\nHall recorded his own version of the song, on Decca, a few months after Big Maybelle recorded her version:\n\n[Excerpt: Roy Hall, \"Whole Lotta Shakin' Goin' On\"]\n\nIf Hall did buy his share of the song, rather than writing it, then it was a bad deal for him -- as soon as the song became a hit, Hall's ex-wife sued him, and was awarded all of his share of the song's royalties.\n\nNeither Big Maybelle's version of the song, nor Roy Hall's, had been the inspiration for Jerry Lee Lewis, though. Instead, his inspiration had been that bass player we mentioned earlier, Johnny Littlejohn.\n\nJerry Lee had turned up late to a gig with Littlejohn and Mr. Paul, back when they were playing together, and had found them already on stage, with Littlejohn singing lead on a version of \"Whole Lotta Shakin'\" that was very different from either version that had already come out -- they were playing the song faster, and Littlejohn included a spoken section, where he'd tell the audience that all they needed to do was stand in one spot and wiggle around just a little bit, and that's when you've got it. When Jerry Lee got on stage after the song, Littlejohn had said to him, \"You're a bit late, aren't you?\" \"No,\" Jerry Lee had replied, \"I'm right on time\".\n\nThat spoken section was probably inspired by this similar passage in \"Pine Top's Boogie Woogie\", a song that Jerry Lee knew well:\n\n[Excerpt: Pine Top Smith, \"Pine Top's Boogie Woogie\"]\n\nWhen that group had split up, Jerry Lee had taken that song and that performance, exactly as Littlejohn had done it, and started doing it himself. He later said “I done it just like Johnny done it. Maybe I should have felt guilty about that.”\n\nHe didn't feel guilty, though. He felt many things, especially when it got the women in the audience dancing and wiggling, but he didn't feel guilty.\n\nJerry Lee took his version of the song into Sun, convinced that this was going to be his big hit... and neither Sam Phillips nor Jack Clement believed in it. They thought that the song was probably too vulgar to get played on the radio, and that anyway it sounded too much like Elvis -- there wasn't room for someone else who sounded like that in the charts.\n\nNo, they were going to have Jerry Lee record a nice, sensible, country song that Clement had written. A song inspired by going to the toilet, and by reincarnation. Clement was on the toilet, thinking about a breakup he'd had, and how he'd like to come back as a turd in his ex's toilet bowl, so she'd look down and see him in there winking up at her. He'd taken that idea, cleaned it up a little, and turned it into \"It'll Be Me\":\n\n[Excerpt: Jerry Lee Lewis, \"It'll Be Me\", single version]\n\nThat was going to be the A-side, of course, but they'd let Jerry Lee cut this \"Shakin'\" thing for the B-side if he wanted.\n\nThere are different stories about the recording of \"Whole Lotta Shakin' Goin' On\" -- Cowboy Jack Clement, for example, would always claim that they'd recorded it in just one take, with just three minutes of tape left on the reel, right at the end of the session. The reality seems, sadly, slightly more prosaic -- they took several takes, with both Clement and Phillips throwing in ideas, and changed the instrumentation around a bit during the session, lowering the bass in the mix and adding some slapback echo to the piano. However much time they spent on it, though, the result still *sounded* spontaneous:\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin'\"]\n\nWhen it was finished, everyone knew that that would have to be the A-side of the single. Before it came out, Jerry Lee went out on tour with Johnny Cash, Carl Perkins, Wanda Jackson, and a couple of other acts -- the only things Jerry Lee and his band brought with them on the tour, other than their clothes and instruments, were whiskey, comic books, and cherry bombs. He started out as the third billed act, with Perkins and Cash following him, but soon they started to insist he go on last, even though he'd not had a hit yet, because nobody could follow him. The three men became friends, but Perkins and Cash were already starting to resent the fact that Jerry Lee was clearly Sam Phillips' new golden boy, and plotting ways to get out of their contract with Sun, and go somewhere that they'd not be overshadowed by this wild kid.\n\nThe tour zig-zagged across much of North America -- at one point Jerry Lee insisted on a detour on the way to Buffalo, to see Niagara Falls. When he got there, he got out of the car, stood there for thirty seconds, said “Jerry Lee Lewis has seen the Niagara Falls. Now let’s go home, boys\", and got back into the car.\n\nOn an early date on the tour, Jerry Lee met Sam Phillips' brother Jud for the first time. Jud did a lot of the promotion work for Sun, and he saw something in Jerry Lee -- in the way he looked, the way he performed, the way the slicked-back hair he had at the start of a performance would soon fall over his face in wild blond shocks. He knew that anyone who saw Jerry Lee perform live would see the same thing. He knew that Jerry Lee needed to be on TV.\n\nSpecifically, he had to go on either the Ed Sullivan or the Steve Allen show -- the two big variety shows that between them could make an artist. Jud persuaded Sam to let him take Jerry Lee to New York, to try to persuade the bookers for those shows to give the boy a shot. Jud and Jerry Lee travelled up to meet Steve Allen's manager and the head of talent for NBC -- they were squeezed in to a fifteen minute meeting on a Friday evening. They went in to the meeting with none of the usual things that someone trying to book an artist on the Steve Allen show would bring -- no photos, no records, nothing -- and Jerry Lee sat in the meeting reading a Superman comic and blowing bubbles with his bubblegum while the businessmen talked. Jud Phillips eventually persuaded them to let Jerry show them what he could do on the piano, explaining that records couldn't capture his performance.\n\nWhen Jerry Lee did show them his stuff, they said to Jud \"I'll give you five hundred dollars if you don't show him to anyone else. And bring him back on Monday morning. I want Steve to see him.\"\n\nSo Jerry Lee got to spend the weekend in New York, and ride the rollercoasters at Coney Island, before heading back in on the Monday to play the piano for Steve Allen, who despite his general contempt for rock and roll was as impressed as everyone else. They booked him in for an appearance on the Steve Allen Show in a month's time.\n\nThat performance is available online, if you go looking for it. I'll excerpt some of the music, but the sound alone doesn't capture it. It really needs the video:\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin' Goin' On\", Steve Allen Show 1957]\n\nAt that moment, when Jerry Lee screamed \"shake\", he kicked the piano stool away and it went flying across the stage and out of shot. A few seconds later it came flying back across the stage, as Steve Allen, the host who'd made Elvis wear a dinner jacket and sing to a real hound dog, and who'd mocked Fats Domino and Gene Vincent's lyrics, got into the spirit of the thing and threw the stool right back.\n\nThat was the moment when Jerry Lee Lewis became a star. But when you're someone like Jerry Lee Lewis, the only reason to rise up is to fall down again, and we'll find out about Jerry Lee's fall in a few weeks' time.",
  "enclosure": "",
  "itunes:summary": "Episode fifty-nine of A History of Rock Music in Five Hundred Songs looks at \"Whole Lotta Shakin' Goin' On\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"So Long I'm Gone\" by Warren Smith.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. This one by Rick Bragg is better than most.\n\nThe episode of Cocaine and Rhinestones I mention in the episode is here.\n\nThere are many budget CDs containing Lewis' pre-1962 work. This set seems as good an option as any.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe're in an odd position with this episode, really. The first time we looked at Jerry Lee Lewis, it was as part of the Million Dollar Quartet, yet at the time of the actual Million Dollar Quartet session, Lewis was basically an unknown, and we didn't have time to cover his career up to that point -- even though the Million Dollar Quartet recordings prove that he considered himself a peer of Elvis and Carl Perkins right from the start. And we also talked about Lewis a fortnight ago, when we were dealing with Billy Lee Riley, but again, the focus was on someone other than Lewis.\n\nThe problem is that Jerry Lee Lewis is just the kind of figure who demands discussion, even before he became a famous musician. He's someone who just dominates other people's stories, and pushes in to them and takes over.\n\nSo now we've got to the point where he's about to have his first hit, but we haven't really looked at how he got to that point, just at him interacting with other people. So now we're going to have to back up, and look at the first hit record from the last great artist to be discovered by Sun Records.\n\n[Excerpt: Jerry Lee Lewis, \"Whole Lotta Shakin' Going On\"]\n\nJerry Lee Lewis was a young piano player from Ferriday, Louisiana, who loved music more than anything. He loved Gene Autry, and Hank Williams -- and he loved Al Jolson. He would later tell a story about going on a date to the cinema. Before the show they were playing records, and one record that came on was Jolson singing \"Toot Toot Tootsie Goodbye\":\n\n[Excerpt: Al Jolson, \"Toot Toot Tootsie Goodbye\"]\n\nLewis immediately got out of his seat, told his girlfriend he needed to use the toilet, cycled home, worked out how to play the song on the piano, cycled back, and rejoined his date for the film. She asked why he'd been gone so long, and he said he'd picked up some popcorn as well.\n\nSam Phillips would often say later that Jerry Lee Lewis was the most naturally talented musician he ever worked with. Elvis was the most charismatic, Johnny Cash had the most commanding presence, and Howlin' Wolf was the most profound artist, but Lewis was the one who had the greatest obsession with his music, the greatest drive to create, and the greatest sheer knowledge of music, in all different genres. Lewis would play piano for eight hours a day, and while in other matters he was surprisingly ignorant -- other than the Bible, the only things he ever read were comics -- he could talk with a huge amount of authority about the musical techniques of everyone from B.B. King to Frank Sinatra, and he could hear a song once and remember it and play it years later. And whatever music he learned, from whatever source, he would somehow transmute it and turn it into a Jerry Lee Lewis song. Nothing he played sounded like anyone else.\n\nHe'd started playing music when he was four years old. He'd been walking past a piano in the house of his rich uncle, Lee Calh",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-nine of A History of Rock Music in Five Hundred Songs looks at \"Whole Lotta Shakin' Goin' On\" by Jerry Lee Lewis. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"So Long I'm Gone\" by Warren Smith.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. This one by Rick Bragg is better than most.\n\nThe episode of Cocaine and Rhinestones I mention in the episode is here.\n\nThere are many budget CDs containing Lewis' pre-1962 work. This set seems as good an option as any.\n\nPatreon\n\nThis podcast is brought to you by t",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}