{
  "title": "Chinese Whispers: how powerful is the People's Liberation Army?",
  "link": "https://audioboom.com/posts/8084283",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2575,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>It’s clear now that Vladimir Putin didn’t expect his army to perform quite so badly when invading Ukraine. As much as that is celebrated in much of the world, it will be a cause for concern – or at least a moment for learning – amongst Beijing’s military leaders. Because Russia has always been a heavy influence and source of strategy and equipment for China’s People’s Liberation Army, ever since the days of the Soviet Union. So could the PLA – which hasn’t been in active combat since Vietnam in 1979 – similarly flounder?<br>\n<br>\n\n</div>\n<div>That's the burning question Cindy Yu and guests discuss in the latest episode of Chinese Whispers. Timothy R. Heath is an expert on the Chinese military at the American think tank, the RAND Corporation, and tells her that: 'A lot of the issues that we're seeing in the Russian military is going to be of high concern to the PLA because there's a very good chance the Chinese military could have some of the similar issues'.<br>\n<br>\n\n</div>\n<div>They also discuss the possibility of low morale when it comes to fighting an enemy who looks and speaks like you – as some Russian soldiers have found disconcerting in Ukraine. Could an invasion of Taiwan throw up similar problems? Tim argues that it could, and draws parallel with another event – the enlisting of the PLA for suppressing the Tiananmen Square protests in 1989. It was a decision that saw many soldiers (though not enough) refusing to obey orders. 'The experience of the PLA was such a shock for the military and the CCP that a decade later, the Chinese government took the PLA out of the job of suppressing domestic dissent.'<br>\n<br>\n\n</div>\n<div>In fact, the lack of trust in its soldiers' loyalty is such that today's PLA is one of the only armies to offer a 'suicide pill', so says Professor Li Xiaobing, a Chinese military historian at the University of Central Oklahoma who served in the PLA himself. '20,000 Chinese soldiers were captured during the Korean war. After the war, 70 per cent of the Chinese POWs didn't want to go back to China, and they went to Taiwan. So that's really embarrassing for the Chinese government in the Cold War'.<br>\n<br>\n\n</div>\n<div>Tune in to this episode to hear more incredible insights about this most elusive yet important modern military force.</div>\n",
  "pubDate": "Mon, 16 May 2022 13:07:36 +0000",
  "guid": "tag:audioboom.com,2022-05-16:/posts/8084283",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}