{
  "title": "Driving Sustainable Production in the F&#038;B and Packaging Sector",
  "link": "https://www.iaasiaonline.com/driving-sustainable-production-in-the-fb-and-packaging-sector/",
  "dc:creator": "Tzelong",
  "pubDate": "Tue, 01 Nov 2022 06:42:24 +0000",
  "category": [
    "Industry News",
    "Sustainable Production",
    "Schaeffler"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38738",
  "description": "<p>Driving Sustainable Production in the F&B and Packaging Sector By Alfred Lee, President Industrial, Schaeffler Asia Pacific An increase in world population growth is predicted to drive an exponential rise in food demand between 59% to 98% by 2050. Amidst growing acute pressures placed on the Food and Beverage (F&B) industry for higher production standards, &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/driving-sustainable-production-in-the-fb-and-packaging-sector/\"> <span class=\"screen-reader-text\">Driving Sustainable Production in the F&#038;B and Packaging Sector</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/driving-sustainable-production-in-the-fb-and-packaging-sector/\">Driving Sustainable Production in the F&#038;B and Packaging Sector</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p><strong><u>Driving Sustainable Production in the F&B and Packaging Sector</u></strong></p>\n<p><em>By Alfred Lee, President Industrial, Schaeffler Asia Pacific </em></p>\n<p><span id=\"more-38738\"></span></p>\n<p>An increase in world population growth is predicted to drive an exponential rise in food demand between 59% to 98% by 2050. Amidst growing acute pressures placed on the Food and Beverage (F&B) industry for higher production standards, environmental impact and sustainability goals are also fast becoming key concerns for businesses.</p>\n<p>&nbsp;</p>\n<p>Other major disruptions including evolving consumer demands, shifting government regulations, supply chain bottlenecks, and rising energy costs are part of the challenges that can impact the F&B industry players.</p>\n<p>&nbsp;</p>\n<p>The growing social awareness of the climate change threat and a greater need for a more sustainable economy are contrasted with the need for energy-intensive automated processes to maintain tiptop F&B hygiene. Other factors including increased temperatures contributed by global warming and round-the-clock operations can lead to a need for high-frequency cleaning and maintenance cycles.</p>\n<p>&nbsp;</p>\n<p>While these factors pose significant challenges to the F&B sector, we need to take advantage of the endless opportunities presented to evaluate processes and adopt innovative technologies to create more energy-efficient production lines that are reliable, hygienic, and friendlier on the environment.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Enabling Sustainability Through Digitalisation </strong></p>\n<p>With most food, beverage and packaging production facilities running round-the-clock, unexpected failures resulting in unplanned downtime or improper management of facilities can significantly result in high carbon emissions and costs when left unoptimised.</p>\n<p>&nbsp;</p>\n<p>To effectively counter these challenges, smart and intelligent solutions such as automated condition monitoring and predictive maintenance can make it possible for manufacturers to monitor the operations of several machines in real-time. The immediate data gained provides insights into understanding energy consumption levels across operations and processes and generates forecasts of expected load profiles to optimise workflows for greater energy efficiency.</p>\n<p>&nbsp;</p>\n<p>At one of our plant facilities at Schaeffler Vietnam, we adopted a comprehensive suite of lifetime digital solutions such as the SmartCheck diagnostic system to better identify bearing damage, wear and tear, and irregularities to gain a deeper understanding of the remaining useful life of our production machinery. In addition, the data received from the system allowed our team to track and benchmark towards ideal targets and optimise maintenance work following actual operating conditions for higher energy efficiency across all production operations.</p>\n<p><strong> </strong></p>\n<p><strong> </strong></p>\n<p><strong>Building Sustainability Through Competencies</strong></p>\n<p>The durability of machines and systems plays a huge role in the sustainability of production, particularly in machine-processed and highly automated food production. With variable demand loads and short-cycle times coupled with regular cleaning and maintenance cycles, using sub-optimal components may lead to poor chemical resistance and corrosion protection, which impacts energy wastage and downtime of machines. Similarly, these issues would also lead to high operating costs.</p>\n<p>&nbsp;</p>\n<p>In a specific use case from the production of baked goods, it was found that operating costs for conveyor belts in the production and assembly line could be lowered by 98% with reduced production stops and maintenance activities. This is because when the conveyor and production line stops, unwanted excess in the pipeline and machines must be destroyed and cleaned before a restart can happen – all of which require manpower and time that could be utilised elsewhere. Therefore, manufacturers need to take the relevant mechanical loads and ambient conditions into account even during the planning stages of their machines and choose optimal quality components in their production.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Riding on the Sustainability Wave  </strong></p>\n<p>With heightening public awareness about climate change and the environment, consumers are leaning towards companies with sustainable-driven practices in their products and services. It is thus imperative for both manufacturers and industrial players to ride on this wave to support the decarbonisation of the entire supply chain to ease environmental threats and ensure business continuity.</p>\n<p>&nbsp;</p>\n<p>To start off, manufacturers and industrial players should adopt internal governance measures and external regulations as part of their zero-carbon strategy. One way to kickstart the sustainability strategy is to manage new sourcing strategies across supply chains for better traceability and transparency and to choose suppliers that adhere to sustainable practices. To help stakeholders make the switch to sustainability practices, Schaeffler offers smart technologies such as OPTIME and OPTIME C1 that let organisations reduce production downtime and optimise supply chains for greater cost benefits.</p>\n<p>&nbsp;</p>\n<p>Based on our long-standing expertise in the field of bearing engineering, vibration analysis, and lubrication, the OPTIME Ecosystem enables a high level of intelligence that supports predictive maintenance and condition monitoring to eliminate unplanned downtimes in machines, a highly unfavourable situation in the F&B industry.</p>\n<p>&nbsp;</p>\n<p>Should manufacturers and industrial players find fault with their machines’ lubrication, potentially affecting food production, our smart lubricator OPTIME C1 also helps streamline lubrication management and turns complexity into simplicity by cutting on the time and effort in tedious manual lubricating and checking throughout the plant.</p>\n<p>&nbsp;</p>\n<p>On the other hand, the intrinsic nature of the F&B industry is fast-paced and calls for the right type of rolling bearings in conveyor belts and machines. It is imperative for manufacturers to engage in bearing solutions that meet the requirements of the food, beverage and packing sector – and we offer just the right kind of bearing solutions to ensure smooth and continuous operations.</p>\n<p>&nbsp;</p>\n<p>At Schaeffler, we are actively driving sustainable practices across our value chain guided by our Sustainability Roadmap to meet our goals of climate neutrality for in-house production by 2030 and supply chain by 2040. To date, we have successfully transited towards renewable sources across our production sites in Germany and aim for all our global sites to make the switch by 2024.</p>\n<p><strong> </strong></p>\n<p>With all things considered, there is considerable potential for the food, beverage, and packaging sector to leverage intelligent solutions and tools to improve sustainability in the industry. While the transformation might seem daunting, identifying the right technologies, components, systems, and development partners will allow industry players to be well on their way to unlocking hidden benefits of sustainability while taking responsibility for a cleaner and greener world.<!--more--></p>\n<p><strong><b>CLICK </b></strong><a href=\"https://www.iaasiaonline.com/industry-news/\"><strong><u><b>HERE</b></u></strong></a><strong><b> FOR LATEST NEWS.</b></strong></p>\n<p><strong><b>READ CURRENT AND PAST </b></strong><a href=\"https://www.iaasiaonline.com/magazine/\"><strong><u><b>ISSUES</b></u></strong></a><strong><b> OF IAA.</b></strong></p>\n<p><strong><b>KEEP YOURSELF UPDATED, </b></strong><a href=\"https://www.iaasiaonline.com/subscription/\"><strong><u><b>SUBSCRIBE</b></u></strong></a><strong><b> TO IAA NOW!</b></strong></p>\n<p><strong><b>AND DON’T FORGET FOLLOW US ON </b></strong><a href=\"https://www.facebook.com/IAAsia/\"><strong><u><b>FACEBOOK</b></u></strong></a><strong><b>,</b></strong><a href=\"https://www.linkedin.com/showcase/industrial-automation-asia/\"><strong><u><b> LINKEDIN</b></u></strong></a><strong><b> AND </b></strong><a href=\"https://twitter.com/IAA_Asia\"><strong><u><b>TWITTER!</b></u></strong></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/driving-sustainable-production-in-the-fb-and-packaging-sector/\">Driving Sustainable Production in the F&#038;B and Packaging Sector</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}