{
  "title": "S1E14 - You Don't Need to Have Sight to Have Vision with Amy Dixon",
  "guid": "https://pinecast.com/guid/435acfc1-68d2-4875-b2db-6453651b32d0",
  "pubDate": "Tue, 08 Sep 2020 06:30:59 -0000",
  "itunes:duration": "01:06:44",
  "description": "<p>Laura is so honored to welcome Amy Dixon, a visually impaired professional triathlete and member of the USA Paratriathlon National Team, to the podcast today. Amy lost 98% of her vision to a rare autoimmune disease and now serves as a patient advocate and President of the Glaucoma Eyes international non-profit. She is also the reigning Aquathlon World Champion, US National Champion triathlete, USA Paracycling Time Trial National Champion, and is ranked 6th in the world in the Paralympic International Rankings. She recently moved to San Diego to focus her training for her road to the Tokyo 2021 Paralympic Games, and she talks about her preparation for these Games and so much more with Laura here today.</p>\n<p>She begins their conversation by sharing her experience and advice as a sommelier with Laura before moving onto how the pandemic has affected her and her training, including how her autoimmune disease has prepared her for the current health protocols. Amy then offers a vivid description of exactly what her sight is like these days, her bad luck at World Championships, the story of her vision loss and how she dealt with the news, and the therapy she found in working with horses again. She also discusses the story of her competitive triathlon career, how she missed going to the 2016 Paralympics, what keeps her going for the 2021 Games, and the surgeries and treatments she continues to undergo and the complications they create for training. Amy closes out the conversation by explaining how she maintains her mantra given her many challenges and offers details about the ‘No Sight No Limits’ camp she started. Today’s episode is a truly moving and inspiring story of one woman’s courage, strength, perseverance, and determination, which holds lessons for everyone, especially those in pursuit of gold.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Amy’s sommelier expertise</li>\n<li>How the pandemic has affected Amy and her training</li>\n<li>How Amy’s auto-immune disease has prepared her for the current pandemic protocols</li>\n<li>Amy’s description of her sight</li>\n<li>Her bad luck at the World Championships</li>\n<li>The story of her vision loss and how it led her to the triathlon</li>\n<li>How she dealt with the news of her vision loss emotionally</li>\n<li>The therapy she found in returning to her love of horses</li>\n<li>The story of her competitive triathlon career from the beginning</li>\n<li>The story of how she missed going to the 2016 Paralympics</li>\n<li>What keeps her going for Tokyo 2021</li>\n<li>Her eye surgeries/treatment and the complications they create for her training</li>\n<li>Her mantra and how she keeps it going with so many challenges</li>\n<li>Amy’s ‘No Sight No Limits’ camp</li>\n</ul>\n<p>Quotes:</p>\n<p>“This is my one and done shot.”</p>\n<p>“I always laugh that I’m held together with duct tape and glue.”</p>\n<p>“I’ve lived my whole life like this as far as being…physically distant.”</p>\n<p>“I developed some really unhealthy habits as far as anxiety is concerned.”</p>\n<p>“It’s like looking through a keyhole.”</p>\n<p>“They were able to slow down the progression of my disease by putting me on a kind of steroids, but I gained 75 pounds, and so that’s when I found triathlon.”</p>\n<p>“I just envisioned it to be the worst possible death sentence, in my opinion.”</p>\n<p>“I can still do this with this different body and this different ability and just in a different way, and it wasn’t that different than anybody else out on the course.”</p>\n<p>“So you took chemo and got cancer.”</p>\n<p>“The goal always was to slow the disease down enough that technology would catch up with it.”</p>\n<p>“I’ve had 33 surgeries over the past 7 years…to control my disease.”</p>\n<p>“My eye is constantly deflating every time I train really hard.”</p>\n<p>“95% of people who are…legally blind have some residual vision.”</p>\n<p>“I’m the first patient over the age of 40 that has any usable vision with this kind of diagnosis.”</p>\n<p>“I know what the other side looks like and that it’s not all bad.”</p>\n<p>“This anxiety that we have with this Olympic and Paralympic postponement really has created problems that I didn’t imagine for myself, but, at the same time…on the positive side, it’s bought me an entire year of hopefully having consistent training and hopefully being healthy if I make some good decisions going forward.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Amy:</p>\n<p>Amy’s homepage:   <a href=\"https://amydixonusa.com/\" rel=\"nofollow\">https://amydixonusa.com/</a></p>\n<p>Amy’s Facebook:   <a href=\"https://www.facebook.com/amydixonusa\" rel=\"nofollow\">https://www.facebook.com/amydixonusa</a></p>\n<p>Amy’s Instagram:   <a href=\"https://www.instagram.com/nosightnolimits/?hl=en\" rel=\"nofollow\">https://www.instagram.com/nosightnolimits/?hl=en</a></p>\n<p>Amy’s Twitter:   <a href=\"https://twitter.com/nosightnolimits\" rel=\"nofollow\">https://twitter.com/nosightnolimits</a></p>",
  "itunes:title": "You Don't Need to Have Sight to Have Vision with Amy Dixon",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 14
}