{
  "id": "yt:video:J_6tnx-SuN8",
  "yt:videoId": "J_6tnx-SuN8",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "”CHALLENGE OF CHAMPIONS”  1974 INDIANAPOLIS 500 RACE   JOHNNY RUTHERFORD  XD60674",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-01T19:29:54+00:00",
  "updated": "2022-11-01T19:29:54+00:00",
  "media:group": {
    "media:title": "”CHALLENGE OF CHAMPIONS”  1974 INDIANAPOLIS 500 RACE   JOHNNY RUTHERFORD  XD60674",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis promotional film for Valvoline covers the 58th Running of the Indianapolis 500 held on May 26th, 1974, at the Indianapolis Motor Speedway. Throughout the film, race drivers and team managers are interviewed, and highlights of the 115-lap 500-mile race are shown. In 1974, 33 drivers competed for a prize of over one million dollars.\n\nThe film begins with shots showing the over 300.000 fans attending the motorsport event (00:08). An overview reveals the impressive size of the crowd and stadium (00:16). McLaren team manager George Bignotti is interviewed (01:24), followed by Parnelli Jones (01:36), team manager Dan Gurney (01:45), Teddy Mayor of the McLaren team (01:52), and chief mechanic A. J. Watson (01:56). Gordon Johncock, winner of Indianapolis 500 in 1973 (02:24), 1969 winner; Mario Andretti (02:27), and 1968 winner; Bobby Unser (02:31). Mike Mosley puts on his glasses (02:34). Bill Vukovich II in his racecar (02:37), and Lloyd Ruby in his racecar (02:41). Three-time winner A. J. Foyt is interviewed about his results during trials (02:46). Footage from the qualification rounds (03:28). Johnny Rutherford is interviewed about the race from the 25th position (04:04), followed by Wally Dallenbach Sr. about starting from the front row (04:13). Clips of Mike Hiss (04:32), two-time winner Al Unser (04:36), Gary Bettenhausen (04:39), Pancho Carter (04:45), and Bill Simpson (04:57). Various fans are interviewed about their favorite driver (05:12). Tony Hulman is the starting command (05:38). Many balloons are released into the sky as a celebratory measure (05:49). 11 rows with 33 cars are lining up for the start of the race (06:14). The green flag is in, and the Indianapolis 500 begins (08:12). Mike Mosley is out on Lap four (11:15). Rutherford is in the pit on lap 23 (13:30), followed by A. J. Floyd on lap 24 (14:06), and Unser on lap 28 (14:14). Unser’s team manager Dan Gurney (14:28) and George Bignotti (15:07) comments on the race. On lap 59, 10 cars are out of the race (15:33). Jan Opperman has an accident on the track (16:01), and the yellow flag is out for caution laps (16:15). A. J. Floyd's pit crew is having problems inside the pit (17:13). The green flag is out (17:34). Jerry Grant hits a wall causing an accident on the racetrack (18:34), and the yellow flag is out again (18:43). Team-members attend to the damaged car to clean up the raceway (18:54). The green flag is out (19:45). At the 150-mile mark, half of the drivers are out of the race (20:18). Salt Walter is out (20:37). His father is interviewed about Walter’s near fatal accident in the 1973 race (20:44). A. J. Floyd is having unfixable problems with his car in the pit (22:06) and he withdraws from the race (22:24). Pancho Carter’s car is bumped and turned, and he is forced to drive off the track (23:17). Johnny Rutherford wins the race (26:45). Bobby Unser finishes second 22 behind (26:54). Fans are expressing their joy over the results of the race (27:07). Rutherford drives on the checkered victory lane (27:21). His team manager comments on the success (27:50). Rutherford comments on his victory and accepts several embraces and congratulations (28:05). \n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}