{
  "title": "Ep. 3 - The Poe Show",
  "itunes:title": "The Poe Show",
  "pubDate": "Tue, 07 Oct 2014 10:13:46 +0000",
  "guid": "7fc6b26b92ef0e75847f6a48cd1663a5",
  "link": "https://sites.libsyn.com/58064/history-goes-bump-podcast-ep-3-the-poe-show",
  "itunes:image": "",
  "description": "<p>In this third episode of the History Goes Bump Podcast, the Moment in Oddity features the Female Stranger Grave. On this day in 1849, Edgar Allan Poe died and this episode is about him and dedicated to him. Was Poe really a drug addled womanizing alcoholic who was nuts or is the truth something different? Listen in to hear about his tragic history, his writings and the mysterious circumstances of his death. Is his ghost still hanging around and where? If you are a fan of Poe, you will enjoy The Poe Show!<br /> <br /> Check out the website at: <a href= \"http://historygoesbump.com\">http://historygoesbump.com</a><br /> <br /> Show notes and pictures can be found here: <a href= \"http://historygoesbump.blogspot.com/2014/10/hgb-podcast-3-poe-show.html\"> http://historygoesbump.blogspot.com/2014/10/hgb-podcast-3-poe-show.html</a></p> <p>Become an Executive Producer: <a href= \"http://patreon.com/historygoesbump\">http://patreon.com/historygoesbump</a></p> <p> </p>",
  "content:encoded": "<p>In this third episode of the History Goes Bump Podcast, the Moment in Oddity features the Female Stranger Grave. On this day in 1849, Edgar Allan Poe died and this episode is about him and dedicated to him. Was Poe really a drug addled womanizing alcoholic who was nuts or is the truth something different? Listen in to hear about his tragic history, his writings and the mysterious circumstances of his death. Is his ghost still hanging around and where? If you are a fan of Poe, you will enjoy The Poe Show!  Check out the website at: <a href= \"http://historygoesbump.com\">http://historygoesbump.com</a>  Show notes and pictures can be found here: <a href= \"http://historygoesbump.blogspot.com/2014/10/hgb-podcast-3-poe-show.html\"> http://historygoesbump.blogspot.com/2014/10/hgb-podcast-3-poe-show.html</a></p> <p>Become an Executive Producer: <a href= \"http://patreon.com/historygoesbump\">http://patreon.com/historygoesbump</a></p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "33:52",
  "itunes:explicit": false,
  "itunes:keywords": "EDGAR,history,ghosts,paranormal,hauntings,historic,allan,Poe",
  "itunes:subtitle": "In this third episode of the History Goes Bump Podcast, the Moment in Oddity features the Female Stranger Grave. On this day in 1849, Edgar Allan Poe died and this episode is about him and dedicated to him. Was Poe really a drug addled womanizing...",
  "itunes:episode": 3,
  "itunes:episodeType": "full"
}