{
  "title": "Monitoring Parkinson’s Patients at Home Could Improve Disease Management",
  "link": "https://spectrum.ieee.org/radar-device-could-monitor-parkinson-s-at-home",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-showing-a-device-with-an-antenna-on-a-wall-radiating-a-signal-a-figure-walks-through-a-door-and-is-seen-in-severa.jpg?id=31842546&width=1200&height=600&coordinates=0%2C78%2C0%2C619\"/><br/><br/><p>A radar device the size of a Wi-Fi router could help continuously monitor Parkinson’s disease in patients from afar as they go about their lives at home. By using radio waves to track the gait of Parkinson’s patients, the device should help doctors assess the effectiveness of medications, see how the disease is progressing, and create better treatment plans.</p><p><a href=\"https://www.michaeljfox.org/parkinsons-101\" target=\"_blank\">Parkinson’s disease</a> is a chronic, progressive brain disorder that affects motor function, causing tremors, impaired balance, and the <a href=\"https://spectrum.ieee.org/smart-footwear-helps-assess-the-fall-risk-of-people-with-parkinsons-disease\" target=\"_self\">risk of falls</a> and injuries. There is no cure for it and patients rely on medications to control symptoms. </p><p>Patients then have to visit clinics regularly so specialists can assess their motor and nonmotor symptoms to determine how they are responding to the drugs. The gold-standard test used to assess Parkinson’s disease is the <a href=\"https://www.movementdisorders.org/MDS/MDS-Rating-Scales/MDS-Unified-Parkinsons-Disease-Rating-Scale-MDS-UPDRS.htm\" target=\"_blank\">Unified Parkinson’s Disease Rating Scale </a>(UPDRS) in which a patient’s motor skills are evaluated and scored based on a number of physical exercises. But this type of assessment isn’t ideal and can be affected by things like the patient being tired or the subjectivity of the evaluator. </p><p>That’s if patients even make it to the clinics in the first place. About 40 percent of patients with Parkinson’s are not seen by neurologists or Parkinson’s specialists, because these care providers are concentrated in medical centers in urban areas. Those suffering from advanced Parkinson’s often have problems traveling to these medical centers due to old age, limited mobility, impaired cognition, and decreased driving ability.</p><p>An objective and accurate way to continuously assess Parkinson’s at home could lead to better medical care and also help researchers develop new drugs to control the disorder, says <a href=\"http://yingchengliu.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Yingcheng Liu</a>, a Ph.D. candidate in the electrical engineering and computer science department at MIT. One way to do that is to ask patients to wear sensors or measure themselves. But Liu and Guo Zhang of MIT, along with neurologists at the University of Rochester Medical Center wanted to develop a touchless, passive system. So they decided to use radio waves. </p><p>Their device, reported in the journal <em>Science Translational Medicine</em>, is the size of a Wi-Fi router, but it transmits radio signals at a thousandth of the power. “Our device works like a low-power home human radar,” Liu says. </p><p class=\"pull-quote\">An objective and accurate way to continuously assess Parkinson’s at home could lead to better medical care and also help researchers develop new drugs to control the disorder.</p><p>The low-power signals can travel through walls and objects, but they reflect off the human body because of its water content. The device collects the signals and sends them to Amazon Cloud where they are analyzed by the advanced signal-processing and machine-learning algorithms that the researchers developed. </p><p>Based on the signals, the algorithms extract a patient’s walking movements and trajectories through the home. From these trajectories, Liu says the researchers can calculate the person’s walking speed and evaluate its correlation with Parkinson’s severity, disease progression, and medication response.</p><p>The team tested the device by using it to monitor 34 participants with Parkinson’s disease and 16 healthy control subjects continuously in their homes for months. They found that the calculated walking speed correlated with scores on the standard test used today to measure disease severity. </p><p>But the at-home gait speed was more sensitive at tracking disease progression over time. “We found that those with Parkinson’s disease had a faster rate of decline in gait speed over time than those without,” Liu says.</p><p>What’s more, the device was able to detect the fluctuations in patients’ walking speed in response to medication over the course of the day. Typically, patients have to record these fluctuations in diaries so that doctors can adjust their treatment plans. Being able to detect them remotely using the radar device takes the burden off the patients, the researchers say.<br/></p><p>They now need to make the algorithms more robust and efficient, and they plan to test the device and methods on a larger population. Liu says he also wants to analyze more gait parameters such as stride length and swing length. “I will try to combine both gait and sleep to study Parkinson’s in a more holistic aspect,” he says. “Also, there are many other diseases that result in gait dysfunction, such as cancer. I will also study these diseases.” </p>",
  "pubDate": "Thu, 29 Sep 2022 17:43:48 +0000",
  "guid": "https://spectrum.ieee.org/radar-device-could-monitor-parkinson-s-at-home",
  "category": [
    "Radar",
    "Remote monitoring",
    "Parkinson's disease",
    "Gait control"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}