{
  "id": "yt:video:ujooHQVKMKI",
  "yt:videoId": "ujooHQVKMKI",
  "yt:channelId": "UCXX1iQGufHujuIvQ38MPKMA",
  "title": "A Critique of Star Wars: The Force Awakens - Part 4",
  "link": "",
  "author": {
    "name": "MauLer",
    "uri": "https://www.youtube.com/channel/UCXX1iQGufHujuIvQ38MPKMA"
  },
  "published": "2022-03-04T19:00:16+00:00",
  "updated": "2022-08-19T15:43:39+00:00",
  "media:group": {
    "media:title": "A Critique of Star Wars: The Force Awakens - Part 4",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is Part 4 of 6 of a series of videos all about Star Wars: The Force Awakens. \n\nAfter having gone over the big battle on Takodana, Leia and The Resistance arrive. Only for Kylo to attempt to torture Rey while the heroes construct a plan to approach Star Killer Base, leaving us... plenty to talk about. \n\nWe jump into all kinds of third party media as example of how better or worse to commit to certain writing ideas including Fargo, Lord of the Rings, Game of Thrones, The Suicide Squad, as well as the Book of Boba Fett, The Matrix Resurrections and Loki. With a small detour into some advice from the creators of South Park.\n\nYou may see one or two cameos as the video progresses as well as a few more sneaky references here and there.\n\nThe Thumbnail art is courtesy of Oliver Pocock\n\nJlongBone (TheMarcia Lucas comment reading) - https://www.youtube.com/c/JLongbone\n\nJay Exci (Voice acting Rey) - https://www.youtube.com/c/CinemaSinsSins\n\nMauler merchandise store - https://teespring.com/en-GB/stores/maulers-store\n\nThe first third of the EFAP Arcane coverage - https://www.youtube.com/watch?v=rFRVD4GYuEg\n\nThe complete EFAP coverage of The Book of Boba Fett - https://www.youtube.com/watch?v=R3Ov_P0QVLQ\n\nThe previous part - https://www.youtube.com/watch?v=Zb3F5WE6KBI\n\nHere is a link to my second channel, where my Podcast \"EFAP\" is hosted. - https://www.youtube.com/channel/UCHH-ybUwH1CfJrXxnqw6Ljw\n\nTwitter - https://twitter.com/MauLer93\n\nPatreon - https://www.patreon.com/user?u=4817956\n\nSubscribeStar - https://www.subscribestar.com/mauler\n\nDiscord - https://discord.gg/aNX8J2v\n\n0:00:00 - Introduction.\n\n0:00:55 - Leia and C3PO join the story with a little ADR.\n\n0:06:03 - The Resistance and the incredible resurrection of Poe Dameron.\n\n0:12:03 - Finn's history and his relationship with The Resistance.\n\n0:16:46 - The absolutely confusing \"Map to Luke\" and what it means.\n\n0:24:30 - Han and Leia discuss the past - Missed opportunities.\n\n0:36:08 - The nature of Contrivance.\n\n0:57:56 - Who is Kylo Ren?\n\n1:09:06 - Kylo interrogates Rey.\n\n1:20:10 - Rey outperforms Kylo and many attempt to explain it.\n\n1:25:28 - Scanning, following, tracking and winding the ticking clock.\n\n1:30:24 - What does Snoke want from Rey?\n\n1:33:43 - Rey escapes her captivity with a Jedi mind trick and Kylo big mad.\n\n1:42:48 - The mysterious case of the sun-eating planet.\n\n1:47:05 - The Resistance plan their assault on Starkiller Base. \n\n1:53:33 - Kylo warns that Rey must be found before she gains more power while she sneaks around.\n\n1:54:26 - Hyperdrive has been a tad compromised. let's discuss that.\n\n2:02:43 - Kylo searches for Rey as our heroes enter the base.\n\n2:06:08 - Finn captures Captain Phasma and forces her to disable the planetary shields.\n\n2:09:33 - Who is Captain Phasma?\n\n2:13:35 - The shields are down and the assault begins.\n\n2:18:12 - Finn and Han realise Rey saved herself and they team up.\n\n2:21:04 - Our heroes must separate to prepare the sabotage of Star Killer Base.\n\n2:23:05 - The outro - Thank you so much for watching.\n\n2:24:04 - Check out EFAP! - Links in description. \n\n2:27:22 - Marcia Lucas' comments on Disney Star Wars.\n\n2:28:58 - Jay Exci outtakes.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}