{
  "title": "Fundraising in time of crisis: Why SEA founders can remain hopeful",
  "link": "https://e27.co/fundraising-in-time-of-crisis-why-sea-founders-can-remain-hopeful-20221028/",
  "dc:creator": "Anisa Menur",
  "pubDate": "Fri, 28 Oct 2022 07:53:07 +0000",
  "category": [
    "e27",
    "Echelon",
    "Events",
    "Carro",
    "Vertex Growth Fund",
    "Vertex Holdings",
    "Vertex Ventures",
    "Vertex Ventures Holdings",
    "Vertex Ventures Southeast Asia & India"
  ],
  "guid": "https://e27.co/?p=475170",
  "description": "<p>On the first day of Echelon 2022, Carmen Yuen, General Partner at Vertex Ventures, explains how startups in the Southeast Asian ecosystem today still have to deal with global challenges in a manner similar to the earlier days of the COVID-19 pandemic in 2020. &#8220;We were bracing for the worst. The response by companies was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/fundraising-in-time-of-crisis-why-sea-founders-can-remain-hopeful-20221028/\">Fundraising in time of crisis: Why SEA founders can remain hopeful</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475198\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475198\" loading=\"lazy\" class=\"wp-image-475198 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/echelon_article_1.jpg\" alt=\"\" width=\"690\" height=\"390\" /><p id=\"caption-attachment-475198\" class=\"wp-caption-text\">Left to right: Mohan Belani (e27), Sonny Sudaryana (Kemenkominfo), Aaron Tan (Carro), Carmen Yuen (Vertex Ventures)</p></div>\n<p>On the first day of Echelon 2022, Carmen Yuen, General Partner at Vertex Ventures, explains how startups in the Southeast Asian ecosystem today still have to deal with global challenges in a manner similar to the earlier days of the COVID-19 pandemic in 2020.</p>\n<p>&#8220;We were bracing for the worst. The response by companies was to cut costs ratio, extend the runway, and make sure to have money that lasts for 18 to 24 months. Are you able to work on a creative model to make sure that your talent stays around?&#8221; she points out. &#8220;Then, subsequently, everybody forgot about that because money started coming in investments. It takes you on a rollercoaster ride that is very, very high &#8230; then we came down again. So, the practices that we did in 2020 still apply today.&#8221;</p>\n<p>Yuen gave this observation at a panel discussion called &#8220;The state of SEA startup ecosystem today and what&#8217;s in it for 2023&#8221; at Echelon 2022, held at Resorts World Sentosa on Thursday. However, in addition to a warning, she also gave hope by stressing that the region &#8220;is just about finding enough pieces [of puzzles] to solve&#8221;.</p>\n<p>Some verticals also continue to be popular, even during a time of crisis. Yuen gave the example of climate tech, particularly companies that are working on providing solutions to problems such as food security and waterborne diseases, in addition to the already popular sector of electric vehicles.</p>\n<p>Despite not being an impact investor, Vertex Ventures has portfolio companies that have developed a product with impact. In addition to working closely with MSMEs, these companies try to implement principles of inclusion in their operations.</p>\n<p>&#8220;Honestly, when you are doing something good, you will probably generate employment in the area of work that you are doing. So your job should not be only about making money for you and your immediate partners. Your wealth should go down to more and more people in the community you serve. So that&#8217;s where you got economic empowerment,&#8221; Yuen said.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/echelon-2022-moving-into-web3-why-now-is-the-right-time-20221025/\">Echelon 2022: Moving into Web3, why now is the right time?</a></strong></p>\n<h1>Fundraising today and tomorrow</h1>\n<p>Regardless of the global situation, there are several pieces of advice that remain timeless when it comes to fundraising. Carro, as a company that confirmed its unicorn status last year through a <a rel=\"follow\" href=\"https://e27.co/carro-raises-us360m-series-c-to-be-the-first-automotive-marketplace-unicorn-in-sea-20210614/\">US$360 million Series C raise</a>, has several tips to share.</p>\n<p>The first one is to understand the difference between fundraising for companies in the early and later stages. According to CEO Aaron Tan in a fireside chat at the event, for early-stage founders, there is a stronger emphasis on their ability to tell a compelling story. On the other hand, investors will scrutinise the economic units in Series B and C stages.</p>\n<p>&#8220;[The investors at the early stage] basically just want to find a team that can execute and stuff,&#8221; he stressed.</p>\n<p>Particularly for early-stage companies, Tan shared his experience in fundraising and the points that founders need to pay attention to. It starts with researching the background of the VC that they want to raise from, followed by understanding how to reach out to them.</p>\n<p>&#8220;We do not like to work with people we cannot get along with. Sometimes it works similarly for me as a founder,&#8221; Tan said.</p>\n<h2>Not just VC funding</h2>\n<p>In the startup ecosystem, raising VC funding is often viewed as an important milestone that a startup must go through. However, it is important to acknowledge that not all companies will raise external funding. Even if they do, VC is not the only available alternative for founders to reach out to.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/malaysian-fleet-fuel-expense-management-startup-bayapay-raises-funding-20221027/\">Malaysian fleet fuel expense management startup BayaPay raises funding</a></strong></p>\n<p>In a separate panel called &#8220;Alternative to fundraising from VCs &#8211; The growth of syndicates, venture debt, and marketplace&#8221;, panellists look at situations where VC fundraising can actually be &#8220;a downside&#8221; for startups.</p>\n<p>According to Milan Reinartz, Co-Founder at Genesis Ascend Angels, it starts with the company&#8217;s stages. For companies in the very early stages, VC firms often do not cater to their needs.</p>\n<p>&#8220;I think that there are also other elements around having strategic value on the cap tables or even in VC rounds, you often see angel syndicates or super angels coming in individually to participate in the fundraising &#8230; It could also be family offices or somebody who has a senior position in an adjacent or same industry,&#8221; he explained.</p>\n<p>&#8220;That would make sense for the founder to have beyond just money. It is not that VCs are all non-strategic; they can be very strategic as well. Oftentimes, it makes sense to take smaller checks and get a wealth of knowledge and support from the angel community, even for Series As and Bs.&#8221;</p>\n<p>Regarding the fundraising process itself, such as performing due diligence, there are no significant differences between VC fundraising and alternative platforms such as angel syndicates or marketplace.</p>\n<p>&#8220;One consideration that I would say is that founders need to be very realistic about the valuation that they are looking for,&#8221; said Danyaal Shah, Group Head of Corporate Development & Partnership at Alta, formerly known as Fundnel.</p>\n<p>&#8220;If you do a round at a higher valuation than you should be, the next round will suffer from a previous valuation that is too high to follow. Doing a down round is never a good thing. So it should always be that you know your valuation is justified.&#8221;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/fundraising-in-time-of-crisis-why-sea-founders-can-remain-hopeful-20221028/\">Fundraising in time of crisis: Why SEA founders can remain hopeful</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}