{
  "id": "yt:video:Ud7b8Mg6iVI",
  "yt:videoId": "Ud7b8Mg6iVI",
  "yt:channelId": "UC9Kq-yEt1iYsbUzNOoIRK0g",
  "title": "Harry Potter and the Deathly Hallows: Part 1 Pitch Meeting",
  "link": "",
  "author": {
    "name": "Pitch Meeting",
    "uri": "https://www.youtube.com/channel/UC9Kq-yEt1iYsbUzNOoIRK0g"
  },
  "published": "2022-08-25T19:15:00+00:00",
  "updated": "2022-08-27T17:08:34+00:00",
  "media:group": {
    "media:title": "Harry Potter and the Deathly Hallows: Part 1 Pitch Meeting",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Step inside the pitch meeting that led to Harry Potter and the Deathly Hallows Part 1!\n\nSubscribe to the NEW CHANNEL for more Pitch Meetings: https://www.youtube.com/channel/UC9Kq-yEt1iYsbUzNOoIRK0g\n\nIf Warner Bros got to stretch the Deathly Hallows into two pieces of content then so do we! Harry Potter and the Deathly Hallows Part 1 is the beginning of the final adventure for Harry and the gang as they set off to destroy a bunch of a Horcruxes and do a WHOLE lot of camping.\n\nHarry Potter and the Deathly Hallows Part 1 does raise some questions. Like why did all the good guys think that having a massive party at a house that was already destroyed by Death Eaters was a good idea? And where did Harry get that mirror shard? And how thick is this dude’s plot armor? How many wildly different functions do these magical do-hickeys have?\n\nTo answer all these questions and more, step inside the Pitch Meeting that led to Harry Potter and the Deathly Hallows Part 1! It’ll be super easy, barely an inconvenience.\n\nCheck Out These Other Videos:\n\nHarry Potter and the Half-Blood Prince Pitch Meeting\nhttps://www.youtube.com/watch?v=gAqEVui7je4\n\nMorbius Pitch Meeting\nhttps://www.youtube.com/watch?v=xb5I1WWeFQg\n\nOur Social Media:\nhttps://twitter.com/screenrant\nhttps://www.facebook.com/ScreenRant\n\nOur Website\nhttp://screenrant.com/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}