{
  "id": "yt:video:DvCFc5JtkkA",
  "yt:videoId": "DvCFc5JtkkA",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "Black Adam - Comic-Con Sneak Peek",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-07-23T18:21:19+00:00",
  "updated": "2022-08-19T15:54:02+00:00",
  "media:group": {
    "media:title": "Black Adam - Comic-Con Sneak Peek",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "\"You can be the destroyer of this world, or you can be its savior.\" #BlackAdam only in theaters October 21.\n\n-----------------\nhttps://www.facebook.com/blackadammovie\nhttps://www.instagram.com/blackadammovie/\nhttps://twitter.com/blackadammovie\n-----------------\n\nFrom New Line Cinema, Dwayne Johnson stars in the action adventure “Black Adam.” The first-ever feature film to explore the story of the DC Super Hero comes to the big screen under the direction of Jaume Collet-Serra (“Jungle Cruise”).&#13;\n\nNearly 5,000 years after he was bestowed with the almighty powers of the ancient gods—and imprisoned just as quickly—Black Adam (Johnson) is freed from his earthly tomb, ready to unleash his unique form of justice on the modern world.&#13;\n\nJohnson stars alongside Aldis Hodge (“City on a Hill,” “One Night in Miami”) as Hawkman, Noah Centineo (“To All the Boys I’ve Loved Before”) as Atom Smasher, Sarah Shahi (“Sex/Life,” “Rush Hour 3”), Marwan Kenzari (“Murder on the Orient Express,” “The Mummy”), Quintessa Swindell (“Voyagers,” “Trinkets”) as Cyclone, Mo Amer (“Mo,” “Ramy”), Bodhi Sabongui (“A Million Little Things”), and Pierce Brosnan (the “Mamma Mia!” and James Bond franchises) as Dr. Fate.&#13;\n\nCollet-Serra directed from a screenplay written by Adam Sztykiel and Rory Haines & Sohrab Noshirvani, based on characters from DC, based on characters created by Bill Parker and C.C. Beck. The film’s producers are Beau Flynn, Dwayne Johnson, Hiram Garcia and Dany Garcia, with Walter Hamada, Adam Schlagman, Richard Brener, Dave Neustadter, Chris Pan, Eric McLeod, Geoff Johns and Scott Sheldon executive producing.\n\n&#13;The director’s behind-the-scenes creative team includes Oscar-nominated director of photography Lawrence Sher (“Joker”), production designer Tom Meyer (“Real Steel”), editors Mike Sale (“Red Notice,” “Skyscraper”) and John Lee (“Anyone Home?”), costume designers Kurt and Bart (“Deadpool 2,” “The Hunger Games: Mockingjay – Part 1 & 2”), Oscar-winning visual effects supervisor Bill Westenhofer (“Life of Pi,” “Wonder Woman”), and composer Lorne Balfe (“Black Widow”).&#13;\n\nNew Line Cinema Presents a Seven Bucks/Flynn Co. Production, A Jaume Collet-Serra Film, “Black Adam,” smashing into theaters and IMAX internationally beginning 19 October 2022, in North America on October 21, 2022. It will be distributed worldwide by Warner Bros. Pictures.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}