{
  "id": "tag:theatlantic.com,2020:39-617257",
  "content": "<p><small><i>This article was published online on December 15, 2020.</i></small></p><p class=\"dropcap\">E<span class=\"smallcaps\">veryone is born</span> a mark, and you have to hope you wise up from there. Getting purposefully and repeatedly fooled is one of the fundamental experiences of childhood—by peekaboo, by Santa Claus, by the idea that you’ll grow a watermelon in your tummy if you swallow the seeds. The more kids realize they’ve been fooled, first by caregivers doing some good-natured baby trickery and then by peers at school, the wiser they theoretically get to situations in which they should be wary.</p><p>When high school spits kids out into adulthood, they’d better have learned those lessons well—the stakes of being a mark ratchet up considerably along with the legal rights of being a grown-up. Suddenly banks, lenders, student-loan underwriters, and any store hyping a 20 percent discount for opening a new credit card would like to show you your options. The pitches are pretty good, too: No one trying to shake you down at recess was dangling the carrot of shopping sprees or class mobility. If you need to pay for college, rent an apartment, or just buy some jeans, the entire field of credit and lending unfurls before you.</p><p>Yet few Americans hit the age of majority with more than a rudimentary understanding of their finances, and the country’s banks are poorly regulated. From 2004 to 2020, <a href=\"https://www.brookings.edu/policy2020/votervital/who-owes-all-that-student-debt-and-whod-benefit-if-it-were-forgiven/\">student-loan debt metastasized from $250 billion to $1.5 trillion</a>, as the costs of higher education increased but wages in many fields didn’t rise to meet them. Also putting young people into arrears during the aughts: carnival barkers in the quad hawking Visa, Mastercard, and the like alongside free T‑shirts and pizza, until the federal government kicked credit-card companies off campus in 2009 and barred them from sending sign-up pitches offering prizes to those living in college housing.</p><p>The new protections, combined with an ambient fear of debt in a country still reeling from a loan-induced economic catastrophe, worked. Young Americans <a href=\"https://www.cnbc.com/2019/05/21/millennials-are-no-longer-good-at-staying-out-of-bad-credit-card-debt.html\">began opening credit cards less frequently</a>; when they did, they missed fewer payments and maintained lower balances than previous generations had. In 2012, only <a href=\"https://www.cnbc.com/2019/05/21/millennials-are-no-longer-good-at-staying-out-of-bad-credit-card-debt.html\">41 percent of people in their 20s</a> had a credit card, as opposed to <a href=\"https://www.creditcards.com/credit-card-news/credit-cards-in-different-cultures-1267/\">more than 73 percent</a> of American households overall. The use of debit cards soared. The marks weren’t so easy anymore.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2020/07/coronavirus-banks-collapse/612247/?utm_source=feed\">From the July/August 2020 issue: The looming bank collapse</a>]</i></p><p>By 2019, that progress had eroded. The number of 20‑somethings with credit cards ticked above 50 percent, and more of them began falling behind on payments. The cost of living was rising, the Great Recession wasn’t so close in the rearview mirror, and people needed and wanted to buy things, even if they didn’t necessarily want credit cards. It was the perfect time for a shiny new gambit from the finance world, and one emerged to meet the moment: point-of-sale lending start-ups like Klarna, Afterpay, and Affirm, or, as many of them prefer to be known, “buy now, pay later” services.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>You’ve probably seen these businesses infiltrate many of the places you shop online. They’re embedded in the checkout processes at Walmart, H&amp;M, Sephora, Dyson. Their promises are enticing: Split a $200 pair of Adidas into four automatic, interest-free payments of $50, with only a cursory credit check required. Try a pricey new moisturizer and return it if you don’t like it before the money has even left your bank account. Pelotons don’t cost two grand; they cost 60 interest-free bucks a month for a few years. The checkout lenders market themselves on simplicity, transparency, and low cost—credit for people who are too smart to get tangled up with credit cards. But when you find yourself being flattered and asked for your debit-card number in the same breath, it’s time once again to ponder one of life’s most important questions: What’s the catch?</p><p class=\"dropcap\"><span class=\"smallcaps\">When Erin Lowry </span>first encountered the chance to take out a loan for a couple hundred dollars from Affirm, she was buying Cole Haan shoes. This was a few years ago, before Affirm and similar services had been adopted by tens of thousands of American internet retailers. “My gut reaction was like, <i>Oh, this is a terrible idea</i>,” Lowry, the author of the <i>Broke Millennial</i> financial-advice books, told me. Her standard counsel for these situations probably won’t shock you: Deals that sound too good to be true probably are. But could point-of-sale lenders be the exception to the rule?</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2020/09/pandemic-broke-online-shopping/616353/?utm_source=feed\">Read: Why everything is sold out</a>]</i></p><p>These companies put forth a range of financing alternatives, but their most ubiquitous breaks down purchases into two to four installments, paid automatically over a few weeks or months, usually with your debit card. The fine print varies, but the plans typically charge no interest, and the penalty for missing a payment ranges from nothing to nominal—seven or eight bucks. (Credit cards are also accepted, but that, of course, introduces the possibility of paying interest.) Upon checkout, you give the store’s lending partner your name, address, phone number, and birth date, and are approved or rejected based on an algorithm in lieu of a full credit check. None of the major lenders discloses the criteria included in their algorithms, but the time of day and the size of your purchase are often cited as examples of what might be considered—bad news if you want to spend a lot of money at three in the morning.</p><p>For Lowry, the claim of transparency and low cost felt like a red flag in and of itself. Most credit-card companies make money through interest and fees paid by the people who use their cards and continually add to their balances—so what was going on here? If you’re not sure who’s funding the bottom line, Lowry told me, it’s probably you, in one way or another.</p><p>According to the lenders, their revenue comes primarily from stores, which pay much more than they would to process the same transactions with credit cards. Why are retailers willing to fork over the extra money? “They say consumers are more likely to shop; they see consumers spending a bit more money and shopping more regularly,” says David Sykes, the head of Klarna’s U.S. division. He compares his firm’s business model to the one with which the Home Shopping Network struck gold decades ago: When people hear “four payments of $25,” they just don’t feel like they’re spending $100.</p><p>These new lenders also give retailers greater access to a demographic whose purchasing power is relatively untapped: the nearly half of Americans in their 20s who don’t have a credit card. While many of the services offer loans for four- or five-figure purchases, with interest rates similar to those of credit cards, their bread and butter is the mundane commerce of everyday life for the young—people buying a last-minute suit for a job interview or stocking up during a sale at Sephora before their next paycheck clears.</p><p>As is the case with credit cards, Lowry thinks the trick is using these services infrequently. Something that’s simple for one purchase can be difficult to track across many, especially for inexperienced budgeters. “It can become really easy to forget that two months ago, you purchased an item that’s taking $25 out of your account for the next four months,” she said. “That’s a quick way to end up in a debt cycle.” And like with other forms of credit, if you just don’t pay, a bill collector will come after you.</p><p>Amanda Clayman, a Prudential financial therapist and wellness advocate (a thing that many people could use right now), told me that the very novelty of these services presents peril. “Any new technology has a certain seductiveness,” she said. “When we have these new exposures to things that make it easier for us to buy, we don’t yet have the experience or template of danger. We only see the promise.”</p><p class=\"dropcap\"><span class=\"smallcaps\">All of the </span>financial experts I spoke with voiced apprehension about the sudden pervasiveness of point-of-sale lenders and the challenges consumers face in using them wisely. Their penchant for targeting young audiences, with sponsored content from Instagram influencers and <i>RuPaul’s Drag Race </i>contestants, was also a point of concern. But the experts were clear about something else: There is no reason to vilify these services more than any of the other products that encourage (or merely help) people to buy things they can’t afford.</p><p>“The U.S. market for financial services is regulated under the philosophy of caveat emptor,” observes Sarah Newcomb, the director of behavioral science at the financial-research firm Morningstar. “Our laws basically say, ‘Look, you need to know what you’re buying—it’s on you.’ ” That includes services that are objectively much riskier than what Klarna and its kin are peddling—such as payday lenders, which make small loans at sky-high interest rates to people who, because of their low income or poor credit history, can’t use regular banks. These businesses take advantage of the working poor, yes, but so does the larger financial system, which leaves many people who need to pay the electric bill or buy groceries dependent on such high-risk loans.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2016/05/payday-lending/476403/?utm_source=feed\">From the May 2016 issue: Will anything better replace payday lending?</a>]</i></p><p>“That line between helpful and predatory can be really blurry,” Newcomb told me. “What may be predatory to one type of customer is actually a very good solution for another type of customer.” Over the summer, I took out a zero-interest Affirm loan to buy a Peloton after considering the terms for a few months. I feel like I got a great deal—I was going to buy the bike regardless, and I’m paying no more than I would have had I taken the money out of my savings account. The benefit for me is that I get to hold on to my cash a bit longer, a cushion in case I have some kind of expensive emergency.</p><p>But I’m in my mid-30s, which makes me a little long in the tooth for any service looking to reach The Youths. I know things now that I didn’t know when I was in college and accruing five figures of consumer debt, which it took me years to pay down. I would have salivated at the idea of paying $72.50 up front for a new Coach bag and worrying about the rest in a few weeks. (There would not have been much more money in a few weeks.)</p><p>That come-what-may desire for instant gratification is what point-of-sale loans hope to inspire in us, after all. By decoupling the act of buying from the act of spending, they remove the psychological friction that can force people to stop, consider their choices, and decide whether they can really afford to buy that one fabulous thing. They obliterate the moment in which you might ask yourself if you are a mark.</p><hr><p><em><small>This article appears in the January/February 2021 print edition with the headline “Jeans Now, Pay Later.” </small></em></p>",
  "author": {
    "name": "Amanda Mull",
    "uri": "http://www.theatlantic.com/author/amanda-mull/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Giacomo Bagnara"
  },
  "title": "Why Is There Financing for Everything Now?",
  "published": "2020-12-15T06:00:00-05:00",
  "updated": "2020-12-21T12:17:21-05:00",
  "summary": "Are the new online services that allow you to buy jeans or shampoo in installments—interest-free—too good to be true?",
  "link": ""
}