{
  "id": "https://bibleinoneyear.org/en/youth/210",
  "title": "Day 210: Four Sacrifices That Please God",
  "description": "Psalm 89:33–35, 1 Chronicles 6:49, Romans 12:1–2,9–13,17–18,21.  We do not need to make any sacrifices for our sins  Yet the New Testament tells us that there are four sacrifices you can make that *please God*",
  "pubDate": "Fri, 29 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/210/",
  "itunes:duration": "14:55",
  "guid": "enyouth29072022-210",
  "length": 895.16,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 210: Four Sacrifices That Please God",
  "itunes:subtitle": "Psalm 89:33–35, 1 Chronicles 6:49, Romans 12:1–2,9–13,17–18,21.  We do not need to make any sacrifices for our sins  Yet the New Testament tells us that there are four sacrifices you can make that *please God*",
  "itunes:summary": "Looking back at my life, I now realise how many sacrifices my parents made out of love for my sister and me. I wish I had appreciated that more at the time. My parents came from a generation that was very familiar with the idea of sacrifice. They both fought in World War Two. Many of their contemporaries had sacrificed their lives for their fellow human beings and for their country. The whole idea of making sacrifices, great or small, seems more alien to our generation.\nThe vast majority of biblical references to ‘sacrifice’ are in the Old Testament. These passages prefigure Jesus’ sacrificial death for us on the cross. In the New Testament, almost all the references are about Jesus’ sacrifice – the death of Jesus as the one perfect and complete sacrifice fulfilling all the Old Testament preparation and prediction. We do not need to make any sacrifices for our sins. Yet the New Testament tells us that there are four sacrifices you can make that please God.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 575
}