{
  "title": "New Miracle Sleep Aid Discovered!",
  "link": "https://freakonomics.com/2015/02/new-miracle-sleep-aid-discovered/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Mon, 23 Feb 2015 17:26:35 +0000",
  "category": [
    "Freakonomics Blog",
    "Jessica Graham",
    "sleep"
  ],
  "guid": "http://freakonomics.com/?p=109738",
  "description": "<p>From a podcast listener named Jessica Graham in Sydney, Australia: My name is Jess and for most of my adult life I have been afflicted by various forms of sleeplessness. Would I call it insomnia? I don&#8217;t know if it could be classified as clinical insomnia, but all I can say is up until a few months ago I did . . .</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/02/new-miracle-sleep-aid-discovered/\">New Miracle Sleep Aid Discovered!</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>From a podcast listener named <strong>Jessica Graham</strong> in Sydney, Australia:</p>\n<blockquote><p>My name is Jess and for most of my adult life I have been afflicted by various forms of sleeplessness.</p>\n<p>Would I call it insomnia? I don&#8217;t know if it could be classified as clinical insomnia, but all I can say is up until a few months ago I did dread that point in the night where you turn off the light (where normal people drop off to sleep within a matter of minutes) and where, I, on the other hand, would spend many hours tossing and turning as my brain would come up with a thousand and one things to ruminate over instead of journeying peacefully to the land of nod.</p>\n<p>What happened to change this dire situation you ask? I now religiously download my Freakonomics podcasts well in advance, pop my headphones on, tune in with anticipation as invariably my mind slowly melds into a soft fuzzy somnambulistic state as I listen to the dulcet tones of Stephen J. Dubner!</p>\n<p>SO THANKYOU <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f642.png\" alt=\"🙂\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p></blockquote>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/02/new-miracle-sleep-aid-discovered/\">New Miracle Sleep Aid Discovered!</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}