{
  "title": "TU93: Polyvagal Theory in Action – The Practice of Body Regulation With Dr Stephen Porges",
  "link": "https://therapistuncensored.com/episodes/tu93-polyvagal-theory-in-action-the-practice-of-body-regulation-with-dr-stephen-porges/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu93-polyvagal-theory-in-action-the-practice-of-body-regulation-with-dr-stephen-porges",
  "pubDate": "Wed, 10 Apr 2019 01:55:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7042",
  "description": "Polyvagal Theory is about the biology of opening our hearts. Cool, huh?\n\nWhat is all this fuss about the vagal nerve and the flurry of interventions developed around it? Find out the facts directly from the father of Polyvagal Theory, award-winning neuroscientist Dr. Stephen Porges.\n\nIn this episode, he speaks with co-host Sue Marriott LCSW, CGP to discuss this ground-breaking discovery about the biology of threat and safety which explains so much about human behavior and psychological disturbances. Rest assured,this isn’t just about our brains, it’s about the biology of opening our hearts.\n\nThis episode will be followed by another updated primer on Polyvagal Theory, so stay tuned.\nWho is Dr. Porges?\nStephen W. Porges PhD is the father of the Polyvagal Theory, which has led to groundbreaking shifts in our understanding of how the nervous system responds to threat and trauma. Through his extensive career, he has published over 300 peer-reviewed articles crossing numerous disciplines from anesthesiology to space medicine.  The Polyvagal Theory is leading to innovative treatments based on insights into the symptoms observed in several behavioral, psychiatric, and physical disorders.\n\n \n\nDr. Porges is a “Distinguished University Scientist” at the Kinsey Institute, Indiana University. He is the founding director of the Traumatic Stress Research Consortium. He holds the position of Professor of Psychiatry at the University of North Carolina as well as Professor Emeritus at the University of Illinois at Chicago and the University of Maryland. He previously served as president of the Society for Psychophysiological Research and the Federation of Associations in Behavioral & Brain Sciences. He is also a former recipient of a National Institute of Mental Health Research Scientist Development Award.\nEpisode 93 Show Notes:\nIntroducing Dr. Porges and The Polyvagal Theory (PVT)\n\n \tWe love it because what we’re interested here in this community is how can learn and use neuroscience and the relational sciences in order to heal.\n \tIt’s not just for our brains; it’s for our hearts. And it’s for creating secure connections in the world.\n\nThe Truth: Beyond Vagal Nerve Pop Culture\n\n \tAwareness of the Vagus is great, but Dr Porges gets concerned when people get enamored with the Vagus\n \tThe nerve is really just a conduit. It’s a highway of bringing information from the body to the brain and from the brain to the body. You have to change the information, not fix the nerve.\n \tIt’s supposed to be an understanding of how our body changes state and the connection of our brain to our body and our body to our brain.\n \tIt was the foundation of brain-body science and medicine.\n\nPolyvagal Theory Origins\n\n \t1994 – presented as the subject of Dr Porges’ presidential address to the Society for Psychophysiological Research\n \tA rediscovery of what had already been observed presented from a new perspective\n \t1995 – Polyvagal Theory is published\n\nThe Backstory:\n\n \tThe original research began as an attempt to develop a methodology for dynamic measurement of normal heart regulation of fetuses through the process of childbirth.\n \tInitially, Dr. Porges thought he discovered a way of measuring the Vagal influence: when the body is regulating, it’s in a good physiological state, resilient, and can survive delivery.\n\nThe Paradox\n\n \tThe situation: baby suffers from hypoxia, resulting in clinical apnea (stop breathing) or clinical bradycardia (heart rate drops)\n \tDr Porges’ view: bradycardia indicates protective Vagal response\n \tNeonatologist and pediatrician view: bradycardia indicates a lethal Vagal response\n\nBoth are right, but how?\n\n \tThey are two different branches of the same system.\n \tHow branches emerge, and their effects are built into the nervous system.\n \tThe protective Vagal circuit (branch 1) is a newer Mammalian Vagal circuit, which preterm babies often aren’t born with.\n \tDuring severe stress,",
  "enclosure": "",
  "itunes:subtitle": "Polyvagal Theory is about the biology of opening our hearts. Cool, huh? - What is all this fuss about the vagal nerve and the flurry of interventions developed around it? Find out the facts directly from the father of Polyvagal Theory,",
  "itunes:summary": "Dr. Stephen Porges, the neuroscientist behind Polyvagal Theory & Sue Marriott discuss mechanisms in the brain that create an array of psychological symptoms.  Learn how to regulate your nervous system and co-regulate those you love.  Full version.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "59:32"
}