{
  "id": "https://bibleinoneyear.org/en/youth/162",
  "title": "Day 162: God Even Uses Your Mistakes",
  "description": "Psalm 72:1,4–5,15b, 2 Samuel 17:5–7,14, Acts 7:20–25,30,33–37,38b.  *Even your mistakes* he uses for good  In all the circumstances of your life and the events going on around you, you can trust in the providence of God",
  "pubDate": "Fri, 11 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/162/?ignore",
  "itunes:duration": "14:04",
  "guid": "enyouth11062021-162",
  "length": 844.43,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 162: God Even Uses Your Mistakes",
  "itunes:subtitle": "Psalm 72:1,4–5,15b, 2 Samuel 17:5–7,14, Acts 7:20–25,30,33–37,38b.  *Even your mistakes* he uses for good  In all the circumstances of your life and the events going on around you, you can trust in the providence of God",
  "itunes:summary": "Handley Moule, when he was Bishop of Durham, had the task of visiting the relatives of 170 miners who had been killed in a mining accident. While he was wondering what to say to them, he picked up a little bookmark his mother had given him. As he held it up, on the reverse side of the handwoven bookmark there was a tangled web. There was no rhyme, no reason, no pattern, nothing. But on the other side it said, ‘God is love’.\nThe world sometimes seems to us like a tangled web. Often we cannot work out what is going on or why we are suffering in the way we are. But the claim of Jesus and the Scriptures is that behind it all is the love of God. Even though things may seem very difficult for us to understand now, God is working out his loving purposes in the world.\nGod can weave a pattern from the threads of our lives – including the suffering, heartaches and even our mistakes and make something beautiful. The apostle Paul tells us that ‘in all things God works for the good of those who love him, who have been called according to his purpose’ (Romans 8:28). Reflect today on the fact that, even though your situation may be challenging, God is weaving his purpose for your life.\nJob said, ‘You gave me life and showed me kindness, and in your providence watched over my spirit’ (Job 10:12). Everything that happens in this world is within the sphere of God’s working. ‘Providence’ means God’s foresight: the way he anticipates and prepares for the future. ‘Providence’ is the way God guides and steers human history – he is present and active in the world – sustaining it and ruling it.\nIt is also the way he guides and steers your life personally and individually. God has a specific, unique destiny for you. Sometimes this thought worries people: that they might somehow mess things up and miss out on God’s purpose. But that isn’t the case. Even your mistakes he uses for good. In all the circumstances of your life and the events going on around you, you can trust in the providence of God.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 162
}