{
  "title": "#26/Modernism Week 3: Annalisa Capurro & Brooke Hodge / Mark Davis & Aluminaire",
  "pubDate": "Mon, 15 May 2017 07:00:00 +0000",
  "guid": "92e455472a2f3c22f6bb68bb63e7d7ce",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM26a.mp3",
  "itunes:image": "",
  "description": "<p><span class=\"auto-style1\"><span class=\"auto-style10\">Host</span> <strong><span class=\"auto-style10\">George Smart</span></strong> <span class=\"auto-style10\">reports from February's Modernism Week in Palm Springs, the Mecca for all things Mid-Century Modernist!  He spoke poolside from the Hotel Skylark with keynote speakers from the week.</span></span><strong><br class= \"auto-style2\" /> <br class=\"auto-style2\" /> <span class=\"auto-style2\">Annalisa Capurro,</span></strong> <span class=\"auto-style2\">aka Ms. Modernism, is a interior designer, design educator, architectural historian, speaker, writer, preservationist, MCM photographer, and mid-century design afficionado who lives in the 1956 Russell Jack House in Sydney, Australia. She is an educator at Design Centre Enmore and the University of New South Wales. At Modernism Week 2017, she starred in SEXY & CULTURE, six presentations on surprising topics related to sexual mores in the MCM world. She love-love-loves the color orange.</span><strong><br class=\"auto-style2\" /> <br class=\"auto-style2\" /> <span class=\"auto-style2\">Brooke Hodge</span></strong> <span class= \"auto-style2\">is an architect, journalist, and blogger for the New York Times Style Magazine - and the Director of Architecture and Design at the Palm Springs Art Museum, overseeing their huge architectural assets including the Architecture and Design Center and the 1964 Albert Frey house. She's worked for some of the greatest names in design museums: the Cooper Hewitt Museum, the Hammer Museum, and the Museum of Contemporary Art in Los Angeles. She's also into Japan, California, juggling, modeling hats, and writing Mad Libs.</span> <strong><br class=\"auto-style2\" /> <br class=\"auto-style2\" /></strong> <span class= \"auto-style2\">Besides serving as Treasurer for Palm Springs Modernism Week, which is a huge job, <strong>Mark Davis</strong></span> <span class=\"auto-style2\">is Chair of the Aluminaire Foundation, dedicated to preserving, moving, and rebuilding Albert Frey's and Lawrence Kocher's iconic Aluminaire House from New York to Palm Springs.  Spoiler: they moved it.  Next challenge, getting it rebuilt.  <a href= \"http://www.aluminaire.org/\"><span class=\"auto-style22\">You can help</span></a>!</span></p>",
  "content:encoded": "<p>Host George Smart reports from February's Modernism Week in Palm Springs, the Mecca for all things Mid-Century Modernist!  He spoke poolside from the Hotel Skylark with keynote speakers from the week.  Annalisa Capurro, aka Ms. Modernism, is a interior designer, design educator, architectural historian, speaker, writer, preservationist, MCM photographer, and mid-century design afficionado who lives in the 1956 Russell Jack House in Sydney, Australia. She is an educator at Design Centre Enmore and the University of New South Wales. At Modernism Week 2017, she starred in SEXY & CULTURE, six presentations on surprising topics related to sexual mores in the MCM world. She love-love-loves the color orange.  Brooke Hodge is an architect, journalist, and blogger for the New York Times Style Magazine - and the Director of Architecture and Design at the Palm Springs Art Museum, overseeing their huge architectural assets including the Architecture and Design Center and the 1964 Albert Frey house. She's worked for some of the greatest names in design museums: the Cooper Hewitt Museum, the Hammer Museum, and the Museum of Contemporary Art in Los Angeles. She's also into Japan, California, juggling, modeling hats, and writing Mad Libs.   Besides serving as Treasurer for Palm Springs Modernism Week, which is a huge job, Mark Davis is Chair of the Aluminaire Foundation, dedicated to preserving, moving, and rebuilding Albert Frey's and Lawrence Kocher's iconic Aluminaire House from New York to Palm Springs.  Spoiler: they moved it.  Next challenge, getting it rebuilt.  <a href= \"http://www.aluminaire.org/\">You can help</a>!</p>",
  "enclosure": "",
  "itunes:duration": "41:46",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Host George Smart reports from February's Modernism Week in Palm Springs, the Mecca for all things Mid-Century Modernist!  He spoke poolside from the Hotel Skylark with keynote speakers from the week.  Annalisa Capurro, aka Ms. Modernism, is a...",
  "itunes:episodeType": "full"
}