{
  "title": "Episode 137: &#8220;Papa&#8217;s Got a Brand New Bag&#8221; by James Brown",
  "link": "https://500songs.com/podcast/episode-137-papas-got-a-brand-new-bag-by-james-brown/",
  "pubDate": "Mon, 15 Nov 2021 01:20:48 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=933",
  "description": "Episode one hundred and thirty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Papa's Got a Brand New Bag” by James Brown, and at how Brown went from a minor doo-wop artist to the pioneer of funk. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/58707466\">on \"I'm a Fool\" by Dino, Desi, and Billy</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>NB </strong>an early version of this was uploaded, in which I said \"episode 136\" rather than 137 and \"flattened ninth\" at one point rather than \"ninth\". I've fixed that in a new upload, which is otherwise unchanged.\n\n<strong>Resources</strong>\n\nAs usual, I’ve created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-137-papas-got-a-brand-new-bag/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI relied mostly on fur books for this episode. <a href=\"https://amzn.to/2YqB2ga\"><em>James Brown: The Godfather of Soul</em></a>, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\n<a href=\"https://amzn.to/2Jm29D4\"><em>Kill ‘Em and Leave: Searching for the Real James Brown</em></a>, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\n<a href=\"https://amzn.to/3wM0C1g\"><em>Black and Proud: The Life of James Brown</em></a> by Geoff Brown is a more traditional objective biography.\n\n<a href=\"https://amzn.to/3ChobAe\">And Douglas Wolk's 33 1/3 book on <em>Live at the Apollo</em></a> is a fascinating, detailed, look at that album.\n\n<a href=\"https://amzn.to/3Dj6RvN\">This box set</a> is the best collection of Brown's work there is, but is out of print. <a href=\"https://amzn.to/3wJbAoh\">This two-CD set</a> has all the essential hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\n[Introduction, the opening of Live at the Apollo. \"So now, ladies and gentlemen, it is star time. Are you ready for star time? [Audience cheers, and gives out another cheer with each musical sting sting] Thank you, and thank you very kindly. It is indeed a great pleasure to present to you in this particular time, national and international known as the hardest working man in showbusiness, Man that sing \"I'll Go Crazy\"! [sting] \"Try Me\" [sting] \"You've Got the Power\" [sting] \"Think\" [sting], \"If You Want Me\" [sting] \"I Don't Mind\" [sting] \"Bewildered\" [sting] million-dollar seller \"Lost Someone\" [sting], the very latest release, \"Night Train\" [sting] Let's everybody \"Shout and Shimmy\" [sting] Mr. Dynamite, the amazing Mr. Please Please himself, the star of the show, James Brown and the Famous Flames\"]\n\nIn 1951, the composer John Cage entered an anechoic chamber at Harvard University. An anechoic chamber is a room that's been completely soundproofed, so no sound can get in from the outside world, and in which the walls, floor, and ceiling are designed to absorb any sounds that are made. It's as close as a human being can get to experiencing total silence. When Cage entered it, he expected that to be what he heard -- just total silence. Instead, he heard two noises, a high-pitched one and a low one. Cage was confused by this -- why hadn't he heard the silence? The engineer in charge of the chamber explained to him that what he was hearing was himself -- the high-pitched noise was Cage's nervous system, and the low-pitched one was his circulatory system.\n\nCage later said about this, \"Until I die there will be sounds. And they will continue following my death. One need not fear about the future of music.\"\n\nThe experience inspired him to write his most famous piece, 4'33, in which a performer attempts not to make any sound for four minutes and thirty-three seconds. The piece is usually described as being four minutes and thirty-three seconds of silence, but it actually isn't -- the whole point is that there is no silence, and that the audience is meant to listen to the ambient noise and appreciate that noise as music.\n\nHere is where I would normally excerpt the piece, but of course for 4'33 to have its full effect, one has to listen to the whole thing.\n\nBut I can excerpt another piece Cage wrote. Because on October the twenty-fourth 1962 he wrote a sequel to 4'33, a piece he titled 0'00, but which is sometimes credited as \"4'33 no. 2\". He later reworked the piece, but the original score, which is dedicated to two avant-garde Japanese composers, Toshi Ichiyanagi and his estranged wife Yoko Ono, reads as follows:\n\n\"In a situation provided with maximum amplification (no feedback), perform a disciplined action.\"\n\nNow, as it happens, we have a recording of someone else performing Cage's piece, as written, on the day it was written, though neither performer nor composer were aware that that was what was happening. But I'm sure everyone can agree that this recording from October the 24th, 1962, is a disciplined action performed with maximum amplification and no feedback:\n\n[Excerpt: James Brown, \"Night Train\" (Live at the Apollo version)]\n\nWhen we left James Brown, almost a hundred episodes ago, he had just had his first R&B number one, with \"Try Me\", and had performed for the first time at the venue with which he would become most associated, the Harlem Apollo, and had reconnected with the mother he hadn't seen since he was a small child. But at that point, in 1958, he was still just the lead singer of a doo-wop group, one of many, and there was nothing in his shows or his records to indicate that he was going to become anything more than that, nothing to distinguish him from King Records labelmates like Hank Ballard, who made great records, put on a great live show, and are still remembered more than sixty years later, but mostly as a footnote.\n\nToday we're going to look at the process that led James Brown from being a peer of Ballard or Little Willie John to being arguably the single most influential musician of the second half of the twentieth century. Much of that influence is outside rock music, narrowly defined, but the records we're going to look at this time and in the next episode on Brown are records without which the entire sonic landscape of the late twentieth and early twenty-first centuries would be unimaginably different.\n\nAnd that process started in 1958, shortly after the release of \"Try Me\" in October that year, with two big changes to Brown's organisation. The first was that this was -- at least according to Brown -- when he first started working with Universal Attractions, a booking agency run by a man named Ben Bart, who before starting his own company had spent much of the 1940s working for Moe Gale, the owner of the Savoy Ballroom and manager of the Ink Spots, Louis Jordan, and many of the other acts we looked at in the very first episodes of this podcast.\n\nBart had started his own agency in 1945, and had taken the Ink Spots with him, though they'd returned to Gale a few years later, and he'd been responsible for managing the career of the Ravens, one of the first bird groups:\n\n[Excerpt: The Ravens, \"Rock Me All Night Long\"]\n\nIn the fifties, Bart had become closely associated with King Records, the label to which Brown and the Famous Flames were signed. A quick aside here -- Brown's early records were released on Federal Records, and later they switched to being released on King, but Federal was a subsidiary label for King, and in the same way that I don't distinguish between Checker and Chess, Tamla and Motown, or Phillips and Sun, I'll just refer to King throughout. Bart and Universal Attractions handled bookings for almost every big R&B act signed by King, including Tiny Bradshaw, Little Willie John, the \"5\" Royales, and Hank Ballard and the Midnighters.\n\nAccording to some sources, the Famous Flames signed with Universal Attractions at the same time they signed with King Records, and Bart's family even say it was Bart who discovered them and got them signed to King in the first place. Other sources say they didn't sign with Universal until after they'd proved themselves on the charts. But everyone seems agreed that 1958 was when Bart started making Brown a priority and taking an active interest in his career. Within a few years, Bart would have left Universal, handing the company over to his son and a business partner, to devote himself full-time to managing Brown, with whom he developed an almost father-son relationship.\n\nWith Bart behind them, the Famous Flames started getting better gigs, and a much higher profile on the chitlin circuit. But around this time there was another change that would have an even more profound effect.\n\nUp to this point, the Famous Flames had been like almost every other vocal group playing the chitlin' circuit, in that they hadn't had their own backing musicians. There were exceptions, but in general vocal groups would perform with the same backing band as every other act on a bill -- either a single backing band playing for a whole package tour, or a house band at the venue they were playing at who would perform with every act that played that venue. There would often be a single instrumentalist with the group, usually a guitarist or piano player, who would act as musical director to make sure that the random assortment of musicians they were going to perform with knew the material.\n\nThis was, for the most part, how the Famous Flames had always performed, though they had on occasion also performed their own backing in the early days. But now they got their own backing band, centred on J.C. Davis as sax player and bandleader, Bobby Roach on guitar, Nat Kendrick on drums, and Bernard Odum on bass. Musicians would come and go, but this was the core original lineup of what became the James Brown Band. Other musicians who played with them in the late fifties were horn players Alfred Corley and Roscoe Patrick, guitarist Les Buie, and bass player Hubert Perry, while keyboard duties would be taken on by Fats Gonder, although James Brown and Bobby Byrd would both sometimes play keyboards on stage.\n\nAt this point, as well, the lineup of the Famous Flames became more or less stable. As we discussed in the previous episode on Brown, the original lineup of the Famous Flames had left en masse when it became clear that they were going to be promoted as James Brown and the Famous Flames, with Brown getting more money, rather than as a group. Brown had taken on another vocal group, who had previously been Little Richard's backing vocalists, but shortly after \"Try Me\" had come out, but before they'd seen any money from it, that group had got into an argument with Brown over money he owed them. He dropped them, and they went off to record unsuccessfully as the Fabulous Flames on a tiny label, though the records they made, like \"Do You Remember\", are quite good examples of their type:\n\n[Excerpt: The Fabulous Flames, \"Do You Remember?\"]\n\nBrown pulled together a new lineup of Famous Flames, featuring two of the originals. Johnny Terry had already returned to the group earlier, and stayed when Brown sacked the rest of the second lineup of Flames, and they added Lloyd Bennett and Bobby Stallworth. And making his second return to the group was Bobby Byrd, who had left with the other original members, joined again briefly, and then left again.\n\nOddly, the first commercial success that Brown had after these lineup changes was not with the Famous Flames, or even under his own name. Rather, it was under the name of his drummer, Nat Kendrick.\n\nBrown had always seen himself, not primarily as a singer, but as a band leader and arranger. He was always a jazz fan first and foremost, and he'd grown up in the era of the big bands, and musicians he'd admired growing up like Lionel Hampton and Louis Jordan had always recorded instrumentals as well as vocal selections, and Brown saw himself very much in that tradition. Even though he couldn't read music, he could play several instruments, and he could communicate his arrangement ideas, and he wanted to show off the fact that he was one of the few R&B musicians with his own tight band.\n\nThe story goes that Syd Nathan, the owner of King Records, didn't like the idea, because he thought that the R&B audience at this point only wanted vocal tracks, and also because Brown's band had previously released an instrumental which hadn't sold. Now, this is a definite pattern in the story of James Brown -- it seems that at every point in Brown's career for the first decade, Brown would come up with an idea that would have immense commercial value, Nathan would say it was the most ridiculous thing he'd ever heard, Brown would do it anyway, and Nathan would later admit that he was wrong.\n\nThis is such a pattern -- it apparently happened with \"Please Please Please\", Brown's first hit, *and* \"Try Me\", Brown's first R&B number one, and we'll see it happen again later in this episode -- that one tends to suspect that maybe these stories were sometimes made up after the fact, especially since Syd Nathan somehow managed to run a successful record label for over twenty years, putting out some of the best R&B and country records from everyone from Moon Mullican to Wynonie Harris, the Stanley Brothers to Little Willie John, while if these stories are to be believed he was consistently making the most boneheaded, egregious, uncommercial decisions imaginable.\n\nBut in this case, it seems to be at least mostly true, as rather than being released on King Records as by James Brown, \"(Do the) Mashed Potatoes\" was released on Dade Records as by Nat Kendrick and the Swans, with the DJ Carlton Coleman shouting vocals over Brown's so it wouldn't be obvious Brown was breaking his contract:\n\n[Excerpt: Nat Kendrick and the Swans, \"(Do the)\" Mashed Potatoes\"]\n\nThat made the R&B top ten,  and I've seen reports that Brown and his band even toured briefly as Nat Kendrick and the Swans, before Syd Nathan realised his mistake, and started allowing instrumentals to be released under the name \"James Brown presents HIS BAND\", starting with a cover of Bill Doggett's \"Hold It\":\n\n[Excerpt: James Brown Presents HIS BAND, \"Hold It\"]\n\nAfter the Nat Kendrick record gave Brown's band an instrumental success, the Famous Flames also came back from another mini dry spell for hits, with the first top twenty R&B hit for the new lineup, \"I'll Go Crazy\", which was followed shortly afterwards by their first pop top forty hit, \"Think!\":\n\n[Excerpt: James Brown and the Famous Flames, \"Think!\"]\n\nThe success of \"Think!\" is at least in part down to Bobby Byrd, who would from this point on be Brown's major collaborator and (often uncredited) co-writer and co-producer until the mid-seventies.\n\nAfter leaving the Flames, and before rejoining them, Byrd had toured for a while with his own group, but had then gone to work for King Records at the request of Brown. King Records' pressing plant had equipment that sometimes produced less-than-ideal pressings of records, and Brown had asked Byrd to take a job there performing quality control, making sure that Brown's records didn't skip.\n\nWhile working there, Byrd also worked as a song doctor. His job was to take songs that had been sent in as demos, and rework them in the style of some of the label's popular artists, to make them more suitable, changing a song so it might fit the style of the \"5\" Royales or Little Willie John or whoever, and Byrd had done this for \"Think\", which had originally been recorded by the \"5\" Royales, whose leader, Lowman Pauling, had written it:\n\n[Excerpt: The \"5\" Royales, \"Think\"]\n\nByrd had reworked the song to fit Brown's style and persona. It's notable for example that the Royales sing \"How much of all your happiness have I really claimed?/How many tears have you cried for which I was to blame?/Darlin’, I can’t remember which was my fault/I tried so hard to please you—at least that’s what I thought.”\n\nBut in Brown's version this becomes “How much of your happiness can I really claim?/How many tears have you shed for which you was to blame?/Darlin’, I can’t remember just what is wrong/I tried so hard to please you—at least that’s what I thought.”\n\n[Excerpt: James Brown and the Famous Flames, \"Think\"]\n\nIn Brown's version, nothing is his fault, he's trying to persuade an unreasonable woman who has some problem he doesn't even understand, but she needs to think about it and she'll see that he's right, while in the Royales' version they're acknowledging that they're at fault, that they've done wrong, but they didn't *only* do wrong and maybe she should think about that too. It's only a couple of words' difference, but it changes the whole tenor of the song.\n\n\"Think\" would become the Famous Flames' first top forty hit on the pop charts, reaching number thirty-three. It went top ten on the R&B charts, and between 1959 and 1963 Brown and the Flames would have fifteen top-thirty R&B hits, going from being a minor doo-wop group that had had a few big hits to being consistent hit-makers, who were not yet household names, but who had a consistent sound that could be guaranteed to make the R&B charts, and who put on what was regarded as the best live show of any R&B band in the world.\n\nThis was partly down to the type of discipline that Brown imposed on his band. Many band-leaders in the R&B world would impose fines on their band members, and Johnny Terry suggested that Brown do the same thing. As Bobby Byrd put it, \"Many band leaders do it but it was Johnny’s idea to start it with us and we were all for it ‘cos we didn’t want to miss nothing. We wanted to be immaculate, clothes-wise, routine-wise and everything. Originally, the fines was only between James and us, The Famous Flames, but then James carried it over into the whole troupe. It was still a good idea because anybody joining The James Brown Revue had to know that they couldn’t be messing up, and anyway, all the fines went into a pot for the parties we had.\"\n\nBut Brown went much further with these fines than any other band leader, and would also impose them arbitrarily, and it became part of his reputation that he was the strictest disciplinarian in rhythm and blues music. One thing that became legendary among musicians was the way that he would impose fines while on stage. If a band member missed a note, or a dance step, or missed a cue, or had improperly polished shoes, Brown would, while looking at them, briefly make a flashing gesture with his hand, spreading his fingers out for a fraction of a second. To the audience, it looked like just part of Brown's dance routine, but the musician knew he had just been fined five dollars. Multiple flashes meant multiples of five dollars fined.\n\nBrown also developed a whole series of other signals to the band, which they had to learn, To quote Bobby Byrd again:\n\n\"James didn’t want anybody else to know what we was doing, so he had numbers and certain screams and spins. There was a certain spin he’d do and if he didn’t do the complete spin you’d know it was time to go over here. Certain screams would instigate chord changes, but mostly it was numbers. James would call out football numbers, that’s where we got that from. Thirty-nine — Sixteen —Fourteen — Two — Five — Three — Ninety-eight, that kind of thing. Number thirty-nine was always the change into ‘Please, Please, Please’. Sixteen is into a scream and an immediate change, not bam-bam but straight into something else. If he spins around and calls thirty-six, that means we’re going back to the top again. And the forty-two, OK, we’re going to do this verse and then bow out, we’re leaving now. It was amazing.\"\n\nThis, or something like this, is a fairly standard technique among more autocratic band leaders, a way of allowing the band as a whole to become a live compositional or improvisational tool for their leader, and Frank Zappa, for example, had a similar system. It requires the players to subordinate themselves utterly to the whim of the band leader, but also requires a band leader who knows the precise strengths and weaknesses of every band member and how they are likely to respond to a cue. When it works well, it can be devastatingly effective, and it was for Brown's live show.\n\nThe Famous Flames shows soon became a full-on revue, with other artists joining the bill and performing with Brown's band. From the late 1950s on, Brown would always include a female singer. The first of these was Sugar Pie DeSanto, a blues singer who had been discovered (and given her stage name) by Johnny Otis, but DeSanto soon left Brown's band and went on to solo success on Chess records, with hits like \"Soulful Dress\":\n\n[Excerpt: Sugar Pie DeSanto, \"Soulful Dress\"]\n\nAfter DeSanto left, she was replaced by  Bea Ford, the former wife of the soul singer Joe Tex, with whom Brown had an aggressive rivalry and mutual loathing. Ford and Brown recorded together, cutting tracks like \"You Got the Power\":\n\n[Excerpt: James Brown and Bea Ford, \"You Got the Power\"]\n\nHowever, Brown and Ford soon fell out, and Brown actually wrote to Tex asking if he wanted his wife back. Tex's response was to record this:\n\n[Excerpt: Joe Tex, \"You Keep Her\"]\n\nFord's replacement was Yvonne Fair, who had briefly replaced Jackie Landry in the Chantels for touring purposes when Landry had quit touring to have a baby. Fair would stay with Brown for a couple of years, and would release a number of singles written and produced for her by Brown, including one which Brown would later rerecord himself with some success:\n\n[Excerpt: Yvonne Fair, \"I Found You\"]\n\nFair would eventually leave the band after getting pregnant with a child by Brown, who tended to sleep with the female singers in his band. The last shows she played with him were the shows that would catapult Brown into the next level of stardom.\n\nBrown had been convinced for a long time that his live shows had an energy that his records didn't, and that people would buy a record of one of them. Syd Nathan, as usual, disagreed. In his view the market for R&B albums was small, and only consisted of people who wanted collections of hit singles they could play in one place. Nobody would buy a James Brown live album.\n\nSo Brown decided to take matters into his own hands. He decided to book a run of shows at the Apollo Theatre, and record them, paying for the recordings with his own money. This was a week-long engagement, with shows running all day every day -- Brown and his band would play five shows a day, and Brown would wear a different suit for every show.\n\nThis was in October 1962, the month that we've already established as the month the sixties started -- the month the Beatles released their first single, the Beach Boys released their first record outside the US, and the first Bond film came out, all on the same day at the beginning of the month. By the end of October, when Brown appeared at the Apollo, the Cuban Missile Crisis was at its height, and there were several points during the run where it looked like the world itself might not last until November 62.\n\nDouglas Wolk has written an entire book on the live album that resulted, which claims to be a recording of the midnight performance from October the twenty-fourth, though it seems like it was actually compiled from multiple performances. The album only records the headline performance, but Wolk describes what a full show by the James Brown Revue at the Apollo was like in October 1962, and the following description is indebted to his book, which I'll link in the show notes.\n\nThe show would start with the \"James Brown Orchestra\" -- the backing band. They would play a set of instrumentals, and a group of dancers called the Brownies would join them:\n\n[Excerpt: James Brown Presents His Band, \"Night Flying\"]\n\nAt various points during the set, Brown himself would join the band for a song or two, playing keyboards or drums. After the band's instrumental set, the Valentinos would take the stage for a few songs. This was before they'd been taken on by Sam Cooke, who would take them under his wing very soon after these shows, but the Valentinos were already recording artists in their own right, and had recently released \"Lookin' For a Love\":\n\n[Excerpt: The Valentinos, \"Lookin' For a Love\"]\n\nNext up would be Yvonne Fair, now visibly pregnant with her boss' child, to sing her few numbers:\n\n[Excerpt: Yvonne Fair, \"You Can Make it if You Try\"]\n\nFreddie King was on next, another artist for the King family of labels who'd had a run of R&B hits the previous year, promoting his new single \"I'm On My Way to Atlanta\":\n\n[Excerpt: Freddie King, \"I'm on My Way to Atlanta\"]\n\nAfter King came Solomon Burke, who had been signed to Atlantic earlier that year and just started having hits, and was the new hot thing on the scene, but not yet the massive star he became:\n\n[Excerpt: Solomon Burke, \"Cry to Me\"]\n\nAfter Burke came a change of pace -- the vaudeville comedian Pigmeat Markham would take the stage and perform a couple of comedy sketches. We actually know exactly how these went, as Brown wasn't the only one recording a live album there that week, and Markham's album \"The World's Greatest Clown\" was a result of these shows and released on Chess Records:\n\n[Excerpt: Pigmeat Markham, \"Go Ahead and Sing\"]\n\nAnd after Markham would come the main event. Fats Gonder, the band's organist, would give the introduction we heard at the beginning of the episode -- and backstage, Danny Ray, who had been taken on as James Brown's valet that very week (according to Wolk -- I've seen other sources saying he'd joined Brown's organisation in 1960), was listening closely. He would soon go on to take over the role of MC, and would introduce Brown in much the same way as Gonder had at every show until Brown's death forty-four years later.\n\nThe live album is an astonishing tour de force, showing Brown and his band generating a level of excitement that few bands then or now could hope to equal. It's even more astonishing when you realise two things. The first is that this was *before* any of the hits that most people now associate with the name James Brown -- before \"Papa's Got a Brand New Bag\" or \"Sex Machine\", or \"It's a Man's Man's Man's World\" or \"Say it Loud I'm Black and I'm Proud\" or \"Funky Drummer\" or \"Get Up Offa That Thing\". It's still an *unformed* James Brown, only six years into a fifty-year career, and still without most of what made him famous.\n\nThe other thing is, as Wolk notes, if you listen to any live bootleg recordings from this time, the microphone distorts all the time, because Brown is singing so loud. Here, the vocal tone is clean, because Brown knew he was being recorded. This is the sound of James Brown restraining himself:\n\n[Excerpt: James Brown and the Famous Flames, \"Night Train\" (Live at the Apollo version)]\n\nThe album was released a few months later, and proved Syd Nathan's judgement utterly, utterly, wrong. It became the thirty-second biggest selling album of 1963 -- an amazing achievement given that it was released on a small independent label that dealt almost exclusively in singles, and which had no real presence in the pop market. The album spent sixty-six weeks on the album charts, making number two on the charts -- the pop album charts, not R&B charts. There wasn't an R&B albums chart until 1965, and Live at the Apollo basically forced Billboard to create one, and more or less single-handedly created the R&B albums market. It was such a popular album in 1963 that DJs took to playing the whole album -- breaking for commercials as they turned the side over, but otherwise not interrupting it. It turned Brown from merely a relatively big R&B star into a megastar.\n\nBut oddly, given this astonishing level of success, Brown's singles in 1963 were slightly less successful than they had been in the previous few years -- possibly partly because he decided to record a few versions of old standards, changing direction as he had for much of his career. Johnny Terry quit the Famous Flames, to join the Drifters, becoming part of the lineup that recorded \"Under the Boardwalk\" and \"Saturday Night at the Movies\". Brown also recorded a second live album, Pure Dynamite!, which is generally considered a little lacklustre in comparison to the Apollo album.\n\nThere were other changes to the lineup as well as Terry leaving. Brown wanted to hire a new drummer, Melvin Parker, who agreed to join the band, but only if Brown took on his sax-playing brother, Maceo, along with him. Maceo soon became one of the most prominent musicians in Brown's band, and his distinctive saxophone playing is all over many of Brown's biggest hits.\n\nThe first big hit that the Parkers played on was released as by James Brown and his Orchestra, rather than James Brown and the Famous Flames, and was a landmark in Brown's evolution as a musician:\n\n[Excerpt: James Brown and his Orchestra, \"Out of Sight\"]\n\nThe Famous Flames did sing on the B-side of that, a song called \"Maybe the Last Time\", which was ripped off from the same Pops Staples song that the Rolling Stones later ripped off for their own hit single. But that would be the last time Brown would use them in the studio -- from that point on, the Famous Flames were purely a live act, although Bobby Byrd, but not the other members, would continue to sing on the records.\n\nThe reason it was credited to James Brown, rather than to James Brown and the Famous Flames, is that \"Out of Sight\" was released on Smash Records, to which Brown -- but not the Flames -- had signed a little while earlier. Brown had become sick of what he saw as King Records' incompetence, and had found what he and his advisors thought was a loophole in his contract. Brown had been signed to King Records under a personal services contract as a singer, not under a musician contract as a musician, and so they believed that he could sign to Smash, a subsidiary of Mercury, as a musician. He did, and he made what he thought of as a fresh start on his new label by recording \"Caldonia\", a cover of a song by his idol Louis Jordan:\n\n[Excerpt: James Brown and his Orchestra, \"Caldonia\"]\n\nUnderstandably, King Records sued on the reasonable grounds that Brown was signed to them as a singer, and they got an injunction to stop him recording for Smash -- but by the time the injunction came through, Brown had already released two albums and three singles for the label. The injunction prevented Brown from recording any new material for the rest of 1964, though both labels continued to release stockpiled material during that time.\n\nWhile he was unable to record new material, October 1964 saw Brown's biggest opportunity to cross over to a white audience -- the TAMI Show:\n\n[Excerpt: James Brown, \"Out of Sight (TAMI show live)\"]\n\nWe've mentioned the TAMI show a couple of times in previous episodes, but didn't go into it in much detail. It was a filmed concert which featured Jan and Dean, the Barbarians, Lesley Gore, Chuck Berry, the Beach Boys, Gerry and the Pacemakers, Billy J Kramer and the Dakotas, Marvin Gaye, the Miracles, the Supremes, and, as the two top acts, James Brown and the Rolling Stones.\n\nRather oddly, the point of the TAMI Show wasn't the music as such. Rather it was intended as a demonstration of a technical process.\n\nBefore videotape became cheap and a standard, it was difficult to record TV shows for later broadcast, for distribution to other countries, or for archive. The way they used to be recorded was a process known as telerecording in the UK and kinescoping in the US, and that was about as crude as it's possible to get -- you'd get a film camera, point it at a TV showing the programme you wanted to record, and film the TV screen. There was specialist equipment to do this, but that was all it actually did. Almost all surviving TV from the fifties and sixties -- and even some from the seventies -- was preserved by this method rather than by videotape. Even after videotape started being used to make the programmes, there were differing standards and tapes were expensive, so if you were making a programme in the UK and wanted a copy for US broadcast, or vice versa, you'd make a telerecording.\n\nBut what if you wanted to make a TV show that you could also show on cinema screens? If you're filming a TV screen, and then you project that film onto a big screen, you get a blurry, low-resolution, mess -- or at least you did with the 525-line TV screens that were used in the US at the time.\n\nSo a company named Electronovision came into the picture, for those rare times when you wanted to do something using video cameras that would be shown at the cinema. Rather than shoot in 525-line resolution, their cameras shot in 819-line resolution -- super high definition for the time, but capable of being recorded onto standard videotape with appropriate modifications for the equipment. But that meant that when you kinescoped the production, it was nearly twice the resolution that a standard US TV broadcast would be, and so it didn't look terrible when shown in a cinema.\n\nThe owner of the Electronovision process had had a hit with a cinema release of a performance by Richard Burton as Hamlet, and he needed a follow-up, and decided that another filmed live performance would be the best way to make use of his process -- TV cameras were much more useful for capturing live performances than film cameras, for a variety of dull technical reasons, and so this was one of the few areas where Electronovision might actually be useful.\n\nAnd so Bill Roden, one of the heads of Electronovision, turned to a TV director named Steve Binder, who was working at the time on the Steve Allen show, one of the big variety shows, second only to Ed Sullivan, and who would soon go on to direct Hullaballoo. Roden asked Binder to make a concert film, shot on video, which would be released on the big screen by American International Pictures (the same organisation with which David Crosby's father worked so often).\n\nBinder had contacts with West Coast record labels, and particularly with Lou Adler's organisation, which managed Jan and Dean. He also had been in touch with a promoter who was putting on a package tour of British musicians. So they decided that their next demonstration of the capabilities of the equipment would be a show featuring performers from \"all over the world\", as the theme song put it -- by which they meant all over the continental United States plus two major British cities. For those acts who didn't have their own bands -- or whose bands needed augmenting -- there was an orchestra, centred around members of the Wrecking Crew, conducted by Jack Nitzsche, and the Blossoms were on hand to provide backing vocals where required. Jan and Dean would host the show and sing the theme song.\n\nJames Brown had had less pop success than any of the other artists on the show except for the Barbarians, who are now best-known for their appearances on the Nuggets collection of relatively obscure garage rock singles, and whose biggest hit, \"Are You a Boy or Are You a Girl?\" only went to number fifty-five on the charts:\n\n[Excerpt: The Barbarians, \"Are You a Boy or Are You a Girl?\"]\n\nThe Barbarians were being touted as the American equivalent of the Rolling Stones, but the general cultural moment of the time can be summed up by that line \"You're either a girl or you come from Liverpool\" -- which was where the Rolling Stones came from. Or at least, it was where Americans seemed to think they came from given both that song, and the theme song of the TAMI show, written by P.F. Sloan and Steve Barri, which sang about “the Rolling Stones from Liverpool”, and also referred to Brown as \"the king of the blues\":\n\n[Excerpt: Jan and Dean, \"Here They Come From All Over The World\"]\n\nBut other than the Barbarians, the TAMI show was one of the few places in which all the major pop music movements of the late fifties and early sixties could be found in one place -- there was the Merseybeat of Gerry and the Pacemakers and the Dakotas, already past their commercial peak but not yet realising it, the fifties rock of Chuck Berry, who actually ended up performing one song with Gerry and the Pacemakers:\n\n[Excerpt: Chuck Berry and Gerry and the Pacemakers: \"Maybellene\"]\n\nAnd there was the Brill Building pop of Lesley Gore, the British R&B of the Rolling Stones right at the point of their breakthrough, the vocal surf music of the Beach Boys and Jan and Dean, and three of the most important Motown acts, with Brown the other representative of soul on the bill.\n\nBut the billing was a sore point. James Brown's manager insisted that he should be the headliner of the show, and indeed by some accounts the Rolling Stones also thought that they should probably not try to follow him -- though other accounts say that the Stones were equally insistent that they *must* be the headliners. It was a difficult decision, because Brown was much less well known, but it was eventually decided that the Rolling Stones would go on last.\n\nMost people talking about the event, including most of those involved with the production, have since stated that this was a mistake, because nobody could follow James Brown, though in interviews Mick Jagger has always insisted that the Stones didn't have to follow Brown, as there was a recording break between acts and they weren't even playing to the same audience -- though others have disputed that quite vigorously. But what absolutely everyone has agreed is that Brown gave the performance of a lifetime, and that it was miraculously captured by the cameras.\n\nI say its capture was miraculous because every other act had done a full rehearsal for the TV cameras, and had had a full shot-by-shot plan worked out by Binder beforehand. But according to Steve Binder -- though all the accounts of the show are contradictory -- Brown refused to do a rehearsal -- so even though he had by far the most complex and choreographed performance of the event, Binder and his camera crew had to make decisions by pure instinct, rather than by having an actual plan they'd worked out in advance of what shots to use.\n\nThis is one of the rare times when I wish this was a video series rather than a podcast, because the visuals are a huge part of this performance -- Brown is a whirlwind of activity, moving all over the stage in a similar way to Jackie Wilson, one of his big influences, and doing an astonishing gliding dance step in which he stands on one leg and moves sideways almost as if on wheels. The full performance is easily findable online, and is well worth seeking out. But still, just hearing the music and the audience's reaction can give some insight:\n\n[Excerpt: James Brown, \"Out of Sight\" (TAMI Show)]\n\nThe Rolling Stones apparently watched the show in horror, unable to imagine following that -- though when they did, the audience response was fine:\n\n[Excerpt: The Rolling Stones, \"Around and Around\"]\n\nIncidentally, Chuck Berry must have been quite pleased with his payday from the TAMI Show, given that as well as his own performance the Stones did one of his songs, as did Gerry and the Pacemakers, as we heard earlier, and the Beach Boys did \"Surfin' USA\" for which he had won sole songwriting credit.\n\nAfter the TAMI Show, Mick Jagger would completely change his attitude to performing, and would spend the rest of his career trying to imitate Brown's performing style. He was unsuccessful in this, but still came close enough that he's still regarded as one of the great frontmen, nearly sixty years later.\n\nBrown kept performing, and his labels kept releasing material, but he was still not allowed to record, until in early 1965 a court reached a ruling -- yes, Brown wasn't signed as a musician to King Records, so he was perfectly within his rights to record with Smash Records. As an instrumentalist. But Brown *was* signed to King Records as a singer, so he was obliged to record vocal tracks for them, and only for them. So until his contract with Smash lapsed, he had to record twice as much material -- he had to keep recording instrumentals, playing piano or organ, for Smash, while recording vocal tracks for King Records.\n\nHis first new record, released as by \"James Brown\" rather than the earlier billings of \"James Brown and his Orchestra\" or \"James Brown and the Famous Flames\", was for King, and was almost a remake of \"Out of Sight\", his hit for Smash Records. But even so, \"Papa's Got a Brand New Bag\" was a major step forward, and is often cited as the first true funk record.\n\nThis is largely because of the presence of a new guitarist in Brown's band.\n\nJimmy Nolen had started out as a violin player, but like many musicians in the 1950s he had been massively influenced by T-Bone Walker, and had switched to playing guitar. He was discovered as a guitarist by the bluesman Jimmy Wilson, who had had a minor hit with \"Tin Pan Alley\":\n\n[Excerpt: Jimmy Wilson, \"Tin Pan Alley\"]\n\nWilson had brought Nolen to LA, where he'd soon parted from Wilson and started working with a whole variety of bandleaders. His first recording came with Monte Easter on Aladdin Records:\n\n[Excerpt: Monte Easter, \"Blues in the Evening\"]\n\nAfter working with Easter, he started recording with Chuck Higgins, and also started recording by himself. At this point, Nolen was just one of many West Coast blues guitarists with a similar style, influenced by T-Bone Walker -- he was competing with Pete \"Guitar\" Lewis, Johnny \"Guitar\" Watson, and Guitar Slim, and wasn't yet quite as good as any of them. But he was still making some influential records. His version of \"After Hours\", for example, released under his own name on Federal Records, was a big influence on Roy Buchanan, who would record several versions of the standard based on Nolen's arrangement:\n\n[Excerpt: Jimmy Nolen, \"After Hours\"]\n\nNolen had released records on many labels, but his most important early association came from records he made but didn't release. In the mid-fifties, Johnny Otis produced a couple of tracks by Nolen, for Otis' Dig Records label, but they weren't released until decades later:\n\n[Excerpt: Jimmy Nolen, \"Jimmy's Jive\"]\n\nBut when Otis had a falling out with his longtime guitar player Pete \"Guitar\" Lewis, who was one of the best players in LA but who was increasingly becoming unreliable due to his alcoholism, Otis hired Nolen to replace him. It's Nolen who's playing on most of the best-known recordings Otis made in the late fifties, like \"Casting My Spell\":\n\n[Excerpt: Johnny Otis, \"Casting My Spell\"]\n\nAnd of course Otis' biggest hit \"Willie and the Hand Jive\":\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nNolen left Otis after a few years, and spent the early sixties mostly playing in scratch bands backing blues singers, and not recording. It was during this time that Nolen developed the style that would revolutionise music. The style he developed was unique in several different ways. The first was in Nolen's choice of chords. We talked last week about how Pete Townshend's guitar playing became based on simplifying chords and only playing power chords. Nolen went the other way -- while his voicings often only included two or three notes, he was also often using very complex chords with *more* notes than a standard chord. As we discussed last week, in most popular music, the chords are based around either major or minor triads -- the first, third, and fifth notes of a scale, so you have an E major chord, which is the notes E, G sharp, and B:\n\n[Excerpt: E major chord]\n\nIt's also fairly common to have what are called seventh chords, which are actually a triad with an added flattened seventh, so an E7 chord would be the notes E, G sharp, B, and D:\n\n[Excerpt: E7 chord]\n\nBut Nolen built his style around dominant ninth chords, often just called ninth chords. Dominant ninth chords are mostly thought of as jazz chords because they're mildly dissonant. They consist of the first, third, fifth, flattened seventh, *and* ninth of a scale, so an E9 would be the notes E, G sharp, B, D, and F sharp:\n\n[Excerpt: E9 chord]\n\nAnother way of looking at that is that you're playing both a major chord *and* at the same time a minor chord that starts on the fifth note, so an E major and B minor chord at the same time:\n\n[Demonstrates Emajor, B minor, E9]\n\nIt's not completely unknown for pop songs to use ninth chords, but it's very rare. Probably the most prominent example came from a couple of years after the period we're talking about, when in mid-1967 Bobby Gentry basically built the whole song \"Ode to Billie Joe\" around a D9 chord, barely ever moving off it:\n\n[Excerpt: Bobby Gentry, \"Ode to Billie Joe\"]\n\nThat shows the kind of thing that ninth chords are useful for -- because they have so many notes in them, you can just keep hammering on the same chord for a long time, and the melody can go wherever it wants and will fit over it. The record we're looking at, \"Papa's Got a Brand New Bag\", actually has three chords in it -- it's basically a twelve-bar blues, like \"Out of Sight\" was, just with these ninth chords sometimes used instead of more conventional chords -- but as Brown's style got more experimental in future years, he would often build songs with no chord changes at all, just with Nolen playing a single ninth chord throughout. There's a possibly-apocryphal story, told in a few different ways, but the gist of which is that when auditioning Nolen's replacement many years later, Brown asked \"Can you play an E ninth chord?\"\n\n\"Yes, of course\" came the reply.\n\n\"But can you play an E ninth chord *all night*?\"\n\nThe reason Brown asked this, if he did, is that playing like Nolen is *extremely* physically demanding. Because the other thing about Nolen's style is that he was an extremely percussive player. In his years backing blues musicians, he'd had to play with many different drummers, and knew they weren't always reliable timekeepers. So he'd started playing like a drummer himself, developing a technique called chicken-scratching, based on the Bo Diddley style he'd played with Otis, where he'd often play rapid, consistent, semiquaver chords, keeping the time himself so the drummer didn't have to. Other times he'd just play single, jagged-sounding, chords to accentuate the beat.\n\nHe used guitars with single-coil pickups and turned the treble up and got rid of all the midrange, so the sound would cut through no matter what. As well as playing full-voiced chords, he'd also sometimes mute all the strings while he strummed, giving a percussive scratching sound rather than letting the strings ring. In short, the sound he got was this:\n\n[Excerpt: James Brown, \"Papa's Got a Brand New Bag\"]\n\nAnd that is the sound that became funk guitar. If you listen to Jimmy Nolen's playing on \"Papa's Got a Brand New Bag\", that guitar sound -- chicken scratched ninth chords -- is what every funk guitarist after him based their style on. It's not Nolen's guitar playing in its actual final form -- that wouldn't come until he started using wah wah pedals, which weren't mass produced until early 1967 -- but it's very clear when listening to the track that this is the birth of funk.\n\nThe original studio recording of \"Papa's Got a Brand New Bag\" actually sounds odd if you listen to it now -- it's slower than the single, and lasts almost seven minutes:\n\n[Excerpt: James Brown \"Papa's Got a Brand New Bag (parts 1, 2, and 3)\"]\n\nBut for release as a single, it was sped up a semitone, a ton of reverb was added, and it was edited down to just a few seconds over two minutes. The result was an obvious hit single:\n\n[Excerpt: James Brown, \"Papa's Got a Brand New Bag\"]\n\nOr at least, it was an obvious hit single to everyone except Syd Nathan, who as you'll have already predicted by now didn't like the song. Indeed according to Brown, he was so disgusted with the record that he threw his acetate copy of it onto the floor. But Brown got his way, and the single came out, and it became the biggest hit of Brown's career up to that point, not only giving him his first R&B number one since \"Try Me\" seven years earlier, but also crossing over to the pop charts in a way he hadn't before. He'd had the odd top thirty or even top twenty pop single in the past, but now he was in the top ten, and getting noticed by the music business establishment in a way he hadn't earlier. Brown's audience went from being medium-sized crowds of almost exclusively Black people with the occasional white face, to a much larger, more integrated, audience.\n\nIndeed, at the Grammys the next year, while the Beatles, the Beach Boys, the Rolling Stones, Bob Dylan, Phil Spector and the whole Motown stable were overlooked in favour of the big winners for that year Roger Miller, Herb Alpert, and the Anita Kerr Singers, even an organisation with its finger so notoriously off the pulse of the music industry as the National Academy of Recording Arts and Sciences, which presents the Grammys, couldn't fail to find the pulse of \"Papa's Got a Brand New Bag\", and gave Brown the Grammy for Best Rhythm and Blues record, beating out the other nominees \"In the Midnight Hour\", \"My Girl\", \"Shotgun\" by Junior Walker, and \"Shake\" by Sam Cooke.\n\nFrom this point on, Syd Nathan would no longer argue with James Brown as to which of his records would be released. After nine years of being the hardest working man in showbusiness, James Brown had now become the Godfather of Soul, and his real career had just begun.",
  "itunes:subtitle": "Episode one hundred and thirty-seven of A History of Rock Music in Five Hundred Songs looks at “Papas Got a Brand New Bag” by James Brown, and at how Brown went from a minor doo-wop artist to the pioneer of funk. Click the full post to read liner notes, ",
  "itunes:keywords": "Ben Bart,Bobby Byrd,Chuck Berry,James Brown,Jan and Dean,John Cage,Johnny Otis,King Records,Maceo Parker,Steve Binder,Syd Nathan,The Drifters,The Rolling Stones,The Valentinos,Yoko Ono",
  "itunes:episodeType": "full",
  "itunes:episode": 137,
  "content:encoded": "Episode one hundred and thirty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Papa's Got a Brand New Bag” by James Brown, and at how Brown went from a minor doo-wop artist to the pioneer of funk. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/58707466\">on \"I'm a Fool\" by Dino, Desi, and Billy</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>NB </strong>an early version of this was uploaded, in which I said \"episode 136\" rather than 137 and \"flattened ninth\" at one point rather than \"ninth\". I've fixed that in a new upload, which is otherwise unchanged.\n\n<strong>Resources</strong>\n\nAs usual, I’ve created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-137-papas-got-a-brand-new-bag/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI relied mostly on fur books for this episode. <a href=\"https://amzn.to/2YqB2ga\"><em>James Brown: The Godfather of Soul</em></a>, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\n<a href=\"https://amzn.to/2Jm29D4\"><em>Kill ‘Em and Leave: Searching for the Real James Brown</em></a>, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\n<a href=\"https://amzn.to/3wM0C1g\"><em>Black and Proud: The Life of James Brown</em></a> by Geoff Brown is a more traditional objective biography.\n\n<a href=\"https://amzn.to/3ChobAe\">And Douglas Wolk's 33 1/3 book on <em>Live at the Apollo</em></a> is a fascinating, detailed, look at that album.\n\n<a href=\"https://amzn.to/3Dj6RvN\">This box set</a> is the best collection of Brown's work there is, but is out of print. <a href=\"https://amzn.to/3wJbAoh\">This two-CD set</a> has all the essential hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\n[Introduction, the opening of Live at the Apollo. \"So now, ladies and gentlemen, it is star time. Are you ready for star time? [Audience cheers, and gives out another cheer with each musical sting sting] Thank you, and thank you very kindly. It is indeed a great pleasure to present to you in this particular time, national and international known as the hardest working man in showbusiness, Man that sing \"I'll Go Crazy\"! [sting] \"Try Me\" [sting] \"You've Got the Power\" [sting] \"Think\" [sting], \"If You Want Me\" [sting] \"I Don't Mind\" [sting] \"Bewildered\" [sting] million-dollar seller \"Lost Someone\" [sting], the very latest release, \"Night Train\" [sting] Let's everybody \"Shout and Shimmy\" [sting] Mr. Dynamite, the amazing Mr. Please Please himself, the star of the show, James Brown and the Famous Flames\"]\n\nIn 1951, the composer John Cage entered an anechoic chamber at Harvard University. An anechoic chamber is a room that's been completely soundproofed, so no sound can get in from the outside world, and in which the walls, floor, and ceiling are designed to absorb any sounds that are made. It's as close as a human being can get to experiencing total silence. When Cage entered it, he expected that to be what he heard -- just total silence. Instead, he heard two noises, a high-pitched one and a low one. Cage was confused by this -- why hadn't he heard the silence? The engineer in charge of the chamber explained to him that what he was hearing was himself -- the high-pitched noise was Cage's nervous system, and the low-pitched one was his circulatory system.\n\nCage later said about this, \"Until I die there will be sounds. And they will continue following my death. One need not fear about the future of music.\"\n\nThe experience inspired him to write his most famous piece, 4'33, in which a performer attempts not to make any sound for four minutes and thirty-three seconds. The piece is usually described as being four minutes and thirty-three seconds of silence, but it actually isn't -- the whole point is that there is no silence, and that the audience is meant to listen to the ambient noise and appreciate that noise as music.\n\nHere is where I would normally excerpt the piece, but of course for 4'33 to have its full effect, one has to listen to the whole thing.\n\nBut I can excerpt another piece Cage wrote. Because on October the twenty-fourth 1962 he wrote a sequel to 4'33, a piece he titled 0'00, but which is sometimes credited as \"4'33 no. 2\". He later reworked the piece, but the original score, which is dedicated to two avant-garde Japanese composers, Toshi Ichiyanagi and his estranged wife Yoko Ono, reads as follows:\n\n\"In a situation provided with maximum amplification (no feedback), perform a disciplined action.\"\n\nNow, as it happens, we have a recording of someone else performing Cage's piece, as written, on the day it was written, though neither performer nor composer were aware that that was what was happening. But I'm sure everyone can agree that this recording from October the 24th, 1962, is a disciplined action performed with maximum amplification and no feedback:\n\n[Excerpt: James Brown, \"Night Train\" (Live at the Apollo version)]\n\nWhen we left James Brown, almost a hundred episodes ago, he had just had his first R&B number one, with \"Try Me\", and had performed for the first time at the venue with which he would become most associated, the Harlem Apollo, and had reconnected with the mother he hadn't seen since he was a small child. But at that point, in 1958, he was still just the lead singer of a doo-wop group, one of many, and there was nothing in his shows or his records to indicate that he was going to become anything more than that, nothing to distinguish him from King Records labelmates like Hank Ballard, who made great records, put on a great live show, and are still remembered more than sixty years later, but mostly as a footnote.\n\nToday we're going to look at the process that led James Brown from being a peer of Ballard or Little Willie John to being arguably the single most influential musician of the second half of the twentieth century. Much of that influence is outside rock music, narrowly defined, but the records we're going to look at this time and in the next episode on Brown are records without which the entire sonic landscape of the late twentieth and early twenty-first centuries would be unimaginably different.\n\nAnd that process started in 1958, shortly after the release of \"Try Me\" in October that year, with two big changes to Brown's organisation. The first was that this was -- at least according to Brown -- when he first started working with Universal Attractions, a booking agency run by a man named Ben Bart, who before starting his own company had spent much of the 1940s working for Moe Gale, the owner of the Savoy Ballroom and manager of the Ink Spots, Louis Jordan, and many of the other acts we looked at in the very first episodes of this podcast.\n\nBart had started his own agency in 1945, and had taken the Ink Spots with him, though they'd returned to Gale a few years later, and he'd been responsible for managing the career of the Ravens, one of the first bird groups:\n\n[Excerpt: The Ravens, \"Rock Me All Night Long\"]\n\nIn the fifties, Bart had become closely associated with King Records, the label to which Brown and the Famous Flames were signed. A quick aside here -- Brown's early records were released on Federal Records, and later they switched to being released on King, but Federal was a subsidiary label for King, and in the same way that I don't distinguish between Checker and Chess, Tamla and Motown, or Phillips and Sun, I'll just refer to King throughout. Bart and Universal Attractions handled bookings for almost every big R&B act signed by King, including Tiny Bradshaw, Little Willie John, the \"5\" Royales, and Hank Ballard and the Midnighters.\n\nAccording to some sources, the Famous Flames signed with Universal Attractions at the same time they signed with King Records, and Bart's family even say it was Bart who discovered them and got them signed to King in the first place. Other sources say they didn't sign with Universal until after they'd proved themselves on the charts. But everyone seems agreed that 1958 was when Bart started making Brown a priority and taking an active interest in his career. Within a few years, Bart would have left Universal, handing the company over to his son and a business partner, to devote himself full-time to managing Brown, with whom he developed an almost father-son relationship.\n\nWith Bart behind them, the Famous Flames started getting better gigs, and a much higher profile on the chitlin circuit. But around this time there was another change that would have an even more profound effect.\n\nUp to this point, the Famous Flames had been like almost every other vocal group playing the chitlin' circuit, in that they hadn't had their own backing musicians. There were exceptions, but in general vocal groups would perform with the same backing band as every other act on a bill -- either a single backing band playing for a whole package tour, or a house band at the venue they were playing at who would perform with every act that played that venue. There would often be a single instrumentalist with the group, usually a guitarist or piano player, who would act as musical director to make sure that the random assortment of musicians they were going to perform with knew the material.\n\nThis was, for the most part, how the Famous Flames had always performed, though they had on occasion also performed their own backing in the early days. But now they got their own backing band, centred on J.C. Davis as sax player and bandleader, Bobby Roach on guitar, Nat Kendrick on drums, and Bernard Odum on bass. Musicians would come and go, but this was the core original lineup of what became the James Brown Band. Other musicians who played with them in the late fifties were horn players Alfred Corley and Roscoe Patrick, guitarist Les Buie, and bass player Hubert Perry, while keyboard duties would be taken on by Fats Gonder, although James Brown and Bobby Byrd would both sometimes play keyboards on stage.\n\nAt this point, as well, the lineup of the Famous Flames became more or less stable. As we discussed in the previous episode on Brown, the original lineup of the Famous Flames had left en masse when it became clear that they were going to be promoted as James Brown and the Famous Flames, with Brown getting more money, rather than as a group. Brown had taken on another vocal group, who had previously been Little Richard's backing vocalists, but shortly after \"Try Me\" had come out, but before they'd seen any money from it, that group had got into an argument with Brown over money he owed them. He dropped them, and they went off to record unsuccessfully as the Fabulous Flames on a tiny label, though the records they made, like \"Do You Remember\", are quite good examples of their type:\n\n[Excerpt: The Fabulous Flames, \"Do You Remember?\"]\n\nBrown pulled together a new lineup of Famous Flames, featuring two of the originals. Johnny Terry had already returned to the group earlier, and stayed when Brown sacked the rest of the second lineup of Flames, and they added Lloyd Bennett and Bobby Stallworth. And making his second return to the group was Bobby Byrd, who had left with the other original members, joined again briefly, and then left again.\n\nOddly, the first commercial success that Brown had after these lineup changes was not with the Famous Flames, or even under his own name. Rather, it was under the name of his drummer, Nat Kendrick.\n\nBrown had always seen himself, not primarily as a singer, but as a band leader and arranger. He was always a jazz fan first and foremost, and he'd grown up in the era of the big bands, and musicians he'd admired growing up like Lionel Hampton and Louis Jordan had always recorded instrumentals as well as vocal selections, and Brown saw himself very much in that tradition. Even though he couldn't read music, he could play several instruments, and he could communicate his arrangement ideas, and he wanted to show off the fact that he was one of the few R&B musicians with his own tight band.\n\nThe story goes that Syd Nathan, the owner of King Records, didn't like the idea, because he thought that the R&B audience at this point only wanted vocal tracks, and also because Brown's band had previously released an instrumental which hadn't sold. Now, this is a definite pattern in the story of James Brown -- it seems that at every point in Brown's career for the first decade, Brown would come up with an idea that would have immense commercial value, Nathan would say it was the most ridiculous thing he'd ever heard, Brown would do it anyway, and Nathan would later admit that he was wrong.\n\nThis is such a pattern -- it apparently happened with \"Please Please Please\", Brown's first hit, *and* \"Try Me\", Brown's first R&B number one, and we'll see it happen again later in this episode -- that one tends to suspect that maybe these stories were sometimes made up after the fact, especially since Syd Nathan somehow managed to run a successful record label for over twenty years, putting out some of the best R&B and country records from everyone from Moon Mullican to Wynonie Harris, the Stanley Brothers to Little Willie John, while if these stories are to be believed he was consistently making the most boneheaded, egregious, uncommercial decisions imaginable.\n\nBut in this case, it seems to be at least mostly true, as rather than being released on King Records as by James Brown, \"(Do the) Mashed Potatoes\" was released on Dade Records as by Nat Kendrick and the Swans, with the DJ Carlton Coleman shouting vocals over Brown's so it wouldn't be obvious Brown was breaking his contract:\n\n[Excerpt: Nat Kendrick and the Swans, \"(Do the)\" Mashed Potatoes\"]\n\nThat made the R&B top ten,  and I've seen reports that Brown and his band even toured briefly as Nat Kendrick and the Swans, before Syd Nathan realised his mistake, and started allowing instrumentals to be released under the name \"James Brown presents HIS BAND\", starting with a cover of Bill Doggett's \"Hold It\":\n\n[Excerpt: James Brown Presents HIS BAND, \"Hold It\"]\n\nAfter the Nat Kendrick record gave Brown's band an instrumental success, the Famous Flames also came back from another mini dry spell for hits, with the first top twenty R&B hit for the new lineup, \"I'll Go Crazy\", which was followed shortly afterwards by their first pop top forty hit, \"Think!\":\n\n[Excerpt: James Brown and the Famous Flames, \"Think!\"]\n\nThe success of \"Think!\" is at least in part down to Bobby Byrd, who would from this point on be Brown's major collaborator and (often uncredited) co-writer and co-producer until the mid-seventies.\n\nAfter leaving the Flames, and before rejoining them, Byrd had toured for a while with his own group, but had then gone to work for King Records at the request of Brown. King Records' pressing plant had equipment that sometimes produced less-than-ideal pressings of records, and Brown had asked Byrd to take a job there performing quality control, making sure that Brown's records didn't skip.\n\nWhile working there, Byrd also worked as a song doctor. His job was to take songs that had been sent in as demos, and rework them in the style of some of the label's popular artists, to make them more suitable, changing a song so it might fit the style of the \"5\" Royales or Little Willie John or whoever, and Byrd had done this for \"Think\", which had originally been recorded by the \"5\" Royales, whose leader, Lowman Pauling, had written it:\n\n[Excerpt: The \"5\" Royales, \"Think\"]\n\nByrd had reworked the song to fit Brown's style and persona. It's notable for example that the Royales sing \"How much of all your happiness have I really claimed?/How many tears have you cried for which I was to blame?/Darlin’, I can’t remember which was my fault/I tried so hard to please you—at least that’s what I thought.”\n\nBut in Brown's version this becomes “How much of your happiness can I really claim?/How many tears have you shed for which you was to blame?/Darlin’, I can’t remember just what is wrong/I tried so hard to please you—at least that’s what I thought.”\n\n[Excerpt: James Brown and the Famous Flames, \"Think\"]\n\nIn Brown's version, nothing is his fault, he's trying to persuade an unreasonable woman who has some problem he doesn't even understand, but she needs to think about it and she'll see that he's right, while in the Royales' version they're acknowledging that they're at fault, that they've done wrong, but they didn't *only* do wrong and maybe she should think about that too. It's only a couple of words' difference, but it changes the whole tenor of the song.\n\n\"Think\" would become the Famous Flames' first top forty hit on the pop charts, reaching number thirty-three. It went top ten on the R&B charts, and between 1959 and 1963 Brown and the Flames would have fifteen top-thirty R&B hits, going from being a minor doo-wop group that had had a few big hits to being consistent hit-makers, who were not yet household names, but who had a consistent sound that could be guaranteed to make the R&B charts, and who put on what was regarded as the best live show of any R&B band in the world.\n\nThis was partly down to the type of discipline that Brown imposed on his band. Many band-leaders in the R&B world would impose fines on their band members, and Johnny Terry suggested that Brown do the same thing. As Bobby Byrd put it, \"Many band leaders do it but it was Johnny’s idea to start it with us and we were all for it ‘cos we didn’t want to miss nothing. We wanted to be immaculate, clothes-wise, routine-wise and everything. Originally, the fines was only between James and us, The Famous Flames, but then James carried it over into the whole troupe. It was still a good idea because anybody joining The James Brown Revue had to know that they couldn’t be messing up, and anyway, all the fines went into a pot for the parties we had.\"\n\nBut Brown went much further with these fines than any other band leader, and would also impose them arbitrarily, and it became part of his reputation that he was the strictest disciplinarian in rhythm and blues music. One thing that became legendary among musicians was the way that he would impose fines while on stage. If a band member missed a note, or a dance step, or missed a cue, or had improperly polished shoes, Brown would, while looking at them, briefly make a flashing gesture with his hand, spreading his fingers out for a fraction of a second. To the audience, it looked like just part of Brown's dance routine, but the musician knew he had just been fined five dollars. Multiple flashes meant multiples of five dollars fined.\n\nBrown also developed a whole series of other signals to the band, which they had to learn, To quote Bobby Byrd again:\n\n\"James didn’t want anybody else to know what we was doing, so he had numbers and certain screams and spins. There was a certain spin he’d do and if he didn’t do the complete spin you’d know it was time to go over here. Certain screams would instigate chord changes, but mostly it was numbers. James would call out football numbers, that’s where we got that from. Thirty-nine — Sixteen —Fourteen — Two — Five — Three — Ninety-eight, that kind of thing. Number thirty-nine was always the change into ‘Please, Please, Please’. Sixteen is into a scream and an immediate change, not bam-bam but straight into something else. If he spins around and calls thirty-six, that means we’re going back to the top again. And the forty-two, OK, we’re going to do this verse and then bow out, we’re leaving now. It was amazing.\"\n\nThis, or something like this, is a fairly standard technique among more autocratic band leaders, a way of allowing the band as a whole to become a live compositional or improvisational tool for their leader, and Frank Zappa, for example, had a similar system. It requires the players to subordinate themselves utterly to the whim of the band leader, but also requires a band leader who knows the precise strengths and weaknesses of every band member and how they are likely to respond to a cue. When it works well, it can be devastatingly effective, and it was for Brown's live show.\n\nThe Famous Flames shows soon became a full-on revue, with other artists joining the bill and performing with Brown's band. From the late 1950s on, Brown would always include a female singer. The first of these was Sugar Pie DeSanto, a blues singer who had been discovered (and given her stage name) by Johnny Otis, but DeSanto soon left Brown's band and went on to solo success on Chess records, with hits like \"Soulful Dress\":\n\n[Excerpt: Sugar Pie DeSanto, \"Soulful Dress\"]\n\nAfter DeSanto left, she was replaced by  Bea Ford, the former wife of the soul singer Joe Tex, with whom Brown had an aggressive rivalry and mutual loathing. Ford and Brown recorded together, cutting tracks like \"You Got the Power\":\n\n[Excerpt: James Brown and Bea Ford, \"You Got the Power\"]\n\nHowever, Brown and Ford soon fell out, and Brown actually wrote to Tex asking if he wanted his wife back. Tex's response was to record this:\n\n[Excerpt: Joe Tex, \"You Keep Her\"]\n\nFord's replacement was Yvonne Fair, who had briefly replaced Jackie Landry in the Chantels for touring purposes when Landry had quit touring to have a baby. Fair would stay with Brown for a couple of years, and would release a number of singles written and produced for her by Brown, including one which Brown would later rerecord himself with some success:\n\n[Excerpt: Yvonne Fair, \"I Found You\"]\n\nFair would eventually leave the band after getting pregnant with a child by Brown, who tended to sleep with the female singers in his band. The last shows she played with him were the shows that would catapult Brown into the next level of stardom.\n\nBrown had been convinced for a long time that his live shows had an energy that his records didn't, and that people would buy a record of one of them. Syd Nathan, as usual, disagreed. In his view the market for R&B albums was small, and only consisted of people who wanted collections of hit singles they could play in one place. Nobody would buy a James Brown live album.\n\nSo Brown decided to take matters into his own hands. He decided to book a run of shows at the Apollo Theatre, and record them, paying for the recordings with his own money. This was a week-long engagement, with shows running all day every day -- Brown and his band would play five shows a day, and Brown would wear a different suit for every show.\n\nThis was in October 1962, the month that we've already established as the month the sixties started -- the month the Beatles released their first single, the Beach Boys released their first record outside the US, and the first Bond film came out, all on the same day at the beginning of the month. By the end of October, when Brown appeared at the Apollo, the Cuban Missile Crisis was at its height, and there were several points during the run where it looked like the world itself might not last until November 62.\n\nDouglas Wolk has written an entire book on the live album that resulted, which claims to be a recording of the midnight performance from October the twenty-fourth, though it seems like it was actually compiled from multiple performances. The album only records the headline performance, but Wolk describes what a full show by the James Brown Revue at the Apollo was like in October 1962, and the following description is indebted to his book, which I'll link in the show notes.\n\nThe show would start with the \"James Brown Orchestra\" -- the backing band. They would play a set of instrumentals, and a group of dancers called the Brownies would join them:\n\n[Excerpt: James Brown Presents His Band, \"Night Flying\"]\n\nAt various points during the set, Brown himself would join the band for a song or two, playing keyboards or drums. After the band's instrumental set, the Valentinos would take the stage for a few songs. This was before they'd been taken on by Sam Cooke, who would take them under his wing very soon after these shows, but the Valentinos were already recording artists in their own right, and had recently released \"Lookin' For a Love\":\n\n[Excerpt: The Valentinos, \"Lookin' For a Love\"]\n\nNext up would be Yvonne Fair, now visibly pregnant with her boss' child, to sing her few numbers:\n\n[Excerpt: Yvonne Fair, \"You Can Make it if You Try\"]\n\nFreddie King was on next, another artist for the King family of labels who'd had a run of R&B hits the previous year, promoting his new single \"I'm On My Way to Atlanta\":\n\n[Excerpt: Freddie King, \"I'm on My Way to Atlanta\"]\n\nAfter King came Solomon Burke, who had been signed to Atlantic earlier that year and just started having hits, and was the new hot thing on the scene, but not yet the massive star he became:\n\n[Excerpt: Solomon Burke, \"Cry to Me\"]\n\nAfter Burke came a change of pace -- the vaudeville comedian Pigmeat Markham would take the stage and perform a couple of comedy sketches. We actually know exactly how these went, as Brown wasn't the only one recording a live album there that week, and Markham's album \"The World's Greatest Clown\" was a result of these shows and released on Chess Records:\n\n[Excerpt: Pigmeat Markham, \"Go Ahead and Sing\"]\n\nAnd after Markham would come the main event. Fats Gonder, the band's organist, would give the introduction we heard at the beginning of the episode -- and backstage, Danny Ray, who had been taken on as James Brown's valet that very week (according to Wolk -- I've seen other sources saying he'd joined Brown's organisation in 1960), was listening closely. He would soon go on to take over the role of MC, and would introduce Brown in much the same way as Gonder had at every show until Brown's death forty-four years later.\n\nThe live album is an astonishing tour de force, showing Brown and his band generating a level of excitement that few bands then or now could hope to equal. It's even more astonishing when you realise two things. The first is that this was *before* any of the hits that most people now associate with the name James Brown -- before \"Papa's Got a Brand New Bag\" or \"Sex Machine\", or \"It's a Man's Man's Man's World\" or \"Say it Loud I'm Black and I'm Proud\" or \"Funky Drummer\" or \"Get Up Offa That Thing\". It's still an *unformed* James Brown, only six years into a fifty-year career, and still without most of what made him famous.\n\nThe other thing is, as Wolk notes, if you listen to any live bootleg recordings from this time, the microphone distorts all the time, because Brown is singing so loud. Here, the vocal tone is clean, because Brown knew he was being recorded. This is the sound of James Brown restraining himself:\n\n[Excerpt: James Brown and the Famous Flames, \"Night Train\" (Live at the Apollo version)]\n\nThe album was released a few months later, and proved Syd Nathan's judgement utterly, utterly, wrong. It became the thirty-second biggest selling album of 1963 -- an amazing achievement given that it was released on a small independent label that dealt almost exclusively in singles, and which had no real presence in the pop market. The album spent sixty-six weeks on the album charts, making number two on the charts -- the pop album charts, not R&B charts. There wasn't an R&B albums chart until 1965, and Live at the Apollo basically forced Billboard to create one, and more or less single-handedly created the R&B albums market. It was such a popular album in 1963 that DJs took to playing the whole album -- breaking for commercials as they turned the side over, but otherwise not interrupting it. It turned Brown from merely a relatively big R&B star into a megastar.\n\nBut oddly, given this astonishing level of success, Brown's singles in 1963 were slightly less successful than they had been in the previous few years -- possibly partly because he decided to record a few versions of old standards, changing direction as he had for much of his career. Johnny Terry quit the Famous Flames, to join the Drifters, becoming part of the lineup that recorded \"Under the Boardwalk\" and \"Saturday Night at the Movies\". Brown also recorded a second live album, Pure Dynamite!, which is generally considered a little lacklustre in comparison to the Apollo album.\n\nThere were other changes to the lineup as well as Terry leaving. Brown wanted to hire a new drummer, Melvin Parker, who agreed to join the band, but only if Brown took on his sax-playing brother, Maceo, along with him. Maceo soon became one of the most prominent musicians in Brown's band, and his distinctive saxophone playing is all over many of Brown's biggest hits.\n\nThe first big hit that the Parkers played on was released as by James Brown and his Orchestra, rather than James Brown and the Famous Flames, and was a landmark in Brown's evolution as a musician:\n\n[Excerpt: James Brown and his Orchestra, \"Out of Sight\"]\n\nThe Famous Flames did sing on the B-side of that, a song called \"Maybe the Last Time\", which was ripped off from the same Pops Staples song that the Rolling Stones later ripped off for their own hit single. But that would be the last time Brown would use them in the studio -- from that point on, the Famous Flames were purely a live act, although Bobby Byrd, but not the other members, would continue to sing on the records.\n\nThe reason it was credited to James Brown, rather than to James Brown and the Famous Flames, is that \"Out of Sight\" was released on Smash Records, to which Brown -- but not the Flames -- had signed a little while earlier. Brown had become sick of what he saw as King Records' incompetence, and had found what he and his advisors thought was a loophole in his contract. Brown had been signed to King Records under a personal services contract as a singer, not under a musician contract as a musician, and so they believed that he could sign to Smash, a subsidiary of Mercury, as a musician. He did, and he made what he thought of as a fresh start on his new label by recording \"Caldonia\", a cover of a song by his idol Louis Jordan:\n\n[Excerpt: James Brown and his Orchestra, \"Caldonia\"]\n\nUnderstandably, King Records sued on the reasonable grounds that Brown was signed to them as a singer, and they got an injunction to stop him recording for Smash -- but by the time the injunction came through, Brown had already released two albums and three singles for the label. The injunction prevented Brown from recording any new material for the rest of 1964, though both labels continued to release stockpiled material during that time.\n\nWhile he was unable to record new material, October 1964 saw Brown's biggest opportunity to cross over to a white audience -- the TAMI Show:\n\n[Excerpt: James Brown, \"Out of Sight (TAMI show live)\"]\n\nWe've mentioned the TAMI show a couple of times in previous episodes, but didn't go into it in much detail. It was a filmed concert which featured Jan and Dean, the Barbarians, Lesley Gore, Chuck Berry, the Beach Boys, Gerry and the Pacemakers, Billy J Kramer and the Dakotas, Marvin Gaye, the Miracles, the Supremes, and, as the two top acts, James Brown and the Rolling Stones.\n\nRather oddly, the point of the TAMI Show wasn't the music as such. Rather it was intended as a demonstration of a technical process.\n\nBefore videotape became cheap and a standard, it was difficult to record TV shows for later broadcast, for distribution to other countries, or for archive. The way they used to be recorded was a process known as telerecording in the UK and kinescoping in the US, and that was about as crude as it's possible to get -- you'd get a film camera, point it at a TV showing the programme you wanted to record, and film the TV screen. There was specialist equipment to do this, but that was all it actually did. Almost all surviving TV from the fifties and sixties -- and even some from the seventies -- was preserved by this method rather than by videotape. Even after videotape started being used to make the programmes, there were differing standards and tapes were expensive, so if you were making a programme in the UK and wanted a copy for US broadcast, or vice versa, you'd make a telerecording.\n\nBut what if you wanted to make a TV show that you could also show on cinema screens? If you're filming a TV screen, and then you project that film onto a big screen, you get a blurry, low-resolution, mess -- or at least you did with the 525-line TV screens that were used in the US at the time.\n\nSo a company named Electronovision came into the picture, for those rare times when you wanted to do something using video cameras that would be shown at the cinema. Rather than shoot in 525-line resolution, their cameras shot in 819-line resolution -- super high definition for the time, but capable of being recorded onto standard videotape with appropriate modifications for the equipment. But that meant that when you kinescoped the production, it was nearly twice the resolution that a standard US TV broadcast would be, and so it didn't look terrible when shown in a cinema.\n\nThe owner of the Electronovision process had had a hit with a cinema release of a performance by Richard Burton as Hamlet, and he needed a follow-up, and decided that another filmed live performance would be the best way to make use of his process -- TV cameras were much more useful for capturing live performances than film cameras, for a variety of dull technical reasons, and so this was one of the few areas where Electronovision might actually be useful.\n\nAnd so Bill Roden, one of the heads of Electronovision, turned to a TV director named Steve Binder, who was working at the time on the Steve Allen show, one of the big variety shows, second only to Ed Sullivan, and who would soon go on to direct Hullaballoo. Roden asked Binder to make a concert film, shot on video, which would be released on the big screen by American International Pictures (the same organisation with which David Crosby's father worked so often).\n\nBinder had contacts with West Coast record labels, and particularly with Lou Adler's organisation, which managed Jan and Dean. He also had been in touch with a promoter who was putting on a package tour of British musicians. So they decided that their next demonstration of the capabilities of the equipment would be a show featuring performers from \"all over the world\", as the theme song put it -- by which they meant all over the continental United States plus two major British cities. For those acts who didn't have their own bands -- or whose bands needed augmenting -- there was an orchestra, centred around members of the Wrecking Crew, conducted by Jack Nitzsche, and the Blossoms were on hand to provide backing vocals where required. Jan and Dean would host the show and sing the theme song.\n\nJames Brown had had less pop success than any of the other artists on the show except for the Barbarians, who are now best-known for their appearances on the Nuggets collection of relatively obscure garage rock singles, and whose biggest hit, \"Are You a Boy or Are You a Girl?\" only went to number fifty-five on the charts:\n\n[Excerpt: The Barbarians, \"Are You a Boy or Are You a Girl?\"]\n\nThe Barbarians were being touted as the American equivalent of the Rolling Stones, but the general cultural moment of the time can be summed up by that line \"You're either a girl or you come from Liverpool\" -- which was where the Rolling Stones came from. Or at least, it was where Americans seemed to think they came from given both that song, and the theme song of the TAMI show, written by P.F. Sloan and Steve Barri, which sang about “the Rolling Stones from Liverpool”, and also referred to Brown as \"the king of the blues\":\n\n[Excerpt: Jan and Dean, \"Here They Come From All Over The World\"]\n\nBut other than the Barbarians, the TAMI show was one of the few places in which all the major pop music movements of the late fifties and early sixties could be found in one place -- there was the Merseybeat of Gerry and the Pacemakers and the Dakotas, already past their commercial peak but not yet realising it, the fifties rock of Chuck Berry, who actually ended up performing one song with Gerry and the Pacemakers:\n\n[Excerpt: Chuck Berry and Gerry and the Pacemakers: \"Maybellene\"]\n\nAnd there was the Brill Building pop of Lesley Gore, the British R&B of the Rolling Stones right at the point of their breakthrough, the vocal surf music of the Beach Boys and Jan and Dean, and three of the most important Motown acts, with Brown the other representative of soul on the bill.\n\nBut the billing was a sore point. James Brown's manager insisted that he should be the headliner of the show, and indeed by some accounts the Rolling Stones also thought that they should probably not try to follow him -- though other accounts say that the Stones were equally insistent that they *must* be the headliners. It was a difficult decision, because Brown was much less well known, but it was eventually decided that the Rolling Stones would go on last.\n\nMost people talking about the event, including most of those involved with the production, have since stated that this was a mistake, because nobody could follow James Brown, though in interviews Mick Jagger has always insisted that the Stones didn't have to follow Brown, as there was a recording break between acts and they weren't even playing to the same audience -- though others have disputed that quite vigorously. But what absolutely everyone has agreed is that Brown gave the performance of a lifetime, and that it was miraculously captured by the cameras.\n\nI say its capture was miraculous because every other act had done a full rehearsal for the TV cameras, and had had a full shot-by-shot plan worked out by Binder beforehand. But according to Steve Binder -- though all the accounts of the show are contradictory -- Brown refused to do a rehearsal -- so even though he had by far the most complex and choreographed performance of the event, Binder and his camera crew had to make decisions by pure instinct, rather than by having an actual plan they'd worked out in advance of what shots to use.\n\nThis is one of the rare times when I wish this was a video series rather than a podcast, because the visuals are a huge part of this performance -- Brown is a whirlwind of activity, moving all over the stage in a similar way to Jackie Wilson, one of his big influences, and doing an astonishing gliding dance step in which he stands on one leg and moves sideways almost as if on wheels. The full performance is easily findable online, and is well worth seeking out. But still, just hearing the music and the audience's reaction can give some insight:\n\n[Excerpt: James Brown, \"Out of Sight\" (TAMI Show)]\n\nThe Rolling Stones apparently watched the show in horror, unable to imagine following that -- though when they did, the audience response was fine:\n\n[Excerpt: The Rolling Stones, \"Around and Around\"]\n\nIncidentally, Chuck Berry must have been quite pleased with his payday from the TAMI Show, given that as well as his own performance the Stones did one of his songs, as did Gerry and the Pacemakers, as we heard earlier, and the Beach Boys did \"Surfin' USA\" for which he had won sole songwriting credit.\n\nAfter the TAMI Show, Mick Jagger would completely change his attitude to performing, and would spend the rest of his career trying to imitate Brown's performing style. He was unsuccessful in this, but still came close enough that he's still regarded as one of the great frontmen, nearly sixty years later.\n\nBrown kept performing, and his labels kept releasing material, but he was still not allowed to record, until in early 1965 a court reached a ruling -- yes, Brown wasn't signed as a musician to King Records, so he was perfectly within his rights to record with Smash Records. As an instrumentalist. But Brown *was* signed to King Records as a singer, so he was obliged to record vocal tracks for them, and only for them. So until his contract with Smash lapsed, he had to record twice as much material -- he had to keep recording instrumentals, playing piano or organ, for Smash, while recording vocal tracks for King Records.\n\nHis first new record, released as by \"James Brown\" rather than the earlier billings of \"James Brown and his Orchestra\" or \"James Brown and the Famous Flames\", was for King, and was almost a remake of \"Out of Sight\", his hit for Smash Records. But even so, \"Papa's Got a Brand New Bag\" was a major step forward, and is often cited as the first true funk record.\n\nThis is largely because of the presence of a new guitarist in Brown's band.\n\nJimmy Nolen had started out as a violin player, but like many musicians in the 1950s he had been massively influenced by T-Bone Walker, and had switched to playing guitar. He was discovered as a guitarist by the bluesman Jimmy Wilson, who had had a minor hit with \"Tin Pan Alley\":\n\n[Excerpt: Jimmy Wilson, \"Tin Pan Alley\"]\n\nWilson had brought Nolen to LA, where he'd soon parted from Wilson and started working with a whole variety of bandleaders. His first recording came with Monte Easter on Aladdin Records:\n\n[Excerpt: Monte Easter, \"Blues in the Evening\"]\n\nAfter working with Easter, he started recording with Chuck Higgins, and also started recording by himself. At this point, Nolen was just one of many West Coast blues guitarists with a similar style, influenced by T-Bone Walker -- he was competing with Pete \"Guitar\" Lewis, Johnny \"Guitar\" Watson, and Guitar Slim, and wasn't yet quite as good as any of them. But he was still making some influential records. His version of \"After Hours\", for example, released under his own name on Federal Records, was a big influence on Roy Buchanan, who would record several versions of the standard based on Nolen's arrangement:\n\n[Excerpt: Jimmy Nolen, \"After Hours\"]\n\nNolen had released records on many labels, but his most important early association came from records he made but didn't release. In the mid-fifties, Johnny Otis produced a couple of tracks by Nolen, for Otis' Dig Records label, but they weren't released until decades later:\n\n[Excerpt: Jimmy Nolen, \"Jimmy's Jive\"]\n\nBut when Otis had a falling out with his longtime guitar player Pete \"Guitar\" Lewis, who was one of the best players in LA but who was increasingly becoming unreliable due to his alcoholism, Otis hired Nolen to replace him. It's Nolen who's playing on most of the best-known recordings Otis made in the late fifties, like \"Casting My Spell\":\n\n[Excerpt: Johnny Otis, \"Casting My Spell\"]\n\nAnd of course Otis' biggest hit \"Willie and the Hand Jive\":\n\n[Excerpt: Johnny Otis, \"Willie and the Hand Jive\"]\n\nNolen left Otis after a few years, and spent the early sixties mostly playing in scratch bands backing blues singers, and not recording. It was during this time that Nolen developed the style that would revolutionise music. The style he developed was unique in several different ways. The first was in Nolen's choice of chords. We talked last week about how Pete Townshend's guitar playing became based on simplifying chords and only playing power chords. Nolen went the other way -- while his voicings often only included two or three notes, he was also often using very complex chords with *more* notes than a standard chord. As we discussed last week, in most popular music, the chords are based around either major or minor triads -- the first, third, and fifth notes of a scale, so you have an E major chord, which is the notes E, G sharp, and B:\n\n[Excerpt: E major chord]\n\nIt's also fairly common to have what are called seventh chords, which are actually a triad with an added flattened seventh, so an E7 chord would be the notes E, G sharp, B, and D:\n\n[Excerpt: E7 chord]\n\nBut Nolen built his style around dominant ninth chords, often just called ninth chords. Dominant ninth chords are mostly thought of as jazz chords because they're mildly dissonant. They consist of the first, third, fifth, flattened seventh, *and* ninth of a scale, so an E9 would be the notes E, G sharp, B, D, and F sharp:\n\n[Excerpt: E9 chord]\n\nAnother way of looking at that is that you're playing both a major chord *and* at the same time a minor chord that starts on the fifth note, so an E major and B minor chord at the same time:\n\n[Demonstrates Emajor, B minor, E9]\n\nIt's not completely unknown for pop songs to use ninth chords, but it's very rare. Probably the most prominent example came from a couple of years after the period we're talking about, when in mid-1967 Bobby Gentry basically built the whole song \"Ode to Billie Joe\" around a D9 chord, barely ever moving off it:\n\n[Excerpt: Bobby Gentry, \"Ode to Billie Joe\"]\n\nThat shows the kind of thing that ninth chords are useful for -- because they have so many notes in them, you can just keep hammering on the same chord for a long time, and the melody can go wherever it wants and will fit over it. The record we're looking at, \"Papa's Got a Brand New Bag\", actually has three chords in it -- it's basically a twelve-bar blues, like \"Out of Sight\" was, just with these ninth chords sometimes used instead of more conventional chords -- but as Brown's style got more experimental in future years, he would often build songs with no chord changes at all, just with Nolen playing a single ninth chord throughout. There's a possibly-apocryphal story, told in a few different ways, but the gist of which is that when auditioning Nolen's replacement many years later, Brown asked \"Can you play an E ninth chord?\"\n\n\"Yes, of course\" came the reply.\n\n\"But can you play an E ninth chord *all night*?\"\n\nThe reason Brown asked this, if he did, is that playing like Nolen is *extremely* physically demanding. Because the other thing about Nolen's style is that he was an extremely percussive player. In his years backing blues musicians, he'd had to play with many different drummers, and knew they weren't always reliable timekeepers. So he'd started playing like a drummer himself, developing a technique called chicken-scratching, based on the Bo Diddley style he'd played with Otis, where he'd often play rapid, consistent, semiquaver chords, keeping the time himself so the drummer didn't have to. Other times he'd just play single, jagged-sounding, chords to accentuate the beat.\n\nHe used guitars with single-coil pickups and turned the treble up and got rid of all the midrange, so the sound would cut through no matter what. As well as playing full-voiced chords, he'd also sometimes mute all the strings while he strummed, giving a percussive scratching sound rather than letting the strings ring. In short, the sound he got was this:\n\n[Excerpt: James Brown, \"Papa's Got a Brand New Bag\"]\n\nAnd that is the sound that became funk guitar. If you listen to Jimmy Nolen's playing on \"Papa's Got a Brand New Bag\", that guitar sound -- chicken scratched ninth chords -- is what every funk guitarist after him based their style on. It's not Nolen's guitar playing in its actual final form -- that wouldn't come until he started using wah wah pedals, which weren't mass produced until early 1967 -- but it's very clear when listening to the track that this is the birth of funk.\n\nThe original studio recording of \"Papa's Got a Brand New Bag\" actually sounds odd if you listen to it now -- it's slower than the single, and lasts almost seven minutes:\n\n[Excerpt: James Brown \"Papa's Got a Brand New Bag (parts 1, 2, and 3)\"]\n\nBut for release as a single, it was sped up a semitone, a ton of reverb was added, and it was edited down to just a few seconds over two minutes. The result was an obvious hit single:\n\n[Excerpt: James Brown, \"Papa's Got a Brand New Bag\"]\n\nOr at least, it was an obvious hit single to everyone except Syd Nathan, who as you'll have already predicted by now didn't like the song. Indeed according to Brown, he was so disgusted with the record that he threw his acetate copy of it onto the floor. But Brown got his way, and the single came out, and it became the biggest hit of Brown's career up to that point, not only giving him his first R&B number one since \"Try Me\" seven years earlier, but also crossing over to the pop charts in a way he hadn't before. He'd had the odd top thirty or even top twenty pop single in the past, but now he was in the top ten, and getting noticed by the music business establishment in a way he hadn't earlier. Brown's audience went from being medium-sized crowds of almost exclusively Black people with the occasional white face, to a much larger, more integrated, audience.\n\nIndeed, at the Grammys the next year, while the Beatles, the Beach Boys, the Rolling Stones, Bob Dylan, Phil Spector and the whole Motown stable were overlooked in favour of the big winners for that year Roger Miller, Herb Alpert, and the Anita Kerr Singers, even an organisation with its finger so notoriously off the pulse of the music industry as the National Academy of Recording Arts and Sciences, which presents the Grammys, couldn't fail to find the pulse of \"Papa's Got a Brand New Bag\", and gave Brown the Grammy for Best Rhythm and Blues record, beating out the other nominees \"In the Midnight Hour\", \"My Girl\", \"Shotgun\" by Junior Walker, and \"Shake\" by Sam Cooke.\n\nFrom this point on, Syd Nathan would no longer argue with James Brown as to which of his records would be released. After nine years of being the hardest working man in showbusiness, James Brown had now become the Godfather of Soul, and his real career had just begun.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-seven of A History of Rock Music in Five Hundred Songs looks at “Papa's Got a Brand New Bag” by James Brown, and at how Brown went from a minor doo-wop artist to the pioneer of funk. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"I'm a Fool\" by Dino, Desi, and Billy.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nNB an early version of this was uploaded, in which I said \"episode 136\" rather than 137 and \"flattened ninth\" at one point rather than \"ninth\". I've fixed that in a new upload, which is otherwise unchanged.\n\nResources\n\nAs usual, I’ve created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI relied mostly on fur books for this episode. James Brown: The Godfather of Soul, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\nKill ‘Em and Leave: Searching for the Real James Brown, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\nBlack and Proud: The Life of James Brown by Geoff Brown is a more traditional objective biography.\n\nAnd Douglas Wolk's 33 1/3 book on Live at the Apollo is a fascinating, detailed, look at that album.\n\nThis box set is the best collection of Brown's work there is, but is out of print. This two-CD set has all the essential hits.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\n[Introduction, the opening of Live at the Apollo. \"So now, ladies and gentlemen, it is star time. Are you ready for star time? [Audience cheers, and gives out another cheer with each musical sting sting] Thank you, and thank you very kindly. It is indeed a great pleasure to present to you in this particular time, national and international known as the hardest working man in showbusiness, Man that sing \"I'll Go Crazy\"! [sting] \"Try Me\" [sting] \"You've Got the Power\" [sting] \"Think\" [sting], \"If You Want Me\" [sting] \"I Don't Mind\" [sting] \"Bewildered\" [sting] million-dollar seller \"Lost Someone\" [sting], the very latest release, \"Night Train\" [sting] Let's everybody \"Shout and Shimmy\" [sting] Mr. Dynamite, the amazing Mr. Please Please himself, the star of the show, James Brown and the Famous Flames\"]\n\nIn 1951, the composer John Cage entered an anechoic chamber at Harvard University. An anechoic chamber is a room that's been completely soundproofed, so no sound can get in from the outside world, and in which the walls, floor, and ceiling are designed to absorb any sounds that are made. It's as close as a human being can get to experiencing total silence. When Cage entered it, he expected that to be what he heard -- just total silence. Instead, he heard two noises, a high-pitched one and a low one. Cage was confused by this -- why hadn't he heard the silence? The engineer in charge of the chamber explained to him that what he was hearing was himself -- the high-pitched noise was Cage's nervous system, and the low-pitched one was his circulatory system.\n\nCage later said about this, \"Until I die there will be sounds. And they will continue following my death. One need not fear about the future of music.\"\n\nThe experience inspired him to write his most famous piece, 4'33, in which a performer attempts not to make any sound for four minutes and thirty-three seconds. The piece is usually described as being four minutes and thirty-three seconds of silence, but it actually isn't -- the whole point is that there is no silence, and that the audience is meant to listen to the ambient noise and appreciate that noise as music.\n\nHere is where I would normally excerpt the piece, but of course for 4'33 t",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-seven of A History of Rock Music in Five Hundred Songs looks at “Papa's Got a Brand New Bag” by James Brown, and at how Brown went from a minor doo-wop artist to the pioneer of funk. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"I'm a Fool\" by Dino, Desi, and Billy.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nNB an early version of this was uploaded, in which I said \"episode 136\" rather than 137 and \"flattened ninth\" at one point rather than \"ninth\". I've fixed that in a new upload, which is otherwise unchanged.\n\nResources\n\nAs usual, I’ve created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI relied mostly on fur books",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}