{
  "id": "https://bibleinoneyear.org/en/youth/164",
  "title": "Day 164: Your Nation Can Be Changed",
  "description": "Proverbs 14:26–27,30–31,34, 2 Samuel 21:1a, Acts 8:4–8,14–17,18–20.  In the last twenty-five years, there has been huge change – politically, economically and technologically  Massive change is taking place in many countries around the world",
  "pubDate": "Mon, 13 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/164/",
  "itunes:duration": "15:40",
  "guid": "enyouth13062022-164",
  "length": 940.41,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 164: Your Nation Can Be Changed",
  "itunes:subtitle": "Proverbs 14:26–27,30–31,34, 2 Samuel 21:1a, Acts 8:4–8,14–17,18–20.  In the last twenty-five years, there has been huge change – politically, economically and technologically  Massive change is taking place in many countries around the world",
  "itunes:summary": "There were 10,000 sex-workers plying their trade on the streets of London. Binge drinking and gambling were widespread. The UK had descended into decadence and immorality. This was the eighteenth century. Church congregations had declined sharply (just as they have in recent decades). Parts of the church had virtually descended into paganism.\nYet, the nation was changed. The preaching of John Wesley and George Whitefield began to take effect. Thousands of people responded to their message and encountered Jesus. Robert Raikes started his first Sunday school in 1780. The growth from this one idea reached 300,000 unchurched children within five years. By 1910, there were well over 5 million children in Sunday school. God raised up William Wilberforce, Lord Shaftesbury and others. Not only were individual hearts changed – but the nation was also transformed.\nAs we look at our world today, we see it is changing faster than ever before. In the last twenty-five years, there has been huge change – politically, economically and technologically. Massive change is taking place in many countries around the world. How can the spiritual climate of your nation be changed?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 529
}