{
  "title": "Newsweek Embraces the Anti-Democracy Hard Right",
  "link": "https://www.splcenter.org/hatewatch/2022/11/04/newsweek-embraces-anti-democracy-hard-right",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Hatewatch</div>\n      </div>\n</div>\n<div class=\"field field-name-field-long-text field-type-text-long field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p><em>Newsweek</em> positioned political activist Josh Hammer to run their opinion pages during the runup to the 2020 presidential election, and since that time, the publication has taken a marked radical right turn by buoying extremists and promoting authoritarian leaders.</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Newsweek Embraces the Anti-Democracy Hard Right</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div data-embed-button=\"media\" data-entity-id=\"35286\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"41e21ee7-5db4-4ee0-9912-0920c8c48401\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35286\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/joshhammergageskidmore-700pxjpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/josh_hammer_gage_skidmore-700px.jpg\" width=\"700\" height=\"467\" alt=\"Josh Hammer\" title=\"Josh Hammer\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Josh Hammer speaks with attendees at the 2021 Student Action Summit hosted by Turning Point USA at the Tampa Convention Center in Tampa, Florida. (Photo by Gage Skidmore)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Although opinion pages in ostensibly nonpartisan, mainstream publications promote political opinions, sometimes controversial ones, <em>Newsweek</em> stands alone among such brands in its willingness to elevate such figures as <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/jack-posobiec\"> Jack Posobiec</a>, known for promoting the Pizzagate disinformation campaign, and Dinesh D’Souza, whose film <a href=\"https://www.npr.org/2022/09/20/1123898736/prominent-election-deniers-are-facing-growing-legal-trouble\"> <em>2000 Mules</em></a> researchers roundly debunked for spreading conspiracies about the 2020 election. Under Hammer’s leadership, <em>Newsweek</em> has also aired bigoted views, like appearing to call for the state to deny adults access to trans-affirming medical care and supporting a ban on all legal immigration into the U.S. They have also spread baseless conspiracies about COVID-19, with one of Hammer’s collaborators describing vaccines designed to fight the virus as a “bioweapon.”</p>\n<p><em>Newsweek</em> has also failed to disclose potential conflicts of interest emerging in the content published through Hammer’s opinion section and his <em>Newsweek</em>-branded podcast, “The Josh Hammer Show.” Hammer donated to the campaign of Arizona U.S. Senate candidate Blake Masters and at least four times published the work of a man who ran one of Masters’ fundraisers. On his podcast, Hammer told <em>Newsweek</em>’s audience to “go ahead and vote for Blake Masters.” Hammer also promoted hard-right Hungarian leader Viktor Orbán in a <em>Newsweek</em> dispatch authored from Hungary, without disclosing that he arrived there in collaboration with a group directly affiliated with the Hungarian government. Hammer also claims membership in a number of reactionary activist groups, and regularly publishes people who are also affiliated with them. He will appear on behalf of the New York Young Republican Club alongside Posobiec and QAnon influencer-turned-congressperson <a href=\"https://www.splcenter.org/hatewatch/2020/09/09/congressional-candidate-marjorie-taylor-greene-has-several-ties-conspiracy-hate-groups\"> Marjorie Taylor Greene</a> in December.</p>\n<p>Hatewatch reached out to <em>Newsweek</em> for comment about the reporting published in this analysis. <em>Newsweek</em> first introduced Hatewatch to a representative of the journalism-focused non-profit Poynter, whom they contracted to advise them on ethics in 2019. Hatewatch had three different conversations with Poynter about <em>Newsweek</em> and their relationship, which are detailed later in this analysis. A representative from the public relations agency LBG PR replied asking for our questions. Hatewatch responded by emailing 19 different specific questions inspired by the reporting in this analysis, and LBG PR issued the following statement in reply:</p>\n<blockquote><p>Newsweek’s opinions section features voices across the political and cultural spectrum. While he offers up his own opinions on the Newsweek platform, as Opinions Editor, Josh Hammer has embraced the mission of &#039;The Debate&#039; and delivered an expansive forum for diverse perspectives and dialogue.</p>\n</blockquote>\n<h2>Campaigning for Blake Masters through <em>Newsweek</em></h2>\n<div data-embed-button=\"media\" data-entity-id=\"35289\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"b4556040-40e6-4a80-9d7d-1cccdca0e5ec\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-left\">\n<div id=\"file-35289\" class=\"file file-image file-image-png\">\n<h2 class=\"element-invisible\"><a href=\"/files/joshhammertweetblakemasters-700pxpng\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/josh_hammer_tweet_blakemasters-700px.png\" width=\"700\" height=\"584\" alt=\"Hammer and Masters\" title=\"Hammer and Masters\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Josh Hammer (left) and Blake Masters. (Photo via Twitter)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Blake Masters, the Republican candidate for Arizona’s U.S. Senate seat, has emerged as a favored candidate of white nationalists, neo-Nazis and other admirers of fascism. (One of his major donors, tech billionaire Peter Thiel, has said he no longer believes freedom and democracy are “compatible.”) The notorious white supremacist website <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/group/american-renaissance\"> American Renaissance</a> has republished versions of stories about Masters’ controversies from other outlets, drawing cheers from their notoriously racist comment section. White nationalist <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/nick-fuentes\"> Nick Fuentes</a>, who praises such fascist dictators as Adolf Hitler and Benito Mussolini, also supports Masters. <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/andrew-anglin\"> Neo-Nazi Andrew Anglin</a> of the hate site The Daily Stormer <a href=\"https://www.azcentral.com/story/news/politics/elections/2022/07/01/trump-backed-senate-candidate-blake-masters-rejects-endorsement-of-neo-nazi-site-founder/7792690001/\"> wrote to his fans</a> about Masters in June:</p>\n<blockquote><p>I cannot give a more forceful endorsement, and I demand that anyone in Arizona (who is not some kind of known neo-Nazi or whatever) get in contact with his campaign and see what kind of help he needs.</p>\n</blockquote>\n<p>Hammer donated $500 to Masters in February, according to public records, and seven months later told <em>Newsweek</em>’s audience in explicit terms to vote for him.</p>\n<p>“If you are in Arizona and listening to this podcast, go ahead and vote for Blake Masters,” Hammer told <em>Newsweek</em>’s audience on a Sept. 5 podcast.</p>\n<p><em>Newsweek</em>’s opinion section has featured other Masters advocates. A man named Austin Stone has published at least four opinion pieces under Hammer’s leadership. Stone gave $5,800 to Masters’ campaign on Aug. 5, 2021, which is the maximum allowed. Stone hosted a fundraiser for Masters, which featured as guests a who’s who of radical right figures including <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/jack-posobiec\"> Posobiec</a>, the anti-LGBTQ, right-wing activist <a href=\"https://www.washingtonpost.com/education/2021/06/19/critical-race-theory-rufo-republicans/\"> Christopher Rufo</a>, and British disinformation hustler <a href=\"https://www.adl.org/blog/at-the-extremes-the-2020-election-and-american-extremism-part-1\"> Raheem Kassam</a>. All three of those men have contributed to <em>Newsweek</em> and boast ties to the Claremont Institute, who gave Hammer a fellowship in 2018. <em>Newsweek</em> also published the opinions of Nick Lindquist, a strategist for Stone’s consultancy firm. Lindquist donated $250 to Masters on Oct. 26, 2021.</p>\n<p>News articles on <em>Newsweek</em>’s own website underscore why their opinion editor’s advocacy of Masters might provoke concern.<em>Newsweek</em> reported in August 2021 that Masters railed against <a href=\"https://archive.ph/PYpxD\"> “anti-white”</a> racism, and this June that he blamed gun violence on <a href=\"https://archive.ph/orK7T\">“Black people,”</a> evoking talking points that white nationalists often embrace. <em>Newsweek</em> <a href=\"https://archive.ph/OMhsJ#selection-955.0-955.132\">reported</a> in June that Masters amplified unfounded conspiracies about the 2021 attack on the Capitol by asking, “Don’t we suspect that like one-third of the people outside of the Capitol complex on January 6 were actual FBI agents hanging out?” An <a href=\"https://archive.ph/zZ3Wz#selection-807.0-807.75\"> Aug. 29 <em>Newsweek</em> headline</a> also declared, “Blake Masters Suggests Female, Black and Gay Officials Hurting U.S. Economy,” referring to comments he made about employees of the Federal Reserve.</p>\n<h2>Newsweek opinion and shifting the ‘Overton window’</h2>\n<p>When searching Apple podcasts for “Newsweek,” several products <a href=\"https://www.documentcloud.org/documents/22337216-screen-shot-2022-09-13-at-11415-pm\"> surface</a>, but first among them is “The Josh Hammer Show,” Hammer’s weekly podcast. <em>Newsweek</em> positions a stream of “The Josh Hammer Show” <a href=\"https://www.documentcloud.org/documents/22337374-screen-shot-2022-09-13-at-11902-pm\"> on its homepage</a>. <em>Newsweek</em> also links to it a second time on the homepage through <a href=\"https://www.documentcloud.org/documents/22338277-screen-shot-2022-09-13-at-12254-pm\"> a clickable image</a>, meaning that casual visitors can listen to Hammer speak twice without even visiting the opinion section he runs.</p>\n<p><em>Newsweek</em> published the first episode of Hammer’s podcast on Feb. 1, and he used it to talk about how the purpose of his show would focus on building a political movement, rather than simply comment on the news, something that stands out from the work of opinion editors from publications that aspire to be mainstream. He used the phrase “[shifting] the Overton window” in describing the show, which refers to the idea of moving the culture to places where previously unthinkable political realities would emerge. Among many other places, writers for such racist, radical-right websites as <a href=\"https://www.documentcloud.org/documents/22415300-screen-shot-2022-09-14-at-34112-pm\"> VDARE</a> and <a href=\"https://www.documentcloud.org/documents/22415304-screen-shot-2022-09-14-at-34531-pm\"> American Renaissance</a> commonly write about shifting or destroying the current “Overton window.” Hammer suggested that the goal of his <em>Newsweek</em>-branded podcast is to workshop ways to defeat “the woke, illiberal left”:</p>\n<blockquote><p>We’re going to have a lot of great guests, we’re going to bring them on in a weekly fashion for you, we’re going to spruce in some monologues, some guest commentary, and what we’re going to be talking about here, this is a conservative podcast, we’re talking about conservatism, what is conservatism, what has conservatism been doing right, what has it been doing wrong, what has the Republican party, which obviously is the vehicle for conservatism, what has that been doing right, what has that been doing wrong, what needs to be changed. And it’s a really exciting time obviously to be engaged in this sort of conversation. I mean if you go back just a few years ago obviously 2016 Donald Trump comes out of nowhere, shakes up the world, absolutely obliterates the field in a highly contested presidential primary, slays all sorts of old orthodoxies, that proves that they were way more easily destroyful [sic] than anyone had previously thought, And that period of intellectual ferment, of all sorts of new thoughts, of Overton window shifting, of exploring new ideas. What is it that we really stand for? What do we want this to be about? How do we best form a movement? How do we best organize a political party? Ultimately of course for the goal of defeating the woke, illiberal left and ultimately saving America.</p>\n</blockquote>\n<p>The guests on Hammer’s show reliably advance pro-Trump, reactionary and sometimes overtly authoritarian viewpoints. Some of them, such as Michael Knowles, express hateful views of the LGBTQ+ community. Knowles, a pundit for Ben Shapiro’s The Daily Wire, used his appearance on the <em>Newsweek</em>-branded show to argue that he is within his rights to tell adult transgender women that they are not women. Knowles made the comment in the context of a discussion with Hammer about how conservatives could wield state power to enforce upon all people the values they hold.</p>\n<p>“What the new conservatives … are saying is: ‘No, I actually can tell the difference between a man and a woman. I actually can tell men that they shouldn’t mutilate themselves to look more like women,’” Knowles said on Hammer’s show.</p>\n<p>Hatewatch emailed Knowles to clarify whether he supported using state power to forbid adults from transitioning, but he did not respond by press time. Following initial publication of this story, he shared his response on Twitter. In his <a href=\"https://www.documentcloud.org/documents/23270444-screen-shot-2022-11-04-at-53920-pm\">comments</a>, Knowles confirms he does in fact support the use of state power to prevent adults from transitioning, comparing gender affirming surgery to cutting off the limbs of a hypothetical able-bodied person \"claiming to be a quadriplegic.\" On Twitter, Knowles said he emailed his response in September, but Hatewatch found no record of the correspondence.</p>\n<p>Hatewatch also emailed the question to <em>Newsweek</em>, but they ignored it. Through <em>Newsweek</em>, Hammer repeatedly argues for using wielding state power to enforce what he describes as conservative values. He has also argued for using the state not to better anyone’s life in particular, but to enact revenge on political opponents, as he wrote in Aug. 12 op-ed called “American Stasi,” referring to the defunct East German military police:</p>\n<blockquote><p>The imperative for conservatives is to respond not merely by tsk-tsking but by recognizing “what time it is” in this ailing, late-stage republic and to demonstrate a willingness to counter the Left’s brazen assaults with our own willingness to prudentially engage in escalatory, tit-for-tat, mutually assured destruction tactics. Sometimes, the only way out is through.</p>\n</blockquote>\n<p>In his op-ed written from Hungary, wherein <em>Newsweek</em> failed to disclose the purpose of his visit, Hammer described Viktor Orbán’s authoritarian Fidesz Party as a potential model for American politics. He argued in it for a “greater imperative to wield state power.” Fidesz has <a href=\"https://www.vox.com/policy-and-politics/2018/9/13/17823488/hungary-democracy-authoritarianism-trump\"> </a> <a href=\"https://www.vox.com/policy-and-politics/2018/9/13/17823488/hungary-democracy-authoritarianism-trump\"> levied</a> state power, as Hammer describes it, to <a href=\"https://cpj.org/2021/11/hungary-klubradio-andras-arato-loss-broadcast-license/\"> clamp down on press freedoms</a> and dissent.</p>\n<p>Hammer hosted Daniel Horowitz of The Blaze on April 5, who described vaccines that treat COVID-19 as a “bioweapon.” More specifically, Horowitz said that elites were “creating, foisting upon us viruses, blocking the treatment for it and then foisting another bioweapon upon us to treat it.” Hammer also featured Ann Coulter on June 14. Coulter has contributed regularly to the white nationalist website VDARE, <a href=\"https://www.splcenter.org/hatewatch/2021/04/25/chauvin-trial-inspires-racist-conspiracy-theories\"> including several pieces</a> defending Derek Chauvin, the police officer found guilty of murdering George Floyd. Coulter used her appearance to advocate for banning all legal immigration into the U.S.</p>\n<p>“We need a total moratorium on immigration,” Coulter said on her June 14 appearance on <em>Newsweek</em>’s podcast, echoing rhetoric that is familiar to <a href=\"https://www.splcenter.org/hatewatch/2019/11/12/stephen-millers-affinity-white-nationalism-revealed-leaked-emails\"> readers of white nationalist websites</a>.</p>\n<p><em>Newsweek</em> ignored questions Hatewatch asked about whether they knew they aired opinions including calling COVID-19 a bioweapon, advocating for the government to bar legal immigration into the U.S. and forbidding adults to be transgender. They also ignored questions about Hammer’s trip to Hungary.</p>\n<h2>Propaganda about civil war</h2>\n<p>Hammer repeatedly frames news events in terms of friends fighting enemies in a civil war. Hammer himself fights in the war he describes, along with his friends, according to his rhetoric. He often invites the listener along, talking about what “we” must do to defeat “our” enemies:</p>\n<blockquote><p>The onus for our side is … to call out the nonsense … to soberly recognize where we are in what appears to be a falling, decadent, late-stage republic and to act accordingly … to know what time it is … and to command our side’s battle stations accordingly … to go to battle in this roiling, cold civil war against our domestic foes.</p>\n</blockquote>\n<div data-embed-button=\"media\" data-entity-id=\"35287\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"fa190fae-20f5-4fb7-92ce-45af55fff3f6\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35287\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/jackposobiecgageskidmore-700pxjpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/jack_posobiec_gage_skidmore-700px.jpg\" width=\"700\" height=\"467\" alt=\"Jack Posobiec\" title=\"Jack Posobiec\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Jack Posobiec speaks with attendees at the 2020 Student Action Summit hosted by Turning Point USA at the Palm Beach County Convention Center in West Palm Beach, Florida. (Photo by Gage Skidmore)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Hammer made those comments on an Aug. 8 episode of his <em>Newsweek</em>-branded podcast, one in which hosted the extremist Posobiec, <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/jack-posobiec\"> </a> <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/jack-posobiec\"> a man primarily known</a> for spreading viral disinformation campaigns, such as Stop the Steal and Pizzagate. Posobiec has promoted and worked with antigovernment groups and hate groups who attacked the Capitol on Jan. 6, 2021, including the <a href=\"https://www.youtube.com/watch?v=HDSb02EJhDE\"> </a> <a href=\"https://www.youtube.com/watch?v=HDSb02EJhDE\"> Oath Keepers and Proud Boys</a><u>,</u> respectively. He also associates with <a href=\"https://www.splcenter.org/hatewatch/2020/07/22/oanns-posobiec-met-polish-neo-fascists-and-amplified-their-messages-online\"> </a> <a href=\"https://www.splcenter.org/hatewatch/2020/07/22/oanns-posobiec-met-polish-neo-fascists-and-amplified-their-messages-online\"> Polish neofascists</a>, and filmed far-right propaganda videos at least twice with a pair of terroristic, <a href=\"https://www.youtube.com/watch?v=r5j0JBItheA\">neo-Nazi</a> brothers. On Twitter, Hammer has called the racist internet performer <a href=\"https://www.documentcloud.org/documents/22415314-screen-shot-2022-09-14-at-35856-pm\"> </a> <a href=\"https://www.documentcloud.org/documents/22415314-screen-shot-2022-09-14-at-35856-pm\"> “a great American patriot.” </a></p>\n<p>Hammer and Posobiec spoke about the FBI’s retrieval of classified documents from Trump’s Mar-a-Lago residence in Florida, making conspiratorial assertions without offering evidence in support. “What do we do when the notion of equal justice under law is just crumbling before our very eyes?” Hammer asked Posobiec during that appearance. Posobiec then claimed of Attorney General Merrick Garland, “I don’t have any specific reporting on this but I like to think … he’s getting revenge” for Republicans blocking his Supreme Court candidacy in 2016. Hammer agreed with enthusiasm, replying: “It is vindictive. It is revenge.”</p>\n<div data-embed-button=\"media\" data-entity-id=\"35290\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"e96734fb-875c-4770-9df4-19869cf79c8e\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-left\">\n<div id=\"file-35290\" class=\"file file-image file-image-png\">\n<h2 class=\"element-invisible\"><a href=\"/files/joshhammertweetjackpwarroom-700pxpng\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/josh_hammer_tweet_jackp_war_room-700px.png\" width=\"700\" height=\"602\" alt=\"Hammer Posobiec tweet\" title=\"Hammer Posobiec tweet\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Josh Hammer thanked Jack Posobiec for hosting him on Steve Bannon’s &#039;War Room&#039; podcast in this Feb. 2 tweet. (Photo via Twitter)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>“[Trump] is unambiguously the victim here,” Hammer told Posobiec. “He is clearly the victim of an unprecedented sicking of federal law enforcement.”</p>\n<p><em>Newsweek</em> published the podcast more than two weeks before the Justice Department revealed a <a href=\"https://www.cnbc.com/2022/08/26/doj-reveals-redacted-affidavit-justifying-trump-mar-a-lago-raid.html\"> </a> <a href=\"https://www.cnbc.com/2022/08/26/doj-reveals-redacted-affidavit-justifying-trump-mar-a-lago-raid.html\"> highly-redacted copy</a> of the affidavit they used to justify the raid of Trump’s property. A few weeks after Hammer’s conversation with Posobiec, and the day after President Biden gave a Sept. 1 speech criticizing the <a href=\"https://www.splcenter.org/hatewatch/2021/12/30/one-year-after-jan-6-hard-right-digs\"> </a> <a href=\"https://www.splcenter.org/hatewatch/2021/12/30/one-year-after-jan-6-hard-right-digs\"> Trump-influenced</a> rebrand of the Republican Party, Hammer <a href=\"https://www.documentcloud.org/documents/22274618-screen-shot-2022-09-02-at-31746-pm\"> </a> <a href=\"https://www.documentcloud.org/documents/22274618-screen-shot-2022-09-02-at-31746-pm\"> tweeted out</a> comments framing America as a country at war, a common trope of <a href=\"https://www.splcenter.org/hatewatch/2020/08/27/fascist-underpinnings-pro-trump-media-interview-author-jason-stanley\"> </a> <a href=\"https://www.splcenter.org/hatewatch/2020/08/27/fascist-underpinnings-pro-trump-media-interview-author-jason-stanley\"> vintage fascist propaganda</a>:</p>\n<blockquote><p>No more ‘peace-time’ conservatism, people. Stop fighting last century’s war. Our side needs a lot of war time consiglieres, and we need them now.<em> </em> <em> </em></p>\n</blockquote>\n<h2>Hyping <em>2000 Mules </em> through <em>Newsweek</em></h2>\n<div data-embed-button=\"media\" data-entity-id=\"35318\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"2c9c5013-e840-4686-a915-d2ef9f8a48a6\" data-splc-media-url=\"Newsweek promotes radical right talking points through The Josh Hammer Show.\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35318\" class=\"file file-video file-video-youtube\">\n<h2 class=\"element-invisible\"><a href=\"/files/excerpts-newsweeks-hard-right-turn\"></a></h2>\n<div class=\"content\">\n<div class=\"media-youtube-video media-youtube-1\">\n<iframe class=\"media-youtube-player\" width=\"640\" height=\"390\" title=\"Excerpts from Newsweek&#039;s Hard Right Turn\" src=\"https://www.youtube.com/embed/TXFuPpPfxDo?wmode=opaque&amp;controls=&amp;rel=0\" name=\"Excerpts from Newsweek&#039;s Hard Right Turn\" frameborder=\"0\" allowfullscreen=\"\" id=\"Excerpts from Newsweek&#039;s Hard Right Turn\">Video of Excerpts from Newsweek&amp;#039;s Hard Right Turn</iframe></div>\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Newsweek promotes radical right talking points through The Josh Hammer Show.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Hammer hosted right-wing performer Dinesh D’Souza on the May 10 episode of his podcast to promote his book and accompanying film <em>2000 Mules</em>, which falsely allege that Biden defeated Trump in the 2020 election due to widespread fraud. Non-partisan fact checkers from across the journalism industry have <a href=\"https://www.reuters.com/article/factcheck-usa-mules/fact-check-does-2000-mules-provide-evidence-of-voter-fraud-in-the-2020-u-s-presidential-election-idUSL2N2XJ0OQ\"> debunked D’Souza’s premise</a>. Radical right publisher Regnery even <a href=\"https://www.npr.org/2022/09/08/1121648290/a-publisher-abruptly-recalled-the-2-000-mules-election-denial-book-npr-got-a-cop\"> pulled the book version</a> of <em>2000 Mules</em> from stores in September due to potentially “libelous” claims.</p>\n<p>“A mule is a paid operative that is hired, in our case, by a left-wing organization, to deliver fraudulent and illegal votes to a mail-in drop box. So, that’s what a mule is,” D’Souza said on <em>Newsweek</em>’s podcast, “The Josh Hammer Show.” “The mule is a middleman. The mule doesn’t come up with ballots. The mule goes to a left-wing organization, is handed a satchel or a backpack filled with ballots and then they go kind of on a route from one drop box to another, to another.”</p>\n<p>D’Souza continued, suggesting that operatives pick this strategy in order to avoid detection. Hammer made no effort to interrogate D’Souza during the conversation, allowing him to describe the plot of the book in detail. <em>Newsweek</em> never offered an update to that podcast to address concerns over the legitimacy of D’Souza’s claims.</p>\n<p>“We found in five states, or actually in the urban areas of five states, more than 2,000 mules,” D’Souza concluded. “The actual number of mules is vastly greater.”</p>\n<h2>Early warning signs from coup-plotter John Eastman</h2>\n<div data-embed-button=\"media\" data-entity-id=\"35288\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"a303e807-17f4-4eb9-a537-bf11a2de636e\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35288\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/johneastman2e1cd3d-700pxjpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/john_eastman_2e1cd3d-700px.jpg\" width=\"700\" height=\"467\" alt=\"John Eastman\" title=\"John Eastman\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Chapman University law professor John Eastman, next to U.S. President Donald Trump&#039;s personal lawyer Rudy Giuliani, gestures as he speaks while Trump supporters gather ahead of his speech to contest the certification by the U.S. Congress of the results of the 2020 U.S. presidential election in Washington, D.C., Jan. 6, 2021. (Photo via Reuters/Jim Bourg)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Hammer started working for <em>Newsweek</em> in May 2020. In August 2020, <em>The New Republic</em> labeled <em>Newsweek</em> a <a href=\"https://newrepublic.com/article/158968/newsweek-rise-zombie-magazine\"> “zombie magazine”</a> known for laundering “right-wing ideas and conspiracy theories.” <em>The New Republic</em>’s criticism followed Hammer’s opinion section publishing a now-infamous op-ed by lawyer John Eastman. Eastman floated in his <em>Newsweek</em> piece a legal argument for nullifying non-white, California-born Kamala Harris’s then-current vice presidential candidacy. Readers repeatedly called Eastman’s op-ed racist on social media and in comment sections. Employees of the publication complained internally, and Hammer, along with Cooper, applied multiple editors’ notes to Eastman’s post.</p>\n<p><em>Newsweek</em>’s editorial notes did not detail the significant overlap between Hammer and Eastman at University of Chicago Law School and in prominent reactionary advocacy groups. (<em>Newsweek</em> readers <a href=\"https://www.documentcloud.org/documents/23118791-screen-shot-2022-10-04-at-93525-pm\"> picked up on these connections</a> in the comments.) Both the Federalist Society and the Claremont Institute feature the two men on their websites. Hammer described Eastman as “my friend” on his <em>Newsweek</em>-branded podcast as recently as August. He has also referred to him as his friend <a href=\"https://www.documentcloud.org/documents/22416370-screen-shot-2022-09-15-at-125856-pm\"> on Twitter</a>. He wrote about Eastman’s influence on him in a Q&amp;A published on the <a href=\"https://archive.ph/YGyM9#selection-543.0-547.370\"> Claremont Institute’s website</a>, depicting him as a mentor figure:</p>\n<blockquote><p>I had heard of Claremont and the <em>Claremont Review of Books</em> going back at least as far back as college, but I first started hearing of friends applying to the John Marshall Fellowship when I was in law school at the University of Chicago. Given (University of Chicago Law alum) John Eastman’s long-standing leadership of the John Marshall program, the ties between that particular fellowship and Chicago are of course quite deep.</p>\n</blockquote>\n<p>Shortly after Hammer and <em>Newsweek</em> published Eastman’s op-ed, the lawyer pushed the Stop the Steal disinformation campaign and helped lay out a blueprint for Trump staging <a href=\"https://www.nytimes.com/2021/10/02/us/politics/john-eastman-trump-memo.html\"> a coup following his defeat in the election</a>. Hammer has portrayed Eastman on his podcast as a victim of a corrupt FBI, which he claims targets Trump supporters unfairly. (<a href=\"https://www.washingtonpost.com/national-security/2022/06/27/eastman-phone-seized-fbi-jan6/\">The FBI seized the embattled lawyer’s phone</a> this June.) Eastman has also involved himself in other anti-democracy activism, including lobbying the Supreme Court to adopt <a href=\"https://newrepublic.com/article/167285/independent-state-legislature-theory-elections\"> “independent state legislator theory,”</a> which would <a href=\"https://newrepublic.com/article/167721/john-eastman-independent-state-legislature\"> further advance gerrymandering</a> and weaken U.S. elections.</p>\n<p>Hammer speaks cagily about the outcome of the 2020 election on his <em>Newsweek</em> podcast. For example, he described the outcome of the 2020 election in Arizona as something “a lot of people had some very heated thoughts on, one way or the other.” Although that may be true of some people misled by a radical-right <a href=\"https://www.theatlantic.com/ideas/archive/2022/04/trump-voters-big-lie-stolen-election/629572/\"> disinformation campaign</a>, Biden unequivocally won Arizona. Even a <a href=\"https://www.npr.org/2021/09/24/1040327483/the-controversial-election-review-in-arizona-confirms-bidens-win\"> controversial and discredited</a> GOP-led attempt to recount ballots in the state found Biden ahead of Trump, and even added votes onto his total lead.</p>\n<p>Hammer called depictions of what happened on Jan. 6 as an attempted coup or insurrection to be “ludicrous” and “laughable, on its face,” during a 2022 episode of <em>Newsweek</em>’s “The Debate” podcast focused on the attack’s anniversary. He compared the attack, which left five people dead, to the anti-tax, 18<sup>th</sup>-century Whiskey Rebellion under George Washington, and suggested the majority of Trump supporters involved could be described as “peacefully rioting.”</p>\n<h2>Fallout with ‘The Debate’</h2>\n<p><em>Newsweek</em> claimed in their statement about Hammer to Hatewatch that he “has embraced the mission of ‘The Debate.’” However, Hammer’s name no longer appears as a co-host of the podcast of that name. <em>Newsweek</em> listed him as a co-host alongside veteran journalist Celeste Headlee as recently as the Jan. 6, 2021, episode in which he described pro-Trump Jan. 6 participants as “peacefully rioting.” Headlee continues to host “The Debate” alongside journalist Andrew Tallman.</p>\n<p>One month earlier, podcast producers had to edit out a conversation between him and his co-host at the time, Celeste Headlee. Headlee is a veteran journalist who has anchored NPR programs including “All Things Considered” and “Weekend Edition.”</p>\n<p><em>Newsweek</em>’s “The Debate” podcast featured two guests during its Dec. 3, 2021, episode: reactionary YouTube performer Dave Rubin and libertarian journalist Nick Gillespie. The episode ostensibly focused on the sustainability of our two-party political system in the U.S. Rubin quickly tilted the conversation to attack what he described as “woke” people.</p>\n<p>Headlee objected to Rubin using the slang word “woke” to generalize about people with whom he disagrees, noting the term’s origins in the Black community, and said, “I’m the only person of color here.” (Headlee’s family lineage is Black and Jewish.) Hammer interjected to endorse what he perceived to be the soundness in using the term, describing it as an “illiberal, leftist ideology.” In the unedited version, Rubin said, “You’re a woman of color, what color are you?” according to Headlee.</p>\n<p>“It kind of devolved from there,” Headlee said to Hatewatch. “Josh was upset. He felt that I had embarrassed him in front of his friends.”</p>\n<p>Headlee said Hammer did not apologize but instead expected an apology from her. Hatewatch reached out to Rubin through an email address belonging to his publicist, and on Sept. 15, he tweeted out a response to his followers criticizing SPLC as a “far-left hate group.” He also belittled Headlee, calling her “the girl” and added that “she looked white to me, and I honestly can’t remember what she said.” (Hammer <a href=\"https://www.documentcloud.org/documents/22415389-screen-shot-2022-09-14-at-52608-pm\"> responded</a> by liking the tweet.) A day later, Rubin continued on Twitter, posting photos of Headlee, asking his followers to determine her race.</p>\n<p>“I’ve been a journalist for a very long time,” Headlee told Hatewatch of the incident on <em>Newsweek</em>’s “The Debate” podcast. “It was a very uncomfortable position to be in. It was uncomfortable and it was … upsetting. It was an upsetting situation.”</p>\n<p><em>Newsweek</em> did not respond to questions about Hammer’s interaction with Headlee. The publication gave him his solo podcast show a little less than two months later.</p>\n<h2>Accusations of special treatment for Hammer</h2>\n<p>Hatewatch interviewed over two dozen current and former <em>Newsweek</em> employees, most of whom intersected with Hammer, and the feedback they gave about him and his worldview was universally negative. Employees, the majority of whom declined to be named, citing conditions of <em>Newsweek</em>’s contract, described the company’s managerial staff as giving Hammer preferential treatment and a kind of celebrity status, which they did not believe his resume or contribution warranted. One former <em>Newsweek</em> reporter, Benjamin Fearnow, told Hatewatch by phone that Hammer made suggestions to him over the Slack messaging platform about how he should write his news articles, making recommendations to cite reactionary academics in a <em>Newsweek</em> section over which he had no authority. <em>Newsweek</em> did not answer a question about Fearnow’s claim.</p>\n<p>The employees also said managers, such as editor Nancy Cooper and chief content officer Dayan Candappa, indulged Hammer’s involvement in radical-right politics, while striking a markedly different tone with other employees. Far from labeling itself as an activist organization, <em>Newsweek</em> has warned writers in multiple meetings and on email chains about publicly supporting political causes, employees said. K. Thor Jensen, a <a href=\"https://www.documentcloud.org/documents/22277245-screen-shot-2022-09-08-at-15039-pm\"> former <em>Newsweek</em> employee</a>, told Hatewatch that the publication’s editor Cooper fired him over his use of social media in February 2020. Jensen’s editor had recently started a conversation with him over violating a policy of advocating political support for left-leaning causes. Nicole Goodkind, now a reporter for CNN Business, recalled to Hatewatch a meeting in fall 2018, during the runup to midterm elections, wherein <em>Newsweek</em>’s leadership warned employees against promoting political views online. Four other employees also recalled the meeting she described.</p>\n<p>“<em>Newsweek</em> has a firm policy of newsroom editors and [reporters] not donating to political campaigns. This does not apply to those in the opinions section,” LBG PR told Hatewatch.</p>\n<p>In addition to the details previously mentioned about Hammer’s advocacy of Blake Masters, both in and out of <em>Newsweek</em>, he has also repeatedly hyped him on Twitter.</p>\n<p>“Huge congrats to [Blake Masters], a real political talent who is going to be a tremendous force for good as a U.S. Senator,” Hammer posted to Twitter on Aug. 3, after Masters won the GOP Primary in his state. “Let’s retire Mark Kelly,” he wrote of his Democratic opponent, the husband of <a href=\"https://www.indiewire.com/2022/03/gabby-giffords-wont-back-down-interview-mark-kelly-1234706619/\"> assassination attempt survivor</a> Gabby Giffords.</p>\n<h2>Poynter relationship and ‘journalism in a for-profit world’</h2>\n<p>Journalism experts have raised concerns about <em>Newsweek</em>’s business practices for years, dating back to before they formed a partnership with Poynter in April 2019. When <em>Newsweek</em> formed the relationship with Poynter, <em>Columbia Journalism Review</em> had already started work on <a href=\"https://www.cjr.org/special_report/newsweek.php\"> an investigative story</a> called “Dropshipping Journalism,” which detailed how the company’s financial troubles harmed its quality of reporting and dealt a blow to the mental health of the employees delivering that reporting.</p>\n<p>Hatewatch reached out to Poynter about <em>Newsweek</em>’s opinion section on July 7, regarding Hammer’s connections to Blake Masters, and media business analyst Rick Edmonds responded. Edmonds said that while some publications with a clearly understood political slant, like <em>The Nation</em> or <em>The National Review</em>, might tolerate involvement in a political campaign, <em>Newsweek</em>’s treatment of Hammer’s political activism would be considered highly unorthodox.</p>\n<p>“<em>Newsweek</em>’s current owners are trading on its name, and it is not at all news that the company has gotten into financial trouble,” Edmonds said, regarding Hammer’s involvement in hard right causes and activism. “If the selling point is that this is <em>Newsweek</em> like you remember <em>Newsweek</em>, it’s especially deceptive.”</p>\n<p>Days later, <em>Newsweek</em> introduced Hatewatch to Kelly McBride, a senior vice president and the chair of the Craig Newmark Center for Ethics and Leadership at Poynter. In 2018, McBride <a href=\"https://www.poynter.org/newsletters/2018/what-we-do-with-money-from-the-koch-foundation/\"> defended</a> Poynter’s use of money donated from Koch Industries, owned by the reactionary billionaire Charles Koch, from criticism. In response to Edmonds’ comments, McBride told Hatewatch that analysts at Poynter were permitted to have differences of opinion. After Hatewatch relayed details about Hammer’s promotion of radical-right talking points and politicians, McBride said that she would look into some of the details published in this investigation.</p>\n<p>“The advice I have given <em>Newsweek</em> is with the understanding that they intend and aspire to be a credible national news source and that they want to use their name and their brand for good,” McBride said of Hammer on July 12. “I’m going to call them up and get some more details on this.”</p>\n<div data-embed-button=\"media\" data-entity-id=\"35291\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"6a21ee55-0cc2-46eb-95fb-60cff813ce53\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-left\">\n<div id=\"file-35291\" class=\"file file-image file-image-png\">\n<h2 class=\"element-invisible\"><a href=\"/files/joshhammertweetgovrondesantis-700pxpng\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/josh_hammer_tweet_govrondesantis-700px.png\" width=\"700\" height=\"726\" alt=\"Hammer and DeSantis\" title=\"Hammer and DeSantis\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Josh Hammer (left) and Florida Gov. Ron DeSantis pose in January. (Photo via Twitter)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Hatewatch followed up with McBride two months later, on Sept. 12, after Hammer brought the neo-Nazi collaborator and disinformation specialist Posobiec onto his podcast and ranted about going “to battle in this roiling, cold civil war against our domestic foes,” referring to other Americans with whom he shared political disagreements. Hatewatch asked McBride about her discussions with <em>Newsweek</em> and whether she found it ethical for Hammer to ask <em>Newsweek</em>’s audience in Arizona directly to vote for Blake Masters.</p>\n<p>“So … they haven’t asked me to look at that,” McBride said. “I can say generically, and if you use this, make sure you use this in the proper context of ‘generically,’ we work with a lot of clients who engage in a lot of practices that are outside the work of our consultancy. And, you know, that is … that is journalism, you know, in a for-profit world.”</p>\n<p>Hatewatch asked McBride if Poynter would take money from Gateway Pundit, the notorious website that publishes hard-right disinformation, including lies about the 2020 election and stories that <a href=\"https://archive.ph/otZZt\">recycle propaganda</a> from the <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/group/proud-boys\">Proud Boys</a>.</p>\n<p>“Gateway Pundit has never called and asked for help, but we would take the phone call,” McBride said.</p>\n<p>Hatewatch asked if Poynter would then take money from Gateway Pundit after taking a phone call of this nature.</p>\n<p>“If they wanted to get better on ethics, yeah,” McBride said.</p>\n<p>Hatewatch reached out to other experts in journalism for context about Hammer’s employment and political activity. Few agreed to comment on the record and no one spoke favorably of Hammer. Some responded by simply dismissing the credibility of <em>Newsweek</em> outright. New York University journalism instructor Jay Rosen referred Hatewatch to a tweet he issued in response to a <em>Newsweek</em> opinion piece authored by Donald Trump Jr. with the headline, <a href=\"https://www.documentcloud.org/documents/22924766-screen-shot-2022-09-25-at-50138-pm\"> “Trump was right about everything,”</a> from March 16.</p>\n<p>“<em>Newsweek</em> is not a thing. It’s like an animal that lives in the discarded shell of another animal,” <a href=\"https://www.documentcloud.org/documents/22924768-screen-shot-2022-09-25-at-64156-pm\"> Rosen wrote</a>.</p>\n<p><em> Megan Squire contributed to this reporting.</em></p>\n<p><i>Editor&#039;s note: This story has been updated to include comment from Michael Knowles, who posted his response on Twitter following initial publication. He also said on Twitter that he sent his reply in September, but Hatewatch found no record of the email.</i></p>\n<p><em>The author, Michael Edison Hayden, worked for </em> Newsweek <em> from September 2017 to May 2018, covering far-right extremism as a beat from the publication’s politics desk. He also appeared as a source in the </em> Columbia Journalism Review<em> feature about </em>Newsweek<em>, </em> <a href=\"https://www.cjr.org/special_report/newsweek.php\"> <em>“Dropshipping Journalism.”</em> </a></p>\n<p><em>Hayden reported for </em> Newsweek <em> on some of the radical right figures mentioned in this story, including </em> <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/individual/jack-posobiec\"> <em>the extremist Jack Posobiec</em></a> on multiple occasions<em>.</em></p>\n<p><em>Photo illustration by SPLC</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-person field-type-entityreference field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><article id=\"node-15258\" class=\"node node-person node-teaser node-odd\">\n\n  \n  <div class=\"content\">\n    <div class=\"group-text-field-group\"><div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><a href=\"/about/staff/michael-edison-hayden\">Michael Edison Hayden</a></div>\n      </div>\n</div>\n</div>  </div> <!-- /content -->\n\n  \n      <div class=\"links\">\n          </div> <!-- /links -->\n  \n  </article> <!-- /article #node --></div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Newsweek Embraces the Anti-Democracy Hard Right - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/hatewatch/2022/11/04/newsweek-embraces-anti-democracy-hard-right\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 04, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Mon, 31 Oct 2022 18:25:07 +0000",
  "dc:creator": "chris.heller_1541",
  "guid": "17203 at https://www.splcenter.org"
}