{
  "title": "Monitoring a Pregnancy at Home With a Smartphone",
  "link": "https://spectrum.ieee.org/pregnancy-heartbeat-monitor-smartphone",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-smiling-pregnant-woman-sitting-on-a-couch-and-looking-at-her-phone.jpg?id=31802228&width=1200&height=600&coordinates=0%2C0%2C0%2C1251\"/><br/><br/><p><em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em></p><p>Although a pregnancy is an exciting time for expecting parents, it can involve many trips to a doctor’s office to monitor the health of the fetus. Currently, the most common method for monitoring the heartbeat of a fetus is through an ultrasound test—which requires not only a visit to a doctor’s office but also the expertise of a trained technician. </p><p>In the search for a simpler approach, researchers have developed a novel system that includes a wearable device, a smartphone, and an algorithm that could offer at-home monitoring of a fetus’s cardiac health. The new algorithm, dubbed Lullaby, is described in a <a href=\"https://ieeexplore.ieee.org/document/9863638\" rel=\"noopener noreferrer\" target=\"_blank\">study</a> published on 19 August in <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7782634\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Sensors Letters</em></a>.</p><p>The wearable device involves a patch that’s placed on the abdomen of a pregnant user in addition to electrodes that monitor the electrocardiogram (ECG) signals from the fetus. The device also includes a microcontroller that processes the signals and sends them via Bluetooth to a smartphone or watch. Users can then view the data on an app.</p><p>However, a major challenge with this type of tech is that continuous ECG monitoring involves a lot of data to process, which has made real-time monitoring with wearable devices challenging. The new Lullaby algorithm addresses this issue. </p><p>“Lullaby was made to push the boundaries of the field by creating an algorithm that could process high-resolution ECG in real time and on a wearable device,” explains Daniel Jilani, an undergraduate researcher at University of California, Irvine, who co-led the development of this technology.</p><p>The system works by exploiting the fact that a heartbeat has a steady rhythm. The device uses this temporal pattern to better distinguish between true and false heartbeats, thereby focusing its computational power more on the heartbeats themselves, rather than the cardiac activity between heartbeats. This approach reduces the amount of computation required to process the data and extract the fetal heartbeats.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e687fd62b1ec16a2de1d55a21a68ade9\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2ff6a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/this-fetal-cardiac-monitoring-system-uses-a-patch-with-electrodes-which-record-the-abdominal-ecg-signals-of-a-pregnant-user-th.png?id=31786813&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">This fetal cardiac-monitoring system uses a patch with electrodes, which record the abdominal ECG signals of a pregnant user. The novel system is currently being developed jointly by Sensoriis and HERO Laboratory.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Tai Le</small></p><p>In their study, the researchers used a data set of abdominal ECG recordings to test the Lullaby approach against other existing ECG-processing algorithms, finding it to be nearly seven to 1,000 times as fast as these existing options.<br/></p><p>“In terms of power, we believe that the algorithm is efficient enough to run continuously [on a smartphone] for days or weeks,” says Jilani. “In terms of RAM memory, the Lullaby algorithm uses memory on the scale of kilobytes, meaning it can run on memory-limited devices such as microcontrollers and smartwatches.”</p><p>The researchers do not yet know how accurate the Lullaby approach is compared to a traditional ultrasound test, but they note that ultrasound devices are less accessible, more expensive, and more difficult to operate than an ECG. What’s more, ultrasound tests are done during a visit to the doctor’s office, whereas a wearable ECG device can provide more continuous monitoring as a pregnant user goes about their normal day. Significantly, this technology could be especially impactful by making fetal heart monitoring more accessible to low-income and disadvantaged communities, Jilani notes. </p><p>Since this initial study, Jilani says the team has already greatly improved the algorithm to be more accurate and faster than the original version, and they are working toward implementing it in a full system. This includes work on a mobile app that can be used on smart phones to support fetal heart monitoring. </p><p>They have a provisional joint patent on the Lullaby algorithm with the University of California, Irvine, and have teamed up with a sponsoring company, <a href=\"https://sensoriis.com/\" target=\"_blank\">Sensoriis</a>, to produce a novel fetal cardiac-monitoring system that uses it. </p>",
  "pubDate": "Thu, 22 Sep 2022 18:43:44 +0000",
  "guid": "https://spectrum.ieee.org/pregnancy-heartbeat-monitor-smartphone",
  "category": [
    "Pregnancy",
    "Ecg",
    "Fetus",
    "Journal watch"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}