{
  "id": "tag:blogger.com,1999:blog-37798047.post-6542937840234381358",
  "published": "2021-10-10T20:35:00.002-04:00",
  "updated": "2021-10-10T20:35:49.145-04:00",
  "title": "100 terabyte home NAS",
  "content": "<p>So, as a nerd, let's say you need 100 terabytes of home storage. What do you do?</p><p>My solution would be a commercial NAS RAID, like from <a href=\"http://amazon.com/dp/B095NW9576\">Synology</a>, <a href=\"https://www.amazon.com/dp/B08P42JR89\">QNAP</a>, or <a href=\"https://www.amazon.com/dp/B07Y2BJWLT\">Asustor</a>. I'm a nerd, and I have setup my own Linux systems with RAID, but I'd rather get a commercial product. When a disk fails, and a disk will always eventually fail, then I want something that will loudly beep at me and make it easy to replace the drive and repair the RAID.</p><span><a name='more'></a></span><p>Some choices you have are:</p><p></p><ul style=\"text-align: left;\"><li>vendor (Synology, QNAP, and Asustor are the vendors I know and trust the most)</li><li>number of bays (you want 8 to 12)</li><li>redundancy (you want at least 2 if not 3 disks)</li><li>filesystem (btrfs or ZFS) [not btrfs-raid builtin, but btrfs on top of RAID]</li><li>drives (NAS optimized between $20/tb and $30/tb)</li><li>networking (at least 2-gbps bonded, but box probably can't use all of 10gbps)</li><li>backup (big external USB drives)</li></ul><p></p><p>The products I link above all have at least 8 drive bays. When you google \"NAS\", you'll get a list of smaller products. You don't want them. You want somewhere between 8 and 12 drives.</p><p>The reason is that you want <b>two-drive redundancy</b>&nbsp;like RAID6 or RAIDZ2, meaning two additional drives. Everyone tells you one-disk redundancy (like RAID5) is enough, they are wrong. It's just legacy thinking, because it was sufficient in the past when drives were small. Disks are so big nowadays that you really need two-drive redundancy. If you have a 4-bay unit, then half the drives are used for redundancy. If you have a 12-bay unit, then only 2 out of the 12 drives are being used for redundancy.</p><p>The next decision is the filesystem. There's only two choices, <i>btrfs</i>&nbsp;and <i>ZFS</i>. The reason is that they both <b>healing</b>&nbsp;and <b>snapshots</b>. Note btrfs means btrfs-on-RAID6, not btrfs-RAID, which is broken. In other words, btrfs contains its own RAID feature that you don't want to use.</p><p>Over long periods of time, errors creep into the file system. You want to scrub the data occasionally. This means reading the entire filesystem, checksuming the files, and repairing them if there's a problem. That requires a filesystem that checksums each block of data.</p><p>Another thing you want snapshots to guard against things like ransomware. This means you mark the files you want to keep, and even if a workstation attempts to change or delete the file, it'll still be held on the disk.</p><p>QNAP uses ZFS while others like Synology and Asustor use btrfs. I really don't know which is better.</p><p>It's cheaper to buy the NAS diskless then add your own disk drives. If you can't do this, then you'll be helpless when a drive fails and needs to be replaced.</p><p>Drives cost between $20/tb and $30/tb right now. This <a href=\"https://www.anandtech.com/show/12075/best-consumer-hdds\">recent article</a> has a good buying guide. You probably want to get a NAS optimized hard drive. You probably want to double-check that it's CMR instead of SMR -- SMR is \"shingled\" vs. \"conventional\" magnetic recording. SMR is bad. There's only three hard drive makers (Seagate, Western Digital, and Toshiba), so there's not a big selection.</p><p>Working with such large data sets over 1-gbps is painful. These units allow 802.3ad link aggregation as well as faster Ethernet. Some have 10gbe built-in, others allow a <a href=\"https://www.amazon.com/dp/B07G9N9KJT\">PCIe adapter</a> to be plugged in.</p><p>However, due to the overhead of spinning disks, you are unlikely to get 10gbps speeds. I mention this because 10gbps copper Ethernet sucks, so is not necessarily a buying criteria. You may prefer multigig/NBASE-T that only does 5gbps with relaxed cabling requirements and lower power consumption.</p><p>This means that your NAS decision is going to be made with your home networking decision. I use a couple of these <a href=\"https://amazon.com/dp/B075Q6NPM2\">multigig switches</a> as something that doesn't cost too much for home networking.</p><p>Even though RAID is pretty darn reliable, you still need a backup solution. The way I do this is wither <a href=\"https://www.amazon.com/dp/B08KTRBHP1\">external USB hard drives</a>. I schedule the NAS to backup to those drives automatically. As a home user, tapes aren't an effective solution, so you are stuck with USB drives.</p><p>In the end, this means that your total storage costs, with the NAS server, the drives, and the backup drives, is going to cost you 3x the price of the raw storage. Spinning drives fail often. If you plan on keeping your data around for the next decade, there's no way to do this without 3x the cost for storage.</p><p>I choose Synology because I have the most familiarity with the software, and its software gets the best reviews. But QNAP and Asustor also have great reputations.&nbsp;</p><p>Note that I've made the assumption here that you'll want \"desktop NAS\" solutions. There are also rackmount solutions available.</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 2
}