{
  "title": "North Korea fires missiles near South&#039;s sea border",
  "link": "https://www.rt.com/news/565772-north-korea-missile-seoul/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565772-north-korea-missile-seoul/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6361f33585f5402ed14829de.jpg\" /> North Korea has fired at least 10 ballistic missiles in a show of force to the South, with one munition crossing a de facto sea border <br/><a href=\"https://www.rt.com/news/565772-north-korea-missile-seoul/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The South Korean military denounced the show of force as “intolerable”</strong></p>\n            \n                        \n            <p>North Korea has launched at least&nbsp;ten ballistic missiles from areas along its coast, including one munition which crossed a de facto maritime border separating the two Koreas for the first time since the 1950s. The move comes just one day after Pyongyang denounced the ongoing war games between Washington and Seoul and vowed to take <em>&ldquo;powerful measures&rdquo;</em> in response.</p>\n<p><strong></strong>After announcing an initial volley of <a href=\"https://en.yna.co.kr/view/AEN20220307009054325?section=nk/nk\" target=\"_blank\" rel=\"noopener noreferrer\">three missiles</a> earlier on Wednesday, the South Korean military&rsquo;s Joint Chiefs of Staff noted that <a href=\"https://en.yna.co.kr/view/AEN20221102005300325?section=nk/nk\" target=\"_blank\" rel=\"noopener noreferrer\">at least&nbsp;ten&nbsp;projectiles</a> of <em>&ldquo;various types&rdquo;</em> were fired into the East and West Seas. At least three were said to be short-range ballistic missiles (SRBMs), one of which entered a buffer zone between the two sides.</p>\n<p><em>&ldquo;North Korea's missile launch &ndash; which marks the first time since the division of the peninsula that [any missiles have] landed near our territorial waters south of the Northern Limit Line &ndash; is very rare and intolerable,&rdquo;</em> the Joint Chiefs said in a press release cited by Yonhap, adding that the military would <em>&ldquo;respond firmly to this provocation.&rdquo;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6360a36f2030274d80227d7d.jpg\" alt=\"FILE PHOTO: North Korean flags are carried during a celebration of the nation&#039;s 73rd founding anniversary in Pyongyang, North Korea, September 9, 2021.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565703-north-korea-nuclear-plans/\">North Korea claims US has put ‘nuclear script’ into ‘final Stage’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>According to the military, the SRBM landed in the sea 26km (16 miles) south of the Northern Limit Line, which was established as the tentative maritime border between the North and South in 1953 following the Korean War &ndash; a conflict that was never officially concluded with a formal treaty.</p>\n<p>Though the missile fell far short of land, the launch nonetheless set off air raid sirens on South Korea&rsquo;s Ulleungdo Island, prompting panicked residents to take shelter, Yonhap reported.</p>\n<p>The show of force came amid the week-long &lsquo;Vigilant Storm&rsquo; exercise held by the&nbsp;US and South Korea, which will see hundreds of aircraft perform more than 1,600 practice sorties and other aerial maneuvers. Pyongyang has denounced the drills as provocative, even suggesting they could be preparation for a nuclear attack on North Korea.</p>\n<p>The &lsquo;Vigilant Storm&rsquo; drills follow several other rounds of war games between Washington and Seoul in recent months, some also involving Tokyo, all of which have been condemned by the North as rehearsals for an invasion. Pyongyang has responded with a record number of weapons tests this year, stoking fears among US and South Korean officials that it could be preparing to carry out another nuclear test.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565634-south-korea-us-air-exercises/\">\n            <span>READ MORE: </span>South Korea and US kick off major war games\n        </a>\n    </p>\n\n    \n",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 04:37:04 +0000",
  "dc:creator": "RT"
}