{
  "title": "Changing of the Guard: Can Musk Deliver on His Promises for Free Speech and Information?",
  "link": "https://mises.org/node/60822",
  "description": "<p>Elon Musk’s <a href=\"https://www.reuters.com/markets/deals/elon-musk-completes-44-bln-acquisition-twitter-2022-10-28/\">takeover</a> of Twitter and his immediate firing of top brass represents a potential weakening of the Big Digital woke cartel that controls information, censors content, censures and bans users, and serves as a propaganda arm of leftist totalitarian statists. Given their cooperation with and promotion of leftist statism, it is more than evident that Twitter, Facebook, Google, and others have served as state apparatuses, as what I <a href=\"https://mises.org/wire/google-election\">have called</a> “governmentalities.” Musk’s takeover not only represents a potential blow to the woke cartel but also to the globalist statists whom it so assiduously serves.</p>\n<p>I have <a href=\"https://mises.org/wire/elon-musks-twitter-gambit-and-what-it-means-clique-power\">argued</a> that Musk’s Twitter gambit represents an important test case for the woke cartel because it pits “the world’s richest man” against these agents of the state. Musk’s takeover will now demonstrate just how much this cartel and the statists they support can manage to infringe property rights by controlling what Musk can do with his own property.</p>\n<p>Already the European Union [EU] is threatening Musk with control of Twitter’s content. After Musk <a href=\"https://twitter.com/elonmusk/status/1585841080431321088\">tweeted</a> “the bird is freed,” EU industry chief Thierry Breton <a href=\"https://twitter.com/ThierryBreton/status/1585902196864045056\">tweeted</a> “[i]n Europe, the bird will fly by our EU rules.\" Breton was indirectly referring to the EU’s <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_2545\">Digital Services Act</a>, which aims to ban “illegal and harmful content” across Europe.</p>\n<p>But the Digital Services Act threatens to universalize content moderation by social media and search engines, subjecting them to the EU’s stringent and anti-free-speech laws against “disinformation” and “hate speech,” which are not (yet) recognized legal categories in the United States. Given that Twitter will be forced to abide by EU-enforced content moderation for its EU users, it is possible that it will simply apply the Digital Services Act’s rules to all content—unless Twitter builds algorithms that allow it to distinguish between EU-originated posts and those deriving from elsewhere.</p>\n<p>Shortly after Musk moved to buy Twitter, several dozen countries and international governance bodies—including the U.S. and EU—announced the <a href=\"https://www.state.gov/wp-content/uploads/2022/04/Declaration-for-the-Future-for-the-Internet.pdf\">ratification of the “Declaration for the Future of the Internet,</a>” which, among other things, aims to “bolster resilience to disinformation and misinformation, and increase participation in democratic processes [sic].” Two days after Musk announced that he was buying Twitter, the Biden administration <a href=\"https://thepostmillennial.com/breaking-biden-administration-creates-disinformation-governance-board-under-dhs-to-fight-misinformation\">announced</a> the formation of a “Disinformation Governance Board,” which has since been scrapped, at least for now.</p>\n<p>It’s not as if the woke cartel and the leftist totalitarian statism that it supports are going to simply take Musk’s incursion into major social media ownership laying down. This fight will show how important information control is to “<a href=\"https://mises.org/library/road-totalitarianism\">the clique in power</a>.”</p>\n<p>Musk is by no means a model for free market libertarians, but his takeover and remodeling of Twitter is no less a significant eventuality in the struggle for liberty against the woke cartel and the state that it supports. What happens on Twitter will not only be a test of Musk’s sincerity and resolve but also of the power of the woke cartel’s regime for enforcing state dictates and narratives.</p>\n<p>I am one of the <a href=\"https://www.legitgov.org/michael-rectenwalds-appeal-twitter-after-musk-takeover\">recent victims</a> of Twitter’s cancellation of dissident voices. I believe I was cancelled because I argued that the transgender movement is part of a neo-Malthusian depopulation regime (while also a means for dismantling the family). Now that Musk is at the helm, I am hoping for reinstatement (and verification). But I’m not holding my breath.</p>\n\n",
  "author": "Michael Rectenwald",
  "enclosure": "",
  "guid": 60822,
  "pubDate": "Mon, 31 Oct 2022 06:00:00 -0500",
  "source": "Mises Wire"
}