{
  "title": "545: Can Anyone Tell The Phelps Twins Apart? And Fans React to the Reunion",
  "link": "https://audioboom.com/posts/8010308",
  "itunes:episode": 545,
  "itunes:title": "Can Anyone Tell The Phelps Twins Apart? And Fans React to the Reunion",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3597,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>We open up our Muggle Mail bag for the first time in 2022, as we take listener feedback on  the <em>Harry Potter 20th Anniversary: Return to Hogwarts</em> reunion special! You wont want to miss our Top 10 Outtakes That We Don’t Know For Sure Happened During the Reunion But They Totally Did! Plus, did Andrew predict Jacob getting a wand five years ago?!? And speaking of Jacob, next week we return to our Fantastic Beasts character discussions, so <a href=\"https://mugglecast.com/contact/\">send us your feedback</a>!<br>\n<br>\n\n</div>\n<ul>\n<li>What did we miss during our <a href=\"https://mugglecast.com/episode-544-harry-potter-reunion-special-review/\">Reunion Special episode</a>? Where was Steve Kloves? Why did Emma Roberts make a cameo? Can Warner Bros. tell the Phelps twins apart?</li>\n<li>MuggleCast’s Top 10 Outtakes That We Don’t Know For Sure Happened During the Reunion But They Totally Did</li>\n<li>Muggle Mail, Muggle Mail, Muggle Mail! Listeners sound off on <a href=\"http://www.facebook.com/mugglecast\">Facebook</a>, <a href=\"http://www.twitter.com/mugglecast\">Twitter</a> and <a href=\"http://www.instagram.com/mugglecast\">Instagram</a> on everything from Tom Felton and Emma Watson to Dan Radcliffe and Helena Bonham Carter!</li>\n<li>Voicemails cover Michael Gambon, Robbie Coltrane and the In Memoriam</li>\n<li>Andrew predicted Jacob having a wand on Episode 311... and we have the proof!</li>\n<li>One listener convinces us we ARE headed to Rio in Secrets of Dumbledore</li>\n<li>Could Jacob be in possession of the Elder Wand?</li>\n<li>2006 Throwback Email: Did Nicolas Flamel and Dumbledore swap places?</li>\n<li>Quizzitch: This Phelps twin, who plays Fred, in real life has a scar on his left eyebrow. Name the Phelps twin. <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>This week's episode is brought to you by <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp</a> (get 10% off your first month) and <a href=\"http://www.masterclass.com/mugglecast\">MasterClass</a> (get 15% off an annual membership)!</li>\n</ul>\n",
  "pubDate": "Tue, 11 Jan 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-01-10:/posts/8010308",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}