{
  "title": "S13 Ep119: Haunted World War II: Soldier Spirits, Ghost Planes, and Strange Synchronicities",
  "link": "https://audioboom.com/posts/8098656",
  "itunes:episode": 119,
  "itunes:title": "Haunted World War II: Soldier Spirits, Ghost Planes, and Strange Synchronicities",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5371,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS Time Travels today to witness Haunted World War II: Soldier Spirits, Ghost Planes, and Strange Synchronicities with Matthew L. Swayne<br>\n<br>\nToday you will discover battlefields in Europe and invasion sites in the South Pacific where the spirits of soldiers, sailors, and civilians return again and again to recreate their last moments, unable—or unwilling—to let the past go.<br>\n <br>\nPLUS a NEW Theater of the Mind and a BONUS Classic Theater of the Mind at the end of the show!<br>\n<br>\nSupport show & our sponsor's for Great Deals!<br>\n<br>\nWalk in comfort & style with THE BEST socks in the History of feet, BOMBAS!<br>\nListeners get 20% off their first order at <a href=\"http://www.Bombas.com/Darkness\">www.Bombas.com/Darkness</a><br>\nAnd use code DARKNESS at check out<br>\n<br>\n<a href=\"http://www.UnTuckit.com\">www.UnTuckit.com</a> use Promo Code: Darkness to save 20% on your first order<br>\n<br>\nSign up now with <a href=\"http://Pluto.tv\">Pluto.tv</a> for the leader in FREE Streaming Television, over 100 free TV channels & 1000's of of free movies On Demand <a href=\"http://www.Pluto.tv\">www.Pluto.tv</a><br>\n<br>\nLadies, the future of at-home hair color is here with Madison Reed - Gorgeous salon-quality hair color delivered right to your door for less than $25!<br>\n<br>\nFind your perfect shade at <a href=\"http://www.Madison-Reed.com\">www.Madison-Reed.com</a> & get 10% off and free shipping with code: DARKNESS at checkout",
  "itunes:summary": "BEYOND the DARKNESS Time Travels today to witness Haunted World War II: Soldier Spirits, Ghost Planes, and Strange Synchronicities with Matthew L. Swayne\n\nToday you will discover battlefields in Europe and invasion sites in the South Pacific...",
  "pubDate": "Sun, 30 Sep 2018 08:00:00 +0000",
  "guid": "9a28d2ad-1765-4654-a0b9-ec3c71a9f796",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}