{
  "title": "Episode 48: Classroom Management - An Interview with Dr. Ross Green part1",
  "pubDate": "Sat, 01 Mar 2008 23:24:50 +0000",
  "guid": "episode-48-classroom-management-an-interview-wi",
  "link": "http://www.thepsychfiles.com/2008/03/01/episode-48-classroom-management-an-interview-with-dr-ross-green/",
  "itunes:image": "",
  "description": "<p>Classroom management techniques - there are a lot of strategies for dealing with behavior problems in the classroom. It's time to add Collaborative Problem Solving to your toolkit.  Learn an alternative to traditional classroom discipline techniques like timeout or sending the child to the principal.  A recent Time magazine article entitled \"How to Make Great Teachers\" mentions that in a 2001 survey of teachers, 44% listed \"student behavior problems\" as the reason they left the profession.  What can be done?</p>\n\n<p>In this episode I interview Dr. Ross Green, author of The Explosive Child and the upcoming book \"Lost in School\".  He'll tell you how to use collaborative problem solving with your students.  This episode is also for parents, daycare workers, babysitters - anyone who wants to help young people learn to think their way through everyday behavior problems.</p>",
  "content:encoded": "<p>Classroom management techniques - there are a lot of strategies for dealing with behavior problems in the classroom. It's time to add Collaborative Problem Solving to your toolkit.  Learn an alternative to traditional classroom discipline techniques like timeout or sending the child to the principal.  A recent Time magazine article entitled \"How to Make Great Teachers\" mentions that in a 2001 survey of teachers, 44% listed \"student behavior problems\" as the reason they left the profession.  What can be done?</p>\n\n<p>In this episode I interview Dr. Ross Green, author of The Explosive Child and the upcoming book \"Lost in School\".  He'll tell you how to use collaborative problem solving with your students.  This episode is also for parents, daycare workers, babysitters - anyone who wants to help young people learn to think their way through everyday behavior problems.</p>",
  "enclosure": "",
  "itunes:duration": "19:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Classroom management techniques - there are a lot of strategies for dealing with behavior problems in the classroom. It's time to add Collaborative Problem Solving to your toolkit. Learn an alternative to traditional classroom discipline techniques.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Classroom management techniques - there are a lot of strategies for dealing with behavior problems in the classroom. It's time to add Collaborative Problem Solving to your toolkit. Learn an alternative to traditional classroom discipline techniques like timeout or sending the child to the principal. A recent Time magazine article entitled \"How to Make Great Teachers\" mentions that in a 2001 survey of teachers, 44% listed \"student behavior problems\" as the reason they left the profession. What can be done? In this episode I interview Dr. Ross Green, author of The Explosive Child and the upcoming book \"Lost in School\". He'll tell you how to use collaborative problem solving with your students. This episode is also for parents, daycare workers, babysitters - anyone who wants to help young people learn to think their way through everyday behavior problems."
}