{
  "id": "https://bibleinoneyear.org/en/youth/361",
  "title": "Day 361: Hallelujah",
  "description": "Psalm 148:1–2, Nehemiah 8:3b,6, Revelation 18:21,23–24, 19:1–4,6–9. The word ‘Hallelujah’ is an invitation to worship – it literally means ‘Praise (Hallal) the Lord’ (Yahweh)  It occurs twenty-four times in the Old Testament (mainly in the Psalms) and it occurs four times in the New Testament – each of them in our passage for today",
  "pubDate": "Mon, 27 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/361/?ignore",
  "itunes:duration": "14:29",
  "guid": "enyouth27122021-361",
  "length": 869.75,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 361: Hallelujah",
  "itunes:subtitle": "Psalm 148:1–2, Nehemiah 8:3b,6, Revelation 18:21,23–24, 19:1–4,6–9. The word ‘Hallelujah’ is an invitation to worship – it literally means ‘Praise (Hallal) the Lord’ (Yahweh)  It occurs twenty-four times in the Old Testament (mainly in the Psalms) and it occurs four times in the New Testament – each of them in our passage for today",
  "itunes:summary": "Over 50 million people have now watched a youtube clip of unsuspecting shoppers who get a surprise while eating lunch. A young woman, seemingly enjoying her lunch in a food court, stands up. She appears to be on her mobile phone. She begins singing the ‘Hallelujah’ chorus. All around her, over 100 (clearly prearranged) opera singers stand one by one and join in.\nMessiah is George Frederick Handel’s most famous work. It tells the story of Jesus – the Messiah. Part Two is about his death on the cross, his resurrection and his ascension into heaven. It ends with the ‘Hallelujah’ chorus. In the spring of 1742, King George II rose to his feet as the first notes of the triumphant ‘Hallelujah’ chorus rang out. Royal protocol has always demanded that, whenever the monarch stands, so too does everyone in the monarch’s presence. Thus, the entire audience and orchestra stood. King George II had accepted that he too was subject to the Lord of lords and King of kings.\nThe word ‘Hallelujah’ is an invitation to worship – it literally means ‘Praise (Hallal) the Lord’ (Yahweh). It occurs twenty-four times in the Old Testament (mainly in the Psalms) and it occurs four times in the New Testament – each of them in our passage for today.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 361
}