{
  "title": "542 - Alex Cody Foster (Ghostwriter)",
  "description": "<p><a target=\"_blank\" href=\"https://www.alexfosterghostwriter.com/\">Alex Cody Foster’s</a> next book, <em>The Man Who Hacked the World: A Ghostwriter’s Descent into Madness with John McAfee</em><em>,</em> will be published November 15th (2022). In the meantime, the crazy story is told in the Netflix documentary called “Running with the Devil.” He’s ghostwritten eight #1 Amazon Bestsellers, written for one of the U.K's most successful thriller writers, and worked as John McAfee's biographer for six months. Before all that, Alex built a solar-powered trike, hitchhiked across America, was homeless in LA where he was nearly murdered, lost his mind, got it back, crewed on a yacht, and became a writer.</p><p>Intro music “Brightside of the Sun,” by <a target=\"_blank\" href=\"https://basinandrange.bandcamp.com/track/brightside-of-the-sun\">Basin and Range</a>. “The Mark of a Good Man,” by <a target=\"_blank\" href=\"https://biminiroad.bandcamp.com/album/the-lost-years-ft-russell-brill\">Bimini Road</a>; Outro: “Smoke Alarm,” by <a target=\"_blank\" href=\"https://www.carsieblanton.com/\">Carsie Blanton</a>.</p><p>And now for something extra, just for Substack subscribers:</p><p>If you prefer to watch, click through to the Substack page and you’ll find a video of our conversation (including extra bonus content I edited out of the podcast recording, including a look at his shiner and a reference to an orgy with Mick Jagger).</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/542-alex-cody-foster-ghostwriter",
  "guid": "substack:post:69711683",
  "dc:creator": "Chris Ryan",
  "pubDate": "Wed, 24 Aug 2022 15:25:14 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:explicit": "No",
  "itunes:duration": 6533,
  "itunes:image": ""
}