{
  "title": "Serbs resign en masse from official posts in Kosovo",
  "link": "https://www.rt.com/news/566013-serb-officials-resign-kosovo-plates/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566013-serb-officials-resign-kosovo-plates/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63669cbe85f54046a47d4908.jpg\" /> Ethnic Serb officials in Kosovo resigned en masse amid ongoing tensions with Pristina <br/><a href=\"https://www.rt.com/news/566013-serb-officials-resign-kosovo-plates/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Ethnic Serb police officers, lawmakers, and other government employees walked out in solidarity with a fired officer</strong></p>\n            \n                        \n            <p>Dozens of ethnic Serb government employees in the breakaway region of Kosovo have resigned from their positions.</p>\n<p>They are protesting against the firing of a police chief who refused to enforce Pristina&rsquo;s orders requiring drivers to&nbsp;change automobile&nbsp;license plates issued by Belgrade or face penalties that will eventually include vehicle confiscation.</p>\n<p>A government minister, ten parliamentarians, and a host of police officers, judiciary officials, and others in the province&rsquo;s four majority-Serb municipalities stepped down on Saturday, with the police officers removing their uniforms symbolically. They have vowed not to return until an &ldquo;<em>Association of Serbian Municipalities</em>&rdquo; is created.&nbsp;</p>\n<p>Kosovar leader Albin Kurti urged the Serbs in the province to &ldquo;<em>maintain calm, peace and security</em>&rdquo; following the mass resignation, pleading with them not to &ldquo;<em>boycott or abandon the institutions of Kosovo</em>&rdquo; or &ldquo;<em>fall prey to political manipulations and geopolitical games</em>.&rdquo;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636146c72030270a290a6639.jpg\" alt=\"FILE PHOTO: Serbian Air Force Mig 29 fighter planes fly over the Batajnica military airport near capital Belgrade.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565753-serbia-drones-kosovo-military/\">Serbia issues drone shoot-down order</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The mass resignation was proposed by Goran Rakic, chair of the Serbian List party in Kosovo, at a meeting between his party and the mayors of the four municipalities. Serbs should &ldquo;<em>strengthen and build their own institutions</em>&rdquo; in the province in cooperation with Serbia, Rakic said, denouncing the &ldquo;<em>illegal and anti-Serbian decision</em>&rdquo; to suspend North Mitrovica police chief Nenad Djuric on Thursday.</p>\n<p>Djuric was dismissed for refusing to issue reprimands to drivers caught with pre-war Serbian license plates, officially illegal as of November 1, having denounced the order as discriminatory against Serbs.</p>\n<p>The police warnings are the first of a three-part phasing out of the plates, which must be replaced by Kosovo-issued registrations by April 21. During the second phase, drivers with Serbian plates will be fined &euro;150, while those still sporting the offending plates after that date will be confiscated.</p>\n<p>Serbia placed its military on high alert earlier this week as the standoff over license plates resumed. NATO reserve troops arrived in Kosovo in September, and Serbian President Aleksandar Vucic has accused Pristina of further escalating tensions by sending its own troops to border regions.</p>\n<p>A previous effort to force the 10,000 drivers of Serbian-registered vehicles to switch their plates in July,&nbsp;with both&nbsp;sides refusing to recognize the other&rsquo;s identity documents, nearly erupted in fighting before American and European diplomats brokered a solution.&nbsp;&nbsp;</p>\n<p>Both Serbia and its breakaway province, which is not recognized as an independent state by the UN, want to join the EU. However, their aims are mutually exclusive, with Pristina seeking&nbsp;inclusion as an independent state and Belgrade determined to reabsorb Kosovo.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 17:27:45 +0000",
  "dc:creator": "RT"
}