{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-5420463519652931197",
  "published": "2022-10-31T16:39:00.000+05:00",
  "updated": "2022-10-31T16:39:00.303+05:00",
  "category": [
    "",
    ""
  ],
  "title": "Tetra Pak reiterates its commitment to sustainability at the Euro Village 2022",
  "content": "<p>Islamabad: Tetra Pak asserted its commitment towards sustainability and ensuring a greener environment at the Euro Village 2022 gala recently organized by the European Union in Islamabad. Participating at the Euro Village 2022 event served as an ideal opportunity for Tetra Pak to highlight its approach to sustainability which is shaped by its promise of protecting what’s good and its commitment to making food safe and available, everywhere. As a reflection of practically implementing this approach, a swing set for children which was completely manufactured by recycled Tetra Pak packaging material was also placed at Tetra Pak’s designated booth which reiterated the fact that Tetra Pak is taking practical steps towards realizing its sustainability vision.&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFebuGW4GKBKqU8iZKgVd76roFjsTODj4120d0rjmnYH7oj0BGfe6wYASd5RBjwkKyYgxRvLZcfZU3RUei42qbcSEqK793w1a-D5uAUo_nBgUVPBRG146LnWMGfZaWlbWsLm8LFrCJbjMCeW7lwpX_hSj6nFldF_96voqHMkdvLE_Q9KSiBQMBg4cXUA/s1492/TPP%20Euro%20Village%20Visual%202%20(E).jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"Tetra Pak reiterates its commitment to sustainability at the Euro Village 2022\" border=\"0\" data-original-height=\"1044\" data-original-width=\"1492\" height=\"448\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFebuGW4GKBKqU8iZKgVd76roFjsTODj4120d0rjmnYH7oj0BGfe6wYASd5RBjwkKyYgxRvLZcfZU3RUei42qbcSEqK793w1a-D5uAUo_nBgUVPBRG146LnWMGfZaWlbWsLm8LFrCJbjMCeW7lwpX_hSj6nFldF_96voqHMkdvLE_Q9KSiBQMBg4cXUA/w640-h448/TPP%20Euro%20Village%20Visual%202%20(E).jpg\" width=\"640\" /></a></div><br /><p><br /></p><p>Notable dignitaries, including the Swedish Ambassador to Pakistan, H.E. Henrik Person, also visited the Tetra Pak booth and were greeted by company representatives. They were delighted to learn more about Tetra Pak’s achievements within the sustainability realm and its commitment towards a low-carbon circular economy.&nbsp;</p><p>During his visit, the Swedish Ambassador to Pakistan, H.E. Henrik Person said, \"I am very happy to be visiting this installation made by a Swedish company Tetra Pak, which is a leading company in packaging, as well as, sustainability. Tetra Pak is making sure that the used cartons are recycled to make items for other purposes. This is of course a very fun purpose to make a swing set for children made out of Tetra Pak cartons. I will encourage all consumers to support recycling of cartons as much as possible, Tetra Pak will do the rest to ensure that we are working towards a sustainable future.\"</p><p>Tetra Pak Pakistan also made special arrangements to apprise the audience about its local partnership with Green Earth Recycling, which started in 2014 and since then has been successfully achieving increasing recycling targets every year by collecting and recycling packaging waste into sellable products such as garden furniture, school desks, roofing solutions, and much more. Visitors were also pleased to learn that in 2021, Tetra Pak Pakistan achieved a recycling rate of over 42% of its produced cartons, while the goal for 2022 is to increase this volume and recycle around 27,000 tonnes of beverage cartons.</p><p>The Euro Village is an annual cultural event organized in different countries with the purpose of highlighting the visibility and impact of the European footprint around the world. The event is conducted as a fun-filled evening with a range of family-centric cultural and entertainment activities that help to enhance mutual interactions between the locals and everyone else that represent team Europe. Highlights of this event include European stalls, a live musical concert, culture and information booths, along with lots of food and fun-based activities.</p><div><br /></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}