{
  "title": "I'm Founding a Dask Company",
  "link": "",
  "updated": "2020-01-08T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2020/01/08/founding-1",
  "content": "<p>Last week I finished my position at NVIDIA.  Next week I form a company.\nThis company will work to scale Python’s open source data science ecosystem,\nprimarily using <a href=\"https://dask.org\">Dask</a>.</p>\n\n<p>This post mostly talks about the history of funding Dask,\nand then goes into the motivation for creating a company.\nI will follow up with plans for the new company in a future post.</p>\n\n<h2 id=\"funding-dask-a-brief-history\">Funding Dask, a brief history</h2>\n\n<p><a href=\"https://dask.org\">Dask</a> is an open source Python library that helps to\nparallelize other Python libraries to work on large datasets and on large\nclusters of distributed hardware.</p>\n\n<p>As community driven open source projects go, Dask has been remarkably well funded.\nWe’ve always had a few people (2-10) paid to work on Dask about half-time over\nthe past five years.</p>\n\n<p>While at Anaconda we pulled the money to support this\nfrom a diverse set of sources:</p>\n\n<ol>\n  <li>The US Government, with an early DARPA grant</li>\n  <li>Consulting revenue, at first from financial services companies that were\nDask’s first institutional users, and then from a wider variety of institutions</li>\n  <li>Philanthropic non-profits, in particular the Gordon and Betty Moore Foundation</li>\n  <li>Margin on some of Anaconda’s other consulting projects</li>\n  <li>\n    <p>US Research grants from NSF and NASA, with collaborations like Pangeo</p>\n\n    <p>(tip: this was the highest bang-for-buck out of all these options)</p>\n  </li>\n</ol>\n\n<p>This money went to fund developers.  These developers focused full time on\nadding features, fixing bugs, engaging in community ecosystem design, and\nanswering user questions.  This full-time funded development was critical to\nthe success of Dask.</p>\n\n<h2 id=\"enter-nvidia\">Enter NVIDIA</h2>\n\n<p>Then, about a year ago, we found a new source of funding:</p>\n\n<ol>\n  <li>NVIDIA: A large hardware company that wanted to do a lot of work with Dask,\nbut was much more comfortable hiring people internally than paying people\nexternally.</li>\n</ol>\n\n<p>Rather than try to change the culture of a large institution we went along with\nit, and I personally changed my employer to NVIDIA to build out this team.</p>\n\n<p><em>“Same job, new employer”</em> I often said, and in many cases this was true.\nMy job was to maintain Dask, and also to make sure that the GPU work that the\n50-person RAPIDS team was doing would interact well with Dask and with the\nsurrounding Python data science community.  I’m really proud of this work, and\nI’m honored to be a part of such a large effort.</p>\n\n<p>We also hired six additional people to work on Dask specifically,\nalong with a mix of GPU-Python ecosystem things.\nTheir work included the obvious Dask + GPU work:</p>\n\n<ol>\n  <li>Dask + RAPIDS gives us GPU accelerated distributed dataframes</li>\n  <li>Dask + CuPy gives us GPU accelerated distributed multi-dimensional arrays</li>\n</ol>\n\n<p>As well as many community ecosystem improvements:</p>\n\n<ol>\n  <li>You can build GPU packages on Conda-Forge now</li>\n  <li>Dask’s Parquet reader is way nicer, with some changes upstreamed to Arrow</li>\n  <li>It’s easier to build dashboards with Bokeh and JupyterLab</li>\n  <li>We can trivially share data between pretty much any pair of GPU libraries\nlike PyTorch, CuPy, RAPIDS, MPI4Py, MxNet.\n(everyone except Tensorflow really (come on Google, catch up))</li>\n  <li>High performance networking hardware like Infiniband is now available in\nPython due to bindings for UCX</li>\n  <li>The Numpy API is easier to use on non-Numpy libraries</li>\n  <li>…</li>\n</ol>\n\n<p>Today NVIDIA generally operates as a good partner to the ecosystem.\nYes, they’re motivated to sell you GPUs,\nbut along the way they’re cleaning up a bunch of stuff, which is great.\nIt’s like when someone new moves into the neighborhood and starts picking up\ntrash and planting flowers.</p>\n\n<p>The Dask team within RAPIDS within NVIDIA is going to continue working on these\nsame problems and more.  The first person we hired onto this team was my good\nfriend and long-time colleague <a href=\"https://github.com/quasiben\">Ben Zaitlen</a>, who\nhas been managing this team for the last couple of months (honestly he does a\nbetter job at this than I ever did).  Ben has been in the Python community for a\nlong time and I am thrilled knowing that he is leading this team into the\nfuture.  More on my experience managing within NVIDIA in a future post.</p>\n\n<h2 id=\"dask-as-a-funded-community-project\">Dask as a Funded Community Project</h2>\n\n<p>Dask’s development is distinct in that it has both …</p>\n\n<ol>\n  <li>Been consistently funded to employ many people for years</li>\n  <li>Operated completely in the open as a community governed and developed project</li>\n</ol>\n\n<p>Most OSS projects that are built and maintained by for-profit entities feel\ndifferent from those that are built and maintained by a volunteer workforce\n(like Numpy, Scipy, Matplotlib, Pandas, Scikit-Learn, and Jupyter for example).</p>\n\n<p>In general, I’ve gotten the impression that the community trusts Dask in the\nsame way that it trusts other PyData projects, despite Dask’s history\nof funded development.  I am personally grateful for this trust.\nI believe that this is for many reasons:</p>\n\n<ol>\n  <li>We hold discussions and make decisions in public</li>\n  <li>We give non-Anaconda/NVIDIA community leaders full commit rights and ownership over decisions</li>\n  <li>We engage in ecosystem discussions of protocols and design with other packages\nand make sure to avoid lock-in APIs</li>\n  <li>We contribute to the surrounding ecosystem of packages and are generally good citizens</li>\n</ol>\n\n<p>As an organizer for the Dask project I’ve been on the lookout for how to\nincrease our maintainer pool and how to secure the kind of long-term baseline\nfunding a project needs in order to employ maintainers long term.\nWhen I find those sources, I go after them.\nThis is what motivated my move to NVIDIA a year ago\nand this is what motivates my move now.</p>\n\n<h2 id=\"a-dask-company-seems-right-today\">A Dask Company Seems Right Today</h2>\n\n<p>Today I see large and well funded companies and institutions asking for\nhelp deploying Dask, and making it work well within their institution.\nThey’re used to paying for these things\n(indeed, they often ask me for someone that they can pay for these things)\nso I figure it’s best to make an organization that they can pay.</p>\n\n<p>There is <em>a lot</em> of demand for scalable Python with Dask today.\nI think that if we channel this demand carefully that it can have a strong\npositive impact on Dask, on Python, on open source software, and more importantly on the\nsocial and environmental problems that we all want to solve with that software.</p>\n\n<p>I’m excited.</p>\n\n<p><em>(Looking for more?  I’ll describe my plans in more depth in a follow up blogpost)</em></p>"
}