{
  "title": "483 - The Movement for a Global Pandemic Treaty",
  "itunes:title": "483 - The Movement for a Global Pandemic Treaty",
  "pubDate": "Wed, 22 Jun 2022 10:00:00 +0000",
  "guid": "7c00b26b-48d5-4415-a63b-43a7d9d5da97",
  "link": "https://johnshopkinssph.libsyn.com/483-the-movement-for-a-global-pandemic-treaty-0",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Greater global cooperation could have saved many lives during the COVID-19 pandemic. Preparedness and response expert</span> <strong>Lucia Mullen</strong> <span style=\"font-weight: 400;\">of the Center for Health Security talks with</span> <strong>Dr. Josh Sharfstein</strong> <span style= \"font-weight: 400;\">about the growing call to support such cooperation through a pandemic treaty . They also talk about mis- and disinformation that have emerged already, such as myths that a treaty could override countries’ rights or give the World Health Organization sweeping power.</span></p>",
  "content:encoded": "<p>Greater global cooperation could have saved many lives during the COVID-19 pandemic. Preparedness and response expert Lucia Mullen of the Center for Health Security talks with Dr. Josh Sharfstein about the growing call to support such cooperation through a pandemic treaty . They also talk about mis- and disinformation that have emerged already, such as myths that a treaty could override countries’ rights or give the World Health Organization sweeping power.</p>",
  "enclosure": "",
  "itunes:duration": "12:59",
  "itunes:explicit": false,
  "itunes:keywords": "global,Government,who,Pandemic,cooperation,Treaty,coronavirus,covid",
  "itunes:subtitle": "Greater global cooperation could have saved many lives during the COVID-19 pandemic. Preparedness and response expert Lucia Mullen of the Center for Health Security talks with Dr. Josh Sharfstein about the growing call to support such cooperation...",
  "itunes:season": 6,
  "itunes:episode": 483,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}