{
  "title": "How to “Follow the Money” in a Political Campaign",
  "link": "https://www.propublica.org/article/how-to-understand-political-contributions-campaign-finance",
  "pubDate": "Tue, 01 Nov 2022 09:00:00 -0400",
  "guid": "https://www.propublica.org/article/how-to-understand-political-contributions-campaign-finance",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/karim-doumar\">Karim Doumar</a> and <a class=\"name\" href=\"https://www.propublica.org/people/cynthia-gordy\">Cynthia Gordy Giwa</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">There’s a phrase that pops up a lot when investigative journalists talk about politics: Follow the money. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">For journalists, that often means looking at how political campaigns are funded and who’s paying for lobbyists. Today we’re going to talk about some of the methods we use to dig into those subjects. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">This advice may not lead to you uncovering large-scale corruption — let us know if you do, though — but we hope to better acquaint you with which industries are donating to races you care about, how your candidates spend the money they raise and the oversized influence the ultrawealthy can have. </p>\n\nCampaign Finance Laws Are Meant to Increase Transparency\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">After the Watergate scandal (which, in addition to a break-in at the Democratic National Committee headquarters, involved <a href=\"https://www.cnn.com/2012/02/04/politics/watergate-reform/index.html\">campaign funds used toward the scheme</a>), Congress <a href=\"https://transition.fec.gov/pages/40th_anniversary/40th_anniversary.shtml\">strengthened laws</a> requiring federal campaigns to report their political contributions and spending to the Federal Election Commission. This was designed as a check against corruption, but also as a way to keep voters reasonably informed about money in politics.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">So, let’s take a look at what money <em>does</em> in a campaign. Seeing where a candidate’s money comes from, as well as which groups are spending on behalf of (or against) their campaign, helps you understand their beliefs, the advice they’re getting and the kinds of policies they’re likely to support.</p>\n\nWhat a Donation Gets Candidates:\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">Money can help someone win an election, though it’s not the only factor. By and large, donations get spent on the day-to-day expenses of running a campaign. You can <a href=\"https://www.fec.gov/data/browse-data/\">use </a><a href=\"https://www.fec.gov/data/browse-data/\">FEC data to research how candidates are spending their funds this election</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">It’s probably garden-variety stuff: lunch, plane tickets, campaign ads, fundraising software, venue rentals for campaign events. In some cases, you might even see donations to the campaigns of other candidates they support. The choices candidates make tell you something about their priorities: where they’re spending their time, which voters they’re trying hardest to win over (older voters with TV ads or younger folks online) and how much they pay their staff.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">Of course, sometimes candidates try to hide the true purpose of their campaign expenses. U.S. Rep. Duncan Hunter of California was <a href=\"https://www.nytimes.com/2020/03/17/us/duncan-hunter-sentencing.html\">sentenced to 11 months in prison</a> in 2020 for spending 2018 campaign donations on family trips to Hawaii and Italy and private school for his children. </p>\n\nWhat a Donation Gets Campaign Donors:\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">Individuals are allowed to contribute up to $2,900 per election to each candidate’s campaign. (A primary and a general election count as separate elections; so do runoffs.) </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">Campaign donations are not supposed to be transactional — that’s considered bribery, and it’s a crime. But they are a way of establishing a relationship and opening the door to conversations between the donor and the government. One example of this: In January 2021, The Intercept obtained a recording of <a href=\"https://theintercept.com/2021/06/16/joe-manchin-leaked-billionaire-donors-no-labels/\">a Zoom call Sen. Joe Manchin had with billionaire donors</a> that shed light on the kind of access major funders get. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">Most of the time these donors don’t see a direct “return” on their investment. If you donate to a candidate, chances are you’re getting one of two things: </p>\n\n<ol>\n<li>The satisfaction of backing a potential winner who shares your values or goals.</li>\n<li>Access. Academic research has shown that <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/ajps.12180\">elected officials are more responsive to requests for meetings</a> that come from donors to their campaigns. When you give money, the recipients know it, and while they may not agree with all your positions, they’re more likely to hear you out. </li>\n</ol>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">I know: It’s murky. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">But, thanks to regulations in the ‘70s, we can at least see what’s behind the curtain. If you give $200 or more to a candidate, the campaign is required to report your name, address and employer or occupation to the FEC. Based on these FEC filings, along with similar disclosures from political action committees, the Center for Responsive Politics (through its site <a href=\"https://www.opensecrets.org/\">OpenSecrets.org</a>) determines which industries are funding the candidates in your race, and you can <a href=\"https://www.opensecrets.org/races\">look it up</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">Take a close look at the types of sectors and interest groups donating to your candidates. These can signal who has their ear.</p>\n\nWhat a Donation Gets Super PAC Donors:\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">Some of the biggest players in the campaign landscape are super PACs. These are political action committees that don’t give directly to a candidate but spend independently in support of (or in opposition to) them. This outside spending is completely uncapped, freeing super PACs to raise any amount of money to influence any given race — <strong>and typically what super PACs spend money on are negative campaign ads</strong>. (You may balk at this, but, even if people claim to hate them, <a href=\"https://www.cnn.com/2012/01/02/opinion/lariscy-negative-ads/index.html\">attack ads work</a>.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">Think about the negative ads you’ve seen lately. Chances are they were funded by a super PAC that believe certain voters can be activated based on its message. Knowing who these groups are can help you better understand their motives and better assess whether you buy what they’re selling. You can browse our <a href=\"https://projects.propublica.org/itemizer/\">FEC Itemizer database</a> to learn more about outside spending in specific races. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">Super PACs tend to represent three main categories:</p>\n\n<ul>\n<li><p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\"><strong>Single-issue groups:</strong> Think advocacy groups that focus on abortion, the environment or taxes.</p>\n\n</li>\n<li><p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\"><strong>Partisan groups</strong>: These are super PACs linked to key House and Senate leaders, like the Congressional Leadership Fund (affiliated with House Republican leaders) and the Senate Majority PAC (connected with Senate Democratic leadership). While lawmakers themselves are restricted from soliciting unlimited donations to the super PACs they’re tied to, the people running these groups can do so on their behalf. </p>\n\n</li>\n<li><p data-pp-blocktype=\"copy\" data-pp-id=\"1.19\"><strong>Family interests</strong>: Basically, this is when a wealthy family member donates money to a campaign or supportive PAC. For example, New Jersey congressional candidate Bob Healey’s campaign is supported by a Super PAC <a href=\"https://www.politico.com/news/2022/06/14/congressional-candidates-mother-boosts-his-campaign-with-2m-super-pac-donation-00039427\">mostly funded by a $2 million donation from his mother</a>. </p>\n\n</li>\n</ul>\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.20\">Outside spending from super PACs can have a big impact on an election. For example, the Saving Arizona PAC, which is connected to tech mogul <a href=\"https://www.propublica.org/article/lord-of-the-roths-how-tech-mogul-peter-thiel-turned-a-retirement-account-for-the-middle-class-into-a-5-billion-dollar-tax-free-piggy-bank\">Peter Thiel</a>, is <a href=\"https://www.politico.com/news/2022/09/08/thiel-pac-arizona-senate-00055761\">pouring millions into ads supporting Republican Blake Masters</a>, who is running to unseat Sen. Mark Kelly in Arizona. This comes after the Washington Post reported that <a href=\"https://www.washingtonpost.com/politics/2022/08/31/peter-thiel-mcconnell-blake-masters/\">Mitch McConnell asked Thiel to intervene in the race</a> after he funded the Masters in the primary. </p>\n\nHow Companies and Industries Grapple with Politicized Donations\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.21\">A total of 147 members of Congress voted against certifying Joe Biden’s 2020 election win. Pro-Trump Republicans had planned the vote for weeks, riding baseless claims of election fraud that had already been debunked in lawsuits, recounts and more. Until that moment, the certification vote had been symbolic. There was no procedural or democratic reason to vote against certifying election results, which were real, or state electors, who had already been sent by the states. A violent mob broke into and ransacked the U.S. Capitol, calling for Mike Pence’s hanging and other blood. In the aftermath, dozens of companies released statements that they’d no longer be donating to candidates who voted against certifying the election. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.22\">ProPublica focuses on accountability, so, naturally, we wanted to know whether they’d stuck to their word. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.23\">Sergio Hernandez, a news apps developer here, looked into it. Using publicly available campaign finance information, he found that Fortune 500 companies have given millions of dollars to election deniers who voted against certifying the 2020 election. You can <a href=\"https://projects.propublica.org/fortune-500-company-election-deniers-jan-6\">look up each company’s top beneficiaries</a>, individual contributions and whether they kept their promises. </p>\n\nWhat About Dark Money?\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.24\">Transparency laws as they are written only bring us so much information. Since the 2010 Supreme Court decision in Citizens United v. Federal Election Commission, <a href=\"https://www.opensecrets.org/darkmoney/dark-money-basics.php\">dark money</a> (money spent by political nonprofits or super PACs, which are not legally obligated to disclose donors) has been flowing fast. That’s one reason ProPublica is busy. Sometimes it takes intrepid journalists who investigate as their full-time jobs to unearth just some of the ways the ultrawealthy influence how the government operates. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.25\">In August, ProPublica and its partner The Lever exposed how an elderly, ultrasecretive business owner named <a href=\"https://www.propublica.org/article/dark-money-leonard-leo-barre-seid\">Barre Seid gave the largest known political donation</a>, <strong>worth $1.6 billion</strong>, to an advocacy organization run by Leonard Leo, one of the prime architects of the conservative effort to reshape the Supreme Court. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.26\">Seid, a later investigation found, has been quietly funding right-wing causes using a strategy he called “attack philanthropy.” Seid did much of his political funding while trying to remain below radar. That’s one reason you may have never heard of him. But the donors who help shape this country deserve as much scrutiny and publicity as the politicians they support. After all, this country belongs to all of us.</p>\n        \n                                   ",
  "dc:subject": "Democracy, A User’s Guide to Democracy",
  "dc:date": "2022-11-01T09:00:00-04:00",
  "dc:creator": "by Karim Doumar and Cynthia Gordy Giwa"
}