{
  "title": "Did J.J. Thomson Discover the Electron?",
  "link": "https://spectrum.ieee.org/discovery-of-the-electron",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-elongated-glass-vacuum-tube-sits-lengthwise-on-a-wooden-stand.jpg?id=29721938&width=1245&height=700&coordinates=0%2C79%2C0%2C80\"/><br/><br/><p>\n<strong>“We shall call</strong> such particles corpuscles,” announced the physicist J.J. Thomson, during a<a href=\"https://books.google.com/books?id=vBZbAAAAYAAJ&pg=PA104#v=onepage&q&f=false\" rel=\"noopener noreferrer\" target=\"_blank\"> lecture at the Royal Institution</a> in London, on 30 April 1897. “The atoms of the ordinary elements are made up of corpuscles and holes, the holes being predominant,” he continued. Thomson described his experiments with cathode rays to verify the existence of these subatomic corpuscles. This model of the atom became known as the “plum pudding” model, so named for the popular English dessert. In Thomson’s analogy, negatively charged corpuscles were like raisins suspended in a positively charged cake, resulting in a neutral atom. The model also became known as the Thomson model, although its chief proponent was William Thomson (Lord Kelvin), not J.J. Thomson, who merely endorsed the idea.\n</p><p>\n\tCorpuscles and pudding are not how we think about the structure of an atom today. Corpuscles are electrons, and the plum pudding model gave way to Ernest Rutherford’s nuclear model in 1911. Yet J.J. Thomson is often hailed as the discoverer of the electron based on that lecture 125 years ago.\n</p><hr/><p>\n\tOf course, history is always more muddled than that. For this month’s column, I knew that I wanted to write about the 125th anniversary of the electron’s discovery, which for simplicity’s sake I pegged to Thomson’s lecture. The challenge then was to find a museum artifact that captured that discovery. \n\t<a href=\"https://collection.sciencemuseumgroup.org.uk/objects/co31178/karl-ferdinand-brauns-braun-tube-1897-cathode-ray-tube\" target=\"_blank\">A Braun vacuum tube</a>, like the one pictured at top, seemed like a good choice, because its inventor, <a href=\"https://www.lindahall.org/karl-ferdinand-braun/\" rel=\"noopener noreferrer\" target=\"_blank\">Karl Ferdinand Braun</a>, created it to study beams of electrons, and Thomson used a similar instrument for his experiments.\n</p><p>\n\tBut as I dug into the histories of Thomson and Braun, I learned that theirs were two parallel stories involving many of the same players and similar outcomes (both men won a Nobel Prize in Physics), but having little else in common. Many people, in fact, had a reasonable claim to aspects of the electron’s discovery. The more I researched, the more I contemplated what it meant to discover something.\n</p><h2>Cathode rays, vacuum tubes, and the birth of atomic theory</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"In a black-and-white image of the British physicist J.J. Thomson, he has a dark mustache and wire-rimmed glasses.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"ad7f7ac7ce3c7c09a4bcba82a85acb93\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1bc04\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/in-a-black-and-white-image-of-the-british-physicist-j-j-thomson-he-has-a-dark-mustache-and-wire-rimmed-glasses.jpg?id=29721951&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Exactly 125 years ago, the British physicist J.J. Thomson gave a lecture detailing his and others’ experiments with the energetic beams inside cathode-ray tubes.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">\n\tUniversal Images Group/Getty Images\n\t</small>\n</p><p>\n\t As the 19th century was coming to a close, many prominent thinkers believed that all of the great discoveries in science had already been made. Electricity was being tamed, and theories of thermodynamics were coalescing to explain the workings of steam engines. Little did scientists know that atomic theory was about to upend science and change our fundamental understanding of matter. J.J. Thomson was a key player in establishing this new direction in physics.\n</p><p>\n\t In 1876, Thomson had received a scholarship to study at the University of Cambridge’s Trinity College, and four years later he graduated with a degree in mathematics. In 1884, he was appointed the Cavendish Professor of Experimental Physics and began his lifelong study of electromagnetism. Much of Thomson’s research was devoted to understanding the nature of cathode rays. We now know these rays are streams of electrons emerging from the cathode (or negative electrode) of a vacuum tube. But that knowledge was hard won, after decades of investigations by many players.\n</p><p>\n\t The purely scientific question—What are cathode rays?—was also wrapped up in national identity. Many German physicists believed that visible cathode rays resulted from an interaction with the ether—a colorless, weightless substance that enveloped all of space. Ether is part of what historians call the Classical Worldview, a 19th-century synthesis of physics that has its roots in Aristotle and Newton. French and British scientists, meanwhile, were beginning to argue that cathode rays were electrified subatomic particles. This did not fit neatly within the Classical Worldview, which held that everything was composed of immutable and indivisible atoms.\n</p><p class=\"pull-quote\">\n\t In the “plum pudding” model of the atom, negatively charged corpuscles were like raisins suspended in a positively charged cake, resulting in a neutral atom.\n</p><p>\n\tFor his experiments, Thomson relied on a specialized vacuum tube known as a Crookes tube (more about Crookes and his tubes in a bit), in which he observed and photographed various phenomena, including the effect of a magnetic force on the electrical discharge at high pressure. He also compared experiments on the charges carried by cathode rays both within and outside of the tube.\n</p><p>\n\t Thomson’s foray into cathode rays was preceded by more than 200 years of demonstration and experimentation with low-vacuum globes and tubes. Early experimenters such as \n\t<a href=\"https://www.lindahall.org/francis-hauksbee/\" rel=\"noopener noreferrer\" target=\"_blank\">Francis Hauksbee</a> were simply trying to figure out what was happening inside the tubes and were mesmerized by the different colored lights they could produce. In the 1850s, things got more serious, when Julius Plücker, a physicist and mathematician at the University of Bonn, and his glassblower colleague Heinrich Geissler observed that the green phosphorescence on the glass of a high-vacuum tube was magnetic. When they placed a magnet near the cathode, the light spread out in a pattern similar to iron filings around a magnet.\n</p><p>\n\t Plücker’s student Johann Wilhelm Hittorf showed that an object placed in front of the cathode cast a shadow on the opposite wall of the tube. Hittorf’s “glow rays” started a line of inquiry about directionality, which Eugen Goldstein picked up on in the 1870s, in experiments that showed cathode rays could be focused using a concave cathode.\n</p><p>\n\t It seemed as if each new player made slight modifications to the tubes. Then came \n\t<a href=\"https://www.lindahall.org/william-crookes/\" rel=\"noopener noreferrer\" target=\"_blank\">William Crookes</a>. He designed a wide array of vacuum tubes for studying cathode rays and gave beautiful demonstrations with his tubes, popularizing their use in laboratories and making the public aware of the research. When Thomson began the investigations that led to his 30 April lecture, he used a Crookes tube.\n</p><h2>How Karl Ferdinand Braun worked out the basics of the oscilloscope</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"In a black-and-white image of the German physicist Karl Ferdinand Braun, he has a full beard and small wire-rimmed glasses.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"d6d3777179ccd662926e87252e83b326\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1ebb0\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/in-a-black-and-white-image-of-the-german-physicist-karl-ferdinand-braun-he-has-a-full-beard-and-small-wire-rimmed-glasses.jpg?id=29722374&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">The German physicist Karl Ferdinand Braun invented a type of vacuum tube that became the basis of 20th-century CRTs, used in television sets and computer monitors.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Alamy</small>\n</p><p>\n\tIn the years leading up to Thomson’s lecture, Geissler tubes, Plücker tubes, Hittorf tubes, and Crookes tubes filled laboratories and lecture halls. Mostly they were used to show the colorful effects of the electric discharge of cathode rays on different phosphorescent surfaces, without any clear practical applications.\n</p><p>\n\tThen \n\t<a href=\"https://ethw.org/Wilhelm_Roentgen\" rel=\"noopener noreferrer\" target=\"_blank\">Wilhelm Röntgen</a> noticed something unusual. Even though the Crookes tube he was using was encased in black cardboard, a phosphorescent screen across the room started glowing. This led to his 1895 announcement that he had discovered X-rays. The discovery set off a fresh new wave of cathode-ray experiments.\n</p><p>\n\t One scientist inspired by Röntgen’s work was \n\t<a href=\"https://www.lindahall.org/karl-ferdinand-braun/\" rel=\"noopener noreferrer\" target=\"_blank\">Karl Ferdinand Braun</a>. Braun had received his Ph.D. from the University of Berlin in 1872, studying the oscillations of strings and elastic rods, and he spent the next 20 years in various positions at the universities of Marburg, Karlsruhe, and Tübingen. At the time of Röntgen’s discovery, Braun was director of the Physical Institute at Strasbourg. According to historian George Shiers, in his 1974 article “<a href=\"https://www.jstor.org/stable/24950032?refreqid=excelsior%3Ab8cc6dcfb75ae4d114113907212814cb\" rel=\"noopener noreferrer\" target=\"_blank\">Ferdinand Braun and the Cathode Ray Tube</a>,” for <em>Scientific American</em>, Braun differed from many Röntgen enthusiasts in that he was more interested in the source of the X-rays than in the applications of the radiation.</p><p>\n\tBraun sought a new type of instrument, one that could visually capture the oscillatory and transitory phenomena in electrical circuits. In short, he wanted to map alternating current, in what would turn out to be a precursor of the oscilloscope. He instructed his instrument maker, Franz Müller, to modify a Crookes tube by adding a restrictive diaphragm across the middle of it. The diaphragm focused the thin beam of cathode rays. A phosphor-coated piece of mica served as a viewing screen. A coil outside the tube deflected the cathode-ray beam at right angles to the magnetic field. Because the beam responded almost immediately to changes in voltage or current, it could be used to trace these patterns on the screen. Braun published a description of his tube, including a diagram, in \n\t<em>Annalen der Physik </em>in February 1897, 10 weeks before Thomson’s lecture.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A page of scientific text in German with a simple line drawing of an early vacuum tube.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"03d8441fd87f2ee31b8747a7297c7622\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"649f2\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-page-of-scientific-text-in-german-with-a-simple-line-drawing-of-an-early-vacuum-tube.jpg?id=29722385&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In Karl Ferdinand Braun’s cathode-ray tube indicator, voltage was applied to the anode (A) and cathode (K), causing a negatively charged beam to be emitted from the cathode. A diaphragm (C) focused the beam, which then struck a phosphor-coated screen (D) at the opposite end.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">The Linda Hall Library of Science, Engineering & Technology</small>\n</p><p>If Thomson knew about Braun’s work when he gave his 30 April lecture, he made no mention of it. Nor did Thomson choose to call his subatomic particles by a name that was already in use: the electron. In 1874, the Irish physicist <a href=\"https://en.wikipedia.org/wiki/George_Johnstone_Stoney\" rel=\"noopener noreferrer\" target=\"_blank\">George Johnstone Stoney</a> proposed <em>electrine</em> for the unknown subatomic particle, later changing it to <em>electron</em> in 1891. Stoney also estimated the electron’s charge (which turned out to be very close to the modern value), and he was frustrated that <a href=\"https://www.biodiversitylibrary.org/item/122066#page/432/mode/2up\" rel=\"noopener noreferrer\" target=\"_blank\">Hermann von Helmholtz kept getting credit</a> for that discovery.</p><p>Thomson otherwise did a good job of tracing the history of experiments on cathode rays and naming scientists and instrument makers who had provided the foundation for his work. (The <a href=\"https://books.google.com/books?id=vBZbAAAAYAAJ&pg=PA104#v=onepage&q&f=false\" rel=\"noopener noreferrer\" target=\"_blank\">text of Thomson’s lecture</a> was published in the 21 May 1897 issue of <em>The Electrician</em>.) Only in the final part of his lecture did he posit his corpuscle hypothesis and describe the experiments in which he measured the ratio of the corpuscles’ mass to their charge. But he did not conclude with a definitive statement on the discovery of the electron. Rather, he ended by simply noting that the ratio is of the same order as the value that Dutch physicist <a href=\"https://www.lindahall.org/pieter-zeeman/\" rel=\"noopener noreferrer\" target=\"_blank\">Pieter Zeeman</a> deduced the previous year, in his experiments on the magnetic field of sodium light.</p><p>Zeeman discovered that when an element is burned in the presence of a strong magnetic field, spectral lines are split into regular patterns. Today we understand the “Zeeman effect” to be the result of electron spin, but the electron had not yet been discovered. However, Zeeman's supervisor Hendrik Lorentz had already theorized that atoms might consist of charged particles. Zeeman and Lorentz won a Nobel Prize in 1902 for this work.</p><h2>Different theories of discovery</h2><p>\n\tWho then discovered the electron? Braun’s invention and Thomson’s discovery both built on decades of work by numerous scientists and instrument makers, so it seems unfair to give credit to one individual. It’s true, though, that Braun never patented his invention, nor did he do much to promote it. By the end of 1897, he’d abandoned his cathode-ray research and moved on to wireless telegraphy, for which he shared a Nobel Prize in Physics with Guglielmo Marconi, in 1909. Braun’s CRTs didn’t see much action during his lifetime, but modified versions dominated television sets and computer monitors during the second half of the 20th century, and Braun is hailed as their original inventor.\n</p><p>\n\tMeanwhile, Thomson doubled down on his corpuscle theory, winning his Nobel Prize in 1906. And, even though the plum pudding model he espoused fizzled after a few years, Thomson is the one recognized as the discoverer of the electron 125 years later.\n</p><p>The question of discovery and who should get credit is much debated amongst historians, philosophers, scientists, and textbook writers, who often have different ideas on the matter, especially when there is a long path to the end result with many different players. In her book \n\t<a href=\"http://www.amazon.co.uk/exec/obidos/ASIN/0748407200/qid=1125600918/sr=8-1/ref=sr_8_xs_ap_i1_xgl/202-2540451-5546262\" rel=\"noopener noreferrer\" target=\"_blank\"><em>J.J. Thomson and the Discovery of the Electron</em></a>, the historian of mathematics and science <a href=\"https://uk.linkedin.com/in/isobel-falconer-a394b7a\" target=\"_blank\">Isobel Falconer</a> argues (quite persuasively) against the traditional nationalistic debate over the nature of cathode rays. She points out that Thomson didn’t even become interested in them until 1896, and even then, his corpuscles had little in common with what was being called an electron at the time. In his article “<a href=\"https://www.sciencedirect.com/science/article/abs/pii/S1355219896000196\" target=\"_blank\">Rethinking the ‘Discovery’ of the Electron</a>,” historian <a href=\"http://scholar.uoa.gr/tarabatz/home\" target=\"_blank\">Theodore Arabatzis</a> proposes a taxonomy of what it means to discover an unobservable entity. <a href=\"https://www.informationphilosopher.com/solutions/philosophers/hacking/\" target=\"_blank\">Philosopher Ian Hacking</a> suggests in his 1983 book, <a href=\"https://www.cambridge.org/core/books/representing-and-intervening/F6506B708BB5A8B6A5D884BDCF28E7B7\" target=\"_blank\"><em>Representing and Intervening</em></a>, that something has been discovered once a scientist finds a way to manipulate the entity. But maybe discovery should be counted from when something is demonstrated or published or named. Or perhaps the recognition of discovery should occur only retrospectively, once the modern concept of the entity’s various features has been established—in the case of the electron, that would be its mass, charge, spin, and particle-wave nature.<br/></p><p>\n\tI realize that bringing up these philosophical questions kills the joy of a narrative based on a single aha moment. It’s easier on our brains when histories of discovery have neat edges, with a finite cast of fascinating characters, perhaps some hardship and setbacks to overcome, and a rousing, definitive success at the end. That’s the Hollywood biopic version of discovery. It’s not wrong, necessarily, but the truth is messier, richer, and more tentative.\n</p><p>\n<em><em>Part of a </em><em><a href=\"https://spectrum.ieee.org/tag/Past+Forward\" rel=\"noopener noreferrer\" target=\"_self\">continuing series</a></em><em> looking at photographs of historical artifacts that embrace the boundless potential of technology.</em></em></p><p><em><em></em><em>An abridged version of this article appears in the May 2022 print issue as “Birth of the Electron.\"</em></em>\n</p>",
  "pubDate": "Sat, 30 Apr 2022 19:00:01 +0000",
  "guid": "https://spectrum.ieee.org/discovery-of-the-electron",
  "category": [
    "Atomic theory",
    "Cathode-ray tubes",
    "Discovery of the electron",
    "J.j. thomson",
    "Karl ferdinand braun",
    "Past forward",
    "Type:departments",
    "Vacuum tubes",
    "Electron discovery"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}