{
  "title": "Special Episode: The Improving Case for Commodities",
  "description": "<p>For only the second time in the last decade, commodities outperformed equities in 2021. Looking ahead at 2022, what challenges and opportunities are on the horizon for this asset class?</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Morgan Stanley's Chief Cross Asset. Strategist.</p><p><br></p><p><strong>Martijn Rats </strong>And I'm Martijn Rats, Morgan Stanley's Global Commodity Strategist.</p><p><br></p><p><strong>Andrew Sheets </strong>And today in the podcast we'll be talking about tailwinds driving commodities broadly, as well as the path ahead for global energy markets. It's Friday, February 4th at 3p.m. in London.&nbsp;</p><p><br></p><p><strong>Andrew Sheets </strong>So, Martijn, there were a number of reasons why I wanted to talk to you today, but one of them was that, for only the second time in the last decade, commodities outperformed equities in 2021. There are a number of drivers behind this, and you and your team have done some good work recently talking about those drivers and how they might continue. But one of them has certainly been the focus on inflation, which has been a major investment topic at the end of last year and continues to be a major topic into this year. Why are commodities and the inflation debate so interlinked and why do you think they're important for commodity performance?</p><p><br></p><p><strong>Martijn Rats </strong>Well, look, commodities tend to maintain their value in real terms. So when there is broad inflation, the cost of producing commodities tends to go up. And when that happens, then the price of commodities tends to follow that. So at the same time, if you have a rising inflation, then also ends up in having an impact on interest rates. Interest rates start to rise. That tends to be a headwind for a lot of financial assets. So when inflation expectations all of a sudden pick up, then then all of a sudden it weighs on the valuation of an awful lot of other things, whilst actually commodities are often somewhat insulated of that. There aren't that many sectors that that really benefit from inflation. So all of a sudden then from an investment perspective, investment demand for commodities goes up. The allocation to commodities is still small, and when you put those things together, that explains why in the past and again over the last 12, 18 months, commodities really come into their own in these periods where inflation expectations are picking up and are high, commodities tend to do well in those environments.</p><p><br></p><p><strong>Andrew Sheets </strong>So another thing about commodities is that you can't ignore is that this is a really diverse set of things. You know, we're talking about everything from, you know, wheat, to coffee, to aluminum, to crude oil. So it's hard to generalize what's driving commodities as a whole, but something I think is quite interesting in your research is that one theme that actually strikes out across a lot of different commodities from aluminum to oil, is the energy transition, which is affecting both demand for certain commodities and the supply of certain commodities. Could you go into that in a little bit more detail how you see the energy transition impacting this space? You know, really over the next decade?</p><p><br></p><p><strong>Martijn Rats </strong>Yeah, it broadly splits in two and<s> </s>there are a range of commodities for which the energy transition is basically demand positive. So if you look at a lot of renewable projects, you know, wind power or solar power or hydrogen projects, electric vehicles, all of those types of assets require tremendous demand amounts of, basically of metals, copper, lithium, cobalt, nickel, aluminum. In those areas, it simply demands positive. But then there are other areas where the energy transition creates a lot of uncertainty about the long-term outlook for demand. This is particularly true, of course, for the fossil fuels, for oil and gas. And what is currently going on is that the energy transition is starting to become such a red flag not to invest in new productive capacity in those areas, that it's that it's already weighing on capex, and that there is an element of it constraining the supply of those fossil fuels even before demand is materially impacted. And we're seeing that at play at the moment. Oil and gas demand continues to recover quite strongly coming out of COVID, and there are actually very little signs that demand for those fossil fuels is rolling over anytime soon.<s> </s>But the energy transition makes the demand outlook over the long run into the 2030s very uncertain. And the way that we read the market at the moment is that the demand uncertainty is already impacting investment now. If you don't invest for the 2030s, there's a certain amount of oil and gas you also don't have over the next couple of years. So whether it's through the supply side or through the demand side, our conclusion would be that on the whole the energy transition contributes to the tightness of commodity markets in a relatively broad sense.</p><p><br></p><p><strong>Andrew Sheets </strong>So Martijn, drilling down a little bit further into the oil story. You know, you and your team have identified what you call a triple deficit in oil markets that would drive a triple digit oil price estimate. You and your team think oil could hit $100 a barrel this year. Now<s> </s>what is that triple deficit and what's driving it?</p><p><br></p><p><strong>Martijn Rats </strong>The triple deficit refers to the idea or the expectation that three things will be low in the oil markets simultaneously, broadly around the middle of this year as we go into the second half. The first one is inventories, the second one is spare capacity, and a third one is investment levels. Already read last year we have seen very strong draws in global oil inventories. The oil market was under supplied by about two million barrels a day last year, which is historically very high. The way that we model supply demands, that rate of inventory draws that does slow down in 2022, but we end up with inventory draws nonetheless, and we will end 2022 on our balances with inventories that are still lower than at the end of last year. So, the first point low and falling levels of inventory. The second point relates to spare capacity. The world's spare capacity to produce oil in emergency situations when it's needed completely sits within OPEC. There is no spare capacity outside of OPEC now. OPEC is growing production this year, but they're not adding an awful lot of capacity. Our reading of the situation is that by the middle of the year OPEC's spare capacity, which at the moment stands probably somewhere around three and a half million barrels a day, will fall below two million barrels a day. And typically, when spare capacity falls to such low levels, it becomes supportive for prices. So that's the second of the triple deficit that we talk about, low and falling levels of spare capacity. And finally, there is investment. Investment has been on a sliding trend already since 2014, took an enormous nosedive in 2020, did not rebound in 2021, and is only modestly creeping higher this year. Investment levels relative to current consumption we would characterize as very low. And that is not changing anytime soon. So if you add these three things up low inventories, low spare capacity, low levels of investment, you're really looking at the oil market that is very tight. And ultimately, we think that that will support this $100 oil price forecast.</p><p><strong>&nbsp;</strong></p><p><strong>Andrew Sheets </strong>So Martijn, the last thing I want to ask you about was this question of geopolitical uncertainty. When I talked to investors, there are some who think that the only reason that the oil price has gone up a lot this year is because of increasing geopolitical tension. There are others who say, no, it's gone up mostly because of the supply and demand imbalance that you just highlighted<s> </s>how do you how do you as a commodities analyst in your team try to address questions of how much of a driver is fundamental and how much of it is risk premium around event uncertainty?</p><p><strong>&nbsp;</strong></p><p><strong>Martijn Rats </strong>It depends a little bit market by market, but in most markets we have price indicators other than simply the spot price of the commodity that will tell us something about the underlying dynamics of the market. In particular, price forward curves tell us a lot, and particularly the slope of the forward curve tells us a lot. So if a market is fundamentally tight, quite often that is associated with downward sloping forward curves. Downward sloping forward curves, incentivize holders of inventory to release commodities from inventory, and the market only creates those structures when extra supply from inventory is needed. So at the moment, particularly in the oil markets, that is exactly that what we're seeing. We're seeing very steeply downward sloping forward curves. And that would be consistent with a scenario in which oil prices simply rise because of the tightness in supply demand, not because of speculative reasons. If you have purely speculative reasons, geopolitical risk building, the price can still rise, but the forward curve would not be so steeply downward sloping. And for that reason, we would be of the school of thought that actually says that particularly the rise in the price of oil recently is not related to geopolitical risk at this stage. Maybe at some point that will become more important, but that is not what's going on. So far, the price of oil is mostly supported by simply the fundamentals of supply and demand.</p><p>&nbsp;</p><p><strong>Martijn Rats</strong> That's typically how we go about it, but Andrew perhaps let me ask you. We look at commodities from a pure fundamentals perspective, supply and demand, inventories, those factors, but you often put it in a broader cross asset context. From a cross asset perspective, how do you look at the asset class?</p><p><br></p><p><strong>Andrew Sheets </strong>So there are two factors here that I think are really important. The first is that I think commodities are really unique in that they are maybe the asset class where buying the index, kind of quote unquote, has actually potentially the most problematic. Some of the broadest, most widely recognized commodity indices have not performed particularly well over time, and some of that's due to the nature of the commodity markets you just highlighted. These markets can be inefficient, they can have structural inefficiencies. That's one thing I think investors should keep in mind is that the performance of commodities relative to some of the indices one might see can be quite different. The second element is around the inflation debate. I think that's really important. As we've discussed on this program before, I'm kind of skeptical that gold will be a particularly good inflation hedge in this environment. Whereas I'm a lot more optimistic that oil can work in that manner that energy related commodities can and I think there are some interesting dynamics there related not just to the to your team's fundamental views, your team has a much more bullish forecast for oil than it does for gold, as well as some of the more quantitative tools that we run that that oil yields a lot more to hold it than gold does, that oil has much better momentum, price momentum, than gold does. And generally speaking, in commodities, investors have been rewarded for going with the momentum. It tends to be a very cycle-based trending asset class. So, you know, I think that the case for commodities overall is strong in our cross asset allocation. We're running a modest overweight to commodities. That was a view we went out with in our 2022 outlook back in November. But you know, these nuances are really important, both between different commodities and then how one implements them going forward.</p><p><br></p><p><strong>Andrew Sheets </strong>So with that, Martijn, thanks for taking the time to talk.</p><p><br></p><p><strong>Martijn Rats </strong>My pleasure. Thank you, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.</p>",
  "itunes:title": "Special Episode: The Improving Case for Commodities",
  "itunes:episodeType": "full",
  "itunes:episode": 548,
  "itunes:summary": "For only the second time in the last decade, commodities outperformed equities in 2021. Looking ahead at 2022, what challenges and opportunities are on the horizon for this asset class?",
  "content:encoded": "<p>For only the second time in the last decade, commodities outperformed equities in 2021. Looking ahead at 2022, what challenges and opportunities are on the horizon for this asset class?</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Morgan Stanley's Chief Cross Asset. Strategist.</p><p><br></p><p><strong>Martijn Rats </strong>And I'm Martijn Rats, Morgan Stanley's Global Commodity Strategist.</p><p><br></p><p><strong>Andrew Sheets </strong>And today in the podcast we'll be talking about tailwinds driving commodities broadly, as well as the path ahead for global energy markets. It's Friday, February 4th at 3p.m. in London.&nbsp;</p><p><br></p><p><strong>Andrew Sheets </strong>So, Martijn, there were a number of reasons why I wanted to talk to you today, but one of them was that, for only the second time in the last decade, commodities outperformed equities in 2021. There are a number of drivers behind this, and you and your team have done some good work recently talking about those drivers and how they might continue. But one of them has certainly been the focus on inflation, which has been a major investment topic at the end of last year and continues to be a major topic into this year. Why are commodities and the inflation debate so interlinked and why do you think they're important for commodity performance?</p><p><br></p><p><strong>Martijn Rats </strong>Well, look, commodities tend to maintain their value in real terms. So when there is broad inflation, the cost of producing commodities tends to go up. And when that happens, then the price of commodities tends to follow that. So at the same time, if you have a rising inflation, then also ends up in having an impact on interest rates. Interest rates start to rise. That tends to be a headwind for a lot of financial assets. So when inflation expectations all of a sudden pick up, then then all of a sudden it weighs on the valuation of an awful lot of other things, whilst actually commodities are often somewhat insulated of that. There aren't that many sectors that that really benefit from inflation. So all of a sudden then from an investment perspective, investment demand for commodities goes up. The allocation to commodities is still small, and when you put those things together, that explains why in the past and again over the last 12, 18 months, commodities really come into their own in these periods where inflation expectations are picking up and are high, commodities tend to do well in those environments.</p><p><br></p><p><strong>Andrew Sheets </strong>So another thing about commodities is that you can't ignore is that this is a really diverse set of things. You know, we're talking about everything from, you know, wheat, to coffee, to aluminum, to crude oil. So it's hard to generalize what's driving commodities as a whole, but something I think is quite interesting in your research is that one theme that actually strikes out across a lot of different commodities from aluminum to oil, is the energy transition, which is affecting both demand for certain commodities and the supply of certain commodities. Could you go into that in a little bit more detail how you see the energy transition impacting this space? You know, really over the next decade?</p><p><br></p><p><strong>Martijn Rats </strong>Yeah, it broadly splits in two and<s> </s>there are a range of commodities for which the energy transition is basically demand positive. So if you look at a lot of renewable projects, you know, wind power or solar power or hydrogen projects, electric vehicles, all of those types of assets require tremendous demand amounts of, basically of metals, copper, lithium, cobalt, nickel, aluminum. In those areas, it simply demands positive. But then there are other areas where the energy transition creates a lot of uncertainty about the long-term outlook for demand. This is particularly true, of course, for the fossil fuels, for oil and gas. And what is currently going on is that the energy transition is starting to become such a red flag not to invest in new productive capacity in those areas, that it's that it's already weighing on capex, and that there is an element of it constraining the supply of those fossil fuels even before demand is materially impacted. And we're seeing that at play at the moment. Oil and gas demand continues to recover quite strongly coming out of COVID, and there are actually very little signs that demand for those fossil fuels is rolling over anytime soon.<s> </s>But the energy transition makes the demand outlook over the long run into the 2030s very uncertain. And the way that we read the market at the moment is that the demand uncertainty is already impacting investment now. If you don't invest for the 2030s, there's a certain amount of oil and gas you also don't have over the next couple of years. So whether it's through the supply side or through the demand side, our conclusion would be that on the whole the energy transition contributes to the tightness of commodity markets in a relatively broad sense.</p><p><br></p><p><strong>Andrew Sheets </strong>So Martijn, drilling down a little bit further into the oil story. You know, you and your team have identified what you call a triple deficit in oil markets that would drive a triple digit oil price estimate. You and your team think oil could hit $100 a barrel this year. Now<s> </s>what is that triple deficit and what's driving it?</p><p><br></p><p><strong>Martijn Rats </strong>The triple deficit refers to the idea or the expectation that three things will be low in the oil markets simultaneously, broadly around the middle of this year as we go into the second half. The first one is inventories, the second one is spare capacity, and a third one is investment levels. Already read last year we have seen very strong draws in global oil inventories. The oil market was under supplied by about two million barrels a day last year, which is historically very high. The way that we model supply demands, that rate of inventory draws that does slow down in 2022, but we end up with inventory draws nonetheless, and we will end 2022 on our balances with inventories that are still lower than at the end of last year. So, the first point low and falling levels of inventory. The second point relates to spare capacity. The world's spare capacity to produce oil in emergency situations when it's needed completely sits within OPEC. There is no spare capacity outside of OPEC now. OPEC is growing production this year, but they're not adding an awful lot of capacity. Our reading of the situation is that by the middle of the year OPEC's spare capacity, which at the moment stands probably somewhere around three and a half million barrels a day, will fall below two million barrels a day. And typically, when spare capacity falls to such low levels, it becomes supportive for prices. So that's the second of the triple deficit that we talk about, low and falling levels of spare capacity. And finally, there is investment. Investment has been on a sliding trend already since 2014, took an enormous nosedive in 2020, did not rebound in 2021, and is only modestly creeping higher this year. Investment levels relative to current consumption we would characterize as very low. And that is not changing anytime soon. So if you add these three things up low inventories, low spare capacity, low levels of investment, you're really looking at the oil market that is very tight. And ultimately, we think that that will support this $100 oil price forecast.</p><p><strong>&nbsp;</strong></p><p><strong>Andrew Sheets </strong>So Martijn, the last thing I want to ask you about was this question of geopolitical uncertainty. When I talked to investors, there are some who think that the only reason that the oil price has gone up a lot this year is because of increasing geopolitical tension. There are others who say, no, it's gone up mostly because of the supply and demand imbalance that you just highlighted<s> </s>how do you how do you as a commodities analyst in your team try to address questions of how much of a driver is fundamental and how much of it is risk premium around event uncertainty?</p><p><strong>&nbsp;</strong></p><p><strong>Martijn Rats </strong>It depends a little bit market by market, but in most markets we have price indicators other than simply the spot price of the commodity that will tell us something about the underlying dynamics of the market. In particular, price forward curves tell us a lot, and particularly the slope of the forward curve tells us a lot. So if a market is fundamentally tight, quite often that is associated with downward sloping forward curves. Downward sloping forward curves, incentivize holders of inventory to release commodities from inventory, and the market only creates those structures when extra supply from inventory is needed. So at the moment, particularly in the oil markets, that is exactly that what we're seeing. We're seeing very steeply downward sloping forward curves. And that would be consistent with a scenario in which oil prices simply rise because of the tightness in supply demand, not because of speculative reasons. If you have purely speculative reasons, geopolitical risk building, the price can still rise, but the forward curve would not be so steeply downward sloping. And for that reason, we would be of the school of thought that actually says that particularly the rise in the price of oil recently is not related to geopolitical risk at this stage. Maybe at some point that will become more important, but that is not what's going on. So far, the price of oil is mostly supported by simply the fundamentals of supply and demand.</p><p>&nbsp;</p><p><strong>Martijn Rats</strong> That's typically how we go about it, but Andrew perhaps let me ask you. We look at commodities from a pure fundamentals perspective, supply and demand, inventories, those factors, but you often put it in a broader cross asset context. From a cross asset perspective, how do you look at the asset class?</p><p><br></p><p><strong>Andrew Sheets </strong>So there are two factors here that I think are really important. The first is that I think commodities are really unique in that they are maybe the asset class where buying the index, kind of quote unquote, has actually potentially the most problematic. Some of the broadest, most widely recognized commodity indices have not performed particularly well over time, and some of that's due to the nature of the commodity markets you just highlighted. These markets can be inefficient, they can have structural inefficiencies. That's one thing I think investors should keep in mind is that the performance of commodities relative to some of the indices one might see can be quite different. The second element is around the inflation debate. I think that's really important. As we've discussed on this program before, I'm kind of skeptical that gold will be a particularly good inflation hedge in this environment. Whereas I'm a lot more optimistic that oil can work in that manner that energy related commodities can and I think there are some interesting dynamics there related not just to the to your team's fundamental views, your team has a much more bullish forecast for oil than it does for gold, as well as some of the more quantitative tools that we run that that oil yields a lot more to hold it than gold does, that oil has much better momentum, price momentum, than gold does. And generally speaking, in commodities, investors have been rewarded for going with the momentum. It tends to be a very cycle-based trending asset class. So, you know, I think that the case for commodities overall is strong in our cross asset allocation. We're running a modest overweight to commodities. That was a view we went out with in our 2022 outlook back in November. But you know, these nuances are really important, both between different commodities and then how one implements them going forward.</p><p><br></p><p><strong>Andrew Sheets </strong>So with that, Martijn, thanks for taking the time to talk.</p><p><br></p><p><strong>Martijn Rats </strong>My pleasure. Thank you, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.</p>",
  "guid": "gid://art19-episode-locator/V0/WWj8QhznuZmCym3AgW14x8e1tYhaM_o-iSt_1BUNt7s",
  "pubDate": "Sat, 05 Feb 2022 00:49:44 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:10:18",
  "enclosure": ""
}