{
  "title": "Understanding medical marijuana, CBD and more, with Ziva Cooper, PhD",
  "itunes:title": "Understanding medical marijuana, CBD and more, with Ziva Cooper, PhD",
  "pubDate": "Wed, 26 Oct 2022 10:30:00 +0000",
  "guid": "5324d064-78ff-44ea-96de-461fa58d4b91",
  "link": "http://sopapa.libsyn.com/understanding-medical-marijuana-cbd-and-more-with-ziva-cooper-phd",
  "itunes:image": "",
  "description": "<p>Over the past few years, the number and variety of cannabis products legally available to American consumers has soared. Ziva Cooper, PhD, of the UCLA Center for Cannabis and Cannabinoids, talks about how researchers are exploring both the potential health benefits and the risks of marijuana, CBD and more, aiming to make sure that the science keeps up with policy changes and the evolving marketplace.<br /> <br /> <br /> <strong>Links</strong><br /> <br /> <br /> <a href=\"https://bioscience.ucla.edu/people/ziva-cooper/\">Ziva Cooper, PhD</a><br /> <br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p>",
  "content:encoded": "<p>Over the past few years, the number and variety of cannabis products legally available to American consumers has soared. Ziva Cooper, PhD, of the UCLA Center for Cannabis and Cannabinoids, talks about how researchers are exploring both the potential health benefits and the risks of marijuana, CBD and more, aiming to make sure that the science keeps up with policy changes and the evolving marketplace.   Links   <a href=\"https://bioscience.ucla.edu/people/ziva-cooper/\">Ziva Cooper, PhD</a>  <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p>",
  "enclosure": "",
  "itunes:duration": "45:01",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Over the past few years, the number and variety of cannabis products legally available to American consumers has soared. Ziva Cooper, PhD, of the UCLA Center for Cannabis and Cannabinoids, talks about how researchers are exploring both the potential...",
  "itunes:episode": 212,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}