{
  "title": "Progressive Transformation Learning For Leveraging Virtual Images in Training. (arXiv:2211.01778v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01778",
  "description": "<p>To effectively interrogate UAV-based images for detecting objects of\ninterest, such as humans, it is essential to acquire large-scale UAV-based\ndatasets that include human instances with various poses captured from widely\nvarying viewing angles. As a viable alternative to laborious and costly data\ncuration, we introduce Progressive Transformation Learning (PTL), which\ngradually augments a training dataset by adding transformed virtual images with\nenhanced realism. Generally, a virtual2real transformation generator in the\nconditional GAN framework suffers from quality degradation when a large domain\ngap exists between real and virtual images. To deal with the domain gap, PTL\ntakes a novel approach that progressively iterates the following three steps:\n1) select a subset from a pool of virtual images according to the domain gap,\n2) transform the selected virtual images to enhance realism, and 3) add the\ntransformed virtual images to the training set while removing them from the\npool. In PTL, accurately quantifying the domain gap is critical. To do that, we\ntheoretically demonstrate that the feature representation space of a given\nobject detector can be modeled as a multivariate Gaussian distribution from\nwhich the Mahalanobis distance between a virtual object and the Gaussian\ndistribution of each object category in the representation space can be readily\ncomputed. Experiments show that PTL results in a substantial performance\nincrease over the baseline, especially in the small data and the cross-domain\nregime.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Shen_Y/0/1/0/all/0/1\">Yi-Ting Shen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lee_H/0/1/0/all/0/1\">Hyungtae Lee</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kwon_H/0/1/0/all/0/1\">Heesung Kwon</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bhattacharyya_S/0/1/0/all/0/1\">Shuvra Shikhar Bhattacharyya</a>"
}