{
  "title": "Aligning the Eyes of the Universe Machine",
  "link": "https://spectrum.ieee.org/james-webb-space-telescope-mirror",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-person-on-a-cherry-picker-next-to-the-james-webb-space-telescope.jpg?id=31637785&width=1200&height=800&coordinates=0%2C67%2C0%2C142\"/><br/><br/><p>\n\tThe <a href=\"https://spectrum.ieee.org/collections/james-webb-telescope/\" target=\"_self\">James Webb Space Telescope</a>, in just a few months of operation, has begun to change our view of the universe. Its images—more detailed than what was possible before—show space aglow with galaxies, some of them formed very soon after the big bang.\n</p><p>\n\tNone of this would be possible without the work of a team led by <a href=\"https://www.researchgate.net/scientific-contributions/D-Scott-Acton-2005553350\" rel=\"noopener noreferrer\" target=\"_blank\">Scott Acton</a>, the lead <a href=\"https://webb.nasa.gov/content/about/innovations/wavefront.html\" rel=\"noopener noreferrer\" target=\"_blank\">wavefront sensing and control</a> scientist for the Webb at <a href=\"https://www.ball.com/aerospace/programs/astrophysics/webb\" rel=\"noopener noreferrer\" target=\"_blank\">Ball Aerospace & Technologies</a> in Colorado. He and his colleagues <a href=\"https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.823.4123&rep=rep1&type=pdf\" rel=\"noopener noreferrer\" target=\"_blank\">developed</a> <a href=\"https://www.jwst.nasa.gov/resources/JWSTTech.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">the systems</a> that align the 18 separate segments of the Webb’s primary mirror with its smaller secondary mirror and science instruments. To produce clear images in the infrared wavelengths the telescope uses, the segments have to be within <a href=\"https://jwst-docs.stsci.edu/jwst-observatory-hardware/jwst-wavefront-sensing-and-control\" rel=\"noopener noreferrer\" target=\"_blank\">tens of nanometers</a> of the shape specified in the spacecraft design.\n</p><p>\n\tActon grew up in Wyoming and spent more than 20 years on the Webb team. <em>IEEE Spectrum</em> spoke with Acton after his team had finished aligning the telescope’s optics in space. This transcript has been edited for clarity and brevity.\n</p><p>\n<strong>Tell your story. What got you started?</strong>\n</p><p>\n<strong>Scott Acton:</strong> When I was seven-years-old, my dad brought home a new television. And he gave me the old television to take apart. I was just enthralled by what I saw inside this television. And from that moment on I was defined by electronics. You look inside an old television and there are mechanisms, there are smells and colors and sights and for a seven-year-old kid, it was just the most amazing thing I’d ever seen.\n</p><p>\n\tFast-forward 25 years and I’m working in the field of adaptive optics. And eventually that led to wavefront sensing and controls, which led to the Webb telescope.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"sky with bright stars and gaseous activity\" class=\"rm-shortcode\" data-rm-shortcode-id=\"cf0f79e1e2e89612e8fa9b62102b382e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"01a79\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/sky-with-bright-stars-and-gaseous-activity.jpg?id=31638587&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Called the Cosmic Cliffs, Webb’s seemingly three-dimensional picture looks like craggy mountains on a moonlit evening. In reality, it is the edge of the giant, gaseous cavity within NGC 3324, and the tallest “peaks” in this image are about 7 light-years high.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\"> NASA/ESA/CSA/STScI</small>\n</p><p>\n<strong>Talk about your work getting the telescope ready for flight. You worked on it for more than 20 years.</strong>\n</p><p>\n<strong>Acton: </strong>Well, we had to invent all of the wavefront sensing and controls. None of that technology really existed in 2001, so we started from the ground up with concepts and simple experiments. Then more complicated, very complicated experiments and eventually something known as TRL 6 technology—Technology Readiness Level 6—which demonstrated that we could do this in a flightlike environment. And then it was a question of taking this technology, algorithms, understanding it and implementing it into very robust procedures, documentation, and software, so that it could then be applied on the flight telescope.\n</p><p>\n<strong>What was it like finally to launch?</strong>\n</p><p>\n<strong>Acton:</strong> Well, I’ve got to say, there was a lot of nervousness, at least on my part. I was thinking we had a 70 percent chance of mission success, or something like that. It’s like sending your kid off to college—this instrument that we’d been looking at and thinking about.\n</p><p>\n\tThe Ariane 5 vehicle is so reliable. I didn’t think there was going to be any problem with it, but deployment starts, basically, minutes after launch. So, for me, the place to be was at a computer console [at the Space Telescope Science Institute in Baltimore].\n</p><p>\n<strong>And then there were a lot of things that had to work.</strong>\n</p><p>\n<strong>Acton:</strong> Yes, right. But there are some things that that are interesting. They have these things called nonexplosive actuators [used to secure the spacecraft during launch]. There are about 130 of them. And you actually can’t test them. You build them and they get used, basically, once. If you do reuse one, well, it’s now a different actuator because you have to solder it back together. So you can’t qualify the part, but what you can do is qualify the process.\n</p><p>\n\tWe could have still had a mission if some didn’t fire, but most of them were absolutely necessary for the success of the mission. So just ask yourself, let’s suppose you want to have a 95 percent chance of success. What number raised to the 130th power is equal to 0.95? That number is basically one. These things had to be perfect.\n</p><p class=\"pull-quote\">\n\tI remember walking home one night, talking on the phone to my wife, Heidi, and saying, “If I’m wrong about this I’ve just completely screwed up the telescope.” She said, “Scott, that’s why you’re there.” That was her way of telling me to cowboy up. The responsibility had to come down to somebody and in that moment, it was me.\n</p><p>\n<strong>I think the public perception was that the Webb was in very good shape and the in-flight setup all went very well. Would you say that’s accurate?</strong>\n</p><p>\n<strong>Acton: </strong>Early on in the mission there were hiccups, but other than that, I’d say things just went beyond our wildest expectations. Part of that comes down to the fact that my team and I had commissioned the telescope 100 times in simulations. And we always made it a little harder. I think that served us well because when we got to the real telescope, it was quite robust. It just worked.\n</p><p>\n<strong>Take us through the process of aligning the telescope.</strong>\n</p><p>\n<strong>Acton: </strong>The first image we got back from the telescope was 2 February, in the middle of the night. Most people had gone home, but I was there, and a lot of other people were too. We just pointed the telescope at the Large Magellanic Cloud, which has lots and lots of stars in it, and took images on the near-infrared cameras. People were really happy to see these images because they were looking basically to make sure that the science instruments worked.\n</p><p>\n\tBut some of us were really concerned with that image, because you could see some very significant astigmatism—stronger than we were expecting to see from our simulations. Later we would learn that the telescope’s secondary mirror was off in translation—about 1.5 millimeters along the deployment axis and about a millimeter in the other axis. And the primary mirror segments were clocked a bit from the perfectly aligned state.\n</p><p>\n<a href=\"https://jwst.nasa.gov/content/meetTheTeam/people/feinberg.html\" rel=\"noopener noreferrer\" target=\"_blank\">Lee Feinberg</a>, the telescope lead at NASA Goddard, texted me and said, “Scott, why can’t you just simulate this to see if you can get some images that bad?” So that morning I ran a simulation and was able to reproduce almost exactly what we were seeing in these images. We realized that we were not going to have any major problems with the wavefront.\n</p><p><strong>Describe the cadence of your work during commissioning. What would a day be like?</strong>\n</p><p>\n<strong>Acton:</strong> One of the rules we set up very early on was that in terms of wavefront sensing and control, we would always have two people sitting in front of the computers at any given time. Anytime anything significant happened, I always wanted to make sure that I was there, so I got an apartment [near the institute in Baltimore]. From my door to the door of the of the Mission Operations Center was a 7-minute walk.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"sky with bright star in middle with gases\" class=\"rm-shortcode\" data-rm-shortcode-id=\"9e7e4d9499e9901a9c1bd852b8b57d33\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"a9903\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/sky-with-bright-star-in-middle-with-gases.jpg?id=31638681&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In this mosaic image stretching 340 light-years across, Webb’s Near-Infrared Camera (NIRCam) displays the Tarantula Nebula star-forming region in a new light, including tens of thousands of never-before-seen young stars that were previously shrouded in cosmic dust.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA/ESA/CSA/STScI/Webb ERO Production Team</small>\n</p><p>\n\tThere were certainly times during the process where it had a very large pucker factor, if you will. We couldn’t point the telescope reliably at the very beginning. And a lot of our software, for the early steps of commissioning, depended on the immutability of telescope pointing. We wanted to have the telescope repeatedly pointed to within a couple of arc-seconds and it was closer to 20 or 30. Because of that, some of the initial moves to align the telescope had to be calculated, if you will, by hand.\n</p><p>\n\tI remember walking home one night, talking on the phone to my wife, Heidi, and saying, “If I’m wrong about this I’ve just completely screwed up the telescope.” She said, “Scott, that’s why you’re there.” That was her way of telling me to cowboy up. The responsibility had to come down to somebody and in that moment, it was me.\n</p><p>\n\tBut when the result came back, we could see the images. We pointed the telescope at a bright isolated star and then we could see, one at a time, 18 spots appearing in the middle of our main science detector. I remember a colleague saying, “I now believe we’re going to completely align the telescope.” He felt in his mind that if we could get past that step, that everything else was downhill.\n</p><p>\n\tYou’re trying to piece together the universe. It’s hard to get it right, and very easy to make mistakes. But we did it.\n</p><p>\n<strong>Building the Webb was, of course, a big, complicated project. Do you think there are any particular lessons to be drawn from it that people in the future might find useful?</strong>\n</p><p>\n<strong>Acton:</strong> Here are a couple of really big ones that apply to wavefront sensing and control. One is that there are multiple institutions involved—Northrop Grumman, Ball Aerospace, the Goddard Space Flight Center, the Space Telescope Science Institute—and the complication of having all these institutional lines. It could have been very, very difficult to navigate. So very early on we decided not to have any lines. We were a completely badgeless team. Anybody could talk to anybody. If someone said, “No, I think this is wrong, you should do it this way,” even if they didn’t necessarily have contractual responsibility, everybody listened.\n</p><p>\n\tAnother big lesson we learned was about the importance of the interplay between experimentation and simulation. We built a one-sixth scale model, a fully functional optical model of the telescope, and it’s still working. It allowed us, very early on, to know what was going to be difficult. Then we could address those issues in simulation. That understanding, the interplay between experimentation and modeling and simulations, was absolutely essential.\n</p><p>\n<strong>Recognizing of course, that it’s very early, do you yet have a favorite image?</strong>\n</p><p>\n<strong>Acton:</strong> My favorite image, so far, was one that was taken during the last real wavefront activity that we did as part of commissioning. It was called a thermal slew test. The telescope has a large <a href=\"https://spectrum.ieee.org/james-webb-telescope-sunshield\" target=\"_self\">sunshield</a>, but the sunshield can be at different angles with respect to the sun. So to make sure it was stable, we aimed it at a bright star we used as a guide star, put it in one orientation, and stayed there for five or six days. And then we switched to a different orientation for five or six days. It turned out to be quite stable. But how do you know that the telescope wasn’t rolling about the guide star? To check this, we took a series of test images with the redundant fine-guidance sensor. As you can imagine, when you have a 6-1/2 meter telescope at L2 away from any competing light sources that is cooled to 50 kelvins, yes, it is sensitive. Even just one 20-minute exposure is going to just have unbelievable detail regarding the deep universe. Imagine what happens if you take 100 of those images and average them together. We came up with an image of just some random part of the sky.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"james webb telescope image of bright lights against a dark background\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d6e5ebd7d02699554f88c146434fd49c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5a840\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/james-webb-telescope-image-of-bright-lights-against-a-dark-background.jpg?id=31638422&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Scott Acton’s favorite Webb image: A test image of a random part of the sky, shot with the Webb’s fine-guidance sensor. The points with six-pointed diffraction patterns are stars; all other points are galaxies. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA/CSA/FGS</small>\n</p><p>\n\tI sent this image to <a href=\"https://www.astro.ucla.edu/~larkin/\" rel=\"noopener noreferrer\" target=\"_blank\">James Larkin</a> at UCLA, and he looked at it and estimated that that single image had 15,000 galaxies in it. Every one of those galaxies probably has between 100 [billion] and 200 billion stars.\n</p><p>\n\tI don’t talk about religion too much when it comes to this, but I must have had in my mind a Biblical reference to the stars singing. I pictured all of those galaxies as singing, as if this was a way for the universe to express joy that after all these years, we could finally see them. It was quite an emotional experience for me and for many people.\n</p><p>\n<strong>You realized that there was so much out there, and you weren’t even really looking for it yet? You were still phasing the telescope?</strong>\n</p><p>\n<strong>Acton:</strong> That’s right. I guess I I’m not sure what I expected. I figured you’d just see dark sky. Well, there <em>is</em> no dark sky. Dark sky is a myth. Galaxies are everywhere.\n</p><p>\n\tFinally, we got to our first diffraction-limited image [with the telescope calibrated for science observations for the first time]. And that’s the way the telescope is operating now.\n</p><p>\n\tSeveral days later, about 70 of us got together—astronomers, engineers, and other team members. A member of the team—his name is Anthony Galyer—and I had gone halves several years earlier and purchased a bottle of cognac from 1906, the year that James Webb was born. We toasted James Webb and the telescope that bears his name.\n</p>",
  "pubDate": "Fri, 09 Sep 2022 17:39:58 +0000",
  "guid": "https://spectrum.ieee.org/james-webb-space-telescope-mirror",
  "category": [
    "Jwst",
    "Telescopes",
    "Wavefront sensing",
    "Simulations",
    "Control systems",
    "Optics"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}