{
  "title": "Episode 6: The Ink Spots &#8212; &#8220;That&#8217;s When Your Heartaches Begin&#8221;",
  "link": "https://500songs.com/podcast/the-ink-spots-thats-when-your-heartaches-begin/",
  "pubDate": "Mon, 12 Nov 2018 00:46:07 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/the-ink-spots-thats-when-your-heartaches-begin/",
  "description": "Welcome to episode six of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at the Ink Spots and \"That's When Your Heartaches Begin\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-6-thats-when-your-heartaches-begin/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. Unfortunately, listeners in the US may not be able to access this one -- Mixcloud doesn't allow USians to listen to streams when they have more than four songs in a row by the same artists, due to copyright restrictions (and it isn't set up to realise that in this case, all the music is in the public domain so those restrictions don't apply). I apologise for that, but it's rather out of my hands.\n\nAll the Ink Spots' music is now in the public domain, so there are a lot of compilations available. <a href=\"https://amzn.to/2QAzQ5U\">This one</a>&nbsp;is dirt cheap, has decent sound quality, and has all the essential hits on it.\n\n<em>More than Words Can Say&nbsp;</em>by Marv Goldberg is the definitive Ink Spots biography, but sadly it came out through an academic publisher and is thus grossly overpriced. You can buy it <a href=\"https://amzn.to/2OBODeY\">here</a>, should you choose. Goldberg's <a href=\"http://www.uncamarvy.com\">website</a> is also an invaluable source of information, not just about the Ink Spots but about forties and fifties vocal groups, and R&B.\n\n<a href=\"http://inkspots.ca/\">Inkspots.ca </a>&nbsp;is a wonderful resource for detail about the band's career.\n\n<em><a href=\"https://amzn.to/2PN1Giv\">Before Elvis</a>,&nbsp;</em>a book I've mentioned many times before, has a reasonable amount about the Ink Spots in it, as well as about almost all the other pre-1954 artists I'm covering here.\n\nA resource I should have mentioned earlier, but one that's useful for all the pre-1952 music, is <a href=\"https://archive.org/details/georgeblood\">archive.org's collection of digitised 78 records</a>. I'm using this a lot.\n\nAnd finally, Deke Watson's autobiography is <a href=\"https://amzn.to/2B1jMFf\">currently only available on the Kindle</a>. It's credited there as by \"Shirlita Bolton\", but that's actually the name of Deke's widow, who owns the rights to the book -- it's definitely Deke's autobiography. It's very short, only seventy-three pages, and it's full of inaccuracies, but it's still the only autobiography any of the real Ink Spots wrote, and it's very cheap.\n\n<strong>Clarification</strong>\n\nAt one point, talking about \"top and bottom\", I say \"they first did it in the studio\". I don't mean, there, that the first time they performed in this style was in the studio, but that this was the first time they tried something in the studio that they'd already done live. The way I say it makes it sound more ambiguous than I intended...\n\n<strong>Transcript</strong>\n\nOK, so we've covered the Carnegie Hall concerts of 1938 and 39 and the performers around them <em>quite</em> exhaustively now -- we had a bit of a diversion into Western Swing, but mostly we've stayed around there.\n\nNow, we're still looking at New York in the late 1930s and early forties, but we're moving away from those shows, and we're going to look at the most popular vocal group of the era, and possibly the most important vocal group of all time.\n\nWe've talked over the last few weeks about almost all the major elements of what we now think of as rock and roll -- the backbeat, the arrangements that focus on a rhythm section, the riffs, the electric guitar and the amplification generally. We've seen, quite clearly, how most of these elements were being pulled together, in different proportions and by different people, in the late 1930s, almost but not quite coalescing into what we now call rock and roll.\n\nThere's one aspect which might be quite easy to overlook, though, which we've not covered yet, and that's the vocal group. Vocal harmonies have become much less prominent in rock music in the last forty years or so, and so today they might not be thought of as an essential element of the genre, but vocal groups played a massive role in the fifties and sixties, and were a huge element of the stew of genres that made up rock and roll when it started.\n\nAnd the vocal group that had the most influence on the groups that became rock and roll was a band whose basis was not as a vocal group, but in coffee pot groups.\n\nCoffee-pot groups were groups of poor black teenagers, who performed on street corners and tried to reproduce the sounds of the lush records they heard on the radio, using... well, using the equipment they had to hand. For string parts, you'd play ukuleles or guitars or banjos, but for the horns you'd play the kazoo. But of course, kazoos were not particularly pleasant instruments, and they certainly didn't sound much like a saxophone or clarinet. But it turned out you could make them sound a lot more impressive than they otherwise would if you blew them into something that resonated. Different sizes of container would resonate differently, and so you could get a pretty fair approximation of a horn section by having a teapot, a small coffee pot, and a large coffee pot, and having three of your band members play kazoos into them. The large coffee pot you could also pass around to the crowd afterward, to collect the money in -- though, as Deek Watson said about his coffee-pot group the Percolating Puppies \"all of us had to keep our eyes on the cat who passed the collection for the evening, or else some of the money found its way from the pot to his pocket before dividing time arrived\".\n\nOther instrumental parts, of course, would be replaced with simple mouth noises. You can make quite an impressive collection of instrumental sounds with just your voice, if you try hard enough.\n\nThe Ink Spots formed out of people who'd started their careers in these groups -- Charlie Fuqua (pron. Foo-kway, and yes I have checked) was in one with Jerry Daniels before they became the imaginatively-named duo \"Charlie and Jerry\", while Deek Watson was in another. Those three, plus Hoppy Jones, performed in a variety of combinations under a variety of names before they settled on calling themselves \"King, Jack, and Jester\" or sometimes \"King, Jack, and Jesters\".\n\nIn the early years of their career, they actually got themselves a radio show on a local station, where they were a fill-in for another band, the Four Mills Brothers. And the Four Mills Brothers were the people who influenced them the most.\n\nThe Mills Brothers had actually started out not so differently from the coffee pot groups -- they entered a talent contest, and John Mills had lost the kazoo he was going to play. He cupped his hands in front of his mouth and imitated a trumpet, and the brothers decided that they were going to start imitating brass instruments with their voices. And they got good at it. Listen to this:\n\n[Mills Brothers: \"It Don't Mean a Thing\"]\n\nThere is no instrument on there other than a single acoustic guitar, believe it or not. They're imitating trumpets, a tuba, and a trombone with their voices, and they'd listen to instrumental musicians and copy their voicings. This is something&nbsp; that a lot of vocal groups have continued to do, but no-one has done it better than the Mills Brothers.\n\nThe Mills Brothers became massively successful, and from 1930 through 1939 they were far and away the biggest black act in the US, making multiple appearances on Bing Crosby's radio show, appearing in films, and touring the world. It was the touring the world that caused their eventual downfall -- they went to play the UK in 1939, and discovered that with World War II imminent, the only ship away from the UK they could get at the end of their tour was one that went to Australia.\n\nBetween that massive transport disruption, and then the further disruption caused by the war itself, it took them two years to get back into the US, by which time their popularity had faded somewhat (although they went on to have a massive hit with \"Paper Moon\" when they got back -- their career was far from over). They carried on having occasional hits into the late sixties, and carried on performing together into the late eighties -- and the last surviving Mills Brother carried on performing until his death in 1999, with one of his sons who carries on the family band to this day.\n\nBut they'd lost their place as the top of the entertainment tree, and they'd lost it to people who'd been imitating them -- to the band we last heard of performing as \"King, Jack, and Jesters\".\n\nBy the mid 1930s, those four men were in New York and performing as the Riff Brothers, but not getting very far. They were doing a mix of Mills Brothers inspired stuff and more jive music, and were earning decent money but not yet massive successes.\n\nIn his autobiography, Deek Watson talks about how the Riff Brothers decided to change their name -- there were too many brother and cousin acts for the Riff Brothers to stand out, and the band eventually ended up in their booking agent's office, arguing for hours over what name they should choose and getting nowhere. Finally, as their agent toyed with a pen, a few drops of ink fell out. I'll read the next bit from Watson's book directly:\n\n\"To me, it seemed like inspiration. 'That's it!' I shouted. 'How about calling us the Ink Spots?'\n\nThe boys really yelled this time. 'There you go again Deek!' Charlie exclaimed. 'That's right!' agreed Hoppy, 'always wanting us to be something colored. Black Dots, Ink Spots, next thing you know he'll be wanting us to call ourselves the Old Black Joes'\n\nThey all talked at once. 'Man, you know ain't nobody wants to be no Ink Spot'.\"\n\nNow, Watson in his book does seem to take credit for absolutely every good idea anyone involved in the band had (and for other things which had nothing to do with them, like writing \"Your Feet's Too Big\", which was written by Fred Fisher and Ada Benson). He also makes up some quite outrageous lies, like that this original lineup of the Ink Spots played at the coronation of King Edward VIII (anyone who knows anything about inter-war British history will know why that is impossible), but this does have the ring of truth about it. When he was in the Percolating Puppies, Watson used to work under the name \"four-dice Rastus\", and many early reviews of the Ink Spots criticised him for eye-rolling, hand-waving, and other minstrelly behaviours, which many black reviewers of the time considered brought black people into disrepute. It's entirely possible that his bandmates would be irritated by his emphasis on their race.\n\nThat said, I'm not going to criticise Watson for this, or repeat some of the insulting names he was called by other black people. Everyone has a different response to the experience of oppression, and I'm not, as a white man, going to sit here and moralise or pontificate about how black people \"should\" have behaved in the 1930s. A lot of much better artists than Deke Watson did a lot more to play along with those stereotypes.\n\nEither way, and whatever they thought about it, Charlie Fuqua, Deke Watson, Jerry Daniels and Hoppy Jones became the Ink Spots, and that was the name under which their group would eventually become even more famous than the Mills Brothers.\n\nBut there was a problem -- Jerry Daniels, their main jive singer, was getting seriously ill from the stress of the band's performing schedule, and eventually ended up hospitalised. He couldn't continue touring with them, and so for a little while the Four Ink Spots were down to three. They had to change, and in changing their lineup, they&nbsp;became the band that would change music.\n\nIn 1936 Bill Kenny, a twenty-one year old high tenor singer, won an amateur night contest at the Savoy Ballroom. Moe Gale, the Ink Spots' manager, was the co-owner of the Savoy, and Charles Buchanan, the club's manager, knew his boss' band wanted a new singer and suggested Kenny.&nbsp;Kenny was, by any standards, an extraordinary singer, and his vocals would become the defining characteristic of the Ink Spots' records from that point on. When you think of the Ink Spots, it's Kenny's voice you think of. Or at least, it's Kenny and Hoppy Jones.\n\nBecause as well as being an utterly astonishing singer, Bill Kenny was an inspired arranger, and he came up with an idea that changed the whole style and sound of the Ink Spots' music, and would later indirectly change all of popular music. The idea he came up with was called \"top and bottom\".\n\n(Note that Deke Watson also claimed credit for this idea in his autobiography, but the story as he tells it there is inconsistent with the known facts, so I'm happy to believe the consensus view that it was Kenny).\n\nUp until Bill Kenny joined the band, the Ink Spots had been a jive band, performing songs in the style of Cab Calloway or Fats Waller -- they were performing uptempo comedy numbers, and they were doing it very well indeed:\n\n[excerpt of the Ink Spots singing \"Your Feet's Too Big\"]\n\nWhen Bill Kenny joined the band, they continued doing the same kind of thing for a while -- still concentrating on uptempo numbers, as you can hear in their 1937 recording of \"Swing High, Swing Low\".\n\n[excerpt of \"Swing High Swing Low\"]\n\nSometimes in those performances Hoppy Jones would speak-sing a line or two in his bass voice, but it was mostly fairly straightforward vocal group singing. They were still basically doing the Mills Brothers sound. And that was fine, because the Mills Brothers were, after all, the most popular black vocal group ever up to that point. But if they were going to be really big, they needed their own sound, and Bill Kenny came up with it.\n\nHe refined the idea of Hoppy's spoken vocals and came up with a hit formula, which they would use over and over again. They first did it in the studio with their massive hit \"If I Didn't Care\", but the one we're going to look at is their 1941 record \"That's When Your Heartaches Begin\". They started doing ballads, usually introduced by an acoustic guitar playing what would become a familiar figure -- this one:\n\n[excerpt of \"That's When Your Heartaches Begin\"]\n\nWe'd then get the whole song sung through by Bill Kenny, with the others singing backing vocals:\n\n[excerpt of him singing]\n\nThen Kenny would join in with the backing vocals, as Hoppy Jones repeated the whole song, speak-singing it in his deep bass voice\n\n[excerpt of that]\n\nAnd finally there'd be a final line with Kenny singing lead again.\n\nWhen I say this was a formula, I mean it <em>really</em> was a formula. They'd found a sound and they were going to absolutely stick with it. To give you an example of what I mean, here's the intro to \"We Three (My Echo, My Shadow, and Me)\"\n\n[intro to that song]\n\nNow here's the intro to \"I Don't Want to Set the World on Fire\"\n\n[intro to that song]\n\nAnd here's the intro to \"To Each His Own\"\n\n[intro to that song]\n\nAnd to \"Whispering Grass\"\n\n[intro to that song]\n\nI could go on... if you don't believe that those are different songs, incidentally, check out the Mixcloud with the full versions of all these songs on.\n\nThis was such a well-known formula for them that the Glenn Miller band did a dead-on parody of it:\n\n[excerpt: \"Juke Box Saturday Night\"]\n\nBut the thing is -- all those songs I just played the intros of, they all went top ten, and two of them went to number one. This was a formula that absolutely, undoubtedly, worked.\n\nAnd when I say \"number one\" or \"top ten\", I don't mean on the R&B charts. I mean number one on the <em>pop</em> charts. They did sometimes deviate from the formula slightly -- and when they did, they didn't have hits that were quite so big. The public knew what it liked, and what it liked was a guitar going dun-dun-dun-dun, then Bill Kenny singing a song in a high voice, then Hoppy Jones saying the same words that Bill Kenny had just sung, in a much lower voice. And the Ink Spots were happy to give that to them.\n\nThat may sound like I'm being dismissive of the Ink Spots' music. I'm not. I absolutely love it. One of the great things about popular music before about 1970 is it had a lot of space for people who could do one thing really really well, and who just did their one thing. Duane Eddy, Bo Diddley, John Lee Hooker, all just kept making basically the same record over and over, and it was a great record, so why not?\n\nThe Ink Spots sold tens of millions of records over the decade or so when they were at their peak -- roughly from 1939, when they started making \"top and bottom\" records, until the late forties. Their manager Moe Gale was also the manager of most of the bands who played the Savoy, and so could put on package tours combining, say, Ella Fitzgerald and the Ink Spots and Lucky Millinder's band, all of whom often played on the same bill together. This also meant that, for example, when Deke Watson took ill with pneumonia in 1943, Trevor Bacon from Millinder's band could fill in for him. Or when the Ink Spots needed a new pianist to back them in 1942, Bill Doggett, who had been in Millinder's band, was easily available.\n\nBut Gale&nbsp; was taking the majority of the money -- Gale took sixty percent while the Ink Spots got the other forty between them, split four ways. But forty percent of multiple millions of 1940s dollars is still a lot of money, and with a lot of money comes the kind of problems you only get when you've got a big pile of money and think you could get a bigger pile of money if you didn't have to share it.\n\nThe Ink Spots' period in the spotlight was eventually brought to an end by personality conflicts, lineup changes, legal squabbles, and deaths. Four years after their career took off, in 1942, Charlie Fuqua was drafted, and that began a whole series of lineup shifts, as replacements were brought in to cover his parts for the three years he was away. But then, two years later, in 1944, everything started falling apart.\n\nDeke Watson and Bill Kenny never got on very well -- Watson thought of himself as the leader, on the grounds that he was the one who'd put the band together, named it, and been the on-stage leader until Kenny came along. Meanwhile Kenny thought of himself as the leader, on account of being the lead singer and arranger. Hoppy Jones was the peacemaker between the two of them -- he'd worked with Watson for years before Kenny came along, but he also had an assured place in the band because of his spoken bits, so he took it on himself to keep the peace.\n\nBut Hoppy Jones was growing ill, and started missing more and more dates because of what turned out to be a series of brain haemmorages. Meanwhile, Moe Gale allegedly gave Bill Kenny a pay rise, but not Watson or Jones. Deke Watson quit the band as a result of this and went off to form his own \"Ink Spots\". Kenny and Hoppy Jones carried on for a month -- but then, tragically, Hoppy Jones collapsed on stage and died.\n\nAfter this, Deke Watson tried to rejoin the band, but Kenny wouldn't let him.\n\nThe result was a complicated four-way legal battle. Deke Watson wanted the right to rejoin the band, or failing that to form his own Ink Spots. Bill Kenny wanted to continue touring with his current Ink Spots lineup, Charlie Fuqua wanted to make sure that once the war was over he was allowed back into the band -- unlike Watson he hadn't quit, but he was worried that with Jones and Watson out, Kenny would see no reason to let him back in. And Moe Gale wanted to be able to continue taking sixty percent of what any of them was making. There was a whole flurry of lawsuits and counter-suits.\n\nIn the end, Bill Kenny more or less won. The courts ruled that no club could book an act called \"the Ink Spots\" which didn't have Bill Kenny in it, but also that Deke Watson and Charlie Fuqua continued to have a financial interest in the band, that Moe Gale was still everyone's manager, and that Charlie Fuqua would be paid a regular salary as an Ink Spot while he was in the army. The only real loser was Deke Watson. He continued to get some money for his share of the Ink Spots name -- although I've seen some claims that Bill Kenny bought him out totally. But he wasn't allowed to tour as the Ink Spots, or to rejoin the band he'd founded.\n\nFuqua came back, and for a few years a new lineup of Bill Kenny and his brother Herb, Fuqua, and Billy Bowen toured and recorded. Deke Watson, meanwhile,&nbsp; had been performing with his own Ink Spots before the lawsuits, but once they were settled, and not in his favour, he said he was going to form a new vocal group based on \"a completely new idea\".\n\nThis completely new idea was to have a vocal group made up of four people, which would start their songs off with a guitar going dun-dun-dun-dun, have a bloke sing the song in a high tenor, then have someone recite the same song lyrics, then finish the song off with the high tenor again. And called \"the Brown Dots\".\n\nThe Brown Dots actually made a record that would itself go on to be hugely influential -- \"I Love You For Sentimental Reasons\", written by two of their members.\n\n[excerpt of \"I Love You For Sentimental Reasons\"]\n\nThat's been covered by almost everyone who ever sang a ballad, from Nat \"King\" Cole to Ella Fitzgerald to Sam Cooke to the Righteous Brothers to Rod Stewart. It looked like Deke Watson had found himself a second great band to be with.&nbsp;But then the other band members realised that it was hard to get on with Deke Watson, and left him to form their own band without him. The Four Tunes, their new name, would have several big hits in the 1950s, without Watson.\n\nMeanwhile, back in the Ink Spots, Charlie Fuqua returned for a while, but in 1952 he and Bill Kenny decided to part ways. The lawsuit from eight years earlier had said that both of them had an equal share in the band name, but had *also* said that only bands with Bill Kenny in could legally be presented as \"the Ink Spots\". Rather than reopen that can of worms, they eventually came to an agreement that Kenny and his band could carry on calling themselves \"The Ink Spots\" and Fuqua would tour as \"Charlie Fuqua's New Ink Spots\".\n\nExcept that Fuqua soon ended up breaking this agreement, and just touring and recording as \"the Ink Spots\" -- he even got Deke Watson back into his band for a while.\n\nThere's one recording of that version of the band -- Jimmy Holmes, Charlie Fuqua, Deek Watson, and Harold Jackson -- live at the Apollo before Watson was kicked out again:\n\n[excerpt of \"Wish You Were Here\"]\n\nAs you can hear, it <em>sort of</em> sounds like the Ink Spots, but not really. Meanwhile Bill Kenny was still making records as the Ink Spots, which still sounded like the old Ink Spots minus Hoppy's bass vocal:\n\n[excerpt of \"I Don't Stand The Ghost of a Chance With You\"]\n\nSo there was one version of \"the Ink Spots\" touring with two original members, and another with no original members, but with the bloke who'd sung lead on all their hits and had the memorable voice that everyone wanted to hear when they heard the Ink Spots.\n\nThat wasn't a situation that was sustainable, so they went to court again -- and most people would have expected the court to make the same ruling it had before, that they owned the band name equally but that Bill Kenny was the only one who could tour as the Ink Spots.\n\nInstead, the ruling was one that no-one had expected, and that no-one wanted.\n\nYou see, it turns out that the Ink Spots weren't a corporation, they were a partnership. And the judge ruled that, when Hoppy Jones had died, ten years earlier, that partnership had been dissolved. Since then, there had been <em>no</em> legitimate group called the Ink Spots, and no-one owned the name. Neither the surviving original members of the band, nor the man whose arrangement ideas and lead vocals had brought the band their success, had any claim over it. Anyone at all could go out and call themselves The Ink Spots and go on tour, and there was nothing anyone could do about it.\n\nAnd they did. Every surviving member of the band -- not just the three surviving members of the classic lineup, but anyone who had filled in in a later version of the band on guitar or what have you -- went out on tour as \"the Ink Spots\". At one point there were up to forty different \"Ink Spots\" groups touring, and many of them were recording too. Usually, at first, these bands would have <em>some</em> claim to authenticity, having at least one person who'd been in a proper version of the Ink Spots -- and indeed a few times in the fifties and sixties Fuqua and Watson would get together again and tour as \"Ink Spots\", in between bouts of suing each other. But more and more they'd just be any group of four black men, so long as you could get one old enough that he might plausibly have been in the band with Bill Kenny at some point.\n\nThe last actual Ink Spots member, Huey Long, who had been one of the temporary replacements for Charlie Fuqua in 1945 for nine months, died aged 106 in 2009. The last Ink Spots gig I've been able to find details for took place in 2013.\n\nBut the Ink Spots' career ending in legal infighting, arguments over credit, and disputes over the band name isn't the only way in which they were a precursor to rock music. Over the next few weeks we'll hear how, along with the jump band sound that was coming to dominate rhythm and blues, a new wave of Ink Spots-inspired vocal groups ended up shaping the new music.\n\nAnd how, in 1953, shortly after the Ink Spots' final split, a young man walked into a recording studio in Memphis that let you make your own single-copy records. He wanted to make a record of himself singing, as a gift for his mother, and he chose one of his favourite songs, \"That's When Your Heartaches Begin\", as one of the two tracks he would record.\n\nBut we'll get to Elvis Presley in a few episodes' time...\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them?</a>",
  "itunes:subtitle": "Welcome to episode six of A History of Rock Music in Five Hundred Songs. Today were looking at the Ink Spots and Thats When Your Heartaches Begin\n\n\n\nResources\n\nAs always, Ive created a Mixcloud streaming playlist with full versions of all the songs in th",
  "itunes:keywords": "coffee-pot groups,Four Mills Brothers,Ink Spots,jive singing,lawsuits,Mo Gale,racism,Savoy Ballroom,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 6,
  "content:encoded": "Welcome to episode six of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at the Ink Spots and \"That's When Your Heartaches Begin\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-6-thats-when-your-heartaches-begin/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. Unfortunately, listeners in the US may not be able to access this one -- Mixcloud doesn't allow USians to listen to streams when they have more than four songs in a row by the same artists, due to copyright restrictions (and it isn't set up to realise that in this case, all the music is in the public domain so those restrictions don't apply). I apologise for that, but it's rather out of my hands.\n\nAll the Ink Spots' music is now in the public domain, so there are a lot of compilations available. <a href=\"https://amzn.to/2QAzQ5U\">This one</a>&nbsp;is dirt cheap, has decent sound quality, and has all the essential hits on it.\n\n<em>More than Words Can Say&nbsp;</em>by Marv Goldberg is the definitive Ink Spots biography, but sadly it came out through an academic publisher and is thus grossly overpriced. You can buy it <a href=\"https://amzn.to/2OBODeY\">here</a>, should you choose. Goldberg's <a href=\"http://www.uncamarvy.com\">website</a> is also an invaluable source of information, not just about the Ink Spots but about forties and fifties vocal groups, and R&B.\n\n<a href=\"http://inkspots.ca/\">Inkspots.ca </a>&nbsp;is a wonderful resource for detail about the band's career.\n\n<em><a href=\"https://amzn.to/2PN1Giv\">Before Elvis</a>,&nbsp;</em>a book I've mentioned many times before, has a reasonable amount about the Ink Spots in it, as well as about almost all the other pre-1954 artists I'm covering here.\n\nA resource I should have mentioned earlier, but one that's useful for all the pre-1952 music, is <a href=\"https://archive.org/details/georgeblood\">archive.org's collection of digitised 78 records</a>. I'm using this a lot.\n\nAnd finally, Deke Watson's autobiography is <a href=\"https://amzn.to/2B1jMFf\">currently only available on the Kindle</a>. It's credited there as by \"Shirlita Bolton\", but that's actually the name of Deke's widow, who owns the rights to the book -- it's definitely Deke's autobiography. It's very short, only seventy-three pages, and it's full of inaccuracies, but it's still the only autobiography any of the real Ink Spots wrote, and it's very cheap.\n\n<strong>Clarification</strong>\n\nAt one point, talking about \"top and bottom\", I say \"they first did it in the studio\". I don't mean, there, that the first time they performed in this style was in the studio, but that this was the first time they tried something in the studio that they'd already done live. The way I say it makes it sound more ambiguous than I intended...\n\n<strong>Transcript</strong>\n\nOK, so we've covered the Carnegie Hall concerts of 1938 and 39 and the performers around them <em>quite</em> exhaustively now -- we had a bit of a diversion into Western Swing, but mostly we've stayed around there.\n\nNow, we're still looking at New York in the late 1930s and early forties, but we're moving away from those shows, and we're going to look at the most popular vocal group of the era, and possibly the most important vocal group of all time.\n\nWe've talked over the last few weeks about almost all the major elements of what we now think of as rock and roll -- the backbeat, the arrangements that focus on a rhythm section, the riffs, the electric guitar and the amplification generally. We've seen, quite clearly, how most of these elements were being pulled together, in different proportions and by different people, in the late 1930s, almost but not quite coalescing into what we now call rock and roll.\n\nThere's one aspect which might be quite easy to overlook, though, which we've not covered yet, and that's the vocal group. Vocal harmonies have become much less prominent in rock music in the last forty years or so, and so today they might not be thought of as an essential element of the genre, but vocal groups played a massive role in the fifties and sixties, and were a huge element of the stew of genres that made up rock and roll when it started.\n\nAnd the vocal group that had the most influence on the groups that became rock and roll was a band whose basis was not as a vocal group, but in coffee pot groups.\n\nCoffee-pot groups were groups of poor black teenagers, who performed on street corners and tried to reproduce the sounds of the lush records they heard on the radio, using... well, using the equipment they had to hand. For string parts, you'd play ukuleles or guitars or banjos, but for the horns you'd play the kazoo. But of course, kazoos were not particularly pleasant instruments, and they certainly didn't sound much like a saxophone or clarinet. But it turned out you could make them sound a lot more impressive than they otherwise would if you blew them into something that resonated. Different sizes of container would resonate differently, and so you could get a pretty fair approximation of a horn section by having a teapot, a small coffee pot, and a large coffee pot, and having three of your band members play kazoos into them. The large coffee pot you could also pass around to the crowd afterward, to collect the money in -- though, as Deek Watson said about his coffee-pot group the Percolating Puppies \"all of us had to keep our eyes on the cat who passed the collection for the evening, or else some of the money found its way from the pot to his pocket before dividing time arrived\".\n\nOther instrumental parts, of course, would be replaced with simple mouth noises. You can make quite an impressive collection of instrumental sounds with just your voice, if you try hard enough.\n\nThe Ink Spots formed out of people who'd started their careers in these groups -- Charlie Fuqua (pron. Foo-kway, and yes I have checked) was in one with Jerry Daniels before they became the imaginatively-named duo \"Charlie and Jerry\", while Deek Watson was in another. Those three, plus Hoppy Jones, performed in a variety of combinations under a variety of names before they settled on calling themselves \"King, Jack, and Jester\" or sometimes \"King, Jack, and Jesters\".\n\nIn the early years of their career, they actually got themselves a radio show on a local station, where they were a fill-in for another band, the Four Mills Brothers. And the Four Mills Brothers were the people who influenced them the most.\n\nThe Mills Brothers had actually started out not so differently from the coffee pot groups -- they entered a talent contest, and John Mills had lost the kazoo he was going to play. He cupped his hands in front of his mouth and imitated a trumpet, and the brothers decided that they were going to start imitating brass instruments with their voices. And they got good at it. Listen to this:\n\n[Mills Brothers: \"It Don't Mean a Thing\"]\n\nThere is no instrument on there other than a single acoustic guitar, believe it or not. They're imitating trumpets, a tuba, and a trombone with their voices, and they'd listen to instrumental musicians and copy their voicings. This is something&nbsp; that a lot of vocal groups have continued to do, but no-one has done it better than the Mills Brothers.\n\nThe Mills Brothers became massively successful, and from 1930 through 1939 they were far and away the biggest black act in the US, making multiple appearances on Bing Crosby's radio show, appearing in films, and touring the world. It was the touring the world that caused their eventual downfall -- they went to play the UK in 1939, and discovered that with World War II imminent, the only ship away from the UK they could get at the end of their tour was one that went to Australia.\n\nBetween that massive transport disruption, and then the further disruption caused by the war itself, it took them two years to get back into the US, by which time their popularity had faded somewhat (although they went on to have a massive hit with \"Paper Moon\" when they got back -- their career was far from over). They carried on having occasional hits into the late sixties, and carried on performing together into the late eighties -- and the last surviving Mills Brother carried on performing until his death in 1999, with one of his sons who carries on the family band to this day.\n\nBut they'd lost their place as the top of the entertainment tree, and they'd lost it to people who'd been imitating them -- to the band we last heard of performing as \"King, Jack, and Jesters\".\n\nBy the mid 1930s, those four men were in New York and performing as the Riff Brothers, but not getting very far. They were doing a mix of Mills Brothers inspired stuff and more jive music, and were earning decent money but not yet massive successes.\n\nIn his autobiography, Deek Watson talks about how the Riff Brothers decided to change their name -- there were too many brother and cousin acts for the Riff Brothers to stand out, and the band eventually ended up in their booking agent's office, arguing for hours over what name they should choose and getting nowhere. Finally, as their agent toyed with a pen, a few drops of ink fell out. I'll read the next bit from Watson's book directly:\n\n\"To me, it seemed like inspiration. 'That's it!' I shouted. 'How about calling us the Ink Spots?'\n\nThe boys really yelled this time. 'There you go again Deek!' Charlie exclaimed. 'That's right!' agreed Hoppy, 'always wanting us to be something colored. Black Dots, Ink Spots, next thing you know he'll be wanting us to call ourselves the Old Black Joes'\n\nThey all talked at once. 'Man, you know ain't nobody wants to be no Ink Spot'.\"\n\nNow, Watson in his book does seem to take credit for absolutely every good idea anyone involved in the band had (and for other things which had nothing to do with them, like writing \"Your Feet's Too Big\", which was written by Fred Fisher and Ada Benson). He also makes up some quite outrageous lies, like that this original lineup of the Ink Spots played at the coronation of King Edward VIII (anyone who knows anything about inter-war British history will know why that is impossible), but this does have the ring of truth about it. When he was in the Percolating Puppies, Watson used to work under the name \"four-dice Rastus\", and many early reviews of the Ink Spots criticised him for eye-rolling, hand-waving, and other minstrelly behaviours, which many black reviewers of the time considered brought black people into disrepute. It's entirely possible that his bandmates would be irritated by his emphasis on their race.\n\nThat said, I'm not going to criticise Watson for this, or repeat some of the insulting names he was called by other black people. Everyone has a different response to the experience of oppression, and I'm not, as a white man, going to sit here and moralise or pontificate about how black people \"should\" have behaved in the 1930s. A lot of much better artists than Deke Watson did a lot more to play along with those stereotypes.\n\nEither way, and whatever they thought about it, Charlie Fuqua, Deke Watson, Jerry Daniels and Hoppy Jones became the Ink Spots, and that was the name under which their group would eventually become even more famous than the Mills Brothers.\n\nBut there was a problem -- Jerry Daniels, their main jive singer, was getting seriously ill from the stress of the band's performing schedule, and eventually ended up hospitalised. He couldn't continue touring with them, and so for a little while the Four Ink Spots were down to three. They had to change, and in changing their lineup, they&nbsp;became the band that would change music.\n\nIn 1936 Bill Kenny, a twenty-one year old high tenor singer, won an amateur night contest at the Savoy Ballroom. Moe Gale, the Ink Spots' manager, was the co-owner of the Savoy, and Charles Buchanan, the club's manager, knew his boss' band wanted a new singer and suggested Kenny.&nbsp;Kenny was, by any standards, an extraordinary singer, and his vocals would become the defining characteristic of the Ink Spots' records from that point on. When you think of the Ink Spots, it's Kenny's voice you think of. Or at least, it's Kenny and Hoppy Jones.\n\nBecause as well as being an utterly astonishing singer, Bill Kenny was an inspired arranger, and he came up with an idea that changed the whole style and sound of the Ink Spots' music, and would later indirectly change all of popular music. The idea he came up with was called \"top and bottom\".\n\n(Note that Deke Watson also claimed credit for this idea in his autobiography, but the story as he tells it there is inconsistent with the known facts, so I'm happy to believe the consensus view that it was Kenny).\n\nUp until Bill Kenny joined the band, the Ink Spots had been a jive band, performing songs in the style of Cab Calloway or Fats Waller -- they were performing uptempo comedy numbers, and they were doing it very well indeed:\n\n[excerpt of the Ink Spots singing \"Your Feet's Too Big\"]\n\nWhen Bill Kenny joined the band, they continued doing the same kind of thing for a while -- still concentrating on uptempo numbers, as you can hear in their 1937 recording of \"Swing High, Swing Low\".\n\n[excerpt of \"Swing High Swing Low\"]\n\nSometimes in those performances Hoppy Jones would speak-sing a line or two in his bass voice, but it was mostly fairly straightforward vocal group singing. They were still basically doing the Mills Brothers sound. And that was fine, because the Mills Brothers were, after all, the most popular black vocal group ever up to that point. But if they were going to be really big, they needed their own sound, and Bill Kenny came up with it.\n\nHe refined the idea of Hoppy's spoken vocals and came up with a hit formula, which they would use over and over again. They first did it in the studio with their massive hit \"If I Didn't Care\", but the one we're going to look at is their 1941 record \"That's When Your Heartaches Begin\". They started doing ballads, usually introduced by an acoustic guitar playing what would become a familiar figure -- this one:\n\n[excerpt of \"That's When Your Heartaches Begin\"]\n\nWe'd then get the whole song sung through by Bill Kenny, with the others singing backing vocals:\n\n[excerpt of him singing]\n\nThen Kenny would join in with the backing vocals, as Hoppy Jones repeated the whole song, speak-singing it in his deep bass voice\n\n[excerpt of that]\n\nAnd finally there'd be a final line with Kenny singing lead again.\n\nWhen I say this was a formula, I mean it <em>really</em> was a formula. They'd found a sound and they were going to absolutely stick with it. To give you an example of what I mean, here's the intro to \"We Three (My Echo, My Shadow, and Me)\"\n\n[intro to that song]\n\nNow here's the intro to \"I Don't Want to Set the World on Fire\"\n\n[intro to that song]\n\nAnd here's the intro to \"To Each His Own\"\n\n[intro to that song]\n\nAnd to \"Whispering Grass\"\n\n[intro to that song]\n\nI could go on... if you don't believe that those are different songs, incidentally, check out the Mixcloud with the full versions of all these songs on.\n\nThis was such a well-known formula for them that the Glenn Miller band did a dead-on parody of it:\n\n[excerpt: \"Juke Box Saturday Night\"]\n\nBut the thing is -- all those songs I just played the intros of, they all went top ten, and two of them went to number one. This was a formula that absolutely, undoubtedly, worked.\n\nAnd when I say \"number one\" or \"top ten\", I don't mean on the R&B charts. I mean number one on the <em>pop</em> charts. They did sometimes deviate from the formula slightly -- and when they did, they didn't have hits that were quite so big. The public knew what it liked, and what it liked was a guitar going dun-dun-dun-dun, then Bill Kenny singing a song in a high voice, then Hoppy Jones saying the same words that Bill Kenny had just sung, in a much lower voice. And the Ink Spots were happy to give that to them.\n\nThat may sound like I'm being dismissive of the Ink Spots' music. I'm not. I absolutely love it. One of the great things about popular music before about 1970 is it had a lot of space for people who could do one thing really really well, and who just did their one thing. Duane Eddy, Bo Diddley, John Lee Hooker, all just kept making basically the same record over and over, and it was a great record, so why not?\n\nThe Ink Spots sold tens of millions of records over the decade or so when they were at their peak -- roughly from 1939, when they started making \"top and bottom\" records, until the late forties. Their manager Moe Gale was also the manager of most of the bands who played the Savoy, and so could put on package tours combining, say, Ella Fitzgerald and the Ink Spots and Lucky Millinder's band, all of whom often played on the same bill together. This also meant that, for example, when Deke Watson took ill with pneumonia in 1943, Trevor Bacon from Millinder's band could fill in for him. Or when the Ink Spots needed a new pianist to back them in 1942, Bill Doggett, who had been in Millinder's band, was easily available.\n\nBut Gale&nbsp; was taking the majority of the money -- Gale took sixty percent while the Ink Spots got the other forty between them, split four ways. But forty percent of multiple millions of 1940s dollars is still a lot of money, and with a lot of money comes the kind of problems you only get when you've got a big pile of money and think you could get a bigger pile of money if you didn't have to share it.\n\nThe Ink Spots' period in the spotlight was eventually brought to an end by personality conflicts, lineup changes, legal squabbles, and deaths. Four years after their career took off, in 1942, Charlie Fuqua was drafted, and that began a whole series of lineup shifts, as replacements were brought in to cover his parts for the three years he was away. But then, two years later, in 1944, everything started falling apart.\n\nDeke Watson and Bill Kenny never got on very well -- Watson thought of himself as the leader, on the grounds that he was the one who'd put the band together, named it, and been the on-stage leader until Kenny came along. Meanwhile Kenny thought of himself as the leader, on account of being the lead singer and arranger. Hoppy Jones was the peacemaker between the two of them -- he'd worked with Watson for years before Kenny came along, but he also had an assured place in the band because of his spoken bits, so he took it on himself to keep the peace.\n\nBut Hoppy Jones was growing ill, and started missing more and more dates because of what turned out to be a series of brain haemmorages. Meanwhile, Moe Gale allegedly gave Bill Kenny a pay rise, but not Watson or Jones. Deke Watson quit the band as a result of this and went off to form his own \"Ink Spots\". Kenny and Hoppy Jones carried on for a month -- but then, tragically, Hoppy Jones collapsed on stage and died.\n\nAfter this, Deke Watson tried to rejoin the band, but Kenny wouldn't let him.\n\nThe result was a complicated four-way legal battle. Deke Watson wanted the right to rejoin the band, or failing that to form his own Ink Spots. Bill Kenny wanted to continue touring with his current Ink Spots lineup, Charlie Fuqua wanted to make sure that once the war was over he was allowed back into the band -- unlike Watson he hadn't quit, but he was worried that with Jones and Watson out, Kenny would see no reason to let him back in. And Moe Gale wanted to be able to continue taking sixty percent of what any of them was making. There was a whole flurry of lawsuits and counter-suits.\n\nIn the end, Bill Kenny more or less won. The courts ruled that no club could book an act called \"the Ink Spots\" which didn't have Bill Kenny in it, but also that Deke Watson and Charlie Fuqua continued to have a financial interest in the band, that Moe Gale was still everyone's manager, and that Charlie Fuqua would be paid a regular salary as an Ink Spot while he was in the army. The only real loser was Deke Watson. He continued to get some money for his share of the Ink Spots name -- although I've seen some claims that Bill Kenny bought him out totally. But he wasn't allowed to tour as the Ink Spots, or to rejoin the band he'd founded.\n\nFuqua came back, and for a few years a new lineup of Bill Kenny and his brother Herb, Fuqua, and Billy Bowen toured and recorded. Deke Watson, meanwhile,&nbsp; had been performing with his own Ink Spots before the lawsuits, but once they were settled, and not in his favour, he said he was going to form a new vocal group based on \"a completely new idea\".\n\nThis completely new idea was to have a vocal group made up of four people, which would start their songs off with a guitar going dun-dun-dun-dun, have a bloke sing the song in a high tenor, then have someone recite the same song lyrics, then finish the song off with the high tenor again. And called \"the Brown Dots\".\n\nThe Brown Dots actually made a record that would itself go on to be hugely influential -- \"I Love You For Sentimental Reasons\", written by two of their members.\n\n[excerpt of \"I Love You For Sentimental Reasons\"]\n\nThat's been covered by almost everyone who ever sang a ballad, from Nat \"King\" Cole to Ella Fitzgerald to Sam Cooke to the Righteous Brothers to Rod Stewart. It looked like Deke Watson had found himself a second great band to be with.&nbsp;But then the other band members realised that it was hard to get on with Deke Watson, and left him to form their own band without him. The Four Tunes, their new name, would have several big hits in the 1950s, without Watson.\n\nMeanwhile, back in the Ink Spots, Charlie Fuqua returned for a while, but in 1952 he and Bill Kenny decided to part ways. The lawsuit from eight years earlier had said that both of them had an equal share in the band name, but had *also* said that only bands with Bill Kenny in could legally be presented as \"the Ink Spots\". Rather than reopen that can of worms, they eventually came to an agreement that Kenny and his band could carry on calling themselves \"The Ink Spots\" and Fuqua would tour as \"Charlie Fuqua's New Ink Spots\".\n\nExcept that Fuqua soon ended up breaking this agreement, and just touring and recording as \"the Ink Spots\" -- he even got Deke Watson back into his band for a while.\n\nThere's one recording of that version of the band -- Jimmy Holmes, Charlie Fuqua, Deek Watson, and Harold Jackson -- live at the Apollo before Watson was kicked out again:\n\n[excerpt of \"Wish You Were Here\"]\n\nAs you can hear, it <em>sort of</em> sounds like the Ink Spots, but not really. Meanwhile Bill Kenny was still making records as the Ink Spots, which still sounded like the old Ink Spots minus Hoppy's bass vocal:\n\n[excerpt of \"I Don't Stand The Ghost of a Chance With You\"]\n\nSo there was one version of \"the Ink Spots\" touring with two original members, and another with no original members, but with the bloke who'd sung lead on all their hits and had the memorable voice that everyone wanted to hear when they heard the Ink Spots.\n\nThat wasn't a situation that was sustainable, so they went to court again -- and most people would have expected the court to make the same ruling it had before, that they owned the band name equally but that Bill Kenny was the only one who could tour as the Ink Spots.\n\nInstead, the ruling was one that no-one had expected, and that no-one wanted.\n\nYou see, it turns out that the Ink Spots weren't a corporation, they were a partnership. And the judge ruled that, when Hoppy Jones had died, ten years earlier, that partnership had been dissolved. Since then, there had been <em>no</em> legitimate group called the Ink Spots, and no-one owned the name. Neither the surviving original members of the band, nor the man whose arrangement ideas and lead vocals had brought the band their success, had any claim over it. Anyone at all could go out and call themselves The Ink Spots and go on tour, and there was nothing anyone could do about it.\n\nAnd they did. Every surviving member of the band -- not just the three surviving members of the classic lineup, but anyone who had filled in in a later version of the band on guitar or what have you -- went out on tour as \"the Ink Spots\". At one point there were up to forty different \"Ink Spots\" groups touring, and many of them were recording too. Usually, at first, these bands would have <em>some</em> claim to authenticity, having at least one person who'd been in a proper version of the Ink Spots -- and indeed a few times in the fifties and sixties Fuqua and Watson would get together again and tour as \"Ink Spots\", in between bouts of suing each other. But more and more they'd just be any group of four black men, so long as you could get one old enough that he might plausibly have been in the band with Bill Kenny at some point.\n\nThe last actual Ink Spots member, Huey Long, who had been one of the temporary replacements for Charlie Fuqua in 1945 for nine months, died aged 106 in 2009. The last Ink Spots gig I've been able to find details for took place in 2013.\n\nBut the Ink Spots' career ending in legal infighting, arguments over credit, and disputes over the band name isn't the only way in which they were a precursor to rock music. Over the next few weeks we'll hear how, along with the jump band sound that was coming to dominate rhythm and blues, a new wave of Ink Spots-inspired vocal groups ended up shaping the new music.\n\nAnd how, in 1953, shortly after the Ink Spots' final split, a young man walked into a recording studio in Memphis that let you make your own single-copy records. He wanted to make a record of himself singing, as a gift for his mother, and he chose one of his favourite songs, \"That's When Your Heartaches Begin\", as one of the two tracks he would record.\n\nBut we'll get to Elvis Presley in a few episodes' time...\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it, <a href=\"http://patreon.com/andrewhickey\">why not join them?</a>",
  "enclosure": "",
  "itunes:summary": "Welcome to episode six of A History of Rock Music in Five Hundred Songs. Today we're looking at the Ink Spots and \"That's When Your Heartaches Begin\"\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. Unfortunately, listeners in the US may not be able to access this one -- Mixcloud doesn't allow USians to listen to streams when they have more than four songs in a row by the same artists, due to copyright restrictions (and it isn't set up to realise that in this case, all the music is in the public domain so those restrictions don't apply). I apologise for that, but it's rather out of my hands.\n\nAll the Ink Spots' music is now in the public domain, so there are a lot of compilations available. This one&nbsp;is dirt cheap, has decent sound quality, and has all the essential hits on it.\n\nMore than Words Can Say&nbsp;by Marv Goldberg is the definitive Ink Spots biography, but sadly it came out through an academic publisher and is thus grossly overpriced. You can buy it here, should you choose. Goldberg's website is also an invaluable source of information, not just about the Ink Spots but about forties and fifties vocal groups, and R&B.\n\nInkspots.ca &nbsp;is a wonderful resource for detail about the band's career.\n\nBefore Elvis,&nbsp;a book I've mentioned many times before, has a reasonable amount about the Ink Spots in it, as well as about almost all the other pre-1954 artists I'm covering here.\n\nA resource I should have mentioned earlier, but one that's useful for all the pre-1952 music, is archive.org's collection of digitised 78 records. I'm using this a lot.\n\nAnd finally, Deke Watson's autobiography is currently only available on the Kindle. It's credited there as by \"Shirlita Bolton\", but that's actually the name of Deke's widow, who owns the rights to the book -- it's definitely Deke's autobiography. It's very short, only seventy-three pages, and it's full of inaccuracies, but it's still the only autobiography any of the real Ink Spots wrote, and it's very cheap.\n\nClarification\n\nAt one point, talking about \"top and bottom\", I say \"they first did it in the studio\". I don't mean, there, that the first time they performed in this style was in the studio, but that this was the first time they tried something in the studio that they'd already done live. The way I say it makes it sound more ambiguous than I intended...\n\nTranscript\n\nOK, so we've covered the Carnegie Hall concerts of 1938 and 39 and the performers around them quite exhaustively now -- we had a bit of a diversion into Western Swing, but mostly we've stayed around there.\n\nNow, we're still looking at New York in the late 1930s and early forties, but we're moving away from those shows, and we're going to look at the most popular vocal group of the era, and possibly the most important vocal group of all time.\n\nWe've talked over the last few weeks about almost all the major elements of what we now think of as rock and roll -- the backbeat, the arrangements that focus on a rhythm section, the riffs, the electric guitar and the amplification generally. We've seen, quite clearly, how most of these elements were being pulled together, in different proportions and by different people, in the late 1930s, almost but not quite coalescing into what we now call rock and roll.\n\nThere's one aspect which might be quite easy to overlook, though, which we've not covered yet, and that's the vocal group. Vocal harmonies have become much less prominent in rock music in the last forty years or so, and so today they might not be thought of as an essential element of the genre, but vocal groups played a massive role in the fifties and sixties, and were a huge element of the stew of genres that made up rock and roll when it started.\n\nAnd the vocal group that had the most influence on the groups that became rock and roll was a band whose basis was not as a vocal group, but in coffee pot groups.\n\nCoffee-pot groups were gr",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode six of A History of Rock Music in Five Hundred Songs. Today we're looking at the Ink Spots and \"That's When Your Heartaches Begin\"\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. Unfortunately, listeners in the US may not be able to access this one -- Mixcloud doesn't allow USians to listen to streams when they have more than four songs in a row by the same artists, due to copyright restrictions (and it isn't set up to realise that in this case, all the music is in the public domain so those restrictions don't apply). I apologise for that, but it's rather out of my hands.\n\nAll the Ink Spots' music is now in the public domain, so there are a lot of compilations available. This one&nbsp;is dirt cheap, has decent sound quality, and has all the essential hits on it.\n\nMore than Words Can Say&nbsp;by Marv Goldberg is the definitive Ink Spots biography, but sadly it came out through an academic publish",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}