{
  "title": "Newton&#8217;s Third Law of Reputations",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/19/newtons-third-law-of-reputations/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/19/newtons-third-law-of-reputations/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Wed, 19 Oct 2022 13:39:52 +0000",
  "category": [
    "Economics",
    "Political Science",
    "Sociology"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47603",
  "description": "This news article by Tiffany Hsu explains how the big bucks earned by Matt Damon, Larry David, LeBron James, etc., from Crypto.com, etc., did not come for free. These celebs are now paying in terms of their reputation. That&#8217;s all &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/19/newtons-third-law-of-reputations/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>This <a href=\"https://www.nytimes.com/2022/05/17/business/media/crypto-gwyneth-paltrow-matt-damon-reese-witherspoon.html\">news article</a> by Tiffany Hsu explains how the big bucks earned by Matt Damon, Larry David, LeBron James, etc., from Crypto.com, etc., did not come for free.  These celebs are now paying in terms of their reputation.</p>\n<p>That&#8217;s all fine. After all, what&#8217;s the point of reputation if you can&#8217;t convert it to something else&#8212;in this case, more money for people who are already unimaginably rich&#8212;actually, my guess is that the reason these celebs were endorsing crypto is not so much for the money but because they felt they were getting in on the ground floor of the next big thing, i.e. they were more conned-upon than conning, although conned-upon in a very mild way as I guess they made some $$$ from it all&#8212;, and a positive social benefit to these stars being considered clueless at best and fraudsters at worst is that maybe for awhile we&#8217;ll be spared the advice of Matt Demon, Larry David, LeBron James, etc., on politics, culture, health, etc.  So good news all around:  these stars made money, and we&#8217;ll be less subject to their influence.</p>\n<p>The episode reminded me of what&#8217;s been happening with the medical journal Lancet over the years:  they keep lending their reputation to fraudulent or politically-slanted research, and now it&#8217;s reached the point where when we see that something&#8217;s published in Lancet, we get a little bit suspicious.  Not completely so, as they publish lots of good stuff too, but a little bit.</p>\n<p>Or Dr. Oz, who cashed in on the reputation of the medical establishment (and Columbia University!) to get money and fame.  When it turns sour, that reduces the future value of the &#8220;Dr.&#8221; label and the Ivy League connection.  On the other hand, if he gets elected to the Senate, then maybe the presidency, then eventually is elected king of the world, then maybe they&#8217;ll change the rules on who gets to be called Dr.:  maybe it will be an absolut requirement that if you want the &#8220;doctor&#8221; label you have to endorse at least two fraudulent cures.</p>\n<p>Or the Wall Street Journal, which published <a href=\"https://statmodeling.stat.columbia.edu/2022/07/17/what-happens-to-the-wall-street-journals-reputation-when-they-publish-a-regular-column-by-someone-associated-with-fraudulent-research/\">a regular column</a> by someone associated with fraudulent research?</p>\n<p>Reputation is a <a href=\"https://statmodeling.stat.columbia.edu/2016/01/05/pace-study-and-the-lancet-journal-reputation-is-a-two-way-street/\">two-way street</a>.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/19/newtons-third-law-of-reputations/feed/",
  "slash:comments": 13
}