{
  "guid": "urn:uuid:93f45fc4-0052-4a31-a41a-61ae590568c4",
  "link": "https://www.who.int/news/item/17-10-2022-one-health-joint-plan-of-action-launched-to-address-health-threats-to-humans--animals--plants-and-environment",
  "a10:author": {
    "a10:name": ""
  },
  "title": "One Health Joint Plan of Action launched to address health threats to humans, animals, plants and environment",
  "description": "<p>Today, a new One Health Joint Plan of Action was launched by the Quadripartite &ndash; the Food and Agriculture Organization of the United Nations (FAO), the United Nations Environment Programme (UNEP), the World Health Organization (WHO), and the World Organisation for Animal Health (WOAH, founded as OIE). </p><p>This first joint plan on One Health aims to create a framework to integrate systems and capacity so that we can collectively better prevent, predict, detect, and respond to health threats. Ultimately, this initiative seeks to improve the health of humans, animals, plants, and the environment, while contributing to sustainable development. </p><p>The One Health Joint Plan of Action, developed through a participatory process, provides a set of activities that aim to strengthen collaboration, communication, capacity building, and coordination equally across all sectors responsible for addressing health concerns at the human-animal-plant-environment interface. <br /></p> <p><strong>The</strong> <strong>One Health Joint Plan of Action (OH JPA) </strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong></strong></p><p>The five-year plan (2022-2026) focuses on supporting and expanding capacities in six areas: One Health capacities for health systems, emerging and re-emerging zoonotic epidemics, endemic zoonotic, neglected tropical and vector-borne diseases, food safety risks, antimicrobial resistance and the environment.&nbsp;</p><p>This technical document is informed by evidence, best practices, and existing guidance. It covers a set of actions which endeavour to advance One Health at global, regional and national levels. These actions notably include the development of an upcoming implementation guidance for countries, international partners, and non-State actors such as civil society organizations, professional associations, academia and research institutions. </p><p>The plan sets out operational objectives, which include: providing a framework for collective and coordinated action to mainstream the One Health approach at all levels; providing upstream policy and legislative advice and technical assistance to help set national targets and priorities; and promoting multinational, multi-sector, multidisciplinary collaboration, learning and exchange of knowledge, solutions and technologies. It also fosters the values of cooperation and shared responsibility, multisectoral action and partnership, gender equity, and inclusiveness.<br /></p> <p><strong>Why One Health?</strong><br /></p> <p>One Health is the main approach for addressing the complex health challenges facing our society, such as ecosystem degradation, food system failures, infectious diseases and antimicrobial resistance. <br /></p> <p>&ldquo;Using a One Health lens that brings all relevant sectors together is critical to tackle global health threats, like monkeypox, COVID-19 and Ebola.&rdquo; WOAH Director General Dr Monique Eloit&nbsp;highlights the need for enhanced disease prevention capacity in all sectors. &ldquo;It all starts with ensuring the health of animals. Animal health is our health, it is everyone&rsquo;s health.&rdquo;<br /></p>  <p>FAO Director-General QU Dongyu&nbsp;adds, &ldquo;<w:sdt sdttag=\"goog_rdk_0\" id=\"-1244338695\">One Health should start from proper land management and  stopping deforestation, which will help people and their animals in the  surrounding environment. We need all sectors working closely together to  identify and implement adaptation and mitigation measures.&rdquo;</w:sdt><w:sdt showingplchdr=\"t\" sdttag=\"goog_rdk_1\" id=\"-100491397\">&nbsp;&nbsp;&nbsp;&nbsp; </w:sdt><br /></p> <p>UNEP Executive&nbsp;Director Inger Andersen says that &ldquo;Everyone has the right to a clean and healthy environment - the foundation of all life on Earth. The current pandemic unequivocally demonstrates that the degradation of nature is driving up health risks across the board.&rdquo; Efforts by just one sector or specialty cannot prevent or eliminate infectious disease and other complex threats to One Health. She continued: &ldquo;Vulnerable populations of all species, including the most poor and marginalized humans, bear the heaviest costs. The Joint Plan of Action will drive down health risks through an integrated approach to human, animal and environment health.&rdquo;<br /></p> <p>&nbsp;&ldquo;It&rsquo;s clear that a One Health approach must be central to our shared work to strengthen the world&rsquo;s defences against epidemics and pandemics such as COVID-19. That&rsquo;s why One Health is one of the guiding principles of the new international agreement for pandemic prevention, preparedness and response, which our Member States are now negotiating.&rdquo; WHO Director-General Dr Tedros Adhanom Ghebreyesus said. </p><p>Building on existing structures and agreements, mechanisms for coordinated financing are under development to support the plan&rsquo;s implementation. The Quadripartite will join forces to leverage the needed resources in support of the common approach to address critical health threats and promote the health of people, animals, plants and the environment.</p>",
  "pubDate": "Fri, 14 Oct 2022 16:15:46 Z"
}