{
  "title": "EPISODE 54 Sitting Bull (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Wed, 02 Oct 2019 21:10:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/10/2/episode-54-sitting-bull-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5d9510750aa8ae7635d44e78",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1570050547662-G1CUP6MT4PYY5MXTDC9W/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5d9511f0a355511033840e44\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1570050547662-G1CUP6MT4PYY5MXTDC9W/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Sitting Bull, leader of the largest Indian nation on the continent, the strongest, boldest, most stubborn opponent of European influence, was the very heart and soul of the Frontier. When the true history of the New World is written, he will receive his chapter. For Sitting Bull was one of the Makers of America.”</em> — Stanley Vestal&nbsp;</p><p class=\"\"><em>“If you intend to do this for my sake, take good care of them and let them live. My father is a man and death is his.”</em> — Sitting Bull addressing his fellow tribesmen who wanted to kill some captives</p><p class=\"\"><em>“I told them I did not want their annuities, nor could I sell my country. My father lived and died here; so would I. And if our white brothers would do right, we would never have had war.” —</em> Sitting Bull&nbsp;</p><p class=\"\"><em>“At no other time or place in the history of the Indian Wars, before or after, would the U.S. Army voluntarily destroy a major defensive line in order to appease an enemy.”</em> — Bill Yenne&nbsp;</p><p class=\"\">In historical terms, it was just a blink of an eye ago. In the mid-1800s, the Great Plains in the United States were still firmly in the hands of nomadic, buffalo hunting tribes. The looming threat of American expansion was still barely noticeable. But things changed quickly, and soon the tribes were locked in an existential struggle with the U.S. for control of the heartland of North America. One man rose among these tribes to lead his people to resisting the inevitable for over two decades. By the time he was 10 years old, the boy who would become the Lakota leader Sitting Bull, had killed his first bison by running him down and putting an arrow through its heart. In the opinion of his fellow tribesmen, his ability as a hunter and as a warrior was only second to his generosity in taking care of widows and orphans. In this first episode of this series, we’ll see Sitting Bull dueling man-to-man against a Crow chief, adopting a boy from an enemy tribe, avenging his father (Conan The Barbarian-style), having visions, acquiring shamanic powers, dealing with marriages and grief, leading the first round of warfare against the U.S., and much, much more.&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 54 Sitting Bull (Part 1)"
  }
}