{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-6380038612833618596",
  "published": "2020-10-16T08:00:00.001+11:00",
  "updated": "2020-10-16T08:00:05.618+11:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Google Play Points: a rewards program for the ways you Play",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"266\" src=\"https://www.youtube.com/embed/KBhixjDM00M\" width=\"320\" youtube-src-id=\"KBhixjDM00M\"></iframe></div><br /><div>Since 2012, Google Play has been your place to find and enjoy apps, games, movies, TV shows, and books. More than 2 billion people in 190 countries use Google Play to discover blockbuster movies, apps that help you be more productive, and books that inspire imagination.&nbsp;</div><div>To show our appreciation, we created a new rewards program called Google Play Points that lets you earn points and rewards for the ways you already use Google Play. Over the two years, millions of people in Japan, South Korea, the US, Taiwan, and Hong Kong have joined the program. Starting this week, Google Play Points is launching in Australia, as well as UK, France and Germany.&nbsp;</div><div><br /></div><div>It’s free to join, and you can earn Play Points to use for special items and discounts in top games like Candy Crush Saga and Pokémon GO, or for Google Play Credit to use on movies, books, games, and apps.&nbsp;</div><div><br /></div><div><br /></div><div><b>Play your way and earn points&nbsp;</b></div><div>With Google Play Points, you’ll earn points on everything you buy with Google Play, including in-app items, movies, books, subscriptions and more. You can also earn Play Points by downloading featured free apps and games. Weekly points events can boost your earning rate on movies, books, and select games.&nbsp;  </div><div><br /></div><div>Google Play Points has four levels, from Bronze to Platinum. Your level depends on how many points you’ve collected, and higher levels have perks like weekly prizes.&nbsp;</div><div><br /></div><div><br /></div><div><b>Redeem your Play Points how you’d like</b>&nbsp;</div><div>We’re partnering with developers of some of the top apps and games on Google Play so that you can redeem points for special in-app items like characters, gems and more. You can also use Play Points for Google Play Credit and rent an award-winning movie or buy a best-selling audiobook.&nbsp;</div><div><br /></div><div><br /></div><div><b>Join for free&nbsp;</b></div><div>Google Play Points will be available over the next week. It’s free to join, there is no recurring or monthly fee, and you’ll earn three times the Play Points on everything you buy your first week. To get started, visit Google Play. Tap menu, then Play Points. <a href=\"https://play.google.com/about/playpoints/\">Learn more</a> about Play Points--and get ready to earn points and rewards.&nbsp;</div><div><br /></div><div><span class=\"byline-author\">Posted by Winston Mok, Product Manager, Google Play</span> <span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}