{
  "title": "Making the web better. With blocks!",
  "link": "https://www.joelonsoftware.com/2022/01/27/making-the-web-better-with-blocks/",
  "dc:creator": "Joel Spolsky",
  "pubDate": "Thu, 27 Jan 2022 17:14:00 +0000",
  "category": "News",
  "guid": "https://www.joelonsoftware.com/?p=3906",
  "description": "You&#8217;ve probably seen web editors based on the idea of blocks. I&#8217;m typing this in WordPress, which has a little + button that brings up a long&#8230; <span class=\"read-more\"><a class=\"more-link\" href=\"https://www.joelonsoftware.com/2022/01/27/making-the-web-better-with-blocks/\" rel=\"bookmark\">Read more <span class=\"screen-reader-text\">\"Making the web better. With blocks!\"</span></a></span>",
  "content:encoded": "\n<p>You&#8217;ve probably seen web editors based on the idea of <em>blocks</em>. I&#8217;m typing this in WordPress, which has a little + button that brings up a long list of potential blocks that you can insert into this page:</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img decoding=\"async\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/01/wordpressblocks.png?resize=260%2C573&#038;ssl=1\" alt=\"\" class=\"wp-image-3908\" width=\"260\" height=\"573\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/01/wordpressblocks.png?resize=465%2C1024&ssl=1 465w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/01/wordpressblocks.png?resize=136%2C300&ssl=1 136w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/01/wordpressblocks.png?w=676&ssl=1 676w\" sizes=\"(max-width: 260px) 100vw, 260px\" data-recalc-dims=\"1\" /></figure>\n\n\n\n<p>This kind of &#8220;insert block&#8221; user interface concept is showing up in almost every blogging tool, web editor, note-taking app, and content management system. People like it and it makes sense. </p>\n\n\n\n<p>We have seem to have standardized on one thing: the <strong>/</strong> key to insert a new block. Everything else, though, is completely proprietary and non-standard. </p>\n\n\n\n<p>I thought, wouldn&#8217;t it be cool if blocks were interchangeable and reusable across the web?</p>\n\n\n\n<p>Until now, every app that wants blocks has to implement them from scratch. Want a calendar block? Some kind of fancy Kanban board? Something to embed image galleries? Code it up yourself, buddy.</p>\n\n\n\n<p>As a result of the non-standardization of blocks, our end-users suffer. If someone is using my blog engine, they can only use those blocks that I had time to implement. Those blocks may be pretty basic or incomplete. Users might want to use a fancier block that they saw in WordPress or Medium or Notion, but my editor doesn&#8217;t have it. Blocks can&#8217;t be shared or moved around very easily, and our users are limited to the features and capabilities that we had time to re-implement.</p>\n\n\n\n<p>To fix this, we&#8217;re going to create a protocol called the <a href=\"https://blockprotocol.org\">Block Protocol</a>. </p>\n\n\n\n<p>It&#8217;s open, free, non-proprietary, we want it to be everywhere on the web. </p>\n\n\n\n<p>It&#8217;s just a protocol that embedding applications can use to embed blocks. Any block can be used in any embedding application if they all follow the protocol.</p>\n\n\n\n<p>Our hope is that this will make life much easier for app developers to support a huge variety of block types. At the same time, anyone can develop a block once and have it work in any blog platform, note-taking app, or content management system. It is all 100% free, open, and any sample code we develop showing how to use the protocol will be open-source.</p>\n\n\n\n<p>We&#8217;ve released a very early draft of the Block Protocol, and we&#8217;ve started building some very simple blocks and a simple editor that can host them.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-style-default\"><img decoding=\"async\" loading=\"lazy\" width=\"730\" height=\"485\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_1-v2.png?resize=730%2C485&#038;ssl=1\" alt=\"\" class=\"wp-image-3923\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_1-v2.png?resize=1024%2C680&ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_1-v2.png?resize=300%2C199&ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_1-v2.png?resize=768%2C510&ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_1-v2.png?w=1200&ssl=1 1200w\" sizes=\"(max-width: 730px) 100vw, 730px\" data-recalc-dims=\"1\" /></figure>\n\n\n\n<p>We&#8217;re hoping to foster an open source community that creates a huge open source library of amazing blocks:</p>\n\n\n\n<figure class=\"wp-block-image size-large is-style-default\"><img decoding=\"async\" loading=\"lazy\" width=\"730\" height=\"333\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_2-v2.png?resize=730%2C333&#038;ssl=1\" alt=\"\" class=\"wp-image-3924\" srcset=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_2-v2.png?resize=1024%2C467&ssl=1 1024w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_2-v2.png?resize=300%2C137&ssl=1 300w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_2-v2.png?resize=768%2C350&ssl=1 768w, https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2022/02/bp_illustration_2-v2.png?w=1200&ssl=1 1200w\" sizes=\"(max-width: 730px) 100vw, 730px\" data-recalc-dims=\"1\" /></figure>\n\n\n\n<p>What can be a block? </p>\n\n\n\n<ul><li>Anything that makes sense in a document: a paragraph, list, table, diagram, or a kanban board. </li><li>Anything that makes sense on the web: an order form, a calendar, a video.</li><li>Anything that lets you interact with structured or typed data: I&#8217;ll get to that in a minute.</li></ul>\n\n\n\n<p>If you work on any kind of editor—be it a blogging tool, a note-taking app, a content management system, or anything like that—you should allow your users to embed blocks that conform to the Block Protocol. This way you can write the embedding code once and immediately make your editor able to embed a rich variety of block types with no extra work on your part.</p>\n\n\n\n<p>If you work on any kind of custom data type that might make sense to embed in web pages, you should support the Block Protocol. That way anybody with a hosting application that supports the protocol can embed your custom data type.</p>\n\n\n\n<p>Because it&#8217;s all 100% open, we hope that the Block Protocol will become a web standard and commonly used across the Internet.</p>\n\n\n\n<p>That will mean that common block types, from paragraphs and lists to images and videos, will get better and better. But it will also mean that some esoteric block types will be embeddable anywhere. Want to create a block that shows the Great Circle routing for a flight between two airports? Write the code for the block once and it can be embedded anywhere. </p>\n\n\n\n<p>Oh, and <strong>one more thing</strong>. Blocks can be highly structured, that is, they can have types. That means that they magically become machine-readable without screen scraping. For example, if you want to create an event block to represent an event on a calendar, you will be able to specify a <em>schema</em> that describes the event data type in a standard way. That way tools like calendars can instantly parse and understand web pages that contain your event block, reliably.</p>\n\n\n\n<p>Over time, it will mean that anyone can easy publish complex, typed data sets on the web that are automatically machine-readable without extra work. (Have you ever seen one of those websites where there&#8217;s a link to &#8220;download the data set in .XLS format&#8221;? Yeah, say goodbye to that.)</p>\n\n\n\n<p><strong>We&#8217;re going public with this very early in the development process</strong> because we need a lot of help! </p>\n\n\n\n<p>Everything we have so far is version 0.1. It&#8217;s simple and not very good yet and going to need some iteration before it has the hope of truly being a useful web protocol. </p>\n\n\n\n<p>This is an open protocol, free and non-proprietary, and it&#8217;s going to make the open web much better if widely adopted, so we need to start getting people involved early, giving us feedback, and building new things!</p>\n\n\n\n<p><a href=\"https://blockprotocol.org\">Go read more about the Block Protocol now!</a></p>\n",
  "post-id": 3906
}