{
  "title": "581: What if Petunia Had Been Accepted to Hogwarts? And More MuggleMail",
  "link": "https://audioboom.com/posts/8168115",
  "itunes:episode": 581,
  "itunes:title": "What if Petunia Had Been Accepted to Hogwarts? And More MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4281,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we're busting open our MuggleMail bag as listeners send in owls about the first several chapters of Sorcerer's Stone! We entertain a few What Ifs about Petunia and Dudley and get some enlightening perspectives on Narcissa and Lupin!<br>\n<br>\n\n</div>\n<ul>\n<li>Hey, Apple Podcast users! You can now subscribe to the show right within the Apple Podcasts app. For $2.99/month, you'll receive early episode releases and ad-free MuggleCast! Thanks in advance for your support.</li>\n<li>We're opening up our Chapter-by-Chapter MuggleMail bag!</li>\n<li>Why was Hagrid sent for Harry?</li>\n<li>How big is the student body at Hogwarts?</li>\n<li>What happened to both sets of Harry's grandparents?</li>\n<li>How did Dudley's pigtail finally get removed?</li>\n<li>Did Harry's Horcrux impact the Dursley's treatment of him?</li>\n<li>What if... Petunia had magical ability and had been accepted at Hogwarts?</li>\n<li>What if... Dudley was a wizard? Would Vernon have disowned him?</li>\n<li>Could House-Elves be responsible for sending the Hogwarts letters?</li>\n<li>Other MuggleMail covers Leta Lestrange, The Elder Wand, Narcissa Malfoy and Remus Lupin</li>\n<li>Should Dumbledore have been sorted into Slytherin?</li>\n<li>Why wasn't Dobby asked to be in The Order?</li>\n<li>Quizzitch: In one of their very first History of Magic classes, which two famous wizards do the students in Harry's class get mixed up?</li>\n<li>On next week's episode: Chapters 9 & 10 of Sorcerer’s Stone: The Midnight Duel and Halloween</li>\n<li>In this week’s Bonus MuggleCast available <a href=\"https://www.patreon.com/mugglecast/\">exclusively to Patrons</a>, we discuss excerpts from Alan Rickman's recently released diary, <em>Truly Madly</em>!</li>\n<li>This week's episode is brought to you by <a href=\"https://podcasts.apple.com/us/podcast/nerd-out-the-happiness-of-being-a-fan/id1474245040?i=1000577693870\">The Happiness Lab Podcast</a>, BetterHelp (get 10% off your first month at <a href=\"http://www.BetterHelp.com/MuggleCast\">BetterHelp.com/MuggleCast</a>) and HelloFresh (use code muggle65 for 65% off plus free shipping at <a href=\"http://www.HelloFresh.com/Muggle65\">HelloFresh.com/Muggle65</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 04 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-03:/posts/8168115",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}