{
  "published": "2022-11-01T17:13:05-04:00",
  "updated": "2022-11-01T17:13:05-04:00",
  "title": "Bolsonaro finally speaks — but doesn’t concede the election",
  "content": "<figure>\n      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/9K6z672jyK6fEFn1EAqRipCM2a0=/258x0:2277x1514/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71566826/1244408333.7.jpg\" />\n        <figcaption>President of Brazil Jair Bolsonaro looks on during a press conference two days after being defeated by Lula da Silva in the presidential runoff at Alvorada Palace on November 1, 2022, in Brasilia, Brazil. | Andressa Anholete/Getty Images</figcaption>\n    </figure>\n\n  <p>Still, his administration confirmed that the presidential transition is beginning, as Lula prepares to take over on January 1.</p> <p id=\"EHAcrm\">Brazilian president Jaír Bolsonaro finally spoke to the country on Tuesday — almost 48 hours after losing the presidential runoff election to political rival and former president <a href=\"https://www.youtube.com/watch?v=rtAWPMLYMpQ&amp;t=3s\">Luiz Inácio Lula da Silva</a>.</p>\n<p id=\"JeFrsx\">Bolsonaro, in a very short speech, did not concede the election or recognize Lula’s victory. Instead, he said <a href=\"https://twitter.com/g1/status/1587532186890260481?s=20&amp;t=eHEMM4Rn_Z9pjI3TmyvHrg\">he would follow the Constitution</a>. He thanked his voters and addressed protests and pro-Bolsonaro trucker roadblocks that have sprung up across Brazil. He described demonstrations as the product of “indignation and feelings of injustice in the electoral process.” But, he said while <a href=\"https://twitter.com/g1/status/1587530755483308032?s=20&amp;t=eHEMM4Rn_Z9pjI3TmyvHrg\">“peaceful protests are always welcome,”</a> he condemned the blockades’ tactics, <a href=\"https://www.nytimes.com/2022/11/01/world/americas/bolsonaro-protest-brazil-election.html\">saying </a>“our methods cannot be those of the left, like property invasion, destruction of goods, and restrictions on the right to come and go.” </p>\n<p id=\"UVLBTJ\">After Bolsonaro gave his statement, his chief of staff said that the president had authorized <a href=\"https://twitter.com/DLBiller/status/1587533889492369408?s=20&amp;t=zIl73EOcmlzYgFFcG2zzpw\">the start of the presidential transition</a>. </p>\n<p id=\"ZhFqDk\">Bolsonaro’s speech on Tuesday indicated that he is prepared to leave office, and to do so without a real effort to disrupt the transfer of power to Lula, despite months of agitating his supporters with unfounded claims of possible election fraud. </p>\n<p id=\"B8tesp\">Bolsonaro may not have had any choice. Even as the president stayed silent, Brazil’s political, <a href=\"https://www1.folha.uol.com.br/poder/2022/10/pastores-bolsonaristas-abaixam-o-tom-e-pedem-oracao-por-lula.shtml?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=comptw\">religious</a>, and <a href=\"https://www.reuters.com/world/americas/brazilian-court-orders-roadblocks-cleared-bolsonaro-silent-election-loss-2022-11-01/\">business</a> leaders — <a href=\"https://br.noticias.yahoo.com/tarc%C3%ADsio-diz-que-buscar%C3%A1-alinhamento-011300849.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAFEX45UAbvlcRPTB4TsO7Rl4-k3t82TTY2GMQm8NofwJrPVPVs5L1Z4-BZ28Oybu7fDcCaah0toOfLuGmhazCPCN0nWp3YduRzzFG03ftSo4uQa6Ic7x5xlo7TT9yrscJhWyY0EurhoYfJyOycdCbcFssTBCYsvtaZ9UtL5Pm1Ai\">including some of Bolsonaro’s closest allies</a> — affirmed Lula’s electoral victory and promised to work with the new administration. The full-throated support for the legitimacy of Lula’s win blunted the potential threat of Bolsonaro’s silence — and the threat of the possibility the incumbent might not accept the electoral results.</p>\n<p id=\"uHccqv\">Still, Bolsonaro supporters <a href=\"https://www.cbsnews.com/news/brazil-election-results-2022-protest-lula-bolsonaro-road-blocks/\">have staged disruptive protests across the country</a>, with truck drivers blocking roads and refusing to accept the results. Bolsonaro did not exactly tell these demonstrators to stand down, but he also didn’t rile them up by explicitly claiming fraud. How his supporters will react to Bolsonaro’s speech remains uncertain, <a href=\"https://www.aljazeera.com/news/2022/11/1/brazils-supreme-court-orders-removal-of-pro-bolsonaro-roadblocks\">though the Supreme Court has ordered the removal of these roadblocks.</a></p>\n<h3 id=\"MFeUGy\">Bolsonaro’s election denialism ends with a whimper — for now. But Bolsonarismo is likely here to stay.</h3>\n<p id=\"CcqEc1\">Bolsonaro has long sowed doubts <a href=\"https://www.vox.com/2021/9/8/22620570/bolsonaro-brazil-september-7-democracy-supreme-court\">about election integrity in Brazil</a> and raised the specter of voter fraud throughout his presidency, <a href=\"https://medium.com/dfrlab/electionwatch-claims-of-electronic-voting-fraud-circulate-in-brazil-b09cdbe6777a\">including in the 2018 election he actually won</a>. </p>\n<p id=\"jDDGbV\">In the lead-up to the 2022 elections, <a href=\"https://www.vox.com/2021/9/8/22620570/bolsonaro-brazil-september-7-democracy-supreme-court\">he amplified and intensified those claims</a>, especially as Lula led in the polls and <a href=\"https://www.vox.com/2021/6/4/22456981/brazil-jair-bolsonaro-impeachment-protests-coronavirus\">Bolsonaro faced political backlash for his handling of the Covid-19 pandemic and the economy</a>. Specifically, Bolsonaro lied about the security of the country’s electronic voting system (which, in use since 2002, was created <a href=\"https://www.ndi.org/e-voting-guide/examples/the-rationale-for-e-voting-in-brazil\">to reduce fraud and corruption</a> and <a href=\"https://www.bloomberg.com/news/articles/2020-11-12/dozens-of-fake-bolsonaros-are-running-in-brazilian-elections\">to manage the logistics of a complex voting system</a>). “I’ll hand over the presidential sash to whoever wins the election cleanly,” the far-right <a href=\"https://www.reuters.com/world/americas/brazils-bolsonaro-says-he-wont-hand-over-presidency-if-there-is-vote-fraud-2021-07-01/\">Bolsonaro said in July</a> 2021. “Not with fraud.”</p>\n<p id=\"Z7aAoC\">But in the aftermath of the election, Bolsonaro was isolated as prominent allies and politicians affirmed they were preparing for Lula’s inauguration on January 1. And, though Bolsonaro did not say the words himself, his own administration confirmed the process is beginning. </p>\n<p id=\"ctZxGV\">Exactly how smooth a transition that may be is still in question. Bolsonaro has previously <a href=\"https://www.reuters.com/world/americas/bolsonaro-says-he-will-be-arrested-killed-or-declared-winner-2021-08-28/\">said he saw three outcomes for the elections: death, prison, or victory</a>. His reluctance to concede already chips away at the health of Brazil’s democracy, and he may still do more damage, depending on how he uses the platform of the presidency for the next two months.</p>\n<p id=\"VoIXmA\">“I don’t think he’ll be interested in working with Lula during the transition period,” said Andre Pagliarini, an assistant professor of history at Hampden-Sydney College and fellow at the Washington Brazil Office. “That said, one thing I think is fatal to any attempt by Bolsonaro to muck things up is that virtually everybody else has recognized his defeat.”</p>\n<p id=\"XOWUAb\">Still, how the post-election period has unfolded in Brazil is a reassuring sign for Brazil’s democratic institutions. Even if the future reactions of Bolsonaro and his most ardent supporters are still troublingly unpredictable, the country is withstanding <a href=\"https://thehill.com/opinion/international/3707536-will-brazil-have-its-own-jan-6-crisis/\">the type of January 6-style insurrection</a> that some feared might happen in the wake of a Bolsonaro defeat. </p>\n<p id=\"Db3cMz\">In retrospect, that’s looking like it was always going to be a bit harder to pull off. For one, Brazil gets its election results fast — the world’s fourth-largest democracy, with a population of over 210 million, including some <a href=\"https://www.voanews.com/a/in-brazilian-amazon-a-1-000-mile-voyage-so-people-can-vote-/6773339.html\">who vote from remote parts of the Amazon</a>, tallies its results quickly (<a href=\"https://www.vox.com/2018/5/8/17320758/primary-election-night-results-ohio-west-virginia-indiana-north-carolina\">certainly faster than the world’s second-largest</a> democracy). The country — and the world — knew Lula had won the election the day of. That, experts pointed out, has eliminated a lot of space for Bolsonaro to sow real doubts about the outcome. (There <a href=\"https://www.reuters.com/world/americas/brazil-highway-police-blockades-fan-voter-suppression-fears-2022-10-30/\">were reports of possible voter intimidation</a> on the day of the election against Lula voters after police allegedly blocked roads in the northeast, Lula’s stronghold.)</p>\n<p id=\"TxX4T1\">And, again, the political establishment credited Lula with victory, <a href=\"https://twitter.com/Zambelli2210/status/1586856212821336064?s=20&amp;t=2AdEG2t-W-HU-e650GTm6Q\">even as some of his opponents made clear they would oppose him and his agenda when in office</a>. The military and police, always a potential wild card, <a href=\"https://twitter.com/malugaspar/status/1587112513388388352?s=20&amp;t=kVX3FBJm7MH_V7ovy-VMag\">also don’t appear to be agitating to disrupt the peaceful transfer of power</a>. “At the institutional level, everyone is acting very responsibly, so Bolsonaro doesn’t have traction there,” said Paulo Barrozo, an associate law professor at Boston College.</p>\n<p id=\"IzPEDC\">That institutional bulwark, if it holds, and Lula’s victory itself are signs that Brazil’s democracy withstood Bolsonaro’s very real threat. There are sighs of relief and celebration from many of <a href=\"https://twitter.com/tomphillipsin/status/1587096539863842817?s=20&amp;t=fZlyJwQchoPuNKXGflmO1Q\">Lula’s supporters and Bolsonaro’s opponents</a> who see Lula’s win as an opportunity to restore and shore up the country’s political system. </p>\n<p id=\"JVVxhC\">But that victory is not a cure-all for the country’s sharp divisions.<strong> </strong>Bolsonaro lost the election, but <a href=\"https://www.reuters.com/world/americas/right-wing-wins-brazils-congress-show-staying-power-bolsonarismo-2022-10-03/\">many of his political allies won</a>, and Lula will rule over a divided government. Lula won with a coalition that <a href=\"https://www.bloomberg.com/graphics/2022-brazil-election/\">included his traditional base of support</a>, but his coalition spanned from the far left to the center right, including many who voted against Bolsonaro, rather than for Lula. That may redefine the legacy of Lula, a leftist hero who went from prison back to the presidency and who, as experts said, may now govern more from the center, framing himself as a transitional leader.</p>\n<p id=\"5aat8C\">“Starting January 1, 2023, I will govern for 215 million Brazilians and not only for those who voted for me,” Lula said in his victory speech. “There are not two Brazils. We are a single country, a single people, and a great nation.” </p>\n<p id=\"rRdnCB\">But the close results of the election — the tightest since Brazil’s transition to a democracy in 1984-1985 — make it clear that two Brazils likely do exist. Bolsonaro may have lost, but Bolsonarismo<em> </em>and the right-wing movement he created have become a more deeply rooted political phenomenon, said Pagliarini. </p>\n<p id=\"C1thqb\">The election results, if anything, show the strength of the right wing in Brazil — which still had electoral success in 2022, and may see this election as a future to build on, one that transcends Bolsonaro himself. “If and when Bolsonaro leaves the stage, his presence will be felt for years to come, not just in elected office,” Pagliarini said. </p>\n<p id=\"g4AOvO\"><em><strong>Update, November 1, 5 pm ET: </strong></em><em>This story has been updated to include information about Bolsonaro’s speech Tuesday.</em></p>",
  "link": "",
  "id": "https://www.vox.com/world/2022/10/31/23432788/brazil-election-lula-wins-bolsonaro-speech-no-concession",
  "author": {
    "name": "Jen Kirby"
  }
}