{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-6116765973770355647",
  "published": "2022-10-29T17:04:00.000+05:00",
  "updated": "2022-10-29T17:04:23.403+05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Jazz supports the nationwide breast cancer awareness campaign",
  "content": "<h1 style=\"text-align: left;\">Jazz supports the nationwide breast cancer awareness campaign</h1><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSRSBwTkO-BQnL_d4zJD8iCgemnJ0MvwV4eusQ0-xDwZ1s5smjNrvLvuQBt9L8lm4DgVuvk4b9tvBVXzj9PjaJFzm70NDSPjNQsMwVWiZLk5pU1REI4en0EdMM2Q-Foq5NAjx_IQ3WdfOVPBUTU9pbnpQbiEnqtxfwMKCJ7QeCs_IIQaKHDRaOIJWKog/s800/Jazz%20Breast%20Cancer%20Awareness%20Campaign.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"449\" data-original-width=\"800\" height=\"360\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSRSBwTkO-BQnL_d4zJD8iCgemnJ0MvwV4eusQ0-xDwZ1s5smjNrvLvuQBt9L8lm4DgVuvk4b9tvBVXzj9PjaJFzm70NDSPjNQsMwVWiZLk5pU1REI4en0EdMM2Q-Foq5NAjx_IQ3WdfOVPBUTU9pbnpQbiEnqtxfwMKCJ7QeCs_IIQaKHDRaOIJWKog/w640-h360/Jazz%20Breast%20Cancer%20Awareness%20Campaign.jpg\" width=\"640\" /></a></div><br /><div><br /></div><div><br /></div><div>Aimed at raising awareness on breast cancer, Jazz, Pakistan’s leading digital operator and the largest internet and broadband service provider, conducted month-long campaigns to drive reinforcement for prevention, reminder of periodic checkups, and educate the masses including its own employees.</div><p>Pakistan has the highest incidence of breast cancer among Asian countries; one in nine women is at risk of being diagnosed with breast cancer, and 40,000 women die of breast cancer every year, out of which only 19,000 women are diagnosed with breast cancer.&nbsp;</p><p>Jazz offices and experience centers were lit up pink to serve as a reminder and draw attention to this critically important message, encouraging women to have regular check-ups and destigmatize the taboos associated with breast cancer.</p><p>Additionally, the company collaborated with Pink Ribbon to organize nationwide awareness sessions for all branches and joined hands with Shaukat Khanum Memorial Cancer Hospital and Research Centre for SMS and billboard awareness campaigns.&nbsp;</p><p>“Jazz is committed to empowering Pakistani women through the power of the internet by providing digital access to effective, quality essential health care services. With over 21,000 women remaining undiagnosed with breast cancer, our campaigns were aimed at creating conversation around this topic. Our thoughts and prayers remain with those who have lost their lives fighting against breast cancer,” said Sabahat Bokhari, Head of D&amp;I, Jazz.</p><p>Shaukat Khanum, Pink Ribbon, and ITTEHAD teams also visited Jazz offices to highlight the importance of breast cancer early detection, destigmatizing the examination, timely diagnosis, and efficient treatment methods. Jazz has provided employees with Pink Cards (valid for family members as well), which offer females up to 50% discount on various healthcare tests such as hormone profiles, and mammograms, among other women-related medical tests.</p><div><br /></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}