{
  "title": "LIVVY DUNNE SHOCKED BY LIVE DM REVEAL — BFFs EP. 89 WITH ANDREW SCHULZ",
  "description": "<p>We start the pod off joined by Andrew Schulz, who has a new comedy special that he bought off a streamer himself to keep the jokes uncensored. We then get into headlines with Andrew including Tristan Thompson and Khloe Kardashian having another baby, JLo and Ben Affleck tying the knot, Elon Musk’s dad having a child with his step daughter, Sevryn moving on from Mads, Sabrina Carptenter releasing a clap back album to Olivia Rodrigo’s driver’s license, Kylie Jenner getting cancelled over 3 minute private jet rides, Addison Rae’s dad commenting on her mom’s Tik Toks, Addison getting her own Barbie doll, Dana White giving Nelk $250k for their birthday, Bryce Hall issuing his terms for the Tayler Holder fight, EmRata divorcing her cheating husband, and Lebron dominating the Drew League.\n\nWe then are joined by Livvy Dunne to figure out if there is a hint of romance between her and Josh after he tried to buy her bath water, her current NIL deals, her time at Coachella, and whether or not she has become an LA girl.\n\nWe then accidentally reveal DMs that Livvy did not know we had in the most vicious (but accidental) ambush in the history of the show.\n\nWe finish with a game of FMK turned KMK with some familiar friends, Tik Tokkers, and exes. \n\nSupport our sponsors!\n\nGametime: Download the Gametime app at https://barstool.link/GametimeApp and redeem code BFF for $20 off your first purchase (terms apply).\n\nTakis: Find Takis on Amazon Today and \"Face the Intensity\"\n\nBetterhelp: Go to BetterHelp.com/BFF for 10% off your first month\n\nBeis : Go to https://barstool.link/BeisBFF for 15% off your first purchase</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "fb877329-9d44-4390-8625-bf052bc7ffc7",
  "pubDate": "Thu, 21 Jul 2022 00:01:36 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:22:57",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}