{
  "title": "Cost Matters: Why Lambda School should have a lower success rate than college",
  "author": {
    "name": "Chris Stucchio"
  },
  "link": "",
  "updated": "2020-03-03T08:30:00+01:00Z",
  "published": "2020-03-03T08:30:00+01:00Z",
  "id": "https://www.chrisstucchio.com/blog/2020/why_lambda_school_should_have_a_50_percent_success_rate.html",
  "content": "\n                (If mathematical formulas are not showing up here, <a href=\"https://www.chrisstucchio.com/blog/2020/why_lambda_school_should_have_a_50_percent_success_rate.html?utm_medium=rss&utm_source=rss&utm_campaign=rss\">please read this on the web.</a>.)\n                <p>Lambda School has recently come under fire by the mainstream media for having success rates smaller than 100%, as well as for having a founder who is a nerd. The articles imply that Lambda School is somehow ripping off it's students - possibly by, um, tricking hedge funds into paying for their education - though no real mechanism for this is provided.</p>\n<p>(I'm not actually joking about the nerd part - the <a href=\"http://archive.is/HU2vj\">MSM article</a> that I found literally talks about how he doesn't have enough friends.) But this critique is the height of innumeracy; there is no intrinsic reason Lambda School or any other institution <em>should</em> have high success rates.</p>\n<p>In this blog post I'm going to do some really simple probability and expose an important tradeoff that I've observed people ignoring in many different contexts - Lambda School and MOOCs, in business, and elsewhere. This article is more about decision theory than Lambda School - but the recent controversy over Lambda School having a lower than 100% success rate makes a good jumping off point.</p>\n<p>Lets do the math.</p>\n<section id=\"the-basic-math-of-a-single-gamble\">\n<h2>The basic math of a single gamble</h2>\n<p>Suppose we have the opportunity to make a gamble. If we make the gamble, we have a probability <code>p</code> of winning. If we win the gamble we earn a payoff of <code>w</code>, whereas if we lose we earn a payoff of <code>l</code>.</p>\n<p>For example, the gamble might be \"attend Lambda School\", \"go to college\" or \"buy clicks via google adwords which may or may not buy a product from our landing page\". The payoff of a win (<code>w</code>) would be a higher paying job or a sale on a website. The loss of losing (<code>l</code>) would be the time and money spent on tuition or the money paid to Google for the click.</p>\n<p>It's very easy to compute the expected value of this gamble is:</p>\n<pre>E[gamble] = p*w + (1-p)*l</pre>\n<p>Assuming no risk aversion - fairly typical when <code>w</code> and <code>l</code> are not that large - we should take this gamble whenever <code>E[gamble] > 0</code>. Doing some simple arithmetic, we discover that this gamble is positive sum whenever:</p>\n<pre>w/l > (1-p)/p</pre>\n<p>(If this is a repeated game we should use the <a href=\"https://en.wikipedia.org/wiki/Kelly_criterion\">Kelly Criterion</a> or some similar rule. I'm going to focus on the non-repeated case in this post.)</p>\n<p>Another useful rearrangement is we break even when <code>p = l/(w+l)</code>.</p>\n<p>Sounds simple, right?</p>\n<p>It's important to note that there are 3 different ways we can alter the parameters to make a gamble worthwhile:</p>\n<ul class=\"simple\">\n<li>Increase <code>w</code> - make the payoff more attractive.</li>\n<li>Increase <code>p</code> - make a winning bet more likely.</li>\n<li>Decrease <code>l</code> - make the cost of losing lower.</li>\n</ul>\n<p>The latter case is actually pretty important; consider the limiting case of <code>l == 0</code>. In this case, there is a finite probability <code>p</code> of winning something, and even if you don't win you lose nothing. That's a good bet to take regardless of how low <code>p</code> is!</p>\n<p>So far, nothing groundbreaking, right?</p>\n<section id=\"concrete-examples-lambda-school-and-rutgers-university\">\n<h3>Concrete examples: Lambda School and Rutgers University</h3>\n<p>Lets now consider Lambda School and cook up an oversimplified example.</p>\n<p>I'll assume the applicant currently earns $30k/year. I'll assume that <em>if</em> the student is successful via Lambda School, their salary will increase to $70k/year. Furthermore, I'll assume the value of their time (before graduation) is $30k/year. I'll also use a 5 year time horizon.</p>\n<p>Lambda School is a 9 month program. Valuing time at $30k/year, this means the cost of an unsuccessful attempt at Lambda School is <code>l = $22.5k</code>.</p>\n<p>If Lambda School succeeds, the winning payoff is a job earning $70k/year. The student will have to pay Lambda School 17% of this for 2 years (yielding a net pay of $58.1k/year) and after this they earn the full $70k. The excess over their original pay is then $28.1k for 2 years and $40k for 3 years - in total, <code>w = $178k</code>.</p>\n<p>On net, <code>w/l = 7.91</code> implying that even if the probability of success is only 15%, this is a reasonably good deal for the student.</p>\n<p>Now lets examine Rutgers. I'm choosing Rutgers because it's my alma mater. Following the numbers <a href=\"https://twitter.com/stucchio/status/1230510530973978627\">from this tweet thread</a>, we learn the cost of Rutgers (a 4 year program) is $22.5k x 4 = $90k in lost income. Additionally tuition is $12k in state (assume a generous $6k after financial aid) adding another $24k for a total of $114k. This is paid whether the gamble pays off or not.</p>\n<p>This means that <code>w = 5 * $40k - 114k = $86k</code> and <code>l = $114k</code>. This yields <code>w/l=0.75</code>, implying that even at 50% success probability, going to Rutgers is a bad deal for the student! Rutgers needs approximately a 60% success probability for the student to break even.</p>\n<p>(Note: The actual success rate of Rutgers, <a href=\"https://twitter.com/stucchio/status/1230510532051947520\">measured according to the criteria of Lambda School</a>, is about 30%.)</p>\n<p>You can play with these numbers a lot - take a 10 year time horizon, play with outcomes beyond \"fail - 30k, success - 70k\", etc.</p>\n<p>But it's really hard to escape from the extreme cost advantage that ISAs provide: Lambda School doesn't cost very much for people who don't succeed. There's a reason that <a href=\"https://twitter.com/Austen\">Austen Allred</a> constantly talks about alignment of incentives!</p>\n</section>\n</section>\n<section id=\"the-basic-math-of-a-sorting-rule\">\n<h2>The basic math of a sorting rule</h2>\n<p>Lets suppose now that we have multiple gambles we can choose to enter or not - say <code>N` gambles, with ``i <- 1..N</code> representing a particular gamble. Moreover, for each gamble, we know the success probability <code>p[i]</code> of that particular gamble.</p>\n<p>For example, we might be choosing which students to admit to Lambda School or Rutgers.</p>\n<p>As another example, we might be choosing which adwords (and landing pages matched to the adwords) we wish to bid on for CPC.</p>\n<p>We are now faced with the task of choosing which gambles we want to take. Armed with the decision rule we came up with above we have a simple way to decide this: if <code>w/l > (1-p[i])/p[i]</code> we will accept gamble <code>i</code>.</p>\n<section id=\"lowering-the-cost-of-failure-allows-one-to-accept-a-lower-success-rate\">\n<h3>Lowering the cost of failure allows one to accept a lower success rate</h3>\n<p>Let us now consider a set of gambles; lets assume that <code>p[i] = i/10</code> for <code>i=0..10</code>. Suppose for simplicity that <code>w=2, l=8</code>. This implies that the positive sum gambles are the ones with <code>p[i] >= 0.8</code> or <code>i >= 8</code>.</p>\n<p>If we choose gambles according to this rule, we will only choose to gamble at <code>i=8,9,10</code>; the overall success probability is <code>0.9</code>. This set of gambles should be thought of as a regular university; the cost of failure is high.</p>\n<p>Suppose now we reduced the cost of failure; say instead of <code>l=8</code> we had <code>l=2</code>. In this case, the positive sum gambles are the ones with <code>p[i] >= 0.5</code> or <code>i=5...10</code>. The average success rate of over all of these gambles is <code>0.75</code>, which is lower than the <code>0.9</code> we had at a cost of <code>l=8</code>.</p>\n<p>Here's the core economics of this. If you lower the cost of something, it makes sense to lower quality standards of that something.</p>\n</section>\n<section id=\"intuitive-example-wikipedia-lambda-school-and-college\">\n<h3>Intuitive example: Wikipedia, Lambda School and College</h3>\n<p>On the topic of educational institutions, consider my favorites: Wikipedia and Duckduckgo. These institutions have very high failure rates for me; quite often, I search for something and do not find what I'm looking for. Obviously, Wikipedia is not in any sense bad for consumers simply because I search for lots of things I don't find.</p>\n<p>And the reason for this is obvious; Wikipedia is free. If it's useful 20% of the time and takes me 5 seconds to search for something, that's an average of 25 seconds of search per useful result. That's a win.</p>\n<p>In contrast, a college with a 20-30% success rate (and <a href=\"https://moneyinc.com/worst-colleges-in-america/\">they do exist</a>) is taking tens of thousands of dollars from students and providing very little value in return. This is much worse even though the success rate is the same.</p>\n<p>Lambda school operates somewhere in between the extremes of Wikipedia and College. It's a lot cheaper than college - particular for the people who don't succeed. This means that the socially optimal result (from the perspective of a student) is that Lambda School should admit more students until it's success rate drops significantly below college.</p>\n<p>I understand the sentiment that high failure rates are a problem, but hopefully the example of Wikipedia provides intuition about why a low cost method of education can be valuable even if it's success rate is low.</p>\n</section>\n</section>\n<section id=\"you-can-never-raise-your-conversion-rate\">\n<h2>You can never raise your conversion rate</h2>\n<p>Here's an example that someone at a major travel website told me about. The customer acquisition funnel consists of paying Google for adwords on a cost-per-click basis. Once people reach the site, a certain fraction of them make a purchase.</p>\n<p>Suppose we have several different ad channels, i.e. keywords that can be bid on. When a customer converts the profit is $50.</p>\n<p>The channels available are:\n- A, with a CPC of $2 and a conversion rate of 10%. The cost per conversion here is $2/0.1 = $20, meaning the profit is $30 for people coming from this channel.\n- B, with a CPC of $1 and a conversion rate of 3%. The cost per conversion here is $33, meaning the profit is $16 for people coming from this channel.\n- C, with a CPC of $1 and a conversion rate of 1.5%. The cost per conversion here is $66, making this channel money losing.</p>\n<p>Assuming these channels provide equal traffic, bids will be placed on channels A and B only. C is unprofitable so no bids are placed.</p>\n<p>Now suppose the price of adwords falls by 30%; channel A now costs $1.4/click while B and C cost $0.7/click. At this point the cost per conversion of channel C has dropped to <code>$0.7/0.015 = $46.67 < $50</code>. At this time channel C gets switched on.</p>\n<p>However, the net result of this is that the conversion rate has dropped from <code>(10% + 3%)/2=6.5%</code> to <code>(10%+3%+1.5%)/3 = 4.8%</code>. Profit margins have dropped too. The net result here is that traffic has increased by 50%, but the new 50% are low margin, barely profitable users with low conversion rates. These new users drag the average down even as they add profits to the bottom line.</p>\n<p>On the flip side of this phenomenon, it's very difficult to <em>raise</em> conversion rates. Imagine a sitewide improvement that results in the conversion rate on every channel increasing by 40% (but prices remained the same). This raises the conversion rate of channel C to 2.1%, lowering the cost per conversion to $47.61 and making it profitable.</p>\n<p>The average conversion rate goes to <code>(14%+4.2%+2.1%)/3 = 6.76%</code>, a mere 4% improvement over the old conversion rate of <code>(10%+3%)/2=6.5%</code>. If Channel C were twice the size of channel A, then the conversion rate would actually go down to <code>(14%+4.2%+2x2.1%)/4 = 5.6%</code>!</p>\n<p>On the other hand it's important to look at aggregate numbers. In these scenarios, improving conversion rates has increased sales by 50-100%. The additional sales have significantly lower margin, but it's still an increase in profits.</p>\n</section>\n<section id=\"why-indian-software-developers-are-lower-quality-than-western-ones\">\n<h2>Why Indian software developers are lower quality than Western ones</h2>\n<p>I've made this argument <a href=\"https://www.chrisstucchio.com/blog/2017/cobbs_douglas.html\">elsewhere in more detail</a>, but I'll give a short summary here.</p>\n<p>The cost of an American developer is approximately 3-10x the cost of a similar Indian developer. In my experience (I lived in India for many years), there are plenty of Indian developers and data scientists just as good as any in the US. (If you are seeking employees, I know of a good company that everyone is leaving from. I can connect you to people.)</p>\n<p>Yet the reputation of Indian developers among Americans is quite low. People commonly talk about outsourced projects run by teams of idiots, and have generally strong criticisms of Indian developers in general.</p>\n<p>I never had this experience, but I also subject anyone I hire in India to the same level of hiring rigor that I subject Americans to.</p>\n<p>We can reconcile these two views simply by observing that as you lower the cost of a failure (e.g. making a bad hire), it is economically optimal to allow a higher rate of failure. This means that Indian companies competing with American companies should have a lower hiring bar, by the same logic as above. This will drag the <em>average</em> quality of Indian developers down; similarly low quality American developers would simply not get hired as developers.</p>\n<p>Thus, the Indian software engineering market has lower quality simply because low costs have allowed a larger pool of people to enter.</p>\n<p>(Note: I'm singling out India only because I lived and worked there for many years.)</p>\n</section>\n<section id=\"conclusion\">\n<h2>Conclusion</h2>\n<p>The interplay between individual success probabilities, cost of failure, and aggregate success probabilities is complex. It is simply innumerate to say, as <a href=\"https://twitter.com/Austen/status/1231972469495324672\">Austin Allred did</a>, that <em>\"We will never be ok with 50% [success rate].\"</em> As the cost of failure drops, as it does with Lambda School, the socially optimal success rate also drops.</p>\n<p>(To be clear, I believe <a href=\"https://twitter.com/Austen\">&#64;austen</a> probably knows this and is merely attempting to placate innumerate journalists.)</p>\n<p>Simple economics tells us that the lower the cost of failure, the more failed attempts should be made. When the cost of failure goes down, any critique of reduced success rates is hopelessly innumerate.</p>\n</section>\n\n              "
}