{
  "title": "60: Ora Nadrich- Says Who? Banish Negative Thoughts & Take Back Our Lives",
  "pubDate": "Thu, 20 Oct 2016 15:53:35 +0000",
  "guid": "c6cefe6c03ff558e6bce497581121986",
  "link": "https://lifeonpurpose.libsyn.com/60-ora-nadrich-says-who-banish-negative-thoughts-take-back-our-lives",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #60</strong>, my guest is certified life coach, mindfulness meditation teacher, author, and blogger <strong>Ora Nadrich</strong>.<br /> <br /> <strong>Ora</strong> joined me for a great chat about her new book, <em><strong>Says Who? How One Simple Question Can Change the Way You Think Forever</strong></em>, how her own life story — including her sister's nervous breakdown when <strong>Ora</strong> was 14 years old influenced her work, and the Says Who? Method she developed.<br /> <br /> In the book, she vividly illustrates and breaks down her simple yet highly effective method, based on the principle that while we all face obstacles and negative thoughts in our lives, it is not enough to simply examine and be aware of them — we must question and challenge them in order to bring about true change.<br /> <br /> <em>“We think 60,000–70,000 thoughts a day, and sadly, it’s the negative ones we tend to hear the loudest. But using a set of daily, simple questions, we can stop them the instant they pop up to sabotage us. It’s as simple a practice as brushing your teeth.”</em><br /> <br /> About: <strong>Ora Nadrich</strong> is a certified Life Coach, and Mindfulness Meditation teacher. She is a frequent blogger for the Huffington Post on Mindfulness, and leads workshops on “Living a Mindful Life.”<br /> <br /> Ora was an actress and screenwriter, where she worked in film, episodic television, and commercials for more than a decade, which she feels provided her vast experience in exploring motivation and the process of self-discovery. During that time, she simultaneously embarked on a two-decade psychological and spiritual journey towards self-awareness and transformation.<br /> <br /> Ora retired from acting, and devoted her time to studying the workings of the mind. On her psychological and spiritual journey she explored Cognitive Behavioral Therapy (CBT), and a multi-year, intensive study of various disciplines and techniques, including the Technology of Change with Robert Lorenz, and extensive Jungian analysis.<br /> <br /> She studied Kabbalah and Buddhism, and met some of the finest spiritual teachers and leaders like, Gurumayi of Siddha Yoga, Sonam Kazi, the Dalai Lama’s interpreter, and, ultimately, His Holiness himself, the Dalai Lama. Her exploration of self-realization continues today.<br /> <br /> Ora lives with her husband, Jeff, and two sons, Jake and Benjamin in Los Angeles.<br /> <br /> To learn more about <strong>Ora</strong> and her work, visit: <a href=\"http://www.oranadrich.com/\" target= \"_blank\">http://www.oranadrich.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #60, my guest is certified life coach, mindfulness meditation teacher, author, and blogger Ora Nadrich.  Ora joined me for a great chat about her new book, <em>Says Who? How One Simple Question Can Change the Way You Think Forever</em>, how her own life story — including her sister's nervous breakdown when Ora was 14 years old influenced her work, and the Says Who? Method she developed.  In the book, she vividly illustrates and breaks down her simple yet highly effective method, based on the principle that while we all face obstacles and negative thoughts in our lives, it is not enough to simply examine and be aware of them — we must question and challenge them in order to bring about true change.  <em>“We think 60,000–70,000 thoughts a day, and sadly, it’s the negative ones we tend to hear the loudest. But using a set of daily, simple questions, we can stop them the instant they pop up to sabotage us. It’s as simple a practice as brushing your teeth.”</em>  About: Ora Nadrich is a certified Life Coach, and Mindfulness Meditation teacher. She is a frequent blogger for the Huffington Post on Mindfulness, and leads workshops on “Living a Mindful Life.”  Ora was an actress and screenwriter, where she worked in film, episodic television, and commercials for more than a decade, which she feels provided her vast experience in exploring motivation and the process of self-discovery. During that time, she simultaneously embarked on a two-decade psychological and spiritual journey towards self-awareness and transformation.  Ora retired from acting, and devoted her time to studying the workings of the mind. On her psychological and spiritual journey she explored Cognitive Behavioral Therapy (CBT), and a multi-year, intensive study of various disciplines and techniques, including the Technology of Change with Robert Lorenz, and extensive Jungian analysis.  She studied Kabbalah and Buddhism, and met some of the finest spiritual teachers and leaders like, Gurumayi of Siddha Yoga, Sonam Kazi, the Dalai Lama’s interpreter, and, ultimately, His Holiness himself, the Dalai Lama. Her exploration of self-realization continues today.  Ora lives with her husband, Jeff, and two sons, Jake and Benjamin in Los Angeles.  To learn more about Ora and her work, visit: <a href=\"http://www.oranadrich.com/\" target= \"_blank\">http://www.oranadrich.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "58:31",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #60, my guest is certified life coach, mindfulness meditation teacher, author, and blogger Ora Nadrich.  Ora joined me for a great chat about her new book, Says Who? How One Simple Question Can Change the Way You Think..."
}