{
  "id": "https://bibleinoneyear.org/en/youth/358",
  "title": "Day 358: Faith Looks Up",
  "description": "Psalm 147:1–3,6–7a,11, Nehemiah 1:3–5a,6b, 2:17–18, Revelation 16:1,5–7,12–17.  It is not just a case of looking back, but also looking up  Faith looks up",
  "pubDate": "Fri, 24 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/358/?ignore",
  "itunes:duration": "09:59",
  "guid": "enyouth24122021-358",
  "length": 599.43,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 358: Faith Looks Up",
  "itunes:subtitle": "Psalm 147:1–3,6–7a,11, Nehemiah 1:3–5a,6b, 2:17–18, Revelation 16:1,5–7,12–17.  It is not just a case of looking back, but also looking up  Faith looks up",
  "itunes:summary": "In A Christmas Carol, by Charles Dickens, the central character, Ebenezer Scrooge, was a miserable, mean, miserly old businessman who is shown his past, present and future. He eventually repents and starts to give generously.\nDickens captures the transformation in his character: ‘He went to church, and walked about the streets… and found that everything could yield him pleasure. He had never dreamed that any walk – that any thing – could give him so much happiness.’\n‘Repentance’ is a very positive word in the Bible. The Greek word ‘metanoia’ means ‘change of mind’. That means, first, turning away from the bad stuff. This is the stuff that spoils your life and breaks your relationship with God. Repentance means to be sorry enough to quit. Getting rid of the bad stuff only enhances your life. But, that is only the first part.\nThe change of heart and mind means not only turning away from the bad things, but also turning towards God and good. The word ‘repent’ rarely appears on its own in the Bible. Genuine repentance is shown by its fruit. Remorse is not enough. A change of mind, heart and life is required. It is nearly always, ‘repent and…’. Repent and believe. Repent and put your faith in Jesus Christ. It is not just a case of looking back, but also looking up. Faith looks up.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 358
}