{
  "title": "US calls Security Council meeting after ICBM launch",
  "link": "https://www.rt.com/news/565929-security-council-korea-icbm/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565929-security-council-korea-icbm/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63647b0220302743c0362bf8.jpg\" /> The US has requested a meeting at the United Nations Security Council to discuss North Korea’s recent missile launches <br/><a href=\"https://www.rt.com/news/565929-security-council-korea-icbm/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Pyongyang has fired a barrage of missiles and artillery shells to protest extended US-South Korean war games this week</strong></p>\n            \n                        \n            <p>The&nbsp;US has asked for a meeting at the United Nations Security Council to discuss a series of recent missile launches by North Korea, including an intercontinental ballistic missile (ICBM) fired over the sea on Thursday morning.</p>\n<p><strong></strong>Washington is seeking to meet publicly by Friday, UN Ambassador Linda Thomas-Greenfield <a href=\"https://usun.usmission.gov/ambassador-linda-thomas-greenfields-interview-with-andrea-mitchell-of-msnbcs-andrea-mitchell-reports-3/\" target=\"_blank\" rel=\"noopener noreferrer\">told</a> MSNBC, accusing North Korea of violating <em>&ldquo;multiple&rdquo;</em> Security Council resolutions prohibiting missile tests.</p>\n<p><em>&ldquo;We really do need to ramp up our efforts so that the DPRK gets the message that what they are doing is unacceptable. We will be having a Security Council meeting tomorrow to bring this before the entire council,&rdquo;</em> Thomas-Greenfield said on Thursday. <em>&ldquo;We&rsquo;re working closely with our Japanese and Republic of Korea colleagues also to ensure that the DPRK does not think that this is something that is acceptable.&rdquo;</em></p>\n<p>Several other Security Council members have already backed the US request, including France, Britain, Norway, Ireland, and Albania, multiple unnamed diplomats <a href=\"https://archive.ph/gweTl\" target=\"_blank\" rel=\"noopener noreferrer\">told</a> Reuters.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63642de185f5404eeb7b628b.jpg\" alt=\"US Secretary of Defense Lloyd Austin speaks during a news conference with South Korea&#039;s Defense Minister Lee Jong-sup at the Pentagon, November 3, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565923-austin-pentagon-korea-strategic/\">Pentagon reveals stance on ‘strategic assets’ in Korea</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Pyongyang unleashed around 100 artillery shells and at least six missiles into the sea on Wednesday as a show of force to protest the ongoing military exercises by the US and South Korea. It followed up that demonstration with an ICBM test on Thursday morning, its first since May, prompting a stern warning from the Pentagon.</p>\n<p><strong></strong><em>&ldquo;Any nuclear attack against the United States or its allies and partners, including the use of non-strategic nuclear weapons, is unacceptable and will result in the end of the Kim [Jong-un] regime,&rdquo;</em> US Defense Secretary Lloyd Austin <a href=\"https://www.defense.gov/News/Releases/Release/Article/3209105/54th-security-consultative-meeting-joint-communique/\" target=\"_blank\" rel=\"noopener noreferrer\">said</a> during a meeting with his South Korean counterpart on Thursday.</p>\n<p><strong></strong>North Korea has repeatedly condemned the joint military drills of Washington and Seoul, deeming them preparations for an attack, and has been particularly vocal about this week&rsquo;s &lsquo;Vigilant Storm&rsquo; aerial exercises. US and South Korean officials have agreed to extend the drills past Friday in response to <em>&ldquo;recent provocations&rdquo;</em> by Pyongyang, which denounced the move as an <em>&ldquo;awful mistake&rdquo;</em> and an <em>&ldquo;irresponsible decision.&rdquo;</em></p>\n<p>Though the Security Council <a href=\"https://apnews.com/article/russia-ukraine-china-japan-north-korea-c2814192ae7890d7cf08cbed76845336\" target=\"_blank\" rel=\"noopener noreferrer\">met last month</a> to discuss North Korea&rsquo;s record number of missile launches this year, the body was divided on how to proceed. Some members, including Russia and China, argued that US-led military exercises were inflaming tensions in the region and provoking reactions from Pyongyang, with Beijing&rsquo;s deputy envoy urging Washington to take a less hostile approach.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565928-unga-condemns-cuba-embargo-israel/\">\n            <span>READ MORE: </span>Only one country backs US in UN Cuba vote\n        </a>\n    </p>\n\n    \n\n<p></p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 02:38:09 +0000",
  "dc:creator": "RT"
}