{
  "title": "S03.05: A Heart of Blood and Ashes by Milla Vane: Because Moon Reasons",
  "category": [
    "full-length episode",
    "read along",
    "S03 - BOOB"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 16 Sep 2020 04:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2020/9/15/s0305-a-heart-of-blood-and-ashes-by-milla-vane",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5f60b7cc26ee893714f0eb9c",
  "description": "<p class=\"\">This week, we begin the Season 3 read alongs, and we announce the first wave of work of romance we want to honor -- joy. Romance is supposed to be fun, and sometimes, especially now, as 2020 rages around us, it can be difficult to remember that.</p><p class=\"\">So, we begin talking about joy this week with a book that gave us both immense joy, Milla Vane's <em>A Heart of Blood and Ashes</em>. This one is a long one, y'all, so get ready. We're all over the place because we loved it so much, and it's a ride. Eric wants us to tell you that this is going to feel like an old-school IAD episode, so if you haven't read the book, good luck! We love you!</p><p class=\"\">Next week, we’ve got an interstitial for you! And the week after, we’re deep diving on Alisha Rai’s <em>Serving Pleasure</em>, which is a fantastic erotic romance. Find it at <a href=\"https://amzn.to/32zLEy4\">Amazon</a>, <a href=\"https://www.barnesandnoble.com/w/serving-pleasure-alisha-rai/1122082804?ean=2940151625579\">B&N</a>, <a href=\"https://www.kobo.com/us/en/ebook/serving-pleasure\">Kobo</a>, <a href=\"https://books.apple.com/us/book/serving-pleasure/id1003204174?itscg=30200&itsct=books_toolbox\">Apple Books</a> or <a href=\"https://bookshop.org/a/5775/9781518710100\">Bookshop.org</a>.</p><p class=\"\">Also -- Sarah has a contemporary novella out September 15th! Preorder the Naughty Brits anthology, wherever you get your ebooks: <a href=\"https://amzn.to/32mLLLP\">Amazon</a>, <a href=\"https://bit.ly/naughtybritsnook\">Nook</a>, <a href=\"https://bit.ly/naughtybritskobo\">Kobo</a>, <a href=\"https://bit.ly/naughtybritsapple\">Apple</a>, or in print at <a href=\"https://bookshop.org/a/5775/9781949364071\">bookshop.org</a>.</p><p class=\"\"><strong>Show Notes</strong></p><p class=\"\">Please listen and suscribe to the <a href=\"https://podcasts.apple.com/us/podcast/black-romance-podcast/id1528266279\">Black Romance Podcast</a>, a fascinating oral history of Black romance authors. For more recent interviews with authors, check out <a href=\"https://wickedwallflowersclub.com/\">The Wicked Wallflowers podcast</a>. There are so many amazing romance podcasts for every type of listener.</p><p class=\"\"><a href=\"https://www.kirkusreviews.com/news-and-features/articles/remembering-romance-novelist-johanna-lindsey/\">After her death</a>, readers shared their memories of their first Johanna Lindsey novels using the hashtag <a href=\"https://twitter.com/sarahmaclean/status/1209131730705305600\">#MyFirstJohanna.</a></p><p class=\"\">Alisha Rai, <a href=\"https://twitter.com/AlishaRai/status/751576519416348672\">we demand to know the name of your hairdresser</a>.</p><p class=\"\">California and the entire West Coast and experiencing <a href=\"https://en.wikipedia.org/wiki/2020_California_wildfires?scrlybrkr=f4ab5e85\">the worst fire season in 100 years</a>. <a href=\"https://www.c2es.org/content/wildfires-and-climate-change/#:~:text=Climate%20change%20has%20been%20a,in%20the%20Western%20United%20States.&text=Once%20a%20fire%20starts%E2%80%94more,them%20harder%20to%20put%20out.\">Climate Change is real</a>.</p><p class=\"\">Sarah <a href=\"https://millavane.com/maps/\">asked for maps</a>, and Jen said <a href=\"http://www.adlit.org/article/19844/\">\"reading strategies are for everyone\"</a> because they are! While we're at it, <a href=\"https://www.readingrockets.org/strategies/visual_imagery\">making mental movies, models, and visual images of what you read is one of the best reading strategies out there </a>and if you have little kids, teach them to do this and it will help them be better readers their entire life.</p><p class=\"\">This amazing thread by <a href=\"https://twitter.com/AlexandraErin\">Alexandra Erin</a> is about how <a href=\"https://twitter.com/AlexandraErin/status/1302200977261461505\">sometimes genre is determined by plot and sometimes it's determined by setting</a>.</p><p class=\"\"><a href=\"https://amzn.to/2RvVPNH\">The audiobook for A Heart of Blood and Ashes is great</a>, but Jen really recommends you <a href=\"https://twitter.com/caitlynlynch6/status/1302004418242662401\">slow it down to .9 if you want it at \"regular\" speaking speed.</a></p><p class=\"\">Ilona Andrews writes amazing books, and <a href=\"https://fatedmates.net/episodes/2019/3/1/85-gateways-to-romance-interstitial\">Jen wants you to read the Hidden Legacy series</a>. IN FACT, NEVADA AND ROGAN DO KISS in the first book, but they don't do the business until the second.</p><p class=\"\">If you missed <a href=\"https://fatedmates.net/episodes/2019/5/18/135-freewheeling-with-sarah-and-jen\">our bodily autonomy episode</a>, we were real mad about ridiculous anti-abortion laws and we talked about how romance taught us about birth control and our bodies.</p><p class=\"\">Some <a href=\"https://www.theguardian.com/science/blog/2015/dec/17/poisons-sparkling-cyanide-murder-forensics-toxicology?scrlybrkr=8409eb5d\">interesting thoughts about poison</a>, and <a href=\"https://www.bitchmedia.org/article/poison-is-womans-weapon\">the myth of the woman as poisoner</a> and <a href=\"https://www.washingtonpost.com/news/wonk/wp/2015/05/07/poison-is-a-womans-weapon/\">who is likely to use it</a>. This is realted to the idea that manipulation (or as Maddek might call it, \"sly tongue\") <a href=\"https://www.womensweb.in/2020/03/manipulative-women-victim-of-patriarchy-survival-strategy-mar20wk2sr/\">is often used by the powerless as a way of getting around patriarchal power structures that silence them</a>.</p><p class=\"\"><a href=\"https://youtu.be/Z58g-u0YrMU\">\"She rescues him right back\"</a> is, of course, a reference to Pretty Woman.</p><p class=\"\">Up next, <a href=\"https://amzn.to/2ZA0CCb\">Serving Pleasure</a> by Alisha Rai.</p><p class=\"\">Buy Fated Mates swag by clicking on the Merch link at the top of this page.</p><p class=\"\">Did someone say map?</p><p class=\"\"><a href=\"https://millavane.com/maps/#\">Milla Vane's website had it!</a></p><p class=\"\"><strong>Lost Limb Count (SO MANY SPOILERS!)</strong></p><p class=\"\">For those listeners who missed Season One of Fated Mates, Kresley Cole really enjoyed removing limbs from her characters (They mostly regenerated). She liked it so much, that we tracked the lost limbs from the books in what is now an epic lost limb counter.</p><p class=\"\">Also, if you missed Season One, it's our pure joy in your earholes. We recommend it.</p><p class=\"\"><strong>Legs & Feet</strong></p><p class=\"\">Years earlier, Yvenne attempted to escape with her mother. In retaliation, her father and brother shatter her knee. It never heals properly and she will never run again.</p><p class=\"\">At the end, Yvenne is trapped in her tower, and from that window she shoots her father Zhalen right through his knee and calf with her arrow, shattering his knee as hers had been.</p><p class=\"\"><strong>Arms, Hands, and Fingers</strong></p><p class=\"\">Immediately before the book begins, Yvenne used a bow and arrow to kill her brother Lazen. To punish her, her father cut off the first and second fingers of her right hand so she can never draw a bow again.</p><p class=\"\"><strong>Head, Face, and Eyes</strong></p><p class=\"\">Yvenne throws a dagger at her brother Bazir’s eye. Although her aim is perfect, the handle hits him in the eye rather than the blade. Later that night, Bazir and his men attack, and Maddek rips out Bazir’s tongue, stabs and kills Bazir with his own poisoned sword.</p><p class=\"\"><strong>Torso</strong></p><p class=\"\">When Zhalen realized that Yvenne sent a message to Maddek’s parents, he whipped her back and left numerous scars.</p><p class=\"\">When Maddek kidnaps her from the wedding caravan, Yvenne stabs her brother Cezan in the back with her dagger.</p><p class=\"\">When Zhalen’s men come for her and kill Banek, she rips the arrows from the fallen bodies around her in order to shoot back at her father’s men.</p><p class=\"\"><strong>Total Body Destruction</strong></p><p class=\"\">After Yvenne’s brother Aezil poisons Maddek, he is too weak to wield a weapon. He crawls to the edge of the cliff, drops his sword into the drepa (an evil bird dinosaur kind of thing) nest which causes them to attack and kill Aezil while Maddek and his wolf play dead.</p><p class=\"\">Zhalen tricks Yvenne into drinking three doses of half-moon milk. She was not sure she was pregnant, so it forced her to have a heavy period or perhaps an abortion. She is overcome with grief.</p><p class=\"\">After Yvenne shatters Zhalen’s kneecap with her arrow, Maddek rips out his tongue, shreds his cock and balls with his silver claws, and then tears out his heart. He then uses Zhalen’s own axe to cut off his head, which he then presents to Yvenne as a sign of his love and devotion.</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Sarah and Jen really like this book.",
  "itunes:summary": "This week, we begin the Season 3 read alongs, and we announce the first wave of work of romance we want to honor -- joy. Romance is supposed to be fun, and sometimes, especially now, as 2020 rages around us, it can be difficult to remember that.\n\nSo, we begin talking about joy this week with a book that gave us both immense joy, Milla Vane's A Heart of Blood and Ashes. This one is a long one, y'all, so get ready. We're all over the place because we loved it so much, and it's a ride. Eric wants us to tell you that this is going to feel like an old-school IAD episode, so if you haven't read the book, good luck! We love you!",
  "itunes:explicit": "yes",
  "itunes:duration": "01:36:38",
  "itunes:image": "",
  "itunes:season": 3,
  "itunes:episode": 5,
  "itunes:title": "S03.05: A Heart of Blood and Ashes by Milla Vane: Because Moon Reasons",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S03.05: A Heart of Blood and Ashes by Milla Vane: Because Moon Reasons"
  }
}