{
  "title": "Reliable emulation of complex functionals by active learning with error control. (arXiv:2208.06727v2 [physics.chem-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2208.06727",
  "description": "<p>A statistical emulator can be used as a surrogate of complex physics-based\ncalculations to drastically reduce the computational cost. Its successful\nimplementation hinges on an accurate representation of the nonlinear response\nsurface with a high-dimensional input space. Conventional ``space-filling''\ndesigns, including random sampling and Latin hypercube sampling, become\ninefficient as the dimensionality of the input variables increases, and the\npredictive accuracy of the emulator can degrade substantially for a test input\ndistant from the training input set. To address this fundamental challenge, we\ndevelop a reliable emulator for predicting complex functionals by active\nlearning with error control (ALEC). The algorithm is applicable to\ninfinite-dimensional mapping with high-fidelity predictions and a controlled\npredictive error. The computational efficiency has been demonstrated by\nemulating the classical density functional theory (cDFT) calculations, a\nstatistical-mechanical method widely used in modeling the equilibrium\nproperties of complex molecular systems. We show that ALEC is much more\naccurate than conventional emulators based on the Gaussian processes with\n``space-filling'' designs and alternative active learning methods. Besides, it\nis computationally more efficient than direct cDFT calculations. ALEC can be a\nreliable building block for emulating expensive functionals owing to its\nminimal computational cost, controllable predictive error, and fully automatic\nfeatures.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Fang_X/0/1/0/all/0/1\">Xinyi Fang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gu_M/0/1/0/all/0/1\">Mengyang Gu</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Wu_J/0/1/0/all/0/1\">Jianzhong Wu</a>"
}