{
  "title": "Is Iran Tracking and Controlling Its Protesters' Phones?",
  "link": "https://mobile.slashdot.org/story/22/11/05/0035236/is-iran-tracking-and-controlling-its-protesters-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "The Intercept reports that protesters in Iran \"have often been left wondering how the government was able to track down their locations or gain access to their private communications &mdash; tactics that are frighteningly pervasive but whose mechanisms are virtually unknown.\" \n\nBut The Intercept now has evidence of a new possibility:\nWhile disconnecting broad swaths of the population from the web remains a favored blunt instrument of Iranian state censorship, the government has far more precise, sophisticated tools available as well. Part of Iran's data clampdown may be explained through the use of a system called \"SIAM,\" a web program for remotely manipulating cellular connections made available to the Iranian Communications Regulatory Authority. The existence of SIAM and details of how the system works, reported here for the first time, are laid out in a series of internal documents from an Iranian cellular carrier that were obtained by The Intercept. \n\nAccording to these internal documents, SIAM is a computer system that works behind the scenes of Iranian cellular networks, providing its operators a broad menu of remote commands to alter, disrupt, and monitor how customers use their phones. The tools can slow their data connections to a crawl, break the encryption of phone calls, track the movements of individuals or large groups, and produce detailed metadata summaries of who spoke to whom, when, and where. Such a system could help the government invisibly quash the ongoing protests &mdash; or those of tomorrow &mdash; an expert who reviewed the SIAM documents told The Intercept. \n\n\"SIAM can control if, where, when, and how users can communicate,\" explained Gary Miller, a mobile security researcher and fellow at the University of Toronto's Citizen Lab. \"In this respect, this is not a surveillance system but rather a repression and control system to limit the capability of users to dissent or protest.\" \nThanks to long-time Slashdot reader mspohr for submitting the article.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Is+Iran+Tracking+and+Controlling+Its+Protesters'+Phones%3F%3A+https%3A%2F%2Fbit.ly%2F3Uv7Z83\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F22%2F11%2F05%2F0035236%2Fis-iran-tracking-and-controlling-its-protesters-phones%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://mobile.slashdot.org/story/22/11/05/0035236/is-iran-tracking-and-controlling-its-protesters-phones?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22334637&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "EditorDavid",
  "dc:date": "2022-11-05T15:34:00+00:00",
  "dc:subject": "cellphones",
  "slash:department": "Big-Brother",
  "slash:section": "mobile",
  "slash:comments": 41,
  "slash:hit_parade": "41,36,27,23,6,4,3"
}