{
  "title": "TU55: Feeling Empty? Demoralization and the Fight Back to Caring Again.",
  "link": "https://therapistuncensored.com/episodes/tu55-feeling-empty-demoralization-and-the-fight-back-to-caring-again/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu55-feeling-empty-demoralization-and-the-fight-back-to-caring-again",
  "pubDate": "Wed, 14 Feb 2018 11:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5897",
  "description": "Have you given up the fight (political, interpersonal….)? In this episode we attempt to reignite the fight inside you for things that used to matter, and distinguish demoralization from clinical depression.\n\nHopelessness, loss of meaning, and existential distress – these are the characteristics not of depression as one might think, but of demoralization. They are different syndromes with different directions for intervention. Find out more in this episode where co-hosts Ann Kelley PhD and Sue Marriott LCSW CGP discuss how transitioning from taking an active stance towards either situation can be beneficial. Learn how you can develop both internal and external coping mechanisms against demoralization.\n\nPlease listen through the end we thank several of you for leaving a rating/review for us!\n\nSue Marriott is a professional clinical social worker and psychotherapist, Ann Kelley is an experienced psychologist and together they along with their guests, bring the science of relationships to the world in practical understandable tidbits.\n\nSIGN UP FOR OUR LIVE CONFERENCE ON ATTACHMENT APRIL 7, 2018 – Early Bird Discount available now until 3/1/18: \n\nHealing Adult Attachment, the 3 Pillars of Integrated Treatment  with Dr. David Elliott (Thank you to our co-sponsor Austin IN Connection.)\n\nOnline reading group to start in April, 2018 for Elliott’s book – Attachment Disturbances in Adults Comprehensive Treatment and Repair (Norton 2016) by Daniel Brown and David Elliott. Reserve your slot today!\n\nEpisode 55:\n\n0:00-10:00\n\nIntroduction\n\nDefining demoralization, differentiating between depression and demoralization\n\nDemoralization – feeling of hopelessness, dropping your hands to your side, idea of the “collapse”\n\nDepression is a physiological state. People stay in this physiological state.\n\nDemoralization: You can’t imagine positive for anticipated events\n\nDemoralization clinically speaking is more of an existential crisis, idea of things being “too easy”\n\nAntidepressants are unlikely to help a demoralized person\n\n10:00-20:00\n\nImportance of developing agency, competence, “grit” of overcoming demoralization (and not taking that struggle from your children)\n\nSolution to demoralization: transitioning from passive to active, changing the environment, asking for accommodations\n\nConsider the way you’re complaining in dissatisfaction and external, you might be taking the demoralized approach\n\nDemoralization is inability to cope. Internal and external coping can counteract. Feel trapped.\n\nThese shifts can be very difficult.\n\n20:00-30:00\n\nDemoralization is related more to Dismissive, or Anxious-Avoidant Attachment, choosing to stay down and bypass feelings, rather than get hopes up then get disappointed over and over again\n\nWithin hope there’s desire and connection, without those you can’t push forward\n\nYou can’t talk someone out of demoralization\n\nDemoralization is more linked with suicidal ideation than depression – is serious in it’s own right\n\nTaking quarter or half steps to affect change and feel efficacy, transitioning from left to right brain thinking\n\nBe interested in what happens to you when you become deflated – explore, be curious\n\nDepression is serious and should be treated but demoralization is important to differentiate. Inactivity is detrimental to both\n\nTalking to yourself out loud, using your name is a form of taking action. Take active curiosity in why you complain.\n\nWrap up\n\nHey careful listeners… we never figured out the French phrase Sue was trying to remember, rough english translation of dropping your hands by your side. Any ideas there?\n\nResources:\n\nTHE MMPI-2’s RESTRUCTURED CLINICAL DEMORALIZATION SCALE: EXPLORING\n\nCORRELATES OF DEMORALIZATION IN A PSYCHIATRIC INPATIENT SAMPLE AND\n\nTHE IMPLICATIONS FOR AGING\n\nGrief, Demoralization and Depression: Diagnostic Challenges and Treatment Modalities\n\nThe Demoralized Mind\n\nMore Resources here",
  "enclosure": "",
  "itunes:subtitle": "Have you given up the fight (political, interpersonal….)? In this episode we attempt to reignite the fight inside you for things that used to matter, and distinguish demoralization from clinical depression. - Hopelessness, loss of meaning,",
  "itunes:summary": "Hopelessness, loss of meaning, and existential distress – these are the characteristics not of depression as one might think, but of demoralization.  They are different syndromes with different directions for intervention. Find out more in this episode where co-hosts Ann Kelley PhD and Sue Marriott LCSW CGP discuss how transitioning from taking an active stance towards either situation can be beneficial. Learn how you can develop both internal and external coping mechanisms against demoralization.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "32:51"
}