{
  "title": "S1E52 - Unwavering Belief with 2-Time Super Bowl Champ Tory James",
  "guid": "https://pinecast.com/guid/e5cbbd1f-c432-4e08-a86c-a009fc6f2cca",
  "pubDate": "Tue, 07 Sep 2021 06:30:00 -0000",
  "itunes:duration": "00:56:58",
  "description": "<p>With the start of the new football season upon us, the timing is perfect for 2-time Super Bowl champ, Tory James, to join Laura on the podcast. During his 11 season career in the NFL, Tory enjoyed great success with a few different teams, especially the Denver Broncos, and even earned a spot in the 2004 Pro Bowl. Tory’s resilience throughout this extensive career is very much a function of the influence his family had upon him, and, especially, the unwavering belief that he had in himself, and he discusses these factors and so much more here today.</p>\n<p>He begins by sharing his early involvement in sports, his shift into football, his mom’s perspective on it, and both those who doubted and believed in his potential. He then goes on to summarize his playing career from high school to college to the NFL, the pivotal injury he suffered and his recovery from it, his ability to use fear to help him, and the source of his impressive longevity in the NFL. He finishes up by sharing the hardest and greatest moments in his career and what he does these days in retirement. Throughout this fascinating conversation, Tory highlights the role that family, gratitude, love of the game, and his unwavering belief played in his success, and his story as told here today will undoubtedly move and inspire all who listen.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>How Tory became involved in sports and football in particular</li>\n<li>Listening to the one coach who believed in him</li>\n<li>His feeling of unwavering belief</li>\n<li>His Mom’s perspective on his playing football</li>\n<li>Tory’s impact on those who doubted him</li>\n<li>His transition for high school to college football</li>\n<li>Getting to the NFL</li>\n<li>The difference between the NFL and college football</li>\n<li>His knee injury and recovery</li>\n<li>Using your fear to help you</li>\n<li>His return from the knee injury</li>\n<li>What makes the NFL so tough</li>\n<li>The source of his longevity in the NFL</li>\n<li>Loving to play</li>\n<li>The important role family plays</li>\n<li>The hardest and greatest moments of his career</li>\n<li>What Tory does in retirement</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>‘‘It hurts so bad. It hurts still to this day, because I still like basketball over football. But I was always good at football, so I took his advice and I started playing football.”</li>\n<li>“So when I'm helping little kids, I tell them, ‘See it in your mind, you do it perfect in your mind over and over again until it becomes you and it becomes natural.’”</li>\n<li>“For whatever reason, people put their fears on you, and I just never let it affect me.”</li>\n<li>“I think you probably changed their entire outlook on how they saw the world, and I think that's huge.”</li>\n<li>“That's, like, the joy when I think about playing football - how it made people feel.”</li>\n<li>“The power of just having one person believe in you like that one coach when everybody else is saying ‘No’, it makes a huge difference.”</li>\n<li>“It was really hard to mess up in Denver, they just had it down. That's probably one of the most professional teams I've ever played for, and it showed by us winning and everybody loved each other, and everybody helped each other. It was amazing.”</li>\n<li>“We're all going to go through stuff, and it's how you handle it that's going to grow you as a person and your character and who you are the rest of your life beyond your sport, too.”</li>\n<li>“Fear is feeling excited and ready.”</li>\n<li>“Now today, what I do is I'm thankful for everything that happens.”</li>\n<li>“Hard work, dedication, drive, and just willing to do what you have to do and just not ever giving up on your goal.”</li>\n<li>“I hope everybody else that I'm playing with feels like they're the best because that's the type of players I want to play with.”</li>\n<li>“You tell me I can't do it, I'm going to find a way to prove you wrong.”</li>\n<li>“You made this choice to enjoy it and to have fun and playing the game the whole time.”</li>\n<li>“The reason I'm playing is for family.”</li>\n<li>“I learned discipline, hard work, to be honest, from my mom.”</li>\n<li>“It turned out to be the best thing that happened to me because I think if I wouldn't have gotten hurt early on, I don't think my body would have held up as long as it did.”</li>\n<li>“They always kept me grounded and humble, like, you know, and I kept that with me my whole football career.”</li>\n<li>“I wanted to get 10 years and I felt like if I got 10 years and that's like my goal, that's like my gold medal.”</li>\n<li>“I love your mental mindset. I love your passion, your gratitude, you're always so thankful for every opportunity, good and bad. I love that you showed us your purpose that's beyond yourself, your unwavering belief in your dreams.”</li>\n</ul>\n<p>Show Links\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>       \n       \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a></p>",
  "itunes:title": "Unwavering Belief with 2-Time Super Bowl Champ Tory James",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 52
}