{
  "title": "TU34: Treating Attachment Difficulties with Dr. David Elliott",
  "link": "https://therapistuncensored.com/episodes/tu34-treating-attachment-difficulties-with-dr-david-elliott/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu34-treating-attachment-difficulties-with-dr-david-elliott",
  "pubDate": "Wed, 21 Jun 2017 21:28:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=4868",
  "description": "In this episode of Therapist Uncensored,\nGuest Dr. David Elliott presents the Three Pillars of treatment for attachment disruptions.  Besides background on why attachment matters and the prevalence of insecurity, we focus mostly on how to apply the science in trying to heal relational attachment injuries for our clients, or ourselves.\nMeeting David Elliott\nDr. Elliott has had leadership roles in several professional organizations. He was President of the Rhode Island Psychological Association for a two-year term, during 2000 and 2001; and prior to that he was Chair of the Coalition of Mental Health Professionals of Rhode Island (COMHPRI), also for two years. Both organizations advocate for availability and access to high quality and affordable mental health services.\n\nSince 1998 Dr. Elliott has been on the faculty of and teaches annually at the International School for Psychotherapy, Counseling, and Group Leadership, in St. Petersburg, Russia. This three-year post-graduate program helps the therapists in training develop not only the professional skills necessary for effective therapy or leadership, but also the personal qualities that assure empathic, attuned, and ethically responsible professional activity. He is currently Chair of the International Advisory Board of the school.\n\nDavid Elliott is a clinician and consultant who works with trauma and co-author of Attachment Disturbances in Adults, Treatment for Comprehensive Repair(2016).\nTreating Attachment – today’s episode\nWe knew we had to interview Dr. Elliott upon finding his book, Attachment Disturbances in Adults, Treatment for Comprehensive Repair(2016). It immediately became Sue’s current favorite read and that is saying a lot!\n\nWe cover quite a lot in this podcast, especially about treatment, but if that still isn’t enough, these show notes are PACKED with PDF’s of great material offered by Dr. Elliott! Below you will find 4 full PDF handouts about the salient ideas of their synthesis of treatment for adults with attachment disruptions.\n\nDr. Elliott introduces our audience to the 3 Pillars of Comprehensive Treatment: Ideal Parent Protocol, Metacognition and Fostering Collaborative Capacity. While he touches on them all, please download the 4 PDF attachments provided below, and start by reviewing the Overview.\nFour PDFs\n\n \tOverview of the Three Pillars Model of Attachment Treatment (Brown & Elliott, 2016)\n \tThe Five Primary Conditions that Promote Secure Attachment (Brown & Elliott, 2016)\n \tLevels of Metacognitive Skills (Brown & Elliott, 2016)\n \tFostering Collaborative Capacity and Behavior (Brown & Elliott, 2016)\n\n \n\n_______\nIt’s too late to attend, but just so ya know this happened….\nWe were so impressed with his work Therapist Uncensored brought Dr. Elliott to Austin Texas for the first live professional conference we’ve hosted spun directly off the podcast in March of 2018. It was co-hosted by Austin IN Connection, an incredible non-profit supporting the the dissemination of the attachment sciences.\nRESOURCES:\nAdditional resources for this episode:\n\n \tDaniel Brown, co-author of Attachment Disturbances in Adults This is his current website, which focuses on his meditation and spiritual development activities.\n \tAttachment Disturbances in Adults Treatment for Comprehensive Repair (2016) Daniel Brown andDavid Elliott \n \tClinical Application of the Adult Attachment Interview Edited by Howard Steele and Mariam Steele Our favorite clinical reference for those that want to learn much more deeply about using the AAI to treat attachment and learn about its usefulness with various populations.\n \tVideo of Strange Situation to familiarize yourself with Mary Ainsworth and later Mary Main’s phenomenal work.\n \tThese and other resources have been collected for you on our Resources page!\n\nIf you loved this podcast episode- then you will definitely want to check out our new course…\n\nOur advanced course on attachment and neuroscience has bee...",
  "enclosure": "",
  "itunes:subtitle": "In this episode of Therapist Uncensored, Guest Dr. David Elliott presents the Three Pillars of treatment for attachment disruptions.  Besides background on why attachment matters and the prevalence of insecurity,",
  "itunes:summary": "Guest Dr. David Elliott presents the Three Pillars of treatment for attachment disruptions.   Besides background on why attachment matters and the prevalence of insecurity, we focus mostly on how to apply the science in trying to heal relational attachment injuries for our clients, or ourselves.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:duration": "50:21"
}