{
  "id": "yt:video:2T7wSwQtkts",
  "yt:videoId": "2T7wSwQtkts",
  "yt:channelId": "UCOY6nAvXpLem0XczOq3wYQA",
  "title": "Strangely Familiar Places in Movies Explained",
  "link": "",
  "author": {
    "name": "Du Cinema",
    "uri": "https://www.youtube.com/channel/UCOY6nAvXpLem0XczOq3wYQA"
  },
  "published": "2022-05-08T16:55:15+00:00",
  "updated": "2022-09-02T17:09:53+00:00",
  "media:group": {
    "media:title": "Strangely Familiar Places in Movies Explained",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In this video essay we will be exploring and demistifying various types of strange, yet familiar looking places in movies and TV series. These 'unsetteling' places have gained a lot of popularity in recent years and became known as so called: \"Liminal Spaces\". People have been sharing and discussing pictures of empty shopping malls, playgrounds and hotels all over the internet, but what makes these places so special? \nTo try and find an answer to this question I decided to shine a new light on this subject by looking at it from the perspective of movies. I was suprised nobody had written about this or made a video on it already, so thats why I gathered a list of movies that feature various forms of liminality. I discovered that directors such as Stanley Kubrick, Andrei Tarkovsky and David Lynch had mastered the art of liminal spaces, long before it became a thing. So let me show you how deep the rabbit hole goes...\n\nStory, narration and editing by Eloi du Cinema. \n- My instagram: https://www.instagram.com/eloiducinema/ \n- Business Inquiries: ducinemaofficial@gmail.com\n\nChapters:\n0:00 An introduction to Liminal Spaces\n3:04 Chapter 1: Physical Liminal Spaces (i.e. Discovering them)\n4:51 ii. Exploring Liminal Spaces\n7:24 iii. Escaping Liminal Spaces\n8:59 Chapter 2: Emotional Liminal spaces\n13:06 Chapter 3: Temporal Liminal spaces\n\nMusic in this video is public domain and/or Royalty-free Music from Artlist and Epidemicsounds: \n- https://artlist.io/\n- https://www.epidemicsound.com/\n\nSo Below - Minecraft Soundtrack\nSubwoofer Lullaby - Minecraft Soundtrack\n\nCopyright Disclaimer under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\n\n#LiminalSpaces #Backrooms #VideoEssay",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}