{
  "title": "236: Memories of A Murderer: The Nilsen Tapes",
  "link": "https://audioboom.com/posts/8070460",
  "itunes:episode": 236,
  "itunes:title": "Memories of A Murderer: The Nilsen Tapes",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3901,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On a cold day in 1983, a plumber was called to an apartment building in the Cranley Gardens neighborhood of North London. The building drains were clogged. And when he climbed down into plumbing \"man hole\" he saw what was causing the blockage: human flesh and bone. What followed was essentially an elaborate confession by one of the building's tenants: Dennis Nilsen who explained to the police that he had murdered and dismembered at least 12 men and boys and disposed of them both UNDER HIS FLOORBOARDS AND DOWN THE DRAINS. How is it possible that at least 12 people could vanish and be murdered and nobody noticed?<br>\n<br>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\">COME SEE US ON TOUR</a>!! In May we're hitting <strong>Chicago, Boston, Seattle, and Los Angeles! </strong>We're covering \"CLASS ACTION PARK.\" You know you want to see us do that one LIVE AND IN-PERSON! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">GET YOUR TICKETS HERE!!!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"LuLaRich\"</strong> <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a> <br>\n<br>\n<a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">COME TO OBSESSED FEST!!</a> It's the first-ever OBSESSED NETWORK FAMILY WEEKEND! It's going to be a weekend full of live shows--OWD Friday night, TCO Saturday night (and two non-Obsessed Network live shows as well!), meet & greets, KARAOKE!, meetups, panel chats AND. ONE. INSANE. DRAG. BRUNCH!!! It's all happening at the Hyatt Regency in Columbus, Ohio from September 30 - October 2nd. <a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">TICKETS ARE ALMOST GONE!! GET YOUR TICKET HERE!!</a><br>\n<br>\n<br>\n\n</div>\n<div>\n<a href=\"https://audioboom.com/posts/8068251-murdered-and-missing-in-montana/edit\">Update Description<br>\n</a><br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 26 Apr 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-21:/posts/8070460",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}