{
  "title": "MOXIE Shows How to Make Oxygen on Mars",
  "link": "https://spectrum.ieee.org/making-oxygen-on-mars",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image-of-mars-perseverance-rover-with-scientific-instruments-on-extended-robotic-arm.jpg?id=31612448&width=1500&height=2000&coordinates=78%2C0%2C552%2C0\"/><br/><br/><p><sub></sub>Planning for the return journey is an integral part of the preparations for a crewed Mars mission. Astronauts will require a total mass of about 50 tonnes of rocket propellent for the ascent vehicle that will lift them off the planet’s surface, including 31 tonnes of oxygen approximately. The less popular option is for crewed missions to carry the required oxygen themselves. But scientists are optimistic that it could instead be produced from the carbon dioxide–rich Martian atmosphere itself, using a system called <a href=\"https://spectrum.ieee.org/moxie-might-be-the-most-exciting-thing-perseverance-has-brought-to-mars\" target=\"_self\"><u>MOXIE</u></a>.</p><p>The <a href=\"https://mars.nasa.gov/mars2020/spacecraft/instruments/moxie/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Mars Oxygen ISRU (In-Situ Resource Utilization) Experiment</u></a> is an 18-kilogram unit housed within the Perseverance rover on Mars. The unit is “the size of a toaster,” adds <a href=\"https://aeroastro.mit.edu/people/jeffrey-a-hoffman/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Jeffrey Hoffman</u></a>, professor of aerospace engineering at MIT. Its job is to <a href=\"https://mars.nasa.gov/mars2020/spacecraft/instruments/moxie/for-scientists/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>electrochemically break down carbon dioxide</u></a> collected from the Martian atmosphere into oxygen and carbon monoxide. It also tests the purity of the oxygen. </p><p>Between February 2021, when it arrived on Mars aboard the Perseverance, and the end of the year, MOXIE has had several successful test runs. According to a review of the system by Hoffman and colleagues, published in <a href=\"https://www.science.org/doi/10.1126/sciadv.abp8636\" rel=\"noopener noreferrer\" target=\"_blank\"><u><em>Science Advances</em></u></a>, it has demonstrated its ability to produce oxygen during both night and day, when temperatures can vary by over 100 ºC. The generation and purity rates of oxygen also meet requirements to produce rocket propellent and for breathing. The authors assert that a scaled-up version of MOXIE could produce the required oxygen for lift-off as well as for the astronauts to breathe.</p><p class=\"pull-quote\">Next question: How to power any oxygen-producing factories that NASA can land on Mars? Perhaps via NASA’s Kilopower fission reactors? </p><p>MOXIE is a first step toward a much larger and more complex system to support the human exploration of Mars. The researchers estimate a required generation rate of 2 to 3 kilograms per hour, compared with the current MOXIE rate of 6 to 8 grams per hour, to produce enough oxygen for lift-off for a crew arriving 26 months later. “So we’re talking about a system that’s a couple of hundred times bigger than MOXIE,” Hoffman says. </p><p>They calculate this rate accounting for eight months to get to Mars, followed by some time to set up the system. “We figure you'd probably have maybe 14 months to make all the oxygen.” Further, he says, the produced oxygen would have to be liquefied to be used a rocket propellant, something the current version of MOXIE doesn’t do.</p><p>MOXIE also currently faces several design constraints because, says Hoffman, a former astronaut, “our only ride to Mars was inside the Perseverance rover.” This limited the amount of power available to operate the unit, the amount of heat they could produce, the volume and the mass. </p><p>“MOXIE does not work nearly as efficiently as a stand-alone system that was specifically designed would,” says Hoffman. Most of the time, it’s turned off. “Every time we want to make oxygen, we have to heat it up to 800 ºC, so most of the energy goes into heating it up and running the compressor, whereas in a well-designed stand-alone system, most of the energy will go into the actual electrolysis, into actually producing the oxygen.”</p><p>However, there are still many kinks to iron out for the scaling-up process. To begin with, any oxygen-producing system will need lots of power. Hoffman thinks nuclear power is the most likely option, maybe NASA’s <a href=\"https://www.nasa.gov/directorates/spacetech/kilopower\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Kilopower fission reactors</u></a>. The setup and the cabling would certainly be challenging, he says. “You’re going to have to launch to all of these nuclear reactors, and of course, they’re not going to be in exactly the same place as the [other] units,” he says. \"So, robotically, you’re going to have to connect to the electrical cables to bring power to the oxygen-producing unit.”</p><p>Then there is the solid oxide electrolysis units, which Hoffman points out are carefully machined systems. Fortunately, the company that makes them, <a href=\"https://oxeonenergy.com/solutions/solid-oxide-electrolysis-cells\" rel=\"noopener noreferrer\" target=\"_blank\"><u>OxEon</u></a>, has already designed, built, and tested a full-scale unit, a hundred times bigger than the one on MOXIE. “Several of those units would be required to produce oxygen at the quantities that we need,” Hoffman says. </p><p>He also adds that at present, there is no redundancy built into MOXIE. If any part fails, the whole system dies. “If you’re counting on a system to produce oxygen for rocket propellant and for breathing, you need very high reliability, which means you’re going to need quite a few redundant units.”</p><p>Moreover, the system has to be pretty much autonomous, Hoffman says. “It has to be able to monitor itself, run itself.” For testing purposes, every time MOXIE is powered up, there is plenty of time to plan. A full-scale MOXIE system, though, would have to run continuously, and for that it has to be able to adjust automatically to changes in the Mars atmosphere, which can vary by a factor of two over a year, and between nighttime and daytime temperature differences.</p>",
  "pubDate": "Thu, 08 Sep 2022 15:27:59 +0000",
  "guid": "https://spectrum.ieee.org/making-oxygen-on-mars",
  "category": [
    "Mars exploration",
    "Space flight",
    "Space",
    "Mars"
  ],
  "dc:creator": "Payal Dhar",
  "media:content": ""
}