{
  "title": "Episode 98: &#8220;I&#8217;ve Just Fallen For Someone&#8221; by Adam Faith",
  "link": "https://500songs.com/podcast/episode-98-ive-just-fallen-for-someone-by-adam-faith/",
  "pubDate": "Tue, 15 Sep 2020 19:04:10 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-98-ive-just-fallen-for-someone-by-adam-faith/",
  "description": "Episode ninety-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I've Just Fallen For Someone\" by Adam Faith, and is our final look at the pre-Beatles British pop scene. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/41644637\">on \"San Francisco Bay Blues\" by Jesse Fuller.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-97-song-to-woody/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/3kxIwsH\">This double-CD set </a>contains all Adam Faith's early recordings.\n\n<a href=\"https://amzn.to/3kqT1Op\">And&nbsp;<em>Big Time: The Life of Adam Faith</em> by David and Caroline Stafford</a> is a delightfully-written, extremely quotable, and by all accounts accurate biography of Faith.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Errata</strong>\n\nI repeatedly mispronounce Faith's birth surname as “Nelham”. It was “Nelhams”, with an “s”.\n\nI also say that \"Milk From the Coconut\" by Johnny Gentle made the top thirty. It didn't -- I got this from an unreliable source.\n\n<strong>Transcript</strong>\n\nToday we're going to take our last look at the pre-Beatles British pop world, and we're going to look at a record that's far more important in retrospect than it seemed at the time. We're going to look at Adam Faith, and a track he recorded called \"I've Just Fallen For Someone\":\n\n[Excerpt: Adam Faith, \"I've Just Fallen For Someone\"]\n\nAs is normal for British rock and roll stars of the fifties, Adam Faith was a pseudonym, in this case for someone whose birth name is the subject of some debate -- the registrar seems to have got a bit confused -- but who was known as Terry Nelhams, a five-foot-five singer with high cheekbones, a strong chin, and a weak voice.\n\nThe crucial change in Nelhams' life had come at the cinema, when he had watched a film called Rebel Without A Cause, starring James Dean. Amazingly, I think we managed to get through the whole 1950s without mentioning Dean, but he was a massive figure in youth pop culture of the fifties, and his presence still resonated for decades afterwards. Dean only starred in three films, and only one, East of Eden, was released in his lifetime -- he died in a car crash while the other two were in post-production -- but his performance in the posthumously-released Rebel Without A Cause seemed to many teenagers of the time to encapsulate everything that they wanted to be.\n\nAnd Terry Nelhams decided he wanted to be James Dean -- why not? He bore a slight resemblance to him. Terry was going to go into showbiz.\n\nThere was a problem, though -- in the Britain of the fifties, acting was something that was largely the purview of the middle classes, and Terry was firmly working class. He lived on a council estate and went to a secondary modern -- the schools which, in the fifties UK education system, were designed for people who were considered unlikely to succeed academically. There was no way he was going to end up studying at RADA or any of the other ways one got into acting.\n\nSo he decided that rather than become a film star, he would become a director. That was much easier to get into than acting was, in the British film industry of the fifties -- you got a job as a tea boy at a film studio, worked your way up into the editing suite, became an editor, and then became a director. There was a steady career path, and you had job security at every stage -- and Terry Nelhams was someone who always looked after his money. So that's what he did -- he got a job at the Rank organisation as a messenger, then moved across to a company that made commercials for the new commercial TV network ITV, where he was an assistant editor.\n\nBut while he was working at Rank, Nelhams had joined a skiffle group, the Worried Men -- named after the skiffle standard -- who had been formed by some of the younger employees. They became the resident band at the 2is when the Vipers Skiffle Group went out on tour. Despite all the stories about other people who had been discovered at the 2is on their first gig, the Worried Men ended up performing there for months before any kind of success. But then they did get a certain amount of fame, when Six-Five Special did its single most famous episode -- a live outside broadcast from the 2is itself. As the house band, the Worried Men got to perform a few songs on that show, and they also got a couple of tracks on two Decca compilations, \"Rockin' at the 2is\" and \"Stars of the Six-Five Special\":\n\n[Excerpt: The Worried Men, \"This Little Light\"]\n\nBut neither album sold particularly well, and the Worried Men slowly drifted apart -- one member joined the Vipers, and Nelhams left before the group got in a couple of people we've already seen a few times in our story -- both Tony Meehan, who would go on to join the Shadows, and Brian Bennett, who ended up replacing him, passed through the group.\n\nBut while Nelhams had quit the Worried Men -- as much as anything else because holding down a day job while he also played for four hours at the 2is every night was starting to affect his health -- Jack Good remembered him from that one Six-Five Special appearance, and thought that his looks, if not his singing ability, gave him the potential to be a star.\n\nGood changed Nelhams' name to Adam Faith, and gave him a solo spot on Six-Five Special, as well as getting him a contract with HMV, one of several record labels owned by the large conglomerate EMI. His first single on HMV was \"(Got A) Heartsick Feeling\", backed by Geoff Love and his Orchestra:\n\n[Excerpt: Adam Faith, \"(Got A) Heartsick Feeling\"]\n\nThat record was, of course, publicised on Six-Five Special, but the extent to which Faith's star potential was based on his looks rather than his singing ability can probably be seen from the fact that after his first appearance on the show he mimed rather than sing live, unlike all the other performers. The record was not a success, and nor was his second single, a cover of Jerry Lee Lewis' \"High School Confidential\":\n\n[Excerpt: Adam Faith, \"High School Confidential\"]\n\nFaith was unpopular, but he was able to give up his day job in the editing room to go on tour with a package based on Six-Five Special, at the bottom of the bill. And on that tour he became friendly with one of the other acts, John Barry, the trumpet playing leader of a group called the John Barry Seven. Barry had wanted to be an arranger for big bands, but when he realised that was no longer a viable career path, he'd formed his small group, who at the time were making records like \"Zip Zip\", which were fairly awful early British rock and roll efforts, but with slightly more interesting instrumental arrangements than the bulk of the work being put out in the UK at that point:\n\n[Excerpt: The John Barry Seven, \"Zip Zip\"]\n\nWhen Jack Good moved over to ITV to do Oh Boy!, he took Faith with him, but Faith's career was stagnating, and he quit performing altogether, and got another job as an assistant editor at Elstree studios, working on ATV shows like William Tell and The Invisible Man. But then Faith got a call from John Barry. The BBC were putting together a new show, Drumbeat, to compete with Oh Boy!, and they wanted their own star to compete with Cliff Richard and Marty Wilde. Would Adam be interested?\n\nHe would -- though he was cautious enough after last time that he kept his day job. He'd bunk off work on Thursday and Friday afternoons to rehearse and record the show, and make the time up on Sundays. His workmates covered for him when he bunked off, and that worked until his boss' daughter mentioned to the boss that she'd seen Terry on the telly. He was told he had to choose between his pop career and a secure job, and he decided to make his pop career into a secure job, by getting a guaranteed six-month contract on Drumbeat before quitting Elstree.\n\nDrumbeat did little to make Faith's records sell any more, but it did lead to acting appearances -- as a biker in the police show No Hiding Place, and as a musician in a cheap exploitation film that was originally titled \"Striptease Girl\", before the censors made the film producers cut the nudity out (except for foreign markets) at which point it was retitled Beat Girl in the UK, and Wild For Kicks in the US. It was hardly Rebel Without a Cause, but it was definitely a step in the right direction.\n\nThe music for that film was done by Adam's friend John Barry -- the very first film score Barry ever did:\n\n[Excerpt: The John Barry Seven, \"Beat Girl\"]\n\nBut Adam Faith was still a pop star without a hit, and that was a situation that couldn't last. He was also temporarily without a record contract, but his new manager Eve Taylor managed to get him one with Parlophone, another EMI-owned label. And then his Drumbeat contacts came through in a big way.\n\nOne of the other acts who regularly appeared on the show was a group called the Raindrops, who featured a singer who had been born Yannis Skoradalides, but whose name had soon been anglicised to John Worsley. He'd then taken on the stage name Johnny Worth, which was the name he performed under, but he was also starting to write songs -- and because he was under contract as a recording artist, he took on yet another name as a songwriter to avoid any legal complications, so he was writing as Les Vandyke.\n\nIt was under that name that he wrote a song called \"What Do You Want?\", which he played to Faith and Barry, his two colleagues on Drumbeat. They saw potential in it -- a lot of potential. And John Barry had an idea for an instrumental gimmick.\n\nWe're now into 1959, and Buddy Holly's \"It Doesn't Matter Any More\" had just been a big posthumous hit for him:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nThe pizzicato strings, in particular, had caught the ear of a lot of people, and Barry had already used them in the arrangement he'd written for \"Be Mine\", a record by the minor British pop star Lance Fortune:\n\n[Excerpt: Lance Fortune, \"Be Mine\"]\n\nThat hadn't been released yet – it went top five when it eventually was – and Barry thought that it was worth repeating the trick, and so he came up with a pizzicato arrangement for the song Vandyke had written. And for a final touch, Faith received some vocal coaching from another Drumbeat performer, Roy Young, who taught him how to mangle his vowels so that he could sing in what was, to British ears, almost a convincing imitation of Buddy Holly's hiccupping vocal, particularly on the word \"baby\".\n\nThe result was a huge hit, becoming the first number one single ever on the Parlophone label:\n\n[Excerpt: Adam Faith, \"What Do You Want?\"]\n\nFaith was now a real pop star at last. \"What Do You Want?\" was also one of the very rare British records to actually get an American cover version -- Bobby Vee, the Buddy Holly soundalike, picked up on the record and issued his own version of it:\n\n[Excerpt: Bobby Vee, \"What Do You Want?\"]\n\nThat wasn't a success, but as Vee became a star he would occasionally record versions of other songs Faith recorded.\n\nFaith's second Parlophone single was another number one, and another song written by Les Vandyke and arranged by John Barry. It was very much \"What Do You Want?\" part two, but there was an interesting musical figure Barry came up with in the intro:\n\n[Excerpt: Adam Faith, \"Poor Me\"]\n\nIn the 1990s, Barry used that as evidence in a court case over his claim to authorship of the piece of music with which he is most associated, a piece arranged and performed by Barry, but whose credited writer is Monty Norman. Compare and contrast \"Poor Me\":\n\n[Excerpt: Adam Faith, \"Poor Me\"]\n\nAnd the James Bond theme:\n\n[Excerpt: John Barry, \"James Bond Theme\"]\n\nFor the next couple of years, Faith had a string of hits, mostly written by Vandyke and arranged by Barry, though no more number ones. By most metrics -- in hits, record sales, and fan appeal -- he was the second-biggest British pop star of the early sixties, after Cliff Richard.\n\nHe also became well known as a media personality, thanks in large part to his appearance on the interview show Face to Face. This was a TV programme that ran from 1959 through 1962 -- almost the precise same length as Faith's pop career -- and which had interviewer John Freeman sat with his back to the camera, while the studio was largely in darkness other than the face of the person he was interviewing. Freeman's questions seem in the modern media landscape to be remarkably gentle, but in the early sixties he was regarded as the most incisive and probing interviewer in the British media. He reduced at least one subject, Gilbert Harding, to tears, and his questioning of Tony Hancock is popularly supposed to have started Hancock into the spiral of questioning, self-doubt, and depression that led first to his career crashing and burning and eventually to his suicide.\n\nMost of the guests that Freeman had on the show were serious, important, highbrow people. The thirty-five episodes of the show included interviews with Bertrand Russell, Carl Jung, Adlai Stevenson, Henry Moore, Martin Luther King and Jomo Kenyatta. But occasionally there would be someone invited on from the world of sport or entertainment, and Faith was invited on to the show as a representative of youth culture and pop music.\n\nThe questions asked on the show were clearly designed to make Faith -- a twenty-year-old pop singer who went to a secondary modern and still lived on a council estate even now he'd hit the big time -- seem a laughing stock, and to poke holes in his image. Everyone involved seems to have been surprised when he came across as a well-read, cultured, if rather mercenary, young man who could string three words together:\n\n[Excerpt: Adam Faith, \"Face to Face\", interview questions about classical music and literature]\n\nAs a result of that appearance, Faith was increasingly asked on to TV shows to be \"the voice of the youth\", particularly as he was the first pop star to admit to things like having sex before marriage. He debated with the Archbishop of York about religion on national TV, in a debate chaired by Ludovic Kennedy, and Faith was largely viewed as having come out better than the bishop.\n\nHe also took at least one brave political stand in 1964. He had been booked to tour in South Africa, and agreed to do so only under the condition that he would perform only to integrated audiences. But when he got on stage for one show, he saw the police dragging two young girls out of an otherwise all-white audience, because they weren't white. He walked off stage, and refused to do the rest of the tour. The promoter demanded compensation, and Faith refused, saying he'd made clear that he was only going to play to integrated audiences. He tried to leave the country, booking plane tickets under his birth name to escape suspicion, but was dragged off the plane at gunpoint by South African police. Eventually the intervention of the chairman of EMI, the British Foreign Secretary, the general secretary of Equity, the actor's union, and several brave journalists who said that if Faith was imprisoned they would go to prison with him, meant that Faith was allowed to leave the country, though EMI paid the promoter's compensation and took it out of Faith's future royalties.\n\nNot that there were many royalties by that point. In early 1963, John Barry had stopped working with Faith to concentrate on his film music -- he'd just started working on the Bond films that would make his name -- and the hits dried up then, especially when musical styles suddenly changed in the middle of that year.\n\nBut Faith had managed to parlay his looks into an acting career by that point, and over the next decade he appeared in several films, starred in the TV series Budgie, and toured in repertory theatre. He also became a manager and producer, managing Leo Sayer and producing Roger Daltrey's solo recordings.\n\nHe would occasionally make the odd record himself, up to the nineties, with his final single being a duet with Daltrey on a cover version of \"Stuck in the Middle With You\":\n\n[Excerpt: Adam Faith and Roger Daltrey, \"Stuck in the Middle With You\"]\n\nBut as someone who looked after his money, Faith had been far more canny than most of his fellow pop stars, and for much of his life he was a very wealthy man. While he continued performing, his main role in the eighties and nineties was as a financial journalist and investment advisor, writing columns on finance for the Daily Mail. He presented the BBC business show Working Lunch, the Channel 4 money show Dosh, and eventually started his own TV channel devoted to business, The Money Channel. Unfortunately for him, the Money Channel went down in the stock market crashes of the early 2000s, and Faith went bankrupt in 2002. He died in 2003, aged sixty-two.\n\nBut you'll notice we haven't yet mentioned the song that this episode is about. That's because that song, \"I've Just Fallen For Someone\", was completely unimportant in Adam Faith's life. It was just a bit of album filler on his second album. But though Faith didn't know it, it was an important song in rock music history:\n\n[Excerpt: Adam Faith, \"I've Just Fallen For Someone\"]\n\nLike Faith's hits, that was written by another performer, one who like Les Vandyke had a variety of different names. John Askew was one of Larry Parnes' stable of acts, and far from the most successful of them. He performed under the name Johnny Gentle, and didn't have a great deal of success. Askew's first single, \"Wendy\", was unsuccessful, but it was unusual among British singles of the period in that it was written by Askew himself:\n\n[Excerpt: Johnny Gentle, \"Wendy\"]\n\nHis second, though, made the top thirty:\n\n[Excerpt: Johnny Gentle, \"Milk From the Coconut\"]\n\nThat would be the most success Johnny Gentle ever had, and his live shows were made up entirely of cover versions of other people's records -- when he toured Scotland in 1960, for example, his setlist consisted of two Buddy Holly songs, and one each by Elvis, Ricky Nelson, Clarence \"Frogman\" Henry, Eddie Cochran, and Jim Reeves.\n\nBut he was still writing songs on that tour, and he was working on one in a hotel in Inverness – one that clearly referenced “What Do You Want?” with its girl who doesn't want ermine and pearls – when he got stuck for a middle eight for the song, and mentioned it to the rhythm guitarist in his backing band. The guitarist came up with a new middle eight -- referencing a line from a favourite song of his, \"Money\" by Barrett Strong. Askew took that new middle eight, though didn't give the guitarist any songwriting credit -- Askew was an established songwriter, after all. He gave the song to Faith, who recorded it in late 1961, and released it in 1962:\n\n[Excerpt: Adam Faith, \"I've Just Fallen for Someone\"]\n\nThat was on his second album, Adam Faith (his first album had been called Adam), and on an EP taken from the album. But Askew thought it had more potential, and he recorded his own version, as Darren Young -- by this point he'd decided that his old stage name was bringing him bad luck:\n\n[Excerpt: Darren Young, \"I've Just Fallen for Someone\"]\n\nThat version wasn't successful either, and the song remained completely obscure until the mid-1990s. It was at that point that Askew started telling the story of how the song had been written. And suddenly the song was of a lot more interest, at least to some people, because that rhythm guitarist who wrote that middle eight was John Lennon, and Gentle's backing band on that tour was the Beatles. We've just heard the story of the first ever commercial recording of a John Lennon song. And we'll pick up on that next week...",
  "itunes:subtitle": "Episode ninety-eight of A History of Rock Music in Five Hundred Songs looks at Ive Just Fallen For Someone by Adam Faith, and is our final look at the pre-Beatles British pop scene. Click the full post to read liner notes, links to more information, and ",
  "itunes:keywords": "2is,Adam Faith,Jack Good,James Bond,John Barry,John Lennon,Johnny Gentle,Larry Parnes,Roger Daltrey,Six-Five Special,skiffle,South Africa,The Beatles,The Shadows,The Vipers Skiffle Group",
  "itunes:episodeType": "full",
  "itunes:episode": 98,
  "content:encoded": "Episode ninety-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I've Just Fallen For Someone\" by Adam Faith, and is our final look at the pre-Beatles British pop scene. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/41644637\">on \"San Francisco Bay Blues\" by Jesse Fuller.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-97-song-to-woody/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/3kxIwsH\">This double-CD set </a>contains all Adam Faith's early recordings.\n\n<a href=\"https://amzn.to/3kqT1Op\">And&nbsp;<em>Big Time: The Life of Adam Faith</em> by David and Caroline Stafford</a> is a delightfully-written, extremely quotable, and by all accounts accurate biography of Faith.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Errata</strong>\n\nI repeatedly mispronounce Faith's birth surname as “Nelham”. It was “Nelhams”, with an “s”.\n\nI also say that \"Milk From the Coconut\" by Johnny Gentle made the top thirty. It didn't -- I got this from an unreliable source.\n\n<strong>Transcript</strong>\n\nToday we're going to take our last look at the pre-Beatles British pop world, and we're going to look at a record that's far more important in retrospect than it seemed at the time. We're going to look at Adam Faith, and a track he recorded called \"I've Just Fallen For Someone\":\n\n[Excerpt: Adam Faith, \"I've Just Fallen For Someone\"]\n\nAs is normal for British rock and roll stars of the fifties, Adam Faith was a pseudonym, in this case for someone whose birth name is the subject of some debate -- the registrar seems to have got a bit confused -- but who was known as Terry Nelhams, a five-foot-five singer with high cheekbones, a strong chin, and a weak voice.\n\nThe crucial change in Nelhams' life had come at the cinema, when he had watched a film called Rebel Without A Cause, starring James Dean. Amazingly, I think we managed to get through the whole 1950s without mentioning Dean, but he was a massive figure in youth pop culture of the fifties, and his presence still resonated for decades afterwards. Dean only starred in three films, and only one, East of Eden, was released in his lifetime -- he died in a car crash while the other two were in post-production -- but his performance in the posthumously-released Rebel Without A Cause seemed to many teenagers of the time to encapsulate everything that they wanted to be.\n\nAnd Terry Nelhams decided he wanted to be James Dean -- why not? He bore a slight resemblance to him. Terry was going to go into showbiz.\n\nThere was a problem, though -- in the Britain of the fifties, acting was something that was largely the purview of the middle classes, and Terry was firmly working class. He lived on a council estate and went to a secondary modern -- the schools which, in the fifties UK education system, were designed for people who were considered unlikely to succeed academically. There was no way he was going to end up studying at RADA or any of the other ways one got into acting.\n\nSo he decided that rather than become a film star, he would become a director. That was much easier to get into than acting was, in the British film industry of the fifties -- you got a job as a tea boy at a film studio, worked your way up into the editing suite, became an editor, and then became a director. There was a steady career path, and you had job security at every stage -- and Terry Nelhams was someone who always looked after his money. So that's what he did -- he got a job at the Rank organisation as a messenger, then moved across to a company that made commercials for the new commercial TV network ITV, where he was an assistant editor.\n\nBut while he was working at Rank, Nelhams had joined a skiffle group, the Worried Men -- named after the skiffle standard -- who had been formed by some of the younger employees. They became the resident band at the 2is when the Vipers Skiffle Group went out on tour. Despite all the stories about other people who had been discovered at the 2is on their first gig, the Worried Men ended up performing there for months before any kind of success. But then they did get a certain amount of fame, when Six-Five Special did its single most famous episode -- a live outside broadcast from the 2is itself. As the house band, the Worried Men got to perform a few songs on that show, and they also got a couple of tracks on two Decca compilations, \"Rockin' at the 2is\" and \"Stars of the Six-Five Special\":\n\n[Excerpt: The Worried Men, \"This Little Light\"]\n\nBut neither album sold particularly well, and the Worried Men slowly drifted apart -- one member joined the Vipers, and Nelhams left before the group got in a couple of people we've already seen a few times in our story -- both Tony Meehan, who would go on to join the Shadows, and Brian Bennett, who ended up replacing him, passed through the group.\n\nBut while Nelhams had quit the Worried Men -- as much as anything else because holding down a day job while he also played for four hours at the 2is every night was starting to affect his health -- Jack Good remembered him from that one Six-Five Special appearance, and thought that his looks, if not his singing ability, gave him the potential to be a star.\n\nGood changed Nelhams' name to Adam Faith, and gave him a solo spot on Six-Five Special, as well as getting him a contract with HMV, one of several record labels owned by the large conglomerate EMI. His first single on HMV was \"(Got A) Heartsick Feeling\", backed by Geoff Love and his Orchestra:\n\n[Excerpt: Adam Faith, \"(Got A) Heartsick Feeling\"]\n\nThat record was, of course, publicised on Six-Five Special, but the extent to which Faith's star potential was based on his looks rather than his singing ability can probably be seen from the fact that after his first appearance on the show he mimed rather than sing live, unlike all the other performers. The record was not a success, and nor was his second single, a cover of Jerry Lee Lewis' \"High School Confidential\":\n\n[Excerpt: Adam Faith, \"High School Confidential\"]\n\nFaith was unpopular, but he was able to give up his day job in the editing room to go on tour with a package based on Six-Five Special, at the bottom of the bill. And on that tour he became friendly with one of the other acts, John Barry, the trumpet playing leader of a group called the John Barry Seven. Barry had wanted to be an arranger for big bands, but when he realised that was no longer a viable career path, he'd formed his small group, who at the time were making records like \"Zip Zip\", which were fairly awful early British rock and roll efforts, but with slightly more interesting instrumental arrangements than the bulk of the work being put out in the UK at that point:\n\n[Excerpt: The John Barry Seven, \"Zip Zip\"]\n\nWhen Jack Good moved over to ITV to do Oh Boy!, he took Faith with him, but Faith's career was stagnating, and he quit performing altogether, and got another job as an assistant editor at Elstree studios, working on ATV shows like William Tell and The Invisible Man. But then Faith got a call from John Barry. The BBC were putting together a new show, Drumbeat, to compete with Oh Boy!, and they wanted their own star to compete with Cliff Richard and Marty Wilde. Would Adam be interested?\n\nHe would -- though he was cautious enough after last time that he kept his day job. He'd bunk off work on Thursday and Friday afternoons to rehearse and record the show, and make the time up on Sundays. His workmates covered for him when he bunked off, and that worked until his boss' daughter mentioned to the boss that she'd seen Terry on the telly. He was told he had to choose between his pop career and a secure job, and he decided to make his pop career into a secure job, by getting a guaranteed six-month contract on Drumbeat before quitting Elstree.\n\nDrumbeat did little to make Faith's records sell any more, but it did lead to acting appearances -- as a biker in the police show No Hiding Place, and as a musician in a cheap exploitation film that was originally titled \"Striptease Girl\", before the censors made the film producers cut the nudity out (except for foreign markets) at which point it was retitled Beat Girl in the UK, and Wild For Kicks in the US. It was hardly Rebel Without a Cause, but it was definitely a step in the right direction.\n\nThe music for that film was done by Adam's friend John Barry -- the very first film score Barry ever did:\n\n[Excerpt: The John Barry Seven, \"Beat Girl\"]\n\nBut Adam Faith was still a pop star without a hit, and that was a situation that couldn't last. He was also temporarily without a record contract, but his new manager Eve Taylor managed to get him one with Parlophone, another EMI-owned label. And then his Drumbeat contacts came through in a big way.\n\nOne of the other acts who regularly appeared on the show was a group called the Raindrops, who featured a singer who had been born Yannis Skoradalides, but whose name had soon been anglicised to John Worsley. He'd then taken on the stage name Johnny Worth, which was the name he performed under, but he was also starting to write songs -- and because he was under contract as a recording artist, he took on yet another name as a songwriter to avoid any legal complications, so he was writing as Les Vandyke.\n\nIt was under that name that he wrote a song called \"What Do You Want?\", which he played to Faith and Barry, his two colleagues on Drumbeat. They saw potential in it -- a lot of potential. And John Barry had an idea for an instrumental gimmick.\n\nWe're now into 1959, and Buddy Holly's \"It Doesn't Matter Any More\" had just been a big posthumous hit for him:\n\n[Excerpt: Buddy Holly, \"It Doesn't Matter Any More\"]\n\nThe pizzicato strings, in particular, had caught the ear of a lot of people, and Barry had already used them in the arrangement he'd written for \"Be Mine\", a record by the minor British pop star Lance Fortune:\n\n[Excerpt: Lance Fortune, \"Be Mine\"]\n\nThat hadn't been released yet – it went top five when it eventually was – and Barry thought that it was worth repeating the trick, and so he came up with a pizzicato arrangement for the song Vandyke had written. And for a final touch, Faith received some vocal coaching from another Drumbeat performer, Roy Young, who taught him how to mangle his vowels so that he could sing in what was, to British ears, almost a convincing imitation of Buddy Holly's hiccupping vocal, particularly on the word \"baby\".\n\nThe result was a huge hit, becoming the first number one single ever on the Parlophone label:\n\n[Excerpt: Adam Faith, \"What Do You Want?\"]\n\nFaith was now a real pop star at last. \"What Do You Want?\" was also one of the very rare British records to actually get an American cover version -- Bobby Vee, the Buddy Holly soundalike, picked up on the record and issued his own version of it:\n\n[Excerpt: Bobby Vee, \"What Do You Want?\"]\n\nThat wasn't a success, but as Vee became a star he would occasionally record versions of other songs Faith recorded.\n\nFaith's second Parlophone single was another number one, and another song written by Les Vandyke and arranged by John Barry. It was very much \"What Do You Want?\" part two, but there was an interesting musical figure Barry came up with in the intro:\n\n[Excerpt: Adam Faith, \"Poor Me\"]\n\nIn the 1990s, Barry used that as evidence in a court case over his claim to authorship of the piece of music with which he is most associated, a piece arranged and performed by Barry, but whose credited writer is Monty Norman. Compare and contrast \"Poor Me\":\n\n[Excerpt: Adam Faith, \"Poor Me\"]\n\nAnd the James Bond theme:\n\n[Excerpt: John Barry, \"James Bond Theme\"]\n\nFor the next couple of years, Faith had a string of hits, mostly written by Vandyke and arranged by Barry, though no more number ones. By most metrics -- in hits, record sales, and fan appeal -- he was the second-biggest British pop star of the early sixties, after Cliff Richard.\n\nHe also became well known as a media personality, thanks in large part to his appearance on the interview show Face to Face. This was a TV programme that ran from 1959 through 1962 -- almost the precise same length as Faith's pop career -- and which had interviewer John Freeman sat with his back to the camera, while the studio was largely in darkness other than the face of the person he was interviewing. Freeman's questions seem in the modern media landscape to be remarkably gentle, but in the early sixties he was regarded as the most incisive and probing interviewer in the British media. He reduced at least one subject, Gilbert Harding, to tears, and his questioning of Tony Hancock is popularly supposed to have started Hancock into the spiral of questioning, self-doubt, and depression that led first to his career crashing and burning and eventually to his suicide.\n\nMost of the guests that Freeman had on the show were serious, important, highbrow people. The thirty-five episodes of the show included interviews with Bertrand Russell, Carl Jung, Adlai Stevenson, Henry Moore, Martin Luther King and Jomo Kenyatta. But occasionally there would be someone invited on from the world of sport or entertainment, and Faith was invited on to the show as a representative of youth culture and pop music.\n\nThe questions asked on the show were clearly designed to make Faith -- a twenty-year-old pop singer who went to a secondary modern and still lived on a council estate even now he'd hit the big time -- seem a laughing stock, and to poke holes in his image. Everyone involved seems to have been surprised when he came across as a well-read, cultured, if rather mercenary, young man who could string three words together:\n\n[Excerpt: Adam Faith, \"Face to Face\", interview questions about classical music and literature]\n\nAs a result of that appearance, Faith was increasingly asked on to TV shows to be \"the voice of the youth\", particularly as he was the first pop star to admit to things like having sex before marriage. He debated with the Archbishop of York about religion on national TV, in a debate chaired by Ludovic Kennedy, and Faith was largely viewed as having come out better than the bishop.\n\nHe also took at least one brave political stand in 1964. He had been booked to tour in South Africa, and agreed to do so only under the condition that he would perform only to integrated audiences. But when he got on stage for one show, he saw the police dragging two young girls out of an otherwise all-white audience, because they weren't white. He walked off stage, and refused to do the rest of the tour. The promoter demanded compensation, and Faith refused, saying he'd made clear that he was only going to play to integrated audiences. He tried to leave the country, booking plane tickets under his birth name to escape suspicion, but was dragged off the plane at gunpoint by South African police. Eventually the intervention of the chairman of EMI, the British Foreign Secretary, the general secretary of Equity, the actor's union, and several brave journalists who said that if Faith was imprisoned they would go to prison with him, meant that Faith was allowed to leave the country, though EMI paid the promoter's compensation and took it out of Faith's future royalties.\n\nNot that there were many royalties by that point. In early 1963, John Barry had stopped working with Faith to concentrate on his film music -- he'd just started working on the Bond films that would make his name -- and the hits dried up then, especially when musical styles suddenly changed in the middle of that year.\n\nBut Faith had managed to parlay his looks into an acting career by that point, and over the next decade he appeared in several films, starred in the TV series Budgie, and toured in repertory theatre. He also became a manager and producer, managing Leo Sayer and producing Roger Daltrey's solo recordings.\n\nHe would occasionally make the odd record himself, up to the nineties, with his final single being a duet with Daltrey on a cover version of \"Stuck in the Middle With You\":\n\n[Excerpt: Adam Faith and Roger Daltrey, \"Stuck in the Middle With You\"]\n\nBut as someone who looked after his money, Faith had been far more canny than most of his fellow pop stars, and for much of his life he was a very wealthy man. While he continued performing, his main role in the eighties and nineties was as a financial journalist and investment advisor, writing columns on finance for the Daily Mail. He presented the BBC business show Working Lunch, the Channel 4 money show Dosh, and eventually started his own TV channel devoted to business, The Money Channel. Unfortunately for him, the Money Channel went down in the stock market crashes of the early 2000s, and Faith went bankrupt in 2002. He died in 2003, aged sixty-two.\n\nBut you'll notice we haven't yet mentioned the song that this episode is about. That's because that song, \"I've Just Fallen For Someone\", was completely unimportant in Adam Faith's life. It was just a bit of album filler on his second album. But though Faith didn't know it, it was an important song in rock music history:\n\n[Excerpt: Adam Faith, \"I've Just Fallen For Someone\"]\n\nLike Faith's hits, that was written by another performer, one who like Les Vandyke had a variety of different names. John Askew was one of Larry Parnes' stable of acts, and far from the most successful of them. He performed under the name Johnny Gentle, and didn't have a great deal of success. Askew's first single, \"Wendy\", was unsuccessful, but it was unusual among British singles of the period in that it was written by Askew himself:\n\n[Excerpt: Johnny Gentle, \"Wendy\"]\n\nHis second, though, made the top thirty:\n\n[Excerpt: Johnny Gentle, \"Milk From the Coconut\"]\n\nThat would be the most success Johnny Gentle ever had, and his live shows were made up entirely of cover versions of other people's records -- when he toured Scotland in 1960, for example, his setlist consisted of two Buddy Holly songs, and one each by Elvis, Ricky Nelson, Clarence \"Frogman\" Henry, Eddie Cochran, and Jim Reeves.\n\nBut he was still writing songs on that tour, and he was working on one in a hotel in Inverness – one that clearly referenced “What Do You Want?” with its girl who doesn't want ermine and pearls – when he got stuck for a middle eight for the song, and mentioned it to the rhythm guitarist in his backing band. The guitarist came up with a new middle eight -- referencing a line from a favourite song of his, \"Money\" by Barrett Strong. Askew took that new middle eight, though didn't give the guitarist any songwriting credit -- Askew was an established songwriter, after all. He gave the song to Faith, who recorded it in late 1961, and released it in 1962:\n\n[Excerpt: Adam Faith, \"I've Just Fallen for Someone\"]\n\nThat was on his second album, Adam Faith (his first album had been called Adam), and on an EP taken from the album. But Askew thought it had more potential, and he recorded his own version, as Darren Young -- by this point he'd decided that his old stage name was bringing him bad luck:\n\n[Excerpt: Darren Young, \"I've Just Fallen for Someone\"]\n\nThat version wasn't successful either, and the song remained completely obscure until the mid-1990s. It was at that point that Askew started telling the story of how the song had been written. And suddenly the song was of a lot more interest, at least to some people, because that rhythm guitarist who wrote that middle eight was John Lennon, and Gentle's backing band on that tour was the Beatles. We've just heard the story of the first ever commercial recording of a John Lennon song. And we'll pick up on that next week...",
  "enclosure": "",
  "itunes:summary": "Episode ninety-eight of A History of Rock Music in Five Hundred Songs looks at \"I've Just Fallen For Someone\" by Adam Faith, and is our final look at the pre-Beatles British pop scene. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"San Francisco Bay Blues\" by Jesse Fuller.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThis double-CD set contains all Adam Faith's early recordings.\n\nAnd&nbsp;Big Time: The Life of Adam Faith by David and Caroline Stafford is a delightfully-written, extremely quotable, and by all accounts accurate biography of Faith.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nErrata\n\nI repeatedly mispronounce Faith's birth surname as “Nelham”. It was “Nelhams”, with an “s”.\n\nI also say that \"Milk From the Coconut\" by Johnny Gentle made the top thirty. It didn't -- I got this from an unreliable source.\n\nTranscript\n\nToday we're going to take our last look at the pre-Beatles British pop world, and we're going to look at a record that's far more important in retrospect than it seemed at the time. We're going to look at Adam Faith, and a track he recorded called \"I've Just Fallen For Someone\":\n\n[Excerpt: Adam Faith, \"I've Just Fallen For Someone\"]\n\nAs is normal for British rock and roll stars of the fifties, Adam Faith was a pseudonym, in this case for someone whose birth name is the subject of some debate -- the registrar seems to have got a bit confused -- but who was known as Terry Nelhams, a five-foot-five singer with high cheekbones, a strong chin, and a weak voice.\n\nThe crucial change in Nelhams' life had come at the cinema, when he had watched a film called Rebel Without A Cause, starring James Dean. Amazingly, I think we managed to get through the whole 1950s without mentioning Dean, but he was a massive figure in youth pop culture of the fifties, and his presence still resonated for decades afterwards. Dean only starred in three films, and only one, East of Eden, was released in his lifetime -- he died in a car crash while the other two were in post-production -- but his performance in the posthumously-released Rebel Without A Cause seemed to many teenagers of the time to encapsulate everything that they wanted to be.\n\nAnd Terry Nelhams decided he wanted to be James Dean -- why not? He bore a slight resemblance to him. Terry was going to go into showbiz.\n\nThere was a problem, though -- in the Britain of the fifties, acting was something that was largely the purview of the middle classes, and Terry was firmly working class. He lived on a council estate and went to a secondary modern -- the schools which, in the fifties UK education system, were designed for people who were considered unlikely to succeed academically. There was no way he was going to end up studying at RADA or any of the other ways one got into acting.\n\nSo he decided that rather than become a film star, he would become a director. That was much easier to get into than acting was, in the British film industry of the fifties -- you got a job as a tea boy at a film studio, worked your way up into the editing suite, became an editor, and then became a director. There was a steady career path, and you had job security at every stage -- and Terry Nelhams was someone who always looked after his money. So that's what he did -- he got a job at the Rank organisation as a messenger, then moved across to a company that made commercials for the new commercial TV network ITV, where he was an assistant editor.\n\nBut while he was working at Rank, Nelhams had joined a",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-eight of A History of Rock Music in Five Hundred Songs looks at \"I've Just Fallen For Someone\" by Adam Faith, and is our final look at the pre-Beatles British pop scene. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"San Francisco Bay Blues\" by Jesse Fuller.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThis double-CD set contains all Adam Faith's early recordings.\n\nAnd&nbsp;Big Time: The Life of Adam Faith by David and Caroline Stafford is a delightfully-written, extremely quotable, and by all accounts accurate biography of Faith.\n\nPatreon\n",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}