{
  "title": "The Legend of Zelda: Tears of the Kingdom release date, trailers, gameplay, and more",
  "link": "https://www.digitaltrends.com/gaming/breath-of-the-wild-2-release-date-trailer-story-news/",
  "pubDate": "Fri, 04 Nov 2022 17:00:37 +0000",
  "dc:creator": "Jon Bitner",
  "category": [
    "Gaming",
    "News",
    "Breath of the wild 2",
    "Nintendo",
    "The Legend of Zelda: Breath of the Wild",
    "The Legend of Zelda: Tears of the Kingdom",
    "upcoming games"
  ],
  "guid": "https://www.digitaltrends.com/?p=2499244",
  "description": "From playable characters and returning enemies to the release date and storyline, here is everything we know — and don't know — about Tears of the Kingdom.",
  "content:encoded": "<p>When Nintendo released the teaser trailer for <em>Breath of the Wild 2</em> several years ago, it unleashed a whirlwind of rumors and speculation about a sequel to one of the <a href=\"https://www.digitaltrends.com/gaming/best-zelda-games/\">best Zelda games</a>. As the dust started to settle, a few things were made clear &#8212; but much remained up in the air. Nintendo is notoriously scarce with information regarding first-party titles, and that holds true for this much-anticipated sequel.</p>\n<p>Thankfully, Nintendo has given us a few new glimpses into what we now know will be called <em>The Legend of Zelda: Tears of the Kingdom</em>. Eagle-eyed viewers have been able to piece together a lot of the clues seen in the announcement trailer, and the latest gameplay reveal has plenty of other hidden secrets for us to decode. Plus, we&#8217;ve heard a few things directly from the legendary game designer Eiji Aonuma, which has only added fuel to the fire.</p>\n<p>From playable characters and returning enemies to the release date and storyline, here&#8217;s everything we know &#8212; and don&#8217;t know &#8212; about <em>The Legend of Zelda: Tears of the Kingdom</em>.</p>\n<p><strong>Further reading</strong></p>\n<ul>\n<li><a href=\"https://www.digitaltrends.com/gaming/upcoming-switch-games/\">The best upcoming Nintendo Switch games</a></li>\n<li><a href=\"https://www.digitaltrends.com/gaming/things-we-want-in-legend-of-zelda-breath-of-the-wild-2/\">10 things we want in Breath of the Wild 2</a></li>\n<li><a href=\"https://www.digitaltrends.com/gaming/botw-2-shouldnt-release-switch/\">Zelda: Breath of the Wild 2 should wait for a Switch Pro</a></li>\n</ul>\n<h2>Release date</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3178118 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/09/tok.jpg?fit=720%2C720&p=1\" alt=\"Link flying through air in The Legend of Zelda: Tears of the Kingdom.\"   /></figure>\n<p><em>The Legend of Zelda: Tears of the Kingdom </em>is set to launch on May 12, 2023.</p>\n<p><em>The Legend of Zelda: Tears of the Kingdom</em> was set for a 2022 release during Nintendo&#8217;s E3 2021 keynote, but as of March 2022, series producer Eiji Aonuma announced that the game would be delayed until 2023. His statement on the matter was, &#8220;For those of you who have been looking forward to a release this year, we apologize. As previously announced, the adventure in this sequel will take place not just on the ground as in the previous game, but also in the skies above. However, the expanded world goes beyond that, and there will be an even wider variety of features you can enjoy, including new encounters and gameplay elements. In order to make this game’s experience something special, the entire development team is continuing to work diligently on this game, so please wait a while longer.”</p>\n<h2>Platforms</h2>\n<figure class=\"alignnone\"><img  class=\" wp-image-3029536 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/03/the-legend-of-zelda-breath-of-the-wild-2-link-master-sword-wood.jpg?fit=720%2C404&p=1\" alt=\"Link holds a corrupted version of the Master Sword in the sequel to The Legend of Zelda: Breath of the Wild.\"   /></figure>\n<p><em>The Legend of Zelda: Tears of the Kingdom</em> will only be available on Nintendo Switch. Nintendo isn&#8217;t keen on porting its high-performing first-party titles to other consoles, and we don&#8217;t expect that trend to change when <em>Tears </em>is eventually released.</p>\n<p>And despite the launch of the <a href=\"https://www.digitaltrends.com/gaming/nintendo-switch-oled-review/\">Switch OLED model,</a> rumors continue to swirl about<a href=\"https://www.digitaltrends.com/gaming/botw-2-shouldnt-release-switch/\"> a potential Switch Pro Console</a> &#8212; and it&#8217;ll be interesting to see if <em>The Legend of Zelda: Tears of the Kingdom</em> coincides with the launch of a &#8220;next-gen&#8221; Switch. With <em>Hyrule Warriors</em> pushing the system to its limits, there&#8217;s no doubt <em>The Legend of Zelda: Tears of the Kingdom</em> could benefit from some upgraded hardware.</p>\n<h2>Trailers</h2>\n<p>Nintendo has released three trailers for <em>The Legend of Zelda: Tears of the Kingdom</em> &#8212; a brief reveal trailer, a short gameplay trailer announced during E3, and the latest during a Nintendo Direct in 2022.</p>\n<iframe src=\"https://www.youtube.com/embed/3fr1Z07AV00\" width=\"640\" height=\"360\"></iframe>\n<p>The gameplay trailer is particularly interesting, as it shows a variety of new mechanics, including some that look to be borrowed from <em>Skyward Sword</em>.</p>\n<iframe src=\"https://www.youtube.com/embed/Pi-MRZBP91I\" width=\"640\" height=\"360\"></iframe>\n<iframe src=\"https://www.youtube.com/embed/2SNF4M_v7wc\" width=\"640\" height=\"360\"></iframe>\n<p>This latest trailer was still very brief but starts off showing some ancient carvings before revealing Link opening a massive door, rushing out onto a floating platform, and fearlessly diving off. He lands on some sort of flying device before the title is revealed. Originally, Nintendo withheld revealing the official title for <em>The Legend of Zelda: Tears of the Kingdom</em> due to it spoiling aspects of the story. This has led to tons of fan speculation and theory-crafting, such as Ganon&#8217;s corpse rising from Hyrule Castle, the return of Malice, and even connections to <em>The Legend of Zelda: Twilight Princess. </em></p>\n<p>While there&#8217;s no consensus on hard details, most agree this will be a much darker game than the first.</p>\n<h2>Gameplay</h2>\n<figure class=\"alignnone\"><img  class=\"size-large wp-image-2721152 \" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/06/breath-of-the-wild-2.jpg?fit=720%2C397&p=1\" alt=\"Link is surrounded by magic in The Legend of Zelda: Breath of the Wild 2.\"   /></figure>\n<p>While there&#8217;s a lot we don&#8217;t know about <em>The Legend of Zelda: Tears of the Kingdom</em>&#8216;s gameplay, we&#8217;re pretty confident that players will be returning to the Hyrule seen in the original <em>Breath of the Wild</em>. Eiji Aonuma said that he would love to visit the world again and introduce new gameplay concepts alongside a new story. He later went on to say that <em>The Legend of Zelda: Tears of the Kingdom</em> will indeed be a <a href=\"https://www.gameinformer.com/e3-2019/2019/06/11/breath-of-the-wilds-director-is-returning-for-the-sequel\">&#8220;continuation&#8221; of the original</a>, meaning we should expect to see more of the Hyrule we&#8217;ve come to know and love over the past few years.</p>\n<p>The latest E3 trailer confirmed much of that statement &#8212; although we now have a bunch of floating islands in the sky we&#8217;ll be able to explore. It&#8217;s unclear if these locations will be easily accessible while roaming around on the ground or if they&#8217;ll be set in a completely different timeline &#8212; similar to the young and adult Link variants seen in <em>Ocarina of Time</em>.</p>\n<p>One thing everyone picked up from the reveal trailer is the fact that this entry is looking to be a much darker adventure than its predecessor. Aonuma went on to confirm this, saying the entry will be similar to <em>The Legend of Zelda: </em><em>Majora&#8217;s Mask</em> in tone &#8212; easily the darkest and most disturbing game in the series. How exactly that will play out is unknown. However, it&#8217;s been confirmed that <a href=\"https://www.ign.com/articles/2019/06/11/zelda-breath-of-the-wild-sequel-is-not-related-to-majoras-mask\">it will <em>not</em> tie into <em>Majora&#8217;s Mask</em></a> in any way. It might be going for a similar aesthetic, but that doesn&#8217;t mean any story elements from the hit Nintendo 64 title will make an appearance.</p>\n<p>Apparently, the driving factor for making a <em>Breath of the Wild</em> sequel came from the development team conjuring up too many DLC ideas. While DLC works to add small changes to a game &#8212; it essentially functions as an expansion &#8212; you&#8217;re often limited to the existing structure of the title. Aonuma said that the team had some big changes they wanted to implement, but they <a href=\"https://www.gameinformer.com/e3-2019/2019/06/11/breath-of-the-wilds-director-is-returning-for-the-sequel\">couldn&#8217;t do this using DLC</a>. As time went on and more ideas began percolating, it became clear that a new game was the only way to make these a reality.</p>\n<figure class=\"alignnone\"><img  class=\" wp-image-2620504 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/01/breath-of-the-wild-2-zelda-and-link.jpg?fit=720%2C720&p=1\" alt=\"Zelda and Link exploring a cave.\"   /></figure>\n<p>As soon as the trailer was revealed at E3 2019, the internet exploded with rumors and speculation. Not all of it is reliable, but we&#8217;ve compiled a list of the most realistic rumblings. Nintendo hasn&#8217;t commented either way about the following claims, so it&#8217;s possible that some of these great ideas might make it into the final product:</p>\n<ul>\n<li>The reveal trailer shows Link and Zelda exploring some sort of underground chamber, but Zelda looks markedly different than we remember. Her hair has been cut short into a type of bob, and fans are speculating that&#8217;s because she will be a playable character. Shorter hair has less of a chance of clipping into other objects and makes it easier to pull off a clean look without any janky animation. We&#8217;re not sure how likely this is &#8212; but we can&#8217;t deny it would be great to run around Hyrule as someone other than Link.</li>\n<li>Watching Link and Zelda together in the reveal trailer gave some fans the impression that this might be a co-op title. Aonuma was asked about this possibility and didn&#8217;t give a direct answer. While it probably won&#8217;t be the driving force of the game, we&#8217;re hopeful that you&#8217;ll be able to partner up with a friend this time around.</li>\n<li>Several cave paintings seem to reference a time before the Calamity occurred. Does this mean the title could be a prequel to the original?</li>\n<li>Traditional dungeons might make a return. Since players are already familiar with the map of Hyrule, it makes sense that new locations will have to be underground or indoors.</li>\n<li>Ganondorf is the most likely villain, as he fits the appearance of the slumped-over corpse seen in the trailer. Some are also speculating that Zant, one of the antagonists of <em>The Legend of Zelda: Twilight Princess</em>, might also make a return, but there isn&#8217;t much evidence to back up this claim.</li>\n</ul>\n<p>As for the E3 2021 gameplay trailer, we saw Link with a few new tricks &#8212; such as the ability to teleport through solid objects and a deadly new gauntlet &#8212; and it confirmed that much of <em>The Legend of Zelda: Tears of the Kingdom</em> won&#8217;t stray too far from the original title. Speculation is already swirling about how Link, Zelda, and Ganon all fit into the picture, but for now, it&#8217;s just a bunch of fan theories, regardless of how intriguing they may be. Until Nintendo gives us some more concrete details, we&#8217;ll leave the guesswork up to internet sleuths.</p>\n<p>The newest 2022 trailer shows off new ways to interact with objects to raise directly up into the sky environments by rewinding time.</p>\n<h2>Multiplayer</h2>\n<figure class=\"alignnone\"><img  class=\"size-large wp-image-2619751 \" src=\"https://www.digitaltrends.com/wp-content/uploads/2021/01/pull-out-sword.jpg?fit=720%2C405&p=1\" alt=\"Link with the Master Sword in The Legend of Zelda: Breath of the Wild.\"   /></figure>\n<p>The game is rumored to include co-op &#8212; but that&#8217;s only because fans saw Link and Zelda exploring together in the reveal trailer. Nothing is official yet, although offering co-op would be a massive change when compared to <em>Breath of the Wild</em>.</p>\n<h2>Preorder</h2>\n<p>It&#8217;s still a long way off, but you can preorder <em>The Legend of Zelda: Tears of the Kingdom</em> on <a href=\"https://www.amazon.com/Legend-Zelda-Breath-Wild-Nintendo-Switch/dp/B097B2YWFX/ref=sr_1_2?keywords=zelda+breath+of+the+wild+2+nintendo+switch&qid=1645012500&sprefix=zelda+breth+of+the+wild+2%2Caps%2C220&sr=8-2&tag=nlife-20\" target=\"_blank\" rel=\"sponsored noopener\">Amazon</a> and <a href=\"https://www.bestbuy.com/site/the-legend-of-zelda-tears-of-the-kingdom-nintendo-switch/6464080.p?acampID=0&cmp=RMX&irclickid=y4yyXHwMOxyNRmTzS82UByWnUkDXyhSFzW3FV00&irgwc=1&loc=Narrativ+Campaign&mpid=3139288&ref=198&skuId=6464080\" target=\"_blank\" rel=\"sponsored noopener\">Best Buy</a>.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/09/zelborg-new.jpg?p=1",
  "enclosure": "",
  "post-id": 2499244
}