{
  "title": "Trevor Noah Kisses Up To The WHCD Crowd",
  "itunes:title": "Trevor Noah Kisses Up To The WHCD Crowd",
  "pubDate": "Fri, 06 May 2022 06:20:34 +0000",
  "guid": "1d263015-3027-4c05-bb57-124745e67327",
  "link": "https://thejimmydoreshow.libsyn.com/trevor-noah-kisses-up-to-the-whcd-crowd",
  "itunes:image": "",
  "description": "<p>The Daily Show's Trevor Noah headlined this year's White House Correspondents Dinner, and the South African-born comedian delivered what he was paid for -- some mild criticism of the luminaries in the room and then an epic tongue bath for the fourth estate and all the alleged \"journalism\" the media bigwigs in the room produce.<br /> <br /> Plus a segment on Dave Chappelle's recent attack while on stage at the Hollywood Bowl.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Vince Vaughn and CNN stars Jake Tapper and Jeffrey Toobin!</p>",
  "content:encoded": "<p>The Daily Show's Trevor Noah headlined this year's White House Correspondents Dinner, and the South African-born comedian delivered what he was paid for -- some mild criticism of the luminaries in the room and then an epic tongue bath for the fourth estate and all the alleged \"journalism\" the media bigwigs in the room produce.  Plus a segment on Dave Chappelle's recent attack while on stage at the Hollywood Bowl.  Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Vince Vaughn and CNN stars Jake Tapper and Jeffrey Toobin!</p>",
  "enclosure": "",
  "itunes:duration": "01:08:12",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The Daily Show's Trevor Noah headlined this year's White House Correspondents Dinner, and the South African-born comedian delivered what he was paid for -- some mild criticism of the luminaries in the room and then an epic tongue bath for the fourth...",
  "itunes:episodeType": "full",
  "itunes:summary": "The Daily Show's Trevor Noah headlined this year's White House Correspondents Dinner, and the South African-born comedian delivered what he was paid for -- some mild criticism of the luminaries in the room and then an epic tongue bath for the fourth estate and all the alleged \"journalism\" the media bigwigs in the room produce. Plus a segment on Dave Chappelle's recent attack while on stage at the Hollywood Bowl. Also featuring Stef Zamorano, Kurt Metzger and Mike MacRae! And phone calls from Vince Vaughn and CNN stars Jake Tapper and Jeffrey Toobin!"
}