{
  "title": "PLEDGE WEEK: &#8220;I&#8217;m Henry VIII I Am&#8221; by Herman&#8217;s Hermits",
  "link": "https://500songs.com/podcast/pledge-week-im-henry-viii-i-am-by-hermans-hermits/",
  "pubDate": "Thu, 14 Jul 2022 22:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1237",
  "description": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to <a href=\"http://patreon.com/andrewhickey\">patreon.com/andrewhickey</a> and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\n<strong>Transcript</strong>\n\nToday's backer-only episode is an extra-long one -- it runs about as long as some of the shorter main episodes -- but it also might end up containing material that gets repeated in the main podcast at some point, because a lot of British rock and pop music gets called, often very incorrectly, music-hall, and so the subject of the music halls is one that may well have to be explained in a future episode. But today we're going to look at one of the very few pop hits of the sixties that is incontrovertibly based in the music-hall tradition -- Herman's Hermits singing \"I'm Henry the Eighth, I Am\":\n\n[Excerpt: Herman's Hermits, \"I'm Henry the Eighth, I Am\"]\n\nThe term \"music hall\" is one that has been widely misused over the years. People talk about it as being a genre of music, when it's anything but. Rather, the music hall -- which is the British equivalent of the American vaudeville -- was the most popular form of entertainment, first under that name and then under the name \"variety\", for more than a century, only losing its popularity when TV and rock-and-roll between them destroyed the market for it. Even then, TV variety shows rooted in the music hall continued, explicitly until the 1980s, with The Good Old Days, and implicitly until the mid-1990s.\n\nAs you might imagine, for a form of entertainment that lasted over a hundred years, there's no such thing as \"music-hall music\" as a singular thing, any more than there exists a \"radio music\" or a \"television music\". Many music-hall acts were non-musical performers -- comedians, magicians, acrobats, and so forth -- but among those who did perform music, there were all sorts of different styles included, from folk song to light opera, to ragtime, and especially minstrel songs -- the songs of Stephen Foster were among the very first transatlantic hits.\n\nWe obviously don't have any records from the first few decades of the music hall, but we do have sheet music, and we know that the first big British hit song was \"Champagne Charlie\", originally performed by George Leybourne, and here performed by Derek B Scott, a professor of critical musicology at the university of Leeds:\n\n[Excerpt: Derek B. Scott, \"Champagne Charlie\"]\n\nIf you've ever heard the phrase \"the Devil has all the best tunes\", that song is why. William Booth, the founder of the Salvation Army, set new lyrics to it and made it into a hymn, and when asked why, he replied \"Why should the Devil have all the good tunes?\" The phrase had been used earlier, but it was Booth who popularised it.\n\n\"Champagne Charlie\" also has rather morbid associations, because it was sung by the crowd at the last public execution in Britain, so it often gets used in horror and mystery films set in Victorian London, so chances are if you recognised the song it's because you've heard it in a film about Jack the Ripper or Jekyll and Hyde.\n\nBut the music hall, like all popular entertainment, demanded a whole stream of new material. The British Tin Pan Alley publishers and songwriters who wrote much of the early British rock and roll we've looked at started out in music hall, and almost every British popular song up until the rise of jazz, and most after that until the fifties, was performed in the music halls.\n\nWe do have recordings from the later part of the music-hall era, of course, and they show what a wide variety of music was performed there, from pitch-black comedy songs like \"Murders\", by George Grossmith, the son of the co-writer of Diary of a Nobody:\n\n[Excerpt: George Grossmith, \"Murders\"]\n\nTo sing-along numbers like \"Waiting at the Church\" by Vesta Victoria:\n\n[Excerpt: Vesta Victoria, \"Waiting at the Church\"]\n\nAnd one of the most-recorded music-hall performers, Harry Champion, a London performer who sang very wordy songs, at a fast tempo, usually with a hornpipe rhythm and often about food, like \"A Little Bit of Cucumber\" or his most famous song \"Boiled Beef and Carrots\":\n\n[Excerpt: Harry Champion, \"Boiled Beef and Carrots\"]\n\nBut one that wasn't about food, and was taken a bit slower than his normal patter style, was \"I'm Henry the VIII I Am\":\n\n[Excerpt: Harry Champion, \"I'm Henry VIII, I Am\"]\n\n(Incidentally, the song as written on the sheet music has \"Henery\" rather than \"Henry\", and most people sing it \"Enery\", but the actual record by Champion uses \"Henry\" on the label, as does the Hermits' version, so that's what I'm going with).\n\nFifty years after Champion, the song was recorded by Joe Brown. We've talked about Brown before in the main podcast, but for those of you who don't remember, he's one of the best British rock and roll musicians of the fifties, and still performing today, and he has a real love of pre-war pop songs, and he would perform them regularly with his band, the Bruvvers. Those of you who've heard the Beatles performing \"Sheikh of Araby\" on their Decca audition, they're copying Brown's version of that song -- George Harrison was a big fan of Brown.\n\nBrown's version of \"I'm Henry the Eighth I Am\" gave it a rock and roll beat, and dropped the verse, leaving only the refrain:\n\n[Excerpt: Joe Brown and the Bruvvers, \"I'm Henry the Eighth I Am\"]\n\nEnter Herman's Hermits, four years later.\n\nIn 1964, Herman's Hermits, a beat group from Manchester led by singer Peter Noone, had signed with Mickie Most and had a UK number one with \"I'm Into Something Good\", a Goffin and King song originally written for Earl-Jean of the Cookies:\n\n[Excerpt: Herman's Hermits, \"I'm Into Something Good\"]\n\nThat would be their only UK number one, though they'd have several more top ten hits over here. It only made number thirteen in the US, but their second US single (not released as a single over here), \"Can't You Hear My Heartbeat\", went to number two in the States. From that point on, the group's career would diverge enormously between the US and the UK -- half their US hits were never released as singles in the UK, and vice versa. Several records, like their cover version of Sam Cooke's \"Wonderful World\", were released in both countries, but in general they went in two very different directions. In the UK they tended to release fairly normal beat-group records like \"No Milk Today\", written by Graham Gouldman, who was also writing hits for the Yardbirds and the Hollies:\n\n[Excerpt: Herman's Hermits, \"No Milk Today\"]\n\nThat only charted in the US when it was later released as a B-side. Meanwhile, in the US, they pursued a very different strategy. Since the \"British Invasion\" was a thing, and so many British bands were doing well in the States partly because of the sheer novelty of them being British, Herman's Hermits based their career on appealing to American Anglophiles.\n\nThis next statement might be a little controversial, even offensive to some listeners, so I apologise, but it's the truth. There is a large contingent of people in America who genuinely believe that they love Britain and British things, but who have no actual idea what British culture is actually like. They like a version of Britain that has been constructed entirely from pop-culture aimed at an American market, and have a staggeringly skewed vision of what Britain is actually like, one that is at best misguided and at worst made up of extremely offensive stereotypes. People who think they know all about the UK because they've spent a week going round a handful of tourist traps in central London and they've watched every David Tennant episode of Doctor Who.\n\n(Please note that I am not, here, engaging in reflex anti-Americanism, as so many British people do on this topic, because I know very well that there is an equally wrong kind of British person who worships a fictional America which has nothing to do with the real country -- as any American who has come over to the UK and seen cans of hot dog sausages in brine with \"American style\" and an American flag on the label will shudderingly attest. Fetishising of a country not one's own exists in every culture, and about every culture, whether it's American weebs who think they know about Japan or British Communists who were insistent that the Soviet Union under Stalin was a utopia).\n\nFor their US-only singles, most of which were massive hits, Herman's Hermits played directly to that audience.\n\nThe group's first single in this style was \"Mrs. Brown, You've Got a Lovely Daughter\", written by the actor Trevor Peacock, now best known for playing Jim in The Vicar of Dibley, but at the time best known as a songwriter for groups like the Vernons Girls and  for writing linking material for Six-Five Special and Oh Boy!\n\nThat song was written for a TV play and originally performed by the actor Tom Courtenay:\n\n[Excerpt: Tom Courtenay, \"Mrs. Brown, You've Got a Lovely Daughter\"]\n\nThe Hermits copied Courtenay's record closely, down to Noone imitating Courtenay's vocals:\n\n[Excerpt: Herman's Hermits, \"Mrs. Brown, You've Got a Lovely Daughter\"]\n\nThat became their first US number one, and the group went all-in on appealing to that particular market.\n\nNoone started singing, not in the pseudo-American style that, say, Mick Jagger sings in (and early-sixties Jagger is a perfect example of the British equivalent of those American Anglophiles, loving but not understanding Black America), and not in his own Manchester accent, but in a faked Cockney accent, doing what is essentially a bad impersonation of Anthony Newley.\n\n(Davy Jones, who like Noone was a Mancunian who had started his career in the Manchester-set soap opera Coronation Street, was also doing the same thing at the time, in his performances as the Artful Dodger in the Broadway version of Oliver! -- we'll talk more about Jones in future episodes of the main podcast, but he, like Noone, was someone who was taking aim at this market.)\n\nNoone's faked accent varied a lot, sometimes from syllable to syllable, and on records like \"Mrs. Brown, You've Got a Lovely Daughter\" and the Hermits' version of the old George Formby song \"Leaning on a Lamp Post\" he sounds far more Northern than on other songs -- fitting into a continuum of Lancashire novelty performers that stretched at least from Formby's father, George Formby senior, all the way to Frank Sidebottom.\n\nBut on the Hermits' version of \"I'm Henry the Eighth, I Am\", Noone is definitely trying to sound as London as he can, and he and the group copy Joe Brown's arrangement:\n\n[Excerpt: Herman's Hermits, \"I'm Henry the Eighth I Am\"]\n\nThat also became an American number one, and Herman's Hermits had truly found their niche. They spent the next three years making an odd mixture of catchy pop songs by writers like Graham Gouldman or PF Sloan, which became UK hits, and the very different type of music typified by \"I'm Henry the Eighth I Am\". Eventually, though, musical styles changed, and the group stopped having hits in either country. Peter Noone left the group in 1971, and they made some unsuccessful records without him before going on to the nostalgia circuit.\n\nNoone's solo career started relatively successfully, with a version of David Bowie's \"Oh! You Pretty Things\", backed by Bowie and the Spiders From Mars:\n\n[Excerpt: Peter Noone, \"Oh! You Pretty Things\"]\n\nThat made the top twenty in the UK, but Noone had no further solo success. These days, there are two touring versions of Herman's Hermits -- in the US, Noone has toured as \"Herman's Hermits featuring Peter Noone\", with no other original members, since the 1980s. Drummer Barry Whitwham and lead guitarist Derek Leckenby kept the group going in the rest of the world until Leckenby's death in 1994 -- since then Whitwham has toured as Herman's Hermits without any other original members.\n\nHerman's Hermits may not have the respect that some of their peers had, but they had incredible commercial success at their height, made some catchy pop records, and became the first English group to realise there was a specific audience of Anglophiles in the US that they could market to. Without that, much of the subsequent history of music might have been very different.",
  "itunes:subtitle": "This episode is part of Pledge Week 2022. Every day this week, Ill be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying back",
  "itunes:keywords": "David Bowie,Graham Gouldman,Herman&#039;s Hermits,Joe Brown,music hall",
  "itunes:episodeType": "bonus",
  "content:encoded": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to <a href=\"http://patreon.com/andrewhickey\">patreon.com/andrewhickey</a> and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\n<strong>Transcript</strong>\n\nToday's backer-only episode is an extra-long one -- it runs about as long as some of the shorter main episodes -- but it also might end up containing material that gets repeated in the main podcast at some point, because a lot of British rock and pop music gets called, often very incorrectly, music-hall, and so the subject of the music halls is one that may well have to be explained in a future episode. But today we're going to look at one of the very few pop hits of the sixties that is incontrovertibly based in the music-hall tradition -- Herman's Hermits singing \"I'm Henry the Eighth, I Am\":\n\n[Excerpt: Herman's Hermits, \"I'm Henry the Eighth, I Am\"]\n\nThe term \"music hall\" is one that has been widely misused over the years. People talk about it as being a genre of music, when it's anything but. Rather, the music hall -- which is the British equivalent of the American vaudeville -- was the most popular form of entertainment, first under that name and then under the name \"variety\", for more than a century, only losing its popularity when TV and rock-and-roll between them destroyed the market for it. Even then, TV variety shows rooted in the music hall continued, explicitly until the 1980s, with The Good Old Days, and implicitly until the mid-1990s.\n\nAs you might imagine, for a form of entertainment that lasted over a hundred years, there's no such thing as \"music-hall music\" as a singular thing, any more than there exists a \"radio music\" or a \"television music\". Many music-hall acts were non-musical performers -- comedians, magicians, acrobats, and so forth -- but among those who did perform music, there were all sorts of different styles included, from folk song to light opera, to ragtime, and especially minstrel songs -- the songs of Stephen Foster were among the very first transatlantic hits.\n\nWe obviously don't have any records from the first few decades of the music hall, but we do have sheet music, and we know that the first big British hit song was \"Champagne Charlie\", originally performed by George Leybourne, and here performed by Derek B Scott, a professor of critical musicology at the university of Leeds:\n\n[Excerpt: Derek B. Scott, \"Champagne Charlie\"]\n\nIf you've ever heard the phrase \"the Devil has all the best tunes\", that song is why. William Booth, the founder of the Salvation Army, set new lyrics to it and made it into a hymn, and when asked why, he replied \"Why should the Devil have all the good tunes?\" The phrase had been used earlier, but it was Booth who popularised it.\n\n\"Champagne Charlie\" also has rather morbid associations, because it was sung by the crowd at the last public execution in Britain, so it often gets used in horror and mystery films set in Victorian London, so chances are if you recognised the song it's because you've heard it in a film about Jack the Ripper or Jekyll and Hyde.\n\nBut the music hall, like all popular entertainment, demanded a whole stream of new material. The British Tin Pan Alley publishers and songwriters who wrote much of the early British rock and roll we've looked at started out in music hall, and almost every British popular song up until the rise of jazz, and most after that until the fifties, was performed in the music halls.\n\nWe do have recordings from the later part of the music-hall era, of course, and they show what a wide variety of music was performed there, from pitch-black comedy songs like \"Murders\", by George Grossmith, the son of the co-writer of Diary of a Nobody:\n\n[Excerpt: George Grossmith, \"Murders\"]\n\nTo sing-along numbers like \"Waiting at the Church\" by Vesta Victoria:\n\n[Excerpt: Vesta Victoria, \"Waiting at the Church\"]\n\nAnd one of the most-recorded music-hall performers, Harry Champion, a London performer who sang very wordy songs, at a fast tempo, usually with a hornpipe rhythm and often about food, like \"A Little Bit of Cucumber\" or his most famous song \"Boiled Beef and Carrots\":\n\n[Excerpt: Harry Champion, \"Boiled Beef and Carrots\"]\n\nBut one that wasn't about food, and was taken a bit slower than his normal patter style, was \"I'm Henry the VIII I Am\":\n\n[Excerpt: Harry Champion, \"I'm Henry VIII, I Am\"]\n\n(Incidentally, the song as written on the sheet music has \"Henery\" rather than \"Henry\", and most people sing it \"Enery\", but the actual record by Champion uses \"Henry\" on the label, as does the Hermits' version, so that's what I'm going with).\n\nFifty years after Champion, the song was recorded by Joe Brown. We've talked about Brown before in the main podcast, but for those of you who don't remember, he's one of the best British rock and roll musicians of the fifties, and still performing today, and he has a real love of pre-war pop songs, and he would perform them regularly with his band, the Bruvvers. Those of you who've heard the Beatles performing \"Sheikh of Araby\" on their Decca audition, they're copying Brown's version of that song -- George Harrison was a big fan of Brown.\n\nBrown's version of \"I'm Henry the Eighth I Am\" gave it a rock and roll beat, and dropped the verse, leaving only the refrain:\n\n[Excerpt: Joe Brown and the Bruvvers, \"I'm Henry the Eighth I Am\"]\n\nEnter Herman's Hermits, four years later.\n\nIn 1964, Herman's Hermits, a beat group from Manchester led by singer Peter Noone, had signed with Mickie Most and had a UK number one with \"I'm Into Something Good\", a Goffin and King song originally written for Earl-Jean of the Cookies:\n\n[Excerpt: Herman's Hermits, \"I'm Into Something Good\"]\n\nThat would be their only UK number one, though they'd have several more top ten hits over here. It only made number thirteen in the US, but their second US single (not released as a single over here), \"Can't You Hear My Heartbeat\", went to number two in the States. From that point on, the group's career would diverge enormously between the US and the UK -- half their US hits were never released as singles in the UK, and vice versa. Several records, like their cover version of Sam Cooke's \"Wonderful World\", were released in both countries, but in general they went in two very different directions. In the UK they tended to release fairly normal beat-group records like \"No Milk Today\", written by Graham Gouldman, who was also writing hits for the Yardbirds and the Hollies:\n\n[Excerpt: Herman's Hermits, \"No Milk Today\"]\n\nThat only charted in the US when it was later released as a B-side. Meanwhile, in the US, they pursued a very different strategy. Since the \"British Invasion\" was a thing, and so many British bands were doing well in the States partly because of the sheer novelty of them being British, Herman's Hermits based their career on appealing to American Anglophiles.\n\nThis next statement might be a little controversial, even offensive to some listeners, so I apologise, but it's the truth. There is a large contingent of people in America who genuinely believe that they love Britain and British things, but who have no actual idea what British culture is actually like. They like a version of Britain that has been constructed entirely from pop-culture aimed at an American market, and have a staggeringly skewed vision of what Britain is actually like, one that is at best misguided and at worst made up of extremely offensive stereotypes. People who think they know all about the UK because they've spent a week going round a handful of tourist traps in central London and they've watched every David Tennant episode of Doctor Who.\n\n(Please note that I am not, here, engaging in reflex anti-Americanism, as so many British people do on this topic, because I know very well that there is an equally wrong kind of British person who worships a fictional America which has nothing to do with the real country -- as any American who has come over to the UK and seen cans of hot dog sausages in brine with \"American style\" and an American flag on the label will shudderingly attest. Fetishising of a country not one's own exists in every culture, and about every culture, whether it's American weebs who think they know about Japan or British Communists who were insistent that the Soviet Union under Stalin was a utopia).\n\nFor their US-only singles, most of which were massive hits, Herman's Hermits played directly to that audience.\n\nThe group's first single in this style was \"Mrs. Brown, You've Got a Lovely Daughter\", written by the actor Trevor Peacock, now best known for playing Jim in The Vicar of Dibley, but at the time best known as a songwriter for groups like the Vernons Girls and  for writing linking material for Six-Five Special and Oh Boy!\n\nThat song was written for a TV play and originally performed by the actor Tom Courtenay:\n\n[Excerpt: Tom Courtenay, \"Mrs. Brown, You've Got a Lovely Daughter\"]\n\nThe Hermits copied Courtenay's record closely, down to Noone imitating Courtenay's vocals:\n\n[Excerpt: Herman's Hermits, \"Mrs. Brown, You've Got a Lovely Daughter\"]\n\nThat became their first US number one, and the group went all-in on appealing to that particular market.\n\nNoone started singing, not in the pseudo-American style that, say, Mick Jagger sings in (and early-sixties Jagger is a perfect example of the British equivalent of those American Anglophiles, loving but not understanding Black America), and not in his own Manchester accent, but in a faked Cockney accent, doing what is essentially a bad impersonation of Anthony Newley.\n\n(Davy Jones, who like Noone was a Mancunian who had started his career in the Manchester-set soap opera Coronation Street, was also doing the same thing at the time, in his performances as the Artful Dodger in the Broadway version of Oliver! -- we'll talk more about Jones in future episodes of the main podcast, but he, like Noone, was someone who was taking aim at this market.)\n\nNoone's faked accent varied a lot, sometimes from syllable to syllable, and on records like \"Mrs. Brown, You've Got a Lovely Daughter\" and the Hermits' version of the old George Formby song \"Leaning on a Lamp Post\" he sounds far more Northern than on other songs -- fitting into a continuum of Lancashire novelty performers that stretched at least from Formby's father, George Formby senior, all the way to Frank Sidebottom.\n\nBut on the Hermits' version of \"I'm Henry the Eighth, I Am\", Noone is definitely trying to sound as London as he can, and he and the group copy Joe Brown's arrangement:\n\n[Excerpt: Herman's Hermits, \"I'm Henry the Eighth I Am\"]\n\nThat also became an American number one, and Herman's Hermits had truly found their niche. They spent the next three years making an odd mixture of catchy pop songs by writers like Graham Gouldman or PF Sloan, which became UK hits, and the very different type of music typified by \"I'm Henry the Eighth I Am\". Eventually, though, musical styles changed, and the group stopped having hits in either country. Peter Noone left the group in 1971, and they made some unsuccessful records without him before going on to the nostalgia circuit.\n\nNoone's solo career started relatively successfully, with a version of David Bowie's \"Oh! You Pretty Things\", backed by Bowie and the Spiders From Mars:\n\n[Excerpt: Peter Noone, \"Oh! You Pretty Things\"]\n\nThat made the top twenty in the UK, but Noone had no further solo success. These days, there are two touring versions of Herman's Hermits -- in the US, Noone has toured as \"Herman's Hermits featuring Peter Noone\", with no other original members, since the 1980s. Drummer Barry Whitwham and lead guitarist Derek Leckenby kept the group going in the rest of the world until Leckenby's death in 1994 -- since then Whitwham has toured as Herman's Hermits without any other original members.\n\nHerman's Hermits may not have the respect that some of their peers had, but they had incredible commercial success at their height, made some catchy pop records, and became the first English group to realise there was a specific audience of Anglophiles in the US that they could market to. Without that, much of the subsequent history of music might have been very different.",
  "enclosure": "",
  "itunes:summary": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to patreon.com/andrewhickey and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\nTranscript\n\nToday's backer-only episode is an extra-long one -- it runs about as long as some of the shorter main episodes -- but it also might end up containing material that gets repeated in the main podcast at some point, because a lot of British rock and pop music gets called, often very incorrectly, music-hall, and so the subject of the music halls is one that may well have to be explained in a future episode. But today we're going to look at one of the very few pop hits of the sixties that is incontrovertibly based in the music-hall tradition -- Herman's Hermits singing \"I'm Henry the Eighth, I Am\":\n\n[Excerpt: Herman's Hermits, \"I'm Henry the Eighth, I Am\"]\n\nThe term \"music hall\" is one that has been widely misused over the years. People talk about it as being a genre of music, when it's anything but. Rather, the music hall -- which is the British equivalent of the American vaudeville -- was the most popular form of entertainment, first under that name and then under the name \"variety\", for more than a century, only losing its popularity when TV and rock-and-roll between them destroyed the market for it. Even then, TV variety shows rooted in the music hall continued, explicitly until the 1980s, with The Good Old Days, and implicitly until the mid-1990s.\n\nAs you might imagine, for a form of entertainment that lasted over a hundred years, there's no such thing as \"music-hall music\" as a singular thing, any more than there exists a \"radio music\" or a \"television music\". Many music-hall acts were non-musical performers -- comedians, magicians, acrobats, and so forth -- but among those who did perform music, there were all sorts of different styles included, from folk song to light opera, to ragtime, and especially minstrel songs -- the songs of Stephen Foster were among the very first transatlantic hits.\n\nWe obviously don't have any records from the first few decades of the music hall, but we do have sheet music, and we know that the first big British hit song was \"Champagne Charlie\", originally performed by George Leybourne, and here performed by Derek B Scott, a professor of critical musicology at the university of Leeds:\n\n[Excerpt: Derek B. Scott, \"Champagne Charlie\"]\n\nIf you've ever heard the phrase \"the Devil has all the best tunes\", that song is why. William Booth, the founder of the Salvation Army, set new lyrics to it and made it into a hymn, and when asked why, he replied \"Why should the Devil have all the good tunes?\" The phrase had been used earlier, but it was Booth who popularised it.\n\n\"Champagne Charlie\" also has rather morbid associations, because it was sung by the crowd at the last public execution in Britain, so it often gets used in horror and mystery films set in Victorian London, so chances are if you recognised the song it's because you've heard it in a film about Jack the Ripper or Jekyll and Hyde.\n\nBut the music hall, like all popular entertainment, demanded a whole stream of new material. The British Tin Pan Alley publishers and songwriters who wrote much of the early British rock and roll we've looked at started out in music hall, and almost every British popular song up until the rise of jazz, and most after that until the fifties, was performed in the music halls.\n\nWe do have recordings from the later part of the music-hall era, of course, and they show what a wide variety of music was performed",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to patreon.com/andrewhickey and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\nTranscript\n\nToday's backer-only episode is an extra-long one -- it runs about as long as some of the shorter main episodes -- but it also might end up containing material that gets repeated in the main podcast at some point, because a lot of British rock and pop music gets called, often very incorrectly, music-hall, and so the subject of the music halls is one that may well have to b",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}