{
  "id": "tag:blogger.com,1999:blog-15418143.post-8255085887863637133",
  "published": "2015-04-04T09:08:00.000-05:00",
  "updated": "2016-06-14T04:57:35.478-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Three Fundamental Dimensions for Thinking About Machine Learning Systems",
  "content": "Today, let's set cutting-edge machine learning and computer vision techniques aside. You probably already know that computer vision (or \"machine vision\") is the branch of computer science / artificial intelligence concerned with recognizing objects like cars, faces, and hand gestures in images. And you also probably know that Machine Learning algorithms are used to drive state-of-the-art computer vision systems. But what's missing is a birds-eye view of <i>how to think</i> about designing new learning-based systems. So instead of focusing on today's trendiest machine learning techniques, let's go all the way back to day 1 and build ourselves <b>a strong foundation for thinking about machine learning and computer vision systems</b>.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://4.bp.blogspot.com/-sYorlxwElHA/VSAlhF21s9I/AAAAAAAAN7Q/HH9esGPAjGU/s1600/springs-01.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><img border=\"0\" height=\"173\" src=\"https://4.bp.blogspot.com/-sYorlxwElHA/VSAlhF21s9I/AAAAAAAAN7Q/HH9esGPAjGU/s400/springs-01.png\" width=\"400\" /></a></div><div style=\"text-align: left;\"></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br />Allow me to introduce&nbsp;<b>three fundamental dimensions</b>&nbsp;which you can follow to obtain computer vision masterdom. The first dimension is <b>mathematical</b>, the second is <b>verbal</b>, and the third is <b>intuitive</b>.<br /><br />On a personal level, most of my daily computer vision activities directly map onto these dimensions. When I'm at a coffee shop, I prefer the mathematical - pen and paper are my weapons of choice. When it's time to get ideas out of my head, there's nothing like a solid founder-founder face-to-face meeting, an occasional MIT visit to brainstorm with my scientist colleagues, or simply rubberducking&nbsp;(<a href=\"http://en.wikipedia.org/wiki/Rubber_duck_debugging\">rubber duck debugging</a>) with developers.&nbsp;And when it comes to engineering, interacting with a live learning system can help develop the intuition necessary to make a system more powerful, more efficient, and ultimately much more robust.<br /><br /><div><div><h3><b>Mathematical: Learn to love the linear classifier</b></h3></div><div>At the core of machine learning is mathematics, so you shouldn't be surprised that I include <i>mathematical</i> as one of the three fundamental dimensions of thinking about computer vision.<br /><br />The single most important concept in all of machine learning which you should master is the idea of the classifier. For some of you, classification is a well-understood problem; however, too many students prematurely jump into more complex algorithms line randomized decision forests and multi-layer neural networks, without first grokking the power of the linear classifier. Plenty of data scientists will agree that <b>the linear classifier is the most fundamental machine learning algorithm.</b>&nbsp;In fact, when Peter Norvig, Director of Research at Google, was asked \"Which AI field has surpassed your expectations and surprised you the most?\" in his 2010 interview, he answered with \"machine learning by linear separators.\"&nbsp;</div><div><br />The illustration below depicts a linear classifier. In two dimensions, a linear classifier is a line which separates the positive examples from the negative examples. &nbsp;You should first master the 2D linear classifier, even though in most applications you'll need to explore a higher-dimensional feature space.&nbsp;<b>My personal favorite learning algorithm is the linear support vector machine, or linear SVM</b>. In a SVM, overly-confident data points do not influence the decision boundary. Or put in another way, learning with these confident points is like they aren't even there! This is a very useful property for large-scale learning problems where you can't fit all data into memory. You're going to want to master the linear SVM (and how it relates to Linear Discriminant Analysis, Linear Regression, and Logistic Regression) if you're going to pass one of my whiteboard data-science interviews.</div><div><br /></div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://upload.wikimedia.org/wikipedia/commons/2/2a/Svm_max_sep_hyperplane_with_margin.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"http://upload.wikimedia.org/wikipedia/commons/2/2a/Svm_max_sep_hyperplane_with_margin.png\" height=\"400\" width=\"370\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Linear Support Vector Machine from the <a href=\"http://en.wikipedia.org/wiki/Support_vector_machine\">SVM Wikipedia page</a></div><div><br /></div><div><br /></div><div>An intimate understanding of the linear classifier is necessary to understand how deep learning systems work. &nbsp;The neurons inside a multi-layer neural network are little linear classifiers, and while the final decision boundary is non-linear, you should understand the underlying primitives very well. Loosely speaking, you can <b>think of the linear classifier as a simple spring system and a more complex classifiers as a higher-order assembly of springs.</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br />Also, there are going to be scenarios in your life as a data-scientist where <b>a linear classifier should be the first machine learning algorithm you try</b>. So don't be afraid to use some pen and paper, get into that hinge loss, and master the fundamentals.<br /><br /><b>Further reading:</b>&nbsp;Google's Research Director talks about Machine Learning.&nbsp;<a href=\"https://www.youtube.com/watch?v=hE7k0_9k0VA\">Peter Norvig's Reddit AMA on YouTube from 2010</a>.<br /><b>Further reading:</b>&nbsp;A demo for playing with linear classifiers in the browser.&nbsp;<a href=\"http://vision.stanford.edu/teaching/cs231n/linear-classify-demo/\">Linear classifier Javascript demo</a> from Stanford's&nbsp;CS231n: Convolutional Neural Networks for Visual Recognition.<br /><b>Further reading:</b>&nbsp;My blog post:&nbsp;<a href=\"http://www.computervisionblog.com/2015/03/deep-learning-vs-machine-learning-vs.html\">Deep Learning vs Machine Learning vs Pattern Recognition</a><br /><br /></div><div><h3><b>Verbal: Talk about you vision (and join a community)</b></h3></div><div>As you start acquiring knowledge of machine learning concepts, the best way forward is to speak up. <b>Learn something, then teach a friend.</b> As counterintuitive as it sounds, when it comes down to machine learning mastery, human-human interaction is key. This is why getting a ML-heavy Masters or PhD degree is ultimately the best bet for those adamant about becoming pioneers in the field. Daily conversations are necessary to strengthen your ideas. &nbsp;See Raphael's \"The School of Athens\" for a depiction of what I think of as the ideal learning environment. &nbsp;I'm sure half of those guys were thinking about computer vision.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-bHmE-F0j4zY/VSAl3Juj71I/AAAAAAAAN7Y/mXUGUAEwmsY/s1600/soa.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"200\" src=\"https://3.bp.blogspot.com/-bHmE-F0j4zY/VSAl3Juj71I/AAAAAAAAN7Y/mXUGUAEwmsY/s400/soa.jpg\" width=\"400\" /></a></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://en.wikipedia.org/wiki/The_School_of_Athens\">The School of Athens</a> by Raphael</div><div class=\"separator\" style=\"clear: both; text-align: center;\">An ideal ecosystem for collaboration and learning about computer vision</div><br /><br />If you're not ready for a full-time graduate-level commitment to the field, consider <b>a.)</b> taking an advanced undergraduate course in vision/learning from your university, <b>b.)</b> a machine learning MOOC, or <b>c.)</b>&nbsp;taking part in a practical and application-focused online community/course focusing on computer vision.</div><div><br /></div><div>During my 12-year academic stint, I made the observation that talking to your peers about computer vision and machine learning is more important that listening to teachers/supervisors/mentors. &nbsp;Of course, there's much value in having a great teacher, but don't be surprised if you get 100x more face-to-face time with your friends compared to student-teacher interactions. &nbsp;So if you take an online course like Coursera's Machine Learning MOOC, make sure to take it with friends. &nbsp;Pause the video and discuss. Go to dinner and discuss. Write some code and discuss. Rinse, lather, repeat.</div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/30/d6ee30352d11e4b07f0965d0c0162f/large-icon.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"180\" src=\"https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/30/d6ee30352d11e4b07f0965d0c0162f/large-icon.png\" width=\"320\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">Coursera's <a href=\"https://www.coursera.org/course/ml\">Machine Learning MOOC</a> taught by <a href=\"http://cs.stanford.edu/people/ang/\">Andrew Ng</a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div><br />Another great opportunity is to follow Adrian Rosebrock's <a href=\"http://www.pyimagesearch.com/\">pyimagesearch.com blog</a>, where he focuses on python and computer vision applications. &nbsp;</div><div><br /><b>Further reading:</b>&nbsp;Old blog post:&nbsp;<a href=\"http://www.computervisionblog.com/2012/05/why-your-vision-lab-needs-reading-group.html\">Why your vision lab needs a reading group</a></div><div><b><br /></b><b>Homework assignment:&nbsp;</b>First somebody on the street and teach them about machine learning.</div><div><br /></div><div><h3><b>Intuitive: Play with a real-time machine learning system</b></h3></div><div>The third and final dimension is centered around intuition. Intuition is&nbsp;the ability to understand something immediately, without the need for conscious reasoning. The following guidelines are directed towards real-time object detection systems, but can also transfer over to other applications like learning-based attribution models for advertisements, high-frequency trading, as well as numerous tasks in robotics.<br /><br />To gain some true insights about object detection, you should <b>experience a real-time object detection system</b>. &nbsp;There's something unique about seeing a machine learning system run in real-time, right in front of you. &nbsp;And when you get to control the input to the system, such as when using a webcam, you can learn a lot about how the algorithms work. &nbsp;For example, seeing the classification score go down as you occlude the object of interest, and seeing the detection box go away when the object goes out of view is fundamental to building intuition about what works and what elements of a system need to improve.<br /><br />I see countless students tweaking an algorithm, applying it to a static large-scale dataset, and then waiting for the precision-recall curve to be generated. I understand that this is the hard and scientific way of doing things, but unless you've already spent a few years making friends with every pixel, you're unlikely to make a lasting contribution this way. And it's not very exciting -- you'll probably fall asleep at your desk.<br /><br />Using a real-time feedback loop (see illustration below), you can learn about the patterns which are intrinsically difficult to classify, as well what environmental variations (lights, clutter, motion) affect your system the most. &nbsp;This is something which really cannot be done with a static dataset. &nbsp;So go ahead, mine some intuition and play.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://3.bp.blogspot.com/-iWfH_in0I_M/VSAmGScNeuI/AAAAAAAAN7g/fDC_KIE_f_A/s1600/pong2.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"225\" src=\"https://3.bp.blogspot.com/-iWfH_in0I_M/VSAmGScNeuI/AAAAAAAAN7g/fDC_KIE_f_A/s400/pong2.jpg\" width=\"400\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><b>Visual Debugging:</b> Designing the&nbsp;<a href=\"http://vision.ai/\">vision.ai</a> real-time gesture-based controller in Fall 2013</div><br />Visual feedback is where our work at <a href=\"http://vision.ai/\">vision.ai</a>&nbsp;truly stands out. Take a look at the following video, where&nbsp;we show a live example of training and playing with a detector based on vision.ai's VMX object recognition system.<br /><br /></div><div><center><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"158\" src=\"https://www.youtube.com/embed/u6HPGCefm9I\" width=\"280\"></iframe></center></div><div><br /><b>NOTE:</b> There a handful of other image recognition systems out there which you can turn into real-time vision systems, but be warned that optimization for real-time applications requires some non-trivial software engineering experience. &nbsp;We've put a lot of care into our system so that the detection scores are analogous to a linear SVM scoring strategy.&nbsp;Making the output of a non-trivial learning algorithm backwards-compatible with a linear SVM isn't always easy, but in my opinion, well-worth the effort.<br /><br /><b>Extra Credit:</b>&nbsp;See comments below for some free VMX by vision.ai beta software licenses so you can train some detectors using our visual feedback interface and gain your own machine vision intuition.<br /><br /><h3><b>Conclusion</b></h3></div><div>The three dimensions, namely <b>mathematical</b>, <b>verbal</b>, and <b>intuitive</b>&nbsp;provide different ways for advancing your knowledge of machine learning and computer vision systems. &nbsp;So remember to love the linear classifier, talk to your friends, and use a real-time feedback loop when designing your machine learning system.<br /><br /><br /></div></div><div><br /></div><div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Tomasz Malisiewicz",
    "uri": "http://www.blogger.com/profile/17507234774392358321",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 4
}