{
  "title": "‘Connecting the Dots’: Southern Echo takes on Mississippi’s voter suppression laws",
  "link": "https://www.splcenter.org/news/2022/11/01/vote-your-voice-southern-echo-mississippi",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Features and Stories</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>‘Connecting the Dots’: Southern Echo takes on Mississippi’s voter suppression laws</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>Mississippian Brenda Hyde well remembers the heart-wrenching experience she had voting in the 2020 presidential election.</p>\n<p>“At my precinct, there was a very long line,” she said. “Hours long. I stayed in line, but I saw people giving up and leaving. It was dark and cold. A truck came through with bullhorns, driving fast, covered in Trump flags, support stickers and wooden signs [that read]: ‘Make America Great Again.’ They were loud, hollering. The police were called. It was a form of intimidation.</p>\n<p>“I had on a nice, black T-shirt with a printed saying on the back: ‘They try to silence me. Scare me. Suppress me. Erase me. And still I vote.’ On the front it says: ‘And still I vote.’”</p>\n<p>A white man got upset and started talking with other white people around him, Hyde recalled.</p>\n<p>“He was angry that I was wearing that shirt. It’s an empowerment saying to Black and Brown people – that white people try to intimidate us, but we still vote.</p>\n<p>“Some white folks get mad when they see the shirt and say, ‘Why are you separating?’ When we wear those shirts, we’re not saying that white votes don’t matter, but we have experienced Black voter suppression, and we’ve gone from not having the right to vote to still facing the fight to vote. This is about power.”</p>\n<p>Hyde is the deputy director of the Jackson-based nonprofit organization <a href=\"https://southernecho.org/\" target=\"_blank\">Southern Echo</a> Inc., an intergenerational leadership development, education and training organization. Southern Echo works with grassroots individuals, groups and other organizations to dismantle institutional and systemic racism in our education, economic, environmental, political and health systems. Its civic engagement work with Black and Brown communities centers around organizing and public education, specifically voting, census and redistricting.</p>\n<p>During this redistricting and election cycle, Southern Echo is educating and training individuals and grassroots organizations how to draw and promote fair and equitable redistricting maps, engage in get-out-the-vote (GOTV) activities and increase voter participation in elections.</p>\n<p>Southern Echo is among 39 voter outreach organizations across the Deep South that are receiving more than <a href=\"https://www.splcenter.org/news/2022/08/29/splc-awards-2022-vote-your-voice-grants\">$4.6 million in funding</a> as part of the new round of <a href=\"https://www.splcenter.org/vote-your-voice\">Vote Your Voice</a> grants announced in August. The initiative is a partnership between the SPLC and the <a href=\"https://cfgreateratlanta.org/\" target=\"_blank\">Community Foundation for Greater Atlanta</a> to increase voter registration, participation and civic engagement among communities of color in the Deep South.</p>\n<p>The SPLC has <a href=\"https://www.splcenter.org/news/2021/12/06/vote-your-voice-expands-splc-pledges-100-million-support-voter-engagement-and-pro-democracy\">pledged to invest $100 million</a> in Vote Your Voice grants through 2032.</p>\n<h2>Pathway to change</h2>\n<div data-embed-button=\"media\" data-entity-id=\"35305\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"9a90ead7-f4da-450a-912b-0236db3fc3a2\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35305\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/webvyv-southern-echo-ms-inline-brenda-shirt2022jpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/web_vyv-southern-echo-ms-inline-brenda-shirt_2022.jpg\" width=\"700\" height=\"879\" alt=\"Person wearing And Still I Vote T-shirt\" title=\"brenda-hyde-vote-t-shirt\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Brenda Hyde, deputy director of Southern Echo, wearing the T-shirt she wore while voting in the 2020 presidential election. “Some white folks get mad when they see the shirt,” she says. “When we wear those shirts, we’re not saying that white votes don’t matter. ... This is about power.” (Courtesy of Southern Echo)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Southern Echo was awarded an additional $120,000 over last year’s $400,000 grant. That grant largely funded the organization’s 365 VOTE, a campaign that included a strong field and education effort to organize voters. It included training poll workers and poll watchers, and educating communities about the importance of voting, voter registration, voter ID, absentee voting, and voter purging.</p>\n<p>Sixty percent of the new grant will support the continuation of those efforts, but in 2022-2023 Southern Echo will increase education on voter ID requirements and help communities address voter roll purges, which disproportionately affect communities of color. The organization will hold voter restoration workshops and trainings for members of the community who have been incarcerated and disenfranchised. And it will closely monitor polling place closures to inform communities of any changes in their voting locations.</p>\n<p>Southern Echo will use the remaining 40% of the grant for its fair redistricting map education program. The organization has a redistricting team of 12 members, including eight redistricting fellows and four staff, which covers 58 of Mississippi’s 82 counties. The redistricting team encourages communities to participate in the redistricting process, analyze data and maps and draw community alternative redistricting plans.</p>\n<p>Rachel Mayes, Southern Echo’s executive director, called redistricting “the pathway to democracy and policy change.”</p>\n<p>The organization uses the metaphor “connecting the dots” in its work to help Black and Brown communities understand the connection between the census, fair redistricting and voting and how each impacts overall quality of life outcomes. This knowledge strengthens the resolve of voters of color to overcome more than a century of concerted Black and Brown voter suppression and disenfranchisement.</p>\n<p>“We as leaders and organizers have to help people navigate their personal experiences as well as what they see in the media, and the reality of January 6<sup>th</sup>. We need to help address their concerns, motivate and inspire hope, so that they believe that there is still POWER in the VOTE,” Mayes said.</p>\n<h2>‘Ugly history’</h2>\n<p>Getting to that place is no small order in a state that has the highest percentage of Black residents in the country yet whose history of Black and Brown <a href=\"https://dce.olemiss.edu/um-votes-exploring-the-history-of-voting-suppression-in-ms/\" target=\"_blank\">voter suppression</a> remains one of the country’s most racist repudiations of the 14<sup>th</sup> Amendment’s <a href=\"https://constitution.congress.gov/browse/amendment-14/#:~:text=No%20State%20shall%20make%20or,equal%20protection%20of%20the%20laws.\" target=\"_blank\">equal protection clause</a>.</p>\n<p>As recently as 2020, Mississippi ranked first among states with 10.6% of its voting age population disenfranchised due to <a href=\"https://mississippitoday.org/2020/10/19/study-11-of-all-mississippians-16-of-black-mississippians-cant-vote-because-of-felony-convictions/\" target=\"_blank\">felony convictions</a>, and third in the country for its 16% Black disenfranchised voting age residents, according to a <a href=\"https://www.sentencingproject.org/wp-content/uploads/2020/10/Locked-Out-2020.pdf\" target=\"_blank\">Sentencing Project</a> study.</p>\n<p>States in the South tend to have the most <a href=\"https://attheu.utah.edu/facultystaff/liu-voting-rights/\" target=\"_blank\">restrictive voting laws</a>, historically and today.</p>\n<p>Mississippi is among the five states with the most voter restrictions. Its <a href=\"/our-future-our-vote/mississippi-voter-guide\">voter ID</a> laws are strict and discriminatory. They require a driver’s license with photo ID, a U.S. passport or a free voter ID card issued by a circuit court clerk to in-person applicants with accepted forms of proof of identification.</p>\n<p>The voter ID law is particularly burdensome for the Black community in Mississippi, where disenfranchisement remains <a href=\"https://www.mississippifreepress.org/26643/a-wrong-never-righted-court-upholds-mississippis-1890-jim-crow-voting-law\" target=\"_blank\">structurally entrenched</a> nearly six decades after the end of the Jim Crow era. The state ranks 48th among states in the <a href=\"https://www.valuepenguin.com/auto-insurance/car-ownership-statistics#state-per-capita\" target=\"_blank\">number of registered cars per capita</a>, and many Black people lack driver’s licenses because they cannot afford a vehicle. Some lack other accepted forms of ID proof because their birth at home by midwives was not officially recorded.</p>\n<p>In addition, the state’s confusing and <a href=\"https://apnews.com/article/mississippi-voting-rights-delbert-hosemann-elections-voter-registration-be764ae42ca49a8e64e593b3f419c7aa\" target=\"_blank\">limited absentee balloting</a> and one-day in-person voting, absence of drop boxes and online voting, and voter intimidation at the polls impose more barriers to the ballot box.</p>\n<p>Today, Black people make up 38% of the state’s population; while 56% of the population is non-Hispanic white, according to the <a href=\"https://www.census.gov/quickfacts/MS\" target=\"_blank\">2020 U.S. census</a>.</p>\n<p>In the 2020 presidential election, Mississippi ranked <a href=\"https://www.statista.com/statistics/1184621/presidential-election-voter-turnout-rate-state/\" target=\"_blank\">near the bottom</a> of states for voter participation. At the same time, early and absentee voting <a href=\"https://www.census.gov/library/stories/2021/04/what-methods-did-people-use-to-vote-in-2020-election.html\" target=\"_blank\">surged</a> across the country, from 44% in 2016 to 69% in 2020. Black voters in general cast ballots early or absentee at an even higher rate of 69.6%, exceeded only by Asian American Pacific Islander and Latinx voters. While the COVID-19 pandemic largely drove the increase, early mail-in voting for the 2018 midterm elections was the highest then to date. Big early voting numbers for the <a href=\"https://www.cnn.com/2022/10/28/politics/midterm-elections-early-absentee-voting-ballots/index.html\" target=\"_blank\">2022 midterm elections</a> point to a continuing trend.</p>\n<p>But in Mississippi, the voter ID law makes it difficult for many would-be voters who lack a driver’s license or other photo ID and have to appear before a circuit court clerk.</p>\n<p>“This process isn’t easy and can be frustrating for people,” Mayes said. “You’re supposed to be able to just go in there and say you don’t have a photo ID and be given one, but people are intimidated to go to circuit clerk office for fear that they will be confronted with questions. It makes it hard for people.”</p>\n<p>“Voting should be easy, right? You shouldn’t have to go through what we do to vote. This is just another tactic to keep people away from the polls. It’s consistent with an ugly history of voter suppression in Mississippi,” Mayes said.</p>\n<h2>Fighting against gerrymandering</h2>\n<p>In the years since 2018 when Southern Echo began its “Connecting the Dots” trainings on voting, census and redistricting, the organization has helped communities draw more than 70 alternative redistricting maps. (Every 10 years after the U.S. census is completed, district maps on the federal, state and local levels are supposed to be reconsidered based on population and demographic changes.)</p>\n<p>Now that Southern Echo has resumed in-person education and training, the organization plans to assist even more communities in drawing alternative redistricting plans. The organization is training communities to negotiate directly with city, county and local governing bodies on the “front end” as officials start the process of drawing a new or revised map. If successful, communities will act more as collaborators rather than as angry critics when inequitable maps are introduced at public hearings – often with restricted public comment period before a vote.</p>\n<p>“In the past, under <a href=\"https://www.americanprogress.org/article/5-reasons-why-section-5-of-the-voting-rights-act-enhances-our-democracy/\" target=\"_blank\">pre-clearance</a>, Southern states with a history of voter suppression could send both a community map and the jurisdiction’s map to the Justice Department, which would then decide which map to choose,” Mayes explained. “Now the community <a href=\"https://www.justice.gov/crt/about-section-5-voting-rights-act#:~:text=On%20June%2025%2C%202013%2C%20the,570%20U.S.%20529%20(2013).\" target=\"_blank\">can’t send their map</a> to the Justice Department.”</p>\n<p>Mayes noted that while community activists have been unsuccessful challenging maps that deny Black and Brown voters’ fair representation at the state and federal levels, they have been more successful at the local level. “We are a majority at the city and county level where minority voting strength wasn’t diluted,” she said.</p>\n<p>“When we talk about redistricting and the connection to voting and strategizing values around the vote, we are connecting the dots. ‘How do we come together as a community to organize to get out the vote?’ ” Mayes said is the ongoing question, “because it’s all connected.”</p>\n<p><em>Picture at top: Southern Echo, based in Jackson, Mississippi, is one of 39 voter outreach organizations that are receiving funding from the Vote Your Vote initiative, a partnership between the SPLC and the Community Foundation for Greater Atlanta. Since 2018, Southern Echo has helped communities draw 70 alternative redistricting maps. (Courtesy of Southern Echo)</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-person field-type-entityreference field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><article id=\"node-16901\" class=\"node node-person node-teaser node-even\">\n\n  \n  <div class=\"content\">\n    <div class=\"group-text-field-group\"><div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><a href=\"/about/staff/rhonda-sonnenberg\">Rhonda Sonnenberg</a></div>\n      </div>\n</div>\n<div class=\"field field-name-field-person-title field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Senior Staff Writer</div>\n      </div>\n</div>\n</div>  </div> <!-- /content -->\n\n  \n      <div class=\"links\">\n          </div> <!-- /links -->\n  \n  </article> <!-- /article #node --></div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"&amp;lsquo;Connecting the Dots&amp;rsquo;: Southern Echo takes on Mississippi&amp;rsquo;s voter suppression laws - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/news/2022/11/01/vote-your-voice-southern-echo-mississippi\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 01, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Tue, 01 Nov 2022 18:54:11 +0000",
  "dc:creator": "rudy.isaza_2663",
  "guid": "17205 at https://www.splcenter.org"
}