{
  "title": "A BERT-based Deep Learning Approach for Reputation Analysis in Social Media. (arXiv:2211.01954v1 [cs.CL])",
  "link": "http://arxiv.org/abs/2211.01954",
  "description": "<p>Social media has become an essential part of the modern lifestyle, with its\nusage being highly prevalent. This has resulted in unprecedented amounts of\ndata generated from users in social media, such as users' attitudes, opinions,\ninterests, purchases, and activities across various aspects of their lives.\nTherefore, in a world of social media, where its power has shifted to users,\nactions taken by companies and public figures are subject to constantly being\nunder scrutiny by influential global audiences. As a result, reputation\nmanagement in social media has become essential as companies and public figures\nneed to maintain their reputation to preserve their reputation capital.\nHowever, domain experts still face the challenge of lacking appropriate\nsolutions to automate reliable online reputation analysis. To tackle this\nchallenge, we proposed a novel reputation analysis approach based on the\npopular language model BERT (Bidirectional Encoder Representations from\nTransformers). The proposed approach was evaluated on the reputational polarity\ntask using RepLab 2013 dataset. Compared to previous works, we achieved 5.8%\nimprovement in accuracy, 26.9% improvement in balanced accuracy, and 21.8%\nimprovement in terms of F-score.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Rahman_M/0/1/0/all/0/1\">Mohammad Wali Ur Rahman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shao_S/0/1/0/all/0/1\">Sicong Shao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Satam_P/0/1/0/all/0/1\">Pratik Satam</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hariri_S/0/1/0/all/0/1\">Salim Hariri</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Padilla_C/0/1/0/all/0/1\">Chris Padilla</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Taylor_Z/0/1/0/all/0/1\">Zoe Taylor</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nevarez_C/0/1/0/all/0/1\">Carlos Nevarez</a>"
}