{
  "id": "yt:video:pVzaitdJKk0",
  "yt:videoId": "pVzaitdJKk0",
  "yt:channelId": "UCbu2SsF-Or3Rsn3NxqODImw",
  "title": "Sonic Frontiers Everything To Know",
  "link": "",
  "author": {
    "name": "GameSpot",
    "uri": "https://www.youtube.com/channel/UCbu2SsF-Or3Rsn3NxqODImw"
  },
  "published": "2022-11-02T23:30:06+00:00",
  "updated": "2022-11-04T18:28:48+00:00",
  "media:group": {
    "media:title": "Sonic Frontiers Everything To Know",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Sonic is back with a bold new direction in Sonic Frontiers. Sonic Frontiers takes cues from modern open world games to create something both familiar and all new for Sonic. So, here is everything you need to know about Sonic Frontiers.\n#Gaming #SonicFrontiers #GameSpot\n\nBrand new to Sonic with Sonic Frontiers is a skill tree. Fallen enemies now drop skill pieces Sonic can collect and use to upgrade his skills. Not only that, but Sonic will be able to upgrade his stats by collecting red seeds of power and blue seeds of defense. These seeds can be found by completing puzzles and sidequests in the open zones. These puzzles can also unlock new areas of the map.\n\nCombat is another new feature to Sonic Frontiers. While Sonic will maintain his classic skill of a homing attack, he’ll also have a drop dash and stomp attack, be able to slide at any point, and boost his speed on ground or mid-air. Not only that, but Sonic can now attack with his fists in melee combat, perform combos, and use the brand new skill tree to level up these skills.\n\nCyloop sees you run in a circle around an enemy while activating this ability in order to break enemy’s shields and guards, then have an opening to get in attacks. Cyloop can also be used to quickly collect rings after getting hit by an enemy.\n\nSonic can also now both parry enemy attacks and dodge. Parrying allows Sonic to use this window to counter-attack. Meanwhile, dodging at the right time briefly slows down the time allowing Sonic to get in more attacks.\n\nIncluded in Sonic’s new skillset is a meter that will fill up during combos, and when high enough, allows Sonic to perform a Phantom Rush - which boosts Sonic’s attack power until the meter drops back to 0.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}