{
  "id": "tag:blogger.com,1999:blog-10004977.post-1356369042930731351",
  "published": "2022-11-02T14:03:00.003-04:00",
  "updated": "2022-11-02T14:35:52.555-04:00",
  "title": "FOMC Statement: Raise Rates 75 bp; \"Ongoing increases appropriate\"",
  "content": "Fed Chair Powell <a href=\"https://www.federalreserve.gov/live-broadcast.htm\">press conference video here</a> or on <a href=\"https://youtu.be/-yiC8wZvzgQ\">YouTube here</a>, starting at 2:30 PM ET.<br /><br /><a href=\"https://www.federalreserve.gov/newsevents/pressreleases/monetary20221102a.htm\">FOMC Statement:</a> <br /><blockquote>Recent indicators point to modest growth in spending and production. Job gains have been robust in recent months, and the unemployment rate has remained low. Inflation remains elevated, reflecting supply and demand imbalances related to the pandemic, higher food and energy prices, and broader price pressures.<br /><br />Russia's war against Ukraine is causing tremendous human and economic hardship. The war and related events are creating additional upward pressure on inflation and are weighing on global economic activity. The Committee is highly attentive to inflation risks.<br /><br />The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run. In support of these goals, <b>the Committee decided to raise the target range for the federal funds rate to 3-3/4 to 4 percent</b>. The Committee anticipates that ongoing increases in the target range will be appropriate in order to attain a stance of monetary policy that is sufficiently restrictive to return inflation to 2 percent over time. In determining the pace of future increases in the target range, the Committee will take into account the cumulative tightening of monetary policy, the lags with which monetary policy affects economic activity and inflation, and economic and financial developments. In addition, <b>the Committee will continue reducing its holdings of Treasury securities and agency debt and agency mortgage-backed securities</b>, as described in the Plans for Reducing the Size of the Federal Reserve's Balance Sheet that were issued in May. The Committee is strongly committed to returning inflation to its 2 percent objective.<br /><br />In assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook. The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee's goals. The Committee's assessments will take into account a wide range of information, including readings on public health, labor market conditions, inflation pressures and inflation expectations, and financial and international developments.<br /><br />Voting for the monetary policy action were Jerome H. Powell, Chair; John C. Williams, Vice Chair; Michael S. Barr; Michelle W. Bowman; Lael Brainard; James Bullard; Susan M. Collins; Lisa D. Cook; Esther L. George; Philip N. Jefferson; Loretta J. Mester; and Christopher J. Waller.<br /><span style=\"font-size: x-small;\">emphasis added</span></blockquote>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Calculated Risk",
    "uri": "http://www.blogger.com/profile/08664541332908374389",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}