{
  "title": "On campus, a warm welcome for MIT’s next president, Sally Kornbluth",
  "link": "https://news.mit.edu/2022/campus-warm-welcome-mits-next-president-sally-kornbluth-1020",
  "description": "“This is your moment,” the Institute’s 18th president tells an MIT audience at a community introduction event.",
  "pubDate": "Thu, 20 Oct 2022 20:00:00 -0400",
  "guid": "https://news.mit.edu/2022/campus-warm-welcome-mits-next-president-sally-kornbluth-1020",
  "dc:creator": "Peter Dizikes | MIT News Office",
  "content:encoded": "<p>Incoming MIT President Sally Kornbluth greeted members of the Institute community at a campus event on Thursday afternoon, outlining her vision and values, and thanking everyone for the reception she has enjoyed.</p>\n\n<p></p>\n\n<p>“The warmth and welcome I’ve received from all of you at MIT has been incredible,” said Kornbluth, speaking to a large audience in MIT’s Room 10-250, Huntington Hall. Kornbluth’s selection was announced on Thursday morning, after the MIT Corporation voted to ratify the decision made by an Institute search committee.</p>\n\n<p></p>\n\n<p>In her remarks, which were also webcast to an online audience, Kornbluth emphasized the contributions MIT can make at a time of social and civic need, while describing some key elements in her intellectual and professional background.&nbsp; &nbsp;</p>\n\n<p></p>\n\n<p>“I believe MIT is uniquely poised to harness the power of science and technology, all along the continuum from fundamental science to engineering innovations for society, and deeply enriched by the wisdom and inventive power of the humanities, the arts, the social sciences, management, and design,” Kornbluth said.</p>\n\n<p></p>\n\n<p>She added: “From climate change to pandemic disease to the ethical use of AI, this is a moment when humanity faces huge global problems — problems that urgently demand the attention of the world’s most skillful minds and hands. In short, I believe this is your moment — and I couldn’t imagine a greater privilege than helping all of you seize its full potential.”</p>\n<p><strong>“The ideal 18</strong><strong>th</strong><strong> president”</strong></p>\n\n<p></p>\n\n<p>Kornbluth is a cell biologist who has been serving as provost of Duke University since 2014. She is also currently the Jo Rae Wright University Professor of Biology at Duke, where she has been on the faculty since 1994. As Duke’s provost, Kornbluth was the university’s chief academic officer, overseeing teaching, research, and intellectual priorities across Duke’s 10 schools and six institutes.</p>\n\n<p></p>\n\n<p>Kornbluth’s selection is the culmination of an eight-month process run by a 20-person MIT search committee. In introductory remarks, Diane Greene SM '78, chair of the MIT Corporation, called Kornbluth “the ideal 18th president of MIT” and described the qualities that shaped the committee’s decision.</p>\n\n<p></p>\n\n<p>“Sally Kornbluth is an exceptional administrator,” Greene said. “She’s widely respected for her ability to create an environment that breaks barriers, and enables every student, faculty, and staff member to contribute at their highest level. She’s known for her judgment, her plain-spokenness, and integrity.”</p>\n\n<p></p>\n\n<p>Greene added: “Dr. Kornbluth’s leadership style is decisive, bold, and invariably informed by high moral principles. Her career has exemplified a powerful drive for excellence and a capacity to appreciate, respect, and integrate a wide array of viewpoints. Sally demonstrates the leadership qualities necessary to do justice to MIT’s incredible assemblage of talent, people who seek to achieve the seemingly impossible, who demand excellence, and who are driven by a hunger to make a positive difference in the world.”</p>\n\n<p></p>\n\n<p>Lily Tsai, the Ford Professor of Political Science and chair of the MIT faculty, who participated in the presidential search, also spoke at the event.</p>\n\n<p></p>\n\n<p>“This is a moment of great hope and joy for the Institute as a whole,” said Tsai, who emphasized that an extensive engagement process with the MIT community “shaped the process of selecting our next president. It guided the questions we asked ourselves, and the candidates. It provided the lens through which we assessed the answers.”</p>\n\n<p></p>\n\n<p>In the end, Tsai said, the search committee was looking for “a bold leader with exceptional judgment. An active listener, who seeks all viewpoints with a genuinely open mind. An individual who leads from principles and integrity, who is trusted by their community. A person with experience handling crises with wisdom and calm, who loves MIT’s uniqueness, who will maintain and advance its excellence. And someone with intellectual breadth. … We believe Sally Kornbluth exemplifies these attributes.”</p>\n\n<p></p>\n\n<p>In her remarks, Kornbluth thanked Greene for “the careful and thorough way you led the search process, and for the outstanding questions you and your colleagues posed” in conversations during the search.</p>\n\n<p></p>\n\n<p>Kornbluth emphasized her appreciation for MIT Corporation Life Member John W. Jarve ’78, SM ’79, who chaired the presidential search committee, saying he had “inspired me to see the world of opportunities ahead for the Institute.” She also expressed gratitude to MIT’s Executive Committee and the members of the MIT Corporation, for “trusting me with the profound responsibility” of leading the Institute.</p>\n\n<p></p>\n\n<p>Additionally, Kornbluth thanked her husband, Daniel Lew, the James B. Duke Professor of Pharmacology and Cancer Biology at the Duke School of Medicine, who she called “a superb scientist and always my greatest constructive critic and sounding board.”</p>\n\n<p></p>\n\n<p><strong>Gifts from President Reif — for the winter and the desk</strong></p>\n\n<p></p>\n\n<p>Kornbluth’s tenure as MIT’s 18th president will begin on Jan. 1, 2023. She follows L. Rafael Reif, who has served as MIT president since 2012.</p>\n\n<p></p>\n\n<p>Reif and his wife Christine attended Thursday’s event, with Reif earning a standing ovation from the audience at the outset.</p>\n\n<p></p>\n\n<p>“Thank you so much for welcoming my family and me with such warmth and graciousness,” Kornbluth told the Reifs.</p>\n\n<p></p>\n\n<p>For his part, Reif spoke for a few minutes at the end of the event, extending a presidential greeting that included a pair of presents.</p>\n\n<p></p>\n\n<p>“Sally, I hope you can feel the energy and anticipation in the room,” Reif said. “This is truly a very special occasion for every one of us at MIT.”</p>\n\n<p></p>\n\n<p>To further welcome Kornbluth to MIT, Reif presented her with two gifts bearing an Institute theme. The first gift, in recognition of the fact that Kornbluth will be starting her job in the middle of the Massachusetts winter, consisted of a cap, scarf, and pair of gloves, labelled “MIT” and “18,” denoting Kornbluth’s place in the succession of MIT presidents.</p>\n\n<p></p>\n\n<p>“What do you call these things?” joked Kornbluth, in reference to the warmer winters she has been experiencing in North Carolina.</p>\n\n<p></p>\n\n<p>The second gift was a glass pumpkin, made in MIT’s Glass Lab, which, as Reif noted, drawing laughs from the audience, was a Duke-like dark blue color. The gift “expresses the joy this community takes in making things, hands-on, and that also embodies MIT’s signature spirit of playful creativity,” he said. “It could be described as a charming example of materials science in action. ”</p>\n\n<p></p>\n\n<p>More seriously, Reif congratulated Kornbluth and expressed delight in her selection.</p>\n\n<p></p>\n\n<p>“You are about to begin what, in my mind, is the best job in the world,” Reif said. “You and Danny are embarking on a truly wonderful new adventure. Chris and I wish you the best of success, and we truly cannot wait to see the future you help create for our really beloved MIT.”</p>\n\n<p></p>\n\n<p><strong>A transformative teacher and a commitment to helping others</strong></p>\n\n<p></p>\n\n<p>In her remarks, Kornbluth also noted that as undergraduate, at Williams College, she was actually a political science major, and did not become immersed in biology until late in her college years. To explain the shift, Kornbluth singled out the influence of “the most transformative teacher of my life,” Bill DeWitt, a Williams biology professor who helped her become fascinated with the functioning of cells.</p>\n\n<p></p>\n\n<p>“For all of you who are teachers, from graduate students to senior faculty, never underestimate your impact,” Kornbluth said. “It’s amazing what can blossom when you sow the seeds of curiosity and inspiration.”</p>\n\n<p></p>\n\n<p>After graduating from Williams, Kornbluth earned a scholarship to study at Emmanuel College of Cambridge University, earning a BA in genetics. She earned her PhD from Rockefeller University, and then was a postdoc at the University of California at San Diego, before joining Duke.</p>\n\n<p></p>\n\n<p>With her own intellectual trajectory in mind, Kornbluth emphasized that her presidency will be firmly centered on what MIT and all its community members can accomplish.</p>\n\n<p></p>\n\n<p>“Here, as your president-elect, I see the most important thing of all: this remarkable creative community,” Kornbluth said.</p>\n\n<p></p>\n\n<p>She added: “I’ve always felt that my greatest professional strength and pleasure are in enabling the success of other people. Who would not want to do that, for the best-of-the-best, here at MIT?”</p>",
  "media:content": {
    "media:description": "At the community introduction event, Reif presented Kornbluth with a glass pumpkin, created in MIT’s Glass Lab in the signature blue color of Duke University, where she has served as a faculty member since 1994 and as provost since 2014.",
    "media:credit": "Image: M. Scott Brauer"
  },
  "category": [
    "Administration",
    "MIT Corporation",
    "President L. Rafael Reif",
    "Faculty",
    "Community",
    "History of MIT",
    "Students",
    "Staff",
    "Diversity and inclusion",
    "Alumni/ae",
    "Special events and guest speakers",
    "President Sally Kornbluth"
  ]
}