{
  "title": "S14 Ep69: Supernatural News/Parashare: Nuke Em All Edition",
  "link": "https://audioboom.com/posts/8098561",
  "itunes:episode": 69,
  "itunes:title": "Supernatural News/Parashare: Nuke Em All Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5976,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS Nuke Em All Edition of Supernatural News & ParaShare is locked and loaded on your device!<br>\n<br>\nElon Musk is still Stuck on Launching Nukes at Mars! No Musicfest for Area 51, Ghostly Snow Kangaroos in Australia, A Time Traveller is pregnant with an alien baby PLUS your scary calls and stories<br>\n<br>\nPLUS:  There is an all new Darkness Radio app for IOS and IPhone!  Check the app store by searching \"Darkness Radio\" and looking for the picture of \"Skully\"! Best of all, it's free!<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nSend your kids back to school with the socks that keep them comfy, colorful, and ready to take on the school year. Visit <a href=\"http://Bombas.com/Darkness\">Bombas.com/Darkness</a> to receive 20 percent off of your first order! <br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends. Best Fiends is a CASUAL game anyone can play (but made for adults). Download FREE on the Apple App Store or Google Play!",
  "itunes:summary": "BEYOND the DARKNESS Nuke Em All Edition of Supernatural News & ParaShare is locked and loaded on your device!\n\nElon Musk is still Stuck on Launching Nukes at Mars! No Musicfest for Area 51, Ghostly Snow Kangaroos in Australia, A Time...",
  "pubDate": "Sat, 24 Aug 2019 08:00:00 +0000",
  "guid": "250d3574-396d-4baf-a7d6-f1445a4096e4",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}