{
  "title": "583: High Flying Hijinks (Sorcerer's Stone, Chapters 11 - 12)",
  "link": "https://audioboom.com/posts/8176272",
  "itunes:episode": 583,
  "itunes:title": "High Flying Hijinks (Sorcerer's Stone, Chapters 11 - 12)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 6047,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we pay tribute to Robbie Coltrane, whose iconic role as Rubeus Hagrid made him beloved to costars and fans alike. Chapter-by-Chapter continues as we take flight with Harry in his first Quidditch match and explore the halls of Hogwarts beneath the Invisibility Cloak.<br>\n<br>\n\n</div>\n<ul>\n<li>We remember Robbie Coltrane, the beloved actor who played Hagrid in the Harry Potter series</li>\n<li>Main Discussion #1: Sorcerer’s Stone, Chapter 11: Quidditch</li>\n<li>7-Word Summary: Gryffindor surprises Hogwarts with winning very tastily </li>\n<li>Why does Snape choose to confide in Filch after being attacked by Fluffy? Why does he not go to Madam Pomfrey? Or heal himself?</li>\n<li>What is going through Snape's mind when Harry sees him in this vulnerable situation?</li>\n<li>Does Professor Quirrell’s attack on Harry during the Quidditch match do Quirrell more harm (for him) than good?</li>\n<li>Security Nightmare: Why are there not more protections in place during Quidditch matches?</li>\n<li>Main Discussion #2: Sorcerer’s Stone, Chapter 12: The Mirror of Erised</li>\n<li>7-Word Summary: Dumbledore gives Harry some advice about life</li>\n<li>The hosts rank Harry's Christmas gifts from best to worst, using math</li>\n<li>How does <a href=\"https://www.wizardingworld.com/writing-by-jk-rowling/the-mirror-of-erised\">this new information</a> on The Mirror of Erised influence our thoughts on the magical device?</li>\n<li>We discuss Harry’s (reckless) tendency of using gifts from anonymous sources</li>\n<li>Laura connects the threads between several Mirror of Erised and Resurrection Stone passages</li>\n<li>Why is Nicolas Flamel not more well-known?</li>\n<li>Who did the hosts select as their Most Valuable Character/Chapter of the Week?</li>\n<li>Next week: Chapter-By-Chapter continues for Sorcerer’s Stone with Chapters 13 and 14!</li>\n<li>Quizzitch: In Sorcerer's Stone, how old is Nicolas Flamel at the time of Harry’s first year at Hogwarts?</li>\n<li>This week's episode is brought to you by: the Audible Original <a href=\"https://www.audible.com/pd/The-Sandman-Act-III-Audiobook/B0BFK1K36D\">The Sandman: Act III</a>, MeUndies (Go to <a href=\"https://www.MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a> for 20% off your first order and free shipping) and <a href=\"https://www.indeed.com/mugglecast\">Indeed</a>\n</li>\n</ul>\n",
  "pubDate": "Tue, 18 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-17:/posts/8176272",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}