{
  "title": "AI enhanced finite element multiscale modelling and structural uncertainty analysis of a functionally graded porous beam. (arXiv:2211.01970v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01970",
  "description": "<p>The local geometrical randomness of metal foams brings complexities to the\nperformance prediction of porous structures. Although the relative density is\ncommonly deemed as the key factor, the stochasticity of internal cell sizes and\nshapes has an apparent effect on the porous structural behaviour but the\ncorresponding measurement is challenging. To address this issue, we are aimed\nto develop an assessment strategy for efficiently examining the foam properties\nby combining multiscale modelling and deep learning. The multiscale modelling\nis based on the finite element (FE) simulation employing representative volume\nelements (RVEs) with random cellular morphologies, mimicking the typical\nfeatures of closed-cell Aluminium foams. A deep learning database is\nconstructed for training the designed convolutional neural networks (CNNs) to\nestablish a direct link between the mesoscopic porosity characteristics and the\neffective Youngs modulus of foams. The error range of CNN models leads to an\nuncertain mechanical performance, which is further evaluated in a structural\nuncertainty analysis on the FG porous three-layer beam consisting of two thin\nhigh-density layers and a thick low-density one, where the imprecise CNN\npredicted moduli are represented as triangular fuzzy numbers in double\nparametric form. The uncertain beam bending deflections under a mid-span point\nload are calculated with the aid of Timoshenko beam theory and the Ritz method.\nOur findings suggest the success in training CNN models to estimate RVE modulus\nusing images with an average error of 5.92%. The evaluation of FG porous\nstructures can be significantly simplified with the proposed method and\nconnects to the mesoscopic cellular morphologies without establishing the\nmechanics model for local foams.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Chen_D/0/1/0/all/0/1\">Da Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Emami_N/0/1/0/all/0/1\">Nima Emami</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rezaei_S/0/1/0/all/0/1\">Shahed Rezaei</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rosendahl_P/0/1/0/all/0/1\">Philipp L. Rosendahl</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_B/0/1/0/all/0/1\">Bai-Xiang Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Schneider_J/0/1/0/all/0/1\">Jens Schneider</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gao_K/0/1/0/all/0/1\">Kang Gao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yang_J/0/1/0/all/0/1\">Jie Yang</a>"
}