{
  "title": "Episode 8: &#8220;The Fat Man&#8221; by Fats Domino",
  "link": "https://500songs.com/podcast/the-fat-man-by-fats-domino/",
  "pubDate": "Mon, 26 Nov 2018 00:06:03 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/the-fat-man-by-fats-domino/",
  "description": "Welcome to episode eight of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Fats Domino and \"The Fat Man\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>A couple of notes:</strong>\n\nThis one originally ran very long, so I've had to edit it down rather ruthlessly -- I know one of the things people like about this podcast is that it only takes half an hour. I also had some technical issues, so you might notice a slight change in audio quality at one point. I think I know what caused the problem, and it shouldn't affect any other episodes.\n\nAlso, this episode is the first episode to discuss someone who's still alive -- we're now getting into the realm of living memory, as Dave Bartholomew is still alive, aged ninety-nine -- and I hope he'll be around for many more years.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-8-the-fat-man/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. The Mixcloud, in fact, was created before I edited this one down, and so contains one song -- \"Junko Partner\" by Dr. John -- that doesn't appear in the finished podcast. But it's a good song anyway.\n\nFats Domino's forties and fifties music is now all in the public domain, so there are all sorts of cheap compilations available. However, the best one is actually one that was released when some of the music was still in copyright -- a four-CD box set called <a href=\"https://amzn.to/2PT704t\"><em>They Call Me The Fat Man: The Legendary Imperial Recordings</em></a>. We'll be talking a lot about Fats in the coming months, and there's a reason for that -- his music is among the best of his era.\n\nThe performance of the Gottschalk piece, \"Danza\", I excerpted is from <a href=\"https://amzn.to/2KwI251\">a CD of performances by Frank French of Gottschalk's piano work</a>. I recommend it to anyone who is interested in the development of American music. I first learned about Gottschalk from his influence on another great Louisiana-raised pianist, Van Dyke Parks, and Parks has excellent orchestral arrangements of Gottschalk's \"Danza\" and \"Night in the Tropics\" on his <a href=\"https://amzn.to/2zpp4ZW\"><em>Moonlighting: Live at the Ash Grove</em></a> album.\n\nI talk early on about <a href=\"https://amzn.to/2DKRLmP\"><em>The Sound of the City</em> by Charlie Gillett</a>. I recommend that book to anyone who's interested in 50s and 60s rock and roll, though it's dated in some respects (most notably, it uses the word \"Negro\" thoughout -- at the time, that was the word that black people considered the most appropriate to describe them, though now it's very much looked upon as inappropriate).\n\nThe only biography of Fats Domino I know of is Rick Coleman's <a href=\"https://amzn.to/2QhFZqP\"><em>Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll</em></a>. It's a very good book, though I don't totally buy Coleman's argument that the rhythms in New Orleans music come directly from African drumming.\n\nThe recording of \"New Orleans Blues\" by Jelly Roll Morton is from a cheap compilation called <em>Doctor Jazz (100 Original Tracks)</em> -- it's labelled \"New Orleans Joys\" there, but it's clearly the same song as \"New Orleans Blues\", which appears in a different recording under that name on the same set. That set also has Morton being interviewed and talking about the \"Spanish tinge\". The precise set I have seems no longer to be available, but<a href=\"https://amzn.to/2QhFZqP\"> this</a> looks very similar.\n\nAnd finally, the intro to this episode comes, of course, from the Fat Man radio show, episodes of which can be found in a collection along with The Thin Man <a href=\"https://amzn.to/2PQkQVn\">here</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nIn his 1970 book <em>The Sound of the City</em>, which was the first attempt at a really serious history of rock and roll, Charlie Gillett also makes the first attempt at a serious typology of the music. He identifies five different styles of music, all of them very different, which loosely got lumped together (in much the same way that country and western or rhythm and blues had) and labelled rock and roll.\n\nThe five styles he identifies are Northern band rock and roll -- people like Bill Haley, whose music came from Western Swing; Memphis country rock -- the music we normally talk about as rockabilly; Chicago rhythm and blues -- Chuck Berry and Bo Diddley; what he calls \"vocal group rock and roll\" but which is now better known as doo-wop; and New Orleans dance blues. I'd add a sixth genre to go in the mix, which is the coastal jump bands -- people like Johnny Otis and Lucky Millinder, based in the big entertainment centres of LA and New York.\n\nSo far, we've talked about the coastal jump bands, and about precursors to the Northern bands, doo-wop, and rockabilly. We haven't yet talked about New Orleans dance blues though. So let's take a trip down the Mississippi.\n\nWe can trace New Orleans' importance in music back at least to the early nineteenth century, and to the first truly great American composer, Louis Moreau Gottschalk.\n\nGottschalk was considered, in his life, an unimportant composer, just another Romantic -- Mark Twain made fun of his style, and he was largely forgotten for decades after his early death. When he was remembered, if at all, it was as a performer -- he was considered the greatest pianist of his generation, a flashy showman of the keyboard, who could make it do things no-one else could. But listen to this:\n\n[Excerpt of \"Danza\"]\n\nThat's a piece composed by someone who knew Chopin and Liszt. Someone who was writing so long ago he *taught someone* who played for Abraham Lincoln. Yet it sounds astonishingly up to date. It sounds like it could easily come from the 1920s or 1930s.\n\nAnd the reason it sounds so advanced, and so modern, is that Gottschalk was the first person to put New Orleans music into some sort of permanent form.\n\nWe don't know -- we can't know -- how much of later New Orleans music was inspired by Gottschalk, and how much of Gottschalk was him copying the music he heard growing up. Undoubtedly there is an element of both -- we know, for example, that Jelly Roll Morton, who was credited (mostly by himself, it has to be said) as the inventor of jazz, knew Gottschalk's work. But we also know that Gottschalk knew and incorporated folk melodies he heard in New Orleans.\n\nAnd that music had a lot of influences from a lot of different places. There were the slave songs, of course, but also the music that came up from the Caribbean because of New Orleans' status as a port city. And after the Civil War there was also the additional factor of the brass band music -- all those brass instruments that had been made for the military, suddenly no longer needed for a war, and available cheap.\n\nGottschalk himself was almost the epitome of a romantic -- he wrote pieces called things like \"the Dying Poet\", he was first exiled from his home in the South due to his support for the North in the Civil War and then later had to leave the US altogether and move to South America after a scandalous affair with a student, and he eventually contracted yellow fever and collapsed on stage shortly after playing a piece called Morte! (with an exclamation mark) which is Portuguese for \"death\". He never recovered from his collapse, and died three weeks later of a quinine overdose.\n\nSo as well as presaging the music of the twentieth century, Gottschalk also presaged the careers of many twentieth-century musicians. Truly ahead of his time.\n\nBut by the middle of the twentieth century, time had caught up to him, and New Orleans had repeatedly revolutionised popular music, often with many of the same techniques that Gottschalk had used.\n\nIn particular, New Orleans became known for its piano virtuosos. We'll undoubtedly cover several of them over the course of this series, but anyone with a love for the piano in popular music knows about the piano professors of New Orleans, and to an extent of Louisiana more widely. Jelly Roll Morton, Professor Longhair, James Booker, Allen Toussaint, Huey \"Piano\" Smith... it's in the piano that New Orleans music has always come into its own.\n\nAnd if there's one song that sums up New Orleans music, more than any other, it's \"Junker's Blues\". You've probably not heard that name before, but you've almost certainly heard the melody:\n\n[section of \"Junker's Blues\" as played by Champion Jack Dupree]\n\nThat's Champion Jack Dupree, in 1940, playing the song. That's the first known recording of it, and Dupree claims songwriting credit on the label, but it was actually written by a New Orleans piano player, Drive-Em Down Hall, some time in the 1920s. Dupree heard the song from Hall, who also apparently taught Dupree his piano style.\n\n\"Junker's Blues\" itself never became a well-known song, but its melody was reused over and over again. Most famously there was the Lloyd Price song \"Lawdy Miss Clawdy\", which we're going to be devoting a full episode to soon, but there was also \"Tipitina\" by Professor Longhair...\n\n[section of \"Tipitina\"]\n\n\"Tee Nah Nah\"\n\n[\"Tee Nah Nah\" -- Smiley Lewis]\n\nAnd more. This one melody, by a long-dead unknown New Orleans piano player, has been performed under various names and with different sets of lyrics, by everyone from the Clash to the zydeco accordion player Clifton Chenier, by way of Elvis, Doctor John, and even Hugh Laurie.\n\nBut the most important recording of it was in 1949, by a New Orleans piano player called Fats Domino. And in his version, it became one of those songs that is often considered to be \"the first rock and roll record\".\n\nFats Domino was not someone who could have become a rock star even a few years later. He was not mean and moody and slim, he was a big cheerful fat man, who spoke Louisiana Creole as his first language. He was never going to be a sex symbol. But he had a way of performing that made people happy, and made them want to dance, and in 1949 that was the most important thing for a musician to do.\n\nHe grew up in a kind of poverty that's hard to imagine now -- his family *did* have a record player, but it was a wind-up one, not an electrical one, and eventually the winding string broke, but young Antoine Domino loved music so much that he would sit at the record player and manually turn the records using his finger so he could still listen to them.\n\nBy 1949, Domino had become a minor celebrity among black music fans in New Orleans, more for his piano playing than for his singing. He was known as one of the best boogie woogie players around, with a unique style based on triplets rather than the more straightforward rhythms many boogie pianists used. He'd played, for example, with Roy Brown, although Domino and his entire band got dropped by Brown after Domino sang a few numbers on stage himself during a show -- Brown said he was only paying Domino to play piano, not to sing and upstage him.\n\nBut minor celebrities in local music scenes are still only minor celebrities -- and at aged twenty-one Fats Domino already had a family, and was living in a room in his in-laws' house with his wife and kids, working a day job at a mattress factory, and working a second job selling crushed ice with syrup to kids, to try to make ends meet. Piano playing wasn't exactly a way to make it rich, unless you got on records.\n\nSomeone who *had* made records, and was the biggest musician in New Orleans at the time, was Dave Bartholomew; and Bartholomew, who was working for Imperial Records, suggested that the label sign Domino.\n\nLike many musicians in New Orleans in the late forties, Dave Bartholomew learned his musical skills while he was in the Army during World War II -- he'd already been able to play the trumpet, having been taught by the same man who taught Louis Armstrong, but once he was put into a military brass band he had to learn more formal musical skills, including writing and arranging.\n\nAfter getting out of the army, he got work as an A&R man for Imperial Records, and he also formed his own band, the Dave Bartholomew Orchestra, who had a hit with \"Country Boy\"\n\n[excerpt of \"Country Boy\" by the Dave Bartholomew Orchestra]\n\nNow, something you may notice about that song is that \"dan, dah-dah\" horn part. That may sound absolutely cliched to you now, but that was the first time anything like that had been used in an R&B record. And we can link that horn part back to the Gottschalk piece we heard earlier by its use of a rhythm called the tresillo (pronounced tray heel oh). The tresillo is one of a variety of related rhythms that are all known as \"habanera\" rhythms. That word means \"from Havana\", and was used to describe any music that was influenced by the dance music -- Danzas, like the title of the Gottschalk piece -- coming out of Cuba in the mid nineteenth century.\n\nThe other major rhythm that came from the habanera is the clave, which is a two-bar rhythm. The first bar is a tresilo, and the second is just a \"bam bam\" [demonstrates]. That beat is one we'll be seeing a lot of in the future.\n\nThese rhythms were the basis of the original tango -- which didn't have the beat that we now associate with the tango, but instead had that \"dan, dah-dah\" rhythm (or rhythms like it, like the cinquillo). And through Gottschalk and people like him -- French-speaking Creole people living in New Orleans -- that rhythm entered New Orleans music generally. Jelly Roll Morton called it the \"Spanish tinge\". Have a listen, for example, to Jelly Roll's \"New Orleans Blues\":\n\n[excerpt \"New Orleans Blues\" by Jelly Roll Morton]\n\nJelly Roll claimed to have written that as early as 1902, and the first recording of it was in 1923. It's the tresillo rhythm underpinning it. From Gottschalk, to Jelly Roll Morton, to Dave Bartholomew. That was the sound of New Orleans, travelling across the generations.\n\nBut what really made that rhythm interesting was when you put that \"dah dah dah\" up against something else -- on those early compositions, you have that rhythm as the main pulse, but by the time Dave Bartholomew was doing it -- and he seems to have been the first one to do this -- that rhythm was put against drums playing a shuffle or a backbeat. The combination of these pulses rubbing up against each other is what gave New Orleans R&B its special flavour.\n\nI'm going to try to explain how this works, and to do that I'm going to double-track myself to show those rhythms rubbing against each other.\n\nYou have the backbeat, which we've talked about before -- \"one TWO three FOUR\" -- emphasising the second and fourth beats of the bar, like that.\n\nAnd you have the tresillo, which is \"ONE-and-two-AND-three-and-FOUR-and\" -- emphasising the first, a beat half-way between the two and the three, and the fourth beat. Again, \"ONE-and-two-AND-three-and-FOUR-and\".\n\nYou put those two together, and you get something that sounds like this:\n\n[excerpt -- recording of me demonstrating the two rhythms going up against each other]\n\nThat habanera-backbeat combination is something that, as far as I can tell, Dave Bartholomew and the musicians who worked with him were the first ones to put together (and now I've said that someone will come up with some example from 1870 or something).\n\nThe musicians on \"Country Boy\" were ones that Bartholomew would continue to employ for many years on all the sessions he produced, and in particular they included the drummer Earl Palmer, who was bar none the greatest drummer working in America at that time.\n\nEarl Palmer has been claimed as the first person to use the word \"funky\" to describe music, and he was certainly a funky player. He was also an *extraordinarily* precise timekeeper. There's a legend told about him at multiple sessions that in the studio, after a take that lasted, say, three minutes twenty, the producer might say to the band \"can we have it a little faster, say two seconds shorter?\"\n\nPalmer would then pretend to \"wind up\" his leg, like a clock, count out the new tempo, and the next take would come in at three minutes eighteen, dead on. That's the kind of story that's hard to believe, but it's been told about him by multiple people, so it might just be true.\n\nEither way, Earl Palmer was the tightest, funkiest, just plain best drummer working in the US in 1949, and for many years afterwards. And he was the drummer in the band of session musicians who Dave Bartholomew put together. That band were centred around Cosimo Matassa's studio, J&M, in Louisiana, which would become one of the most important places in the history of this new music.\n\nCosimo Matassa was one of many Italian-American or Jewish people who got in at the very early stages of rock and roll, when it was still a predominantly black music, and acted as a connection between the black and white communities, usually in some back-room capacity. In Matassa's case, it was as an engineer and studio owner. We've actually already heard one record made by him, last week -- Roy Brown's \"Good Rockin' Tonight\", which he recorded with Matassa in 1947. \"Good Rockin' Tonight\" was made in New Orleans, and engineered by the man most responsible for recording the New Orleans sound, but in other respects it doesn't have that New Orleans sound to it -- it's of the type we're referring to as coastal jump band music. It's music recorded *in* New Orleans, but not music *of* New Orleans. But the records that Matassa would go on to engineer with Dave Bartholomew and his band, and with other musicians of their type, would be the quintessential New Orleans records that still, seventy years on, sum up the sound of that city.\n\nMatassa's studio was tiny -- it was in the back room of his family's appliance store, which also had a bookmaker's upstairs and a shoeshine boy operating outside the studio door. Matassa himself had no training in record production -- he'd been a chemistry student until he dropped out of university, aged eighteen, and set up the studio, which was laughably rudimentary by today's standards. He had a three-channel mixer, and they didn't record to tape but directly to disc. They had two disc cutters plugged into the mixer. One of them would cut a safety copy, which they could listen to to see if it sounded OK, while the other would be cutting the master.\n\nTo explain why this is, I should probably explain how records were actually made, at least back then. A disc cutter is essentially a record player in reverse. It uses a stylus to cut a groove into a disc made of some soft material, which is called the master -- the groove is cut by the vibrations of the stylus as the music goes through it. Then, a mould, called the mother, is made of the master -- it's a pure negative copy, so that instead of a groove, it has a ridge. That mother is then used to stamp out as many copies as possible of the record before it wears out -- at which point, you create a new mother from the original master.\n\nThey had two disc cutters, and during a recording session someone's job would be to stand by them and catch the wax they cut out of the discs before it dropped on to the floor -- by this point, most professional studios, if they were using disc cutters at all, were using acetate discs, which are slightly more robust, but apparently J&M were still using wax.\n\nA wax master couldn't be played without the needle causing so much damage it couldn't be used as a master, so you had two choices -- you could either get the master made into a mother, and then use the mother to stamp out copies, and just hope they sounded OK, or you could run two disc cutters simultaneously. Then you'd be able to play one of them -- destroying it in the process -- to check that it sounded OK, and be pretty confident that the other disc, which had been cut from the same signal, would sound the same.\n\nTo record like this, mixing directly onto wax with no tape effects or any way to change anything, you needed a great engineer with a great feel for music, a great room with a wonderful room sound, and fantastic musicians.\n\nTruth be told, the J&M studio didn't have a great room sound at all. It was too small and acoustically dead, and the record companies who received the masters and released them would often end up adding echo after the fact.\n\nBut what they did have was a great engineer in Matassa, and a great bandleader in Dave Bartholomew, and the band he put together for Fats Domino's first record would largely work together for the next few years, creating some of the greatest rock and roll music ever made.\n\nDomino had a few tunes that would always get the audiences going, and one of them was \"Junker's Blues\". Dave Bartholomew wanted him to record that, but it was felt that the lyrics weren't quite suitable for the radio, what with them being pretty much entirely about heroin and cocaine.\n\nBut then Bartholomew got inspired, by a radio show. \"The Fat Man\" was a spinoff from The Thin Man, a radio series based on the Dashiel Hammet novel. (Hammet was credited as the creator of \"The Fat Man\", too, but he seems to have had almost nothing to do with it). The series featured a detective who weighed two hundred and thirty seven pounds, and was popular enough that it got its own film version in 1951. But back in 1949 Dave Bartholomew heard the show and realised that he could capitalise on the popular title, and tie it in to his fat singer. So instead of \"they call me a junker, because I'm loaded all the time\", Domino sang \"they call me the fat man, 'cos I weigh two hundred pounds\".\n\nNow, \"The Fat Man\" actually doesn't have that tresillo rhythm in much of the record. There are odd parts where the bass plays it, but the bass player (who it's *really* difficult to hear anyway, because of the poor sound quality of the recording) seems to switch between playing a tresillo, playing normal boogie basslines, and playing just four root notes as crotchets. But it does, definitely, have that \"Spanish tinge\" that Jelly Roll Morton talked about. You listen to this record, and you have no doubt whatsoever that this is a New Orleans musician. It's music that absolutely couldn't come from anywhere else.\n\n[Excerpt from \"The Fat Man\"]\n\nDomino's scatted vocals here are very reminiscent of the Mills Brothers -- there's a similarity in his trumpet imitation which I've not seen anyone pick up on, but is very real. On later records, there'd be a saxophone solo doing much the same kind of thing -- Domino's later records almost all featured a tenor sax solo, roughly two thirds of the way through the record -- but in this case it's Domino's own voice doing the job.\n\nAnd while this recording doesn't have the rhythmic sophistication of the later records that Domino and Bartholomew would make, it's definitely a step towards what would become their eventual sound. You'd have Earl Palmer on drums playing a simple backbeat, and then over that you'd lay the bass playing a tresillo rhythm, and then over *that* you'd lay a horn riff, going across both those other rhythms, and then over *that* you'd lay Domino's piano, playing fast triplets. You can dance to all of the beats, all of them are keeping time with each other and going in the same 4/4 bars, but what they're not doing is playing the same thing -- there's an astonishing complexity there.\n\nBartholomew's lyrics, to the extent they're about anything at all, follow a standard blues trope of being fat but having the ability to attract women anyway -- the same kind of thing as Howlin' Wolf's later \"Three Hundred Pounds of Joy\" or \"Built for Comfort\" -- but what really matters with the vocal part is Domino's obvious *cheeriness*.\n\nDomino was known as one of the nicest men in the music industry -- to the extent that it's difficult to find much biographical information about him compared to any of his contemporaries, because people tend to have more anecdotes about musicians who shoot their bass player on stage, get married eight times, and end up accidentally suing themselves than they do about people like Fats Domino. He remained married to the same woman for sixty-one years, and while he got himself a nice big house when he became rich, it was still in the same neighbourhood he'd lived in all his life, and he stayed there until Hurricane Katrina drove him out in 2005.\n\nBy all accounts he was just an absolutely, thoroughly, nice person -- I have read a lot about forties rhythm and blues artists, and far more about fifties rock and rollers, and I don't recall anyone ever saying a single negative word about him. He was shy, friendly, humble, gracious, and cheerful, and that all comes across in his vocals. While other rhythm and blues vocalists of the era were aggressive -- remember, this was the era of the blues shouter -- Domino comes across as friendly. Even when, as in a song like this, he's bragging sexually, he doesn't actually sound like he means it.\n\n\"The Fat Man\" went on to sell a million copies within four years, and was the start of what became a monster success for Domino -- and as a result, Fats Domino is the first artist we've seen who's going to get more episodes about him. We've now reached the point where we're seeing the very first rock star -- and this is the point beyond which it's indisputable that rock and roll has started. Fats Domino, usually with Dave Bartholomew, carried on making records that sounded just like this throughout the fifties. Everyone called them rock and roll, and they sold in massive numbers. He outsold every other rock and roll artist of the fifties other than Elvis, and had *thirty-nine* charting hit singles in a row in the fifties and early sixties. Estimates of his sales vary between sixty-five million and a hundred and ten million, but as late as the early eighties it was being seriously claimed that the only people who'd sold more records than him in the rock era were Elvis, the Beatles, and Michael Jackson. Quite a few others have now overtaken him, but still, if anyone can claim to be the first rock star, it's Fats Domino. And as the music he was making was all in the same style as \"The Fat Man\", it's safe to say that while we still have many records that have been claimed as \"the first rock and roll record\" to go, we're now definitely in the rock and roll era.",
  "itunes:subtitle": "Welcome to episode eight of A History of Rock Music in Five Hundred Songs. Today were looking at Fats Domino and The Fat Man. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nA couple of notes:\n\nThis",
  "itunes:keywords": "backbeat,Cosimo Matassa,Dave Bartholomew,Earl Palmer,Fats Domino,Jelly Roll Morton,Louis Gottschalk,New Orleans,tresillo",
  "itunes:episodeType": "full",
  "itunes:episode": 8,
  "content:encoded": "Welcome to episode eight of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Fats Domino and \"The Fat Man\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>A couple of notes:</strong>\n\nThis one originally ran very long, so I've had to edit it down rather ruthlessly -- I know one of the things people like about this podcast is that it only takes half an hour. I also had some technical issues, so you might notice a slight change in audio quality at one point. I think I know what caused the problem, and it shouldn't affect any other episodes.\n\nAlso, this episode is the first episode to discuss someone who's still alive -- we're now getting into the realm of living memory, as Dave Bartholomew is still alive, aged ninety-nine -- and I hope he'll be around for many more years.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-8-the-fat-man/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. The Mixcloud, in fact, was created before I edited this one down, and so contains one song -- \"Junko Partner\" by Dr. John -- that doesn't appear in the finished podcast. But it's a good song anyway.\n\nFats Domino's forties and fifties music is now all in the public domain, so there are all sorts of cheap compilations available. However, the best one is actually one that was released when some of the music was still in copyright -- a four-CD box set called <a href=\"https://amzn.to/2PT704t\"><em>They Call Me The Fat Man: The Legendary Imperial Recordings</em></a>. We'll be talking a lot about Fats in the coming months, and there's a reason for that -- his music is among the best of his era.\n\nThe performance of the Gottschalk piece, \"Danza\", I excerpted is from <a href=\"https://amzn.to/2KwI251\">a CD of performances by Frank French of Gottschalk's piano work</a>. I recommend it to anyone who is interested in the development of American music. I first learned about Gottschalk from his influence on another great Louisiana-raised pianist, Van Dyke Parks, and Parks has excellent orchestral arrangements of Gottschalk's \"Danza\" and \"Night in the Tropics\" on his <a href=\"https://amzn.to/2zpp4ZW\"><em>Moonlighting: Live at the Ash Grove</em></a> album.\n\nI talk early on about <a href=\"https://amzn.to/2DKRLmP\"><em>The Sound of the City</em> by Charlie Gillett</a>. I recommend that book to anyone who's interested in 50s and 60s rock and roll, though it's dated in some respects (most notably, it uses the word \"Negro\" thoughout -- at the time, that was the word that black people considered the most appropriate to describe them, though now it's very much looked upon as inappropriate).\n\nThe only biography of Fats Domino I know of is Rick Coleman's <a href=\"https://amzn.to/2QhFZqP\"><em>Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll</em></a>. It's a very good book, though I don't totally buy Coleman's argument that the rhythms in New Orleans music come directly from African drumming.\n\nThe recording of \"New Orleans Blues\" by Jelly Roll Morton is from a cheap compilation called <em>Doctor Jazz (100 Original Tracks)</em> -- it's labelled \"New Orleans Joys\" there, but it's clearly the same song as \"New Orleans Blues\", which appears in a different recording under that name on the same set. That set also has Morton being interviewed and talking about the \"Spanish tinge\". The precise set I have seems no longer to be available, but<a href=\"https://amzn.to/2QhFZqP\"> this</a> looks very similar.\n\nAnd finally, the intro to this episode comes, of course, from the Fat Man radio show, episodes of which can be found in a collection along with The Thin Man <a href=\"https://amzn.to/2PQkQVn\">here</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nIn his 1970 book <em>The Sound of the City</em>, which was the first attempt at a really serious history of rock and roll, Charlie Gillett also makes the first attempt at a serious typology of the music. He identifies five different styles of music, all of them very different, which loosely got lumped together (in much the same way that country and western or rhythm and blues had) and labelled rock and roll.\n\nThe five styles he identifies are Northern band rock and roll -- people like Bill Haley, whose music came from Western Swing; Memphis country rock -- the music we normally talk about as rockabilly; Chicago rhythm and blues -- Chuck Berry and Bo Diddley; what he calls \"vocal group rock and roll\" but which is now better known as doo-wop; and New Orleans dance blues. I'd add a sixth genre to go in the mix, which is the coastal jump bands -- people like Johnny Otis and Lucky Millinder, based in the big entertainment centres of LA and New York.\n\nSo far, we've talked about the coastal jump bands, and about precursors to the Northern bands, doo-wop, and rockabilly. We haven't yet talked about New Orleans dance blues though. So let's take a trip down the Mississippi.\n\nWe can trace New Orleans' importance in music back at least to the early nineteenth century, and to the first truly great American composer, Louis Moreau Gottschalk.\n\nGottschalk was considered, in his life, an unimportant composer, just another Romantic -- Mark Twain made fun of his style, and he was largely forgotten for decades after his early death. When he was remembered, if at all, it was as a performer -- he was considered the greatest pianist of his generation, a flashy showman of the keyboard, who could make it do things no-one else could. But listen to this:\n\n[Excerpt of \"Danza\"]\n\nThat's a piece composed by someone who knew Chopin and Liszt. Someone who was writing so long ago he *taught someone* who played for Abraham Lincoln. Yet it sounds astonishingly up to date. It sounds like it could easily come from the 1920s or 1930s.\n\nAnd the reason it sounds so advanced, and so modern, is that Gottschalk was the first person to put New Orleans music into some sort of permanent form.\n\nWe don't know -- we can't know -- how much of later New Orleans music was inspired by Gottschalk, and how much of Gottschalk was him copying the music he heard growing up. Undoubtedly there is an element of both -- we know, for example, that Jelly Roll Morton, who was credited (mostly by himself, it has to be said) as the inventor of jazz, knew Gottschalk's work. But we also know that Gottschalk knew and incorporated folk melodies he heard in New Orleans.\n\nAnd that music had a lot of influences from a lot of different places. There were the slave songs, of course, but also the music that came up from the Caribbean because of New Orleans' status as a port city. And after the Civil War there was also the additional factor of the brass band music -- all those brass instruments that had been made for the military, suddenly no longer needed for a war, and available cheap.\n\nGottschalk himself was almost the epitome of a romantic -- he wrote pieces called things like \"the Dying Poet\", he was first exiled from his home in the South due to his support for the North in the Civil War and then later had to leave the US altogether and move to South America after a scandalous affair with a student, and he eventually contracted yellow fever and collapsed on stage shortly after playing a piece called Morte! (with an exclamation mark) which is Portuguese for \"death\". He never recovered from his collapse, and died three weeks later of a quinine overdose.\n\nSo as well as presaging the music of the twentieth century, Gottschalk also presaged the careers of many twentieth-century musicians. Truly ahead of his time.\n\nBut by the middle of the twentieth century, time had caught up to him, and New Orleans had repeatedly revolutionised popular music, often with many of the same techniques that Gottschalk had used.\n\nIn particular, New Orleans became known for its piano virtuosos. We'll undoubtedly cover several of them over the course of this series, but anyone with a love for the piano in popular music knows about the piano professors of New Orleans, and to an extent of Louisiana more widely. Jelly Roll Morton, Professor Longhair, James Booker, Allen Toussaint, Huey \"Piano\" Smith... it's in the piano that New Orleans music has always come into its own.\n\nAnd if there's one song that sums up New Orleans music, more than any other, it's \"Junker's Blues\". You've probably not heard that name before, but you've almost certainly heard the melody:\n\n[section of \"Junker's Blues\" as played by Champion Jack Dupree]\n\nThat's Champion Jack Dupree, in 1940, playing the song. That's the first known recording of it, and Dupree claims songwriting credit on the label, but it was actually written by a New Orleans piano player, Drive-Em Down Hall, some time in the 1920s. Dupree heard the song from Hall, who also apparently taught Dupree his piano style.\n\n\"Junker's Blues\" itself never became a well-known song, but its melody was reused over and over again. Most famously there was the Lloyd Price song \"Lawdy Miss Clawdy\", which we're going to be devoting a full episode to soon, but there was also \"Tipitina\" by Professor Longhair...\n\n[section of \"Tipitina\"]\n\n\"Tee Nah Nah\"\n\n[\"Tee Nah Nah\" -- Smiley Lewis]\n\nAnd more. This one melody, by a long-dead unknown New Orleans piano player, has been performed under various names and with different sets of lyrics, by everyone from the Clash to the zydeco accordion player Clifton Chenier, by way of Elvis, Doctor John, and even Hugh Laurie.\n\nBut the most important recording of it was in 1949, by a New Orleans piano player called Fats Domino. And in his version, it became one of those songs that is often considered to be \"the first rock and roll record\".\n\nFats Domino was not someone who could have become a rock star even a few years later. He was not mean and moody and slim, he was a big cheerful fat man, who spoke Louisiana Creole as his first language. He was never going to be a sex symbol. But he had a way of performing that made people happy, and made them want to dance, and in 1949 that was the most important thing for a musician to do.\n\nHe grew up in a kind of poverty that's hard to imagine now -- his family *did* have a record player, but it was a wind-up one, not an electrical one, and eventually the winding string broke, but young Antoine Domino loved music so much that he would sit at the record player and manually turn the records using his finger so he could still listen to them.\n\nBy 1949, Domino had become a minor celebrity among black music fans in New Orleans, more for his piano playing than for his singing. He was known as one of the best boogie woogie players around, with a unique style based on triplets rather than the more straightforward rhythms many boogie pianists used. He'd played, for example, with Roy Brown, although Domino and his entire band got dropped by Brown after Domino sang a few numbers on stage himself during a show -- Brown said he was only paying Domino to play piano, not to sing and upstage him.\n\nBut minor celebrities in local music scenes are still only minor celebrities -- and at aged twenty-one Fats Domino already had a family, and was living in a room in his in-laws' house with his wife and kids, working a day job at a mattress factory, and working a second job selling crushed ice with syrup to kids, to try to make ends meet. Piano playing wasn't exactly a way to make it rich, unless you got on records.\n\nSomeone who *had* made records, and was the biggest musician in New Orleans at the time, was Dave Bartholomew; and Bartholomew, who was working for Imperial Records, suggested that the label sign Domino.\n\nLike many musicians in New Orleans in the late forties, Dave Bartholomew learned his musical skills while he was in the Army during World War II -- he'd already been able to play the trumpet, having been taught by the same man who taught Louis Armstrong, but once he was put into a military brass band he had to learn more formal musical skills, including writing and arranging.\n\nAfter getting out of the army, he got work as an A&R man for Imperial Records, and he also formed his own band, the Dave Bartholomew Orchestra, who had a hit with \"Country Boy\"\n\n[excerpt of \"Country Boy\" by the Dave Bartholomew Orchestra]\n\nNow, something you may notice about that song is that \"dan, dah-dah\" horn part. That may sound absolutely cliched to you now, but that was the first time anything like that had been used in an R&B record. And we can link that horn part back to the Gottschalk piece we heard earlier by its use of a rhythm called the tresillo (pronounced tray heel oh). The tresillo is one of a variety of related rhythms that are all known as \"habanera\" rhythms. That word means \"from Havana\", and was used to describe any music that was influenced by the dance music -- Danzas, like the title of the Gottschalk piece -- coming out of Cuba in the mid nineteenth century.\n\nThe other major rhythm that came from the habanera is the clave, which is a two-bar rhythm. The first bar is a tresilo, and the second is just a \"bam bam\" [demonstrates]. That beat is one we'll be seeing a lot of in the future.\n\nThese rhythms were the basis of the original tango -- which didn't have the beat that we now associate with the tango, but instead had that \"dan, dah-dah\" rhythm (or rhythms like it, like the cinquillo). And through Gottschalk and people like him -- French-speaking Creole people living in New Orleans -- that rhythm entered New Orleans music generally. Jelly Roll Morton called it the \"Spanish tinge\". Have a listen, for example, to Jelly Roll's \"New Orleans Blues\":\n\n[excerpt \"New Orleans Blues\" by Jelly Roll Morton]\n\nJelly Roll claimed to have written that as early as 1902, and the first recording of it was in 1923. It's the tresillo rhythm underpinning it. From Gottschalk, to Jelly Roll Morton, to Dave Bartholomew. That was the sound of New Orleans, travelling across the generations.\n\nBut what really made that rhythm interesting was when you put that \"dah dah dah\" up against something else -- on those early compositions, you have that rhythm as the main pulse, but by the time Dave Bartholomew was doing it -- and he seems to have been the first one to do this -- that rhythm was put against drums playing a shuffle or a backbeat. The combination of these pulses rubbing up against each other is what gave New Orleans R&B its special flavour.\n\nI'm going to try to explain how this works, and to do that I'm going to double-track myself to show those rhythms rubbing against each other.\n\nYou have the backbeat, which we've talked about before -- \"one TWO three FOUR\" -- emphasising the second and fourth beats of the bar, like that.\n\nAnd you have the tresillo, which is \"ONE-and-two-AND-three-and-FOUR-and\" -- emphasising the first, a beat half-way between the two and the three, and the fourth beat. Again, \"ONE-and-two-AND-three-and-FOUR-and\".\n\nYou put those two together, and you get something that sounds like this:\n\n[excerpt -- recording of me demonstrating the two rhythms going up against each other]\n\nThat habanera-backbeat combination is something that, as far as I can tell, Dave Bartholomew and the musicians who worked with him were the first ones to put together (and now I've said that someone will come up with some example from 1870 or something).\n\nThe musicians on \"Country Boy\" were ones that Bartholomew would continue to employ for many years on all the sessions he produced, and in particular they included the drummer Earl Palmer, who was bar none the greatest drummer working in America at that time.\n\nEarl Palmer has been claimed as the first person to use the word \"funky\" to describe music, and he was certainly a funky player. He was also an *extraordinarily* precise timekeeper. There's a legend told about him at multiple sessions that in the studio, after a take that lasted, say, three minutes twenty, the producer might say to the band \"can we have it a little faster, say two seconds shorter?\"\n\nPalmer would then pretend to \"wind up\" his leg, like a clock, count out the new tempo, and the next take would come in at three minutes eighteen, dead on. That's the kind of story that's hard to believe, but it's been told about him by multiple people, so it might just be true.\n\nEither way, Earl Palmer was the tightest, funkiest, just plain best drummer working in the US in 1949, and for many years afterwards. And he was the drummer in the band of session musicians who Dave Bartholomew put together. That band were centred around Cosimo Matassa's studio, J&M, in Louisiana, which would become one of the most important places in the history of this new music.\n\nCosimo Matassa was one of many Italian-American or Jewish people who got in at the very early stages of rock and roll, when it was still a predominantly black music, and acted as a connection between the black and white communities, usually in some back-room capacity. In Matassa's case, it was as an engineer and studio owner. We've actually already heard one record made by him, last week -- Roy Brown's \"Good Rockin' Tonight\", which he recorded with Matassa in 1947. \"Good Rockin' Tonight\" was made in New Orleans, and engineered by the man most responsible for recording the New Orleans sound, but in other respects it doesn't have that New Orleans sound to it -- it's of the type we're referring to as coastal jump band music. It's music recorded *in* New Orleans, but not music *of* New Orleans. But the records that Matassa would go on to engineer with Dave Bartholomew and his band, and with other musicians of their type, would be the quintessential New Orleans records that still, seventy years on, sum up the sound of that city.\n\nMatassa's studio was tiny -- it was in the back room of his family's appliance store, which also had a bookmaker's upstairs and a shoeshine boy operating outside the studio door. Matassa himself had no training in record production -- he'd been a chemistry student until he dropped out of university, aged eighteen, and set up the studio, which was laughably rudimentary by today's standards. He had a three-channel mixer, and they didn't record to tape but directly to disc. They had two disc cutters plugged into the mixer. One of them would cut a safety copy, which they could listen to to see if it sounded OK, while the other would be cutting the master.\n\nTo explain why this is, I should probably explain how records were actually made, at least back then. A disc cutter is essentially a record player in reverse. It uses a stylus to cut a groove into a disc made of some soft material, which is called the master -- the groove is cut by the vibrations of the stylus as the music goes through it. Then, a mould, called the mother, is made of the master -- it's a pure negative copy, so that instead of a groove, it has a ridge. That mother is then used to stamp out as many copies as possible of the record before it wears out -- at which point, you create a new mother from the original master.\n\nThey had two disc cutters, and during a recording session someone's job would be to stand by them and catch the wax they cut out of the discs before it dropped on to the floor -- by this point, most professional studios, if they were using disc cutters at all, were using acetate discs, which are slightly more robust, but apparently J&M were still using wax.\n\nA wax master couldn't be played without the needle causing so much damage it couldn't be used as a master, so you had two choices -- you could either get the master made into a mother, and then use the mother to stamp out copies, and just hope they sounded OK, or you could run two disc cutters simultaneously. Then you'd be able to play one of them -- destroying it in the process -- to check that it sounded OK, and be pretty confident that the other disc, which had been cut from the same signal, would sound the same.\n\nTo record like this, mixing directly onto wax with no tape effects or any way to change anything, you needed a great engineer with a great feel for music, a great room with a wonderful room sound, and fantastic musicians.\n\nTruth be told, the J&M studio didn't have a great room sound at all. It was too small and acoustically dead, and the record companies who received the masters and released them would often end up adding echo after the fact.\n\nBut what they did have was a great engineer in Matassa, and a great bandleader in Dave Bartholomew, and the band he put together for Fats Domino's first record would largely work together for the next few years, creating some of the greatest rock and roll music ever made.\n\nDomino had a few tunes that would always get the audiences going, and one of them was \"Junker's Blues\". Dave Bartholomew wanted him to record that, but it was felt that the lyrics weren't quite suitable for the radio, what with them being pretty much entirely about heroin and cocaine.\n\nBut then Bartholomew got inspired, by a radio show. \"The Fat Man\" was a spinoff from The Thin Man, a radio series based on the Dashiel Hammet novel. (Hammet was credited as the creator of \"The Fat Man\", too, but he seems to have had almost nothing to do with it). The series featured a detective who weighed two hundred and thirty seven pounds, and was popular enough that it got its own film version in 1951. But back in 1949 Dave Bartholomew heard the show and realised that he could capitalise on the popular title, and tie it in to his fat singer. So instead of \"they call me a junker, because I'm loaded all the time\", Domino sang \"they call me the fat man, 'cos I weigh two hundred pounds\".\n\nNow, \"The Fat Man\" actually doesn't have that tresillo rhythm in much of the record. There are odd parts where the bass plays it, but the bass player (who it's *really* difficult to hear anyway, because of the poor sound quality of the recording) seems to switch between playing a tresillo, playing normal boogie basslines, and playing just four root notes as crotchets. But it does, definitely, have that \"Spanish tinge\" that Jelly Roll Morton talked about. You listen to this record, and you have no doubt whatsoever that this is a New Orleans musician. It's music that absolutely couldn't come from anywhere else.\n\n[Excerpt from \"The Fat Man\"]\n\nDomino's scatted vocals here are very reminiscent of the Mills Brothers -- there's a similarity in his trumpet imitation which I've not seen anyone pick up on, but is very real. On later records, there'd be a saxophone solo doing much the same kind of thing -- Domino's later records almost all featured a tenor sax solo, roughly two thirds of the way through the record -- but in this case it's Domino's own voice doing the job.\n\nAnd while this recording doesn't have the rhythmic sophistication of the later records that Domino and Bartholomew would make, it's definitely a step towards what would become their eventual sound. You'd have Earl Palmer on drums playing a simple backbeat, and then over that you'd lay the bass playing a tresillo rhythm, and then over *that* you'd lay a horn riff, going across both those other rhythms, and then over *that* you'd lay Domino's piano, playing fast triplets. You can dance to all of the beats, all of them are keeping time with each other and going in the same 4/4 bars, but what they're not doing is playing the same thing -- there's an astonishing complexity there.\n\nBartholomew's lyrics, to the extent they're about anything at all, follow a standard blues trope of being fat but having the ability to attract women anyway -- the same kind of thing as Howlin' Wolf's later \"Three Hundred Pounds of Joy\" or \"Built for Comfort\" -- but what really matters with the vocal part is Domino's obvious *cheeriness*.\n\nDomino was known as one of the nicest men in the music industry -- to the extent that it's difficult to find much biographical information about him compared to any of his contemporaries, because people tend to have more anecdotes about musicians who shoot their bass player on stage, get married eight times, and end up accidentally suing themselves than they do about people like Fats Domino. He remained married to the same woman for sixty-one years, and while he got himself a nice big house when he became rich, it was still in the same neighbourhood he'd lived in all his life, and he stayed there until Hurricane Katrina drove him out in 2005.\n\nBy all accounts he was just an absolutely, thoroughly, nice person -- I have read a lot about forties rhythm and blues artists, and far more about fifties rock and rollers, and I don't recall anyone ever saying a single negative word about him. He was shy, friendly, humble, gracious, and cheerful, and that all comes across in his vocals. While other rhythm and blues vocalists of the era were aggressive -- remember, this was the era of the blues shouter -- Domino comes across as friendly. Even when, as in a song like this, he's bragging sexually, he doesn't actually sound like he means it.\n\n\"The Fat Man\" went on to sell a million copies within four years, and was the start of what became a monster success for Domino -- and as a result, Fats Domino is the first artist we've seen who's going to get more episodes about him. We've now reached the point where we're seeing the very first rock star -- and this is the point beyond which it's indisputable that rock and roll has started. Fats Domino, usually with Dave Bartholomew, carried on making records that sounded just like this throughout the fifties. Everyone called them rock and roll, and they sold in massive numbers. He outsold every other rock and roll artist of the fifties other than Elvis, and had *thirty-nine* charting hit singles in a row in the fifties and early sixties. Estimates of his sales vary between sixty-five million and a hundred and ten million, but as late as the early eighties it was being seriously claimed that the only people who'd sold more records than him in the rock era were Elvis, the Beatles, and Michael Jackson. Quite a few others have now overtaken him, but still, if anyone can claim to be the first rock star, it's Fats Domino. And as the music he was making was all in the same style as \"The Fat Man\", it's safe to say that while we still have many records that have been claimed as \"the first rock and roll record\" to go, we're now definitely in the rock and roll era.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode eight of A History of Rock Music in Five Hundred Songs. Today we're looking at Fats Domino and \"The Fat Man\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nA couple of notes:\n\nThis one originally ran very long, so I've had to edit it down rather ruthlessly -- I know one of the things people like about this podcast is that it only takes half an hour. I also had some technical issues, so you might notice a slight change in audio quality at one point. I think I know what caused the problem, and it shouldn't affect any other episodes.\n\nAlso, this episode is the first episode to discuss someone who's still alive -- we're now getting into the realm of living memory, as Dave Bartholomew is still alive, aged ninety-nine -- and I hope he'll be around for many more years.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. The Mixcloud, in fact, was created before I edited this one down, and so contains one song -- \"Junko Partner\" by Dr. John -- that doesn't appear in the finished podcast. But it's a good song anyway.\n\nFats Domino's forties and fifties music is now all in the public domain, so there are all sorts of cheap compilations available. However, the best one is actually one that was released when some of the music was still in copyright -- a four-CD box set called They Call Me The Fat Man: The Legendary Imperial Recordings. We'll be talking a lot about Fats in the coming months, and there's a reason for that -- his music is among the best of his era.\n\nThe performance of the Gottschalk piece, \"Danza\", I excerpted is from a CD of performances by Frank French of Gottschalk's piano work. I recommend it to anyone who is interested in the development of American music. I first learned about Gottschalk from his influence on another great Louisiana-raised pianist, Van Dyke Parks, and Parks has excellent orchestral arrangements of Gottschalk's \"Danza\" and \"Night in the Tropics\" on his Moonlighting: Live at the Ash Grove album.\n\nI talk early on about The Sound of the City by Charlie Gillett. I recommend that book to anyone who's interested in 50s and 60s rock and roll, though it's dated in some respects (most notably, it uses the word \"Negro\" thoughout -- at the time, that was the word that black people considered the most appropriate to describe them, though now it's very much looked upon as inappropriate).\n\nThe only biography of Fats Domino I know of is Rick Coleman's Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll. It's a very good book, though I don't totally buy Coleman's argument that the rhythms in New Orleans music come directly from African drumming.\n\nThe recording of \"New Orleans Blues\" by Jelly Roll Morton is from a cheap compilation called Doctor Jazz (100 Original Tracks) -- it's labelled \"New Orleans Joys\" there, but it's clearly the same song as \"New Orleans Blues\", which appears in a different recording under that name on the same set. That set also has Morton being interviewed and talking about the \"Spanish tinge\". The precise set I have seems no longer to be available, but this looks very similar.\n\nAnd finally, the intro to this episode comes, of course, from the Fat Man radio show, episodes of which can be found in a collection along with The Thin Man here.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nIn his 1970 book The Sound of the City, which was the first attempt at a really serious history of rock and roll, Charlie Gillett also makes the first attempt at a serious typology of the music. He identifies five different styles of music, all of them very different, which loosely got lumped together (in much the same way that country and western or rhythm and blues had) and labelled rock and roll.\n\nThe five styles he identifies are Northern band rock and roll -- people like Bill Haley, whose musi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode eight of A History of Rock Music in Five Hundred Songs. Today we're looking at Fats Domino and \"The Fat Man\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nA couple of notes:\n\nThis one originally ran very long, so I've had to edit it down rather ruthlessly -- I know one of the things people like about this podcast is that it only takes half an hour. I also had some technical issues, so you might notice a slight change in audio quality at one point. I think I know what caused the problem, and it shouldn't affect any other episodes.\n\nAlso, this episode is the first episode to discuss someone who's still alive -- we're now getting into the realm of living memory, as Dave Bartholomew is still alive, aged ninety-nine -- and I hope he'll be around for many more years.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. The Mixcloud, in fact, was crea",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}