{
  "title": "TU69: Exploring Intersecting Genders &#8211; What We Can All Learn with Guest Li Brookens",
  "link": "https://therapistuncensored.com/episodes/tu69-exploring-intersecting-genders-what-we-can-all-learn-with-guest-li-brookens/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu69-exploring-intersecting-genders-what-we-can-all-learn-with-guest-li-brookens",
  "pubDate": "Tue, 10 Jul 2018 11:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6212",
  "description": "Exploring Intersecting Genders - What We Can All Learn\nWalk through the discovery experience of coming to understand yourself as transgender and see how coming to truly discover and embrace yourself relates to everyone, not just those who identify as non-binary.\n\nTherapist Uncensored co-host Sue Marriott LCSW, CGP joins Umbrella Collective founder, clinical social worker, psychotherapist and parent Li Brookens in a lively discussion on recognizing the complexities (and social implications) of defining oneself as non-binary. They discuss what therapists need to know in working with these populations, and share great resources to follow up. Their sweet conversation captures the human development across ages to the struggle and pride of landing in a place with oneself that feels like home.\n\nThey also talk about how to differentiate terms like gender and sex and the importance of a non-binary conception when discussing identity. We think you’ll enjoy it and learn something no matter your gender identity!\n\nWHO IS LI?\n\nLi Brookens is a licensed clinical social worker (LCSW), certified group psychotherapist (CGP), and clinical hypnotherapist providing psychotherapy for individuals, couples, and groups in Boulder, Colorado. Li is the founder of their group practice, the Umbrella Collective that specializes in psychotherapy for your intersecting identities. Li has advanced skills in working with LGBTQ+ identities, young adults, and groups. Li works collaboratively with clients weaving together modern psychodynamic theory and postmodern therapy using a social justice lens that centers on marginalized identities. “I believe that each client I work with has an inner knowing that is seeking to be uncovered. I see my job as helping my clients excavate that knowledge so they can empower themselves to make meaningful changes in their lives.”\n\n0:00-15:00\n\nIntroduction\n\nLi’s own experience growing up, maturing and discovering their gender identity as non-binary\n\n15:00-30:00\n\nRemoving binary thinking from identity and opening up a world for identity\n\nCounter transference\n\nDefining “cisgender”, transgender as anyone who transgresses gender norms\n\nGender assignment vs. sex assignment, sexual orientation, sex role\n\nNon-gender specific pronouns such as “they”\n\n30:00-50:00\n\nPreferred terms vs defining terms; it’s not a preference, it just is.\n\nAddressing being trans in a general therapy sessions\n\nGender dysphoria\n\nHaving a problem with anxiety vs. having anxiety about having a problem\n\nResources, how best to address transgender people as therapists, familiarizing yourself with the gender spectrum\n\nWrap up and outro\n\n \n\nReferences/Resources:\n\nThe Colonized Mind: Gender Trauma and Mentalization by Sarah Silverman – excellent clinical article from therapists perspective, one of Li’s favorite’s!\n\nWPath.org (World Psychological Organization for Transgender Health)    THIS IS A MUST SEE -Ethical Standards, be familiar with these if you are a therapist. Great resource!\n\nGender Spectrum for families Another awesome resource, this has tons of great material for anyone interested in learning more! Share freely.\n\nUmbrella Collective – how to get in touch with Li Brookens\n\nKUT Views & Brews: “Being Trans in Texas Today”\n\n\n\nWe appreciate our sponsor TheraNest! \n\nOur show is not just for mental health professionals AT ALL, but if you are a mental health professional, you will appreciate our sponsor as well! Most of us do not want to spend our time on the business aspect of our practice.\n\nTheraNest is a practice management software that will help you streamline and manage your entire practice with ease. They provide HIPPA compliant documentation, full-featured calendar (even with text reminders!), insurance and client billing, credit card processing and live customer service. Our listeners receiving 20% discount on first three months if you sign up with TheraNest.com/Therapistuncensored.",
  "enclosure": "",
  "itunes:subtitle": "Exploring Intersecting Genders - What We Can All Learn Walk through the discovery experience of coming to understand yourself as transgender and see how coming to truly discover and embrace yourself relates to everyone,",
  "itunes:summary": "Walk through the discovery experience of coming to understand yourself as transgender and see how this coming to know yourself relates to everyone, not just those who identify as non-binary.   What&apos;s the difference between transgender and butch lesbian, sex, gender and sexual orientation, tomboy and trans... and what&apos;s the deal with the strange pronouns. Find out here.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "50:48"
}