{
  "title": "Episode 28: &#8220;Sincerely&#8221; by the Moonglows",
  "link": "https://500songs.com/podcast/episode-28-sincerely-by-the-moonglows/",
  "pubDate": "Sun, 14 Apr 2019 08:42:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=672",
  "description": "Welcome to episode twenty-eight of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at The Moonglows and \"Sincerely\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-28-sincerely/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nFor the background on Charlie Fuqua, see episode six, on <a href=\"https://www.500songs.com/e/episode-6-the-ink-spots-thats-when-your-heartaches-begin/\">the Ink Spots</a>.\n\nThere are no books on the Moonglows, but as always with vocal groups of the fifties, <a href=\"http://www.uncamarvy.com/Moonglows/moonglows.html\">Marv Goldberg</a> has an exhaustively-researched page from which I got most of the information about them.\n\nThe information on Alan Freed comes from<a href=\"https://amzn.to/2VLllii\"><em> Big Beat Heat: Alan Freed and the Early Years of Rock & Roll</em></a> by John A. Jackson.\n\nAnd <a href=\"https://amzn.to/2Pi2NUJ\">this compilation</a> contains every recording by every lineup of Moonglows and Moonlighters, apart from the brief 1970s reunion.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n[13 seconds of Intro from a recording of Alan Freed: “Hello, everybody, how you all? This is Alan Freed, the old King of the Moondoggers, and a hearty welcome to all our thousands of friends in Northern Ohio, Ontario Canada, Western New York, Western Pennsylvania, West Virginia. Long about eleven thirty, fifteen minutes from now, we'll be joining the Moondog Network...”]\n\nChess Records is one of those labels, like Sun or Stax or PWL, which defined a whole genre. And in the case of Chess, the genre it defined was the electric Chicago blues. People like Muddy Waters, Elmore James, Howlin' Wolf, Little Walter, and Willie Dixon all cut some of their most important recordings for the Chess label. I remember when I was just starting to buy records as a child, decades after the events we're talking about, I knew before I left primary school that Chess, like Sun, was one of the two record labels that consistently put out music that I liked.\n\nAnd yet when it started out, Chess Records was just one of dozens of tiny little indie blues labels, like Modern, or RPM, or King Records, or Duke or Peacock, many of which were even putting out records by the same people who were recording for Chess. So this episode is actually part one of a trilogy, and over the next three episodes, we're going to talk about how Chess ended up being the one label that defined that music in the eyes of many listeners, and how that music fed into early rock and roll. And today we're also going to talk about how it ended up being influential in the formation of another of those important record labels.\n\nAnd to talk about that, we're going to talk about Harvey Fuqua [Foo-kwah]. Yes, Fuqua. Even though we talked about his uncle, Charlie Fuqua [Foo-kway], back in the episode on the Ink Spots, apparently Harvey pronounced his name differently from his uncle.\n\nAs you might imagine, having an uncle in the most important black vocal group in history gave young Harvey Fuqua quite an impetus, even though the two of them weren't close.\n\nFuqua started a duo with his friend Bobby Lester after they both got out of the military. Fuqua would play piano, and they would both sing. The two of them had a small amount of success, touring the South, but then shortly after their first tour Fuqua had about the worst thing possible happen to him -- there was a fire, and both his children died in it. Understandably, he didn't want to stay in Louisville Kentucky, where he'd been raising his family, so he and his wife moved to Cleveland.\n\nWhen he got to Cleveland, he met up again with an old friend from his military days, Danny Coggins. The two of them started performing together with a bass singer, Prentiss Barnes, under the name The Crazy Sounds.\n\nThe style they were performing in was called \"vocalese\", and it's a really odd style of jazz singing that's... the easiest way to explain it is the opposite of scat singing. In scat, you improvise a new melody with nonsense lyrics [demonstrates] -- that's the standard form of jazz singing, other than just singing the song straight. It's what Louis Armstrong or Ella Fitzgerald or whoever would do.\n\nIn vocalese, on the other hand, you do the opposite. You come up with proper lyrics, not just nonsense syllables, and you put them to a pre-recorded melody. The twist is that the pre-recorded melody you choose is a melody that's already been improvised by an instrumentalist. So for example, you could take Coleman Hawkins' great sax solo on \"Body and Soul\":\n\n[Excerpt: Coleman Hawkins, \"Body and Soul\"]\n\nHawkins improvised that melody line, and it was a one-off performance -- every other time he played the song he'd play it differently. But Eddie Jefferson, who is credited as the inventor of vocalese, learned Hawkins' solo, added words, and sang this:\n\n[Excerpt: Eddie Jefferson, \"Body and Soul\"]\n\nThe Crazy Sounds performed this kind of music as a vocal trio for a while, but their sound was missing something, and eventually Fuqua travelled down to Kentucky and persuaded Bobby Lester to move to Cleveland and join the Crazy Sounds. They became a four-piece, and slowly started writing their own new material in a more R&B style.\n\nThey performed together a little, and eventually auditioned at a club called the Loop, where they were heard by a blues singer called Al \"Fats\" Thomas. Thomas apparently recorded for several labels, but this is the only one of his records I can find a copy of anywhere, on the Chess subsidiary Checker, from right around the time we're talking about in 1952:\n\n[Excerpt: Al \"Fats\" Thomas, \"Baby Please No No\"]\n\nFats Thomas was very impressed by the Crazy Sounds, and immediately phoned his friend, the DJ Alan Freed.\n\nAlan Freed is a difficult character to explain, and his position in rock and roll history is a murky one. He was the first superstar DJ, and he was the person who more than anyone else made the phrase \"rock and roll\" into a term for a style of music, rather than, as it had been, just a phrase that was used in some of that music.\n\nFreed had not started out as a rhythm and blues or rock and roll DJ, and in fact had no great love for the music when he started playing it on his show. He was a lover of classical music -- particularly Wagner, whose music he loved so much that he named one of his daughters Sieglinde. But he named his first daughter Alana, which shows his other great love, which was for himself.\n\nFreed had been a DJ for several years when he was first introduced to rhythm and blues music, and he'd played a mixture of big band music and light classical, depending on what the audience wanted. But then, in 1951, something changed. Freed met Leo Mintz, the owner of a record shop named Record Rendezvous, in a bar. Mintz discovered that Freed was a DJ and took him to the shop. Freed later mythologised this moment, as he did a lot of his life, by talking about how he was shocked to see white teenagers dancing to music made by black people, and he had a sort of Damascene conversion and immediately decided to devote his show to rhythm and blues.\n\nThe reality is far more prosaic. Mintz, whose business actually mostly sold to black people at this point, decided that if there was a rhythm and blues radio show then it would boost business to his shop, especially if Mintz paid for the radio show and so bought all the advertising on it. He took Freed to the shop to show him that there was indeed an audience for that kind of music, and Freed was impressed, but said that he didn't know anything about rhythm and blues music. Mintz said that that didn't matter. Mintz would pick the records -- they'd be the ones that he wanted his customers to buy -- and tell Freed what to play. All Freed had to do was to play the ones he was told and everything would work out fine.\n\nThe music Mintz had played for Freed was, according to Freed later, people like LaVern Baker -- who had not yet become at all well known outside Detroit and Chicago at the time -- but Mintz set about putting together selections of records that Freed should play. Those records were mostly things with gospel-sounding vocals, a dance beat, or honking saxophones, and Freed found that his audiences responded astonishingly well to it.\n\nFreed would often interject during records, and would bang his fists on the table or other objects in time to the beat, including a cowbell that he had on his desk -- apparently some of his listeners would be annoyed when they bought the records he played to find out half the sounds they'd heard weren't on the record at all.\n\nFreed took the stage name \"Moondog\", after a blind New York street musician and outsider artist of that name. Freed's theme song for his radio show was \"Moondog Symphony\", by Moondog, a one-man-band performance credited to \"Moondog (by himself) playing drums, maracas, claves, gourds, hollow legs, Chinese block and cymbals.\"\n\n[Excerpt: \"Moondog Symphony\" by Moondog]\n\nWhen Fats Thomas got the Crazy Sounds an audition with Freed, Freed was impressed enough that he offered them a management contract. Being managed by the biggest DJ in the city was obviously a good idea, so they took him up on that, and took his advice about how to make themselves more commercial, including changing their name to emphasise the connection to Freed. They became first the Moonpuppies and then the Moonglows.\n\nFreed set up his own record label, Champagne Records, and released the Moonglows' first single, \"I Just Can't Tell No Lie\":\n\n[Excerpt, \"I Just Can't Tell No Lie\", the Moonglows]\n\nAccording to Freed's biographer John A. Jackson, Freed provided additional percussion on that song, hitting a telephone book in time with the rhythm as he would on his show. I don't hear any percussion on there other than the drum kit, but maybe you can, if you have better ears than me.\n\nThis was a song that had been written by the Moonglows themselves, but when the record came out, both sides were credited to Al Lance -- which was a pseudonym for Alan Freed. And so the DJ who was pushing their record on the radio was also their manager, and the owner of the record company, and the credited songwriter. Unsurprisingly, then, Freed promoted \"I Just Can't Tell No Lie\" heavily on his radio show, but it did nothing anywhere outside of Cleveland and the immediately surrounding area. Danny Coggins quit the group, fed up with their lack of success, and he was replaced by a singer who variously went under the names Alex Graves, Alex Walton, Pete Graves, and Pete Walton. Freed closed down Champagne Records.\n\nFor a time it looked like the Moonglows' career was going to have peaked with their one single, as Freed signed another vocal group, the Coronets, and got them signed to Chess Records in Chicago.\n\nChess was a blues label, which had started in 1947 as Aristocrat Records, but in 1948 it was bought out by two brothers, Leonard and Phil Chess, who had emigrated from Poland as children and Anglicised their names. Their father was in the liquor business during the Prohibition era, which in Chicago meant he was involved with Al Capone, and in their twenties the Chess brothers had started running nightclubs in the black area of Chicago.\n\nChess, at its start, had the artists who had originally recorded for Aristocrat -- people like Muddy Waters and Sunnyland Slim, and they also licensed records made by Sam Phillips in Memphis, and because of that put out early recordings by Howlin' Wolf, before just poaching Wolf for their own label, and Jackie Brenston's \"Rocket 88\".\n\nBy 1954, thanks largely to their in-house bass player and songwriter Willie Dixon, Chess had become known as the home of electric Chicago blues, and were putting out classic after classic in that genre. But they were still interested in putting out other styles of black music too, and were happy to sign up doo-wop groups.\n\nThe Coronets put out a single, \"Nadine\", on Chess, which did very well. The credited writer was Alan Freed:\n\n[Excerpt: \"Nadine\", the Coronets]\n\nThe Coronets' follow-up single did less well, though, and Chess dropped them.\n\nBut Freed had been trying for some time to make a parallel career as a concert promoter, and indeed a few months before he signed the Moonglows to a management contract he had put on what is now considered the first major rock and roll concert -- the Moondog Coronation Ball, at the Cleveland Arena. That show had been Freed's first inkling of just how popular he and the music he was playing were becoming -- twenty thousand people tried to get into the show, even though the arena only had a capacity of ten thousand, and the show had to be cancelled after the first song by the first performer, because it was becoming unsafe to continue.\n\nBut Freed put on further shows at the arena, with better organisation, and in August 1953 he put on \"the Big Rhythm and Blues Show\". This featured Fats Domino and Big Joe Turner, and the Moonglows were also put on the bill. As a result of their appearance on the show, they got signed to Chance Records, a small label whose biggest act was the doo-wop group The Flamingos. Freed didn't own this label of course, but by this time he'd got into the record distribution business, and the distribution company he co-owned was Chance's distributor in the Cleveland area. The other co-owner was the owner of Chance Records, and Freed's brother was the distributor's vice-president and in charge of running it.\n\nThe Moonglows' first single on Chance, a Christmas single, did nothing in the charts, but they followed it with a rather unusual choice.\n\n\"Secret Love\" was a hit for Doris Day, from the soundtrack of her film \"Calamity Jane\":\n\n[Excerpt: Doris Day, \"Secret Love\"]\n\nIn the context of the film, which has a certain amount of what we would now call queerbaiting, that song can be read as a song about lesbianism or bisexuality. But that didn't stop a lot of male artists covering it for other markets. We've talked before about how popular songs would be recorded in different genres, and so Day's pop version was accompanied by Slim Whitman's country version and by this by the Moonglows:\n\n[Excerpt: the Moonglows, \"Secret Love\"]\n\nUnfortunately, a fortnight after the Moonglows released their version, the Orioles, who were a much more successful doo-wop group, released their own record of the song, and the two competed for the same market. However, \"Secret Love\" did well enough, given a promotional push by Freed, that it became apparent that the Moonglows could have a proper career. It sold over a hundred thousand copies, but then the next few records on Chance failed to sell, and Chance closed down when their biggest act, the Flamingos, moved first to Parrot Records, and then quickly on to Chess.\n\nIt seemed like everything was against the Moonglows, but they were about to get a big boost, thanks in part to a strike.\n\nWINS radio in New York had been taken over at a rock-bottom price by an investment consortium who wanted to turn the money-losing station into a money-maker. It had a powerful transmitter, and if they could boost listenership they would almost certainly be able to sell it on at a massive profit.\n\nOne of the first things the new owners did was to sack their house band -- they weren't going to pay musicians any more, as live music was too expensive. This caused the American Federation of Musicians to picket the station, which was expected and understandable.\n\nBut WINS also had the broadcast rights to the New York Yankees games -- indeed, the ball games were the only really popular thing that the station had. And so the AFM started to picket Yankee Stadium too. On the week of the starting game for what looked to be the Yankees' sixth World Series win in a row.\n\nThat game would normally have had the opening ball thrown by the Mayor of New York, but the Mayor, Robert Wagner, rather admirably refused to cross a picket line. The Bronx borough president substituted for him -- and threw the opening ball right into the stomach of a newspaper photographer.\n\nWINS now desperately needed something to go right for them, and they realised Freed's immense drawing power. They signed him for the unprecedented sum of seventy-five thousand dollars a year, and Freed moved from the mid-market town of Cleveland to a huge, powerful, transmitter in New York. He instantly became the most popular DJ in New York, and probably the best-known DJ in the world.\n\nAnd with his great power came record labels wanting to do Freed favours. He was already friends with the Chess brothers, and with the sure knowledge that any record the Moonglows put out would get airplay from Freed, they eagerly signed the Moonglows and put out \"Sincerely\":\n\n[Excerpt: The Moonglows, \"Sincerely\"]\n\n\"Sincerely\" featured Bobby Lester on lead vocals, but the song was written by Harvey Fuqua. Or, as the label credited it, Harvey Fuqua and Alan Freed. But while those were the two credited writers, the song owes more than a little to another one. Here's the bridge for \"Sincerely\":\n\n[Excerpt: The Moonglows, \"Sincerely\"]\n\nAnd here's the bridge for \"That's What You're Doing to Me\" by Billy Ward and the Dominoes, written by Billy Ward and sung by Clyde McPhatter:\n\n[Excerpt: The Dominoes, \"That's What You're Doing to Me\"]\n\nSo while I'm critical of Freed for taking credit where it's not deserved, it should be remembered that Fuqua wasn't completely clean when it came to this song either.\n\n\"Sincerely\" rose to number one on the R&B charts, thanks in large part to Freed's promotion. It knocked \"Earth Angel\" off the top, and was in turn knocked off by \"Pledging My Love\", and it did relatively well in the pop charts, although once again it was kept off the top of the pop charts by an insipid white cover version, this time by the McGuire Sisters:\n\n[Excerpt: The McGuire Sisters, \"Sincerely\"]\n\nChess wanted to make as much out of the Moonglows as they could, and so they decided to release records by the group under multiple names and on multiple labels. So while the Moonglows were slowly rising up the charts on Chess, The Moonlighters put out another single, \"My Loving Baby\", on Checker:\n\n[Excerpt: the Moonlighters, \"My Loving Baby\"]\n\nThere were two Moonlighters singles in total, though neither did well enough for them to continue under that name, and on top of that they also provided backing vocals on records by other Chess artists. Most notably, they sang the backing vocals on \"Diddley Daddy\" by Bo Diddley:\n\n[Excerpt Bo Diddley, \"Diddley Daddy\"]\n\nThe Moonglows or Moonlighters weren't the only ones performing under new names though. The real Moondog had, once Freed came to New York, realised that Freed had taken his name, and sued him. Freed had to pay Moondog five thousand seven hundred dollars, and stop calling himself Moondog. He had to switch to using his real name. And along with this, he changed the name of his show to \"The Rock and Roll Party\".\n\nThe term \"rock and roll\" had been used in various contexts before, of course -- the theme for this series in fact comes from almost twenty years before this, but it had not been applied to a form of music on a regular basis. Freed didn't want to get into the same trouble with the phrase \"rock and roll\" as he had with the name \"Moondog\", and so he formed a company, Seig Music, which was owned by himself, the promoter Lew Platt, WINS radio, and the gangs–. I'm sorry, the legitimate businessman and music publisher Morris Levy. We'll be hearing more about Levy later. This company trademarked the phrase \"rock and roll\" (the book I got this information from says they copyrighted the phrase, but I think that's a confusion between copyright and trademark law on the writer's part) and started using it for Freed's now-branded \"Rock and Roll Shows\", both on radio and on stage.\n\nThe only problem was that the phrase caught on too much, thanks to Freed's incessant use of the phrase on his show -- there was no possible way they were going to be able to collect royalties from everyone who was using it, and so that particular money-making scheme faltered.\n\nThe Moonglows, on the other hand, had a run of minor hits. None were as big as \"Sincerely\", but they had five R&B top ten hits and a bunch more in the top twenty. The most notable, and the one people remember, is \"Ten Commandments of Love\", from 1958:\n\n[excerpt: \"Ten Commandments of Love\", Harvey and the Moonglows]\n\nBut that song wasn't released as by \"the Moonglows\", but by \"Harvey and the Moonglows\". There was increasing tension between the different members of the band, and songs started to be released as by Harvey and the Moonglows or by Bobby Lester and the Moonglows, as Chess faced the fact that the group's two lead singers would go their separate ways.\n\nChess had been contacted by some Detroit-based songwriters, who were setting up a new label, Anna, and wanted Chess to take over the distribution for it.\n\nBy this point, Harvey Fuqua had divorced his first wife, and was working for Chess in the backroom as well as as an artist, and he was asked by Leonard Chess to go over and work with this new label. He did -- and he married one of the people involved, Gwen Gordy. Gwen and her brother ended up setting up a lot of different labels, and Harvey got to run a few of them himself -- there was Try-Phi, and Harvey Records. There was a whole family of different record labels owned by the same family, and they soon became quite successful.\n\nBut at the same time, he was still performing and recording for Chess. We heard one of his singles, a duet with Etta James, in the episode on The Wallflower, but it's so good we might as well play a bit of it again here:\n\n[Excerpt: Harvey Fuqua and Etta James, \"Spoonful\"]\n\nBut at the same time both Bobby Lester and Harvey Fuqua were performing with rival groups of Moonglows, who both continued recording for Chess. Harvey's Moonglows was an entire other vocal group, a group from Washington DC called the Marquees, who'd had one single out, \"Wyatt Earp\". That single had been co-written by Bo Diddley, a Chess artist who had tried to get the group signed to Chess. When they'd been turned down, Diddley took them to Okeh instead:\n\n[Excerpt: the Marquees, \"Wyatt Earp\"]\n\nFuqua hired the Marquees and renamed them, and they recorded several tracks as Harvey and the Moonglows, and while none of them were very successful commercially, some of them were musically interesting. This one in particular featured a lead from a great young vocalist who would in 1963 become Harvey Fuqua's brother-in-law, when he married Gwen's sister Anna:\n\n[Excerpt: Harvey and the Moonglows, \"Mama Loocie\"]\n\nThat record didn't do much, but that singer was to go on to bigger and better things, as was Harvey Fuqua, when one of the Gordy family's labels became a little bit better known than the rest, with Fuqua working for it as a record producer and head of artist development.\n\nBut the story of Motown Records, and of that singer, Marvin Gaye, is for another time. Next week, we're going to continue the Chess story, with a look at another song that Alan Freed got a co-writing credit for. Come back in a week's time to hear the story of how Chuck Berry came up with Maybellene.\n\n[Excerpt: Alan Freed's final signoff]",
  "itunes:subtitle": "Welcome to episode twenty-eight of A History of Rock Music in Five Hundred Songs. Today were looking at The Moonglows and Sincerely. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs alw",
  "itunes:keywords": "Alan Freed,Bo Diddley,Chess Records,doo wop,Etta James,Gwen Gordy,Harvey Fuqua,jazz,Leonard Chess,Marvin Gaye,Moondog,Morris Levy,Motown,plagiarism,The Moonglows,vocal groups,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 28,
  "content:encoded": "Welcome to episode twenty-eight of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at The Moonglows and \"Sincerely\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-28-sincerely/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nFor the background on Charlie Fuqua, see episode six, on <a href=\"https://www.500songs.com/e/episode-6-the-ink-spots-thats-when-your-heartaches-begin/\">the Ink Spots</a>.\n\nThere are no books on the Moonglows, but as always with vocal groups of the fifties, <a href=\"http://www.uncamarvy.com/Moonglows/moonglows.html\">Marv Goldberg</a> has an exhaustively-researched page from which I got most of the information about them.\n\nThe information on Alan Freed comes from<a href=\"https://amzn.to/2VLllii\"><em> Big Beat Heat: Alan Freed and the Early Years of Rock & Roll</em></a> by John A. Jackson.\n\nAnd <a href=\"https://amzn.to/2Pi2NUJ\">this compilation</a> contains every recording by every lineup of Moonglows and Moonlighters, apart from the brief 1970s reunion.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n[13 seconds of Intro from a recording of Alan Freed: “Hello, everybody, how you all? This is Alan Freed, the old King of the Moondoggers, and a hearty welcome to all our thousands of friends in Northern Ohio, Ontario Canada, Western New York, Western Pennsylvania, West Virginia. Long about eleven thirty, fifteen minutes from now, we'll be joining the Moondog Network...”]\n\nChess Records is one of those labels, like Sun or Stax or PWL, which defined a whole genre. And in the case of Chess, the genre it defined was the electric Chicago blues. People like Muddy Waters, Elmore James, Howlin' Wolf, Little Walter, and Willie Dixon all cut some of their most important recordings for the Chess label. I remember when I was just starting to buy records as a child, decades after the events we're talking about, I knew before I left primary school that Chess, like Sun, was one of the two record labels that consistently put out music that I liked.\n\nAnd yet when it started out, Chess Records was just one of dozens of tiny little indie blues labels, like Modern, or RPM, or King Records, or Duke or Peacock, many of which were even putting out records by the same people who were recording for Chess. So this episode is actually part one of a trilogy, and over the next three episodes, we're going to talk about how Chess ended up being the one label that defined that music in the eyes of many listeners, and how that music fed into early rock and roll. And today we're also going to talk about how it ended up being influential in the formation of another of those important record labels.\n\nAnd to talk about that, we're going to talk about Harvey Fuqua [Foo-kwah]. Yes, Fuqua. Even though we talked about his uncle, Charlie Fuqua [Foo-kway], back in the episode on the Ink Spots, apparently Harvey pronounced his name differently from his uncle.\n\nAs you might imagine, having an uncle in the most important black vocal group in history gave young Harvey Fuqua quite an impetus, even though the two of them weren't close.\n\nFuqua started a duo with his friend Bobby Lester after they both got out of the military. Fuqua would play piano, and they would both sing. The two of them had a small amount of success, touring the South, but then shortly after their first tour Fuqua had about the worst thing possible happen to him -- there was a fire, and both his children died in it. Understandably, he didn't want to stay in Louisville Kentucky, where he'd been raising his family, so he and his wife moved to Cleveland.\n\nWhen he got to Cleveland, he met up again with an old friend from his military days, Danny Coggins. The two of them started performing together with a bass singer, Prentiss Barnes, under the name The Crazy Sounds.\n\nThe style they were performing in was called \"vocalese\", and it's a really odd style of jazz singing that's... the easiest way to explain it is the opposite of scat singing. In scat, you improvise a new melody with nonsense lyrics [demonstrates] -- that's the standard form of jazz singing, other than just singing the song straight. It's what Louis Armstrong or Ella Fitzgerald or whoever would do.\n\nIn vocalese, on the other hand, you do the opposite. You come up with proper lyrics, not just nonsense syllables, and you put them to a pre-recorded melody. The twist is that the pre-recorded melody you choose is a melody that's already been improvised by an instrumentalist. So for example, you could take Coleman Hawkins' great sax solo on \"Body and Soul\":\n\n[Excerpt: Coleman Hawkins, \"Body and Soul\"]\n\nHawkins improvised that melody line, and it was a one-off performance -- every other time he played the song he'd play it differently. But Eddie Jefferson, who is credited as the inventor of vocalese, learned Hawkins' solo, added words, and sang this:\n\n[Excerpt: Eddie Jefferson, \"Body and Soul\"]\n\nThe Crazy Sounds performed this kind of music as a vocal trio for a while, but their sound was missing something, and eventually Fuqua travelled down to Kentucky and persuaded Bobby Lester to move to Cleveland and join the Crazy Sounds. They became a four-piece, and slowly started writing their own new material in a more R&B style.\n\nThey performed together a little, and eventually auditioned at a club called the Loop, where they were heard by a blues singer called Al \"Fats\" Thomas. Thomas apparently recorded for several labels, but this is the only one of his records I can find a copy of anywhere, on the Chess subsidiary Checker, from right around the time we're talking about in 1952:\n\n[Excerpt: Al \"Fats\" Thomas, \"Baby Please No No\"]\n\nFats Thomas was very impressed by the Crazy Sounds, and immediately phoned his friend, the DJ Alan Freed.\n\nAlan Freed is a difficult character to explain, and his position in rock and roll history is a murky one. He was the first superstar DJ, and he was the person who more than anyone else made the phrase \"rock and roll\" into a term for a style of music, rather than, as it had been, just a phrase that was used in some of that music.\n\nFreed had not started out as a rhythm and blues or rock and roll DJ, and in fact had no great love for the music when he started playing it on his show. He was a lover of classical music -- particularly Wagner, whose music he loved so much that he named one of his daughters Sieglinde. But he named his first daughter Alana, which shows his other great love, which was for himself.\n\nFreed had been a DJ for several years when he was first introduced to rhythm and blues music, and he'd played a mixture of big band music and light classical, depending on what the audience wanted. But then, in 1951, something changed. Freed met Leo Mintz, the owner of a record shop named Record Rendezvous, in a bar. Mintz discovered that Freed was a DJ and took him to the shop. Freed later mythologised this moment, as he did a lot of his life, by talking about how he was shocked to see white teenagers dancing to music made by black people, and he had a sort of Damascene conversion and immediately decided to devote his show to rhythm and blues.\n\nThe reality is far more prosaic. Mintz, whose business actually mostly sold to black people at this point, decided that if there was a rhythm and blues radio show then it would boost business to his shop, especially if Mintz paid for the radio show and so bought all the advertising on it. He took Freed to the shop to show him that there was indeed an audience for that kind of music, and Freed was impressed, but said that he didn't know anything about rhythm and blues music. Mintz said that that didn't matter. Mintz would pick the records -- they'd be the ones that he wanted his customers to buy -- and tell Freed what to play. All Freed had to do was to play the ones he was told and everything would work out fine.\n\nThe music Mintz had played for Freed was, according to Freed later, people like LaVern Baker -- who had not yet become at all well known outside Detroit and Chicago at the time -- but Mintz set about putting together selections of records that Freed should play. Those records were mostly things with gospel-sounding vocals, a dance beat, or honking saxophones, and Freed found that his audiences responded astonishingly well to it.\n\nFreed would often interject during records, and would bang his fists on the table or other objects in time to the beat, including a cowbell that he had on his desk -- apparently some of his listeners would be annoyed when they bought the records he played to find out half the sounds they'd heard weren't on the record at all.\n\nFreed took the stage name \"Moondog\", after a blind New York street musician and outsider artist of that name. Freed's theme song for his radio show was \"Moondog Symphony\", by Moondog, a one-man-band performance credited to \"Moondog (by himself) playing drums, maracas, claves, gourds, hollow legs, Chinese block and cymbals.\"\n\n[Excerpt: \"Moondog Symphony\" by Moondog]\n\nWhen Fats Thomas got the Crazy Sounds an audition with Freed, Freed was impressed enough that he offered them a management contract. Being managed by the biggest DJ in the city was obviously a good idea, so they took him up on that, and took his advice about how to make themselves more commercial, including changing their name to emphasise the connection to Freed. They became first the Moonpuppies and then the Moonglows.\n\nFreed set up his own record label, Champagne Records, and released the Moonglows' first single, \"I Just Can't Tell No Lie\":\n\n[Excerpt, \"I Just Can't Tell No Lie\", the Moonglows]\n\nAccording to Freed's biographer John A. Jackson, Freed provided additional percussion on that song, hitting a telephone book in time with the rhythm as he would on his show. I don't hear any percussion on there other than the drum kit, but maybe you can, if you have better ears than me.\n\nThis was a song that had been written by the Moonglows themselves, but when the record came out, both sides were credited to Al Lance -- which was a pseudonym for Alan Freed. And so the DJ who was pushing their record on the radio was also their manager, and the owner of the record company, and the credited songwriter. Unsurprisingly, then, Freed promoted \"I Just Can't Tell No Lie\" heavily on his radio show, but it did nothing anywhere outside of Cleveland and the immediately surrounding area. Danny Coggins quit the group, fed up with their lack of success, and he was replaced by a singer who variously went under the names Alex Graves, Alex Walton, Pete Graves, and Pete Walton. Freed closed down Champagne Records.\n\nFor a time it looked like the Moonglows' career was going to have peaked with their one single, as Freed signed another vocal group, the Coronets, and got them signed to Chess Records in Chicago.\n\nChess was a blues label, which had started in 1947 as Aristocrat Records, but in 1948 it was bought out by two brothers, Leonard and Phil Chess, who had emigrated from Poland as children and Anglicised their names. Their father was in the liquor business during the Prohibition era, which in Chicago meant he was involved with Al Capone, and in their twenties the Chess brothers had started running nightclubs in the black area of Chicago.\n\nChess, at its start, had the artists who had originally recorded for Aristocrat -- people like Muddy Waters and Sunnyland Slim, and they also licensed records made by Sam Phillips in Memphis, and because of that put out early recordings by Howlin' Wolf, before just poaching Wolf for their own label, and Jackie Brenston's \"Rocket 88\".\n\nBy 1954, thanks largely to their in-house bass player and songwriter Willie Dixon, Chess had become known as the home of electric Chicago blues, and were putting out classic after classic in that genre. But they were still interested in putting out other styles of black music too, and were happy to sign up doo-wop groups.\n\nThe Coronets put out a single, \"Nadine\", on Chess, which did very well. The credited writer was Alan Freed:\n\n[Excerpt: \"Nadine\", the Coronets]\n\nThe Coronets' follow-up single did less well, though, and Chess dropped them.\n\nBut Freed had been trying for some time to make a parallel career as a concert promoter, and indeed a few months before he signed the Moonglows to a management contract he had put on what is now considered the first major rock and roll concert -- the Moondog Coronation Ball, at the Cleveland Arena. That show had been Freed's first inkling of just how popular he and the music he was playing were becoming -- twenty thousand people tried to get into the show, even though the arena only had a capacity of ten thousand, and the show had to be cancelled after the first song by the first performer, because it was becoming unsafe to continue.\n\nBut Freed put on further shows at the arena, with better organisation, and in August 1953 he put on \"the Big Rhythm and Blues Show\". This featured Fats Domino and Big Joe Turner, and the Moonglows were also put on the bill. As a result of their appearance on the show, they got signed to Chance Records, a small label whose biggest act was the doo-wop group The Flamingos. Freed didn't own this label of course, but by this time he'd got into the record distribution business, and the distribution company he co-owned was Chance's distributor in the Cleveland area. The other co-owner was the owner of Chance Records, and Freed's brother was the distributor's vice-president and in charge of running it.\n\nThe Moonglows' first single on Chance, a Christmas single, did nothing in the charts, but they followed it with a rather unusual choice.\n\n\"Secret Love\" was a hit for Doris Day, from the soundtrack of her film \"Calamity Jane\":\n\n[Excerpt: Doris Day, \"Secret Love\"]\n\nIn the context of the film, which has a certain amount of what we would now call queerbaiting, that song can be read as a song about lesbianism or bisexuality. But that didn't stop a lot of male artists covering it for other markets. We've talked before about how popular songs would be recorded in different genres, and so Day's pop version was accompanied by Slim Whitman's country version and by this by the Moonglows:\n\n[Excerpt: the Moonglows, \"Secret Love\"]\n\nUnfortunately, a fortnight after the Moonglows released their version, the Orioles, who were a much more successful doo-wop group, released their own record of the song, and the two competed for the same market. However, \"Secret Love\" did well enough, given a promotional push by Freed, that it became apparent that the Moonglows could have a proper career. It sold over a hundred thousand copies, but then the next few records on Chance failed to sell, and Chance closed down when their biggest act, the Flamingos, moved first to Parrot Records, and then quickly on to Chess.\n\nIt seemed like everything was against the Moonglows, but they were about to get a big boost, thanks in part to a strike.\n\nWINS radio in New York had been taken over at a rock-bottom price by an investment consortium who wanted to turn the money-losing station into a money-maker. It had a powerful transmitter, and if they could boost listenership they would almost certainly be able to sell it on at a massive profit.\n\nOne of the first things the new owners did was to sack their house band -- they weren't going to pay musicians any more, as live music was too expensive. This caused the American Federation of Musicians to picket the station, which was expected and understandable.\n\nBut WINS also had the broadcast rights to the New York Yankees games -- indeed, the ball games were the only really popular thing that the station had. And so the AFM started to picket Yankee Stadium too. On the week of the starting game for what looked to be the Yankees' sixth World Series win in a row.\n\nThat game would normally have had the opening ball thrown by the Mayor of New York, but the Mayor, Robert Wagner, rather admirably refused to cross a picket line. The Bronx borough president substituted for him -- and threw the opening ball right into the stomach of a newspaper photographer.\n\nWINS now desperately needed something to go right for them, and they realised Freed's immense drawing power. They signed him for the unprecedented sum of seventy-five thousand dollars a year, and Freed moved from the mid-market town of Cleveland to a huge, powerful, transmitter in New York. He instantly became the most popular DJ in New York, and probably the best-known DJ in the world.\n\nAnd with his great power came record labels wanting to do Freed favours. He was already friends with the Chess brothers, and with the sure knowledge that any record the Moonglows put out would get airplay from Freed, they eagerly signed the Moonglows and put out \"Sincerely\":\n\n[Excerpt: The Moonglows, \"Sincerely\"]\n\n\"Sincerely\" featured Bobby Lester on lead vocals, but the song was written by Harvey Fuqua. Or, as the label credited it, Harvey Fuqua and Alan Freed. But while those were the two credited writers, the song owes more than a little to another one. Here's the bridge for \"Sincerely\":\n\n[Excerpt: The Moonglows, \"Sincerely\"]\n\nAnd here's the bridge for \"That's What You're Doing to Me\" by Billy Ward and the Dominoes, written by Billy Ward and sung by Clyde McPhatter:\n\n[Excerpt: The Dominoes, \"That's What You're Doing to Me\"]\n\nSo while I'm critical of Freed for taking credit where it's not deserved, it should be remembered that Fuqua wasn't completely clean when it came to this song either.\n\n\"Sincerely\" rose to number one on the R&B charts, thanks in large part to Freed's promotion. It knocked \"Earth Angel\" off the top, and was in turn knocked off by \"Pledging My Love\", and it did relatively well in the pop charts, although once again it was kept off the top of the pop charts by an insipid white cover version, this time by the McGuire Sisters:\n\n[Excerpt: The McGuire Sisters, \"Sincerely\"]\n\nChess wanted to make as much out of the Moonglows as they could, and so they decided to release records by the group under multiple names and on multiple labels. So while the Moonglows were slowly rising up the charts on Chess, The Moonlighters put out another single, \"My Loving Baby\", on Checker:\n\n[Excerpt: the Moonlighters, \"My Loving Baby\"]\n\nThere were two Moonlighters singles in total, though neither did well enough for them to continue under that name, and on top of that they also provided backing vocals on records by other Chess artists. Most notably, they sang the backing vocals on \"Diddley Daddy\" by Bo Diddley:\n\n[Excerpt Bo Diddley, \"Diddley Daddy\"]\n\nThe Moonglows or Moonlighters weren't the only ones performing under new names though. The real Moondog had, once Freed came to New York, realised that Freed had taken his name, and sued him. Freed had to pay Moondog five thousand seven hundred dollars, and stop calling himself Moondog. He had to switch to using his real name. And along with this, he changed the name of his show to \"The Rock and Roll Party\".\n\nThe term \"rock and roll\" had been used in various contexts before, of course -- the theme for this series in fact comes from almost twenty years before this, but it had not been applied to a form of music on a regular basis. Freed didn't want to get into the same trouble with the phrase \"rock and roll\" as he had with the name \"Moondog\", and so he formed a company, Seig Music, which was owned by himself, the promoter Lew Platt, WINS radio, and the gangs–. I'm sorry, the legitimate businessman and music publisher Morris Levy. We'll be hearing more about Levy later. This company trademarked the phrase \"rock and roll\" (the book I got this information from says they copyrighted the phrase, but I think that's a confusion between copyright and trademark law on the writer's part) and started using it for Freed's now-branded \"Rock and Roll Shows\", both on radio and on stage.\n\nThe only problem was that the phrase caught on too much, thanks to Freed's incessant use of the phrase on his show -- there was no possible way they were going to be able to collect royalties from everyone who was using it, and so that particular money-making scheme faltered.\n\nThe Moonglows, on the other hand, had a run of minor hits. None were as big as \"Sincerely\", but they had five R&B top ten hits and a bunch more in the top twenty. The most notable, and the one people remember, is \"Ten Commandments of Love\", from 1958:\n\n[excerpt: \"Ten Commandments of Love\", Harvey and the Moonglows]\n\nBut that song wasn't released as by \"the Moonglows\", but by \"Harvey and the Moonglows\". There was increasing tension between the different members of the band, and songs started to be released as by Harvey and the Moonglows or by Bobby Lester and the Moonglows, as Chess faced the fact that the group's two lead singers would go their separate ways.\n\nChess had been contacted by some Detroit-based songwriters, who were setting up a new label, Anna, and wanted Chess to take over the distribution for it.\n\nBy this point, Harvey Fuqua had divorced his first wife, and was working for Chess in the backroom as well as as an artist, and he was asked by Leonard Chess to go over and work with this new label. He did -- and he married one of the people involved, Gwen Gordy. Gwen and her brother ended up setting up a lot of different labels, and Harvey got to run a few of them himself -- there was Try-Phi, and Harvey Records. There was a whole family of different record labels owned by the same family, and they soon became quite successful.\n\nBut at the same time, he was still performing and recording for Chess. We heard one of his singles, a duet with Etta James, in the episode on The Wallflower, but it's so good we might as well play a bit of it again here:\n\n[Excerpt: Harvey Fuqua and Etta James, \"Spoonful\"]\n\nBut at the same time both Bobby Lester and Harvey Fuqua were performing with rival groups of Moonglows, who both continued recording for Chess. Harvey's Moonglows was an entire other vocal group, a group from Washington DC called the Marquees, who'd had one single out, \"Wyatt Earp\". That single had been co-written by Bo Diddley, a Chess artist who had tried to get the group signed to Chess. When they'd been turned down, Diddley took them to Okeh instead:\n\n[Excerpt: the Marquees, \"Wyatt Earp\"]\n\nFuqua hired the Marquees and renamed them, and they recorded several tracks as Harvey and the Moonglows, and while none of them were very successful commercially, some of them were musically interesting. This one in particular featured a lead from a great young vocalist who would in 1963 become Harvey Fuqua's brother-in-law, when he married Gwen's sister Anna:\n\n[Excerpt: Harvey and the Moonglows, \"Mama Loocie\"]\n\nThat record didn't do much, but that singer was to go on to bigger and better things, as was Harvey Fuqua, when one of the Gordy family's labels became a little bit better known than the rest, with Fuqua working for it as a record producer and head of artist development.\n\nBut the story of Motown Records, and of that singer, Marvin Gaye, is for another time. Next week, we're going to continue the Chess story, with a look at another song that Alan Freed got a co-writing credit for. Come back in a week's time to hear the story of how Chuck Berry came up with Maybellene.\n\n[Excerpt: Alan Freed's final signoff]",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-eight of A History of Rock Music in Five Hundred Songs. Today we're looking at The Moonglows and \"Sincerely\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor the background on Charlie Fuqua, see episode six, on the Ink Spots.\n\nThere are no books on the Moonglows, but as always with vocal groups of the fifties, Marv Goldberg has an exhaustively-researched page from which I got most of the information about them.\n\nThe information on Alan Freed comes from Big Beat Heat: Alan Freed and the Early Years of Rock & Roll by John A. Jackson.\n\nAnd this compilation contains every recording by every lineup of Moonglows and Moonlighters, apart from the brief 1970s reunion.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\n[13 seconds of Intro from a recording of Alan Freed: “Hello, everybody, how you all? This is Alan Freed, the old King of the Moondoggers, and a hearty welcome to all our thousands of friends in Northern Ohio, Ontario Canada, Western New York, Western Pennsylvania, West Virginia. Long about eleven thirty, fifteen minutes from now, we'll be joining the Moondog Network...”]\n\nChess Records is one of those labels, like Sun or Stax or PWL, which defined a whole genre. And in the case of Chess, the genre it defined was the electric Chicago blues. People like Muddy Waters, Elmore James, Howlin' Wolf, Little Walter, and Willie Dixon all cut some of their most important recordings for the Chess label. I remember when I was just starting to buy records as a child, decades after the events we're talking about, I knew before I left primary school that Chess, like Sun, was one of the two record labels that consistently put out music that I liked.\n\nAnd yet when it started out, Chess Records was just one of dozens of tiny little indie blues labels, like Modern, or RPM, or King Records, or Duke or Peacock, many of which were even putting out records by the same people who were recording for Chess. So this episode is actually part one of a trilogy, and over the next three episodes, we're going to talk about how Chess ended up being the one label that defined that music in the eyes of many listeners, and how that music fed into early rock and roll. And today we're also going to talk about how it ended up being influential in the formation of another of those important record labels.\n\nAnd to talk about that, we're going to talk about Harvey Fuqua [Foo-kwah]. Yes, Fuqua. Even though we talked about his uncle, Charlie Fuqua [Foo-kway], back in the episode on the Ink Spots, apparently Harvey pronounced his name differently from his uncle.\n\nAs you might imagine, having an uncle in the most important black vocal group in history gave young Harvey Fuqua quite an impetus, even though the two of them weren't close.\n\nFuqua started a duo with his friend Bobby Lester after they both got out of the military. Fuqua would play piano, and they would both sing. The two of them had a small amount of success, touring the South, but then shortly after their first tour Fuqua had about the worst thing possible happen to him -- there was a fire, and both his children died in it. Understandably, he didn't want to stay in Louisville Kentucky, where he'd been raising his family, so he and his wife moved to Cleveland.\n\nWhen he got to Cleveland, he met up again with an old friend from his military days, Danny Coggins. The two of them started performing together with a bass singer, Prentiss Barnes, under the name The Crazy Sounds.\n\nThe style they were performing in was called \"vocalese\", and it's a really odd style of jazz singing that's... the easiest way to explain it is the opposite of scat singing. In scat, you improvise a new melody with nonsense lyrics [demonstrates] -- that's the standard for",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-eight of A History of Rock Music in Five Hundred Songs. Today we're looking at The Moonglows and \"Sincerely\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor the background on Charlie Fuqua, see episode six, on the Ink Spots.\n\nThere are no books on the Moonglows, but as always with vocal groups of the fifties, Marv Goldberg has an exhaustively-researched page from which I got most of the information about them.\n\nThe information on Alan Freed comes from Big Beat Heat: Alan Freed and the Early Years of Rock & Roll by John A. Jackson.\n\nAnd this compilation contains every recording by every lineup of Moonglows and Moonlighters, apart from the brief 1970s reunion.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\n[13 se",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}