{
  "title": "Be Kind - Ep 75",
  "itunes:title": "Be Kind - Ep 75",
  "pubDate": "Tue, 09 Jun 2020 13:00:00 +0000",
  "guid": "cf00e3d7-0358-47ab-872f-08a002a0ea96",
  "link": "http://investor.fm/be-kind-ep-75",
  "itunes:image": "",
  "description": "<p>In April 2018, Vitaliy met with one of his best investment friends, John Mauldin. John has been an inspiration to Vitaliy both personally and professionally, but no more so in the context of writing. John writes at Mauldin Economics, one of the web's the most widely read and successful investment letters. In this podcast, Vitaliy shares how John was able to inspire him to both write better, and be a better human being.<br /> <br /> John's articles-> <a href= \"https://www.mauldineconomics.com/\">https://www.mauldineconomics.com/</a></p> <p>You can read this article online at: <a href= \"https://contrarianedge.com/be-kind/\">https://contrarianedge.com/be-kind/</a></p>",
  "content:encoded": "<p>In April 2018, Vitaliy met with one of his best investment friends, John Mauldin. John has been an inspiration to Vitaliy both personally and professionally, but no more so in the context of writing. John writes at Mauldin Economics, one of the web's the most widely read and successful investment letters. In this podcast, Vitaliy shares how John was able to inspire him to both write better, and be a better human being.  John's articles-> <a href= \"https://www.mauldineconomics.com/\">https://www.mauldineconomics.com/</a></p> <p>You can read this article online at: <a href= \"https://contrarianedge.com/be-kind/\">https://contrarianedge.com/be-kind/</a></p>",
  "enclosure": "",
  "itunes:duration": "05:14",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In April 2018, Vitaliy met with one of his best investment friends, John Mauldin. John has been an inspiration to Vitaliy both personally and professionally, but no more so in the context of writing. John writes at Mauldin Economics, one of the web's...",
  "itunes:season": 1,
  "itunes:episode": 75,
  "itunes:episodeType": "full",
  "itunes:author": "Vitaliy Katsenelson"
}