{
  "title": "New materials could enable longer-lasting implantable batteries",
  "link": "https://news.mit.edu/2022/nonrechargeable-batteries-electrolyte-1104",
  "description": "Pacemakers and other medical devices, as well as long-distance drones and remote sensors, could require fewer battery replacements with new approach.",
  "pubDate": "Fri, 04 Nov 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/nonrechargeable-batteries-electrolyte-1104",
  "dc:creator": "David L. Chandler | MIT News Office",
  "content:encoded": "<div>\n<p>For the last few decades, battery research has largely focused on rechargeable lithium-ion batteries, which are used in everything from electric cars to portable electronics and have improved dramatically in terms of affordability and capacity. But nonrechargeable batteries have seen little improvement during that time, despite their crucial role in many important uses such as implantable medical devices like pacemakers.</p>\n\n<p></p>\n\n<p>Now, researchers at MIT have come up with a way to improve the energy density of these nonrechargeable, or “primary,” batteries. They say it could enable up to a 50 percent increase in useful lifetime, or a corresponding decrease in size and weight for a given amount of power or energy capacity, while also improving safety, with little or no increase in cost.</p>\n\n<p></p>\n\n<p>The new findings, which involve substituting the conventionally inactive battery electrolyte with a material that is active for energy delivery, are <a href=\"https://www.pnas.org/doi/10.1073/pnas.2121440119\" target=\"_blank\">reported today</a> in the journal <em>Proceedings of the National Academy of Sciences</em>, in a paper by MIT Kavanaugh Postdoctoral Fellow Haining Gao, graduate student Alejandro Sevilla, associate professor of mechanical engineering Betar Gallant, and four others at MIT and Caltech.</p>\n\n<p></p>\n\n<p>Replacing the battery in a pacemaker or other medical implant requires a surgical procedure, so any increase in the longevity of their batteries could have a significant impact on the patient’s quality of life, Gallant says. Primary batteries are used for such essential applications because they can provide about three times as much energy for a given size and weight as rechargeable batteries.</p>\n\n<p></p>\n\n<p>That difference in capacity, Gao says, makes primary batteries “critical for applications where charging is not possible or is impractical.” The new materials work at human body temperature, so would be suitable for medical implants. In addition to implantable devices, with further development to make the batteries operate efficiently at cooler temperatures, applications could also include sensors in tracking devices for shipments, for example to ensure that temperature and humidity requirements for food or drug shipments are properly maintained throughout the shipping process. Or, they might be used in remotely operated aerial or underwater vehicles that need to remain ready for deployment over long periods.</p>\n\n<p></p>\n\n<p>Pacemaker batteries typically last from five to 10 years, and even less if they require high-voltage functions such as defibrillation. Yet for such batteries, Gao says, the technology is considered mature, and “there haven’t been any major innovations in fundamental cell chemistries in the past 40 years.”</p>\n\n<p></p>\n\n<p>The key to the team’s innovation is a new kind of electrolyte — the material that lies between the two electrical poles of the battery, the cathode and the anode, and allows charge carriers to pass through from one side to the other. Using a new liquid fluorinated compound, the team found that they could combine some of the functions of the cathode and the electrolyte in one compound, called a catholyte. This allows for saving much of the weight of typical primary batteries, Gao says.</p>\n\n<p></p>\n\n<p>While there are other materials besides this new compound that could theoretically function in a similar catholyte role in a high-capacity battery, Gallant explains, those materials have lower inherent voltages that do not match those of the remainder of the material in a conventional pacemaker battery, a type known as CF<sub>x</sub>. Because the overall output from the battery can’t be more than that of the lesser of the two electrode materials,&nbsp; the extra capacity would go to waste because of the voltage mismatch. But with the new material, “one of the key merits of our fluorinated liquids is that their voltage aligns very well with that of CF<sub>x</sub>,” Gallant says.</p>\n\n<p></p>\n\n<p>In a conventional &nbsp;CF<sub>x </sub>battery, the liquid electrolyte is essential because it allows charged particles to pass through from one electrode to the other. But “those electrolytes are actually chemically inactive, so they’re basically dead weight,” Gao says. This means about 50 percent of the battery’s key components, mainly the electrolyte, is inactive material. But in the new design with the fluorinated catholyte material, the amount of dead weight can be reduced to about 20 percent, she says.</p>\n\n<p></p>\n\n<p>The new cells also provide safety improvements over other kinds of proposed chemistries that would use toxic and corrosive catholyte materials, which their formula does not, Gallant says. And preliminary tests have demonstrated a stable shelf life over more than a year, an important characteristic for primary batteries, she says.</p>\n\n<p></p>\n\n<p></p>\n\n<p>So far, the team has not yet experimentally achieved the full 50 percent improvement in energy density predicted by their analysis. They have demonstrated a 20 percent improvement, which in itself would be an important gain for some applications, Gallant says. The design of the cell itself has not yet been fully optimized, but the researchers can project the cell performance based on the performance of the active material itself. “We can see the projected cell-level performance when it’s scaled up can reach around 50 percent higher than the CF<sub>x</sub> cell,” she says. Achieving that level experimentally is the team’s next goal.</p>\n\n<p></p>\n\n<p>Sevilla, a doctoral student in the mechanical engineering department, will be focusing on that work in the coming year. “I was brought into this project to try to understand some of the limitations of why we haven’t been able to attain the full energy density possible,” he says. “My role has been trying to fill in the gaps in terms of understanding the underlying reaction.”</p>\n\n<p>One big advantage of the new material, Gao says, is that it can easily be integrated into existing battery manufacturing processes, as a simple substitution of one material for another. Preliminary discussions with manufacturers confirm this potentially easy substitution, Gao says. The basic starting material, used for other purposes, has already been scaled up for production, she says, and its price is comparable to that of the materials currently used in CF<sub>x</sub> batteries. The cost of batteries using the new material is likely to be comparable to the existing batteries as well, she says. The team has already applied for a patent on the catholyte, and they expect that the medical applications are likely to be the first to be commercialized, perhaps with a full-scale prototype ready for testing in real devices within about a year.</p>\n\n<p></p>\n\n<p>Further down the road, other applications could likely take advantage of the new materials as well, such as smart water or gas meters that can be read out remotely, or devices like EZPass transponders, increasing their usable lifetime, the researchers say. Power for drone aircraft or undersea vehicles would require higher power and so may take longer to be developed. Other uses could include batteries for equipment used at remote sites, such as drilling rigs for oil and gas, including devices sent down into the wells to monitor conditions.</p>\n\n<p></p>\n\n<p>The team also included Gustavo Hobold, Aaron Melemed, and Rui Guo at MIT and Simon Jones at Caltech. The work was supported by MIT Lincoln Laboratory and the Army Research Office.</p>\n</div>",
  "media:content": {
    "media:description": "Time-lapse series of images shows the new type of battery becoming fully discharged over a period of days. In the process of discharging, the new \"catholyte\" material in the battery cell gets chemically coverted into a reddish compound, so the color gets darker the more it discharges.",
    "media:credit": "Image: Courtesy of the researchers"
  },
  "category": [
    "Batteries",
    "Mechanical engineering",
    "Electrochemistry",
    "Energy",
    "Energy storage",
    "Medical devices",
    "Climate change",
    "School of Engineering",
    "Lincoln Laboratory"
  ]
}