{
  "title": "A Papuan Human Rights Hero Has Died",
  "link": "https://www.hrw.org/news/2022/11/01/papuan-human-rights-hero-has-died",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Filep Karma outside the Abepura prison in Jayapura, Indonesia, December 2014.\n                    © 2014 Andreas Harsono\n          \n\n  \n<p>Filep Karma, a prominent Papuan activist and former political prisoner, was found dead Monday on a beach in the Papuan city of Jayapura. He had been on a diving trip with his brother-in-law and nephew, and apparently went diving alone after his relatives left the trip early. Karma, a master diver with three decades’ experience, was found wearing his scuba diving suit.</p>\n\n<p>His daughter said he had died because of an “accident and drowning.”</p>\n\n<p>I had met Karma in 2008 when I visited a Jayapura prison to interview political inmates. Karma was clearly the leader the other prisoners looked to for inspiration. He articulated his principles for the human rights and self-determination of the Papuan people. We quickly became friends, discussing and debating the human rights situation in Papua.</p>\n\n<p>Filep Karma was born in 1959 in Jayapura, the capital of Indonesia’s Papua province. Karma told me his father educated him about the mistreatment of Indigenous Papuans under Indonesian rule.</p>\n\n<p>In 1998, Karma organized a protest on Biak Island, calling for independence for Papua while raising the Morning Star flag, a symbol of independence banned by Indonesia’s government. Indonesia military forces violently broke up the protest. Karma was imprisoned, then released in 1999. In 2004, he organized another Morning Star protest following the killing of Theys Eluai, another pro-independence leader. The authorities tried and sentenced Karma to 15 years in prison for “treason.”</p>\n\n<p>In 2010, Human Rights Watch published a report on political prisoners in Papua and the Moluccas Islands, launching a global campaign to release the prisoners. In 2011, Karma’s mother, Eklefina Noriwari, petitioned the United Nations Working Group on Arbitrary Detention for Karma’s release. The working group determined Karma’s detention had violated international law, and called on the Indonesian government release him. The authorities only released Karma in 2015.</p>\n\n<p>After his release, Karma embraced a wider agenda of political activism. He spoke about human rights and environmental protection. He campaigned for the rights of minorities. He organized help for political prisoners’ families.</p>\n\n<p>Karma’s humor, integrity, and moral courage was an inspiration to many people. His death is a huge loss, not only for Papuans, but for many people across Indonesia who have lost a human rights hero.</p>",
  "pubDate": "Tue, 01 Nov 2022 15:50:45 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/01/papuan-human-rights-hero-has-died"
}