{
  "title": "Scott Young &#8211; Ultralearning",
  "link": "https://www.madfientist.com/scott-young-interview/",
  "comments": "https://www.madfientist.com/scott-young-interview/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Wed, 16 Oct 2019 09:00:37 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "http://www.madfientist.com/?p=6521",
  "description": "<p class=\"lead\">Scott Young joins me on the Financial Independence Podcast to talk about \"ultralearning\" and why it's great for people pursuing early retirement!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/scott-young-interview/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/scott-young-interview/\">Scott Young &#8211; Ultralearning</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>On today&#8217;s episode of the <a rel=\"noopener\" href=\"https://www.madfientist.com/podcast/\" target=\"_blank\">Financial Independence Podcast</a>, I&#8217;m excited to introduce Scott Young!</p>\n\n\n\n<p>I first heard about Scott when he decided to <a href=\"https://www.scotthyoung.com/blog/myprojects/mit-challenge-2/\" target=\"_blank\" rel=\"noopener\" aria-label=\"complete MIT's entire computer science curriculum in a year (opens in a new tab)\">complete MIT&#8217;s entire computer science curriculum in a year</a>.</p>\n\n\n\n<p>Scott has taken on a lot of these types of impressive learning projects and he just wrote a great book about it &#8211; <a rel=\"nofollow  noopener\" href=\"https://amzn.to/31mSdjH?tag=madfientist-20\" target=\"_blank\">Ultralearning</a>.</p>\n\n\n\n<p>As you know, I&#8217;m attempting to tackle a <a rel=\"noopener\" aria-label=\"very intimidating project (opens in a new tab)\" href=\"https://www.madfientist.com/best-and-worst-about-fi/\" target=\"_blank\">very intimidating project</a> myself so what better way to kick off that effort than with my own 3-month ultralearning project!</p>\n\n\n\n<p>In today&#8217;s interview, we dive into the details of ultralearning and we design a new ultralearning project from scratch.</p>\n\n\n\n<p>Ultralearning projects seem perfect for anyone who is FI or hopes to achieve financial independence one day so hope you get as much out of this discussion as I did!</p>\n\n\n\n<p><em>Note: To follow along with my own ultralearning project, here is the new homepage for this experiment &#8211; <a rel=\"noopener\" aria-label=\"Ultralearning Experiment (opens in a new tab)\" href=\"https://www.madfientist.com/ultralearning-experiment\" target=\"_blank\">Ultralearning Experiment</a>.  Since I now have a bunch of experiments currently going on, I also created an </em><a rel=\"noopener\" aria-label=\"Experiments Homepage (opens in a new tab)\" href=\"https://www.madfientist.com/experiments/\" target=\"_blank\"><em>Experiments Homepage</em></a><em> so you can find them all there!</em></p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-6521-11\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"http://traffic.libsyn.com/madfientist/scott-young-interview.mp3?_=11\" /><a href=\"http://traffic.libsyn.com/madfientist/scott-young-interview.mp3\">http://traffic.libsyn.com/madfientist/scott-young-interview.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='http://traffic.libsyn.com/madfientist/scott-young-interview.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Highlights</h2>\n\n\n\n<ul><li>Why ultralearning can help you get to FI quicker (while making the journey more enjoyable)</li><li>How Scott was able to complete MIT&#8217;s computer science curriculum in one year</li><li>Why the first part of learning something new is the hardest and how to use ultralearning to get past that phase sooner</li><li>How to learn new languages as quickly and efficiently as possible</li><li>Details about my own ultralearning project and how Scott suggests I design it</li><li>The importance of breaking big goals into concrete stages</li><li>Why limiting scope is so important when diving into something new</li><li>What is meta-feedback and why it&#8217;s important</li><li>The power of direct practice and how to use drills to fix specific issues</li><li>What to do when you hit a block or a plateau in your learning </li></ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul><li><a rel=\"noopener\" aria-label=\"Scott Young (opens in a new tab)\" href=\"https://www.scotthyoung.com\" target=\"_blank\">Scott Young</a></li><li><a href=\"https://amzn.to/31mSdjH?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow  noopener\" aria-label=\"Ultralearning: Master Hard Skills, Outsmart the Competition, and Accelerate Your Career (opens in a new tab)\">Ultralearning: Master Hard Skills, Outsmart the Competition, and Accelerate Your Career</a></li><li><a rel=\"noopener\" aria-label=\"Fluent in 3 Months (opens in a new tab)\" href=\"https://www.fluentin3months.com\" target=\"_blank\">Fluent in 3 Months</a></li><li><a rel=\"noopener\" aria-label=\"The Year Without English (opens in a new tab)\" href=\"https://www.scotthyoung.com/blog/myprojects/the-year-without-english-2/\" target=\"_blank\">The Year Without English</a></li><li><a rel=\"noopener\" href=\"https://www.madfientist.com/go/itunes/\" target=\"_blank\">Leave a review for the Financial Independence Podcast on iTunes</a>!</li></ul>\n\n\n\n<h2>Full Transcript</h2>\n\n\n\n<div class=\"transcript\">\n<p>\n<strong>Mad Fientist:</strong>\tHey, what&#8217;s up everybody? It&#8217;s the Mad Fientist. Welcome to another episode of The Financial Independence Podcast. On today&#8217;s episode, I&#8217;m excited to introduce Scott Young. \n</p><p> \nI first came across Scott many years ago actually. I heard about a guy who was doing the entire MIT computer science curriculum for free online in one year. And it was a really inspiring story to hear about how he went about it and how he ended up completing all the classes, all the assignments, all the tests. \n</p><p> \nOh, he just released a book called Ultralearning where he documents how he came up with this project, how we structured it, and also how he&#8217;s done other similar projects in language learning and creative arts. \n</p><p> \nSo, after I read the book, I knew I had to get him on the show because this ultralearning idea seems perfect for people who are just newly retired or who are planning to retire early and want some sort of big project to sink their teeth into after they leave their job. And since I just recently shared in my latest post what I&#8217;ve been up to for all these years and what I&#8217;m hoping to accomplish, I figured it&#8217;d be really interesting if I tried to build my own ultralearning project and have Scott&#8217;s help and input along the way, and then have an experiment that I could share all my results with you. And so, that&#8217;s exactly what I&#8217;m doing. \n</p><p> \nSo, if you have no idea what I&#8217;m talking about, and you haven&#8217;t checked out my latest post yet, I suggest you do that first because this episode will make a lot more sense. So head over to MadFientist.com/goal, and you can read about it there. \n</p><p> \nAnd finally, one more thing to tell you about before we get into the interview, I also created an experiments home page since I got a few experiments currently running at the same time. I&#8217;ve collected them all at MadFientist.com/experiments. And you can go there and check out the new ultralearning experiment that just launched today as well as some old ones like the guinea pig experiment and the mortgage payoff experiment and things like that. \tSo, head over to MadFientist.com/experiments. \n</p><p> \nThat&#8217;s enough for the announcements. I have so many questions I want to ask Scott. So let&#8217;s dive right into it. \t\n</p><p> \nScott, thank you so much for being here. I really appreciate it.\n</p><p>\n<strong>Scott Young:</strong> \tOh, it&#8217;s great to be here.\n</p><p>\n<strong>Mad Fientist:</strong>\tSo, before we dive in, there&#8217;s a ton of stuff I want to get into. But I want to just pull out a quote that you had in the book: “Your deepest moments of happiness don&#8217;t come from doing easy things. They come from realizing your potential and overcoming your own limiting beliefs about yourself.” And I really couldn&#8217;t agree more with that quote. \n</p><p> \nAnd that&#8217;s the beauty of financial independence and early retirement, is that you can start tackling some of these bigger projects. \n</p><p> \nAnd another quote from your book is: “Ultralearning offers a path to master the things that will bring deep satisfaction and self-confidence.” \n</p><p> \nSo, it seems like ultralearning is a great thing to maybe follow up your financial independence with because you&#8217;re about to have all this free time and you have a lot more sleep and bandwidth to deal with a bigger project. So it feels like it&#8217;s a great thing to think about as you&#8217;re preparing for potentially an early retirement. \n</p><p> \nSo, saying all that, I&#8217;m really excited to chat to you about it. So before we dive in though, can you just tell the audience what ultralearning is and how this whole project came about for you?\n</p><p>\n<strong>Scott Young:</strong> \tYeah, so ultralearning, I know this is not going to be a familiar term for many people who are listening right now. But it is to describe a sort of phenomenon or sort of a set of people that I&#8217;ve encountered in the world that have done just some incredible things, but there didn&#8217;t seem to be a really good term to describe what they&#8217;re doing. \n</p><p> \nAnd so, the idea is to describe people who have pursued self-directed learning projects, projects where they want to get good at something, but they&#8217;re not doing it through the normal way of paying a bunch of tuition, taking classes. They&#8217;re just learning things on their own… but then also people who really care about doing it well. \n</p><p> \nSo, we all have this kind of sense of, “Oh, you know, I&#8217;m going to learn a language” and you just download DuoLingo and you play around for like six months… and maybe you&#8217;ll learn a sentence or two. But this was people who really wanted to break down what it means to learn something well and how to do it in the most effective and efficient way possible. \n</p><p> \nSo, these are people that I&#8217;ve encountered such as Benny Lewis who speaks 10+ languages, people like Tristan de Montebello who went from having near zero experience in public speaking to the world championships in public speaking in about seven months, people like Eric Barone who worked on learning every aspect of video game development, art, music, programming, game design, and went on to create a million dollar-selling game. \n</p><p> \nSo, I think there&#8217;s a lot of really interesting ideas here about how you can get better at things that you care about. And certainly for the people listening to this, not only the people who, they still haven&#8217;t retired yet, they still have to earn money in their career, building valuable skills can not only allow you to move up in your career or more money, you hit those goals a bit earlier, but they can also allow you to—you know, like we were just talking about build skills and things in your life that give you joy and passion and you just really live your best life. \n</p><p>\n<strong>Mad Fientist:</strong>\tAll those stories that you mentioned and you detail in the book which just help bring the concepts to life, but you&#8217;re sort of selling yourself short as well because you&#8217;ve used these principles yourself in pretty impressive ways. And that&#8217;s actually the first time that I heard about you, was through the MIT experiment. Could you just tell my listeners what that was all about? And was that your first ultralearning sort of experiment?\n</p><p>\n<strong>Scott Young:</strong> \tYeah, I think you could say that was my first ultralearning project. The MIT challenge was a project that I took on 2011. So now looking back, it&#8217;s like almost eight years ago. But the project was to try to learn MIT’s 4-year computer science curriculum—so learning the material that they cover in a normal undergraduate program—and to try to do this by passing the final exams and doing the programming projects that an MIT student would do. \t\n</p><p>\t\nBut instead of going to MIT and taking classes and getting a degree and doing all that at the end, I wanted to use their free resources because MIT puts a lot of these classes and lectures and stuff up online for free. \n</p><p> \nAnd the kind of little twist of this is that I wanted to try to do it in 12 months. So this is a project I started again in October 2011 and completed the last class in September 2012.\n</p><p>\n<strong>Mad Fientist:</strong>\tWow! And you did it for less than $2,000 total, was that right?\n</p><p>\n<strong>Scott Young:</strong> \tYeah, when I was doing it, I wasn&#8217;t really thinking, “Oh, let&#8217;s try to save as much money as possible.” That was just sort of a side effect of how I did it. I think if you were really trying to be cheap, you could have possibly done it for even cheaper. \n</p><p> \nThe only cost that I had to spend was on textbooks. And even then, sometimes, I was spending a little bit more because I was getting the textbooks that they recommended which was like an out of print edition, so sometimes it was like a little bit more money. \n</p><p> \nBut you don&#8217;t need it for most classes. And I would say, for a lot of classes, it would also be okay if you used a slightly different textbook. I mean, you&#8217;re learning from one or the other. Or you could even just go to the library and put in a request to get it out. So, if I did it with the library method, it would have been hard to do it in 12 months just because it would have taken too long to request all the books. But I could have done it for free if that had been my absolute priority.\n</p><p>\n<strong>Mad Fientist:</strong>\tSo, it seems like it was a big success. Do you feel like you possibly even learned the material better than you would’ve had had you been in Boston or Cambridge drinking a bunch of beer with undergrads? \n</p><p>\n<strong>Scott Young:</strong>\tWell, it’s hard to say. It&#8217;s hard to say. I think if I had been an MIT student—and I don&#8217;t want to discourage anyone who&#8217;s thinking about going to a school. If you can go to MIT, I think, by all means, go to MIT. But for me, that wasn&#8217;t an option. I certainly didn&#8217;t have the money to go to MIT. And obviously, most people, even if you are very smart, you can&#8217;t get into MIT even if you wanted to do that. \n</p><p> \nAnd I&#8217;m Canadian (I&#8217;m not American). So, if I were to go to study at MIT, then I also had to move, and I&#8217;d also have to get paperwork and all these stuff to get a green card or whatever it is to study there. \n</p><p> \nAnd so, for me, this was just a much simpler and easier option. \n</p><p> \nSo, I don&#8217;t know what I would be doing differently if I had, in some alternate universe, gone to MIT. But what I can say—and I was joking about this on another podcast—that I did another undergrad before. I did a business school education before that that I took the normal pace and I spent tuition. I did all those things. \n</p><p> \nAnd although that also had some worthwhile moments as an experience, I would say that, in terms of just strictly the amount of stuff I learned and the amount that impacts my life today, I learned more in that one year of doing the MIT challenge than I did in my normal undergrade  that was spread over multiple years. \n</p><p>\n<strong>Mad Fientist:</strong> \tThat&#8217;s amazing. So, this is your first attempt at this ultralearning idea. So you see that it works, and you see that you&#8217;re successful at it. Where did it lead to next?\n</p><p>\n<strong>Scott Young:</strong> \tYeah, this project, I was not only interested in learning computer science, but the initiation of this idea come about because I had met a guy that I mentioned just a bit earlier in the podcast, Benny Lewis. And so this was actually when I was doing my business school undergrad. I was doing an exchange in France. And I was trying to learn French and I was struggling. And I was introduced to this guy, Benny Lewis, who has a website very modestly called Fluent in 3 Months. And I remember my first reaction when I saw that website title, I was like, “This is bullshit! There&#8217;s no way you can learn a language this quickly.” \t\n</p><p>\nAnd so, I decided I had to meet Benny. And I did meet him. And I found that what it was wasn’t just, okay, he’s doing one technique differently, like there&#8217;s some little trick, “Oh, you just do this,” and then, all of a sudden, language learning is just effortless and easy, and you just become fluent instantly. \n</p><p> \nBut rather, it was his whole approach to the problem of learning. And so this is what I try to talk about in this ultralearning approach. Most people don&#8217;t go this far. Most people don&#8217;t really think about what is the best way to learn this material. They don&#8217;t really optimize everything to make it the most effective possible. \n</p><p> \nIt&#8217;s a little bit like if everyone in your life just jogged occasionally, and then you hear about someone running a marathon, and you&#8217;re like, “There&#8217;s no way that the human body can run that far,” it’s a little bit like that, if you&#8217;ve never heard of someone doing this. But obviously, lots of people do run marathons, and you can train for it and practice. \n</p><p> \nIt isn&#8217;t to say that everyone does it or everyone should do it. But it is to say that once you know that the human body is capable of that, it causes you to think differently about your own jogging or the little light exercise that you do. \n</p><p> \nAnd so, similarly, meeting Benny Lewis, really caused me to reflect. I had been, my whole life, in this school system where you have to take the classes, pass the exams, do what you&#8217;re told. It’s very much following the rules rather than really thinking outside the box of, “Okay, this is the skill I want. What&#8217;s the best way to get it?” \n</p><p> \nAnd so, Benny Lewis was really just sort of inspiring for me in that way. And so, that was sort of part of my inspiration for doing this MIT challenge, sort of seeing how he approached projects—and not only doing the project and learning things, but also writing about it and sharing it with other people. \n</p><p> \nAnd then, after I did the MIT challenge, it just so happened that good friend of mine was wanting to go travelling for a while. And so, after my somewhat lackluster approach at learning French, I decided, you know what, let&#8217;s maybe try to approach language the Benny Lewis way. \n</p><p> \nSo, we did a project which we called The Year Without English where we went to four different countries—Spain, Brazil, China and South Korea. And the idea was that, when we would land in each of these countries, we wouldn&#8217;t speak English to each other or the languages we learned. We would try to speak only in the language we were learning to each other and to everyone we would meet. \n</p><p> \nAnd that sounds super difficult when I outline it there. But the reality was that, yes, it is kind of frustrating for the beginning, but you quickly get to a level where, even if you&#8217;re not fluent, at least you&#8217;re comfortable using that language. And your proficiency develops much, much, much faster than the normal approach. \n</p><p> \nIn Spain, at the very least, by the time we were about a month or a month and a half in, you know, we had friends, we were going on dates, we were going to parties, we were doing all sorts of things that you would do if you were living there… it just happened to be in Spanish. So that was the second big project that I did. \n</p><p>\n<strong>Mad Fientist:</strong> \tThat&#8217;s fantastic. And yeah, you had a TEDx Talk that goes into some more details about that specific project. So I will link to that in the show notes because it&#8217;s really amazing to see the change. In that TEDx Talk, you shared some videos of you at week 1 versus week 12. And it&#8217;s amazing! It looks like you are fluent. And more importantly, as you said, it looks like you&#8217;re so comfortable with it that your learning is surely going to increase at a higher rate than it would be if you’re still not confident and doing the normal thing that everybody else does. \n</p><p> \nAnd do you think that&#8217;s a big thing that plays a part in it? Ultralearning is a good way to sort of get past that initial, really tough, uncomfortable phase to get to a stage where you can start to see the gains, and therefore have more motivation to continue and to work harder at it? \n</p><p>\n<strong>Scott Young:</strong> \tYeah. So, just before you mentioned that, before I get into that question, you mentioned the TEDx Talk where we had some short clips. And just because of the constraints of the TED Talk format, those clips are quite short. \n</p><p> \nBut if you go to my website, we have very long videos of us talking. So I think that’s a much better representation of what kind of level of ability that we were reaching at each stage because, obviously, anyone can sound good for like 15 seconds. But if you have like an unstructured 30-minute conversation, I mean that&#8217;s pretty hard to pull off if you don&#8217;t know anything. \n</p><p> \nSo, to go to your point about confidence, this was something that I thought was very interesting with approaching things in this ultralearning way. \n</p><p> \nAnd I think it brings up a very, very important point because some people I think have taken the idea of this ultralearning and saying, “Okay! Well, I&#8217;m just going to set some super ambitious goal,” and just setting of the ambitious goal is the process by which they’re going to be really good. And then, they start doing it, and they find it really frustrating. They&#8217;re like, “Well, what happened? Why did this person do it and I couldn&#8217;t?” \n</p><p> \nAnd so, I think I want to clarify here because it&#8217;s not just “Okay! Well, I&#8217;m going to be fluent in three months. And therefore, I&#8217;m an ultra learner. I&#8217;m going to do this really fast.” Rather, what it is is it’s kind of the opposite approach. It&#8217;s not thinking about the goal, but it&#8217;s thinking about what is the process of learning and how do I look at every moment that I&#8217;m spending learning and making little modifications so that you can make it more effective overall? \n</p><p> \nAnd when you do that—and some of those are big changes. Like I mentioned with language learning, obviously, if you are spending the entirety of your day only speaking in the language you&#8217;re trying to learn, already, that&#8217;s like a night and day difference between how most people learn a language. Most people, you would be lucky if you got an hour of practice in a day; whereas we were getting 8 or 10 hours a day on the regular… every day. That wasn&#8217;t even an unusual day. And it wasn&#8217;t something forced. It was just, well, you just have to get around and buy groceries and live your life. \n</p><p> \nAnd so, making adjustments like these to how you structure your learning efforts, whether it&#8217;s learning a new skill for a hobby or work, they can make big strides or big improvements. And then, as you&#8217;re seeing yourself improve more rapidly, I think that does build confidence. \n</p><p> \nSo certainly, when we were doing this language learning project, when we went to the second country, it was a little bit like we were missionaries for a new religion. We were converted. We knew that this was the approach that worked. And so, I think that&#8217;s something that can&#8217;t be understated when you&#8217;re going into a learning project or when you’re really tackling anything in your life. If you can approach it in such a way that you do build some early success and you get that confidence loop, now when you go off and you do something new or you face new challenges, you approach it from a different perspective. You approach it from this position of confidence and not, “Oh, I&#8217;m the worst in the class. This is awful! I suck in this!” It’s really demotivating constantly. \n</p><p> \nBut I think, at the same time, the right way to approach it is, instead of focusing on the outcome of like trying to learn an MIT degree in one year, or trying to learn a language in a month, or trying to do X in a very short period of time, focus on the process first. And then, as you start doing the process, it&#8217;s very easy to sort of pick a goal. Even when you&#8217;re halfway through, you could say, “Okay, three months down the road, let&#8217;s try to aim for this test or this benchmark or this kind of approach” because that will be a lot more successful than if you just arbitrarily pick something and you don&#8217;t focus on the process.\n</p><p>\n<strong>Mad Fientist:</strong> \tYeah, that&#8217;s great to point out. And that&#8217;s exactly why I was so excited to get you on the show, because not only am I very interested in your book—your book was great, I really enjoyed it. But I just released a post recently talking about the fact that one of my biggest ambitions in life is to just write and record and release music. And it&#8217;s the one thing that I feel like I can&#8217;t do because I just have this fixed mindset of like, “Hey, I&#8217;m a math and science guy.” \n</p><p> \nAnd even though everything else in my life, I feel like, if I work hard enough, I can do it and accomplish it, it’s this other side of things that I feel like, “Oh, maybe I just don&#8217;t have what it takes to be creative or be an artist” or whatever. \n</p><p> \nAnd luckily, through the writings of James Clear who is the person that wrote the foreword for your book—and he&#8217;s been on the show before—I&#8217;ve got into at least the habit of trying to read music which has totally revolutionized everything because, now, feel like my identity is changing a bit. And it&#8217;s like, “Well, hey! Actually, I am a musician and I could do this.” \n</p><p> \nAnd it&#8217;s been great. But I feel like, for the past few years, I&#8217;ve just been bouncing around in the dark and hitting off walls and not really sure what direction I&#8217;m going in and if I&#8217;m making progress; whereas now, I feel like at least I&#8217;m out into the light and I&#8217;m going maybe five miles per hour, and I feel like I&#8217;m moving in the right direction. But five miles per hour doesn&#8217;t really feel like you&#8217;re moving when you&#8217;re in a car or whatever. And it&#8217;s not extremely motivating. And I still feel like maybe I&#8217;m slightly pointed in the wrong direction. So, I thought, this is great, I have three months coming up where I have absolutely nothing scheduled. I have no responsibilities really… which is great. So, it&#8217;s like I can dedicate three months to maybe trying out my own ultralearning project. \n</p><p> \nAnd I&#8217;m not hoping to create this album that I can then release and everybody will love or anything. But if I could get from like 5 miles per hour to maybe 10 or 15 miles per hour and feel the breeze in my hair and sort of make it feel like I&#8217;m making more progress, then that would be amazing. \n</p><p> \nSo, do you think an ultralearning project would be ideal for that sort of…?\n</p><p>\n<strong>Scott Young:</strong>\tOh, absolutely. Absolutely! And I think if I were just thinking about your project, one of the challenges—and I think you kind of bring this up a little bit—is that when we talk about big things like music or art or a new language or programming or whatever it is, it can often feel overwhelming because the scope of what we want to learn is just so broad. You just see all the things that you can&#8217;t do or that you&#8217;re not adequate about, and it just feels impossible. \t\n</p><p>\t\nAnd so, one of the things that I really recommend doing—and again, it sounds kind of surprising, considering that some of these projects have been kind of large in scope, but this is really the art of it—is to break down big ideas of things that you want to do into smaller, very concrete stages. \n</p><p> \nSo, if we&#8217;re talking about learning a language, for instance, a very good sort of starting goal is having your first conversation with the aid of Google Translate and a dictionary. You can type whatever you want and have that back and forth for like maybe five minutes. That’s a very good starting goal. \n</p><p> \nAnd then, you can move to, “Okay! Well, let&#8217;s try to have a five minute conversation, and I don&#8217;t need to use the dictionary.” And then, try to move that up to 30 minutes. And then, try different situations and different topics. And it can expand and multiply in this way. \n</p><p> \nAnd I think so many skills, you have to really chunk them down to something concrete because when we say to ourselves, “Well, I want to be good at programming,” well, there is no such thing as being good at programming. Being good at programming is really being good at many, many, many different sub-skills that all kind of, in aggregate, add up to, “Oh, you&#8217;re a good programmer.” It&#8217;s knowing many things as having lots of patterns saved in the brain. \n</p><p> \nSo, this is one of the principles I talked about in the book of intuition. And I think it&#8217;s related to what you&#8217;re trying to do here with music, is that for a lot of people who perhaps don&#8217;t have a lot of confidence—so if you&#8217;re approaching something that you&#8217;re trying to learn, and you feel like you&#8217;re not very good at it right now—that’s okay. I think that, for those people, it&#8217;s better to just see it as, “Okay, let&#8217;s focus on some concrete, specific thing that I want to work on,” and then, once you&#8217;ve done that, do another concrete specific thing… and then another one. \n</p><p> \nAnd then, as you start building them out, you start to become a bit more confident, a bit more flexible. And you can start to handle a bit more ambiguous challenges, things that are a little bit less concrete that are a little bit more flexible.\n</p><p>\n<strong>Mad Fientist:</strong>\tExcellent! So, if it&#8217;s okay with you, I obviously want to dive into a bit of more detail about ultralearning. But I think if we structure it in a way that, you know, I&#8217;m coming up with my own plan, then yeah, that could be potentially more useful to people out there just to see what a real ultralearning project could look like. \n</p><p>\n<strong>Scott Young:</strong>\tYeah. \n</p><p>\n<strong>Mad Fientist:</strong> \tSo, the first thing, I guess, is to define the project goals, the timeline and the scope. So for me, I guess the project is songwriting and music production. The timeline is September/October/November this year. And then, the scope is, like I said, this is something I want to do for the rest of my life. And I want it to be more fun. Obviously, the milestones along that path are actually releasing an album. And before that, maybe releasing an EP or a single or things like that. \n</p><p> \nBut for this project, I think it is just getting from 5 miles per hour to 15 miles per hour. Is that what you mean by scope? \n</p><p>\n<strong>Scott Young:</strong>\tSo, scope, I would say has two roles here. So one scope is the scope of the content that you want to learn. So you&#8217;ve already kind of delineated it somewhat, producing an album. One way to kind of further limit the scope is sort of artistic style, “So this is the kind of music I want to make.” And depending on how you&#8217;re recording it too, like are you playing the instruments, is it something you&#8217;re using software, limiting it in that scope so that you know, “Okay, this is what I&#8217;m going to try to learn. And I&#8217;m not going to try to learn some other things.” \n</p><p> \nSo, I&#8217;ll use an example of a project that I did which was short in timeframe. It was only one month. And I had to really restrict the scope in order to make it successful. And this was one of the projects I talked about in the book which was learning to draw faces, draw portraits. \n</p><p> \nAnd for that project, I only spent a month doing it. And I think I did a reasonable job in that month of getting better at drawing faces. But the key was that I had to really restrict what I was trying to do in that timeframe because, if you had just said, “Well, I want to become a great artist in one month,” that is probably going to be not so successful in a one month project. \n</p><p> \nHowever, I limited it to—wlel, first of all, I&#8217;m only going to do it with graphite pencil (and a little bit of chalk, but graphite pencil basically). So I&#8217;m not trying to do charcoal, which is more difficult because it&#8217;s hard to erase charcoal. I&#8217;m not going to do watercolors. I’m not going to do oil paints, acrylics. I&#8217;m not going to do pastels. I&#8217;m just doing graphite. So, already, we&#8217;ve simplified somewhat. It’s only doing black and white. So again, I don&#8217;t have to deal with skin tones and all the various little—I just have to focus on tonal values. \n</p><p> \nI&#8217;m doing sort of like portraits or drawings from photographs. So I&#8217;m not trying to do a model in the studio (I have to bring people in and try to sketch them while they&#8217;re sniffling and what-not). And finally, I&#8217;m only focusing on what I&#8217;ll call sort of like a reasonably long amount of time to draw a particular portrait, so like in the range of an hour or plus to draw a finished portrait, which is quite different from like street side caricaturists or street side sketch artist who have to do it in about three or four minutes, right? So, it’s somewhat of a different skill. Some of the methods you can use to draw things really well when it takes you five or six hours to draw a very accurate portrait will not work when you&#8217;re trying to do it in three or four minutes. They just take too long. \n</p><p> \nSo, these are all examples of scope production, so that I&#8217;m focusing on a very concrete skill. And the result is that I was able to get quite a bit better with a concentrated burst of practice. \n</p><p> \nNow, if I had just been, “I want to get better at drawing,” that&#8217;s too broad of a scope I think. And so, one thing that could be helpful here is thinking about how are you going to put constraints on the albums you want to create, the music you want to create, in that three-month period of time, so that you can get really good at the things that are within those constraints. And you can just leave the things that are outside of those constraints just for the time being. You just put them aside. So that&#8217;s one way of talking about scope. \t\n</p><p>\t\nThe other way of talking about scope is simply in terms of your time investment. So, when I did that portrait drawing challenge, for instance, I made a rule that I was going to spend—it was going to be a pseudo-full time project, but it was going to be 25 hours a week. That was how much time I was going to spend. I was going to spend more than that. I was just going to spend five hours, Monday to Friday. That was how long I wanted to spend. I wanted some extra time to work on some other projects for my work and this kind of thing. And so, that was my scope for that project. \n</p><p> \nPeople listening to this, if you&#8217;re working full time, you maybe only have half an hour a day for a project. That&#8217;s your scope. If you&#8217;re going to be doing this for three months, four months, that&#8217;s also a scope. \n</p><p> \nSo, thinking about what constraints you&#8217;re doing the learning in, it’s very important to delineate those in the beginning because, once you get that box of “Okay, this is what I have to work within,” now you can start to really explore, “Okay, what will be the best way to reach that?” Whereas if you don&#8217;t have those constraints, there&#8217;s always this temptation of, “Oh, maybe I should be doing something,” and then it&#8217;s completely different from what you&#8217;re doing right now. And you just kind of flounder.\n</p><p>\n<strong>Mad Fientist:</strong> \tOh, that&#8217;s fantastic feedback actually because I need that. I need to be more focused on things. \n</p><p> \nFor the first part of the scope, I&#8217;ve been doing some prep work. We&#8217;re recording this in August, and I wanted to really hit the ground running in September. So, I&#8217;ve been setting up like default projects within my music recording software just so that I have structures in place that I can just start firing ideas into. And so, maybe sticking to those structures—most songs are structured the same. And another musician that I really respect talked to me about that. And he&#8217;s like, “You know what, this formula works so well, and it&#8217;s used so many times. It’s because people are used to hearing it, and that&#8217;s what people like to hear.” So, just sticking to that structure, you may feel like you need to do something really unique. But really, you don&#8217;t. You can just stay within that framework and record and release some really interesting stuff. \n</p><p> \nSo, maybe for this three-month project, I have to stick to that. And then, as far as equipment goes, like I obviously have the synthesizers that I own, maybe just focusing on only using those and limiting the amount of instruments that I try to put into the things that I write. That could be really good for scope. \n</p><p> \nAnd then, as far as time is concerned, do you think five hours per day, five days a week, is a good way to do it? Obviously, like I said, I have all the time in the world. But when you have all the time in the world, sometimes, you don&#8217;t focus as hard as when you only have five hours. \n</p><p>\n<strong>Scott Young:</strong> \tWell, full time… yeah, full time, I think that hourly restriction is less important if it&#8217;s like, “Okay, I&#8217;m not doing anything else.” The time restriction I think is particularly important if you are juggling this with other things. \n</p><p> \nThe thing that I&#8217;m trying to avoid is, okay, you&#8217;re working a job, you&#8217;re already going to school, you&#8217;re already dealing with x, y, zed in your life. And then, you say to yourself, “I want to do some ultralearning project to learn…” some skill that you care about. And then, you say to yourself, “Well, I&#8217;m just going to do it as much as possible. I&#8217;m just going to study as much as I can… you know, whenever I have time.” “As much as I can” inevitably becomes “not very much.” And so, what I recommend for people is to decide what hours you&#8217;re going to invest in advance. \n</p><p> \nSo, five hours is kind of arbitrary. And I think the right way to think about this hourly investment is you do have the opportunity to change it midway. I did a project recently where I was learning quantum mechanics, and I was originally trying to stick to a six hour per day schedule, and then I was finding it more difficult, so I actually went a little bit more than that. There’s a week or so that I was doing much closer to full time or a little bit more full time for that schedule. \n</p><p> \nAnd so, you can change those constraints depending on your feedback. \n</p><p> \nAnd I would add as well, you can also change your constraints to your content based on feedback as well. So these are not decisions that need to be set in stone. \n</p><p> \nSo, you might decide right now, for instance, that, okay, a limited set of instruments is going to make this project easier. But you might go into the project finding, “You know what? Actually, that doesn&#8217;t matter so much. Maybe the instruments that I&#8217;m restricting myself to is not really helpful, and it&#8217;s actually getting in the way of things. And what I should really be restricting is maybe the genre” or maybe restricting, “I&#8217;m going to try to do this type of song… I&#8217;m going to do like an indie rock song versus synth pop or some kind of deep house. I&#8217;m going to do a very specific genre of song.” \n</p><p> \nSo, I don&#8217;t know. As I’ve said, I’m not a music producer. We were talking about this before the call, that I don&#8217;t have that sort of hands-on experience of learning this particular thing. But I would say that playing with constraints is very important. I think that&#8217;s an area where a lot of people stumble in their learning projects, is that they just let things go fuzzy. They just sort of allow themselves to do whatever… and then they try a bit of this, and they try a bit of that. \n</p><p> \nAnd I&#8217;m not saying that there&#8217;s anything wrong with dabbling as you&#8217;re figuring things out. But I think if you want to really get results that are you&#8217;re very happy with, it&#8217;s often very helpful to be quite clear at what you&#8217;re trying to accomplish. \n</p><p> \nAnd if the constraints are too broad, particularly for the amount of time you have to invest in it, a good way to get better results is just to tighten the constraints and make it more concrete and specific… and you will start getting faster results in that more concrete and specific thing.\n</p><p>\n<strong>Mad Fientist:</strong> \tExcellent! So meta-feedback. This is probably a good time to share what that is and why that&#8217;s important.\n</p><p>\n<strong>Scott Young:</strong> \tYes, I love the word meta. So, meta just basically means something about itself. So feedback, meta feedback, is basically feedback about your learning process (or the feedback you&#8217;re getting). So essentially, there is feedback you can get of “does this song sound good or not?” But then there&#8217;s also the feedback of “is the approach I&#8217;m using to learn songwriting good or not?” And so that kind of feedback is also very useful. \t\n</p><p>\nAnd so, a lot of the things that I talk about in this book—and this is sort of hard to convey. I can only give you the impression of it. It’s really something you have to learn through practice. But I want people to kind of start developing a feel for when are things slowing down, when are things getting stuck, when you&#8217;re like, “Well, I&#8217;m not actually getting better right now.” And if you can sort of fine tune your own sensitivity to that process, you&#8217;ll learn a lot better. \n</p><p> \nAnd so, using my portrait drawing project that we&#8217;re talking about before, this was something that happened to me. So I went in, and like a lot of people, you go into a project, you have some idea of “Okay, this is probably the way I want to approach it.” And so, the idea that I had going into this project is, “Well, I want to get better at drawing faces. And often, I draw faces, and they are clearly wrong, like not just that this is a bad artistic rendition, but the eyes aren&#8217;t in the right spot, the face is too wide, too tall. Even by little bit, if those things are off, the face looks wrong. \n</p><p> \nAnd so, I was trying to figure out “Okay, how can I get better at drawing faces?” And so, I thought a really good technique would be draw faces fairly quickly, and then take a photo with my iPhone, scan it or just put it on my computer. And then, you can in Photoshop (I was using a different software), you just lower the transparency of the photo to about 50%, and you put it on top of the drawing you had. You have to scale it a little bit, but you just line it up, and you just see how close were you, right? \n</p><p> \nThis is the kind of feedback you don&#8217;t usually get when you&#8217;re drawing that you can say, “Oh, no, no… their eyes were supposed to be here. That&#8217;s what you screwed up about it.” \n</p><p> \nAnd so, this was sort of my little idea that I had of “Oh, this is all I&#8217;m going to need to be able to draw portraits well.” \n</p><p> \nAnd so, I&#8217;m doing this. And this is a project, by the way, that only just took place over a month. So this isn&#8217;t something where I&#8217;ve been working on it for years. This was just a very short period of time. And after about two weeks of doing this, I started to stall. It was getting better to a point. And then, I noticed, well, all the mistakes I&#8217;m making are now just random. \n</p><p> \nSo, it used to be “Okay. Well, I&#8217;m consistently putting the eyes too high up on the head” or “I&#8217;m consistently making this kind of mistake.” Whereas now, it just seems sometimes the head’s too wide and sometimes it&#8217;s too narrow. Sometimes, it&#8217;s too this; sometimes, it’s too that. \n</p><p> \nAnd so, I kept doing it again and again. And I was seeing, “You know what, I&#8217;m not actually getting that much better with this method anymore.” So this is a kind of meta feedback. And so, what I did then is it was like, “Okay, let&#8217;s do some more research to figure out what other techniques exist for drawing portraits.” And it happened to be that I found this course taught by a place called Vitruvian Studios. And they teach a very specific method for basically plotting out how wide and where things should be on the face. It a little bit of time. So you can&#8217;t sketch with it, but it does work extremely well. \n</p><p> \nAnd so, that was one sort of step that, once I learned that method, then I went back, and all of a sudden, I was back to improving again. \n</p><p> \nAnd so, when you&#8217;re working on learning projects, they often proceed like this, where you go with some sort of approach—you get some book, you get some manual, you get some instructions—and you work on it for a while. And then, you keep doing it, you keep doing it… and it sort of plateaus. You stop getting better. And you need to kind of be sensitive to those plateaus to be like, “Hmm… maybe I need to go back and look at some other methods, look at some other techniques, maybe have some different drills, what-have-you, to try to get back up on that  steeper part of the learning curve.” \n</p><p>\n<strong>Mad Fientist:</strong> \tRight! Okay, okay. That makes sense. So, if we go back to the actual building of the ultralearning plan, we have the scope, “I&#8217;m going to dial down a bit more and make that more focused,” but then you also sort of talk about, in the book, to identify core concepts, facts and procedures—which I&#8217;m not going to go into here because there&#8217;s a lot of other things I&#8217;d rather dive into, but you go into in detail in the book. \n</p><p> \nSo, for mine, I identified the things that I know that I&#8217;m going to have to get good at as far as if I want to write and produce a really good song. I’m going to have to get good at melody and harmony and rhythm and lyrics and sound design and mixing and mastering. And all of that started to get overwhelming. \n</p><p> \nBut then I got to the part in the book where you talk about the emphasize/exclude method. And that sort of actually made me feel a lot better because I was able to exclude mastering, for example, because that&#8217;s something I could pay somebody else to do who has spent a whole lifetime getting as good as they can at mastering. And that&#8217;s not something essential, especially to this project, but overall to my ultimate goal. \n</p><p> \nAnd then, it also made me realize like maybe focusing on melody is very important because all the songs that I really enjoy and would love to produce myself have really strong, catchy melodies. \n</p><p> \nSo, could you just talk a little bit about the importance of that, emphasize/exclude in developing an ultralearning plan? \n</p><p>\n<strong>Scott Young:</strong> \tYeah. So, the way that I think of emphasize/exclude is to say that, when you start learning anything new, I always try to look at how do other people learn this as the starting point. And that might sound a little funny because isn&#8217;t my whole kind of pitch right now that you should be learning differently and thinking outside the box and doing ultralearning as opposed to what people normally do. But I think it&#8217;s always good to start with how other people have actually learned the skill. So, if you want to learn a language, talk to people who learned the language. \n</p><p> \nAnd so, sometimes, you&#8217;re going to have a bunch of different suggestions. So, someeon’s going to say, “Well, I spent 10 years doing this” or “I was in art school for 15 years” or whatever. And then, you&#8217;re like, “Wow, I don&#8217;t know whether I can really replicate that.” \n</p><p> \nBut the main thing to focus on—and I think particularly for skills like this—is to often look at people who are selling books or courses or tutorials that have an actual curriculum for getting good at this. \n</p><p> \nSo, I&#8217;m sure that there&#8217;s books and resources for producing your first album, these kinds of guides. This would be a good starting point to look at like a structuring… okay, how would you approach it. \n</p><p> \nSo, I can speak to language learning, this is something that I know fairly well now. If you buy any book on languages, they will kind of give you sort of, “Okay. Well, you&#8217;re going to need to do this, this and this. And this is what people have done in the past to learn it. These are sort of the sequence of topics. These are sort of some words to learn.” \n</p><p> \nAnd so, the emphasize/exclude method is to recognize that, because learning materials generally are structured to be for everyone, when you are learning something personally, you can often either omit some parts that you&#8217;re like, “You know what? I’m not going to do this right now. I’m going to do this later. I&#8217;m going to do this in a different project,” or you can emphasize some parts that you really want to focus on that maybe get sort of a short shrift in the current curriculum. \t\n</p><p>\t\nSo, with the language, for instance, one of the things that I think about—which is a classic example of this emphasize/exclude method—is a lot of people who learn Chinese, if they go through a normal school system, they will be taught to handwrite characters from the beginning. This is a very early process. They are taught to get the little grid of squares and handwrite these calligraphic characters onto the paper. \tAnd in my opinion, this is a total waste of time. \n</p><p> \nYes, I think learning to recognize characters does have some utility. But learning to handwrite characters should really only be done once you are already comfortable reading and writing with a keyboard. If you&#8217;re not able to do that, I don&#8217;t really see much point in learning to handwrite the eight things that you can say. \n</p><p> \nSo, this is an example of emphasize/exclude. You even say, “You know what? I&#8217;m going to exclude handwriting characters. And I&#8217;m going to emphasize,” let&#8217;s say, “having conversations which may be are not that prevalent in the class or program that I&#8217;m in.” \n</p><p>\n<strong>Mad Fientist:</strong>\tYeah, that makes sense. And yeah, just thinking through my own projects while you&#8217;re talking, it&#8217;s like in these courses, I&#8217;m sure recording live instruments is probably going to be a really big section because that&#8217;s a big, important part. But since I&#8217;ve limited my scope to this, to only synthesizer/electronic music, then that&#8217;s one whole thing that I can just exclude completely and not worry about. \n</p><p> \nAnd yeah, one day, I hopefully will learn that stuff because I would like to record some real life instruments. But at this stage, that&#8217;s something I can just feel happy just completely excluding… which obviously makes me feel better because that&#8217;s one less thing to worry about at this stage. \n</p><p>\n<strong>Scott Young:</strong>\tMm-hmm… and there&#8217;s nothing wrong with going back and learning something later. So, I think the sequencing of how you learn things is very important. \n</p><p> \nSo, I think the totally wrong way to approach learning is to say, “Well, I&#8217;m going to have to learn it eventually anyway. So I might as well just learn it right now.” And I think this is the wrong way of doing it because learning is always a bootstrapping process. How do you bootstrap yourself to the next level, and then the next level, and then the next level? \n</p><p> \nAnd so, if you just learn things in a completely random order, you never get to a level of proficiency, or you need to learn so much more to get to the first level of proficiency that you don&#8217;t get that feedback. You don&#8217;t get that improvement process. \n</p><p> \nAnd so, yeah, I think it&#8217;s certainly possible for someone to approach music with the opposite scope. They’re going to say, “You know what? I&#8217;m going to start by learning how to play this instrument, and only later worry about composition and producing actual songs. I’m just going to start by playing the piano or the guitar.” That’s also a valid way of approaching it. \n</p><p> \nBut I think, “I&#8217;m going to do everything. I&#8217;m going to learn to play the guitar a bit and the trumpet and the drums, and then also produce, and also do these, because I want to be able to do them all eventually anyways,” that&#8217;s the wrong way to approach it. You’re then going to just be totally confused and in a mess, and it&#8217;s going to be very difficult to actually do everything all at once.\n</p><p>\n<strong>Mad Fientist:</strong> \tYeah, absolutely. So, one of the big things that you talk about that seems very important to have a successful ultralearning project is direct practice. And I know you mentioned DuoLingo earlier, and I know that I&#8217;ve come across things that have felt really productive in a very fun and laying back on the couch sort of really easy way. But I&#8217;ve also talked to Cal Newport—and he&#8217;s been on the show, talking about the value of doing the hard thing and focusing and not taking the easy game way out. So can you talk a little bit about direct practice?\n</p><p>\n<strong>Scott Young:</strong>\tSo, direct practice is this idea that there has been, really, for over a hundred years, an enormous amount of research that shows that people are bad at what we call transfer. \t\t\n</p><p>\t\nSo, transfer is when you learn something in one context (let&#8217;s say in a classroom or from a book), and you want to apply it in a different context (let’s say in real life). This doesn’t mean that books are bad. This doesn’t mean that classrooms are bad. But what it means is that, without a connection to the real world, often, people who learn something in a purely academic setting or purely in a classroom setting are unable to make fairly trivial transfers of that knowledge to a situation that we actually care about. \n</p><p> \nSo, when we have students in a classroom, we don&#8217;t really care about how they do on a test. We&#8217;re hoping that they&#8217;re going to learn something that they can apply off of the test. That&#8217;s the whole point of going to school. And it just shows that—you know, there&#8217;s study after study showing that really trivial things that you would expect someone who has spent a bunch of time studying something should be able to do, they often can&#8217;t. \n</p><p> \nAnd there&#8217;s all sorts of research about people explaining why this might be the case and how you might alleviate it and all these types of things. But for the person listening right here, I think the most valuable lesson here is just to understand that the way that we learn things, at least in the beginning, tends to be quite specific. \n</p><p> \nAnd this is not just in terms of “Okay, we&#8217;re just…” Like if you&#8217;re learning vocabulary word, and you learn that word, it doesn&#8217;t mean you&#8217;ve learned other words. Yes, there’s that specificity. But also, there’s specificity in how you use it. So, if you learn a word just by using flashcards, you are going to be somewhat less effective in using it in conversations than if you would learn the word in conversations. \n</p><p> \nSo, that doesn’t mean that flashcards are always bad. But it doesn&#8217;t mean that you need to be careful if the only way you&#8217;re learning to speak is through flashcards. \n</p><p> \nAnd so, similarly, in your music example, if you just read a book of theory, about music theory, you&#8217;re going to have to do a lot of practice that is very similar to how you actually want to produce music in order to translate that into actual usable knowledge. Whereas a lot of people would just read book after book after book, and then they start going in there like, “Why can&#8217;t I remember anything? Why can&#8217;t actually use this?” And the problem is this issue of transfer right here. \nItnx\tRight, okay. So, obviously, in my situation then, the thing I need to do for direct practice is to write songs. That&#8217;s exactly what I need to do. That&#8217;s what&#8217;s going to teach me how to write songs… by writing songs. \n</p><p> \nMy question to you is, as I’ve talked about before, it&#8217;s a confidence issue at the moment. I obviously must have this fragile ego that&#8217;s trying to protect itself and doesn&#8217;t want to fail. And the act of writing songs is the hardest part just because it&#8217;s just like, yeah, it&#8217;s combining so much stuff. \n</p><p> \nI recently just finished a cover song. Sonic Youth is like a band that&#8217;s very experimental noise guitar rock. And I decided to write like a synth-y version of one of their songs… which ended up teaching me so much about music production, songwriting, building energy, all these sorts of things that are really important. But my ego was sort of protected in a way because it was like, “Well, I know this is a good song. The structure, everything about this song is great. I love it.” But it allowed me to sort of build those skills without having that dread of sitting in front of a synthesizer and being like, “Okay, I have to create something from nothing.” And then, all this stuff after it of like, “Well, is this really good? Or does it suck?” and all that sort of stuff. \n</p><p> \nSo, obviously, that was really helpful to me. But I also don&#8217;t want to rely on that for the next three months and just do that sort of thing. So, is there a balance there? Should I start my morning by really trying to do stuff from scratch, but then have the bulk of my day being something where I am really progressing in certain areas, but I&#8217;m not dreading it, and I&#8217;m not at risk of finding things to procrastinate with? \n</p><p>\n<strong>Scott Young:</strong>\tOkay, so this is actually a really good question because, obviously, when you say, “Okay, just go out and do things in the real world,” the challenge with many learning activities is that you&#8217;re not good enough to do them in the real world. \n</p><p> \nSo, if I say, right now, I’m imagining that you don&#8217;t speak Hungarian right now, but if I said, “Okay, go out to this person, just deliver this lecture in Hungarian” because you want to be a University lecturer in Budapest, that&#8217;s not necessarily very useful advice because how the heck do you do that if you don&#8217;t know any Hungarian. \n</p><p> \nAnd so, the key is to recognize that, when I&#8217;m talking about direct practice, what I&#8217;m trying to point out is that you should be trying to learn in ways that are connected with what you&#8217;re trying to do. But very often, you have to start with something simpler. And the simplicity and the simplification is going to omit things. There&#8217;s no doubt about that. \n</p><p> \nSo, if you are doing a cover song versus a new song, the new song is harder. And you&#8217;re right about that because there are things that you have to do, mentally speaking, to create a new song that you don&#8217;t have to do in a cover song. And those skills are not necessarily getting practice. \n</p><p> \nNow, that being said, it&#8217;s just a little bit like having a conversation that I recommend, for instance, if we&#8217;re talking about language learning, that what someone should do right off the bat is try to have what I call a Google Translate conversation where they just type what they want to say into Google Translate, they kind of read it out, they make the sounds with their lips, that person says what they want to say. They obviously don&#8217;t understand it, so you get them to type it. They copy it and put it into Google Translate. \n</p><p> \nThis is very halting, and it&#8217;s a little artificial because, obviously, you don&#8217;t want to be talking to Google Translate. But the idea is to simulate some of the basic elements of a conversation early on. And then, you can use this as a bootstrapping process. So as you learn more vocabulary, maybe you don&#8217;t have to translate those things. Maybe instead of translating whole sentences, you just translate a word you don&#8217;t know. And it can progress from there. \n</p><p> \nAnd so, in this way as well, if I were to start with music production because I have no ability here, I definitely wouldn&#8217;t be just like, “Well, I&#8217;m just going to make a new song,” and I don&#8217;t know anything. I would probably simplify the task as well. \n</p><p> \nThe idea is that you want to grow into it. I think it is very much the case that, if you do covers, you&#8217;re probably going to miss some of the creative process, but you&#8217;re still working on a lot of the things that are involved in getting better at that skill. And you can grow into making more original works as you get better at those other parts. \t\n</p><p>\t\nSo, the directness idea is kind of a nuanced idea. But the right way to think about it—and I&#8217;m going to be a little bit abstract here, so hopefully the listeners will understand what I&#8217;m saying. The right way to think about it is that, really, what&#8217;s going on in your head whenever you&#8217;re doing any skill is that you are having to make many, many, many little different discriminations, little different choices of what to do, different actions to take. There&#8217;s all these very small micro skills that make up the bigger skill that you&#8217;re trying to do. \n</p><p> \nSo, as I’ve said, there&#8217;s no such skill as speaking a language. There&#8217;s the skill of producing this sentence, producing this word, pronouncing these phonemes. Those are all little smaller skills. \n</p><p> \nI know this is a very abstract picture, but what I&#8217;m trying to suggest when we&#8217;re talking about directness is that you should, at the very least, be doing some subset of these skills that builds into the total skill that you&#8217;re doing. \n</p><p> \nAnd also, to recognize that when you are only doing some of the sub-skills, the ones that you aren&#8217;t practicing, you haven&#8217;t gotten to yet. And you&#8217;re going to have to work on those if you actually want to be able to perform it. \n</p><p> \nSo, this contrast with how we often learn things in an academic setting where, first of all, there are huge swaths of the skill that you just never practice. If you&#8217;re in a classroom, you just never do those things because they&#8217;re not classroom; they’re real world. \n</p><p> \nAnd then, there&#8217;s also situations where you get kind of an imbalanced situation where you keep learning new vocabulary, keep learning new vocabulary, new grammar patterns, but you&#8217;ve never had a real conversation with someone outside of the classroom. That&#8217;s kind of a lopsided imbalancing. You&#8217;re not growing into the space that you need to grow into. \n</p><p> \nBut then also you get into the situation where you just keep working at it, and you don&#8217;t really get the results you want because you don&#8217;t realize that you&#8217;re actually missing this huge chunk of what you need to learn. \n</p><p> \nSo, I think it&#8217;s totally okay to simplify the task in the beginning. And that may even be necessary to learn. You may even necessarily have to simplify quite a bit. But I think the more you can recognize, “Okay, I&#8217;m going to be doing this cover songs right now. And as I&#8217;m getting better with this, I&#8217;m going to gradually move into creating my own original compositions and to go in that direction,” you can slowly expand until you build that confidence.\n</p><p>\n<strong>Mad Fientist:</strong> \tOkay, perfect. And then, just as you were talking, that made me think like, maybe in the next one that I do, I’d do something similar. But I’ll also maybe tweak the melody of it and make that a bit more original. \n</p><p> \nBecause when I finished this one that I did, I realized if I took the lyrics and the vocal melody out, this could be a completely different song because everything else is so different. And then, it&#8217;s like, “Well, this is great. I designed all these sounds on my synths that I really enjoy. And I could use those in another song. But I could even just use the whole structure.” So yeah, maybe doing that. But then each time, tweaking something else that I didn&#8217;t tweak in the last version to then sort of be like a drill… which I wanted to get to next actually. Then I would drill melody writing in this certain scenario. And I would have the lyrics already, so I wouldn&#8217;t have to worry about that, but I could develop certain new melodies for a song that already I know is good. \n</p><p> \nSo yeah, maybe this is a good way to talk about drills. And I can maybe list some of the things that I came up with for my project. And you can tell me if I&#8217;m sort of going down the right direction. Does that sound like a plan? \n</p><p>\n<strong>Scott Young:</strong>\tMm-hmmm… \n</p><p>\n<strong>Mad Fientist:</strong>\tAlright! So, obviously, the direct practice is the main thing. But then you also have to drill on the things that you&#8217;re not as competent in. is that the purpose of drills? \n</p><p>\n<strong>Scott Young:</strong>\tSo, there&#8217;s two purposes to drills. One is that, sometimes, you have a particular weakness that’s holding you back. So, this particular weakness is just lowering your overall proficiency. \n</p><p> \nI don&#8217;t know what it would be exactly in music, but a good example from language learning would be your pronunciation. So maybe your pronunciation is just not correct, and this is causing a lot of problems. It just hold back everything else you do in your speaking. \n</p><p> \nOr it could be that you do have good pronunciation and grammar, but you just don&#8217;t know enough words. And then, that&#8217;s a bottleneck. \n</p><p> \nSo, drills can sometimes be to fix a very specific deficit. It&#8217;s not that your problems are everywhere. You have one particular problem. And then, the second reason to do drills is just because when you are doing complicated skills, like we just said, there are so many different things going on at the same time that you need to simplify it. You need to focus on some particular element of it. \n</p><p> \nSo, again, if we&#8217;re talking about music, if you are working on making a new song, you have to think about the instruments, melody, samples, all sorts of things. Maybe you just focus on, “You know what? I&#8217;m just going to focus on lyrics… I&#8217;m just going to focus on melodies… or I&#8217;m just going to focus on making a sick baseline,” or something like that is going to be your starting point. And so, this can be a good activity. \n</p><p> \nThe one thing I would say about it is—and this is, again, going back to this getting a feel for things, which again is something that I can&#8217;t give you rules for. You just have to learn by doing it. But I hopefully can point you in the right direction. And one of those things is that, when you&#8217;re doing direct practice, it&#8217;s again noticing, “Okay, I&#8217;m starting to slow down now,” and then you can kind of use that as a trigger point for “Maybe I should do some more drills.” \n</p><p> \nSo, I think as you get better in skills, the amount of time you spend doing drills changes. \n</p><p> \nI feel that, in the beginning, you&#8217;re doing something like drills maybe because the direct practice situation is just too hard. So, for instance, if we&#8217;re speaking a language, you may only be doing a little bit of direct practice because you just need to actually master some of the basics on their own, and then build them and put them together to actually have that conversation. But after you&#8217;ve been speaking for a while, it goes the other direction where, once you&#8217;ve been speaking a language for a couple years, now maybe it&#8217;s sort of like, “Okay, I actually need to really work on my writing ability… or my ability to give speeches… or my ability to understand movies” because this specific thing is holding me back.\n</p><p>\nAnd so, I think that you can see this pattern in a lot of skills. Now, I don&#8217;t know where exactly you&#8217;re at with the music production and how difficult it is. But again, I think the drills play these kind of roles. And in the beginning, they are sort of necessary simplifications of the actual thing you&#8217;re trying to do because the actual thing you&#8217;re trying to do is just too hard to do most of the time. And then, later, you&#8217;re doing more drills, because the thing that you&#8217;re trying to do most of the time, or the direct practice situation, is in some ways too easy. In some ways, you&#8217;re just kind of, well, you&#8217;re adequate at it, and you need to actually break it apart and break it down and work on those sub-skills in order to get better at the things that you&#8217;re already good at.\n</p><p>\n<strong>Mad Fientist:</strong>\tAlright, okay. Yeah, no, that makes a lot more sense actually. And that again makes me a bit less apprehensive about starting this because I was just imagining myself banging my head against the table for five hours or something because I’m just trying to do as much direct practice as I can. \n</p><p> \nBut yeah, just change it as I get more confident or recognize that I need some additional work in certain areas. That’s great. \n</p><p> \nSo, the other thing that you&#8217;ve been talking about is experimenting which also seems to play a big part, especially in songwriting and things like that. Again, I guess it’s just going to depend on how I feel which is what I&#8217;ve learned from our conversation. One of my questions was going to be like, “How do I balance these things?” So, obviously, there&#8217;s going to be the direct practice, and then eventually my willpower, I’m just going to get fed up or something, and then I won&#8217;t be able to do that anymore. So then maybe go to drills, and then maybe go to just experiment on one of my synths, just making sounds up, which could then lead to, like you said, a baseline or a lead line or things like that. \n</p><p> \nSo, I guess what I&#8217;m hearing from you is just I guess play it by ear, see how it goes, and don&#8217;t feel bad about adjusting as I progress in my skills increases. \n</p><p>\n<strong>Scott Young:</strong> \tOh, yeah. Everything is all adjusting. So this is I think the right way to think about it. You want a good plan to give yourself a good push, a good starting point. But most of the things that make this work is having that self-awareness, having what is called in the psychological industry metacognition, of basically just being aware of what your problem is. \n</p><p> \nAnd this is very hard, I think, for most people because they&#8217;re learning something and they just feel stuck. And they don&#8217;t know what their problem is. And so, this is the sense that you need to develop, this intuition you have. \n</p><p> \nAnd I think this is something that you do develop over time. So, if it sounds impossible for you to do this, as you do more projects like these, and as you start to have more success, you try more techniques, you&#8217;ve had more, “Well, I tried doing this, and it didn&#8217;t actually help,” you get that sense. You develop it a little bit better. And it crosses over to other projects. \n</p><p> \nBut it is this sense of “Hmmm… things are slowing down now. Why are they slowing down?” or “Hmmm… I can&#8217;t seem to do this even though I&#8217;m trying. Why am I not able to do this?” \n</p><p> \nAnd so, sometimes, it&#8217;s a particular skill. So it could be, as you said if we&#8217;re talking about melodies, sort of like, “Well, maybe the problem is that I&#8217;m just trying random stuff, and I have no structure for thinking about what would make a good melody. So maybe I should learn a little bit of music theory about melodies. And maybe I should buy a book and dig into that.” \n</p><p> \nOr maybe it&#8217;s “Yeah, I&#8217;m doing this. But it&#8217;s just too hard to do with everything else. So maybe let&#8217;s break it off and work on it in isolation.” \n</p><p> \nMaybe the issue is that, “Okay, I&#8217;m doing this, but I&#8217;m not sure quite what the problem is. It sounds okay, but it&#8217;s just not at the level where it really needs to be at.Maybe I need to get an expert or someone to look at a song I produced and give me their feedback about what things they think I ought to try to improve.” \n</p><p> \nSo, there&#8217;s all these sorts of little feelings that you have to get about doing it. I know, again, that sounds a little vague and handwavy. But I think it&#8217;s very important to realize that the ultralearning process I&#8217;m trying to describe is not something that&#8217;s “Here’s eight tactics, and you just apply these rigorously.” It’s a very organic thing that you have all these different tools, all these different ways to solve problems, but it&#8217;s sort of up to you to kind of look at what you&#8217;re doing and be like, “Hmmm… this is where I&#8217;m getting stuck.” \n</p><p> \nSo, if we&#8217;re talking about a language, for instance, one of the big things that is a very common feeling you&#8217;ll notice is, “Oh, wow! I actually forget most of the words that I&#8217;ve learned.” And so then you start to think, “Okay, I need to get developed some sort of system or some sort of better approach to make sure these things are in my memory.” And so then you start to talk about things like retrieval practice like spaced repetition systems. \n</p><p> \nAnd so, it starts from this self-diagnosis of “What is the issue here? Why am I getting stuck? Is it that I don&#8217;t understand something? Is that I don&#8217;t remember something? Is that I can&#8217;t perform a particular skill?” These are all sorts of feelings that you kind of start to develop as you go through these projects. \n</p><p>\n<strong>Mad Fientist:</strong>\tThat&#8217;s great. And yeah, it’s just going to make such a difference to what I was planning on doing. I&#8217;ve spent a lot of time developing this plan, and I was just going to execute it, but it sounds like I need to have two separate hats—the execution hat, but then, at the end of the day, thinking about the project overall, and exactly as you said, just adjusting and assessing what&#8217;s working, what&#8217;s not working, and where I need to focus more. \n</p><p> \nWell, we’re already over an hour which is crazy, My list is so much longer than this, but this has been fantastic! It’s really been helpful. \n</p><p>\n<strong>Scott Young:</strong>\tOh, yeah? That’s great. \n</p><p>\n<strong>Mad Fientist:</strong> \tAnd hopefully, it&#8217;s been helpful to other people out there who are maybe starting to think about their own ultralearning project. \n</p><p> \nBut if people want to learn more about you, where&#8217;s the best place to go? Obviously, I&#8217;ll link to the book on Amazon or anywhere books are sold. But where else can people find you?\n</p><p>\n<strong>Scott Young:</strong>\tSo, you can go to my website at ScottHYoung.com. And as I mentioned about the book, I&#8217;ve got links to the book there. There&#8217;s also an audible version. I know some people prefer to listen. So, if you&#8217;re not totally sick of listening to my voice by now, then you can also get the audio version of the book where I&#8217;m narrating it. \n</p><p> \nAnd i would say not only to you with your music project, but also to the listeners who are hearing right now, if any of you take on an ultralearning project, I would love to hear about it. \n</p><p> \nI&#8217;m in sort of my own kind of process of trying to gather and collect up people&#8217;s experiences with ultralearning—not only for me, just to know how the ideas and advice are being received because (you know, even having this conversation, it&#8217;s interesting to see kind of some of the ways that you&#8217;ve been thinking about it and how they differ slightly from how I would think about it), but then also just because I want to gather more stories. And I think that this is really what we need. \n</p><p> \nWe have so many examples of people dredging through school, but so few examples of people getting really good at things on their own that they care about. And I would like to change that. \n</p><p>\n<strong>Mad Fientist:</strong>\tNice! Well, hopefully, mine will be successful in some way and I will be able to share that with you because I do plan on documenting. I&#8217;m not going to do it in real-time just because I don&#8217;t want to have to juggle two things of like publishing on MadFientist.com at the same time I&#8217;m doing this. But I do plan on recording everything that I&#8217;m doing and how it&#8217;s going. \n</p><p>\n<strong>Scott Young:</strong>\tWell, I look forward to listening to the album.\n</p><p>\n<strong>Mad Fientist:</strong> \tYeah, that would be amazing. But yeah, I will document and share with you; and hopefully, all the Mad Fientist readers as well. \n</p><p> \nBut I usually end all my interviews with “What&#8217;s one piece of advice you&#8217;d give to somebody on the path to FI?” But I am happy to tweak that a little bit. If you had any one piece of advice to pursuing some of these bigger goals…? \n</p><p>\n<strong>Scott Young:</strong> \tSo, I&#8217;ll say something that I think is less of a tactical. We’ve been talking a lot about tactics. But I think the big thing that I want to leave people with is that the feeling that you get when you are at your best moments in life, I think those moments are going to come from when you are able to do something you weren&#8217;t able to do before, or when you&#8217;re able to see something in the world that you didn&#8217;t know existed. \n</p><p> \nAnd so, for me, this is the real driving force behind why I&#8217;m interested in doing these projects and why I wrote the book. It’s not just so much so that, “Here’s How you can cut down your learning time,” but rather because I want people to cultivate that feeling. \n</p><p> \nAnd so, my hope for people when they&#8217;re listening to this right now is that they can see a little bit of that. It’s difficult to sometimes describe it in words, but I&#8217;m hoping that there&#8217;s something that you&#8217;ve been thinking about that you&#8217;d like to learn or explore in your life. And maybe, hopefully, you&#8217;ll just give it a little bit of a shot.\n</p><p>\n<strong>Mad Fientist:</strong>\tThat&#8217;s fantastic, Scott! Thank you so much again, . And yeah, congrats again on the book. \n</p><p>\n<strong>Scott Young:</strong>\tThank you. \n</p><p>\n<strong>Mad Fientist:</strong>\tTake care. Bye.\n</p>\n</div>\n\n\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/best-and-worst-about-fi/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>The Best and Worst Thing About Financial Independence</h3><p class='post_card_excerpt'>The best thing about financial independence is also the worst. I explain what it is and also share details about the secret project I've been working on!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2019/09/best-and-worst-about-fi.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/scott-young-interview/\">Scott Young &#8211; Ultralearning</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/scott-young-interview/feed/",
  "slash:comments": 8,
  "enclosure": ""
}