{
  "title": "Omakase 3: Diplomacy",
  "description": "<!--kg-card-begin: markdown--><p>\"Diplomacy\" is a rather infamous game among board game enthusiasts -- It's an experience known to destroy the deepest friendships and create mistrust that can brew for years. That was a bit of exaggeration, but there's a key reason that Diplomacy has earned such a reputation: backstabbing is</p>",
  "link": "https://kvfrans.com/omakase-3-diplomacy/",
  "guid": "60225e9617e26d47c77e8ec9",
  "category": "games",
  "dc:creator": "Kevin Frans",
  "pubDate": "Tue, 24 Sep 2019 14:02:56 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>\"Diplomacy\" is a rather infamous game among board game enthusiasts -- It's an experience known to destroy the deepest friendships and create mistrust that can brew for years. That was a bit of exaggeration, but there's a key reason that Diplomacy has earned such a reputation: backstabbing is not only expected, but crucial to securing victory.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/maxresdefault.jpg\" alt></p>\n<p>Diplomacy's ruleset is relatively simple. Each player represents a country along with the troops they control. By moving and capturing areas of the map, players can acquire supply points which grant them additional units every few turns. To win, a player must capture over half of the supply points.</p>\n<p>The beauty of Diplomacy comes from the emergent player-to-player negotiation that is essential to gaining an advantage. The game is very clearly zero-sum: to take territory, another player has to lose it. Simply attacking another player head-on will surely lead to losses on both sides. Instead, it's better to form an alliance and join forces towards a common enemy -- but always be aware that your ally could easily betray you and take all the land for themselves!</p>\n<p>In this month's Omakase game, I wanted to build a super simplified version of Diplomacy, that would encourage complex player-to-player relationships and negotiations while only taking ~30 minutes rather than 3 hours.</p>\n<h6 id=\"mvpbrainstorming\">MVP Brainstorming</h6>\n<p>When deciding how to structure the game, I decided that a key tenet to design around was to encourage players to attack with alliances and discourage one-on-one skirmishes. At the same time, committing to an attack should leave one's back open, so it is always a risky idea. It should also always be optimal to gain more territory.</p>\n<p>With these constraints in mind, a simple minimum-viable product would look something like:</p>\n<ul>\n<li>The map is a hex-grid akin to the Civilization games</li>\n<li>Players spawn equal distances to randomly-placed supply points.</li>\n<li>Each round, players command each of their units to move to a tile.</li>\n<li>Turns are taken simultaneously.</li>\n<li>If two opposing units move to the same tile, they fight and both are destroyed.</li>\n<li>Every 4 rounds, players gain units equal to the number of supply points they control, and can place them adjacent to any friendly unit.</li>\n</ul>\n<p>Nearing the end of my time at Sizigi, I was able to test out this version on the whiteboard! My only regret is not taking pictures of the board every round, but I'll do my best to dictate the story.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/1--1---1-.jpg\" alt></p>\n<p>In the beginning, Red, Green, Blue, and Purple all spawn on opposite sides of the map. Triangles represent supply points.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/2--1---1-.jpg\" alt></p>\n<p>All players move their starting unit out to capture the nearest supply point.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/3--1---1-.jpg\" alt></p>\n<p>Spawning phase happens (every four movement rounds), and each player gets two unit spawns (1 from supply points, and 1 from their uncaptured home tile). Green places their units defensively, while blue and purple make aggressive plays towards each other and red creeps behind.</p>\n<p>At this point, Red asks Purple for an alliance and Purple agrees. Green states that they will be non-aggressive as long as no one attacks them.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/4--1---1-.jpg\" alt></p>\n<p>Purple attacks Blue, and first blood is shed on the tile marked with yellow. Both Blue and Purple lose a unit. Right before the spawning round, Red sneaks a unit into Purple's home base and captures it.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/5--1---1-.jpg\" alt></p>\n<p>Green and Red get 4 and 5 spawns respectively, and Purple spawns ontop of a Blue unit, triggering combat once more. At this point, Blue calls out Red for being too powerful.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/6--1---1-.jpg\" alt></p>\n<p>Blue moves in and finally takes Purple down to a single unit. The stage is very close to a three-kingdoms stalemate. Red and Green are at relatively equal power levels, while Blue is still in the game but is weak. Red asks Blue for an alliance against Green, and Blue agrees if Red will allow them to take Purple's last supply point.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/7--1---1-.jpg\" alt></p>\n<p>Red backstabs Blue, taking the supply depot for themselves. At the same time, Green accidentally attacks Blue due to a bad prediction of Blue's movement patterns. Green and Blue start a fight among the northern border, and Red still pledges an alliance with Blue.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/8--1---1-.jpg\" alt></p>\n<p>Blue and Green continue fighting, and Red attacks Green along their border.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/09/9--1---1-.jpg\" alt></p>\n<p>In a final play, with Green and Blue unsuspecting, Red attacks the central supply point with three units, capturing it and winning the game.</p>\n<h6 id=\"analysis\">Analysis</h6>\n<p>So that was a sample round of my Diplomacy variant! Afterwards, I asked the players what they thought of the rules and gameplay.</p>\n<p>The biggest feedback was that a lot of time, the game felt like trench warfare -- it was always optimal to hold your lines instead of going for the offensive, since you always lose units in a fight.</p>\n<p>A radical solution that was suggested was to allow multiple units on the same tile, so more blitzkrieg-like tactics could be employed.</p>\n<p>Overall, I was glad that some level of alliance trickery was involved in the game<br>\n(mostly Red strongarming Blue and then betraying them multiple times), and the three-kingdom stalemate did not last as long as expected. It did feel like a lot of Red's victory was due to taking advantage of Purple's early aggression towards Blue, and the map was admittedly not super balanced.</p>\n<p>I was originally going to build this into a web-based Diplomacy implementation, but I felt like there was more to be gained by iterating on whiteboards/paper than worrying about an implementation, so that didn't end up being finished.<br>\n<img src=\"https://kvfrans.com/content/images/2019/09/Screen-Shot-2019-08-26-at-12-03-30-AM-copy.jpg\" alt></p>\n<blockquote>\n<p>Grid in pixi.js with randomly-generated mountain tiles</p>\n</blockquote>\n<p>That's all for this month! I definitely think there's still a big potential in negotiation games, especially in extracting out the interesting player interactions without too much overhead with the turn-by-turn mechanics. Things like information delay and fog-of-war could also create some super cool scenarios.</p>\n<!--kg-card-end: markdown-->"
}