{
  "title": "Ultrasound Stickers Look Inside the Body",
  "link": "https://spectrum.ieee.org/ultrasound-imaging",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/close-up-of-a-square-rectangular-clear-device-affixed-to-an-arm.jpg?id=30454684&width=1200&height=600&coordinates=0%2C207%2C0%2C208\"/><br/><br/><p>A wearable ultrasound sticker roughly the size of a postage stamp could help enable continuous medical imaging of internal organs for patients on the move, a new study finds.<br/></p><p><a href=\"https://spectrum.ieee.org/piezo-samarium\" target=\"_blank\">Ultrasound imaging</a> is one of the most common medical tools for scanning inside the body in <a href=\"https://spectrum.ieee.org/ultrasound-microscopy-helps-image-tiny-blood-vessels\" target=\"_blank\">a safe, noninvasive manner</a>. Currently, to image with ultrasound, first a liquid gel is applied to a patient’s skin that helps transmit ultrasound waves. Then an ultrasound probe, or transducer, is pressed against the gel.</p><p>Continuous long-term ultrasound imaging could help shed light on potentially vital changes in a patient’s health over days or even months. However, ultrasound imaging currently requires bulky, rigid equipment, making long-term monitoring difficult.</p><p>In addition, capturing ultrasound images demands highly trained sonographers to properly apply and orient the ultrasound probes onto a patient’s body. Practically speaking, and even just to avoid repetitive motion injuries, these practical restrictions often limit the length of ultrasound sessions. For patients who need long periods of imaging, some hospitals offer probes on robotic arms that can hold a transducer in place without tiring. However, the liquid ultrasound gel flows away and dries out over time, interrupting the sessions and producing less-than-ideal results.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Animated gif shows gel being pressed against an arm by a device on the left, and on the right, a gloved finger pressing down on a contained gel device on the skin.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"0a0d51979abdc7d6abf86987fd19f4d8\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"326f4\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/animated-gif-shows-gel-being-pressed-against-an-arm-by-a-device-on-the-left-and-on-the-right-a-gloved-finger-pressing-down-on.gif?id=30454695&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In this animated image, the bioadhesive ultrasound (BAUS) device is compared with a conventional ultrasound probe with liquid hydrogel couplant.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">MIT</small></p><p>Recently scientists have explored stretchable ultrasound probes that can better conform  to a patient’s body for potential wearable applications. However, such designs have suffered from low resolution and poor image quality during body movements, among other problems.</p><p>Now scientists have developed an ultrasound sticker they say can overcome many of these challenges. They detailed <a href=\"http://www.science.org/doi/10.1126/science.abo2542\" target=\"_blank\">their findings</a> in the 29 July issue of the journal <em>Science</em>.</p><p>The new device consists of a thin, rigid scanner array possessing 400 ultrasound transducers per square centimeter. This array is coupled to a soft, durable, sticky layer that can bond onto skin. The entire sticker measures 3 millimeters thick and 2 square centimeters in size.</p><p>The device’s adhesive layer contains a soft <a href=\"https://spectrum.ieee.org/stretchy-touchpad-could-find-use-in-gaming\" target=\"_blank\">hydrogel</a>, a material similar to the absorbent stuffing inside disposable diapers. This hydrogel easily transmits sound waves, and unlike traditional ultrasound gels, is stretchy and elastic. The hydrogel is encapsulated between two thin rubbery layers that help keep the hydrogel wet so acoustic waves can pass through it.</p><p>In tests, the researchers had healthy volunteers wear the devices on various parts of their body, including the neck, chest, abdomen and arms. They also had the participants perform a variety of activities in the lab, such as sitting, standing, jogging, biking, weightlifting and drinking juice.</p><p>The devices stuck onto the skin of the volunteers and produced clear images of underlying structures for up to 48 hours. They could watch how the jugular vein widened after volunteers went from sitting or standing to a supine position; how the heart swelled after a half hour of exercise; how the lungs behaved during jogging and cycling; how the stomach distended and shrank as the volunteers drank juice that later flowed out; and how biceps became flooded with blood after lifting weights.</p><p>The image resolution of the bioadhesive ultrasound (BAUS) device “is on a similar level to point-of-care ultrasound,” says study senior author Xuanhe Zhao, a mechanical engineer at MIT. More work is needed to reach the performance of mature conventional ultrasound machines, he adds.</p><p>Although the stickers do continuously image the body with ultrasound waves, “the imaging frequency is low, such as one image per 30 minutes or 1 hour,” Zhao says. “Therefore, BAUS is safe for the body.”</p><p>Currently, the devices need to be connected with instruments that can translate their ultrasound data into images. Even with this tethered design, the researchers suggest the stickers could have a variety of applications. For instance, they can be applied to patients in the hospital, similar to heart-monitoring <a href=\"https://spectrum.ieee.org/skin-circuits\" target=\"_self\">EKG</a> stickers, and help continuously scan internal organs without requiring a technician to hold a probe in place for long stretches of time.</p><p>The scientists now seek to make wireless versions of their device. In addition, they are working on integrating data-processing circuitry and other components onto the stickers. Moreover, they are developing software algorithms based on artificial intelligence that can better interpret and diagnose the stickers’ images.</p><p>The ultimate goal are wearable ultrasound stickers, each designed for a different location on the body, that patients could take home from a doctor’s office or even buy at a pharmacy or get shipped to them. The patches could communicate with your cellphone, where AI algorithms could then automatically analyze the images on demand. Such a setup could, for example, help doctors continuously monitor the symptoms of possibly infected <a href=\"https://spectrum.ieee.org/covid-breathalyzers-could-transform-rapid-testing\" target=\"_blank\">COVID-19</a> patients at home with minimal exposure risk to medical staff, Zhao says. They might also help monitor the development of fetuses in the womb or the progression of tumors.</p><p>“Continuous monitoring and diagnosis of chronic conditions is a grand challenge in health care,” Zhao says. “We want to use wearable imaging with BAUS to address this challenge.”</p>",
  "pubDate": "Wed, 03 Aug 2022 18:22:56 +0000",
  "guid": "https://spectrum.ieee.org/ultrasound-imaging",
  "category": [
    "Ultrasound transducer",
    "Adhesive",
    "Wearables",
    "Wearable sensors",
    "Wearable devices",
    "Ultrasound",
    "Covid-19",
    "Ultrasound imaging"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}