{
  "title": "EPISODE 55 Sitting Bull (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sat, 09 Nov 2019 18:07:43 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/10/2/episode-55-sitting-bull-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5d951301a6d33b43576024b9",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1573322570517-DD86719VNRYFJH27X7ST/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5dc6ff4880e6ab4d110e8d56\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1573322570517-DD86719VNRYFJH27X7ST/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“I don’t want to have anything to do with people who make one carry water on the shoulders and haul manure. You are fools to make yourselves slaves to a piece of fat bacon, some hardtack, and a little sugar and coffee. The whites may get me at last, but I will have good times till then.”</em> — Sitting Bull&nbsp;</p><p class=\"\"><em>“Let me live deep while I live.” —</em> Robert E. Howard</p><p class=\"\"><em>“Were I to run away from the enemy, no one will consider me a man.”</em> — Kit Fox warrior society song&nbsp;</p><p class=\"\"><em>“A warrior I have been. Now it is all over. A hard time I have.” —</em> Sitting Bull song&nbsp;</p><p class=\"\">In historical terms, it was just a blink of an eye ago. In the mid-1800s, the Great Plains in the United States were still firmly in the hands of nomadic, buffalo hunting tribes. The looming threat of American expansion was still barely noticeable. But things changed quickly, and soon the tribes were locked in an existential struggle with the U.S. for control of the heartland of North America. One man rose among these tribes to lead his people to resisting the inevitable for over two decades. By the time he was 10 years old, the boy who would become the Lakota leader Sitting Bull, had killed his first bison by running him down and putting an arrow through its heart. In the opinion of his fellow tribesmen, his ability as a hunter and as a warrior was only second to his generosity in taking care of widows and orphans. In this second episode of this series, we’ll see Sitting Bull emerging as the main leader for the free Lakota, fighting in a brutal intertribal battle, challenging the expansion of the Northern Pacific Railroad, saving the Cheyenne from starvation, Sun Dancing and having premonitory visions of the Little Big Horn battle, leading his people to Canada, befriending a major for the Royal Canadian Mounted Police, helping Nez Perce’ refugees across the border, fighting in a duel at 49 years of age, returning to the U.S. as a POW, and much, much more.</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 55 Sitting Bull (Part 2)"
  }
}