{
  "title": "S14 Ep20: The Girls Are Gone",
  "link": "https://audioboom.com/posts/8098610",
  "itunes:episode": 20,
  "itunes:title": "The Girls Are Gone",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7676,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the Darkness celebrates it's 100th episode of True Crime Tuesday by airing some of it's best episodes for you this weekend!!<br>\n<br>\nOn Sunday's episode...<br>\n<br>\nTRUE CRIME TUESDAY is turned on their ear with the case of The Girls are Gone!<br>\nWe find another horrific story within a story on today's episode with special guests Allison Mann & Michael Brodkorb. PLUS Dumb Crimes/Stupid Criminals!<br>\n<br>\nThe Girls Are Gone is the true story of two sisters who went missing, the father who kept searching, and the adults who conspired to keep the truth hidden. This is an emotional rollercoaster for Dave as they examine this disturbing case and quickly a story within the story unfolds that leaves Dave in an emotional upheaval. Do Not Miss this episode.<br>\n<br>\nVisit their site: <a href=\"http://missinginminnesota.com/\">http://missinginminnesota.com/</a><br>\n<br>\nGet their book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\n 2 out of 3 guys will experience hair loss by the time they’re 35. Introducing Keeps – the easiest and most affordable way to keep the hair you have.  To receive your first month of treatment for free, go to <a href=\"http://Keeps.com/DARKNESS\">Keeps.com/DARKNESS</a><br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nHas life piled on the anxiety to an overwhelming crescendo? Sunday Scaries can give you relief! Sunday Scaries are CBD Gummies custom formulated with a 10mg of blend of broad spectrum and isolate CBD as well as vitamins B12 and D3 for mood boosters. They are made with natural ingredients and are free of gluten, dairy, yeast, egg, soy and peanuts. Get 10 percent off and free shipping  at <a href=\"http://sundayscaries.com\">sundayscaries.com</a> and use the code word DARKNESS .",
  "itunes:summary": "BEYOND the Darkness celebrates it's 100th episode of True Crime Tuesday by airing some of it's best episodes for you this weekend!!\n\nOn Sunday's episode...\n\nTRUE CRIME TUESDAY is turned on their ear with the case of The Girls...",
  "pubDate": "Sun, 10 Mar 2019 08:00:00 +0000",
  "guid": "ee2da900-2c00-43c3-9ab5-b8a599b91fee",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}