{
  "title": "The Fall and Rise of Russian Electronic Warfare",
  "link": "https://spectrum.ieee.org/the-fall-and-rise-of-russian-electronic-warfare",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/side-profile-of-a-russian-krasukha-4-military-vehicle.jpg?id=30142963&width=1200&height=800&coordinates=0%2C125%2C0%2C125\"/><br/><br/><p>\n<strong>A month into Russia’s invasion,</strong> Ukrainian troops stumbled upon a nondescript shipping <a href=\"https://www.thedrive.com/the-war-zone/44879/ukraine-just-captured-part-of-one-of-russias-most-capable-electronic-warfare-systems\" target=\"_blank\">container</a> at an abandoned Russian command post outside Kyiv. They did not know it then, but the branch-covered box left by retreating Russian soldiers was possibly the biggest intelligence coup of the young war.\n</p><p>\n\tInside were the guts of one of Russia’s most sophisticated electronic warfare (EW) systems, the \n\t<a href=\"https://www.armyrecognition.com/russia_russian_military_field_equipment/krasukha-4_1rl257_broadband_multifunctional_jamming_station_electronic_warfare_system_technical_data_sheet_pictures_video_10610156.html\" target=\"_blank\">Krasukha-4</a>. First fielded in 2014, the <a href=\"https://en.wikipedia.org/wiki/Krasukha_(electronic_warfare_system)\" target=\"_blank\">Krasukha-4</a> is a centerpiece of Russia’s strategic EW complement. Designed primarily to jam airborne or satellite-based fire control radars in the <a href=\"https://www.microwaves101.com/encyclopedias/frequency-letter-bands\" target=\"_blank\">X- and K<sub>u</sub>-bands</a>, the Krasukha-4 Is often used <a href=\"https://defence.nridigital.com/global_defence_technology_mar22/russia_electronic_warfare\" target=\"_blank\">alongside</a> the Krasukha-2, which targets lower-frequency S-band search radars. Such radars are used on stalwart U.S. reconnaissance platforms, such as the E-8 Joint Surveillance Target Attack Radar System (<a href=\"https://www.af.mil/About-Us/Fact-Sheets/Display/Article/104507/e-8c-joint-stars/\" target=\"_blank\">JSTARS</a>) and Airborne Warning and Control System, or <a href=\"https://www.af.mil/About-Us/Fact-Sheets/Display/Article/104504/e-3-sentry-awacs/\" target=\"_blank\">AWACS</a>, aircraft.\n</p><p>\n\tAnd now Ukraine, including by extension its intelligence partners in NATO, had a Krasukha-4 to dissect and analyze.\n</p><p>\n\tThat Russian troops would ditch the heart of such a valuable EW system was surprising in March, when Moscow was still making gains across the country and threatening Kyiv. Five months into the war, it is now apparent that Russia’s initial advance was already faltering when the Krasukha-4 was left by the roadside. With highways around Kyiv clogged by armored columns, \n\t<a href=\"https://www.washingtonpost.com/national-security/2022/04/06/pentagon-russia-withdraws-kyiv-chernihiv/\" target=\"_blank\">withdrawing</a> units needed to lighten their load.\n</p><p>\n\tThe abandoned Krasukha-4 was emblematic of the puzzling failure of Russian EW in the first few months of Russia’s invasion. After nearly a decade of owning the airwaves during a Moscow-backed insurgency in eastern Ukraine, EW was \n\t<a href=\"https://www.thedrive.com/the-war-zone/this-is-whats-happened-so-far-in-ukraines-electronic-warfare-battle\" target=\"_blank\">not decisive</a> when Russia went to war in February. The key questions now are, why was this so, what is next for Russian EW in this oddly anachronistic war, and how might it affect the outcome?\n</p><p class=\"pull-quote\">\n\tAt least three of Russia’s five electronic warfare brigades are engaged in Ukraine. And with more exposure to NATO-supplied radios, experienced Russian EW operators who cut their teeth in Syria are beginning to detect and degrade Ukrainian communications.\n</p><p>\n<strong>Electronic warfare is a pivotal</strong> if invisible part of modern warfare. Military forces rely on radios, radars, and infrared detectors to coordinate operations and find the enemy. They use EW to control the spectrum, protecting their own sensing and communications while denying access to the electromagnetic spectrum by enemy troops.\n</p><p>\n\tU.S. military doctrine defines EW as comprising electronic attack (EA), electronic protection, and electronic support. The most familiar of these is EA, which includes jamming, where a transmitter overpowers or disrupts the waveform of a hostile radar or radio. For instance, the Russian \n\t<a href=\"https://odin.tradoc.army.mil/mediawiki/index.php/R-330Zh_Zhitel_Russian_Cellular_Jamming_and_Direction_Finding_System\" target=\"_blank\">R-330Zh Zhitel</a> jammer can reportedly shut down—within a radius of tens of kilometers—GPS, satellite communications, and cellphone networks in the VHF and UHF bands. Deception is also part of EA, in which a system substitutes its own signal for an expected radar or radio transmission. For example, Russian forces sent propaganda and fake orders to troops and civilians during the 2014–2022 insurgency in eastern Ukraine by hijacking the local cellular network with the RB-341V <a href=\"https://odin.tradoc.army.mil/mediawiki/index.php?title=Leer-3_Russian_6x6_Mobile_Drone-Based_Electronic_Warfare_(EW)_System&printable=yes\" target=\"_blank\">Leer-3</a> system. Using soldier-portable Orlan-10 drones managed by a truck-mounted control system, the Leer-3 can extend its range and impact VHF and UHF communications over wider areas.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Three Russian soldiers climb on a wheeled vehicle supporting an antenna.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"a97e7019b43b7732d50ae3c073b58bb1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ad623\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/three-russian-soldiers-climb-on-a-wheeled-vehicle-supporting-an-antenna.png?id=30296258&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The Zhitel jamming system can shut down, over tens of kilometers, GPS and satellite communications. This image shows the base of one of the four antennas in a typical setup.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">informnapalm.org</small>\n</p><p>\n\tThe converse of electronic attack is electronic support (ES), which is used to passively \n\t<a href=\"https://www.thedrive.com/the-war-zone/33401/this-is-what-ground-forces-look-like-to-an-electronic-warfare-system-and-why-its-a-big-deal\" target=\"_blank\">detect and analyze</a> an opponent’s transmissions. ES is essential for understanding the potential vulnerabilities of an adversary’s radars or radios. Therefore, most Russian EA systems include ES capabilities that allow them to find and quickly characterize potential jamming targets. Using their ES capabilities, most EA systems can also geolocate enemy radio and cellphone transmissions and then pass that information on so that it can be used to direct artillery or rocket fire—with often <a href=\"https://www.thedrive.com/the-war-zone/30741/ukrainian-officer-details-russian-electronic-warfare-tactics-including-radio-virus\" target=\"_blank\">devastating</a> effects.\n</p><p>\n\tA few Russian systems conduct ES exclusively; one example is the \n\t<a href=\"https://odin.tradoc.army.mil/mediawiki/index.php?title=Moskva-1_(1L265)_Russian_Electronic_Warfare_Vehicle&printable=yes\" target=\"_blank\">Moskva-1</a>, which is a precision HF/VHF receiver that can use the reflections of TV and radio signals to conduct <a href=\"https://dsiac.org/articles/passive-coherent-location-radar-the-silent-threat/\" target=\"_blank\">passive coherent location</a> or passive radar operations. Basically, the system picks up the radio waves of commercial TV and radio transmitters in an area, which will reflect off targets like ships or aircraft. By triangulating among multiple sets of received waves, the target can be pinpointed with sufficient accuracy to track it and, if needed, shoot at it.\n</p><h2>Key Russian Electronic Warfare Systems Deployed in Ukraine </h2><table border=\"0\" style=\"white-space: unset;\" width=\"100%\">\n<tbody>\n<tr>\n<td scope=\"col\" width=\"25%\">\n<p>\nElectronic Warfare System\n\t\t</p>\n</td>\n<td scope=\"col\" width=\"25%\">\n<p>\nPurpose\n\t\t</p>\n</td>\n<td scope=\"col\" width=\"25%\">\n<p>\nFirst Fielded\n\t\t</p>\n</td>\n<td scope=\"col\" width=\"25%\">\n<p>\nNotes\n\t\t</p>\n</td>\n</tr>\n<tr>\n<td>\n\t\t1RL257 Krasukha-4\n\t</td>\n<td>\n\t\tTargets X-band and K\n\t\t<sub>u</sub>-band radars, particularly on planes, drones, missiles, and low-orbit satellites\n\t</td>\n<td>\n\t\t2014\n\t</td>\n<td>\n\t\tConsists of two KamAZ-6350 trucks, one a command post and the other outfitted with sensors\n\t</td>\n</tr>\n<tr>\n<td>\n\t\t1L269 Krasukha-2\n\t</td>\n<td>\n\t\tTargets S-band radars, particularly on airborne platforms. Often used paired with the Krasukha-4\n\t</td>\n<td>\n\t\t2011\n\t</td>\n<td>\n\t\tAlso based on two KamAZ-6350 trucks\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tRB-341V Leer-3\n\t</td>\n<td>\n\t\tDisrupts VHF and UHF communications, including cellular communications and military radios, over hundreds of kilometers\n\t</td>\n<td>\n\t\t2015\n\t</td>\n<td>\n\t\tConsists of a truck-based command post that works with Orlan-10 drones to extend its range\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tRH-330Zh Zhitel\n\t</td>\n<td>\n\t\tJammer; can shut down GPS and satellite communications over a radius of tens of kilometers\n\t</td>\n<td>\n\t\t2011\n\t</td>\n<td>\n\t\tConsists of a truck command post and four telescopic-mast phased-array antennas\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tMurmansk-BN\n\t</td>\n<td>\n\t\tLong-range detection and jamming of HF military radios\n\t</td>\n<td>\n\t\t2020\n\t</td>\n<td>\n\t\tRussian sources claim it can jam communications thousands of kilometers away\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tR-934B\n\t</td>\n<td>\n\t\tVHF/UHF jammer that targets wireless and wired communications\n\t</td>\n<td>\n\t\t1996\n\t</td>\n<td>\n\t\tConsists of either a truck or a tracked vehicle and a towed 16-kilowatt generator\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tSPN-2, 3, 4\n\t</td>\n<td>\n\t\tX- or K\n\t\t<sub>u</sub>-band jammers that target airborne radars and air-to-surface guidance-control radars\n\t</td>\n<td>\n\t\t(not available)\n\t</td>\n<td>\n\t\tConsists of a combat-control vehicle and an antenna vehicle\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tRepellent-1\n\t</td>\n<td>\n\t\tAntidrone system\n\t</td>\n<td>\n\t\t2016\n\t</td>\n<td>\n\t\tWeighs more than 20 tonnes\n\t</td>\n</tr>\n<tr>\n<td>\n\t\tMoéskva-1\n\t</td>\n<td>\n\t\tPrecision HF/VHF receiver for passive coherent location of enemy ships and planes\n\t</td>\n<td>\n\t\t2015\n\t</td>\n<td>\n\t\tPublished sources cite a range of up to 400 kilometers\n\t</td>\n</tr>\n<tr>\n<td colspan=\"4\">\n\t\tSources: Wikipedia; Military Factory; \n\t\t<u>Global Defence Technology</u>; U.S. Army; <u>Air Power Australia</u>; U.S. Army Training and Doctrine Command; <i>Russian Electronic Warfare: The Role of Electronic Warfare in the Russian Armed Forces</i>, Jonas Kjellén, Swedish Defence Research Agency (FOI), 2018; <u>Defence24</u>\n</td>\n</tr>\n</tbody>\n</table><p>\n\tRussia uses specialized electronic-warfare units to conduct its EA and ES operations. In its \n\t<a href=\"https://icds.ee/wp-content/uploads/2018/ICDS_Report_Russias_Electronic_Warfare_to_2025.pdf\" target=\"_blank\">ground forces</a>, dedicated EW brigades of several hundred soldiers are assigned to the five Russian military districts—West, South, North, Central, and East—to support regional EW operations that include disrupting enemy surveillance radars and satellite communication networks over hundreds of kilometers. EW brigades are equipped with the larger Krasukha-2 and -4, Leer-3, Moskva-1, and Murmansk-BN systems (the latter of which detects and jams HF radios). Each Russian army maneuver brigade also includes an EW company of about 100 personnel that is trained to support local actions within about 50 kilometers using smaller systems, like the R-330Zh Zhitel.\n</p><p>\n<span style=\"background-color: initial;\">Militaries use electronic protection (EP), also known as electronic countermeasures, to defend against EA and ES. Long considered an afterthought by western forces after the Cold War, EP has risen again to be perhaps the most important aspect of EW as Russia and China field increasingly sophisticated jammers and sensors. EP includes tactics and technologies to shield radio transmissions from being detected or jammed. Typical techniques include using narrow beams or low</span><span style=\"background-color: initial;\">-</span><span style=\"background-color: initial;\">power transmissions, as well as advanced waveforms that are resistant to jamming.</span>\n</p><p>\n<a href=\"https://www.foi.se/en/foi/reports/report-summary.html?reportNo=FOI-R--4625--SE\" target=\"_blank\">Experts</a> have long touted Russia as having some of the most experienced and best-equipped EW units in the world. So in the early days of the 24 February invasion, analysts expected Russian forces to quickly gain control of, and then dominate, the electromagnetic spectrum. Since the annexation of Crimea in 2014, EW has been a key part of Russian operations in the “<a href=\"https://www.atlanticcouncil.org/blogs/new-atlanticist/todays-wars-are-fought-in-the-gray-zone-heres-everything-you-need-to-know-about-it/\" target=\"_blank\">gray zone</a>,” the shadowy realm between peace and war, in the Donbas region. Using Leer-3 EW vehicles and Orlan-10 drones, Moscow-backed separatists and mercenaries would jam Ukrainian communications and send propaganda over local mobile-phone networks. When Russian forces were ready to strike, the ground and airborne systems would detect Ukrainian radios and target them with rocket attacks.\n</p><p>\n\tBut after nearly a decade of rehearsals in eastern Ukraine, when \n\t<a href=\"https://en.wikipedia.org/wiki/2022_Russian_invasion_of_Ukraine#:~:text=On%2024%20February%202022%2C%20Russia,third%20of%20the%20population%20displaced.\" target=\"_blank\">the latest escalation and invasion began in February</a>, Russian EW was a no-show. Ukrainian defenders did not experience the jamming they faced in the Donbas and were not being targeted by drones or ground-based electronic surveillance. Although Russian forces did blow up some broadcast radio and television towers, Ukraine’s leaders continued to reach the outside world unimpeded by Russian EW.\n</p><p class=\"pull-quote\">\n\tUsing counter-drone systems provided by the United States before the invasion, Ukrainian troops have downed hundreds of Russian drones by jamming their GPS signals or possibly by damaging their electronics with high-powered microwave beams.\n</p><p>\n\tRussia is \n\t<a href=\"https://www.washingtonpost.com/national-security/2022/06/13/severodonetsk-donbas-russian-advance/\" target=\"_blank\">gaining</a> the upper hand now, having consolidated control in Ukraine's east and south as the invaded country begins running out of soldiers, weapons, and time. With more defined front lines and better logistics support from their homeland, Russian troops are now <a href=\"https://apnews.com/article/russia-ukraine-kyiv-technology-90d760f01105b9aaf1886427dbfba917\" target=\"_blank\">using</a> their EW systems to guide artillery and rocket strikes. But instead of being the leading edge of Russia’s offensive, EW is coming into play only after Moscow resorted to siege tactics that call to mind the origins of EW in World War I.\n</p><p>\n\tThe RF spectrum was a lot less busy then. Commanders used their new radios to coordinate troop movements and direct fire and employed early passive direction-finding equipment to locate or listen to enemy radio transmissions. While communications jamming emerged at the same time, it was not widely employed. Radio operators realized that simply keying their systems could send out a blast of white noise to drown the transmissions of other radios operating at the same frequencies. But this tactic had limited operational value, because it also prevented forces doing the jamming from using the same radio frequencies to communicate. Moreover, warfare happened slowly enough that the victim could simply wait out the jammer.\n</p><p>\n\tThus, World War I EW was exemplified by passive detection of radio transmissions and infrequent, rudimentary jamming. The shift to more sophisticated EW systems and tactics occurred with World War II, when technological advances made airborne radars and jammers practical, better tuners allowed jamming and communicating on separate frequencies, and the increased tempo of warfare gave combatants an incentive to not just jam enemy transmissions but to intercept and exploit them as well.\n</p><p>\n\tConsider the Battle of Britain, when the main \n\t<a href=\"https://csbaonline.org/uploads/documents/What-it-Takes-to-Win.pdf\" target=\"_blank\">challenge</a> for German pilots was reaching the right spot to drop their bombs. Germany used a radio-beacon system it called <em>Knickebein</em> (“crooked leg” in English) to guide its bombers to British aircraft factories, which the British countered with fake beacons that they code-named Aspirin. To support British warplanes attacking Germany in 1942, the Royal Air Force (RAF) fielded the GEE hyperbolic radio navigation system that allowed its bomber crews to use transmissions from British ground stations to determine their in-flight positions. Germany countered with jammers that drowned out the GEE transmissions.\n</p><p>\n\tThe World War II EW competition \n\t<a href=\"https://www.amazon.com/dp/B06Y94D4LV/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\" target=\"_blank\">extended</a> to sensing and communication networks. RAF and U.S. bombers dispensed clouds of metallic chaff called Window that confused German air-defense radars by creating thousands of false radar targets. And they used VHF communication jammers, which the British called Jostle, to interfere with German ground controllers attempting to vector fighters toward allied bombers.\n</p><p>\n\tThe move-countermove cycle accelerated in response to Soviet military aggressions and advances in the 1950s. Active countermeasures such as jammers or decoys proliferated, thanks to technological advances that enabled EW systems with greater power, wider frequency ranges, and more complex waveforms, and which were small enough to fit aircraft as well as ships.\n</p><p>\n\tLater, as Soviet military sensors, surface-to-air missiles, and antiship cruise missiles grew in their sophistication and numbers, the U.S. Department of Defense sought to break out of the radar-versus-electronic-attack competition by leveraging emerging materials, computer simulation, and other technologies. In the years since, the U.S. military has developed multiple generations of stealth aircraft and ships with severely reduced radio-frequency, infrared, acoustic, and visual signatures. Russia followed with its own stealth platforms, albeit more slowly after the Soviet Union’s collapse.\n</p><p>\n<strong>But today, years of </strong><a href=\"https://www.economist.com/interactive/2022/03/08/curious-case-russias-missing-air-force\" target=\"_blank\"><strong>underfunded</strong></a><strong> aviation training</strong> and maintenance and the <a href=\"https://en.wikipedia.org/wiki/FIM-92_Stinger#Russian_invasion_of_Ukraine\" target=\"_blank\">rapid introduction by NATO of Stinger shoulder-launched surface-to-air missiles </a>have largely grounded Russian jets and helicopters during the Ukraine invasion. So when Russian troops crossed the border, they faced a situation not unlike the armies of World War I.\n</p><p>\n\tWithout airpower, the Russian assault crawled at the speed of their trucks and tanks. And although they proved effective in the Donbas during the last decade, Russian drones are controlled by line-of-sight radios operating in the \n\t<a href=\"https://www.esa.int/Applications/Telecommunications_Integrated_Applications/Satellite_frequency_bands\" target=\"_blank\">K<sub>a</sub>- and K<sub>u</sub>-bands</a>, which prevented them from straying too far from their operators on the ground. With Russian columns moving along multiple axes into Ukraine and unable to send EW drones well over the horizon, any jamming of Ukrainian forces, some of which were interspersed between Russian formations, would have also taken out Russian radios.\n</p><p>\n\tRussian EW units did use Leer-3 units to find Ukrainian fighters via their radio and cellphone transmissions, as they had in the Donbas. But unlike Ukraine’s rural east, the areas around Kyiv are relatively densely populated. With civilian cellphone transmissions mixed in with military communications, Russian ES systems were unable to pinpoint military transmitters and use that information to target Ukrainian troops. Making matters worse for the Russians, Ukrainian forces also began using the NATO Single-Channel Ground and Airborne Radio System, or \n\t<a href=\"https://en.wikipedia.org/wiki/SINCGARS\" target=\"_blank\">SINCGARS</a>.\n</p><p>\n\tUkrainian troops had trained for a decade with SINCGARS, but the portable VHF combat radios were scarce until the lead-up to the Russian invasion, when the flood of NATO support sent SINCGARS radios to nearly every Ukrainian ground unit. Unlike Ukraine’s previous radios, which were Russian-built and included \n\t<a href=\"https://www.thedrive.com/the-war-zone/30741/ukrainian-officer-details-russian-electronic-warfare-tactics-including-radio-virus\" target=\"_blank\">backdoors</a> for the convenience of Russian intelligence, <a href=\"https://irp.fas.org/doddir/army/miobc/lp-sincg.htm\" target=\"_blank\">SINCGARS</a> have built-in encryption. To protect against jamming and interception, SINCGARS automatically hops among frequencies up to 100 times a second across its overall coverage of 30 to 88 megahertz. Because <a href=\"https://dsm.forecastinternational.com/wordpress/2022/05/17/life-in-the-old-waveform-yet/\" target=\"_blank\">SINCGARS</a> can control signals within 25-kilohertz bands, the user can select among more than 2,000 channels.\n</p><p>\n\tAs in World War I, the lack of airpower also affected the speed of conflict. The widely circulated videos of Russian armored convoys stuck along the roads around Kyiv were a stark reminder that ground operations can only move as fast as their fuel supply. In World War II and the Cold War, bombing missions and other air operations happened so quickly that even if jamming impacted friendly forces, the effect would be temporary, as the positions of jammers, jamming targets, and bystanders would quickly change. But when Russian forces were trundling toward the urban areas of northern Ukraine, they were going so slowly that they were unable to exploit changing geometries to get their jammers into positions from which they could have substantial effects. At the same time, Russian troops were not sitting still, which prevented them from setting up a large system like the Krasukha-4 to blind NATO radars in the air and in space.\n</p><p class=\"pull-quote\">\n\tRussian EW is gaining an advantage only now because Moscow’s strategy of quickly taking Kyiv failed, and it shifted to a grinding war of attrition in Ukraine’s south.\n</p><p>\n<strong>So what’s next?</strong> The Kremlin’s fortunes have improved now that its soldiers are fighting from Russian-held territory in Ukraine’s east. No longer spread out along multiple lines in suburban areas, invading troops are now <a href=\"https://www.timesofisrael.com/theyre-jamming-everything-secretive-electronic-warfare-shapes-war-in-ukraine/\" target=\"_blank\">able to use EW</a> to support a strategy of incrementally gaining territory by finding Ukrainian positions and overwhelming them with Russia’s roughly <a href=\"https://www.theguardian.com/world/2022/jun/10/were-almost-out-of-ammunition-and-relying-on-western-arms-says-ukraine\" target=\"_blank\">10-to-1</a> advantage in artillery.\n</p><p>\n\tAs of this writing, at least three of Russia’s five EW brigades are engaged in Ukraine. And with more exposure to NATO-supplied radios, experienced Russian EW operators who cut their teeth in the last decade of war in Syria are beginning to \n\t<a href=\"https://www.newsweek.com/theyre-jamming-everything-putins-electronic-warfare-turns-tide-war-1712784\" target=\"_blank\">detect and degrade</a> Ukrainian communications. EW brigades are using the Leer-3’s Orlan-10 drones to detect Ukrainian artillery positions based on their radio emissions, although the encryption and frequency hopping of SINCGARS radios makes them hard to intercept and exploit. Because the front lines are now better defined compared to the early war around Kyiv, Russian forces can assume the detections are from Ukrainian military units and direct artillery and rocket fire against those locations.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"side profile of an orlan 10 drone and a LEER-3 Russian military vehicle\" class=\"rm-shortcode\" data-rm-shortcode-id=\"551c3721d12b04d90453d62ef70b04b1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"04145\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/side-profile-of-an-orlan-10-drone-and-a-leer-3-russian-military-vehicle.jpg?id=30142961&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Russian troops are using Orlan-10 drones [foreground] in conjunction with the Leer-3 electronic-warfare system (which includes the truck in the background) to identify and attack Ukrainian units. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">iStockphoto</small>\n</p><p>\n\tThe Krasukha-4, which was too powerful and unwieldy to be useful during the assault on Kyiv, is also making a reappearance. Exploiting Russia’s territorial control in the Donbas, EW brigades are using the Krasukha-4 to \n\t<a href=\"https://www.newsweek.com/russia-says-electronic-warfare-system-took-out-ukrainian-drone-1720399\" target=\"_blank\">jam</a> the radars on such Ukrainian drones as the Bayraktar TB2, and to interfere with their communication links, preventing Ukrainian forces from locating Russian artillery emplacements.\n</p><p>\n<span style=\"background-color: initial;\">To gain flexibility and mobility leading up to the invasion, the Russian army </span><a href=\"https://www.fpri.org/article/2022/02/electronic-warfare-russias-approach/\" target=\"_blank\">broke</a><span style=\"background-color: initial;\"> its 2,000-soldier maneuver brigades into smaller battalion tactical groups (BTGs) of 300</span> to <span style=\"background-color: initial;\">800 personnel in such a way that each included a portion of the original maneuver brigade’s EW company. Today, BTGs operating in southern and eastern Ukraine are employing shorter-range VHF-UHF electronic attack systems like the R-330Zh </span><span style=\"background-color: initial;\">Zhitel</span> to disable <a href=\"https://spectrum.ieee.org/ukraine-drone-war\" target=\"_self\">Ukrainian drones</a><span style=\"background-color: initial;\"> ranging from Bayraktar TB2s to small DJI </span><span style=\"background-color: initial;\">Mavics</span> by jamming their GPS signals. BTGs are also attacking Ukrainian communications using R-934B VHF and SPR-2 VHF/UHF jammers, with some success. Although Ukrainian soldiers have SINCGARS radios, they still rely on vulnerable cellphones and radios without encryption or frequency hopping when SINCGARS is down or unavailable.\n</p><p>\n\tBut Ukraine is fighting back against Russia’s spectrum assault. Using counter-drone systems \n\t<a href=\"https://www.reuters.com/business/aerospace-defense/eying-russia-pentagon-send-ukraine-counter-drone-electronic-warfare-equipment-2021-06-11/\" target=\"_blank\">provided</a> by the United States before the invasion, Ukrainian troops have downed hundreds of Russian drones by jamming their GPS signals or <a href=\"https://spectrum.ieee.org/ukraine-drone-war\" target=\"_self\">possibly</a> by damaging their electronics with <a href=\"https://issuu.com/ukrainian_defense_review/docs/udr-04-2014/39\" target=\"_blank\">high-powered microwave</a> beams, a specific type of EA where electromagnetic energy is used to generate high voltages in sensitive microelectronics that damage transistors and integrated circuits.\n</p><p>\n\tUkrainian forces are also leveraging U.S.-supplied EW systems and \n\t<a href=\"https://www.c4isrnet.com/electronic-warfare/2022/05/19/ukrainian-troops-training-with-us-electronic-jamming-kit/\" target=\"_blank\">training</a> to <a href=\"https://www.businessinsider.com/cyber-and-electronic-warfare-on-display-in-ukraine-russia-war-2022-6\" target=\"_blank\">jam</a> Russian communications. Unlike their Ukrainian counterparts, Russian troops do not have a system like SINCGARS and often rely on cellphones or unencrypted radios to coordinate operations, making them susceptible to Ukrainian geolocation and jamming. In this way, stabilization of the front lines also helps Ukraine’s EW efforts because it allows quick correlation of transmissions to locations. Ukraine’s defenders also exploited a weakness of the large and powerful Russian EW systems—they are easy to find. Using U.S.-supplied ES gear, Ukrainian troops have been able to <a href=\"https://www.businessinsider.com/cyber-and-electronic-warfare-on-display-in-ukraine-russia-war-2022-6\" target=\"_blank\">detect</a> transmissions from systems like the Leer-3 or Krasukha-4 and direct rocket, artillery, and drone counterattacks against the truck-borne Russian systems.\n</p><p>\n<strong>The Ukraine invasion</strong> shows EW can change the course of a war, but it’s also showing that the fundamentals still matter. Without airpower or satellite-guided drones, Russia’s army could not get jammers over the horizon to degrade Ukrainian communications and radars in advance of troops moving on Kyiv. Forced to use short-range unmanned aircraft and ground systems, Russian EW brigades operating with BTGs had to worry about interfering with friendly operations and could not distinguish Ukrainian troops from civilians. They also had to stay on the move, reducing the utility of their large multivehicle EW systems. Russian EW is gaining an advantage only now because Moscow’s strategy of quickly taking Kyiv failed, and it shifted to a grinding war of attrition in Ukraine’s south.\n</p><p>\n\tSo for now, unable to reach over the horizon, Russian EW ground units can jam Ukrainian troops only when they are separated by clearly defined battle lines. They are relying on systems like the Leer-3 to find Ukrainian emissions so Russian artillery can then overwhelm the defenders with volleys of shells and rockets. Russian EW systems like the Krasukha-4 and R-330Zh Zhitel can disable GPS or radars on Ukrainian drones, but it’s not substantially different from shooting down aircraft with guns. And although ES systems like the Moskva-4 could hear signals over the horizon, Russia is \n\t<a href=\"https://ukdefencejournal.org.uk/russia-running-out-of-precision-weapons/\" target=\"_blank\">running out</a> of the long-range missiles that could exploit such detections.\n</p><p>\n\tPerhaps the biggest lesson from Ukraine for EW is that winning the airwaves does not equal winning the war. Russia is on top of the EW war now only because its lighting assault became a pulverizing slog. The situation could quickly flip if Kyiv’s troops, with western support, regain control of Ukraine’s skies, where they could electronically and physically disrupt the management and logistics that keep Russia’s rickety war machine trundling along. \n\t<span class=\"ieee-end-mark\"></span>\n</p>",
  "pubDate": "Sat, 30 Jul 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/the-fall-and-rise-of-russian-electronic-warfare",
  "category": [
    "Electronic warfare",
    "Russia-ukraine war",
    "Electronic countermeasures",
    "Military radios",
    "Communications security"
  ],
  "dc:creator": "Bryan Clark",
  "media:content": ""
}