{
  "title": "S5 Ep45: Director's Cut: Reflections on the European elections",
  "link": "https://audioboom.com/posts/7274500",
  "itunes:episode": 45,
  "itunes:title": "Director's Cut: Reflections on the European elections",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2034,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>An analysis of the results of the most recent European elections reveals what Bruegel director Guntram Wolff classifies as a generally positive trend in electoral participation across the EU, with an overall increase of 7% in voter turnout since the last elections in 2014. Additionally, populist parties in the European Parliament seem to have been prevented from gaining ground.<br>\n<br>\nHowever, election results in some EU member states were not as pro-EU at the national level. In this podcast, Guntram Wolff welcomes Ferdinando Giugliano from Bloomberg and Krzysztof Blusz from WiseEuropa to discuss the results in each guest's home countries - Italy and Poland, respectively - and how the nationalist trends in each state might play a role in politics in the new European Parliament and European Commission.<br>\n<br>\nIf you are interested in Bruegel's work concerning the European elections, we recommend our blog post: ‘<a href=\"http://bruegel.org/2019/05/spitzenkandidaten-visions-for-the-future-of-europes-economy/\">Spitzenkandidaten visions for the future of Europe’s economy</a>’, which features the candidates for the next president of the European Commission. You can also visit the main page for <a href=\"http://bruegel.org/europe2019/\">our Spitzenkandidaten series</a>, to review the content in full.</div>\n",
  "itunes:summary": "Bruegel director Guntram Wolff hosts Ferdinando Giugliano, columnist for Bloomberg and La Repubblica, and Krzysztof Blusz, political analyst and senior fellow at WiseEuropa – Centre for European Strategy, for a discussion about the results of the European elections, both across Europe and within the states of Italy and Poland.",
  "pubDate": "Wed, 29 May 2019 13:26:17 +0000",
  "guid": "tag:audioboom.com,2019-05-29:/posts/7274500",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}