{
  "title": "ACL 2018 Highlights: Understanding Representations and Evaluation in More Challenging Settings",
  "description": "This post discusses highlights of the 56th Annual Meeting of the Association for Computational Linguistics (ACL 2018). It focuses on understanding representations and evaluating in more challenging scenarios.",
  "link": "http://ruder.io/acl-2018-highlights/",
  "guid": "5c76ff7c1b9b0d18555b9ead",
  "category": [
    "natural language processing",
    "events",
    "transfer learning",
    "reinforcement learning"
  ],
  "dc:creator": "Sebastian Ruder",
  "pubDate": "Thu, 26 Jul 2018 11:00:00 GMT",
  "media:content": "",
  "content:encoded": "<!--kg-card-begin: markdown--><!--kg-card-begin: markdown--><img src=\"http://ruder.io/content/images/2018/07/view_out_of_conference_venue-2.jpg\" alt=\"ACL 2018 Highlights: Understanding Representations and Evaluation in More Challenging Settings\"><p>This post discusses highlights of the 56th Annual Meeting of the Association for Computational Linguistics (ACL 2018).</p>\n<p><em>This post originally appeared at the <a href=\"http://blog.aylien.com/acl-2018-highlights-understanding-representations-and-evaluation-in-more-challenging-settings/\">AYLIEN blog</a>.</em></p>\n<p>I attended the <a href=\"https://acl2018.org/\">56th Annual Meeting of the Association for Computational Linguistics (ACL 2018)</a> in Melbourne, Australia from July 15-20, 2018 and presented three papers <a href=\"#fn25\"></a><a href=\"#fn38\"></a><a href=\"#fn26\"></a>. It is foolhardy to try to condense an entire conference into one topic; however, in retrospect, certain themes appear particularly pronounced. In 2015 and 2016, NLP conferences were dominated by word embeddings and some people were musing that <a href=\"http://ruder.io/word-embeddings-1/\"><em>Embedding Methods in Natural Language Processing</em></a> was a more appropriate name for the Conference on <a href=\"http://emnlp2018.org/\"><em>Empirical Methods in Natural Language Processing</em></a>, one of the top conferences in the field.</p>\n<p><a href=\"https://nlp.stanford.edu/manning/talks/Simons-Institute-Manning-2017.pdf\">According to Chris Manning</a>, 2017 was the year of the BiLSTM with attention. While BiLSTMs optionally with attention are still ubiquitous, the main themes of this conference for me were to <em>gain a better understanding</em> what the representations of such models capture and to expose them to <em>more challenging settings</em>. In my review, I will mainly focus on contributions that touch on these themes but will also discuss other themes that I found of interest.</p>\n<h1 id=\"understandingrepresentations\">Understanding Representations</h1>\n<h2>Probing models</h2>\n<p>It was very refreshing to see that rather than introducing ever shinier new models, many papers methodically investigated existing models and what they capture. This was most commonly done by automatically creating a dataset that focuses on one particular aspect of the generalization behaviour and evaluating different trained models on this dataset:</p>\n<ul>\n<li> Conneau et al.<a href=\"#fn11\"></a> for instance evaluate different sentence embedding methods on ten datasets designed to capture certain linguistic features, such as predicting the length of a sentence, recovering word content, sensitivity to bigram shift, etc. They find that different encoder architectures can result in embeddings with different characteristics and that bag-of-embeddings is surprisingly good at capturing sentence-level properties, among other results.</li>\n<li> Zhu et al.<a href=\"#fn9\"></a> evaluate sentence embeddings by observing the change in similarity of generated triplets of sentences that differ in a certain semantic or syntactic aspect. They find---among other things---that SkipThought and InferSent can distinguish negation from synonymy, while InferSent is better at identifying semantic equivalence and dealing with quantifiers.</li>\n<li> Pezzelle et al.<a href=\"#fn10\"></a> focus specifically on quantifiers and test different CNN and LSTM models on their ability to predict quantifiers in single-sentence and multi-sentence contexts. They find that in single-sentence context, models outperform humans, while humans are slightly better in multi-sentence contexts.</li>\n<li> Kuncoro et al.<a href=\"#fn12\"></a> evaluate LSTMs on modeling subject-verb agreement. They find that with enough capacity, LSTMs can model subject-verb agreement, but that more syntax-sensitive models such as recurrent neural network grammars do even better.</li>\n<li> Blevins et al.<a href=\"#fn24\"></a> evaluate models pretrained on different tasks whether they capture a hierarchical notion of syntax. Specifically, they train the models to predict POS tags as well as constituent labels at different depths of a parse tree. They find that all models indeed encode a significant amount of syntax and---in particular---that language models learn some syntax.</li>\n<li> Khandelwal et al.<a href=\"#fn42\"></a> show that LSTM language models use about 200 tokens of context on average. Word order is only relevant within the most recent sentence.\n</li><li> Another interesting result regarding the generalization ability of language models is due to Lau et al.<a href=\"#fn16\"></a> who find that a language model trained on a sonnet corpus captures meter implicitly at human-level performance.</li>\n<li> Language models, however, also have their limitations. Spithourakis and Riedel<a href=\"#fn23\"></a> observe that language models are bad at modelling numerals and propose several strategies to improve them.</li>\n<li> Liu et al.<a href=\"#fn37\"></a> show that LSTMs trained on natural language data are able to recall tokens from much longer sequence than models trained on non-language data at the Repl4NLP workshop.</li>\n</ul>\n<p>In particular, I think better understanding what information LSTMs and language models will become more important, as they seem to be a key driver of progress in NLP going forward, as evidenced by our ACL paper on language model fine-tuning<a href=\"#fn38\"></a> and <a href=\"http://ruder.io/nlp-imagenet/\">related approaches</a>.</p>\n<h2 id=\"understandingstateoftheartmodels\">Understanding state-of-the-art models</h2>\n<p>While the above studies try to understand a specific aspect of the generalization ability of a particular model class, several papers focus on better understanding state-of-the-art models for a particular task:</p>\n<ul>\n<li> Glockner et al.<a href=\"#fn8\"></a> focused on the task of natural language inference. They created a dataset with sentences that differ by at most one word from sentences in the training data in order to probe if models can deal with simple lexical inferences. They find that current state-of-the-art models fail to capture many simple inferences.</li>\n<li> Mudrakarta et al.<a href=\"#fn22\"></a> analyse state-of-the-art QA models across different modalities and find that the models often ignore key question terms. They then perturb questions to craft adversarial examples that significantly lower models' accuracy.</li>\n</ul>\nI found many of the papers probing different aspects of models stimulating. I hope that the generation of such probing datasets will become a standard tool in the toolkit of every NLP researchers so that we will not only see more of such papers in the future but that such an analysis may also become part of the standard model evaluation, besides error and ablation analyses.\n<h2 id=\"analyzingtheinductivebias\">Analyzing the inductive bias</h2>\n<p>Another way to gain a better understanding of a model is to analyze its inductive bias. The <a href=\"https://sites.google.com/view/relsnnlp\">Workshop on Relevance of Linguistic Structure in Neural Architectures for NLP (RELNLP)</a> sought to explore how useful it is to incorporate linguistic structure into our models. One of the key points of Chris Dyer's talk during the workshop was whether RNNs have a useful inductive bias for NLP. In particular, he argued that there are several pieces of evidence indicating that RNNs prefer sequential recency, namely:</p>\n<ol>\n<li> Gradients become attenuated across time. LSTMs or GRUs may help with this, but they also forget.</li>\n<li> People have used training regimes like reversing the input sequence for machine translation.</li>\n<li> People have used enhancements like attention to have direct connections back in time.</li>\n<li> For modeling subject-verb agreement, the error rate increases with the number of attractors<a href=\"#fn29\"></a>.</li>\n</ol>\n<p>According to Chomsky, sequential recency is not the right bias for learning human language. RNNs thus don't seem to have the right bias for modeling language, which in practice can lead to statistical inefficiency and poor generalization behaviour. Recurrent neural network grammars<a href=\"#fn30\"></a>, a class of models that generates both a tree and a sequence sequentially by compressing a sentence into its constituents, instead have a bias for syntactic (rather than sequential) recency.</p>\n<p>However, it can often be hard to identify whether a model has a useful inductive bias. For identifying subject-verb agreement, Chris hypothesizes that LSTM language models learn a non-structural \"first noun\" heuristic that relies on matching the verb to the first noun in the sentence. In general, perplexity (and other aggregate metrics) are correlated with syntactic/structural competence, but are not particularly sensitive at distinguishing structurally sensitive models from models that use a simpler heuristic.</p>\n<h2>Using Deep Learning to understand language</h2>\n<p>In his talk at the workshop, Mark Johnson opined that while Deep Learning has revolutionized NLP, its primary benefit is economic: complex component pipelines have been replaced with end-to-end models and target accuracy can often be achieved more quickly and cheaply. Deep Learning has not changed our understanding of language. Its main contribution in this regard is to demonstrate that a neural network aka a computational model can perform certain NLP tasks, which shows that these tasks are not indicators of intelligence. While DL methods can pattern match and perform perceptual tasks really well, they struggle with tasks relying on deliberate reflection and conscious thought.</p>\n<h2>Incorporating linguistic structure</h2>\n<p>Jason Eisner questioned in his talk whether linguistic structures and categories actually exist or whether \"scientist just like to organize data into piles\" given that a linguistics-free approach works surprisingly well for MT. He finds that even \"arbitrarily defined\" categories such as the difference between the /b/ and /p/ phonemes can become hardened and accrue meaning. However, neural models are pretty good sponges to soak up whatever isn't modeled explicitly.</p>\n<p>He outlines four common ways to introduce linguistic information into models: a) via a pipeline-based approach, where linguistic categories are used as features; b) via data augmentation, where the data is augmented with linguistic categories; c) via multi-task learning; d) via structured modeling such as using a transition-based parser, a recurrent neural network grammar, or even classes that depend on each other such as BIO notation.</p>\n<p>In her talk at the workshop, Emily Bender questioned the premise of linguistics-free learning altogether: Even if you had a huge corpus in a language that you knew nothing about, without any other priors, e.g. what function words are, you would not be able to learn sentence structure or meaning. She also pointedly called out many ML papers that describe their approach as similar to how babies learn, without citing any actual developmental psychology or language acquisition literature. Babies in fact learn in situated, joint, emotional context, which carries a lot of signal and meaning.</p>\n<h2>Understanding the failure modes of LSTMs</h2>\n<p>Better understanding representations was also a theme at the <a href=\"https://sites.google.com/site/repl4nlp2018/\n\">Representation Learning for NLP workshop</a>. During his talk, Yoav Goldberg detailed some of the efforts of his group to better understand representations of RNNs. In particular, he discussed recent work on extracting a finite state automaton from an RNN in order to better understand what the model has learned<a href=\"#fn35\"></a>. He also reminded the audience that LSTM representations, even though they have been trained on one task, are not task-specific. They are often predictive of unintended aspects such as demographics in the data. Even when a model has been trained using a domain-adversarial loss to produce representations that are invariant of a certain aspect, the representations will be still slightly predictive of said attribute. It can thus be a challenge to completely remove unwanted information from encoded language data and even seemingly perfect LSTM models may have hidden failure modes.</p>\n<p>On the topic of failure modes of LSTMs, a statement that also fits well in this theme was uttered by this year's recipient of the ACL lifetime achievement award, Mark Steedman. He asked <em>\"LSTMs work in practice, but can they work in theory?\"</em>.</p>\n<h1 id=\"\">Evaluation in more challenging settings</h1>\n<h2>Adversarial examples</h2>\n<p>A theme that is closely interlinked with gaining a better understanding of the limitations of state-of-the-art models is to propose ways how they can be improved. In particular, similar to adversarial example paper mentioned above<a href=\"#fn22\"></a>, several papers tried to make models more robust to adversarial examples:</p>\n<ul>\n<li> Cheng et al.\n<a href=\"#fn21\"></a> propose to make both the encoder and decoder in NMT models more robust against input perturbations.</li>\n<li> Ebrahimi et al.<a href=\"#fn28\"></a> propose white-box adversarial examples to trick a character-level neural classifier by swapping few tokens.</li>\n<li> Ribeiro et al.<a href=\"#fn13\"></a> improve upon the previous method with semantic-preserving perturbations that induce changes in the model's predictions, which they generalize to rules that induce adversaries on many instances.</li>\n<li> Bose et al.<a href=\"#fn41\"></a> incorporate adversarial examples into noise contrastive estimation using an adversarially learned sampler. The sampler finds harder negative examples, which forces the model to learn better representations.</li>\n</ul>\n<h2>Learning robust and fair representations</h2>\n<p>Tim Baldwin discussed different ways to make models more robust to a domain shift during his talk at the <a href=\"https://sites.google.com/site/repl4nlp2018/\n\">RepL4NLP workshop</a>. The slides can be found <a href=\"https://drive.google.com/file/d/1JhZKKCJjIDIqZdwRL0GEUcrWxscLS87l/view\">here</a>. For using a single source domain, he discussed a method to linguistically perturb training instances based on different types of syntactic and semantic noise<a href=\"#fn32\"></a>. In the setting with multiple source domains, he proposed to train an adversarial model on the source domains<a href=\"#fn33\"></a>. Finally, he discussed a method that allows to learn robust and privacy-preserving text representations<a href=\"#fn34\"></a>.</p>\n<p>Margaret Mitchell focused on fair and privacy-preserving representations during her talk at the workshop. In particular, she highlighted the difference between a descriptive and a normative view of the world. ML models learn representations that reflect a descriptive view of the data they're trained on. The data represents \"the world as people talk about it\". Research in fairness conversely seeks to create representations that reflect a normative view of the world, which captures our values and seeks to instill them in the representations.</p>\n<h2>Improving evaluation methodology</h2>\n<p>Besides making models more robust, several papers sought to improve the way we evaluate our models:</p>\n<ul>\n<li> Finegan-Dollak et al.<a href=\"#fn18\"></a> identify limitations and propose improvements to current evaluations of text-to-SQL systems. They show that the current train-test split and practice of anonymization of variables are flawed and release standardized and improved versions of seven datasets to mitigate these.</li>\n<li> Dror et al.<a href=\"#fn14\"></a> focus on a practice that should be commonplace, but is often not done or done poorly: statistical significance testing. In particular, they survey recent empirical papers in ACL and TACL 2017 finding that statistical significance testing is often ignored or misused and propose a simple protocol for statistical significance test selection for NLP tasks.</li>\n<li> Chaganty et al.<a href=\"#fn17\"></a> investigate the bias of automatic metrics such as BLEU and ROUGE and find that even an unbiased estimator only achieves a comparatively low error reduction. This highlights the need to improve both the correlation of automatic metric as well as reduce the variance of human annotation.</li>\n</ul>\n<h2>Strong baselines</h2>\n<p>Another way to improve model evaluation is to compare new models against stronger baselines, in order to make sure that improvements are actually significant. Some papers focused on this line of research:</p>\n<ul>\n<li> Shen et al.<a href=\"#fn19\"></a> systematically compare simple word embedding-based methods with pooling to more complex models such as LSTMs and CNNs. They find that for most datasets, word embedding-based methods exhibit competitive or even superior performance.</li>\n<li> Ethayarajh<a href=\"#fn36\"></a> proposes a strong baseline for sentence embedding models at the RepL4NLP workshop.</li>\n<li> In a similar vein, Ruder and Plank<a href=\"#fn25\"></a> find that classic bootstrapping algorithms such as tri-training make for strong baselines for semi-supervised learning and even outperform recent state-of-the-art methods.</li>\n</ul>\nIn the above paper, we also emphasize the importance of evaluating in more challenging settings, such as on out-of-distribution data and on different tasks. Our findings would have been different if we had just focused on a single task or only on in-domain data. We need to test our models under such adverse conditions to get a better sense of their robustness and how well they can actually generalize.\n<h2>Creating harder datasets</h2>\n<p>In order to evaluate under such settings, more challenging datasets need to be created. Yejin Choi argued during the RepL4NLP panel discussion (a summary can be found <a href=\"https://twitter.com/seb_ruder/status/1020196710050455554\">here</a>) that the community pays a lot of attention to easier tasks such as SQuAD or bAbI, which are close to solved. Yoav Goldberg even went so far as to say that \"SQuAD is the MNIST of NLP\". Instead, we should focus on solving harder tasks and develop more datasets with increasing levels of difficulty. If a dataset is too hard, people don't work on it. In particular, the community should not work on datasets for too long as datasets are getting solved very fast these days; creating novel and more challenging datasets is thus even more important. Two datasets that seek to go beyond SQuAD for reading comprehension were presented at the conference:</p>\n<ul>\n<li> <a href=\"http://qangaroo.cs.ucl.ac.uk/\">QAngaroo</a><a href=\"#fn39\"></a> focuses on reading comprehension that requires to gather several pieces of information via multiple steps of inference.</li>\n<li> <a href=\"https://github.com/deepmind/narrativeqa\">NarrativeQA</a><a href=\"#fn40\"></a> requires understand of an underlying narrative by asking the reader to answer questions about stories by reading entire books or movie scripts.</li>\n</ul>\n<p>Richard Socher also stressed the importance of training and evaluating a model across multiple tasks during <a href=\"https://twitter.com/RichardSocher/status/1021917140801052672\">his talk</a> during the <a href=\"https://mrqa2018.github.io/\">Machine Reading for Question Answering workshop</a>. In particular, he argues that NLP requires many types of reasoning, e.g. logical, linguistic, emotional, etc., which cannot all be satisfied by a single task.</p>\n<h2>Evaluation on multiple and low-resource languages</h2>\n<p>Another facet of this is to evaluate our models on multiple languages. Emily Bender surveyed 50 NAACL 2018 papers in her talk mentioned above and found that 42 papers evaluate on an unnamed mystery language (i.e. English). She emphasizes that it is important to name the language you work on as languages have different linguistic structures; not mentioning the language obfuscates this fact.</p>\n<p>If our methods are designed to be cross-lingual, then we should additionally evaluate them on the more challenging setting of low-resource languages. For instance, both of the following two papers observe that current methods for unsupervised bilingual dictionary methods fail if the target language is dissimilar to language such as with Estonian or Finnish:</p>\n<ul>\n<li> Søgaard et al.<a href=\"#fn26\"></a> probe the limitations of current methods further and highlight that such methods also fail when embeddings are trained on different domains or using different algorithms. They finally propose a metric to quantify the potential of such methods.</li>\n<li> Artetxe et al.<a href=\"#fn27\"></a> propose a new unsupervised self-training method that employs a better initialization to steer the optimization process and is particularly robust for dissimilar language pairs.</li>\n</ul>\n<p>Several other papers also evaluate their approaches on low-resource languages:</p>\n<ul>\n<li> Dror et al.<a href=\"#fn15\"></a> propose to use orthographic features for bilingual lexicon induction. Though these mostly help for related languages, they also evaluate on the dissimilar language pair English-Finnish.</li>\n<li> Ren et al.<a href=\"#fn20\"></a> finally propose to leverage another rich language for translation into a resource-poor language\n. They find that their model significantly improves the translation quality of rare languages.</li>\n<li> Currey and Heafield<a href=\"#fn31\"></a> propose an unsupervised tree-to-sequence model for NMT by adapting the Gumbel tree-LSTM. Their model proves particularly useful for low-resource languages.</li>\n</ul>\n<h1 id=\"\">Progress in NLP</h1>\n<p>Another theme during the conference for me was that the field is visibly making progress. Marti Hearst, president of the ACL, echoed this sentiment during her presidential address. She used to demonstrate what our models can and can't do using the example of Stanley Kubrick's HAL 9000 (seen below). In recent years, this has become a less useful exercise as our models have learned to perform tasks that seemed previously decades away such as recognizing and producing human speech or lipreading<a href=\"#fn7\">[1]</a>. Naturally, we are still far away from tasks that require deep language understanding and reasoning such as having an argument; nevertheless, this progress is remarkable.</p>\n<figure>\n    <center>\n<img src=\"http://ruder.io/content/images/2018/07/hal9000.png\" width=\"150\" alt=\"ACL 2018 Highlights: Understanding Representations and Evaluation in More Challenging Settings\">\n    <figcaption>Hal 9000. (Source: <a href=\"https://creativecommons.org/licenses/by/3.0\" title=\"Creative Commons Attribution 3.0\">CC BY 3.0</a>, <a href=\"https://commons.wikimedia.org/w/index.php?curid=11651154\">Wikimedia</a>)</figcaption>\n    </center>\n</figure>\n<p>Marti also paraphrased NLP and IR pioneer Karen Spärck Jones saying that research is not going around in circles, but climbing a spiral or---maybe more fittingly---different staircases that are not necessarily linked but go in the same direction. She also expressed a sentiment that seems to resonate with a lot of people: In the 1980s and 90s, with only a few papers to read, it was definitely easier to keep track of the state of the art. To make this easier, I have  recently created a document to collect the <a href=\"http://nlpprogress.com/\">state of the art across different NLP tasks</a>.</p>\n<p>With the community growing, she encouraged people to participate and volunteer and announced an ACL Distinguished Service Award for the most dedicated members. ACL 2018 also saw the launch (after EACL in 1982 and NAACL in 2000) of its third chapter, AACL, the <a href=\"http://aaclweb.org/\">Asia-Pacific Chapter of the Association for Computational Linguistics</a>.</p>\n<p>The business meeting during the conference focused on measures to address a particular challenge of the growing community: the escalating number of submissions and the need for more reviewers. We can expect to see new efforts to deal with the large number of submissions at the conferences next year.</p>\n<h1 id=\"reinforcementlearning\">Reinforcement learning</h1>\n<p><a href=\"http://ruder.io/emnlp-2016-highlights/\">Back in 2016</a>, it seemed as though reinforcement learning (RL) was finding its footing in NLP and being applied to more and more tasks. These days, it seems that the dynamic nature of RL makes it most useful for tasks that intrinsically have some temporal dependency such as selecting data during training<a href=\"#fn1\">[1]</a><a href=\"#fn2\">[1]</a> and modelling dialogue, while supervised learning seems to be better suited for most other tasks. Another important application of RL is to optimize the end metric such as ROUGE or BLEU directly instead of optimizing a surrogate loss such as cross-entropy. Successful applications of this are summarization<a href=\"#fn3\">[1]</a><a href=\"#fn4\">[1]</a> and machine translation<a href=\"#fn5\">[1]</a>.</p>\n<p>Inverse reinforcement learning can be valuable in settings where the reward is too complex to be specified. A successful application of this is visual storytelling<a href=\"#fn6\">[1]</a>. RL is particularly promising for sequential decision making problems in NLP such as playing text-based games, navigating webpages, and completing tasks. The <a href=\"https://www.cs.ucsb.edu/~william/papers/ACL2018DRL4NLP.pdf\">Deep Reinforcement Learning for NLP tutorial</a> provided a comprehensive overview of the space.</p>\n<h1 id=\"\">Tutorials</h1>\n<p>There were other great tutorials as well. I particularly enjoyed the <a href=\"https://github.com/philschulz/VITutorial\">Variational Inference and Deep Generative Models tutorial</a>. The tutorials on <a href=\"https://github.com/allenai/acl2018-semantic-parsing-tutorial\">Semantic Parsing</a> and about <a href=\"http://faculty.washington.edu/ebender/100things-sem_prag.html\">\"100 things you always wanted to know about semantics & pragmatics\"</a> also seemed really worthwhile. A complete list of the tutorials can be found <a href=\"https://acl2018.org/tutorials/\">here</a>.</p>\n<p><em>Cover image: View from the conference venue.</em></p>\n<p><em>Thanks to <a href=\"http://isabelleaugenstein.github.io/\">Isabelle Augenstein</a> for some paper suggestions.</em></p>\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Fang, M., Li, Y., & Cohn, T. (2017). Learning how to Active Learn: A Deep Reinforcement Learning Approach. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. Retrieved from https://arxiv.org/pdf/1708.02383v1.pdf</p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Wu, J., Li, L., & Wang, W. Y. (2018). Reinforced Co-Training. In Proceedings of NAACL-HLT 2018.</p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p>Paulus, R., Xiong, C., & Socher, R. (2018). A deep reinforced model for abstractive summarization. In Proceedings of ICLR 2018.</p></li>\n<li id=\"fn4\" class=\"footnote-item\"><p>Celikyilmaz, A., Bosselut, A., He, X., & Choi, Y. (2018). Deep communicating agents for abstractive summarization. In Proceedings of NAACL-HLT 2018.</p></li>\n<li id=\"fn5\" class=\"footnote-item\"><p>Ranzato, M. A., Chopra, S., Auli, M., & Zaremba, W. (2016). Sequence level training with recurrent neural networks. In Proceedings of ICLR 2016.</p></li>\n<li id=\"fn6\" class=\"footnote-item\"><p>Wang, X., Chen, W., Wang, Y.-F., & Wang, W. Y. (2018). No Metrics Are Perfect: Adversarial Reward Learning for Visual Storytelling. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1804.09160</p></li>\n<li id=\"fn7\" class=\"footnote-item\"><p>Chung, J. S., & Zisserman, A. (2016, November). Lip reading in the wild. In Asian Conference on Computer Vision (pp. 87-103). Springer, Cham.</p></li>\n<li id=\"fn8\" class=\"footnote-item\"><p>Glockner, M., Shwartz, V., & Goldberg, Y. (2018). Breaking NLI Systems with Sentences that Require Simple Lexical Inferences. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1805.02266.</p></li>\n<li id=\"fn9\" class=\"footnote-item\"><p>Zhu, X., Li, T., & De Melo, G. (2018). Exploring Semantic Properties of Sentence Embeddings. In Proceedings of ACL 2018 (pp. 1–6). Retrieved from http://aclweb.org/anthology/P18-2100\n</p></li>\n<li id=\"fn10\" class=\"footnote-item\"><p>Pezzelle, S., Steinert-Threlkeld, S., Bernardi, R., & Szymanik, J. (2018). Some of Them Can be Guessed! Exploring the Effect of Linguistic Context in Predicting Quantifiers. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1806.00354\n</p></li>\n<li id=\"fn11\" class=\"footnote-item\"><p>Conneau, A., Kruszewski, G., Lample, G., Barrault, L., & Baroni, M. (2018). What you can cram into a single vector: Probing sentence embeddings for linguistic properties. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1805.01070\n</p></li>\n<li id=\"fn12\" class=\"footnote-item\"><p>Kuncoro, A., Dyer, C., Hale, J., Yogatama, D., Clark, S., & Blunsom, P. (2018). LSTMs Can Learn Syntax-Sensitive Dependencies Well, But Modeling Structure Makes Them Better. In Proceedings of ACL 2018 (pp. 1–11). Retrieved from http://aclweb.org/anthology/P18-1132\n</p></li>\n<li id=\"fn13\" class=\"footnote-item\"><p>\nRibeiro, M. T., Singh, S., & Guestrin, C. (2018). Semantically Equivalent Adversarial Rules for Debugging NLP Models. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn14\" class=\"footnote-item\"><p>\nDror, R., Baumer, G., Shlomov, S., & Reichart, R. (2018). The Hitchhiker’s Guide to Testing Statistical Significance in Natural Language Processing. In Proceedings of ACL 2018. Retrieved from https://ie.technion.ac.il/~roiri/papers/ACL-2018-sig-cr.pdf\n</p></li>\n<li id=\"fn15\" class=\"footnote-item\"><p>\nDror, R., Baumer, G., Shlomov, S., & Reichart, R. (2018). Riley, P., & Gildea, D. (2018). Orthographic Features for Bilingual Lexicon Induction. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn16\" class=\"footnote-item\"><p>\nLau, J. H., Cohn, T., Baldwin, T., Brooke, J., & Hammond, A. (2018). Deep-speare: A Joint Neural Model of Poetic Language, Meter and Rhyme. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1807.03491\n</p></li>\n<li id=\"fn17\" class=\"footnote-item\"><p>\nChaganty, A. T., Mussman, S., & Liang, P. (2018). The price of debiasing automatic metrics in natural language evaluation. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1807.02202\n</p></li>\n<li id=\"fn18\" class=\"footnote-item\"><p>\nFinegan-Dollak, C., Kummerfeld, J. K., Zhang, L., Ramanathan, K., Sadasivam, S., Zhang, R., & Radev, D. (2018). Improving Text-to-SQL Evaluation Methodology. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1806.09029\n</p></li>\n<li id=\"fn19\" class=\"footnote-item\"><p>\nShen, D., Wang, G., Wang, W., Min, M. R., Su, Q., Zhang, Y., … Carin, L. (2018). Baseline Needs More Love: On Simple Word-Embedding-Based Models and Associated Pooling Mechanisms. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn20\" class=\"footnote-item\"><p>\nRen, S., Chen, W., Liu, S., Li, M., Zhou, M., & Ma, S. (2018). Triangular Architecture for Rare Language Translation. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1805.04813\n</p></li>\n<li id=\"fn21\" class=\"footnote-item\"><p>\nCheng, Y., Tu, Z., Meng, F., Zhai, J., & Liu, Y. (2018). Towards Robust Neural Machine Translation. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn22\" class=\"footnote-item\"><p>\nMudrakarta, P. K., Taly, A., Brain, G., Sundararajan, M., & Google, K. D. (2018). Did the Model Understand the Question? In Proceedings of ACL 2018. Retrieved from https://arxiv.org/pdf/1805.05492.pdf\n</p></li>\n<li id=\"fn23\" class=\"footnote-item\"><p>\nSpithourakis, G. P., & Riedel, S. (2018). Numeracy for Language Models: Evaluating and Improving their Ability to Predict Numbers. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn24\" class=\"footnote-item\"><p>\nBlevins, T., Levy, O., & Zettlemoyer, L. (2018). Deep RNNs Encode Soft Hierarchical Syntax. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1805.04218\n</p></li>\n<li id=\"fn25\" class=\"footnote-item\"><p>\nRuder, S., & Plank, B. (2018). Strong Baselines for Neural Semi-supervised Learning under Domain Shift. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn26\" class=\"footnote-item\"><p>\nSøgaard, A., Ruder, S., & Vulić, I. (2018). On the Limitations of Unsupervised Bilingual Dictionary Induction. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn27\" class=\"footnote-item\"><p>\nArtetxe, M., Labaka, G., & Agirre, E. (2018). A robust self-learning method for fully unsupervised cross-lingual mappings of word embeddings. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn28\" class=\"footnote-item\"><p>\nEbrahimi, J., Rao, A., Lowd, D., & Dou, D. (2018). HotFlip: White-Box Adversarial Examples for Text Classification. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1712.06751\n</p></li>\n<li id=\"fn29\" class=\"footnote-item\"><p>\nLinzen, T., Dupoux, E., & Goldberg, Y. (2016). Assessing the Ability of LSTMs to Learn Syntax-Sensitive Dependencies. Proceedings of TACL 2016. Retrieved from http://arxiv.org/abs/1611.01368\n</p></li>\n<li id=\"fn30\" class=\"footnote-item\"><p>\nDyer, C., Kuncoro, A., Ballesteros, M., & Smith, N. A. (2016). Recurrent Neural Network Grammars. In NAACL. Retrieved from http://arxiv.org/abs/1602.07776\n</p></li>\n<li id=\"fn31\" class=\"footnote-item\"><p>\nCurrey, A., & Heafield, K. (2018). Unsupervised Source Hierarchies for Low-Resource Neural Machine Translation. In Proceedings of the Workshop on the Relevance of Linguistic Structure in Neural Architectures for NLP (pp. 1–7).\n</p></li>\n<li id=\"fn32\" class=\"footnote-item\"><p>\nLi, Y., Cohn, T., & Baldwin, T. (2017). Robust Training under Linguistic Adversity. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics (Vol. 2, pp. 21–27).\n</p></li>\n<li id=\"fn33\" class=\"footnote-item\"><p>\nLi, Y., Baldwin, T., & Cohn, T. (2018). Learning Domain-Robust Text Representations using Adversarial Training. In Proceedings of NAACL-HLT 2018.\n</p></li>\n<li id=\"fn34\" class=\"footnote-item\"><p>\nLi, Y., Baldwin, T., & Cohn, T. (2018). Towards Robust and Privacy-preserving Text Representations. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn35\" class=\"footnote-item\"><p>\nWeiss, G., Goldberg, Y., & Yahav, E. (2018). Extracting Automata from Recurrent Neural Networks Using Queries and Counterexamples. In Proceedings of ICML 2018. Retrieved from http://arxiv.org/abs/1711.09576\n</p></li>\n<li id=\"fn36\" class=\"footnote-item\"><p>\nEthayarajh, K. (2018). Unsupervised Random Walk Sentence Embeddings: A Strong but Simple Baseline. In Proceedings of the 3rd Workshop on Representation Learning for NLP. Retrieved from http://www.aclweb.org/anthology/W18-3012\n</p></li>\n<li id=\"fn37\" class=\"footnote-item\"><p>\nLiu, N. F., Levy, O., Schwartz, R., Tan, C., & Smith, N. A. (2018). LSTMs Exploit Linguistic Attributes of Data. In Proceedings of the 3rd Workshop on Representation Learning for NLP,. Retrieved from http://arxiv.org/abs/1805.11653\n</p></li>\n<li id=\"fn38\" class=\"footnote-item\"><p>\nHoward, J., & Ruder, S. (2018). Universal Language Model Fine-tuning for Text Classification. In Proceedings of ACL 2018. Retrieved from http://arxiv.org/abs/1801.06146\n</p></li>\n<li id=\"fn39\" class=\"footnote-item\"><p>\nWelbl, J., Stenetorp, P., & Riedel, S. (2018). Constructing Datasets for Multi-hop Reading Comprehension Across Documents. In Transactions of the Association for Computational Linguistics. Retrieved from http://arxiv.org/abs/1710.06481\n</p></li>\n<li id=\"fn40\" class=\"footnote-item\"><p>\nKočiský, T., Schwarz, J., Blunsom, P., Dyer, C., Hermann, K. M., Melis, G., & Grefenstette, E. (2018). The NarrativeQA Reading Comprehension Challenge. Transactions of the Association for Computational Linguistics. Retrieved from http://arxiv.org/abs/1712.07040\n</p></li>\n<li id=\"fn41\" class=\"footnote-item\"><p>\nBose, A., Ling, H., & Cao, Y. (2018). Adversarial Contrastive Estimation. In Proceedings of ACL 2018.\n</p></li>\n<li id=\"fn42\" class=\"footnote-item\">Khandelwal, U., He, H., Qi, P., & Jurafsky, D. (2018). Sharp Nearby, Fuzzy Far Away: How Neural Language Models Use Context. In Proceedings of ACL 2018.</li>\n</ol><!--kg-card-end: markdown--><!--kg-card-end: markdown-->"
}