{
  "id": "https://bibleinoneyear.org/en/youth/29",
  "title": "Day 29: You Are Loved",
  "description": "Psalm 17:7–8, Job 13:15, Matthew 20:1–16.  He has forgiven me for what I have done  He has turned my life around",
  "pubDate": "Sat, 29 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/29/",
  "itunes:duration": "12:08",
  "guid": "enyouth29012022-29",
  "length": 728.84,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 29: You Are Loved",
  "itunes:subtitle": "Psalm 17:7–8, Job 13:15, Matthew 20:1–16.  He has forgiven me for what I have done  He has turned my life around",
  "itunes:summary": "Shane Taylor was considered one of the most dangerous men in the UK prison system. Originally jailed for attempted murder, he had his sentence extended by four years when he attacked a prison officer with a broken glass, setting off a riot.\nHe was put in a segregation unit inside a maximum-security prison. He was given his food through a hatch. His door was not opened unless there were six officers armed with riot shields waiting outside.\nLater, he was transferred to Long Lartin maximum-security prison where he was invited on Alpha. During the course he prayed, ‘Jesus Christ, I know you died on a cross for me. I hate who I am; who I’ve become. Please forgive me and come into my life.’ At that moment he was filled with the Holy Spirit. He went running out onto the wing, telling everyone he could find, ‘Jesus is real!’\nHis behaviour changed so much that he went from living in total segregation to getting a trusted job in the prison chaplaincy. He prayed for the prison officers and for his enemies and, when he came out of prison, he got involved in a church. He met a young woman called Sam, who had also had a tough life and had been involved with drugs and criminal activity. She also came to faith in Jesus. Now, they are married and have five children.\nTalking to Shane now, it is hard to imagine that he is the same person who terrified so many people in the past. He has experienced ‘the wonder of [God’s] great love’ (Psalm 17:7). He says, ‘Jesus has shown me how to love and how to forgive. He has saved me. He has forgiven me for what I have done. He has turned my life around.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 394
}