{
  "title": "Density Matrix Renormalization Group for Transcorrelated Hamiltonians: Ground and Excited States in \\emph{ab initio} Systems. (arXiv:2211.00173v2 [physics.chem-ph] UPDATED)",
  "link": "http://arxiv.org/abs/2211.00173",
  "description": "<p>We present the theory of a density matrix renormalization group (DMRG)\nalgorithm which can solve for both the ground and excited states of\nnon-Hermitian transcorrelated Hamiltonians, and show applications in \\emph{ab\ninitio} molecular systems. Transcorrelation (TC) accelerates the basis set\nconvergence rate by including known physics (such as, but not limited to, the\nelectron-electron cusp) in the Jastrow factor used for the similarity\ntransformation. It also improves the accuracy of approximate methods such as\ncoupled cluster singles and doubles (CCSD) as shown by some recent studies.\nHowever, the non-Hermiticity of the TC Hamiltonians poses challenges for\nvariational methods like DMRG. Imaginary-time evolution on the matrix product\nstate (MPS) in the DMRG framework has been proposed to circumvent this problem;\nbut this is currently limited to treating the ground state, and has lower\nefficiency than the time-independent DMRG (TI-DMRG), due to the need to\neliminate Trotter errors. In this work, we show that with minimal changes to\nthe existing TI-DMRG algorithm, namely replacing the original Davidson solver\nwith the general Davidson solver to solve the non-Hermitian effective\nHamiltonians at each site for a few low-lying right eigenstates, and following\nthe rest of the original DMRG recipe, one can find the ground and excited\nstates with improved efficiency compared to the original DMRG when\nextrapolating to the infinite bond dimension limit in the same basis set.\nAccelerated basis set convergence rate is also observed, as expected, within\nthe TC framework.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Liao_K/0/1/0/all/0/1\">Ke Liao</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Zhai_H/0/1/0/all/0/1\">Huanchen Zhai</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Christlmaier_E/0/1/0/all/0/1\">Evelin Martine Christlmaier</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Schraivogel_T/0/1/0/all/0/1\">Thomas Schraivogel</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Rios_P/0/1/0/all/0/1\">Pablo L&#xf3;pez R&#xed;os</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Kats_D/0/1/0/all/0/1\">Daniel Kats</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Alavi_A/0/1/0/all/0/1\">Ali Alavi</a>"
}