{
  "title": "Avoiding a requiem for the WTO",
  "link": "https://audioboom.com/posts/7887709",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2898,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>As the only global international organisation dealing with the rules of trade between nations, the World Trade Organisation should be the place where governments sort out the trade problems they face with each other. However, in recent years, WTO members have not managed to conclude new agreements to liberalise trade in goods and services. The organisation has not played a significant role in defusing and addressing the trade conflict between the US and China. It was also largely ‘missing in action’ during the first stages of the global COVID-19 pandemic.<br>\n<br>\n\n</div>\n<div>All these lead to the conclusion that reform is necessary – whether the political will exists to re engage multilaterally and pursue it is another question. In this live podcast, <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> and <a href=\"https://www.bruegel.org/author/niclas-poitiers/\">Niclas Poitiers</a> are joined by <a href=\"https://www.bruegel.org/author/bernard-hoekman/\">Bernard Hoekman</a>, Professor and Director of Global Economics at the Robert Schuman Centre for Advanced Studies, European University Institute in Florence; <a href=\"https://www.bruegel.org/author/petros-c-mavroidis/\">Petros C. Mavroidis</a>, Edwin B. Parker Professor of Law at Columbia Law School in New York and <a href=\"https://www.bruegel.org/author/anna-dias/\">Anna Dias</a>, Lawyer and partner at Gide Loyrette Nouel in Paris. Together they discuss what areas of reform the WTO should prioritise, and what challenges it would face.<br>\n<br>\n\n</div>\n<div><strong>Revelant Publications:</strong></div>\n<div>\n<a href=\"https://www.bruegel.org/2021/01/china-and-the-wto-why-multilateralism-still-matters/\">China and the WTO: Why Multilateralism Still Matters</a>, <em>Book by Petros C. Mavroidis and André Sapir</em>.</div>\n<div>\n<a href=\"https://geopolitique.eu/en/2021/03/21/avoiding-a-requiem-for-the-wto/\">Avoiding a Requiem for the WTO</a>, <em>Article by Petros C. Mavroidis and Bernard Hoekman.</em>\n</div>\n<div>\n<em>*This article is part of the Revue européenne du droit (RED) issue on global governance, which you can read </em><a href=\"https://geopolitique.eu/en/2021/03/21/governing-globalization/\"><em>here</em></a><em>.<br>\n</em><br>\n\n</div>\n<div><em>This podcast is organised together with the editorial team of RED which we thank for the support.</em></div>\n",
  "itunes:summary": "The WTO has been 'missing in action': how can we restore the organisation's role as a global forum for cooperation on trade?",
  "pubDate": "Wed, 16 Jun 2021 08:34:36 +0000",
  "guid": "tag:audioboom.com,2021-06-16:/posts/7887709",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}