{
  "title": "S1E38 - Paralyzed to Powerful with Rugby Player Robert Paylor",
  "guid": "https://pinecast.com/guid/3c730b07-1ba7-4f6c-a2a5-64a66afa28c8",
  "pubDate": "Tue, 23 Mar 2021 06:30:00 -0000",
  "itunes:duration": "01:00:10",
  "description": "<p>Laura has been looking forward to today’s interview for a while, and the reason will become very clear, very quickly. On May 6, 2017, Robert Paylor was playing for the number one college rugby team in the country as they competed in the National Championship, a dream come true for any young athlete. Mere moments into that game, Robert broke his neck and was subsequently told that he would never walk or move his hands again. His life was changed forever in that instant, but if you think that’s where Robert’s story ends, you couldn’t be more wrong. That fateful day not only impacted his physical life, but his mindset, his faith, and his outlook on life, and he shares the whole story with us all today.\n \nHe begins by describing how he got involved in rugby in the first place, his experience at Cal, and then he shares, in chilling detail, the events of that day in May, 2017, as well as the immediate and long-term decisions and treatments involved in his rehabilitation, which continues to this very day. Along the way he touches upon the need for mental toughness, working through the daily grind toward his vision, the role that neuroplasticity plays in his rehabilitation, and the power of forgiveness. Throughout his story are woven Robert’s feelings of gratitude, the incredible support from family, friends, doctors, teammates, and coaches, and, especially, his discovery of the greatest purpose and commitment of his life. What happened to Robert truly changed his life on so many levels, and by listening in to his heartfelt and moving conversation with Laura today you’ll find out why he wouldn’t have it any other way.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>How Robert got involved with rugby</li>\n<li>His experience at Cal</li>\n<li>The day Robert’s life changed forever</li>\n<li>The advice he received and the decision he made in his darkest hour</li>\n<li>Accessing mental toughness to make treatment decisions</li>\n<li>Robert’s post-surgery experience</li>\n<li>Support of family and friends</li>\n<li>Robert’s rehabilitation at Craig Hospital in Colorado</li>\n<li>False hope and false hopelessness</li>\n<li>Working through the grind toward his ironclad vision</li>\n<li>The first flicker of movement</li>\n<li>Accessing perspective to be more grateful</li>\n<li>The three ways to achieve recovery form spinal cord injury</li>\n<li>The role that neuroplasticity plays in his recovery</li>\n<li>Robert’s rehabilitation since he left the hospital</li>\n<li>The support from Robert’s rugby team and especially Coach Billups</li>\n<li>Graduating from Cal</li>\n<li>The power of asking yourself, “Compared to what?”</li>\n<li>The impact that Robert can have on the lives of others</li>\n<li>Talon’s story</li>\n<li>The biggest commitment that Robert has ever made</li>\n<li>The power of forgiveness</li>\n<li>Counting the days and appreciating the daily grind</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“It was a day of legacy.”</li>\n<li>“My face slams against my chest, I feel this crunch in my neck, and I immediately can’t feel or move anything below my neck.”</li>\n<li>“The reality is, you will never walk again. You will never move your hands.”</li>\n<li>“The one thing you have control over is your mindset. Your positivity, your ambition, your willingness to wake up every single day and fight is up to you.”</li>\n<li>“I was going to give everything I had to get absolutely everything I can get.”</li>\n<li>“I knew I couldn’t live with the regret of not going into this surgery.”</li>\n<li>“It was like Death was sitting with me in that hospital room, waiting for me to quit.”</li>\n<li>“If I don’t do this, I might die!”</li>\n<li>“They look at me and they see potential, not some broken body.”</li>\n<li>“The one thing we do know is that we are going to give you everything that modern science and medicine has to offer.”</li>\n<li>“I came here to walk out of these hospital doors.”</li>\n<li>“Appreciate every victory we have no matter how small they are.”</li>\n<li>“There was just so much that I had lost that I had taken for granted in my life.”</li>\n<li>“I couldn’t have graduated if it weren’t for this team.”</li>\n<li>“Just being a quadriplegic is a job in itself.”</li>\n<li>“It was my perspective that really fuelled me.”</li>\n<li>“Remind me not to complain about anything ever again.”</li>\n<li>“I think that’s very unhealthy when we dismiss our challenges.”</li>\n<li>“There are so many positives in our lives that we can be focusing on right now.”</li>\n<li>“If I could go back and change what happened to me on May 6 of 2017, I wouldn’t and I couldn’t, because…it has given me now the greatest purpose that I have in my life.”</li>\n<li>“I forgive him whether he is sorry or not.”</li>\n<li>“I’m either going to get out of this wheelchair one day or I’m going to die trying.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n \nLaura’s Social Media:\nInstagram:  <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\"> Laura's Instagram</a>\nFacebook:  <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\"> Laura's Facebook page</a>\n \nConnect with Robert:\n<a href=\"https://www.robertpaylor.com/\" rel=\"nofollow\">Robert's homepage</a>\n<a href=\"https://www.facebook.com/robertpaylor5\" rel=\"nofollow\">Robert's Facebook</a>\n<a href=\"https://twitter.com/robertpaylor\" rel=\"nofollow\">Robert's Twitter</a>\n<a href=\"https://www.instagram.com/rob.paylor/\" rel=\"nofollow\">Robert's Instagram</a></p>",
  "itunes:title": "Paralyzed to Powerful with Rugby Player Robert Paylor",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 38
}