{
  "title": "Gen Z is redefining global consumption. Can companies keep up?",
  "link": "https://e27.co/gen-z-is-redefining-global-consumption-can-companies-keep-up-20221101/",
  "dc:creator": "Hanh Vu",
  "pubDate": "Tue, 01 Nov 2022 05:00:31 +0000",
  "category": [
    "Events",
    "Indonesia",
    "Sponsored",
    "CleverTap",
    "Gen Z",
    "Roadshow",
    "The Big Leap",
    "The Big Leap Roadshow"
  ],
  "guid": "https://e27.co/?p=475431",
  "description": "<p>Born in the digital age, the Gen Z generation has never existed in a world without the Internet and social media.  With new technologies, insights from historical events, connecting with people from various cultures, and knowledge of the current political climate – Gen Z is turning out to be the most diverse and educated group [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/gen-z-is-redefining-global-consumption-can-companies-keep-up-20221101/\">Gen Z is redefining global consumption. Can companies keep up?</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"size-full wp-image-475434 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/11/pexels-cottonbro-4003773.jpg\" alt=\"CleverTap\" width=\"690\" height=\"390\" />\n<p><span style=\"font-weight: 400;\">Born in the digital age, the Gen Z generation has never existed in a world without the Internet and social media. </span></p>\n<p><span style=\"font-weight: 400;\">With new technologies, insights from historical events, connecting with people from various cultures, and knowledge of the current political climate – Gen Z is turning out to be the most diverse and educated group of individuals who have witnessed some of the most turbulent periods in recent history such as the Great Recession in 2008 and most recently, the COVID-19 pandemic.</span></p>\n<p><span style=\"font-weight: 400;\">These world events shaped Gen Z&#8217;s world views and perspectives, giving them a strong sense of being global citizens and prioritising different values.</span></p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/seas-mobile-first-population-are-spending-all-their-time-on-mobile-phones-are-you-20221020/\">SEA’s mobile-first population are spending all their time on mobile phones: Are you?</a></b></p>\n<p><span style=\"font-weight: 400;\">These views and perspectives directly influence their consumption behaviour. And as Gen Zs enter the prime time in their career, their purchasing power will increase substantially and their consumption behaviours will have a significant influence on the market.</span></p>\n<p><span style=\"font-weight: 400;\">By 2025, Gen Z will make up about 27 per cent of the global workforce, and would significantly if not completely change global consumption trends.</span></p>\n<h1><b>Individual expression and an ethical moral code as foundation</b></h1>\n<p><span style=\"font-weight: 400;\">Gen Zs highly value their own unique personal identity and individual expression, while constantly searching for the truth, finding ways to solve conflicts through dialogues and diplomacy, and emphasising ethical behaviours. The COVID-19 pandemic also helped redefine Gen Zs’ future aspirations and values, highlighting the importance of digital adoption, personal connections, and sustainability.</span></p>\n<p><span style=\"font-weight: 400;\">As working individuals, Gen Zs place more importance on benefits such as work-life balance, mental health care, remote/hybrid work establishments, and </span><a rel=\"follow\" href=\"https://www.talentlms.com/research/gen-z-workplace-statistics\"><span style=\"font-weight: 400;\">meaningful work assignments</span></a><span style=\"font-weight: 400;\"> in comparison to the previous generations. However, despite a growing emphasis on things like mobility, pursuing one’s dream job, as well as personal growth — competitive salary and compensation remain important factors to retain the Gen Z in the workplace.</span></p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/the-big-leap-bringing-retention-best-practices-across-sea-20221012/\">The Big Leap: Bringing retention best practices across SEA</a></b></p>\n<p><span style=\"font-weight: 400;\">As consumers, Gen Zs put a premium on lifestyle and individual expression — to be themselves, rather than make purchases designed simply for physical needs. Consequently, their purchasing decision is more likely to reflect their values, not brand loyalty. Brands will therefore find it much harder to retain </span><a rel=\"follow\" href=\"https://www.forbes.com/sites/forbesagencycouncil/2022/08/10/3-things-you-need-to-know-about-gen-z-and-brand-loyalty/?sh=4075afefc4f2\"><span style=\"font-weight: 400;\">Gen Zs loyalty</span></a>.</p>\n<p><span style=\"font-weight: 400;\">They are also conscious of the impact of their consumption and demand that marketers stick to their promises and uphold ethical practices.</span></p>\n<p><span style=\"font-weight: 400;\">Gen Zs utilise different channels to gain information and learn about new products. They are likelier to engage with brands endorsed by influencers. They discover and connect with their favourite brands and products via social media platforms. And they make purchases with their </span><a rel=\"follow\" href=\"https://www.apptus.com/blog/generation-z-online-shopping-habits/\"><span style=\"font-weight: 400;\">mobile apps or e-commerce platforms</span></a>.</p>\n<p><span style=\"font-weight: 400;\">For Gen Z personalised recommendations from trusted individuals and entities are more likely to influence their purchase behaviour.</span></p>\n<h2><b>Discover more about the Gen Z and other new and unexpected markets with CleverTap’s The Big Leap Roadshow in Indonesia</b></h2>\n<p><span style=\"font-weight: 400;\">As countries emerge out of the COVID-19 pandemic and settle into the new normal, it is time we change, learn, unlearn and relearn the market’s growth story: tapping into the vast potential of the vibrant Gen Z market and winning the new generation of customers’ trust and satisfaction.</span></p>\n<p><span style=\"font-weight: 400;\">The Big Leap Roadshow’s special panel discussion aptly titled, </span><i><span style=\"font-weight: 400;\">Retention Playbook: Gen Z and unexpected segments in the new normal</span></i><span style=\"font-weight: 400;\">, is a collaborative event between </span><b>e27</b><span style=\"font-weight: 400;\"> and </span><b>CleverTap</b><span style=\"font-weight: 400;\"> happening at The Big Leap Roadshow in Indonesia. The programme will bring together experts in the market who have managed to leverage crises to achieve new heights and get ready for the next level of growth in 2023. </span></p>\n<p><span style=\"font-weight: 400;\">Through the event, the participants will have access to over 12 on-ground sessions with industry experts and brand custodians deep diving into customer journeys and how brands can create customised solutions to retain them. Leaders in the industry will discuss strategies to scale businesses by increasing the revisits and repurchases from returning customers. Marketers will also learn about what tools and technology can help them create solutions that will attract customers and keep them coming back, cultivating a culture of brand loyalty.</span></p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/how-this-cutting-edge-technology-helps-fortify-your-crypto-security-20221010/\">How this cutting-edge technology helps fortify your crypto security</a></b></p>\n<p><span style=\"font-weight: 400;\">A significant portion of the panel discussion will be dedicated to uncovering the characteristics of Gen Zs and other unconventional segments as focal customers and learning how to convert them into frequent and loyal customers. The sharing can inspire participating business leaders, entrepreneurs, and investors to think outside the box and learn from the best practices in their corresponding sectors, generating new product and service ideas to serve Gen Z customers.</span></p>\n<p><span style=\"font-weight: 400;\">Marc-Antoine Hager, CleverTap’s Regional Vice President for Sales in Southeast Asia, is one of the panellists and  will share the company’s mission and its successful journey  even during the most challenging global economic situation. </span></p>\n<p><span style=\"font-weight: 400;\">The Big Leap Roadshow in Indonesia will provide business leaders and entrepreneurs from one of Southeast Asia’s largest economies with valuable opportunities to network with over 100 like-minded entrepreneurs, key thought leaders, and investors. </span></p>\n<p><span style=\"font-weight: 400;\">Participants will learn first-hand about success stories in customer retention and how to craft innovative customer experiences. Want to find out about new trends in the industry to learn how to align your strategies with customer preferences and adapt to the changing market context? Join us at the the Big Leap happening on November 9th, </span><span style=\"font-weight: 400;\">2022 in Jakarta.</span></p>\n<p><span style=\"font-weight: 400;\">To sign up for the event, click <a rel=\"follow\" href=\"https://e27.co/clevertap/event/jakarta/?utm_source=e27&utm_medium=article&utm_campaign=TheBigLeap_Jakarta\">here</a>.</span></p>\n<p>—</p>\n<p>Photo by <a rel=\"follow\" href=\"https://www.pexels.com/photo/woman-in-white-shirt-holding-her-face-4003773/\">cottonbro</a> from <a rel=\"follow\" href=\"https://www.pexels.com/\">Pexels</a></p>\n<p>&#8211; &#8211;</p>\n<p>This article is produced by the <b>e27</b> team, sponsored by CleverTap</p>\n<p>We can share your story at <b>e27</b>, too. Engage the Southeast Asian tech ecosystem by bringing your story to the world. Visit us at <a rel=\"follow\" href=\"https://e27.co/advertise?utm_source=e27&utm_medium=boilerplate&utm_campaign=lead_gen\">e27.co/advertise</a> to get started.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/gen-z-is-redefining-global-consumption-can-companies-keep-up-20221101/\">Gen Z is redefining global consumption. Can companies keep up?</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}