{
  "title": "Meet Google Cloud at Supercomputing 2022",
  "link": "https://cloud.google.com/blog/topics/hpc/meet-google-cloud-at-supercomputing-2022/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Google Cloud is excited to announce our participation in the <a href=\"https://sc22.supercomputing.org/\" target=\"_blank\">Supercomputing 2022</a> (SC22) conference in Dallas, TX from November 13th - 18th, 2022. Supercomputing is the premier conference for High Performance Computing and is a great place to see colleagues, learn about the latest technologies, and meet with vendors, partners and HPC users. We’re looking forward to returning to Supercomputing fully for the first time since 2019 with a booth, talks, demos, labs, and much more.</p><p>We’re excited to invite you to meet Google’s architects and experts in <a href=\"https://hallerickson.ungerboeck.com/prod/app85.cshtml?AppCode=VFP&amp;OrgCode=34&amp;EvtID=5025&amp;CC=SC22SM\" target=\"_blank\">booth #3210</a>, near the exhibit floor entrances. If you’re interested in sitting down with our HPC team for a private meeting, please let us know at <a href=\"mailto:hpc-sales@google.com\">hpc-sales@google.com</a>. Whether it’s your first time speaking with Google ever, or your first time seeing us at Supercomputing, we are looking forward to meeting with you. Bring your tough questions, and we’ll work together to solve them.</p><p>In the booth, we’ll have lab stations where you can get hands-on with Google Cloud labs covering topics ranging from HPC to Machine Learning and Quantum Computing. Come check out one of our demo stations to dive into the details of how Google Cloud and our partners can help handle your toughest workloads. We’ll also have a full schedule of talks from Google, Cloud HPC partners, and Google Cloud users hosted in our booth theater.</p><p>Be sure to visit our booth to review our full booth talk schedule. Here is a sneak peak at a few talks and speakers we have scheduled:</p><ul><li><p>Using GKE as a Supercomputer - Louis Bailleul, Petroleum Geo-Services</p></li><li><p>Google Cloud HPC Toolkit - Carlos Boneti, Google Cloud</p></li><li><p>Michael Wilde, <a href=\"https://edu.google.com/intl/ALL_us/why-google/customer-stories/parallel-works-gcp/\" target=\"_blank\">Parallel Works</a></p></li><li><p>Suresh Andani, Sr. Director, AMD</p></li><li><p>Quantum Computing at Google - Kevin Kissell, Google Cloud</p></li><li><p>Tensor Processing Units (TPUs) on Slurm - Nick Ihli, SchedMD</p></li><li><p><a href=\"https://womeninhpc.org/\" target=\"_blank\">Women in HPC Panel</a> - Cristin Merritt, Women in HPC; Annie Ma-Weaver, Google Cloud</p></li><li><p><a href=\"https://docs.daos.io/v2.0/QSG/cloud/\" target=\"_blank\">DAOS on GCP</a> - Margaret Lawson, Google Cloud; Dean Hildebrand, Google Cloud</p></li></ul><p>There will also be talks, tutorials, and other events hosted by Google staff throughout the conference, including:</p><ul><li><p>Tutorial: Parallel I/O in Practice, Co-hosted by Brent Welch</p></li><li><p>Exhibitor Forum Talk: HPC Best Practices on Google Cloud, Hosted by Ilias Katsardis</p></li><li><p>Storage events co-organized by Dean Hildebrand, including:</p></li><ul><li><p><a href=\"https://sc22.supercomputing.org/presentation/?id=bof124&amp;sess=sess331\" target=\"_blank\">IO500 Birds of a Feather</a> (List of top HPC storage systems)</p></li><li><p><a href=\"https://sc22.supercomputing.org/presentation/?id=bof147&amp;sess=sess357\" target=\"_blank\">DAOS</a> Birds of a Feather (Emerging HPC Storage System)</p></li><li><p>DAOS on GCP talk in the Intel booth</p></li><li><p>Keynote by Arif Merchant at the <a href=\"http://www.pdsw.org/index.shtml\" target=\"_blank\">Parallel Data Systems Workshop</a></p></li></ul><li><p><a href=\"https://sc22.supercomputing.org/presentation/?id=bof200&amp;sess=sess470\" target=\"_blank\">Converged Computing: Bringing Together the HPC and Cloud Communities BoF</a>, Bill Magro - Panelist</p></li><li><p><a href=\"https://sc22.supercomputing.org/presentation/?id=bof117&amp;sess=sess344\" target=\"_blank\">Ethics in HPC BoF</a>co-organized by Margaret Lawson</p></li><li><p><a href=\"https://rescale.com/lp/sc22-cloud-hpc-event/\" target=\"_blank\">Cloud operating model: Challenges and opportunities</a>, Annie Ma-Weaver - Panelist</p></li></ul><p>Google Cloud is also excited to sponsor Women in HPC at SC22, and we look forward to seeing you at the <a href=\"https://womeninhpc.org/events/sc-2022-networking-reception\" target=\"_blank\">Women in HPC Networking Reception</a>, the <a href=\"https://womeninhpc.org/events/sc-2022/sc-2022-workshop\" target=\"_blank\">WHPC Workshop</a>, and <a href=\"https://womeninhpc.org/events/sc-2022-diversity-day\" target=\"_blank\">Diversity Day</a>.</p><p>If you’ll be attending Supercomputing, reach out to your Google account manager or the <a href=\"mailto:hpc-sales@google.com\">HPC team</a> to let us know. We look forward to seeing you there.</p></div></div></body></html>",
  "pubDate": "Tue, 01 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/hpc/meet-google-cloud-at-supercomputing-2022/",
  "category": [
    "Compute",
    "Google Cloud",
    "HPC"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Meet Google Cloud at Supercomputing 2022",
    "description": "Find out all the details on Google Cloud’s presence at the Supercomputing 2022 conference.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/google_cloud_E2p3eed.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/hpc/meet-google-cloud-at-supercomputing-2022/"
  },
  "author": {
    "name": "Wyatt Gorman",
    "title": "HPC Solutions Manager, Google Cloud",
    "department": "",
    "company": ""
  }
}