{
  "title": "Episode 134: &#8220;In the Midnight Hour&#8221; by Wilson Pickett",
  "link": "https://500songs.com/podcast/episode-134-in-the-midnight-hour-by-wilson-pickett/",
  "pubDate": "Wed, 13 Oct 2021 01:41:55 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=897",
  "description": "Episode 134 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “In the Midnight Hour\", the links between Stax, Atlantic, and Detroit, and the career of Wilson Pickett. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/57335552\">on \"Mercy Mercy\" by Don Covay</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\nI say “After Arthur Alexander had moved on to Monument Records” – I meant to say “Dot Records” here, the label that Alexander moved to *before* Monument.\nI also misspeak at one point and say \"keyboard player Chips Moman\", when I mean to say \"keyboard player Spooner Oldham\". This is correct in the transcript/script, I just misread it.\n<strong>Resources</strong>\n\nNo Mixcloud this week, as there are too many songs by Pickett.\n\nThe main resource I used for the biographical details of Wilson Pickett was <em><a href=\"https://amzn.to/2X63Sai\">In the Midnight Hour: The Life and Soul of Wilson Pickett</a>.</em>\n\nInformation about Stax comes primarily from two books: <a href=\"https://amzn.to/3nPGLZp\"><em>Soulsville USA: The Story of Stax</em> by Rob Bowman</a>, and <a href=\"https://amzn.to/3ftoePF\"><em>Respect Yourself: Stax Records and the Soul Explosion</em> by Robert Gordon</a>.\n\n<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L Hughes</a> is a great overview of the soul music made in Muscle Shoals, Memphis, and Nashville in the sixties.\n\nThe episodes of Cocaine and Rhinestones I reference are the ones on <a href=\"https://cocaineandrhinestones.com/owen-bradley-nashville-sound\">Owen Bradley</a> and <a href=\"https://cocaineandrhinestones.com/nashville-a-team\">the Nashville A-Team</a>.\n\nAnd information on the Falcons comes from <a href=\"http://www.uncamarvy.com/Falcons/falcons.html\">Marv Goldberg</a>.\n\nPickett's complete Atlantic albums can be found in <a href=\"https://amzn.to/3Dy3kJW\">this excellent ten-CD set</a>. For those who just want the hits, <a href=\"https://amzn.to/2YHqVt1\">this single-CD compilation</a> is significantly cheaper.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nA quick note before I start, just to say that this episode contains some discussion of domestic abuse, drug use, and abuse of employees by their employer, and one mention of an eating disorder. Also, this episode is much longer than normal, because we've got a lot to fit in.\n\nToday we're going to move away from Motown, and have a look at a record recorded in the studios of their great rival Stax records, though not released on that label. But the record we're going to look at is from an artist who was a bridge between the Detroit soul of Motown and the southern soul of Stax, an artist who had a foot in both camps, and whose music helped to define soul while also being closer than that of any other soul man to the music made by the white rock musicians of the period.\n\nWe're going to look at Stax, and Muscle Shoals, and Atlantic Records, and at Wilson Pickett and \"In the Midnight Hour\"\n\n[Excerpt: Wilson Pickett: \"In the Midnight Hour\"]\n\nWilson Pickett never really had a chance. His father, Wilson senior, was known in Alabama for making moonshine whisky, and spent time in prison for doing just that -- and his young son was the only person he told the location of his still. Eventually, Wilson senior moved to Detroit to start earning more money, leaving his family at home at first. Wilson junior and his mother moved up to Detroit to be with his father, but they had to leave his older siblings in Alabama, and his mother would shuttle between Michigan and Alabama, trying vainly to look after all her children.\n\nEventually, Wilson's mother got pregnant while she was down in Alabama, which broke up his parents' marriage, and Wilson moved back down to Alabama permanently, to live on a farm with his mother. But he never got on with his mother, who was physically abusive to him -- as he himself would later be to his children, and to his partners, and to his bandmates.\n\nThe one thing that Wilson did enjoy about his life in Alabama was the gospel music, and he became particularly enamoured of two gospel singers, Archie Brownlee of the Five Blind Boys of Mississippi:\n\n[Excerpt: The Mississippi Blind Boys, \"Will My Jesus Be Waiting?\"]\n\nAnd Julius Cheeks of the Sensational Nightingales:\n\n[Excerpt: The Sensational Nightingales, \"God's World Will Never Pass Away\"]\n\nWilson determined to become a gospel singer himself, but he couldn't stand living with his mother in rural Alabama, and decided to move up to be with his father and his father's new girlfriend in Detroit.  Once he moved to Detroit, he started attending Northwestern High School, which at the time was also being attended by Norman Whitfield, Florence Ballard, and Melvin Franklin.\n\nPickett also became friendly with Aretha Franklin, though she didn't attend the same school -- she went to school at Northern, with Smokey Robinson -- and he started attending services at New Bethel Church, the church where her father preached. This was partly because Rev. Franklin was one of the most dynamic preachers around, but also because New Bethel Church would regularly feature performances by the most important gospel performers of the time -- Pickett saw the Soul Stirrers perform there, with Sam Cooke singing lead, and of course also saw Aretha singing there.\n\nHe joined a few gospel groups, first joining one called the Sons of Zion, but he was soon poached by a more successful group, the Violinaires. It was with the Violinaires that he made what is almost certainly his first recording -- a track that was released as a promo single, but never got a wide release at the time:\n\n[Excerpt: The Violinaires, \"Sign of the Judgement\"]\n\nThe Violinaires were only moderately successful on the gospel circuit, but Pickett was already sure he was destined for bigger things. He had a rivalry with David Ruffin, in particular, constantly mocking Ruffin and saying that he would never amount to anything, while Wilson Pickett was the greatest.\n\nBut after a while, he realised that gospel wasn't where he was going to make his mark. Partly his change in direction was motivated by financial concern -- he'd physically attacked his father and been kicked out of his home, and he was also married while still a teenager, and had a kid who needed feeding. But also, he was aware of a certain level of hypocrisy among his more religious acquaintances. Aretha Franklin had two kids, aged only sixteen, and her father, the Reverend Franklin, had fathered a child with a twelve-year-old, was having an affair with the gospel singer Clara Ward, and was hanging around blues clubs all the time.\n\nMost importantly, he realised that the audiences he was singing to in church on Sunday morning were mostly still drunk from Saturday night. As he later put it \"I might as well be singing rock ’n’ roll as singing to a drunken audience. I might as well make me some money.\"\n\nAnd this is where the Falcons came in. The Falcons were a doo-wop group that had been formed by a Black singer, Eddie Floyd, and a white singer, Bob Manardo. They'd both recruited friends, including bass singer Willie Schofield, and after performing locally they'd decided to travel to Chicago to audition for Mercury Records. When they got there, they found that you couldn't audition for Mercury in Chicago, you had to go to New York, but they somehow persuaded the label to sign them anyway -- in part because an integrated group was an unusual thing.\n\nThey recorded one single for Mercury, produced by Willie Dixon who was moonlighting from Chess:\n\n[Excerpt: The Falcons, \"Baby That's It\"]\n\nBut then Manardo was drafted, and the group's other white member, Tom Shetler, decided to join up along with him. The group went through some other lineup changes, and ended up as Eddie Floyd, Willie Schofield, Mack Rice, guitarist Lance Finnie, and lead singer Joe Stubbs, brother of Levi.\nThe group released several singles on small labels owned by their manager, before having a big hit with \"You're So Fine\", the record we heard about them recording last episode:\n\n[Excerpt: The Falcons, \"You're So Fine\"]\n\nThat made number two on the R&B charts and number seventeen on the pop charts. They recorded several follow-ups, including \"Just For Your Love\", which made number 26 on the R&B charts:\n\n[Excerpt: The Falcons, \"Just For Your Love\"]\n\nTo give you some idea of just how interrelated all the different small R&B labels were at this point, that was originally recorded and released on Chess records. But as Roquel Davis was at that point working for Chess, he managed to get the rights to reissue it on Anna Records, the label he co-owned with the Gordy sisters -- and the re-released record was distributed by Gone Records, one of George Goldner's labels. The group also started to tour supporting Marv Johnson.\n\nBut Willie Schofield was becoming dissatisfied. He'd written \"You're So Fine\", but he'd only made $500 from what he was told was a million-selling record. He realised that in the music business, the real money was on the business side, not the music side, so while staying in the Falcons he decided he was going to go into management too.\n\nHe found the artist he was going to manage while he was walking to his car, and heard somebody in one of the buildings he passed singing Elmore James' then-current blues hit \"The Sky is Crying\":\n\n[Excerpt: Elmore James, \"The Sky is Crying\"]\n\nThe person he heard singing that song, and accompanying himself on acoustic guitar, was of course Wilson Pickett, and Schofield signed him up to a management contract -- and Pickett was eager to sign, knowing that Schofield was a successful performer himself.\n\nThe intention was at first that Schofield would manage Pickett as a solo performer, but then Joe Stubbs got ideas above his station, and started insisting that the group be called \"Joe Stubbs and the Falcons\", which put the others' backs up, and soon Stubbs was out of the group. This experience may have been something that his brother later had in mind -- in the late sixties, when Motown started trying to promote groups as Lead Singer and The Group, Levi Stubbs always refused to allow his name to go in front of the Four Tops.\n\nSo the Falcons were without a lead singer. They tried a few other singers in their circle, including Marvin Gaye, but were turned down. So in desperation, they turned to Pickett. This wasn't a great fit -- the group, other than Schofield, thought that Pickett was \"too Black\", both in that he had too much gospel in his voice, and literally in that he was darker-skinned than the rest of the group (something that Schofield, as someone who was darker than the rest of the group but less dark than Pickett, took offence at). Pickett, in turn, thought that the Falcons were too poppy, and not really the kind of thing he was at all interested in doing.\n\nBut they were stuck with each other, and had to make the most of it, even though Pickett's early performances were by all accounts fairly dreadful. He apparently came in in the wrong key on at least one occasion, and another time froze up altogether and couldn't sing. Even when he did sing, and in tune, he had no stage presence, and he later said “I would trip up, fall on the stage and the group would rehearse me in the dressing room after every show. I would get mad, ‘cos I wanted to go out and look at the girls as well! They said, ‘No, you got to rehearse, Oscar.’ They called me Oscar. I don’t know why they called me Oscar, I didn’t like that very much.”\n\nSoon, Joe Stubbs was back in the group, and there was talk of the group getting rid of Pickett altogether. But then they went into the studio to record a song that Sam Cooke had written for the group, \"Pow! You're in Love\". The song had been written for Stubbs to sing, but at the last minute they decided to give Pickett the lead instead:\n\n[Excerpt: The Falcons, \"Pow! You're in Love\"]\n\nPickett was now secure as the group's lead singer, but the group weren't having any success with records. They were, though, becoming a phenomenal live act -- so much so that on one tour, where James Brown was the headliner, Brown tried to have the group kicked off the bill, because he felt that Pickett was stealing his thunder.\n\nEventually, the group's manager set up his own record label, Lu Pine Records, which would become best known as the label that released the first record by the Primettes, who later became the Supremes.  Lu Pine released the Falcons' single \"I Found a Love\",   after the group's management had first shopped it round to other labels to try to get them to put it out:\n\n[Excerpt: The Falcons, \"I Found a Love\"]\n\nThat song, based on the old Pentecostal hymn \"Yes Lord\", was written by Pickett and Schofield, but the group's manager, Robert West, also managed to get his name on the credits. The backing group, the Ohio Untouchables, would later go on to become better known as The Ohio Players.\n\nOne of the labels that had turned that record down was Atlantic Records, because Jerry Wexler hadn't heard any hit potential in the song. But then the record started to become successful locally, and Wexler realised his mistake. He got Lu Pine to do a distribution deal with Atlantic, giving Atlantic full rights to the record, and it became a top ten R&B hit.\n\nBut by this point, Pickett was sick of working with the Falcons, and he'd decided to start trying for a solo career. His first solo single was on the small label Correc-Tone, and was co-produced by Robert Bateman, and featured the Funk Brothers as instrumental backing, and the Primettes on vocals. I've seen some claims that the Andantes are on there too, but I can't make them out -- but I can certainly make out the future Supremes:\n\n[Excerpt: Wilson Pickett, \"Let Me Be Your Boy\"]\n\nThat didn't do anything, and Pickett kept recording with the Falcons for a while, as well as putting out his solo records. But then Willie Schofield got drafted, and the group split up. Their manager hired another group, The Fabulous Playboys, to be a new Falcons group, but in 1964 he got shot in a dispute over the management of Mary Wells, and had to give up working in the music industry.\n\nPickett's next single, which he co-wrote with Robert Bateman and Sonny Schofield, was to be the record that changed his career forever. \"If You Need Me\" once again featured the Funk Brothers and the Andantes, and was recorded for Correc-Tone:\n\n[Excerpt: Wilson Pickett, \"If You Need Me\"]\n\nJerry Wexler was again given the opportunity to put the record out on Atlantic, and once again decided against it. Instead, he offered to buy the song's publishing, and he got Solomon Burke to record it, in a version produced by Bert Berns:\n\n[Excerpt: Solomon Burke, \"If You Need Me\"]\n\nBurke wasn't fully aware, when he cut that version, that Wilson Pickett, who was his friend, had recorded his own version. He became aware, though, when Double-L Records, a label co-owned by Lloyd Price, bought the Correc-Tone master and released Pickett's version nationally, at the same time as Burke's version came out.\n\nThe two men were annoyed that they'd been put into unwitting competition, and so started an unofficial nonaggression pact -- every time Burke was brought into a radio station to promote his record, he'd tell the listeners that he was there to promote Wilson Pickett's new single. Meanwhile, when Pickett went to radio stations, he'd take the opportunity to promote the new record he'd written for his good friend Solomon Burke, which the listeners should definitely check out.\n\nThe result was that both records became hits -- Pickett's scraped the lower reaches of the R&B top thirty, while Burke, as he was the bigger star, made number two on the R&B chart and got into the pop top forty. Pickett followed it up with a soundalike, \"It's Too Late\", which managed to make the R&B top ten as there was no competition from Burke.\n\nAt this point, Jerry Wexler realised that he'd twice had the opportunity to release a record with Wilson Pickett singing, twice he'd turned the chance down, and twice the record had become a hit. He realised that it was probably a good idea to sign Pickett directly to Atlantic and avoid missing out. He did check with Pickett if Pickett was annoyed about the Solomon Burke record -- Pickett's response was \"I need the bread\", and Wilson Pickett was now an Atlantic artist.\n\nThis was at the point when Atlantic was in something of a commercial slump -- other than the records Bert Berns was producing for the Drifters and Solomon Burke, they were having no hits, and they were regarded as somewhat old-fashioned, rooted in a version of R&B that still showed its roots in jazz, rather than the new sounds that were taking over the industry in the early sixties. But they were still a bigger label than anything else Pickett had recorded for, and he seized the opportunity to move into the big time.\nTo start with, Atlantic teamed Pickett up with someone who seemed like the perfect collaborator -- Don Covay, a soul singer and songwriter who had his roots in hard R&B and gospel music but had written hits for people like Chubby Checker.  The two got together and recorded a song they wrote together, \"I'm Gonna Cry (Cry Baby)\":\n\n[Excerpt: Wilson Pickett, \"I'm Gonna Cry (Cry Baby)\"]\n\nThat did nothing commercially -- and gallingly for Pickett, on the same day, Atlantic released a single Covay had written for himself, \"Mercy Mercy\", and that ended up going to number one on the R&B chart and making the pop top forty.\n\nAs \"I'm Gonna Cry\" didn't work out, Atlantic decided to try to change tack, and paired Pickett with their established hitmaker Bert Berns, and a duet partner, Tami Lyn, for what Pickett would later describe as \"one of the weirdest sessions on me I ever heard in my life\", a duet on a Mann and Weil song, \"Come Home Baby\":\n\n[Excerpt: Wilson Pickett and Tami Lyn, \"Come Home Baby\"]\n\nPickett later said of that track, \"it didn't sell two records\", but while it wasn't a hit, it was very popular among musicians -- a few months later Mick Jagger would produce a cover version of it on Immediate Records, with Ronnie Wood, Keith Richards, and the Georgie Fame brass section backing a couple of unknown singers:\n\n[Excerpt: Rod Stewart and P.P. Arnold, \"Come Home Baby\"]\n\nSadly for Rod Stewart and P.P. Arnold, that didn't get past being issued as a promotional record, and never made it to the shops.\n\nMeanwhile, Pickett went out on tour again, substituting on a package tour for Clyde McPhatter, who had to drop out when his sister died. Also on the tour was Pickett's old bandmate from the Falcons, Mack Rice, now performing as Sir Mack Rice, who was promoting a single he'd just released on a small label, which had been produced by Andre Williams. The song had originally been called \"Mustang Mama\", but Aretha Franklin had suggested he call it \"Mustang Sally\" instead:\n\n[Excerpt: Sir Mack Rice, \"Mustang Sally\"]\n\nPickett took note of the song, though he didn't record it just yet -- and in the meantime, the song was picked up by the white rock group The Young Rascals, who released their version as the B-side of their number one hit, \"Good Lovin'\":\n\n[Excerpt: The Young Rascals, \"Mustang Sally\"]\n\nAtlantic's problems with having hits weren't only problems with records they made themselves -- they were also having trouble getting any big hits with Stax records. As we discussed in the episode on \"Green Onions\", Stax were being distributed by Atlantic, and in 1963 they'd had a minor hit with \"These Arms of Mine\" by Otis Redding:\n\n[Excerpt: Otis Redding, \"These Arms of Mine\"]\n\nBut throughout 1964, while the label had some R&B success with its established stars, it had no real major breakout hits, and it seemed to be floundering a bit -- it wasn't doing as badly as Atlantic itself, but it wasn't doing wonderfully. It wasn't until the end of the year when the label hit on what would become its defining sound, when for the first time Redding collaborated with Stax studio guitarist and producer Steve Cropper on a song:\n\n[Excerpt: Otis Redding, \"Mr. Pitiful\"]\n\nThat record would point the way towards Redding's great artistic triumphs of the next couple of years, which we'll look at in a future episode. But it also pointed the way towards a possible future sound for Atlantic.\n\nAtlantic had signed a soul duo, Sam & Dave, who were wonderful live performers but who had so far not managed to translate those live performances to record. Jerry Wexler thought that perhaps Steve Cropper could help them do that, and made a suggestion to Jim Stewart at Stax -- Atlantic would loan out Sam & Dave to the label. They'd remain signed to Atlantic, but make their records at Stax studios, and they'd be released as Stax records.\n\nTheir first single for Stax, \"A Place Nobody Can Find\", was produced by Cropper, and was written by Stax songwriter Dave Porter:\n\n[Excerpt: Sam and Dave, \"A Place Nobody Can Find\"]\n\nThat wasn't a hit, but soon Porter would start collaborating with another songwriter, Isaac Hayes, and would write a string of hits for the duo.\n\nBut in order to formalise the loan-out of Sam and Dave, Atlantic also wanted to formalise their arrangement with Stax. Previously they'd operated on a handshake basis -- Wexler and Stewart had a mutual respect, and they simply agreed that Stax would give Atlantic the option to distribute their stuff. But now they entered into a formal, long-term contract, and for a nominal sum of one dollar, Jim Stewart gave Atlantic the distribution rights to all past Stax records and to all future records they released for the next few years.\n\nOr at least, Stewart *thought* that the agreement he was making was formalising the distribution agreement. What the contract actually said -- and Stewart never bothered to have this checked over by an entertainment lawyer, because he trusted Wexler -- was that Stax would, for the sum of one dollar, give Atlantic *permanent ownership* of all their records, in return. The precise wording was \"You hereby sell, assign and transfer to us, our successors or assigns, absolutely and forever and without any limitations or restrictions whatever, not specifically set forth herein, the entire right, title and interest in and to each of such masters and to each of the performances embodied thereon.\"\n\nJerry Wexler would later insist that he had no idea that particular clause was in the contract, and that it had been slipped in there by the lawyers. Jim Stewart still thought of himself as the owner of an independent record label, but without realising it he'd effectively become an employee of Atlantic.\nAtlantic started to take advantage of this new arrangement by sending other artists down to Memphis to record with the Stax musicians. Unlike Sam and Dave, these would still be released as Atlantic records rather than Stax ones, and Jerry Wexler and Atlantic's engineer Tom Dowd would be involved  in the production, but the records would be made by the Stax team.\n\nThe first artist to benefit from this new arrangement was Wilson Pickett, who had been wanting to work at Stax for a while, being a big fan of Otis Redding in particular. Pickett was teamed up with Steve Cropper, and together they wrote the song that would define Pickett's career.\n\nThe seeds of \"In the Midnight Hour\" come from two earlier recordings. One is a line from his record with the Falcons, \"I Found a Love\":\n\n[Excerpt: The Falcons, \"I Found a Love\"]\n\nThe other is a line from a record that Clyde McPhatter had made with Billy Ward and the Dominoes back in 1951:\n\n[Excerpt: Billy Ward and the Dominoes, \"Do Something For Me\"]\n\nThose lines about a \"midnight hour\" and \"love come tumbling down\" were turned into the song that would make Pickett's name, but exactly who did what has been the cause of some disagreement. The official story is that Steve Cropper took those lines and worked with Pickett to write the song, as a straight collaboration.\n\nMost of the time, though, Pickett would claim that he'd written the song entirely by himself, and that Cropper had stolen the credit for that and their other credited collaborations. But other times he would admit \"He worked with me quite a bit on that one\".\n\nFloyd Newman, a regular horn player at Stax, would back up Pickett, saying \"Every artist that came in here, they’d have their songs all together, but when they leave they had to give up a piece of it, to a certain person. But this person, you couldn’t be mad at him, because he didn’t own Stax, Jim Stewart owned Stax. And this guy was doing what Jim Stewart told him to do, so you can’t be mad at him.\"\n\nBut on the other hand, Willie Schofield, who collaborated with Pickett on \"I Found a Love\", said of writing that \"Pickett didn’t have any chord pattern. He had a couple of lyrics. I’m working with him, giving him the chord change, the feel of it. Then we’re going in the studio and I’ve gotta show the band how to play it because we didn’t have arrangers. That’s part of the songwriting. But he didn’t understand. He felt he wrote the lyrics so that’s it.\"\n\nGiven that Cropper didn't take the writing credit on several other records he participated in, that he did have a consistent pattern of making classic hit records, that \"In the Midnight Hour\" is stylistically utterly different from Pickett's earlier work but very similar to songs like \"Mr. Pitiful\" cowritten by Cropper, and Pickett's longstanding habit of being dismissive of anyone else's contributions to his success, I think the most likely version of events is that Cropper did have a lot to do with how the song came together, and probably deserves his credit, but we'll never know for sure exactly what went on in their collaboration.\nWhoever wrote it, \"In the Midnight Hour\" became one of the all-time classics of soul:\n\n[Excerpt: Wilson Pickett, \"In the Midnight Hour\"]\n\nBut another factor in making the record a success -- and in helping reinvent the Stax sound -- was actually Jerry Wexler. Wexler had started attending sessions at the Stax studios, and was astonished by how different the recording process was in the South.\n\nAnd Wexler had his own input into the session that produced \"In the Midnight Hour\".\n\nHis main suggestion was that rather than play the complicated part that Cropper had come up with, the guitarist should simplify, and just play chords along with Al Jackson's snare drum. Wexler was enthusing about a new dance craze called the Jerk, which had recently been the subject of a hit record by a group called the Larks:\n\n[Excerpt: The Larks, \"The Jerk\"]\n\nThe Jerk, as Wexler demonstrated it to the bemused musicians, involved accenting the second and fourth beats of the bar, and delaying them very slightly. And this happened to fit very well with the Stax studio sound.\n\nThe Stax studio was a large room, with quite a lot of reverb, and the musicians played together without using headphones, listening to the room sound. Because of this, to stay in time, Steve Cropper had started taking his cue not just from the sound, but from watching Al Jackson's left hand going to the snare drum. This had led to him playing when he saw Jackson's hand go down on the two and four, rather than when the sound of the snare drum reached his ears -- a tiny, fraction-of-a-second, anticipation of the beat, before everyone would get back in sync on the one of the next bar, as Jackson hit the kick drum. This had in turn evolved into the whole group playing the backbeat with a fractional delay, hitting it a tiny bit late -- as if you're listening to the echo of those beats rather than to the beat itself.\n\nIf anyone other than utterly exceptional musicians had tried this, it would have ended up as a car crash, but Jackson was one of the best timekeepers in the business, and many musicians would say that at this point in time Steve Cropper was *the* best rhythm guitarist in the world, so instead it gave the performances just enough sense of looseness to make them exciting.\n\nThis slight delayed backbeat was something the musicians had naturally fallen into doing, but it fit so well with Wexler's conception of the Jerk that they started deliberately exaggerating it -- still only delaying the backbeat minutely, but enough to give the record a very different sound from anything that was out there:\n\n[Excerpt: Wilson Pickett, \"In the Midnight Hour\"]\n\nThat delayed backbeat sound would become the signature sound of Stax for the next several years, and you will hear it on the run of classic singles they would put out for the next few years by Otis Redding, Sam & Dave, Carla Thomas, Booker T. and the MGs, Eddie Floyd and others.\n\nThe sound of that beat is given extra emphasis by the utter simplicity of Al Jackson's playing. Jackson had a minimalist drum kit, but played it even more minimally -- other than the occasional fill, he never hit his tom at all, just using the kick drum, snare, and hi-hat -- and the hi-hat was not even miced, with any hi-hat on the actual records just being the result of leakage from the other mics. But that simplicity gave the Stax records a power that almost no other records from the period had:\n\n[Excerpt: Wilson Pickett, \"In the Midnight Hour\"]\n\n\"In the Midnight Hour\" made number one on the R&B charts, and made number twenty-one on the pop charts, instantly turning Pickett from an also-ran into one of the major stars of soul music. The follow-up, a soundalike called \"Don't Fight It\", also made the top five on the R&B charts.\n\nAt his next session, Pickett was reunited with his old bandmate Eddie Floyd. Floyd would soon go on to have his own hits at Stax, most notably with \"Knock on Wood\", but at this point he was working as a staff songwriter at Stax, coming up with songs like \"Comfort Me\" for Carla Thomas:\n\n[Excerpt: Carla Thomas, \"Comfort Me\"]\n\nFloyd had teamed up with Steve Cropper, and they'd been... shall we say, \"inspired\"... by a hit for the Marvelettes, \"Beechwood 45789\", written by Marvin Gaye, Gwen Gordy and Mickey Stevenson:\n\n[Excerpt: The Marvelettes, \"Beechwood 45789\"]\n\nCropper and Floyd had come up with their own song, \"634-5789\", which Pickett recorded, and which became an even bigger hit than \"In the Midnight Hour\", making number thirteen on the pop charts as well as being Pickett's second R&B number one:\n\n[Excerpt: Wilson Pickett, \"634-5789\"]\n\nAt the same session, they cut another single. This one was inspired by an old gospel song, \"Ninety-Nine and One Half Won't Do\", recorded by Sister Rosetta Tharpe among others:\n\n[Excerpt: Sister Rosetta Tharpe, \"Ninety-Nine and One Half Won't Do\"]\n\nThe song was rewritten by Floyd, Cropper, and Pickett, and was also a moderate R&B hit, though nowhere as big as \"634-5789\":\n\n[Excerpt: Wilson Pickett, \"Ninety-Nine and One Half Won't Do\"]\n\nThat would be the last single that Pickett recorded at Stax, though -- though the reasoning has never been quite clear. Pickett was, to put it as mildly as possible, a difficult man to work with, and he seems to have had some kind of falling out with Jim Stewart -- though Stewart always said that the problem was actually that Pickett didn't get on with the musicians. But the musicians disagree, saying they had a good working relationship -- Pickett was often an awful person, but only when drunk, and he was always sober in the studio.\n\nIt seems likely, actually, that Pickett's move away from the Stax studios was more to do with someone else -- Pickett's friend Don Covay was another Atlantic artist recording at Stax, and Pickett had travelled down with him when Covay had recorded \"See Saw\" there:\n\n[Excerpt: Don Covay, \"See Saw\"]\n\nEveryone involved agreed that Covay was an eccentric personality, and that he rubbed Jim Stewart up the wrong way. There is also a feeling among some that Stewart started to resent the way Stax's sound was being used for Atlantic artists, like he was \"giving away\" hits, even though Stax's company got the publishing on the songs Cropper was co-writing, and he was being paid for the studio time.\nEither way, after that session, Atlantic didn't send any of its artists down to Stax, other than Sam & Dave, who Stax regarded as their own artists. Pickett would never again record at Stax, and possibly coincidentally once he stopped writing songs with Steve Cropper he would also never again have a major hit record with a self-penned song.\n\nBut Jerry Wexler still wanted to keep working in Southern studios, and with Southern musicians, and so he took Pickett to FAME studios, in Muscle Shoals, Alabama.\n\nWe looked, back in the episode on Arthur Alexander, at the start of FAME studios, but after Arthur Alexander had moved on to Monument Records, Rick Hall had turned FAME into a home for R&B singers looking for crossover success. While Stax employed both Black and white musicians, FAME studios had an all-white rhythm section, with a background in country music, but that had turned out to be absolutely perfect for performers like the soul singer Joe Tex, who had himself started out in country before switching to soul, and who recorded classics like \"Hold What You Got\" at the studio:\n\n[Excerpt: Joe Tex, \"Hold What You Got\"]\n\nThat had been released on FAME's record label, and Jerry Wexler had been impressed and had told Rick Hall to call him the next time he thought he had a hit.\n\nWhen Hall did call Wexler, Wexler was annoyed -- Hall phoned him in the middle of a party. But Hall was insistent. \"You said to call you next time I've got a hit, and this is a number one\". Wexler relented and listened to the record down the phone. This is what he heard:\n\n[Excerpt: Percy Sledge, \"When a Man Loves a Woman\"]\n\nAtlantic snapped up \"When a Man Loves a Woman\" by Percy Sledge, and it went to number one on the pop charts -- the first record from any of the Southern soul studios to do so. In Wexler's eyes, FAME was now the new Stax.\n\nWexler had a bit of culture shock when working at FAME, as it was totally unlike anything he'd experienced before. The records he'd been involved with in New York had been mostly recorded by slumming jazz musicians, very technical players who would read the music from charts, and Stax had had Steve Cropper as de facto musical director, leading the musicians and working out their parts with them.\n\nBy contrast, the process used at FAME, and at most of the other studios in what Charles Hughes describes as the \"country-soul triangle\" of Memphis, Muscle Shoals, and Nashville, was the process that had been developed by Owen Bradley and the Nashville A-Team in Nashville (and for a fuller description of this, see the excellent episodes on Bradley and the A-Team in the great country music podcast Cocaine and Rhinestones). The musicians would hear a play through of the song by its writer, or a demo, would note down the chord sequences using the Nashville number system rather than a more detailed score, do a single run-through to get the balance right, and then record. Very few songs required a second take.\n\nFor Pickett's first session at FAME, and most subsequent ones, the FAME rhythm section of keyboard player Spooner Oldham, guitarist Jimmy Johnson, bass player Junior Lowe and drummer Roger Hawkins was augmented with a few other players -- Memphis guitarists Chips Moman and Tommy Cogbill, and the horn section who'd played on Pickett's Stax records, moonlighting.\n\nAnd for the first track they recorded there, Wexler wanted them to do something that would become a signature trick for Pickett over the next couple of years -- record a soul cover version of a rock cover version of a soul record. Wexler's thinking was that the best way for Pickett to cross over to a white audience was to do songs that were familiar to them from white pop cover versions, but songs that had originated in Pickett's soul style. At the time, as well, the hard backbeat sound on Pickett's hits was one that was more associated with white rock music than with soul, as was the emphasis on rhythm guitar. To modern ears, Pickett's records are almost the definition of soul music, but at the time they were absolutely considered crossover records.\n\nAnd so in the coming months Pickett would record cover versions of Don Covay's \"Mercy Mercy\", Solomon Burke's \"Everybody Needs Somebody to Love\", and Irma Thomas' \"Time is on My Side\", all of which had been previously covered by the Rolling Stones -- and two of which had their publishing owned by Atlantic's publishing subsidiary.\n\nFor this single, though, he was recording a song which had started out as a gospel-inspired dance song by the R&B singer Chris Kenner:\n\n[Excerpt: Chris Kenner, \"Land of a Thousand Dances\"]\n\nThat had been a minor hit towards the bottom end of the Hot One Hundred, but it had been taken up by a lot of other musicians, and become one of those songs everyone did as album filler -- Rufus Thomas had done a version at Stax, for example. But then a Chicano garage band called Cannibal and the Headhunters started performing it live, and their singer forgot the lyrics and just started singing \"na na na na\", giving the song a chorus it hadn't had in its original version. Their version, a fake-live studio recording, made the top thirty:\n\n[Excerpt: Cannibal and the Headhunters, \"Land of a Thousand Dances\"]\n\nPickett's version was drastically rearranged, and included a guitar riff that Chips Moman had come up with, some new lyrics that Pickett introduced, and a bass intro that Jerry Wexler came up with, a run of semiquavers that Junior Lowe found very difficult to play.\n\nThe musicians spent so long working on that intro that Pickett got annoyed and decided to take charge. He yelled \"Come on! One-two-three!\" and the horn players, with the kind of intuition that comes from working together for years, hit a chord in unison. He yelled \"One-two-three!\" again, and they hit another chord, and Lowe went into the bass part. They'd found their intro. They ran through that opening one more time, then recorded a take:\n\n[Excerpt: Wilson Pickett, \"Land of a Thousand Dances\"]\n\nAt this time, FAME was still recording live onto a single-track tape, and so all the mistakes were caught on tape with no opportunity to fix anything, like when all but one of the horn players forget to come in on the first line of one verse:\n\n[Excerpt: Wilson Pickett, \"Land of a Thousand Dances\"]\n\nBut that kind of mistake only added to the feel of the track, which became Pickett's biggest hit yet -- his third number one on the R&B chart, and his first pop top ten.\n\nAs the formula of recording a soul cover version of a rock cover version of a soul song had clearly worked, the next single Pickett recorded was \"Mustang Sally\", which as we saw had originally been an R&B record by Pickett's friend Mack Rice, before being covered by the Young Rascals. Pickett's version, though, became the definitive version:\n\n[Excerpt: Wilson Pickett, \"Mustang Sally\"]\n\nBut it very nearly wasn't. That was recorded in a single take, and the musicians went into the control room to listen to it -- and the metal capstan on the tape machine flew off while it was rewinding. The tape was cut into dozens of tiny fragments, which the machine threw all over the room in all directions.\n\nEveryone was horrified, and Pickett, who was already known for his horrific temper, looked as if he might actually kill someone. Tom Dowd, Atlantic's genius engineer who had been a physicist on the Manhattan Project while still a teenager, wasn't going to let something as minor as that stop him. He told everyone to take a break for half an hour, gathered up all the randomly-thrown bits of tape, and spliced them back together. The completed recording apparently has forty splices in it, which would mean an average of a splice every four seconds. Have a listen to this thirty-second segment and see if you can hear any at all:\n\n[Excerpt: Wilson Pickett, \"Mustang Sally\"]\n\nThat segment has the one part where I *think* I can hear one splice in the whole track, a place where the rhythm hiccups very slightly -- and that might well just be the drummer trying a fill that didn't quite come off.\n\n\"Mustang Sally\" was another pop top thirty hit, and Wexler's crossover strategy seemed to have been proved right -- so much so that Pickett was now playing pretty much all-white bills. He played, for example, at Murray the K's last ever revue at the Brooklyn Paramount, where the other artists on the bill were Mitch Ryder and the Detroit Wheels, the Young Rascals, Al Kooper's Blues Project, Cream, and the Who. Pickett found the Who extremely unprofessional, with their use of smoke bombs and smashing their instruments, but they eventually became friendly.\n\nPickett's next single was his version of \"Everybody Needs Somebody to Love\", the Solomon Burke song that the Rolling Stones had also covered, and that was a minor hit, but his next few records after that didn't do particularly well. He did though have a big hit with his cover version of a song by a group called Dyke and the Blazers. Pickett's version of \"Funky Broadway\" took him to the pop top ten:\n\n[Excerpt: Wilson Pickett, \"Funky Broadway\"]\n\nIt did something else, as well. You may have noticed that two of the bands on that Paramount bill were groups that get called \"blue-eyed soul\". \"Soul\" had originally been a term used for music made by Black people, but increasingly the term was being used by white people for their music, just as rock and roll and rhythm and blues before it had been picked up on by white musicians. And so as in those cases, Black musicians were moving away from the term -- though it would never be abandoned completely -- and towards a new slang term, \"funk\". And Pickett was the first person to get a song with \"funk\" in the title onto the pop charts.\n\nBut that would be the last recording Pickett would do at FAME for a couple of years. As with Stax, Pickett was moved away by Atlantic because of problems with another artist, this time to do with a session with Aretha Franklin that went horribly wrong, which we'll look at in a future episode. From this point on, Pickett would record at American Sound Studios in Memphis, a studio owned and run by Chips Moman, who had played on many of Pickett's records.\n\nAgain, Pickett was playing with an all-white house band, but brought in a couple of Black musicians -- the saxophone player King Curtis, and Pickett's new touring guitarist, Bobby Womack, who had had a rough few years, being largely ostracised from the music community because of his relationship with Sam Cooke's widow.\n\nWomack wrote what might be Pickett's finest song, a song called \"I'm in Love\" which is a masterpiece of metrical simplicity disguised as complexity -- you could write it all down as being in straight four-four, but the pulse shifts and implies alternating bars of five and three at points:\n\n[Excerpt: Wilson Pickett, \"I'm In Love\"]\n\nWomack's playing on those sessions had two effects, one on music history and one on Pickett. The effect on music history was that he developed a strong working relationship with Reggie Young, the guitarist in the American Sound studio band, and Young and Womack learned each other's styles. Young would later go on to be one of the top country session guitarists, playing on records by Merle Haggard, Willie Nelson, Dolly Parton, Kenny Rogers, Waylon Jennings and more, and he was using Womack's style of playing -- he said later \"I didn’t change a thing. I was playing that Womack style on country records, instead of the hillbilly stuff—it changed the whole bed of country music.\"\n\nThe other effect, though, was a much more damaging one. Womack introduced Pickett to cocaine, and Pickett -- who was already an aggressive, violent, abusive, man, became much more so.\n\n\"I'm in Love\" went to number four on the R&B charts, but didn't make the pop top forty. The follow-up, a remake of \"Stagger Lee\", did decently on the pop charts but less well on the R&B charts. Pickett's audiences were diverging, and he was finding it more difficult to make the two come together.\n\nBut he would still manage it, sporadically, throughout the sixties. One time when he did was in 1968, when he returned to Muscle Shoals and to FAME studios. In a session there, the guitarist was very insistent that Pickett should cut a version of the Beatles' most recent hit. Now obviously, this is a record that's ahead in our timeline, and which will be covered in a future episode, but I imagine that most of you won't find it too much of a spoiler when I tell you that \"Hey Jude\" by the Beatles was quite a big hit:\n\n[Excerpt: The Beatles, \"Hey Jude\"]\n\nWhat that guitarist had realised was that the tag of the song gave the perfect opportunity for ad-libbing. You all know the tag:\n\n[Excerpt: The Beatles, \"Hey Jude\"]\n\nAnd so on.\n\nThat would be perfect for a guitar solo, and for Pickett to do some good soul shouting over. Neither Pickett nor Rick Hall were at all keen -- the Beatles record had only just dropped off number one, and it seemed like a ridiculous idea to both of them. But the guitarist kept pressing to do it, and by the time the other musicians returned from their lunch break, he'd convinced Pickett and Hall. The record starts out fairly straightforward:\n\n[Excerpt: Wilson Pickett, \"Hey Jude\"]\n\nBut it's on the tag when it comes to life. Pickett later described recording that part -- “He stood right in front of me, as though he was playing every note I was singing. And he was watching me as I sang, and as I screamed, he was screaming with his guitar.”:\n\n[Excerpt: Wilson Pickett, \"Hey Jude\"]\n\nThat was not Pickett's biggest hit, but it was one of the most influential. It made the career of the guitarist, Duane Allman, who Jerry Wexler insisted on signing to his own contract after that, and as Jimmy Johnson, the rhythm guitarist on the session said, \"We realised then that Duane had created southern rock, in that vamp.\"\n\nIt was big enough that Wexler pushed Pickett to record a whole series of cover versions of rock songs -- he put out versions of \"Hey Joe\", \"Born to be Wild\" and \"You Keep Me Hangin' On\" -- the latter going back to his old technique of covering a white cover version of a Black record, as his version copied the Vanilla Fudge's arrangement rather than the Supremes' original. But these only had very minor successes -- the most successful of them was his version of \"Sugar Sugar\" by the Archies.\n\nAs the sixties turned into the seventies, Pickett continued having some success, but it was more erratic and less consistent. The worlds of Black and white music were drifting apart, and Pickett, who more than most had straddled both worlds, now found himself having success in neither.\n\nIt didn't help that his cocaine dependency had made him into an egomaniac. At one point in the early seventies, Pickett got a residency in Las Vegas, and was making what by most standards was a great income from it. But he would complain bitterly that he was only playing the small room, not the big one in the same hotel, and that the artist playing the big room was getting better billing than him on the posters. Of course, the artist playing the big room was Elvis Presley, but that didn't matter to Pickett -- he thought he deserved to be at least that big.\n\nHe was also having regular fights with his record label. Ahmet Ertegun used to tell a story -- and I'm going to repeat it here with one expletive cut out in order to get past Apple's ratings system. In Ertegun's words “Jerry Wexler never liked Crosby, Stills & Nash because they wanted so much freaking artistic autonomy. While we were arguing about this, Wilson Pickett walks in the room and comes up to Jerry and says, ‘Jerry,’ and he goes, ‘Wham!’ And he puts a pistol on the table. He says, ‘If that [Expletive] Tom Dowd walks into where I’m recording, I’m going to shoot him. And if you walk in, I’m going to shoot you. ‘Oh,’ Jerry said. ‘That’s okay, Wilson.’ Then he walked out. So I said, ‘You want to argue about artistic autonomy?’ ”\n\nAs you can imagine, Atlantic were quite glad to get rid of Pickett when he decided he wanted to move to RCA records, who were finally trying to break into the R&B market. Unfortunately for Pickett, the executive who'd made the decision to sign him soon left the company, and as so often happens when an executive leaves, his pet project becomes the one that everyone's desperate to get rid of.  RCA didn't know how to market records to Black audiences, and didn't really try, and Pickett's voice was becoming damaged from all the cocaine use.\n\nHe spent the seventies, and eighties going from label to label, trying things like going disco, with no success. He also went from woman to woman, beating them up, and went through band members more and more quickly as he attacked them, too. The guitarist Marc Ribot was in Pickett's band for a short time and said, (and here again I'm cutting out an expletive) \" You can write about all the extenuating circumstances, and maybe it needs to be put in historical context, but … You know why guys beat women? Because they can. And it’s abuse. That’s why employers beat employees, when they can. I’ve worked with black bandleaders and white bandleaders who are respectful, courteous and generous human beings—and then I’ve worked with Wilson Pickett.\"\n\nHe was becoming more and more paranoid. He didn't turn up for his induction in the rock and roll hall of fame, where he was scheduled to perform -- instead he hid in his house, scared to leave.\n\nPickett was repeatedly arrested throughout this time, and into the nineties, spending some time in prison, and then eventually going into rehab in 1997 after being arrested for beating up his latest partner. She dropped the charges, but the police found the cocaine in his possession and charged him with that.\nAfter getting out, he apparently mellowed out somewhat and became much easier to get along with -- still often unpleasant, especially after he'd had a drink, which he never gave up, but far less violent and more easy-going than he had been. He also had something of a comeback, sparked by an appearance in the flop film Blues Brothers 2000. He recorded a blues album, It's Harder Now, and also guested on Adlib, the comeback duets album by his old friend Don Covay, singing with him and cowriting on several songs, including \"Nine Times a Man\":\n\n[Excerpt: Don Covay and Wilson Pickett, \"Nine Times a Man\"]\n\nIt's Harder Now was a solid blues-based album, in the vein of similar albums from around that time by people like Solomon Burke, and could have led to Pickett having the same kind of late-career resurgence as Johnny Cash. It was nominated for a Grammy, but lost in the category for which it was nominated to Barry White. Pickett was depressed by the loss and just decided to give up making new music, and just played the oldies circuit until 2004, at which point he became too ill to continue. The duet with Covay would be the last time he went into the studio.\n\nThe story of Pickett's last year or so is a painful one, with squabbles between his partner and his children over his power of attorney while he spent long periods in hospital, suffering from kidney problems caused by his alcoholism, and also at this point from bulimia, diabetes, and more. He was ill enough that he tried to make amends with his children and his ex-wife, and succeeded as well as anyone can in that situation. On the eighteenth of January 2006, two months before his sixty-fifth birthday, his partner took him to get his hair cut and his moustache shaped, so he'd look the way he wanted to look, they ate together at his assisted living facility, and prayed together, and she left around eleven o'clock that night. Shortly thereafter, Pickett had a heart attack and died, alone, some time close to the midnight hour.",
  "itunes:subtitle": "Episode 134 of A History of Rock Music in Five Hundred Songs looks at “In the Midnight Hour, the links between Stax, Atlantic, and Detroit, and the career of Wilson Pickett. Click the full post to read liner notes, links to more information, and a transc",
  "itunes:keywords": "Ahmet Ertegun,Andre Williams,Aretha Franklin,Atlantic Records,Bert Berns,Bobby Womack,C.L. Franklin,Chess Records,Chips Moman,Don Covay,Duane Allman,Eddie Floyd,Jerry Wexler,Joe Tex,Marc Ribot,Muscle Shoals,Otis Redding,Percy Sledge,Rick Hall,Robert Bateman,Rod Stewart,Sam and Dave,Sam Cooke,Solomon Burke,Spooner Oldham,Stax Records,Steve Cropper,The Falcons,The Four Tops,The Ohio Players,The Rolling Stones,The Supremes,The Young Rascals,Tom Dowd,Willie Dixon,Wilson Pickett",
  "itunes:episodeType": "full",
  "itunes:episode": 134,
  "content:encoded": "Episode 134 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “In the Midnight Hour\", the links between Stax, Atlantic, and Detroit, and the career of Wilson Pickett. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/57335552\">on \"Mercy Mercy\" by Don Covay</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\nI say “After Arthur Alexander had moved on to Monument Records” – I meant to say “Dot Records” here, the label that Alexander moved to *before* Monument.\nI also misspeak at one point and say \"keyboard player Chips Moman\", when I mean to say \"keyboard player Spooner Oldham\". This is correct in the transcript/script, I just misread it.\n<strong>Resources</strong>\n\nNo Mixcloud this week, as there are too many songs by Pickett.\n\nThe main resource I used for the biographical details of Wilson Pickett was <em><a href=\"https://amzn.to/2X63Sai\">In the Midnight Hour: The Life and Soul of Wilson Pickett</a>.</em>\n\nInformation about Stax comes primarily from two books: <a href=\"https://amzn.to/3nPGLZp\"><em>Soulsville USA: The Story of Stax</em> by Rob Bowman</a>, and <a href=\"https://amzn.to/3ftoePF\"><em>Respect Yourself: Stax Records and the Soul Explosion</em> by Robert Gordon</a>.\n\n<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L Hughes</a> is a great overview of the soul music made in Muscle Shoals, Memphis, and Nashville in the sixties.\n\nThe episodes of Cocaine and Rhinestones I reference are the ones on <a href=\"https://cocaineandrhinestones.com/owen-bradley-nashville-sound\">Owen Bradley</a> and <a href=\"https://cocaineandrhinestones.com/nashville-a-team\">the Nashville A-Team</a>.\n\nAnd information on the Falcons comes from <a href=\"http://www.uncamarvy.com/Falcons/falcons.html\">Marv Goldberg</a>.\n\nPickett's complete Atlantic albums can be found in <a href=\"https://amzn.to/3Dy3kJW\">this excellent ten-CD set</a>. For those who just want the hits, <a href=\"https://amzn.to/2YHqVt1\">this single-CD compilation</a> is significantly cheaper.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\nA quick note before I start, just to say that this episode contains some discussion of domestic abuse, drug use, and abuse of employees by their employer, and one mention of an eating disorder. Also, this episode is much longer than normal, because we've got a lot to fit in.\n\nToday we're going to move away from Motown, and have a look at a record recorded in the studios of their great rival Stax records, though not released on that label. But the record we're going to look at is from an artist who was a bridge between the Detroit soul of Motown and the southern soul of Stax, an artist who had a foot in both camps, and whose music helped to define soul while also being closer than that of any other soul man to the music made by the white rock musicians of the period.\n\nWe're going to look at Stax, and Muscle Shoals, and Atlantic Records, and at Wilson Pickett and \"In the Midnight Hour\"\n\n[Excerpt: Wilson Pickett: \"In the Midnight Hour\"]\n\nWilson Pickett never really had a chance. His father, Wilson senior, was known in Alabama for making moonshine whisky, and spent time in prison for doing just that -- and his young son was the only person he told the location of his still. Eventually, Wilson senior moved to Detroit to start earning more money, leaving his family at home at first. Wilson junior and his mother moved up to Detroit to be with his father, but they had to leave his older siblings in Alabama, and his mother would shuttle between Michigan and Alabama, trying vainly to look after all her children.\n\nEventually, Wilson's mother got pregnant while she was down in Alabama, which broke up his parents' marriage, and Wilson moved back down to Alabama permanently, to live on a farm with his mother. But he never got on with his mother, who was physically abusive to him -- as he himself would later be to his children, and to his partners, and to his bandmates.\n\nThe one thing that Wilson did enjoy about his life in Alabama was the gospel music, and he became particularly enamoured of two gospel singers, Archie Brownlee of the Five Blind Boys of Mississippi:\n\n[Excerpt: The Mississippi Blind Boys, \"Will My Jesus Be Waiting?\"]\n\nAnd Julius Cheeks of the Sensational Nightingales:\n\n[Excerpt: The Sensational Nightingales, \"God's World Will Never Pass Away\"]\n\nWilson determined to become a gospel singer himself, but he couldn't stand living with his mother in rural Alabama, and decided to move up to be with his father and his father's new girlfriend in Detroit.  Once he moved to Detroit, he started attending Northwestern High School, which at the time was also being attended by Norman Whitfield, Florence Ballard, and Melvin Franklin.\n\nPickett also became friendly with Aretha Franklin, though she didn't attend the same school -- she went to school at Northern, with Smokey Robinson -- and he started attending services at New Bethel Church, the church where her father preached. This was partly because Rev. Franklin was one of the most dynamic preachers around, but also because New Bethel Church would regularly feature performances by the most important gospel performers of the time -- Pickett saw the Soul Stirrers perform there, with Sam Cooke singing lead, and of course also saw Aretha singing there.\n\nHe joined a few gospel groups, first joining one called the Sons of Zion, but he was soon poached by a more successful group, the Violinaires. It was with the Violinaires that he made what is almost certainly his first recording -- a track that was released as a promo single, but never got a wide release at the time:\n\n[Excerpt: The Violinaires, \"Sign of the Judgement\"]\n\nThe Violinaires were only moderately successful on the gospel circuit, but Pickett was already sure he was destined for bigger things. He had a rivalry with David Ruffin, in particular, constantly mocking Ruffin and saying that he would never amount to anything, while Wilson Pickett was the greatest.\n\nBut after a while, he realised that gospel wasn't where he was going to make his mark. Partly his change in direction was motivated by financial concern -- he'd physically attacked his father and been kicked out of his home, and he was also married while still a teenager, and had a kid who needed feeding. But also, he was aware of a certain level of hypocrisy among his more religious acquaintances. Aretha Franklin had two kids, aged only sixteen, and her father, the Reverend Franklin, had fathered a child with a twelve-year-old, was having an affair with the gospel singer Clara Ward, and was hanging around blues clubs all the time.\n\nMost importantly, he realised that the audiences he was singing to in church on Sunday morning were mostly still drunk from Saturday night. As he later put it \"I might as well be singing rock ’n’ roll as singing to a drunken audience. I might as well make me some money.\"\n\nAnd this is where the Falcons came in. The Falcons were a doo-wop group that had been formed by a Black singer, Eddie Floyd, and a white singer, Bob Manardo. They'd both recruited friends, including bass singer Willie Schofield, and after performing locally they'd decided to travel to Chicago to audition for Mercury Records. When they got there, they found that you couldn't audition for Mercury in Chicago, you had to go to New York, but they somehow persuaded the label to sign them anyway -- in part because an integrated group was an unusual thing.\n\nThey recorded one single for Mercury, produced by Willie Dixon who was moonlighting from Chess:\n\n[Excerpt: The Falcons, \"Baby That's It\"]\n\nBut then Manardo was drafted, and the group's other white member, Tom Shetler, decided to join up along with him. The group went through some other lineup changes, and ended up as Eddie Floyd, Willie Schofield, Mack Rice, guitarist Lance Finnie, and lead singer Joe Stubbs, brother of Levi.\nThe group released several singles on small labels owned by their manager, before having a big hit with \"You're So Fine\", the record we heard about them recording last episode:\n\n[Excerpt: The Falcons, \"You're So Fine\"]\n\nThat made number two on the R&B charts and number seventeen on the pop charts. They recorded several follow-ups, including \"Just For Your Love\", which made number 26 on the R&B charts:\n\n[Excerpt: The Falcons, \"Just For Your Love\"]\n\nTo give you some idea of just how interrelated all the different small R&B labels were at this point, that was originally recorded and released on Chess records. But as Roquel Davis was at that point working for Chess, he managed to get the rights to reissue it on Anna Records, the label he co-owned with the Gordy sisters -- and the re-released record was distributed by Gone Records, one of George Goldner's labels. The group also started to tour supporting Marv Johnson.\n\nBut Willie Schofield was becoming dissatisfied. He'd written \"You're So Fine\", but he'd only made $500 from what he was told was a million-selling record. He realised that in the music business, the real money was on the business side, not the music side, so while staying in the Falcons he decided he was going to go into management too.\n\nHe found the artist he was going to manage while he was walking to his car, and heard somebody in one of the buildings he passed singing Elmore James' then-current blues hit \"The Sky is Crying\":\n\n[Excerpt: Elmore James, \"The Sky is Crying\"]\n\nThe person he heard singing that song, and accompanying himself on acoustic guitar, was of course Wilson Pickett, and Schofield signed him up to a management contract -- and Pickett was eager to sign, knowing that Schofield was a successful performer himself.\n\nThe intention was at first that Schofield would manage Pickett as a solo performer, but then Joe Stubbs got ideas above his station, and started insisting that the group be called \"Joe Stubbs and the Falcons\", which put the others' backs up, and soon Stubbs was out of the group. This experience may have been something that his brother later had in mind -- in the late sixties, when Motown started trying to promote groups as Lead Singer and The Group, Levi Stubbs always refused to allow his name to go in front of the Four Tops.\n\nSo the Falcons were without a lead singer. They tried a few other singers in their circle, including Marvin Gaye, but were turned down. So in desperation, they turned to Pickett. This wasn't a great fit -- the group, other than Schofield, thought that Pickett was \"too Black\", both in that he had too much gospel in his voice, and literally in that he was darker-skinned than the rest of the group (something that Schofield, as someone who was darker than the rest of the group but less dark than Pickett, took offence at). Pickett, in turn, thought that the Falcons were too poppy, and not really the kind of thing he was at all interested in doing.\n\nBut they were stuck with each other, and had to make the most of it, even though Pickett's early performances were by all accounts fairly dreadful. He apparently came in in the wrong key on at least one occasion, and another time froze up altogether and couldn't sing. Even when he did sing, and in tune, he had no stage presence, and he later said “I would trip up, fall on the stage and the group would rehearse me in the dressing room after every show. I would get mad, ‘cos I wanted to go out and look at the girls as well! They said, ‘No, you got to rehearse, Oscar.’ They called me Oscar. I don’t know why they called me Oscar, I didn’t like that very much.”\n\nSoon, Joe Stubbs was back in the group, and there was talk of the group getting rid of Pickett altogether. But then they went into the studio to record a song that Sam Cooke had written for the group, \"Pow! You're in Love\". The song had been written for Stubbs to sing, but at the last minute they decided to give Pickett the lead instead:\n\n[Excerpt: The Falcons, \"Pow! You're in Love\"]\n\nPickett was now secure as the group's lead singer, but the group weren't having any success with records. They were, though, becoming a phenomenal live act -- so much so that on one tour, where James Brown was the headliner, Brown tried to have the group kicked off the bill, because he felt that Pickett was stealing his thunder.\n\nEventually, the group's manager set up his own record label, Lu Pine Records, which would become best known as the label that released the first record by the Primettes, who later became the Supremes.  Lu Pine released the Falcons' single \"I Found a Love\",   after the group's management had first shopped it round to other labels to try to get them to put it out:\n\n[Excerpt: The Falcons, \"I Found a Love\"]\n\nThat song, based on the old Pentecostal hymn \"Yes Lord\", was written by Pickett and Schofield, but the group's manager, Robert West, also managed to get his name on the credits. The backing group, the Ohio Untouchables, would later go on to become better known as The Ohio Players.\n\nOne of the labels that had turned that record down was Atlantic Records, because Jerry Wexler hadn't heard any hit potential in the song. But then the record started to become successful locally, and Wexler realised his mistake. He got Lu Pine to do a distribution deal with Atlantic, giving Atlantic full rights to the record, and it became a top ten R&B hit.\n\nBut by this point, Pickett was sick of working with the Falcons, and he'd decided to start trying for a solo career. His first solo single was on the small label Correc-Tone, and was co-produced by Robert Bateman, and featured the Funk Brothers as instrumental backing, and the Primettes on vocals. I've seen some claims that the Andantes are on there too, but I can't make them out -- but I can certainly make out the future Supremes:\n\n[Excerpt: Wilson Pickett, \"Let Me Be Your Boy\"]\n\nThat didn't do anything, and Pickett kept recording with the Falcons for a while, as well as putting out his solo records. But then Willie Schofield got drafted, and the group split up. Their manager hired another group, The Fabulous Playboys, to be a new Falcons group, but in 1964 he got shot in a dispute over the management of Mary Wells, and had to give up working in the music industry.\n\nPickett's next single, which he co-wrote with Robert Bateman and Sonny Schofield, was to be the record that changed his career forever. \"If You Need Me\" once again featured the Funk Brothers and the Andantes, and was recorded for Correc-Tone:\n\n[Excerpt: Wilson Pickett, \"If You Need Me\"]\n\nJerry Wexler was again given the opportunity to put the record out on Atlantic, and once again decided against it. Instead, he offered to buy the song's publishing, and he got Solomon Burke to record it, in a version produced by Bert Berns:\n\n[Excerpt: Solomon Burke, \"If You Need Me\"]\n\nBurke wasn't fully aware, when he cut that version, that Wilson Pickett, who was his friend, had recorded his own version. He became aware, though, when Double-L Records, a label co-owned by Lloyd Price, bought the Correc-Tone master and released Pickett's version nationally, at the same time as Burke's version came out.\n\nThe two men were annoyed that they'd been put into unwitting competition, and so started an unofficial nonaggression pact -- every time Burke was brought into a radio station to promote his record, he'd tell the listeners that he was there to promote Wilson Pickett's new single. Meanwhile, when Pickett went to radio stations, he'd take the opportunity to promote the new record he'd written for his good friend Solomon Burke, which the listeners should definitely check out.\n\nThe result was that both records became hits -- Pickett's scraped the lower reaches of the R&B top thirty, while Burke, as he was the bigger star, made number two on the R&B chart and got into the pop top forty. Pickett followed it up with a soundalike, \"It's Too Late\", which managed to make the R&B top ten as there was no competition from Burke.\n\nAt this point, Jerry Wexler realised that he'd twice had the opportunity to release a record with Wilson Pickett singing, twice he'd turned the chance down, and twice the record had become a hit. He realised that it was probably a good idea to sign Pickett directly to Atlantic and avoid missing out. He did check with Pickett if Pickett was annoyed about the Solomon Burke record -- Pickett's response was \"I need the bread\", and Wilson Pickett was now an Atlantic artist.\n\nThis was at the point when Atlantic was in something of a commercial slump -- other than the records Bert Berns was producing for the Drifters and Solomon Burke, they were having no hits, and they were regarded as somewhat old-fashioned, rooted in a version of R&B that still showed its roots in jazz, rather than the new sounds that were taking over the industry in the early sixties. But they were still a bigger label than anything else Pickett had recorded for, and he seized the opportunity to move into the big time.\nTo start with, Atlantic teamed Pickett up with someone who seemed like the perfect collaborator -- Don Covay, a soul singer and songwriter who had his roots in hard R&B and gospel music but had written hits for people like Chubby Checker.  The two got together and recorded a song they wrote together, \"I'm Gonna Cry (Cry Baby)\":\n\n[Excerpt: Wilson Pickett, \"I'm Gonna Cry (Cry Baby)\"]\n\nThat did nothing commercially -- and gallingly for Pickett, on the same day, Atlantic released a single Covay had written for himself, \"Mercy Mercy\", and that ended up going to number one on the R&B chart and making the pop top forty.\n\nAs \"I'm Gonna Cry\" didn't work out, Atlantic decided to try to change tack, and paired Pickett with their established hitmaker Bert Berns, and a duet partner, Tami Lyn, for what Pickett would later describe as \"one of the weirdest sessions on me I ever heard in my life\", a duet on a Mann and Weil song, \"Come Home Baby\":\n\n[Excerpt: Wilson Pickett and Tami Lyn, \"Come Home Baby\"]\n\nPickett later said of that track, \"it didn't sell two records\", but while it wasn't a hit, it was very popular among musicians -- a few months later Mick Jagger would produce a cover version of it on Immediate Records, with Ronnie Wood, Keith Richards, and the Georgie Fame brass section backing a couple of unknown singers:\n\n[Excerpt: Rod Stewart and P.P. Arnold, \"Come Home Baby\"]\n\nSadly for Rod Stewart and P.P. Arnold, that didn't get past being issued as a promotional record, and never made it to the shops.\n\nMeanwhile, Pickett went out on tour again, substituting on a package tour for Clyde McPhatter, who had to drop out when his sister died. Also on the tour was Pickett's old bandmate from the Falcons, Mack Rice, now performing as Sir Mack Rice, who was promoting a single he'd just released on a small label, which had been produced by Andre Williams. The song had originally been called \"Mustang Mama\", but Aretha Franklin had suggested he call it \"Mustang Sally\" instead:\n\n[Excerpt: Sir Mack Rice, \"Mustang Sally\"]\n\nPickett took note of the song, though he didn't record it just yet -- and in the meantime, the song was picked up by the white rock group The Young Rascals, who released their version as the B-side of their number one hit, \"Good Lovin'\":\n\n[Excerpt: The Young Rascals, \"Mustang Sally\"]\n\nAtlantic's problems with having hits weren't only problems with records they made themselves -- they were also having trouble getting any big hits with Stax records. As we discussed in the episode on \"Green Onions\", Stax were being distributed by Atlantic, and in 1963 they'd had a minor hit with \"These Arms of Mine\" by Otis Redding:\n\n[Excerpt: Otis Redding, \"These Arms of Mine\"]\n\nBut throughout 1964, while the label had some R&B success with its established stars, it had no real major breakout hits, and it seemed to be floundering a bit -- it wasn't doing as badly as Atlantic itself, but it wasn't doing wonderfully. It wasn't until the end of the year when the label hit on what would become its defining sound, when for the first time Redding collaborated with Stax studio guitarist and producer Steve Cropper on a song:\n\n[Excerpt: Otis Redding, \"Mr. Pitiful\"]\n\nThat record would point the way towards Redding's great artistic triumphs of the next couple of years, which we'll look at in a future episode. But it also pointed the way towards a possible future sound for Atlantic.\n\nAtlantic had signed a soul duo, Sam & Dave, who were wonderful live performers but who had so far not managed to translate those live performances to record. Jerry Wexler thought that perhaps Steve Cropper could help them do that, and made a suggestion to Jim Stewart at Stax -- Atlantic would loan out Sam & Dave to the label. They'd remain signed to Atlantic, but make their records at Stax studios, and they'd be released as Stax records.\n\nTheir first single for Stax, \"A Place Nobody Can Find\", was produced by Cropper, and was written by Stax songwriter Dave Porter:\n\n[Excerpt: Sam and Dave, \"A Place Nobody Can Find\"]\n\nThat wasn't a hit, but soon Porter would start collaborating with another songwriter, Isaac Hayes, and would write a string of hits for the duo.\n\nBut in order to formalise the loan-out of Sam and Dave, Atlantic also wanted to formalise their arrangement with Stax. Previously they'd operated on a handshake basis -- Wexler and Stewart had a mutual respect, and they simply agreed that Stax would give Atlantic the option to distribute their stuff. But now they entered into a formal, long-term contract, and for a nominal sum of one dollar, Jim Stewart gave Atlantic the distribution rights to all past Stax records and to all future records they released for the next few years.\n\nOr at least, Stewart *thought* that the agreement he was making was formalising the distribution agreement. What the contract actually said -- and Stewart never bothered to have this checked over by an entertainment lawyer, because he trusted Wexler -- was that Stax would, for the sum of one dollar, give Atlantic *permanent ownership* of all their records, in return. The precise wording was \"You hereby sell, assign and transfer to us, our successors or assigns, absolutely and forever and without any limitations or restrictions whatever, not specifically set forth herein, the entire right, title and interest in and to each of such masters and to each of the performances embodied thereon.\"\n\nJerry Wexler would later insist that he had no idea that particular clause was in the contract, and that it had been slipped in there by the lawyers. Jim Stewart still thought of himself as the owner of an independent record label, but without realising it he'd effectively become an employee of Atlantic.\nAtlantic started to take advantage of this new arrangement by sending other artists down to Memphis to record with the Stax musicians. Unlike Sam and Dave, these would still be released as Atlantic records rather than Stax ones, and Jerry Wexler and Atlantic's engineer Tom Dowd would be involved  in the production, but the records would be made by the Stax team.\n\nThe first artist to benefit from this new arrangement was Wilson Pickett, who had been wanting to work at Stax for a while, being a big fan of Otis Redding in particular. Pickett was teamed up with Steve Cropper, and together they wrote the song that would define Pickett's career.\n\nThe seeds of \"In the Midnight Hour\" come from two earlier recordings. One is a line from his record with the Falcons, \"I Found a Love\":\n\n[Excerpt: The Falcons, \"I Found a Love\"]\n\nThe other is a line from a record that Clyde McPhatter had made with Billy Ward and the Dominoes back in 1951:\n\n[Excerpt: Billy Ward and the Dominoes, \"Do Something For Me\"]\n\nThose lines about a \"midnight hour\" and \"love come tumbling down\" were turned into the song that would make Pickett's name, but exactly who did what has been the cause of some disagreement. The official story is that Steve Cropper took those lines and worked with Pickett to write the song, as a straight collaboration.\n\nMost of the time, though, Pickett would claim that he'd written the song entirely by himself, and that Cropper had stolen the credit for that and their other credited collaborations. But other times he would admit \"He worked with me quite a bit on that one\".\n\nFloyd Newman, a regular horn player at Stax, would back up Pickett, saying \"Every artist that came in here, they’d have their songs all together, but when they leave they had to give up a piece of it, to a certain person. But this person, you couldn’t be mad at him, because he didn’t own Stax, Jim Stewart owned Stax. And this guy was doing what Jim Stewart told him to do, so you can’t be mad at him.\"\n\nBut on the other hand, Willie Schofield, who collaborated with Pickett on \"I Found a Love\", said of writing that \"Pickett didn’t have any chord pattern. He had a couple of lyrics. I’m working with him, giving him the chord change, the feel of it. Then we’re going in the studio and I’ve gotta show the band how to play it because we didn’t have arrangers. That’s part of the songwriting. But he didn’t understand. He felt he wrote the lyrics so that’s it.\"\n\nGiven that Cropper didn't take the writing credit on several other records he participated in, that he did have a consistent pattern of making classic hit records, that \"In the Midnight Hour\" is stylistically utterly different from Pickett's earlier work but very similar to songs like \"Mr. Pitiful\" cowritten by Cropper, and Pickett's longstanding habit of being dismissive of anyone else's contributions to his success, I think the most likely version of events is that Cropper did have a lot to do with how the song came together, and probably deserves his credit, but we'll never know for sure exactly what went on in their collaboration.\nWhoever wrote it, \"In the Midnight Hour\" became one of the all-time classics of soul:\n\n[Excerpt: Wilson Pickett, \"In the Midnight Hour\"]\n\nBut another factor in making the record a success -- and in helping reinvent the Stax sound -- was actually Jerry Wexler. Wexler had started attending sessions at the Stax studios, and was astonished by how different the recording process was in the South.\n\nAnd Wexler had his own input into the session that produced \"In the Midnight Hour\".\n\nHis main suggestion was that rather than play the complicated part that Cropper had come up with, the guitarist should simplify, and just play chords along with Al Jackson's snare drum. Wexler was enthusing about a new dance craze called the Jerk, which had recently been the subject of a hit record by a group called the Larks:\n\n[Excerpt: The Larks, \"The Jerk\"]\n\nThe Jerk, as Wexler demonstrated it to the bemused musicians, involved accenting the second and fourth beats of the bar, and delaying them very slightly. And this happened to fit very well with the Stax studio sound.\n\nThe Stax studio was a large room, with quite a lot of reverb, and the musicians played together without using headphones, listening to the room sound. Because of this, to stay in time, Steve Cropper had started taking his cue not just from the sound, but from watching Al Jackson's left hand going to the snare drum. This had led to him playing when he saw Jackson's hand go down on the two and four, rather than when the sound of the snare drum reached his ears -- a tiny, fraction-of-a-second, anticipation of the beat, before everyone would get back in sync on the one of the next bar, as Jackson hit the kick drum. This had in turn evolved into the whole group playing the backbeat with a fractional delay, hitting it a tiny bit late -- as if you're listening to the echo of those beats rather than to the beat itself.\n\nIf anyone other than utterly exceptional musicians had tried this, it would have ended up as a car crash, but Jackson was one of the best timekeepers in the business, and many musicians would say that at this point in time Steve Cropper was *the* best rhythm guitarist in the world, so instead it gave the performances just enough sense of looseness to make them exciting.\n\nThis slight delayed backbeat was something the musicians had naturally fallen into doing, but it fit so well with Wexler's conception of the Jerk that they started deliberately exaggerating it -- still only delaying the backbeat minutely, but enough to give the record a very different sound from anything that was out there:\n\n[Excerpt: Wilson Pickett, \"In the Midnight Hour\"]\n\nThat delayed backbeat sound would become the signature sound of Stax for the next several years, and you will hear it on the run of classic singles they would put out for the next few years by Otis Redding, Sam & Dave, Carla Thomas, Booker T. and the MGs, Eddie Floyd and others.\n\nThe sound of that beat is given extra emphasis by the utter simplicity of Al Jackson's playing. Jackson had a minimalist drum kit, but played it even more minimally -- other than the occasional fill, he never hit his tom at all, just using the kick drum, snare, and hi-hat -- and the hi-hat was not even miced, with any hi-hat on the actual records just being the result of leakage from the other mics. But that simplicity gave the Stax records a power that almost no other records from the period had:\n\n[Excerpt: Wilson Pickett, \"In the Midnight Hour\"]\n\n\"In the Midnight Hour\" made number one on the R&B charts, and made number twenty-one on the pop charts, instantly turning Pickett from an also-ran into one of the major stars of soul music. The follow-up, a soundalike called \"Don't Fight It\", also made the top five on the R&B charts.\n\nAt his next session, Pickett was reunited with his old bandmate Eddie Floyd. Floyd would soon go on to have his own hits at Stax, most notably with \"Knock on Wood\", but at this point he was working as a staff songwriter at Stax, coming up with songs like \"Comfort Me\" for Carla Thomas:\n\n[Excerpt: Carla Thomas, \"Comfort Me\"]\n\nFloyd had teamed up with Steve Cropper, and they'd been... shall we say, \"inspired\"... by a hit for the Marvelettes, \"Beechwood 45789\", written by Marvin Gaye, Gwen Gordy and Mickey Stevenson:\n\n[Excerpt: The Marvelettes, \"Beechwood 45789\"]\n\nCropper and Floyd had come up with their own song, \"634-5789\", which Pickett recorded, and which became an even bigger hit than \"In the Midnight Hour\", making number thirteen on the pop charts as well as being Pickett's second R&B number one:\n\n[Excerpt: Wilson Pickett, \"634-5789\"]\n\nAt the same session, they cut another single. This one was inspired by an old gospel song, \"Ninety-Nine and One Half Won't Do\", recorded by Sister Rosetta Tharpe among others:\n\n[Excerpt: Sister Rosetta Tharpe, \"Ninety-Nine and One Half Won't Do\"]\n\nThe song was rewritten by Floyd, Cropper, and Pickett, and was also a moderate R&B hit, though nowhere as big as \"634-5789\":\n\n[Excerpt: Wilson Pickett, \"Ninety-Nine and One Half Won't Do\"]\n\nThat would be the last single that Pickett recorded at Stax, though -- though the reasoning has never been quite clear. Pickett was, to put it as mildly as possible, a difficult man to work with, and he seems to have had some kind of falling out with Jim Stewart -- though Stewart always said that the problem was actually that Pickett didn't get on with the musicians. But the musicians disagree, saying they had a good working relationship -- Pickett was often an awful person, but only when drunk, and he was always sober in the studio.\n\nIt seems likely, actually, that Pickett's move away from the Stax studios was more to do with someone else -- Pickett's friend Don Covay was another Atlantic artist recording at Stax, and Pickett had travelled down with him when Covay had recorded \"See Saw\" there:\n\n[Excerpt: Don Covay, \"See Saw\"]\n\nEveryone involved agreed that Covay was an eccentric personality, and that he rubbed Jim Stewart up the wrong way. There is also a feeling among some that Stewart started to resent the way Stax's sound was being used for Atlantic artists, like he was \"giving away\" hits, even though Stax's company got the publishing on the songs Cropper was co-writing, and he was being paid for the studio time.\nEither way, after that session, Atlantic didn't send any of its artists down to Stax, other than Sam & Dave, who Stax regarded as their own artists. Pickett would never again record at Stax, and possibly coincidentally once he stopped writing songs with Steve Cropper he would also never again have a major hit record with a self-penned song.\n\nBut Jerry Wexler still wanted to keep working in Southern studios, and with Southern musicians, and so he took Pickett to FAME studios, in Muscle Shoals, Alabama.\n\nWe looked, back in the episode on Arthur Alexander, at the start of FAME studios, but after Arthur Alexander had moved on to Monument Records, Rick Hall had turned FAME into a home for R&B singers looking for crossover success. While Stax employed both Black and white musicians, FAME studios had an all-white rhythm section, with a background in country music, but that had turned out to be absolutely perfect for performers like the soul singer Joe Tex, who had himself started out in country before switching to soul, and who recorded classics like \"Hold What You Got\" at the studio:\n\n[Excerpt: Joe Tex, \"Hold What You Got\"]\n\nThat had been released on FAME's record label, and Jerry Wexler had been impressed and had told Rick Hall to call him the next time he thought he had a hit.\n\nWhen Hall did call Wexler, Wexler was annoyed -- Hall phoned him in the middle of a party. But Hall was insistent. \"You said to call you next time I've got a hit, and this is a number one\". Wexler relented and listened to the record down the phone. This is what he heard:\n\n[Excerpt: Percy Sledge, \"When a Man Loves a Woman\"]\n\nAtlantic snapped up \"When a Man Loves a Woman\" by Percy Sledge, and it went to number one on the pop charts -- the first record from any of the Southern soul studios to do so. In Wexler's eyes, FAME was now the new Stax.\n\nWexler had a bit of culture shock when working at FAME, as it was totally unlike anything he'd experienced before. The records he'd been involved with in New York had been mostly recorded by slumming jazz musicians, very technical players who would read the music from charts, and Stax had had Steve Cropper as de facto musical director, leading the musicians and working out their parts with them.\n\nBy contrast, the process used at FAME, and at most of the other studios in what Charles Hughes describes as the \"country-soul triangle\" of Memphis, Muscle Shoals, and Nashville, was the process that had been developed by Owen Bradley and the Nashville A-Team in Nashville (and for a fuller description of this, see the excellent episodes on Bradley and the A-Team in the great country music podcast Cocaine and Rhinestones). The musicians would hear a play through of the song by its writer, or a demo, would note down the chord sequences using the Nashville number system rather than a more detailed score, do a single run-through to get the balance right, and then record. Very few songs required a second take.\n\nFor Pickett's first session at FAME, and most subsequent ones, the FAME rhythm section of keyboard player Spooner Oldham, guitarist Jimmy Johnson, bass player Junior Lowe and drummer Roger Hawkins was augmented with a few other players -- Memphis guitarists Chips Moman and Tommy Cogbill, and the horn section who'd played on Pickett's Stax records, moonlighting.\n\nAnd for the first track they recorded there, Wexler wanted them to do something that would become a signature trick for Pickett over the next couple of years -- record a soul cover version of a rock cover version of a soul record. Wexler's thinking was that the best way for Pickett to cross over to a white audience was to do songs that were familiar to them from white pop cover versions, but songs that had originated in Pickett's soul style. At the time, as well, the hard backbeat sound on Pickett's hits was one that was more associated with white rock music than with soul, as was the emphasis on rhythm guitar. To modern ears, Pickett's records are almost the definition of soul music, but at the time they were absolutely considered crossover records.\n\nAnd so in the coming months Pickett would record cover versions of Don Covay's \"Mercy Mercy\", Solomon Burke's \"Everybody Needs Somebody to Love\", and Irma Thomas' \"Time is on My Side\", all of which had been previously covered by the Rolling Stones -- and two of which had their publishing owned by Atlantic's publishing subsidiary.\n\nFor this single, though, he was recording a song which had started out as a gospel-inspired dance song by the R&B singer Chris Kenner:\n\n[Excerpt: Chris Kenner, \"Land of a Thousand Dances\"]\n\nThat had been a minor hit towards the bottom end of the Hot One Hundred, but it had been taken up by a lot of other musicians, and become one of those songs everyone did as album filler -- Rufus Thomas had done a version at Stax, for example. But then a Chicano garage band called Cannibal and the Headhunters started performing it live, and their singer forgot the lyrics and just started singing \"na na na na\", giving the song a chorus it hadn't had in its original version. Their version, a fake-live studio recording, made the top thirty:\n\n[Excerpt: Cannibal and the Headhunters, \"Land of a Thousand Dances\"]\n\nPickett's version was drastically rearranged, and included a guitar riff that Chips Moman had come up with, some new lyrics that Pickett introduced, and a bass intro that Jerry Wexler came up with, a run of semiquavers that Junior Lowe found very difficult to play.\n\nThe musicians spent so long working on that intro that Pickett got annoyed and decided to take charge. He yelled \"Come on! One-two-three!\" and the horn players, with the kind of intuition that comes from working together for years, hit a chord in unison. He yelled \"One-two-three!\" again, and they hit another chord, and Lowe went into the bass part. They'd found their intro. They ran through that opening one more time, then recorded a take:\n\n[Excerpt: Wilson Pickett, \"Land of a Thousand Dances\"]\n\nAt this time, FAME was still recording live onto a single-track tape, and so all the mistakes were caught on tape with no opportunity to fix anything, like when all but one of the horn players forget to come in on the first line of one verse:\n\n[Excerpt: Wilson Pickett, \"Land of a Thousand Dances\"]\n\nBut that kind of mistake only added to the feel of the track, which became Pickett's biggest hit yet -- his third number one on the R&B chart, and his first pop top ten.\n\nAs the formula of recording a soul cover version of a rock cover version of a soul song had clearly worked, the next single Pickett recorded was \"Mustang Sally\", which as we saw had originally been an R&B record by Pickett's friend Mack Rice, before being covered by the Young Rascals. Pickett's version, though, became the definitive version:\n\n[Excerpt: Wilson Pickett, \"Mustang Sally\"]\n\nBut it very nearly wasn't. That was recorded in a single take, and the musicians went into the control room to listen to it -- and the metal capstan on the tape machine flew off while it was rewinding. The tape was cut into dozens of tiny fragments, which the machine threw all over the room in all directions.\n\nEveryone was horrified, and Pickett, who was already known for his horrific temper, looked as if he might actually kill someone. Tom Dowd, Atlantic's genius engineer who had been a physicist on the Manhattan Project while still a teenager, wasn't going to let something as minor as that stop him. He told everyone to take a break for half an hour, gathered up all the randomly-thrown bits of tape, and spliced them back together. The completed recording apparently has forty splices in it, which would mean an average of a splice every four seconds. Have a listen to this thirty-second segment and see if you can hear any at all:\n\n[Excerpt: Wilson Pickett, \"Mustang Sally\"]\n\nThat segment has the one part where I *think* I can hear one splice in the whole track, a place where the rhythm hiccups very slightly -- and that might well just be the drummer trying a fill that didn't quite come off.\n\n\"Mustang Sally\" was another pop top thirty hit, and Wexler's crossover strategy seemed to have been proved right -- so much so that Pickett was now playing pretty much all-white bills. He played, for example, at Murray the K's last ever revue at the Brooklyn Paramount, where the other artists on the bill were Mitch Ryder and the Detroit Wheels, the Young Rascals, Al Kooper's Blues Project, Cream, and the Who. Pickett found the Who extremely unprofessional, with their use of smoke bombs and smashing their instruments, but they eventually became friendly.\n\nPickett's next single was his version of \"Everybody Needs Somebody to Love\", the Solomon Burke song that the Rolling Stones had also covered, and that was a minor hit, but his next few records after that didn't do particularly well. He did though have a big hit with his cover version of a song by a group called Dyke and the Blazers. Pickett's version of \"Funky Broadway\" took him to the pop top ten:\n\n[Excerpt: Wilson Pickett, \"Funky Broadway\"]\n\nIt did something else, as well. You may have noticed that two of the bands on that Paramount bill were groups that get called \"blue-eyed soul\". \"Soul\" had originally been a term used for music made by Black people, but increasingly the term was being used by white people for their music, just as rock and roll and rhythm and blues before it had been picked up on by white musicians. And so as in those cases, Black musicians were moving away from the term -- though it would never be abandoned completely -- and towards a new slang term, \"funk\". And Pickett was the first person to get a song with \"funk\" in the title onto the pop charts.\n\nBut that would be the last recording Pickett would do at FAME for a couple of years. As with Stax, Pickett was moved away by Atlantic because of problems with another artist, this time to do with a session with Aretha Franklin that went horribly wrong, which we'll look at in a future episode. From this point on, Pickett would record at American Sound Studios in Memphis, a studio owned and run by Chips Moman, who had played on many of Pickett's records.\n\nAgain, Pickett was playing with an all-white house band, but brought in a couple of Black musicians -- the saxophone player King Curtis, and Pickett's new touring guitarist, Bobby Womack, who had had a rough few years, being largely ostracised from the music community because of his relationship with Sam Cooke's widow.\n\nWomack wrote what might be Pickett's finest song, a song called \"I'm in Love\" which is a masterpiece of metrical simplicity disguised as complexity -- you could write it all down as being in straight four-four, but the pulse shifts and implies alternating bars of five and three at points:\n\n[Excerpt: Wilson Pickett, \"I'm In Love\"]\n\nWomack's playing on those sessions had two effects, one on music history and one on Pickett. The effect on music history was that he developed a strong working relationship with Reggie Young, the guitarist in the American Sound studio band, and Young and Womack learned each other's styles. Young would later go on to be one of the top country session guitarists, playing on records by Merle Haggard, Willie Nelson, Dolly Parton, Kenny Rogers, Waylon Jennings and more, and he was using Womack's style of playing -- he said later \"I didn’t change a thing. I was playing that Womack style on country records, instead of the hillbilly stuff—it changed the whole bed of country music.\"\n\nThe other effect, though, was a much more damaging one. Womack introduced Pickett to cocaine, and Pickett -- who was already an aggressive, violent, abusive, man, became much more so.\n\n\"I'm in Love\" went to number four on the R&B charts, but didn't make the pop top forty. The follow-up, a remake of \"Stagger Lee\", did decently on the pop charts but less well on the R&B charts. Pickett's audiences were diverging, and he was finding it more difficult to make the two come together.\n\nBut he would still manage it, sporadically, throughout the sixties. One time when he did was in 1968, when he returned to Muscle Shoals and to FAME studios. In a session there, the guitarist was very insistent that Pickett should cut a version of the Beatles' most recent hit. Now obviously, this is a record that's ahead in our timeline, and which will be covered in a future episode, but I imagine that most of you won't find it too much of a spoiler when I tell you that \"Hey Jude\" by the Beatles was quite a big hit:\n\n[Excerpt: The Beatles, \"Hey Jude\"]\n\nWhat that guitarist had realised was that the tag of the song gave the perfect opportunity for ad-libbing. You all know the tag:\n\n[Excerpt: The Beatles, \"Hey Jude\"]\n\nAnd so on.\n\nThat would be perfect for a guitar solo, and for Pickett to do some good soul shouting over. Neither Pickett nor Rick Hall were at all keen -- the Beatles record had only just dropped off number one, and it seemed like a ridiculous idea to both of them. But the guitarist kept pressing to do it, and by the time the other musicians returned from their lunch break, he'd convinced Pickett and Hall. The record starts out fairly straightforward:\n\n[Excerpt: Wilson Pickett, \"Hey Jude\"]\n\nBut it's on the tag when it comes to life. Pickett later described recording that part -- “He stood right in front of me, as though he was playing every note I was singing. And he was watching me as I sang, and as I screamed, he was screaming with his guitar.”:\n\n[Excerpt: Wilson Pickett, \"Hey Jude\"]\n\nThat was not Pickett's biggest hit, but it was one of the most influential. It made the career of the guitarist, Duane Allman, who Jerry Wexler insisted on signing to his own contract after that, and as Jimmy Johnson, the rhythm guitarist on the session said, \"We realised then that Duane had created southern rock, in that vamp.\"\n\nIt was big enough that Wexler pushed Pickett to record a whole series of cover versions of rock songs -- he put out versions of \"Hey Joe\", \"Born to be Wild\" and \"You Keep Me Hangin' On\" -- the latter going back to his old technique of covering a white cover version of a Black record, as his version copied the Vanilla Fudge's arrangement rather than the Supremes' original. But these only had very minor successes -- the most successful of them was his version of \"Sugar Sugar\" by the Archies.\n\nAs the sixties turned into the seventies, Pickett continued having some success, but it was more erratic and less consistent. The worlds of Black and white music were drifting apart, and Pickett, who more than most had straddled both worlds, now found himself having success in neither.\n\nIt didn't help that his cocaine dependency had made him into an egomaniac. At one point in the early seventies, Pickett got a residency in Las Vegas, and was making what by most standards was a great income from it. But he would complain bitterly that he was only playing the small room, not the big one in the same hotel, and that the artist playing the big room was getting better billing than him on the posters. Of course, the artist playing the big room was Elvis Presley, but that didn't matter to Pickett -- he thought he deserved to be at least that big.\n\nHe was also having regular fights with his record label. Ahmet Ertegun used to tell a story -- and I'm going to repeat it here with one expletive cut out in order to get past Apple's ratings system. In Ertegun's words “Jerry Wexler never liked Crosby, Stills & Nash because they wanted so much freaking artistic autonomy. While we were arguing about this, Wilson Pickett walks in the room and comes up to Jerry and says, ‘Jerry,’ and he goes, ‘Wham!’ And he puts a pistol on the table. He says, ‘If that [Expletive] Tom Dowd walks into where I’m recording, I’m going to shoot him. And if you walk in, I’m going to shoot you. ‘Oh,’ Jerry said. ‘That’s okay, Wilson.’ Then he walked out. So I said, ‘You want to argue about artistic autonomy?’ ”\n\nAs you can imagine, Atlantic were quite glad to get rid of Pickett when he decided he wanted to move to RCA records, who were finally trying to break into the R&B market. Unfortunately for Pickett, the executive who'd made the decision to sign him soon left the company, and as so often happens when an executive leaves, his pet project becomes the one that everyone's desperate to get rid of.  RCA didn't know how to market records to Black audiences, and didn't really try, and Pickett's voice was becoming damaged from all the cocaine use.\n\nHe spent the seventies, and eighties going from label to label, trying things like going disco, with no success. He also went from woman to woman, beating them up, and went through band members more and more quickly as he attacked them, too. The guitarist Marc Ribot was in Pickett's band for a short time and said, (and here again I'm cutting out an expletive) \" You can write about all the extenuating circumstances, and maybe it needs to be put in historical context, but … You know why guys beat women? Because they can. And it’s abuse. That’s why employers beat employees, when they can. I’ve worked with black bandleaders and white bandleaders who are respectful, courteous and generous human beings—and then I’ve worked with Wilson Pickett.\"\n\nHe was becoming more and more paranoid. He didn't turn up for his induction in the rock and roll hall of fame, where he was scheduled to perform -- instead he hid in his house, scared to leave.\n\nPickett was repeatedly arrested throughout this time, and into the nineties, spending some time in prison, and then eventually going into rehab in 1997 after being arrested for beating up his latest partner. She dropped the charges, but the police found the cocaine in his possession and charged him with that.\nAfter getting out, he apparently mellowed out somewhat and became much easier to get along with -- still often unpleasant, especially after he'd had a drink, which he never gave up, but far less violent and more easy-going than he had been. He also had something of a comeback, sparked by an appearance in the flop film Blues Brothers 2000. He recorded a blues album, It's Harder Now, and also guested on Adlib, the comeback duets album by his old friend Don Covay, singing with him and cowriting on several songs, including \"Nine Times a Man\":\n\n[Excerpt: Don Covay and Wilson Pickett, \"Nine Times a Man\"]\n\nIt's Harder Now was a solid blues-based album, in the vein of similar albums from around that time by people like Solomon Burke, and could have led to Pickett having the same kind of late-career resurgence as Johnny Cash. It was nominated for a Grammy, but lost in the category for which it was nominated to Barry White. Pickett was depressed by the loss and just decided to give up making new music, and just played the oldies circuit until 2004, at which point he became too ill to continue. The duet with Covay would be the last time he went into the studio.\n\nThe story of Pickett's last year or so is a painful one, with squabbles between his partner and his children over his power of attorney while he spent long periods in hospital, suffering from kidney problems caused by his alcoholism, and also at this point from bulimia, diabetes, and more. He was ill enough that he tried to make amends with his children and his ex-wife, and succeeded as well as anyone can in that situation. On the eighteenth of January 2006, two months before his sixty-fifth birthday, his partner took him to get his hair cut and his moustache shaped, so he'd look the way he wanted to look, they ate together at his assisted living facility, and prayed together, and she left around eleven o'clock that night. Shortly thereafter, Pickett had a heart attack and died, alone, some time close to the midnight hour.",
  "enclosure": "",
  "itunes:summary": "Episode 134 of A History of Rock Music in Five Hundred Songs looks at “In the Midnight Hour\", the links between Stax, Atlantic, and Detroit, and the career of Wilson Pickett. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Mercy Mercy\" by Don Covay.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\nI say “After Arthur Alexander had moved on to Monument Records” – I meant to say “Dot Records” here, the label that Alexander moved to *before* Monument.\nI also misspeak at one point and say \"keyboard player Chips Moman\", when I mean to say \"keyboard player Spooner Oldham\". This is correct in the transcript/script, I just misread it.\nResources\n\nNo Mixcloud this week, as there are too many songs by Pickett.\n\nThe main resource I used for the biographical details of Wilson Pickett was In the Midnight Hour: The Life and Soul of Wilson Pickett.\n\nInformation about Stax comes primarily from two books: Soulsville USA: The Story of Stax by Rob Bowman, and Respect Yourself: Stax Records and the Soul Explosion by Robert Gordon.\n\nCountry Soul by Charles L Hughes is a great overview of the soul music made in Muscle Shoals, Memphis, and Nashville in the sixties.\n\nThe episodes of Cocaine and Rhinestones I reference are the ones on Owen Bradley and the Nashville A-Team.\n\nAnd information on the Falcons comes from Marv Goldberg.\n\nPickett's complete Atlantic albums can be found in this excellent ten-CD set. For those who just want the hits, this single-CD compilation is significantly cheaper.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\nA quick note before I start, just to say that this episode contains some discussion of domestic abuse, drug use, and abuse of employees by their employer, and one mention of an eating disorder. Also, this episode is much longer than normal, because we've got a lot to fit in.\n\nToday we're going to move away from Motown, and have a look at a record recorded in the studios of their great rival Stax records, though not released on that label. But the record we're going to look at is from an artist who was a bridge between the Detroit soul of Motown and the southern soul of Stax, an artist who had a foot in both camps, and whose music helped to define soul while also being closer than that of any other soul man to the music made by the white rock musicians of the period.\n\nWe're going to look at Stax, and Muscle Shoals, and Atlantic Records, and at Wilson Pickett and \"In the Midnight Hour\"\n\n[Excerpt: Wilson Pickett: \"In the Midnight Hour\"]\n\nWilson Pickett never really had a chance. His father, Wilson senior, was known in Alabama for making moonshine whisky, and spent time in prison for doing just that -- and his young son was the only person he told the location of his still. Eventually, Wilson senior moved to Detroit to start earning more money, leaving his family at home at first. Wilson junior and his mother moved up to Detroit to be with his father, but they had to leave his older siblings in Alabama, and his mother would shuttle between Michigan and Alabama, trying vainly to look after all her children.\n\nEventually, Wilson's mother got pregnant while she was down in Alabama, which broke up his parents' marriage, and Wilson moved back down to Alabama permanently, to live on a farm with his mother. But he never got on with his mother, who was physically abusive to him -- as he himself would later be to his children, and to his partners, and to his bandmates.\n\nThe one thing that Wilson did enjoy about his life in Alabama was the gospel music, and he became particularly enamoured of two gospel singers, Archie Brownlee of the Five Blind Boys of Mississi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 134 of A History of Rock Music in Five Hundred Songs looks at “In the Midnight Hour\", the links between Stax, Atlantic, and Detroit, and the career of Wilson Pickett. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Mercy Mercy\" by Don Covay.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\nI say “After Arthur Alexander had moved on to Monument Records” – I meant to say “Dot Records” here, the label that Alexander moved to *before* Monument.\nI also misspeak at one point and say \"keyboard player Chips Moman\", when I mean to say \"keyboard player Spooner Oldham\". This is correct in the transcript/script, I just misread it.\nResources\n\nNo Mixcloud this week, as there are too many ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}