{
  "title": "Harnessing Algorithms for Healthier Hearts",
  "link": "https://datasciencebowl.com/harnessing-algorithms-for-healthier-hearts/",
  "dc:creator": "admin",
  "pubDate": "Wed, 22 Jan 2020 19:22:42 +0000",
  "category": "Data Science",
  "guid": "https://datasciencebowl.com/?p=5908",
  "description": "<p>“The passion and technical expertise of the global data science community that is harnessed by the Data Science Bowl is extraordinary. They have been able to push the boundaries of what’s possible in this extremely complex and important challenge.” -Josh Sullivan, Booz Allen Hamilton senior vice president and artificial intelligence lead Each year, Booz Allen [...]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/harnessing-algorithms-for-healthier-hearts/\">Harnessing Algorithms for Healthier Hearts</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n",
  "content:encoded": "<p><em>“The passion and technical expertise of the global data science community that is harnessed by the Data Science Bowl is extraordinary. They have been able to push the boundaries of what’s possible in this extremely complex and important challenge.”</em></p>\n<p><em>&#8211;</em><a href=\"https://datasciencebowl.com/data-science-bowl-algorithm-could-transform-cardiac-care/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Josh Sullivan</em></a>, Booz Allen Hamilton senior vice president and artificial intelligence lead</p>\n<p>Each year, Booz Allen partners with Kaggle, the world’s leading online data science community, to challenge people across the globe to use their passion, grit, and curiosity to change the world in areas from <a href=\"https://www.3blmedia.com/News/Hatfield-Marine-Science-Center-Director-Praises-Data-Science-Bowl\" target=\"_blank\" rel=\"noopener noreferrer\">ocean health</a> to <a href=\"https://www.3blmedia.com/News/Booz-Allen-Kaggle-Challenge-Data-Scientists-Medical-Community-Improve-Cancer-Screening-using\" target=\"_blank\" rel=\"noopener noreferrer\">lung cancer detection</a> to <a href=\"https://www.3blmedia.com/News/Booz-Allen-Kaggles-Annual-Data-Science-Competition-Puts-Artificial-Intelligence-Work\" target=\"_blank\" rel=\"noopener noreferrer\">biomedical research</a>.</p>\n<p>During a 90-day period, participants gain access to unique data sets and are issued a specific challenge using the power of data science and artificial intelligence. The 2019 competition is focused on <a href=\"https://www.3blmedia.com/News/Booz-Allen-Kaggle-PBS-KIDS-Team-2019-Data-Science-Bowl\" target=\"_blank\" rel=\"noopener noreferrer\">improving early childhood education</a>, and concludes next week with winners to be announced in early next month.</p>\n<p>In recognition of American Heart Month this February, we’re highlighting a past challenge focused on cardiac health, and its lasting impact.</p>\n<p><strong>A slow, manual process</strong></p>\n<p>The heart’s ability to efficiently pump blood—a key indicator of heart disease—is traditionally measured through magnetic resonance imaging (MRI). It can take a specially trained cardiologist up to 20 minutes to read MRI images. The process is manual—and during this time, the physician could be delivering other aspects of patient care.</p>\n<p>In a Data Science Bowl competition with the National Institutes of Health (NIH), Booz Allen and Kaggle rallied the global data science community in a challenge: develop an algorithm to automate the assessment process—and drastically cut the time and cost of diagnosing heart disease.</p>\n<p><strong>An unprecedented pool of data</strong></p>\n<p>The National Institutes of Health and Children’s National Medical Center compiled images from more than 1,000 patients—a data set larger than any previously released data set of its kind. Images represented a broad spectrum of individuals with different ages and genders, to ensure that algorithms would reflect the demands of real-world patient-care.</p>\n<p>In 2016,  nearly 5,000 participants responded to the Data Science Bowl challenge, submitting 9,300 algorithms for consideration. The winning algorithms used AI to achieve in just seconds what takes a skilled cardiologist up to 20 minutes.</p>\n<p><strong>An enduring impact on cardiac care—and MRI analysis</strong></p>\n<p>The impact lasts beyond the 90-day challenge. A more efficient measurement process enhances physicians’ ability to diagnose heart conditions early—and proactively create robust treatment plans for stopping this silent killer.</p>\n<p>The Data Science Bowl also inspired further progress in the area of MRI analysis. Researchers from around the world have been training algorithms to detect contours in the heart, which are critical for cardiologists’ diagnoses. In one example, NIH researchers are using artificial intelligence and an open-source processing platform to analyze MRI images—delivering results, including the heart’s contours, within 20-30 seconds.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/harnessing-algorithms-for-healthier-hearts/\">Harnessing Algorithms for Healthier Hearts</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n"
}