{
  "title": "Delivering on our $1 billion commitment in Africa",
  "link": "https://blog.google/around-the-globe/google-africa/delivering-on-our-1b-commitment-in-africa/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"314zi\">Last year our CEO, Sundar Pichai, announced that Google would invest $1 billion in Africa over the next five years to support a range of initiatives, from improved connectivity to investment in startups, to help boost Africa’s digital transformation.</p><p data-block-key=\"afer1\">Africa’s internet economy has the potential to grow to <a href=\"https://www.ifc.org/wps/wcm/connect/publications_ext_content/ifc_external_publication_site/publications_listing_page/google-e-conomy\">$180 billion by 2025</a> – 5.2% of the continent’s GDP. To support this growth, over the last year we’ve made progress on helping to enable affordable access and on building products for every African user – helping businesses build their online presence, supporting entrepreneurs spur next-generation technologies, and helping nonprofits to improve lives across the continent.</p><p data-block-key=\"cuqbr\">We’d like to share how we’re delivering on our commitment and partnering with others – policymakers, non-profits, businesses and creators – to make the internet more useful to more people in Africa.</p><h3 data-block-key=\"ann09\">Introducing the first Google Cloud region in Africa</h3><p data-block-key=\"9b5q3\">Today we’re announcing our intent to establish a Google Cloud region in South Africa – our first on the continent. South Africa will be joining Google Cloud’s <a href=\"https://cloud.google.com/about/locations\">global network</a> of <a href=\"https://cloud.google.com/about/locations\">35 cloud regions and 106 zone</a>s worldwide.</p><p data-block-key=\"1lnu0\">The future cloud region in South Africa will bring Google Cloud services closer to our local customers, enabling them to innovate and securely deliver faster, more reliable experiences to their own customers, helping to accelerate their growth. According to research by AlphaBeta Economics for Google Cloud, the South Africa cloud region will contribute more than a cumulative USD 2.1 billion to the country’s GDP, and will support the creation of more than 40,000 jobs by 2030.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image__is-caption h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"Image shows Director for Cloud in Africa, Niral Patel, next to a heading that announces Google's intent to establish its first Cloud region in Africa\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Niral_Screengrab_gB7aWHZ.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Niral_Screengrab_gB7aWHZ.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Niral_Screengrab_gB7aWHZ.max-100x100.png \" tabindex=\"0\"/></a></div><figcaption class=\"article-image__caption article-image__is-caption-image h-c-grid__col--8 h-c-grid__col--offset-2 h-c-grid__col-l--6 h-c-grid__col-l--offset-3\"><div class=\"rich-text\"><p data-block-key=\"67cm8\">Niral Patel, Director for Cloud in Africa announces Google's intention to establish Google's first Cloud region in Africa</p></div></figcaption></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"vw9iq\">Along with the cloud region, we are expanding our network through the Equiano subsea cable and building Dedicated Cloud Interconnect sites in Johannesburg, Cape Town, Lagos and Nairobi. In doing so, we are building full scale Cloud capability for Africa.</p><h3 data-block-key=\"72vp7\">Supporting African entrepreneurs</h3><p data-block-key=\"3s6s3\">We continue to support African entrepreneurs in growing their businesses and developing their talent. Our recently announced second cohort of the <a href=\"https://www.campus.co/africa/black-founders-fund/\">Black Founders Fund</a> builds on the success of last year’s cohort, who raised $97 million in follow-on funding and have employed more than 500 additional staff since they were selected. We’re also continuing our support of African small businesses through the <a href=\"http://g.co/hustleacademy\">Hustle Academy</a> and <a href=\"https://www.google.com/business/\">Google Business Profiles</a>, and helping job seekers learn skills through Developer Scholarships and <a href=\"https://grow.google/intl/ssa/google-certificates\">Career Certifications</a>.</p><p data-block-key=\"50p9u\">We’ve also continued to support nonprofits working to improve lives in Africa, with a $40 million cash and in-kind commitment so far. Over the last year this has included:</p><ul><li data-block-key=\"ef3pp\">$1.5M investment in Career Certifications this year bringing our total Google.org funding to more than $3M since 2021</li><li data-block-key=\"6lakd\">A $3 million grant to support <a href=\"https://www.airqo.net/\">AirQo</a> in expanding their work monitoring air quality from Kampala to ten cities in five countries on the continent;</li><li data-block-key=\"50sa9\">A team of Googlers who have joined the <a href=\"https://africa.googleblog.com/2022/03/helping-africans-create-their-own.html\">Tony Elumelu Foundation</a> for 6 months, full-time and pro-bono. The team helped build a new training web and app interface to support the next million African entrepreneurs to grow and fund their businesses.</li></ul><p data-block-key=\"4d004\">Across all our initiatives, we continue to work closely with our partners – most recently with the UN to launch the Global Africa Business Initiative (GABI), aimed at accelerating Africa’s economic growth and sustainable development.</p><h3 data-block-key=\"24d1a\">Building more helpful products for Africa</h3><p data-block-key=\"3bjmo\">We recently announced plans to open the first African product development centre in Nairobi. The centre will develop and build better products for Africans and the world.</p><p data-block-key=\"7v344\">Today, we’re launching voice typing support for nine more African languages (isiNdebele, isiXhosa, Kinyarwanda, Northern Sotho, Swati, Sesotho, Tswana, Tshivenda and Xitsonga) in Gboard, the Google keyboard – while <a href=\"https://blog.google/products/translate/24-new-languages/\">24 new languages</a> are now supported on Google Translate, including Lingala, which is spoken by more than 45 million people across Central Africa.</p><p data-block-key=\"fp6m3\">To make Maps more useful, Street View imagery in Kenya, South Africa, Senegal and Nigeria has had a refresh with nearly 300,000 more kilometres of imagery now helping people virtually explore and navigate neighbourhoods. We’re also extending the service to Rwanda, meaning that Street View is now available in 11 African countries.</p><p data-block-key=\"7ar0g\">In addition to <a href=\"https://africa.googleblog.com/2022/05/google-research-enhances-its-ai-growth.html\">expanding the AI Accra Research Center</a> earlier this year, the<a href=\"https://sites.research.google/open-buildings\">Open Buildings</a> Project, which mapped buildings across the African continent using machine learning and satellite imagery, is expanding to South and Southeast Asia and is a great example of the AI centre creating solutions for Africa that are useful across the world.</p><h3 data-block-key=\"5cnk2\">Delivering on our promise</h3><p data-block-key=\"1f0kk\">We remain committed to working with our partners in building for Africa together, and helping to unlock the benefits of the digital economy for more people by providing useful products, programmes and investments. We’re doing this by partnering with African organisations, businesses and entrepreneurs. It’s the talent and drive of the individuals in the countries, communities and businesses of Africa that will power Africa’s economic growth.</p></div></div></body></html>",
  "pubDate": "Wed, 05 Oct 2022 08:00:00 +0000",
  "guid": "https://blog.google/around-the-globe/google-africa/delivering-on-our-1b-commitment-in-africa/",
  "category": [
    "Google in Africa",
    "Google Cloud",
    "Translate",
    "Next Billion Users"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Delivering on our $1 billion commitment in Africa",
    "description": "How we're partnering with policymakers, non-profits, businesses and creators to make the internet more useful to more people in Africa.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Google_for_Africa_2022_logo.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/around-the-globe/google-africa/delivering-on-our-1b-commitment-in-africa/"
  },
  "author": {
    "name": "Nitin Gajria",
    "title": "Managing Director, Google Sub-Saharan Africa",
    "department": "",
    "company": ""
  }
}