{
  "title": "No More Invasive Surgery—This Pacemaker Dissolves Instead",
  "link": "https://spectrum.ieee.org/dissolvable-pacemaker",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/animated-gif-of-a-device-with-a-coil-on-one-end-dissolving-between-days-1-and-60.gif?id=30813679&width=1200&height=600&coordinates=0%2C108%2C0%2C108\"/><br/><br/><p>After having cardiovascular surgery, many patients require a temporary pacemaker to help stabilize their heart rate. The device consists of a pulse generator, one or more insulated wires, and an electrode at the end of each wire.</p><p>The pulse generator—a metal case that contains electronic circuitry with a small computer and a battery—regulates the impulses sent to the heart. The wire is connected to the pulse generator on one end while the electrode is placed inside one of the heart’s chambers.</p><p>But there are several issues with temporary pacemakers: The generator limits the patient’s mobility, and the wires must be surgically removed, which can cause complications such as infection, dislodgment, torn or damaged tissues, bleeding, and blood clots.</p><hr/><p>Researchers have found that a dissolving pacemaker can make a real difference for patients. Last year a team of scientists at <a href=\"https://www.northwestern.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Northwestern University</a>, in Evanston, Ill., developed such a device, which will allow patients to live without being tethered to external hardware. The dissolving pacemaker is 250 micrometers thick, weighs less than half a gram, and dissolves in the patient’s body, eliminating the need for surgical removal.</p><p>In May, the researchers introduced an upgraded, smart version of the pacemaker. It connects to a network of soft, flexible wearable sensors developed by the team. These sensors monitor various physiological functions to help determine when to pace the heart and at what rate. The pacing system is completely autonomous.</p><p>The device also releases an anti-inflammatory drug while it dissolves.</p><p>“When you implant any kind of foreign hardware into the human body, cells attack that object,” explains <a href=\"https://www.feinberg.northwestern.edu/faculty-profiles/az/profile.html?xid=54955\" rel=\"noopener noreferrer\" target=\"_blank\">Igor Efimov</a>, a member of the development team and a professor of biomedical engineering at the university. He says that releasing the anti-inflammatory drug will stop the body from rejecting the pacemaker.</p><p>The device isn’t available for human use yet, but Efimov expects it to be available to patients in less than five years.</p><p>The pacemaker’s outer layer is made of a bioresorbable polyurethane. The material is thin, soft, and flexible, which were important factors to consider during development because the device is placed on the surface of a patient’s heart, says <a href=\"http://rogersgroup.northwestern.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">John Rogers</a>, who led the project. Rogers, an IEEE Fellow, is a professor of materials science and engineering, biomedical engineering, and neurological surgery at Northwestern.<br/></p><p>Encased in the bioresorbable polyurethane are the electronics. On one side there is a receiver antenna and on the other side there is a transmission coil. They are connected via a serpentine radio-frequency diode.</p><p>A small wireless patch is attached to the patient’s chest, directly above the pacemaker. Electrodes are located on the side of the patch that is in direct contact with the person’s skin. Inside the device there is a small battery and a transmission coil. The electrodes record an electrocardiogram (ECG) on the patient and help regulate impulses sent to the heart.</p><p>The transmission coils in the patch and the pacemaker couple wirelessly. An oscillating magnetic field produced by the battery induces current in the patch’s coil. The current is then passed into the coil in the pacemaker to power the device and control the heart’s pacing rate.</p><p>If the pacemaker detects that the patient’s heart rate drops below a certain rate, the device activates the transmission coil in the patch. This powers the pacemaker, allowing it to bring the patient’s heart rate back up to a healthy level.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Close up of a tablet screen next to a person with two white devices affixed to their chest.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c2199e13fb9080a3eb48971e2c278bf0\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"61f1e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/close-up-of-a-tablet-screen-next-to-a-person-with-two-white-devices-affixed-to-their-chest.jpg?id=30813688&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">A small wireless patch attached to the patient’s chest records an ECG, which is then sent to a mobile app and available for the patient’s doctor to monitor.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Northwestern University</small></p><p>The receiver antenna inside the pacemaker collects data on the patient’s heart rate and sends it to a mobile app using <a data-linked-post=\"2650277409\" href=\"https://spectrum.ieee.org/smart-tags-add-touch-controls-to-ordinary-objects\" target=\"_blank\">Near Field Communication protocols</a>—the same technology used in smartphones and RFID tags. The data is monitored by the patient’s doctor.</p><p>The process of dissolution starts immediately after the device is implanted. The bioresorbable polyurethane is the first material to dissolve.</p><p>Each device will be designed and made for individual patients. If a surgeon needs a patient’s pacemaker to last for two weeks, the team will design the device so it maintains its integrity for the required time period, Rogers says.</p><p>While it is possible to measure how fast a patient’s heart is beating solely based on ECG results, Rogers says, outside factors such as physical activity, the patient’s blood type, and their resting heart rate can affect the heart. So Rogers and his team developed a network of sensors that monitor the patient’s body temperature, oxygen levels, respiration, physical activity, muscle tone, and the heart’s electrical activity.</p><p>There are currently three units: one for the chest, the forehead, and the neck. The pacemaker’s system automatically analyzes the data collected by these sensors. If it detects abnormal cardiac rhythms, the pacemaker will change the impulse of the heart rate.</p><p>“If normal activity is regained, then it stops pacing,” Efimov explains. “This is important because if you stimulate the heart when it’s unnecessary, then you risk inducing arrhythmia.”</p>",
  "pubDate": "Wed, 10 Aug 2022 14:47:35 +0000",
  "guid": "https://spectrum.ieee.org/dissolvable-pacemaker",
  "category": [
    "Biomedical electronics",
    "Northwestern university",
    "Pacemaker",
    "Medical devices"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}