{
  "title": "Proposed Amendment to the IEEE Constitution on the Ballot",
  "link": "https://spectrum.ieee.org/proposed-amendment-to-the-constitution",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/people-making-corrections-on-a-giant-piece-of-paper.jpg?id=30444058&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>At its November 2021 meeting, the <a href=\"https://www.ieee.org/about/corporate/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Board of Directors</a> voted to propose an amendment to the <a href=\"https://www.ieee.org/content/dam/ieee-org/ieee/web/org/about/corporate/ieee-constitution-and-bylaws.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Constitution</a>, Article XIV—Amendments.</p><p>The proposed amendment seeks to ensure that any member-initiated petition proposal to amend the IEEE Constitution receives participation from all geographic regions.</p><hr/><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img class=\"rm-shortcode\" data-rm-shortcode-id=\"a419a2672e5d7e40c1c3aba0d55677f3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"02f7f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.png?id=30444362&width=980\"/>\n</p><h2>Supporting and Opposing Statements</h2><p>Members have been discussing and sharing their views on the proposed amendment on the <a href=\"https://ieee-collabratec.ieee.org/app/community/1355/IEEE-Constitutional-Amendment-Article-XIV-Amendments-Discussion-Forum/activities\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Collabratec</a> discussion forum. To ensure a collaborative environment, the forum is moderated by the <a href=\"https://www.ieee.org/content/dam/ieee-org/ieee/web/org/about/whatis/election_oversight_committee.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Election Oversight Committee</a>.</p><p>These two statements, along with a link to the discussion forum, will accompany the proposed amendment on the IEEE Annual Election Ballot. </p><p>In Support Statement: The proposed amendment reflects changes in IEEE membership and in the emergence of global electronic communications. In 1963 IEEE had 150,000 members, 93 percent of which were in today’s Regions 1-6 in the U.S., and electronic communications were almost non-existent. Today IEEE has over 400,000 members, with approximately 1/3 in Regions 1-6, 1/3 in Region 10, and 1/3 in Regions 7, 8, and 9, and global, personal electronic communication is instant and ubiquitous. </p><p>Given the evolution of global membership distribution and the enablement of electronic communications and IEEE electronic petitions, IEEE is today able to ensure equity across all Regions and encourage deeper membership engagement through the requirement that every Region have a voice in proposed constitutional changes, without the great burden of collecting paper signatures. The proposed amendment ensures that future proposed constitutional changes reflect global member interests in a global organization, encourages professional collaboration across regional boundaries, and results in a more balanced, equitable, and scalable IEEE that will keep pace with change, both in global membership and relevant technologies, and continue to support the careers and technical lives of our members.</p><p> In Opposition Statement: The IEEE Board of Directors (BoD) is correct to assert that “IEEE’s Constitution is IEEE’s highest-level governance document that affects all Members and rarely should change.” As such, no change should be made unless substantial evidence is provided that the Constitution has a critical flaw that needs fixed. Such evidence was not provided, and so the proposed amendment should be rejected.</p><p>No evidence was provided that the current Constitution is resulting in a large number of member-initiated petitions. If such petitions are currently rare, then the proposed amendment to make the requirements much more onerous will make it impossible for a member to bring an amendment to the ballot.</p><p>The proposed amendment will require collecting over 3,000 signatures, which is nearly impossible given the time required to locate, contact, communicate with, and discuss with so many members. The proposed 0.333 percent requirement per region will make member-initiated petitions impossible, given the broad geographical locations and the wide variety of languages spanned in the countries covered in the regions. To place an amendment on the ballot would require such an extensive investment in time and finances that only the very rich would have a chance of bringing an amendment to the ballot.</p><p>Members can participate in the forum until it closes at 11:59 EDT on 14 August. It will become accessible to members in “read only” mode when balloting for the 2022 IEEE Annual Election begins on 15 August.</p><h2>More Information on the 2022 Election</h2><p>To adopt this amendment, an affirmative vote of at least two-thirds of all ballots cast is required, provided that the total number of those voting is at least 10 percent of all IEEE members who are eligible to vote on record as of 30 June 2022. For more details on the proposed amendment, the process for proposed amendment petitions, and election deadlines, visit the <a href=\"https://www.ieee.org/about/corporate/election/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE elections website</a>.</p>",
  "pubDate": "Tue, 02 Aug 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/proposed-amendment-to-the-constitution",
  "category": [
    "Ieee news",
    "Ieee election",
    "Constitutional amendment",
    "Type:ti"
  ],
  "dc:creator": "IEEE Corporate Governance Team",
  "media:content": ""
}