{
  "title": "Episode 14&#8243;Jambalaya&#8221; by Hank Williams",
  "link": "https://500songs.com/podcast/jambalaya-by-hank-williams/",
  "pubDate": "Mon, 07 Jan 2019 21:51:55 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/jambalaya-by-hank-williams/",
  "description": "Welcome to episode fourteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Jambalaya\" by Hank Williams. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Erratum</strong>\n\nI list \"Lovesick Blues\" among the songs Williams wrote. Of course, he didn't write that one, just recorded a cover version of it.\n\nFirst, a brief apology -- this podcast is up about twenty hours later than normal. I used up my buffer over the Christmas and New Year period, and had to deal with some family stuff on Saturday, my usual day for recording new episodes, so everything was thrown out a bit. Everything should be back to normal by next episode.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-14-jambalaya/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many good biographies of Hank WIlliams, but <a href=\"https://amzn.to/2RyuFY6\">Colin Escott's</a> is generally considered the best.\n\nWilliams' recordings are all in the public domain now, so there are many great, cheap, compilations of it. <a href=\"https://amzn.to/2SCIdil\">This one</a>, with ten CDs for ten pounds, is probably the best value.\n\nAnd I mention an episode of <em>Cocaine and Rhinestones</em> in the podcast. <a href=\"https://cocaineandrhinestones.com/rusty-doug-kershaw-cajun-way\">This</a> is the episode I'm talking about.\n\nThe episode on Bob Wills I mention is <a href=\"https://www.500songs.com/e/episode-3-ida-red/\">here</a>, to save you digging through the archives.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThe music that became rock and roll had many different progenitors. The cliche -- which we've already established as being very wrong -- is that it was a mixture of the blues and country music.\n\nWhile that's very far from being the actual truth, we've also seen that country and western did have a substantial influence on the development of rock and roll. And yet so far we've only looked at one country and western star -- Bob Wills, back in episode three.\n\nNow, this is probably the correct balance -- early rock and roll grew primarily out of rhythm and blues records -- but it would be ahistorical in the extreme if we were to completely ignore the growth of the hillbilly boogie, which is the branch of music that eventually led to much of what we now think of as rock and roll and rockabilly. Obviously, even from its name you can tell that hillbilly boogie was hugely influenced by boogie and R&B, but it was its own unique thing as well.\n\nIf you haven't heard of it, hillbilly boogie is a type of music that grew out of Western Swing, and which itself later turned into honky-tonk music. It's music that combined country music instruments -- guitars, fiddles, and steel guitars, primarily -- with the rhythms of boogie music, and it was a big, big, genre in the late forties and fifties. It was less subtle than Western Swing was, with most of its subjects being drinking, fighting, sex, and boogie-woogie, in approximately that order of importance. This was party music, for working-class white men who wanted to get drunk, hit something, and have sex with something.\n\nBut as is often the case with music that appeals to such primal emotions, much of the music had a power to it that was far greater than one might expect from the description, and some of it rises to the status of actual great art. And in the right hands, some of the hillbilly boogie music could be as powerful as any music around.\n\nThe hillbilly boogie craze started in 1945, with a record called \"Guitar Boogie\" by Arthur Smith:\n\n[excerpt: \"Guitar Boogie\" by Arthur Smith]\n\nYou can hear in that some of the Django Reinhardt influence we've already seen in the Western Swing genre -- that's still a fairly sedate version of hillbilly boogie, more intellectual than it quickly became. A few years later, the genre had gone a lot further down into the gutter:\n\n[excerpt: \"Shotgun Boogie\" by Tennessee Ernie Ford]\n\nSo today, we're going to talk about a song that was -- as far as we can tell -- a collaboration between two greats of the country field: Hank Williams, who is pretty much the epitome of the 1950s country musician, a man who could perform in many country and western subgenres; and Moon Mullican, who was a far less versatile musician, one who pretty much only played hillbilly boogie, but who managed to be a massive influence on early rock and roll as a result.\n\nYou've probably heard of Hank Williams, but you've probably *not* heard of Moon Mullican, yet Mullican was massively important to the development of both country and rock music. He was a hillbilly boogie piano player who could play faster than almost anyone around, and who could keep a pounding left hand going while playing lightning-fast trills with his right. If you listen to his piano playing, you can see in particular exactly where the other great Louisiana piano player Jerry Lee Lewis takes his style from.\n\nMullican was, like many of the hillbilly boogie players, equally influenced both by country and blues music. You can hear the influence of people like Bob Wills very clearly in his music, but you can also hear people like Bessie Smith or, especially, Big Joe Turner, in his style. Most of his early influences were blues singers, although he didn't sound very blues:\n\n[excerpt: Moon Mullican \"What's the Matter with the Mill?\"]\n\nThat's a cover of an old Memphis Minnie blues song, but it's absolutely country and western in Mullican's performance. We're again looking at one of those musicians who would take influences from everywhere, but transmute them into his own style. And this is something we need to talk about more when we talk about influence.\n\nThere are, roughly, three things you can do when you hear something you like from outside your genre. One is to completely ignore it and continue ploughing your own field. Another is to switch over completely and copy it totally, either for one song (like the white people who would record knock-offs of black hits) or for the rest of your career -- we'll later be looking at the way that young white English men were so impressed by the blues that they set out to sound as much as possible like older black American men.\n\nBut the third thing you can do -- the one that tends to lead to the most interesting music, and to the best art in any medium and genre, is to take what appeals to you about the other work, see what about it you can get to work with your own style, and incorporate it. Cover your inspiration's song, but do it in your own style and arrangement. Borrow that rhythm, but put your own melody line and lyrics over it. That's the way most truly interesting creative artists work, and it's what Mullican did. You hear any of his records, and you can hear a whole host of different influences in there, but he's not directly copying any of them.\n\nPeople like that are the most important vectors for different musical ideas and the creation of new genres, and the most important influence that Mullican brought into country music, and which through him became a major influence on rock and roll, was Cajun music.\n\nCajun music is music made by the Cajun people in Louisiana. There's a whole lot of stuff around Cajun people that involves social class and racial stuff that, frankly, I'm not the best person to talk about -- I'm likely to say something that is very offensive while trying to be well-meaning, because I simply don't know enough to talk sensibly. But the main thing you need to know here is that Cajun people are -- or certainly were at this point -- looked down upon by other residents of Louisiana, and by other Americans, and they have their own culture -- they have their own cooking, largely involving things that many other cultures would discard as inedible, very heavily spiced; and they have their own language, Cajun French, rather than speaking English as so many other people in the US do.\n\nIt's Cajun and Creole culture which makes New Orleans, and Louisiana more generally, such a unique place, and which makes its music so different from the rest of the US. That's not the only factor, of course, but it's a big one.\n\nWe've talked a little bit already about New Orleans music, and Cajun music definitely plays a part in that style. But Cajun music has its own unique traditions, which we can only briefly touch upon here. If you're interested in hearing more about Cajun music as it applies to *country* music, as opposed to its influence on rock and roll, I'd recommend the episode of the great country music podcast Cocaine and Rhinestones on Doug & Rusty Kershaw. I'll link that in the show notes, and it's definitely worth checking out.\n\nBut this is, of course, a podcast about rock and roll music, and so I'm going to talk about the influence that Cajun music had on rock and roll, and that mostly came through the style of zydeco, which is a genre that mostly grew up among Creole people – black people in Louisiana who speak the same Cajun French as the white Cajuns.\n\nThe name \"zydeco\" itself, tells you quite a bit about Cajun and Creole culture generally. There are a few plausible explanations for the word's origins, but the one I prefer is that it's a mispronunciation of the phrase \"les haricots\" -- French for \"the beans\" -- as used in the Cajun French phrase \"Les haricots ne sont pas salés\" -- \"the beans aren't salty\", a phrase which idiomatically meant \"things are difficult\" or \"I'm tired\". “Zydeco ne sont pas salés\" was the title of a song recorded by the great zydeco accordion player Clifton Chenier, among others:\n\n[excerpt \"Zydeco ne sont pas sales\": Clifton Chenier]\n\nZydeco is very closely related to another genre -- fais dos dos music. This is music that's mostly played by white Cajun people, and it features the accordion and fiddle as the main instruments. Fais dos dos music has a strong Western Swing influence too, as you can hear for example in \"Bosco Stomp\" by Lawrence Walker:\n\n[excerpt \"Bosco Stomp\", Lawrence Walker]\n\nAnd Moon Mullican brought that fais dos dos music right into the mainstream of country music. You can hear it best on his hit \"New Jole Blon\" which went to number two on the country charts in 1951:\n\n[excerpt \"New Jole Blon\" by Moon Mullican]\n\nThat's a really strange mixture of fais dos dos music and Western Swing. You've got that high \"ahh\" sound that Bob Wills would make, and traditional country instrumentation, without the prominent accordion, but you've also got a thoroughly Louisiana melody, and you've got lyrics in an odd mixture of Cajun French and English, with lots of mentions of typical Cajun foods. It's a really *odd* track, frankly, not least because of the way he'll sometimes just depart totally from any conventional idea of melody and start singing random notes, trying to get as much lyric as he can into a space.\n\nThere were other Cajun musicians who played country music, of course, and vice versa, but if you listen to Mullican's records you get a real sense of someone who is equally at home with both kinds of music.\n\nNow let's talk some more about Hank Williams.\n\nI try to assume, when I make these podcasts, that the people listening to them have absolutely no idea about any of the music I'm talking about -- for everyone who knows far more details about the career of Benny Goodman or Bob Wills than I could ever fit into a half-hour podcast episode, there's someone who has literally never heard of those people, and I try to make these shows equally listenable to both.\n\nI'm going to try that with Hank Williams as well, but that means I'll possibly be sounding patronising to some of you. Hank Williams is, by far, the most famous person I've dealt with so far in this series, and so you might think that I could just skip over the basics. But rest assured, there is someone listening to this who has never heard of Hank Williams and will appreciate the background.\n\nSo, Hank Williams was, as you may have guessed from that preamble, the most important single figure in country music, possibly ever and certainly after the death of Jimmie Rodgers. He had thirty-five hits in the country top ten, of which eleven went to number one in the country chart, and he wrote dozens upon dozens of country and gospel classics -- \"I Saw the Light\", \"I'm So Lonesome I Could Cry\", \"Lovesick Blues\", \"Your Cheatin' Heart\", \"Cold Cold Heart\", \"Hey Good Lookin'\" and far more than I could name here. He was, in short, the most important songwriter alive during his very short career.\n\nAnd it *was* a very short career. His career as a recording artist started in 1946 -- though he'd been a live performer for quite a few years already by then -- and ended in 1952. In that six-year period, he basically redefined country and western music.\n\nUnlike Moon Mullican, who basically did his one thing very, very well, but didn't do anything else, Hank Williams varied his style enormously. Where Mullican would pull different genres into his own style and incorporate them, Williams would somehow make the definitive records in a whole slew of different subgenres, while still always sounding like himself.\n\nHe started out, as so many musicians in the 1940s did, basically as a Jimmie Rodgers tribute act. Jimmie Rodgers the Singing Brakeman -- not to be confused with the similarly-named blues musician -- was one of those people who, if this series was going just a little further back in time, we would definitely be covering. His yodelling country blues was the most popular country music of his time, and massively influential on everyone.\n\nOne of the things I've talked about a lot in this series is the way that black and white musicians would collaborate and bounce ideas between each other far more than most modern people believe. While I would never for one second want to downplay the massive amounts of racism in the early twentieth century (or even the levels at the moment, which are lesser but not as much less as many of us would like) there was not as much segregation by genre as modern listeners will assume. Jimmie Rodgers, as an obvious example, is considered the founder of country music, but listen to this:\n\n[excerpt: \"Blue Yodel Number 9\"]\n\nThat's Jimmie Rodgers on vocals, singing in his normal style, backed by Louis Armstrong and Lilian Hardin Armstrong. That's the father of country music playing with two of the greatest black musicians of their time, singing a song which is far closer to the blues of W.C. Handy than to what most people now think of as country music. And this was the most influential country singer of the thirties.\n\nEvery country and western performer in the late thirties and forties was working in the margins of what Jimmie Rodgers did, but by the time Hank Williams finally got a record contract, he was very much his own man.\n\nHis first big hit, \"Move it on Over\" in 1947, is a fun example of hillbilly boogie. Indeed, if you listen to it, you might see the resemblance to a very famous rock and roll song we'll be looking at in a few weeks:\n\n[Excerpt: \"Move it on Over\" by Hank Williams]\n\nBut that wasn't the only style that Williams could do -- he made gospel records, heartbreaking ballads, and uptempo dance music, and he was good at all of it. He wrote a catalogue of songs that still gets covered -- a lot -- to this day, and he was popular enough that his name has given his son and grandson successful careers in the country music world, though neither of them has one millionth his talent.\n\nAnd like Jimmie Rodgers, Hank Williams' appeal crossed racial boundaries. Johnny Otis used to tell a story about his tour bus stopping at a truck stop somewhere in the middle of the US, and getting out and seeing Williams there. Otis was a fan of Williams, and struck up a conversation, introducing him to Little Esther -- and it turned out that Hank was a Johnny Otis fan. They all chatted and got back on the bus, and it drove off. Little Esther's mother asked Esther who she'd been speaking to, and she said \"Just some cowboy\", but when Otis said it was Hank Williams, Esther's mother screamed \"you turn this bus round right now!\" -- she was a fan and she desperately wanted to meet him.\n\nFats Domino, too, was a fan of Hank Williams, and so were many other rhythm and blues musicians. Williams was listening to rhythm and blues, and rhythm and blues musicians were listening to him. Don't let the cowboy hat fool you. EVERYONE was listening to Hank Williams, except for the pop audience -- and even they were listening to WIlliams' songs when, for example, Tony Bennett recorded them:\n\n[excerpt: Tony Bennett \"Cold Cold Heart\"]\n\nAt the time we're talking about his career was on the way down. He was twenty-eight years old, but he was often in agony with back pain, and he was drinking too much and taking too many pills to numb the pain. He was getting divorced from his first wife, who was also his manager, and he was missing so many shows due to alcoholism that he was about to get fired from the Grand Ole Opry, the popular country radio show which was responsible more than anything else for making him a star. His life was, frankly, in a mess.\n\nBut he was still the most popular singer in country and western music, and he was still making great records -- and one of the records he made, in June 1952, was a song he probably co-wrote with Moon Mullican, called \"Jambalaya (On the Bayou)\"\n\nI say \"probably\", because no-one knows for sure, but it seems likely that Mullican co-wrote it, but wasn't given songwriting credit because he was contracted to a different publisher than Williams. Mullican recorded his own version of the song the same month, and Mullican's version had slightly different lyrics. Let's take a listen to Mullican's version -- the less successful of the two -- first.\n\n[excerpt \"Jambalaya\" by Moon Mullican]\n\nNow let's hear an extract from Hank Williams' version:\n\n[excerpt: \"Jambalaya\" by Hank Williams]\n\nAs you can see, the two versions have a lot of basic similarities, but they both bear the unmistakeable stamp of their creators' sound on them. Mullican's has a far more hilbilly boogie or Cajun sound to it, while Williams has far more of a straight-ahead honkytonk country sound.\n\nBut both tracks still have the same basic attraction to them -- this is a celebration of Cajun culture, and in particular a celebration of the way Cajun people celebrated -- their food, their music, and their dancing. \"Jambalaya, crawfish pie and filet gumbo\", \"pick guitar, fill fruit jar, we're gonna be gay-o\". And this is at a time when Cajun people were, as far as the wider audience was concerned, about the lowest of the low if they were thought of at all. There's a defiance to the song that may not be audible to modern listeners, but is definitely there.\n\nThe guitar player on Williams' record, incidentally, is the great Chet Atkins. Like Hank, he was far more influential in country music than in rock and roll -- though he always denied that he was a country guitarist, saying rather that he was \"a guitarist, period\" -- but he was one of the great guitarists of all time, and also produced a handful of early rock and roll classics. But again, for now, just note that the session guitar player there is probably the most influential country guitarist ever.\n\nBut what we can see from both versions of \"Jambalaya\" is that there was an appetite in country music for a kind of music that was rather broader than the styles that the major labels were interested in. If you just looked at the history of Nashville pop-country, you'd think that country music was as bland and whitebread as the crooners who were dominating popular music at the time, but country music was a stranger, and more eclectic, music than the media impression of it would have you think. It was a music that had as much to do with the blues as rhythm and blues did, and which had an audience that was far happier with experiment and new ideas than you might think.\n\nIn the 1950s, this tendency in country music would lead to a number of subgenres of its own, many of which would be major influences on rock and roll. There was bluegrass, which started in the late forties and which we'll be talking about a lot later, and there was rockabilly, as well as country music sounds which never had much influence on rock and roll but which had much of the same energy, like the Bakersfield sound.\n\nBut \"Jambalaya\" is a record which had the same kind of crossover appeal as \"Choo Choo Ch'Boogie\" had in the opposite direction. Like the stew from which it takes its name, it takes elements from a variety of different areas and throws them together, creating something that had a much greater appeal than you might imagine.\n\n“Jambalaya\" would go on to be a staple of early rock and roll music -- it was especially loved by musicians from Louisiana, like Fats Domino and Jerry Lee Lewis, both of whom made great piano-driven records of the song. Williams is remembered now as a country musician, but that's largely because he died before the rock and roll craze -- had he lived, it's entirely possible we'd now be thinking of him as a rockabilly star.\n\n[excerpts: \"Jambalaya\" by Fats Domino and Jerry Lee Lewis -- short excerpts back to back]\n\nSadly, Hank Williams would not live to see the immense influence he was having on a generation of young musicians who would go on to revolutionise not only country music, but also rock and roll. Barely six months after recording \"Jambalaya\" he was dead. His back pain had led him to drink even more heavily, he'd developed even more of a dependency on pills, he'd developed a reputation for unreliability and missing shows -- he was a mess. And on New Year's Eve, 1952, while he was being driven from Tennessee to Ohio, for a show he had to play on New Year's Day, he fell asleep in the back of the car and never woke up. When his death was announced at the show he'd been driving to, the audience laughed at first – they thought it was just another excuse for him not turning up. His last single, released a month earlier, was titled \"I'll Never Get Out of This World Alive\". He was twenty-nine years old.",
  "itunes:subtitle": "Welcome to episode fourteen of A History of Rock Music in Five Hundred Songs. Today were looking at Jambalaya by Hank Williams. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum\n\nI list Lovesi",
  "itunes:keywords": "Cajun music,Chet Atkins,Clifton Chenier,country and western,Esther Phillips,fais dos dos music,Hank Williams,hillbilly boogie,Jimmie Rodgers,Johnny Otis,Moon Mullican,Tony Bennett,western swing,zydeco",
  "itunes:episodeType": "full",
  "itunes:episode": 14,
  "content:encoded": "Welcome to episode fourteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Jambalaya\" by Hank Williams. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Erratum</strong>\n\nI list \"Lovesick Blues\" among the songs Williams wrote. Of course, he didn't write that one, just recorded a cover version of it.\n\nFirst, a brief apology -- this podcast is up about twenty hours later than normal. I used up my buffer over the Christmas and New Year period, and had to deal with some family stuff on Saturday, my usual day for recording new episodes, so everything was thrown out a bit. Everything should be back to normal by next episode.\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-14-jambalaya/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many good biographies of Hank WIlliams, but <a href=\"https://amzn.to/2RyuFY6\">Colin Escott's</a> is generally considered the best.\n\nWilliams' recordings are all in the public domain now, so there are many great, cheap, compilations of it. <a href=\"https://amzn.to/2SCIdil\">This one</a>, with ten CDs for ten pounds, is probably the best value.\n\nAnd I mention an episode of <em>Cocaine and Rhinestones</em> in the podcast. <a href=\"https://cocaineandrhinestones.com/rusty-doug-kershaw-cajun-way\">This</a> is the episode I'm talking about.\n\nThe episode on Bob Wills I mention is <a href=\"https://www.500songs.com/e/episode-3-ida-red/\">here</a>, to save you digging through the archives.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThe music that became rock and roll had many different progenitors. The cliche -- which we've already established as being very wrong -- is that it was a mixture of the blues and country music.\n\nWhile that's very far from being the actual truth, we've also seen that country and western did have a substantial influence on the development of rock and roll. And yet so far we've only looked at one country and western star -- Bob Wills, back in episode three.\n\nNow, this is probably the correct balance -- early rock and roll grew primarily out of rhythm and blues records -- but it would be ahistorical in the extreme if we were to completely ignore the growth of the hillbilly boogie, which is the branch of music that eventually led to much of what we now think of as rock and roll and rockabilly. Obviously, even from its name you can tell that hillbilly boogie was hugely influenced by boogie and R&B, but it was its own unique thing as well.\n\nIf you haven't heard of it, hillbilly boogie is a type of music that grew out of Western Swing, and which itself later turned into honky-tonk music. It's music that combined country music instruments -- guitars, fiddles, and steel guitars, primarily -- with the rhythms of boogie music, and it was a big, big, genre in the late forties and fifties. It was less subtle than Western Swing was, with most of its subjects being drinking, fighting, sex, and boogie-woogie, in approximately that order of importance. This was party music, for working-class white men who wanted to get drunk, hit something, and have sex with something.\n\nBut as is often the case with music that appeals to such primal emotions, much of the music had a power to it that was far greater than one might expect from the description, and some of it rises to the status of actual great art. And in the right hands, some of the hillbilly boogie music could be as powerful as any music around.\n\nThe hillbilly boogie craze started in 1945, with a record called \"Guitar Boogie\" by Arthur Smith:\n\n[excerpt: \"Guitar Boogie\" by Arthur Smith]\n\nYou can hear in that some of the Django Reinhardt influence we've already seen in the Western Swing genre -- that's still a fairly sedate version of hillbilly boogie, more intellectual than it quickly became. A few years later, the genre had gone a lot further down into the gutter:\n\n[excerpt: \"Shotgun Boogie\" by Tennessee Ernie Ford]\n\nSo today, we're going to talk about a song that was -- as far as we can tell -- a collaboration between two greats of the country field: Hank Williams, who is pretty much the epitome of the 1950s country musician, a man who could perform in many country and western subgenres; and Moon Mullican, who was a far less versatile musician, one who pretty much only played hillbilly boogie, but who managed to be a massive influence on early rock and roll as a result.\n\nYou've probably heard of Hank Williams, but you've probably *not* heard of Moon Mullican, yet Mullican was massively important to the development of both country and rock music. He was a hillbilly boogie piano player who could play faster than almost anyone around, and who could keep a pounding left hand going while playing lightning-fast trills with his right. If you listen to his piano playing, you can see in particular exactly where the other great Louisiana piano player Jerry Lee Lewis takes his style from.\n\nMullican was, like many of the hillbilly boogie players, equally influenced both by country and blues music. You can hear the influence of people like Bob Wills very clearly in his music, but you can also hear people like Bessie Smith or, especially, Big Joe Turner, in his style. Most of his early influences were blues singers, although he didn't sound very blues:\n\n[excerpt: Moon Mullican \"What's the Matter with the Mill?\"]\n\nThat's a cover of an old Memphis Minnie blues song, but it's absolutely country and western in Mullican's performance. We're again looking at one of those musicians who would take influences from everywhere, but transmute them into his own style. And this is something we need to talk about more when we talk about influence.\n\nThere are, roughly, three things you can do when you hear something you like from outside your genre. One is to completely ignore it and continue ploughing your own field. Another is to switch over completely and copy it totally, either for one song (like the white people who would record knock-offs of black hits) or for the rest of your career -- we'll later be looking at the way that young white English men were so impressed by the blues that they set out to sound as much as possible like older black American men.\n\nBut the third thing you can do -- the one that tends to lead to the most interesting music, and to the best art in any medium and genre, is to take what appeals to you about the other work, see what about it you can get to work with your own style, and incorporate it. Cover your inspiration's song, but do it in your own style and arrangement. Borrow that rhythm, but put your own melody line and lyrics over it. That's the way most truly interesting creative artists work, and it's what Mullican did. You hear any of his records, and you can hear a whole host of different influences in there, but he's not directly copying any of them.\n\nPeople like that are the most important vectors for different musical ideas and the creation of new genres, and the most important influence that Mullican brought into country music, and which through him became a major influence on rock and roll, was Cajun music.\n\nCajun music is music made by the Cajun people in Louisiana. There's a whole lot of stuff around Cajun people that involves social class and racial stuff that, frankly, I'm not the best person to talk about -- I'm likely to say something that is very offensive while trying to be well-meaning, because I simply don't know enough to talk sensibly. But the main thing you need to know here is that Cajun people are -- or certainly were at this point -- looked down upon by other residents of Louisiana, and by other Americans, and they have their own culture -- they have their own cooking, largely involving things that many other cultures would discard as inedible, very heavily spiced; and they have their own language, Cajun French, rather than speaking English as so many other people in the US do.\n\nIt's Cajun and Creole culture which makes New Orleans, and Louisiana more generally, such a unique place, and which makes its music so different from the rest of the US. That's not the only factor, of course, but it's a big one.\n\nWe've talked a little bit already about New Orleans music, and Cajun music definitely plays a part in that style. But Cajun music has its own unique traditions, which we can only briefly touch upon here. If you're interested in hearing more about Cajun music as it applies to *country* music, as opposed to its influence on rock and roll, I'd recommend the episode of the great country music podcast Cocaine and Rhinestones on Doug & Rusty Kershaw. I'll link that in the show notes, and it's definitely worth checking out.\n\nBut this is, of course, a podcast about rock and roll music, and so I'm going to talk about the influence that Cajun music had on rock and roll, and that mostly came through the style of zydeco, which is a genre that mostly grew up among Creole people – black people in Louisiana who speak the same Cajun French as the white Cajuns.\n\nThe name \"zydeco\" itself, tells you quite a bit about Cajun and Creole culture generally. There are a few plausible explanations for the word's origins, but the one I prefer is that it's a mispronunciation of the phrase \"les haricots\" -- French for \"the beans\" -- as used in the Cajun French phrase \"Les haricots ne sont pas salés\" -- \"the beans aren't salty\", a phrase which idiomatically meant \"things are difficult\" or \"I'm tired\". “Zydeco ne sont pas salés\" was the title of a song recorded by the great zydeco accordion player Clifton Chenier, among others:\n\n[excerpt \"Zydeco ne sont pas sales\": Clifton Chenier]\n\nZydeco is very closely related to another genre -- fais dos dos music. This is music that's mostly played by white Cajun people, and it features the accordion and fiddle as the main instruments. Fais dos dos music has a strong Western Swing influence too, as you can hear for example in \"Bosco Stomp\" by Lawrence Walker:\n\n[excerpt \"Bosco Stomp\", Lawrence Walker]\n\nAnd Moon Mullican brought that fais dos dos music right into the mainstream of country music. You can hear it best on his hit \"New Jole Blon\" which went to number two on the country charts in 1951:\n\n[excerpt \"New Jole Blon\" by Moon Mullican]\n\nThat's a really strange mixture of fais dos dos music and Western Swing. You've got that high \"ahh\" sound that Bob Wills would make, and traditional country instrumentation, without the prominent accordion, but you've also got a thoroughly Louisiana melody, and you've got lyrics in an odd mixture of Cajun French and English, with lots of mentions of typical Cajun foods. It's a really *odd* track, frankly, not least because of the way he'll sometimes just depart totally from any conventional idea of melody and start singing random notes, trying to get as much lyric as he can into a space.\n\nThere were other Cajun musicians who played country music, of course, and vice versa, but if you listen to Mullican's records you get a real sense of someone who is equally at home with both kinds of music.\n\nNow let's talk some more about Hank Williams.\n\nI try to assume, when I make these podcasts, that the people listening to them have absolutely no idea about any of the music I'm talking about -- for everyone who knows far more details about the career of Benny Goodman or Bob Wills than I could ever fit into a half-hour podcast episode, there's someone who has literally never heard of those people, and I try to make these shows equally listenable to both.\n\nI'm going to try that with Hank Williams as well, but that means I'll possibly be sounding patronising to some of you. Hank Williams is, by far, the most famous person I've dealt with so far in this series, and so you might think that I could just skip over the basics. But rest assured, there is someone listening to this who has never heard of Hank Williams and will appreciate the background.\n\nSo, Hank Williams was, as you may have guessed from that preamble, the most important single figure in country music, possibly ever and certainly after the death of Jimmie Rodgers. He had thirty-five hits in the country top ten, of which eleven went to number one in the country chart, and he wrote dozens upon dozens of country and gospel classics -- \"I Saw the Light\", \"I'm So Lonesome I Could Cry\", \"Lovesick Blues\", \"Your Cheatin' Heart\", \"Cold Cold Heart\", \"Hey Good Lookin'\" and far more than I could name here. He was, in short, the most important songwriter alive during his very short career.\n\nAnd it *was* a very short career. His career as a recording artist started in 1946 -- though he'd been a live performer for quite a few years already by then -- and ended in 1952. In that six-year period, he basically redefined country and western music.\n\nUnlike Moon Mullican, who basically did his one thing very, very well, but didn't do anything else, Hank Williams varied his style enormously. Where Mullican would pull different genres into his own style and incorporate them, Williams would somehow make the definitive records in a whole slew of different subgenres, while still always sounding like himself.\n\nHe started out, as so many musicians in the 1940s did, basically as a Jimmie Rodgers tribute act. Jimmie Rodgers the Singing Brakeman -- not to be confused with the similarly-named blues musician -- was one of those people who, if this series was going just a little further back in time, we would definitely be covering. His yodelling country blues was the most popular country music of his time, and massively influential on everyone.\n\nOne of the things I've talked about a lot in this series is the way that black and white musicians would collaborate and bounce ideas between each other far more than most modern people believe. While I would never for one second want to downplay the massive amounts of racism in the early twentieth century (or even the levels at the moment, which are lesser but not as much less as many of us would like) there was not as much segregation by genre as modern listeners will assume. Jimmie Rodgers, as an obvious example, is considered the founder of country music, but listen to this:\n\n[excerpt: \"Blue Yodel Number 9\"]\n\nThat's Jimmie Rodgers on vocals, singing in his normal style, backed by Louis Armstrong and Lilian Hardin Armstrong. That's the father of country music playing with two of the greatest black musicians of their time, singing a song which is far closer to the blues of W.C. Handy than to what most people now think of as country music. And this was the most influential country singer of the thirties.\n\nEvery country and western performer in the late thirties and forties was working in the margins of what Jimmie Rodgers did, but by the time Hank Williams finally got a record contract, he was very much his own man.\n\nHis first big hit, \"Move it on Over\" in 1947, is a fun example of hillbilly boogie. Indeed, if you listen to it, you might see the resemblance to a very famous rock and roll song we'll be looking at in a few weeks:\n\n[Excerpt: \"Move it on Over\" by Hank Williams]\n\nBut that wasn't the only style that Williams could do -- he made gospel records, heartbreaking ballads, and uptempo dance music, and he was good at all of it. He wrote a catalogue of songs that still gets covered -- a lot -- to this day, and he was popular enough that his name has given his son and grandson successful careers in the country music world, though neither of them has one millionth his talent.\n\nAnd like Jimmie Rodgers, Hank Williams' appeal crossed racial boundaries. Johnny Otis used to tell a story about his tour bus stopping at a truck stop somewhere in the middle of the US, and getting out and seeing Williams there. Otis was a fan of Williams, and struck up a conversation, introducing him to Little Esther -- and it turned out that Hank was a Johnny Otis fan. They all chatted and got back on the bus, and it drove off. Little Esther's mother asked Esther who she'd been speaking to, and she said \"Just some cowboy\", but when Otis said it was Hank Williams, Esther's mother screamed \"you turn this bus round right now!\" -- she was a fan and she desperately wanted to meet him.\n\nFats Domino, too, was a fan of Hank Williams, and so were many other rhythm and blues musicians. Williams was listening to rhythm and blues, and rhythm and blues musicians were listening to him. Don't let the cowboy hat fool you. EVERYONE was listening to Hank Williams, except for the pop audience -- and even they were listening to WIlliams' songs when, for example, Tony Bennett recorded them:\n\n[excerpt: Tony Bennett \"Cold Cold Heart\"]\n\nAt the time we're talking about his career was on the way down. He was twenty-eight years old, but he was often in agony with back pain, and he was drinking too much and taking too many pills to numb the pain. He was getting divorced from his first wife, who was also his manager, and he was missing so many shows due to alcoholism that he was about to get fired from the Grand Ole Opry, the popular country radio show which was responsible more than anything else for making him a star. His life was, frankly, in a mess.\n\nBut he was still the most popular singer in country and western music, and he was still making great records -- and one of the records he made, in June 1952, was a song he probably co-wrote with Moon Mullican, called \"Jambalaya (On the Bayou)\"\n\nI say \"probably\", because no-one knows for sure, but it seems likely that Mullican co-wrote it, but wasn't given songwriting credit because he was contracted to a different publisher than Williams. Mullican recorded his own version of the song the same month, and Mullican's version had slightly different lyrics. Let's take a listen to Mullican's version -- the less successful of the two -- first.\n\n[excerpt \"Jambalaya\" by Moon Mullican]\n\nNow let's hear an extract from Hank Williams' version:\n\n[excerpt: \"Jambalaya\" by Hank Williams]\n\nAs you can see, the two versions have a lot of basic similarities, but they both bear the unmistakeable stamp of their creators' sound on them. Mullican's has a far more hilbilly boogie or Cajun sound to it, while Williams has far more of a straight-ahead honkytonk country sound.\n\nBut both tracks still have the same basic attraction to them -- this is a celebration of Cajun culture, and in particular a celebration of the way Cajun people celebrated -- their food, their music, and their dancing. \"Jambalaya, crawfish pie and filet gumbo\", \"pick guitar, fill fruit jar, we're gonna be gay-o\". And this is at a time when Cajun people were, as far as the wider audience was concerned, about the lowest of the low if they were thought of at all. There's a defiance to the song that may not be audible to modern listeners, but is definitely there.\n\nThe guitar player on Williams' record, incidentally, is the great Chet Atkins. Like Hank, he was far more influential in country music than in rock and roll -- though he always denied that he was a country guitarist, saying rather that he was \"a guitarist, period\" -- but he was one of the great guitarists of all time, and also produced a handful of early rock and roll classics. But again, for now, just note that the session guitar player there is probably the most influential country guitarist ever.\n\nBut what we can see from both versions of \"Jambalaya\" is that there was an appetite in country music for a kind of music that was rather broader than the styles that the major labels were interested in. If you just looked at the history of Nashville pop-country, you'd think that country music was as bland and whitebread as the crooners who were dominating popular music at the time, but country music was a stranger, and more eclectic, music than the media impression of it would have you think. It was a music that had as much to do with the blues as rhythm and blues did, and which had an audience that was far happier with experiment and new ideas than you might think.\n\nIn the 1950s, this tendency in country music would lead to a number of subgenres of its own, many of which would be major influences on rock and roll. There was bluegrass, which started in the late forties and which we'll be talking about a lot later, and there was rockabilly, as well as country music sounds which never had much influence on rock and roll but which had much of the same energy, like the Bakersfield sound.\n\nBut \"Jambalaya\" is a record which had the same kind of crossover appeal as \"Choo Choo Ch'Boogie\" had in the opposite direction. Like the stew from which it takes its name, it takes elements from a variety of different areas and throws them together, creating something that had a much greater appeal than you might imagine.\n\n“Jambalaya\" would go on to be a staple of early rock and roll music -- it was especially loved by musicians from Louisiana, like Fats Domino and Jerry Lee Lewis, both of whom made great piano-driven records of the song. Williams is remembered now as a country musician, but that's largely because he died before the rock and roll craze -- had he lived, it's entirely possible we'd now be thinking of him as a rockabilly star.\n\n[excerpts: \"Jambalaya\" by Fats Domino and Jerry Lee Lewis -- short excerpts back to back]\n\nSadly, Hank Williams would not live to see the immense influence he was having on a generation of young musicians who would go on to revolutionise not only country music, but also rock and roll. Barely six months after recording \"Jambalaya\" he was dead. His back pain had led him to drink even more heavily, he'd developed even more of a dependency on pills, he'd developed a reputation for unreliability and missing shows -- he was a mess. And on New Year's Eve, 1952, while he was being driven from Tennessee to Ohio, for a show he had to play on New Year's Day, he fell asleep in the back of the car and never woke up. When his death was announced at the show he'd been driving to, the audience laughed at first – they thought it was just another excuse for him not turning up. His last single, released a month earlier, was titled \"I'll Never Get Out of This World Alive\". He was twenty-nine years old.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode fourteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Jambalaya\" by Hank Williams. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum\n\nI list \"Lovesick Blues\" among the songs Williams wrote. Of course, he didn't write that one, just recorded a cover version of it.\n\nFirst, a brief apology -- this podcast is up about twenty hours later than normal. I used up my buffer over the Christmas and New Year period, and had to deal with some family stuff on Saturday, my usual day for recording new episodes, so everything was thrown out a bit. Everything should be back to normal by next episode.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many good biographies of Hank WIlliams, but Colin Escott's is generally considered the best.\n\nWilliams' recordings are all in the public domain now, so there are many great, cheap, compilations of it. This one, with ten CDs for ten pounds, is probably the best value.\n\nAnd I mention an episode of Cocaine and Rhinestones in the podcast. This is the episode I'm talking about.\n\nThe episode on Bob Wills I mention is here, to save you digging through the archives.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThe music that became rock and roll had many different progenitors. The cliche -- which we've already established as being very wrong -- is that it was a mixture of the blues and country music.\n\nWhile that's very far from being the actual truth, we've also seen that country and western did have a substantial influence on the development of rock and roll. And yet so far we've only looked at one country and western star -- Bob Wills, back in episode three.\n\nNow, this is probably the correct balance -- early rock and roll grew primarily out of rhythm and blues records -- but it would be ahistorical in the extreme if we were to completely ignore the growth of the hillbilly boogie, which is the branch of music that eventually led to much of what we now think of as rock and roll and rockabilly. Obviously, even from its name you can tell that hillbilly boogie was hugely influenced by boogie and R&B, but it was its own unique thing as well.\n\nIf you haven't heard of it, hillbilly boogie is a type of music that grew out of Western Swing, and which itself later turned into honky-tonk music. It's music that combined country music instruments -- guitars, fiddles, and steel guitars, primarily -- with the rhythms of boogie music, and it was a big, big, genre in the late forties and fifties. It was less subtle than Western Swing was, with most of its subjects being drinking, fighting, sex, and boogie-woogie, in approximately that order of importance. This was party music, for working-class white men who wanted to get drunk, hit something, and have sex with something.\n\nBut as is often the case with music that appeals to such primal emotions, much of the music had a power to it that was far greater than one might expect from the description, and some of it rises to the status of actual great art. And in the right hands, some of the hillbilly boogie music could be as powerful as any music around.\n\nThe hillbilly boogie craze started in 1945, with a record called \"Guitar Boogie\" by Arthur Smith:\n\n[excerpt: \"Guitar Boogie\" by Arthur Smith]\n\nYou can hear in that some of the Django Reinhardt influence we've already seen in the Western Swing genre -- that's still a fairly sedate version of hillbilly boogie, more intellectual than it quickly became. A few years later, the genre had gone a lot further down into the gutter:\n\n[excerpt: \"Shotgun Boogie\" by Tennessee Ernie Ford]\n\nSo today, we're going to talk about a song that was -- as far as we can tell -- a collaboration between two greats of the country field: Hank Williams, who is pretty much the epitome of the 1950",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode fourteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Jambalaya\" by Hank Williams. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum\n\nI list \"Lovesick Blues\" among the songs Williams wrote. Of course, he didn't write that one, just recorded a cover version of it.\n\nFirst, a brief apology -- this podcast is up about twenty hours later than normal. I used up my buffer over the Christmas and New Year period, and had to deal with some family stuff on Saturday, my usual day for recording new episodes, so everything was thrown out a bit. Everything should be back to normal by next episode.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many good biographies of Hank WIlliams, but Colin Escott's is generally considered the best.\n\nWilliams' recordings are all in the public domain now, so there are many gre",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}