{
  "title": "Episode 57: &#8220;Flying Saucers Rock &#8216;n&#8217; Roll&#8221; by Billy Lee Riley and the Little Green Men",
  "link": "https://500songs.com/podcast/episode-57-flying-saucers-rock-n-roll-by-billy-lee-riley-and-the-little-green-men/",
  "pubDate": "Mon, 18 Nov 2019 16:53:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=567",
  "description": "Episode fifty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Flying Saucers Rock 'n' Roll\" by Billy Lee Riley and the Little Green Men, and at the flying saucer craze of the fifties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"http://patreon.com/posts/31652277\">on \"Silhouettes\" by the Rays, and the power of subliminal messages.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-57-flying-saucers-rock-roll/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em> </a>by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. I've also relied on a lot of websites for this one, including <a href=\"http://www.rockabilly.net/billyleeriley/story.shtml\">this very brief outline of Riley's life in his own words</a>.\n\nThere are many compilations of Riley's music. <a href=\"https://amzn.to/37jDwCa\">This one,</a> from Bear Family, is probably the most comprehensive collection of his fifties work.\n\nThe Patreon episode on \"The Flying Saucer\", for backers who've not heard it, is at <a href=\"https://www.patreon.com/posts/27855307\">https://www.patreon.com/posts/27855307</a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>ERRATUM</strong>\n\nI mistakenly said “Jack Earl” instead of Jack Earls at one point.\n\n<strong>Transcript</strong>\n\nLet's talk about flying saucers for a minute.\n\nOne aspect of 1950s culture that probably requires a little discussion at this point is the obsession in many quarters with the idea of alien invasion. Of course, there were the many, many, films on the subject that filled out the double bills and serials, things like \"Flying Disc Man From Mars\", \"Radar Men From The Moon\", \"It Came From Outer Space\", \"Earth vs. the Flying Saucers\", and so on. But those films, campy as they are, reveal a real fascination with the idea that was prevalent throughout US culture at the time.\n\nWhile the term \"flying saucer\" had been coined in 1930, it really took off in June 1947 when Kenneth Arnold, a Minnesotan pilot, saw nine disc-shaped objects in the air while he was flying. Arnold's experience has entered into legend as the canonical \"first flying saucer sighting\", mostly because Arnold seems to have been, before the incident, a relatively stable person -- or at least someone who gave off all the signals that were taken as signs of stability in the 1940s. Arnold seems to have just been someone who saw something odd, and wanted to find out what it was that he'd seen.\n\nBut eventually two different groups of people seem to have dominated the conversation -- religious fanatics who saw in Arnold's vision a confirmation of their own idiosyncratic interpretation of the Bible, and people who believed that the things Arnold had seen came from another planet. With no other explanations forthcoming, he turned to the people who held to the extraterrestrial hypothesis as being comparatively the saner option.\n\nOver the next few years, so did a significant proportion of the American population. The same month as Kenneth Arnold saw his saucers, a nuclear test monitoring balloon crashed in Roswell, New Mexico. A farmer who found some of the debris had heard reports of Arnold's sightings, and put two and two together and made space aliens. The Government didn't want to admit that the balloon had been monitoring nuclear tests, and so various cover stories were put out, which in turn led to the belief in aliens becoming ever more widespread. And this tied in with the nuclear paranoia that was sweeping the nation.\n\nIt was widely known, of course, that both the USA and Russia were working on space programmes -- and that those space programmes were intimately tied in with the nuclear missiles they were also developing. While it was never stated specifically, it was common knowledge that the real reason for the competition between the two nations to build rockets was purely about weapons delivery, and that the civilian space programme was, in the eyes of both governments if not the people working on it, merely a way of scaring the other side with how good the rockets were, without going so far that they might accidentally instigate a nuclear conflict.\n\nWhen you realise this, Little Richard's terror at the launch of Sputnik seems a little less irrational, and so does the idea that there might be aliens from outer space.\n\nSo, why am I talking about flying saucers?\n\nWell, there are two reasons. The first is that, among other things, this podcast is a cultural history of the latter part of the twentieth century, and you can't understand anything about the mid twentieth century without understanding the deeply weird paranoid ideas that would sweep the culture.\n\nThe second is that it inspired a whole lot of records. One of those, \"the Flying Saucer\", I've actually already looked at briefly in one of the Patreon bonus episodes, but is worth a mention here -- it was a novelty record that was a very early example of sampling:\n\n[Excerpt: Buchanan and Goodman, \"The Flying Saucer\"]\n\nAnd there'd been \"Two Little Men in a Flying Saucer\" by Ella Fitzgerald:\n\n[Excerpt: Ella Fitzgerald, \"Two Little Men in a Flying Saucer\"]\n\nBut today we're going to look at one of the great rockabilly records, by someone who was one of the great unsung acts on Sun Records:\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Flying Saucers Rock and Roll\"]\n\nBilly Lee Riley was someone who was always in the wrong place at the wrong time -- for example, when he got married after leaving the army, he decided to move with his new wife to Memphis, and open a restaurant. The problem was that neither of them knew Memphis particularly well, and didn't know how bad the area they were opening it in was. The restaurant was eventually closed down by the authorities after only three months, after a gunfight between two of their customers.\n\nBut there was one time when he was in precisely the right place at the right time. He was an unsuccessful, down on his luck, country singer in 1955, when he was driving on Christmas morning, from his in-laws' house in Arkansas to his parents' house three miles away, and he stopped to pick up two hitch-hikers.\n\nThose two hitch-hikers were Cowboy Jack Clement and Ronald \"Slim\" Wallace, two musicians who were planning on setting up their own record company. Riley was so interested in their conversation that while he'd started out just expecting to drive them the three miles he was going, he ended up driving them the more than seventy miles to Memphis.\n\nClement and Wallace invited Riley to join their label. They actually had little idea of how to get into the record business -- Clement was an ex-Marine and aspiring writer, who was also a dance instructor -- he had no experience or knowledge of dancing when he became a dance instructor, but had decided that it couldn't be that difficult. He also played pedal steel in a Western Swing band led by someone called Sleepy-Eyed John Epley.\n\nWallace, meanwhile, was a truck driver who worked weekends as a bass player and bandleader, and Clement had joined Wallace's band as well as Epley's. They regularly commuted between Arkansas, where Wallace owned a club, and Memphis, where Clement was based, and on one of their journeys, Clement, who had been riding in the back seat, had casually suggested to Wallace that they should get into the record business. Wallace would provide the resources -- they'd use his garage as a studio, and finance it with his truck-driving money -- while Clement would do the work of actually converting the garage into a studio.\n\nBut before they were finished, they'd been out drinking in Arkansas on Christmas Eve with Wallace's wife and a friend, and Clement and the friend had been arrested for drunkenness. Wallace's wife had driven back to Memphis to be home for Christmas day, while Wallace had stayed on to bail out Clement and hitch-hike back with him.\n\nThey hadn't actually built their studio yet, as such, but they were convinced it was going to be great when they did, and when Riley picked them up he told them what a great country singer he was, and they all agreed that when they did get the studio built they were going to have Riley be the first artist on their new label, Fernwood Records. In the meantime, Riley was going to be the singer in their band, because he needed the ten or twelve dollars a night he could get from them.\n\nSo for a few months, Riley performed with Clement and Wallace in their band, and they slowly worked out an act that would show Riley's talents off to their best advantage. By May, Clement still hadn't actually built the studio -- he'd bought a tape recorder and a mixing board from Sleepy-Eyed John Epley, but he hadn't quite got round to making Wallace's garage into a decent space for recording in.\n\nSo Clement and Wallace pulled together a group of musicians, including a bass player, because Clement didn't think Wallace was good enough, Johnny Bernero, the drummer who'd played on Elvis' last Sun session, and a guitarist named Roland Janes, and rented some studio time from a local radio station. They recorded the two sides of what was intended to be the first single on Fernwood Records, \"Rock With Me Baby\":\n\n[Excerpt: Billy Lee RIley, \"Rock With Me Baby\"]\n\nSo they had a tape, but they needed to get it properly mastered to release it as a single. The best place in town to do that was at Memphis Recording Services, which Sam Phillips was still keeping going even though he was now having a lot of success with Sun.\n\nPhillips listened to the track while he was mastering it, and he liked it a lot. He liked it enough, in fact, that he made an offer to Clement -- rather than Clement starting up his own label, would he sell the master to Phillips, and come and work for Sun records instead?\n\nHe did, leaving Slim Wallace to run Fernwood on his own, and for the last few years that Sun was relevant, Cowboy Jack Clement was one of the most important people working for the label -- second only to Sam Phillips himself. Clement would end up producing sessions by Johnny Cash, Carl Perkins, Jerry Lee Lewis, and others.\n\nBut his first session was to produce the B-side to the Billy Lee Riley record. Sam Phillips hadn't liked their intended B-side, so they went back into the studio with the same set of musicians to record a \"Heartbreak Hotel\" knockoff called \"Trouble Bound\":\n\n[Excerpt: Billy Lee Riley, \"Trouble Bound\"]\n\nThat was much more to Sam's liking, and the result was released as Billy Lee Riley's first single.\n\nRiley and the musicians who had played on that initial record became the go-to people for Clement when he wanted musicians to back Sun's stars. Roland Janes, in particular, is someone whose name you will see on the credits for all sorts of Sun records from mid-56 onwards. Riley, too, would play on sessions -- usually on harmonica, but occasionally on guitar, bass, or piano.\n\nThere's one particularly memorable moment of Riley on guitar at the end of Jerry Lee Lewis' first single, a cover version of Ray Price's \"Crazy Arms\". That song had been cut more as a joke than anything else, with Janes, who couldn't play bass, on bass. Right at the end of the song, Riley picked up a guitar, and hit a single wrong chord, just after everyone else had finished playing, and while their sound was dying away:\n\n[Excerpt: Jerry Lee Lewis, \"Crazy Arms\"]\n\nSam Phillips loved that track, and released it as it was, with Riley's guitar chord on it.\n\nRiley, meanwhile, started gigging regularly, with a band consisting of Janes on guitar, new drummer Jimmy Van Eaton, and, at first, Jerry Lee Lewis on piano, all of whom would play regularly on any Sun sessions that needed musicians.\n\nNow, we're going to be talking about Jerry Lee Lewis in a couple of weeks, so I don't want to talk too much about him here, but you'll have noticed that we already talked about him quite a bit in the episode on \"Matchbox\". Jerry Lee Lewis was one of those characters who turn up everywhere, and even before he was a star, he was making a huge impression on other people's lives. So while this isn't an episode about him, you will see his effect on Riley's career. He's just someone who insists on pushing into the story before it's his turn.\n\nJerry Lee was the piano player on Riley's first session for Sun proper. The song on that session was brought in by Roland Janes, who had a friend, Ray Scott, who had written a rock and roll song about flying saucers. Riley loved the song, but Phillips thought it needed something more -- it needed to sound like it came from outer space. They still didn't have much in the way of effects at the Sun studios -- just the reverb system Phillips had cobbled together -- but Janes had a tremolo bar on his guitar. These were a relatively new invention -- they'd only been introduced on the Fender Stratocaster a little over two years earlier, and they hadn't seen a great deal of use on records yet.\n\nPhillips got Janes to play making maximum use of the tremolo arm, and also added a ton of reverb, and this was the result:\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Flying Saucers Rock and Roll\"]\n\nGreil Marcus later said of that track that it was \"one of the weirdest of early rock 'n' roll records - and early rock 'n' roll records were weird!\" -- and he's right. \"Flying Saucers Rock & Roll\" is a truly odd recording, even by the standards of Sun Records in 1957.\n\nWhen Phillips heard that back, he said \"Man that’s it. You sound like a bunch of little green men from Mars!\" -- and then immediately realised that that should be the name of Riley's backing band. So the single came out as by Billy Lee Riley and the Little Green Men, and the musicians got themselves a set of matching green suits to wear at gigs, which they bought at Lansky's on Beale Street.\n\nThose suits caused problems, though, as they were made of a material which soaked up sweat, which was a problem given how frantically active Riley's stage show was -- at one show at the Arkansas State University Riley jumped on top of the piano and started dancing -- except the piano turned out to be on wheels, and rolled off the stage. Riley had to jump up and cling on to a steel girder at the top of the stage, dangling from it by one arm, while holding the mic in the other, and gesturing frantically for people to get him down.\n\nYou can imagine that with a show like that, absorbent material would be a problem, and sometimes the musicians would lie on their backs to play solos and get the audiences excited, and then find it difficult to get themselves back to their feet again, because their suits were so heavy.\n\nRiley's next single was a cover of a blues song first recorded by another Sun artist, Billy \"the Kid\" Emerson, in 1955. \"Red Hot\" had been based on a schoolyard chant:\n\n[Excerpt: Billy \"the Kid\" Emerson, \"Red Hot\"]\n\nWhile \"Flying Saucers Rock and Roll\" had been a local hit, but not a national one, Billy was confident that his version of \"Red Hot\" would be the record that would make him into a national star:\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Red Hot\"]\n\nThe song was recorded either at the same session as \"Flying Saucers Rock and Roll\" or at one a couple of weeks later with a different pianist -- accounts vary -- but it was put on the shelf for six months, and in that six months Riley toured promoting \"Flying Saucers Rock and Roll\", and also carried on playing on sessions for Sun. He played bass on \"Take Me To That Place\" by Jack Earls:\n\n[Excerpt: Jack Earls, \"Take Me To That Place\"]\n\nRhythm guitar on \"Miracle of You\" by Hannah Fay:\n\n[Excerpt: Hannah Fay, \"Miracle of You\"]\n\nAnd much more. But he was still holding out hopes for the success of \"Red Hot\", which Sam Phillips kept telling him was going to be his big hit.\n\nAnd for a while it looked like that might be the case. Dewey Phillips played the record constantly, and Alan Freed tipped it to be a big hit. But for some reason, while it was massive in Memphis, the track did nothing at all outside the area -- the Memphis musician Jim Dickinson once said that he had never actually realised that \"Red Hot\" hadn't been a hit until he moved to Texas and nobody there had heard it, because everyone in Memphis knew the song.\n\nRiley and his band continued recording for Sun, both recording for themselves and as backup musicians for other artists. For example Hayden Thompson's version of Little Junior Parker's \"Love My Baby\", another rockabilly cover of an old Sun blues track, was released shortly after \"Red Hot\", credited to Thompson \"with Billy Lee Riley's band [and] Jerry Lee Lewis' 'pumping piano'\":\n\n[Excerpt: Hayden Thompson, \"Love My Baby\"]\n\nBut Riley was starting to get suspicious. \"Red Hot\" should have been a hit, it was obvious to him. So why hadn't it been?\n\nRiley became convinced that what had happened was that Sam Phillips had decided that Riley and his band were more valuable to him as session musicians, backing Jerry Lee Lewis and whoever else came into the studio, than as stars themselves. He would later claim that he had actually seen piles of orders for \"Red Hot\" come in from record shops around the country, and Sam Phillips phoning the stores up and telling them he was sending them Jerry Lee Lewis records instead.\n\nHe also remembered that Sam had told him to come off the road from a package tour to record an album -- and had sent Jerry Lee out on the tour in his place.\n\nHe became convinced that Sam Phillips was deliberately trying to sabotage his career.\n\nHe got drunk, and he got mad. He went to Sun studios, where Sam Phillips' latest girlfriend, Sally, was working, and started screaming at her, and kicked a hole in a double bass. Sally, terrified, called Sam, who told her to lock the doors, and to on no account let Riley leave the building. Sam came to the studio and talked Riley down, explaining to him calmly that there was no way he would sabotage a record on his own label -- that just wouldn't make any sense. He said \"“Red Hot” ain’t got it. We’re saving you for something good.’ ”\n\nBy the time Sam had finished talking, according to Riley, \"I felt like I was the biggest star on Sun Records!”\n\nBut that feeling didn't last, and Riley, like so many Sun artists before, decided he had a better chance at stardom elsewhere. He signed with Brunswick Records, and recorded a single with Owen Bradley, a follow-up to \"Flying Saucers Rock & Roll\" called \"Rockin' on the Moon\", which I wouldn't be at all surprised to hear had been an influence on Joe Meek:\n\n[Excerpt: Billy Lee Riley, \"Rockin' on the Moon\"]\n\nBut that wasn't a success either, and Riley came crawling back to Sun, though he never trusted Phillips again. He carried on as a Sun artist for a while, and then started recording for other labels based around Memphis, under a variety of different names. with a variety of different bands. For example he played harmonica on \"Shimmy Shimmy Walk\" by the Megatons, a great instrumental knock-off of \"You Don't Love Me\":\n\n[Excerpt: The Megatons, \"Shimmy Shimmy Walk Part 1\"]\n\nIndeed, he had a part to play in the development of another classic Memphis instrumental, though he didn't play on it. Riley was recording a session under one of his pseudonyms at the Stax studio, in 1962, and he was in the control room after the session when the other musicians started jamming on a twelve-bar blues:\n\n[Excerpt: Booker T and the MGs, \"Green Onions\"]\n\nBut we'll talk more about Booker T and the MGs in a few months' time.\n\nAfter failing to make it as a rock and roll star, Billy Riley decided he might as well go with what he'd been most successful at, and become a full-time session musician. He moved to LA, where he was one of the large number of people who were occasional parts of the group of session players known as the Wrecking Crew. He played harmonica, for example, on the album version of the Beach Boys' \"Help Me Ronda\":\n\n[Excerpt: The Beach Boys, \"Help Me, Ronda\"]\n\nAnd on Dean Martin's \"Houston\":\n\n[Excerpt: Dean Martin, \"Houston\"]\n\nAfter a couple of years of this, he went back to the south, and started recording again for anyone who would have him. But again, he was unlucky in sales -- and songs he recorded would tend to get recorded by other artists. For example, in 1971 he recorded a single produced by Chips Moman, the great Memphis country-soul producer and songwriter who had recently revitalised Elvis' career. That song, Tony Joe White's \"I've Got a Thing About You Baby\" started rising up the charts:\n\n[Excerpt: Billy Lee Riley, \"I've Got A Thing About You Baby\"]\n\nBut then Elvis released his own version of the song, and Riley's version stalled at number ninety-three.\n\nIn 1973, Riley decided to retire from the music business, and go to work in the construction industry instead. He would eventually be dragged back onto the stage in 1979, and he toured Europe after that, playing to crowds of rockabilly fans\n\nIn 1992, Bob Dylan came calling. It turned out that Bob Dylan was a massive Billy Lee Riley fan, and had spent six years trying to track Riley down, even going so far as to visit Riley's old home in Tennessee to see if he could find him. Eventually he did, and he got Riley to open for him on a few shows in Arkansas and Tennessee, and in Little Rock he got Riley to come out on stage and perform \"Red Hot\" with him and his band:\n\n[Excerpt: Bob Dylan and Billy Lee Riley, \"Red Hot\"]\n\nIn 2015, when Dylan was awarded the \"Musicares person of the year\" award, he spent most of his speech attacking anyone in the music industry who had ever said a bad word about Bob Dylan. It's one of the most extraordinarily, hilariously, petty bits of score-settling you'll ever hear, and I urge you to seek it out online if you ever start to worry that your own ego bruises too easily.\n\nBut in that speech Dylan does say good things about some people.He talks for a long time about Riley, and I won't quote all of it, but I'll quote a short section:\n\n\"He was a true original. He did it all: He played, he sang, he wrote. He would have been a bigger star but Jerry Lee came along. And you know what happens when someone like that comes along. You just don't stand a chance. So Billy became what is known in the industry—a condescending term—as a one-hit wonder. But sometimes, just sometimes, once in a while, a one-hit wonder can make a more powerful impact than a recording star who's got 20 or 30 hits behind him.”\n\nDylan went on to talk about his long friendship with Riley, and to say that the reason he was proud to accept the Musicares award was that in his last years, Musicares had helped Billy Lee Riley pay his doctor's bills and keep comfortable, and that Dylan considered that a debt that couldn't be repaid.\n\nBilly Lee Riley gave his final performance in June 2009, on Beale Street in Memphis, using a walking frame for support. He died of colon cancer in August 2009, aged 75.",
  "itunes:subtitle": "Episode fifty-seven of A History of Rock Music in Five Hundred Songs looks at Flying Saucers Rock n Roll by Billy Lee Riley and the Little Green Men, and at the flying saucer craze of the fifties. Click the full post to read liner notes, links to more in",
  "itunes:keywords": "Billy Lee Riley,Bob Dylan,Brunswick Records,Buchanan and Goodman,Chips Moman,country and western,Jack Clement,Jerry Lee Lewis,Jimmy van Eaton,Johnny Bernero,Memphis Recording Services,Owen Bradley,rockabilly,Roland Janes,Sam Phillips,Stax Records,Sun Records,The Wrecking Crew",
  "itunes:episodeType": "full",
  "itunes:episode": 57,
  "content:encoded": "Episode fifty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Flying Saucers Rock 'n' Roll\" by Billy Lee Riley and the Little Green Men, and at the flying saucer craze of the fifties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"http://patreon.com/posts/31652277\">on \"Silhouettes\" by the Rays, and the power of subliminal messages.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-57-flying-saucers-rock-roll/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em> </a>by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. I've also relied on a lot of websites for this one, including <a href=\"http://www.rockabilly.net/billyleeriley/story.shtml\">this very brief outline of Riley's life in his own words</a>.\n\nThere are many compilations of Riley's music. <a href=\"https://amzn.to/37jDwCa\">This one,</a> from Bear Family, is probably the most comprehensive collection of his fifties work.\n\nThe Patreon episode on \"The Flying Saucer\", for backers who've not heard it, is at <a href=\"https://www.patreon.com/posts/27855307\">https://www.patreon.com/posts/27855307</a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>ERRATUM</strong>\n\nI mistakenly said “Jack Earl” instead of Jack Earls at one point.\n\n<strong>Transcript</strong>\n\nLet's talk about flying saucers for a minute.\n\nOne aspect of 1950s culture that probably requires a little discussion at this point is the obsession in many quarters with the idea of alien invasion. Of course, there were the many, many, films on the subject that filled out the double bills and serials, things like \"Flying Disc Man From Mars\", \"Radar Men From The Moon\", \"It Came From Outer Space\", \"Earth vs. the Flying Saucers\", and so on. But those films, campy as they are, reveal a real fascination with the idea that was prevalent throughout US culture at the time.\n\nWhile the term \"flying saucer\" had been coined in 1930, it really took off in June 1947 when Kenneth Arnold, a Minnesotan pilot, saw nine disc-shaped objects in the air while he was flying. Arnold's experience has entered into legend as the canonical \"first flying saucer sighting\", mostly because Arnold seems to have been, before the incident, a relatively stable person -- or at least someone who gave off all the signals that were taken as signs of stability in the 1940s. Arnold seems to have just been someone who saw something odd, and wanted to find out what it was that he'd seen.\n\nBut eventually two different groups of people seem to have dominated the conversation -- religious fanatics who saw in Arnold's vision a confirmation of their own idiosyncratic interpretation of the Bible, and people who believed that the things Arnold had seen came from another planet. With no other explanations forthcoming, he turned to the people who held to the extraterrestrial hypothesis as being comparatively the saner option.\n\nOver the next few years, so did a significant proportion of the American population. The same month as Kenneth Arnold saw his saucers, a nuclear test monitoring balloon crashed in Roswell, New Mexico. A farmer who found some of the debris had heard reports of Arnold's sightings, and put two and two together and made space aliens. The Government didn't want to admit that the balloon had been monitoring nuclear tests, and so various cover stories were put out, which in turn led to the belief in aliens becoming ever more widespread. And this tied in with the nuclear paranoia that was sweeping the nation.\n\nIt was widely known, of course, that both the USA and Russia were working on space programmes -- and that those space programmes were intimately tied in with the nuclear missiles they were also developing. While it was never stated specifically, it was common knowledge that the real reason for the competition between the two nations to build rockets was purely about weapons delivery, and that the civilian space programme was, in the eyes of both governments if not the people working on it, merely a way of scaring the other side with how good the rockets were, without going so far that they might accidentally instigate a nuclear conflict.\n\nWhen you realise this, Little Richard's terror at the launch of Sputnik seems a little less irrational, and so does the idea that there might be aliens from outer space.\n\nSo, why am I talking about flying saucers?\n\nWell, there are two reasons. The first is that, among other things, this podcast is a cultural history of the latter part of the twentieth century, and you can't understand anything about the mid twentieth century without understanding the deeply weird paranoid ideas that would sweep the culture.\n\nThe second is that it inspired a whole lot of records. One of those, \"the Flying Saucer\", I've actually already looked at briefly in one of the Patreon bonus episodes, but is worth a mention here -- it was a novelty record that was a very early example of sampling:\n\n[Excerpt: Buchanan and Goodman, \"The Flying Saucer\"]\n\nAnd there'd been \"Two Little Men in a Flying Saucer\" by Ella Fitzgerald:\n\n[Excerpt: Ella Fitzgerald, \"Two Little Men in a Flying Saucer\"]\n\nBut today we're going to look at one of the great rockabilly records, by someone who was one of the great unsung acts on Sun Records:\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Flying Saucers Rock and Roll\"]\n\nBilly Lee Riley was someone who was always in the wrong place at the wrong time -- for example, when he got married after leaving the army, he decided to move with his new wife to Memphis, and open a restaurant. The problem was that neither of them knew Memphis particularly well, and didn't know how bad the area they were opening it in was. The restaurant was eventually closed down by the authorities after only three months, after a gunfight between two of their customers.\n\nBut there was one time when he was in precisely the right place at the right time. He was an unsuccessful, down on his luck, country singer in 1955, when he was driving on Christmas morning, from his in-laws' house in Arkansas to his parents' house three miles away, and he stopped to pick up two hitch-hikers.\n\nThose two hitch-hikers were Cowboy Jack Clement and Ronald \"Slim\" Wallace, two musicians who were planning on setting up their own record company. Riley was so interested in their conversation that while he'd started out just expecting to drive them the three miles he was going, he ended up driving them the more than seventy miles to Memphis.\n\nClement and Wallace invited Riley to join their label. They actually had little idea of how to get into the record business -- Clement was an ex-Marine and aspiring writer, who was also a dance instructor -- he had no experience or knowledge of dancing when he became a dance instructor, but had decided that it couldn't be that difficult. He also played pedal steel in a Western Swing band led by someone called Sleepy-Eyed John Epley.\n\nWallace, meanwhile, was a truck driver who worked weekends as a bass player and bandleader, and Clement had joined Wallace's band as well as Epley's. They regularly commuted between Arkansas, where Wallace owned a club, and Memphis, where Clement was based, and on one of their journeys, Clement, who had been riding in the back seat, had casually suggested to Wallace that they should get into the record business. Wallace would provide the resources -- they'd use his garage as a studio, and finance it with his truck-driving money -- while Clement would do the work of actually converting the garage into a studio.\n\nBut before they were finished, they'd been out drinking in Arkansas on Christmas Eve with Wallace's wife and a friend, and Clement and the friend had been arrested for drunkenness. Wallace's wife had driven back to Memphis to be home for Christmas day, while Wallace had stayed on to bail out Clement and hitch-hike back with him.\n\nThey hadn't actually built their studio yet, as such, but they were convinced it was going to be great when they did, and when Riley picked them up he told them what a great country singer he was, and they all agreed that when they did get the studio built they were going to have Riley be the first artist on their new label, Fernwood Records. In the meantime, Riley was going to be the singer in their band, because he needed the ten or twelve dollars a night he could get from them.\n\nSo for a few months, Riley performed with Clement and Wallace in their band, and they slowly worked out an act that would show Riley's talents off to their best advantage. By May, Clement still hadn't actually built the studio -- he'd bought a tape recorder and a mixing board from Sleepy-Eyed John Epley, but he hadn't quite got round to making Wallace's garage into a decent space for recording in.\n\nSo Clement and Wallace pulled together a group of musicians, including a bass player, because Clement didn't think Wallace was good enough, Johnny Bernero, the drummer who'd played on Elvis' last Sun session, and a guitarist named Roland Janes, and rented some studio time from a local radio station. They recorded the two sides of what was intended to be the first single on Fernwood Records, \"Rock With Me Baby\":\n\n[Excerpt: Billy Lee RIley, \"Rock With Me Baby\"]\n\nSo they had a tape, but they needed to get it properly mastered to release it as a single. The best place in town to do that was at Memphis Recording Services, which Sam Phillips was still keeping going even though he was now having a lot of success with Sun.\n\nPhillips listened to the track while he was mastering it, and he liked it a lot. He liked it enough, in fact, that he made an offer to Clement -- rather than Clement starting up his own label, would he sell the master to Phillips, and come and work for Sun records instead?\n\nHe did, leaving Slim Wallace to run Fernwood on his own, and for the last few years that Sun was relevant, Cowboy Jack Clement was one of the most important people working for the label -- second only to Sam Phillips himself. Clement would end up producing sessions by Johnny Cash, Carl Perkins, Jerry Lee Lewis, and others.\n\nBut his first session was to produce the B-side to the Billy Lee Riley record. Sam Phillips hadn't liked their intended B-side, so they went back into the studio with the same set of musicians to record a \"Heartbreak Hotel\" knockoff called \"Trouble Bound\":\n\n[Excerpt: Billy Lee Riley, \"Trouble Bound\"]\n\nThat was much more to Sam's liking, and the result was released as Billy Lee Riley's first single.\n\nRiley and the musicians who had played on that initial record became the go-to people for Clement when he wanted musicians to back Sun's stars. Roland Janes, in particular, is someone whose name you will see on the credits for all sorts of Sun records from mid-56 onwards. Riley, too, would play on sessions -- usually on harmonica, but occasionally on guitar, bass, or piano.\n\nThere's one particularly memorable moment of Riley on guitar at the end of Jerry Lee Lewis' first single, a cover version of Ray Price's \"Crazy Arms\". That song had been cut more as a joke than anything else, with Janes, who couldn't play bass, on bass. Right at the end of the song, Riley picked up a guitar, and hit a single wrong chord, just after everyone else had finished playing, and while their sound was dying away:\n\n[Excerpt: Jerry Lee Lewis, \"Crazy Arms\"]\n\nSam Phillips loved that track, and released it as it was, with Riley's guitar chord on it.\n\nRiley, meanwhile, started gigging regularly, with a band consisting of Janes on guitar, new drummer Jimmy Van Eaton, and, at first, Jerry Lee Lewis on piano, all of whom would play regularly on any Sun sessions that needed musicians.\n\nNow, we're going to be talking about Jerry Lee Lewis in a couple of weeks, so I don't want to talk too much about him here, but you'll have noticed that we already talked about him quite a bit in the episode on \"Matchbox\". Jerry Lee Lewis was one of those characters who turn up everywhere, and even before he was a star, he was making a huge impression on other people's lives. So while this isn't an episode about him, you will see his effect on Riley's career. He's just someone who insists on pushing into the story before it's his turn.\n\nJerry Lee was the piano player on Riley's first session for Sun proper. The song on that session was brought in by Roland Janes, who had a friend, Ray Scott, who had written a rock and roll song about flying saucers. Riley loved the song, but Phillips thought it needed something more -- it needed to sound like it came from outer space. They still didn't have much in the way of effects at the Sun studios -- just the reverb system Phillips had cobbled together -- but Janes had a tremolo bar on his guitar. These were a relatively new invention -- they'd only been introduced on the Fender Stratocaster a little over two years earlier, and they hadn't seen a great deal of use on records yet.\n\nPhillips got Janes to play making maximum use of the tremolo arm, and also added a ton of reverb, and this was the result:\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Flying Saucers Rock and Roll\"]\n\nGreil Marcus later said of that track that it was \"one of the weirdest of early rock 'n' roll records - and early rock 'n' roll records were weird!\" -- and he's right. \"Flying Saucers Rock & Roll\" is a truly odd recording, even by the standards of Sun Records in 1957.\n\nWhen Phillips heard that back, he said \"Man that’s it. You sound like a bunch of little green men from Mars!\" -- and then immediately realised that that should be the name of Riley's backing band. So the single came out as by Billy Lee Riley and the Little Green Men, and the musicians got themselves a set of matching green suits to wear at gigs, which they bought at Lansky's on Beale Street.\n\nThose suits caused problems, though, as they were made of a material which soaked up sweat, which was a problem given how frantically active Riley's stage show was -- at one show at the Arkansas State University Riley jumped on top of the piano and started dancing -- except the piano turned out to be on wheels, and rolled off the stage. Riley had to jump up and cling on to a steel girder at the top of the stage, dangling from it by one arm, while holding the mic in the other, and gesturing frantically for people to get him down.\n\nYou can imagine that with a show like that, absorbent material would be a problem, and sometimes the musicians would lie on their backs to play solos and get the audiences excited, and then find it difficult to get themselves back to their feet again, because their suits were so heavy.\n\nRiley's next single was a cover of a blues song first recorded by another Sun artist, Billy \"the Kid\" Emerson, in 1955. \"Red Hot\" had been based on a schoolyard chant:\n\n[Excerpt: Billy \"the Kid\" Emerson, \"Red Hot\"]\n\nWhile \"Flying Saucers Rock and Roll\" had been a local hit, but not a national one, Billy was confident that his version of \"Red Hot\" would be the record that would make him into a national star:\n\n[Excerpt: Billy Lee Riley and the Little Green Men, \"Red Hot\"]\n\nThe song was recorded either at the same session as \"Flying Saucers Rock and Roll\" or at one a couple of weeks later with a different pianist -- accounts vary -- but it was put on the shelf for six months, and in that six months Riley toured promoting \"Flying Saucers Rock and Roll\", and also carried on playing on sessions for Sun. He played bass on \"Take Me To That Place\" by Jack Earls:\n\n[Excerpt: Jack Earls, \"Take Me To That Place\"]\n\nRhythm guitar on \"Miracle of You\" by Hannah Fay:\n\n[Excerpt: Hannah Fay, \"Miracle of You\"]\n\nAnd much more. But he was still holding out hopes for the success of \"Red Hot\", which Sam Phillips kept telling him was going to be his big hit.\n\nAnd for a while it looked like that might be the case. Dewey Phillips played the record constantly, and Alan Freed tipped it to be a big hit. But for some reason, while it was massive in Memphis, the track did nothing at all outside the area -- the Memphis musician Jim Dickinson once said that he had never actually realised that \"Red Hot\" hadn't been a hit until he moved to Texas and nobody there had heard it, because everyone in Memphis knew the song.\n\nRiley and his band continued recording for Sun, both recording for themselves and as backup musicians for other artists. For example Hayden Thompson's version of Little Junior Parker's \"Love My Baby\", another rockabilly cover of an old Sun blues track, was released shortly after \"Red Hot\", credited to Thompson \"with Billy Lee Riley's band [and] Jerry Lee Lewis' 'pumping piano'\":\n\n[Excerpt: Hayden Thompson, \"Love My Baby\"]\n\nBut Riley was starting to get suspicious. \"Red Hot\" should have been a hit, it was obvious to him. So why hadn't it been?\n\nRiley became convinced that what had happened was that Sam Phillips had decided that Riley and his band were more valuable to him as session musicians, backing Jerry Lee Lewis and whoever else came into the studio, than as stars themselves. He would later claim that he had actually seen piles of orders for \"Red Hot\" come in from record shops around the country, and Sam Phillips phoning the stores up and telling them he was sending them Jerry Lee Lewis records instead.\n\nHe also remembered that Sam had told him to come off the road from a package tour to record an album -- and had sent Jerry Lee out on the tour in his place.\n\nHe became convinced that Sam Phillips was deliberately trying to sabotage his career.\n\nHe got drunk, and he got mad. He went to Sun studios, where Sam Phillips' latest girlfriend, Sally, was working, and started screaming at her, and kicked a hole in a double bass. Sally, terrified, called Sam, who told her to lock the doors, and to on no account let Riley leave the building. Sam came to the studio and talked Riley down, explaining to him calmly that there was no way he would sabotage a record on his own label -- that just wouldn't make any sense. He said \"“Red Hot” ain’t got it. We’re saving you for something good.’ ”\n\nBy the time Sam had finished talking, according to Riley, \"I felt like I was the biggest star on Sun Records!”\n\nBut that feeling didn't last, and Riley, like so many Sun artists before, decided he had a better chance at stardom elsewhere. He signed with Brunswick Records, and recorded a single with Owen Bradley, a follow-up to \"Flying Saucers Rock & Roll\" called \"Rockin' on the Moon\", which I wouldn't be at all surprised to hear had been an influence on Joe Meek:\n\n[Excerpt: Billy Lee Riley, \"Rockin' on the Moon\"]\n\nBut that wasn't a success either, and Riley came crawling back to Sun, though he never trusted Phillips again. He carried on as a Sun artist for a while, and then started recording for other labels based around Memphis, under a variety of different names. with a variety of different bands. For example he played harmonica on \"Shimmy Shimmy Walk\" by the Megatons, a great instrumental knock-off of \"You Don't Love Me\":\n\n[Excerpt: The Megatons, \"Shimmy Shimmy Walk Part 1\"]\n\nIndeed, he had a part to play in the development of another classic Memphis instrumental, though he didn't play on it. Riley was recording a session under one of his pseudonyms at the Stax studio, in 1962, and he was in the control room after the session when the other musicians started jamming on a twelve-bar blues:\n\n[Excerpt: Booker T and the MGs, \"Green Onions\"]\n\nBut we'll talk more about Booker T and the MGs in a few months' time.\n\nAfter failing to make it as a rock and roll star, Billy Riley decided he might as well go with what he'd been most successful at, and become a full-time session musician. He moved to LA, where he was one of the large number of people who were occasional parts of the group of session players known as the Wrecking Crew. He played harmonica, for example, on the album version of the Beach Boys' \"Help Me Ronda\":\n\n[Excerpt: The Beach Boys, \"Help Me, Ronda\"]\n\nAnd on Dean Martin's \"Houston\":\n\n[Excerpt: Dean Martin, \"Houston\"]\n\nAfter a couple of years of this, he went back to the south, and started recording again for anyone who would have him. But again, he was unlucky in sales -- and songs he recorded would tend to get recorded by other artists. For example, in 1971 he recorded a single produced by Chips Moman, the great Memphis country-soul producer and songwriter who had recently revitalised Elvis' career. That song, Tony Joe White's \"I've Got a Thing About You Baby\" started rising up the charts:\n\n[Excerpt: Billy Lee Riley, \"I've Got A Thing About You Baby\"]\n\nBut then Elvis released his own version of the song, and Riley's version stalled at number ninety-three.\n\nIn 1973, Riley decided to retire from the music business, and go to work in the construction industry instead. He would eventually be dragged back onto the stage in 1979, and he toured Europe after that, playing to crowds of rockabilly fans\n\nIn 1992, Bob Dylan came calling. It turned out that Bob Dylan was a massive Billy Lee Riley fan, and had spent six years trying to track Riley down, even going so far as to visit Riley's old home in Tennessee to see if he could find him. Eventually he did, and he got Riley to open for him on a few shows in Arkansas and Tennessee, and in Little Rock he got Riley to come out on stage and perform \"Red Hot\" with him and his band:\n\n[Excerpt: Bob Dylan and Billy Lee Riley, \"Red Hot\"]\n\nIn 2015, when Dylan was awarded the \"Musicares person of the year\" award, he spent most of his speech attacking anyone in the music industry who had ever said a bad word about Bob Dylan. It's one of the most extraordinarily, hilariously, petty bits of score-settling you'll ever hear, and I urge you to seek it out online if you ever start to worry that your own ego bruises too easily.\n\nBut in that speech Dylan does say good things about some people.He talks for a long time about Riley, and I won't quote all of it, but I'll quote a short section:\n\n\"He was a true original. He did it all: He played, he sang, he wrote. He would have been a bigger star but Jerry Lee came along. And you know what happens when someone like that comes along. You just don't stand a chance. So Billy became what is known in the industry—a condescending term—as a one-hit wonder. But sometimes, just sometimes, once in a while, a one-hit wonder can make a more powerful impact than a recording star who's got 20 or 30 hits behind him.”\n\nDylan went on to talk about his long friendship with Riley, and to say that the reason he was proud to accept the Musicares award was that in his last years, Musicares had helped Billy Lee Riley pay his doctor's bills and keep comfortable, and that Dylan considered that a debt that couldn't be repaid.\n\nBilly Lee Riley gave his final performance in June 2009, on Beale Street in Memphis, using a walking frame for support. He died of colon cancer in August 2009, aged 75.",
  "enclosure": "",
  "itunes:summary": "Episode fifty-seven of A History of Rock Music in Five Hundred Songs looks at \"Flying Saucers Rock 'n' Roll\" by Billy Lee Riley and the Little Green Men, and at the flying saucer craze of the fifties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Silhouettes\" by the Rays, and the power of subliminal messages.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. I've also relied on a lot of websites for this one, including this very brief outline of Riley's life in his own words.\n\nThere are many compilations of Riley's music. This one, from Bear Family, is probably the most comprehensive collection of his fifties work.\n\nThe Patreon episode on \"The Flying Saucer\", for backers who've not heard it, is at https://www.patreon.com/posts/27855307\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nERRATUM\n\nI mistakenly said “Jack Earl” instead of Jack Earls at one point.\n\nTranscript\n\nLet's talk about flying saucers for a minute.\n\nOne aspect of 1950s culture that probably requires a little discussion at this point is the obsession in many quarters with the idea of alien invasion. Of course, there were the many, many, films on the subject that filled out the double bills and serials, things like \"Flying Disc Man From Mars\", \"Radar Men From The Moon\", \"It Came From Outer Space\", \"Earth vs. the Flying Saucers\", and so on. But those films, campy as they are, reveal a real fascination with the idea that was prevalent throughout US culture at the time.\n\nWhile the term \"flying saucer\" had been coined in 1930, it really took off in June 1947 when Kenneth Arnold, a Minnesotan pilot, saw nine disc-shaped objects in the air while he was flying. Arnold's experience has entered into legend as the canonical \"first flying saucer sighting\", mostly because Arnold seems to have been, before the incident, a relatively stable person -- or at least someone who gave off all the signals that were taken as signs of stability in the 1940s. Arnold seems to have just been someone who saw something odd, and wanted to find out what it was that he'd seen.\n\nBut eventually two different groups of people seem to have dominated the conversation -- religious fanatics who saw in Arnold's vision a confirmation of their own idiosyncratic interpretation of the Bible, and people who believed that the things Arnold had seen came from another planet. With no other explanations forthcoming, he turned to the people who held to the extraterrestrial hypothesis as being comparatively the saner option.\n\nOver the next few years, so did a significant proportion of the American population. The same month as Kenneth Arnold saw his saucers, a nuclear test monitoring balloon crashed in Roswell, New Mexico. A farmer who found some of the debris had heard reports of Arnold's sightings, and put two and two together and made space aliens. The Government didn't want to admit that the balloon had been monitoring nuclear tests, and so various cover stories were put out, which in turn led to the belief in aliens becoming ever more widespread. And this tied in with the nuclear paranoia that was sweeping the nation.\n\nIt was widely known, of course, that both the USA and Russia were working on space programmes -- and that those space programmes were intimately tied in with the nuclear missiles they were also developing. While it was never stated specifically, it was common knowledge that the real reason for the competition between the two nations to build rockets was purely about weapons delivery, and that the civilian space programme was, in the eyes of both governments if not the people working on it, merely",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-seven of A History of Rock Music in Five Hundred Songs looks at \"Flying Saucers Rock 'n' Roll\" by Billy Lee Riley and the Little Green Men, and at the flying saucer craze of the fifties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Silhouettes\" by the Rays, and the power of subliminal messages.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. I've also relied on a lot of websites for this one, including this very brief outline of Riley's life in his own words.\n\nThere are many compilations of Riley's music. This one, from Bear Family, is probably the most comprehensive collection of his fifties work.\n\nThe Patreon episode on \"The F",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}