{
  "title": "Thoughts on “Symbolic Behavior in Artificial Intelligence”",
  "link": "https://awjuliani.medium.com/thoughts-on-symbolic-behavior-in-artificial-intelligence-15321c86e3bb?source=rss-18dfe63fa7f0------2",
  "guid": "https://medium.com/p/15321c86e3bb",
  "category": [
    "machine-learning",
    "artificial-intelligence",
    "philosophy",
    "deep-learning",
    "language"
  ],
  "dc:creator": "Arthur Juliani",
  "pubDate": "Fri, 12 Feb 2021 18:36:01 GMT",
  "atom:updated": "2021-02-12T18:36:01.991Z",
  "content:encoded": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*zcs8H1kbdeGsQUTIyQ8tZg.jpeg\" /></figure><p>I recently read a new pre-print titled <a href=\"https://arxiv.org/abs/2102.03406\"><em>Symbolic Behaviour in Artificial Intelligence</em></a>, by Adam Santoro, Andrew Lampinen, and collaborators at DeepMind, and was so taken by it that I thought I would write up some brief thoughts. Unlike much of the research published by DeepMind, which is largely empirical in nature, this paper presents a philosophical perspective on the classic symbolic vs connectionist debate. Rather than making the now-typical proposal to combine symbolic reasoning and neural network approaches into a hybrid system where deep learning is used for “low level” processing, and a classical AI system is used at the “high level,” the authors of the paper take a step back and discuss how symbol use emerges in humans in the first place. As they note, it is really only in humans that we have any real example of symbol use to begin with. In doing so, I think that they arrive at a few key points which provide a useful way of thinking about symbols in artificial intelligence and beyond.</p><p>Key to the author’s thinking is the concept of <em>symbolic behavior</em>, which could be seen to stand in contrast to the typical notion used in artificial intelligence of symbolic representation or symbolic reasoning. Putting their argument simply, we humans are led to believe that we possess symbolic representations because we act in the world as if we did. Instead of focusing on the inferred symbolic representations, the authors suggest we focus our attention on understanding the properties of the behavior itself. When thinking about AI systems, what we are likewise interested in as researchers is the development of artificial agents which act like they possess symbolic representations. This can be seen clearly in the classic formulation of the <a href=\"https://en.wikipedia.org/wiki/Turing_test\">Turing test</a>, where it is enough that the agent can behave as if it is intelligent.</p><p>Taking behavior as our starting point, we can then examine just what characterizes our symbolic behavior in humans. The authors suggest that symbolic behavior emerges naturally as the result of developing and maintaining shared conventions which are actively participated in by one or more agents within a world. This sharing-of and participating-in conventions can be between different agents, as is the case in social and cultural interaction, or can take place between a single agent at various points, thanks to one’s ability to store and retrieve memories over time. In this view, any symbolic representations which an agent may possess are emergent properties of the system, rather than necessarily being the result of some hard-coded symbol processing mechanisms. As a result, such hard-coded symbolic reasoning isn’t the only, best, or even necessarily correct way of arriving at agents which display symbolic behavior.</p><p>One might still argue that it seems straightforward that the best way to get symbolic behavior is to develop agents with strong symbolic reasoning priors. The authors make what I believe is a strong refutation of this argument, especially when it calls for a return to the symbolic approaches used in the so-called “Good Old Fashioned AI” (GOFAI) of the late 20th century. They are not alone in this thinking, as there have been great philosophical critiques of the GOFAI approaches, such as those of <a href=\"https://en.wikipedia.org/wiki/Hubert_Dreyfus%27s_views_on_artificial_intelligence\">Hubert Dreyfus</a> in his seminal work <em>What Computers Can’t Do</em>, a classic for anyone interested in understanding why the approaches taken at the time were likely doomed from the start. On the other hand, there has been a wealth of empirical evidence in support of the connectionist (and not the symbolic) approach in the past decade with the great successes of deep learning at everything from image-detection to game-playing to car-driving. Some groups, like OpenAI have taken the approach of continuing down the purely connectionist route, utilizing more and more compute and network capacity. As <a href=\"https://openai.com/blog/openai-api/\">GPT-3 </a>and <a href=\"https://openai.com/blog/dall-e/\">other recent large models</a> testify, it does indeed seem that explicit recourse to symbolic reasoning is not necessary for increasingly human-like abilities.</p><p>Despite this, we still find ourselves as a community at a bit of a crossroads, with many not convinced that the approach of simply scaling connectionist systems will lead to truly human-like intelligence. As such, the spectre of GOFAI continues to loom over the field of AI research, with many <a href=\"https://www.youtube.com/watch?v=vNOTDn3D_RI\">critics</a> in recent years suggesting that what needs to be done is to somehow marry the classical and deep learning approaches. The problem with this line of thinking is that while we humans display symbolic <em>behavior</em> quite naturally, we do not display symbolic reasoning very naturally at all! As the authors point out, human symbolic reasoning displays a graded quality which suggests that we are far from ideal symbol manipulators. For example, it takes many years of mathematics courses before algebraic reasoning can be reliably deployed by a typical human. In contrast, it is in fact computers, just the things which we seek to make more human, which are already essentially perfect at such tasks. For humans, it isn’t the ability to arbitrarily manipulate symbols, but rather the ability to ground them in meaning, and maintain a shared system of conventions over time and space which makes us intelligent symbol users. This approach is motivating <a href=\"https://arxiv.org/abs/2012.05672\">work at DeepMind</a> and elsewhere to focus on agents which must communicate and collaborate in order to solve complex tasks, with symbolic representations being a result, not a starting point.</p><p>Whether the approach explicitly outlined in this paper is the right one, I can’t say. I do believe however that this grounding of empirical research in philosophical discourse can serve only to benefit the field of artificial intelligence. At worst, it can help to prevent some of the mistakes the field has made in the past. At best, it can open new directs for empirical research which prove to be much more promising than the typical performance improvement chasing which so often dominates the field.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=15321c86e3bb\" width=\"1\" height=\"1\" alt=\"\">"
}