{
  "title": "The Cosmic-Ray Induced Sputtering Process On Icy Grains. (arXiv:2211.01511v1 [astro-ph.EP])",
  "link": "http://arxiv.org/abs/2211.01511",
  "description": "<p>In molecular cloud cores, the cosmic ray (CR) induced sputtering via CR\nion-icy grain collision is one of the desorption processes for ice molecules\nfrom mantles around dust grains. The efficiency of this process depends on the\nincident CR ion properties as well as the physicochemical character of the ice\nmantle. Our main objective is the examination of the sputtering efficiency for\nH$_2$O and CO ices found in molecular cloud cores. In the calculation routine,\nwe consider a multi-dimensional parameter space that consists of thirty CR ion\ntypes, five different CR ion energy flux distributions, two separate ice mantle\ncomponents (pure H$_2$O and CO), three ice formation states, and two sputtering\nregimes (linear and quadratic). We find that the sputtering behavior of H$_2$O\nand CO ices is dominated by the quadratic regime rather than the linear regime,\nespecially for CO sputtering. The sputtering rate coefficients for H$_2$O and\nCO ices show distinct variations with respect to the adopted CR ion energy flux\nas well as the grain size-dependent mantle depth. The maximum radius of the\ncylindrical latent region is quite sensitive to the effective electronic\nstopping power. The track radii for CO ice are much bigger than H$_2$O ice\nvalues. In contrast to the H$_2$O mantle, even relatively light CR ions ($Z\n\\geq 4$) may lead to a track formation within the CO mantle, depending on ${\\rm\nS_{\\rm e,eff}}$. We suggest that the latent track formation threshold can be\nassumed as a separator between the linear and the quadratic regimes for\nsputtering.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Ozgun_A/0/1/0/all/0/1\">Arslan &#xd6;zg&#xfc;n</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Seyit_H/0/1/0/all/0/1\">Hocuk Seyit</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Paola_C/0/1/0/all/0/1\">Caselli Paola</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ibrahim_K/0/1/0/all/0/1\">K&#xfc;&#xe7;&#xfc;k &#x130;brahim</a>"
}