{
  "id": "yt:video:bBhx3jhLNHs",
  "yt:videoId": "bBhx3jhLNHs",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Japan Has Been Crashing For 33 Years...It's Not Looking Good...",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-26T19:00:14+00:00",
  "updated": "2022-10-26T19:00:14+00:00",
  "media:group": {
    "media:title": "Japan Has Been Crashing For 33 Years...It's Not Looking Good...",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "After WW2, Japan was by far the fastest-growing country in the world. They put western countries to shame as they pumped out winner after winner from Toyota and Honda to Sony and Panasonic. But, all of this unprecedented growth abruptly came to an end in 1989 when their stock market peaked. At first, people thought that this was simply a routine bear market that would recover sooner or later. But, the bear market just kept going and going and going. In fact, you could argue that it’s still ongoing given that the Nikkei 225 has yet to put in a new all-time high since 1989. It’s not just the stock market that has gotten crushed either. The real estate market also peaked in 1989 and has yet to recover. When you factor in inflation, this situation just becomes even worse. One of the main reasons for this massive stagnation is that Japan’s assets bubbles simply went so far that it has taken decades for real valuations to catch up. This was simply fueled by the Plaza Accord which loosened economic policies within Japan and tightened policies outside Japan. This video explains why Japan’s economy hasn’t grown in 33 years and whether this is what’s up ahead for the US. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Japan’s Peak\n3:28 - Unprecedented Growth\n5:46 - The Plaza Accord\n8:01 - Monstrous Valuations\n11:06 - The Lost Decades\n\nResources: \nhttps://pastebin.com/Rs1Sye7U",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}