{
  "title": "Winning solution of Kaggle Higgs competition: what a single model can do?",
  "link": "https://no2147483647.wordpress.com/2014/09/17/winning-solution-of-kaggle-higgs-competition-what-a-single-model-can-do/",
  "comments": "https://no2147483647.wordpress.com/2014/09/17/winning-solution-of-kaggle-higgs-competition-what-a-single-model-can-do/#comments",
  "dc:creator": "phunterlau",
  "pubDate": "Wed, 17 Sep 2014 05:12:03 +0000",
  "category": "Uncategorized",
  "guid": "http://no2147483647.wordpress.com/?p=60",
  "description": "This blog is for describing the winning solution of the Kaggle Higgs competition. It has the public score of 3.75+ and the private score of 3.73+ which has ranked at 26th. This solution uses a single classifier with some feature work from basic high-school physics plus a few advanced but calculable physical features. Github link to [&#8230;]",
  "content:encoded": "<p>This blog is for describing the winning solution of the <a href=\"http://www.kaggle.com/c/higgs-boson/\">Kaggle Higgs competition</a>. It has the public score of 3.75+ and the private score of 3.73+ which has ranked at 26th. This solution uses <strong>a single classifier</strong> with some feature work from basic high-school physics plus a few advanced but calculable physical features.</p>\n<p>Github link to the <a href=\"https://github.com/phunterlau/kaggle_higgs\">source code</a>.</p>\n<p><strong>1. The model</strong></p>\n<p>I choose <a href=\"https://github.com/tqchen/xgboost\">XGBoost</a> which is a parallel implementation of gradient boosting tree. It is a great piece of work: parallel, fast, efficient and tune-able parameters.</p>\n<p>The parameter tuning-up is simple. I know GBM can have a good learning result by providing a small shrinkage eta value. According to a simply brute-force grid search for the parameters and the cross-validation score, I choose :</p>\n<ul>\n<li>eta = 0.01 (small shrinkage)</li>\n<li>max_depth = 9 (default max_depth=6 which is not deep enough)</li>\n<li>sub_sample = 0.9 (giving some randomness for preventing overfitting)</li>\n<li>num_rounds = 3000 (because of slow shrinkage, many trees are needed)</li>\n</ul>\n<p>and leave other parameters by default. This parameter works good, however, since I only have limited knowledge of GBM, this model is not very optimal for:</p>\n<ul>\n<li>shrinkage too slow and training time too long, so a training takes about 30 minutes and cross-validation takes longer time. On the forum, some faster parameters are published which can limit the training time to less than 5 min.</li>\n<li>sub_sample parameter gives some randomness, especially when complicated non-linear features are involved, and the submission AMS score is not stable and not 100% reproducible. In the feature reduction section, I have a short discussion.</li>\n</ul>\n<p>The cross validation is done as usually. A reminder about the AMS is that, from the AMS equation, one can simplify it to</p>\n<p style=\"text-align:center;\"><img src=\"https://s0.wp.com/latex.php?latex=%7B%5Crm+AMS%7D+%3D+%5Cfrac%7BS%7D%7B%5Csqrt%7BB%7D%7D&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002\" srcset=\"https://s0.wp.com/latex.php?latex=%7B%5Crm+AMS%7D+%3D+%5Cfrac%7BS%7D%7B%5Csqrt%7BB%7D%7D&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002 1x, https://s0.wp.com/latex.php?latex=%7B%5Crm+AMS%7D+%3D+%5Cfrac%7BS%7D%7B%5Csqrt%7BB%7D%7D&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002&#038;zoom=4.5 4x\" alt=\"{&#92;rm AMS} = &#92;frac{S}{&#92;sqrt{B}}\" class=\"latex\" /></p>\n<p>which means, if we evenly partition the training set for K-fold cross validation where the S and B have applied the factor of <img src=\"https://s0.wp.com/latex.php?latex=%28K-1%29%2FK&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002\" srcset=\"https://s0.wp.com/latex.php?latex=%28K-1%29%2FK&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002 1x, https://s0.wp.com/latex.php?latex=%28K-1%29%2FK&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002&#038;zoom=4.5 4x\" alt=\"(K-1)/K\" class=\"latex\" />, the AMS score from CV is artificially lowered by approximately <img src=\"https://s0.wp.com/latex.php?latex=%5Csqrt%7B%28K-1%29%2FK%7D&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002\" srcset=\"https://s0.wp.com/latex.php?latex=%5Csqrt%7B%28K-1%29%2FK%7D&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002 1x, https://s0.wp.com/latex.php?latex=%5Csqrt%7B%28K-1%29%2FK%7D&#038;bg=ffffff&#038;fg=444444&#038;s=0&#038;c=20201002&#038;zoom=4.5 4x\" alt=\"&#92;sqrt{(K-1)/K}\" class=\"latex\" />. The same with estimating the test AMS: the weight should be scaled by the number of test samples.</p>\n<p>XGboost also supports customized loss function. People have some discussions <a href=\"http://www.kaggle.com/c/higgs-boson/forums/t/10286/customize-loss-function-in-xgboost\">in this thread</a> and I have some tries. I haven&#8217;t applied this customized function for my submission.</p>\n<p><strong>2. The features</strong></p>\n<p>The key for this solution is the feature engineering. With the basic physics features, I can reach the public leaderboard score around 3.71, and the other advanced physics features push it to public 3.75 and private 3.73.</p>\n<p><strong>2.1 General idea for feature engineering</strong></p>\n<p>Since the signal (positive) samples are Higgs to tau-tau events where <strong>two taus coming from the same Higgs boson</strong>, while the background (negative) samples are tau-tau-look-like events where particles have no correlation with the Higgs boson, I have the general idea that, in the signal, these particles should have their kinematic correlations with Higgs, while the background particles don&#8217;t. This kinematic correlation can be represented as:</p>\n<ul>\n<li>Simply as the open angles (see part 2.2)</li>\n<li>Complicated as CAKE features (see this <a href=\"http://www.kaggle.com/c/higgs-boson/forums/t/10329/new-variables-features-for-higgs-vs-z-discrimination\">link </a>in the Higgs forum, this feature is not developed by me nor being used in the submission/solution)</li>\n</ul>\n<p><strong>2.2 Basic physics features</strong></p>\n<p>Because of the general idea of finding the &#8220;correlation&#8221; in the kinematic system, the correlation between each pair of particles can be useful. The possible features are:</p>\n<ul>\n<li>The open angles in the transverse (phi) plane and the longitudinal plan (eta angle). The reminder is that, the phi angle difference must be mapped into ±pi, and the absolute values of these angles work better for xgboost.</li>\n<li>Some careful study on the open angle can find that, tau-MET open angles in phi direction is somehow useless. It is understandable that in tau-l-nu case the identified tau angle has no much useful correlation with nu angle.</li>\n<li>Cartesian of each momentum value (px, py, pz): it works with xgboost.</li>\n<li>The momentum correlation in the longitudinal direction (Z direction), for example, jet momentum in Z direction vs tau-lepton momentum in Z direction is important. This momentum in Z direction can be calculated using the pt (transverse momentum) and the eta angle.</li>\n<li>The longitudinal eta open angle for the leading jet and the subleading jet: the physics reason is from the jet production mechanism from tau, but it is easy to be noticed when plotting PRI_jet_leading_eta &#8211; PRI_jet_subleading_eta without physics knowledge.</li>\n<li>The transverse momentum ratio of tau-lep, jet-jet, MET to the total transverse momentum.</li>\n<li>The min and max PT: this idea comes from the traditional cut-based analysis where different physics channel, e.g. 2-jet VBF vs 1 jet jet suppression to lepton, there are minimal and maximal PT cut. In this approach, I give them as features instead of splitting the model, and xgboost picks them up in a nice way.</li>\n</ul>\n<p>Overlapping the feature distribution for the signal and the background is a common technique for visualizing features in the experimental high energy physics, for example, the jet-lepton eta open angle distribution for the positive and negative samples can be visualized as following:</p>\n<div style=\"width: 720px\" class=\"wp-caption alignnone\"><img class=\"\" src=\"https://dl.dropboxusercontent.com/u/10652630/blog/jet-lep-eta.png\" alt=\"\" width=\"720\" height=\"404\" /><p class=\"wp-caption-text\">Jet-lepton open angle distributions</p></div>\n<p><strong>2.3 Advanced physics features</strong></p>\n<p>If one reads the CMS/ATLAS Higgs to tau-tau analysis paper, one can have some advanced features for eliminating particular background. For example, <a href=\"https://indico.cern.ch/event/218030/session/15/contribution/211/material/slides/0.pdf\">this CMS talk</a> has covered the fundamental points of Higgs to tau-tau search.</p>\n<p>In Higgs to tau tau search, one of the most important background is the Z particle where Z can decay into lepton pairs (l-l, tau-tau) and mimic the Higgs signal. Moreover, considering the known Higgs mass is 126 GeV which is close to Z mass 91 GeV, the tau-tau kinematics can be very similar in Z and Higgs.</p>\n<p>The common technique for eliminating this background is reconstructing Z invariant mass peak which is around 91 GeV. The provided &#8216;PRI&#8217; features only have tau momentum and lepton momentum, from which we can&#8217;t have precise reconstruction of Z particle invariant, however, this invariant mass idea gives some hint that, the pseudo transverse invariant mass can be a good feature where the transverse invariant mass distribution can be :</p>\n<div style=\"width: 749px\" class=\"wp-caption alignnone\"><img class=\"\" src=\"https://dl.dropboxusercontent.com/u/10652630/blog/tau-lep-invariant.png\" alt=\"\" width=\"749\" height=\"404\" /><p class=\"wp-caption-text\">Tau-lepton pseduo invariant mass</p></div>\n<p>QCD and W+jet background are also important where lepton/tau can be mis-identified as jet, however, these two have much lower cross-section so the feature work on these two background are not very important. Tau-jet pseudo invariant mass features are useful too.</p>\n<p>Some other not important features are:</p>\n<ul>\n<li>For tau-tau channel, the di-tau momentum summation can be roughly estimated by tau-lep-jet combination although it is far from truth.</li>\n<li>For 2-jets VBF channel, the jet-jet invariant mass should be high for signal.</li>\n</ul>\n<p><strong>Some comments about SVFIT and CAKE-A</strong>:</p>\n<ul>\n<li>I know some teams (e.g. Lubos&#8217; team) are using <strong>SVFIT</strong>, which is the CMS counter-partner of ALTAS&#8217; MMC method (the DER_invariant_MMC feature). SVFIT has more variables and more considerable features than MMC, so SVFIT can do better Higgs invariant mass construction. Deriving SVFIT feature using the current provided features is very hard, so I haven&#8217;t done it.</li>\n<li><strong>CAKE-A</strong> feature is basically the likelihood if a mass peak belongs to Z mass or Higgs mass. CAKE team claims that, it is a very complicated feature and some positive reports exist in the leaderboard, so ATLAS should investigate this feature for their Higgs search model.</li>\n</ul>\n<p><strong>2.4 Feature selection</strong></p>\n<p>Gradient boosting tree method is generally sensitive to confusing samples. In this particular problem of Higgs to tau-tau, many background events can have very similar features to the signal ones, thus, a good understanding of features and feature selection can help reducing confusions for better model building.</p>\n<p>The feature selection uses some logic and/or domain knowledge, and I haven&#8217;t applied any automatic feature selection techniques, e.g. PCA. The reason is that, most auto feature selection methods are designed for capturing the max errors while this competition is for maximizing the AMS score, so I am afraid some feature selection can accidentally drop some important features.</p>\n<p>Because of the proton-proton collision in the longitudinal direction, the transverse direction is symmetric, thus the raw phi values of these particles are mostly useless and should be removed for less confusions for the boosting process. It is also the reason why ATLAS and CMS detectors are cylinders.</p>\n<ul>\n<li>Some one on the forum asks why the Phi distribution shows some periodic &#8216;waves&#8217; and questions if it is a useful feature. It is actually from <a href=\"http://www.atlas.ch/calorimeter.html\">ATLAS periodical calorimeter structure</a>.</li>\n</ul>\n<p>The tau and lep raw eta values don&#8217;t help much too. The reason behind it is the Higgs to tau tau production mechanism, but one can easily see it from the symmetric distributions of these variables.</p>\n<p>Jets raw eta values are important. The physics reason behind it is from the jet production mechanism where the jets from the signal should be more centralized, but one can easily find it by overlapping the distributions of PRI_jet_(sub)leading_eta for the signal and the background without physics knowledge.</p>\n<p><strong>2.5 Discussions</strong></p>\n<p><strong>More advanced features or not? It is a question.</strong> I only keep physically meaningful features for the final submission. I have experimented some other tricky features, e.g. the weighted transverse invariant mass with PT ratio, and some of them help scoring on the public LB. However, it doesn&#8217;t show significant improvement in my CV score. To be safe, I spend the last 3 days before the deadline removing these &#8216;tricky&#8217; features, and keeping only the basic physics feature (linear combinations) as well as these pseudo invariant mass features, in order not to overfit the public LB. After checking the private LB scores, I find some of them can help, but only a little. @Raising Spirit on the forum has <a href=\"https://www.kaggle.com/c/higgs-boson/forums/t/10314/maybe-you-want-to-use-this-variable/53622#post53622\">posted a feature</a> which is DER_mass_MMC*DER_pt_ratio_lep_tau/DER_sum_pt and Lubos has <a href=\"https://www.kaggle.com/c/higgs-boson/forums/t/10314/maybe-you-want-to-use-this-variable/53628#post53628\">a nice comment</a> if it is good idea or not.</p>\n<p><strong>CAKE features effect.</strong> I have used 3 test submissions for testing CAKE-A and CAKE-B feature. With CAKE A+B, both of my public and private LB submission score drops around 0.01; with CAKE-A, my model score has almost no change (reduce 0.0001); with CAKE-B, my model score improves 0.01. I think it is because CAKE-A feature may have strong correlations with my current feature, while CAKE-B is essentially the <a href=\"http://inspirehep.net/record/1260715/?ln=en\">MT2</a> variable in physics which can help for the hadronic (jet) final state. I haven&#8217;t include these submissions in my final scoring ones, but thanks to CAKE team for providing these features.</p>\n<p><strong>3. Conclusion and lessons learned</strong></p>\n<p><strong>What I haven&#8217;t used:</strong></p>\n<ul>\n<li>loss function using AMS score: In these two posts (<a href=\"http://www.kaggle.com/c/higgs-boson/forums/t/10286/customize-loss-function-in-xgboost\">post 1</a> and <a href=\"http://www.kaggle.com/c/higgs-boson/forums/t/10272/an-approach-to-optimizing-ams\">post 2</a>), they proposed the AMS loss function. XGboost has a good interface for these customized loss function, but I just didn&#8217;t have chance to tune up the parameters.</li>\n<li>Tricky non-linear non-physical features.</li>\n<li>Vector PT summations of tau-lep, lep-tau and other particle pairs, and their open angles with other particles. They are physically meaningful, but my model doesn&#8217;t pick them up <img src=\"https://s0.wp.com/wp-content/mu-plugins/wpcom-smileys/twemoji/2/72x72/1f626.png\" alt=\"😦\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></li>\n<li>Categorizing the jet multiplicity (PRI_jet_num). Usually this categorizing technique works better since it increase the feature dimension for better separation, but not for this time, maybe because of my model parameters.</li>\n<li>Split models by PRI_jet_num. In the common Higgs analysis, the analysis is divided into different num-of-jets categories, e.g. 0-jet, 1-jet, 2-jets, because each partition can have different physical meanings in the Higgs production. XGboost has caught this partition nicely with features, and it handles the missing values in a nice way.</li>\n</ul>\n<p><strong>Lesson learned</strong></p>\n<ul>\n<li>Automate the process: script for filing CV, script for the full workflow of training + testing, script for parameter scan, library of adding features so CV and training can have consistent features. It can save very much time.</li>\n<li>Discuss with the team members and check the forum.</li>\n<li>Renting a cloud is easier than buying a machine.</li>\n<li>I show learn ensembling classifiers for better score in future.</li>\n<li>Spend some time: studying the features and the model needs some time. I paused my submission for 2 months for preparing for my O1-A visa application (I got no luck in this year&#8217;s H1B lottery, so I had to write &#8216;a lot of a lot&#8217; for this visa instead) and only fully resumed it about 2 weeks before deadline when my visa was approved, so my VM instance has run like crazy for feature work, model tuning and CV since then while I sleep or during daily work. Fortunately, these work (plus electricity bills to Google) has good payback on the rank.</li>\n<li><img class=\"\" src=\"https://dl.dropboxusercontent.com/u/10652630/blog/vm-cpu.png\" alt=\"\" width=\"914\" height=\"402\" /></li>\n</ul>\n<p><strong>4. Acknowledgment</strong></p>\n<p>I want to thank <a href=\"http://www.kaggle.com/users/32300/tianqi-chen\">@Tianqi Chen</a> (the author of xgboost), @yr, @Bing Xu, @Luboš Motl for their nice work and the discussions with them. I also want to thank to Google Cloud Engine for providing 500$ free credit for using their cloud computer, so I don&#8217;t have to buy my own computer but just rent a 16-core VM.</p>\n<p>5. Suggestions to CMS, ATLAS, ROOT and Kaggle</p>\n<p>To CMS and ATLAS: In the physics analyses, ML was called &#8216;multi-variate analysis&#8217; (MVA, so ROOT&#8217;s ML package is called TMVA) where features were &#8216;variates&#8217;. This method of selecting variates (features) was from the traditional cut-based analysis where each variate must be <strong>kind of strong physically meaningful so they were explainable</strong>, for example, in CMS&#8217;s tau-tau analysis, we had 2-jet VBF channel where tau-tau required jet-jet momentum was greater than 110 GeV etc. Using this cut-based feature selection idea in the MVA technique gave some limits of feature work where features were carefully selected by physicists using their experience and knowledge, which was good but very limited. In this competition, I came up some intuitive &#8216;magic&#8217; features using my physics intuition, and the model + feature selection techniques in ML helped removing non-sense ones as well as finding new good features. So, my suggestion to CMS and ATLAS on the feature work is that, we should introduce more ML techniques for helping feature/variate engineering work and use machine&#8217;s power for finding more good features.</p>\n<p>To ROOT TMVA: XGboost is a great idea for parallelizing the GBM learning. ROOT&#8217;s current TMVA is using single thread which is slow, and ROOT should have some similar idea of xgboost into the next version of TMVA.</p>\n<p>To Kaggle: it might be a good idea of having some sponsored computing credits from some cloud computing providers and giving them to the competitors, e.g. Google Cloud and Amazon AWS. It can remove the obstacles of computing resources for competitors, and also a good advertisement for these cloud computing providers.</p>\n<p><strong>6. Our background</strong></p>\n<p>My teammate <a href=\"http://www.kaggle.com/users/106466/dlop78\">@dlp78</a> and I are both data scientists and physicists. We used to work on <a href=\"http://cms.web.cern.ch/\">the CMS experiment</a>. He worked on Higgs -> ZZ and Higgs-> bb discovery channel, and I worked on Higgs->gamma gamma discovery channel and some supersymmetry/exotics particle search. My <a href=\"http://cds.cern.ch/record/1423333/\">PhD dissertation</a> is search for long-lived particle decay into photons, in which the method is inspired by the tau discovery method, and <a href=\"http://en.wikipedia.org/wiki/Gail_Hanson\">my advisor</a> is one of the scientists who discovered the tau particle (well, she also discovered many others, for example: Psi, D0, Tau, jets, Higgs). I have my Linkedin page linked on my Kaggle profile page, and I would like to link to you great Kaggle competitors.</p>\n",
  "wfw:commentRss": "https://no2147483647.wordpress.com/2014/09/17/winning-solution-of-kaggle-higgs-competition-what-a-single-model-can-do/feed/",
  "slash:comments": 6,
  "media:content": [
    {
      "media:title": "phunterlau"
    },
    "",
    "",
    ""
  ]
}