{
  "title": "Hints of the Photonic Nature of the Electromagnetic fields in Classical Electrodynamics and its connection to the electronic charge and vacuum energy density. (arXiv:2211.01850v1 [physics.class-ph])",
  "link": "http://arxiv.org/abs/2211.01850",
  "description": "<p>The electromagnetic fields of a long dipole working without dispersive and\ndissipative losses are analyzed in the frequency domains. The dipole produces\nradiation in bursts of duration T/2 where T is the period of oscillation. The\nparameter studied in this paper is the energy, U, dissipated in a single burst\nof radiation of duration T/2. We have studied how U vary as a function of the\ncharge associated with the current in the dipole and the ratio of the length of\nthe dipole and its radius. We have observed a remarkable result when this ratio\nis equal to the ratio of the radius of the universe to the Bohr radius. Our\nresults, based purely on the classical electrodynamics and general relativity,\nshow that, as the magnitude of the oscillating charge (as defined by the root\nmean square) reduces to the electronic charge, the energy dissipated in a\nsingle burst of radiation reduces to hv, where v is the frequency of\noscillation and h is the Planck constant. The importance of this finding is\ndiscussed. In particular, the results show that the existence of a minimum free\ncharge in nature, i.e., electronic charge, is a direct consequence of the\nphotonic nature of the electromagnetic fields. Furthermore, the presented\nfindings allow to derive for the first time an expression for the vacuum energy\ndensity of the universe in terms of the other fundamental constants in nature,\nthe prediction of which is consistent with experimental observations. This\nequation, which combines the vacuum energy, electronic charge and mass, speed\nof light, gravitational constant and Planck constant, creates a link between\nclassical field theories (i.e., classical electrodynamics and general\nrelativity) and quantum mechanics.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Cooray_V/0/1/0/all/0/1\">Vernon Cooray</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Cooray_G/0/1/0/all/0/1\">Gerald Cooray</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Rubinstein_M/0/1/0/all/0/1\">Marcos Rubinstein</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Rachidi_F/0/1/0/all/0/1\">Farhad Rachidi</a>"
}