{
  "id": "https://bibleinoneyear.org/en/youth/185",
  "title": "Day 185: Opposition Turned into Opportunity",
  "description": "Psalm 80:3, 2 Kings 9:6,14a,16,22, Acts 23:12–13,16–18a,19–30,34.  Stephen Lungu was captivated by the preacher In each of the passages for today we see attacks of various kinds and how God turns opposition into opportunity",
  "pubDate": "Sun, 04 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/185/?ignore",
  "itunes:duration": "15:07",
  "guid": "enyouth04072021-185",
  "length": 907.99,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 185: Opposition Turned into Opportunity",
  "itunes:subtitle": "Psalm 80:3, 2 Kings 9:6,14a,16,22, Acts 23:12–13,16–18a,19–30,34.  Stephen Lungu was captivated by the preacher In each of the passages for today we see attacks of various kinds and how God turns opposition into opportunity",
  "itunes:summary": "Stephen Lungu came to our home and told me his story. He is the oldest son of a teenage mother from a township in Zimbabwe. She was trapped in a difficult marriage to a man more than twenty years her senior. She dealt with her struggles by drinking heavily.\nOne day, when Stephen was three years old, his mother took him, his brother and baby sister into town. Saying she needed to go to the toilet, Stephen’s mother left him holding his sister in the busy town square, while his brother John played on the ground. Two hours later she had not returned. Their mother had run away, leaving the three children in the reluctant care of an aunt. By the age of eleven, Stephen too had run away – preferring to live on the streets.\nGrowing up, Stephen developed a strong bitterness against God. As a teenager he was recruited into one of the urban gangs, called the Black Shadows, which carried out violence, theft and destruction on the streets of Zimbabwe.\nWhen a travelling evangelist came to town to speak to thousands of people about Jesus in a large tent, Stephen went to firebomb the event. He carried a bag full of bombs. He wanted to attack the event because he wanted to attack God. As Stephen awaited the moment for his attack, Shadrach Maloka, a South African evangelist, took to the stage and announced that the Holy Spirit had warned him that many in the audience may die soon without Christ. Astonished, the Black Shadows thought someone had figured out their plan. Stephen Lungu was captivated by the preacher.\nIn each of the passages for today we see attacks of various kinds and how God turns opposition into opportunity.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 185
}