{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-8426498299120240997",
  "published": "2019-10-24T11:32:00.000-07:00",
  "updated": "2020-01-07T13:18:48.851-08:00",
  "category": "",
  "title": "My Path to Google - Luisa Vassalo, Associate Account Strategist",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Welcome to the 37th installment of our blog series “My Path to Google.” These are real stories from Googlers, interns, and alumni highlighting how they got to Google, what their roles are like, and even some tips on how to prepare for interviews.<br /><br />Today’s post is all about Luisa Vassalo. Read on!<br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-c9SGFMzxD84/XbHsSUcBltI/AAAAAAAAAsw/HQNpR0lzAr0MWa1K-7YasQqedxXhuAvKACLcBGAsYHQ/s1600/unnamed%2B%252833%2529.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"410\" height=\"320\" src=\"https://1.bp.blogspot.com/-c9SGFMzxD84/XbHsSUcBltI/AAAAAAAAAsw/HQNpR0lzAr0MWa1K-7YasQqedxXhuAvKACLcBGAsYHQ/s320/unnamed%2B%252833%2529.jpg\" width=\"256\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Luisa (front) and teammate, Sarah, at Noogler orientation in Dublin</td></tr></tbody></table><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><b><br />Can you tell us a bit about yourself?</b><br />I was born and raised in Lisbon, Portugal. When I was 18 I moved to the United Kingdom to pursue my bachelor’s degree in Business and Management.<br /><br />While at university,&nbsp; I worked several part-time jobs which helped me build great soft skills such as time management, leadership, and communication capabilities. During the summer months I volunteered with the <a href=\"https://cisv.org/programmes/\">Children's International Summer Village</a> as a camp counselor educating children in conflict resolution, human rights, diversity, and a sustainable environment.<br /><br />I love playing sports and travelling during my free time — I usually take time off to travel every three months!<br /><br /><b>What’s your role at Google?</b><br />I’m an <a href=\"https://goo.gle/applynow\">Associate Account Strategist</a> in Dublin, Ireland – Google’s Europe, Middle East, and Africa (EMEA) headquarters. I manage small-medium business accounts focusing on the Spanish market.<br /><br />I love that I am constantly communicating with people — clients, colleagues, or support teams at Google. Working with so many clients exposes me to many different business models and objectives. While sometimes challenging, it’s definitely an awesome learning experience.<br /><br />Here’s a quick background on the role for anyone interested in applying: When you join Google you go through an onboarding training and gain a deep understanding of Google Ads Solutions. Once fully prepared, you start working as a junior seller – meaning that you are given a portfolio of clients. Your job is to help them build their online marketing strategy in order to meet their business goals.<br /><br />After about a year, many become senior sellers, where you can decide whether you would like to keep working with a portfolio of direct clients, or if you would like to move teams and work with agencies. The main difference here is that your point of contact is not the final client anymore, but media agencies that represent clients.<br /><br />After you become a senior seller, your career at Google can take many different paths depending on your career goals: sales, management, product related teams, operations, etc.<br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-V0hFin7fU5c/XbHsSI-1yMI/AAAAAAAAAtI/SVQ0m1AXZRQjH_fTBEiXiPnIXtgNaefsgCEwYBhgL/s1600/IMG_20190221_144737.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://1.bp.blogspot.com/-V0hFin7fU5c/XbHsSI-1yMI/AAAAAAAAAtI/SVQ0m1AXZRQjH_fTBEiXiPnIXtgNaefsgCEwYBhgL/s640/IMG_20190221_144737.jpg\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Luisa and teammates, Álvaro, Andrea, and Aaron, at an event in Barcelona.</td><td class=\"tr-caption\"><br /></td></tr></tbody></table><b>Complete the following: \"I [choose one: code/create/design/build] for...\"</b><br />I build for diversity, inclusion, and respect.<br /><br /><b>What does a week at Google look like for you?</b><br />More than half of my time goes towards client’s calls, video conferences, or face to face meetings. That is really where I get to know the client and help them implement a strong online strategy using our Google Ads solutions.<br /><br />Apart from meetings with clients, I also need to ensure that I have time for administrative tasks. This includes any follow up with clients, sending proposals, and also any internal emailing.<br /><br />I also make time for internal trainings and study time. We’re always learning the latest features of the products and getting coaching in order to provide the highest level of support and guidance.<br /><br />After six months at Google, I was able to take on other projects. I really enjoy interviewing and coaching, so I take part in interviewing candidates and coaching the newest members of our team.<br /><br />Here’s a peak at what a general week looks like for me:<br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-exXoOgQqpzY/XbHsSURu8rI/AAAAAAAAAtI/ilH5-7W9Ef4aWskMbebddQcDP7PAN2ikwCEwYBhgL/s1600/Captura%2Bde%2Bpantalla%2B2019-05-30%2Ba%2Blas%2B11.20.58.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"790\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-exXoOgQqpzY/XbHsSURu8rI/AAAAAAAAAtI/ilH5-7W9Ef4aWskMbebddQcDP7PAN2ikwCEwYBhgL/s1600/Captura%2Bde%2Bpantalla%2B2019-05-30%2Ba%2Blas%2B11.20.58.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Luisa'a Google calendar.</td></tr></tbody></table><br /><b>What inspires you to come in every day?</b><br />The people. Google has a strong culture of collaboration, and as a result, I learn something new from my colleagues every single day.<br /><br />In addition, I’m developing a wide variety of skills through my core job and projects I am involved in. In the past two years I have grown a lot as a professional and individual. It’s great because career wise there’s a huge amount of opportunities within Google. I’m in charge of my own development and career path and my managers have always supported me.<br /><br /><b>Can you tell us about your decision to enter the process?&nbsp;</b><br />I came across Google at a career fair while I was at uni. From there I attended Google <a href=\"https://buildyourfuture.withgoogle.com/events/adcamp-emea/#!?detail-content-tabby_activeEl=overview\">AdCamp</a> where I spent two days in the London offices meeting other students and learning about Google.<br />During that time, I realized that I really wanted to join the company. As I said, what really caught my attention was the culture of collaboration and respect, where new ideas were always welcome and creativity was valued and seen an asset.<br />I never thought I was a good fit for Google and I never thought I could ever get in! But the initial application was so straight-forward (uploading a CV) that I gave it a try, and it worked!<br /><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-iTGGmjzjf3k/XbHsTPYaekI/AAAAAAAAAtI/026gxTzSaakPNtZSOS3rnB8li3m8M7ruACEwYBhgL/s1600/unnamed%2B%252835%2529.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"268\" data-original-width=\"512\" height=\"334\" src=\"https://1.bp.blogspot.com/-iTGGmjzjf3k/XbHsTPYaekI/AAAAAAAAAtI/026gxTzSaakPNtZSOS3rnB8li3m8M7ruACEwYBhgL/s640/unnamed%2B%252835%2529.jpg\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Luisa presenting at an event in Madrid.</td></tr></tbody></table><b>How did the recruitment process go for you?&nbsp;</b><br />As mentioned, I first applied to Google after hearing about the Associate Account Strategist role at a university career fair. I went through several interviews and was invited to come to the Dublin offices for the final round.<br /><br />Unfortunately one of the interviews didn't go well and I didn't get an offer. I thought I could never try again! However, the recruiter suggested I work on an internship for six months and then re apply. So that’s exactly what I did! I gained some work experience and after six months I applied again and was able to secure a full time offer.<br /><br />The second time around I used several online resources that were available at the time. I strongly recommend checking out this “<a href=\"https://www.youtube.com/watch?v=eIMR82oO2Dc\">preparing for your Google interview</a>” video, where you’ll get a peak at an example interview.<br /><br /><b>Do you have any tips you’d like to share with aspiring Googlers?&nbsp;</b><br />Be yourself. Be confident. In an interview I recommend trying out the STAR approach when responding to questions (Situation, Task, Action, Result) - it helps keep a concise and clear structure in your answers.</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 115
}