{
  "id": "yt:video:RnvtXikwrIU",
  "yt:videoId": "RnvtXikwrIU",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Crossdraft kiln",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2019-07-12T21:00:03+00:00",
  "updated": "2022-07-21T23:04:47+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Crossdraft kiln",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join me for my first Reddit AMA on Friday 1st November 9am BST / 6pm AEST. My username is u/JohnPlant. The AMA will be on the “r/IAmA” subreddit. \nOrder book: http://po.st/PrimTechBook\nPrimitive Technology: Crossdraft kiln - Building a crossdraft kiln from scratch.\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nLast time, I made Polynesian Arrowroot Flour from scratch: https://youtube.com/watch?v=lMZY_9QNe4I&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI built a cross draft kiln and fired a pot in it to test ideas about how cross draft kilns operate. A cross draft kiln is one in which the flames travel from the firebox and across a horizontal wear chamber before traveling vertically up a chimney and out of the kiln. Unlike an updraft kiln there is no perforated floor that the pottery sits on. Instead the pot sits on the floor of the wearchamber as the flames pass around it. \nTaking soil from a previous kiln and mixing it into mud, I formed the kiln so it was less than a meter long. It was 25 cm wide and tall inside the tunnel formed by the kiln though a slight curve was added to the tops of the side walls. The walls were covered with sticks and a roof of mud was put in place onto this. A chimney about 25 cm wide and 65 cm in total height was made at the end of the kiln to draw flames through the kiln due to natural draft. 5 grate bars made of clay were installed in the firebox to make combustion more efficient. A side door was cut into the kiln to access the ware chamber (25 x 25 cm).\nClay was taken from the creek bank and mixed with previous crushed pottery as grog. It was formed into a pot with a pouring spout. This was dried and then placed into the kiln. The kiln was fired with the flames acting as planned and the pot was fired in a relatively short 1 hour and 20 minutes. It would have been a shorter firing time had the kiln not still been wet. The pot was tested with water and held it satisfactorily. \nCross draft kilns are an apparent improvement on updrafts with the reasoning being that more efficiently retain heat as the hot gasses don't immediately exit the kiln leaving the colder gasses inside. Hot spots are less likely to develop giving a more uniform firing of the pottery. Cross draft kilns developed early in Asia, evolving from the practice of excating tunnels into the side of hills to fire pottery. It's unknown whether the European cross drafts were adopted from the east or were the result of the gradual extension of the firing arch outwards from the conventional updrafts. My personal experience is that this type of kiln fires quickly and evenly though I need to experiment more to understand the positive and negative aspects more fully.\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}