{
  "guid": "urn:uuid:98f3665a-85c8-465f-89a4-c97eb0e71f5a",
  "link": "https://www.who.int/news/item/21-03-2022-on-world-tb-day-who-calls-for-increased-investments-into-tb-services-and-research",
  "a10:author": {
    "a10:name": ""
  },
  "title": "On World TB day WHO calls for increased investments into TB services and research",
  "description": "<p>On World TB Day, WHO calls for an urgent investment of resources, support, care and information into the fight against tuberculosis (TB). Although 66 million lives have been saved since 2000, the COVID-19 pandemic has reversed those gains. For the first time in over a decade, TB deaths increased in 2020. Ongoing conflicts across Eastern Europe, Africa and the Middle East have further exacerbated the situation for vulnerable populations.<br /></p><p>Global spending on TB diagnostics, treatments and prevention in 2020 were less than half of the global target of US$ 13 billion annually by 2022. For research and development, an extra US$ 1.1 billion per year is needed<em>. &ldquo;Urgent investments are needed to develop and expand access to the most innovative services and tools to prevent, detect and treat TB that could save millions of lives each year, narrow inequities and avert huge economic losses,&rdquo; </em>said Dr Tedros Adhanom Ghebreyesus. <em>&ldquo;These investments offer huge returns for countries and donors, in averted health care costs and increased productivity.&rdquo;</em><br /></p><p>Investments in TB programmes have demonstrated benefits not just for people with TB but for health systems and pandemic preparedness. Building on lessons learnt from COVID-19 research, there is a need to catalyse investment and action to accelerate the development of new tools, especially new TB vaccines.<br /></p><p>Progress towards reaching the 2022 targets set in the UN High Level Meeting political declaration and the WHO Director-General&rsquo;s Flagship Initiative Find.Treat.All is at risk mainly due to lack of funding. Between 2018&ndash;2020, 20 million people were reached with TB treatment. This is 50% of the 5-year target of 40 million people reached with TB treatment for 2018-2022. During the same period 8.7 million people were provided TB preventive treatment. This is 29% of the target of 30 million for 2018-2022. <br /></p><p>The situation is even worse for children and adolescents with TB. In 2020, an estimated 63 % of children and young adolescents below 15 years with TB were not reached with or not officially reported to have accessed life-saving TB diagnosis and treatment services; the proportion was even higher - 72% - for children under 5 years. Almost two thirds of eligible children under 5 did not receive TB preventive treatment and therefore remain at risk of illness.<br /></p><p>COVID-19 has had a further negative and disproportionate impact on children and adolescents with TB or at risk, with increased TB transmission in the household, lower care-seeking and access to health services. WHO is sounding the alarm on World TB Day for countries to urgently restore access to TB services, disrupted due to COVID-19 pandemic for all people with TB, especially children and adolescents.<br /></p><p>&ldquo;<em>Children and adolescents with TB are lagging behind adults in access to TB prevention and care</em>&rdquo;, said Dr Tereza Kasaeva, Director of WHO&rsquo;s Global TB Programme. &ldquo;<em>The WHO guidelines issued today are a gamechanger for children and adolescents, helping them get diagnosed and access care sooner, leading to better outcomes and cutting transmission. The priority now is to rapidly expand implementation of the guidance across countries to save young lives and avert suffering</em>&rdquo;<br /></p><h2>Updated guidelines for the management of TB in children and adolescents&nbsp;<strong><em></em></strong><br /></h2> <p>Updated guidelines for the management of TB in children and adolescents released by WHO today highlight new patient-centred recommendations for diagnosis, treatment and prevention.&nbsp; The most recent recommendations are:</p><ul><li>Diagnostic testing has expanded to include non-invasive specimens, such as stools. </li><li>Rapid molecular diagnostics are recommended as the initial test for TB diagnosis for children and adolescents.</li><li>Children and adolescents who have non-severe forms of drug-susceptible TB are now recommended to be treated for four months instead of six months, as well as TB meningitis, where a six-month regimen is now recommended instead of 12 months. This promotes a patient-centred approach that will reduce the costs of TB care for children, adolescents and their families. &nbsp;</li><li>Two of the newest TB medicines to treat drug resistant TB (bedaquiline and delamanid) are now recommended for use in children of all ages, making it possible for children with drug-resistant TB to receive all-oral treatment regimens regardless of their age.</li><li>New models of decentralized and integrated TB care are also recommended, which will allow more children and adolescents to access TB care or preventive treatment, closer to where they live.<br /></li></ul> <p>TB remains one of the world&rsquo;s deadliest infectious killers. Each day, over 4 100 people lose their lives to TB and close to 30 000 people fall ill with this preventable and curable disease. Ending TB requires concerted action by all sectors. On World TB Day, WHO calls on everyone- individuals, communities, societies, donors and governments to do their part to end TB.</p><p>--------------------------------------------------------------------------------</p><p><strong>Note to the editor:</strong></p><p>WHO is working closely with its offices in Ukraine and neighboring countries, the WHO Regional Office for Europe and partners to rapidly respond to the health emergency triggered by the conflict and to minimize disruptions to the delivery of critical healthcare services. As part of these overarching efforts, given that Ukraine has a high burden of drug-resistant TB, WHO is proactively supporting efforts to enable access to TB care services for the people with TB, refugees and displaced populations at risk.<strong></strong></p><p>&nbsp;</p>",
  "pubDate": "Mon, 21 Mar 2022 13:36:27 Z"
}