{
  "title": "213: Bad Henry",
  "link": "https://audioboom.com/posts/7988274",
  "itunes:episode": 213,
  "itunes:title": "Bad Henry",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3202,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On a February night in 1994, Lamar Woods came home. The door to his apartment was open and his 10 month old son was screaming. In the bedroom, Lamar found his girlfriend, Brandi Henderson, brutally murdered. For a local detective, the murder sounded eerily similar to other killings that had happened in the area in recent years. It was clear that a serial killer was on the loose and it was only a matter of time until he killed again. <br>\n<br>\n<a href=\"https://shop.truecrimeobsessed.com/\">OUR MERCH STORE IS OPEN!</a> Want a \"Steve, I've Been Duped\" T-shirt, or how about \"Not A Mother\" baseball T? \"Let The Women Do The Work\" sweatshirt? We've got all that and more for a limited time only! <a href=\"https://shop.truecrimeobsessed.com/\">CHECK IT OUT HERE!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 30 Nov 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-11-30:/posts/7988274",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}