{
  "title": "John Toll - Cinematographer",
  "pubDate": "Wed, 12 May 2021 09:00:00 +0000",
  "guid": "69df3263-3af3-417c-bdab-123d4a3ec707",
  "link": "https://teamdeakins.libsyn.com/john-toll-cinematographer",
  "itunes:image": "",
  "description": "<p>EPISODE 114 - JOHN TOLL - Cinematographer</p> <p>Team Deakins has a great talk with cinematographer, John Toll (LEGENDS OF THE FALL, BRAVEHEART, WIND, THE THIN RED LINE, RAINMAKER). We start on a humorous note as we learn how he started in the business and learned on the job! We talk about his time as an operator and his eventual switch over to working as a DP. He recalls his time working for Conrad Hall as an operator and what he learned and also speaks of the different methods of working as an operator in England. We learn about his first big break to shoot the behind-the-scenes footage on ET which was never seen. He also shares why he chose to shoot WIND (his first feature as a DP), even though he tended to have bad seasickness! We learned about the difficulty of shooting WIND on the water and in boats, which is even more impressive when you consider it was his first time as a cinematographer! John’s humorous way of at looking things will have you laughing!<br /> <br /> RECOMMENDED EPISODE VIEWING: Wind</p>",
  "content:encoded": "<p>EPISODE 114 - JOHN TOLL - Cinematographer</p> <p>Team Deakins has a great talk with cinematographer, John Toll (LEGENDS OF THE FALL, BRAVEHEART, WIND, THE THIN RED LINE, RAINMAKER). We start on a humorous note as we learn how he started in the business and learned on the job! We talk about his time as an operator and his eventual switch over to working as a DP. He recalls his time working for Conrad Hall as an operator and what he learned and also speaks of the different methods of working as an operator in England. We learn about his first big break to shoot the behind-the-scenes footage on ET which was never seen. He also shares why he chose to shoot WIND (his first feature as a DP), even though he tended to have bad seasickness! We learned about the difficulty of shooting WIND on the water and in boats, which is even more impressive when you consider it was his first time as a cinematographer! John’s humorous way of at looking things will have you laughing!  RECOMMENDED EPISODE VIEWING: Wind</p>",
  "enclosure": "",
  "itunes:duration": "01:21:25",
  "itunes:explicit": false,
  "itunes:keywords": "filmmaking,wind,collaboration,Operator,cinematographer,dp,deakins,visualarts,johntoll",
  "itunes:subtitle": "EPISODE 114 - JOHN TOLL - Cinematographer Team Deakins has a great talk with cinematographer, John Toll (LEGENDS OF THE FALL, BRAVEHEART, WIND, THE THIN RED LINE, RAINMAKER). We start on a humorous note as we learn how he started in the business and...",
  "itunes:episode": 114,
  "itunes:episodeType": "full"
}