{
  "title": "#422: Fawkes Unites (HBP 29, The Phoenix Lament)",
  "link": "https://audioboom.com/posts/7297662",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5069,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club member Chloe!</li>\n<li>Wizards Unite is out and we discuss what we like about the game so far!</li>\n<li>Hagrid's Magical Creatures Motorbike Adventure is dealing with some launch pains</li>\n<li>Chapter-by-Chapter returns with Harry Potter and the Half-Blood Prince, Chapter 29 The Phoenix Lament</li>\n<li>7-Word Summary: After Dumbledore's death, Harry regroups with friends</li>\n<li>Harry breaks the news of Dumbledore's death and reveals the truth about Snape and Draco</li>\n<li>Lupin's loses control when learning of Dumbledore's death in a way Harry has never seen. Is this because of everything Dumbledore has done for Lupin?</li>\n<li>We discuss the healing impact of Fawkes' phoenix song on the Order</li>\n<li>Why did Lupin or Sirius never tell Harry about Snape and Lily?</li>\n<li>Given Harry had been right about Draco all year, if you were Ron and Hermione, how would you feel?</li>\n<li>The Vanishing Cabinet and Hand of Glory have strong threads connecting them back to Chamber of Secrets</li>\n<li>When Flitwick comes to get Snape and is mysteriously unconscious, why aren't Hermione and Luna quicker on the uptake?</li>\n<li>Shouldn't the fact that Snape didn't kill Flitwick tell us that more is happening than meets the eye? Does Snape actually save Luna and Hermione's lives?</li>\n<li>With Death Eaters in Hogwarts, do we think Snape is trying to act as quickly as possible to prevent them from harming the students/?</li>\n<li>Why didn't the Order stop Snape and Malfoy? Why didn't they alert the Ministry?</li>\n<li>Much like in Goblet of Fire, why didn't the Dark Mark trigger an immediate Ministry response?</li>\n<li>We react to Fleur's response to Bill's condition and Tonks' big reveal about Lupin</li>\n<li>Is Harry not trusting in McGonagall about the Horcruxes a mistake?</li>\n<li>Should Hogwarts remain open?</li>\n<li>The hosts give their MVPs of the Week and Rename The Chapter</li>\n<li>Quizzitch: In the final chapter of Half-Blood Prince, who is sitting in Snape's seat in the Great Hall?</li>\n<li>This week's episode is sponsored by the Eaglemoss' Harry Potter and Fantastic Beasts figurine collections! Get figurines of Harry and Hermione, plus free shipping, for just $9.95 by going to <a href=\"http://www.HeroCollector.com/Wizards\">HeroCollector.com/Wizards</a>!</li>\n</ul>\n",
  "pubDate": "Mon, 24 Jun 2019 14:59:33 +0000",
  "guid": "tag:audioboom.com,2019-06-24:/posts/7297662",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}