{
  "title": "Migrants attack US border agents – officials",
  "link": "https://www.rt.com/news/565767-venezuelan-flag-migrants-pepper-balls/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565767-venezuelan-flag-migrants-pepper-balls/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636189c985f54005914ce366.jpg\" /> US Customs and Border Patrol deployed pepper ball grenades to repel a large group of illegal immigrants <br/><a href=\"https://www.rt.com/news/565767-venezuelan-flag-migrants-pepper-balls/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A large group of illegals waving the Venezuelan flag clashed with the police as they tried to cross into the US</strong></p>\n            \n                        \n            <p>US Customs and Border Patrol repelled a large group of migrants waving a giant Venezuelan flag as they attempted to cross the border near El Paso, Texas on Monday after two members of the group allegedly attacked CBP personnel, the agency told Fox News in a statement.</p>\n<p>The altercation was partially caught on video and the Office of Professional Responsibility has reportedly been tasked with reviewing it.</p>\n<p>After one migrant allegedly assaulted an agent with the flagpole and another supposedly injured an agent by throwing a rock at them, CBP &ldquo;<em>initiated crowd-control measures</em>,&rdquo; according to the statement, including &ldquo;<em>the use of the authorized less-lethal force pepper ball launching system</em>&rdquo; &ndash; pepper ball grenades.</p>\n<p>It&rsquo;s not clear if the would-be immigrants were actually from Venezuela, or how long they had been carrying the large, heavy flag. A video of the altercation posted to social media, filmed by an unnamed &ldquo;<em>activist</em>,&rdquo; shows the migrants being herded back into the Rio Grande by the advancing line of Border Patrol agents while a Honduran flag is left planted in the riverbed on the US side.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEW: Longer video provided by activist at scene shows incident in El Paso yesterday where Border Patrol agents fired pepper balls at a group of Venezuelans crossing illegally into the U.S.<br>CBP says a thrown rock injured one agent, & another was assaulted with a flagpole. <a href=\"https://twitter.com/FoxNews?ref_src=twsrc%5Etfw\">@FoxNews</a> <a href=\"https://t.co/t7FrGjnAtb\">pic.twitter.com/t7FrGjnAtb</a></p>&mdash; Bill Melugin (@BillFOXLA) <a href=\"https://twitter.com/BillFOXLA/status/1587458018395897856?ref_src=twsrc%5Etfw\">November 1, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Border Patrol has apprehended more than 50 large groups consisting of 100 migrants or more in the last month alone, according to Fox. The outlet reported that another group, this one comprising about 300 mostly single adults, crossed into Normandy, Texas on Tuesday.</p>\n<p>A record 2.3 million illegal immigrants were apprehended in the US in fiscal year 2022, with more than 227,000 of those encountered in September &ndash; the worst September in CBP history for migrant crossings. Between 7,300 and 7,500 migrants crossed the border every day during the month.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/633cba4785f54068a147fc17.jpg\" alt=\"Migrants from Venezuela are shown making their way to a Greyhound Bus Station last month in El Paso, Texas, for transportation further into the US interior.\" />\n            <figcaption><a href=\"https://www.rt.com/news/564078-us-sets-loose-illegal-alens/\">US sets free over 300,000 illegal migrants with tracking devices – reports</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>While Border Patrol counts &ldquo;<em>migrant encounters</em>&rdquo; rather than individual migrants, meaning some people may be counted more than once, the figure nevertheless represents a major increase over 2021, which saw 1.7 million migrants enter the US. Both President Joe Biden&rsquo;s political rivals at home and the leaders of Guatemala and El Salvador have blamed the US leader for the increase in illegal crossings.</p>\n<p>Biden reversed several measures adopted by his predecessor, Donald Trump, that had proven to be effective in cutting back on the number of illegal border-crossers, like the &ldquo;<em>remain in Mexico</em>&rdquo; policy forcing new arrivals to wait outside the US while their case was considered, as well as a Covid-19 pandemic control order. A Fox News investigation found the Biden administration was even funding legal aid for immigrants fighting deportation.</p>",
  "enclosure": "",
  "pubDate": "Tue, 01 Nov 2022 21:26:12 +0000",
  "dc:creator": "RT"
}