{
  "title": "Minkorrekt Folge 26 „In Ear Löffelglocke“",
  "itunes:title": "Minkorrekt Folge 26 „In Ear Löffelglocke“",
  "description": "Heute mit der Uhr in unseren Zellen, einem sicheren Endlager für Atommüll, einem Skelettmädchen und dem Schneckenweitwurf. Experiment der Woche: \"In Ear Löffelglocke\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 20 May 2014 07:41:30 +0000",
  "link": "https://minkorrekt.podigee.io/28-minkorrekt-folge-26-in-ear-loffelglocke",
  "guid": "http://methodischinkorrekt.wordpress.com/?p=472",
  "content:encoded": "„In Ear Löffelglocke“ zurück im tristen Unialltag.\n<p>&nbsp;</p>\n<p>Endlich wieder eine ganz normale Folge. Also zumindest das, was bei den Inkorrekten so „normal“ ist&#8230;</p>\n<p>Wir schauen uns erst mal an, was sich bei der Stammzellen-Soap ergeben hat. Nicht viel wie sich rausstellt. Alles köchelt auf kleiner Flamme. Vielleicht war es das langsam mit dieser Soap.</p>\n<p>Wir beantworten eine Zuhörerfrage von <a href=\"www.konscience.de\">Katrin</a>: Sie stellt sich die Frage bis zu welcher Größe Heisenbergs Unschärferelation gilt. Für Fußbälle? Für Mauern? Warum eigentlich nicht? Wir diskutieren die Antwort.</p>\n<p><span id=\"more-931\"></span></p>\n<p>Thema 1: „Die Uhr in unseren Zellen“ – Auf vielfachen Wunsch eines Einzelnen (Detlef Breitenbach, auf Twitter als @blackmac42) dieses biologisch/medizinische Thema. Dank <a href=\"http://www.nature.com/news/biomarkers-and-ageing-the-clock-watcher-1.15014\">dieser Studie</a> könnt ihr jetzt das Alter Eurer Zellen ziemlich genau bestimmen. Und wehe, die sind älter als Euer chronologisches Alter!</p>\n<p>Thema 2: „Vorsicht!!! Radioactiveman!“ – Neu! Ein sicheres Endlager für Atommüll! Jetzt mit noch <a href=\"http://www.sciencedirect.com/science/article/pii/S0265931X14001027\">mehr Biofilm!</a>.</p>\n<p>Experiment der Woche: „In Ear Löffelglocke“ – Ja, es sieht bescheuert aus. (<a href=\"https://plus.google.com/photos/107341743493109591753/albums/6015408690953367857?authkey=COCZyvP7qInvpAE\">FOTOS</a>) Aber der Effekt ist der Hammer. Macht es halt wenn ihr alleine seid (und schickt uns anschließend ein Foto)!</p>\n<p>Musik: „<a href=\"https://www.youtube.com/watch?v=ckZEds5taX4\">DNA-Song</a>“ – Mr. Parr singt Lieder für seine Schüler.</p>\n<p>Thema 3: „Die lange Wanderung des Skelettmädchens“ – Aus Asien über Alaska bis Mexico gewandert und dann in einem Loch verendet. Und ihr dachtet, ihr hättet einen miesen Tag. Aber in diesem Fall immerhin <a href=\"http://www.sciencemag.org/content/344/6185/750\">eine wissenschaftliche Sensation</a>.</p>\n<p>Thema 4: „Schneckenweitwurf“ – Ihr habt <a href=\"http://iopscience.iop.org/1402-4896/89/6/068002/article\">Schnecken im Garten</a>? Reinhard erzählt wie weit ihr diese werfen müsst, um sie los zu sein. Nicht mehr und nicht weniger.</p>\n<p>Zuhörerfrage von Domenic: Wir beantworten ob volle oder Leere Filme/Speicherkarten/Akkus schwerer oder leichter sind. Eine tolle Frage. Vielen Dank auch an Jörg Rings für die <a href=\"http://scienceblogs.de/diaxs-rake/2011/01/12/wird-eine-batterie-leichter-wenn-sie-sich-leert/\">Beispielrechnung</a> in seinem Blog.</p>\n<p>Rausschmeißervideo: „Mr. Parr Wunschsong“ – Reinhard wählt aus der Vielfalt der Videos von Mr. Parr die ihr <a href=\"https://www.youtube.com/user/ParrMr/videos\">hier</a> findet. Hier gibt es seine <a href=\"http://www.teacherspayteachers.com/Store/Parrmr\">Musik zum kaufen</a>.</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 28,
  "itunes:episodeType": "full",
  "itunes:subtitle": "„In Ear Löffelglocke“ zurück im tristen Unialltag.",
  "itunes:summary": "Heute mit der Uhr in unseren Zellen, einem sicheren Endlager für Atommüll, einem Skelettmädchen und dem Schneckenweitwurf. Experiment der Woche: \"In Ear Löffelglocke\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 9865
}