{
  "id": "yt:video:q6R7SyV9C8I",
  "yt:videoId": "q6R7SyV9C8I",
  "yt:channelId": "UCG_nvdTLdijiAAuPKxtvBjA",
  "title": "Uncharted — How to be Ruined by the Video Game Movie Curse | Anatomy Of A Failure",
  "link": "",
  "author": {
    "name": "Filmento",
    "uri": "https://www.youtube.com/channel/UCG_nvdTLdijiAAuPKxtvBjA"
  },
  "published": "2022-05-05T19:15:02+00:00",
  "updated": "2022-09-02T04:42:16+00:00",
  "media:group": {
    "media:title": "Uncharted — How to be Ruined by the Video Game Movie Curse | Anatomy Of A Failure",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Become a Lord or Lady of Glencoe by buying land you can visit any time, and help create nature reserves in Scotland. 10% off with code FILMENTO: https://www.highlandtitles.com\n\n2022's Uncharted is a film adaptation of Playstation's Uncharted video game franchise, with Tom Holland as Nathan Drake and Mark Wahlberg as Mark Wahlberg. And as much as I liked it personally, it is yet another victim of the infamous video game movie curse that also claimed other victims like Mortal Kombat and Tomb Raider. So like in the Moral Kombat video, lets see how being a video game movie has harmful effects on Uncharted and how to hopefully fix them for the future. As weird as it may seem... Sonic the Hedgehog might still be the best video game movie to date. I just hope they get Bioshock right, but then again it's Netflix so I dunno.\n\nSupport:     https://patreon.com/filmento\nFollow:       https://twitter.com/filmento\n\n\nMusic:\n#Uncharted #AnatomyOfAFailure\n\n-\nUncharted (2022)\nIntrepid twentysomething Nathan Drake (Tom Holland) desires a life of adventure. Upon crossing paths with the wry Victor Sullivan (Mark Wahlberg), the adventurous duo embarks on a high-stakes international quest to find the world's most elusive ancient treasure. Along the way, they encounter evidence that may lead to the whereabouts of Drake's estranged brother. Ruben Fleischer directs the prequel to the computer game of the same name. Co-starring Antonio Banderas and Tati Gabrielle.\n-\nMortal Kombat (2021)\nMMA fighter Cole Young (Lewis Tan) is unaware of his heritage - or why Outworld’s Emperor seeks to hunt him down. Cole finds sanctuary under Lord Raiden (Tadanobu Asano) and prepares to stand with Earth’s greatest champions against the enemies of Outworld in a high-stakes battle for the universe. Will Cole be able to unleash his arcana in time to stop the Outworld once and for all? Mortal Kombat is in theaters April 23 and streaming exclusively on HBO Max at 12:01 am PT/3:01 am ET. Available on HBO Max in the US only at no extra cost to subscribers for 31 days from its theatrical release. The Mortal Kombat movie everything wrong with Uncharted honest trailer uncharted watch full movie online free 4k clip hd uncharted sequel elena fisher uncharted movie funny moments best moments uncharted ending fight scene uncharted ending explained uncharted movie sequel 2 uncharted bad movie uncharted great movie uncharted failure box office flop reboot from director Simon McQuoid features the defenders of Earthrealm Liu Kang, Sonya Blade, Jax Briggs and more entering the Mortal Kombat tournament to save the world from Shang Tsung, Sub-Zero, Mileena and other supernatural kombatants. Hanzo Hasashi’s (Hiroyuki Sanada) life is forever changed when his compound is attacked by a few uninvited visitors.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}