{
  "title": "AI-Generated Fashion Is Next Wave of DIY Design",
  "link": "https://spectrum.ieee.org/dall-e-fashion-design",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/fashion-platform-cala-s-new-generative-ai-tool-displays-multiple-ai-generated-jackets.jpg?id=32010698&width=1200&height=600&coordinates=0%2C86%2C0%2C86\"/><br/><br/><p>Could AI inspire your next ugly holiday sweater?</p><p>As odd as it may sound, recent advancements in machine learning have made it possible. <a href=\"https://ca.la/\" rel=\"noopener noreferrer\" target=\"_blank\">CALA</a>, an “operating system for fashion” that helps designers sketch, prototype, and produce new products, is the first service to implement OpenAI’s <a href=\"https://apitracker.io/a/openai-dall-e\" target=\"_blank\">DALL-E API</a>. Its new generative AI tool is live and free to try.</p><p>“The use case is enabling anyone to get their idea across without a full sketch or 3D renders, by having DALL-E generate ideas via text inputs,” says <a href=\"https://www.linkedin.com/in/awhyit/\" rel=\"noopener noreferrer\" target=\"_blank\">Andrew Wyatt</a>, cofounder and CEO at CALA. “It’s a continuance of us democratizing access in an industry that’s historically been very insular.” </p><h2>DALL-E for e-fashion?</h2><p>Founded in 2016, CALA is a fashion platform built for designers looking for an accessible way to turn ideas into tangible products. The service is available through both its website and a mobile app. Anyone can sign up and try the platform for free—so I did.</p><p>It’s broadly similar to <a href=\"https://spectrum.ieee.org/these-ai-tools-generate-breathtaking-art-and-controversy\" target=\"_self\">AI art generators such as DALL-E 2 and Stable Diffusion</a> but customized to fit CALA’s platform. Instead of entering a text prompt in a single, long string of text, designers are guided to first select a base style, such as a sweater, blouse, or tote, from a list of 25 options. Designers then use generative AI to modify the style through two textual prompts. The first describes the design based on adjectives and materials, while the other describes desired trims and features such as cuffs or zippers. </p><p class=\"pull-quote\">“We want to prevent the situation where someone comes in, they type in ‘brown shirt,’ and they’re, like, this sucks.”<br/>—Andrew Wyatt, CALA</p><p>Wyatt believes this alternative user interface will help designers zone in on important features and avoid duds. “What we’re kind of doing here, is we built a UI on top of the prompt engineering. Our goal here is to get people to a meaningful result as quickly as possible.” This, Wyatt hopes, will nudge designers away from dead-end or unappealing results. “We want to prevent the situation where someone comes in, they type in ‘brown shirt,’ and they’re, like, this sucks.”</p><p>I saw the results of this tactic in my own, messy effort to make a Halloween sweater. Fashion design is, admittedly, well out of my comfort zone, but I found the tool approachable. The entire process, including the time spent waiting for results to appear, took less than a minute. CALA presents six results at a time, any of which can then be inserted into the design platform for further iteration.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Fashion platform CALA's generative AI tool displaying multiple suggestions for an ugly halloween sweater. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"9038cb801ac27b8e37fe697e9149f773\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"91655\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/fashion-platform-cala-s-generative-ai-tool-displaying-multiple-suggestions-for-an-ugly-halloween-sweater.jpg?id=32010710&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">CALA's generative AI tool offered ideas for an ugly halloween sweater. I like the one on the bottom left. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">CALA</small></p><p>CALA’s implementation shouldn’t be misunderstood as a one-click design tool. Designers still need to bring their own skills and learn how to use CALA’s platform. However, Wyatt hopes AI will significantly reduce the barrier to entry for new designers and give veteran designers a way to overcome creative roadblocks.</p><p>“We want to let people take an idea and just follow the rabbit trail, through variation after variation after variation,” says Wyatt. “We think it’s going to help people come up with way crazier and different concepts.”</p><h2>Ease of use could drive DALL-E’s surge </h2><p>CALA’s tool is the first live, public implementation of OpenAI’s DALL-E API by a third party. The API is not currently available to the public and doesn’t have a release date. </p><p>This isn’t OpenAI’s first rodeo. <a href=\"https://spectrum.ieee.org/open-ais-powerful-text-generating-tool-is-ready-for-business\" target=\"_self\">GPT-3</a>, the company’s deep learning language model, was released as an API in 2020 and was quickly adopted by third parties. GPT-3 is now used by dozens of companies and organizations including <a href=\"https://copysmith.ai/\" target=\"_blank\">Copysmith</a> and <a href=\"https://www.messagebird.com/en/\" rel=\"noopener noreferrer\" target=\"_blank\">MessageBird</a>. Microsoft acquired a license to use the GPT-3 model for <a href=\"https://blogs.microsoft.com/ai/from-conversation-to-code-microsoft-introduces-its-first-product-features-powered-by-gpt-3/\" rel=\"noopener noreferrer\" target=\"_blank\">Microsoft Power Apps</a> and the <a href=\"https://blogs.microsoft.com/ai/new-azure-openai-service/\" rel=\"noopener noreferrer\" target=\"_blank\">Azure OpenAI Service</a>. </p><p>Luke Miller, product manager at OpenAI, says the company learned valuable lessons from GPT-3’s rollout. “Each deployment teaches us more about safety, engineering, and, ultimately, how our technology can create value in the world,” says Miller. “Since releasing the GPT-3 API, we’ve made a number of improvements to our safeguards. For example, we announced an updated <a href=\"https://openai.com/blog/new-and-improved-content-moderation-tooling/\" rel=\"noopener noreferrer\" target=\"_blank\">moderation endpoint</a> in August and we’re continuing to find ways we can improve.” </p><p>CALA’s experience with the DALL-E API hints ease of use will prove the key driver of the API’s adoption once it’s made available to the public. Wyatt says his company’s engineers put the API to use in just a few weeks. </p><p>“We sort of did some high-res concepting that we passed off to [OpenAI] for feedback about eight weeks ago. Then the total build and polish was less than a month,” says Wyatt. “I could see this being a meaningful integration in a multitude of different products.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"CALA's generative AI tool offering input options that will generate AI fashion suggestions. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"7636c8179deb0a7744e77b0798c43ef1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"07bfc\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/cala-s-generative-ai-tool-offering-input-options-that-will-generate-ai-fashion-suggestions.jpg?id=32010727&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">CALA’s use of the DALL-E API is different from the tool found on DALL·E’s own website.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">CALA</small></p><p>In fact, the flood of tools based on DALL-E has already begun. Shutterstock, a service which offers stock photos, images, and videos, <a href=\"https://www.shutterstock.com/press/20435?irclickid=39YTfO1jIxyNU8EUobwjwUDfUkDV7X2lQ1ECyw0&irgwc=1&utm_medium=Affiliate&utm_campaign=Skimbit%20Ltd.&utm_source=10078&utm_term=theverge.com\" rel=\"noopener noreferrer\" target=\"_blank\">plans to implement the DALL-E API</a> “in the coming months.” Shutterstock paired this announcement with a framework to compensate artists on the platform when their work is used to train AI models. <a href=\"https://blogs.microsoft.com/ai/from-hot-wheels-to-handling-content-how-brands-are-using-microsoft-ai-to-be-more-productive-and-imaginative/\" target=\"_blank\">Microsoft is bringing DALL-E to its Azure OpenAI Service</a>, too, though access is currently invite-only.<br/></p><p>“We’ve always felt the future, especially within fashion, is kind of moving towards AI-powered design and automated production,” says Wyatt. “We just thought it was going to be, you know, five years from now. Over the last six months, just seeing the amount of progress...[we] think there’s just going to be tremendous innovation over the next couple of years.” </p>",
  "pubDate": "Sat, 29 Oct 2022 17:42:42 +0000",
  "guid": "https://spectrum.ieee.org/dall-e-fashion-design",
  "category": [
    "Dall-e 2",
    "Artificial intelligence",
    "Diy",
    "Fashion tech"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}