{
  "title": "62: Thomas Sterner- Fully Engaged: Using the Practicing Mind in Daily Life",
  "pubDate": "Thu, 17 Nov 2016 19:54:17 +0000",
  "guid": "87449a3bef6af4a67ccd1c27f10dc94a",
  "link": "https://lifeonpurpose.libsyn.com/62-thomas-sterner-fully-engaged-using-the-practicing-mind-in-daily-life",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #62</strong>, my guest is <strong>Thomas Sterner</strong>, the founder and CEO of The Practicing Mind Institute. As a successful entrepreneur, he is considered an expert in Present Moment Functioning or PMF. He is a popular and in-demand speaker who works with high-performance individuals including, athletes, industry groups and individuals, helping them to operate effectively within high-stress situations so that they can break through to new levels of mastery.</p> <p>As an expert Present Moment Functioning Coach, Tom has brought clarity to thousands regarding how they can accomplish more with less effort, in the least amount of time and with greatly reduced stress. Top media outlets such as NPR, Fox News, and Forbes have sought his advice.</p> <p>Tom joined me for an inspirational chat about his new book <strong>Fully Engaged: Using the Practicing Mind in Daily Life</strong> <em>(New World Library)</em> in which he expands on the concepts from his previous book The Practicing Mind by helping readers apply them to daily life. He shows readers how simple shifts in perspective — such as learning to center their attention on the process of what they are doing instead of what they are trying to achieve; using goals as rudders instead of reminders of what is left to be done; and learning to work without judgment about the process — can completely transform the experience of going through each day.</p> <p><em>“To be fully engaged in an activity means to be present in this moment with whatever you are doing. It also means to be completely content in that experience. There is no anxiousness about or sense of longing for the future, and there is no regret about the past.”</em></p> <p>About: <strong>Thomas M. Sterner</strong> is the author of Fully Engaged and The Practicing Mind. He is accomplished as a musician, composer, and technician in various fields of music; as a recording and audio engineer; and in athletic pursuits from archery to golf. He speaks around the world on developing focus and discipline and lives in Wilmington, Delaware. Visit him online at http://www.practicingmind.com.</p> <p>Thomas M. Sterner is the founder and CEO of The Practicing Mind Institute. As a successful entrepreneur, he is considered an expert in Present Moment Functioning or PMF tm. He is a popular and in-demand speaker who works with high-performance individuals including, athletes, industry groups and individuals, helping them to operate effectively within high-stress situations so that they can break through to new levels of mastery.</p> <p>As an expert Present Moment Functioning Coach, Thomas has brought clarity to thousands regarding how they can accomplish more with less effort, in the least amount of time and with greatly reduced stress. Top media outlets such as NPR, Fox News, and Forbes have sought his advice. He is the author of the best seller The Practicing Mind (New World Library 2012).</p> <p>Prior to founding The Practicing Mind Institute he served as the Chief Concert Piano Technician for a major performing arts center preparing instruments for the most demanding performances. During his 25 year tenure as a high-level technician, he personally worked for industry giants such as Van Cliburn, Pavarotti, Andre Watts, Ray Charles, Fleetwood Mac, Bonnie Raitt, Tony Bennett, Wynton Marsalis and many more. An accomplished musician and composer he has also worked in the visual arts and as a recording studio engineer.</p> <p>In his down time, Tom is an accomplished musician, private pilot, an avid sailor and proficient golfer. He lives in Wilmington Delaware and enjoys spending time with his two daughters and in his recording studio.</p> <p>To learn more about <strong>Tom</strong> and his work, visit: <a href=\"http://tomsterner.com/\" target= \"_blank\">http://tomsterner.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #62, my guest is Thomas Sterner, the founder and CEO of The Practicing Mind Institute. As a successful entrepreneur, he is considered an expert in Present Moment Functioning or PMF. He is a popular and in-demand speaker who works with high-performance individuals including, athletes, industry groups and individuals, helping them to operate effectively within high-stress situations so that they can break through to new levels of mastery.</p> <p>As an expert Present Moment Functioning Coach, Tom has brought clarity to thousands regarding how they can accomplish more with less effort, in the least amount of time and with greatly reduced stress. Top media outlets such as NPR, Fox News, and Forbes have sought his advice.</p> <p>Tom joined me for an inspirational chat about his new book Fully Engaged: Using the Practicing Mind in Daily Life <em>(New World Library)</em> in which he expands on the concepts from his previous book The Practicing Mind by helping readers apply them to daily life. He shows readers how simple shifts in perspective — such as learning to center their attention on the process of what they are doing instead of what they are trying to achieve; using goals as rudders instead of reminders of what is left to be done; and learning to work without judgment about the process — can completely transform the experience of going through each day.</p> <p><em>“To be fully engaged in an activity means to be present in this moment with whatever you are doing. It also means to be completely content in that experience. There is no anxiousness about or sense of longing for the future, and there is no regret about the past.”</em></p> <p>About: Thomas M. Sterner is the author of Fully Engaged and The Practicing Mind. He is accomplished as a musician, composer, and technician in various fields of music; as a recording and audio engineer; and in athletic pursuits from archery to golf. He speaks around the world on developing focus and discipline and lives in Wilmington, Delaware. Visit him online at http://www.practicingmind.com.</p> <p>Thomas M. Sterner is the founder and CEO of The Practicing Mind Institute. As a successful entrepreneur, he is considered an expert in Present Moment Functioning or PMF tm. He is a popular and in-demand speaker who works with high-performance individuals including, athletes, industry groups and individuals, helping them to operate effectively within high-stress situations so that they can break through to new levels of mastery.</p> <p>As an expert Present Moment Functioning Coach, Thomas has brought clarity to thousands regarding how they can accomplish more with less effort, in the least amount of time and with greatly reduced stress. Top media outlets such as NPR, Fox News, and Forbes have sought his advice. He is the author of the best seller The Practicing Mind (New World Library 2012).</p> <p>Prior to founding The Practicing Mind Institute he served as the Chief Concert Piano Technician for a major performing arts center preparing instruments for the most demanding performances. During his 25 year tenure as a high-level technician, he personally worked for industry giants such as Van Cliburn, Pavarotti, Andre Watts, Ray Charles, Fleetwood Mac, Bonnie Raitt, Tony Bennett, Wynton Marsalis and many more. An accomplished musician and composer he has also worked in the visual arts and as a recording studio engineer.</p> <p>In his down time, Tom is an accomplished musician, private pilot, an avid sailor and proficient golfer. He lives in Wilmington Delaware and enjoys spending time with his two daughters and in his recording studio.</p> <p>To learn more about Tom and his work, visit: <a href=\"http://tomsterner.com/\" target= \"_blank\">http://tomsterner.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:00:38",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #62, my guest is Thomas Sterner, the founder and CEO of The Practicing Mind Institute. As a successful entrepreneur, he is considered an expert in Present Moment Functioning or PMF. He is a popular and in-demand speaker who..."
}