{
  "id": "yt:video:sbCvQbBi2G8",
  "yt:videoId": "sbCvQbBi2G8",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "What’s the smartest age? - Shannon Odell",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-10-18T15:01:17+00:00",
  "updated": "2022-10-21T03:48:23+00:00",
  "media:group": {
    "media:title": "What’s the smartest age? - Shannon Odell",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "At what age are you smartest? Dig into how your brain development affects your skills at different stages of your life.\n\n--\n\nTomorrow is the annual Brain Clash — a decathlon of mental challenges, trivia competitions, and puzzles. Amir needs a smart and capable teammate and must choose between three people; all of different ages and talents. So, who should Amir choose for the contest? Shannon Odell breaks down the idea of “smart” and explores how our brain development impacts our skills at various stages of our lives.\n\nLesson by Shannon Odell, directed by Biljana Labović.\n\nThis video made possible in collaboration with Bezos Family Foundation\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nA special thanks to Ali Cohen who provided information and insights for the development of this video.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/what-s-the-smartest-age-shannon-odell\nDig deeper with additional resources: https://ed.ted.com/lessons/what-s-the-smartest-age-shannon-odell#digdeeper\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Angel Alberici, Minh Quan Dinh, Sylvain, Terran Gimpel, Talia Sari, Katie McDowell, Allen, Mahina Knuckles, Charmaine Hanson, Thawsitt, Jezabel, Abdullah Abdulaziz, Xiao Yu, Melissa Suarez, Brian A. Dunn, Francisco Amaya, Daisuke Goto, Matt Switzler, Peng, Tzu-Hsiang, Bethany Connor, Jeremy Shimanek, Mark Byers, Avinash Amarnath, Xuebicoco, Rayo, Po Foon Kwong, Boffin, Jesse Jurman, Scott Markley, Elija Peterson, Ovidiu Mrd, paul g mohney, Steven Razey, Nathan Giusti, Helen Lee, Anthony Benedict, Karthik Balsubramanian, Annastasshia Ames, Amy Lopez, Vinh-Thuy Nguyen, Liz Candee, Ugur Doga Sezgin, Karmi Nguyen, John C. Vesey, Yelena Baykova, Nick Johnson, Carlos H. Costa, Jennifer Kurkoski, Ryan B Harvey and Akinola Emmanuel.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}