{
  "title": "S15 Ep26: The Secret of Skinwalker Ranch with Dr. Travis Taylor",
  "link": "https://audioboom.com/posts/8098497",
  "itunes:episode": 26,
  "itunes:title": "The Secret of Skinwalker Ranch with Dr. Travis Taylor",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4427,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio uncovers The Secret of Skinwalker Ranch with guest Dr. Travis Taylor a NEW series on History Channel!<br>\n<br>\nMonsters, Portals, Shadowy Figures, Strange Energy, UFOs and more finally explored with total honesty. The series features a team of scientists and experts who conduct a daring and thorough search of this infamous 512-acre property located in Utah’s Uinta Basin in an attempt to find out the ‘who?’ ‘what?’ and ‘why?’ behind more than 200 years of UFO and paranormal related mysteries.<br>\n<br>\nFew have ever gained official access to Skinwalker Ranch, and none have ever been able to bring cameras onto the property for a television series, until now. <br>\nSet your DVRs and watch The Secret of Skinwalker Ranch series premiering on Tuesday, March 31st at 10/9c. <br>\n<br>\nFor more information check here: <a href=\"https://www.history.com/shows/the-secret-of-skinwalker-ranch\">https://www.history.com/shows/the-secret-of-skinwalker-ranch</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping",
  "itunes:summary": "Darkness Radio uncovers The Secret of Skinwalker Ranch with guest Dr. Travis Taylor a NEW series on History Channel!\n\nMonsters, Portals, Shadowy Figures, Strange Energy, UFOs and more finally explored with total honesty. The series features...",
  "pubDate": "Sun, 29 Mar 2020 08:00:00 +0000",
  "guid": "247e3942-119e-466b-a3a4-21fe29618eeb",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}