{
  "id": "yt:video:b9VdBFF5nVw",
  "yt:videoId": "b9VdBFF5nVw",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "The Neuroscience of Psychedelic Ego-Death | The latest findings",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2020-08-09T17:51:56+00:00",
  "updated": "2022-09-05T03:52:22+00:00",
  "media:group": {
    "media:title": "The Neuroscience of Psychedelic Ego-Death | The latest findings",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Building on my recent video on what exactly ego death or ego dissolution might be, here I dive into the latest neuroscience findings on how it might work in the brain! \n\nAs always, no prior scientific background is necessary to understand what I present.\n\nAlthough this research is only in its early stages, this is some fascinating stuff and the findings more or less makes sense in relation to peoples' subjective experiences. \n\nHave you experienced ego-death and are looking to make more sense of it in a scientifically-grounded manner? Are you just curious about this fascinating aspect of the psychedelic experience? Then this video is for you!\n\nDon't forget to follow me on social media for all the latest updates: \n\nInstagram\nhttps://www.instagram.com/thepsychedelicscientist \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychedelic-Scientist-113887593677455 \n\nMore info about the host:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/Manesh_Girn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}