{
  "title": "Episode 107: Freud, Projective Tests and .... Poetry",
  "pubDate": "Sun, 18 Oct 2009 19:40:20 +0000",
  "guid": "episode-107-freud-projective-tests-and-poet",
  "link": "http://www.thepsychfiles.com/2009/10/episode-107-freud-projective-tests-and-poetry/",
  "itunes:image": "",
  "description": "How do the Rorschach, the Thematic Apperception Test (TAT) and the House, Tree Person tests work?  Do you reveal something about yourself when you tell stories about pictures or tell what you see in an inkblot or even when you do something as seemingly innocent as drawing a picture of a house? In this episode I try to answer these questions as well as show you how a wonderful poem called How It Will End by Denise Duhamel could be an excellent example of psychology in everyday life.",
  "content:encoded": "How do the Rorschach, the Thematic Apperception Test (TAT) and the House, Tree Person tests work?  Do you reveal something about yourself when you tell stories about pictures or tell what you see in an inkblot or even when you do something as seemingly innocent as drawing a picture of a house? In this episode I try to answer these questions as well as show you how a wonderful poem called How It Will End by Denise Duhamel could be an excellent example of psychology in everyday life.",
  "enclosure": "",
  "itunes:duration": "34:19",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture",
  "itunes:subtitle": "How do the Rorschach, the Thematic Apperception Test (TAT)? Do you reveal something about yourself when you tell stories about pictures or what you see in an inkblot or even when you do something as seemingly innocent as drawing a picture of a house?",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "How do the Rorschach, the Thematic Apperception Test (TAT) and the House, Tree Person tests work? Do you reveal something about yourself when you tell stories about pictures or tell what you see in an inkblot or even when you do something as seemingly innocent as drawing a picture of a house? In this episode I try to answer these questions as well as show you how a wonderful poem called How It Will End by Denise Duhamel could be an excellent example of psychology in everyday life."
}