{
  "title": "Machine Learning PhD Applications — Everything You Need to Know",
  "link": "https://timdettmers.com/2018/11/26/phd-applications/",
  "comments": "https://timdettmers.com/2018/11/26/phd-applications/#comments",
  "dc:creator": "Tim Dettmers",
  "pubDate": "Mon, 26 Nov 2018 19:13:57 +0000",
  "category": [
    "Academia",
    "PhD Life",
    "Advisors",
    "Grad school",
    "PhD"
  ],
  "guid": "http://timdettmers.com/?p=710",
  "description": "<p>I studied in depth how to be successful in my PhD applications and it paid off: I got admitted to Stanford, University of Washington, UCL, CMU, and NYU. This blog post is a mish-mash of how to proceed in your PhD applications from A to Z. It discusses what is important and what is not. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://timdettmers.com/2018/11/26/phd-applications/\">Machine Learning PhD Applications — Everything You Need to Know</a> appeared first on <a rel=\"nofollow\" href=\"https://timdettmers.com\">Tim Dettmers</a>.</p>\n",
  "content:encoded": "<p>I studied in depth how to be successful in my PhD applications and it paid off: I got admitted to Stanford, University of Washington, UCL, CMU, and NYU. This blog post is a mish-mash of how to proceed in your PhD applications from A to Z. It discusses what is important and what is not. It discusses application materials like the statement of purpose (SoP) and how to make sense of these application materials.</p>\n<p><span id=\"more-710\"></span></p>\n<p>There are some excellent sources out there on this topic and it is worth stopping for a second and understand what this blog post will give you and what other sources can give you. This blog post is mainly focused on PhD applications for deep learning and related fields like natural language processing, computer vision, reinforcement learning, and other sub-fields of deep learning. This blog post assumes that you already have a relatively strong profile, meaning you probably have already one or multiple publications under your belt and you worked with more than one person on research. This blog post is designed to help you optimize your chance for success for top programs.</p>\n<p>If you seek more general information for PhD admissions, I recommend reading all the most highly voted questions and answers from <a href=\"https://academia.stackexchange.com/questions?sort=votes\">Academia StackExchange</a>. Other important sources are&nbsp;<a href=\"http://www.cs.cmu.edu/~harchol/gradschooltalk.pdf\">Applying to Ph.D. Programs in Computer Science</a>&nbsp;which is a detailed write-up of the full admission process as viewed by CMU faculty. A similar but more concise source — in particular, relevant for good but not strong candidates — is the blog post <a href=\"https://da-data.blogspot.com/2015/03/reflecting-on-cs-graduate-admissions.html\">Reflecting on CS Graduate Admissions</a>&nbsp;which is again by CMU faculty. Less useful, but a quick read is the negative view of <a href=\"http://www.cs.cmu.edu/~pavlo/blog/2015/10/how-to-write-a-bad-statement-for-a-computer-science-phd-admissions-application.html\">How to Write a Bad Statement for a Computer Science Ph.D. Admissions Application</a>.</p>\n<p>This blog post will first define what is important in PhD applications. Then we will dive into the application materials and how to think about these. Then I will talk a bit about the application process. The final section of the main part of this blog post will be on selecting schools — which schools are too good or too bad for me? After that, I will close with a Q&A section which was drawn from <a href=\"https://twitter.com/Tim_Dettmers/status/1064258559918002176\">questions on Twitter</a>. I will update this Q&A section periodically. If you have some questions regarding the application process, please leave a comment and I try to get back to you.</p>\n<p><figure style=\"width: 600px\" class=\"wp-caption aligncenter\"><a href=\"http://phdcomics.com/comics/archive.php?comicid=368\"><img src=\"https://i0.wp.com/phdcomics.com/comics/archive/phd091703s.gif?resize=600%2C260\" alt=\"\" width=\"600\" height=\"260\"  data-recalc-dims=\"1\"></a><figcaption class=\"wp-caption-text\">Source: <a href=\"http://phdcomics.com/comics/archive.php?comicid=368\"> PhD Comics</a></figcaption></figure></p>\n<h1>Understanding What Makes a Strong PhD Application</h1>\n<p>The most important factor that determines admission at any research university is research potential: How likely are you to become a great researcher? The main direct indicators for this are in order of importance:</p>\n<ol>\n<li>Recommendations: Respected professors speak highly of you. Personal connections are important.</li>\n<li>Research experience: You did successful research before. Measured in publications, first-authorship, and prestige of conference where you published.</li>\n</ol>\n<p>Other indirect factors can help sometimes if they are exceptional, but usually, only the first two factors, recommendations, and research experience count. In order of importance:</p>\n<ol>\n<li>Undergraduate university name: Some universities select aggressively for this, some others do not care so much.</li>\n<li>Employer name: It is common that students are admitted that were previously employed in finance or at companies such as Google, Facebook, etcetera.</li>\n<li>Smarts: Perfect GPA, perfect GRE is somewhat correlated with intelligence (or at least with how fast you can learn and understand).</li>\n<li>Grit / Conscientiousness: You do well under continuous rejection, disappointment, and failure. If you faced and have overcome difficulties you might want to include your story in the statement of purpose.</li>\n<li>Accomplishment: You won Math or CS competitions.</li>\n<li>Recognition: You won prestigious scholarships/fellowships.</li>\n<li>Good at math or engineering: You developed or contributed to open source projects. You worked with research code.</li>\n<li>Heritage: Parents are professors.</li>\n</ol>\n<h1>Understanding Application Materials</h1>\n<h2>Understanding Recommendation Letters</h2>\n<p>For recommendation letters, one could devise four categories: Strong, Good, Weak, and Bad. Note that the main thing that admission committees look for in recommendation letters are indicators of research potential. This section has the main purpose of making you aware of what constitutes a good or strong letter and based on this information it might be easier for you to select letter writers.</p>\n<h3>Signs of a Bad Recommendation Letter</h3>\n<ul>\n<li>Your letter writer knows you and writes bad things about you. Especially in the US anything even slightly critical is very bad.</li>\n<li>Your letter writer does not know you (you had a class with her but you left no impression).</li>\n<li>Your letter is short and only states that you did well in class.</li>\n</ul>\n<h3>Signs of a Weak Recommendation Letter</h3>\n<ul>\n<li>Your letter writer knows you from class only.</li>\n<li>Your letter writer is favorable, but can only write about achievements in class: Great project work in class; part of lively, interesting discussions in class.</li>\n<li>The letter writer does not comment on your research.</li>\n<li>The letter writer is not known by the admission committee nor by potential advisors.</li>\n</ul>\n<h3>Signs of a Good Recommendation Letter</h3>\n<ul>\n<li>The name of the letter writer is known by parts of the admission committee.</li>\n<li>The letter writer&#8217;s name and work are known by at least one potential advisor mentioned in the statement of purpose.</li>\n<li>The letter writer worked with you on research.</li>\n<li>The letter writer mentions your excellent research abilities in anecdotes&nbsp;that demonstrate your creativity, commitment, persistence and research skills in general.</li>\n<li>The letter writer writes about how you published your research.</li>\n<li>The letter writer comments about research done outside of her lab.</li>\n</ul>\n<h3>Signs of a Strong Recommendation Letter</h3>\n<ul>\n<li>US-style recommendation letter: The achievements are oozing through the paper. Everything is very much overdone, that is simple things become grand achievements.</li>\n<li>The letter writer has an excellent command of English.</li>\n<li>The letter writer is personally known by at least one potential advisor mentioned in the statement of purpose.</li>\n<li>The letter writer is known for making excellent recommendations (previously recommended students do very well).</li>\n<li>The letter writer mentions your excellent research abilities in anecdotes&nbsp;that demonstrate your creativity, commitment, persistence and research skills in general.</li>\n<li>The letter writer mentions your abilities which help indirectly with research (engineering skills, presentation skills, interpersonal skills) and wraps these skills into anecdotes.</li>\n<li>The letter writer comments about research done outside of her lab.</li>\n</ul>\n<p>Note a few things:</p>\n<ul>\n<li>Anecdotes are important because the show that the letter writer really knows you. They also read much better. Stories are more interesting than checklists.</li>\n<li>The letter does not need to contain everything listed here to be considered &#8220;bad&#8221; or &#8220;strong&#8221; and so forth. Recommendation letters are complicated.</li>\n<li>If you select recommendation letters it can make sense to have some diversity among letters that highlight different strengths. One strong letter on research skills, a good letter on engineering skills (internship), and a good letter on performance in class/project work is a great combination. This combination is better than a strong letter on research, a good letter on research, and a weak letter on research.</li>\n<li>Please see more details about the process of asking about recommendation letters below.</li>\n</ul>\n<h2>Understanding Publications</h2>\n<h3>Author Position</h3>\n<p>Publications are direct evidence for research experience and research skill. If you published as a first author, people know that you did most of the work. If you published as a second author, people know that you did a good portion of the work (25%-50%). If your name is the third or later, your contribution is discounted, but you probably went through the entire research process towards publication and gained a good amount of research experience. If you published a couple of first author papers a third author paper looks very good: It shows that you can work in a team.</p>\n<h3>Prestige of Venue</h3>\n<p>If you published your work at a respectable&nbsp;conference, people know that: (1) Your work is high quality; (2) your work can be trusted; (3) that your current research skills is sufficient to publish at great conferences, (4) that you are competitive and/or you can stay productive under the pressure of publishing at a top conference.</p>\n<p>It helps to view this in the eyes of a potential advisor: If you have two students, one published already at NeurIPS (Tier A) and one you published at a Tier B conference. You would know that the first student is probably ready to work on a research project which is aiming for NeurIPS next year. The second student would need further preparation, for example, publish in a workshop or at a less competitive Tier A conference before making the step towards NeurIPS. With the second student, there is some risk that this student might take more than a year to acquire the research skills to needed to publish at Tier A conferences. Pushing a student towards NeurIPS can be stressful for an advisor and it is easier to work with someone who already has the necessary research skills. If there is less stress between advisor and student then its easier to develop a strong professional relationship which makes it easier and fun to work with each other. So a potential advisor would have good reasons to select according to the prestige of the conference where you published at.</p>\n<h3>Creativity, Citations, etcetera</h3>\n<p>Other indicators have little effect on the application. Your work might be unusually creative, but you have no track record that you are a creative researcher. Maybe you got lucky.</p>\n<p>The importance of publications often only emerges with the years.&nbsp;Often you published shortly before the PhD applications which means that the citations that you have on your work is a poor indicator of impact. If you get an usually high number of citations in a short time this can help, but maybe you just got lucky or good at marketing. Usually,&nbsp;the number of citations over the past 1-3 years&nbsp;is no reliable indicator of research potential and as such is disregarded. If you have a citation history over the past 5 years this might be a different story, but this does not apply to most applicants.</p>\n<h2>Understanding the Statement of Purpose</h2>\n<p>For most institutions, the statement of purpose is mainly a filter for people who took no time to polish the SoP. Your writing can show how you think, how you can sell, how you explain things, but it can also show that you are lazy and do not pay attention to details. It can show that you are not able to Google simple recipes of how to write (and how not to write) a simple formal document. For some institutions, the SoP can be important (CMU) but the content does not really differ for these institutions.</p>\n<p>Beyond formalities, the SoP is also the only document where you can justify why you did underperform in certain circumstances. For example, you can explain any extraordinary difficulties that you had along the way to graduate school, or it can explain why you did not do so well in certain semesters/quarters at uni. The structure of a SoP should be the following:</p>\n<ol>\n<li>Intro to research interests with a catchy hook that makes the reader want to read more (one paragraph). This is the most important bit: If you do not interest your readers in this paragraph it is unlikely that they will focus on the rest of the letter.</li>\n<li>The research experiences that you gathered along your way to grad school (about one page).</li>\n<li>Identifying what research you want to do in the future.</li>\n<li>Identify people with whom you want to work with and why.</li>\n<li>(Optional) Explaining extenuating circumstances where appropriate.</li>\n</ol>\n<p>In some circumstances, the SoP can be very important. This is so if you showed good — but not strong or weak — academic potential and you had to overcome significant hardship to be able to do research. If your application is strong and write about hardships it might alienate your readers (privileged prick); if your application is weak it might also alienate your reader (whining looser). If your application is good it is exactly right (a&nbsp;smart person that pushed through difficulties). For example, I had a rare situation where I was barred from university access and my SoP was very important to explain the difficulties that I faced under these circumstances.</p>\n<p>However, disclosing hardships and weaknesses — like learning disabilities and mental illnesses — can also be double-edged sword: You might either alienate the readers or you might draw their sympathizes and admiration for persisting in a difficult situation. If you disclose such facts, it needs to be done right and the SoP needs to be extremely polished. Do not attempt this if you do not have the feedback from expert writers. For some stories which are more socially acceptable you do not need expert feedback to do it right: It is easy to write a compelling story where you worked yourself from extreme poverty into college and that you now want to realize your potential by doing a PhD; it is difficult to write a compelling story about the hardships that you faced while suffering from schizophrenia or bipolar disorder.</p>\n<p>However, if you did not face any hardship do not make up stories that make no sense: &#8220;As a white, male, upper-class US citizen, I was haunted by the responsibility of my&nbsp;privilege from an early age and my academic performance suffered in the process.&#8221;, instead, concentrate on your research experience.</p>\n<h2>Understanding GRE, TOEFL, GPA</h2>\n<p>The GRE & TOEFL tests and GPA are usually used as filter criteria. A very high GPA can be a good indicator of &#8220;some intelligence&#8221; which can help with the recommendation letters and publications are borderline. But a GPA of 4.0 will not help if you have no publications and bad recommendation letters — it might even hurt you because it shows that you concentrate on useless classes rather than research. GRE and TOEFL scores are pure filters: If you have an okay score you are not filtered out. If you have a&nbsp;perfect GRE score, it can help a little bit but much less so than a perfect GPA. Great GRE scores do not matter: I got into three out of the top five US computer science programs with verbal 159 (81%), quantitative 163 (86%), writing 5.0 (93%) and a TOEFL 120/120 and a GPA of 8.1/10. Any GPA higher than 3.5 is good. Anything above 3.5 does not matter. A GPA of 4.0 might help a little bit.</p>\n<h2>Understanding the CV</h2>\n<p>The CV lists what you have done. There are no surprises here. The content is important but the content is also determined by what you have done before and cannot be changed. Do not &#8220;tune&#8221; your CV by phrasing things in a nice way or by making your CV look &#8220;nice&#8221; or &#8220;creative&#8221; — this is a waste of time. Just list what you have done.</p>\n<h2>The Application Process</h2>\n<h3>How to ask your professor for a recommendation letter</h3>\n<p>You write two emails: (1) Just ask if the person can write you a good or strong recommendation letter. Knowledgeable recommendation letter writers will reject your request if they think they cannot write you a good letter. In this case, look for someone else. (2) If your recommender agrees she will ask you to include some information for the letter. Give a list of what you have done with the person. Write it in a style that can be easily wrapped into anecdotes:</p>\n<ul>\n<li>DO: &#8220;You told me in a meeting that with some extra work we could make it for the NeurIPS deadline. In the next two weeks, I develop an improved deep network architecture started writing up the findings. The next week, Jane extended my code for an additional task. We then had enough results to submit our work to NeurIPS&#8221;</li>\n<li>DO not write: &#8220;Jane and I published our research at NeurIPS.&#8221;</li>\n</ul>\n<p>Anecdotes can also come from&nbsp;interactions with PhD students and post-docs:</p>\n<ul>\n<li>&#8220;I worked with Tom on developing the research library that served as the main framework for our research that we published at NeurIPS. I worked one week on the library and Tom told me that the library was well designed and well performing.&#8221;</li>\n</ul>\n<p>Your advisor will then ask the respective PhD student or post-doc for more information to write something like this:</p>\n<ul>\n<li>&#8220;My PhD student Tom — whom I regard as one of my most engineering-savvy students — worked with Jane on a research project where we needed to develop a code-base for language modeling before we could start the research. Tom gave this task to Jane and estimated it to take 3 weeks. Jane completed it within one week. Tom told me that after he inspected Jane&#8217;s code in a code-review, he found that Jane&#8217;s engineering abilities are on-par or even exceed his own — the code was very high quality and lightning fast. Jane&#8217;s engineering skills helped with the rapid development of research ideas. The research project became a walk in the park because of this. Jane published her work at NeurIPS2020&#8230;&#8221;</li>\n</ul>\n<p>(2) If you have three letters which are on or above the &#8220;Good&#8221; level, you should think about making your letters more diverse. I for example used one academic letter, one industry lab letter, and one letter from a lecturer who is aware of my research.</p>\n<h3>Statement of Purpose</h3>\n<p>Start early and ask experienced people for feedback. You should be safe if you follow the formula above. If you want to disclose difficulties that you had along the way to graduate school you will need a lot of time in your SoP and you can expect that the SoP will take by far the most time in all your application materials.</p>\n<p>Try to reuse letters between universities. It takes too much time to &#8220;personalize&#8221; the SoP for universities. The only section that I changed in my SoP from university to university was the section that mentions the potential advisors I would like to work with.</p>\n<h3>Online Application</h3>\n<p>Start early filling out the online applications early. Some forms are terrible and take some time to fill out and it is great if you can get this out of the way as early as possible to focus on recommendation letters, university selection and your statement of purpose. You should have a good reserve of money to do these applications. The entire process might cost up to $1000. If you do not have the money, ask some relatives for some help early on.</p>\n<h2>How to Select Schools for PhD Applications?</h2>\n<h3>Can I get admitted to a top school?</h3>\n<p>Many people reading this probably have the dream to get into a top school like Stanford, MIT, Berkeley, or CMU. But admission is really tough. Some programs are highly selective. Here admission statistics for one top school I was admitted to and the prior probability of getting admitted to the program. Note that I have hard statistics on the schools and publications, but I do not have hard statistics on the letters and personal connections but I make assumptions based on what I have heard and seen from admitted students that I talked to:</p>\n<ul>\n<li>Top 2 undergraduate school AND 1 to 3 publications AND >=1 strong letter AND personal connections: 38%</li>\n<li>Top 4 undergraduate school AND 1 to 3 publications AND >=1 strong letter AND personal connections: 14%</li>\n<li>Top 20 undergraduate school AND 2 to 4 publications AND >=1 strong letter AND personal connections: 21%</li>\n<li>Below top 20 undergraduate school AND best school in a country (Tokyo, Australian National) AND 2 to 4 publications AND 1>= strong letter AND personal connections: 11%</li>\n<li>Master in top 3 school AND 1 to 4 publications AND >=1 strong letter AND personal connections: 5%</li>\n<li>Below top 20 undergraduate school AND not the best school in a country AND >4 publications and >=2 strong letters AND personal connections: 5%</li>\n<li>Below top 20 undergraduate school AND not the best school in a country AND >3 publications and >=2 strong letters AND award for Best Teacher/Young Scientist AND personal connections: 5%</li>\n</ul>\n<p>This program, like most top programs, selects aggressively for undergrad degree. Note that usually, some form of personal connection (a letter writer knows a possible advisor at the school) is a requirement especially for edge cases. Other top programs select differently. For example, while CMU also selects aggressively for undergrad degree, they also like candidates with an unusual background which reflects strong performance under difficult circumstances. Some schools really like awards in math/CS competitions. Many schools like it if you got some form of best teacher award. Some schools like it if you have a portfolio of hacks (MIT). However, in general, in order of importance to get admitted to top schools:</p>\n<ol>\n<li>Personal connections</li>\n<li>Top undergrad school AND publications</li>\n<li>Strong letters AND publications</li>\n<li>Publications</li>\n<li>Anything else</li>\n</ol>\n<p>This means if you doing an undergrad at a top 2 school and you have no publications you will still have a hard time. Top 2 school and a publication increase your chances of admittance dramatically. If you have no personal connections it is difficult to get admitted even with a strong profile. However, if your profile is overly strong under respected advisors then personal connections do not matter.</p>\n<p>There are some other factors for special cases. For example, if you study at a top school and have only 1 publication then GPA will be an important factor. However, in general, top schools do not care about GPA numbers from schools below top 20 if it is at least a GPA of 3.5 or equivalent. So if you have a GPA of 3.5 at a below top 20 school and you have 4 publications you have a good chance of getting admitted.&nbsp; A low GPA (which is still > 3.5) can be a factor in favor if your research profile is very strong as it demonstrates that you do not care about classes but that you are passionate about research — exactly what advisors want to see.</p>\n<p>Another thing to note here is that we have publication inflation. This means the value of a single publication becomes less and less because more and more students fulfill this requirement. The more students are interested in ML PhDs the more stringent the publication requirements. It might have been fine to have no publications to get into an ML PhD, but this is often no longer the case.</p>\n<h3>How to get admitted to top schools?</h3>\n<p>These statistics above do not mean that you cannot get accepted by these schools, but it means that if your profile is too weak you should take another year to bolster it. I, for example, extended my master by a year to squeeze in a year of research internships. Without this, I would never have made it into these schools. If your dream is to get into one of these top schools this is by far the best option. Even if you do not necessarily want to get into top schools, a research internship is highly recommendable.</p>\n<p>A research internship will give you:</p>\n<ul>\n<li>Improved research skills so you can get an easier start into a PhD.</li>\n<li>A test whether a PhD or a certain research direction (NLP vs computer vision vs systems) is right for you.</li>\n<li>A good or even strong recommendation letter (the longer the internship the better).</li>\n<li>A possible publication.</li>\n</ul>\n<p>But even finding a research internship is easier said than done! How can you approach this? My next blog post will deal in detail with the topic of how you can improve your application file for the application cycle in the next year.</p>\n<h3>Realistic School Selection</h3>\n<p>You should apply for about 10-15 universities. If you apply for more, you run in the danger that you will not have enough time to really polish your applications. If you apply for less you run into the danger of not being accepted anywhere.</p>\n<p>You should have one or two backup universities where it is likely that you are accepted (> 75%). Often the university where you already studied at is a good candidate for this since your recommendation letter writers will be known to the university faculty.&nbsp;Apply for all top universities where you have some hope of getting admitted (>10% chance).&nbsp;Fill out the rest of the university slots with universities where you expect to have a good admission rate (25-33%) — you should have a minimum of 3 universities of this kind. These universities are usually the ones where a recommendation letter writer has a personal connection to a faculty with whom you would like to work.</p>\n<p>Note that the best advisors are not necessarily at the top schools. You can get excellent PhD training at many schools outside of the top 20. However, if you thinking about an academic career then the school rank will be really important and you should try to find an advisor at a top school.</p>\n<p>Pick universities mainly according to possible advisors. Make sure each university has more than one advisor you would like to work with. Do not apply to a university where there is a single good advisor. If your list is too small, broaden your area of interest. For example, if you would like to do deep learning and NLP and you cannot find enough fitting advisors consider also some advisors in computer vision or other fields.</p>\n<h1>General Q&A</h1>\n<h3>4 year UK PhD vs 6 year US PhD</h3>\n<p>In the first 1-2 years of a US PhD you will do quite a few classes since the US PhD is designed for bachelor students. On the contrary, the UK PhD is designed for students that have already a (1 year) master degree and will have few classes. Thus you can get started immediately with research in a UK PhD which can be a nice advantage.\\</p>\n<p>US PhD:</p>\n<ul>\n<li>Designed for bachelor students</li>\n<li>Classes for 1-2 years. Classes distract from research.</li>\n<li>Funding guaranteed with admission, that is, you have guaranteed positions as a research assistant or a teaching assistant.</li>\n</ul>\n<p>UK PhD</p>\n<ul>\n<li>Designed for master students</li>\n<li>Classes for 0.25 &#8211; 0.5 years. You can focus on your research from start to finish.</li>\n<li>Funding can be problematic and is often dependent on your advisor. This is why it is important to get in touch with your potential advisor before you apply.</li>\n<li>Less prestigious (in most cases) and thus it will be more difficult to get academic positions after your PhD. It will be more difficult to get oral presentations, best paper awards etc due to visibility bias.</li>\n</ul>\n<p>Also be aware of local effects. If you study in the US you will also be in a US research bubble. Same is true if you study in Europe or Asia. For example, researchers in Europe know the &#8220;famous&#8221; researchers worldwide, but beyond that, they know more European universities than US universities in general (e.g. Stony Brooks vs University of Sheffield). Same is true for other locations. If you want to join academia in Europe, and you cannot get admitted to top US schools, it might make sense to apply for mostly EU universities.</p>\n<h3>Is a master&nbsp;required for a PhD?</h3>\n<p>In continental Europe, bachelor degrees are usually 3 years long and you require a master degree to start a PhD. In the US and UK, bachelors are often 4 years long and you can start a PhD right after your bachelor.</p>\n<h3>Does work experience matter?</h3>\n<p>It can help especially if you work at a prestigious institution (Google, Facebook, McKinsey, Goldman Sachs etc.). Other work experience can help if it is software engineering related, but any research experience (research internship) will be seen as far superior. Just a good job and no research experience will not help you.</p>\n<h3>How to pick advisors?</h3>\n<ul>\n<li>Look at recent publications to get a sense of overlapping interest. Avoid working with academics that did not publish papers recently. There does not need to be an overlap in current research, but you should be interested in the research that the advisor is doing.</li>\n<li>Look at the list of students that graduated and where they are now. If you cannot find a list of students that graduated this is a red flag (or a new faculty). This is a good indicator of the quality of advice and training that you will get.</li>\n<li>Does the advisor has a startup? How many students does the advisor have? The combination of these factors is a good indicator of how much time you can the advisor to have. Dependent on how experienced you are in research you will need an advisor that has more or less time.</li>\n<li>Is there a fallback option in the same department? Sometimes relationships do not work out. Protect yourself by having a second advisor option as a fallback.</li>\n</ul>\n<h3>Should one even do a PhD?</h3>\n<p>If you want to work in academia you will need a PhD.</p>\n<p>In industry, everything is regulated by supply and demand. The supply of AI researchers will rise sharply in the next years. If the AI hype collapses the demand will recede. The situation might be very similar to the situation that data scientists face in 2018: Companies only take over-qualified applicants because there is much more supply than demand. In this situation, a PhD will make a big difference if you want to switch jobs or want to be promoted. You might get hired without a PhD now, but without a PhD but you might have problems if you want to switch to another research lab (because the supply of skilled PhDs might be high, while demand is low).</p>\n<p>If the AI hype does not collapse (unlikely) then you can find and switch jobs easily without a PhD. However, note promotion might still be more difficult and you might need to do more &#8220;research engineering work&#8221; compared to research. If you are happy with a research engineer position a PhD might be useless for you.</p>\n<p>Do not do a PhD for the reasons above alone. If you do not want to do research do not do a PhD.</p>\n<h3>Contact advisor before application?</h3>\n<p>This can make sense if one recommendation letter writer can introduce you to a potential advisor. However, this is not required in the US. It can also backfire since it removes a shroud of mystery around you and sometimes it is more impressive to see your publications and recommendation letters first rather than to talk to you in person and seeing the recommendation letters afterward. In the EU it is sometimes required to contact a potential advisor before an application. If you need to do so, also try to get introduced via someone that knows your advisor personally, for example, your bachelor or master thesis advisor. If you do not have a personal connection to your personal advisor you might want to write an email with:</p>\n<ul>\n<li>Your current advisor</li>\n<li>A sentence about your past work (optionally: where did you publish your work?)</li>\n<li>4 bullet points about potential work that you could do with the advisor in the form of &#8220;idea: One sentence that explains the idea&#8221;</li>\n</ul>\n<p>It is very unlikely that your potential advisor will read and even reply you if you do not have a personal contact. If you do not have a personal contact and you apply to EU (UK) universities, then you might want to apply somewhere else.</p>\n<h3>How to pick a topic for your research proposal?</h3>\n<p>The topic for the research proposal does not matter. Nobody will ask you to do the work that you described in your research proposal. You can pick your research proposal topic based on how easy it would be to reuse it across different applications. If you do not need to rewrite it for different applications you save a lot of time. One thing to consider: The more familiar you are with a topic the easier it is to write a good proposal.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://timdettmers.com/2018/11/26/phd-applications/\">Machine Learning PhD Applications — Everything You Need to Know</a> appeared first on <a rel=\"nofollow\" href=\"https://timdettmers.com\">Tim Dettmers</a>.</p>\n",
  "wfw:commentRss": "https://timdettmers.com/2018/11/26/phd-applications/feed/",
  "slash:comments": 154,
  "post-id": 710
}