{
  "guid": "urn:uuid:4476c777-186a-4d3f-b122-0f531eaf7984",
  "link": "https://www.who.int/news/item/18-10-2022-parliamentarians-commit-to-support-global-health",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Parliamentarians commit to support global health",
  "description": "Today, WHO signed a Memorandum of Understanding with UNITE, Parliamentarians Network for Global Health. This represents a new step in strengthening WHO engagement with parliaments.",
  "pubDate": "Tue, 18 Oct 2022 12:44:47 Z",
  "a10:content": "<p>Today at the World Health Summit, in front of an audience including more than 40 parliamentarians from 30 different countries, WHO signed a Memorandum of Understanding with UNITE, Parliamentarians Network for Global Health. </p><p>This represents a new step in strengthening WHO engagement with parliaments. With this agreement, UNITE commits to support WHO in raising awareness and building capacity of parliamentarians in three strategic areas of global public health: <strong>equitable access to health</strong>, with a focus on universal health coverage; <strong>health system strengthening</strong>, with a focus on supporting sustainable financing for global health; and <strong>efficient global health architecture and security</strong>, with a focus on the creation of the global health architecture and security, and the promotion of the pandemic treaty.</p><p>&ldquo;Parliaments play a vital role in promoting and protecting health, by&nbsp;putting in place the legislative, regulatory and budgetary measures that can prevent diseases, and create the conditions for health to thrive,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;WHO is committed to working with parliaments and parliamentary platforms. We welcome the collaboration with UNITE, which will be instrumental in mobilizing parliamentary support, in particular for sustainable financing and strengthening the global health architecture.\"</p><p>Dr Ricardo Baptista Leite, President and Founder of UNITE added: &ldquo;For the last five years, the UNITE Parliamentarians Network for Global Health has been actively promoting evidence-based policy making, in an effort led by our members from more than 85 countries. As current and former members of parliaments, congresses and senates from around the world, we are committed to ensuring that our actions, as politicians and agents for change, lead to a more equitable society in which no one is left behind. UNITE envisions this collaboration as an opportunity to ensure that trustworthy scientific recommendations are delivered to parliamentarians, leading towards new laws and policies that ensure Health is a reality for all. This partnership will empower both UNITE and WHO in achieving our ambitions goals together.&rdquo;&nbsp;</p><p>For more information about UNITE: <a href=\"https://www.unitenetwork.org/\" target=\"_blank\">https://www.unitenetwork.org/</a> </p><p>For more information about WHO parliamentary engagement: Elisa Scolaro, External Relations officer, parliamentary engagement, WHO. <a href=\"mailto:scolaroe@who.int\">scolaroe@who.int</a> &nbsp;</p><p>&nbsp;</p>"
}