{
  "title": "#439: Dumbledip (GOF Illustrated Review, OOTP Chapter 6, 'House of Black')",
  "link": "https://audioboom.com/posts/7401929",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5267,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club member Emily!</li>\n<li>Micah recaps a great weekend in Boston for LeakyCon!</li>\n<li>The <a href=\"https://www.hypable.com/goblet-of-fire-illustrated-edition-release-date/\">Goblet of Fire Illustrated Edition</a> is here! And it's Laura first!</li>\n<li>We discuss some notable illustrations and give our favorites!</li>\n<li>Muggle Mail covers Sirius as a parent, ALL CAPS Harry and Percy Weasley</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix Chapter 6, The Most Noble and Ancient House of Black</li>\n<li>Seven Word Summary: Kreacher has the foresight to take heirlooms</li>\n<li>Molly the Spy: were our parents like this when we were growing up?</li>\n<li>Laura makes an interesting comparison between Molly and Umbridge</li>\n<li>Spring Cleaning at Grimmauld Place: it appears the house is fighting back!</li>\n<li>Why doesn't magic work on doxies? Is Buckbeak getting the shaft?</li>\n<li>Comparing Kreacher to Dobby and Winky</li>\n<li>Can Mad-Eye see a Boggart in its natural state or does he see what he fears most?</li>\n<li>Just what are the Order of the Phoenix taking turns guarding?</li>\n<li>Fred and George are quite the savvy businessmen!</li>\n<li>Kreacher isn't in his \"right mind\" - Hermione couldn't be any closer to the truth!</li>\n<li>Why doesn't Sirius instruct Kreacher not to insult his house guests?</li>\n<li>Everyone's related! We analyze the Black Family tapestry!</li>\n<li>How unfortunate is it that Sirius doesn't realize the important role his brother Regulus played in the downfall on Lord Voldemort?</li>\n<li>If Grimmauld Place has every protection known to Wizard-kind, why does Harry need to return to Privet Drive?</li>\n<li>The blink and you'll miss it locket Horcrux mention</li>\n<li>Dumbledip</li>\n<li>We Connect The Threads, give our MVPs of the Week and Rename the Chapter</li>\n<li>Quizzitch: At what time does Harry wake up for his Ministry hearing?</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits!</li>\n<li>This week's episode is brought to you by <a href=\"http://www.yoursuper.com\">Your Super</a>! Get 15% off your order when you use code MUGGLECAST at checkout!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 21 Oct 2019 15:13:06 +0000",
  "guid": "tag:audioboom.com,2019-10-21:/posts/7401929",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}