{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-6749701939479995997",
  "published": "2020-03-16T13:49:00.001-07:00",
  "updated": "2020-03-16T13:49:48.825-07:00",
  "title": "What Sort of Financial Panic Is This?",
  "content": "Well, as you know, things are changing by the day in financial markets, and central banks are moving quickly to keep up. Most central banks have taken aggressive action recently. After a between-meetings policy rate cut of 50 basis points on March 3, the Fed yesterday reduced its target range for the fed funds rate to 0-0.25%. More to the point, the interest rate on the Fed's overnight reverse repo facility is set at 0%, the interest rate on reserves is 0.10%, and the interest rate on primary credit at the discount window has been reduced to 0.25%. The interest rate target moves, in timing and magnitude, are very aggressive. This was done on a Sunday, before financial markets opened on Monday, and amounted to a 100 basis-point drop in the target range. The discount window rate (the rate at which the Fed lends to Fed member financial institutions) was cut even more, as this rate moved from 50 basis points above the top of the fed funds rate range to the top of the range.<br /><br />There's more. The Fed <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/monetary20200315b.htm\">lists actions</a> that are intended to enhance the functioning of credit markets, though some of these \"actions\" are simply encouragement to banks to use the Fed's credit facilities - the discount window and intraday central bank credit - and to lend in instances where the bank has liquidity and capital in excess of regulatory mandates.<br /><br />One item that stands out is the discontinuation of reserve requirements in the United States. Reserve requirements were dropped long ago in some countries, and currently Canada, the UK, New Zealand, Australia, Sweden, and Hong Kong, are without reserve requirements. In the US, reducing required reserve ratios to zero is essentially a formality. US financial institutions have figured out workarounds, including sweep accounts, that allow them to skirt the effects of reserve requirements, and the Fed's large balance sheet has made reserve requirements non-binding for most banks. The elimination of reserve requirements in the US is long overdue, but why now? Possibly what's going on is that liquidity requirements (the liquidity coverage ratio requirement, for example) exclude required reserves, so eliminating the reserve requirement does in fact relax a constraint on banks, and could encourage them to acquire other assets - loans or asset-backed securities, for example.<br /><br />Closer to (my) home, the Bank of Canada has reduced its policy rate by 100 basis points, to 0.75%, in two steps, and has announced some moves to enhance market liquidity, as <a href=\"https://www.bankofcanada.ca/2020/03/market-notice-2020-03-16/\">outlined here.</a> But I'll focus on the US, where most of the action is.<br /><br />What is the Fed responding to? Most people are aware of the downward slide in the stock market, which continues today. But there are various other signs of distress in financial markets. This has little in common with traditional banking panics, such as what the US banking system encountered in the Great Depression, or prior to the founding of the Fed, between the Civil War and 1914. The primary feature of such panic episodes as the 1907 panic was runs on retail bank deposits, and disruption of retail payments. In principle, such panics could be mitigated, or stopped entirely, through central bank lender-of-last-resort lending, for example through the discount window in the United States. Indeed, a principle function of the Fed, as the authors of the Federal Reserve Act intended, was to lend to banks during financial crises. The Fed could lend to banks, replacing the outflow of deposits, and could finance this lending by issuing more currency, thus giving consumers a safe means of payment to flee to. But what we're seeing now is certainly not a flight from bank deposits to currency.<br /><br />The current panic does have something in common with the financial crisis of 2008, though there are important differences. During the 2008 financial crisis, the origin of the crisis was in the financial sector. Incentive problems in the mortgage market ultimately led to a loss in confidence in the value of a class of asset-backed securities, which fed through to drops in asset prices, a flight to safety in financial markets, and chains of defaults and potential defaults. The current crisis is rooted in the non-financial sector, but some of the same elements are in play. The reduction, or anticipated reduction, in income flows for businesses and individuals, has caused those businesses and individuals to re-evaluate their portfolios, generating a desire to trade in asset markets. But at the same time, everyone is very uncertain about outcomes, and where the risks are. So perceived risk is high, in general, market participants are fleeing to safe assets, and people also want to sell liquid assets to adjust their portfolios in ways they perceive as optimal. What's happening? First, as in the financial crisis, there's been an increase in interest rate spreads. Here's the difference between the 3 month commercial paper rate and the T-bill rate:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-i8oXfyLcT5Q/Xm_X-Dk7ZOI/AAAAAAAAD0Y/CcjAXZRHvTQvqK3yZ-_Brxqr30HAOmLZgCNcBGAsYHQ/s1600/commpaper2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-i8oXfyLcT5Q/Xm_X-Dk7ZOI/AAAAAAAAD0Y/CcjAXZRHvTQvqK3yZ-_Brxqr30HAOmLZgCNcBGAsYHQ/s640/commpaper2.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>You can see that this spread has increased substantially, but it's nowhere near as large as at times during the 2008 financial crisis. Similarly, if we look at a risky corporate bond spread, we get the same story, more or less:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-BHJw0L6CQOA/Xm_YdKI7ehI/AAAAAAAAD0g/2uqJ064mRsc2VHBoiifakZ-EUph4Z_XngCNcBGAsYHQ/s1600/spread.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-BHJw0L6CQOA/Xm_YdKI7ehI/AAAAAAAAD0g/2uqJ064mRsc2VHBoiifakZ-EUph4Z_XngCNcBGAsYHQ/s640/spread.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>Though note that the data in the last 2 charts only runs to late last week, so things could have changed for the worse.<br /><br />As well, markets in US government Treasury securities are not functioning normally. Apparently the bid-ask spread in markets for Treasury securities has widened, and volume has declined, making it more difficult to buy and sell Treasuries. The liquidity of this market is important. There has to be some asset that is easy to buy and sell, at a predictable price, and if government debt is not filling that role, then nothing is.<br /><br />Which brings us to a key part of the Fed's announced intervention plan, which is the resumption of quantitative easing (QE), after a sort-of hiatus of five years or so. Over the next several months, the Fed plans to purchase at least $500 billion in Treasury securities, across maturities, and $200 billion in agency mortgage-backed securities. That's a program about the size of QE2, which ran from 2010-2011, but not as large as QE1 (2009-10) or QE3 (2012-14). This program would amount to a nominal increase of about 18% in the Fed's asset portfolio, or about 3.2% of annual GDP. Not small potatoes, but the Fed has done this on a larger scale before. What's the rationale? The Fed has already expanded its repo program. The Fed is currently lending in excess of $100 billion in the overnight repo market every day, and is also lending substantially in term repo markets. So, if you want to unload some Treasuries and are having trouble doing it, the Fed will lend you the cash. Similarly, the Fed's reverse repo facility is still in place, so if you want to buy Treasuries, but are having a hard time doing it, you can lend the cash to the Fed through the reverse repo facility, say if you're a money market mutual fund, or you can just hold interest-bearing reserves if you have a reserve account.<br /><br />But, possibly there's a role for QE in purchasing on-the-run Treasury securities that financial markets are having a hard time absorbing. In this case, the purchases of Treasuries potentially make life easier for the Treasury. The Fed purchases the Treasury securities, increasing the balance in the Treasury's general account (TGA) with the Fed, and as the Treasury spends the balance, these funds end up in bank reserves. But the Treasury is currently holding a balance (as of last week) of about $380 billion in the TGA account, which is enough to fund Treasury outlays for a typical month. So, the Treasury has a substantial buffer if it has trouble selling its debt, and such difficulties aren't likely to last long.<br /><br />So, why are we into another QE episode? Principally, the FOMC thinks this is an accommodative policy - it's supposed to increase real GDP and inflation. Of course there's no evidence for that - from experience in the US or elsewhere. And QE could actually be harmful, in that it's fundamentally a swap of less useful assets - reserves - for more useful assets - Treasuries and MBS. It's possible that more reserves and less Treasuries and MBS in the market right now would be a good idea. But why commit to this asset purchase program over the next several months? The Fed could at least hold off decisions about continuation of the program until we have more information.<br /><br />Here's what I'm afraid of. The Fed's actions may be appropriate in the moment, but I'm worried about how we get back to some semblance of normal again. The Fed had a set of normalization plans as early as 2011, to undo policies that were put in place during the financial crisis. But the FOMC never followed through on that normalization plan, and ultimately chose to stick with its large balance sheet. Interest rates were never normalized, in the sense of attaining a level that would sustain inflation at 2% indefinitely. Now we're back at the zero lower bound, with plans for a substantial Fed balance sheet increase, no solid science telling us why this is a good idea, and no plans for getting out of this once this virus gets out of town.<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 4
}