{
  "id": "yt:video:_TBwZFifZk8",
  "yt:videoId": "_TBwZFifZk8",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "\"TIMES 25\"  1969 TRAFFIC SAFETY FOUNDATION   DRUNK DRIVING AWARENESS FILM W/ RONALD REAGAN   XD50924",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-10-31T17:00:21+00:00",
  "updated": "2022-10-31T17:00:22+00:00",
  "media:group": {
    "media:title": "\"TIMES 25\"  1969 TRAFFIC SAFETY FOUNDATION   DRUNK DRIVING AWARENESS FILM W/ RONALD REAGAN   XD50924",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis PSA-style film from the late 1970s titled “Times 25” warns of the dangers of alcoholism, how to recognize the problem, and how the issue affects driving and leads to fatal accidents. Produced by KGO-TV in association with The California Traffic Safety Foundation, the film features clips of real-life accidents as well as staged scenes of profiles of people who can be characterized as “alcoholics.” Additionally there was collaboration with the California Highway Patrol, General Motors Corporation, International Driving School, Western Laboratories Inc, and The San Francisco Police Department in the making of the film. Narrated by John Edwards, the film is additionally a series of interviews with doctors, experts, and employees of the California Traffic Safety Foundation and even includes opening and closing segments by former president and then Governor of California, Ronald Reagan. The film was directed by Gordon Waldear and the script was written by both Sharon Tresnon and Gordon Waldear.\n\nScene of a car crash (0:11). Ronald Reagan addresses chronic alcoholism and its link to a rise in fatal car crashes (0:22-2:22). Scene of another car crash (2:24). Interior of morgue with white sheets draped over bodies (2:50). Casket at a funeral in Christian church (3:12). Aerial view of busy city street (3:29). What is perhaps a Lincoln Town Car driving on the road (4:22). Aerial view of pedestrians on busy sidewalk (4:24). Person stirs their drink at a bar (5:01). Royal A. Neilson, from the California Traffic Safety Foundation, discussing statistics (5:18). Lab running blood alcohol studies (6:05). Interview with Dr. Henry Turkel, a coroner from San Francisco (6:38). Scientists in a lab (8:22). Interview with Harold Sullivan, then commissioner of the California Highway Patrol (8:29). Interview with Dr. William Haddon of the Insurance Institute for Highway Safety (9:15). Summary of points discussed thus far using diorama with mini toy cars (10:04). Interview with Dr. Charles Hine of the University of California Medical School to discuss how alcohol affects the body (10:54). Who is the problem drinker? Business man pulls out mug and whiskey from desk drawer (12:49). Housewife takes out a hidden alcohol bottle from the bathroom cabinet (13:06). Man sits in living room smoking and drinking (13:19). Bar counter (13:34). Perspective of a problem drinker from behind the wheel of a car with stitched scenes from the coroner's office (14:14). Highway sign for Los Angeles International Airport (LAX) (15:45). Studies of drunk drivers done at the driving simulator at The University of Los Angeles (UCLA) (15:55). Cinerama-type motion picture screen and real car used to simulate real traffic situations, study supervised by Dr. Slade Hulbert (16:00). Court sentencing for drunk driver (17:20). More of interview with Dr. Charles Hine of the University of California Medical School discussing reasons for excessive drinking (17:38). Interview with Dr. Fred Hudson of Presbyterian Hospital (18:38). More of interview with Dr. Henry Turkel (19:28). More of interview with Harold Sullivan. Interview with Dr. Seymour Pollock, then project director at the University fo Southern California USC (20:36). More of interview with Interview with Dr. William Haddon (21:22). Film returns to Ronald Regan and scene of the original car crash (22:10). Closing credits (24:15). \n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}