{
  "id": "https://bibleinoneyear.org/en/youth/335",
  "title": "Day 335: How to Avoid Spiritual Infections",
  "description": "Psalm 136:23–26, Daniel 7:1,13–14, 1 John 2:12,15-17,21-27.  Yet you have the powerful spiritual ‘antiseptic’ to use against these destructive forces  It is vital that you learn to do so",
  "pubDate": "Wed, 01 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/335/?ignore",
  "itunes:duration": "14:07",
  "guid": "enyouth01122021-335",
  "length": 847.33,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 335: How to Avoid Spiritual Infections",
  "itunes:subtitle": "Psalm 136:23–26, Daniel 7:1,13–14, 1 John 2:12,15-17,21-27.  Yet you have the powerful spiritual ‘antiseptic’ to use against these destructive forces  It is vital that you learn to do so",
  "itunes:summary": "Joseph Lister, the nineteenth-century medic, is known as ‘the father of antiseptic surgery’. Lister was disturbed by the high proportion of patients who died from post-operative infections.\nHe became convinced that infinitesimal microbes, invisible to the naked eye, were causing the infections. He began to develop a number of antiseptic solutions with which to treat the wounds. Sure enough, the proportion of patients dying from infections decreased.\nIn a similar way, there are evil spiritual forces at work in our world today. They cannot be seen, but they wreak havoc in people’s lives, causing them to fall into temptation, moving evil people into positions of national power, manipulating people’s emotions, tearing them apart and destroying them.\nBut just as Lister’s contemporaries dismissed his theory of destructive microbes, many people today are ignorant or dismissive of spiritual realities. Yet you have the powerful spiritual ‘antiseptic’ to use against these destructive forces. It is vital that you learn to do so.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 335
}