{
  "title": "Blogs > Twitter again",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/12/blogs-twitter-again/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/12/blogs-twitter-again/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Wed, 12 Oct 2022 13:11:48 +0000",
  "category": [
    "Causal Inference",
    "Economics",
    "Miscellaneous Statistics",
    "Political Science",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47185",
  "description": "As we&#8217;ve discussed many times, I prefer blogs to twitter because in a blog you can have a focused conversation where you explain your ideas in detail, whereas twitter seems like more of a place for position-taking. An example came &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/12/blogs-twitter-again/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>As we&#8217;ve discussed many times, I <a href=\"https://statmodeling.stat.columbia.edu/2014/11/22/blogs-twitter/\">prefer blogs to twitter</a> because in a blog you can have a focused conversation where you explain your ideas in detail, whereas twitter seems like more of a place for position-taking.</p>\n<p>An example came up recently that demonstrates this point.  Jennifer sent me a blurb for her causal inference conference and I <a href=\"https://statmodeling.stat.columbia.edu/2022/02/16/welcome-to-the-american-causal-inference-conference-2022-data-challenge/\">blogged it</a>.  This was an announcement and not much more; it could&#8217;ve been on twitter without any real loss of information.  A commenter then <a href=\"https://statmodeling.stat.columbia.edu/2022/02/16/welcome-to-the-american-causal-inference-conference-2022-data-challenge/#comment-2045114\">shot back</a>:</p>\n<blockquote><p>Do you see how your policies might possibly negatively impact an outlier such as myself, when you arbitrarily reward contestants for uncovering effects you baked in? How do you know winners just haven’t figured out how you think about manipulating data to find effects? How far removed from my personal, actual, non-ergodic life are your statistical stories, and what policies that impede me unintentionally are you contributing to?</p></blockquote>\n<p>OK, this has more words than your typically twitter post, but if I saw it on twitter I&#8217;d be cool with it: it&#8217;s an expression of strong disagreement.</p>\n<p>It&#8217;s the next step where things get interesting.  When I saw the above comment, my quick reaction is, &#8220;What a crank!&#8221;  And of course I have no duty to respond at all; responding to blog comments is something I can do for fun when I have the time for it:  it can be helpful to explore the limits of what can be communicated.  In a twitter setting I think the appropriate response would be some snappy response.</p>\n<p>But this is a blog, not twitter, so I replied as follows:</p>\n<blockquote><p>That’s a funny way of putting things! I’d say that if you don’t buy the premise of this competition, then you don’t have to play. Kinda like if you aren’t interested in winter sports you don’t need to watch the olympics right now. I guess you might reply that our tax money is (indirectly) funding this competition, but then again our tax money funds the olympics too.</p>\n<p>Getting to the topic at hand: No, I don’t know that the research resulting from this sort of competition will ultimately improve education policy. Or, even if does, it presumably won’t improve everyone’s education, and it could be that students who are similar to you in some ways will be among those who end up with worse outcomes. All I can say is that this sort of question&#8212;variation in treatment effects, looking at effects on individuals, not just on averages&#8212;is a central topic of modern causal inference and has been so for awhile. So, to the extent that you’re interested in evaluating policies in this way, I think this sort of competition is going in the right direction.</p>\n<p>Regarding specifics: I think that after the competition is over, the team that constructed it will publicly release the details of what they did. So at that point in the not-so-distant future, you can take a look, and, if you see problems with it, you can publish your criticisms. That could be useful.</p></blockquote>\n<p>I&#8217;m not saying this response of mine was perfect.  I&#8217;m just saying that the blog format was well suited to a thoughtful response, a deepening of the intellectual exchange and a rhetorical de-escalation, which is kind of the opposite of position-taking on twitter.</p>\n<p><strong>P.S.</strong>  Also relevant is <a href=\"https://robjhyndman.com/hyndsight/forecasting-competitions/\">this post by Rob Hyndman</a>, A brief history of time series forecasting competitions.  I don&#8217;t know anything about the history of causal inference competitions, or the extent to which these were inspired by forecasting competitions.  The same general question arise, of what&#8217;s being averaged over. </p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/12/blogs-twitter-again/feed/",
  "slash:comments": 17
}