{
  "title": "TW & Anti-Racism Resources + Free Coaching Call",
  "itunes:title": "TW & Anti-Racism Resources + Free Coaching Call",
  "pubDate": "Tue, 02 Jun 2020 14:08:27 +0000",
  "guid": "564a2443-2067-4611-8073-1b662fc48040",
  "link": "https://unfuckyourbrain.com/junebonus1",
  "itunes:image": "",
  "description": "<p><span class=\"s1\">What I think the role of thought work is in moments like this and how we can use it to process challenging times and create change in the world.<br /> <br /> I also address how white people can use thought work to get curious about our thoughts and to get honest about our own internalized racism. If you are a white person listening to this, I invite you to stay with me on this episode and to trust what I’m saying today so that it can be a tool for individual liberation and help us contribute to social change.</span></p> <p><span class=\"s1\">Get full show notes and more information here: <a href=\"https://unfuckyourbrain.com/junebonus1\" target=\"_blank\" rel= \"noopener\">https://unfuckyourbrain.com/junebonus1</a></span></p>",
  "content:encoded": "<p>What I think the role of thought work is in moments like this and how we can use it to process challenging times and create change in the world.  I also address how white people can use thought work to get curious about our thoughts and to get honest about our own internalized racism. If you are a white person listening to this, I invite you to stay with me on this episode and to trust what I’m saying today so that it can be a tool for individual liberation and help us contribute to social change.</p> <p>Get full show notes and more information here: <a href=\"https://unfuckyourbrain.com/junebonus1\" target=\"_blank\" rel= \"noopener\">https://unfuckyourbrain.com/junebonus1</a></p>",
  "enclosure": "",
  "itunes:duration": "12:49",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How thought work can enable white people to be curious about our thinking and get honest about our internalized racism.",
  "itunes:episodeType": "bonus",
  "itunes:author": "Kara Loewentheil"
}