{
  "title": "Ep. 42 with designer Barbara Westbrook",
  "description": "The impossibly talented Barbara Westbrook stops by the podcast to talk antiquing, her book Gracious Rooms, her client work, renovating her homes, and her decorating pet peeve. And of course, we answer your decorating questions!\nWHAT YOU'LL HEAR ON THIS EPISODE:\n\nBarbara tells us about some of her earliest memories antiquing with her mom in a shop in her hometown of Lynchberg, VirginiaHow she ended up in Atlanta in the interior design business working for one of our podcast guestsBarbara tells us a story of Suzanne Kasler's bathroom, and we talk about Miles Redd's mirrored bathroomWe talk about Barbara's previous home in a historic neighborhood in AtlantaShe talks about why it's a good idea to live in your home before you renovateBarbara tells us about why she bought her new house and the improvements she's making to itWe talk about collecting items you love and finding a place for them laterWhy she loves designing kitchens and how she'd love to just design kitchens one dayHer best lesson for designing a kitchen or bathroom -- edited the design down to two 'tricks'How she transitioned from a petite home to a larger homeWe talk about picture frames and Barbara's approach to incorporating them into your decor",
  "pubDate": "Tue, 16 Jan 2018 13:53:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Ballard Designs",
  "itunes:image": "",
  "itunes:subtitle": "The impossibly talented Barbara Westbrook stops by the podcast to talk antiquing, her book Gracious Rooms, her client work, renovating her homes, and her decorating pet peeve. And of course, we answer your decorating questions! WHAT YOU'LL HEAR ON...",
  "itunes:summary": "The impossibly talented Barbara Westbrook stops by the podcast to talk antiquing, her book Gracious Rooms, her client work, renovating her homes, and her decorating pet peeve. And of course, we answer your decorating questions!\nWHAT YOU'LL HEAR ON THIS EPISODE:\n\nBarbara tells us about some of her earliest memories antiquing with her mom in a shop in her hometown of Lynchberg, VirginiaHow she ended up in Atlanta in the interior design business working for one of our podcast guestsBarbara tells us a story of Suzanne Kasler's bathroom, and we talk about Miles Redd's mirrored bathroomWe talk about Barbara's previous home in a historic neighborhood in AtlantaShe talks about why it's a good idea to live in your home before you renovateBarbara tells us about why she bought her new house and the improvements she's making to itWe talk about collecting items you love and finding a place for them laterWhy she loves designing kitchens and how she'd love to just design kitchens one dayHer best lesson for designing a kitchen or bathroom -- edited the design down to two 'tricks'How she transitioned from a petite home to a larger homeWe talk about picture frames and Barbara's approach to incorporating them into your decor",
  "content:encoded": "<p>The impossibly talented <a href=\"http://westbrookinteriors.com/\">Barbara Westbroo</a>k stops by the podcast to talk antiquing, her book <a href=\"http://www.rizzoliusa.com/book.php?isbn=9780847845057\"><em>Gracious Rooms</em></a>, her client work, renovating her homes, and her decorating pet peeve. And of course, we answer your decorating questions!</p><p><strong>WHAT YOU'LL HEAR ON THIS EPISODE:</p><p></strong></p><p>Barbara tells us about some of her earliest memories antiquing with her mom in a shop in her hometown of Lynchberg, VirginiaHow she ended up in Atlanta in the interior design business working for one of our podcast guestsBarbara tells us a story of Suzanne Kasler's bathroom, and we talk about <a href=\"https://www.howtodecorate.com/2017/08/house-tour-miles-redds-eclectic-new-york-townhouse/\"><em>Miles Redd's mirrored bathroom</em></a>We talk about Barbara's previous <a href=\"http://gardenandgun.com/slideshow/photos-inside-a-charming-atlanta-bungalow/\">home in a historic neighborhood in Atlanta</a>She talks about why it's a good idea to live in your home before you renovateBarbara tells us about why she bought her new house and the improvements she's making to itWe talk about collecting items you love and finding a place for them laterWhy she loves designing kitchens and how she'd love to just design kitchens one dayHer best lesson for designing a kitchen or bathroom -- edited the design down to two 'tricks'How she transitioned from a petite home to a larger homeWe talk about picture frames and Barbara's approach to incorporating them into your decor</p>",
  "itunes:duration": 3957,
  "itunes:explicit": "no",
  "guid": "ace369575b0192a368136176f7b57b75",
  "enclosure": ""
}