{
  "id": "yt:video:7j-WWL4-1MA",
  "yt:videoId": "7j-WWL4-1MA",
  "yt:channelId": "UCHbMevniQEQnGZ4npjYSfaw",
  "title": "Paris-Plages Turns 20: Fred Kent tells Us Why that's so Important",
  "link": "",
  "author": {
    "name": "Streetfilms",
    "uri": "https://www.youtube.com/channel/UCHbMevniQEQnGZ4npjYSfaw"
  },
  "published": "2022-08-01T18:37:13+00:00",
  "updated": "2022-08-19T15:35:06+00:00",
  "media:group": {
    "media:title": "Paris-Plages Turns 20: Fred Kent tells Us Why that's so Important",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Most folks trying to make people-friendly places around the world don't need an introduction to Fred Kent, but I will try. Fred has been a pioneer for placemaking for fifty years and has been involved with hundreds of projects all around the world. He was mentored by urban planning giants William H. Whyte and Jane Jacobs. He's the founder of Project for Public Spaces. \n\nWhen I recently visited Paris for my first time to look at the amazingly rapid achievement of bike infrastructure installed throughout the city, I knew I would be amazed by the pedestrian areas as well and made sure to spend time documenting that. Then I found myself hanging around Paris-Plages frequently and picking up video & photos even while relaxing.\n\nFred's son Ethan reminded me that it had been 20 years since the first intervention to close the roadway during part of the summer along the Seine and that I should talk to his dad, who has visited Paris fifty times and says it is one of his favorite places. \n\nMany NYC folks involved in more equitable streets movement will remember that for a time Project for Public Spaces, Transportation Alternatives and Open Plans (along with some neighborhood groups) joined forces to push a new vision for the city: The NYC Streets Renaissance project, which in the mid/late-2000s brought in guest experts from around the world: Jan Ghel, Donald Shoup, Enrique Penalosa and more. Back then Paris-Plages was frequently mentioned by dreamers and doers as what is possible for our cities.\n\nIn this very short look, Fred tells us what makes Paris-Plages so special, unique and its importance in the historical realm.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}