{
  "title": "4 years on, some survivors of Laos dam collapse still waiting for promised new homes",
  "description": "Authorities have been slow to deliver on pledges of compensation and houses after 2018 disaster.",
  "link": "https://www.rfa.org/english/news/laos/new-homes-11042022161259.html",
  "guid": "https://www.rfa.org/english/news/laos/new-homes-11042022161259.html",
  "author": "By RFA Lao",
  "media:content": {
    "media:description": "New permanent homes for survivors of flooding from a 2018 saddle dam collapse at the Xe Pian-Xe Namnoy hydropower plant are seen in southern Laos in 2021.",
    "media:credit": "Citizen journalist"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">More than four years after a huge dam collapsed in southern Laos, sweeping away homes and flooding villages, about 100 families are still waiting for the houses and full compensation that authorities promised them. </span></p>\n<p><span style=\"font-weight: 400;\">Instead, they’re living in small, temporary shelters that many describe as inadequate and unstable. They say officials tell them the houses, promised for September, will be ready in December, but they’re not holding their breath.</span></p>\n<p><span style=\"font-weight: 400;\">“The handover of our homes has been postponed,” said one villager who, like other sources, requested anonymity for safety reasons. “It’s now already November, and we’re still waiting for our new homes.”</span></p>\n<p><span style=\"font-weight: 400;\">The July 23, 2018, collapse of the saddle dam at the Xe Pian-Xe Namnoy hydropower plant in Attapeu province killed 71 people and displaced more than 14,400.</span></p>\n<p><span style=\"font-weight: 400;\">Authorities pledged to build new homes for them, pay compensation and provide one to two hectares of arable land so farmers could make a living by growing rice and vegetables. Some 700 houses have been built, and many residents have been resettled, but about 100 families are still waiting, displaced villagers said.</span></p>\n<p><span style=\"font-weight: 400;\">The Lao government, which continues to plan and build hydropower dams at blistering speed despite grappling with crushing debt, has yet to rectify the problem, villagers said.</span></p>\n<p><span style=\"font-weight: 400;\">Based on the latest relief and recovery plan, Lao authorities are scheduled to complete the construction of all new permanent homes this year. The Xe Pian-Xe Namnoy Power Co. is financing the entire project at a cost of 828 billion kip, or roughly U.S.$50 million.</span></p>\n<p><span style=\"font-weight: 400;\">Another villager recalled that authorities said they would finish building all new homes and hand them over to their owners in October, but all residents of Tamayod village and Samong-Tai village are still in limbo.</span></p>\n<p><span style=\"font-weight: 400;\">“The homes have not been completed yet,” he said. “They still live in the metal shelters as usual.</span></p>\n<p><span style=\"font-weight: 400;\">Around the </span><a href=\"https://www.rfa.org/english/news/laos/pnpc-4-07232022091740.html\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">fourth anniversary</span></a><span style=\"font-weight: 400;\"> of the disaster, Laotians affected by the flooding told RFA that while four years have been a sufficient amount of time to rebuild the saddle dam, survivors have been unable to rebuild their lives, given the lack of suitable temporary accommodations and delayed or reduced payments.</span></p>\n<p><span style=\"font-weight: 400;\">In </span><a href=\"https://www.rfa.org/english/news/laos/flooded-farmland-08122022174213.html\" rel=\"noopener\" target=\"_blank\"><span style=\"font-weight: 400;\">August</span></a><span style=\"font-weight: 400;\">, other survivors told RFA that they were still struggling to scratch out a living because much of the farmland that was underwater remained unusable. </span></p>\n<p><span style=\"font-weight: 400;\">Attapeu’s provincial governor told Lao media in early September that since the disaster, officials had completed “the most important work” by improving the living conditions of the survivors.</span></p>\n<p><span style=\"font-weight: 400;\">Work on building the remaining permanent houses is slow due to a lack of manpower, said another Laotian who lost a home during the disaster. </span></p>\n<p><span style=\"font-weight: 400;\">“From my observation, the construction of the permanent homes is too slow and has been delayed because only a few people are working on it,” he said. “I go looking at my [new] home often, and it’s not yet finished.”</span></p>\n<p><span style=\"font-weight: 400;\">“They said that all new homes will be completed in December this year,” the source added.</span></p>\n<p><span style=\"font-weight: 400;\">The villager went on to say that government officials have not paid the sixth and final round of compensation to those affected by the dam collapse.</span></p>\n<p><span style=\"font-weight: 400;\">“They said we’ll get paid sometime in December, but I think our chances of getting it next month are very slim,” he said.</span></p>\n<p><span style=\"font-weight: 400;\">An Attapeu province official acknowledged that the construction of the remaining permanent houses has been delayed.</span></p>\n<p><span style=\"font-weight: 400;\">“We will have to postpone the handover of the homes from October to December [because of] a shortage of workers,” he told RFA Thursday.  “The workers say they’re having trouble getting paid.”</span></p>\n<p><span style=\"font-weight: 400;\">Authorities will pay the final round of compensation to affected villagers in December, he said, adding that officials are working on the matter with the Xe Pian-Xe Namnoy Power Company.</span></p>\n<p><span style=\"font-weight: 400;\">“If the company agrees with the new assessment [of the property losses], then the survivors will get compensated for the last time in the upcoming month,” the official said. “If not, we’ll have to do a new assessment. First of all, we’re speeding up the construction of the homes, then we’ll pay the compensation.”</span></p>\n<p><b><i>Translated by Max Avary for RFA Lao. Written in English by Roseanne Gerin.</i></b></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 16:27:13 -0400"
}