{
  "title": "Scala and Pyspark specialization certification courses started",
  "link": "https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/",
  "comments": "https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/#respond",
  "dc:creator": "saimadhu",
  "pubDate": "Mon, 20 Jun 2016 06:48:41 +0000",
  "category": [
    "Data Science",
    "DATAMINING",
    "Machine Learning",
    "python",
    "Bigdata",
    "Datascience",
    "Machine learning",
    "Scala"
  ],
  "guid": "http://dataaspirant.com/?p=654",
  "description": "&#160; &#160; Data science is a promising field, Where you have to continuously update your skill set by learning the new technique, algorithms, and newly created tools. As the learning journey never ends, we would always seek to find the best resources to start learning these new skill sets. We should be thankful for the great &#8230; <a href=\"https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Scala and Pyspark specialization certification courses&#160;started</span></a>",
  "content:encoded": "<p>&nbsp;</p>\n<figure data-shortcode=\"caption\" id=\"attachment_657\" aria-describedby=\"caption-attachment-657\" style=\"width: 1043px\" class=\"wp-caption aligncenter\"><img loading=\"lazy\" data-attachment-id=\"657\" data-permalink=\"https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/sparkscala_main/#main\" data-orig-file=\"https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png\" data-orig-size=\"695,300\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"sparkScala_main\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png?w=300\" data-large-file=\"https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png?w=695\" class=\"wp-image-657\" src=\"https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png?w=1043&#038;h=450\" alt=\"Scala & Spark Specilization\" width=\"1043\" height=\"450\" srcset=\"https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png 695w, https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png?w=150&h=65 150w, https://dataaspirant.files.wordpress.com/2016/06/sparkscala_main.png?w=300&h=129 300w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" /><figcaption id=\"caption-attachment-657\" class=\"wp-caption-text\">Scala & Spark Specialization</figcaption></figure>\n<p>&nbsp;</p>\n<p>Data science is a promising field, Where you have to continuously update your skill set by learning the new technique, algorithms, and newly created tools. As the learning journey never ends, we would always seek to find the best resources to start learning these new skill sets. We should be thankful for the great MOOC course providers like <a href=\"http://coursera.org\">Coursera</a>, <a href=\"http://edx.org\">Edx</a>, <a href=\"http://udacity.com\">Udacity</a> , where all these MOOC course providers main intention is to provide the high-quality content which explains the core concepts in standardized way  to create the virtual world around the user to feel himself like getting step by step to master in those skills.</p>\n<p>In this particular post, we are going to share you 2 famous data science specialization certification courses offered from Edx  and Coursera.</p>\n<ol>\n<li style=\"text-align:left;\"><strong>Data Science and Engineering with Apache Spark</strong></li>\n<li style=\"text-align:left;\"><strong>Functional Programming in Scala</strong></li>\n</ol>\n<p>These two specializations are a pack of some series of courses, Which start from basics to advanced level. Generally, it would take somewhere around 5 to 6 months  to get complete knowledge out off this specializations course. All the course videos , reference materials stuff are free of cost but if you indented for the specialization certificate it would cost you some decent dollars.</p>\n<h1 style=\"text-align:center;\"><a href=\"https://www.edx.org/xseries/data-science-engineering-apache-spark\">Data Science and Engineering with Apache Spark</a></h1>\n<figure data-shortcode=\"caption\" id=\"attachment_659\" aria-describedby=\"caption-attachment-659\" style=\"width: 378px\" class=\"wp-caption alignnone\"><img data-attachment-id=\"659\" data-permalink=\"https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/spark-series-edx-378x225/#main\" data-orig-file=\"https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg\" data-orig-size=\"378,225\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"spark-series-edx-378&#215;225\" data-image-description=\"\" data-image-caption=\"<p>Image Credit: edx.com</p>\n\" data-medium-file=\"https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg?w=300\" data-large-file=\"https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg?w=378\" class=\"size-full wp-image-659\" src=\"https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg?w=700\" alt=\"Image Credit: edx.com\" srcset=\"https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg 378w, https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg?w=150 150w, https://dataaspirant.files.wordpress.com/2016/06/spark-series-edx-378x225.jpg?w=300 300w\" sizes=\"(max-width: 378px) 100vw, 378px\"   /><figcaption id=\"caption-attachment-659\" class=\"wp-caption-text\">Image Credit: edx.org</figcaption></figure>\n<p style=\"text-align:left;\">The <em>Data Science and Engineering with Spark XSeries</em>, created in partnership with Databricks, will teach students how to perform data science and data engineering at scale using Spark, a cluster computing system well-suited for large-scale machine learning tasks. It will also present an integrated view of data processing by highlighting the various components of data analysis pipelines, including exploratory data analysis, feature extraction, supervised learning, and model evaluation. Students will gain hands-on experience building and debugging Spark applications. Internal details of Spark and distributed machine learning algorithms will be covered, which will provide students with intuition about working with big data and developing code for a distributed environment.</p>\n<p>This XSeries requires a programming background and experience with Python (or the ability to learn it quickly). All exercises will use PySpark (the Python API for Spark), but previous experience with Spark or distributed computing is NOT required. Familiarity with basic machine learning concepts and exposure to algorithms, probability, linear algebra, and calculus are prerequisites for two of the courses in this series.</p>\n<h3 class=\"course-intro-heading\"><a href=\"https://www.edx.org/course/introduction-apache-spark-uc-berkeleyx-cs105x\">1. Introduction to Apache Spark</a></h3>\n<p><strong>About this course:</strong></p>\n<p>Spark is rapidly becoming the compute engine of choice for big data. Spark programs are more concise and often run 10-100 times faster than Hadoop MapReduce jobs. As companies realize this, Spark developers are becoming increasingly valued.</p>\n<p>This statistics and data analysis course will teach you the basics of working with Spark and will provide you with the necessary foundation for diving deeper into Spark. You’ll learn about Spark’s architecture and programming model, including commonly used APIs. After completing this course, you’ll be able to write and debug basic Spark applications. This course will also explain how to use Spark’s web user interface (UI), how to recognize common coding errors, and how to proactively prevent errors. The focus of this course will be Spark Core and Spark SQL.</p>\n<p>This course covers advanced undergraduate-level material. It requires a programming background and experience with Python (or the ability to learn it quickly). All exercises will use PySpark (the Python API for Spark), but previous experience with Spark or distributed computing is NOT required. Students should take <a href=\"http://www.mypythonquiz.com/\" target=\"_blank\">this</a> Python mini-quiz before the course and take <a href=\"http://ai.berkeley.edu/tutorial.html#PythonBasics\" target=\"_blank\">this</a> Python mini-course if they need to learn Python or refresh their Python knowledge.</p>\n<p><strong>What you&#8217;ll learn:</strong></p>\n<ul>\n<li>Basic Spark architecture</li>\n<li>Common operations</li>\n<li>How to avoid coding mistakes</li>\n<li>How to debug your Spark program</li>\n</ul>\n<h3 class=\"course-intro-heading\"><a href=\"https://www.edx.org/course/distributed-machine-learning-apache-uc-berkeleyx-cs120x\">2. Distributed Machine Learning with Apache Spark</a></h3>\n<p><strong>About this course:</strong></p>\n<p>Machine learning aims to extract knowledge from data, relying on fundamental concepts in computer science, statistics, probability, and optimization. Learning algorithms enable a wide range of applications, from everyday tasks such as product recommendations and spam filtering to bleeding edge applications like self-driving cars and personalized medicine. In the age of ‘big data’, with datasets rapidly growing in size and complexity and cloud computing becoming more pervasive, machine learning techniques are fast becoming a core component of large-scale data processing pipelines.</p>\n<p>This statistics and data analysis course introduces the underlying statistical and algorithmic principles required to develop scalable real-world machine learning pipelines. We present an integrated view of data processing by highlighting the various components of these pipelines, including exploratory data analysis, feature extraction, supervised learning, and model evaluation. You will gain hands-on experience applying these principles using Spark, a cluster computing system well-suited for large-scale machine learning tasks, and its packages spark.ml and spark.mllib. You will implement distributed algorithms for fundamental statistical models (linear regression, logistic regression, principal component analysis) while tackling key problems from domains such as online advertising and cognitive neuroscience.</p>\n<p><strong>What you&#8217;ll learn:</strong></p>\n<ul>\n<li>The underlying statistical and algorithmic principles required to develop scalable real-world machine learning pipelines</li>\n<li>Exploratory data analysis, feature extraction, supervised learning, and model evaluation</li>\n<li>Application of these principles using Spark</li>\n<li>How to implement distributed algorithms for fundamental statistical models.</li>\n</ul>\n<h3 class=\"course-intro-heading\"><a href=\"https://www.edx.org/course/big-data-analysis-apache-spark-uc-berkeleyx-cs110x\">3. Big Data Analysis with Apache Spark</a></h3>\n<p><strong>About this course:</strong></p>\n<p>Organizations use their data to support and influence decisions and build data-intensive products and services, such as recommendation, prediction, and diagnostic systems. The collection of skills required by organizations to support these functions has been grouped under the term ‘data science’.</p>\n<p>This statistics and data analysis course will attempt to articulate the expected output of data scientists and then teach students how to use PySpark (part of Spark) to deliver against these expectations. The course assignments include log mining, textual entity recognition, and collaborative filtering exercises that teach students how to manipulate data sets using parallel processing with PySpark.</p>\n<p>This course covers advanced undergraduate-level material. It requires a programming background and experience with Python (or the ability to learn it quickly). All exercises will use PySpark (the Python API for Spark), and previous experience with Spark equivalent to <a href=\"https://www.edx.org/course/introduction-spark-uc-berkeleyx-cs105x\">Introduction to Apache Spark</a>, is required.</p>\n<p><strong>What you&#8217;ll learn:</strong></p>\n<ul>\n<li>How to use Apache Spark to perform data analysis</li>\n<li>How to use parallel programming to explore data sets</li>\n<li>Apply log mining, textual entity recognition and collaborative filtering techniques to real-world data questions.</li>\n</ul>\n<h3 class=\"course-intro-heading\"><a href=\"https://www.edx.org/course/advanced-apache-spark-data-science-data-uc-berkeleyx-cs115x\">4. Advanced Apache Spark for Data Science and Data Engineering</a></h3>\n<p><strong>About this course:</strong></p>\n<p>Gain a deeper understanding of Spark by learning about its APIs, architecture, and common use cases.  This statistics and data analysis course will cover material relevant to both data engineers and data scientists.  You’ll learn how Spark efficiently transfers data across the network via its shuffle, details of memory management, optimizations to reduce the compute costs, and more.  Learners will see several use cases for Spark and will work to solve a variety of real-world problems using public datasets.  After taking this course, you should have a thorough understanding of how Spark works and how you can best utilize its APIs to write efficient, scalable code.  You’ll also learn about a wide variety of Spark’s APIs, including the APIs in Spark Streaming.</p>\n<p><strong>What you&#8217;ll learn:</strong></p>\n<ul>\n<li>Common use cases for Spark</li>\n<li>Details of internals like the shuffle, Spark SQL’s Catalyst Optimizer, and Project Tungsten</li>\n<li>A deep architectural overview</li>\n<li>Spark Streaming</li>\n<li>Spark ML</li>\n</ul>\n<h3 class=\"course-intro-heading\"><a href=\"https://www.edx.org/course/advanced-distributed-machine-learning-uc-berkeleyx-cs125x\">5. Advanced Distributed Machine Learning with Apache Spark</a></h3>\n<p><strong>About this course:</strong></p>\n<p>Building on the core ideas presented in <a href=\"https://www.edx.org/course/distributed-machine-learning-spark-uc-berkeleyx-cs120x\" target=\"_blank\">Distributed Machine Learning with Spark</a>, this course covers advanced topics for training and deploying large-scale learning pipelines. You will study state-of-the-art distributed algorithms for collaborative filtering, ensemble methods (e.g., random forests), clustering and topic modeling, with a focus on model parallelism and the crucial tradeoffs between computation and communication.</p>\n<p>After completing this course, you will have a thorough understanding of the statistical and algorithmic principles required to develop and deploy distributed machine learning pipelines. You will further have the expertise to write efficient and scalable code in Spark, using MLlib and the spark.ml package in particular.</p>\n<p><strong>What you&#8217;ll learn:</strong></p>\n<ul>\n<li>Training and deploying large-scale learning pipelines for various supervised and unsupervised settings</li>\n<li>Model parallelism and tradeoffs between computation and communication in distributed settings</li>\n<li>Collaborative filtering, decision trees, random forests, clustering, topic modeling, hyperparameter tuning</li>\n<li>Application of these principles using Spark, focusing on the spark.ml package.</li>\n</ul>\n<h1 style=\"text-align:center;\"><a href=\"https://www.coursera.org/specializations/scala\">Functional Programming in Scala</a></h1>\n<figure data-shortcode=\"caption\" id=\"attachment_663\" aria-describedby=\"caption-attachment-663\" style=\"width: 987px\" class=\"wp-caption aligncenter\"><img data-attachment-id=\"663\" data-permalink=\"https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/scala-logo/#main\" data-orig-file=\"https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png\" data-orig-size=\"987,293\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"scala-logo\" data-image-description=\"\" data-image-caption=\"<p>Image Credit:coursera.org</p>\n\" data-medium-file=\"https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=300\" data-large-file=\"https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=700\" class=\"size-full wp-image-663\" src=\"https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=700\" alt=\"Image Credit:coursera.org\" srcset=\"https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=700 700w, https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=150 150w, https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=300 300w, https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png?w=768 768w, https://dataaspirant.files.wordpress.com/2016/06/scala-logo.png 987w\" sizes=\"(max-width: 700px) 100vw, 700px\"   /><figcaption id=\"caption-attachment-663\" class=\"wp-caption-text\">Image Credit:coursera.org</figcaption></figure>\n<div class=\"rc-CML with-styles\">\n<p>This Specialization provides a hands-on introduction to functional programming using the widespread programming language, Scala. It begins with the basic building blocks of the functional paradigm, first showing how to use these blocks to solve small problems, before building up to combining these concepts to architect larger functional programs. You&#8217;ll see how the functional paradigm facilitates parallel and distributed programming, and through a series hands-on on examples and programming assignments, you&#8217;ll learn how to analyze data sets small to large; from parallel programming on multicore architectures, to distributed programming on a cluster using Apache Spark. A final capstone project will allow you to apply the skills you learned by building a large data-intensive application using real-world data.</p>\n</div>\n<div></div>\n<h3><a href=\"https://www.coursera.org/learn/progfun1\">1. Functional Programming Principles in Scala</a></h3>\n<p><strong class=\"body-2-text\">About this course:</strong></p>\n<p>Functional programming is becoming increasingly widespread in the industry. This trend is driven by the adoption of Scala as the main programming language for many applications. Scala fuses functional and object-oriented programming in a practical package. It interoperates seamlessly with both Java and Javascript. Scala is the implementation language of many important frameworks, including Apache Spark, Kafka, and Akka. It provides the core infrastructure for sites such as Twitter, Tumblr and also Coursera.</p>\n<p>In this course you will discover the elements of the functional programming style and learn how to apply them usefully in your daily programming tasks. You will also develop a solid foundation for reasoning about functional programs, by touching upon proofs of invariants and the tracing of execution symbolically. The course is hands on; most units introduce short programs that serve as illustrations of important concepts and invite you to play with them, modifying and improving them. The course is complemented by a series programming projects as homework assignments.</p>\n<p><strong>Learning Outcomes:</strong></p>\n<ul>\n<li>understand the principles of functional programming,</li>\n<li>write purely functional programs, using recursion, pattern matching, and higher-order functions,</li>\n<li>combine functional programming with objects and classes,</li>\n<li>design immutable data structures,</li>\n<li>reason about properties of functions,</li>\n<li>understand generic types for functional programs</li>\n</ul>\n<h3><a href=\"https://www.coursera.org/learn/progfun2\">2.Functional Program Design in Scala</a></h3>\n<p><strong class=\"body-2-text\">About this course:</strong></p>\n<p>In this course you will learn how to apply the functional programming style in the design of larger applications. You&#8217;ll get to know important new functional programming concepts, from lazy evaluation to structuring your libraries using monads. We&#8217;ll work on larger and more involved examples, from state space exploration to random testing to discrete circuit simulators. You’ll also learn some best practices on how to write good Scala code in the real world.</p>\n<p>Several parts of this course deal with the question how functional programming interacts with mutable state. We will explore the consequences of combining functions and state. We will also look at purely functional alternatives to mutable state, using infinite data structures or functional reactive programming.</p>\n<p><strong>Learning Outcomes:</strong></p>\n<ul>\n<li>recognize and apply design principles of functional programs,</li>\n<li>design functional libraries and their APIs,</li>\n<li>competently combine functions and state in one program,</li>\n<li>understand reasoning techniques for programs that combine functions and state,</li>\n<li>write simple functional reactive applications.</li>\n</ul>\n<h3 class=\"course-title\"><a href=\"https://www.coursera.org/learn/parprog1\">3. Parallel programming</a></h3>\n<div class=\"course-title\"></div>\n<div class=\"course-title\"><strong>About the Course:</strong></div>\n<div class=\"course-title\">With every smartphone and computer now boasting multiple processors, the use of functional ideas to facilitate parallel programming is becoming increasingly widespread. In this course, you&#8217;ll learn the fundamentals of parallel programming, from task parallelism to data parallelism. In particular, you&#8217;ll see how many familiar ideas from functional programming map perfectly to the data parallel paradigm. We&#8217;ll start the nuts and bolts how to effectively parallelize familiar collections operations, and we&#8217;ll build up to parallel collections, a production-ready data parallel collections library available in the Scala standard library. Throughout, we&#8217;ll apply these concepts through several hands-on examples that analyze real-world data, such as popular algorithms like k-means clustering.</div>\n<div class=\"course-title\"><strong>Learning Outcomes:</strong></div>\n<ul>\n<li class=\"course-title\">reason about task and data parallel programs,</li>\n<li class=\"course-title\">express common algorithms in a functional style and solve them in parallel,</li>\n<li class=\"course-title\">competently microbenchmark parallel code,</li>\n<li class=\"course-title\">write programs that effectively use parallel collections to achieve performance</li>\n<li>References.</li>\n</ul>\n<h3><a href=\"https://www.coursera.org/learn/big-data-analysys\">4. Big Data Analysis with Scala and Spark:</a></h3>\n<p><strong class=\"body-2-text\">About this course:</strong></p>\n<p>Manipulating big data distributed over a cluster using functional concepts is rampant in the industry, and is arguably one of the first widespread industrial uses of functional ideas. This is evidenced by the popularity of MapReduce and Hadoop, and most recently Apache Spark, a fast, in-memory distributed collections framework written in Scala. In this course, we&#8217;ll see how the data parallel paradigm can be extended to the distributed case, using Spark throughout. We&#8217;ll cover Spark&#8217;s programming model in detail, being careful to understand how and when it differs from familiar programming models, like shared-memory parallel collections or sequential Scala collections. Through hands-on examples in Spark and Scala, we&#8217;ll learn when important issues related to the distribution like latency and network communication should be considered and how they can be addressed effectively for improved performance.</p>\n<p><strong>Learning Outcomes:</strong></p>\n<ul>\n<li>read data from persistent storage and load it into Apache Spark,</li>\n<li>manipulate data with Spark and Scala,</li>\n<li>express algorithms for data analysis in a functional style,</li>\n<li>recognize how to avoid shuffles and recomputation in Spark</li>\n</ul>\n<h3><a href=\"https://www.coursera.org/learn/scala-capstone\">5.Functional Programming in Scala Capstone</a></h3>\n<p><strong class=\"body-2-text\">About this course: </strong></p>\n<p>In the final capstone project you will apply the skills you learned by building a large data-intensive application using real-world data.</p>\n<p>&nbsp;</p>\n<h2>Follow us:</h2>\n<p><strong><span style=\"color:#0000ff;\"><a style=\"color:#0000ff;\" title=\"dataaspirant\" href=\"https://www.facebook.com/dataaspirant\">FACEBOOK</a></span>|<span style=\"color:#ff0000;\"> <a style=\"color:#ff0000;\" title=\"dataaspirant.quora.com\" href=\"http://dataaspirant.quora.com/\">QUORA</a></span> |<span style=\"color:#00ccff;\"><a style=\"color:#00ccff;\" title=\"twitter.com/dataaspirant\" href=\"https://twitter.com/dataaspirant\">TWITTER</a></span>| <span style=\"color:#ff9900;\"><a style=\"color:#ff9900;\" title=\"reddit dataaspirant\" href=\"http://www.reddit.com/user/dataaspirant/\">REDDIT</a> </span>| <span style=\"color:#008000;\"><a style=\"color:#008000;\" title=\"flipboard dataaspirant\" href=\"https://flipboard.com/@dataaspirant/\">FLIPBOARD</a></span> |<span style=\"color:#0000ff;\"><a style=\"color:#0000ff;\" title=\"dataaspirant\" href=\"https://www.linkedin.com/company/dataaspirant\">L</a>INKEDIN |</span> <span style=\"color:#00ff00;\"><a style=\"color:#00ff00;\" title=\"medium dataaspirant\" href=\"https://medium.com/@dataaspirant\">MEDIUM<strong><span style=\"color:#00ff00;\">| </span></strong></a><strong><a href=\"https://github.com/saimadhu-polamuri/DataAspirant_codes\"><span style=\"color:#008080;\">GITHUB</span></a></strong></span></strong></p>\n<p>&nbsp;</p>\n<p>I hope you liked today&#8217;s post. If you have any questions then feel free to comment below.  If you want me to write on one specific topic then do tell it to me in the comments below.<br />\n<a title=\"Visit blogadda.com to discover Indian blogs\" href=\"http://www.blogadda.com\"> <img src=\"https://i1.wp.com/www.blogadda.com/images/blogadda.png\" alt=\"Visit blogadda.com to discover Indian blogs\" width=\"80\" height=\"15\" border=\"0\" /></a></p>\n<p><strong>If you want to share your experience or opinions you can say.</strong></p>\n<h5 style=\"text-align:center;\"><span style=\"color:#3366ff;\">Hello to</span> <span style=\"color:#ff6600;\">hello@dataaspirant.com </span></h5>\n<h3 style=\"text-align:center;\"><strong>THANKS FOR READING&#8230;..</strong></h3>\n<h6 style=\"text-align:left;\"><a href=\"http://dataaspirant.com/\">Home</a> | <a href=\"http://dataaspirant.com/about/\">About</a> | <a href=\"http://dataaspirant.com/data-scientists-interviews/\">Data scientists Interviews</a> | <a href=\"http://dataaspirant.com/for-beginners/\">For beginners</a> | <a href=\"http://dataaspirant.com/join-us/\">Join us</a> |  <a href=\"http://dataaspirant.com/monthly-newsletter/\">Monthly newsletter</a></h6>\n",
  "wfw:commentRss": "https://dataaspirant.wordpress.com/2016/06/20/scala-and-pyspark-specialization-certification-courses-started/feed/",
  "slash:comments": 0,
  "media:content": [
    {
      "media:title": "saimadhu7"
    },
    {
      "media:title": "Scala &#038; Spark Specilization"
    },
    {
      "media:title": "Image Credit: edx.com"
    },
    {
      "media:title": "Image Credit:coursera.org"
    },
    {
      "media:title": "Visit blogadda.com to discover Indian blogs"
    }
  ]
}