{
  "title": "TU151: Secure Parenting While Under Stress with Dan Siegel &#038; Tina Payne-Bryson REPLAY",
  "link": "https://therapistuncensored.com/episodes/tu151-secure-parenting-dan-siegel-tina-payne-bryson-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu151-secure-parenting-dan-siegel-tina-payne-bryson-replay",
  "pubDate": "Wed, 04 Aug 2021 00:55:20 +0000",
  "guid": "https://therapistuncensored.com/?p=11804",
  "description": "Learn the cheat code to parenting in a pandemic with Dr. Dan Siegel and Dr. Tina Bryson as they break down the science behind attachment and showing up. This is literally from the father of interpersonal neurobiology and his colleague as they apply the actual science to managing massive uncertainty and unprecedented stress.",
  "enclosure": "",
  "itunes:subtitle": "Learn the literal science of secure relating as parents or partners from the founder of interpersonal neuroscience.",
  "itunes:summary": "Learn the cheat code to parenting in a pandemic with Dr. Dan Siegel and Dr. Tina Payne-Bryson.  We’re all struggling with some uncertainty and fear right now, and as a parent it can often be especially hard to know how to raise a child during the rise of Coronavirus. Join co-host Sue Marriott and expert guests Siegel and Payne-Bryson to unpack their new book The Power of Showing Up. In this episode they use interpersonal neurobiology to break down the science of attachment, and share what it means to show up. Applicable not just to those with children but in all relationships, their four legs of promoting secure attachment can change the way we relate to ourselves, and each other, for the better.<br />\nEven if you heard this one already, listen again it&#039;s full of great timely perspective - learn more at www.therapistuncensored.com/episodes",
  "itunes:author": "Dan Siegel, Tina Payne-Bryson",
  "itunes:image": "",
  "itunes:season": 5,
  "itunes:episode": 151,
  "itunes:title": "Secure Parenting While Under Stress with Dan Siegel & Tina Payne-Bryson REPLAY",
  "itunes:duration": "1:17:34"
}