{
  "title": "All Tricks, No Treats When It Comes to Cyber Scams",
  "link": "https://www.aei.org/technology-and-innovation/all-tricks-no-treats-when-it-comes-to-cyber-scams/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Fri, 28 Oct 2022 10:00:00 +0000",
  "category": [
    "Technology and Innovation",
    "Amazon",
    "consumers",
    "Cybersecurity",
    "Federal Trade Commission (FTC)",
    "Fraud",
    "Smartphones"
  ],
  "guid": "https://www.aei.org/?p=1008663844",
  "description": "<p>The prevalence of phishing and other online scams highlights the importance of implementing frontline cybersecurity measures and the need for consumers to be more cognizant of cyber threats to our digital world.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/all-tricks-no-treats-when-it-comes-to-cyber-scams/\">All Tricks, No Treats When It Comes to Cyber Scams</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Has “Amazon” been trying to send you gift cards via text message lately? Funny, me too!</p>\n\n\n\n<p>This trick is known as &#8220;<a href=\"https://us.norton.com/blog/emerging-threats/smishing\" target=\"_blank\" rel=\"noreferrer noopener\">smishing</a>,&#8221; a form of phishing done via text messaging. It’s also referred to as Short Message Service or SMS phishing. Traditional <a href=\"https://consumer.ftc.gov/articles/how-recognize-and-avoid-phishing-scams\" target=\"_blank\" rel=\"noreferrer noopener\">phishing</a> is when a cybercriminal masquerading as a known trusted entity, usually a well-established shopping site or a well-known consumer website, sends an unsolicited message (usually via email) to a user.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"1169\" height=\"1306\" src=\"https://www.aei.org/wp-content/uploads/2022/10/Scammers-scammers-scammer.jpg?x91208\" alt=\"\" class=\"wp-image-1008663817\"/><figcaption>An example of a &#8220;smishing&#8221; message sent to an AEI staff member.</figcaption></figure>\n\n\n\n<p>If the user clicks the fake link, they are redirected to a phony website. Here, two criminal acts usually happen. The first is deceiving the user to divulge sensitive personal information, such as personally identifiable information (passwords, usernames, etc.), credit card information, or personal finance details. The second occurs in the background when the user opens the link. These fake websites are often programmed to download malicious malware onto the user&#8217;s mobile device or computer.</p>\n\n\n\n<p>It&#8217;s hard to believe that these scams work, but they do. A consumer is more <a href=\"https://www.business2community.com/infographics/text-marketing-vs-email-marketing-one-packs-bigger-punch-infographic-01249186#HlYebylMl1Z5Uwke.97\" target=\"_blank\" rel=\"noreferrer noopener\">apt</a> to open a text message than an email in today’s market. While the trustworthiness of a spontaneous text message has gone down, it’s still an effective way of reaching a target audience for both businesses and scammers. Unfortunately, today’s inundation of text scams shows how easily users are still duped into getting defrauded. One reason is that criminals play on a user&#8217;s emotions by suggesting there is a tight time frame to claim a prize, the user is under investigation by law enforcement, or the user’s banking information has been compromised.</p>\n\n\n\n<p>Purporting to be <a href=\"https://www.infosecurity-magazine.com/news/amazon-customers-receive-smishing/\" target=\"_blank\" rel=\"noreferrer noopener\">Amazon</a> has been one of these con artists’ most prominent backstories for smishing lately. A text scam sends a link to an inauthentic replica of Amazon’s website for the user to claim a fake Amazon gift card. Once the user interacts on the webpage to access the cash value, smishers deploy various malware tools onto their device.</p>\n\n\n\n<p>To deter consumers from participating in fraudulent activity, Amazon, like many others, have been proactive about informing consumers about this potential activity and how these scams work. Many federal authorities and consumer groups track these scams and share information with potential victims and the broader public. The Federal Trade Commission issued a consumer <a href=\"https://consumer.ftc.gov/consumer-alerts/2022/08/dont-click-random-text-its-scam\" target=\"_blank\" rel=\"noreferrer noopener\">alert</a> recently on smishing scams, noting that scammers have been impersonating Costco, Home Depot, and the US Postal System. FedEx, Netflix, and UPS are also being used as <a href=\"https://gizmodo.com/smishing-scams-are-on-the-rise-1848819274\" target=\"_blank\" rel=\"noreferrer noopener\">popular</a> cover stories. And with the Biden administration’s recent student loan debt relief plan, <a href=\"https://www.ic3.gov/Media/Y2022/PSA221018\" target=\"_blank\" rel=\"noreferrer noopener\">scams</a> posing as the entry point to the program with the intent of extracting applicants’ personal financial information are on the rise. The <a href=\"https://www.fbi.gov/how-we-can-help-you/safety-resources/scams-and-safety/common-scams-and-crimes/spoofing-and-phishing\" target=\"_blank\" rel=\"noreferrer noopener\">FBI</a> also warns citizens not to send payments or interact with organizations urging and seeking immediate monetary support.</p>\n\n\n\n<p>Despite the uptick in smishing and other cyber-threats, there are remedies—some easier to implement than others. For starters, using strong passwords and two-factor authentication, actively updating software from known sources, and being cognizant of phishing links are the fundamentals of frontline cybersecurity protection. Every time one of these scammers has success, there are more compromised devices on our networks spreading more malware to more users.</p>\n\n\n\n<p>However, these frontline fundamentals are simply not enough. We need a more holistic cybersecurity approach to better manage the evolution and protection of our great digital economy and its everyday users. Because devices typically conform to “<a href=\"https://www.lifewire.com/plug-and-play-4152995\" target=\"_blank\" rel=\"noreferrer noopener\">plug and play</a>”—a standard in which software and hardware companies design things in a way that the user doesn’t need to reconfigure, adjust, or understand their devices’ inner mechanisms for them to work as intended—it can be easy to forget that you still need to be vigilant and have security front of mind when using your devices.&nbsp;</p>\n\n\n\n<p>As we near the end of <a href=\"https://www.cisa.gov/cybersecurity-awareness-month\" target=\"_blank\" rel=\"noreferrer noopener\">Cybersecurity Awareness Month</a>, this post serves as a reminder to be a conscious consumer and use devices provided by technology companies with a level of personal responsibility. The devices and applications these companies produce allow us to have a robust digital economy that enables society to live with better communication, conduct business quicker, and enjoy life online. As technology, and especially mobile devices, continues to be a powerful economic tool that allows us to engage with each other, stay informed, and organize our lives, we need to educate each other on needing to think about security and protecting our data while we interact in our digital world.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/technology-and-innovation/this-valentines-day-protect-yourself-from-dating-app-scams/\">This Valentine’s Day, Protect Yourself from Dating App Scams</a> | <a href=\"https://www.aei.org/op-eds/mobile-security-risks-are-at-an-all-time-high/\">Mobile Security Risks Are at an All-Time High.</a> | <a href=\"https://www.aei.org/technology-and-innovation/building-a-trusted-future-online-highlights-from-my-conversation-with-adam-golodner/\">Building a \"Trusted Future\" Online: Highlights from My Conversation with Adam Golodner</a> | <a href=\"https://www.aei.org/technology-and-innovation/cybersecurity-in-agriculture-dont-forget-about-mobile/\">Cybersecurity in Agriculture: Don’t Forget About Mobile</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/all-tricks-no-treats-when-it-comes-to-cyber-scams/\">All Tricks, No Treats When It Comes to Cyber Scams</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}