{
  "title": "This Idea Wasn’t All Wet: The Sensing Water-Saving Showerhead Debuts",
  "link": "https://spectrum.ieee.org/water-saving-shower-head",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-mounted-and-running-showerhead-that-says-oasense-and-has-a-blue-light-on-it.jpg?id=31831006&width=1200&height=800&coordinates=0%2C182%2C0%2C183\"/><br/><br/><p>For Evan Schneider, the family dinner table is a good place for invention. “I’m always, ‘Wouldn’t it be cool if this or that,’” he says, “and people would humor me.”</p><p>In 2012, with California in the midst of a severe drought, Schneider, then a mechanical engineering graduate student at <a href=\"https://www.stanford.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Stanford University</a>, once again tossed out a “cool idea.” He imagined a showerhead that would sense when the person showering moved out from under the stream of water. The showerhead would then automatically turn the water off, turning it back on again when the person moved back into range. With such a device, he thought, people could enjoy a long shower without wasting water.</p><p>“But turning the water on and off manually didn’t make sense in our house,” Schneider said. “We had separate knobs for hot and cold, and another one to switch from tub to shower, so you’d have to adjust the water every time you turned it back on. You’d waste more water than you saved. Plus a shower is a blissful time of relaxation. You don’t want to stop the party halfway.”</p><p>Ten years and many starts and stops later, that sensing showerhead is now shipping to customers from <a href=\"https://www.oasense.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Oasense</a>, a company incorporated in 2019.</p><p>“The general idea is really simple,” Schneider says. “A lot of people have said they also thought of this idea. And I’m sure that’s true, but there were a lot of devils in the details.” Oasense’s team has been granted several patents related to their device, the first filed by Schneider in 2016. </p><p>Schneider’s development path started soon after that dinner-table conversation. First, he confirmed that showers were a big part of water usage for a typical household, and that no such device was already on the market. He collected off-the-shelf components, including an infrared sensor scavenged from a high-end automatic faucet, designed a prototype in a CAD system, printed out the plastic parts using a 3D printer, and assembled it. With 4 AA batteries as a power source, the gadget would operate for about a year, thanks to his choice of a latching solenoid valve, one that uses power to switch from open to closed but doesn’t draw any power to hold in one state or another.</p><p>The prototype worked well enough that his parents were willing to throw out their standard showerhead. He assembled dozens of them and distributed them to friends and family—anyone willing to try.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Man seated on box in garage with showerhead casings and parts laid out on the floor in front of him, he holds one showerhead.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"76ba3df7a3727af13c157ff01851326e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"429da\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/man-seated-on-box-in-garage-with-showerhead-casings-and-parts-laid-out-on-the-floor-in-front-of-him-he-holds-one-showerhead.jpg?id=31831165&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Oasense cofounder Ted Li assembles an early version of the company’s sensing showerhead.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Oasense</small></p><p>In 2016, Schneider decided to run a <a href=\"https://www.kickstarter.com/\" target=\"_blank\">Kickstarter</a> campaign to see if the gadget could attract broad interest. The Kickstarter ultimately failed; it drew a decent number of potential buyers, but, says Schneider, “I had set the bar high, because I was busy doing other things, and if I switched to this, I wanted to make sure it would have a good chance of working out. It didn’t meet that bar; it raised about US $34,000 out of its $75,000 goal.”</p><p>So Schneider put his showerhead idea on hold. Instead, he focused on expanding a burgeoning small business that he was also passionate about—3D printing prototypes and various parts for hardware companies.</p><p>But the showerhead wasn’t done with him. In 2017 someone who Schneider had never met edited <a href=\"https://www.facebook.com/VT/videos/646639645508722/\" target=\"_blank\">the video from the Kickstarter pitch</a> and shared it on Facebook. This time, the video got far more attention—millions of views in just weeks.</p><p>Unfortunately, the timing couldn’t have been worse. Schneider was dealing with a flare-up of a chronic illness and his 3D printing business was at a critical growth period. “I had wanted this for years, but it was the worst time for it to happen,” he says.</p><p>“I still believed in the product,” Schneider continued, “but I knew it needed improvements and more attention than I was able to give it. I tried for a couple of weeks to reply to all these people contacting me, thousands of them, but it was too much. I was planning to shelve it.”</p><p>That’s when Chih-Wei Tang, a friend from Stanford’s mechatronics program who had been an early backer of the project on Kickstarter, reached out to Schneider. Tang, who was working as a technical product manager at the <a href=\"https://corporate.ford.com/operations/locations/silicon-valley.html\" rel=\"noopener noreferrer\" target=\"_blank\">Ford Greenfield Labs</a>, convinced Schneider that he could form a team capable of commercializing the product. Tang pulled in his friend Ted Li, who had just left <a href=\"https://www.apple.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Apple</a> after managing display technology for the iPhone and Apple Watch.</p><p>Tang and Li devoted themselves to the project full-time, Schneider helped part-time as needed. The three started by trying to better adapt an off-the-shelf sensor, but ended up designing a sensor suite with custom hardware and algorithms.</p><p>They incorporated as Oasense in December 2019 as cofounders. In late 2020, the company went out for funding, and brought in about $1 million from angel investors, friends, and family. In addition to the founders, Oasense now has four full-time and three part-time employees.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"3 smiling men in suit jackets\" class=\"rm-shortcode\" data-rm-shortcode-id=\"70a9c15e58ef12fe97c7cd6256a3fb15\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"16097\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/3-smiling-men-in-suit-jackets.jpg?id=31831170&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Oasense cofounders [from left] Ted Li, Evan Schneider, and Chih-Wei Tang.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Oasense</small></p><p>The current version of the device includes several sensors (across a wide range of light wavelengths) and software that allows the sensors to self-calibrate, since every shower environment is different in terms of light, reflectivity, size, and design. Calibration happens during warm-up, when the person showering is unlikely to be standing in the stream. A temperature sensor determines when this warm-up period is over and cuts the flow if the user hasn’t moved under the showerhead. The redesign also replaced the AA batteries with a turbine that generates power from the water flow and sends it to a small rechargeable battery sealed inside the device.</p><p>Says Tang, “It does seem like someone would have built this before, but it turns out to be really complicated. For example, one problem that affects the noise in the sensor signals is fog. In a hot shower, after 3 minutes, our original sensor was blinded by fog. When we designed our new sensors, we had to make sure that didn’t happen.</p><p>“And these sensors are power hungry and need to be on for the duration of the shower, whether water is flowing or not, so generator and sensor efficiency had to be maximized.”</p><p>Oasense officially launched its product, <a href=\"https://shop.oasense.com/products/reva-showerhead\" rel=\"noopener noreferrer\" target=\"_blank\">Reva</a>, in August. The company is working to figure out the best way to sell the gadget; it is now just doing <a href=\"https://shop.oasense.com/products/reva-showerhead\" rel=\"noopener noreferrer\" target=\"_blank\">direct sales at $350</a> per self-installable unit.</p><p>“Two trends are coming together,” Tang says. “Sustainability is what everyone has to be about these days, and technology is invading every corner of our homes. Using technology, we designed sustainability into a product that doesn’t compromise quality or the experience, it just addresses the problem.”</p>",
  "pubDate": "Sun, 02 Oct 2022 16:00:00 +0000",
  "guid": "https://spectrum.ieee.org/water-saving-shower-head",
  "category": [
    "Gadgets",
    "Conservation",
    "Water",
    "Consumer electronics",
    "Startups"
  ],
  "dc:creator": "Tekla S. Perry",
  "media:content": ""
}