{
  "id": "https://bibleinoneyear.org/en/youth/238",
  "title": "Day 238: God’s Benefit Package",
  "description": "Psalm 103:1–12, 2 Chronicles 26:16, 2 Corinthians 1:3–11. David reminds himself in the psalm for today *not to forget* ‘*all his benefits*’ (Psalm 103:2)  Many are conscious of the ‘benefits’ they can receive associated with their employment, or from the state",
  "pubDate": "Fri, 26 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/238/",
  "itunes:duration": "14:25",
  "guid": "enyouth26082022-238",
  "length": 865.41,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 238: God’s Benefit Package",
  "itunes:subtitle": "Psalm 103:1–12, 2 Chronicles 26:16, 2 Corinthians 1:3–11. David reminds himself in the psalm for today *not to forget* ‘*all his benefits*’ (Psalm 103:2)  Many are conscious of the ‘benefits’ they can receive associated with their employment, or from the state",
  "itunes:summary": "I rediscovered one of my prayer diaries in which I recorded some of my early experiences of answered prayer.\nOn 26 September 1976, I wrote about a prayer for my mother: ‘Prayed for the Lord to heal her insomnia.’ (I did not tell her I was praying for her.) Exactly three months later, on 26 December 1976, I wrote that my mother ‘says she has slept better in the last few weeks than for four years and it is no longer a problem’.\nOf course, it is not possible to prove Christianity on the basis of answers to prayer, because cynics can always explain them away as coincidence. But as former Archbishop of Canterbury William Temple said, ‘When I pray, coincidences happen; when I don’t, they don’t.’ The cumulative effect of answered prayer is to reinforce our faith in God.\nFor the last thirty years, I have written by the New Testament passage for today some of my prayers for the year ahead. It is amazing to think back and remember the ways in which God has answered so many of these prayers. I find it very easy to forget all the answers to prayer. It is so easy to forget blessings.\nDavid reminds himself in the psalm for today not to forget ‘all his benefits’ (Psalm 103:2). Many are conscious of the ‘benefits’ they can receive associated with their employment, or from the state. But what about the ‘benefits’ that we receive from our loving heavenly Father?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 603
}