{
  "title": "A cryogenic SRAM based arbitrary waveform generator in 14 nm for spin qubit control. (arXiv:2211.02017v1 [quant-ph])",
  "link": "http://arxiv.org/abs/2211.02017",
  "description": "<p>Realization of qubit gate sequences require coherent microwave control pulses\nwith programmable amplitude, duration, spacing and phase. We propose an SRAM\nbased arbitrary waveform generator for cryogenic control of spin qubits. We\ndemonstrate in this work, the cryogenic operation of a fully programmable radio\nfrequency arbitrary waveform generator in 14 nm FinFET technology. The waveform\nsequence from a control processor can be stored in an SRAM memory array, which\ncan be programmed in real time. The waveform pattern is converted to microwave\npulses by a source-series-terminated digital to analog converter. The chip is\noperational at 4 K, capable of generating an arbitrary envelope shape at the\ndesired carrier frequency. Total power consumption of the AWG is 40-140mW at 4\nK, depending upon the baud rate. A wide signal band of 1-17 GHz is measured at\n4 K, while multiple qubit control can be achieved using frequency division\nmultiplexing at an average spurious free dynamic range of 40 dB. This work\npaves the way to optimal qubit control and closed loop feedback control, which\nis necessary to achieve low latency error mitigation\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Prathapan_M/0/1/0/all/0/1\">Mridula Prathapan</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Mueller_P/0/1/0/all/0/1\">Peter Mueller</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Menolfi_C/0/1/0/all/0/1\">Christian Menolfi</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Braendli_M/0/1/0/all/0/1\">Matthias Braendli</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Kossel_M/0/1/0/all/0/1\">Marcel Kossel</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Francese_P/0/1/0/all/0/1\">Pier Andrea Francese</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Heim_D/0/1/0/all/0/1\">David Heim</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Oropallo_M/0/1/0/all/0/1\">Maria Vittoria Oropallo</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Ruffino_A/0/1/0/all/0/1\">Andrea Ruffino</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Zota_C/0/1/0/all/0/1\">Cezar Zota</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Morf_T/0/1/0/all/0/1\">Thomas Morf</a>"
}