{
  "title": "Week(ish) note",
  "link": "https://ianozsvald.com/2020/05/20/weekish-note/",
  "dc:creator": "Ian",
  "pubDate": "Wed, 20 May 2020 17:31:50 +0000",
  "category": "Data science",
  "guid": "https://ianozsvald.com/?p=3847",
  "description": "So &#8211; High Performance Python 2nd ed finally shipped (Amazon, Goodreads) &#8211; yay! In brief we&#8217;ve added notes on how you can be a &#8220;highly performant programmer&#8221;, added some more profiling, added Pandas onto NumPy, improved the Compiling to C chapter with more Numba and a new full section on GPUs (in the first edition [&#8230;]",
  "content:encoded": "<p>So &#8211; High Performance Python 2nd ed finally shipped (<a href=\"https://amzn.to/2zdDak9\">Amazon</a>, <a href=\"https://www.goodreads.com/book/show/49828191-high-performance-python\">Goodreads</a>) &#8211; yay! In brief we&#8217;ve added notes on how you can be a &#8220;highly performant programmer&#8221;, added some more profiling, added Pandas onto NumPy, improved the Compiling to C chapter with more Numba and a new full section on GPUs (in the first edition we said &#8211; GPUs are hard, nobody uses them, avoid them &#8211; oh, how the world moved on there!), updated async, JobLib with multiprocessing, multi-core including Dask, less RAM with Pandas and NumPy and four new &#8220;lessons from the field&#8221; from very experienced colleagues (thanks to Soledad, Linda, Vincent and Valentin). I need to write some more about this.</p>\n<p>I <a href=\"https://twitter.com/ianozsvald/status/1263006150385176581\">posted it to Twitter</a> and got a lot of lovely feedback.</p>\n<p>I&#8217;ve started working on a very interesting project aimed at helping the likes of the Bank of England, the UK Government, the Civil Service and more understand the impact of the pandemic on the UK economy so fixes can be designed. My involvement is just starting, I&#8217;m hoping this will grow in interesting ways.</p>\n<p>I put a simple solution into the Kaggle Covid 19 Week 5 competition and on the <a href=\"https://www.kaggle.com/c/covid19-global-forecasting-week-5/leaderboard\">private leaderboard</a> I&#8217;m hovering around rank 10 of 90ish. My solution takes the 5 day moving average and builds wide percentile confidence bounds &#8211; it is really dumb but it turns out to be really robust too.</p>\n<p>For now I&#8217;ve cancelled my upcoming courses, life with the pandemic continues to be weird so I&#8217;ve decided to simplify things a bit. They&#8217;ll restart in a few months.</p>\n<p>In other news my sourdough baking continues to <a href=\"https://twitter.com/ianozsvald/status/1263154333518004225\">improve</a>, my radishes got pretty big, my lettuce is up, the plums and pears have started to grow and generally the garden is looking awesome. I&#8217;m also working harder at training my Spaniel, we&#8217;ve got a long way to go but having her not try to flush every cat she sees in the street is a huge step forwards.</p>\n<hr>\nIan is a Chief Interim Data Scientist via his <a href=http://morconsulting.com>Mor Consulting</a>. Sign-up for <a href=http://eepurl.com/Z44HT>Data Science tutorials in London</a> and to hear about his <a href=https://ianozsvald.com/data-science-jobs/>data science thoughts and jobs</a>. He lives in London, is walked by his high energy Springer Spaniel and is a consumer of fine coffees."
}