{
  "title": "They Were Trying to Help Run Elections. Then They Got Criminally Investigated.",
  "link": "https://www.propublica.org/article/texas-election-workers-voter-fraud-paxton-midterms",
  "pubDate": "Thu, 03 Nov 2022 06:00:00 -0400",
  "guid": "https://www.propublica.org/article/texas-election-workers-voter-fraud-paxton-midterms",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/cassandra-jaramillo\">Cassandra Jaramillo</a> and <a class=\"name\" href=\"https://www.propublica.org/people/joshua-kaplan\">Joshua Kaplan</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">In the wake of the 2020 presidential election, Republican officials around the country have been giving increasing attention and resources to investigating election crimes. Most have focused on the alleged wrongdoing of voters. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">But Texas Attorney General Ken Paxton is also working a different angle: His office has been criminally investigating the people who help run elections.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">Over the past two years, Paxton’s office opened at least 10 investigations into alleged crimes by election workers, a more extensive effort than previously known, according to records obtained by ProPublica. One of his probes was spurred by a complaint from a county GOP chair, who lost her reelection bid in a landslide. She then refused to certify the results, citing “an active investigation” by the attorney general.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">In at least two of the cases, Paxton’s office unsuccessfully <a href=\"https://www.statesman.com/story/news/columns/2022/02/06/democratic-election-worker-says-texas-ag-tried-throw-me-jail/9308056002/\">tried to indict election workers</a>, attempts that were first reported by the Austin American-Statesman. In the remaining eight investigations identified by ProPublica, it is unclear just how far the probes went. As of mid-October, none of the cases resulted in criminal charges.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">The attorney general’s office did not respond to repeated requests for comment. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">Most of Paxton’s investigations of election workers center on allegations of obstructing a poll watcher, which is banned by a controversial and recently expanded law that experts fear could open the door for turmoil in the election process. Texas is one of the few states where blocking the view or limiting the movements of poll watchers — partisan volunteers who monitor election sites — can bring criminal penalties. Obstruction is a misdemeanor punishable by up to a year in jail.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Experts worry such investigations could exact a stiff price, chilling participation in the process, slowing down elections and fostering misinformation and distrust in the vote. These probes may be a harbinger of potential chaos in the midterms.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">“To have law enforcement policing around and creating the perception that these elections are not secure is doing enormous damage to democracy,” said Lorraine Minnite, a political scientist at Rutgers University, Camden who has studied voter fraud allegations.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">Paxton, who has been under a <a href=\"https://apnews.com/article/2022-midterm-elections-dallas-houston-ken-paxton-62273089acc4feb70dd64349bc398f5d\">securities fraud indictment</a> for seven years, has touted his eagerness to <a href=\"https://www.texastribune.org/2022/09/28/attorney-general-ken-paxton-voter-fraud/\">pursue election-related crimes</a>. He created a unit dedicated to doing so five years ago, long before so-called <a href=\"https://www.washingtonpost.com/investigations/2022/09/26/arizona-election-integrity-unit/\">election integrity units</a> became a trend in Republican-controlled states. (He’s denied wrongdoing in the ongoing securities fraud case.) </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">Between January 2020 and September 2022, records show, the office opened at least 390 cases looking into potential election crimes. That includes criminal investigations of both voters and election workers. It’s not clear how many cases Paxton’s office attempted to prosecute. But the records show that, like other prosecutors’ efforts around the country, Paxton often comes up empty. His office secured five election-related convictions during that period.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">A <a href=\"https://www.texastribune.org/2020/12/11/texas-lawsuit-supreme-court-election-results/\">skeptic of the legitimacy</a> of President Joe Biden’s election, Paxton has been soliciting tips from the public about the upcoming midterms, during which he will be operating with broad new powers. Last year, the Texas Legislature dramatically expanded the state’s ability to pursue criminal sanctions against election officials. This year’s midterms will be the first general election where law enforcement could use the new criminal statutes to prosecute.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">Paxton will also be sending a “task force” to Harris County, which contains Houston, a Democratic stronghold, to respond to “legal issues” with the election, according to a letter from the Texas secretary of state. Paxton is up for reelection in the midterms, in a race that <a href=\"https://www.texastribune.org/2022/10/03/rochelle-garza-ken-paxton-texas-attorney-general/\">polls indicate could be close</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">America’s voting system depends on the thousands of public employees and volunteers, often retirees, who do the tedious job of managing elections. Officials have long <a href=\"https://www.eac.gov/sites/default/files/document_library/files/EAVSDeepDive_pollworkers_pollingplaces_nov17.pdf\">reported challenges</a> in recruiting enough poll workers to run elections efficiently. Now, prospective poll workers may find themselves wrestling with the possibility of facing criminal charges.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">This growing scrutiny and animosity have taken a toll. Officials have <a href=\"https://www.nytimes.com/2021/07/02/us/politics/2020-election-voting-officials.html\">resigned en masse</a>, as <a href=\"https://www.reuters.com/investigates/special-report/usa-election-nevada-washoe/\">conspiracy theories</a> and <a href=\"https://www.reuters.com/investigates/special-report/usa-election-threats-law-enforcement/\">physical threats</a> have increasingly become a part of the job. Over the last two years, roughly a third of Texas’ election administrators have left their posts, according to the Texas secretary of state.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">Paxton’s election worker investigations span large, heavily Democratic cities and deep-red rural counties alike. Some officials learned they were under scrutiny when they were contacted by sergeants in Paxton’s office. Others told ProPublica they were unaware an investigation had occurred. At least five suspects were in their 60s or 70s. Several cases were prompted by a referral from the Texas secretary of state. Others stemmed from complaints made by small-town sheriffs or voters.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">Sam Taylor, a spokesperson for the secretary of state, said the office is required to refer complaints to the attorney general if there is reasonable cause to believe a crime occurred.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">Dana DeBeauvoir said she has already seen the impact of Paxton’s efforts on the ground — and in her own life. She told ProPublica that in her 36 years as the top election official in Travis County, where Austin is located, nothing compared to the disruption she saw in the 2020 election. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">When an unmasked poll watcher named Jennifer Fleck began photographing the counting of ballots, which was against the rules, a volunteer asked her to leave. Fleck refused, then began screaming and banging on the window of the room where votes were being counted, DeBeauvoir said. Ultimately, the police arrived, arrested Fleck and charged her with criminal trespass. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">Officers allegedly found that Fleck had a “button camera on her shirt” connected to a “recording device that had been secreted in Fleck’s pants,” according to police records. Fleck also faces a perjury charge because she swore in an affidavit that she would not use recording devices. The case is pending.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.19\">Weeks later, DeBeauvoir said, the county attorney informed her that Paxton’s office had a different view of the incident: DeBeauvoir herself was now the subject of a criminal investigation. Attorneys advised her to not speak about the case.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.20\">“I never felt more alone,” DeBeauvoir said. “Everything that was being said was completely untrue. And I could not defend myself.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.21\">The next year, Paxton <a href=\"https://www.statesman.com/story/news/columns/2021/12/20/grumet-travis-elections-chief-says-texas-ag-tried-to-intimidate-me/6493013001/\">attempted to prosecute</a> DeBeauvoir for obstructing a poll watcher, court records show. In an unusual move, when his office brought her case before a grand jury, prosecutors didn’t do it in Travis County — where DeBeauvoir lives and the incident took place — but in a suburban county that is more conservative.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.22\">Yet, in a rarity for the criminal justice system, the grand jury in April 2021 declined to indict her.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.23\">“I was completely terrified” by the investigation, DeBeauvoir said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.24\">Fleck did not immediately respond to requests for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.25\">Among the new powers Paxton will now be able to wield: The Legislature made it a felony for an election official to send a mail-in voting application to a person who didn’t request one. It gave new authority to poll watchers, allowing them “free movement” around voting facilities. And it broadened the obstruction statute Paxton had used to try to prosecute officials like DeBeauvoir.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.26\">“We’ve seen this kind of onslaught of laws that are essentially treating voting booths like crime scenes,” said Liz Avore, senior policy adviser at Voting Rights Lab, a nonprofit that analyzes election legislation. She said Texas’ new poll-watching provisions could hamstring election officials who witness partisan volunteers harassing voters and make it hard to keep polling places “a safe place for voters to cast their ballots.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.27\">Even when investigations don’t result in criminal charges, they can be used as a pretext to disrupt the election process. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.28\">In 2020, Cynthia Brehm was running for reelection as chair of the Bexar County Republican Party. She secured more votes than any other candidate in the March primary, but it was a close race and she’d have to go through a runoff to retain her seat. In June, Brehm made a Facebook post suggesting George Floyd’s death was staged. Sen. Ted Cruz and other top Texas Republicans called for her to resign. Her chances were starting to look bleak.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.29\">Then Brehm made a move that would have surprising consequences. She filed a complaint with Paxton’s office about the election, records show, prompting the attorney general to open a criminal investigation into the county elections administrator. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.30\">A police report details what the official stood accused of. First, that the primary results were incorrect. Second, that there were “several other” allegations “that include obstructing poll watchers.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.31\">In July, Brehm lost in the runoff by 32 points. But as party chair, she held the authority to certify the results. She refused to do so — pointing to the fruits of her complaint.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.32\">“The Texas Attorney General has an active investigation ongoing into the results of the Primary Election,” Brehm wrote in a press release justifying her decision. “I Cynthia Brehm, have determined that every aspect of this election has been severely compromised.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.33\">In response to a public records request, Paxton’s office said the investigation into the elections administrator, Jacquelyn Callanen, is now closed. Brehm and Callanen did not respond to requests for comment. The winning candidate ultimately took over Brehm’s post.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.34\">At least three suspects in Paxton’s investigations were the top election officials in their counties, but his probes have also ensnared volunteers. In 2020, Robert Icsezen, a Houston-based attorney and self-described “election nerd,” volunteered to serve on his county’s signature verification committee, which is responsible for checking the signatures on mail-in ballots. On Oct. 14, a poll watcher asked Icsezen to let her into the area where ballots were being processed, he said. He thought that wasn’t permitted and turned her away. Later that morning, he received a call from a local official, who told him the secretary of state’s office said he needed to let the poll watcher in. The woman never returned, Icsezen said. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.35\">Shortly thereafter, an officer in Paxton’s election police unit contacted Icsezen. Assuming it was all a misunderstanding, Icsezen agreed to speak with him, he said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.36\">Eight months later, Paxton’s office brought the case before a grand jury and unsuccessfully tried to indict Icsezen for obstructing a poll watcher, records show.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.37\">“I have four kids,” Icsezen told ProPublica. “There could have been cops coming to my door to cuff me and take me away.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.38\">He will not volunteer to help in another election, he said.</p>\n        \n             \n\n                                    \n        \n                        <p>Do you have information about “election integrity” units that we should know? Reporters Cassandra Jaramillo and Josh Kaplan can be reached via email at <a href=\"mailto:cassandra.jaramillo@propublica.org\">cassandra.jaramillo@propublica.org</a> or <a href=\"mailto:joshua.kaplan@propublica.org\">joshua.kaplan@propublica.org</a>, or via Signal at 469-606-9665 or 734-834-9383.</p>\n\n        \n\n    \n\n\n                                    \n        \n                        <p><a href=\"https://www.propublica.org/people/lynn-dombek\">Lynn Dombek</a> contributed research.</p>\n\n        \n\n    \n                                         ",
  "dc:subject": "Democracy",
  "dc:date": "2022-11-03T06:00:00-04:00",
  "dc:creator": "by Cassandra Jaramillo and Joshua Kaplan"
}