{
  "title": "Investigating the robustness of a learning-based method for quantitative phase retrieval from propagation-based x-ray phase contrast measurements under laboratory conditions. (arXiv:2211.01372v1 [physics.med-ph])",
  "link": "http://arxiv.org/abs/2211.01372",
  "description": "<p>Quantitative phase retrieval (QPR) in propagation-based x-ray phase contrast\nimaging of heterogeneous and structurally complicated objects is challenging\nunder laboratory conditions due to partial spatial coherence and\npolychromaticity. A learning-based method (LBM) provides a non-linear approach\nto this problem while not being constrained by restrictive assumptions about\nobject properties and beam coherence. In this work, a LBM was assessed for its\napplicability under practical scenarios by evaluating its robustness and\ngeneralizability under typical experimental variations. Towards this end, an\nend-to-end LBM was employed for QPR under laboratory conditions and its\nrobustness was investigated across various system and object conditions. The\nrobustness of the method was tested via varying propagation distances and its\ngeneralizability with respect to object structure and experimental data was\nalso tested. Although the LBM was stable under the studied variations, its\nsuccessful deployment was found to be affected by choices pertaining to data\npre-processing, network training considerations and system modeling. To our\nknowledge, we demonstrated for the first time, the potential applicability of\nan end-to-end learning-based quantitative phase retrieval method, trained on\nsimulated data, to experimental propagation-based x-ray phase contrast\nmeasurements acquired under laboratory conditions. We considered conditions of\npolychromaticity, partial spatial coherence, and high noise levels, typical to\nlaboratory conditions. This work further explored the robustness of this method\nto practical variations in propagation distances and object structure with the\ngoal of assessing its potential for experimental use. Such an exploration of\nany LBM (irrespective of its network architecture) before practical deployment\nprovides an understanding of its potential behavior under experimental\nsettings.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Deshpande_R/0/1/0/all/0/1\">Rucha Deshpande</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Avachat_A/0/1/0/all/0/1\">Ashish Avachat</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Brooks_F/0/1/0/all/0/1\">Frank J. Brooks</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Anastasio_M/0/1/0/all/0/1\">Mark A. Anastasio</a>"
}