{
  "id": "https://bibleinoneyear.org/en/youth/102",
  "title": "Day 102: Your Invitation",
  "description": "Psalm 44:22-26, Deuteronomy 17:14–15, 18:15, Luke 14:15–35. Jesus likens the kingdom of God to a great party with the King, one to which we are all invited  It is an even greater privilege than lunch with the Queen, and it is extraordinary that anyone would refuse this invitation",
  "pubDate": "Tue, 12 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/102/",
  "itunes:duration": "12:13",
  "guid": "enyouth12042022-102",
  "length": 733.31,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 102: Your Invitation",
  "itunes:subtitle": "Psalm 44:22-26, Deuteronomy 17:14–15, 18:15, Luke 14:15–35. Jesus likens the kingdom of God to a great party with the King, one to which we are all invited  It is an even greater privilege than lunch with the Queen, and it is extraordinary that anyone would refuse this invitation",
  "itunes:summary": "One day, I received a message that Queen Elizabeth II, Queen of the United Kingdom and 14 Commonwealth Realms, had invited me to lunch! At first, I thought it was a practical joke. But it wasn’t. I turned up at Buckingham Palace on my bicycle, which an amused policeman looked after for me. I sat next to the Queen as we ate some amazing food. Then she turned and began to talk to me as the ‘Parfait de Rhubarbe et Chocolat Blanc’ arrived.\nIt looked delicious. But I did not want to talk with my mouth full – nor did I want to seem rude by cutting into it while the Queen was speaking to me. Eventually she asked me whether I did not like the food. ‘No, no, no,’ I said, ‘I love it’ (as I quickly began to eat). I did not say it to her, but the real reason I had not eaten was that I was overwhelmed by the privilege of being invited to lunch with the Queen.\nJesus likens the kingdom of God to a great party with the King, one to which we are all invited. It is an even greater privilege than lunch with the Queen, and it is extraordinary that anyone would refuse this invitation.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 467
}