{
  "title": "87: Upstairs Inferno",
  "link": "https://audioboom.com/posts/7279129",
  "itunes:episode": 87,
  "itunes:title": "Upstairs Inferno",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3262,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On June 24, 1973, an arsonist set fire to the Up Stairs Lounge, a New Orleans gay bar. The result was the largest gay mass murder in U.S. history--Thirty-two people were killed and some three bodies were never identified. And despite the staggering historical significance, few people know about the tragedy and the circumstances that have made this one of the most viscous unsolved crimes in US history.<br>\n<br>\n<strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon famand</a> instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW!</strong>Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!<br>\n</a><br>\n\n</div>\n<div>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong></a><strong> </strong>Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <strong>All ticket holders are welcome to join Patrick on a FREE walking tour of the West Village on the morning of the show!</strong> He'll show you all the spots from the gay liberation movement, old New York movies, and even Sex and the City--all within a few blocks! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets to the Pride Show here!<br>\n</a><br>\n\n</div>\n<div>\n<strong>To learn about our sponsors AND GET THOSE PROMO CODES,</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click her</a>\n</div>\n<div> </div>\n",
  "pubDate": "Tue, 04 Jun 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-06-04:/posts/7279129",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}