{
  "title": "Q(uarantine) P(hysics)",
  "description": "<p>All day we’re solving a system of equations\nA three body problem, f(you, me, the cat)</p>\n\n<p>Time has all but ended as we flirt with each other’s event horizons</p>\n\n<p>Dipping, dipping lower into an unstoppable force</p>\n\n<p>Together forever!</p>\n\n<p>Time has no meaning. The limit of love as our time together increases goes to infinity</p>\n\n<p>Power. Force</p>\n\n<p>What pulls us together? What unites us?</p>\n\n<p>I love you with the force of a black hole</p>\n\n<p>It’s all-consuming. The more of you I have the more of you I want. Am I addicted?</p>\n\n<p>Robert Palmer would suggest that we might as well face it</p>\n\n<p>Sometimes we merge, emitting a chirp of gravitational waves that echo across all of spacetime</p>\n\n<p>Our love changes the very fabric of Minkoski Space</p>\n\n<p>Waves of love resonating with all who encounter it ❤️</p>\n\n<p>It moves with the speed of light</p>\n\n<p>When we merge, it’s hot. It’s billions of atomic bombs, releasing several suns of energy and pressure</p>\n\n<p>Infinities and zeroes, the notion of distance shatters as our theory breaks down, there’s no limit to what we can do, there’s no answer to the question, to the equation</p>\n\n<p>No one can ever hope to understand us</p>\n\n<p>It’s ephemeral, a blip on the cosmic timescale, but right now, it’s everything, it’s like all of time all the time every time. I’ve forgotten time. The only time I know, the only time I want, the time I need, is with you</p>\n\n<hr />\n\n<p><img src=\"http://www.napowrimo.net/wp-content/uploads/2020/03/napo2020button1-1.png\" alt=\"NaPoWriMo\" /></p>\n\n<h1 id=\"national-poetry-writing-month\">National Poetry (Writing) Month</h1>\n\n<p>This is a poem in a series of poems during April, 2020, for #NationalPoetryMonth and #NaPoWriMo #NaPoWriMo2020</p>\n\n<p>My <a href=\"/2020/03/31/national-poetry-writing-month.html\">NationalPoetryWritingMonth post</a>.</p>",
  "pubDate": "Wed, 01 Apr 2020 00:00:00 +0000",
  "link": "http://korbonits.github.io/2020/04/01/quarantine-physics.html",
  "guid": "http://korbonits.github.io/2020/04/01/quarantine-physics.html"
}