{
  "title": "513 - What the Inflation Reduction Act Means for Medicare and Drug Pricing",
  "itunes:title": "513 - What the Inflation Reduction Act Means for Medicare and Drug Pricing",
  "pubDate": "Fri, 02 Sep 2022 10:00:00 +0000",
  "guid": "a21a0170-a41a-4e5e-8517-a413fd4afcc4",
  "link": "https://johnshopkinssph.libsyn.com/513-what-the-inflation-reduction-act-means-for-medicare-and-drug-pricing",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">The Inflation Reduction Act contains some major changes for both Medicare and drug pricing with the potential to save Americans billions of dollars in drug costs. Hopkins health policy expert</span> <strong>Jerry Anderson</strong><span style=\"font-weight: 400;\">, who has spent decades working on Medicare issues, talks with</span> <strong>Stephanie Desmon</strong> <span style= \"font-weight: 400;\">about the changes, why they took so long, and what still needs to be worked out. Also - we want to hear from you! PublicHealth.jhu.edu/PublicHealthOnCall/Survey</span></p>",
  "content:encoded": "<p>The Inflation Reduction Act contains some major changes for both Medicare and drug pricing with the potential to save Americans billions of dollars in drug costs. Hopkins health policy expert Jerry Anderson, who has spent decades working on Medicare issues, talks with Stephanie Desmon about the changes, why they took so long, and what still needs to be worked out. Also - we want to hear from you! PublicHealth.jhu.edu/PublicHealthOnCall/Survey</p>",
  "enclosure": "",
  "itunes:duration": "15:44",
  "itunes:explicit": false,
  "itunes:keywords": "America,drugs,medicare,medicine,Dollars,inflation,pricing",
  "itunes:subtitle": "The Inflation Reduction Act contains some major changes for both Medicare and drug pricing with the potential to save Americans billions of dollars in drug costs. Hopkins health policy expert Jerry Anderson, who has spent decades working on Medicare...",
  "itunes:season": 6,
  "itunes:episode": 513,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}