{
  "title": "The Edition: Is it over?",
  "link": "https://audioboom.com/posts/8012456",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2059,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is Boris Johnson done for? </div>\n<div><br>\n</div>\n<div>In this week’s Spectator cover story, our political editor James Forsyth and our deputy political editor Katy Balls write about Boris Johnson’s perilous position in the aftermath of the Partygate scandal. They join the podcast to predict the Prime Minister’s fate. (00:40)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Also this week: Is there a dangerous side to self-improvement?</div>\n<div><br>\n</div>\n<div>The hashtag manifesting has had billions of impressions on social media in the last year. Younger generations love it and Mary Wakefield explores this viral phenomenon in her column this week. She joins the podcast along with Ally Head, the health and sustainability editor for Marie Claire UK who has interviewed a number of manifestation experts. (14:36)</div>\n<div>  </div>\n<div><br>\n</div>\n<div>And finally: how attractive are your feet? </div>\n<div><br>\n</div>\n<div>Kate Andrews, the Spectator’s economics editor, made an unusual discovery at the end of last year. Pictures of her in flip flops had made it onto a particular website, Wikifeet – ‘the internet’s largest collaborative celebrity feet website’. Kate wrote about her surprising discovery in this week’s magazine, and she joins the podcast along with Theresa Bedford, a personal finance and investing expert who has written about the best ways to sell pictures of your feet online. (28:59)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator<em> </em>today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk:</div>\n<div><a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk </a></div>\n",
  "pubDate": "Thu, 13 Jan 2022 16:48:06 +0000",
  "guid": "tag:audioboom.com,2022-01-13:/posts/8012456",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}