{
  "title": "Performance of different correction maps in the extended phase-space method for spinning compact binaries. (arXiv:2211.01880v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01880",
  "description": "<p>Since the first detection of gravitational waves by the LIGO/VIRGO team, the\nrelated research field has attracted more attention. The spinning compact\nbinaries system, as one of the gravitational-wave sources for broadband laser\ninterferometers, has been widely studied by related researchers. In order to\nanalyze the gravitational wave signals using matched filtering techniques,\nreliable numerical algorithms are needed. Spinning compact binaries systems in\nPost-Newtonian (PN) celestial mechanics have an inseparable Hamiltonian. The\nextended phase-space algorithm is an effective solution for the problem of this\nsystem. We have developed correction maps for the extended phase-space method\nin our previous work, which significantly improves the accuracy and stability\nof the method with only a momentum scale factor. In this paper, we will add\nmore scale factors to modify the numerical solution in order to minimize the\nerrors in the constants of motion. However, we find that these correction maps\nwill result in a large energy bias in the subterms of the Hamiltonian in\nchaotic orbits, whose potential and kinetic energy, etc. are calculated\ninaccurately. We develop new correction maps to reduce the energy bias of the\nsubterms of the Hamiltonian, which can instead improve the accuracy of the\nnumerical solution and also provides a new idea for the application of the\nmanifold correction in other algorithms.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Luo_J/0/1/0/all/0/1\">Junjie Luo</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Feng_J/0/1/0/all/0/1\">Jie Feng</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Zhang_H/0/1/0/all/0/1\">Hong-Hao Zhang</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Lin_W/0/1/0/all/0/1\">Weipeng Lin</a>"
}