{
  "id": "yt:video:Ia2qfSVxFV8",
  "yt:videoId": "Ia2qfSVxFV8",
  "yt:channelId": "UC510QYlOlKNyhy_zdQxnGYw",
  "title": "The Truth of the Salem Witch Trials",
  "link": "",
  "author": {
    "name": "Simple History",
    "uri": "https://www.youtube.com/channel/UC510QYlOlKNyhy_zdQxnGYw"
  },
  "published": "2022-10-19T18:38:16+00:00",
  "updated": "2022-10-21T21:34:38+00:00",
  "media:group": {
    "media:title": "The Truth of the Salem Witch Trials",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "2nd Channel: https://www.youtube.com/channel/UCPdc6bs3I8s6Y4QE_3g3MZw\nBecome a Simple History member: https://www.youtube.com/simplehistory/join\nSupport us on Patreon: https://www.patreon.com/simplehistory\n\nWhile it’s tempting to deflect all the accusers as having used witchcraft as an excuse to settle grudges, there is no moment in the Salem Witch Trials in which the victims questioned the existence of witchcraft. Take the case of Mary Easty, for instance, who noticeably rocked the confidence of the persecuting magistrates with her nobel defence. Despite being condemned as a witch and to be hanged on September 22nd, 1692, she focused on the paper beams that were holding up the court’s judicial procedures. Have the accusers recount their stories separately and compare them, she had urged. She pleaded for them to check again the accounts of 'some of these confessing witches’, arguing they had lied to save their own lives when pressured to identify more witches. These requests, if they were heard were not listened to, and she was hanged ‘drawing tears from the eyes of almost all present’.\n\nCopyright: DO NOT translate and re-upload our content on Youtube or other social media.\n\nSIMPLE HISTORY MERCHANDISE \n\nGet the Simple History books on Amazon: \n\nhttps://www.amazon.com/Daniel-Turner-%60/e/B00H5TYLAE/\n\nT-Shirts\n\nhttps://teespring.com/stores/simple-history-official-merch\n\nSimple history gives you the facts, simple!\n\nSee the book collection here:\n\nAmazon USA\n\nhttp://www.amazon.com/Daniel-Turner/e/B00H5TYLAE/\n\n\nAmazon UK\nhttp://www.amazon.co.uk/Daniel-Turner/e/B00H5TYLAE/\n\n\nhttps://www.facebook.com/Simple-History-549437675141192/\n\nhttps://twitter.com/SimpleHistoryYT\n\n\nCredit:\nCreated by Daniel Turner (B.A. (Hons) in History, University College London) \nScript: \nNarrator:\n\nChris Kane\nhttps://vocalforge.com/\n\nWriter:\n\nNatasha Martell\n\nBlumber, Jess. “A Brief History of the Salem Witch Trials.” 2007. Smithsonian Magazine.\n\nBoyer, Paul. Nissenbaum, Stephen “Salem Possessed: The Social Origins of Witchcraft.” Harvard University Press: Massachusetts, 1974.\n\nBrooks, Rebecca Beatrice. “Thomas Putnam: Ringleader of the Salem Witch Hunt?” (2013) History of Massachusetts Blog.\n\nCurley, Sarah. Lang, Katherine. Oberly, James. “Tituba of\nSalem: The Racial, Gendered, and Encultured Dimensions of a Confessed\nWitch.” University of Wisconsin.\n\nHale, John. “A Modest Enquiry Into The Nature of Witchcraft.” 1697.\n\nGoss. David. K. Documents of the Salem Witch Trials. Santa Barbara, California: ABC-Clio, 2018.\n\nGoss, David. K. “The Salem Witch Trials: A Reference Guide” Greenwood Press: Connecticut, 2008.\n\nLeBeau, Bryan F. “The Story Of The Salem Witch Trials.” Prentice-Hall Inc: New Jersey.\n\nLevack, Brian P. The Oxford Handbook of Witchcraft in Early Modern Europe and Colonial America. Oxford: Oxford University Press, 2013.\n\nNorton, Mary Beth. “In The Devil's Snare: The Salem Witchcraft Crisis Of 1692.” Alfred A. Knopf: New York, 2002.\n\nSalem Witch Museum “Hale Farm.” Salem Witch Museum.\n\n“Salem Village Witchcraft Trials, Illustrated by a Verbatim report of the Trial of Mrs. Elizabeth Howe.” Sal, Mass: MVB Perley (1911).\n\nUpham, Charles W. “Salem Witchcraft.” Dover Publications: New York, 2000.\n\nWeisman, Richard. “Witchcraft, Magic and Religion in 17th century Massachusetts.” University of Massachusetts Press: Massachusetts, (1984).\n\nYang, Maya. “Last Salem ‘witch’ pardoned 329 years after she was wrongly convicted.” May, 2022. The Guardian.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}