{
  "title": "EPISODE 26 Jack Johnson (Part 1): Bad To The Bone",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 09 Nov 2017 14:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2017/11/9/episode-26-jack-johnson-part-1-bad-to-the-bone",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5a019812c83025f46734e15a",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1510057680326-ZJ6NX2ETW42GSM6VAX0D/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5a01a6ce0d92978241ba431f\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1510057680326-ZJ6NX2ETW42GSM6VAX0D/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\">Back in the day when you could still pay your ticket on the spot in cash, a cop pulled over Jack Johnson for speeding.&nbsp;</p><p class=\"\"><em>“Hey boy</em>—said the cop—<em>This is going to cost you $50!”</em></p><p class=\"\">Johnson handed him $100. The cop tried to protest he didn’t have change, but Johnson waved him off.&nbsp;</p><p class=\"\"><em>“I will be coming back this same way, and I’ll be driving at the same speed, so I’m just paying you in advance.”&nbsp;</em></p><p class=\"\"><em>“His story is one of the great dramas not just of American sports, but of all American history.”<br>—&nbsp;</em>New York Times</p><p class=\"\"><em>&nbsp;“This fellow Johnson is a fair fighter, but he is a black. And for that reason, I will never fight him.” —&nbsp;</em>Heavyweight Champion Jim Jeffries&nbsp;</p><p class=\"\">By 1900, the federal government had long abandoned Reconstruction, and white supremacy was returning to the South with a vengeance. Jim Crow was in full swing. Segregation was the law of the land. And Fifty years before Jackie Robinson challenged segregation in baseball, there was Jack Johnson.&nbsp;</p><p class=\"\">Lynching was a weekly event. Any black man in the South not acting subservient could find himself dangling from a tree. Even African American leaders like Booker T. Washington preached that accepting segregation, keeping one’s head down, and working hard were the best options for black people.</p><p class=\"\">Jack Johnson clearly didn’t get the memo.</p><p class=\"\">At this time when simply looking a white man in the eyes, or talking to a white woman, could get one lynched, Jack Johnson made a living beating the hell out of white men in the ring. Living defiantly as if prejudice didn’t exist—he felt—was the best way to defeat racism.&nbsp;</p><p class=\"\">It would be easy to mistake Jack Johnson’s story simply as a tale of standing up to racism. It’s about that—sure. But it’s also about a lot more. Because as much Jack Johnson stared down white supremacy, he also battled those black people who insisted that he behaved like a hard-working, God-fearing role model. But JJ wasn’t about to trade a cage for another. He wouldn’t be anyone’s puppet. He would have no master telling him how to live—not white ones, but no black ones either. His story is the tale of a man who, in spite of a time and place that would not allow it, was on a defiant quest to be free, and live life on his own terms.&nbsp;</p><p class=\"\">In this episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">How a man who would be among the best fighters in the world grew up as a wimp having his sisters protecting him</p></li><li><p class=\"\">The color line in boxing</p></li><li><p class=\"\">The 1900 Galveston Flood</p></li><li><p class=\"\">Joe Choynski: first KOs Jack Johnson and then teaches him how to fight… in jail</p></li><li><p class=\"\">JJ’s complicated fascination with white women</p></li><li><p class=\"\">The curious story of Saverio Giannone (aka Joe Grim):<em> “I am Joe Grim and I fear no man”</em></p></li><li><p class=\"\">Chasing Tommy Burns around the world</p></li><li><p class=\"\">Jack Johnson’s defiant smile</p></li><li><p class=\"\"><em>“Jim Jeffries must emerge from his alpha alpha farm, and remove that golden smile from Jack Johnson’s face. Jeff, it’s up to you. The White Man must be rescued.”</em> — Jack London</p></li></ul><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get your first three meals free—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">A big thank you for the support to the podcast <em>How It Began: A History of the Modern World</em> by Brad Harris. Brad holds a PhD in history from Stanford University and is the host of a great new podcast focusing the most important scientific, technological and cultural advancements in history. So, please check out his podcast and his website <a href=\"https://howitbegan.com/\">https://howitbegan.com/</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:44:47",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 26,
  "itunes:title": "EPISODE 26 Jack Johnson (Part 1): Bad To The Bone",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 26 Jack Johnson (Part 1): Bad To The Bone"
  }
}