{
  "title": "PayPal and Venmo will soon support Tap to Pay on iPhone",
  "description": "<p>PayPal has <a href=\"https://www.macrumors.com/2022/11/03/paypal-venmo-apple-tap-to-pay-integration/\">revealed</a> in its <a href=\"https://s201.q4cdn.com/231198771/files/doc_financials/2022/q3/PYPL-Q3-22-Earnings-Release.pdf\">latest earnings report</a> (PDF) that merchant users in the US will be able to accept payments using their iPhones in the near future without the need for dongles and card readers. The payment solution will be integrating Apple's Tay to Pay technology \"soon.\" That means businesses and sellers will easily be able to receive payments made via contactless debit or credit cards, as well as via mobile wallets including Apple Pay, through the PayPal or Venmo app. They simply have to make sure that they're using an iPhone XS or a newer model.&nbsp;</p><p>Apple first <a href=\"https://www.engadget.com/apple-tap-to-pay-iphone-business-163522302.html\">announced</a> the Tap to Pay feature on iPhone in February this year. A few months later, staff members at the Apple Park visitor center in Cupertino were seen <a href=\"https://www.engadget.com/apple-is-testing-upcoming-tap-to-pay-merchant-payments-at-its-visitor-center-100004402.html\">testing</a> the the feature. Since it makes payments as easy as bumping phones together, it seemed like it could be a threat to payment companies like Square. However, Square quickly got on board and <a href=\"https://www.engadget.com/square-tap-to-pay-iphone-public-launch-115532796.html\">launched Tap to Pay integration</a> in September after running an early access program.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>In addition to its Tap to Pay news, PayPal has also revealed that it's adding Apple Pay as a payment option to its checkout solution for merchant platforms. And starting next year, customers in the US will be able to add their PayPal and Venmo credit and debit cards to their Apple Wallets. In a statement sent to <a href=\"https://www.bloomberg.com/news/articles/2022-11-03/paypal-apple-reach-truce-and-will-accept-each-other-s-products?sref=10lNAhZ9\"><em>Bloomberg</em></a>, PayPal Chief Executive Officer Dan Schulman said the company is \"very pleased to be working with Apple to enhance [its] offerings for... PayPal and Venmo merchants and consumers.\" It's also worth noting that PayPal briefly touched on making Venmo available <a href=\"https://www.engadget.com/amazon-venmo-payment-option-130142262.html\">as a checkout option</a> for some Amazon users in the US in its earnings report. The company reiterated that the feature will roll out to everyone in the country this coming holiday season.&nbsp;</p>",
  "link": "https://www.engadget.com/paypal-venmo-support-tap-to-pay-iphone-092025702.html?src=rss",
  "source_id": "engadget_479",
  "guid": "01dae51b-dc36-46a6-b30c-f24190337e2f",
  "dc:creator": "Mariella Moon",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 09:20:25 +0000",
  "ingested": 1667552611,
  "modified": "2022-11-04T09:03:34+00:00",
  "category": [
    "Information Technology",
    "Technology & Electronics",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Mariella Moon"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Apple",
      "media:description": "Apple",
      "media:title": "Apple"
    }
  ]
}