{
  "title": "The Edition: How Britain became Europe’s drugs capital",
  "link": "https://audioboom.com/posts/7994148",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2229,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is there any substance to the government’s new drugs agenda?</div>\n<div><br>\n</div>\n<div>In The Spectator this week Fraser Nelson writes the cover story on the government’s new 10 years drugs plan and finds that while on the surface this seems like a new war on drugs, it might actually have some thoughtful and effective policies buried within it. Fraser is joined on the podcast by Christopher Snowden, the head of lifestyle economics at the Institute of Economic Affairs. (00:52)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Also this week: Can Islam save Britain’s churches?</div>\n<div><br>\n</div>\n<div>Britain has for a long time now has been becoming a more and more secular nation. This has meant that many churches that used to have full pews are at risk of turning into luxury flats or another Tesco Express. But in this week’s Spectator, Tanjil Rashid highlights another destiny for these buildings. Conversion into mosques. In the piece, he argues these buildings should continue being a place of faith even if that faith is not Christian. He joins Lara along with Christopher Howse, the author of many a book about religious history and architecture. (13:46)</div>\n<div>  </div>\n<div><br>\n</div>\n<div>And finally: Are we witnessing the twilight of the necktie? </div>\n<div><br>\n</div>\n<div>Lockdowns meant we all got used to working from home, which resulted in a much more casual dress code. It feels very strange to wear a suit around your own house. But Jonathan Miller is worried that this may lead to the end of the necktie, a fashion accessory he believes is an important symbol of traditional masculinity. He joins Lara to expand on that idea along with fashion historian Dr. Kimberly Chrisman-Campbell. (25:47)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator </em>today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk:</div>\n<div><a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk </a></div>\n",
  "pubDate": "Thu, 09 Dec 2021 14:19:38 +0000",
  "guid": "tag:audioboom.com,2021-12-09:/posts/7994148",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}