{
  "title": "Unpaid Volunteers At CyanogenMod Successor LineageOS Maintain Builds For Old Android Devices",
  "link": "https://news.slashdot.org/story/22/11/05/0242233/unpaid-volunteers-at-cyanogenmod-successor-lineageos-maintain-builds-for-old-android-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "Linux magazine explores how to breath fresh life into old Android devices:\nEvery mobile device needs its own Android build because of numerous drivers that are not available in the source code. The need to maintain every version of Android for every mobile device means that many manufacturers eventually stop supporting updates. Often, smartphones or tablets that still work perfectly can no longer be used without worry because the manufacturer has simply ceased to offer bug fixes and security updates.... \n\nThe LineageOS project, the successor to the CyanogenMod project, which was discontinued in 2016, proves that it is not impossible to keep these devices up-to-date. Unpaid volunteers at LineageOS do the work that many manufacturers do not want to do: They combine current Android releases with the required device-specific drivers. \n\nThe LineageOS project (Figure 1) provides Android systems with a fresh patch status every month for around 300 devices. The builds are released weekly, unless there is a problem during the build. The Devices page on the LineageOS Wiki provides the details of whether a LineageOS build is available for your smartphone or tablet.... \n\nI recommend the LineageOS project as the first port of call for anyone who wants to protect an older smartphone or tablet that is no longer maintained and doesn't receive Google security patches. The LineageOS derivatives LineageOS for MicroG and /e/OS make it even easier to enjoy a Google-free smartphone without too many restrictions. \nThe article also describes how to use TWRP to flash a manufacturer-independent recovery system (while also creating a restoreable backup of the existing system) as an alternative to LineageOS's own recovery tools. \n\nAnd it even explains how to unlock the bootloader &mdash; although there may be other locks set up separately by the manufacturer. \"Some manufacturers require you to register the device to unlock it, and then &mdash; after telling you that the warranty is now void &mdash; they hand over a code. Others refuse to unlock the device altogether.\" \n\nThanks to Slashdot reader DevNull127 for submitting the article.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Unpaid+Volunteers+At+CyanogenMod+Successor+LineageOS+Maintain+Builds+For+Old+Android+Devices%3A+https%3A%2F%2Fbit.ly%2F3fwhmpf\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F22%2F11%2F05%2F0242233%2Funpaid-volunteers-at-cyanogenmod-successor-lineageos-maintain-builds-for-old-android-devices%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/22/11/05/0242233/unpaid-volunteers-at-cyanogenmod-successor-lineageos-maintain-builds-for-old-android-devices?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22334755&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "EditorDavid",
  "dc:date": "2022-11-05T16:34:00+00:00",
  "dc:subject": "android",
  "slash:department": "back-builds-better",
  "slash:section": "news",
  "slash:comments": 14,
  "slash:hit_parade": "14,13,13,9,2,0,0"
}