{
  "id": "https://bibleinoneyear.org/en/youth/294",
  "title": "Day 294: Living Content",
  "description": "Psalm 119:73–74, Jeremiah 46:28, 1 Timothy 6:3–19. 17) find ‘a firm foundation’ and ‘take hold of the life that is truly life’ (v 19)",
  "pubDate": "Fri, 21 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/294/",
  "itunes:duration": "13:52",
  "guid": "enyouth21102022-294",
  "length": 832.68,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 294: Living Content",
  "itunes:subtitle": "Psalm 119:73–74, Jeremiah 46:28, 1 Timothy 6:3–19. 17) find ‘a firm foundation’ and ‘take hold of the life that is truly life’ (v 19)",
  "itunes:summary": "Her hands were full of rings, bracelets, necklaces, chains and other treasures. Torrents of lava were erupting and pouring down from Mount Vesuvius in AD 79. As she fled, this woman was not prepared to leave behind her valuable jewels. Encumbered by her treasures, she was overwhelmed by the rain of ashes from the volcano and was buried under it.\nDuring the course of modern building operations, her petrified body was found outside the area of the buried city of Pompeii, an ancient Roman port. Her body was unearthed in a sea of jewels. She lost her life in an attempt to save her treasures.\nJesus warned us that ultimately you have to choose between money and God (Matthew 6:24). In the New Testament, there is no ban on private property or making money, or even enjoying the good things in life. The command to the rich, however, is that they do not ‘put their hope in wealth’ (1 Timothy 6:17). A selfish accumulation of wealth and an unhealthy obsession with material things will never bring contentment. What promises security leads to perpetual insecurity.\nUltimately, contentment only comes from putting your hope in God: ‘godliness with contentment is great gain’ (v.6). The promise of God’s word is that those who ‘put their hope in God’ (v.17) find ‘a firm foundation’ and ‘take hold of the life that is truly life’ (v.19).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 659
}