{
  "title": "Robopill Drills Through Mucus to Deliver Drugs",
  "link": "https://spectrum.ieee.org/swallowable-robotic-pills",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.jpg?id=31957157&width=1200&height=600&coordinates=0%2C232%2C0%2C232\"/><br/><br/><p>Mucus plays a key role in protecting the body from harm, preventing potentially dangerous substances from reaching the gastrointestinal system. But it also makes it virtually impossible to give certain medications orally, including insulin. That means people with diabetes must regularly inject insulin, which is unpleasant and can cause people with diabetes to be inconsistent in taking their medication. </p><p>Researchers at MIT wanted to come up with a way around this problem, so they invented a robotic pill, called RoboCap, which can tunnel like a drill through the mucus protecting the GI tract. In a study published in <a href=\"https://www.science.org/doi/10.1126/scirobotics.abp9066\" target=\"_blank\"><em>Science Robotics</em></a>, they tested the invention in pigs, finding that it was effective at getting the pigs’ bodies to absorb medications, including insulin and an IV antibiotic. Though the research is preliminary, it could one day make treatment of many medical conditions easier and more convenient.<br/></p><hr/><p>“The results that we’re seeing are able to be applied to any drug,” said <a href=\"https://www.media.mit.edu/people/shriyas/overview/\" target=\"_blank\">Shriya Srinivasan</a>, a postdoctoral researcher at MIT’s Koch Institute for Integrative Cancer Research and junior fellow at the Society of Fellows at Harvard University. Srinivasan is the lead author of the <em>Science Robotics</em> paper. </p><h2>How RoboCap Works</h2><p>RoboCap has several parts that allow it to get to the right place and to penetrate mucus. The entire pill is coated with a gelatinous substance that responds to pH, allowing easy swallowing and activation only upon reaching the small intestine. Once there, the coating dissolves, closing the pill’s circuit and triggering its mechanical components. On one side of the pill is a weight  attached to an internal motor, which makes the pill start to vibrate and spin as the motor is activated. RoboCap begins drilling through the mucus that lines the small intestine, eventually depositing its drug load, which is on the other side of the pill.</p><p>To effectively drill through the mucus, the pill uses surface features like spiral turbine fins, inspired by torpedo fins, and helical grooves. It’s also coated with small studs to help “brush” mucus aside, similar to how a toothbrush works. Srinivasan said she was also inspired by online videos of tunnel-boring machines called moles, which push through rock and dirt to drill narrow channels. </p><p>The researchers tested their invention with two different drugs: insulin and vancomycin, an IV antibiotic. They tested the method on a resected portion of a pig’s small intestine.  This allowed them to measure how much of the drug they injected above the mucous layer got through to the other side. They also tested RoboCap on live pigs, in both instances comparing the RoboCap to sham, or control pills, which didn’t have a drilling mechanism.</p><p>“When we look at it, it’s anywhere between a 20-to-40-fold increase in the amount of drug that actually is reaching the bloodstream, when you compare [the control] to RoboCap,” said Srinivasan. </p><h2>Potential Applications</h2><p>After making its drug delivery, RoboCap moves through the digestive system and out of the body on its own. The researchers found no evidence that the pill caused any damage to the pigs’ GI system, and frequent mucus production meant that the drilling action had no lasting impact on infection risk or the body’s ability to protect itself. </p><p>Both the study and the technology have limitations, said Srinivasan. It’s unclear how to dispose of RoboCap once it’s out of the body. The study also did not examine medication dosing, or how the drug would be loaded into the pill. The study also only compared the release of drugs administered orally; it did not compare, for instance, how much insulin gets into the bloodstream when delivered with RoboCap versus insulin injection, as it normally would be. The invention is also a long way from being used in people; it would have to undergo extensive development so that it could be mass-produced and would need to go through the clinical trial process. </p><p>Using mechanical methods like this has many advantages over approaches that use chemical methods to accomplish oral drug delivery for the drugs where that ingestion path is indicated. But just because the approach could be used with a variety of drugs doesn’t mean it would necessarily be practical. </p><p>“I think some of the political and societal pressures right now on insulin pricing maybe make it such that this particular mode of delivery would always kind of make it too expensive,” said <a href=\"https://engineering.nd.edu/faculty/matthew-webber/\" rel=\"noopener noreferrer\" target=\"_blank\">Matthew Webber</a>, a professor of chemical and biomolecular engineering department at the University of Notre Dame. </p><p>Webber does see the approach being potentially useful for other drugs, such as antibody therapies for cancer, which usually have to be given through an IV in the hospital. Regardless of the drug’s possibilities for oral drug delivery, Webber says the idea is an innovative one.</p><p>“The science on it is supercool,” he said. “I think there’s a lot of…really intricate and detailed engineering that goes into making something like this.” </p>",
  "pubDate": "Tue, 18 Oct 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/swallowable-robotic-pills",
  "category": [
    "Robopill",
    "Biomedical electronics",
    "Biomedical engineering",
    "Mit"
  ],
  "dc:creator": "Rebecca Sohn",
  "media:content": ""
}