{
  "title": "74: 7 Steps to Healthy Brain with Dr. Daniel Amen Part 1",
  "pubDate": "Thu, 11 Oct 2018 13:47:01 +0000",
  "guid": "5feeadaf35f44fc49882e7bb110f5fc6",
  "link": "https://sites.libsyn.com/94610/74-7-steps-to-healthy-brain-with-dr-daniel-amen-part-1",
  "itunes:image": "",
  "description": "<p class=\"p1\">What is the secret to a healthy brain?<br /> <br /> If you’re struggling with focus, mental fatigue, brain fog, memory loss, how would you go about fixing that?<br /> <br /> If that’s been an issue for you, then I’m really excited about this episode because I’m going take you behind the closed door of a private gathering we did for our students.<br /> <br /> We brought in an extraordinary guest, Dr. Daniel Amen, a physician, founder of Amen Clinics and BrainMD, double board-certified psychiatrist and nine-time New York Times bestselling author.<br /> <br /> Get ready to have what he calls, \"the brain envy.\" His book, “Change Your Brain, Change Your Life” has impacted so many people's lives, including mine. <br /> <br /> This episode is a part 1 of 3-part series where he walks you through the Seven Steps to having a healthy brain.<br /> <br /> Take lots of notes and enjoy!<br /> <br /> ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "content:encoded": "<p class=\"p1\">What is the secret to a healthy brain?  If you’re struggling with focus, mental fatigue, brain fog, memory loss, how would you go about fixing that?  If that’s been an issue for you, then I’m really excited about this episode because I’m going take you behind the closed door of a private gathering we did for our students.  We brought in an extraordinary guest, Dr. Daniel Amen, a physician, founder of Amen Clinics and BrainMD, double board-certified psychiatrist and nine-time New York Times bestselling author.  Get ready to have what he calls, \"the brain envy.\" His book, “Change Your Brain, Change Your Life” has impacted so many people's lives, including mine.   This episode is a part 1 of 3-part series where he walks you through the Seven Steps to having a healthy brain.  Take lots of notes and enjoy!  ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "enclosure": "",
  "itunes:duration": "17:31",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What is the secret to a healthy brain?  If you’re struggling with focus, mental fatigue, brain fog, memory loss, how would you go about fixing that?  If that’s been an issue for you, then I’m really excited about this episode because I’m going...",
  "itunes:episodeType": "full"
}