{
  "title": "57: Protect Your Brain From EMFs with Dr. Mercola",
  "pubDate": "Tue, 17 Apr 2018 16:57:08 +0000",
  "guid": "16cf4ca0b561ff9bd6caa80652485164",
  "link": "https://sites.libsyn.com/94610/57-protect-your-brain-from-emfs-with-dr-mercola",
  "itunes:image": "",
  "description": "<p class=\"p1\">“Do EMFs harm your brain?”<br /> <br /> I get a lot of questions about learning, brain health, and etc. in our private fb group, and I came a crossed this question we haven’t addressed yet.<br /> <br /> I know it’s hard to imagine living in a world without your smartphones and computers, but what does living in a sea of electronics do to our brains?<br /> <br /> I was recently at an anti-aging conference where I shared the stage with Dr. Joseph Mercola, who can offer very strong advice in this area so I took the opportunity to ask him some questions about EMFs and the effect it has on the brain.<br /> <br /> In this episode, Dr. Mercola will share tools and strategies you can use to protect yourself and your family from possible harmful effects of EMFs.<br /> <br /> Dr. Mercola is a multiple New York Times Bestselling Author, and his website <a href=\"http://www.Mercola.com\"><span class= \"s1\">www.Mercola.com</span></a> is one of the world’s leading natural health website with millions of monthly visitors.<br /> <br /> This interview is not intended as medical advice. Please do your research and talk to your healthcare practitioner for any questions you may have.<br /> <br /> Do you want to stay up to date with every new episode and get my brand new Kwik brain Accelerator Program? Go to <a href= \"http://www.KwikBrain.com/podcast\"><span class= \"s1\">www.KwikBrain.com/podcast</span></a> to get instant access.</p>",
  "content:encoded": "<p class=\"p1\">“Do EMFs harm your brain?”  I get a lot of questions about learning, brain health, and etc. in our private fb group, and I came a crossed this question we haven’t addressed yet.  I know it’s hard to imagine living in a world without your smartphones and computers, but what does living in a sea of electronics do to our brains?  I was recently at an anti-aging conference where I shared the stage with Dr. Joseph Mercola, who can offer very strong advice in this area so I took the opportunity to ask him some questions about EMFs and the effect it has on the brain.  In this episode, Dr. Mercola will share tools and strategies you can use to protect yourself and your family from possible harmful effects of EMFs.  Dr. Mercola is a multiple New York Times Bestselling Author, and his website <a href=\"http://www.Mercola.com\">www.Mercola.com</a> is one of the world’s leading natural health website with millions of monthly visitors.  This interview is not intended as medical advice. Please do your research and talk to your healthcare practitioner for any questions you may have.  Do you want to stay up to date with every new episode and get my brand new Kwik brain Accelerator Program? Go to <a href= \"http://www.KwikBrain.com/podcast\">www.KwikBrain.com/podcast</a> to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "20:13",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "“Do EMFs harm your brain?”  I get a lot of questions about learning, brain health, and etc. in our private fb group, and I came a crossed this question we haven’t addressed yet.  I know it’s hard to imagine living in a world without your...",
  "itunes:episodeType": "full"
}