{
  "title": "S14 Ep35: How to Fight Hollywood, Aliens, Letter Agencies, & Demons, & Still Come Out Smelling Like a Rose",
  "link": "https://audioboom.com/posts/8098595",
  "itunes:episode": 35,
  "itunes:title": "How to Fight Hollywood, Aliens, Letter Agencies, & Demons, & Still Come Out Smelling Like a Rose",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7486,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Charles Michael Beaver (Mike) is an IT Professional who has worked for just about every letter agency you can imagine.  He is also a hypnotherapist and a former Hollywood stuntman who has survived some horrendous stunts gone wrong.  Oh, did we mention the two demons that mike carries around with him as a result of him smoking marijuana?! That's just some of the highlights of today's BEYOND the DARKNESS!<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nGet a low, fixed rate credit card consolidation loan from Lightstream and pay off those credit card balances. You can get a loan from five thousand to a hundred thousand dollars and you could get your money as soon as the day you apply.  Visit <a href=\"http://lightstream.com/Darkness\">lightstream.com/Darkness</a> and get an additional interest rate discount and more information.",
  "itunes:summary": "Charles Michael Beaver (Mike) is an IT Professional who has worked for just about every letter agency you can imagine.  He is also a hypnotherapist and a former Hollywood stuntman who has survived some horrendous stunts gone wrong.  Oh,...",
  "pubDate": "Sun, 28 Apr 2019 08:00:00 +0000",
  "guid": "d6081b16-0f4e-468d-a3a5-5d737608742b",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}