{
  "title": "Timing is everything | Daniel Pink on the best time for meetings, taking breaks and creative breakthroughs",
  "pubDate": "Tue, 19 Feb 2019 23:54:58 +0000",
  "guid": "b94e6ee836154daa922a5c22d8025853",
  "link": "https://tonyrobbins.libsyn.com/timing-is-everything-daniel-pink-on-the-best-time-for-meetings-taking-breaks-and-creative-breakthroughs",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">When you set a goal, what do you focus on? Odds are, you put most of your energy towards</span> <em><span style=\"font-weight: 400;\">how</span></em> <span style= \"font-weight: 400;\">you will achieve the results you’re after. But what if you shifted that focus from the</span> <em><span style= \"font-weight: 400;\">how</span></em> <span style= \"font-weight: 400;\">to the</span> <em><span style= \"font-weight: 400;\">when</span></em><span style= \"font-weight: 400;\">. What if timing was that important? What if good timing could not only enhance your performance - it could actually give you the edge that you need to achieve your goal?</span></p> <p><span style=\"font-weight: 400;\">Welcome back to the Peak Performer season of the Tony Robbins Podcast. Today, we have a very special guest - New York Times bestselling author and one of the most influential business minds of our time, Daniel Pink.</span></p> <p><span style=\"font-weight: 400;\">Dan is widely regarded as one of the foremost thinkers in behavioral sciences. He’s upended conventional wisdom about what gives people drive and motivation. He’s challenged the value that society places on left brain over right brain skills. And he’s dispelled preconceived notions about what really makes a great salesman.</span></p> <p><span style=\"font-weight: 400;\">His latest work is no exception. In</span> <a href=\"https://www.danpink.com/\"><span style= \"font-weight: 400;\">When: The Scientific Secrets of Perfect Timing</span></a> <span style=\"font-weight: 400;\">- Dan offers profound insight into the importance of timing - and why most businesses, and most employees, really get it wrong.</span></p> <p><span style=\"font-weight: 400;\">Dan and I sit down and discuss the science behind timing - how it impacts your cognitive abilities, your mood, your state. And he reveals the secrets of how good timing can help you become the most efficient, effective version of yourself. And how business owners can leverage the time of day to create an optimal working environment for their employees.</span></p> <p><span style=\"font-weight: 400;\">Consider this episode a wake-up call. So that you can not only gain more clarity on why it’s not just about what you are doing, it’s really about when you are doing it that can make all the difference - letting you become the best version of yourself at work and at home.</span></p> <p><br /> <br /></p>",
  "content:encoded": "<p>When you set a goal, what do you focus on? Odds are, you put most of your energy towards <em>how</em> you will achieve the results you’re after. But what if you shifted that focus from the <em>how</em> to the <em>when</em>. What if timing was that important? What if good timing could not only enhance your performance - it could actually give you the edge that you need to achieve your goal?</p> <p>Welcome back to the Peak Performer season of the Tony Robbins Podcast. Today, we have a very special guest - New York Times bestselling author and one of the most influential business minds of our time, Daniel Pink.</p> <p>Dan is widely regarded as one of the foremost thinkers in behavioral sciences. He’s upended conventional wisdom about what gives people drive and motivation. He’s challenged the value that society places on left brain over right brain skills. And he’s dispelled preconceived notions about what really makes a great salesman.</p> <p>His latest work is no exception. In <a href=\"https://www.danpink.com/\">When: The Scientific Secrets of Perfect Timing</a> - Dan offers profound insight into the importance of timing - and why most businesses, and most employees, really get it wrong.</p> <p>Dan and I sit down and discuss the science behind timing - how it impacts your cognitive abilities, your mood, your state. And he reveals the secrets of how good timing can help you become the most efficient, effective version of yourself. And how business owners can leverage the time of day to create an optimal working environment for their employees.</p> <p>Consider this episode a wake-up call. So that you can not only gain more clarity on why it’s not just about what you are doing, it’s really about when you are doing it that can make all the difference - letting you become the best version of yourself at work and at home.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "41:28",
  "itunes:explicit": false,
  "itunes:keywords": "Daniel,pink,tony,productivity,robbins,timing",
  "itunes:subtitle": "When you set a goal, what do you focus on? Odds are, you put most of your energy towards how you will achieve the results you’re after. But what if you shifted that focus from the how to the when. What if timing was that important? What if good...",
  "itunes:episodeType": "full"
}