{
  "id": "yt:video:mP6u0KqyN1E",
  "yt:videoId": "mP6u0KqyN1E",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "Millions Suffered. Hundreds Died. Greg Abbott Will Probably Get Re-Elected Anyway. | NYT Opinion",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-11-04T14:00:34+00:00",
  "updated": "2022-11-05T07:35:50+00:00",
  "media:group": {
    "media:title": "Millions Suffered. Hundreds Died. Greg Abbott Will Probably Get Re-Elected Anyway. | NYT Opinion",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Should politicians be held accountable for disasters which unfold under their watch? It’s a question for Texans voting for governor next week.\n\nThe incumbent, Greg Abbott, was at the helm during a storm in February 2021 in which the state — sometimes billed as the “energy capital of America” — was paralyzed by power failures. About 4.5 million homes lost electricity and at least 240 people died in freezing temperatures.\n\nWhile the storm blanketed most of the United States, only Texas suffered such widespread blackouts and high death toll.\n\nIn the Opinion video above, we reveal how Mr. Abbott’s decisions before and during the storm allowed an entirely preventable humanitarian catastrophe to unfold. Among the victims was 87-year-old Connie Mae Richey, whose terrible story was brought to light in the documentary “Protecting the Greed.”\n\nWe show how fossil fuel companies made billions in unexpected profits during the storm and how some later rewarded Mr. Abbott with campaign donations.\n\nQuick to blame others, Mr. Abbott somehow dodged full accountability — indeed, polls suggest that he is sailing toward a third term. His likely success next week shows that when Americans vote increasingly along party lines, politicians can fail with impunity.\n&#13;\nSubscribe: http://bit.ly/U8Ys7n&#13;\nMore from The New York Times Video:  http://nytimes.com/video&#13;\n----------&#13;\nWhether it's reporting on conflicts abroad and political divisions at home, or covering the latest style trends and scientific developments, New York Times video journalists provide a revealing and unforgettable view of the world. It's all the news that's fit to watch.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}