{
  "title": "S14 Ep84: Salem, Witches, & Magic",
  "link": "https://audioboom.com/posts/8098546",
  "itunes:episode": 84,
  "itunes:title": "Salem, Witches, & Magic",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4627,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Double double toil and trouble; Fire burn and caldron bubble on BEYOND the DARKNESS Salem, WItches &Magic episode with guest Michelle Belanger!<br>\n<br>\nHot of the success of Haunted Salem Live and deep into the month of October we discuss all things Withes, Warlocks, Magics and Myths with Michelle Belanger. Creepy stories, Real Histories and the real Power of Magic in a fun filled conversation with a living legend in the field. <br>\n<br>\nVisit Michelle's site: <a href=\"https://www.michellebelanger.com/\">https://www.michellebelanger.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "Double double toil and trouble; Fire burn and caldron bubble on BEYOND the DARKNESS Salem, WItches &Magic episode with guest Michelle Belanger!\n\nHot of the success of Haunted Salem Live and deep into the month of October we discuss...",
  "pubDate": "Sun, 13 Oct 2019 08:00:00 +0000",
  "guid": "5a309db9-45a5-40c0-a5bd-df247a152c40",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}