{
  "title": "464 - How Russia’s Invasion of Ukraine Is Causing a Global Food Crisis",
  "itunes:title": "464 - How Russia’s Invasion of Ukraine Is Causing a Global Food Crisis",
  "pubDate": "Wed, 04 May 2022 10:00:00 +0000",
  "guid": "29e0ad84-6218-4f63-8879-87468fa184f7",
  "link": "https://johnshopkinssph.libsyn.com/464-how-russias-invasion-of-ukraine-is-causing-a-global-food-crisis",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Ukraine’s strangled food exports of commodities like wheat and sunflower oil are disrupting food supplies and causing food insecurity around the world.</span> <strong>William Masters</strong><span style=\"font-weight: 400;\">, professor of food economics and policy at Tufts University, talks with</span> <strong>Dr. Josh Sharfstein</strong> <span style= \"font-weight: 400;\">about these and other consequences of the war for food,</span> <span style=\"font-weight: 400;\">in the United States and internationally. They also discuss short- and long-term solutions.</span></p>",
  "content:encoded": "<p>Ukraine’s strangled food exports of commodities like wheat and sunflower oil are disrupting food supplies and causing food insecurity around the world. William Masters, professor of food economics and policy at Tufts University, talks with Dr. Josh Sharfstein about these and other consequences of the war for food, in the United States and internationally. They also discuss short- and long-term solutions.</p>",
  "enclosure": "",
  "itunes:duration": "12:09",
  "itunes:explicit": false,
  "itunes:keywords": "food,war,russia,economics,insecurity,export,Ukraine,covid",
  "itunes:subtitle": "Ukraine’s strangled food exports of commodities like wheat and sunflower oil are disrupting food supplies and causing food insecurity around the world. William Masters, professor of food economics and policy at Tufts University, talks with Dr. Josh...",
  "itunes:season": 5,
  "itunes:episode": 464,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}