{
  "title": "$80M Fund Backs OrangeDAO's Revolutionary Plan to Mentor and Invest in Web3 Enterpreneurs",
  "link": "https://news.slashdot.org/story/22/11/05/022240/80m-fund-backs-orangedaos-revolutionary-plan-to-mentor-and-invest-in-web3-enterpreneurs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "An anonymous reader shared this report from long-time tech pundit Robert X. Cringley. \"A Distributed Autonomous Organization (DAO) called OrangeDAO is cooperating with a small seed venture fund called Press Start Capital to establish the OrangeDAO X Press Start Cap Fellowship Program for new Web3 entrepreneurs. \n\n\"Successful applicants get $25,000 each plus 10 weeks of structured mentorship plus continued access to the more than 1200-member OrangeDAO network. In exchange, OrangeDAO and Press Start get to invest in the resulting companies, if any, produced by the class.\" Cringley likens it to the American tech startup accelerator Y Combinator &mdash; but on steroids. \n\nCringley also explains why he thinks this \"middle class VC\" model \"will replicate and grow unconstrained,\" ultimately exporting itself from Silicon Valley to cities around the world.\n\nThere are many DAOs around and hardly anybody understands them or knows what they are good for. Mainly they have seemed to be involved in the NFT market. But OrangeDAO is different. It has 1200+ members and every one of those members is a graduate of the Y Combinator startup accelerator. They are verified Y Combinator company founders, so they've all had similar entrepreneurial experiences and see business much the same way as a result. OrangeDAO seems to have big plans and to make those plans happen in August the DAO, itself, raised $80 million in venture capital, with their first use of that capital being these Fellowships. \n\nI think this will change forever venture capital and the world economy. \n\nIt represents a new stage in the evolution of venture capital. In many senses it is the democratization of VC.... \n\nThe DAO members all have similar backgrounds, similar values, and similar risk tolerances. THERE ARE MORE OF THEM, so they can do bigger deals. And &mdash; here's the important bit &mdash; THEY ARE ALL Y COMBINATOR-EDUCATED and connected globally through the blockchain. They not only know many of the same things, they have a sense of where this knowledge comes from and why it is useful.... In the YC-based DAO we have people who want the next generation of entrepreneurs to be even better-educated. It's not some egalitarian goal, either: they see it as key to success for the whole thing. \n\nSmart people with good ideas will self-identify, be funded at a subsistence level to allow them to develop those ideas and prove their worth, then they can participate on a truly level playing field for the first time.... Gone is the Tycoon, gone is the professional VC who doesn't understand his tech, gone soon will be the angels (subsumed into the DAO model), and gone for the most part are the asshole VCs whom entrepreneurs grow to hate (not all of them, but a lot). \n\n\nDone correctly, this model is essentially Meritocratic VC. If the idea is good, the market is ready, and the people know what they are doing, the capital will be there.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=%2480M+Fund+Backs+OrangeDAO's+Revolutionary+Plan+to+Mentor+and+Invest+in+Web3+Enterpreneurs%3A+https%3A%2F%2Fbit.ly%2F3fFdUZh\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F22%2F11%2F05%2F022240%2F80m-fund-backs-orangedaos-revolutionary-plan-to-mentor-and-invest-in-web3-enterpreneurs%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/22/11/05/022240/80m-fund-backs-orangedaos-revolutionary-plan-to-mentor-and-invest-in-web3-enterpreneurs?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22334721&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "EditorDavid",
  "dc:date": "2022-11-05T22:34:00+00:00",
  "dc:subject": "business",
  "slash:department": "seed-no-evil",
  "slash:section": "news",
  "slash:comments": 11,
  "slash:hit_parade": "11,11,10,10,0,0,0"
}