{
  "id": "tag:blogger.com,1999:blog-5547907074344788039.post-2465909663782733680",
  "published": "2014-06-29T19:13:00.000-07:00",
  "updated": "2014-06-29T19:13:35.138-07:00",
  "title": "How data science shapes our world view",
  "content": "<span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">Data science is increasingly impacting how we view and experience our world.&nbsp;</span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br /></span><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">Last weekend, I was playing around with <a href=\"http://wordlens.com/\">WordLens</a>, a translation / augmented reality app <a href=\"http://www.techrepublic.com/article/google-picks-up-incredible-visual-translation-app-word-lens-and-makes-it-free/\">recently acquired by Google</a>.&nbsp;You point the smartphone's camera view at clear text such as road signs, book covers, and the like and the app not only translates the text but swaps the text out completely, matching the background (almost) seamlessly.&nbsp;You see that road sign in English? I see it in Spanish.&nbsp;</span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br /></span><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-Mh6Q86zfasc/U7BoHS8VCzI/AAAAAAAAC0Y/YwqgZ-TxI00/s1600/wordlens.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><img border=\"0\" src=\"http://2.bp.blogspot.com/-Mh6Q86zfasc/U7BoHS8VCzI/AAAAAAAAC0Y/YwqgZ-TxI00/s1600/wordlens.jpg\" height=\"282\" width=\"320\" /></span></a></div><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br /></span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">When it works well, it can be impossible to tell that the camera view, and target object, was modified in any way.&nbsp;Yes, this app is really buggy. It is not at all ready for prime time but nevertheless you can see the future right there in your hand. Let Google throw a team of engineers at it for the next 12 months, integrate it into glass, and you have a killer app.&nbsp;</span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br />One of the reasons that I am so excited and interested in this technology is that this is a significant step forward in augmented reality and, it could be argued, blurs the line significantly with virtual reality -- it is hard to tell the difference between the original world and the modified world. Moreover, it reinforces just how data science can and will influence our world view, literally.<br />Think of the ways that data science shape and filter what you see, sense, and perceive in the world:</span><br /><ul><li><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">Data science powers your newsfeed, showing what it thinks you want to see and who you want to interact with and filters out what it thinks is irrelevant. This obviously hugely influences your social interactions. &nbsp;</span></li></ul><ul><li><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">Skype will soon be introducing <a href=\"http://www.macrumors.com/2014/05/27/microsoft-demos-skype-translation-tool/\">real time translation in calls</a>. If that works well, it could dramatically shape how we collaborate with other around the world, enabling collaborations that would ordinarily be prohibitive because of a language barrier.</span></li></ul><ul><li><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">Adverts in the real world are becoming dynamic. In London, smart trash cans were introduced (and thereafter&nbsp;<a href=\"http://nakedsecurity.sophos.com/2013/08/13/london-says-media-companys-spying-rubbish-bins-stink/\">soon banned</a>) that would read your mac address and target display ads at you directly.&nbsp;</span></li></ul><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">It kind of sounds like a rogue state, an Orwellian future:&nbsp;a set of algorithms that effectively controls what news you see, which friends you see and interact with, translating and modify the sights and sounds around you.&nbsp;A large proportion then of what you see, hear, and experience could be shaped by data science. Thus, as practicing data&nbsp;scientists, this represents&nbsp;a great deal of responsibility.</span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br />I started writing this post before <a href=\"http://www.pnas.org/content/111/24/8788.full\">Facebook's newsfeed manipulation study</a> was published, a perfect example of precisely the sort of&nbsp;scenario I am talking about. If you've been hiding under a rock and didn't see it, the core Facebook data science team published a paper in Proceedings of the National Academy of Sciences (one of the most&nbsp;prestigious science journals) about an experiment to test social contagion of emotions. To quote directly</span><br /><br /><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">I am old enough to remember sitting down and consuming my news sequentially, cover to cover, on pieces of paper. (Kids, those things are called \"newspapers.\") I had to make a decision what to read and what to skip. Importantly, I got a brief sense of the news articles that I was&nbsp;<i>not</i>&nbsp;reading. This is completely different today. While I read a physical newspaper for long form articles at the weekend, during the week I consume my news from a variety of sources, all shaped, curated, and filtered by algorithms: on Twitter, Prismatic, Reddit and the like. I have a higher hit rate of stories that interest me but I have no idea what I am missing, what's been buried.</span><br /><blockquote class=\"tr_bq\"><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><i>\"The experiment manipulated the extent to which [Facebook users] (N = 689,003) were exposed to emotional expressions in their News Feed. This tested whether exposure to emotions led people to change their own posting behaviors, in particular whether exposure to emotional content led people to post content that was consistent with the exposure—thereby testing whether exposure to verbal affective expressions leads to similar verbal expressions, a form of emotional contagion.\"</i></span></blockquote><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">and they found that</span><br /><blockquote class=\"tr_bq\"><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><i>\"When positive expressions were reduced, people produced fewer positive posts and more negative posts; when negative expressions were reduced, the opposite pattern occurred.\"</i></span></blockquote><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">As I write, there is heated debate about this study. There are those that argue that there was no informed consent of the user. Even the editor of the paper (Prof S. T. Tiske) expressed concern:</span><br /><blockquote class=\"tr_bq\"><div style=\"text-align: left;\"><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><i>\"I was concerned until I queried the authors and they said their local institutional review board had approved it—and apparently on the grounds that Facebook apparently manipulates people's News Feeds all the time... I understand why people have concerns. I think their beef is with Facebook, really, not the research.\"</i> (Source: article in&nbsp;<a href=\"http://www.theatlantic.com/technology/archive/2014/06/even-the-editor-of-facebooks-mood-study-thought-it-was-creepy/373649/\">the Atlantic</a>)</span></div></blockquote><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">and therein lies the&nbsp;flip side. A / B tests, personalization, recommenders, coupons etc. manipulate users all the time. Is this really any different? What makes overt emotional manipulation worse that manipulating their likelihood to open their wallets and purchase a product or share your content?</span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br /></span><blockquote class=\"twitter-tweet\" lang=\"en\"><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">Helpful hint: Whenever you watch TV, read a book, open a newspaper, or talk to another person, someone's manipulating your emotions!</span><br /><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">— Marc Andreessen (@pmarca) <a href=\"https://twitter.com/pmarca/statuses/483020875776540672\">June 28, 2014</a></span></blockquote><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\"><br /></span><script async=\"\" charset=\"utf-8\" src=\"//platform.twitter.com/widgets.js\"></script><span style=\"font-family: Times, Times New Roman, serif; font-size: large;\">I don't want to take sides here but simply want to reinforce that point that as data scientists our work influences people, real people. Keep them in mind and seriously consider ethics and informed consent. Would the user expect their data to be used in this manner? Would you be OK if it were your data? If the answer is no to either of these, then don't do it. If you look out for the customer, put them first, then the business will surely follow.</span><br /><span style=\"font-size: x-small;\"><span style=\"font-family: Arial;\"><br /></span></span> <span style=\"font-family: Arial; font-size: 13px;\"></span>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Carl Anderson",
    "uri": "http://www.blogger.com/profile/11930448254473684406",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}