{
  "title": "Up your open source game with Hacktoberfest at Locke Data!",
  "link": "https://itsalocke.com/blog/up-your-open-source-game-with-hacktoberfest-at-locke-data/",
  "pubDate": "Mon, 01 Oct 2018 00:00:00 +0000",
  "guid": "https://itsalocke.com/blog/up-your-open-source-game-with-hacktoberfest-at-locke-data/",
  "description": "<p>How awesome is open source software? Quite awesome in our opinion! Locke Data maintains several open source repos <a href=\"https://github.com/lockedata\">on GitHub</a>, in particular of <a href=\"https://github.com/search?q=topic%3Ar-package+org%3Alockedata+fork%3Atrue\">R packages</a>, and we&rsquo;d like you to join in the fun! This month, we&rsquo;re taking part in Hacktoberfest and will do our best to mentor you through your first open source contributions if you wish!</p>\n\n<p>Hacktoberfest is a month-long operation celebrating open source software. As an open source newbie, it&rsquo;s the occasion to start participating in open source development! All you need to do is to sign up <a href=\"https://hacktoberfest.digitalocean.com/\">at the Hacktoberfest website</a>, and then to look for &ldquo;hacktoberfest&rdquo;-labelled issues on GitHub to see where your help is needed. <a href=\"https://blog.github.com/2018-09-24-hacktoberfest-is-back-and-celebrating-its-fifth-year/\">More general details in GitHub blog post</a>.</p>\n\n<p>We at Locke Data have labelled <a href=\"https://github.com/search?q=user%3Alockedata+label%3Ahacktoberfest&amp;state=open&amp;type=Issues\">a few issues</a> (follow <a href=\"https://github.com/search?q=user%3Alockedata+label%3Ahacktoberfest&amp;state=open&amp;type=Issues\">the link</a>) in our package repos and would be glad to have you as a contributor. All our repos are nice places with a code of conduct!</p>\n\n<p>If you choose to contribute to one of our repositories, we&rsquo;ll offer pointers as needed. Ellen is the team member in charge of managing our Hacktoberfest efforts, but we&rsquo;ll all cheer! Have fun! If you need to reach out to us for extra help, pointers or just want to know more, feel free to reach out to us on twitter @LockeData and give us a follow while you&rsquo;re over there - we&rsquo;ll be talking about Hacktoberfest for the whole month!</p>"
}