{
  "title": "Simple, Cheap, and Portable: A Filter-Free Desalination System for a Thirsty World",
  "link": "https://spectrum.ieee.org/portable-desalination-filter-free",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-black-hard-case-contains-a-white-device-with-beige-layers-with-wires-connecting-to-electronics-on-the-top-of-the-interior-of-t.jpg?id=29796719&width=1245&height=700&coordinates=0%2C307%2C0%2C18\"/><br/><br/><p>MIT researchers have developed a prototype of a suitcase-size device that can turn seawater into safe drinking water.<br/></p><p>According to the <a href=\"https://idadesal.org/\" target=\"_blank\">International Desalination Association</a>, more than 300 million people around the world now get their drinking water from the sea. With climate change exacerbating water scarcity globally, seawater <a href=\"https://e360.yale.edu/features/as-water-scarcity-increases-desalination-plants-are-on-the-rise\" target=\"_blank\">desalination</a> is stepping in to fill the void. But whereas commercial desalination plants are designed to meet large-scale demand, there is also a need for portable systems that can be carried into remote regions or set up as stand-ins for municipal water works in the wake of a disaster.</p><p>A group of scientists from MIT has <a href=\"https://pubs.acs.org/doi/10.1021/acs.est.1c08466\" target=\"_blank\">developed</a> just such a portable desalination unit; it’s the size of a medium suitcase and weighs less than 10 kilograms. The unit’s one-button operation requires no technical knowledge. What’s more, it has a completely filter-free design. Unlike existing portable desalination systems based on reverse osmosis, the MIT team’s prototype does not need any high-pressure pumping or maintenance by technicians.</p><p>The MIT researchers described their invention in a paper titled “Portable Seawater Desalination System for Generating Drinkable Water in Remote Locations.” The paper was posted in the 14 April online edition of <em>Environmental Science & Technology</em>, a publication of the American Chemical Society.</p><p>The unit uses produces 0.3 liters of potable drinking water per hour, while consuming a minuscule 9 watt-hours of energy.  Plant-scale reverse-osmosis water-treatment operations may be three to four times as energy efficient, and yield far greater quantities of freshwater at much faster rates, but the researchers say the trade-off in terms of weight and size makes their invention the first and only entrant in a new desalination niche.</p><p>The most notable feature of the unit is its unfiltered design. A filter is a barrier that catches the impurities you don’t want in your water, explains <a href=\"https://be.mit.edu/directory/jongyoon-han\" target=\"_blank\">Jongyoon Han</a>, an electrical and biological engineer, and lead author of the study. “We don’t have that specifically because it always tends to clog, and [then] you need to replace it.” This makes traditional portable systems challenging for laypeople to use. Instead, the researchers use ion-concentration polarization (ICP) and electrodialysis (ED) to separate the salt from the water.</p><p>“Instead of filtering, we are nudging the contaminants [in this case, salt] away from the water,” Han says. This portable unit, he adds, is a good demonstration of the effectiveness of ICP desalination technology. “It is quite different from other technologies, in the sense that I can remove both large particles and solids all together.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Hands hold a frame which contains a white rectangle of material with 6 strips on top of it.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"07f4bdb37b5ea60e8bdcdfd220bd8915\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0c150\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/hands-hold-a-frame-which-contains-a-white-rectangle-of-material-with-6-strips-on-top-of-it.jpg?id=29796725&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The setup includes a two-stage ion-concentration polarization (ICP) process, with water flowing through six modules in the first stage and then three in the second stage, followed by a single electrodialysis process.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">M. Scott Brauer</small></p><p>ICP uses an ion-selective membrane that allows the passage of one kind of ion when current is applied—either cations or anions. “What happens is that, [if] these membranes can transfer only cations, what about the anions?” Han asks. “The anions disappear near the membrane because nature really doesn’t like free ions hanging around…. So, [as a result, there is a region] near the membrane that is salt-free.” The salt-free region is the spot from which freshwater is harvested.</p><p>“What is unique about our technology is that we figured out a way to separate…a diverse array of contaminants [from water] in a single process,” says Han. “So we can go [straight] from seawater to drinkable water.”</p><p>It takes 40 liters of seawater to yield a single liter of drinking water. This 2.5 percent recovery rate might seem like a high environmental cost, says Junghyo Yoon, a researcher at Han’s lab. But Yoon reminds us that seawater is an infinite resource, so a low recovery rate is not a significant issue.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A hand adjusts a screw on a white box which sandwiches beige layers of material.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"6081612af901d0d941f5ddef250b97e3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5549f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-hand-adjusts-a-screw-on-a-white-box-which-sandwiches-beige-layers-of-material.jpg?id=29796726&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The portable device does not require any replacement filters, which greatly reduces the long-term maintenance requirements.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">M. Scott Brauer</small></p><p>The MIT group’s device is an out-of-the box system; you can just power it up, connect it to a saltwater source, and wait for potable water. “The box includes the battery and…[it is] like a typical laptop battery, anywhere between 60 and 100 watts,” Han says. “We think that that can operate for about a day or so.” A solar panel is another option, especially in a disaster zone, where there might not be an accessible electric power source.</p><p>Yoon points out that the results reported in the group’s paper are already a year old. “[Since we recorded the results listed in the paper], we have successfully ramped up the desalination rate to 1 liter [of freshwater] per hour,” he reports. “We are pushing ourselves to scale up to 10 liters per hour for practical applications.” He hopes to secure enough investment by the end of this year to take the next steps toward commercialization. “We expect that we can have the first prototype available for beta testing by the end of 2023. [We predict that] he cost will be [US] $1,500,” says Yoon.</p><p>That price will be far cheaper than portable desalination systems currently on the market—mostly models using reverse-osmosis filtration, which go for around $5,000. “Although they have higher flow rates and generate a larger amount of clean water because [they] are bigger, they are generally not so user friendly,” Han says. “Our system is much smaller, and uses much less power. And the goal here is to generate just enough water, in a manner that is very user friendly to address this particular need of disaster relief.”</p><p>Aside from the flow rate, Han is also not happy with the device’s energy consumption at present. “We don’t think is actually optimal,” he says. “Although [its energy efficiency] is good enough, it can always be made better by optimizing the [process].”</p>",
  "pubDate": "Tue, 17 May 2022 17:08:25 +0000",
  "guid": "https://spectrum.ieee.org/portable-desalination-filter-free",
  "category": [
    "Desalination",
    "Climate change",
    "Portable devices"
  ],
  "dc:creator": "Payal Dhar",
  "media:content": ""
}