{
  "id": "https://bibleinoneyear.org/en/youth/47",
  "title": "Day 47: Put First Things First",
  "description": "Psalm 22:16–19, Exodus 19:3–5, 20:1-6, Mark 1:30–41, 2:1–12. &#039;*Put first things first*  The things which matter most to God should take first place in our lives",
  "pubDate": "Tue, 16 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/47/?ignore",
  "itunes:duration": "13:45",
  "guid": "enyouth16022021-47",
  "length": 825.18,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 47: Put First Things First",
  "itunes:subtitle": "Psalm 22:16–19, Exodus 19:3–5, 20:1-6, Mark 1:30–41, 2:1–12. &#039;*Put first things first*  The things which matter most to God should take first place in our lives",
  "itunes:summary": "Shortly after we were married, Pippa and I went to a conference about marriage. One of the sessions I will never forget was about priorities. We were given five cards – each with a word on it: &#039;work&#039;, &#039;God&#039;, &#039;ministry&#039;, &#039;husband/wife&#039; and &#039;children&#039;. We were asked to rank these in order of priority. With hindsight, I can see I got them in completely the wrong order.\nI put &#039;God&#039; first (at least I got that one right – but it was fairly obvious!), followed by ministry, wife, work, and, finally, children (we didn&#039;t have any children at that stage so they didn&#039;t seem very important!).\nAs the leaders of the conference took us through these priorities, it became clear to me that my order should be: first of all God, then my wife (my primary calling), our children, my job (my primary ministry), and finally my ministry – which, though obviously very important, should not be allowed to displace the primary responsibilities of my life. As the philosopher Goethe put it, &#039;Things which matter most must never be at the mercy of things which matter least.&#039;\nPut first things first. The things which matter most to God should take first place in our lives.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 47
}