{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-707638237960786299",
  "published": "2019-08-05T19:32:00.000-07:00",
  "updated": "2019-08-05T19:32:00.940-07:00",
  "title": "Is the Fed Doing Anything Right?",
  "content": "I'm not sure the Fed has many friends these days. Donald Trump is unhappy with it, and the financial media seems puzzled by what the Fed is doing. Can we make sense of the Fed's behavior, particularly its change in policy last week, or is the Fed simply incoherent?<br /><br />It might help to start with first principles. What would good central bank policy look like, were we ever to have the good fortune to observe such a thing? A central bank should have clearly-stated goals. Those goals could be stated in the legal structure that constrains the central bank, or they could be in the central bank's interpretation of the law. For example, in the US the Fed's structure is defined in the Federal Reserve Act, and the Fed's dual mandate is in the Employment Act of 1946 and the Full Employment and Balanced Growth Act of 1978. The Fed's interpretation of what Congress stipulated is in the <a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">\"Statement on Longer-Run Goals and Monetary Policy Strategy,\"</a> which says, basically, that the Fed has a symmetric 2% inflation target, and that it seeks to achieve a \"maximum level of employment,\" without being precise about what that might mean. A central bank's goals should be such that they can be stated in an easily understandable way. That means that the public should be able to understand what the Fed thinks it's doing, and the Fed should be able to understand what it's supposed to be doing. So, the 2% inflation target seems OK in that sense. It's simple, and we'll be able to tell if the Fed is succeeding or not, with respect to that specific goal. However, \"maximum level of employment\" is a poor goal. Fed officials are free to define it however they like, and it's impossible to evaluate performance in terms of something that's not precisely defined.<br /><br />Once the central bank has dealt with what its goals should be, it has to decide on how to achieve those goals. For 40 years or more, it's been well understood among macroeconomists that achieving policy goals is about choosing a policy rule. That policy rule takes all available current information and generates a setting for some targeted variable the central bank can control. In typical modern central banking practice, that targeted variable is an overnight nominal interest rate - the fed funds rate in the Fed's case. The Fed need not write down its policy rule. In fact, writing it down would be a bad idea, in spite of what John Taylor thinks. What the central bank needs to do is to explain carefully what it is doing, and why, every time it takes an action. Over time, if central bankers make those decisions in a consistent way, and explain them well, then their actions become predictable. As it's generally understood by macroeconomists, that predictability is a wonderful thing. Eventually, central bank pressers should become so routine that they're boring as hell. In fact, boring as hell is the nirvana of central banking. Of course, the policy rule should be the best available rule for achieving the central bank's goals. There should be a theory that says it's the best thing around, and we should be able to evaluate the rule's performance in practice.<br /><br />Finally, once the central bankers have figured out their policy rule, they have to have an operating strategy for achieving their short term target. For example, the Fed needs an operating strategy for targeting the fed funds  rate. Currently, that operating strategy is to simply fix an interest rate on reserves, in the context of a large central bank balance sheet with a very large quantity of reserves outstanding - a floor system. Basically, the operating strategy should successfully achieve the target. Not much more to it than that.<br /><br />So, what happened last week at the FOMC meeting? They decided (with a couple of dissents) to reduce the target range for the fed funds rate by 0.25% to 2.00-2.25%. That seems to represent a change of plan, since in September 2018, the median FOMC member was thinking that the fed funds rate by the end of 2019 would be 3%. So, something important must have changed since last September. What was it? From the FOMC statement and Powell's presser after the meeting, it seems there were 5 things bothering the committee:<br /><br />1. Weak global growth.<br />2. Trade policy uncertainty.<br />3. Muted inflation.<br />4. The neutral rate of interest is down.<br />5. The natural rate of unemployment is down.<br /><br />Let's deal with the second part of the Fed's mandate first - the maximum level of employment. On the real side of the economy, things seem to be going quite well. Real GDP has been growing smoothly for the last 10 years: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-uQU-oi4tvyY/XUiiAZoYuGI/AAAAAAAADh4/LL0m2VYW5rEIwv_oyoLqZO9DrEncPGs2ACLcBGAs/s1600/GDP.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-uQU-oi4tvyY/XUiiAZoYuGI/AAAAAAAADh4/LL0m2VYW5rEIwv_oyoLqZO9DrEncPGs2ACLcBGAs/s640/GDP.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>That's an average growth rate of 2.3% vs. 3.3% for the 1947-2009 period, but if we calculate per capita real GDP growth rates, it's not as large a difference, i.e. 1.6% for 2009-2019, and 2.1% for 1947-2009. Of course, there's also a level drop in real GDP from peak to trough in the last recession of about 5%. But in terms of GDP growth, we're not looking worse than last September. In the labor market, a standard measure of labor market tightness is the ratio of job openings to the number of unemployed:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-MPLFcYMIBWU/XUijXXrMKpI/AAAAAAAADiE/ZO_MQ_ZeznQFPf403v3TkzNryWXHr3BOwCLcBGAs/s1600/tightness.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-MPLFcYMIBWU/XUijXXrMKpI/AAAAAAAADiE/ZO_MQ_ZeznQFPf403v3TkzNryWXHr3BOwCLcBGAs/s640/tightness.png\" width=\"640\" height=\"280\" data-original-width=\"1075\" data-original-height=\"470\" /></a></div>So, it looks like the labor market is no less tight than it was in September, when it was tighter than it had ever been since the JOLTS data has been collected by the BLS. There was some talk by Powell in the presser about weak investment, but I don't see that either: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-_Eli46V2pfw/XUikLwKVZjI/AAAAAAAADiQ/TnTlre0yjc8oaICcSczaR90544dRjJeqwCLcBGAs/s1600/investment.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-_Eli46V2pfw/XUikLwKVZjI/AAAAAAAADiQ/TnTlre0yjc8oaICcSczaR90544dRjJeqwCLcBGAs/s640/investment.png\" width=\"640\" height=\"280\" data-original-width=\"1075\" data-original-height=\"470\" /></a></div>No significant weakening in year-over-year real investment growth since September, as far as I can tell.<br /><br />So, things must be really bad in the rest of the world, and maybe we should be worried about that affecting us? Here are real GDP growth paths for the Euro area, Japan, UK, Canada, and the US:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-DhEH8AKMejo/XUik4iqPv4I/AAAAAAAADiY/SRYYSnU7rk8fPaLPzBDXSDlZwT_tL0o2QCLcBGAs/s1600/global%2Bgrowth.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-DhEH8AKMejo/XUik4iqPv4I/AAAAAAAADiY/SRYYSnU7rk8fPaLPzBDXSDlZwT_tL0o2QCLcBGAs/s640/global%2Bgrowth.png\" width=\"640\" height=\"280\" data-original-width=\"1075\" data-original-height=\"470\" /></a></div>So, I don't know about you, but I don't see \"weak global growth\" there, relative to September, when everyone was so optimistic. Maybe this is showing up in labor markets? Certainly not in Japan: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-LHjV41Wus0E/XUilVP8LGII/AAAAAAAADig/ukXEIF4P3QMbqT_jor47zSzC1B_82y9CwCLcBGAs/s1600/Japan.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-LHjV41Wus0E/XUilVP8LGII/AAAAAAAADig/ukXEIF4P3QMbqT_jor47zSzC1B_82y9CwCLcBGAs/s640/Japan.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>Or the Euro area: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-b4kwZ0EBnPs/XUilb1Q6o7I/AAAAAAAADik/RkEMT76YXwMv0H4sJPDLsdoTbi8PC-vGgCLcBGAs/s1600/euro%2Barea%2Blabor_Page_2.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-b4kwZ0EBnPs/XUilb1Q6o7I/AAAAAAAADik/RkEMT76YXwMv0H4sJPDLsdoTbi8PC-vGgCLcBGAs/s640/euro%2Barea%2Blabor_Page_2.png\" width=\"640\" height=\"637\" data-original-width=\"760\" data-original-height=\"756\" /></a></div>Or the UK: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-HRS0n1nELi8/XUiliAobrlI/AAAAAAAADio/xCONwM3qbXAjRnW6pmPyti_kbwgWdnwPwCLcBGAs/s1600/UK.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-HRS0n1nELi8/XUiliAobrlI/AAAAAAAADio/xCONwM3qbXAjRnW6pmPyti_kbwgWdnwPwCLcBGAs/s640/UK.png\" width=\"640\" height=\"427\" data-original-width=\"600\" data-original-height=\"400\" /></a></div>But, I can certainly understand that there's \"trade policy uncertainty.\" More like \"Trump uncertainty,\" I think. But that's been with us since January 2017. And for North America, which we could argue is more relevant for the US, the trade uncertainty is actually lower than it was in September. The USMCA was signed by Mexico, Canada, and the US on November 30, 2018, though it is as yet not ratified. Brexit anxiety is with us of course, but again that's nothing new. So, I think you have to be more specific if you want to make a general case about policy uncertainty. And what's the hurry? You can't wait for resolution?<br /><br />If you're like me, you're now more puzzled than when you started reading this. Typically central banks lower interest rates in the face of observed decreases in aggregate economic activity - somewhere. But we haven't seen any such thing. Must be some very weird policy rule at work here.<br /><br />But what's the story with inflation? <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-e7SUZIma-JY/XUinhM1f-SI/AAAAAAAADi8/7p9Oix6c31QSCajMvh_02naPdcUtpHZDgCLcBGAs/s1600/inflation.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-e7SUZIma-JY/XUinhM1f-SI/AAAAAAAADi8/7p9Oix6c31QSCajMvh_02naPdcUtpHZDgCLcBGAs/s640/inflation.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>So, I guess \"muted\" is as a good a word as any for that, relative to the 2% inflation target. The Fed's chosen measure - headline PCE - is at 1.4%, and stripping out food and energy gives us 1.6%. Not low, certainly, and well within what you might think is reasonable tolerance, but definitely below target. So, that's clearly a change from September, when inflation was roughly on target, though a deviation of 0.6% below target, possibly pushed down temporarily by energy prices, doesn't seem like a big deal.<br /><br />But, suppose we thought that the only problem here is a slightly-below-target inflation rate. What would the corrective action be? Well, we need to go back to the policy rule stage to answer that question. What's the relevant theory to bring to bear on the problem, and what does the theory tell us the Fed should do? A below-target inflation rate says the target fed funds rate moves in what direction? Standard central bank practice says the answer is down. Why? Inflation-targeting central bankers argue that they have built up credibility with the public, who believe that the inflation rate will be 2% indefinitely. That's what a central banker means by \"anchored expectations.\" Then, if inflation expectations are anchored, and assuming there is a stable Phillips curve, everyone knows that lower nominal interest rates imply lower real interest rates in the short run. And lower real interest rates, as everyone knows, makes \"aggregate demand\" go up. Further, as everyone knows, output is demand-determined, so output therefore goes up. Then, by Phillips curve logic, inflation goes up.<br /><br />But, as everyone knows, I think, there are issues with the Phillips curve. AOC knows it, and Jay Powell knows it, as <a href=\"https://www.c-span.org/video/?c4806495/aoc-asks-phillips-curve-fairy-tale\">we can see in this exchange.</a> Powell seems to be telling AOC what his staff told him, which is that the Phillips curve is currently very flat. The Phillips curve is still there though, or so Powell seems to think, though he seems a little confused about how the whole thing works. But, if you're a Phillips curve person, as Powell seems to be, how do you think you're going to get any action in the current environment from an interest rate reduction? You're convinced the Phillips curve is flat, and it's hard to see how the labor market could get any tighter, so where is this Phillips curve inflation going to come from. Expectations? It certainly doesn't look like financial market participants, who had been primed for this interest rate reduction, think so.<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-SNrQrcq0yHE/XUjOMBnXdrI/AAAAAAAADjU/fiSsWgAXy2ooLHEGsZLMCoQUecVlW8-QwCLcBGAs/s1600/breakeven.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-SNrQrcq0yHE/XUjOMBnXdrI/AAAAAAAADjU/fiSsWgAXy2ooLHEGsZLMCoQUecVlW8-QwCLcBGAs/s640/breakeven.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>That is, the current breakeven inflation rate, at a 10-year horizon, is 1.6%, so market participants don't appear to anticipate a return to 2% inflation.<br /><br />So, this rate decrease seems very hard to justify, even in terms of how the typical FOMC participant looks at the world. And you can see that in the presser with Powell. The reporters are trying hard to understand what the Fed is up to, Powell is struggling to explain it, and everything is coming out muddled. For example, this exchange: <blockquote>MICHAEL MCKEE. [inaudible] question is how does it do that? How does cutting interest rates lower, or how does cutting interest rates keep that going since the cost of capital doesn’t seem to the issue here.<br />CHAIR POWELL. You know, I really think it does, and I think the evidence of my eyes tells me that our policy does support, it supports confidence, it supports economic activity, household and business confidence, and through channels that we understand. So, it will lower borrowing costs. It will, and it will work. And I think you see it. Since, you know, since we noted our vigilance about the situation in June, you saw financial conditions move up, and you saw, I won’t take credit for the whole recovery, but you saw financial conditions move up. You see confidence, which had troughed in June. You saw it move back up. You see economic activity on a healthy basis. It just, it seems to work through confidence channels as well as the mechanical channels that you are talking about.</blockquote>Well, there's no confidence channel running from Powell to me, that's for sure. The rest of the presser is more of the same. Powell started off well when he was appointed. He opted for press conferences after every FOMC meeting, reduced the wordiness of FOMC statements, and generally seemed to be communicating well. But this decision makes clear what his limitations are. Powell is an attorney whose experience with monetary policy comes from sitting on the FOMC since 2011. You may think that puts you at the center of things. Sorry, it doesn't. There's a lot Powell doesn't know, and it shows.<br /><br />The other piece of FOMC decision making at this last meeting was to move up the date when the Fed would resume asset purchases. That is, for the time being the Fed intends to maintain the size of its balance sheet, in nominal terms, at its current size. To do this, the Fed will purchase assets (mainly Treasury securities) each month to replace the assets that mature. Earlier this year, the Fed decided it would retain its current floor system operating procedure. Why exactly is unclear. As far as I can make out, the justification seems to be that this makes interest rate control easier. But the Fed claims to be committed to running a floor system with the least possible amount of reserves outstanding that permits the system to work efficiently. Here's some quantities on the Fed's balance sheet.<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-_gZELCI23Sk/XUjU7QzZ6PI/AAAAAAAADjg/MOt-nvxZvTIKFsxgmLAqtQFpS4i_bzFfwCLcBGAs/s1600/fed%2Breserves%2Betc.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-_gZELCI23Sk/XUjU7QzZ6PI/AAAAAAAADjg/MOt-nvxZvTIKFsxgmLAqtQFpS4i_bzFfwCLcBGAs/s640/fed%2Breserves%2Betc.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>In nominal terms, the \"normalization\" in the balance sheet that was promised years ago by the Fed never materialized. The reduction in securities held outright was modest, to about $3.6 trillion. This asset quantity is much more than enough to back the current stock of currency outstanding, which is about $1.7 trillion, and there is still $1.5 trillion in reserves outstanding. That anyone thinks this could be anything close to the minimum amount required to run a floor system is bizarre. Even if $1.5 trillion in reserves were considered about right, there is about $500 billion in other liabilities that the Fed has outstanding for no good reason. This $500 billion includes what is in the Treasury's general account with the Fed, and what are effectively reserve accounts (these are called \"reverse repos\") of foreign entities, including foreign central banks. All of that $500 billion could go to the private sector, in various forms, which would increase reserves outstanding by $500 billion. That is, it would make no difference if $500 billion in securities were allowed to run off, and the $500 billion in foreign-held reverse repos and Treasury balances went to the private sector.<br /><br />Another issue is that the floor system does not appear to be working as advertised. So, in contrast to what the Fed seems to want to tell us, interest rate control is not easier with a floor system. The fed funds rate, which previously was below the interest rate on reserves, is now somewhat above it, and interest rates on overnight repos are misbehaving. A potential solution to this, discussed at the June FOMC meeting, is a standing repo facility. Effectively, this would be a lending facility, possibly for banks and/or primary dealers, with the rate set above the interest rate on reserves. Maybe you're wondering why we need this, given that we have a discount window. But, the claim is that this would somehow make Treasury securities more liquid and reduce the demand for reserves, while also eliminating some upside volatility in overnight repo rates. So, that puzzles me. Why? <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-0BUYWs0pVy0/XUjZikOiMuI/AAAAAAAADjs/R_PC8lB2JzcWCjDhmkuRw0sw4PyqrzWigCLcBGAs/s1600/overnight%2Brates.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-0BUYWs0pVy0/XUjZikOiMuI/AAAAAAAADjs/R_PC8lB2JzcWCjDhmkuRw0sw4PyqrzWigCLcBGAs/s640/overnight%2Brates.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>In the chart, you can see month-end spikes in the overnight repo rate. But you can also see that the 3-month T-bill rate, and the 1-month T-bill rate, are typically lower than the interest rate on reserves through this period. If Treasuries were so illiquid, relative to reserves, then banks would be asking for a premium to hold Treasuries. But that's not what we see. But maybe banks aren't holding much in the way of Treasuries? No, that's not the case. <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-3IdBVbWUxHY/XUjaU2CqzsI/AAAAAAAADj4/A1tCAlJbfVocha5VS6afYZ7gbSe1gOzoQCLcBGAs/s1600/banks.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-3IdBVbWUxHY/XUjaU2CqzsI/AAAAAAAADj4/A1tCAlJbfVocha5VS6afYZ7gbSe1gOzoQCLcBGAs/s640/banks.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>So, this idea makes no sense. I could see someone making an argument for a standing repo facility on the grounds that, for some well-articulated reason, the discount window isn't working well. But that's not the argument.<br /><br />So what's going on here? The Fed announced a normalization plan, which started at the end of 2015. Under the plan, interest rates would normalize. What's that mean? Normal means that short-term nominal interest rates are high enough to be consistent with 2% inflation over the long term. Under current conditions, the real short-term interest rate is persistently low, so a \"normal\" short-term interest rate would be lower than in the past. That's just the logic of Irving Fisher, which we all learned as undergrads. But, if the nominal interest rate is too low on average, then inflation will be too low, on average. That's abundantly obvious given the post-1995 Japanese experiment. Late last year, the FOMC was thinking that a normal fed funds rate is about 2.5-3.0%. I think that's about right. Basically, they aborted normalization. And, if the FOMC thinks an important goal is hitting 2% inflation, it should have kept its target fed funds rate range constant, or moved it up.<br /><br />Balance sheet reduction was also to be a part of normalization, but obviously that's not happening, and the FOMC is not providing us with good reasons for retaining its floor system, which has never behaved according to what the people at the Fed predicted. The recent surprises in the overnight interest rate structure are just another example of that. <br /><br />Where does all that leave us? Not in a really bad place. The central banks of the world are going to model themselves on the Bank of Japan. Barring a Trump recession, things will be OK. We'll have inflation below 2%, a large central bank balance sheet in perpetuity, odd behavior in overnight markets, and puzzled central bankers who can't explain what's going on. Oh well. <br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 14
}