{
  "title": "Conspiracy Theories About Pelosi Attack Spread Unchecked on &#039;Alt-tech&#039; Sites, Conservative Media",
  "link": "https://www.splcenter.org/hatewatch/2022/11/04/conspiracy-theories-about-pelosi-attack-spread-unchecked-alt-tech-sites-conservative-media",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Hatewatch</div>\n      </div>\n</div>\n<div class=\"field field-name-field-long-text field-type-text-long field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>Conspiracy theories about the home invasion and hammer attack on Paul Pelosi, husband of House Speaker Nancy Pelosi, continue to spread across conservative media, social media and “alt-tech” sites, even as a federal criminal complaint appears to debunk false narratives extremists and right-wing influencers have spread.</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Conspiracy Theories About Pelosi Attack Spread Unchecked on &#039;Alt-tech&#039; Sites, Conservative Media </h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>The response shows Republicans and the far right pushing back in a unified way on critics who linked intemperate political rhetoric and political violence, in an effort to limit electoral consequences in the midterms.</p>\n<div data-embed-button=\"media\" data-entity-id=\"35333\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"0c1e1b8b-982c-42ee-ac37-c9b14b84845e\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35333\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/inlineimage1jpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/inline_image1.jpg\" width=\"700\" height=\"467\" alt=\"Nancy and Paul Pelosi\" title=\"Nancy and Paul Pelosi\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Speaker of the House Nancy Pelosi, D-California, and her husband, Paul Pelosi, arrive at the State Department for the Kennedy Center Honors State Department Dinner on Dec. 7, 2019, in Washington, D.C. (Photo via Associated Press/Kevin Wolf) </div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>A <a href=\"https://www.justice.gov/opa/press-release/file/1548106/download?utm_medium=email&amp;utm_source=govdelivery\"> detailed criminal complaint</a> from the Department of Justice filed Monday shows prosecutors alleging that suspect David DePape entered the Pelosis’ residence with a hammer and struck Paul Pelosi with it in front of arresting officers.</p>\n<p>Prosecutors also allege that Speaker Pelosi was the intruder’s primary target, citing his own apparent confession that he had entered her home in order to “break &#039;her kneecaps,’” due to his belief that Pelosi was “‘leader of the pack’ of lies told by the Democratic Party.” They also alleged that DePape had planned to target other politicians.</p>\n<p>The charges came after a wide range of right-wing influencers attempted to muddy the waters with conspiracy theories – some homophobic – and mischaracterizations of DePape, 42, of Berkeley, California.</p>\n<p>But the clear picture of the events in the documents did not slow the generation of false conspiracy narratives later in the week.</p>\n<h2>The Gateway Pundit: fake news influencer</h2>\n<p>Leading the charge was Jim Hoft’s junk news site, The Gateway Pundit, which has published <a href=\"https://www.google.com/search?q=site:thegatewaypundit.com+pelosi&amp;source=lnt&amp;tbs=qdr:w&amp;sa=X&amp;ved=2ahUKEwixrPnatJL7AhX6MjQIHYwEAioQpwV6BAgBEBc&amp;biw=1670&amp;bih=822&amp;dpr=1\"> more than 60 posts</a> on the Pelosi attack. These posts have asserted a range of false narratives about the attack, many of which spread to social media and other websites.</p>\n<p>They included suggestions that DePape and Paul Pelosi were lovers due to the assailant being arrested in his underwear, and that the Pelosis’ marriage was a <a href=\"https://archive.ph/KVcBb\">sham</a> to cover for Paul Pelosi’s homosexuality. Gateway Pundit also pushed false narratives suggesting that security camera footage had been withheld by the Pelosis, and that a number of <a href=\"https://archive.ph/vDza9\">websites and social media accounts</a> associated with the alleged attacker were “false flag” deceptions seeking to link Republicans with the incident.</p>\n<div data-embed-button=\"media\" data-entity-id=\"35334\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"3f4267b6-95ea-47e5-ad3b-117a3cc16835\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35334\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/inlineimage2jpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/inline_image2.jpg\" width=\"700\" height=\"467\" alt=\"David DePape\" title=\"David DePape\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">David DePape, right, records the nude wedding of Gypsy Taub outside City Hall on Dec. 19, 2013, in San Francisco. DePape is accused of breaking into House Speaker Nancy Pelosi&#039;s California home and severely beating her husband Paul with a hammer. DePape was known in Berkeley, California, as a pro-nudity activist who had picketed naked at protests against local ordinances requiring people to be clothed in public. (Photo via Associated Press/Eric Risberg)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>Gateway Pundit also repeatedly characterized DePape. a Canadian citizen, as an “illegal immigrant.”</p>\n<p>The website also <a href=\"https://archive.ph/eyOPi\">celebrated</a> Elon Musk’s short-lived advocacy of a false conspiracy theory about the attack. Twitter’s new proprietor had linked to a story from a fake news website that asserted without evidence that the two men knew each other.</p>\n<p>Gateway Pundit is consistently ranked in the top 10% of websites by popularity, according to Hatewatch’s analysis of Cisco’s Umbrella survey of the top million websites online.</p>\n<p>According to data from Internet monitoring service Pyrra, Gateway Pundit also prolifically posted links to its Pelosi stories on “alt-tech” sites Gettr and Trump-owned Truth Social.</p>\n<p>Pyrra also showed that narratives Gateway Pundit and other right-wing websites promoted were shared and repeated widely across those and other low-moderation “alt-tech” websites. Hundreds of posts using the hashtag #pelosi on sites including Gab, Gettr, Truth Social and WeMe spread false information about the attacker’s motive, the Pelosis’ security and other aspects of the attack.</p>\n<p>On Facebook clone Minds, one user asked: “Criminal? Lover? Drug Dealer? Who is David DePape to Paul Pelosi??? The narrative keeps changing too much.”</p>\n<p>On Thursday, Gateway Pundit published a story by <a href=\"https://archive.ph/8bApR\">Brian Lupo</a> that sought to discredit the FBI investigation and claimed there was a “huge anomaly” in the timeline offered in the criminal complaint.</p>\n<p>That story became a <a href=\"https://archive.ph/MS9j0\">trending topic</a> on Gab, the far-right friendly site run by self-described Christian nationalist Andrew Torba, where it was spread and enjoyed by the site’s user base of extremists. Gab also <a href=\"https://www.documentcloud.org/documents/23261602-20221103-https___gabcom_tags_pelosi\"> played host</a> to memes and false narratives about Paul Pelosi’s relationship with DePape.</p>\n<p>Another <a href=\"https://archive.ph/l4kyt\">story</a> from the antigovernment John Birch Society outlet <em>The New American</em> was <a href=\"https://archive.ph/vK0I4\">trending</a> on Gab at the same time. In it, Benjamin Faulkner made an argument that had already been repeated across a range of more mainstream conservative outlets: that the attack, like the Democrats’ response to the Jan. 6, 2021, riots, was primarily an electoral tactic, and was part of a “climate of fear and hysteria created by a power-mad class that feels their grip on power weakening.”</p>\n<h2>Midterm projections</h2>\n<p>Senior Democrats including President <a href=\"https://www.nytimes.com/2022/11/02/us/politics/transcript-biden-speech-democracy.html\"> Joe Biden</a>, former President <a href=\"https://www.axios.com/2022/10/29/obama-pelosi-attack-rhetoric\"> Barack Obama</a> and former Secretary of State <a href=\"https://twitter.com/HillaryClinton/status/1586411168880807936\"> Hillary Clinton</a> all linked the alleged violent attack to Trumpist political rhetoric in a succession of speeches and public statements during the week.</p>\n<p>Biden linked the attack to the Jan. 6, 2021, attack on the U.S. Capitol, saying that when DePape allegedly asked, “Where’s Nancy?” he used “the very same words used by the mob when they stormed the Capitol.”</p>\n<p>But throughout the week, right-wing influencers, including those with platforms in mainstream publications, tried to depict concerns about political violence as mere Democratic Party electioneering.</p>\n<p>A <a href=\"https://archive.ph/OJFQS\">Sunday column</a> in the Murdoch family-owned <em>New York Post</em> by Miranda Devine attacked what it called a “false depiction of the alleged attacker as a MAGA Republican in defiance of his drug-addicted hippy lifestyle,” and put aside any scruples about mixed metaphors to claim that condemnations of political violence were “a full-court press designed to flip the attack on the House speaker’s husband into an ‘October surprise’ as Dems look down the barrel of a brutal shellacking from the voters next week.”</p>\n<p>On Monday night, Tucker Carlson also <a href=\"https://www.youtube.com/watch?v=-4NFYNnTOX8\"> claimed</a> that the response to the attack was an attempt to limit damage in midterms, after using details about DePape’s living circumstances to mock the idea that he had right-wing politics.</p>\n<p>YouTube performer Dave Rubin <a href=\"https://archive.ph/OFBzV\">accused</a> Hillary Clinton of exploiting the attack for “midterm votes,” and called her “shameless.”</p>\n<p>By week’s end, almost no one on the right – whether open extremist or ostensibly respectable conservative commentator – was acknowledging that the attack was an act of political violence.</p>\n<p><em>Photo illustration by SPLC</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-byline field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Jason Wilson</div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Conspiracy Theories About Pelosi Attack Spread Unchecked on &#039;Alt-tech&#039; Sites, Conservative Media  - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/hatewatch/2022/11/04/conspiracy-theories-about-pelosi-attack-spread-unchecked-alt-tech-sites-conservative-media\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 04, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Fri, 04 Nov 2022 19:34:15 +0000",
  "dc:creator": "chris.heller_1541",
  "guid": "17217 at https://www.splcenter.org"
}