{
  "title": "Domain-Wall Discovery Points Toward Self-Healing Circuits",
  "link": "https://spectrum.ieee.org/domain-wall",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/conical-ferroelectric-domain-walls-in-lithium-niobate.jpg?id=31639003&width=1200&height=400&coordinates=0%2C208%2C0%2C208\"/><br/><br/><p>Atomically thin materials such as <a data-linked-post=\"2650278756\" href=\"https://spectrum.ieee.org/is-graphene-by-any-other-name-still-graphene\" target=\"_blank\">graphene</a> have drawn attention for how electrons can race in them at exceptionally quick speeds, leading to visions of advanced new electronics. Now scientists find that similar behavior can exist within two-dimensional sheets, known as domain walls, that are embedded within unusual crystalline materials. Moreover, unlike other atomically thin sheets, domain walls can easily be created, moved, and destroyed, which may lead the way for novel circuits that can instantly transform or be repaired on command.</p><p>In the new study, researchers investigated crystalline lithium niobate <a href=\"https://spectrum.ieee.org/antiferroelectric\" target=\"_self\">ferroelectric</a> film just 500 nanometers thick. Electric charges within materials separate into positive and negative poles, and ferroelectrics are materials in which these electric dipoles are generally oriented in the same direction. The electric dipoles in ferroelectrics are clustered in regions known as domains. These are separated by two-dimensional layers known as domain walls.</p><p>The amazing <a href=\"https://spectrum.ieee.org/memristor-6g-switches\" target=\"_self\">electronic properties</a> of two-dimensional materials such as <a href=\"https://spectrum.ieee.org/atomically-thin-circuits-made-from-graphene-and-molybdenite\" target=\"_self\">graphene and molybdenum disulfide</a> have led researchers to hope <a href=\"https://spectrum.ieee.org/the-most-complex-2d-microchip-yet\" target=\"_self\">they may allow Moore’s Law to continue</a> once it becomes impossible to make further progress using silicon. Researchers have also investigated similarly attractive behavior in exceptionally thin electrically conducting <a href=\"https://spectrum.ieee.org/the-etchasketchtm-of-microscopy-creates-single-electron-transistors\" target=\"_self\">heterointerfaces</a> between two different insulating materials, such as lanthanum aluminate and strontium titanate.</p><p>Domain walls are essentially homointerfaces between chemically identical regions of the same material. However, unlike any other 2D electronic material, applied electric or magnetic fields can readily create, move, and annihilate domain walls inside materials.</p><p>This unique quality of domain walls may potentially lead to novel “<a href=\"https://www.nature.com/articles/s41578-021-00375-z\" target=\"_blank\">domain wall electronics</a>” far more flexible and adaptable than current devices that rely on static components. One might imagine entire circuits “created in one instant, for one purpose, only to be wiped clean and rewritten in a different form, for a different purpose, in the next instant,” says study lead author <a href=\"https://pure.qub.ac.uk/en/persons/conor-mccluskey\" target=\"_blank\">Conor McCluskey</a>, a physicist at Queen’s University Belfast, in the United Kingdom. “Malleable domain-wall network architecture that can continually metamorphose could represent a kind of technological genie, granting wishes on demand for radical moment-to-moment changes in electronic function.”</p><p>However, scientists have found it difficult to examine domain walls in detail. The fact that domain walls are both very thin and buried under the surfaces of crystals makes them less easy to analyze “than regular 3D or even 2D materials,” McCluskey says.</p><p>In the new study, McCluskey and his colleagues focused on how the domain walls in the crystals they were investigating are shaped like cones. This geometry let them analyze the behavior of the domain walls using a relatively simple probe design.</p><p class=\"pull-quote\">“Malleable domain-wall network architecture that can continually metamorphose could represent a kind of technological genie, granting wishes on demand for radical moment-to-moment changes in electronic function.” —<em>Conor McCluskey</em></p><p>The scientists found that electric-charge mobility was exceptionally fast at room temperature on average. These speeds may be “the highest room-temperature value in any oxide” and “at least comparable to that seen in graphene,” McCluskey says. The researchers detailed <u><a href=\"https://onlinelibrary.wiley.com/doi/full/10.1002/adma.202204298\" target=\"_blank\">their findings</a></u> in the 11 August issue of the journal <em>Advanced Materials</em>.</p><p>Precise knowledge of such parameters “are needed for envisioning and building devices that work reliably,” McCluskey says. “The dream is that it could allow completely malleable or ephemeral nanocircuitry to be created, destroyed, and reformed from one moment to the next.”</p><p>One promising application for domain walls may be brain-mimicking <a href=\"https://spectrum.ieee.org/neuromorphic-computing-more-than-ai\" target=\"_self\">neuromorphic computing</a>, with neuromorphic devices playing the role of the synapses that link neurons together, McCluskey says.</p><p>“The brain works by forging pathways which have some memory about their history: If a particular synaptic pathway is used more frequently, it becomes stronger, making it easier for this pathway to be used in the future. The brain learns by forging these stronger pathways,” McCluskey says. “Some domain-wall systems can behave in the same way: If you apply a small voltage to walls in our particular system, they tilt and change slightly, increasing their conductivity and giving a higher current. The next pulse will produce a higher current, and so on and so on, as if they have some memory of their past.”</p><p>If domain walls can play the role of artificial synapses, “this could pave the way to a low-heat-production, low-power-consumption brainlike architecture for neuromorphic computing,” he adds.</p><p>However, although reconfigurable electronics based on domain walls are a tantalizing idea, in many ferroelectrics the domain walls conduct only marginally better than the rest of the material, and so they will likely not help support viable devices, McCluskey notes.</p><p>“This isn’t a problem for the system we have investigated, lithium niobate, as it has quite an astonishing ratio between the conductivity of the domain walls and the bulk material,” McCluskey says. However, lithium niobate does currently require large voltages to manipulate domain walls. Scaling these systems down in thickness for use with everyday voltages “is one major hurdle,” he notes. “We are working on it.”</p><p>Future experiments will explore why electric-charge mobility is so fast in domain walls. “Broadly speaking, the carrier mobility relies on two things—the number of times the charge carrier will scatter or bump into something on its journey through the material, and the so-called effective mass with which the carrier moves,” McCluskey says.</p><p>Electrons can deflect off defects in materials, as well as vibrations known as phonons. “It is possible the presence of a domain wall alters the defect or phonon concentrations locally, resulting in fewer scattering centers along the domain wall,” McCluskey says.</p><p>When it comes to the effective mass of a charge carrier such as an electron, “when we consider an electron moving through a crystal lattice, we need to consider it not as a free electron, such as one in vacuum, but as an electron moving through the solid crystalline environment,” McCluskey explains. “The electron feels the effect of the nearby atoms as it progresses, changing its energy as it moves closer or further away from any given atom.” This can essentially make an electron moving in a crystal lighter or heavier than a normal electron. The way in which domain walls disturb crystal lattices may in turn alter the electron’s effective mass, he says.</p><p>“Without further experiments, it’s impossible to say which of these contributions is more responsible for determining the carrier mobility in our system,” McCluskey says. “We hope that our study prompts a shift in focus toward characterizing the transport in domain-wall systems, which may be every bit as exciting as some of the other 2D functional materials systems at the forefront of research today.”</p>",
  "pubDate": "Sat, 10 Sep 2022 01:00:00 +0000",
  "guid": "https://spectrum.ieee.org/domain-wall",
  "category": [
    "Two-dimensional materials",
    "Lithium niobate",
    "Ferroelectric",
    "Domain wall"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}