{
  "id": "tag:theatlantic.com,2021:50-618250",
  "content": "<p class=\"dropcap\" dir=\"ltr\">I<span class=\"smallcaps\">n the early 1970s, a psychoanalyst</span> named Herbert J. Freudenberger opened a free clinic to treat poor patients in New York City. It was a bit of a passion project: Freudenberger <a href=\"https://www.researchgate.net/publication/346586006_Herbert_J_Freudenberger_and_the_making_of_burnout_as_a_psychopathological_syndrome\">would work</a> 10 to 12 hours during the day in his private practice, then head over to the free clinic to work until midnight or later. He seemed to realize that he was overcommitting. “You start your second job when most people go home,” Freudenberger <a href=\"https://psycnet.apa.org/record/1975-26014-001\">wrote</a> at one point. “And you put a great deal of yourself in the work.”</p><p dir=\"ltr\">Eventually, he <a href=\"https://www.scientificamerican.com/article/burned-out/\">noticed</a> that this free clinic, which had once brought him so much meaning and joy, was starting to wear on him. Many of his fellow physicians <a href=\"https://psycnet.apa.org/record/1976-10574-001\">were becoming</a> tired, snippy, and cynical. Freudenberger diagnosed himself and his colleagues with what he called “burnout syndrome,” a state of perpetual exhaustion caused primarily by a person’s job. The burned out, <a href=\"https://spssi.onlinelibrary.wiley.com/doi/abs/10.1111/j.1540-4560.1974.tb00706.x\">he wrote</a>, not only have bad attitudes; they have headaches, stomach problems, trouble sleeping, and shortness of breath.</p><p dir=\"ltr\">These days, almost everyone feels like Freudenberger in his 14th hour of work. Those who still have the energy to read the news might encounter dozens of articles about hitting the “<a href=\"https://www.google.com/search?q=pandemic+wall&amp;oq=pandemic+wall&amp;aqs=chrome..69i57j0l2j0i20i263j69i60l2j69i61.1290j0j1&amp;sourceid=chrome&amp;ie=UTF-8\">pandemic wall</a>” or suffering from “<a href=\"https://www.google.com/search?q=pandemic+burnout&amp;oq=pandemic+burnout&amp;aqs=chrome.0.0i433j0l3j69i60l2j69i61.1815j0j1&amp;sourceid=chrome&amp;ie=UTF-8\">pandemic burnout</a>.” Many people have now spent a year staying inside, avoiding friends and family, abstaining from travel and indoor dining, mourning the loss of hundreds of thousands of people, and maintaining the same pace of work while caring for children round-the-clock and often single-handedly. Even people who have been calmly emailing their way through the apocalypse feel that their limit has been reached and they can go no further.</p><p dir=\"ltr\">Research <a href=\"http://www.mnestudies.com/human-resource/role-stress-role-conflict-role-ambiguity\">suggests</a> that people tend to be more stressed out when they face conflicts about their various roles—mother, worker, friend to a frazzled co-worker, daughter to an anti-vaccine parent. And this right here is the role-conflict plague. Nearly 3 million American women have <a href=\"https://www.cbsnews.com/news/covid-crisis-3-million-women-labor-force/\">dropped out</a> of the labor force since the pandemic began, in part because they’re disproportionately shouldering the burden of all those different roles.</p><p dir=\"ltr\"><em>[<a href=\"https://www.theatlantic.com/health/archive/2020/05/work-from-home-pandemic/611098/?utm_source=feed\">Read: Work from home is here to stay</a>]</em></p><p dir=\"ltr\">Anyone can feel burned out, even people who might have spent the pandemic relaxing on a COVID-free island with a magically replenishing money supply. The mental pressure of living through a mass-casualty event would be enough to fry the most Zen of brains. There’s also been burnout creep recently—people might talk about “midlife-crisis burnout” or being “burned out on Pilates.” But at its core, burnout is a work problem. Though wellness influencers might suggest various life hacks to help push through pandemic torpor, actual burnout experts say that tips and tricks are not the best way to treat the condition. Instead, they say, burnout is a problem created by the workplace, and changes to the workplace are the best way to fix it.</p><p class=\"dropcap\" dir=\"ltr\">S<span class=\"smallcaps\">cientifically, to be burned</span> out is to be exhausted, cynical and hostile toward one’s work, and down on one’s job performance. “You know, <em>Maybe I’m not cut out for this kind of work; I shouldn’t be here</em>,” says Christina Maslach, a psychology professor at UC Berkeley and the foremost burnout researcher in the United States. The World Health Organization similarly <a href=\"https://www.who.int/news/item/28-05-2019-burn-out-an-occupational-phenomenon-international-classification-of-diseases\">defines</a> burnout as a syndrome “resulting from chronic workplace stress that has not been successfully managed.” Like Maslach, the WHO says that burnout generates exhaustion, cynicism toward one’s job, and reduced “professional efficacy.”</p><p dir=\"ltr\">Six elements of work cause burnout, Maslach says. The first is pure workload—having way too much to do. One reason people feel burned out right now is that they have been working <a href=\"https://www.economist.com/graphic-detail/2020/11/24/people-are-working-longer-hours-during-the-pandemic\">longer hours</a> during the pandemic. In addition to an overstretching of staff and resources, burnout “could also include a cutthroat, bottom-line, results-oriented culture,” Mandy O’Neill, a management professor at George Mason University, said on Harvard Business Review’s <em><a href=\"https://hbr.org/podcast/2019/04/managing-burnout\">Women at Work</a></em> podcast.</p><p dir=\"ltr\">The second factor is how much control or autonomy someone has over their work. As the Stanford organizational-behavior professor Jeffrey Pfeffer writes in his book <em><a href=\"https://bookshop.org/a/12476/9780062800923\">Dying for a Paycheck</a></em>, “If through their actions people cannot predictably and significantly affect what happens to them, they are going to stop trying. Why expend effort when the results of that effort are uncontrollable, rendering the effort fruitless?”</p><p dir=\"ltr\">The third factor is a lack of recognition or reward for your work. One Philadelphia high-school teacher told <a href=\"https://www.ted.com/talks/worklife_with_adam_grant_burnout_is_everyone_s_problem/transcript?language=en\">the organizational psychologist</a> Adam Grant that her burnout was like being on “a hamster wheel. You’re kind of, like, doing a lot and trying really hard, but is it really changing anything?”</p><p>The fourth factor has to do with whether your workplace is more like a community or a viper pit. You can probably guess which one leads to burnout. The fifth relates to whether policies and practices are administered fairly. Does the boss play favorites? Finally, work that doesn’t create meaning or value for workers can lead to burnout. It’s one thing to spend 60 hours a week working to free an innocent person from prison; it’s quite another to spend them trying to collect someone’s medical debt.</p><p dir=\"ltr\">One line of research suggests that burnout is actually depression. In <a href=\"https://academicworks.cuny.edu/cgi/viewcontent.cgi?article=1316&amp;context=cc_pubs\">several</a> <a href=\"https://academicworks.cuny.edu/cgi/viewcontent.cgi?article=1276&amp;context=gc_pubs\">studies</a> on schoolteachers by Renzo Bianchi, a psychologist at the University of Neuchâtel, in Switzerland, the majority of teachers who had burnout symptoms also had symptoms of moderate or severe depression. Other <a href=\"https://www.sciencedirect.com/science/article/pii/S2213058614000060?via%3Dihub\">studies</a> have found that “burnout and depressive symptoms seem to cluster together and develop in parallel.” This, according to Bianchi and other researchers, suggests that burnout can be understood as a <a href=\"https://academicworks.cuny.edu/cgi/viewcontent.cgi?article=1322&amp;context=cc_pubs\">collection of</a> “work-related depressive symptoms.”</p><p dir=\"ltr\"><em>[<a href=\"https://www.theatlantic.com/health/archive/2019/05/work-life-balance/590662/?utm_source=feed\">Read: Give up on work-life balance</a>]</em></p><p dir=\"ltr\">Bianchi told me via email that understanding the similarities between burnout and depression is important because if people identify as merely burned out, rather than clinically depressed, they might delay seeking help. He laid out a way to determine whether work stress will lead to burnout-like depression. “The key question is: When something bad happens to you, is there something you can do to resolve the problem, surmount the difficulty, neutralize the stressor at stake? If yes, depressive symptoms are not to be expected,” he said. “But if there is nothing you can do, no effective action you can take, no way out, you will feel sentenced to passively endure the negative effects that these problems/difficulties/stressors have on you. This is when stress starts threatening your psychological and physical health.” These days, many people feel like they must “passively endure” one of the most stressful situations they’ve ever encountered.</p><figure><img alt=\"A woman rubs her eye\" height=\"758\" src=\"https://cdn.theatlantic.com/media/img/posts/2021/03/traff_01_2A_1/12153a8e3.jpg\" width=\"640\">\n<figcaption class=\"credit\">Thea Traff</figcaption>\n</figure><p class=\"dropcap\">I<span class=\"smallcaps\">t’s sometimes tempting</span> to try to fix burnout by looking at the burnee. High-achieving workers on the verge of burnout might beat themselves up for not making time to meditate or exercise or pre-slice all their vegetables over the weekend. Many <a href=\"https://www.everydayhealth.com/coronavirus/how-to-not-let-pandemic-fatigue-turn-into-pandemic-burnout/\">online guides</a> to curing burnout emphasize “self-care” strategies, such as creating a daily routine or seeing a therapist.</p><p dir=\"ltr\">In fact, most American organizational researchers, including Maslach, would say that the problem is not with the burned out, but with what burned them. That is, their job. “I get calls from different people: ‘How can we diagnose who’s got burnout in our organization?’” Maslach told me. “And it’s kind of like, If we could just either fix those people or get rid of those people, then we’d have no problems.”</p><p dir=\"ltr\">If burnout pervades an organization, “it’s telling you there’s a toxic environment here, that it’s not a really healthy place to be,” Maslach said. Right now, for example, bosses might be urging workers to “do more with less,” or causing workers to worry that they’ll be laid off, or asking them not to let their children appear in their <a href=\"https://www.yahoo.com/lifestyle/having-kids-zoom-fine-mom-190333481.html\">Zoom calls</a>. Maslach resists combining burnout and depression into one category precisely because doing so implies that the problem lies with workers—that all they need is a little Lexapro to become okay with whatever their employer throws at them. “The phrase ‘If you can’t take the heat, get out of the kitchen’—it’s sort of saying: The kitchen is what it is, and you’re going to have to figure out how to deal with it,” she told me. “Without ever saying, really, <em>Does the kitchen have to be that hot?</em>”</p><p dir=\"ltr\">Some employers have introduced <a href=\"https://hrdailyadvisor.blr.com/2020/03/02/mindfulness-training-in-the-workplace/\">virtual mindfulness trainings</a> and Zoom <a href=\"https://www.purewow.com/money/cool-pandemic-work-perks\">yoga classes</a> during the pandemic, even as their expectations for employee productivity remain basically unchanged. A McKinsey study published in <a href=\"https://www.mckinsey.com/featured-insights/diversity-and-inclusion/women-in-the-workplace\">September noted</a> that many companies had “expanded services related to mental health, such as counseling and enrichment programs,” but that fewer had “taken steps to adjust the norms and expectations that are most likely responsible for employee stress and burnout.”</p><p dir=\"ltr\">Although practices such as yoga and meditation can be beneficial, workers have to feel like it’s okay to take an hour out of their day to do them. “If you, as an individual employee, want to take a mental-health day, but the culture of the organization is not supportive of that, and there’s fear of retribution or backlash, then it’s hard for an individual employee to exercise that benefit,” Nicole Mason, the president of the Institute for Women’s Policy Research, says. Yoga hour is great, she adds, but child-care credits and flexible or reduced working hours would be even better.</p><p dir=\"ltr\">These new virtual seminars are similar to the <a href=\"https://www.theatlantic.com/health/archive/2020/01/uhauls-nicotine-workplace-wellness/604420/?utm_source=feed\">workplace wellness</a> programs that companies promoted before the pandemic. “The assumption of this and similar programs is that if you improve people’s knowledge about nutrition and exercise,” Pfeffer, the Stanford professor, writes in his book, “these interventions will be sufficient to get behavioral change. The problem is that employers seldom consider the workplace itself and what occurs there as important causal factors affecting individual behavior.”</p><p dir=\"ltr\">Instead of providing stress-reduction workshops, Pfeffer told me via email, “employers should reorganize the work environment to, as much as possible, prevent stress. We have come to see stress and burnout as some inevitable condition of work—but they are not. We can design jobs and work environments to reduce them, and then we would not need to try and remedy the problems work causes in the first place.”</p><p dir=\"ltr\">After all, burnout did not start with the pandemic. Research <a href=\"https://onlinelibrary.wiley.com/doi/pdf/10.1111/joim.12752\">shows</a> that the majority of physicians have been burned out for years. In one 2014 study, more than a quarter of Americans <a href=\"https://www.nber.org/system/files/working_papers/w20449/w20449.pdf\">reported working</a> between 10 p.m. and 6 a.m., a greater proportion than in any other country in the analysis. For his book, which was published in 2018, Pfeffer interviewed an executive coach who said that almost all of her clients work a 10-to-12-hour day, then work more between 8 p.m. and midnight, and also work at least one weekend day. A quarter of U.S. adults have been threatened with firing for taking time off to recover from an illness or to care for a sick relative, a <a href=\"https://www.bbc.com/news/world-us-canada-37353742\">2014 survey found</a>. Mobile medical clinics roam around Silicon Valley because, as one medical-group executive <a href=\"https://fortune.com/2015/10/23/is-silicon-valley-bad-for-your-health/\">put it</a> to a <em>Fortune</em> reporter in 2015, “People are so freaking busy they can’t even imagine going out to the doctor.”</p><p dir=\"ltr\">The pandemic has only exacerbated burnout: Job expectations haven’t changed, even as workers try to avoid infection, look after their families, and stave off existential dread. O’Neill, the George Mason professor, <a href=\"https://hbr.org/podcast/2019/04/managing-burnout\">has found</a> that having “companionate love” at work—<a href=\"https://www.theatlantic.com/health/archive/2021/01/pandemic-goodbye-casual-friends/617839/?utm_source=feed\">close friends</a> you can commiserate and celebrate with—helps guard against burnout. But most American office workers have been separated from these support systems for nearly a year.</p><p dir=\"ltr\">On the <a href=\"https://hbr.org/podcast/2019/04/managing-burnout\">Women at Work</a> podcast, O’Neill <a href=\"https://hbr.org/podcast/2019/04/managing-burnout\">offered</a> tips to avoid burnout, such as getting more sleep, and reducing the time you spend on tasks you don’t like and increasing the time you spend on tasks you enjoy. If you find your colleagues annoying instead of refreshing, ask for an office “a little far away,” or ask if you can work from home more (once working conditions return to normal). But again, all of these changes are up to the employer. Your employer has to reduce your hours so that you can get more sleep or give you permission to work from home. Your employer has to approve your decision to do less of the things you hate.</p><p dir=\"ltr\">Managers could be part of the solution too. Companies could try hiring more of them. In his book, Pfeffer points out that positive reinforcement tends to be important to workers, but that “companies run very lean in terms of the number of managers, which makes providing any sort of positive feedback and social support difficult because people are too busy to take care of others.”</p><p dir=\"ltr\">Not everyone’s job can instantly become more easygoing right now. Many doctors and nurses feel burned out because of the sheer volume of COVID-19 patients they are treating. However, much of doctors’ burnout comes from the hours they have to spend creating and updating electronic medical records—yet another thing their employers determine.</p><p dir=\"ltr\">Where employers are unable or unwilling to give people a break, the government could step in. Unfortunately, it has failed to do that. As meatpacking workers began dying at the beginning of the pandemic, the Trump administration allowed plants to <a href=\"https://www.washingtonpost.com/politics/trump-chicken-covid-coronavirus-biden/2021/01/03/ea8902b0-3a39-11eb-98c4-25dc9f4987e8_story.html\">increase their line speeds</a>, making it harder for workers to socially distance. Many states <a href=\"https://www.aarp.org/health/healthy-living/info-2020/states-mask-mandates-coronavirus.html\">still don’t have</a> a mask mandate, putting frontline workers at risk. The federal government does not require that private-sector employers provide paid sick leave or family leave. The COVID-19 stimulus package President Joe Biden signed into law yesterday <a href=\"https://news.bloomberglaw.com/daily-labor-report/paid-leave-inches-ahead-in-states-as-congress-avoids-a-mandate\">includes tax credits</a> for certain employers who choose to offer paid sick leave, but no requirement that they do so. If you get sick, need to quarantine, or need to take care of your family members, “right now you are at the whim of your employer,” says Vicki Shabo, a senior fellow on paid-leave policy at the think tank New America.</p><p dir=\"ltr\">Some of these stressors will end with the pandemic, but even then, the cratered economy will create a difficult environment for workers. Even after they’re vaccinated, Americans are still likely to face burnout. <a href=\"https://www.ted.com/talks/worklife_with_adam_grant_burnout_is_everyone_s_problem/transcript?language=en\">On his podcast</a>, Grant, the psychologist, summarized the keys to preventing burnout as “demand, control, and support”: Place fewer demands on people, give them more control over how to handle those demands, and provide support to handle them. All three are within your boss’s power.</p>",
  "author": {
    "name": "Olga Khazan",
    "uri": "http://www.theatlantic.com/author/olga-khazan/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Thea Traff"
  },
  "title": "Only Your Boss Can Cure Your Burnout",
  "published": "2021-03-12T08:00:00-05:00",
  "updated": "2022-02-15T17:32:56-05:00",
  "summary": "People refer to various forms of malaise as “burnout,” but it’s technically a work problem. And only your employer can solve it.",
  "link": ""
}