{
  "title": "Swedish Engineer Creates Playable Accordion From 2 Commodore 64 Computers",
  "link": "https://hardware.slashdot.org/story/22/11/04/224258/swedish-engineer-creates-playable-accordion-from-2-commodore-64-computers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "An anonymous reader quotes a report from Ars Technica: In late October, a Swedish software engineer named Linus Akesson unveiled a playable accordion -- called \"The Commodordion\" -- he crafted out of two vintage Commodore 64 computers connected with a bellows made of floppy disks taped together. A demo of the hack debuted in an 11-minute YouTube video where Akesson plays a Scott Joplin ragtime song and details the instrument's creation.\n \nA fair amount of custom software engineering and hardware hackery went into making the Commodordion possible, as Akesson lays out in a post on his website. It builds off of earlier projects (that he says were intentionally leading up to this one), such as the Sixtyforgan (a C64 with spring reverb and a chromatic accordion key layout) and Qwertuoso, a program that allows live playing of the C64's famous SID sound chip.\n \nSo how does the Commodordion work? Akesson wired up a custom power supply, and when he flips the unit on, both Commodore 64 machines boot (no display necessary). Next, he loads custom music software he wrote from a Commodore Datasette emulator board into each machine. A custom mixer circuit board brings together the audio signals from the two units and measures input from the bellows to control the volume level of the sound output. The bellows, composed of many 5.25-inch floppy disks cut and taped into shape, emit air through a hole when squeezed. A microphone mounted just outside that hole translates the noise it hears into an audio envelope that manipulates the sound output to match. The Commodordion itself does not have speakers but instead outputs its electronic audio through a jack.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Swedish+Engineer+Creates+Playable+Accordion+From+2+Commodore+64+Computers%3A+https%3A%2F%2Fbit.ly%2F3FHhFYR\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F22%2F11%2F04%2F224258%2Fswedish-engineer-creates-playable-accordion-from-2-commodore-64-computers%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://hardware.slashdot.org/story/22/11/04/224258/swedish-engineer-creates-playable-accordion-from-2-commodore-64-computers?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22334507&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "BeauHD",
  "dc:date": "2022-11-05T03:30:00+00:00",
  "dc:subject": "music",
  "slash:department": "one-of-a-kind",
  "slash:section": "hardware",
  "slash:comments": 24,
  "slash:hit_parade": "24,23,23,22,5,5,4"
}