{
  "title": "Luna gains solid lead over Villanueva in sheriff's race, poll shows",
  "dc:creator": "Alene Tchekmedyian",
  "pubDate": "Thu, 3 Nov 2022 12:00:10 GMT",
  "link": "https://www.latimes.com/politics/story/2022-11-03/luna-maintains-solid-lead-over-villanueva-in-sheriffs-race-poll-shows",
  "guid": "https://www.latimes.com/politics/story/2022-11-03/luna-maintains-solid-lead-over-villanueva-in-sheriffs-race-poll-shows",
  "description": "<p>Retired Long Beach Police Chief Robert Luna has gained support among likely voters in the race for Los Angeles County sheriff as he holds a solid lead over incumbent Alex Villanueva, according to a new poll.</p>",
  "content:encoded": "<p>Retired Long Beach Police Chief Robert Luna has gained support among likely voters in the race for Los Angeles County sheriff as he holds a solid lead over incumbent Alex Villanueva, according to a new poll.</p>",
  "media:content": {
    "media:description": "Los Angeles, CA - September 21: Retired Long Beach Police Chief Robert Luna, left, and Los Angeles Sheriff Alex Villanueva debate during the Los Angeles County Sheriff debate ahead of the Nov. 8 general election at the Skirball Cultural Center in Los Angeles, {on {wdat}. The Los Angeles Times, Fox 11 LA, Univision 34, KPCC, the Skirball Cultural Center, the Los Angeles Urban League and Loyola Marymount University co-host back-to-back debates with the leading candidates in the L.A. mayoral and L.A. County Sheriff races. The mayoral debate will feature top candidates Rep. Karen Bass and developer Rick Caruso; the Los Angeles County Sheriff debate will include Sheriff Alex Villanueva and retired Long Beach Police Chief Robert Luna. The evening aims to be informative for Angelenos ahead of the Nov. 8 general election, which will include the runoff for the next mayor and sheriff. The debates will be co-moderated by Times Columnist Erika D. Smith and Fox 11 News Anchor Elex Michaelson. Additionally, Univision morning news anchor Gabriela Teissier will join the moderators during the mayoral debate, and Univision evening news anchor Oswaldo Borraez will join the moderators during the sheriff candidates debate. KPCC criminal justice correspondent Frank Stoltze will contribute as well. (Allen J. Schaben / Los Angeles Times)",
    "media:credit": "Allen J. Schaben/Los Angeles Times"
  }
}