{
  "title": "MoneySmart to list on SGX via a US$161.7M reverse takeover deal with APS",
  "link": "https://e27.co/moneysmart-to-list-on-sgx-via-a-us161-7m-reverse-takeover-deal-with-aps-20221104/",
  "dc:creator": "Sainul",
  "pubDate": "Fri, 04 Nov 2022 08:49:27 +0000",
  "category": [
    "Fintech",
    "Investments",
    "Singapore",
    "Golden Gate Ventures",
    "MoneySmart",
    "SPH Media Fund",
    "The MoneySmart Group"
  ],
  "guid": "https://e27.co/?p=475739",
  "description": "<p>The MoneySmart Group, which operates financial content and comparison platforms in Singapore and Hong Kong, plans to list on the Singapore Stock Exchange (SGX) via a reverse takeover deal with hotel operator Asia Pacific Strategic Investments (APS). According to a press release, the deal is worth US$161.7 million. The purchase consideration will be satisfied by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/moneysmart-to-list-on-sgx-via-a-us161-7m-reverse-takeover-deal-with-aps-20221104/\">MoneySmart to list on SGX via a US$161.7M reverse takeover deal with APS</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_120502\" style=\"width: 702px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-120502\" class=\"wp-image-120502 size-full\" src=\"https://e27.co/wp-content/uploads/2015/10/Vinod-Nair-Founder-and-CEO-of-MoneySmart1.jpg\" alt=\"MoneySmart Group Founder and CEO Vinod Nair\" width=\"692\" height=\"390\" /><p id=\"caption-attachment-120502\" class=\"wp-caption-text\">MoneySmart Group Founder and CEO Vinod Nair</p></div>\n<p>The MoneySmart Group, which operates financial content and comparison platforms in Singapore and Hong Kong, plans to list on the Singapore Stock Exchange (SGX) via a reverse takeover deal with hotel operator Asia Pacific Strategic Investments (APS).</p>\n<p>According to a press release, the deal is worth US$161.7 million.</p>\n<p>The purchase consideration will be satisfied by the issuance of new ordinary shares in Asia-Pacific Strategic Investments, which will collectively represent 80 per cent of the company&#8217;s enlarged share capital upon the expected completion of the acquisition and a listing within H1 2023.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-did-moneysmart-bag-a-25-per-cent-increase-in-revenue-during-a-pandemic-20210629/\">How did MoneySmart grow its revenue by 25 per cent amidst a pandemic?</a></strong></p>\n<p>Hotel operator APS has been in talks for a reverse takeover of the MoneySmart personal finance portal.</p>\n<p>The listing on the SGX will help 13-year-old MoneySmart to raise capital for its strategic plans in Singapore and the region.</p>\n<p>With the capital, MoneySmart anticipates rapid growth through investments in its membership and rewards programmes. In addition, it will also power other strategic partnerships through potential M&As.</p>\n<p>The MoneySmart Group will also invest significantly in its new insurance brand Bubblegum. Launched earlier this year with car and travel insurance, Bubblegum aims to redefine the insurance experience for all customers.</p>\n<p>Founded in 2009, MoneySmart Group operates financial content and comparison platforms in Singapore and Hong Kong. It provides aggregation, comparison, and financial advisory services for mortgage and insurance products to help customers make the best decisions with their money (loans, insurance or credit cards). MoneySmart also provides readers tips, tricks, news, reviews and commentary on money.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/moneysmart-launches-app-that-helps-you-to-find-the-best-credit-card-deals-20160418/\" rel=\"follow\">Don’t know which credit card to use for a bill? MoneySmart’s new app has the answer</a></strong></p>\n<p>In 2017, MoneySmart raised S$14 million (then US$10 million) in a Series B round led by <a rel=\"follow\" href=\"http://kakaku.com/\" rel=\"follow\">Kakaku.com,</a> a Japanese online service provider. Existing investors SPH Media Fund and Golden Gate Ventures also participated.</p>\n<p>&#8212;</p>\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/moneysmart-to-list-on-sgx-via-a-us161-7m-reverse-takeover-deal-with-aps-20221104/\">MoneySmart to list on SGX via a US$161.7M reverse takeover deal with APS</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}