{
  "title": "Coronavirus Market Crash &#8211; Is This Time Different?",
  "link": "https://www.madfientist.com/coronavirus-market-crash/",
  "comments": "https://www.madfientist.com/coronavirus-market-crash/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Mon, 16 Mar 2020 17:25:00 +0000",
  "category": [
    "Interviews",
    "Investing"
  ],
  "guid": "http://www.madfientist.com/?p=6614",
  "description": "<p class=\"lead\">The COVID-19 coronavirus pandemic has caused stocks to crash.  Is this a normal bear market or is it different this time?  JL Collins is here with his answer.</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/coronavirus-market-crash/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/coronavirus-market-crash/\">Coronavirus Market Crash &#8211; Is This Time Different?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>Bear markets are a normal part of investing but is this time different?</p>\n\n\n\n<p>As the coronavirus COVID-19 spreads around the world, governments are struggling to limit the economic impact of the disease.</p>\n\n\n\n<p>In today&#8217;s unplanned episode of the Financial Independence Podcast, JL Collins (author of <a rel=\"nofollow  noopener\" aria-label=\"Simple Path to Wealth (opens in a new tab)\" href=\"http://amzn.to/33r07uL?tag=madfientist-20\" target=\"_blank\">The Simple Path to Wealth</a>) joins me to talk about this stock-market crash, how it differs from previous crashes, and what you should do about it.</p>\n\n\n\n<p><em>Note: Apologies for the audio quality of this episode.  Since this wasn&#8217;t planned in advance, I didn&#8217;t have my normal microphone so I had to use the microphone on my iPhone headphones :/</em></p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-6614-10\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"http://traffic.libsyn.com/madfientist/coronavirus-market-crash.mp3?_=10\" /><a href=\"http://traffic.libsyn.com/madfientist/coronavirus-market-crash.mp3\">http://traffic.libsyn.com/madfientist/coronavirus-market-crash.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='http://traffic.libsyn.com/madfientist/coronavirus-market-crash.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul><li><a href=\"https://jlcollinsnh.com\" target=\"_blank\" rel=\"noopener\" aria-label=\" (opens in a new tab)\">JLCollinsNH</a></li><li><a href=\"https://amzn.to/33r07uL?tag=madfientist-20\" target=\"_blank\" rel=\"nofollow  noopener\" aria-label=\"The Simple Path to Wealth (opens in a new tab)\">The Simple Path to Wealth</a></li><li><a href=\"https://jlcollinsnh.com/2012/04/15/stocks-part-1-theres-a-major-market-crash-coming-and-dr-lo-cant-save-you/\" target=\"_blank\" rel=\"noopener\" aria-label=\" (opens in a new tab)\">There’s a major market crash coming!</a></li><li><a href=\"https://jlcollinsnh.com/2017/07/26/time-machine-and-the-future-returns-for-stocks/\" target=\"_blank\" rel=\"noopener\" aria-label=\" (opens in a new tab)\">Time Machine and the future returns for stocks</a></li><li><a href=\"https://jlcollinsnh.com/2018/03/16/stocks-part-xxxii-why-you-should-not-be-in-the-stock-market/\" target=\"_blank\" rel=\"noopener\" aria-label=\" (opens in a new tab)\">Why you should not be in the stock market</a></li></ul>\n\n\n\n<h2>Full Transcript</h2>\n\n\n\n<div class=\"transcript\">\n<strong>Mad Fientist:</strong> Hey, what&#8217;s up everybody? It&#8217;s the Mad Fientist. Welcome to the Financial Independence Podcast, the podcast where I get inside the brains of the best and brightest in personal finance to find out how they achieved financial independence. I&#8217;m not doing that today though, because I&#8217;ve already had this guest on twice before. The first time, way back in October of 2012. And then the second time was June of 2016 so this is his four year invite back onto the show. It is none other than JL Collins himself. Welcome.\n<br/><br/>\n<strong>JL Collins:</strong> Thank you, Brandon. It&#8217;s a, it&#8217;s an honor to be here. I&#8217;m a little sorry that it took a bear market to make it happen, but it&#8217;s always a pleasure to talk to you.\n<br/><br/>\n<strong>Mad Fientist:</strong> You know what? We&#8217;ve been doing this for a while, so my blog started way back in early 2012 I think yours was way back in 2011 and to be honest, I&#8217;m surprised it took this long to experience a crash like we&#8217;re experiencing now. Is it the same for you?\n<br/><br/>\n<strong>JL Collins:</strong> Yeah, I would say exactly. You know, we had obviously the, I started my blog in 2011 as you point out, and few years before that, we had the big meltdown in 07/08 and since then the market&#8217;s done almost nothing but relentlessly go up with a couple of 10% corrections scattered over the years, and in December of 2018, there was a bear market.\n<br/><br/>\nBear markets are technically defined as a 20% plus drop. That happened right around Christmas, but it recovered so quickly that I don&#8217;t think most people even remember it. But other than that, this is the one everybody&#8217;s been expecting or should have been expecting.\n<br/><br/>\n<strong>Mad Fientist:</strong> But I don&#8217;t think anyone would have predicted how it actually came about with the coronavirus and the global pandemic. And, I just wanted to say thanks for coming on the show. This is a very last-minute podcast. I emailed you and you responded, and now we&#8217;re talking, and I&#8217;m talking on an iPhone headphones microphone. So apologies for the bad sound quality on my end, but this was something I thought would be better to get out as soon as possible. So thanks for not only joining me but doing it so quickly.\n<br/><br/>\n<strong>JL Collins:</strong> Well, we&#8217;re nomadic these days, you know, so I&#8217;m doing this without any headphone or microphone at all, just sitting in the hotel room, in front of my laptop. But I want to address a comment you made just a moment ago and that nobody would have expected that the coronavirus or, or something like it would be what finally triggered a bear market.\n<br/><br/>\nBut that&#8217;s always true of bear markets. I mean, the things that trigger them are always a surprise. \n<br/><br/>\n<strong>Mad Fientist:</strong> And that&#8217;s it. That&#8217;s exactly what I wanted to get you on the show for it because every time it happens, it feels like this time is different and that&#8217;s what makes these things so scary for investors. That&#8217;s what makes it hard to do what you had planned to do the next time stocks pulled back and it&#8217;s because it always feels like this time is different. \n<br/><br/>\nDo you feel like all the other ones that you&#8217;ve lived through and invested through in the past have always felt like this time is different?\n<br/><br/>\n<strong>JL Collins:</strong> Well, yes, absolutely. Every time there&#8217;s a bear market, it has the feeling that it&#8217;s something major and it&#8217;s something different and it&#8217;s terrifying. And almost, if you think about it, that&#8217;s by definition, because if it were not those things, there would not be a bear market. \nYou know, if people didn&#8217;t feel that way, if people weren&#8217;t scared, they wouldn&#8217;t be panicking.\nAnd if they weren&#8217;t panicking, they wouldn&#8217;t be selling off their stocks. And by the way, creating a great buying opportunity for more level headed people. So by definition, every time there&#8217;s a bear market or a market crash, it&#8217;s something that feels different, feels scary, and feels like it&#8217;s never going to end.\nBut it will.\n<br/><br/>\nAnd by the way&#8230;If someday I&#8217;m wrong about that, then where you&#8217;re invested will be the least of our problems. So let&#8217;s think about the coronavirus in those terms, right? If the coronavirus turns out to be the new black death and it kills 60% of the population, then yeah, it&#8217;s probably going to be a long time before the stock market recovers.\n<br/><br/>\nIs that likely to happen? I don&#8217;t think so. There&#8217;s nothing we can do about it if it does happen that we being the average person on the street. What&#8217;s more likely, and not the least of for reasons that are, that we now have an understanding of the germ theory of disease as an example.\n<br/><br/>\nWe understand basic hygiene, which they didn&#8217;t the 1300/1400s, so it&#8217;s unlikely to be something like that. And if it&#8217;s something that runs it, it&#8217;s course, as past epidemics have that scared the market and scared people in general. Then it&#8217;ll run its course over whatever period of time that takes and the market will recover.\n<br/><br/>\n<strong>Mad Fientist:</strong> Yeah. I just saw a quote on Twitter, Michael Batnick put it up there and, it was in the analogy. If you own a hotel by the beach and there&#8217;s a big hurricane coming, you&#8217;re probably going to shut down the hotel for a few days, and you&#8217;re going to not obviously profit during those days, but when you open back up again, you still have the same business, you still have the same employees and profitability and all those sorts of things.\n<br/><br/>\nAnd this is sorta like this in a way, but obviously, we don&#8217;t know how big the storm is. And I think maybe that&#8217;s where a lot of the fear is coming from. Because if this is a year-long storm, then maybe that hotel doesn&#8217;t have the cash reserves to keep the building and keep servicing the mortgage on that building. Obviously, the employees are going to be laid off for a lot longer than they can handle and things like that. So it seems like that&#8217;s maybe a huge reason that there&#8217;s so much fear in the markets because we don&#8217;t really know how to fix it. \n<br/><br/>\n<strong>JL Collins:</strong> Now there&#8217;s a lot of uncertainty, and again, that&#8217;s the definition of a bear market. That&#8217;s what triggers a bear market. If you didn&#8217;t have that uncertainty, if you didn&#8217;t have some scary thing, then there wouldn&#8217;t be a bear market. My most recent post on the blog there, I have a reader named Gino, and he put up a great line.\n<br/><br/>\nHe said we&#8217;re compensated with higher rates of return in stocks because of ugly times like this.\n<br/><br/> \nAnd he&#8217;s exactly right. If the stocks, if, if the stock market was always smooth sailing, then, we wouldn&#8217;t be compensated with the higher returns that you get over bonds. And I think your analogy of a hurricane and that hotel is a really good one because if you have a hotel in a place where hurricanes happen, then you better be prepared for when they happen, even if they&#8217;re severe so that they don&#8217;t drive you out of business. And if you don&#8217;t do that preparation, then the hurricane can easily drive you out of business. If you do the preparation, then you&#8217;re going to be able to hang on and the time to do that preparation is not in the middle of the hurricane, which is where we are now.\n<br/><br/>\nI wrote a post in 2018 when everything was going swimmingly and the market seemed like it was never going to have a pullback called, Why You Should Not be in the Stock Market. That&#8217;s the time to think about whether or not you should be in the stock market. Now is not time. And if you live in a place where hurricanes are an annual event, then you need to expect hurricanes.\n<br/><br/>\nIf you invest in the stock market and you want those outsized returns that the market provides, you need to understand that bear markets are, are part of the landscape, and you should never be surprised by them, any more than if you live in northern New England, you should be surprised by blizzards or if you live in Southern Florida, you should be surprised by hurricanes. It&#8217;s, it&#8217;s part of the territory.\n<br/><br/>\n<strong>Mad Fientist:</strong> Absolutely. And to go back to the reader&#8217;s point that yeah, this is like the cost of entry. This is the cost of your admission ticket to those outsize gains is that you have to put up with times like these where it&#8217;s scary and you&#8217;re losing a big percentage of your net worth. I also think it could be potentially, if you&#8217;re paying, you have to pay that admission ticket anyway you might as well try to learn something from the process. Because in 2018, reading that post and thinking, Oh, you know, I&#8217;m going to be able to handle the next thing and it&#8217;s going to be easy because I know that I just keep investing and yeah, maybe my 100% stock portfolio is a bit on the riskier side, but I know that I don&#8217;t need that money for 30 years so I&#8217;ll be sensible when it happens. And for a lot of our readers and listeners, we&#8217;ve been doing this since 2011 /2012, there hasn&#8217;t been a scary time like this, so going through it is quite a lot different than thinking about going through it.\nDo you agree? And if so, what? What should people thinking be thinking about now to try to learn from this experience and maybe make adjustments when we get out of the other end of this so that the next one is easier to handle.\n<br/><br/>\n<strong>JL Collins:</strong> So, you know, it&#8217;s one of the things that I&#8217;ve wondered over the years, and I&#8217;ve, as you point out, I&#8217;ve been writing my blog since 2011 and this is really the first storm that, we&#8217;ve had in that time. One of the things that I&#8217;ve wondered is whether people could read what I&#8217;ve written about&#8230;needing to expect bear markets, needing to assess their own risk tolerance beforehand, understanding that these are normal events that you have to expect them, that they should never surprise you. I&#8217;ve often wondered if you can absorb that just by reading it or if you have to live through it and make the mistake, maybe by panicking and selling at the bottom to really appreciate it.\n<br/><br/>\nI know I had to make the mistake in 87 of losing my nerve and selling at the bottom. And it&#8217;s interesting, and this is by no means scientific, but if I look at the comments that I&#8217;ve gotten on my last couple of posts. Since this bear market began, they run about two thirds to one third, two-thirds of my commenters are saying, yes, I knew this was coming and cause I read your stock series, I read your book, I understand that bear markets are normal and, and I&#8217;m sleeping like a baby. It&#8217;s not bothering me. And about one third are panicked and saying, should I sell now and get back in when it goes lower?\n<br/><br/>\nYou know, nobody knows. We&#8217;re recording this on Sunday. Last Friday, the market was up 10%, the Thursday, the day before, was down 10% roughly. Nobody knows what Monday&#8217;s going to bring. And anybody who tells you they know, they&#8217;re just guessing. And. If they&#8217;re right, they just got lucky. You can&#8217;t time the market\nSo, based on the comments, I&#8217;m getting about two-thirds of the people, really have absorbed the message and understand what to do and, and what the real situation is. And another third, I think, didn&#8217;t really understand themselves as thoroughly as they might have their own risk tolerance.\n<br/><br/>\nMaybe they didn&#8217;t read my stuff or other stuff on this subject as closely as they should have, but, and maybe they&#8217;ll have to live through it and sell out at the bottom and, and, watch it, recover without them, to learn the lesson. That&#8217;s, that&#8217;s what I had to do in 87.\n<br/><br/>\n<strong>Mad Fientist:</strong> Yeah. So let&#8217;s talk about 87, because I was not invested back then. I was five at the time, so I wasn&#8217;t thinking about any of this stuff, but,\n<br/><br/>\n<strong>JL Collins:</strong> Wait you? You were five years old. You still weren&#8217;t invested?\n<br/><br/>\n<strong>Mad Fientist:</strong> I wasn&#8217;t.\n<br/><br/>\nI think my dad bought me my first four shares when I was 10, so I was halfway there. But yeah, so talk about that. What was that one like and why did that one feel different and what did you do wrong at that stage.\n<br/><br/>\n<strong>JL Collins:</strong> Well, so 1987, it&#8217;s testing my memory a little bit, &#8217;cause that is a long time ago. But, what I do remember clearly was black Monday, which&#8230; It&#8217;s still to this day, even given the great depression, even given 07/08, even given the drops that we&#8217;ve had now, was the single biggest percentage drop in market history in a day.\n<br/><br/>\nAnd it was 23/24%, as I recall, in one day. And this is in the days, by the way, this is obviously before the internet, before the widespread use of, of computers even then it was in those days I, I had a stockbroker as everybody did and I had a job and I was working and I didn&#8217;t know the market had crashed.\n<br/><br/>\nAnd at the end of the day, I forget why, I called Wayne, who was my stockbroker, but it wasn&#8217;t because of anything going on in the market, cause I didn&#8217;t know and I called him at the end of the day and, he and I were kind of friends too, and I says, how&#8217;s it going, man? And there&#8217;s this long pause at the end of the phone.\n<br/><br/>\nHe&#8217;s like, you&#8217;re joking, right? And I could tell from the tone of his voice something bad had happened. I said, no, what? What&#8217;s going on? He said Jim, we just had the biggest meltdown in history, and you know, I&#8217;ve had people calling me in panic all day and that&#8217;s how I first found out.\n<br/><br/>\nAnd then after that, that black Monday, that big drop, the market continued to grind down. Slowly, but further and further and further down, and at the time I knew all the principals we&#8217;re talking about. It&#8217;s not like I hadn&#8217;t heard this stuff. I knew what I should do. I knew I should stay the course. I knew that it was temporary. I knew that the market would recover. And a couple of months later along by December, I lost my nerve and I sold and I went to cash. And if I didn&#8217;t sell at the exact bottom, it was close enough not to matter. And of course, then the market, as it always does, began its relentless rise again and I watched it and I couldn&#8217;t believe it, and I kept expecting it to fall back to where I could buy it lower than what I sold it at. And of course, that never happened in by the time I got back in, it recaptured all of its losses and posted gains. I never forgot that lesson. And that lesson is what sustained me in 07/08.\n<br/><br/>\nBecause that was a terrifying time. And I&#8217;m not sure that if I had not had the experience of 87, that I would&#8217;ve been able to stay the course in 08, not to mention the more minor problems that happened between those two events. But, you know, 08 was the big one.\n<br/><br/>\nI&#8217;m not sure I had the fortitude to stick through it, which is why I hope that my writings provide people what they need so they don&#8217;t have to go through that experience. But I don&#8217;t know that that&#8217;s the case.\n<br/><br/>\n<strong>Mad Fientist:</strong> Yeah, so I&#8217;m even struggling with something now. So I was invested in, 08. And I saw my net worth get chopped in half. And I luckily didn&#8217;t sell. And I was like, well, this is a good sign. You know, I don&#8217;t have to worry about myself panicking. So, I can handle a high percentage of stocks in my portfolio because I&#8217;ve tested myself in 07/08 and I succeeded and didn&#8217;t do anything silly.\n<br/><br/>\nOne thing that I did do was I had cash at the time that I needed to deploy cause we had sold a house in Scotland. And we had invested half of it in Scotland before we left, but then we had the other half in the States and I was slowly investing it and this was as the market was tanking and I put a big chunk in and then it tanked a little bit more.\n<br/><br/>\nAnd then I put a smaller chunk in because I had less money left and it tanked more. Put a little bit less in again and then it really tanked. And anyway, long story short, I didn&#8217;t get all of the cash in because I was trying to time the bottom, so I thought I learned my lesson back then, but then here we are now and I realized that I actually need stricter systems, and I&#8217;m writing a post about this that I hopefully will get out this week as well after this podcast goes out.\n<br/><br/>\nBut, I realized that I need stricter systems because my tendencies come back to haunt me in times when I think I know better, like, oh, I think, I think it&#8217;s going to go down more, so I&#8217;m just going to wait, which was the same trap I fell into back in 2008. So is there anything that you&#8217;ve learned in subsequent crashes that you found useful, to handle future ones?\n<br/><br/>\nOr is there anything that people can do in a time like this, like diary about their feelings and their emotions and their thoughts about where they think the markets are going, or anything like that that you would recommend to listeners out there that maybe this is their first one they&#8217;re going through.\n<br/><br/>\n<strong>JL Collins:</strong> Well, I, you know, the very first post in my stock series is titled there&#8217;s a major, major market crash coming. And the gist of that post is you need to toughen up, cupcake and deal with it, ride through it. And then in other parts of the stock series, and in the book, I talk about there&#8217;s two financial phases in your life, broadly speaking. One is when you&#8217;re building your wealth and you&#8217;re working, and you have earned income which provides cash flow, and if you&#8217;re, if you&#8217;re interested in becoming financially independent, you are living on less than you&#8217;re earning and you&#8217;re taking part of those earnings, that cash flow and you&#8217;re investing it, and ideally, you&#8217;re investing it in a total stock market fund or an S&#038;P 500 fund and you&#8217;re holding it forever. Now. The fact that you have that cash flow going in on a regular basis smooths the ride for you and it allows you to take advantage of times like this.\n<br/><br/>\nAnd so I would say especially to those people, those younger people who are working on building their wealth, a bear market like this one is a huge gift. In fact, the best thing that can happen to you when you&#8217;re building your wealth and investing is that you get to buy shares on sale, which is what&#8217;s going on now.\n<br/><br/>\nSo certainly those people should keep investing just as they were before. This is a great time to buy stocks on sale. Now the other side of that coin is when you&#8217;re in what I call the wealth preservation stage, which is when you&#8217;re living on the portfolio, and that&#8217;s the time when you introduce bonds because you no longer have that earned income cashflow to smooth the ride so you need something else, and that&#8217;s the role bonds can play and that&#8217;s when you get into your asset allocation. I have a post in the stock series about how to choose your asset allocation and what that allocation is between stocks and bonds is a very personal thing that depends on your own situation and your own tolerance for volatility.\n<br/><br/>\nBut once you have bonds in the mix, then when the market does something, dramatic, either dramatic on the upside or dramatic on the downside like we&#8217;re seeing now, your allocation gets out of whack and you adjust it. Right now, you&#8217;d be adjusting it by selling bonds and buying more stock to bring the stock part of it up.\n<br/><br/>\nWell, now that allows you to buy stock at a bargain price. And by the same time, when the market goes back up and now the percentage of bonds is lower than you intended it to be, you sell some of the stock and the bonds and, and you&#8217;re, you&#8217;re selling at the high. So that&#8217;s the way you deal with volatility rather than panicking and trying to figure out how to, how to time it.\n<br/><br/>\n<strong>Mad Fientist:</strong> It was only, I think, February 19th that we hit all-time highs and then it was Thursday of last week that we were 20% down.\n<br/><br/>\nI think that gives people a unique viewpoint of their temperament and how they handle risk. Because just a few weeks ago, you&#8217;re at that high greed stage where, you know, nothing could go wrong. I&#8217;m so intelligent. I&#8217;m making so much money in the markets and this is the allocation that I&#8217;m happy with.\n<br/><br/>\nAnd then only a few weeks later, now we&#8217;re in panic/fear mode and that&#8217;s sort of the reason why I&#8217;m writing this post that I hope to get out next week is this is a unique opportunity to sort of tap into both of those sides of your brain because they happen so quickly to then maybe make changes to that asset allocation that is so important.\n<br/><br/>\nDo you see this as an opportunity for that as well?\n<br/><br/>\n<strong>JL Collins:</strong> Sure. I think this is a great opportunity for self-reflection. I mean, again, I, ideally you would have, you would have read my post on why you should not be in the stock market in 2018, done the reflection then, understood yourself well enough to know what allocation into stocks works for you.\n<br/><br/>\nBut I would make a point that bear markets almost always happen very fast. There&#8217;s a saying on Wall Street that the stock market takes the stairs up and it takes the express elevator down. And so stocks tend to fall very fast and hard in a bear market and they tend to grind slowly up in bull markets.\n<br/><br/>\nSo there is nothing that unique about this one, might be a little faster than some in the past, but, but it&#8217;s still following the same pattern of, of these things happened pretty quickly. And then when they finally do hit bottom, and there&#8217;s no way to predict when that is, then suddenly, you know, a couple of months later, people are noticing, wow, you know, this is, this is going back up again.\n<br/><br/>\n<strong>Mad Fientist:</strong> And it&#8217;s hard to predict when that is, obviously because you see rallies like you did on Friday, like 10% up day. Does that mean we&#8217;re out of the, out of the woods? I don&#8217;t think so.\n<br/><br/>\n<strong>JL Collins:</strong> Right. You can&#8217;t, you can&#8217;t predict it at all. And the last two days of last week are a perfect example of that. Cause you go into Thursday and you&#8217;d say, well, it&#8217;s had a major collapse of almost 10% and the tendency is going to be so, Oh my goodness, Friday is going to be even worse, and then Friday recovers almost all of those losses in a single day.\n<br/><br/>\nThere&#8217;s no predictive value in that at all. I mean, at least not for me. I have no idea what&#8217;s going to happen on Monday. I&#8217;m sure that you&#8217;re seasoned enough that you don&#8217;t have any idea that you understand. You didn&#8217;t have any idea. Oh, what we could do, Brandon, is we could sit here and I could say, you know what Brandon, it&#8217;s going up on Monday and you could say, no, J L it&#8217;s going down on Monday. And one of us might be right.\n<br/><br/>\n<strong>Mad Fientist:</strong> I stopped predicting when you had your annual series about predicting what the market was going to end that. And I participated I think for two or three years, way back in 2012, 2013. And, I got it terribly wrong both times and then I gave up.\n<br/><br/>\n<strong>JL Collins:</strong> That was a lot of fun. For your listeners who might not be familiar, a few years ago, I did a stock-picking contest at the beginning of each year where gave readers an opportunity to weigh in and say what the high for the year was going to be, what the low for the year was going to be, and what the close was going to be. But the irony of that, of course, is I created it to illustrate in real-time how difficult timing the market is, and ironically, the first year I nailed it.\n<br/><br/>\nIt looked like I had great predictive abilities, and it&#8217;s like, I&#8217;m not making the point I wanted to make.\n<br/><br/>\nSubsequent years I proved that that was just a fluke of luck.\n<br/><br/>\n<strong>Mad Fientist:</strong> Yeah. Well, so going back to that beach analogy, actually, so as we&#8217;ve been talking, I was thinking, the problem with this hurricane is we don&#8217;t know how long it&#8217;s going to last and whether the hotel is going to have enough cash reserves to last.\n<br/><br/>\nBut that&#8217;s the point of diversifying and betting on all the companies in the market and buying a total stock market index fund because this will cause some of those hotels to not be able to survive but the ones that are left are hopefully the strongest of the bunch that are then going to go on and make even more money in the future potentially.\n<br/><br/>\n<strong>JL Collins:</strong> I think it is a good way of summing it up. And you&#8217;re pointing out that bear markets are actually a healthy, necessary part of the process. And this one is no different. The other thing that I would like our listeners to appreciate, and I wrote a post back in 2017, called time machine and the future return of stocks.\n<br/><br/>\nAnd basically, it was looking at the performance of the stock market from 1975, which happened to be the year that I started investing, to 2015/2016/2017, about 40 plus years, the market, on average, went up just shy of 12% a year. Which is an incredible performance. I mean, just absolutely incredible, and I would certainly not suggest to anybody listening that you can expect that going forward but the point of that post is I go through all of the traumas and problems that happened in those 40 years. This was not a perfect, smooth, golden period of time to be an investor, and yet the markets still performed. And so obviously we&#8217;re going to look back on, on this moment in time, and as, as there were many moments in time I point out in that post in those 40 years, as a difficult moment. But that doesn&#8217;t mean the market isn&#8217;t going to provide handsome returns over the next couple of decades.\n<br/><br/>\n<strong>Mad Fientist:</strong> Absolutely. Well, I will link to all those posts that you&#8217;ve mentioned in the show notes so people can go there and link over and check it out. Obviously, the Simple Path to Wealth is a great book to read in times like this, if you haven&#8217;t read it yet, so I&#8217;ll also link to that. Yeah, Jim, I really appreciate it.\nI knew you&#8217;d be a calming voice in a chaotic time. which hopefully will make people out there feel better if this is the first time that you&#8217;re going through that. \n<br/><br/>\nI usually ask all of my guests, what&#8217;s one piece of advice you give to somebody on the path to financial independence? And you&#8217;ve answered it twice before so if people want to hear your answer, they can go to madfientist.com/advice and I put together a PDF containing all the great answers I&#8217;ve received over the years. But today I&#8217;ll just ask you what, what&#8217;s one piece of advice you&#8217;d give to somebody out there that maybe is freaking out and maybe reading about getting punched in the face is a lot different than getting punched in the face and they&#8217;re struggling.\n<br/><br/>\nWhat&#8217;s one piece of advice you&#8217;d give them?\n<br/><br/>\n<strong>JL Collins:</strong> Well, you know, as, as we talked about earlier, that the time to figure out what your investing strategy is, what your risk tolerance is, what your allocation should be, is not in the middle of the hurricane, which is where we are now. It&#8217;s when the seas are calm. Obviously that&#8217;s hindsight. So I would say to anybody who&#8217;s panicking at the moment, don&#8217;t do anything.\n<br/><br/>\nUnderstand how you&#8217;re feeling and learn from the experience. And then when things are calm and the market has begun to turn around and began to go up again, then revisit your allocation and then make adjustments according to what you learned about yourself. Not what you learned about the market because the market&#8217;s doing what the market does.\nBear markets are part of the process, so there&#8217;s nothing unique in market behavior going on here. What you&#8217;re learning about is how you react to that behavior, what your behavior is, and, after the markets calm down and if you were too aggressive, before then, you could make adjustments then, but don&#8217;t do anything now.\n<br/><br/>\n<strong>Mad Fientist:</strong> Perfect. Thank you so much, Jim. Really appreciate it. And yeah, just hope everyone out there stays safe. Obviously, we don&#8217;t touch on any health stuff here, and that may seem cold and clinical to talk about money when everyone&#8217;s panicking and a lot of people are suffering, but this is what we do and it&#8217;s, it&#8217;s still an important part of life even though there&#8217;s other more important things going on.\n<br/><br/>\nSo everybody stay safe out there. Jim, have a great time traveling around and hopefully, you guys can still enjoy your nomadic life when things are getting locked down a little bit for the time being. And again, I really appreciate you coming on the show again.\n<br/><br/>\n<strong>JL Collins:</strong> Well. So far we&#8217;re enjoying it a lot. And I think that last point you made is critical. I think people should forget about your finances for the time being. Ride it out, take care of your health. Changing certain behaviors like shaking hands and what have you are much more important at this time.\n<br/><br/>\nTake care of your health and, and, your money will take care of itself.\n<br/><br/>\n<strong>Mad Fientist:</strong> Absolutely. Thanks, Jim. and I will hopefully speak to you again soon and hopefully I won&#8217;t leave it another four years to get them back on the show.\n<br/><br/>\n<strong>JL Collins:</strong> Well, thanks for the invitation. It&#8217;s always a pleasure hanging out with you and talking about this stuff.\n<br/><br/>\n<strong>Mad Fientist:</strong> All right, Jim, take care. I&#8217;ll speak to you soon.\n<br/><br/>\n<strong>JL Collins:</strong> You do the same.\n<br/><br/>\n<strong>Mad Fientist:</strong> Bye.  \n</div>\n\n\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/jl-collins-interview/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>JL Collins - The Simple Path to Wealth</h3><p class='post_card_excerpt'>JL Collins joins me on the Financial Independence Podcast to talk about stocks, bonds, real estate, and his brand new book - The Simple Path to Wealth!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2016/06/jlcollins-interview.png' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/coronavirus-market-crash/\">Coronavirus Market Crash &#8211; Is This Time Different?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/coronavirus-market-crash/feed/",
  "slash:comments": 48,
  "enclosure": ""
}