{
  "title": "Cotton, Slavery, and the New History of Capitalism with Alan Olmstead and Paul Rhode",
  "pubDate": "Fri, 20 Sep 2019 20:06:54 +0000",
  "guid": "18293fd46ae3491aba9f5537d4e31a54",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP133Olmstead-Rhode_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guests are economic historians Alan Olmstead and Paul Rhode. Both of them have research related to the slave economy of the Antebellum South. Our main topic is a paper they co-authored, <a href= \"https://www.sciencedirect.com/science/article/pii/S0014498317302292\" target=\"_blank\" rel=\"noopener\">Cotton, slavery, and the new history of capitalism</a>.</p> <blockquote>The \"New History of Capitalism\" grounds the rise of industrial capitalism on the production of raw cotton by American slaves. Recent works include Sven Beckert's Empire of Cotton, Walter Johnson's River of Dark Dreams, and Edward Baptist's The Half Has Never Been Told. All three authors mishandle historical evidence and mis-characterize important events in ways that affect their major interpretations on the nature of slavery, the workings of plantations, the importance of cotton and slavery in the broader economy, and the sources of the Industrial Revolution and world development.</blockquote> <p>We discuss the problems with the New History of Capitalism literature and some alternative hypotheses suggested by the economic history literature. In their previous work on the subject, Olmstead and Rhode show \"that a succession of new cotton varieties helped propel the rise in labor productivity and southern growth\" (p. 7). Ed Baptist dubiously attributes this rise in productivity to torture.</p> <hr />",
  "content:encoded": "<p>Today's guests are economic historians Alan Olmstead and Paul Rhode. Both of them have research related to the slave economy of the Antebellum South. Our main topic is a paper they co-authored, <a href= \"https://www.sciencedirect.com/science/article/pii/S0014498317302292\" target=\"_blank\" rel=\"noopener\">Cotton, slavery, and the new history of capitalism</a>.</p> The \"New History of Capitalism\" grounds the rise of industrial capitalism on the production of raw cotton by American slaves. Recent works include Sven Beckert's Empire of Cotton, Walter Johnson's River of Dark Dreams, and Edward Baptist's The Half Has Never Been Told. All three authors mishandle historical evidence and mis-characterize important events in ways that affect their major interpretations on the nature of slavery, the workings of plantations, the importance of cotton and slavery in the broader economy, and the sources of the Industrial Revolution and world development. <p>We discuss the problems with the New History of Capitalism literature and some alternative hypotheses suggested by the economic history literature. In their previous work on the subject, Olmstead and Rhode show \"that a succession of new cotton varieties helped propel the rise in labor productivity and southern growth\" (p. 7). Ed Baptist dubiously attributes this rise in productivity to torture.</p> ",
  "enclosure": "",
  "itunes:duration": "51:49",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guests are economic historians Alan Olmstead and Paul Rhode. Both of them have research related to the slave economy of the Antebellum South. Our main topic is a paper they co-authored, . The \"New History of Capitalism\" grounds the rise of...",
  "itunes:episode": 133,
  "itunes:episodeType": "full"
}