{
  "id": "https://bibleinoneyear.org/en/youth/51",
  "title": "Day 51: How to Meet with God",
  "description": "Psalm 24:1–10, Exodus 27:21, 28:29,35, Mark 5:24–36. There was such a sense of the presence of God on the island that a businessman visiting said, ‘The moment I stepped ashore I was suddenly conscious of the presence of God ’ God was *meeting* with his people",
  "pubDate": "Sat, 20 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/51/?ignore",
  "itunes:duration": "13:20",
  "guid": "enyouth20022021-51",
  "length": 800.84,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 51: How to Meet with God",
  "itunes:subtitle": "Psalm 24:1–10, Exodus 27:21, 28:29,35, Mark 5:24–36. There was such a sense of the presence of God on the island that a businessman visiting said, ‘The moment I stepped ashore I was suddenly conscious of the presence of God ’ God was *meeting* with his people",
  "itunes:summary": "In 1949, one of the greatest revivals in the history of the United Kingdom took place in the Hebrides. Duncan Campbell, the preacher at the centre of the revival, later described how it began.\nSeven men and two women had decided to pray earnestly for revival. One night, at a prayer meeting held in a barn, a young man took his Bible and read from Psalm 24 (the psalm for today): ‘Who may ascend the mountain of the Lord? Who may stand in his holy place? The one who has clean hands and a pure heart’ (vv.3–4a).\nHe shut his Bible and said, ‘It seems to me just so much sentimental humbug to be praying as we are praying, to be waiting as we are waiting here, if we ourselves are not rightly related to God.’ He asked God to reveal if his own hands were clean and his own heart was pure.\nThat night God met with them in a powerful way. As they waited on God ‘his awesome presence swept the barn’. They came to understand that revival is always related to holiness. A power was let loose that shook the parish from centre to circumference.\n‘Three men were lying on the straw having fallen under the power of God. They were lifted out of the ordinary into the extraordinary. They knew that God had visited them and neither they nor their parish could ever be the same again.’\nFour miles away, two sisters aged eighty-two and eighty-four had a vision of God. They saw the churches crowded and the youth and the community flocking into the churches. They had ‘a glorious assurance that God was coming in revival power’.\nDuncan Campbell was invited to come and speak to them. When he arrived in the parish church, it was packed out with hundreds waiting outside. No one could explain where they had come from. Within ten minutes of the service starting, men and woman were crying out to God. They were meeting with God in all his holiness.\nThere was such a sense of the presence of God on the island that a businessman visiting said, ‘The moment I stepped ashore I was suddenly conscious of the presence of God.’ God was meeting with his people.\nHow do you and I meet with God?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 51
}