{
  "title": "S1E13 - Why You Need a Goal Greater than Yourself with AJ Edelman",
  "guid": "https://pinecast.com/guid/f59a2ccd-aba2-46c7-a36f-b0d564667840",
  "pubDate": "Tue, 01 Sep 2020 06:30:45 -0000",
  "itunes:duration": "01:01:24",
  "description": "<p>Laura is very excited to welcome four-time Israeli National Champion in skeleton, AJ Edelman, to the podcast today. AJ is an American-Israeli who, by competing for Israel at the 2018 Winter Olympics, became the first Orthodox Jew to compete in the Winter Olympics, and the first Orthodox Jewish male to compete in either Olympic iteration. He has since retired from skeleton, intends to compete in the coming seasons and qualify Israel for the 2022 Olympics in 4-man bobsled, and is currently head of development and programming for the Israel Bobsled and Skeleton team. As impressive as these accomplishments are, they constitute just one part of his truly inspirational story, as you will hear today.</p>\n<p>AJ begins the conversation by relating his experiences with, and advice regarding, both bullying and mental health. He then goes on to describe the remarkable impact that fellow athlete Steve Holcomb had upon him, the ‘I’ll show you’ attitude which propels his performance, the steps he took to improve his skill in skeleton so quickly, and, above all, the importance of having a goal greater than yourself. AJ’s faith, his duty to represent his community, the special tradition which he started, and his experience of training in Jamaica are all discussed as well. The conversation draws to a close with their exploration of being the best version of yourself, AJ’s Olympic experience in 2018, and what he is up to these days. Intelligent, articulate, passionate, and committed are just a few of the words which come to mind as you listen to AJ speak about all he has been through and accomplished to this point in his life. He is a visionary who puts his heart and soul into each and every goal he sets, and you will undoubtedly be equal parts amazed, impressed, and inspired as you listen to him here today.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>AJ’s experiences with, and advice regarding, bullying and mental health</li>\n<li>His journey from playing hockey at MIT to becoming a skeleton athlete</li>\n<li>The impact that Steve Holcomb had on AJ</li>\n<li>AJ and Laura’s shared ‘I’ll show you’ attitude</li>\n<li>How he improved at the skeleton so quickly</li>\n<li>The importance of having a goal greater than yourself</li>\n<li>AJ’s faith and representing his community</li>\n<li>His special tradition</li>\n<li>AJ’s experience training in Jamaica</li>\n<li>Being the best version of yourself</li>\n<li>His 2018 Olympic experience</li>\n<li>What AJ is up to these days</li>\n</ul>\n<p>Quotes:</p>\n<p>“The only reason why I try to do any of the things that I try to do is borne out of using those experiences, in particular the negative feelings that sometimes come about from depression, as fuel.”</p>\n<p>“It’s always been about rise above and be the best that you can be, but initially motivated by some very negative experiences.”</p>\n<p>“Even though people hurt you, oftentimes, they themselves are hurting, but that’s also not an excuse to take it.”</p>\n<p>“Realize that you are on a higher plane than your bully.”</p>\n<p>“We have to fight bullying by addressing the root causes.”</p>\n<p>“Mental health is very similar to most other health issues, in that it presents differently for people, but we have to acknowledge that it not only exists, and that it exists within ourselves, but that there are many methods that we can take to treat it, but we have to treat it.”</p>\n<p>“I don’t believe that decisions are ever wrong if they’re made with the right intent.”</p>\n<p>“The plan was to find a sport in which I could actually become truly excellent and elite, to show that Jews can become elite in a sport, even later on in life.”</p>\n<p>“People may not register on your scale, but you can impart an enormous amount of influence and help on other people’s lives.”</p>\n<p>“I was fighting in my mind for the future of my program.”</p>\n<p>“I will not be part of the end product, but I will be, I can be, a significant stepping-stone to creating something really good.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a>\nConnect with AJ:\nEmail:   adam.edelman@olympian.org\nInstagram:   <a href=\"https://www.instagram.com/ajedelman/?hl=en\" rel=\"nofollow\">https://www.instagram.com/ajedelman/?hl=en</a></p>",
  "itunes:title": "Why You Need a Goal Greater than Yourself with AJ Edelman",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 13
}