{
  "title": "Hacker Charged With Extorting Online Psychotherapy Service",
  "link": "https://krebsonsecurity.com/2022/11/hacker-charged-with-extorting-online-psychotherapy-service/",
  "comments": "https://krebsonsecurity.com/2022/11/hacker-charged-with-extorting-online-psychotherapy-service/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Thu, 03 Nov 2022 14:43:22 +0000",
  "category": [
    "A Little Sunshine",
    "Ne'er-Do-Well News",
    "Antti Kurittu",
    "hack the planet",
    "Julius Kivimäki",
    "ransom_man",
    "Vastaamo",
    "Ville Tapio",
    "William Ralston",
    "wired",
    "Zbot",
    "Zeekill"
  ],
  "guid": "https://krebsonsecurity.com/?p=61711",
  "description": "A 25-year-old Finnish man has been charged with extorting a once popular and now-bankrupt online psychotherapy company and its patients. Finnish authorities rarely name suspects in an investigation, but they were willing to make an exception for Julius \"Zeekill\" Kivimaki, a notorious hacker who -- at the tender age of 17 -- had been convicted of more than 50,000 cybercrimes, including data breaches, payment fraud, operating botnets, and calling in bomb threats.",
  "content:encoded": "<p><img loading=\"lazy\" class=\"aligncenter wp-image-61773\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/kikmaki-wanted.png\" alt=\"\" width=\"751\" height=\"357\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/kikmaki-wanted.png 2936w, https://krebsonsecurity.com/wp-content/uploads/2022/11/kikmaki-wanted-768x366.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/11/kikmaki-wanted-1536x731.png 1536w, https://krebsonsecurity.com/wp-content/uploads/2022/11/kikmaki-wanted-2048x975.png 2048w, https://krebsonsecurity.com/wp-content/uploads/2022/11/kikmaki-wanted-782x372.png 782w\" sizes=\"(max-width: 751px) 100vw, 751px\" /></p>\n<p>A 25-year-old Finnish man has been charged with extorting a once popular and now-bankrupt online psychotherapy company and its patients. Finnish authorities rarely name suspects in an investigation, but they were willing to make an exception for <strong>Julius &#8220;Zeekill&#8221; Kivimaki</strong>, a notorious hacker who &#8212; at the tender age of 17 &#8212; had been <a href=\"https://krebsonsecurity.com/2015/07/finnish-decision-is-win-for-internet-trolls/\" target=\"_blank\" rel=\"noopener\">convicted of more than 50,000 cybercrimes</a>, including data breaches, payment fraud, operating botnets, and calling in bomb threats.</p>\n<p>In late October 2022, Kivimaki was charged (and arrested in absentia, according to the Finns) with attempting to extort money from the<strong> Vastaamo Psychotherapy Center</strong>.  On October 21, 2020, Vastaamo became the target of blackmail when a tormentor identified as &#8220;<strong>ransom_man</strong>&#8221; demanded payment of 40 bitcoins (~450,000 euros at the time) in return for a promise not to publish highly sensitive therapy session notes Vastaamo had exposed online.</p>\n<p>In a series of posts over the ensuing days on a Finnish-language dark net discussion board, ransom_man said Vastaamo appeared unwilling to negotiate a payment, and that he would start publishing 100 patient profiles every 24 hours &#8220;to provide further incentive for the company to continue communicating with us.&#8221;</p>\n<p>&#8220;We&#8217;re not asking for much, approximately 450,000 euros which is less than 10 euros per patient and only a small fraction of the around 20 million yearly revenues of this company,&#8221; ransom_man wrote.</p>\n<p>When Vastaamo declined to pay, ransom_man shifted to extorting individual patients. According to <a href=\"https://poliisi.fi/-/yksi-vangittu-poissaolevana-liittyen-vastaamon-tietomurtoon?languageId=en_US\" target=\"_blank\" rel=\"noopener\">Finnish police</a>, some 22,000 victims reported extortion attempts targeting them personally, targeted emails that threatened to publish their therapy notes online unless paid a 500 euro ransom.</p>\n<div id=\"attachment_61775\" style=\"width: 761px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61775\" loading=\"lazy\" class=\" wp-image-61775\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion.png\" alt=\"\" width=\"751\" height=\"518\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion.png 2178w, https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion-768x530.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion-1536x1059.png 1536w, https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion-2048x1412.png 2048w, https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion-782x539.png 782w, https://krebsonsecurity.com/wp-content/uploads/2022/11/vastaamo-extortion-100x70.png 100w\" sizes=\"(max-width: 751px) 100vw, 751px\" /><p id=\"caption-attachment-61775\" class=\"wp-caption-text\">The extortion message targeted Vastaamo patients.</p></div>\n<p>On Oct. 23, 2020, ransom_man uploaded to the dark web a large compressed file that included all of the stolen Vastaamo patient records. But investigators found the file also contained an entire copy of ransom_man&#8217;s home folder, a likely mistake that exposed a number of clues that they say point to Kivimaki.</p>\n<p>Ransom_man quickly deleted the large file (accompanied by a &#8220;whoops&#8221; notation), but not before it had been downloaded a number of times. The entire archive has since been made into a searchable website on the Dark Web.</p>\n<p>Among those who grabbed a copy of the database was <strong>Antti Kurittu</strong>, a team lead at <strong>Nixu Corporation</strong> and a former criminal investigator. In 2013, Kurittu worked on investigation involving Kivimaki&#8217;s use of the Zbot botnet, among other activities Kivimaki engaged in as a member of the hacker group <a href=\"https://krebsonsecurity.com/2015/02/webnic-registrar-blamed-for-hijack-of-lenovo-google-domains/\" target=\"_blank\" rel=\"noopener\">Hack the Planet</a>.</p>\n<p>&#8220;It was a huge opsec [operational security] fail, because they had a lot of stuff in there &#8212; including the user&#8217;s private SSH folder, and a lot of known hosts that we could take a very good look at,&#8221; Kurittu told KrebsOnSecurity, declining to discuss specifics of the evidence investigators seized. &#8220;There were also other projects and databases.&#8221;</p>\n<p>Kurittu said he and others he and others who were familiar with illegal activities attributed to Kivimäki couldn&#8217;t shake suspicion that the infamous cybercriminal was also behind the Vastaamo extortion.</p>\n<p>&#8220;I couldn&#8217;t find anything that would link that data directly to one individual, but there were enough indicators in there that put the name in my head and I couldn&#8217;t shake it,&#8221; Kurittu said. &#8220;When they named him as the prime suspect I was not surprised.&#8221;<span id=\"more-61711\"></span></p>\n<p>A handful of individually extorted victims paid a ransom, but when news broke that the entire Vastaamo database had been leaked online, the extortion threats no longer held their sting. However, someone would soon set up a site on the dark web where anyone could search this sensitive data.</p>\n<p>Kivimaki stopped using his middle name Julius in favor of his given first name <strong>Aleksanteri</strong> when he moved abroad several years ago. A Twitter account by that name was verified by Kivimaki&#8217;s attorney as his, and through that account he denied being involved in the Vastaamo extortion.</p>\n<p>&#8220;I believe [the Finnish authorities] brought this to the public in order to influence the decision-making of my old case from my teenage years, which was just processed in the Court of Appeal, both cases are investigated by the same persons,&#8221; Kivimaki <a href=\"https://mobile.twitter.com/AlexKivimaeki/status/1586083493641351168\" target=\"_blank\" rel=\"noopener\">tweeted on Oct. 28</a>.</p>\n<p>Kivimaki is appealing a 2020 district court decision sentencing him to &#8220;one year of conditional imprisonment for two counts of fraud committed as a young person, and one of gross fraud, interference with telecommunications as a young person, aggravated data breach as a young person and incitement to fraud as a young person,&#8221; according to the Finnish tabloid<em> Ilta-Sanomat.</em></p>\n<p class=\"article-body mb-24 px-16\">&#8220;Now in the Court of Appeal, the prosecutor is demanding a harsher punishment for the man, i.e. unconditional imprisonment,&#8221; reads the <a href=\"https://www.is.fi/digitoday/art-2000009041118.html\" target=\"_blank\" rel=\"noopener\"><em>Ilta-Sanomat story</em></a>. &#8220;The prosecutor notes in his complaint that the young man has been committing cybercrimes from Espoo since he was 15 years old, and the actions have had to be painstakingly investigated through international legal aid.&#8221;</p>\n<p>As described in <a href=\"https://www.wired.com/story/vastaamo-psychotherapy-patients-hack-data-breach/\" target=\"_blank\" rel=\"noopener\">this Wired story last year</a>, Vastaamo filled an urgent demand for psychological counseling, and it won accolades from Finnish health authorities and others for its services.</p>\n<p>&#8220;Vastaamo was a private company, but it seemed to operate in the same spirit of tech-enabled ease and accessibility: You booked a therapist with a few clicks, wait times were tolerable, and Finland’s Social Insurance Institution reimbursed a big chunk of the session fee (provided you had a diagnosed mental disorder),&#8221; <strong>William Ralston</strong> wrote for <em>Wired</em>. &#8220;The company was run by <strong>Ville Tapio</strong>, a 39-year-old coder and entrepreneur with sharp eyebrows, slicked-back brown hair, and a heavy jawline. He’d cofounded the company with his parents. They pitched ­Vastaamo as a humble family-run enterprise committed to improving the mental health of all Finns.&#8221;</p>\n<p>But for all the good it brought, the healthcare records management system that Vastaamo used relied on little more than a MySQL database that was left dangerously exposed to the web for 16 months, guarded by nothing more than an administrator account with a blank password.</p>\n<p>The Finnish daily <a href=\"https://www.iltalehti.fi/kotimaa/a/7477b65a-9fc8-46fa-a1a0-63674b8a064a\" target=\"_blank\" rel=\"noopener\">Iltalehti</a> said Tapio was relieved of his duties as CEO of Vastaamo in October 2020, and that in September, prosecutors brought charges against Tapio for a data protection offense in connection with Vastaamo&#8217;s information leak.</p>\n<p class=\"paragraph\">&#8220;According to Vastaamo, the data breach in Vastaamo&#8217;s customer databases took place in November 2018,&#8221; Iltalehti reported last month. &#8220;According to Vastaamo, Tapio concealed information about the data breach for more than a year and a half.&#8221;</p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/11/hacker-charged-with-extorting-online-psychotherapy-service/feed/",
  "slash:comments": 20
}