{
  "id": "tag:blogger.com,1999:blog-37798047.post-5882299128802596099",
  "published": "2021-11-07T20:09:00.001-05:00",
  "updated": "2021-11-07T20:09:32.980-05:00",
  "title": "Example: forensicating the Mesa County system image",
  "content": "<p>Tina Peters, the election clerk in Mesa County (Colorado) <a href=\"https://www.washingtonpost.com/investigations/an-elections-supervisor-embraced-conspiracy-theories-officials-say-she-has-become-an-insider-threat/2021/09/26/ee60812e-1a17-11ec-a99a-5fea2b2da34b_story.html\">went rogue</a> and dumped disk images of an election computer on the Internet. They are available on the Internet via BitTorrent [<a href=\"magnet:?xt=urn:btih:dc654b50ec08a8ad5d8f6275f9cd4fcae29686c1&amp;dn=Mesa1\">Mesa1</a>][<a href=\"magnet:?xt=urn:btih:ef534e78bbe71b3908ccf074d6d40077a3a63074&amp;dn=Mesa2\">Mesa2</a>], The Colorado Secretary of State is now suing her over the incident.</p><p>The lawsuit describes the facts of the case, how she entered the building with an accomplice on Sunday, May 23, 2021. I thought I'd do some forensics on the image to get more details.</p><p>Specifically, I see from the Mesa1 image that she logged on at 4:24pm and was done acquiring the image by 4:30pm, in and (presumably) out in under 7 minutes.</p><p>In this blogpost, I go into more detail about how to get that information.</p><p><br /></p><p><b>The image</b></p><p>To download the Mesa1 image, you need a program that can access BitTorrent, such as the Brave web browser or a BitTorrent client like qBittorrent. Either click on the \"magnet\" link or copy/paste into the program you'll use to download. It takes a minute to gather all the \"metadata\" associated with the link, but it'll soon start the download:</p><p>What you get is file named EMSSERVER.E01. This is a container file that contains both the raw disk image as well as some forensics metadata, like the date it was collected, the forensics investigator, and so on. This container is in the well-known \"EnCase Expert Witness\" format. EnCase is a commercial product, but its container format is a quasi-standard in the industry.</p><p>Some freeware utilities you can use to open this container and view the disk include \"FTK Imager\", \"Autopsy\", and on the Linux command line, \"ewf-tools\".</p><p>However you access the E01 file, what you most want to look at is the Windows operating-system logs. These are located in the directory C:\\Windows\\system32\\winevtx. The standard Windows \"Event Viewer\" application can load these log files to help you view them.</p><p>When inserting a USB drive to create the disk image, these event files will be updated and written to that disk before the image was taken. Thus, we can see in the event files all the events that happen right before the disk image happens.</p><p><br /></p><div><p><b>Disk image acquisition</b></p><p>Here's what the event logs on the Mesa1 image tells us about the acquisition of the disk image itself.</p><p>The person taking the disk image logged in at 4:24:16pm, directly to the console (not remotely), on their second attempt after first typing an incorrect password. The account used was \"emsadmin\". Their NTLM password hash is&nbsp;9e4ec70af42436e5f0abf0a99e908b7a. This is a \"role-based\" account rather than an individual's account, but I think Tina Peters is the person responsible for the \"emsadmin\" roll.</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-O5E-_cB0Fqw/YUrf4Xjn7oI/AAAAAAAAGxM/jFLeVo-RGdE-0GKoe600A8sftEptd2TYQCLcBGAsYHQ/image.png\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img data-original-height=\"1434\" data-original-width=\"1500\" height=\"191\" src=\"https://lh3.googleusercontent.com/-O5E-_cB0Fqw/YUrf4Xjn7oI/AAAAAAAAGxM/jFLeVo-RGdE-0GKoe600A8sftEptd2TYQCLcBGAsYHQ/w200-h191/image.png\" width=\"200\" /></a></div>Then, at 4:26:10pm, they connected via USB a Western Digital&nbsp; \"easystore™\" portable drive that holds 5-terabytes. This was mounted as the F: drive.<p></p><p>The program \"Access Data FTK Imager 4.2.0.13\" was run from the USB drive (F:\\FTK Imager\\FTK Imager.exe) in order to image the system. The image was taken around 4:30pm, local Mountain Time (10:30pm GMT).</p><p>It's impossible to say from this image what happened after it was taken. Presumably, they immediately hit \"eject\" on the drive, logged off, and disconnected the hard drive. Thus from beginning to end, it took about 7 minutes to take the image once they sat down at the computer.</p><p><br /></p></div><div><p><b>Dominion Voting Systems</b></p><p>The disk image is that of a an \"EMS Server\" part of the Dominion Voting Suite. This is a server on an air-gapped network (not connected to any other network) within the count offices.</p><p>Most manuals for Colorado are <a href=\"https://www.sos.state.co.us/pubs/elections/VotingSystems/DVS-DemocracySuite511/documentation/docIndex.html\">online</a>, though some bits and pieces are missing, and can be found in documents posted to <a href=\"https://www.sos.ca.gov/elections/ovsta/frequently-requested-information/dominion-voting\">other state's websites</a>&nbsp;(though each state does things a little different, so such cross referencing can't be completely trusted).</p><p>The locked room with an air-gapped network&nbsp; you see in the Mesa County office appears to look like the following, an \"EMS Standard\" configuration (EMS stands for Election Management System).</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-T_fbz4V9F1Q/YUk7l5shnOI/AAAAAAAAGwQ/45Sa2ikLeSQtnWJEWkd-ZgdLvI8qegcpgCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"1214\" data-original-width=\"2048\" height=\"190\" src=\"https://lh3.googleusercontent.com/-T_fbz4V9F1Q/YUk7l5shnOI/AAAAAAAAGwQ/45Sa2ikLeSQtnWJEWkd-ZgdLvI8qegcpgCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />This small network is \"air gapped\", meaning there is no connection from this network to any other network in the building, nor out to the Internet. By looking at the logs from the Mesa1 image, we can see what this network looks like:<div><ul style=\"text-align: left;\"><li>The EMS Server is named \"EMSERVER\" with IP address 192.168.100.10 and MAC address 44-A8-42-30-01-5D. The hard drive matches Dominion's specs: a 1-terabyte boot drive (C:) and a 2-terabyte data drive (D:) that is shared with the rest of the network as \\\\EMSERVER\\NAS. This also acts as the network's DHCP and DNS server.</li><li>At least one network printer, model Dell E310dw.</li><li>Two EMS Workstations (EMSCLIENT01 and EMSCLIENT02). This is where users spend most of their time, before an election to create the ballots, and after all the ballots have been counted to construct the final tally.</li><li>Four&nbsp;<a href=\"https://www.sos.state.co.us/pubs/elections/VotingSystems/DVS-DemocracySuite511/documentation/2-03-ICC-FunctionalityDescription-5-11-CO.pdf\">ImageCast Central</a>&nbsp;(ICC) (ICC01 - ICC04) scanners, for automatically scanning and tabulating ballots.</li><li>Two <a href=\"https://www.sos.state.co.us/pubs/elections/VotingSystems/DVS-DemocracySuite511/documentation/2-08-ADJ-SystemOperationProcedures-5-11-CO.pdf\">Adjudication Workstations</a> (ADJCLIENT01 and ADJCLIENT03). These are used when the scanners reject ballots, such as when somebody does a write-in candidate, or marks two candidates. Humans need to get involved to make the final judgement on what the ballot actually says.</li></ul></div><div><p>Note this isn't the machines you'd expect to see in a precinct when you vote (which would be \"ballot marking devices\" predominantly). These are the machines in the back office that count the votes and store the official results.</p><p><br /></p><p><b>Conclusion</b></p><p>What we see here is that \"system logs\" can tell us a lot of interesting things about the system. There's good reason to retain them in the future.</p><p>On the other hand, they generally can't answer the most important question: whether the system was hacked and votes flipped.</p><p>Mike Lindell claims to have \"Absolute Proof\" that Chinese hackers flipped votes throughout the country, including Maricopa County. If so, this would've been the system that the Chinese hackers would've hacked. Yet, in the system image, there is no evidence of this. By this, I mean the Mesa1 image, the one from before the system logs were deleted (obviously, there would be nothing in the Mesa2 image).</p><p>This lack of hacking evidence in the logs isn't proof that it didn't happen, though. The fact is, the logs aren't comprehensive enough to record most hacks, and the hackers could've deleted the logs anyway. That's why system logs aren't considered \"election records\" and that laws don't mandate keeping them: they could have some utility, as I've shown above, but they really wouldn't show the things that we most want to know.</p><p><br /></p><p><br /></p><p><br /></p></div><div><div><br /></div><div><br /></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}