{
  "title": "Hockey Stick growth and Github Stars",
  "link": "",
  "updated": "2020-10-28T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2020/10/28/scimitar-growth",
  "content": "<p>Common open source software (OSS) / venture capital (VC) metrics are flawed.\nThis surprises no one; metrics are hard.</p>\n\n<p>Since <a href=\"https://coiled.io\">starting a company</a>\naround a pre-existing community OSS project,\n<a href=\"https://dask.org\">Dask</a>,\nI’ve had many conversations on this topic.\nI’d like to share two prototypical conversations that show the need for nuance below.\nOne about hockey stick growth, and the other about GitHub stars.</p>\n\n<h3 id=\"startup-founder-asks-about-hockey-stick-growth\">Startup Founder asks about Hockey Stick Growth</h3>\n\n<p>Another startup founder wanted to drive adoption to his product by creating an\nopen source project that quickly took off and was curious about how to rapidly\nget project-market fit.</p>\n\n<ul>\n  <li>\n    <p><strong>SF:</strong> <em>Dask seems really successful.  How did you quickly get traction with the open source community?</em></p>\n\n    <p><strong>Me:</strong> <em>We didn’t.  Dask is the result of six years of listening and diligent community service.</em></p>\n  </li>\n</ul>\n\n<p>The full community-based OSS timeline doesn’t make make sense for a for-profit company.</p>\n\n<p>He went on to ask about rapid, hockey-stick growth.</p>\n\n<ul>\n  <li>\n    <p><strong>SF:</strong> <em>Well, along that journey, what happened that cause you go finally achieve hockey-stick growth?</em></p>\n\n    <p><img src=\"http://blogs-images.forbes.com/sageworks/files/2016/10/HSP_Graphic1_11_16-2-e1477181247697.jpg\" width=\"60%\" />\n(Image source,\n<a href=\"https://www.forbes.com/sites/sageworks/2016/10/23/navigating-the-make-or-break-years-as-you-create-hockey-stick-growth/#764356305ed7\">Forbes</a>)</p>\n\n    <p><strong>Me:</strong> <em>Never.</em></p>\n\n    <p><em>Dask grew organically.  See my post on <a href=\"https://blog.dask.org/2020/01/14/estimating-users\">Estimating Users</a> and our weekly unique IPs to API documentation (my preferred metric)</em></p>\n\n    <p><a href=\"https://blog.dask.org/images/dask-weekly-users.png\"><img src=\"https://blog.dask.org/images/dask-weekly-users.png\" width=\"100%\" alt=\"Dask weekly users on documentation\" /></a></p>\n  </li>\n</ul>\n\n<p>I usually call this growth curve “organic growth” or “natural growth”,\nwhich I think reflects a far more stable community of users with deep\nunderstanding between the user and developer communities.</p>\n\n<p>We need to find a way to make organic growth cool again.  Rather than\nHockey-stick growth we can call this <strong>Scimitar growth</strong>?  :)</p>\n\n<h3 id=\"venture-capitalist-asks-about-github-stars\">Venture Capitalist asks about Github Stars</h3>\n\n<p>In another conversation a VC investor trying to evaluate Dask’s popularity asks\nabout GitHub stars.</p>\n\n<ul>\n  <li>\n    <p><strong>VC:</strong> <em>So how popular is Dask?  How many GitHub stars do you have?</em></p>\n\n    <p><strong>Me:</strong> <em>It’s hard to count, as an ecosystem project Dask affects dozens of other projects.</em></p>\n\n    <p><em>We also don’t spend our time trying to collect stars</em></p>\n  </li>\n  <li>\n    <p><strong>VC:</strong> <em>Yeah, but how many stars?</em></p>\n\n    <p><strong>Me:</strong> <em>Sigh, maybe 7k in the main repo, 2k each in a few sub-repos,\nand then another 5k each across various sister projects like RAPIDS, Prefect,\nXarray, …?</em></p>\n  </li>\n  <li>\n    <p><strong>VC:</strong> <em>I guess that’s ok</em></p>\n\n    <p><strong>Me:</strong> <em>But a better metric is probably that 5% of Python users use Dask\n(according to the PSF survey, which is biased towards people who care).</em></p>\n\n    <p><em>So any company that has 20 Python users has a decent chance of using Dask\ninternally.  Apache Spark is 2-3x higher, Apache Hadoop slightly higher,\nand Apache Hive slightly less, Apache Beam about 5x less.</em></p>\n\n    <p>Dask is by far the most popular non-JVM parallel computing framework in Python ever made.</p>\n  </li>\n  <li>\n    <p><strong>VC:</strong> <em>Oh.</em></p>\n  </li>\n</ul>\n\n<p><img src=\"https://mk0coiled27knr0w73eb.kinstacdn.com/wp-content/uploads/dask-users-psf-survey-white-on-black.png\" width=\"80%\" /></p>\n\n<p>I don’t know a better metric than GitHub stars that one can get immediately on the open internet.\nI don’t envy investors.  Rapidly assessing the commercial potential of highly\ntechnical software is hard.  It’s rare to find individuals with dual\nexpertise in distributed systems and business acumen.</p>\n\n<p>Still, the star metric makes me less-than-happy.  It’s a measure of hype, not of use, or of utility.</p>\n\n<h3 id=\"thoughts\">Thoughts</h3>\n\n<p>In the specific case of Dask, hockey stick growth among users is no longer\npossible.  We’ve reached <em>user</em> penetration that’s already pretty high (the 5%\nnumber is for <em>all</em> Python users, including web developers, and people who will\nnever touch big data).  The thing to think about now is <em>company</em> adoption.\nJust because some data scientist is using Dask inside of every Fortune 50\ncompany doesn’t mean that those companies use Dask throughout.  That metric is\nharder though.</p>\n\n<p>Regarding stars, most of the excitement around Dask today is indirect.  It’s for\nsister projects like RAPIDS, Prefect, Pangeo/Xarray, XGBoost, and so on that\nDask supports.  As a <em>community</em> project, Dask tries hard to blend in\nand support peer projects.  This integration is the strength of community\nsoftware.  Dask and many other OSS projects strengthen the collective weave of\nPyData.  We’re less like a monolith, and more like carbon fiber.  Hat tip to\nsimilar computational projects Arrow, RAPIDS, Numba, and Numpy all of whom work\ntirelessly on standards and open integration.</p>\n\n<p>I fundamentally believe that pragmatic sustainable software is better built\norganically and collectively.  I am curious what metrics might capture these\nmore community-supportive behaviors.</p>"
}