{
  "id": "yt:video:kpk2tdsPh0A",
  "yt:videoId": "kpk2tdsPh0A",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - Watch for Rolling Rocks - 0.5x A Presses (Commentated)",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2016-01-12T13:13:18+00:00",
  "updated": "2022-03-05T08:38:50+00:00",
  "media:group": {
    "media:title": "SM64 - Watch for Rolling Rocks - 0.5x A Presses (Commentated)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I collect the star Watch for Rolling Rocks in Hazy Maze Cave using 0.5 A presses. The A press is to perform AB kicks on the rising elevators. Without doing these kicks, Mario would go through the elevator, and so there'd be no way to navigate out of the lake area with QPU speed. For the record, this is TAS.\n\nThis video is an improvement from my previous video in which I collected this star in 1 A press. You can find that video here: https://youtu.be/yGic8wwhm6g. Since then, we discovered PU movement and scuttlebug raising, which made this strat possible.\n\nFor convenience, here are the informative parts of the video:\n0:35 for half A presses\n3:44 for scuttlebug transportation\n5:01 for scuttlebug raising\n8:07 for hyper speed walking (HSWing)\n10:40 for parallel universes (PUs)\n\nHere is a play by play of what I do. First, I use scuttlebug transportation to move a scuttlebug to the corner of the Watch for Rolling Rocks platform. Then, I use scuttlebug raising to raise him to about the height of the platform. Next, I use hyper speed walking to generate massive speed. Finally, I use PU movement to navigate to the top of the course, launch to the scuttlebug to bounce on him, and ground pound in the misalignment of the platform to get onto it. And from there, I collect the star.\n\nIf you want to see my workspace/calculations and read about the process of TASing this, I've chronicled it here: http://imgur.com/gallery/rK24p\n\n.m64 stats:\nLength: 13 hours and 49.5 minutes\nRe-records: 6824\nFrames: 2986271 (1493100 input)\n\nThis video is without a doubt the one that I've put the most time into out of all my videos. I knew this going in, and so I decided to keep a log of how much time I spent on each aspect of it (note: if my computer was doing work like compiling/recording and I could let it be, I didn't count that time). Here are the stats:\nTime to TAS: 12 hours\nTime to record/manage raw avis: 9 hours\nTime to create uncommentated version: 31 hours\nTime to add visuals/commentary: 75 hours\n\nUpdate: The PU route used in this video actually crashes on console, as it turns out PU crashes can still occur even when locking the camera in the main map. Nevertheless, an alternate route has been found that avoids these PU crashes and has been console verified: https://youtu.be/T-G4ymVwajw\n\nUncommentated Version: https://youtu.be/X-zAWbM50JM\nABC Playlist: https://www.youtube.com/playlist?list=PLmvvhlevqC2d6vis077yFHuLJHYtTtqe_\nABC Routes: https://docs.google.com/document/d/1ypRVVRyf4x-v8GqCSmKYnicrfKSIjao3Y1ZVl52RIyM/edit",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}