{
  "title": "L'Affaire Jordan, with Annelle Sheline",
  "description": "<p>Today we’re very lucky to be joined by Annelle Sheline, Research Fellow for the Middle East at the Quincy Institute for Responsible Statecraft and a non-resident fellow at Rice University’s Baker Institute for Public Policy. Annelle’s research focuses on religious authority in the Middle East, particularly the intersection of religious and national identities in the Arab monarchies, and she’s done fieldwork in Egypt, Jordan, Morocco, Oman, Saudi Arabia, and Yemen.</p><p>One of the countries in that list has been particularly newsworthy of late, and somewhat surprisingly it’s Jordan. Annelle is here to provide some context for the alleged coup attempt that Jordanian authorities claimed to have thwarted over the weekend, including an examination of the key question: has former crown prince Hamzah bin Hussein really been plotting with unnamed foreign governments to overthrow his half-brother, King Abdullah II (shown above)? Suffice to say we’re both a bit skeptical. Annelle’s <em>Responsible Statecraft</em> piece on the coup and its potential to serve as a justification for a broad political crackdown is available <a target=\"_blank\" href=\"https://responsiblestatecraft.org/2021/04/05/jordans-detention-of-coup-plotters-is-really-a-crackdown-on-dissent/\">here</a> and you can find her on Twitter <a target=\"_blank\" href=\"https://twitter.com/AnnelleSheline\">here</a>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/laffaire-jordan-with-annelle-sheline",
  "guid": "substack:post:34885230",
  "dc:creator": "Derek Davison",
  "pubDate": "Wed, 07 Apr 2021 22:04:41 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 4341,
  "itunes:image": ""
}