{
  "title": "Are Data Science Certificates Worth It? (15 Recruiters Tell All)",
  "link": "https://www.dataquest.io/blog/data-science-certificate/",
  "dc:creator": "Celeste Grupman",
  "pubDate": "Fri, 14 Oct 2022 08:00:00 +0000",
  "category": [
    "Data Science Career Tips",
    "career",
    "career tips",
    "certificates",
    "promote",
    "study"
  ],
  "guid": "https://www.dataquest.io/?p=14526",
  "description": "What certificate should I get for data science? We interviewed data science recruiters about job applications and none of them cared about certificates.",
  "content:encoded": "<p>Want a data science job ASAP? Then you’re probably wondering what certifications you need.&nbsp;</p>\n<p>In fact, one of the most common data science <a href=\"https://www.quora.com/What-are-the-best-certifications-courses-for-Data-Science/answer/Charlie-Custer-1\" target=\"_blank\" rel=\"noreferrer noopener\">questions on Quora</a> is: “What data science certificate should I get?” </p>\n<p>We talked to 15 hiring managers in the field, and here’s what they said: <strong>You do </strong><strong><em>not</em></strong><strong> need a data science certificate to get a job in data science.&nbsp;</strong></p>\n<p>That’s right&#8211;recruiters are far more interested in your skills than what certifications you have.</p>\n<p>Does that mean certificates aren’t valuable? Not at all. In this article, we’ll explain what certifications really mean to hiring managers and compare some of the best industry certifications available right now.&nbsp;</p>\n<p>Bonus: We’ll let you in on some of the best-kept secrets among recruiters, including what they pay most attention to when weeding out resumes.&nbsp;</p>\n<h2 id=\"h-how-data-science-certificates-impact-your-job-search\"><strong>How Data Science Certificates Impact Your Job Search</strong></h2>\n<p>Surely, data science certificates aren’t worthless, right? To find out, we<a href=\"https://www.dataquest.io/blog/data-science-career-guide/\" target=\"_blank\" rel=\"noreferrer noopener\"> talked to more than a dozen hiring managers and recruiters </a>in the data science field about what they wanted to see on applicants’ résumés. </p>\n<p>None of them mentioned certificates. Not one.</p>\n<p>Here’s what we learned: certificates certainly won’t hurt your job search as long as they’re presented correctly. But they’re unlikely to help much.</p>\n<h3 id=\"h-why-data-science-certificates-fall-short\"><strong>Why Data Science Certificates Fall Short</strong></h3>\n<p>You might be wondering why these certificates aren’t worth the paper they’re printed on.&nbsp;</p>\n<p>The issue is that there’s no universal standard and no universally accredited certification authority. Different websites, schools, and online learning platforms all issue their own certificates. That means these documents could mean anything&#8211;or they could mean nothing at all!&nbsp;</p>\n<p>This is why employers tend not to give them more than a passing glance when qualifying candidates.</p>\n<h2 id=\"h-what-s-the-point-of-a-certification-then\"><strong>What’s the Point of a Certification Then?</strong></h2>\n<p>If certifications won’t help you get a job in data science, then what’s the point of earning one? That’s a great question!&nbsp;</p>\n<p>When it comes down to it, data scientist certifications aren’t completely useless. At Dataquest, we issue certificates when users complete any of <a href=\"https://www.dataquest.io/data-science-courses/\" target=\"_blank\" rel=\"noreferrer noopener\">our data science courses</a>. Why? Because it’s a great way for students to demonstrate that they’re actively engaged in learning new skills. </p>\n<p>Recruiters <em>do </em>like to see that applicants are constantly trying to improve themselves. Listing data science certificates can help your job application in that way.</p>\n<h3 id=\"h-what-s-better-than-a-data-science-certificate-a-portfolio\"><strong>What’s Better than a Data Science Certificate? A Portfolio!&nbsp;</strong></h3>\n<p>What’s most important to recruiters is whether you can actually do the job. Certificates aren’t proof of real skills.&nbsp;</p>\n<p>So what can you do to prove your abilities in the field of data science? Complete a <a href=\"https://www.dataquest.io/blog/career-guide-data-science-projects-portfolio/\" target=\"_blank\" rel=\"noreferrer noopener\">portfolio of projects</a>! </p>\n<p>Portfolios are like the holy grail of data science skills. That’s why hiring managers look at them first. Depending on what they see in your portfolio, they’ll either discard your application or send it to the next round of the hiring process.&nbsp;</p>\n<p>Most of Dataquest’s courses contain interactive projects you’ll complete to help you build your portfolio. Here are just a few of them:</p>\n<ul>\n<li><a href=\"https://www.dataquest.io/course/for-loops-and-conditional-statements-in-python/\" target=\"_blank\" rel=\"noreferrer noopener\">Prison Break</a> — Have some fun using Python and Jupyter Notebook to analyze a dataset of helicopter prison escapes.</li>\n<li><a href=\"https://www.dataquest.io/course/python-for-data-science-intermediate/\" target=\"_blank\" rel=\"noreferrer noopener\">Exploring Hacker News Posts</a> — Work with a dataset of submissions to Hacker News, a popular technology site.</li>\n<li><a href=\"https://www.dataquest.io/course/pandas-fundamentals/\" target=\"_blank\" rel=\"noreferrer noopener\">Exploring eBay Car Sales Data</a> — Use Python to work with a scraped dataset of used cars from eBay Kleinanzeigen, a classifieds section of the German eBay website.</li>\n</ul>\n<p>You can sign up for free! Check out <a href=\"https://www.dataquest.io/data-science-courses/\" target=\"_blank\" rel=\"noreferrer noopener\">our courses here</a>.</p>\n<p><strong>Long story short: </strong>data science certificates are unlikely to help your résumé get noticed.&nbsp;</p>\n<p>When considering which certification to get, don’t focus on “which data science certificate is best.” Instead, find the platform that best helps you learn <a href=\"https://www.dataquest.io/path/data-scientist/\" target=\"_blank\" rel=\"noreferrer noopener\">the fundamental data science skills</a>. That’s what’s going to help you land a job in the field.</p>\n<h2 id=\"h-how-to-choose-a-data-science-certificate-program-in-5-steps\"><strong>How to Choose a Data Science Certificate Program in 5 Steps</strong></h2>\n<p>Finding a data science program that offers a certificate is easy. A quick Google search will turn up dozens.</p>\n<p>Unfortunately, you have a difficult decision to make. You need to compare all these programs to decide whether the certificate is worth your time and money.</p>\n<p>Let’s simplify this process. Here are five key things to consider when looking at a data science certification:</p>\n<ul>\n<li>Content of the program</li>\n<li>Cost of the program</li>\n<li>Prerequisites or qualifications needed</li>\n<li>Time commitment required</li>\n<li>Reviews from previous students</li>\n</ul>\n<p>Now, let’s look at some real-life examples to compare.</p>\n<h2 id=\"h-top-data-science-certifications\"><strong>Top Data Science Certifications</strong></h2>\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/rkFuQBBuQLimW58dcKVE_Z8nAdwbtEGFBzoX6oxcY3PqJDIT7frHChgvjS6s1qJYprx0goXdc7u9r-O6h9AmgX4A8dTZwDCwNqUQdqZkPooi16AFgH_5sfQHm1DS_pydS2xXd_9YdQ9834X82kWa9kryAsqHY3vX4FyHNDdPBhlKaWG-GAdIGVAh2A\" alt=\"\" title=\"dataquest_logo_nav6f10119225a06c6415932df9b22c93da\"/></figure>\n<h3 id=\"h-dataquest\"><strong>Dataquest</strong></h3>\n<p><strong>What you’ll learn:</strong> Dataquest offers <a href=\"https://www.dataquest.io/data-science-courses-directory/\" target=\"_blank\" rel=\"noreferrer noopener\">four different career paths</a> that cover the required skills to become a data analyst, data scientist, and/or data engineer. The specific skills covered vary depending on which path you choose. </p>\n<p><strong>Topics include:</strong></p>\n<ul>\n<li>Python and R programming</li>\n<li>SQL and PostgreSQL</li>\n<li>Probability and statistics</li>\n<li>Machine learning</li>\n<li>Workflow skills like Git, the command line (bash/shell)</li>\n<li>And more</li>\n</ul>\n<p><strong>Cost:</strong> An annual Premium subscription of $399. Monthly subscriptions are also available.</p>\n<p><strong>Prerequisites:</strong> None. There is no application process (anyone can <a href=\"https://app.dataquest.io/signup\" target=\"_blank\" rel=\"noreferrer noopener\">sign up and start learning today</a>). No prior knowledge of applied statistics or programming is required.</p>\n<p><strong>Time commitment:</strong> Varies. Dataquest is a self-serve, interactive learning platform. Most learners find they’re able to meet their learning goals in six months, if studying fewer than ten hours per week. Learning goals can be accelerated with larger time commitments.&nbsp;</p>\n<p><strong>Reviews:</strong></p>\n<ul>\n<li>4.85/5 average on <a href=\"https://www.switchup.org/bootcamps/dataquest\" target=\"_blank\" rel=\"noreferrer noopener\">Switchup</a> (301 reviews)</li>\n<li>4.76/5 on <a href=\"https://www.coursereport.com/schools/dataquest\" target=\"_blank\" rel=\"noreferrer noopener\">Course Report</a> (19 reviews)</li>\n<li>4.7/5 on <a href=\"https://www.g2.com/products/dataquest/reviews\" target=\"_blank\" rel=\"noreferrer noopener\">G2</a> (46 reviews)</li>\n</ul>\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/H1REWi8_KuuvcHBRvfTMqShDeOBG5tQ0OEM2uRmyimwbN8r8IA7cx6KEDEvLYp3fAQMq_uxqFseiFFX_bz_TBMHBaWZ3oclZ3mBLVfKoZT8ZSlKQ2rwgyyYGGq-OZok7Ow3RKTOTnBC66EQbp7MHBt145iTotXzU-msMjtvr1kt4LeylTkIg0lB-7w\" alt=\"\" title=\"cloudera-newco-logo\"/></figure>\n<h3 id=\"h-cloudera-university-data-analyst-course-exam\"><strong>Cloudera University Data Analyst Course/Exam</strong></h3>\n<p><strong>What you’ll learn:</strong> <a href=\"https://www.cloudera.com/about/training/certification/cca-data-analyst.html\" target=\"_blank\" rel=\"noreferrer noopener\">This course</a> focuses on data analysis using Apache products: Hadoop, Hive, and Impala. It covers some SQL, but does not address Python or R programming.</p>\n<p><strong>Cost:</strong> The on-demand version costs $2,235 (180 days of access). Certification exams have an additional cost.</p>\n<p><strong>Prerequisites:</strong> Some prior knowledge of SQL and Linux command line is required.</p>\n<p><strong>Time commitment:</strong> Varies. Because this is a self-paced course, users have access for 180 days to complete 15 sections. Each section is estimated to take between 5-9 hours. The time commitment is between 75 and 135 hours. If you commit less than an hour each day, it might take you the entire 180 days. If you can devote 9 or more hours per day, it might take you a couple of weeks to complete.</p>\n<p><strong>Reviews:</strong> Third-party reviews for this program are difficult to find.</p>\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/EN3AfXxigNGSgWAK2erCkU7omIKXE8hjZsy5aJcaYDzTHk_uCsJv6i1PzVNt3gR7E-ZQbRE2or451EPSwe03ihRpiMKXry7ZJto0UhwprYEqEUFGIBY7lC6PQsYG9pOhiyuwyS_paI6wbOc5u3xhsdM5zehu5JpaldwVzUsrCcFl0A-EZvyskPtfCw\" alt=\"\" title=\"87b07564-d569-4cfd-bee6-8b0a407acb73-eb973ff0b0f8\"/></figure>\n<h3 id=\"h-ibm-data-science-professional-certificate\"><strong>IBM Data Science Professional Certificate</strong></h3>\n<p><strong>What you’ll learn:</strong> This <a href=\"https://www.coursera.org/professional-certificates/ibm-data-science\" target=\"_blank\" rel=\"noreferrer noopener\">Coursera-based program</a> covers Python and SQL. This includes some machine learning skills with Python.</p>\n<p><strong>Cost:</strong> A Coursera subscription, which is required. Based on Coursera’s 10-month completion estimate, the approximate total program cost is $390. A <a href=\"https://www.edx.org/professional-certificate/ibm-data-science\" target=\"_blank\" rel=\"noreferrer noopener\">similar program</a> is also available on EdX.</p>\n<p><strong>Prerequisites:</strong> None.&nbsp;</p>\n<p><strong>Time commitment:</strong> Varies. Coursera suggests that the average time to complete this certificate is ten months.</p>\n<p><strong>Reviews:</strong> Quantitative third-party reviews are difficult to find.</p>\n<ul>\n<li>4.6/5 average on Coursera’s own site (57,501 ratings)</li>\n</ul>\n<h3 id=\"h-harvard-edx-professional-certificate-in-data-science\"><strong>Harvard/EdX Professional Certificate in Data Science</strong></h3>\n<p><strong>What you’ll learn: </strong>This<a href=\"https://www.edx.org/professional-certificate/harvardx-data-science\" target=\"_blank\" rel=\"noreferrer noopener\"> EdX-based program</a> covers R, some machine learning skills, and some statistics and workflow skills. It does not appear to include SQL.</p>\n<p><strong>Cost:</strong> $792.80</p>\n<p><strong>Prerequisites:</strong> None.&nbsp;</p>\n<p><strong>Time commitment:</strong> One year and five months. Course progress doesn’t carry over from session to session, so it could require more time if you’re not able to complete a course within its course run.</p>\n<p><strong>Reviews:</strong> Quantitative third-party reviews are difficult to find.</p>\n<ul>\n<li>4.6/5 average on <a href=\"https://www.classcentral.com/course/edx-data-science-r-basics-9253\" target=\"_blank\" rel=\"noreferrer noopener\">Class Central</a> (11 reviews)</li>\n</ul>\n<h3 id=\"h-certified-analytics-professional\"><strong>Certified Analytics Professional</strong></h3>\n<p><strong>What you’ll learn:</strong> Potentially nothing–this is simply <a href=\"https://www.certifiedanalytics.org/for_professionals.php\" target=\"_blank\" rel=\"noreferrer noopener\">a certification exam</a>. However, test prep courses are available.</p>\n<p><strong>Cost:</strong> The certification test costs $695 and includes limited prep materials. Dedicated <a href=\"https://info.informs.org/cap-prep-class?__hstc=268633774.0c56a6591bfff14959f15f035db16099.1595945843118.1595945843118.1595945843118.1&__hssc=268633774.1.1595945843118&__hsfp=2448812667&hsCtaTracking=a0c84ba6-a21a-4a7d-8d58-0acd84ac74f1%7Cf99e2192-6448-4780-abc2-b5b65913031a\" target=\"_blank\" rel=\"noreferrer noopener\">prep courses are available</a> for an additional cost.</p>\n<p><strong>Prerequisites:</strong> An application is required to take the certification exam. Since no course is included, you’ll need to learn the required information on your own or sign up for a course separately.</p>\n<p><strong>Time commitment:</strong> The exam itself is relatively short. The dedicated prep courses take 1-2 months, depending on options. They are not required for taking the exam.</p>\n<p><strong>Reviews:</strong> Quantitative third-party reviews are difficult to find. Here are some independent opinions about the certification:</p>\n<ul>\n<li><a href=\"https://www.reddit.com/r/datascience/comments/e73uvu/is_certified_analytics_professional_cap_bs/\" target=\"_blank\" rel=\"noreferrer noopener\">Reddit thread about CAP</a></li>\n<li><a href=\"https://www.quora.com/What-is-your-opinion-about-the-Certified-Analytics-Professional-accreditation\" target=\"_blank\" rel=\"noreferrer noopener\">Quora thread about CAP</a></li>\n</ul>\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/q-eh-kMg0bOAJBZoaLudq2OKA3WGqs7H62kPoNVWolY_xelQoL9GvFSUnXxHeb3admNH7FRnKhN4RIR7_hUOijVwZCx_gJNIv0w9fdZL0JreTQfMMN3bz3Ls0GzNzwYTe_QBXF8iieAgrFB-6EbnpF1MXrtWsORyFnaYtgewFvYhm_tUwFmXHgpMuw\" alt=\"google cloud data certification\" title=\"download\"/></figure>\n<h3 id=\"h-from-data-to-insights-with-google-cloud\"><strong>From Data to Insights with Google Cloud</strong></h3>\n<p><strong>What you’ll learn:</strong> <a href=\"https://www.coursera.org/specializations/from-data-to-insights-google-cloud-platform\" target=\"_blank\" rel=\"noreferrer noopener\">This course</a> covers SQL data analysis skills with a focus on using BigQuery and Google Cloud’s data analysis tool.</p>\n<p><strong>Cost:</strong> A Coursera subscription, which is required, costs $39/month. Coursera estimates that most students will need two months to complete the program.</p>\n<p><strong>Prerequisites:</strong> The course page says: “We recommend participants have some proficiency with ANSI SQL.” It’s not clear what level of SQL proficiency is required.</p>\n<p><strong>Time commitment:</strong> Coursera estimates that most students will need two months to complete the program, but students can work at their own pace. However, courses do begin on prescribed dates.</p>\n<p><strong>Reviews:</strong> Quantitative third-party reviews are difficult to find, but:</p>\n<ul>\n<li>4.7/5 rating on Coursera itself (3,712 ratings)</li>\n</ul>\n<h2 id=\"h-tip-beware-of-prerequisites-and-qualifications\"><strong>Tip: Beware of Prerequisites and Qualifications!</strong></h2>\n<p>Before you start looking for data science courses and certifications, there’s something you need to be aware of.&nbsp;</p>\n<p>While some programs like Dataquest, Coursera, and Udemy do not require any particular background or industry knowledge, many others <em>do</em> have concrete prerequisites.</p>\n<p>For example, DASCA’s Senior Data Scientist Certification tracks require at least a Bachelor’s degree (some tracks require a Master’s degree). That’s in addition to a minimum of 3-5 years of professional data-related experience!</p>\n<p>Some programs, particularly <a href=\"https://www.dataquest.io/blog/data-science-bootcamp/\" target=\"_blank\" rel=\"noreferrer noopener\">offline bootcamps</a>, also require specific qualifications or have extensive application processes. Translation? You won’t be able to jump in right away and begin learning. You’ll need to factor in time costs and application fees for these programs when making your choice.</p>\n<h2 id=\"h-what-about-university-certificates-in-data-science\"><strong>What About University Certificates in Data Science?</strong></h2>\n<p>If you’re considering a data science certificate from a university, don’t.&nbsp;</p>\n<p>Many of the expensive certification programs offered online by brand-name schools are not very meaningful to potential employers. This includes those offered by Ivy-League schools.&nbsp;</p>\n<p>In fact, a number of these online programs are not even administered by the schools themselves. Instead, they’re run <a href=\"https://www.huffpost.com/highline/article/capitalist-takeover-college/\" target=\"_blank\" rel=\"noreferrer noopener\">by for-profit, third-party firms called Online Program Managers</a>. </p>\n<p>What’s worse is that data science recruiters know this. That’s right&#8211;employers are keenly aware that a Harvard-affiliated certificate from EdX and a Harvard University degree are two <em>very different</em> things.</p>\n<p>Plus, most data science hiring managers will not have time to research the academic rigor of every data science certification they see on a résumé. So even if your university-based certificate is actually worth something, recruiters likely won’t notice it.&nbsp;</p>\n<p>On average, most résumés are only given 30 seconds of review time. Since certificates don’t tell much about a candidate’s ability, more focus will be given on skills and projects.</p>\n<p>Entry-level applicants are evaluated from the data science projects that are listed on the résumé or found on GitHub. Higher-level applicants are assessed on previous industry experience and completed projects, not certificates.&nbsp;</p>\n<h3 id=\"h-the-sticker-shock-of-university-certificates\">The Sticker Shock of University Certificates</h3>\n<p>University certificates tend to be quite expensive. For example, consider the cost of some of the most popular options out there:</p>\n<ul>\n<li><a href=\"https://www.ecornell.com/certificates/data-science/data-analytics/\" target=\"_blank\" rel=\"noreferrer noopener\">Cornell’s three-week data analytics certificate</a> – $3,600</li>\n<li><a href=\"https://learnmore.duke.edu/certificates/data-science\" target=\"_blank\" rel=\"noreferrer noopener\">Duke’s big data and data science certificate</a> – $3,195</li>\n<li><a href=\"https://scs.georgetown.edu/programs/375/certificate-in-data-science/\" target=\"_blank\" rel=\"noreferrer noopener\">Georgetown’s professional certificate in data science</a> – $7,496</li>\n<li><a href=\"https://extension.berkeley.edu/public/category/courseCategoryCertificateProfile.do?method=load&certificateId=28652248\" target=\"_blank\" rel=\"noreferrer noopener\">UC Berkeley’s data scientist certification program </a>– $5,100</li>\n<li><a href=\"https://www.extension.harvard.edu/academics/professional-graduate-certificates/data-science-certificate\" target=\"_blank\" rel=\"noreferrer noopener\">Harvard’s data science certificate </a>– $11,600</li>\n</ul>\n<h2 id=\"h-how-to-get-the-data-science-skills-employers-desire\"><strong>How to Get the Data Science Skills Employers Desire</strong></h2>\n<p>We’ve established that recruiters and hiring managers in data science are looking for real-world skills, not certifications. What’s the best way to get the skills you need?</p>\n<p><strong>Hands-down, the best way to acquire compelling data science skills is by digging in and getting your hands dirty with actual data.&nbsp;</strong></p>\n<p>Choose a data science course that lets you complete projects as you learn. Then, showcase your know-how with digital portfolios that employers can access when considering your application.&nbsp;</p>\n<p>At Dataquest, our courses are interactive and <a href=\"https://www.dataquest.io/data-science-projects/\" target=\"_blank\" rel=\"noreferrer noopener\">project-based</a>. They’re designed so that students can immediately apply their learning and document their newfound skills to get the attention of recruiters. <a href=\"https://app.dataquest.io/signup\" target=\"_blank\" rel=\"noreferrer noopener\">Sign up for free</a> today, and launch your career in the growing field of data science!</p>\n<script id=\"blog-cta-template-gallery\" type=\"x-tmpl-mustache\"> <div class=\"row\"> <div class=\"col-lg-6 col-md-12 col-sm-12\"> <div class=\"row\"> <div class=\"col-md-12 text-start mb-3\"> <h2 class=\"pt-0\">{{headline}}</h2> </div> <div class=\"col-md-12 text-start d-inline-flex\"> <!-- Icon Blocks --> <span class=\"fa-stack\"> <i class=\"fa-regular fa-circle fa-stack-2x\"></i> <strong class=\"fa-stack-1x\">1</strong> </span> <div class=\"ms-6\"><h3>{{props.0}}</h3></div> <!-- End Icon Blocks --> </div> <div class=\"col-md-12 text-start d-inline-flex mt-3\"> <!-- Icon Blocks --> <span class=\"fa-stack\"> <i class=\"fa-regular fa-circle fa-stack-2x\"></i> <strong class=\"fa-stack-1x\">2</strong> </span> <div class=\"ms-6\"><h3>{{props.1}}</h3> </div> <!-- End Icon Blocks --> </div> <div class=\"col-md-12 text-start d-inline-flex mt-3\"> <!-- Icon Blocks --> <span class=\"fa-stack\"> <i class=\"fa-regular fa-circle fa-stack-2x\"></i> <strong class=\"fa-stack-1x\">3</strong> </span> <div class=\"ms-6\"><h3>{{props.2}}</h3> </div> <!-- End Icon Blocks --> </div> <button class=\"btn btn-primary mt-6 w-100\">Start Now</button> </div> </div> <div class=\"col-lg-6 col-md-0 col-sm-0\"> <div class=\"d-inline align-middle d-none d-lg-block\"> <img src=\"https://www.dataquest.io/wp-content/uploads/2022/04/francisco_small.jpeg\" class=\"w-75 avatar-4x3\"> </div> </div> </div></script><script type=\"text/javascript\"> let tools = { 'data': { 'headline': 'Learn data skills for free', 'props': [\"Take 75+ interactive courses\", \"Apply your skills with projects\", \"Join 1M+ learners\"] }, 'python': { 'headline': 'Learn Python the right way', 'props': [\"Take 75+ interactive courses\", \"Apply your skills with projects\", \"Join 1M+ learners\"] }, 'sql': { 'headline': 'Learn SQL the right way', 'props': [\"Take 75+ interactive courses\", \"Apply your skills with projects\", \"Join 1M+ learners\"] }, 'r': { 'headline': 'Learn R the right way', 'props': [\"Take 75+ interactive courses\", \"Apply your skills with projects\", \"Join 1M+ learners\"] } }; document.addEventListener('DOMContentLoaded', function() { let cta_id = \"blog-cta-7448\"; let template_id = \"blog-cta-template-gallery\"; let template = document.getElementById(template_id).innerHTML; let wrapper = document.getElementById(cta_id); let data = tools[\"data\"]; let template_html = Mustache.render(template, data); wrapper.innerHTML = template_html; });</script><div class=\"text-center text-white bg-dark my-5 p-6 rounded-1 h-white\" id=\"blog-cta-7448\"></div>"
}