{
  "title": "US Messaging to Russian Citizens: Time to Step It Up?",
  "link": "https://jamestown.org/us-messaging-to-russian-citizens-time-to-step-it-up/",
  "dc:creator": "web1983",
  "pubDate": "Fri, 13 Nov 2020 14:41:23 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=87808",
  "description": "<p>In the first week of August, cellphones across Russia lit up with surprising text messages. They came from different numbers, but each said the same thing in Russian: “The US State Department is offering up to $10 million for information about interference in the US elections. If you have information, contact rfj.tips/bngc.” The State Department confirmed the messages were authentic &#8230; <a href=\"https://jamestown.org/us-messaging-to-russian-citizens-time-to-step-it-up/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/us-messaging-to-russian-citizens-time-to-step-it-up/\">US Messaging to Russian Citizens: Time to Step It Up?</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>In the first week of August, cellphones across Russia lit up with surprising text messages. They came from different numbers, but each said the same thing in Russian: “The US State Department is offering up to $10 million for information about interference in the US elections. If you have information, contact rfj.tips/bngc.” The State Department confirmed the messages were authentic (<a href=\"https://tvrain.ru/news/gosdepartament_ssha_predlozhil_rossijanam_10_mln_dollarov_v_obmen_na_informatsiju_o_vmeshatelstve_v_vybory-513890/\">TV Rain</a>, August 6). They came from the department’s “Rewards for Justice Program,” which had just expanded from hunting terrorists to tracking election interference.</p>\n<p>Russian authorities ridiculed the messages. But their reaction suggested they saw something more sinister. “By offering money to talk about interference in American elections, American intelligence is blatantly interfering in our life,” declared Maria Zakharova, spokesperson for the Russian Ministry of Foreign Affairs. “What is this, if not the most real kind of hybrid attack?” (<a href=\"https://www.vedomosti.ru/society/news/2020/08/06/836122-zaharova-otreagirovala-na-sms-rassilku\">Vedomosti</a>, August 6).</p>\n<p>Zakharova’s reference to hybrid warfare suggested that Russian officials were paying as much attention to the medium as to the message. They undoubtedly realized the potential of the United States deciding to reach out to individual Russians so directly. In the future, US messages might not be about American elections, but about Russian foreign policy or internal conditions.</p>\n<p>As it readies its policy toward Russia, the incoming Joseph Biden administration will need to decide whether to let Vladimir Putin’s government be its sole interlocutor in Russia, or if it will regularly go beyond the Kremlin to communicate directly to the Russian population.</p>\n<p>In recent years, US government agencies have hesitated about messaging campaigns to Russian citizens. Several proposals have been considered but set aside. The reasons for pulling back ranged from a fear that such messaging would be too provocative to a belief it would have little effect given the power of Putin’s internal propaganda. At the same time, online platforms like YouTube and social networks offer access to Russian citizens as never before. “In an age of openness, we’ve stopped trying to communicate with the Russian people,” says Peter Pomerantsev, the British specialist on Russia and the information war. “The opportunities are just there to be seized” (see <a href=\"https://jamestown.org/event/upcoming-virtual-book-launch-striking-back-overt-and-covert-options-to-combat-russian-disinformation/\">Jamestown.org</a>, October 23).</p>\n<p>Of course, two US government-financed broadcasting networks—<em>Radio Free Europe/Radio Liberty</em> and <em>Voice of America</em>—have been speaking to Russian citizens for decades. They have never shied away from talking about internal conditions in Russia or the costs of its foreign adventures. Under the law, however, the broadcasters enjoy editorial independence. They cannot be harnessed to convey specific messages or told to turn up or reduce the heat on an adversary. If the new administration wants to communicate to Russians in a way that is precisely calibrated with its policy goals, it will need to develop its own messaging tools and doctrine.</p>\n<p>Many US officials and analysts are wary of anything that looks like a US government “propaganda offensive” to Russia. They ask what such messages would even look like. If they bore the brands of US government agencies, they say, Russians would view them with contempt. If they were unattributed—not revealing where they came from—their source would likely be exposed anyhow. Then the US would be accused of descending to the same level as Russian covert information operators. (The nature of the August text messages suggested they came from US authorities, but they were not signed.)</p>\n<p>Others, however, believe stepped-up communication to Russians is not only reasonable but essential. Dmitri Teperik of Estonia’s International Center for Defense and Security calls for a “ruthless projection of truth” to Putin’s people (<a href=\"https://icds.ee/en/does-the-west-dare-to-open-the-eastern-front-of-information-war/\">Icds.ee</a>, June 8, 2020). Such an effort might even add stability to the US-Russian relationship by establishing a balance of information power. Especially with a new administration that is highly aware of Russian operations, the United States cannot indefinitely tolerate Russia assaulting the US information space with impunity. Unless Washington develops a concept and capability for response, US frustration over Russian provocations could boil over into an overreaction that could escalate beyond the information realm.</p>\n<p>During the 2018 midterm elections, US Cyber Command launched an electronic strike on Russia’s Internet Research Agency, a major troll farm, and briefly cut it off from the internet. (see <a href=\"https://jamestown.org/program/another-step-forward-toward-sovereign-russian-internet/\">EDM</a>, February 27, 2019). Writing after that action, Benjamin Jensen and Brandon Valeriano of Marine Corps University said, “It’s valuable for the US to introduce friction against enemies who seek to harm the American way of life. But it’s equally important to consider the potential for escalation to more widely harmful forms of conflict. […] Quick wins, like shutting down a troll factory for a few days, could produce much bigger longer-term consequences in a connected world” (<a href=\"https://www.navytimes.com/news/your-navy/2019/03/13/waging-war-against-the-troll-farms/\">Navy Times</a>, March 13, 2019).</p>\n<p>US messaging to Russia, as a response to Russian messaging to the US, would be more symmetrical than a cyber strike and present less chance of a spillover to other domains. Any new campaign should be based on a coherent US policy toward the Kremlin, which the new administration is drafting now. Then, depending on how US-Russian relations evolve in the first part of the Biden administration, US messaging could be targeted to whatever goals policymakers found appropriate.</p>\n<p>These could include:</p>\n<ul>\n<li>Inflaming popular discontent in Russia, already on the rise, with the goal of sparking a “color revolution” that would bring down Putin’s regime.</li>\n<li>Encouraging incremental change in Russia through pressure for basic freedoms and against adventurism abroad.</li>\n<li>Improving Russians’ view of the United States by “telling America’s story” more effectively.</li>\n<li>Demonstrating that the US, too, has “information teeth,” and can penetrate Russia’s own information environment if Kremlin operations cross red lines.</li>\n<li>Simply creating new, well-promoted communication channels for the day they may suddenly be needed for urgent messaging.</li>\n</ul>\n<p>Any hope that Western messaging to the general Russian population can chase Putin from office is probably fanciful. Should he fall from power, the impetus could well come not from ordinary people, but from a decision by Kremlin powerbrokers that his policies have outlived their usefulness.</p>\n<p>If the goal is more incremental change in Russia, increased communication from the United States and its allies could play a role. A growing number of Russians already see the West as a potential friend or partner, and are unenthusiastic about seizing other countries’ territory (Levada, <a href=\"https://www.levada.ru/2019/05/06/sobytiya-v-sirii/?fromtg=1\">May 6, 2019</a> and <a href=\"https://www.levada.ru/en/2020/02/28/russia-and-the-west/\">February 28, 2020</a>; <a href=\"https://www.thechicagocouncil.org/publication/lcc/russians-want-crimea-prefer-luhansk-and-donetsk-independent\">Thechicagocouncil.org,</a> April 3, 2019). “I wonder how many Russians, as opposed to what the Kremlin wants, want to actually be a normal European country in the international community,” asks Pomerantsev. “Can we start […] a broader dialogue with the Russian population about how they see Russia’s role in the world? Is it the same as the role the Kremlin has given them, which is these rogue pariahs?” (see <a href=\"https://jamestown.org/event/upcoming-virtual-book-launch-striking-back-overt-and-covert-options-to-combat-russian-disinformation/\">Jamestown.org</a>, October 23, 2020). US messaging might also be designed to aid and amplify Russia’s own liberal-minded independent journalists, social influencers and civil society. They have been courageous advocates for basic freedoms at home and constructive policies abroad.</p>\n<p>Since much of Putin’s legitimacy rests on his being a bulwark against the West, US messaging should seek to improve Russians’ view of the United States. The goal would not be to whitewash the US’s failings, but to recognize its successes and demonstrate that few Americans have any interest in invading or humiliating Russia. The most effective communications will probably not consist of quoting US officials. More convincing voices might be those of US celebrities known in Russia, and recent Russian emigrants who have forged rewarding lives in the United States. However, Biden himself should consider an early address to the Russian people. It can be on YouTube if Putin will not grant him the appearances on Russian television that the Soviet Union allowed Ronald Reagan in 1986 and Margaret Thatcher in 1987 (<a href=\"https://www.margaretthatcher.org/document/106604\">Margaretthatcher.org</a>, March 31, 1987; <a href=\"https://www.reaganlibrary.gov/archives/speech/new-years-messages-president-reagan-and-soviet-general-secretary-gorbachev-0\">Reaganlibrary.gov</a>, January 1, 1986). Such a speech would demonstrate to Russians that Biden sees them not just as disciples of their president, but as a people with their own dignity and agency.</p>\n<p>Demonstrating “information teeth” would not aim to change anything inside Russia in the short term. Rather, the United States and its allies could launch small demonstration campaigns with political or non-political content, just to make clear they have the tools and social insight to affect Russian attitudes if they so choose. Such demonstrations would be the cognitive equivalent of the US government’s reported placement of potentially crippling software inside the Russian electrical grid, designed to be visible to the Russians as a signal of what the US is capable of (<a href=\"https://www.nytimes.com/2019/06/15/us/politics/trump-cyber-russia-grid.html\">The New York Times</a>, June 15, 2019).</p>\n<p>As for establishing new channels to reach Russia’s population, failing to do so seems almost irresponsible—especially when Russia runs a 24-hour television channel visible across the United States, and AM and FM radio stations in Washington and Kansas City. If the United States government must suddenly reach the Russian people in an urgent situation, it cannot start building social accounts and websites at that moment. It makes sense to establish a panoply of sites and accounts now with a wide variety of content, and work to build audiences for the day they are needed. US branding is not necessarily a dealbreaker; at the very least, the United States is a constant subject of Russian curiosity.</p>\n<p>Many of the tactics above can be implemented by a wide variety of actors. A growing number of non-governmental pro-democracy groups have appeared in recent years that have broad experience with social network campaigns and websites. Several are located in former Soviet-bloc countries, meaning they can work easily in Russian. Small amounts of US support could encourage them to engage Russian citizens, each group using themes it develops on its own.</p>\n<p>Policy papers often imagine the United States “working closely with allies” on information strategies against Russia. Such cooperation may well founder on those governments’ reluctance to stand up to the Kremlin—for reasons of domestic politics, fear of Russian retaliation or an aversion to “doing propaganda.” Non-governmental activists have fewer such concerns. They also tend to be more creative and nimble than government departments.</p>\n<p>A potential obstacle to messaging to Russia is the possibility that the Kremlin could close off its internet to content originating abroad. In May 2019, Putin signed a law that would allow authorities to disconnect the so-called Runet from the rest of the world in extreme situations. This project is technically problematic and may never succeed. However, even if the ultimate “cutoff switch” never appears, the Kremlin will likely develop some new barriers to foreign web and social network penetration (see EDM, <a href=\"https://jamestown.org/program/drawing-the-cyber-curtain-will-russia-follow-the-chinese-example/\">June 23, 2016</a>, <a href=\"https://jamestown.org/program/fsb-formidable-player-russias-information-security-domain/\">March 27, 2018</a>, <a href=\"https://jamestown.org/program/another-step-forward-toward-sovereign-russian-internet/\">February 27, 2019</a>).</p>\n<p>For this reason, any strategy to communicate with Russian citizens must include alternative technical options. Text messages are a simple possibility. Email, if allowed by the “cutoff switch,” can carry text and video attachments. Russians likely would become more adept at using VPNs and proxies to reach foreign destinations. A cutoff of foreign content would also raise the importance of Russia’s own independent journalists, social influencers and civil society—whom the West would do well to encourage now.</p>\n<p>As the US looks for new responses to Russian information violence, there will likely be more pressure to shoot not only the arrow but the archer—not only to protect our own populations from Russian disinformation, but to respond with information tools directed at Russia’s own population. Strategies for the Biden administration must be built on a clear consensus of what such actions would aim to accomplish and the best tools to do the job.</p>\n<p>&nbsp;</p>\n<figure id=\"attachment_87464\" class=\"wp-caption alignleft\" style=\"width: 102px;\"><a href=\"https://jamestown.org/product/striking-back/\"><img loading=\"lazy\" class=\"align wp-image-87464\" src=\"/wp-content/uploads/2020/10/Striking-Back-front-cover.jpg\" alt=\"\" width=\"102\" height=\"152\" srcset=\"https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover.jpg 1152w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-203x300.jpg 203w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-768x1137.jpg 768w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-692x1024.jpg 692w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-123x182.jpg 123w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-640x947.jpg 640w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-300x444.jpg 300w, https://jamestown.org/wp-content/uploads/2020/10/Striking-Back-front-cover-600x888.jpg 600w\" sizes=\"(max-width: 102px) 100vw, 102px\" /></a></figure>\n<p><em>Thomas Kent, a former president of Radio Free Europe/Radio Liberty, teaches about disinformation and Russian affairs at Columbia University’s Harriman Institute. This article is based in part on his new book published by Jamestown, </em><a href=\"https://jamestown.org/product/striking-back/\"><em>Striking Back: Overt and Covert Options to Combat Russian Disinformation</em></a><em>, and on an October 23 Jamestown </em><a href=\"https://jamestown.org/event/upcoming-virtual-book-launch-striking-back-overt-and-covert-options-to-combat-russian-disinformation/\"><em>webinar</em></a><em> with Kent and Pomerantsev on communicating to Russians.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/us-messaging-to-russian-citizens-time-to-step-it-up/\">US Messaging to Russian Citizens: Time to Step It Up?</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}