{
  "guid": "prx_137_9e717b72-fe22-4614-9e4e-3d68a02593d8",
  "title": "750 - Sandman in Toyland | Untold Tales",
  "pubDate": "Thu, 28 Feb 2019 00:00:00 -0000",
  "link": "https://beta.prx.org/stories/268539",
  "description": "<p>(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 18:00)<br>\n<br>\nCheck out “Conversations With People Who Hate Me” with Dylan Marron in your podcast app or at <a href=\"http://www.dylanmarron.com/podcast/\" rel=\"nofollow\" target=\"_blank\">http://www.dylanmarron.com/podcast/</a><br>\n<br>\nTonight’s episode is sponsored by Zola - To start your free wedding website and also get $50 off your registry on Zola, go to <a href=\"http://www.zola.com/sleep\" rel=\"nofollow\" target=\"_blank\">zola.com/sleep</a></p>\n\n<p>Zola, the wedding company that will do anything for love, is reinventing the wedding planning and registry experience to make the happiest moment in couples' lives even happier. From engagement to wedding and decorating your first home, Zola is there, combining compassionate customer service with modern tools and technology. All in the service of love.</p>\n\n<p>Tonight’s episode is sponsored by Brooklinen, luxury bedding, at amazing prices. You have to try these sheets today! There is an exclusive offer just for Sleep With Me listeners.<br>\nGet $20 off AND free shipping when you use <strong>promo code [WITHME] at <a href=\"http://www.brooklinen.com\" rel=\"nofollow\" target=\"_blank\">http://www.brooklinen.com</a></strong>.<br>\nBrooklinen is SO confident that they offer **a risk-free 60-night satisfaction guarantee and a lifetime warranty on all of their sheets and comforters! **</p>\n\n<p>Tonight’s episode is sponsored by <a href=\"http://www.kushycbd.com/sleep\" rel=\"nofollow\" target=\"_blank\">KushyCBD</a> - which uses full spectrum CBD oil, which uses a wide variety of healthy cannabinoids—except THC!—flavonoids, terpenes, and fibers. CBD has been shown to be an effective treatment for insomnia, anxiety, and can alleviate stress. Use <strong><a href=\"http://www.kushycbd.com/sleep\" rel=\"nofollow\" target=\"_blank\">www.kushycbd.com/sleep </a>and promo code \"sleep20\"</strong>for 20% off your first purchase. </p>",
  "enclosure": "",
  "itunes:title": "Sandman in Toyland | Untold Tales",
  "itunes:subtitle": "Tom-tom and Bo Peep take a nap on a nice bed of grass, while Scoots meets a Wizard in professional pajamas.",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:episode": 750,
  "itunes:duration": "01:07:11"
}