{
  "id": "https://bibleinoneyear.org/en/youth/49",
  "title": "Day 49: Your Love Letter",
  "description": "Psalm 22:27–31, Exodus 23:1-9, 24:8, Mark 3:35, 4:10–29.  The New Testament is obviously about Jesus  However, Jesus said of the Scriptures that were available in his lifetime (that is, the Old Testament): ‘These are the very Scriptures that testify *about me’* (John 5:39)",
  "pubDate": "Fri, 18 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/49/",
  "itunes:duration": "12:38",
  "guid": "enyouth18022022-49",
  "length": 758.33,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 49: Your Love Letter",
  "itunes:subtitle": "Psalm 22:27–31, Exodus 23:1-9, 24:8, Mark 3:35, 4:10–29.  The New Testament is obviously about Jesus  However, Jesus said of the Scriptures that were available in his lifetime (that is, the Old Testament): ‘These are the very Scriptures that testify *about me’* (John 5:39)",
  "itunes:summary": "Thankfully, there have been very few times since our relationship began that I have been apart from my wife Pippa. However, before we were married, there was a period of three weeks when I was away. In those days, without email or mobile phones, our only way of communication was by letter.\nI wrote every day. She wrote every day. I remember so well the feeling of intense excitement and joy when I saw the handwriting on the envelope and knew that a letter from Pippa was inside.\nI would quickly take the letter and go off to a quiet place by myself to study it! The actual letter wasn’t valuable, but the fact that it was written by the person I love made it so precious to me.\nThe Bible is a love letter from God to you. What makes the Bible so exciting is not the book itself, but the fact that through it we encounter the person we love. The whole Bible is about Jesus. The New Testament is obviously about Jesus. However, Jesus said of the Scriptures that were available in his lifetime (that is, the Old Testament): ‘These are the very Scriptures that testify about me’ (John 5:39).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 414
}