{
  "title": "S14 Ep41: Science Was Wrong: A Farewell To Stanton T. Friedman",
  "link": "https://audioboom.com/posts/8098589",
  "itunes:episode": 41,
  "itunes:title": "Science Was Wrong: A Farewell To Stanton T. Friedman",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6054,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS honors and pays respect to the late UFOlogist, Stanton Friedman.<br>\n<br>\nIn a weekend of memorial shows dedicated to the life of Ufologist Stanton T. Friedman, BEYOND the DARKNESS offers up an encore presentation of an interview with Stanton and his co-author, Kathleen Marden on their book, Science Was Wrong: Startling Truths About Cures, Theories, and Inventions \"They\" Declared Impossible.<br>\n<br>\nGet the Book: <a href=\"http://www.stantonfriedman.com\">www.stantonfriedman.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS honors and pays respect to the late UFOlogist, Stanton Friedman.\n\nIn a weekend of memorial shows dedicated to the life of Ufologist Stanton T. Friedman, BEYOND the DARKNESS offers up an encore presentation of an interview...",
  "pubDate": "Sun, 19 May 2019 08:00:00 +0000",
  "guid": "55d2e610-b3e0-4470-a508-293e0481073e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}