{
  "title": "Linux Developer Laptops: Dell's Precision 5500 series reigns supreme",
  "link": "",
  "published": "2019-09-23T00:00:00-07:00",
  "updated": "2019-09-23T00:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2019-09-23:/blog/linux-laptop-experience/",
  "summary": "<p>About 6 years ago I gave up on Apple laptops and switched to Linux full\ntime. When I'm at home, I prefer to work on a well-equipped desktop with a\nlarge monitor and one of my beloved Kinesis Advantage keyboards. But I am on\nthe road a lot for work …</p>",
  "content": "<p>About 6 years ago I gave up on Apple laptops and switched to Linux full\ntime. When I'm at home, I prefer to work on a well-equipped desktop with a\nlarge monitor and one of my beloved Kinesis Advantage keyboards. But I am on\nthe road a lot for work and so I need to do a lot of hacking on the go.</p>\n<p>My initial reasons for giving up on OS X / macOS were due to my frustrations\naround developer tooling and package management, problems now largely solved by\nHomebrew. I got tired of being able to easily do certain kind of development on\nLinux and then struggle to get all the required pieces set up in the same way\non OS X. Then, as soon as Homebrew began to resolve all that, Apple decided to\nruin its laptops through the introduction of the awful and annoyingly-loud\nbutterfly keyboard and touchbar.</p>\n<p>I've used a variety of Linux laptops over the last 6 years and wanted to share\na bit of my experience to help others who are considering being Linux-only, or\nmaybe are looking to buy their next Linux laptop. These laptops include:</p>\n<ul>\n<li>Lenovo Thinkpad X230</li>\n<li>Lenovo Thinkpad X250</li>\n<li>Dell Precision 5510 (2016 era) with Ubuntu 14.04 certified pre-install</li>\n<li>Dell XPS 13 2-in-1 (2017 era)</li>\n<li>Dell XPS 15 (2017 era)</li>\n<li>Lenovo Thinkpad X1 Carbon (6th generation)</li>\n<li>Lenovo Thinkpad P1 15.6\" (2018 era)</li>\n<li>Precision 5540 (2019 era) with Ubuntu 18.04 certified pre-install</li>\n</ul>\n<p>I just spent the better part of this past year year struggling with the\nThinkpad P1, Lenovo's latest effort to compete with Dell's XPS 15 and Precision\n5500 line. I had had a Precision 5510 in the past, which had been my favorite\nlaptop of all time, except for some small issues that led me to explore\nLenovo's latest.</p>\n<p>I was talking with the Dell folks recently about my experiences with (and\ngeneral fussiness regarding) Linux laptops and they offered to send me a new\nPrecision 5540 to give them constructive feedback. After a few days with the\nnew machine, it was obvious that it was the machine for me and I shut down my\nThinkpad P1 for good.</p>\n<p>The rest of this post will be comparing the P1 and 5540 to hopefully help other\ndevelopers make a decision about which one to get.</p>\n<h2>High level view</h2>\n<p>On paper, the Lenovo P1 and Dell 5540 spec-wise are very similar:</p>\n<ul>\n<li>Similar 15.6\" compact form-factor, weighing in at about 4 pounds. The 55xx is\n  slightly smaller while both laptops have the same general shape.</li>\n<li>Crisp IPS screens. I buy the 1080p variants so I get the best battery life\n  possible for long-haul flights.</li>\n<li>Latest high-end Intel Xeon or i9 processors, now 8 physical cores</li>\n<li>Both embedded Intel and discrete NVIDIA GPUs, to get better battery life when\n  I don't need to test any CUDA stuff</li>\n<li>Large 80-100wH batteries</li>\n<li>Up to 64 GB of RAM</li>\n</ul>\n<p>Since I do a lot of C++ compilation for Apache Arrow development, having a\nbeefy laptop on-the-go is essential to my productivity. Thus, I prefer the\nbalance that these machines strike between portability and power.</p>\n<p>One downside of these laptops is the 130W power brick which sucks too much\namperage to work on airplanes. Dell sells a \"Power Companion\" portable battery\nwhich can give you a few more hours of runtime.</p>\n<p>Ultimately, there are a few dimensions that set the machines apart:</p>\n<ul>\n<li>Linux support</li>\n<li>Keyboard and Trackpad ergonomics</li>\n<li>Overall battery life</li>\n<li>Noise and heat management</li>\n</ul>\n<p>Some of these (like the keyboard) are a matter of taste, but Dell's machine\nwins in pretty much all of these categories for me.</p>\n<h2>Linux support</h2>\n<p>Dell ships a pre-installed a customized Ubuntu LTS release (currently 18.04)\nwith everything working pretty much perfectly out of the box. I presume they've\ndone various tweaking of power management settings and CPU throttling to\nmaximize battery life as well (more on this below).</p>\n<p>On the Lenovo, I had to install Linux myself, but I found that the pop! OS\ndistribution from System76 worked pretty much out of the box and even dealt\nwith gnarliness around the dual-GPU situation.</p>\n<p>So I would say Linux-wise things are similar here. The downside of the Dell\nsolution is that if you install a different distribution, things may not work\nas well or may yield worse battery life. I'm too scared to try, and Ubuntu\n18.04 works well enough anyway.</p>\n<p>I had a Precision 5510 from 2016 for over 3 years and being stuck on Ubuntu\n14.04 eventually became a problem when Canonicial stopped providing package\nupdates. I tried installing stock Ubuntu from ubuntu.com and found that a\nnumber of things didn't work right. This was important stuff like Suspend; I'd\npull my laptop out of my backpack and find that it had died on me despite\nhaving a half full battery when I put it in the bag.</p>\n<p>I hope to see Dell offer (if they are not planning to already) an upgrade path\nto Ubuntu 20.04 LTS but can understand that supporting different hardware\neditions on multiple Linux distributions can be a lot of work.</p>\n<h2>Keyboards and Trackpad</h2>\n<p>Now having had several Lenovo laptops, I think the keyboard quality has gone\ndownhill. Maybe they strived to have a \"meaty\" keypress with much longer key\ntravel to distinguish themselves further from Apple's nearly zero-travel\nbutterfly keyboards. The result for me is that I don't feel very \"fluent\" on a\nLenovo keyboard and the stiff keys with long-key travel were causing me so much\nhand fatigue that I stopped bothering trying to write lots of code on the road.</p>\n<p>The Dell Precision keyboard on the other hand I find much more pleasurable to\nwork on. The keys are responsive with medium travel, and I don't feel as much\nfatigue in long coding sessions. The feel is probably most similar to Apple's\nkeyboards from the 2012 to 2015 era, before they ruined things with Jony Ive's\nthinness obsession.</p>\n<p>Since I try to avoid excess mousing, trackpads are less important to me, but I\nfound the Lenovo trackpad so bad that I always carried an external Bluetooth\nmouse with me. Dell's trackpads are acceptable, not as good as Apple's but good\nenough.</p>\n<h2>Battery Life and Power Management</h2>\n<p>Power management I think is where Dell's OEM Linux really shines. I'm getting\nsomething like 10-14 hours of battery life with the Precision 5540 with the\nWiFi turned off and without doing a lot of code compilation. This is about\ntwice as good as the battery life I was getting on the Precision 5510 when it\nwas brand-new, so Dell has evidently taken Linux power tweaking seriously.</p>\n<p>The Lenovo battery life was a mixed bag. There are some times that I would get\nupwards 8 hours out of a single charge, but normally it was closer to 6.</p>\n<p>On the thermal management and noise side, I've found that Dell's laptop stays\npretty quiet even during 100% load over a multi-minute period (such as doing a\ncomprehensive build and test for Apache Arrow). Lenovo's laptop on the other\nhand was a mess. When compiling, it would turn on a fairly loud fan and get\nrather hot in my lap to the point of being uncomfortable.</p>\n<h2>Dell XPS 15 vs Precision 55xx line</h2>\n<p>When I've told people about the Precision 55xx line of laptops, I'm often asked\n\"Isn't a Precision 55xx just a rebranded XPS 15 that costs\nmore?\". Cosmetically, the machines look almost identical.</p>\n<p>Having compared the two lines side-by-side, it seems clear to me that the\nPrecision laptop has a higher quality keyboard, and probably some of the other\ninternal components are higher quality also. I find the XPS 15 keyboards\n\"gummy\" and unpleasant. Maybe I got a lemon in the past, who knows.</p>\n<h2>Bottom Line</h2>\n<p>If you are a software developer and considering buying any of these laptops, if\nyou can afford it I'd highly recommend the fully loaded Precision 5540. After a\ncouple of weeks of use, I'm ready to call it the best development laptop I've\never owned.</p>\n<p>As a final nice thing which I haven't mentioned until now, with the latest\niteration of Dell's 15-inch laptops, they fixed the front-facing webcam\nposition to address the infamous \"up the nose\" shot from the XPS and Precision\nline over the last few years.</p>\n<p>Big thanks to the Dell Linux laptop group for sending me a demo unit to\nevaluate their latest offering. I'll be writing a lot of open source software\non this machine over the next couple of years!</p>"
}