{
  "title": "UPainting: Unified Text-to-Image Diffusion Generation with Cross-modal Guidance. (arXiv:2210.16031v3 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2210.16031",
  "description": "<p>Diffusion generative models have recently greatly improved the power of\ntext-conditioned image generation. Existing image generation models mainly\ninclude text conditional diffusion model and cross-modal guided diffusion\nmodel, which are good at small scene image generation and complex scene image\ngeneration respectively. In this work, we propose a simple yet effective\napproach, namely UPainting, to unify simple and complex scene image generation,\nas shown in Figure 1. Based on architecture improvements and diverse guidance\nschedules, UPainting effectively integrates cross-modal guidance from a\npretrained image-text matching model into a text conditional diffusion model\nthat utilizes a pretrained Transformer language model as the text encoder. Our\nkey findings is that combining the power of large-scale Transformer language\nmodel in understanding language and image-text matching model in capturing\ncross-modal semantics and style, is effective to improve sample fidelity and\nimage-text alignment of image generation. In this way, UPainting has a more\ngeneral image generation capability, which can generate images of both simple\nand complex scenes more effectively. To comprehensively compare text-to-image\nmodels, we further create a more general benchmark, UniBench, with well-written\nChinese and English prompts in both simple and complex scenes. We compare\nUPainting with recent models and find that UPainting greatly outperforms other\nmodels in terms of caption similarity and image fidelity in both simple and\ncomplex scenes. UPainting project page \\url{https://upainting.github.io/}.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Li_W/0/1/0/all/0/1\">Wei Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_X/0/1/0/all/0/1\">Xue Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xiao_X/0/1/0/all/0/1\">Xinyan Xiao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_J/0/1/0/all/0/1\">Jiachen Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yang_H/0/1/0/all/0/1\">Hu Yang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_G/0/1/0/all/0/1\">Guohao Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Z/0/1/0/all/0/1\">Zhanpeng Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Feng_Z/0/1/0/all/0/1\">Zhifan Feng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+She_Q/0/1/0/all/0/1\">Qiaoqiao She</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lyu_Y/0/1/0/all/0/1\">Yajuan Lyu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wu_H/0/1/0/all/0/1\">Hua Wu</a>"
}