{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-5544034194448853751",
  "published": "2020-02-13T09:00:00.000-08:00",
  "updated": "2020-02-13T09:08:23.537-08:00",
  "title": "Project Witness: Can VR create empathy?",
  "content": "<i>“We’ve allowed our most vulnerable children to be thrown away, to be traumatized and to be locked up in these jails and prisons, and we’ve got to change this narrative that some children aren’t children.”  — Bryan Stevenson   </i><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-G0kEbnRQnb8/XkV4B0n03jI/AAAAAAAAAxY/oyb7QDs8czYxWhkfWpwWgSkWAOUKhPUzACLcBGAsYHQ/s1600/ProjectWitnessPoster01.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1067\" src=\"https://1.bp.blogspot.com/-G0kEbnRQnb8/XkV4B0n03jI/AAAAAAAAAxY/oyb7QDs8czYxWhkfWpwWgSkWAOUKhPUzACLcBGAsYHQ/s1600/ProjectWitnessPoster01.png\" /></a></div><br /><br />As a human rights lawyer, I spent much of my time visiting girls behind bars. Many were arrested for child prostitution, even though they’d only lived 13 or 14 young years of life — not even close to the age of consent. They were not “child prostitutes,” but victims of child rape and trafficking. In prison, many of the girls were isolated for weeks, spending 23 hours a day in solitary confinement. <br /><br />It was impossible for the struggles of these girls — and more broadly, the 48,000 U.S. children who are behind bars — to be witnessed. Their stories go unseen and unheard. So, to help these girls be more visible, I came to Google in 2015. And as Senior Counsel on Civil and Human Rights, I wanted to wield technology for the greater humanitarian good. YouTube and Google  have  always been a tool for people to change their own narratives. <br /><br />YouTube and Google have also long supported efforts to improve our criminal justice system. Over the last four years, we’ve given over $30M in grants to criminal justice reform organizations, and partnered on projects like Love Letters, helping children send digital love letters to their incarcerated parents on Mother’s and Father’s Day. Through our philanthropy, and use of our platform, we’ve supported the work of those who are trying to do what's right.  <br /><br />That work continues today, with the launch of a project that uses immersive storytelling tools to build empathy through proximity. <br /><br />Today, YouTube and Google, in partnership with the Campaign for Fair Sentencing of Youth (CFSY), are launching Project Witness — a campaign that allows us to learn from formerly incarcerated children using Virtual Reality.  <br /><br />It works like this: The VR film anchors the viewer in the experience of an incarcerated child. You’re able to see and hear the experience of being in solitary confinement from the viewpoint of a child in an adult prison. YouTube is a powerful platform for so much more than entertainment — from advocacy to education and awareness — that is open and accessible by everyone. VR is a unique format to pull the viewer into the story.<br /><br />The film is available to everyone on YouTube, and can be watched on desktop or via a VR headset. We will also feature Project Witness at a number of YouTube Spaces and events throughout the year.  <br /><br /><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jo1gM2LLlIc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><br />Project Witness is one part of YouTube’s ongoing criminal justice initiatives. On February 6, we released an episode of  <a href=\"https://www.youtube.com/watch?v=pUe3pxoAIAY\" target=\"_blank\">BookTube</a> featuring Bryan Stevenson, based on his best-selling memoir “Just Mercy,” which is now also a feature film. And in the next few weeks we will release a documentary that explores the challenges of the cash bail system. <br /><br />YouTube is a platform that seeks to give everyone a voice, and we're proud to support the voices who are changing the way formerly incarcerated children are perceived. That’s why I came here, and I haven’t looked back ever since. <br /><br /><i>Malika Saada Saar, YouTube Social Impact </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}