{
  "title": "Episode 95: &#8220;You Better Move On&#8221; by Arthur Alexander",
  "link": "https://500songs.com/podcast/episode-95-you-better-move-on-by-arthur-alexander/",
  "pubDate": "Thu, 27 Aug 2020 15:09:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=382",
  "description": "Episode ninety-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"You Better Move On\", and the sad story of Arthur Alexander. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/40900349\">\"Mother-In-Law\" by Ernie K-Doe.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created Mixcloud playlists with full versions of all the songs in the episode. This week it's been split into two parts because of the number of songs by Arthur Alexander. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-95a-you-better-move-on-part-1/\">Part one</a>. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-95b-you-better-move-on-part-2/\">Part two.</a>\n\n<a href=\"https://amzn.to/3jdlpmc\">This compilation</a> collects the best of Alexander's Dot work.\n\nMuch of the information in this episode comes from <a href=\"https://amzn.to/34CJOO0\">Richard Younger's biography of Alexander</a>. It's unfortunately not in print in the UK, and goes for silly money, though I believe it can be bought cheaply in the US.\n\nAnd a lot of the background on Muscle Shoals comes from&nbsp;<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L. Hughes</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nBefore we start, a warning for those who need it. This is one of the sadder episodes we're going to be doing, and it deals with substance abuse, schizophrenia, and miscarriage.\n\nOne of the things we're going to see a lot of in the next few weeks and months is the growing integration of the studios that produced much of the hit music to come out of the Southern USA in the sixties -- studios in what the writer Charles L. Hughes calls the country-soul triangle: Nashville, Memphis, and Muscle Shoals.\n\nThat integration produced some of the greatest music of the era, but it's also the case that with few exceptions, narratives about that have tended to centre the white people involved at the expense of the Black people. The Black musicians tend to be regarded as people who allowed the white musicians to cast off their racism and become better people, rather than as colleagues who in many cases somewhat resented the white musicians -- there were jobs that weren't open to Black musicians in the segregated South, and now here were a bunch of white people taking some of the smaller number of jobs that *were* available to them.\n\nThis is not to say that those white musicians were, individually, racist -- many were very vocally opposed to racism -- but they were still beneficiaries of a racist system. These white musicians who loved Black music slowly, over a decade or so, took over the older Black styles of music, and made them into white music. Up to this point, when we've looked at R&B, blues, or soul recordings, all the musicians involved have been Black people, almost without exception. And for most of the fifties, rock and roll was a predominantly Black genre, before the influx of the rockabillies made it seem, briefly, like it could lead to a truly post-racial style of music.\n\nBut over the 1960s, we're going to see white people slowly colonise those musics, and push Black musicians to the margins. And this episode marks a crucial turning point in the story, as we see the establishment of Muscle Shoals, Alabama, as a centre of white people making music in previously Black genres. But the start of that story comes with a Black man making music that most people at the time saw as coded as white.\n\nToday we're going to look at someone whose music is often considered the epitome of deep soul, but who worked with many of the musicians who made the Nashville Sound what it was, and who was as influenced by Gene Autry as he was by many of the more obvious singers who might influence a soul legend. Today, we're going to look at Arthur Alexander, and at \"You Better Move On\":\n\n[Excerpt: Arthur Alexander, \"You'd Better Move On\"]\n\nArthur Alexander's is one of the most tragic stories we'll be looking at. He was a huge influence on every musician who came up in the sixties, but he never got the recognition for it. He was largely responsible for the rise of Muscle Shoals studios, and he wrote songs that were later covered by the Beatles, and Bob Dylan, and the Rolling Stones, as well as many, many more. The musician Norbert Putnam told the story of visiting George Harrison in the seventies, and seeing his copy of Alexander's hit single \"You Better Move On\". He said to Harrison, \"Did you know I played bass on that?\" and Harrison replied, \"If I phoned Paul up now, he'd come over and kiss your feet\". That's how important Arthur Alexander was to the Beatles, and to the history of rock music.\n\nBut he never got to reap the rewards his talent entitled him to. He spent most of his life in poverty, and is now mostly known only to fans of the subgenre known as deep soul.\n\nPart of this is because his music is difficult to categorise. While most listeners would now consider it soul music, it's hard to escape the fact that Alexander's music has an awful lot of elements of country music in it.\n\nThis is something that Alexander would point out himself -- in interviews, he would talk about how he loved singing cowboys in films -- people like Roy Rogers and Gene Autry -- and about how when he was growing up the radio stations he would listen to would \"play a Drifters record and maybe an Eddy Arnold record, and they didn't make no distinction. That's the way it was until much later\".\n\nThe first record he truly loved was Eddy Arnold's 1946 country hit \"That's How Much I Love You\":\n\n[Excerpt: Eddy Arnold, \"That's How Much I Love You\"]\n\nAlexander grew up in Alabama, but in what gets described as a relatively integrated area for the time and place -- by his own account, the part of East Florence he grew up in had only one other Black family, and all the other children he played with were white, and he wasn't even aware of segregation until he was eight or nine.\n\nFlorence is itself part of a quad-city area with three other nearby towns – Muscle Shoals, Sheffield, and Tuscumbia. This area as a whole is often known as either “the Shoals”, or “Muscle Shoals”, and when people talk about music, it's almost always the latter, so from this point on, I'll be using “Muscle Shoals” to refer to all four towns. The consensus among people from the area seems to have been that while Alabama itself was one of the most horribly racist parts of the country, Muscle Shoals was much better than the rest of Alabama. Some have suggested that this comparative integration was part of the reason for the country influence in Alexander's music, but as we've seen in many previous episodes, there were a lot more Black fans of country music than popular myth would suggest, and musicians like Fats Domino, Chuck Berry, and Bo Diddley were very obviously influenced by country singers.\n\nAlexander's father was also called Arthur, and so for all his life the younger Arthur Alexander was known to family and friends as \"June\", for Junior. Arthur senior had been a blues guitarist in his youth, and according to his son was also an excellent singer, but he got very angry the one time June picked up his guitar and tried to play it -- he forbade him from ever playing the guitar, saying that he'd never made a nickel as a player, and didn't want that life for his son. As Arthur was an obedient kid, he did as his father said -- he never in his life learned to play any musical instrument.\n\nBut that didn't stop him loving music and wanting to sing. He would listen to the radio all the time, listening to crooners like Patti Page and Nat \"King\" Cole, and as a teenager he got himself a job working at a cafe owned by a local gig promoter, which meant he was able to get free entry to the R&B shows the promoter put on at a local chitlin circuit venue, and get to meet the stars who played there. He would talk to people like Clyde McPhatter, and ask him how he managed to hit the high notes -- though he wasn't satisfied by McPhatter's answer that \"It's just there\", thinking there must be more to it than that. And he became very friendly with the Clovers, once having a baseball game with them, and spending a lot of time with their lead singer, Buddy Bailey, asking him details of how he got particular vocal effects in the song \"One Mint Julep\":\n\n[Excerpt: The Clovers, \"One Mint Julep\"]\n\nHe formed a vocal group called the Heartstrings, who would perform songs like \"Sixty Minute Man\", and got a regular spot on a local TV show, but according to his account, after a few weeks one of the other members decided he didn't need to bother practising any more, and messed up on live TV. The group split up after that.\n\nThe only time he got to perform once that group split up was when he would sit in in a band led by his friend George Brooks, who regularly gigged around Muscle Shoals. But there seemed no prospect of anything bigger happening -- there were no music publishing companies or recording studios in Alabama, and everyone from Alabama who had made an impact in music had moved away to do it -- W.C. Handy, Hank Williams, Sam Phillips, they'd all done truly great things, but they'd done them in Memphis or Nashville, not in Montgomery or Birmingham. There was just not the music industry infrastructure there to do anything.\n\nThat started to change in 1956, when the first record company to set up in Muscle Shoals got its start. Tune Records was a tiny label run from a bus station, and most of its business was the same kind of stuff that Sam Phillips did before Sun became big -- making records of people's weddings and so on. But then the owner of the label, James Joiner, came up with a song that he thought might be commercial if a young singer he knew named Bobby Denton sang it. \"A Fallen Star\" was done as cheaply as humanly possible -- it was recorded at a radio station, cut live in one take. The engineer on the track was a DJ who was on the air at the time -- he put a record on, engineered the track while the record was playing, and made sure the musicians finished before the record he was playing did, so he could get back on the air.\n\nThat record itself wasn't a hit, and was so unsuccessful that I've not been able to find a copy of it anywhere, but it inspired hit cover versions from Ferlin Husky and Jimmy C. Newman:\n\n[Excerpt: Jimmy C. Newman, “A Fallen Star”]\n\nOff the back of those hit versions, Joiner started his own publishing company to go with his record company. Suddenly there was a Muscle Shoals music scene, and everything started to change. A lot of country musicians in the area gravitated towards Joiner, and started writing songs for his publishing company.\n\nAt this point, this professional music scene in the area was confined to white people -- Joiner recalled later that a young singer named Percy Sledge had auditioned for him, but that Joiner simply didn't understand his type of music -- but a circle of songwriters formed that would be important later.\n\nJud Phillips, Sam's brother, signed Denton to his new label, Judd, and Denton started recording songs by two of these new songwriters, Rick Hall and Billy Sherrill. Denton's recordings were unsuccessful, but they started getting cover versions. Roy Orbison's first single on RCA was a Hall and Sherrill song:\n\n[Excerpt: Roy Orbison, \"Sweet and Innocent\"]\n\nHall and Sherrill then started up their own publishing company, with the help of a loan from Joiner, and with a third partner, Tom Stafford. Stafford is a figure who has been almost written out of music history, and about whom I've been able to find out very little, but who seems in some ways the most intriguing person among these white musicians and entrepreneurs. Friends from the time describe him as a \"reality-hacking poet\", and he seems to have been a beatnik, or a proto-hippie, the only one in Muscle Shoals and maybe the only one in the state of Alabama at the time. He was the focal point of a whole group of white musicians, people like Norbert Puttnam, David Briggs, Dan Penn, and Spooner Oldham.\n\nThese musicians loved Black music, and wanted to play it, thinking of it as more exciting than the pop and country that they also played. But they loved it in a rather appropriative way -- and in the same way, they had what they *thought* was an anti-racist attitude. Even though they were white, they referred to themselves collectively as a word I'm not going to use, the single most offensive slur against Black people.\n\nAnd so when Arthur Alexander turned up and got involved in this otherwise-white group of musicians, their attitudes varied widely. Terry Thompson, for example, who Alexander said was one of the best players ever to play guitar, as good as Nashville legends like Roy Clark and Jerry Reed, was also, according to Alexander, “the biggest racist there ever was”, and made derogatory remarks about Black people – though he said that Alexander didn't count. Others, like Dan Penn, have later claimed that they took an “I don't even see race” attitude, while still others were excited to be working with an actual Black man. Alexander would become close friends with some of them, would remain at arm's length with most, but appreciated the one thing that they all had in common – that they, like him, wanted to perform R&B *and* country *and* pop.\n\nFor Hall, Sherrill, and Stafford's fledgling publishing company FAME, Alexander and one of his old bandmates from the Heartstrings, Henry Lee Bennett, wrote a song called “She Wanna Rock”, which was recorded in Nashville by the rockabilly singer Arnie Derksen, at Owen Bradley's studio with the Nashville A-Team backing him:\n\n[Excerpt: Arnie Derksen, \"She Wanna Rock\"]\n\nThat record wasn't a success, and soon after that, the partnership behind FAME dissolved. Rick Hall was getting super-ambitious and wanted to become a millionaire by the time he was thirty, Tom Stafford was content with the minor success they had, and wanted to keep hanging round with his friends, watching films, and occasionally helping them make a record, and Billy Sherrill had a minor epiphany and decided he wanted to make country music rather than rock and roll. Rick Hall kept the FAME name for a new company he was starting up and Sherrill headed over to Nashville and got a job with Sam Phillips at Sun's Nashville studio. Sherrill would later move on from Sun and produce and write for almost every major country star of the sixties and seventies – most notably, he co-wrote \"Stand By Your Man\" with Tammy Wynette, and produced \"He Stopped Loving Her Today\" for George Jones. And Stafford kept the studio and the company, which was renamed Spar.\n\nArthur Alexander stuck with Tom Stafford, as did most of the musicians, and while he was working a day job as a bellhop, he would also regularly record demos for other writers at Stafford's studio. By the start of 1960, 19-year-old June had married another nineteen-year-old, Ann. And it was around this point that Stafford came to him with a half-completed lyric that needed music. Alexander took Stafford's partial lyric, and finished it. He added a standard blues riff, which he had liked in Brook Benton's record “Kiddio”:\n\n[Excerpt: Brook Benton, “Kiddio”]\n\nThe resulting song, “Sally Sue Brown”, was a mixture of gutbucket blues and rockabilly, with a soulful vocal, and it was released under the name June Alexander on Judd Records:\n\n[Excerpt: June Alexander, \"Sally Sue Brown\"]\n\nIt's a good record, but it didn't have any kind of success. So Arthur started listening to the radio more, trying to see what the current hits were, so he could do something more commercial. He particularly liked the Drifters and Ben E. King, and he decided to try to write a song that fit their styles. He eventually came up with one that was inspired by real events -- his wife, Ann, had an ex who had tried to win her back once he'd found out she was dating Arthur.\n\nHe took the song, \"You Better Move On\", to Stafford, who knew it would be a massive hit, but also knew that he couldn't produce the record himself, so they got in touch with Rick Hall, who agreed to produce the track. There were multiple sessions, and after each one, Hall would take the tapes away, study them, and come up with improvements that they would use at the next session.\n\nHall, like Alexander, wanted to get a sound like Ben E. King -- he would later say, \"It was my conception that it should have a groove similar to 'Stand By Me', which was a big record at the time. But I didn't want to cop it to the point where people would recognise it was a cop. You dig? So we used the bass line and modified it just a little bit, put the acoustic guitar in front of that.\":\n\n[Excerpt: Arthur Alexander, \"You Better Move On\"]\n\nFor a B-side, they chose a song written by Terry Thompson, \"A Shot of Rhythm and Blues\", which would prove almost as popular as the A-side:\n\n[Excerpt: Arthur Alexander, \"A Shot of Rhythm and Blues\"]\n\nHall shopped the record around every label in Nashville, with little success. Eventually, in February 1961, the record was released by Dot Records, the label that Pat Boone was on. It went to number twenty-four on the pop charts, becoming the first ever hit record to be made in Alabama. Rick Hall made enough money from it that he was able to build a new, much better, studio, and Muscle Shoals was set to become one of the most important recording centres in the US. As Norbert Puttnam, who had played bass on \"You Better Move On\", and who would go on to become one of the most successful session bass players and record producers in Nashville, later said \"If it wasn't for Arthur Alexander, we'd all be at Reynolds\" -- the local aluminium factory.\n\nBut Arthur Alexander wouldn't record much at Muscle Shoals from that point on. His contracts were bought out -- allegedly, Stafford, a heavy drug user, was bought off with a case of codeine -- and instead of working with Rick Hall, the perfectionist producer who would go on to produce a decade-long string of hits, he was being produced by Noel Ball, a DJ with little production experience, though one who had a lot of faith in Alexander's talent, and who had been the one to get him signed to Dot. His first album was a collection of covers of current hits. The album is widely regarded as a failure, and Alexander's heart wasn't in it -- his father had just died, his wife had had a miscarriage, and his marriage was falling apart.\n\nBut his second single for Dot was almost as great as his first. Recorded at Owen Bradley's studio with top Nashville session players, the A-side, \"Where Have You Been?\" was written by the Brill Building team of Barry Mann and Cynthia Weill, and was very much in the style of \"You Better Move On\":\n\n[Excerpt: Arthur Alexander, \"Where Have You Been?\"]\n\nWhile the B-side, \"Soldiers of Love\" (and yes, it was called \"Soldiers of Love\" on the original label, rather than \"Soldier\"), was written by Buzz Cason and Tony Moon, two members of Brenda Lee's backing band, The Casuals:\n\n[Excerpt: Arthur Alexander, \"Soldiers of Love\"]\n\nThe single was only a modest hit, reaching number fifty-eight, but just like his first single, both sides became firm favourites with musicians in Britain. Even though he wasn't having a huge amount of commercial success, music lovers really appreciated his music, and bands in Britain, playing long sets, would pick up on Arthur's songs. Almost every British guitar group had Arthur Alexander songs in their setlists, even though he was unaware of it at the time.\n\nFor his third Dot single, Arthur was in trouble. He'd started drinking a lot, and taking a lot of speed, and his marriage was falling apart. Meanwhile, Noel Ball was trying to get him to record all sorts of terrible songs. He decided he'd better write one himself, and he'd make it about the deterioration of his marriage to Ann -- though in the song he changed her name to Anna, because it scanned better:\n\n[Excerpt: Arthur Alexander, \"Anna (Go To Him)\"]\n\nReleased with a cover version of Gene Autry's country classic \"I Hang My Head and Cry\" as the B-side, that made the top ten on the R&B chart, but it only made number sixty-eight on the pop charts. His next single, \"Go Home Girl\", another attempt at a \"You Better Move On\" soundalike, only made number 102. Meanwhile, a song that Alexander had written and recorded, but that Dot didn't want to put out, went to number forty-two when it was picked up by the white singer Steve Alaimo:\n\n[Excerpt: Steve Alaimo, \"Every Day I Have To Cry\"]\n\nHe was throwing himself into his work at this point, to escape the problems in his personal life. He'd often just go to a local nightclub and sit in with a band featuring a bass player called Billy Cox, and Cox's old Army friend, who was just starting to get a reputation as a musician, a guitarist they all called Marbles but who would later be better known as Jimi Hendrix. He was drinking heavily, divorced, and being terribly mismanaged, as well as being ripped off by his record and publishing companies. He was living with a friend, Joe Henderson, who had had a hit a couple of years earlier with \"Snap Your Fingers\":\n\n[Excerpt: Joe Henderson, \"Snap Your Fingers\"]\n\nHenderson and Alexander would push each other to greater extremes of drug use, enabling each other's addiction, and one day Arthur came home to find his friend dead in the bathroom, of what was officially a heart attack but which everyone assumes was an overdose. Not only that, but Noel Ball was dying of cancer, and for all that he hadn't been the greatest producer, Arthur cared deeply about him.\n\nHe tried a fresh start with Monument Records, and he was now being produced by Fred Foster, who had produced Roy Orbison's classic hits, and his arrangements were being done by Bill Justis, the saxophone player who had had a hit with \"Raunchy\" on a subsidiary of Sun a few years earlier.\n\nSome of his Monument recordings were excellent, like his first single for the label, \"Baby For You\":\n\n[Excerpt: Arthur Alexander, \"Baby For You\"]\n\nOn the back of that single, he toured the UK, and appeared on several big British TV shows, and was generally feted by all the major bands who were fans of his work, but he had no more commercial success at Monument than he had at the end of his time on Dot.\n\nAnd his life was getting worse and worse. He had a breakdown, brought on by his constant use of amphetamines and cannabis, and started hallucinating that people he saw were people from his past life -- he stopped a taxi so he could get out and run after a man he was convinced was his dead father, and assaulted an audience member he was convinced was his ex-wife. He was arrested, diagnosed with schizophrenia, and spent several months in a psychiatric hospital.\n\nShortly after he got out, Arthur visited his friend Otis Redding, who was in the studio in Memphis, and was cutting a song that he and Arthur had co-written several years earlier, \"Johnny's Heartbreak\":\n\n[Excerpt: Otis Redding, \"Johnny's Heartbreak\"]\n\nOtis asked Arthur to join him on a tour he was going to be going on a couple of weeks later, but fog grounded Arthur's plane so he was never able to meet up with Otis in Atlanta, and the tour proceeded without him -- and so Arthur was not on the plane that Redding was on, on December 10 1967, which crashed and killed him.\n\nArthur saw this as divine intervention, but he was seeing patterns in everything at this point, and he had several more breakdowns. He ended up getting dropped by Monument in 1970. He was hospitalised again after a bad LSD trip led to him standing naked in the middle of the road, and he spent several years drifting, unable to have a hit, though he was still making music. He kept having bad luck – for example, he recorded a song by the songwriter Dennis Linde, which was an almost guaranteed hit, and could have made for a comeback for him:\n\n[Excerpt: Arthur Alexander, “Burning Love”]\n\nBut between him recording it and releasing it as a single, Elvis Presley released his version, which went to number two on the charts, and killed any chance of Arthur's version being a success:\n\n[Excerpt: Elvis Presley, “Burning Love”]\n\nHe did, though, have a bit of a comeback in 1975, when he rerecorded his old song \"Every Day I Have To Cry\", as \"Every Day I Have To Cry Some\", in a version which many people think likely inspired Bruce Springsteen's \"Hungry Heart\" a few years later:\n\n[Excerpt: Arthur Alexander, \"Every Day I Have To Cry Some\"]\n\nThat made number forty-five, but unfortunately his follow-up, “Sharing the Night Together”, was another song where multiple people released versions of it at the same time, without realising, and so didn't chart – Dr. Hook eventually had a hit with it a year later. Arthur stepped away from music. He managed to get himself more mentally well, and spent the years from 1978 through 1993 working a series of blue-collar jobs in Cleveland -- construction worker, bus driver, and janitor. He rarely opened up to people about ever having been a singer. He suffered through more tragedy, too, like the murder of one of his sons, but he remained mentally stable.\n\nBut then, in March 1993, he made a comeback. The producer Ben Vaughn persuaded him into the studio, and he got a contract with Elektra records. He made his first album in twenty-two years, a mixture of new songs and reworkings of his older ones. It got great reviews, and he was rediscovered by the music press as a soul pioneer.\n\nHe got a showcase spot at South by Southwest, he was profiled by NPR on Fresh Air, and he was playing to excited crowds of new, young fans. He was in the process of getting his publishing rights back, and might finally start to see some money from his hits.\n\nAnd then, three months after that album came out, in the middle of a meeting with a publisher about the negotiations for his new contracts, he had a massive heart attack, and died the next day, aged fifty-three. His bad luck had caught up with him again.",
  "itunes:subtitle": "Episode ninety-five of A History of Rock Music in Five Hundred Songs looks at You Better Move On, and the sad story of Arthur Alexander. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers",
  "itunes:keywords": "Arthur Alexander,Barry Mann,Bill Justis,Brill Building,British rock,Buzz Cason,country and western,Cynthia Weil,Dan Penn,David Briggs,Dot Records,Elvis Presley,Fred Foster,Gene Autry,George Harrison,Jimi Hendrix,Judd Records,Monument Records,Muscle Shoals,Nashville,Norbert Puttnam,Otis Redding,Owen Bradley,racism,Rick Hall,Roy Orbison,soul,Spooner Oldham",
  "itunes:episodeType": "full",
  "itunes:episode": 95,
  "content:encoded": "Episode ninety-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"You Better Move On\", and the sad story of Arthur Alexander. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/40900349\">\"Mother-In-Law\" by Ernie K-Doe.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created Mixcloud playlists with full versions of all the songs in the episode. This week it's been split into two parts because of the number of songs by Arthur Alexander. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-95a-you-better-move-on-part-1/\">Part one</a>. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-95b-you-better-move-on-part-2/\">Part two.</a>\n\n<a href=\"https://amzn.to/3jdlpmc\">This compilation</a> collects the best of Alexander's Dot work.\n\nMuch of the information in this episode comes from <a href=\"https://amzn.to/34CJOO0\">Richard Younger's biography of Alexander</a>. It's unfortunately not in print in the UK, and goes for silly money, though I believe it can be bought cheaply in the US.\n\nAnd a lot of the background on Muscle Shoals comes from&nbsp;<a href=\"https://amzn.to/3lul5BR\"><em>Country Soul</em> by Charles L. Hughes</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nBefore we start, a warning for those who need it. This is one of the sadder episodes we're going to be doing, and it deals with substance abuse, schizophrenia, and miscarriage.\n\nOne of the things we're going to see a lot of in the next few weeks and months is the growing integration of the studios that produced much of the hit music to come out of the Southern USA in the sixties -- studios in what the writer Charles L. Hughes calls the country-soul triangle: Nashville, Memphis, and Muscle Shoals.\n\nThat integration produced some of the greatest music of the era, but it's also the case that with few exceptions, narratives about that have tended to centre the white people involved at the expense of the Black people. The Black musicians tend to be regarded as people who allowed the white musicians to cast off their racism and become better people, rather than as colleagues who in many cases somewhat resented the white musicians -- there were jobs that weren't open to Black musicians in the segregated South, and now here were a bunch of white people taking some of the smaller number of jobs that *were* available to them.\n\nThis is not to say that those white musicians were, individually, racist -- many were very vocally opposed to racism -- but they were still beneficiaries of a racist system. These white musicians who loved Black music slowly, over a decade or so, took over the older Black styles of music, and made them into white music. Up to this point, when we've looked at R&B, blues, or soul recordings, all the musicians involved have been Black people, almost without exception. And for most of the fifties, rock and roll was a predominantly Black genre, before the influx of the rockabillies made it seem, briefly, like it could lead to a truly post-racial style of music.\n\nBut over the 1960s, we're going to see white people slowly colonise those musics, and push Black musicians to the margins. And this episode marks a crucial turning point in the story, as we see the establishment of Muscle Shoals, Alabama, as a centre of white people making music in previously Black genres. But the start of that story comes with a Black man making music that most people at the time saw as coded as white.\n\nToday we're going to look at someone whose music is often considered the epitome of deep soul, but who worked with many of the musicians who made the Nashville Sound what it was, and who was as influenced by Gene Autry as he was by many of the more obvious singers who might influence a soul legend. Today, we're going to look at Arthur Alexander, and at \"You Better Move On\":\n\n[Excerpt: Arthur Alexander, \"You'd Better Move On\"]\n\nArthur Alexander's is one of the most tragic stories we'll be looking at. He was a huge influence on every musician who came up in the sixties, but he never got the recognition for it. He was largely responsible for the rise of Muscle Shoals studios, and he wrote songs that were later covered by the Beatles, and Bob Dylan, and the Rolling Stones, as well as many, many more. The musician Norbert Putnam told the story of visiting George Harrison in the seventies, and seeing his copy of Alexander's hit single \"You Better Move On\". He said to Harrison, \"Did you know I played bass on that?\" and Harrison replied, \"If I phoned Paul up now, he'd come over and kiss your feet\". That's how important Arthur Alexander was to the Beatles, and to the history of rock music.\n\nBut he never got to reap the rewards his talent entitled him to. He spent most of his life in poverty, and is now mostly known only to fans of the subgenre known as deep soul.\n\nPart of this is because his music is difficult to categorise. While most listeners would now consider it soul music, it's hard to escape the fact that Alexander's music has an awful lot of elements of country music in it.\n\nThis is something that Alexander would point out himself -- in interviews, he would talk about how he loved singing cowboys in films -- people like Roy Rogers and Gene Autry -- and about how when he was growing up the radio stations he would listen to would \"play a Drifters record and maybe an Eddy Arnold record, and they didn't make no distinction. That's the way it was until much later\".\n\nThe first record he truly loved was Eddy Arnold's 1946 country hit \"That's How Much I Love You\":\n\n[Excerpt: Eddy Arnold, \"That's How Much I Love You\"]\n\nAlexander grew up in Alabama, but in what gets described as a relatively integrated area for the time and place -- by his own account, the part of East Florence he grew up in had only one other Black family, and all the other children he played with were white, and he wasn't even aware of segregation until he was eight or nine.\n\nFlorence is itself part of a quad-city area with three other nearby towns – Muscle Shoals, Sheffield, and Tuscumbia. This area as a whole is often known as either “the Shoals”, or “Muscle Shoals”, and when people talk about music, it's almost always the latter, so from this point on, I'll be using “Muscle Shoals” to refer to all four towns. The consensus among people from the area seems to have been that while Alabama itself was one of the most horribly racist parts of the country, Muscle Shoals was much better than the rest of Alabama. Some have suggested that this comparative integration was part of the reason for the country influence in Alexander's music, but as we've seen in many previous episodes, there were a lot more Black fans of country music than popular myth would suggest, and musicians like Fats Domino, Chuck Berry, and Bo Diddley were very obviously influenced by country singers.\n\nAlexander's father was also called Arthur, and so for all his life the younger Arthur Alexander was known to family and friends as \"June\", for Junior. Arthur senior had been a blues guitarist in his youth, and according to his son was also an excellent singer, but he got very angry the one time June picked up his guitar and tried to play it -- he forbade him from ever playing the guitar, saying that he'd never made a nickel as a player, and didn't want that life for his son. As Arthur was an obedient kid, he did as his father said -- he never in his life learned to play any musical instrument.\n\nBut that didn't stop him loving music and wanting to sing. He would listen to the radio all the time, listening to crooners like Patti Page and Nat \"King\" Cole, and as a teenager he got himself a job working at a cafe owned by a local gig promoter, which meant he was able to get free entry to the R&B shows the promoter put on at a local chitlin circuit venue, and get to meet the stars who played there. He would talk to people like Clyde McPhatter, and ask him how he managed to hit the high notes -- though he wasn't satisfied by McPhatter's answer that \"It's just there\", thinking there must be more to it than that. And he became very friendly with the Clovers, once having a baseball game with them, and spending a lot of time with their lead singer, Buddy Bailey, asking him details of how he got particular vocal effects in the song \"One Mint Julep\":\n\n[Excerpt: The Clovers, \"One Mint Julep\"]\n\nHe formed a vocal group called the Heartstrings, who would perform songs like \"Sixty Minute Man\", and got a regular spot on a local TV show, but according to his account, after a few weeks one of the other members decided he didn't need to bother practising any more, and messed up on live TV. The group split up after that.\n\nThe only time he got to perform once that group split up was when he would sit in in a band led by his friend George Brooks, who regularly gigged around Muscle Shoals. But there seemed no prospect of anything bigger happening -- there were no music publishing companies or recording studios in Alabama, and everyone from Alabama who had made an impact in music had moved away to do it -- W.C. Handy, Hank Williams, Sam Phillips, they'd all done truly great things, but they'd done them in Memphis or Nashville, not in Montgomery or Birmingham. There was just not the music industry infrastructure there to do anything.\n\nThat started to change in 1956, when the first record company to set up in Muscle Shoals got its start. Tune Records was a tiny label run from a bus station, and most of its business was the same kind of stuff that Sam Phillips did before Sun became big -- making records of people's weddings and so on. But then the owner of the label, James Joiner, came up with a song that he thought might be commercial if a young singer he knew named Bobby Denton sang it. \"A Fallen Star\" was done as cheaply as humanly possible -- it was recorded at a radio station, cut live in one take. The engineer on the track was a DJ who was on the air at the time -- he put a record on, engineered the track while the record was playing, and made sure the musicians finished before the record he was playing did, so he could get back on the air.\n\nThat record itself wasn't a hit, and was so unsuccessful that I've not been able to find a copy of it anywhere, but it inspired hit cover versions from Ferlin Husky and Jimmy C. Newman:\n\n[Excerpt: Jimmy C. Newman, “A Fallen Star”]\n\nOff the back of those hit versions, Joiner started his own publishing company to go with his record company. Suddenly there was a Muscle Shoals music scene, and everything started to change. A lot of country musicians in the area gravitated towards Joiner, and started writing songs for his publishing company.\n\nAt this point, this professional music scene in the area was confined to white people -- Joiner recalled later that a young singer named Percy Sledge had auditioned for him, but that Joiner simply didn't understand his type of music -- but a circle of songwriters formed that would be important later.\n\nJud Phillips, Sam's brother, signed Denton to his new label, Judd, and Denton started recording songs by two of these new songwriters, Rick Hall and Billy Sherrill. Denton's recordings were unsuccessful, but they started getting cover versions. Roy Orbison's first single on RCA was a Hall and Sherrill song:\n\n[Excerpt: Roy Orbison, \"Sweet and Innocent\"]\n\nHall and Sherrill then started up their own publishing company, with the help of a loan from Joiner, and with a third partner, Tom Stafford. Stafford is a figure who has been almost written out of music history, and about whom I've been able to find out very little, but who seems in some ways the most intriguing person among these white musicians and entrepreneurs. Friends from the time describe him as a \"reality-hacking poet\", and he seems to have been a beatnik, or a proto-hippie, the only one in Muscle Shoals and maybe the only one in the state of Alabama at the time. He was the focal point of a whole group of white musicians, people like Norbert Puttnam, David Briggs, Dan Penn, and Spooner Oldham.\n\nThese musicians loved Black music, and wanted to play it, thinking of it as more exciting than the pop and country that they also played. But they loved it in a rather appropriative way -- and in the same way, they had what they *thought* was an anti-racist attitude. Even though they were white, they referred to themselves collectively as a word I'm not going to use, the single most offensive slur against Black people.\n\nAnd so when Arthur Alexander turned up and got involved in this otherwise-white group of musicians, their attitudes varied widely. Terry Thompson, for example, who Alexander said was one of the best players ever to play guitar, as good as Nashville legends like Roy Clark and Jerry Reed, was also, according to Alexander, “the biggest racist there ever was”, and made derogatory remarks about Black people – though he said that Alexander didn't count. Others, like Dan Penn, have later claimed that they took an “I don't even see race” attitude, while still others were excited to be working with an actual Black man. Alexander would become close friends with some of them, would remain at arm's length with most, but appreciated the one thing that they all had in common – that they, like him, wanted to perform R&B *and* country *and* pop.\n\nFor Hall, Sherrill, and Stafford's fledgling publishing company FAME, Alexander and one of his old bandmates from the Heartstrings, Henry Lee Bennett, wrote a song called “She Wanna Rock”, which was recorded in Nashville by the rockabilly singer Arnie Derksen, at Owen Bradley's studio with the Nashville A-Team backing him:\n\n[Excerpt: Arnie Derksen, \"She Wanna Rock\"]\n\nThat record wasn't a success, and soon after that, the partnership behind FAME dissolved. Rick Hall was getting super-ambitious and wanted to become a millionaire by the time he was thirty, Tom Stafford was content with the minor success they had, and wanted to keep hanging round with his friends, watching films, and occasionally helping them make a record, and Billy Sherrill had a minor epiphany and decided he wanted to make country music rather than rock and roll. Rick Hall kept the FAME name for a new company he was starting up and Sherrill headed over to Nashville and got a job with Sam Phillips at Sun's Nashville studio. Sherrill would later move on from Sun and produce and write for almost every major country star of the sixties and seventies – most notably, he co-wrote \"Stand By Your Man\" with Tammy Wynette, and produced \"He Stopped Loving Her Today\" for George Jones. And Stafford kept the studio and the company, which was renamed Spar.\n\nArthur Alexander stuck with Tom Stafford, as did most of the musicians, and while he was working a day job as a bellhop, he would also regularly record demos for other writers at Stafford's studio. By the start of 1960, 19-year-old June had married another nineteen-year-old, Ann. And it was around this point that Stafford came to him with a half-completed lyric that needed music. Alexander took Stafford's partial lyric, and finished it. He added a standard blues riff, which he had liked in Brook Benton's record “Kiddio”:\n\n[Excerpt: Brook Benton, “Kiddio”]\n\nThe resulting song, “Sally Sue Brown”, was a mixture of gutbucket blues and rockabilly, with a soulful vocal, and it was released under the name June Alexander on Judd Records:\n\n[Excerpt: June Alexander, \"Sally Sue Brown\"]\n\nIt's a good record, but it didn't have any kind of success. So Arthur started listening to the radio more, trying to see what the current hits were, so he could do something more commercial. He particularly liked the Drifters and Ben E. King, and he decided to try to write a song that fit their styles. He eventually came up with one that was inspired by real events -- his wife, Ann, had an ex who had tried to win her back once he'd found out she was dating Arthur.\n\nHe took the song, \"You Better Move On\", to Stafford, who knew it would be a massive hit, but also knew that he couldn't produce the record himself, so they got in touch with Rick Hall, who agreed to produce the track. There were multiple sessions, and after each one, Hall would take the tapes away, study them, and come up with improvements that they would use at the next session.\n\nHall, like Alexander, wanted to get a sound like Ben E. King -- he would later say, \"It was my conception that it should have a groove similar to 'Stand By Me', which was a big record at the time. But I didn't want to cop it to the point where people would recognise it was a cop. You dig? So we used the bass line and modified it just a little bit, put the acoustic guitar in front of that.\":\n\n[Excerpt: Arthur Alexander, \"You Better Move On\"]\n\nFor a B-side, they chose a song written by Terry Thompson, \"A Shot of Rhythm and Blues\", which would prove almost as popular as the A-side:\n\n[Excerpt: Arthur Alexander, \"A Shot of Rhythm and Blues\"]\n\nHall shopped the record around every label in Nashville, with little success. Eventually, in February 1961, the record was released by Dot Records, the label that Pat Boone was on. It went to number twenty-four on the pop charts, becoming the first ever hit record to be made in Alabama. Rick Hall made enough money from it that he was able to build a new, much better, studio, and Muscle Shoals was set to become one of the most important recording centres in the US. As Norbert Puttnam, who had played bass on \"You Better Move On\", and who would go on to become one of the most successful session bass players and record producers in Nashville, later said \"If it wasn't for Arthur Alexander, we'd all be at Reynolds\" -- the local aluminium factory.\n\nBut Arthur Alexander wouldn't record much at Muscle Shoals from that point on. His contracts were bought out -- allegedly, Stafford, a heavy drug user, was bought off with a case of codeine -- and instead of working with Rick Hall, the perfectionist producer who would go on to produce a decade-long string of hits, he was being produced by Noel Ball, a DJ with little production experience, though one who had a lot of faith in Alexander's talent, and who had been the one to get him signed to Dot. His first album was a collection of covers of current hits. The album is widely regarded as a failure, and Alexander's heart wasn't in it -- his father had just died, his wife had had a miscarriage, and his marriage was falling apart.\n\nBut his second single for Dot was almost as great as his first. Recorded at Owen Bradley's studio with top Nashville session players, the A-side, \"Where Have You Been?\" was written by the Brill Building team of Barry Mann and Cynthia Weill, and was very much in the style of \"You Better Move On\":\n\n[Excerpt: Arthur Alexander, \"Where Have You Been?\"]\n\nWhile the B-side, \"Soldiers of Love\" (and yes, it was called \"Soldiers of Love\" on the original label, rather than \"Soldier\"), was written by Buzz Cason and Tony Moon, two members of Brenda Lee's backing band, The Casuals:\n\n[Excerpt: Arthur Alexander, \"Soldiers of Love\"]\n\nThe single was only a modest hit, reaching number fifty-eight, but just like his first single, both sides became firm favourites with musicians in Britain. Even though he wasn't having a huge amount of commercial success, music lovers really appreciated his music, and bands in Britain, playing long sets, would pick up on Arthur's songs. Almost every British guitar group had Arthur Alexander songs in their setlists, even though he was unaware of it at the time.\n\nFor his third Dot single, Arthur was in trouble. He'd started drinking a lot, and taking a lot of speed, and his marriage was falling apart. Meanwhile, Noel Ball was trying to get him to record all sorts of terrible songs. He decided he'd better write one himself, and he'd make it about the deterioration of his marriage to Ann -- though in the song he changed her name to Anna, because it scanned better:\n\n[Excerpt: Arthur Alexander, \"Anna (Go To Him)\"]\n\nReleased with a cover version of Gene Autry's country classic \"I Hang My Head and Cry\" as the B-side, that made the top ten on the R&B chart, but it only made number sixty-eight on the pop charts. His next single, \"Go Home Girl\", another attempt at a \"You Better Move On\" soundalike, only made number 102. Meanwhile, a song that Alexander had written and recorded, but that Dot didn't want to put out, went to number forty-two when it was picked up by the white singer Steve Alaimo:\n\n[Excerpt: Steve Alaimo, \"Every Day I Have To Cry\"]\n\nHe was throwing himself into his work at this point, to escape the problems in his personal life. He'd often just go to a local nightclub and sit in with a band featuring a bass player called Billy Cox, and Cox's old Army friend, who was just starting to get a reputation as a musician, a guitarist they all called Marbles but who would later be better known as Jimi Hendrix. He was drinking heavily, divorced, and being terribly mismanaged, as well as being ripped off by his record and publishing companies. He was living with a friend, Joe Henderson, who had had a hit a couple of years earlier with \"Snap Your Fingers\":\n\n[Excerpt: Joe Henderson, \"Snap Your Fingers\"]\n\nHenderson and Alexander would push each other to greater extremes of drug use, enabling each other's addiction, and one day Arthur came home to find his friend dead in the bathroom, of what was officially a heart attack but which everyone assumes was an overdose. Not only that, but Noel Ball was dying of cancer, and for all that he hadn't been the greatest producer, Arthur cared deeply about him.\n\nHe tried a fresh start with Monument Records, and he was now being produced by Fred Foster, who had produced Roy Orbison's classic hits, and his arrangements were being done by Bill Justis, the saxophone player who had had a hit with \"Raunchy\" on a subsidiary of Sun a few years earlier.\n\nSome of his Monument recordings were excellent, like his first single for the label, \"Baby For You\":\n\n[Excerpt: Arthur Alexander, \"Baby For You\"]\n\nOn the back of that single, he toured the UK, and appeared on several big British TV shows, and was generally feted by all the major bands who were fans of his work, but he had no more commercial success at Monument than he had at the end of his time on Dot.\n\nAnd his life was getting worse and worse. He had a breakdown, brought on by his constant use of amphetamines and cannabis, and started hallucinating that people he saw were people from his past life -- he stopped a taxi so he could get out and run after a man he was convinced was his dead father, and assaulted an audience member he was convinced was his ex-wife. He was arrested, diagnosed with schizophrenia, and spent several months in a psychiatric hospital.\n\nShortly after he got out, Arthur visited his friend Otis Redding, who was in the studio in Memphis, and was cutting a song that he and Arthur had co-written several years earlier, \"Johnny's Heartbreak\":\n\n[Excerpt: Otis Redding, \"Johnny's Heartbreak\"]\n\nOtis asked Arthur to join him on a tour he was going to be going on a couple of weeks later, but fog grounded Arthur's plane so he was never able to meet up with Otis in Atlanta, and the tour proceeded without him -- and so Arthur was not on the plane that Redding was on, on December 10 1967, which crashed and killed him.\n\nArthur saw this as divine intervention, but he was seeing patterns in everything at this point, and he had several more breakdowns. He ended up getting dropped by Monument in 1970. He was hospitalised again after a bad LSD trip led to him standing naked in the middle of the road, and he spent several years drifting, unable to have a hit, though he was still making music. He kept having bad luck – for example, he recorded a song by the songwriter Dennis Linde, which was an almost guaranteed hit, and could have made for a comeback for him:\n\n[Excerpt: Arthur Alexander, “Burning Love”]\n\nBut between him recording it and releasing it as a single, Elvis Presley released his version, which went to number two on the charts, and killed any chance of Arthur's version being a success:\n\n[Excerpt: Elvis Presley, “Burning Love”]\n\nHe did, though, have a bit of a comeback in 1975, when he rerecorded his old song \"Every Day I Have To Cry\", as \"Every Day I Have To Cry Some\", in a version which many people think likely inspired Bruce Springsteen's \"Hungry Heart\" a few years later:\n\n[Excerpt: Arthur Alexander, \"Every Day I Have To Cry Some\"]\n\nThat made number forty-five, but unfortunately his follow-up, “Sharing the Night Together”, was another song where multiple people released versions of it at the same time, without realising, and so didn't chart – Dr. Hook eventually had a hit with it a year later. Arthur stepped away from music. He managed to get himself more mentally well, and spent the years from 1978 through 1993 working a series of blue-collar jobs in Cleveland -- construction worker, bus driver, and janitor. He rarely opened up to people about ever having been a singer. He suffered through more tragedy, too, like the murder of one of his sons, but he remained mentally stable.\n\nBut then, in March 1993, he made a comeback. The producer Ben Vaughn persuaded him into the studio, and he got a contract with Elektra records. He made his first album in twenty-two years, a mixture of new songs and reworkings of his older ones. It got great reviews, and he was rediscovered by the music press as a soul pioneer.\n\nHe got a showcase spot at South by Southwest, he was profiled by NPR on Fresh Air, and he was playing to excited crowds of new, young fans. He was in the process of getting his publishing rights back, and might finally start to see some money from his hits.\n\nAnd then, three months after that album came out, in the middle of a meeting with a publisher about the negotiations for his new contracts, he had a massive heart attack, and died the next day, aged fifty-three. His bad luck had caught up with him again.",
  "enclosure": "",
  "itunes:summary": "Episode ninety-five of A History of Rock Music in Five Hundred Songs looks at \"You Better Move On\", and the sad story of Arthur Alexander. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Mother-In-Law\" by Ernie K-Doe.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created Mixcloud playlists with full versions of all the songs in the episode. This week it's been split into two parts because of the number of songs by Arthur Alexander. Part one. Part two.\n\nThis compilation collects the best of Alexander's Dot work.\n\nMuch of the information in this episode comes from Richard Younger's biography of Alexander. It's unfortunately not in print in the UK, and goes for silly money, though I believe it can be bought cheaply in the US.\n\nAnd a lot of the background on Muscle Shoals comes from&nbsp;Country Soul by Charles L. Hughes.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nBefore we start, a warning for those who need it. This is one of the sadder episodes we're going to be doing, and it deals with substance abuse, schizophrenia, and miscarriage.\n\nOne of the things we're going to see a lot of in the next few weeks and months is the growing integration of the studios that produced much of the hit music to come out of the Southern USA in the sixties -- studios in what the writer Charles L. Hughes calls the country-soul triangle: Nashville, Memphis, and Muscle Shoals.\n\nThat integration produced some of the greatest music of the era, but it's also the case that with few exceptions, narratives about that have tended to centre the white people involved at the expense of the Black people. The Black musicians tend to be regarded as people who allowed the white musicians to cast off their racism and become better people, rather than as colleagues who in many cases somewhat resented the white musicians -- there were jobs that weren't open to Black musicians in the segregated South, and now here were a bunch of white people taking some of the smaller number of jobs that *were* available to them.\n\nThis is not to say that those white musicians were, individually, racist -- many were very vocally opposed to racism -- but they were still beneficiaries of a racist system. These white musicians who loved Black music slowly, over a decade or so, took over the older Black styles of music, and made them into white music. Up to this point, when we've looked at R&B, blues, or soul recordings, all the musicians involved have been Black people, almost without exception. And for most of the fifties, rock and roll was a predominantly Black genre, before the influx of the rockabillies made it seem, briefly, like it could lead to a truly post-racial style of music.\n\nBut over the 1960s, we're going to see white people slowly colonise those musics, and push Black musicians to the margins. And this episode marks a crucial turning point in the story, as we see the establishment of Muscle Shoals, Alabama, as a centre of white people making music in previously Black genres. But the start of that story comes with a Black man making music that most people at the time saw as coded as white.\n\nToday we're going to look at someone whose music is often considered the epitome of deep soul, but who worked with many of the musicians who made the Nashville Sound what it was, and who was as influenced by Gene Autry as he was by many of the more obvious singers who might influence a soul legend. Today, we're going to look at Arthur Alexander, and at \"You Better Move On\":\n\n[Excerpt: Arthur Alexander, \"You'd Better Move On\"]\n\nArthur Alexander's is one of the most tragic stor",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-five of A History of Rock Music in Five Hundred Songs looks at \"You Better Move On\", and the sad story of Arthur Alexander. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Mother-In-Law\" by Ernie K-Doe.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created Mixcloud playlists with full versions of all the songs in the episode. This week it's been split into two parts because of the number of songs by Arthur Alexander. Part one. Part two.\n\nThis compilation collects the best of Alexander's Dot work.\n\nMuch of the information in this episode comes from Richard Younger's biography of Alexander. It's unfortunately not in print in the UK, and goes",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}