{
  "title": "Debanjan Saha Named Chief Executive Officer of DataRobot",
  "link": "https://www.datarobot.com/newsroom/press/debanjan-saha-named-chief-executive-officer-of-datarobot/",
  "dc:creator": "Stephanie Rogers",
  "pubDate": "Tue, 20 Sep 2022 15:03:00 +0000",
  "category": "Press Releases",
  "guid": "https://www.datarobot.com/?p=40322",
  "description": "<p>Google, Amazon Web Services veteran to chart path forward for AI industry leader&#160; September 20, 2022 — BOSTON — DataRobot, the AI Cloud leader, today announced the appointment of Debanjan Saha as Chief Executive Officer (CEO). An industry veteran, Saha is a strategic business leader who served as DataRobot’s Interim CEO, and previously as President...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/debanjan-saha-named-chief-executive-officer-of-datarobot/\">Debanjan Saha Named Chief Executive Officer of DataRobot</a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "content:encoded": "\n<p><em>Google, Amazon Web Services veteran to chart path forward for AI industry leader&nbsp;</em></p>\n\n\n\n<p><strong>September 20, 2022 — BOSTON —</strong> <a href=\"https://www.datarobot.com\">DataRobot</a>, the AI Cloud leader, today announced the appointment of Debanjan Saha as Chief Executive Officer (CEO). An industry veteran, Saha is a strategic business leader who served as DataRobot’s Interim CEO, and previously as President & Chief Operating Officer (COO).</p>\n\n\n\n<p>“We are confident that Debanjan is the right leader to chart the path forward for DataRobot,” said Mark Hawkins, Chairman of the DataRobot Board of Directors. “Debanjan embodies our innovation and customer-first culture, and has a clear vision for the future to capitalize on the tremendous market opportunity in AI.”</p>\n\n\n\n<p>Saha <a href=\"https://www.datarobot.com/newsroom/press/datarobot-hires-googles-debanjan-saha-as-chief-operating-officer/\">joined</a> DataRobot in February 2022 as President & COO and was <a href=\"https://www.datarobot.com/newsroom/press/datarobot-announces-leadership-changes-for-next-phase-of-innovation-and-growth/\">appointed</a> Interim CEO in July 2022. Prior to DataRobot, Saha spent twenty years leading multi-billion dollar data and cloud businesses at some of the most successful technology companies in the world, including Google and Amazon Web Services.&nbsp;</p>\n\n\n\n<p>“DataRobot is uniquely positioned to lead the AI industry with the most widely deployed and proven AI platform on the market,” said Debanjan Saha. “I am inspired by the opportunity ahead of us and am honored to lead DataRobot through its next phase of growth. We will continue to execute with focus and agility to deliver value for our customers around the world.”</p>\n\n\n\n<p><strong>About DataRobot </strong></p>\n\n\n\n<p>DataRobot AI Cloud is the next generation of AI. DataRobot’s AI Cloud vision is to bring together all data types, all users, and all environments to deliver critical business insights for every organization. DataRobot is trusted by global customers across industries and verticals, including a third of the Fortune 50. For more information, visit <a href=\"http://www.datarobot.com/\">https://www.datarobot.com/</a>.&nbsp;</p>\n\n\n\n<p class=\"has-text-align-center\">###</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/debanjan-saha-named-chief-executive-officer-of-datarobot/\">Debanjan Saha Named Chief Executive Officer of DataRobot</a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "media:content": ""
}