{
  "title": "256: Murder In Ypsilanti: Keith Morrison Investigates",
  "link": "https://audioboom.com/posts/8163896",
  "itunes:episode": 256,
  "itunes:title": "Murder In Ypsilanti: Keith Morrison Investigates",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4046,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In 2018, a reporter in Ypsilanti, Michigan received a mysterious anonymous email: a woman named Martha Agnu was dead. When the reporter looked into the death, another woman's name kept popping up: Tammy NIver. Tamny had been missing since 1993, and it seemed that Tammy and Martha had known each other. So what was going on here? How were these two women connected? And why had this town kept this connection a secret for 25 years?<br>\n<br>\n<a href=\"https://www.obsessednetwork.com/obsessed-fest\">OBSESSED FEST IS THIS WEEKEND! COME JOIN US!</a> But only if you want to see ALL YOUR FAVORITE TRUE CRIME PODCASTERS IN THE SAME PLCE FOR A WHOLE WEEKEND! Damien Echols of the West Memphis Three will be joining Gillian and Bob Ruff on the mainstage for a WM3 Panel, <strong>Rabia Chaudry is doing a Q&A answering all your questions on how he's doing now that he's finally home--and what comes next!,</strong> we have live episode tapings from Let's Go To Court, Strange And Unexplained, Red Handed and more, plus Karaoke and Gillian's Taylor Swift Singalong! ALL OF THIS AND SO MUCH MORE IS INCLUDED IN YOUR FESTIVAL PASS! And then, if you want, you can add on live shows from True Crime Obsessed, Morbid, Obsessed With Disappeared, and Scamfluencers!  <a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">TICKETS ARE ALMOST GONE!! GET YOUR TICKET</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Bad Vegan\" \"LuLaRich\" \"John Wayne Gacy: Devil in Disguise\" \"Night Stalker\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 27 Sep 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-26:/posts/8163896",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}