{
  "title": "Primordial non-gaussianity up to all orders: theoretical aspects and implications for primordial black hole models. (arXiv:2211.01728v1 [astro-ph.CO])",
  "link": "http://arxiv.org/abs/2211.01728",
  "description": "<p>We develop an exact formalism for the computation of the abundance of\nprimordial black holes (PBHs) in the presence of local non-gaussianity (NG) in\nthe curvature perturbation field. For the first time, we include NG going\nbeyond the widely used quadratic and cubic approximations, and consider a\ncompletely generic functional form. Adopting threshold statistics of the\ncompaction function, we address the computation of the abundance both for\nnarrow and broad power spectra. While our formulas are generic, we discuss\nexplicit examples of phenomenological relevance considering the physics case of\nthe curvaton field. We carefully assess under which conditions the conventional\nperturbative approach can be trusted. In the case of a narrow power spectrum,\nthis happens only if the perturbative expansion is pushed beyond the quadratic\norder (with the optimal order of truncation that depends on the width of the\nspectrum). Most importantly, we demonstrate that the perturbative approach is\nintrinsically flawed when considering broad spectra, in which case only the\nnon-perturbative computation captures the correct result. Finally, we describe\nthe phenomenological relevance of our results for the connection between the\nabundance of PBHs and the stochastic gravitational wave (GW) background related\nto their formation. As NGs modify the amplitude of perturbations necessary to\nproduce a given PBHs abundance and boost PBHs production at large scales for\nbroad spectra, modelling these effects is crucial to connect the PBH scenario\nto its signatures at current and future GWs experiments.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Ferrante_G/0/1/0/all/0/1\">Giacomo Ferrante</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Franciolini_G/0/1/0/all/0/1\">Gabriele Franciolini</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Iovino_A/0/1/0/all/0/1\">Antonio Junior Iovino</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Urbano_A/0/1/0/all/0/1\">Alfredo Urbano</a>"
}