{
  "title": "Israel Keyes: Method of a Serial Killer",
  "link": "https://audioboom.com/posts/7597531",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3124,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Israel Keyes is the most terrifying serial killer you’ve maybe never heard of. <br>\n<br>\nHere’s what we know about him: He was methodical—he left “kill kits” hidden all across the country. He hid them years before using them, so he was also patient and self controlled. He picked his victims at random to avoid detection and is believed to have murdered at least 11 people across the United States between 2001 and 2012. He was a meticulous serial killer who constantly morphed his modus operandi and the location in which he killed which helped him evade capture for years. <br>\n<br>\n\n</div>\n<div>In this bone chilling documentary, we actually see him kidnap his final victim, and we watch him being arrested. We go into the interrogation room with him as the police and FBI try to get the names and locations of his victims. But it’s all a game to Keyes, and he’s only willing to divulge a few of his secrets.<br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! \"Obsessed With: Disappeared.\" It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\" The first three episodes are live now!<strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Wed, 03 Jun 2020 09:30:00 +0000",
  "guid": "tag:audioboom.com,2020-06-03:/posts/7597531",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}