{
  "title": "Obsessed With: Abducted in Plain Sight Ep 1: One Year Later (Our first-ever spinoff podcast!)",
  "link": "https://audioboom.com/posts/7518478",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 1407,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>HERE'S EPISODE 1 OF OUR FIRST-EVER SPINOFF PODCAST! For Patrick, this new podcast has been year long labor of love! Please take a listen!</strong><br>\n<br>\nIt's been a year since the smash hit documentary <em>Abducted in Plain Sight</em> premiered on Netflix and set the internet ablaze with shock, fascination, disbelief, and rage over the story of 12 year-old Jan Broberg who was kidnapped TWICE by her neighbor and family friend Bob Berchtold. This four-part series goes behind the scenes of the documentary and shares new interviews with Jan and her parents, deleted scenes, shocking plot lines cut from the film, never-before-heard audio journals from the kidnapper and his wife recovered by the FBI, and so much more.<br>\n<br>\nIn episode 1, we catch up with Jan who shares how her life has changed in the year since <em>Abducted in Plain Sight</em> premiered and she shares new insight into how she found the courage to tell her story. We also learn how the filmmakers got ahold of the kidnapper's audio journals and we share more of these never-before-heard tapes.<br>\n<br>\nAll four episodes of <em>Obsessed With</em> <em>Abducted in Plain Sight</em> are available to binge right now! To learn more about Skye Borgman and <strong>Top Knot Films</strong>, <a href=\"http://www.topknotfilms.com/\">go here.</a> And if you're looking for more great podcasts, <a href=\"https://www.obsessednetwork.com/\">go here</a> to see all the podcasts made by the <strong>Obsessed Network. </strong>\n</div>\n",
  "pubDate": "Mon, 02 Mar 2020 05:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-29:/posts/7518478",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}