{
  "title": "Episode 15: &#8220;Hound Dog&#8221; by Big Mama Thornton",
  "link": "https://500songs.com/podcast/hound-dog-by-big-mama-thornton/",
  "pubDate": "Mon, 14 Jan 2019 11:36:53 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/hound-dog-by-big-mama-thornton/",
  "description": "Welcome to episode fifteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Hound Dog\" by Big Mama Thornton. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-15-hound-dog/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode (along with one, \"Shake, Rattle, and Roll\", that got cut out of the eventual episode)\n\nI used three main resources for this podcast.\n\n<a href=\"https://amzn.to/2RoiMVg\"><em>Big Mama Thornton: Her Life and Music</em> by Michael Spörke </a>&nbsp;is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language.\n\n<a href=\"https://amzn.to/2SY9jkw\"><em>Hound Dog: The Leiber and Stoller Autobiography</em> by Jerry Leiber, Mike Stoller, and David Ritz,</a> is an invaluable book on the most important songwriting team of their generation.\n\nAnd <a href=\"https://amzn.to/2RpFb4G\"><em>Midnight at the Barrelhouse: The Johnny Otis Story </em></a>by George Lipsitz is the definitive biography of Otis.\n\n<a href=\"https://amzn.to/2SUIIo8\">This collection</a> has most of Big Mama Thornton's fifties recordings on it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nOne of the things that is easy to miss when talking about early rock and roll is that much of the development of the genre is about the liminal spaces in race in America.\n\n(Before I start talking about this, a disclaimer I have to make -- I'm a white person, from a different country, born decades after the events I'm talking about. I'm trying to be as accurate as I can here, and as sensitive as I can, but I apologise if I mess up, and nothing I say here should be taken as more accurate or authoritative than the words of the people who were actually affected).\n\n\"Black\" and \"white\" are two categories imposed by culture, and like all culturally-imposed binaries, they're essentially arbitrary and don't really map very well onto really existing people. There have always been people who don't fit neatly into the boxes that a racist society insists everyone fits into -- and part of the reason that rock and roll happened when it did was that in the 1950s America was in the process of redefining those boxes, and moving some people who would have previously fit into one category into the other. The lines were being redrawn, and that led to some interesting art happening at the borders.\n\n(That sounds like I'm doing the \"at least some good art came from this terrible event\" thing. I'm really, really, not. Racism in all its forms is nothing but negative, and its distortions of culture are all negative too. But they do exist, and need noting when talking about culture subject to those distortions).\n\nThere were a lot of groups who would now be regarded as white in the USA but which back in the 1940s and 1950s weren't, quite. Jewish people, for example, were still legally discriminated against in a lot of places (unlike now, when they're merely *illegally* discriminated against). They weren't black, but they weren't quite white either. The same went for several other ethnic minorities, like Greek people.\n\nSo it's perhaps not all that surprising that one of the most successful blues records of all time, which later inspired an even more successful rock and roll record, was the result of a collaboration between a black singer, a Greek-American producer who said \"As a kid I decided that if our society dictated that one had to be black or white, I would be black\", and two Jewish songwriters.\n\nWillie Mae Thornton was big in every sense -- she weighed three hundred and fifty pounds, or about twenty-five stone, and she had a voice to match it -- she would often claim that she didn't need a microphone, because she was louder than any microphone anyway. We've talked in this series about blues shouters, and how they were mostly men, but she was at least the equal of any man as a shouter.\n\nShe became a blues singer when she was fourteen, thanks to her mentor, a singer called \"Diamond Teeth Mary\".\n\n[excerpt: \"Keep Your Hands Off Of Him\" · Diamond Teeth Mary]\n\nThat's a recording of Diamond Teeth Mary from the 1990s -- when she was *in* her nineties. She performed constantly until her death aged ninety-seven, but she only made her first record when she was ninety-two.\n\n\"Diamond Teeth Mary\" was the half-sister of the great blues singer Bessie Smith -- Mary had four stepmothers, one of whom was Smith's mother -- and she was a powerful singer herself, singing with the Hot Harlem Revue around Alabama. She was called \"Diamond Teeth Mary\" because she had diamonds embedded in her front teeth, so she'd be more imposing on stage.\n\nDiamond Teeth Mary heard the young Willie Mae Thornton singing while she was working on a garbage truck, got her to get off the garbage truck, and got her a job with the revue. Mary probably felt a kinship with the fourteen-year-old Willie Mae, a girl who only wore boy's clothes -- Mary had, herself, become a performer when she was only thirteen, having run away from her abusive family, dressed in boy's clothes, and joined the circus.\n\nWillie Mae Thornton stayed with that revue for most of the next decade, playing with musicians like Richard Penniman, who would later become known as Little Richard, playing to audiences that were mostly black and also (according to Little Richard) exclusively gay. The Hot Harlem Revue was not exactly respectable -- Sammy Green, who managed it, made most of his money from owning several brothels -- but it was somewhere that a young singer could very quickly learn how to be an entertainer.\n\nYou had to be impressive as a female blues singer in the 1940s, especially if, as with Willie Mae Thornton, you were also not conventionally attractive and not of a societally-approved sexuality or gender identity. I've seen suggestions from people who would know that Thornton was bisexual, but from others like Johnny Otis that she showed no interest in men or women (though she did have a child in her teens), and I've also seen suggestions that she may have been trans (though I'm going to refer to her using she and her pronouns here as that's what she used throughout her life).\n\nShe was a remarkable figure in many ways. One of her favourite drinks was embalming fluid and grape juice (just in case anyone was considering doing this, please don't. It's really not a good idea, at all, even a little bit. Don't drink embalming fluid.) According to Jerry Leiber she had razor scars all over her face. She was a very, very, intimidating person.\n\nAt the very least, she didn't fit into neat boxes.\n\nBut you see, all that stuff I just said... *that* is putting her into a box -- the caricature angry, aggressive, black woman. And that was a box she never liked to be put in either, but which she was put in by other people. What I just said, you'll notice, is all about what other people thought of her, and that's not always what she thought of herself. She would get very upset that people would say she used to fight promoters, saying \"I never did fight the promoters. All I ever did was ask them for my money. Pay me and there won’t be no hard feelings.\"\n\nAnd while she is uniformly described as \"masculine-looking\" (whatever *that* means), she put it rather differently, saying \"I don’t go out on stage trying to look pretty. I was born pretty.\"\n\nThornton is someone who didn't get to tell her own story much -- much of what we know about her is from other people's impressions of her, and usually the impressions of men. People who knew her well described her as intelligent, kind, charming, funny, and hugely talented, while people who only spent a brief time around her tend to have talked about the razor scars on her face or how aggressive she seemed. Depending on which narrative you choose, you can make a very good case for her being either a loud, swaggering, vulgar, aggressive stereotype of unfeminine black femininity, or a rather sweet, vulnerable, person who intimidated men simply by her physical size, her race, and her loud voice, and who may have played up to their expectations at times, but who never liked that, and who used alcohol and other substances to cope with what wasn't a very happy life, while remaining outwardly happy.\n\nBut because we as a society value black women so little, most of this story is filtered through the white men who told it, so be aware that in what follows, you may find yourself picturing a caricature figure, seeing Big Mama as the angry sassy black woman you've seen in a million films. She was a real person, and I wish we had more of her own words to set against this.\n\nWhile the Hot Harlem Revue was a good place to learn to be an entertainer, it wasn't necessarily the best place to work if you actually wanted to earn a living, and Willie Mae had to supplement her income by shining shoes. She often had to sleep in all-night restaurants and bars, because she couldn't afford to pay rent, and go begging door to door for food. But she would pretend to everyone she knew that everything was all right, and smile for everyone. She became pregnant in her teens, and tried to be a good mother to the child, but she was deemed an unfit mother due to poverty and the child was taken away from her.\n\nAfter several years with the Harlem Revue, she quit them because she was being cheated out of money, and decided to stay in Houston, Texas, which is where she really started to build an audience. Around this time she recorded her first single, \"All Right Baby\", credited to \"the Harlem Stars\" -- it's a song she wrote herself, and it's a boogie track very much in the vein of Big Joe Turner:\n\n[excerpt \"All Right Baby\", the Harlem Stars]\n\nShortly after moving to Houston, she began working for Don Robey, who ran Peacock Records and the Bronze Peacock Club. Robey had a mixed reputation -- most singers and musicians he worked with thought highly of him, but most songwriters he worked with were less enamoured of his penchant for stealing their money and credit.\n\nRobey had a reputation as a thug, too, but according to Little Richard he was too scared of Thornton to beat her up like he would his other acts.\n\nShe recorded several singles for Peacock, starting with \"I'm All Fed Up\", but her talents weren't really suited to the slick Texas blues backing she was given:\n\n[excerpt \"I'm All Fed Up\", Willie Mae Thornton]\n\nThe kind of music Peacock put out was in the smoother style that was becoming prominent in the southwestern US -- the kind of music that people like Lightnin' Hopkins made -- and that wasn't really suited to Thornton's louder, more emotional style. But after a run of unsuccessful singles, things started to change.\n\nPeacock Records was in the process of expanding. Don Robey acquired another label, Duke Records of Memphis, and merged them, and he got distributors working with him in different areas of the country. And he started working with Johnny Otis.\n\nOtis came to Texas, and he and Robey made a deal -- Otis would audition several of the acts that were on Duke and Peacock records, people like Thornton who had not had much success but clearly had talent, and he would incorporate them into his Johnny Otis Revue. Otis would take charge of producing their records, which would be cut in Los Angeles with Otis' band, and he would let Robey release the results.\n\nSome of the artists still couldn't find their commercial potential even with Otis producing. For example, Little Richard's recordings with Otis, while interesting, are an artistic dead-end for him:\n\n[excerpt: \"Little Richard Boogie\", Little Richard]\n\nOf course, Little Richard went on to do quite well for himself later...\n\nBut in the case of Willie Mae Thornton, something clicked. The two became lifelong friends, and also began a remarkable collaboration, with Otis being the first person to encourage Thornton to play harmonica as well as sing. On her first show with the Johnny Otis Revue, Willie Mae Thornton sang \"Have Mercy Baby\", the then-current hit by Billy Ward and the Dominoes, and the audience went so wild that they had to stop the show. After that point, they had to put Thornton at the top of the bill, after even Little Esther, so the audience would allow the other performers to come on.\n\nAnd with the top billing came a change of name. Johnny Otis had a knack for giving artists new names -- as well as Little Esther, he also gave Etta James and Sugar Pie DeSanto their stage names -- and in the case of Willie Mae Thornton, for the rest of her career she was known as \"Big Mama\" Thornton.\n\nAt the time we're talking about, Otis was, as much as a musician, a fixer, a wheeler-dealer, a person who brought people together. And this was a role that those people on the margins of whiteness – like Otis, a son of Greek immigrants who chose to live among black culture – excelled in. The people who were on the borderline between the two different conceptions of race often ended up as backroom facilitators, bringing white money to black artists -- people like Milt Gabler or Ahmet Ertegun or Cosimo Matassa, people of ethnicities that didn't quite fit into the black/white binary, people who were white enough to use white privilege to get financing, but not so white they identified with the majority culture.\n\nAnd in 1952, the people Otis brought together were Big Mama Thornton and two young songwriters who would change the world of music.\n\nJerry Leiber and Mike Stoller were Jewish teenagers, both of whom had moved to California from elsewhere -- Stoller from New York and Leiber from Maryland. Mike Stoller was a musician, who was into modern jazz and modern art music -- he loved Bartok and Thelonius Monk -- but he also had a background in stride and boogie woogie. After he found normal piano lessons uncongenial, he'd been offered lessons by the great James P Johnson, who had taught him how to play boogie. James P Johnson was essentially the inventor of jazz piano -- he'd started out playing ragtime, and had invented the stride piano style that Johnson had taught to Fats Waller. He'd been one of the performers at the Spirituals to Swing concerts, and was also a major composer of serious music, but what he taught young Mike Stoller was how to play a boogie bassline, how to understand twelve-bar blues structure and other rudiments of the blues pianist's art. As Stoller later put it, \"it was as if Beethoven were about to give me a lesson—except that, unlike James P. Johnson, Beethoven had never given a piano lesson to Fats Waller\". After moving to LA, Stoller started studying with Arthur Lange, a composer of film soundtracks, and playing piano for jazz bands, jamming with people like Chet Baker.\n\nMeanwhile, Jerry Leiber was a blues fanatic, who had had a minor epiphany after hearing Jimmy Witherspoon's \"Ain't Nobody's Business if I Do\":\n\n[excerpt: Jimmy Witherspoon \"Ain't Nobody's Business\"]\n\nLeiber had heard Witherspoon's song, and realised that he could do that, and he decided he was going to. He was going to become a songwriter, and he started working on song lyrics immediately, although he had no idea how to go about getting anyone to perform them. The first song he wrote was called \"Real Ugly Woman\". The lyrics went \"She’s a real ugly woman, don’t see how she got that way/Every time she comes ’round, she runs all my friends away\".\n\nHe didn't have much knowledge of the music business, but luckily that knowledge walked right through the door. Leiber was working at a small record store, and one day Lester Sill, who was the national sales manager for Modern Records, walked into the shop.\n\nModern Records was one of the dozens of tiny blues labels that were springing up across the country, usually run by Jewish and Italian entrepreneurs who could see the potential in black music even if the owners of the major labels couldn't, and Sill was a real enthusiast for the music he was selling. He started pitching records to Jerry Leiber, telling him he'd love them, acting as if Leiber was the most important person in the world, even though Leiber kept explaining he didn't make the buying decisions for the shop, he was only a shop assistant.\n\nEventually, after playing a record called \"Boogie Chillen\", by a new artist called John Lee Hooker, which excited Leiber enormously, Sill asked Leiber what he was going to do when he grew up. Leiber replied that he was already grown up, but he planned to become a songwriter. Sill asked to hear one of the songs, and Leiber sang \"Real Ugly Woman\" to him. Sill liked it, and asked for copies of his songs. When Leiber explained that he didn't know how to write music, Sill told him to find a partner who did.\n\nLeiber found Stoller through a mutual friend, who told Leiber that Stoller knew about music. Leiber phoned Stoller, who was unimpressed by the idea of writing songs together, because to his mind \"songs\" were the kind of thing that was dominating the pop charts at the time, the kind of thing that Patti Page or someone would record, not something someone who was into hard bop music would like. But Leiber eventually persuaded him to at least take a look at the lyrics he'd been writing.\n\nStoller looked at the lyrics to \"Real Ugly Woman\", and said \"These are blues! You didn’t tell me you were writing blues. I love the blues.”\n\nThey started collaborating together that day, in 1950, and worked together for the rest of their lives. Soon Jimmy Witherspoon himself was singing \"Real Ugly Woman\", just like Leiber had hoped when he'd started writing:\n\n[Excerpt: Jimmy Witherspoon \"Real Ugly Woman\"]\n\nSoon after, Ralph Bass moved to LA from New York. He'd got to know Leiber and Stoller on their trips East and when he moved west he introduced them to Johnny Otis, who Bass had kept in touch with after leaving Savoy Records. Through the connection with Otis and Bass, they wrote many songs for Little Esther, and they also started a partnership with Little Esther's former backing vocalists The Robins, who put out the very first single with a Leiber and Stoller writing credit: \"That's What the Good Book Says\".\n\n[Excerpt: The Robins \"That's What the Good Book Says\"]\n\nThe partnership between the Leiber and Stoller team and the Robins would end up defining all their careers.\n\nBut right now, Leiber and Stoller were a couple of teenagers who were working with their heroes. And at least one of those heroes was not very impressed. Johnny Otis had introduced them to Big Mama Thornton and asked if they had a song for her. They said \"we don't, but we will have in a few minutes\", ran back to Stoller's house, and quickly knocked out \"Hound Dog\" in a style that they thought would suit Thornton.\n\n\"Hound dog\" was, at the time, black slang for a gigolo, and what Leiber and Stoller wanted to do was have a song that was as aggressive as possible, with their singer demeaning the man she was singing to, while also including sexual undertones. (Those undertones were strengthened in the follow-up Thornton recorded, \"Tom Cat\", where she told a \"tom cat\" \"I ain't going to feed you fish no more\").\n\nLeiber and Stoller had very strong ideas about how their new song should be performed, and they made the mistake of telling her about them. Big Mama Thornton was not about to let two white teenagers teach her how to sing the blues.\n\nIn truth, Big Mama Thornton was only a few years older than those kids -- they were in their late teens, and she was in her mid twenties -- but that kind of gap can seem like a big difference, and it might well also be that Thornton was offended by the fact that these white men were telling her, a black woman, how to do her job. So when Jerry Leiber insisted that rather than croon the song as she had been doing, she should \"attack it\", her response was to point to her crotch and say \"attack this!\"\n\nJohnny Otis didn't help by playing a rimshot right after Thornton said that. But he then suggested that Leiber sing it for Thornton, and she did listen, and agreed to try it that way. Once the communication problem had been sorted, Thornton turned in the definitive performance of the song.\n\n[excerpt: Big Mama Thornton, \"Hound Dog\"]\n\n\"Hound Dog\" is also notable as being one of the last times Johnny Otis played drums on a record. While he could still play the vibraphone, he could no longer hold his drumsticks properly, and so he'd largely given up drumming.\n\nBut when they were working out the arrangement for the recording session, Otis played the drums in the rehearsals, playing with a style of his own -- turning the snare off on his snare drum so it sounded more like a tom-tom. When it came to the actual recording, though, Otis was in the control room, while a session drummer was playing in the studio. But Leiber and Stoller both agreed that he simply wasn't playing the part properly, and enticed Otis into the studio and got him to play the part as he'd been playing it in rehearsal.\n\nWhat happened next is a subject of much debate. What everyone is agreed on is that Otis was credited as a co-writer early on, but that he wasn't credited later. The story as Otis told it is that he did actually help Leiber and Stoller pull the song together, rewriting it with them, as well as doing the arrangement in the studio (which no-one disputes him doing). He claimed specifically that he'd come up with the lines \"You made me feel so blue, you make me weep and moan/You ain't looking for a woman, you're just looking for a home\", because Leiber and Stoller had had, quote, \"some derogatory crap\" in there, that he'd had to remove references to chicken and watermelon, and that he constantly had to edit their songs.\n\nHe said that Leiber and Stoller acknowledged he was a co-writer right up until the point where Elvis Presley wanted to record the song a few years later.\n\nLeiber and Stoller, on the other hand, claimed that Otis had no involvement with the songwriting, and that he'd misrepresented himself to Don Robey. They claimed that Otis had falsely claimed he had power of attorney for them, as well as falsely claiming to have co-written the song, and deliberately defrauded them.\n\nOn the other hand, it's only because of Otis that Leiber and Stoller got credit at all -- Don Robey, who as I've mentioned was a notorious thief of writing credits, originally put himself and Thornton down as the writers, and it was Otis who got the credits amended.\n\nEither way, Leiber and Stoller have, for more than sixty years, had the sole songwriting credits for the track, and Otis never bothered to dispute their claim in court. Indeed, they don't appear to have had any particular animosity -- they all repeatedly praised the others' abilities.\n\nAlthough as Otis put it \"I could have sent my kids to college, like they sent theirs. But, oh well, if I dwell on that I get quite unhappy, so we try to move on.\"\n\nWhat's most ridiculous about the whole credit mess is that Elvis' version bore almost no resemblance to the song Leiber and Stoller wrote. Elvis' version was a cover of a version by the white Vegas lounge band Freddie Bell and the Bellboys, which was more or less a parody of the original.\n\n[excerpt: Freddie Bell and the Bellboys - “Hound Dog”]\n\nBut still, Elvis came later, as did the money. In 1953, all Leiber and Stoller got for a record that sold over a million copies was a cheque for one thousand two hundred dollars. A cheque which bounced. As a result of their experience getting ripped off by Robey, Leiber and Stoller formed their own record label with Lester Sill, and we'll be hearing more about that later...\n\nBig Mama Thornton did actually get paid for her million-seller -- a whole five hundred dollars -- but she never had the success she deserved. She later wrote the song \"Ball and Chain\":\n\n[excerpt: Big Mama Thornton, \"Ball and Chain\"]\n\nJanis Joplin later had a hit with that, and you can hear from Thornton's version just how much Joplin took from Thornton's vocal style. But due to a bad contract Thornton never made a penny in royalties from the song she wrote (which is a far more egregious injustice than the one people complain about, that Elvis had a hit with \"Hound Dog\" -- she didn't write that one, and Elvis did pay the writers).\n\nShe continued performing until a few days before she died, in July 1984, despite getting so sick and losing so much weight (she was under a hundred pounds at the end) that she was almost unrecognisable. She died two weeks before Little Esther, and like Esther, she had asked Johnny Otis, now the Reverend Johnny Otis, to give her eulogy.\n\nOtis said, in part “Mama always told me that the blues were more important than having money. She told me: Artists are artists and businessmen are businessmen. But the trouble is the artist’s money stays in the businessmen’s hands. [...] Don’t waste your sorrow on Big Mama. She’s free. Don’t feel sorry for Big Mama. There’s no more pain. No more suffering in a society where the color of skin was more important than the quality of your talent.\"",
  "itunes:subtitle": "Welcome to episode fifteen of A History of Rock Music in Five Hundred Songs. Today were looking at Hound Dog by Big Mama Thornton. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs alway",
  "itunes:keywords": "Bessie Smith,Big Mama Thornton,Diamond Teeth Mary,Don Robey,Duke Records,Esther Phillips,James P. Johnson,Jimmy Witherspoon,Johnny Otis,Leiber and Stoller,Lester Sill,LGBT+ people,Little Richard,Modern Records,Peacock Records,racism,Ralph Bass,the blues,The Robins",
  "itunes:episodeType": "full",
  "itunes:episode": 15,
  "content:encoded": "Welcome to episode fifteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Hound Dog\" by Big Mama Thornton. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-15-hound-dog/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode (along with one, \"Shake, Rattle, and Roll\", that got cut out of the eventual episode)\n\nI used three main resources for this podcast.\n\n<a href=\"https://amzn.to/2RoiMVg\"><em>Big Mama Thornton: Her Life and Music</em> by Michael Spörke </a>&nbsp;is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language.\n\n<a href=\"https://amzn.to/2SY9jkw\"><em>Hound Dog: The Leiber and Stoller Autobiography</em> by Jerry Leiber, Mike Stoller, and David Ritz,</a> is an invaluable book on the most important songwriting team of their generation.\n\nAnd <a href=\"https://amzn.to/2RpFb4G\"><em>Midnight at the Barrelhouse: The Johnny Otis Story </em></a>by George Lipsitz is the definitive biography of Otis.\n\n<a href=\"https://amzn.to/2SUIIo8\">This collection</a> has most of Big Mama Thornton's fifties recordings on it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nOne of the things that is easy to miss when talking about early rock and roll is that much of the development of the genre is about the liminal spaces in race in America.\n\n(Before I start talking about this, a disclaimer I have to make -- I'm a white person, from a different country, born decades after the events I'm talking about. I'm trying to be as accurate as I can here, and as sensitive as I can, but I apologise if I mess up, and nothing I say here should be taken as more accurate or authoritative than the words of the people who were actually affected).\n\n\"Black\" and \"white\" are two categories imposed by culture, and like all culturally-imposed binaries, they're essentially arbitrary and don't really map very well onto really existing people. There have always been people who don't fit neatly into the boxes that a racist society insists everyone fits into -- and part of the reason that rock and roll happened when it did was that in the 1950s America was in the process of redefining those boxes, and moving some people who would have previously fit into one category into the other. The lines were being redrawn, and that led to some interesting art happening at the borders.\n\n(That sounds like I'm doing the \"at least some good art came from this terrible event\" thing. I'm really, really, not. Racism in all its forms is nothing but negative, and its distortions of culture are all negative too. But they do exist, and need noting when talking about culture subject to those distortions).\n\nThere were a lot of groups who would now be regarded as white in the USA but which back in the 1940s and 1950s weren't, quite. Jewish people, for example, were still legally discriminated against in a lot of places (unlike now, when they're merely *illegally* discriminated against). They weren't black, but they weren't quite white either. The same went for several other ethnic minorities, like Greek people.\n\nSo it's perhaps not all that surprising that one of the most successful blues records of all time, which later inspired an even more successful rock and roll record, was the result of a collaboration between a black singer, a Greek-American producer who said \"As a kid I decided that if our society dictated that one had to be black or white, I would be black\", and two Jewish songwriters.\n\nWillie Mae Thornton was big in every sense -- she weighed three hundred and fifty pounds, or about twenty-five stone, and she had a voice to match it -- she would often claim that she didn't need a microphone, because she was louder than any microphone anyway. We've talked in this series about blues shouters, and how they were mostly men, but she was at least the equal of any man as a shouter.\n\nShe became a blues singer when she was fourteen, thanks to her mentor, a singer called \"Diamond Teeth Mary\".\n\n[excerpt: \"Keep Your Hands Off Of Him\" · Diamond Teeth Mary]\n\nThat's a recording of Diamond Teeth Mary from the 1990s -- when she was *in* her nineties. She performed constantly until her death aged ninety-seven, but she only made her first record when she was ninety-two.\n\n\"Diamond Teeth Mary\" was the half-sister of the great blues singer Bessie Smith -- Mary had four stepmothers, one of whom was Smith's mother -- and she was a powerful singer herself, singing with the Hot Harlem Revue around Alabama. She was called \"Diamond Teeth Mary\" because she had diamonds embedded in her front teeth, so she'd be more imposing on stage.\n\nDiamond Teeth Mary heard the young Willie Mae Thornton singing while she was working on a garbage truck, got her to get off the garbage truck, and got her a job with the revue. Mary probably felt a kinship with the fourteen-year-old Willie Mae, a girl who only wore boy's clothes -- Mary had, herself, become a performer when she was only thirteen, having run away from her abusive family, dressed in boy's clothes, and joined the circus.\n\nWillie Mae Thornton stayed with that revue for most of the next decade, playing with musicians like Richard Penniman, who would later become known as Little Richard, playing to audiences that were mostly black and also (according to Little Richard) exclusively gay. The Hot Harlem Revue was not exactly respectable -- Sammy Green, who managed it, made most of his money from owning several brothels -- but it was somewhere that a young singer could very quickly learn how to be an entertainer.\n\nYou had to be impressive as a female blues singer in the 1940s, especially if, as with Willie Mae Thornton, you were also not conventionally attractive and not of a societally-approved sexuality or gender identity. I've seen suggestions from people who would know that Thornton was bisexual, but from others like Johnny Otis that she showed no interest in men or women (though she did have a child in her teens), and I've also seen suggestions that she may have been trans (though I'm going to refer to her using she and her pronouns here as that's what she used throughout her life).\n\nShe was a remarkable figure in many ways. One of her favourite drinks was embalming fluid and grape juice (just in case anyone was considering doing this, please don't. It's really not a good idea, at all, even a little bit. Don't drink embalming fluid.) According to Jerry Leiber she had razor scars all over her face. She was a very, very, intimidating person.\n\nAt the very least, she didn't fit into neat boxes.\n\nBut you see, all that stuff I just said... *that* is putting her into a box -- the caricature angry, aggressive, black woman. And that was a box she never liked to be put in either, but which she was put in by other people. What I just said, you'll notice, is all about what other people thought of her, and that's not always what she thought of herself. She would get very upset that people would say she used to fight promoters, saying \"I never did fight the promoters. All I ever did was ask them for my money. Pay me and there won’t be no hard feelings.\"\n\nAnd while she is uniformly described as \"masculine-looking\" (whatever *that* means), she put it rather differently, saying \"I don’t go out on stage trying to look pretty. I was born pretty.\"\n\nThornton is someone who didn't get to tell her own story much -- much of what we know about her is from other people's impressions of her, and usually the impressions of men. People who knew her well described her as intelligent, kind, charming, funny, and hugely talented, while people who only spent a brief time around her tend to have talked about the razor scars on her face or how aggressive she seemed. Depending on which narrative you choose, you can make a very good case for her being either a loud, swaggering, vulgar, aggressive stereotype of unfeminine black femininity, or a rather sweet, vulnerable, person who intimidated men simply by her physical size, her race, and her loud voice, and who may have played up to their expectations at times, but who never liked that, and who used alcohol and other substances to cope with what wasn't a very happy life, while remaining outwardly happy.\n\nBut because we as a society value black women so little, most of this story is filtered through the white men who told it, so be aware that in what follows, you may find yourself picturing a caricature figure, seeing Big Mama as the angry sassy black woman you've seen in a million films. She was a real person, and I wish we had more of her own words to set against this.\n\nWhile the Hot Harlem Revue was a good place to learn to be an entertainer, it wasn't necessarily the best place to work if you actually wanted to earn a living, and Willie Mae had to supplement her income by shining shoes. She often had to sleep in all-night restaurants and bars, because she couldn't afford to pay rent, and go begging door to door for food. But she would pretend to everyone she knew that everything was all right, and smile for everyone. She became pregnant in her teens, and tried to be a good mother to the child, but she was deemed an unfit mother due to poverty and the child was taken away from her.\n\nAfter several years with the Harlem Revue, she quit them because she was being cheated out of money, and decided to stay in Houston, Texas, which is where she really started to build an audience. Around this time she recorded her first single, \"All Right Baby\", credited to \"the Harlem Stars\" -- it's a song she wrote herself, and it's a boogie track very much in the vein of Big Joe Turner:\n\n[excerpt \"All Right Baby\", the Harlem Stars]\n\nShortly after moving to Houston, she began working for Don Robey, who ran Peacock Records and the Bronze Peacock Club. Robey had a mixed reputation -- most singers and musicians he worked with thought highly of him, but most songwriters he worked with were less enamoured of his penchant for stealing their money and credit.\n\nRobey had a reputation as a thug, too, but according to Little Richard he was too scared of Thornton to beat her up like he would his other acts.\n\nShe recorded several singles for Peacock, starting with \"I'm All Fed Up\", but her talents weren't really suited to the slick Texas blues backing she was given:\n\n[excerpt \"I'm All Fed Up\", Willie Mae Thornton]\n\nThe kind of music Peacock put out was in the smoother style that was becoming prominent in the southwestern US -- the kind of music that people like Lightnin' Hopkins made -- and that wasn't really suited to Thornton's louder, more emotional style. But after a run of unsuccessful singles, things started to change.\n\nPeacock Records was in the process of expanding. Don Robey acquired another label, Duke Records of Memphis, and merged them, and he got distributors working with him in different areas of the country. And he started working with Johnny Otis.\n\nOtis came to Texas, and he and Robey made a deal -- Otis would audition several of the acts that were on Duke and Peacock records, people like Thornton who had not had much success but clearly had talent, and he would incorporate them into his Johnny Otis Revue. Otis would take charge of producing their records, which would be cut in Los Angeles with Otis' band, and he would let Robey release the results.\n\nSome of the artists still couldn't find their commercial potential even with Otis producing. For example, Little Richard's recordings with Otis, while interesting, are an artistic dead-end for him:\n\n[excerpt: \"Little Richard Boogie\", Little Richard]\n\nOf course, Little Richard went on to do quite well for himself later...\n\nBut in the case of Willie Mae Thornton, something clicked. The two became lifelong friends, and also began a remarkable collaboration, with Otis being the first person to encourage Thornton to play harmonica as well as sing. On her first show with the Johnny Otis Revue, Willie Mae Thornton sang \"Have Mercy Baby\", the then-current hit by Billy Ward and the Dominoes, and the audience went so wild that they had to stop the show. After that point, they had to put Thornton at the top of the bill, after even Little Esther, so the audience would allow the other performers to come on.\n\nAnd with the top billing came a change of name. Johnny Otis had a knack for giving artists new names -- as well as Little Esther, he also gave Etta James and Sugar Pie DeSanto their stage names -- and in the case of Willie Mae Thornton, for the rest of her career she was known as \"Big Mama\" Thornton.\n\nAt the time we're talking about, Otis was, as much as a musician, a fixer, a wheeler-dealer, a person who brought people together. And this was a role that those people on the margins of whiteness – like Otis, a son of Greek immigrants who chose to live among black culture – excelled in. The people who were on the borderline between the two different conceptions of race often ended up as backroom facilitators, bringing white money to black artists -- people like Milt Gabler or Ahmet Ertegun or Cosimo Matassa, people of ethnicities that didn't quite fit into the black/white binary, people who were white enough to use white privilege to get financing, but not so white they identified with the majority culture.\n\nAnd in 1952, the people Otis brought together were Big Mama Thornton and two young songwriters who would change the world of music.\n\nJerry Leiber and Mike Stoller were Jewish teenagers, both of whom had moved to California from elsewhere -- Stoller from New York and Leiber from Maryland. Mike Stoller was a musician, who was into modern jazz and modern art music -- he loved Bartok and Thelonius Monk -- but he also had a background in stride and boogie woogie. After he found normal piano lessons uncongenial, he'd been offered lessons by the great James P Johnson, who had taught him how to play boogie. James P Johnson was essentially the inventor of jazz piano -- he'd started out playing ragtime, and had invented the stride piano style that Johnson had taught to Fats Waller. He'd been one of the performers at the Spirituals to Swing concerts, and was also a major composer of serious music, but what he taught young Mike Stoller was how to play a boogie bassline, how to understand twelve-bar blues structure and other rudiments of the blues pianist's art. As Stoller later put it, \"it was as if Beethoven were about to give me a lesson—except that, unlike James P. Johnson, Beethoven had never given a piano lesson to Fats Waller\". After moving to LA, Stoller started studying with Arthur Lange, a composer of film soundtracks, and playing piano for jazz bands, jamming with people like Chet Baker.\n\nMeanwhile, Jerry Leiber was a blues fanatic, who had had a minor epiphany after hearing Jimmy Witherspoon's \"Ain't Nobody's Business if I Do\":\n\n[excerpt: Jimmy Witherspoon \"Ain't Nobody's Business\"]\n\nLeiber had heard Witherspoon's song, and realised that he could do that, and he decided he was going to. He was going to become a songwriter, and he started working on song lyrics immediately, although he had no idea how to go about getting anyone to perform them. The first song he wrote was called \"Real Ugly Woman\". The lyrics went \"She’s a real ugly woman, don’t see how she got that way/Every time she comes ’round, she runs all my friends away\".\n\nHe didn't have much knowledge of the music business, but luckily that knowledge walked right through the door. Leiber was working at a small record store, and one day Lester Sill, who was the national sales manager for Modern Records, walked into the shop.\n\nModern Records was one of the dozens of tiny blues labels that were springing up across the country, usually run by Jewish and Italian entrepreneurs who could see the potential in black music even if the owners of the major labels couldn't, and Sill was a real enthusiast for the music he was selling. He started pitching records to Jerry Leiber, telling him he'd love them, acting as if Leiber was the most important person in the world, even though Leiber kept explaining he didn't make the buying decisions for the shop, he was only a shop assistant.\n\nEventually, after playing a record called \"Boogie Chillen\", by a new artist called John Lee Hooker, which excited Leiber enormously, Sill asked Leiber what he was going to do when he grew up. Leiber replied that he was already grown up, but he planned to become a songwriter. Sill asked to hear one of the songs, and Leiber sang \"Real Ugly Woman\" to him. Sill liked it, and asked for copies of his songs. When Leiber explained that he didn't know how to write music, Sill told him to find a partner who did.\n\nLeiber found Stoller through a mutual friend, who told Leiber that Stoller knew about music. Leiber phoned Stoller, who was unimpressed by the idea of writing songs together, because to his mind \"songs\" were the kind of thing that was dominating the pop charts at the time, the kind of thing that Patti Page or someone would record, not something someone who was into hard bop music would like. But Leiber eventually persuaded him to at least take a look at the lyrics he'd been writing.\n\nStoller looked at the lyrics to \"Real Ugly Woman\", and said \"These are blues! You didn’t tell me you were writing blues. I love the blues.”\n\nThey started collaborating together that day, in 1950, and worked together for the rest of their lives. Soon Jimmy Witherspoon himself was singing \"Real Ugly Woman\", just like Leiber had hoped when he'd started writing:\n\n[Excerpt: Jimmy Witherspoon \"Real Ugly Woman\"]\n\nSoon after, Ralph Bass moved to LA from New York. He'd got to know Leiber and Stoller on their trips East and when he moved west he introduced them to Johnny Otis, who Bass had kept in touch with after leaving Savoy Records. Through the connection with Otis and Bass, they wrote many songs for Little Esther, and they also started a partnership with Little Esther's former backing vocalists The Robins, who put out the very first single with a Leiber and Stoller writing credit: \"That's What the Good Book Says\".\n\n[Excerpt: The Robins \"That's What the Good Book Says\"]\n\nThe partnership between the Leiber and Stoller team and the Robins would end up defining all their careers.\n\nBut right now, Leiber and Stoller were a couple of teenagers who were working with their heroes. And at least one of those heroes was not very impressed. Johnny Otis had introduced them to Big Mama Thornton and asked if they had a song for her. They said \"we don't, but we will have in a few minutes\", ran back to Stoller's house, and quickly knocked out \"Hound Dog\" in a style that they thought would suit Thornton.\n\n\"Hound dog\" was, at the time, black slang for a gigolo, and what Leiber and Stoller wanted to do was have a song that was as aggressive as possible, with their singer demeaning the man she was singing to, while also including sexual undertones. (Those undertones were strengthened in the follow-up Thornton recorded, \"Tom Cat\", where she told a \"tom cat\" \"I ain't going to feed you fish no more\").\n\nLeiber and Stoller had very strong ideas about how their new song should be performed, and they made the mistake of telling her about them. Big Mama Thornton was not about to let two white teenagers teach her how to sing the blues.\n\nIn truth, Big Mama Thornton was only a few years older than those kids -- they were in their late teens, and she was in her mid twenties -- but that kind of gap can seem like a big difference, and it might well also be that Thornton was offended by the fact that these white men were telling her, a black woman, how to do her job. So when Jerry Leiber insisted that rather than croon the song as she had been doing, she should \"attack it\", her response was to point to her crotch and say \"attack this!\"\n\nJohnny Otis didn't help by playing a rimshot right after Thornton said that. But he then suggested that Leiber sing it for Thornton, and she did listen, and agreed to try it that way. Once the communication problem had been sorted, Thornton turned in the definitive performance of the song.\n\n[excerpt: Big Mama Thornton, \"Hound Dog\"]\n\n\"Hound Dog\" is also notable as being one of the last times Johnny Otis played drums on a record. While he could still play the vibraphone, he could no longer hold his drumsticks properly, and so he'd largely given up drumming.\n\nBut when they were working out the arrangement for the recording session, Otis played the drums in the rehearsals, playing with a style of his own -- turning the snare off on his snare drum so it sounded more like a tom-tom. When it came to the actual recording, though, Otis was in the control room, while a session drummer was playing in the studio. But Leiber and Stoller both agreed that he simply wasn't playing the part properly, and enticed Otis into the studio and got him to play the part as he'd been playing it in rehearsal.\n\nWhat happened next is a subject of much debate. What everyone is agreed on is that Otis was credited as a co-writer early on, but that he wasn't credited later. The story as Otis told it is that he did actually help Leiber and Stoller pull the song together, rewriting it with them, as well as doing the arrangement in the studio (which no-one disputes him doing). He claimed specifically that he'd come up with the lines \"You made me feel so blue, you make me weep and moan/You ain't looking for a woman, you're just looking for a home\", because Leiber and Stoller had had, quote, \"some derogatory crap\" in there, that he'd had to remove references to chicken and watermelon, and that he constantly had to edit their songs.\n\nHe said that Leiber and Stoller acknowledged he was a co-writer right up until the point where Elvis Presley wanted to record the song a few years later.\n\nLeiber and Stoller, on the other hand, claimed that Otis had no involvement with the songwriting, and that he'd misrepresented himself to Don Robey. They claimed that Otis had falsely claimed he had power of attorney for them, as well as falsely claiming to have co-written the song, and deliberately defrauded them.\n\nOn the other hand, it's only because of Otis that Leiber and Stoller got credit at all -- Don Robey, who as I've mentioned was a notorious thief of writing credits, originally put himself and Thornton down as the writers, and it was Otis who got the credits amended.\n\nEither way, Leiber and Stoller have, for more than sixty years, had the sole songwriting credits for the track, and Otis never bothered to dispute their claim in court. Indeed, they don't appear to have had any particular animosity -- they all repeatedly praised the others' abilities.\n\nAlthough as Otis put it \"I could have sent my kids to college, like they sent theirs. But, oh well, if I dwell on that I get quite unhappy, so we try to move on.\"\n\nWhat's most ridiculous about the whole credit mess is that Elvis' version bore almost no resemblance to the song Leiber and Stoller wrote. Elvis' version was a cover of a version by the white Vegas lounge band Freddie Bell and the Bellboys, which was more or less a parody of the original.\n\n[excerpt: Freddie Bell and the Bellboys - “Hound Dog”]\n\nBut still, Elvis came later, as did the money. In 1953, all Leiber and Stoller got for a record that sold over a million copies was a cheque for one thousand two hundred dollars. A cheque which bounced. As a result of their experience getting ripped off by Robey, Leiber and Stoller formed their own record label with Lester Sill, and we'll be hearing more about that later...\n\nBig Mama Thornton did actually get paid for her million-seller -- a whole five hundred dollars -- but she never had the success she deserved. She later wrote the song \"Ball and Chain\":\n\n[excerpt: Big Mama Thornton, \"Ball and Chain\"]\n\nJanis Joplin later had a hit with that, and you can hear from Thornton's version just how much Joplin took from Thornton's vocal style. But due to a bad contract Thornton never made a penny in royalties from the song she wrote (which is a far more egregious injustice than the one people complain about, that Elvis had a hit with \"Hound Dog\" -- she didn't write that one, and Elvis did pay the writers).\n\nShe continued performing until a few days before she died, in July 1984, despite getting so sick and losing so much weight (she was under a hundred pounds at the end) that she was almost unrecognisable. She died two weeks before Little Esther, and like Esther, she had asked Johnny Otis, now the Reverend Johnny Otis, to give her eulogy.\n\nOtis said, in part “Mama always told me that the blues were more important than having money. She told me: Artists are artists and businessmen are businessmen. But the trouble is the artist’s money stays in the businessmen’s hands. [...] Don’t waste your sorrow on Big Mama. She’s free. Don’t feel sorry for Big Mama. There’s no more pain. No more suffering in a society where the color of skin was more important than the quality of your talent.\"",
  "enclosure": "",
  "itunes:summary": "Welcome to episode fifteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Hound Dog\" by Big Mama Thornton. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode (along with one, \"Shake, Rattle, and Roll\", that got cut out of the eventual episode)\n\nI used three main resources for this podcast.\n\nBig Mama Thornton: Her Life and Music by Michael Spörke &nbsp;is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz, is an invaluable book on the most important songwriting team of their generation.\n\nAnd Midnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz is the definitive biography of Otis.\n\nThis collection has most of Big Mama Thornton's fifties recordings on it.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nOne of the things that is easy to miss when talking about early rock and roll is that much of the development of the genre is about the liminal spaces in race in America.\n\n(Before I start talking about this, a disclaimer I have to make -- I'm a white person, from a different country, born decades after the events I'm talking about. I'm trying to be as accurate as I can here, and as sensitive as I can, but I apologise if I mess up, and nothing I say here should be taken as more accurate or authoritative than the words of the people who were actually affected).\n\n\"Black\" and \"white\" are two categories imposed by culture, and like all culturally-imposed binaries, they're essentially arbitrary and don't really map very well onto really existing people. There have always been people who don't fit neatly into the boxes that a racist society insists everyone fits into -- and part of the reason that rock and roll happened when it did was that in the 1950s America was in the process of redefining those boxes, and moving some people who would have previously fit into one category into the other. The lines were being redrawn, and that led to some interesting art happening at the borders.\n\n(That sounds like I'm doing the \"at least some good art came from this terrible event\" thing. I'm really, really, not. Racism in all its forms is nothing but negative, and its distortions of culture are all negative too. But they do exist, and need noting when talking about culture subject to those distortions).\n\nThere were a lot of groups who would now be regarded as white in the USA but which back in the 1940s and 1950s weren't, quite. Jewish people, for example, were still legally discriminated against in a lot of places (unlike now, when they're merely *illegally* discriminated against). They weren't black, but they weren't quite white either. The same went for several other ethnic minorities, like Greek people.\n\nSo it's perhaps not all that surprising that one of the most successful blues records of all time, which later inspired an even more successful rock and roll record, was the result of a collaboration between a black singer, a Greek-American producer who said \"As a kid I decided that if our society dictated that one had to be black or white, I would be black\", and two Jewish songwriters.\n\nWillie Mae Thornton was big in every sense -- she weighed three hundred and fifty pounds, or about twenty-five stone, and she had a voice to match it -- she would often claim that she didn't need a microphone, because she was louder than any microphone anyway. We've talked in this series about blues shouters, and how they were mostly men, but she was at least the equal of any man as a shouter.\n\nShe became a blues singer when she was fourteen, thanks to her mentor, a singer called \"Diamond Teeth Mary\".\n\n[excerpt: \"",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode fifteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Hound Dog\" by Big Mama Thornton. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode (along with one, \"Shake, Rattle, and Roll\", that got cut out of the eventual episode)\n\nI used three main resources for this podcast.\n\nBig Mama Thornton: Her Life and Music by Michael Spörke &nbsp;is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz, is an invaluable book on the most important songwriting team of their generation.\n\nAnd Midnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz is the definitive biography of Otis.\n\nThis collection has most",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}