{
  "id": "yt:video:mCoV-bKzee4",
  "yt:videoId": "mCoV-bKzee4",
  "yt:channelId": "UCCWeRTgd79JL0ilH0ZywSJA",
  "title": "Rack and Pinion (2642 Pitt Pirates)",
  "link": "",
  "author": {
    "name": "AlphaPhoenix",
    "uri": "https://www.youtube.com/channel/UCCWeRTgd79JL0ilH0ZywSJA"
  },
  "published": "2022-09-09T10:00:38+00:00",
  "updated": "2022-09-16T09:26:49+00:00",
  "media:group": {
    "media:title": "Rack and Pinion (2642 Pitt Pirates)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This past spring I attended the FRC North Carolina State Championships and got to talk to a bunch of the teams. If you've never heard of FIRST Robotics, you're in for a real treat, because this competition is AWESOME. (If you haven't seen the hub video for all these interviews, check it out first! https://youtu.be/BycqWYE3Ais)\n\nThese teams, thousands of them, have only about 2 months to design, build, and test robots to play a brand new game before the competitions begin, and then their work is put to the test! It would be a lot for any professional engineer, but these kids are still in high school! It's pretty incredible.\n\nThis video is the complete pit interview with FIRST Team 2642. Enjoy!\n------------------------------------------------------\nTo join or support team 2642:\nhttp://www.pittpiratesrobotics.com/\n------------------------------------------------------\nIf you're interested in finding a team or attending an event, here's the official team search from FIRST:\nhttps://www.firstinspires.org/team-event-search\nAnd if you want to know more about any specific team (like a link to their website) you can probably find it on Blue Alliance:\nhttps://www.thebluealliance.com/\n------------------------------------------------------\nThis is a world map that shows events and teams. I'm not sure how accurate it is because it doesn't look official, but it's a lot easier to search by eye! (and it also doesn't include the other FIRST programs like FLL and FTC (FRC was featured in the video))\nhttps://frcmap.com/\n------------------------------------------------------\nIf you're looking to help a team as a mentor, volunteer, or sponsor:\nhttps://www.firstinspires.org/support\n------------------------------------------------------\nMusic in this video:\nI Dunno by grapes is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/by/3.0/)\nhttp://ccmixter.org/files/grapes/16626",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}