{
  "title": "59: Jonathan Fields- How to Live a Good Life and Inspire Possibility",
  "pubDate": "Wed, 12 Oct 2016 05:09:42 +0000",
  "guid": "280360a665a8af4e402c6af4125bf0ae",
  "link": "https://lifeonpurpose.libsyn.com/59-jonathan-fields-how-to-live-a-good-life-and-inspire-possibility",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #59</strong>, my guest is serial entrepreneur, growth strategist, and award-winning author <strong>Jonathan Fields</strong>.<br /> <br /> <strong>Jonathan</strong> joined me for a fantastic chat about his new book, <em>How To Live a Good Life, Soulful Stories, Surprising Science, and Practical Wisdom</em>, in which he steps out from under the entrepreneurship umbrella and into the realm of the subject that truly fuels him, a broader exploration of human potential. The book is a practical and provocative modern-day manual for the pursuit of a life well lived.<br /> <br /> We also talked about human potential; the incident at age 17 that planted the seeds for his work with the Good Life Project; the art of a great interview; vulnerability; Elizabeth Gilbert's \"secret\"; Camp GLP; the concept of the three buckets; teaching that thing we each need to learn most; how 9-11 motivated him to live life NOW; and MUCH more!<br /> <br /> <em>“If I'm asking people to be open to ideas, I need to model that same state myself.”</em><br /> <br /> About: A dad, husband, serial entrepreneur, growth strategist and award-winning author, <strong>Jonathan Fields</strong> inspires possibility.<br /> <br /> He currently runs mission-driven media and education venture, Good Life Project®, where he and his team lead a global community in the quest to live more meaningful, connected and vital lives. They produce a top-rated podcast and video-series with millions of listens and views in more than 150 countries, where Jonathan regularly shares conversations with the world’s leading voices, like Sir Ken Robinson, Elizabeth Gilbert, Milton Glaser, Brene Brown, Grethcen Rubin and hundreds more.<br /> <br /> Along the way, <strong>Jonathan</strong> has built a number of community-driven ventures or, as he calls them, Businesses of Belonging™, taught everything from yoga and mindfulness to entrepreneurship, branding and innovation to thousands. Along with his world-class faculty, he now offers a growing catalog of events, trainings and courses that range from mission-driven entrepreneurship to building innovative cultures and living good lives. He begins with cracking open the often long-closed window to possibility, then offers strategies and tools for action and progress.<br /> <br /> <strong>Jonathan</strong> is regularly featured in the media, including The New York Times, Wall Street Journal, BusinessWeek, FastCompany, Inc., Entrepreneur, USA Today, Real Simple, HOW, O Magazine, Self, Outside, Slate, Vogue, Elle, Allure, SELF, Yoga Journal, CNBC, Fox News, Today Show, PBS Nightly Business Report and thousands of other places that sound cool, but don’t impress his daughter all that much.<br /> <br /> He also speaks globally for organizations and events of all sizes, from keynoting private meetings for clients like Paypal, GE, Novartis and twitter to taking the stage at mega-events like SXSW, World Domination Summit and many others.<br /> <br /> When not building ventures, writing and producing, he can be found dancing around his living room with his wife and daughter, writing in the third person and listening to “real music.” #AirSupply. #KissFanClub.<br /> <br /> To learn more about <strong>Jonathan</strong> and his work, visit: <a href=\"http://www.jonathanfields.com/\" target= \"_blank\">http://www.jonathanfields.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #59, my guest is serial entrepreneur, growth strategist, and award-winning author Jonathan Fields.  Jonathan joined me for a fantastic chat about his new book, <em>How To Live a Good Life, Soulful Stories, Surprising Science, and Practical Wisdom</em>, in which he steps out from under the entrepreneurship umbrella and into the realm of the subject that truly fuels him, a broader exploration of human potential. The book is a practical and provocative modern-day manual for the pursuit of a life well lived.  We also talked about human potential; the incident at age 17 that planted the seeds for his work with the Good Life Project; the art of a great interview; vulnerability; Elizabeth Gilbert's \"secret\"; Camp GLP; the concept of the three buckets; teaching that thing we each need to learn most; how 9-11 motivated him to live life NOW; and MUCH more!  <em>“If I'm asking people to be open to ideas, I need to model that same state myself.”</em>  About: A dad, husband, serial entrepreneur, growth strategist and award-winning author, Jonathan Fields inspires possibility.  He currently runs mission-driven media and education venture, Good Life Project®, where he and his team lead a global community in the quest to live more meaningful, connected and vital lives. They produce a top-rated podcast and video-series with millions of listens and views in more than 150 countries, where Jonathan regularly shares conversations with the world’s leading voices, like Sir Ken Robinson, Elizabeth Gilbert, Milton Glaser, Brene Brown, Grethcen Rubin and hundreds more.  Along the way, Jonathan has built a number of community-driven ventures or, as he calls them, Businesses of Belonging™, taught everything from yoga and mindfulness to entrepreneurship, branding and innovation to thousands. Along with his world-class faculty, he now offers a growing catalog of events, trainings and courses that range from mission-driven entrepreneurship to building innovative cultures and living good lives. He begins with cracking open the often long-closed window to possibility, then offers strategies and tools for action and progress.  Jonathan is regularly featured in the media, including The New York Times, Wall Street Journal, BusinessWeek, FastCompany, Inc., Entrepreneur, USA Today, Real Simple, HOW, O Magazine, Self, Outside, Slate, Vogue, Elle, Allure, SELF, Yoga Journal, CNBC, Fox News, Today Show, PBS Nightly Business Report and thousands of other places that sound cool, but don’t impress his daughter all that much.  He also speaks globally for organizations and events of all sizes, from keynoting private meetings for clients like Paypal, GE, Novartis and twitter to taking the stage at mega-events like SXSW, World Domination Summit and many others.  When not building ventures, writing and producing, he can be found dancing around his living room with his wife and daughter, writing in the third person and listening to “real music.” #AirSupply. #KissFanClub.  To learn more about Jonathan and his work, visit: <a href=\"http://www.jonathanfields.com/\" target= \"_blank\">http://www.jonathanfields.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "51:30",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #59, my guest is serial entrepreneur, growth strategist, and award-winning author Jonathan Fields.  Jonathan joined me for a fantastic chat about his new book, How To Live a Good Life, Soulful Stories, Surprising Science,..."
}