{
  "title": "Emissions Cheating, Air Pollution, and Health with Hannes Schwandt",
  "pubDate": "Tue, 26 Nov 2019 21:01:34 +0000",
  "guid": "edcdf07d-6af7-450c-9fd8-57ddfd19f685",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP136Schwandt_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today on Economics Detective Radio, I discuss health economics with <a href=\"https://hschwandt.com/\" target=\"_blank\" rel= \"noopener\">Hannes Schwandt</a> of Northwestern University. Hannes is the co-author, along with Diane Alexander, of <a href= \"http://ftp.iza.org/dp12427.pdf\" target=\"_blank\" rel= \"noopener\">\"The Impact of Car Pollution on Infant and Child Health: Evidence from Emissions Cheating.\"</a></p> <blockquote>Car exhaust is a major source of air pollution, but little is known about its impacts on population health. We exploit the dispersion of emissions-cheating diesel cars which secretly polluted up to 150 times as much as gasoline cars across the United States from 2008-2015 as a natural experiment to measure the health impact of car pollution. Using the universe of vehicle registrations, we demonstrate that a 10 percent cheating-induced increase in car exhaust increases rates of low birth weight and acute asthma attacks among children by 1.9 and 8.0 percent, respectively. These health impacts occur at all pollution levels and across the entire socioeconomic spectrum.</blockquote> <p>We also discuss <a href=\"https://www.nber.org/papers/w20368.pdf\" target=\"_blank\" rel=\"noopener\">his work on the health impacts of the 9/11 dust cloud</a>.</p> <hr />",
  "content:encoded": "<p>Today on Economics Detective Radio, I discuss health economics with <a href=\"https://hschwandt.com/\" target=\"_blank\" rel= \"noopener\">Hannes Schwandt</a> of Northwestern University. Hannes is the co-author, along with Diane Alexander, of <a href= \"http://ftp.iza.org/dp12427.pdf\" target=\"_blank\" rel= \"noopener\">\"The Impact of Car Pollution on Infant and Child Health: Evidence from Emissions Cheating.\"</a></p> Car exhaust is a major source of air pollution, but little is known about its impacts on population health. We exploit the dispersion of emissions-cheating diesel cars which secretly polluted up to 150 times as much as gasoline cars across the United States from 2008-2015 as a natural experiment to measure the health impact of car pollution. Using the universe of vehicle registrations, we demonstrate that a 10 percent cheating-induced increase in car exhaust increases rates of low birth weight and acute asthma attacks among children by 1.9 and 8.0 percent, respectively. These health impacts occur at all pollution levels and across the entire socioeconomic spectrum. <p>We also discuss <a href=\"https://www.nber.org/papers/w20368.pdf\" target=\"_blank\" rel=\"noopener\">his work on the health impacts of the 9/11 dust cloud</a>.</p> ",
  "enclosure": "",
  "itunes:duration": "40:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today on Economics Detective Radio, I discuss health economics with  of Northwestern University. Hannes is the co-author, along with Diane Alexander, of  Car exhaust is a major source of air pollution, but little is known about its impacts on...",
  "itunes:episode": 136,
  "itunes:episodeType": "full"
}