{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-4655915224338266183",
  "published": "2021-11-01T10:04:00.010-07:00",
  "updated": "2021-12-01T04:42:05.489-08:00",
  "category": [
    "",
    ""
  ],
  "title": "Searching, browsing, and shutdown Chrome performance improvements",
  "content": "<i><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-axfwGCN_z9s/YadtFVzAScI/AAAAAAAABvU/qVimbiTU4kg_UPfCM8Hxk5izbMDSvGe1ACLcBGAsYHQ/s1999/image1.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"830\" data-original-width=\"1999\" height=\"292\" src=\"https://1.bp.blogspot.com/-axfwGCN_z9s/YadtFVzAScI/AAAAAAAABvU/qVimbiTU4kg_UPfCM8Hxk5izbMDSvGe1ACLcBGAsYHQ/w702-h292/image1.jpg\" width=\"702\" /></a></div><div><i><br /></i></div>Chrome has long-term investments in performance improvement across many projects and we are pleased to share improvements across speed, memory, and unexpected hangs in today’s <a href=\"https://blog.chromium.org/search/label/the%20fast%20and%20the%20curious\">The Fast and the Curious</a> series post. One in six searches is now as fast as a blink of an eye, Chrome OS browsing now uses up to 20% less memory <a href=\"https://blog.chromium.org/2021/04/efficient-and-safe-allocations-everywhere.html\">thanks to our PartitionAlloc investment</a>, and we’ve resolved some thorny Chrome OS and Windows shutdown experiences.</i><h1 style=\"text-align: left;\">Omnibox</h1><div>You’ve probably noticed that potential queries are suggested to you as you type when you’re searching the web using Chrome’s omnibox (as long as the “Autocomplete searches and URLs” feature is turned on in Chrome settings.) This makes searching for information faster and easier, as you don’t have to type in the entire search query -- once you’ve entered enough text for the suggestion to be the one you want, you can quickly select it. <br /><br /><br /><a href=\"https://1.bp.blogspot.com/-DxaVpslQzCs/YYANjOS0ODI/AAAAAAAABsY/mmbXzb8bEa47k1Hj3rlBBkvZSots7RCcwCLcBGAsYHQ/s1999/image2.png\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-DxaVpslQzCs/YYANjOS0ODI/AAAAAAAABsY/mmbXzb8bEa47k1Hj3rlBBkvZSots7RCcwCLcBGAsYHQ/w654-h439/image2.png\" /></a><br /><br /><br />Searching in Chrome is now even faster, as search results are prefetched if a suggested query is very likely to be selected. This means that you see the search results more quickly, as they’ve been fetched from the web server before you even select the query. In fact, our experiments found that search results are now 4X more likely to be shown within 500 ms!<br /><br />Currently, this only happens if Google Search is your default search engine. However, other search providers can trigger this feature by adding information to the query suggestions sent from their servers to Chrome, as described in this <a href=\"https://sites.google.com/a/chromium.org/dev/developers/design-documents/omnibox-prefetch-for-default-search-engines\">article</a>.<br /><h1 style=\"text-align: left;\">Chrome OS PartitionAlloc</h1></div><div>Chrome’s new memory allocator, <a href=\"https://blog.chromium.org/2021/04/efficient-and-safe-allocations-everywhere.html\">PartitionAlloc</a>, rolled out on Android and Windows in M89, bringing improved memory usage [up to 22% savings] and performance [up to 9% faster responsiveness]. Since then, we have also implemented PartitionAlloc on Linux in M92 and Chrome OS in M93. We are now pleased to announce that M93 field data from Chrome OS shows a total memory footprint reduction of 15% in addition to a 20% browser process memory reduction, improving the Chromebook browsing experience for both single and multi-tabs.<br /><br /><h1 style=\"text-align: left;\">Resolving the #1 shutdown hang</h1></div><div>Often software engineers add a cache to a system with the goal of improving performance. But a frequent corollary of caching is that the cache may introduce other problems (code complexity, stability, memory consumption, data consistency), and may even make performance worse. In this case, a local cache was added years ago to Chrome's history system with the goal of making startup faster. The premise at the time, which seemed to bear out in lab testing, was that caching Chrome's internal in-memory history index would be faster than reindexing the history at each startup.<br /><br />Thanks to our continuing systematic investigation into real-world performance using crash data in conjunction with anonymized performance metrics, we uncovered that not only did this cache add code complexity and unnecessary memory usage, but it was also our top contributor to shutdown hangs in the browser. This is because on some OSes, background priority threads can be starved of I/O indefinitely while there is any other I/O happening elsewhere on the system. Moreover, the performance benefits to our users were minimal, based on analysis of field data. We've now removed the cache and resolved our top shutdown hang. This was a great illustration of the principle that caching is not always the answer!<br /><br />Stay tuned for many more performance improvements to come!<br /><br />Posted by Yana Yushkina, Product Manager, Chrome Browser<br /><br /><i>Data source for all statistics: <a href=\"https://www.google.com/chrome/privacy/whitepaper.html#usagestats\">Real-world data</a>&nbsp;anonymously aggregated from Chrome clients.</i></div><div><br /></div><br />",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}