{
  "title": "Non-Technical roles in OSS",
  "link": "",
  "updated": "2019-08-28T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2019/08/28/oss-roles",
  "content": "<p>Software projects require non-technical work to succeed.\nThis post names and defines that work, using terms borrowed from industry.</p>\n\n<p>This post follows on a previous post\n<a href=\"../../../../2019/05/18/maintainer\">The Role of a Maintainer</a>,\nwhich is more focused on the day-to-day technical operation of the project.\nWhile maintainers serve a critical and necessary role,\ntechnical maintenance alone is not sufficient for success.</p>\n\n<p>Here we talk about the following non-technical roles:</p>\n\n<ul>\n  <li>Product Management</li>\n  <li>Project Management</li>\n  <li>Marketing</li>\n  <li>Sales</li>\n  <li>HR</li>\n</ul>\n\n<p>But we connect these business terms to activities within community open source software.</p>\n\n<h3 id=\"product-management\">Product Management</h3>\n\n<ul>\n  <li><em>What new domains and applications should we target for greatest impact?</em></li>\n  <li><em>What features do we need to focus on in order to satisfy those those domains?</em></li>\n</ul>\n\n<p>A maintainer keeps the project running,\nbut where should that project go?\nProduct management determines the direction of a project on a longer timescale.\nThey work to understand the broader context in which the project exists,\nand identify opportunities within that context that would make the project more relevant.</p>\n\n<p>Without product management we end up building neat software that may not have\nas much impact as we would like.</p>\n\n<h3 id=\"project-management\">Project Management</h3>\n\n<ul>\n  <li><em>Are we making steady progress towards our goals?</em></li>\n  <li><em>If not, what is blocking us, and how can we address those problems?</em></li>\n  <li><em>Do our users agree?</em></li>\n</ul>\n\n<p>It’s easy for developers to go off-track.</p>\n\n<ul>\n  <li>We may choose to work on interesting problems rather than important ones</li>\n  <li>We may misunderstand what users need,\nand so waste time on technically correct, but pragmatically unfruitful paths</li>\n  <li>We may get distracted by life, and so projects may become abandoned</li>\n</ul>\n\n<p>Project managers keeps things moving forward in productive directions.\nThey listen to users and other stakeholders,\nand keep development focused on important issues.\nIf something unexpected comes up and a developer has to stop work,\nthey try to organize other developers to step in to maintain continuity.</p>\n\n<p>Project management is hard in general, and particularly in OSS.\nProject managers need to have the technical ability to make good decisions\nand earn the respect of developers.\nThey also need to have enough personal skills to listen to users and stakeholders.</p>\n\n<p>Project management is particularly hard in OSS because\noften we don’t have clear employer/employee relationships with development teams.\nThis means that project managers need to find non-monetary ways to convince developers to work on\nimportant rather than pleasant tasks.\nThis requires either a lot of creativity or a very understanding development team.</p>\n\n<h3 id=\"marketing\">Marketing</h3>\n\n<ul>\n  <li><em>Who would benefit from our project?</em></li>\n  <li><em>How do we speak to them?</em></li>\n  <li><em>What do we say to motivate them to take a look?</em></li>\n</ul>\n\n<p>Many excellent software projects go unused because people don’t know that the project exists.\nOften we can have more impact by telling people about current functionality\nthan by improving or building new functionality.</p>\n\n<p>Marketing communicates the capabilities of the project to new communities that need that capability,\nin a language that those communities understand.\nThis communication might be in the form of\nsocial media,\nacademic papers,\nwhite papers,\nor conference talks.\nWe use different communication systems based on who we are talking to.</p>\n\n<p>It can be challenging to know which of these methods work best,\nand so effective marketing is also quantitative.\nMarketing observes traffic patterns on webpages,\nsends out surveys,\ntracks engagement on social media,\nand learns as much as they can to improve the projects’ outreach.</p>\n\n<p>It’s important to understand that marketing is more than just tweeting out\nabout releases, or maintaining a mailing list.\nGood marketing continuously works to find new potential user bases, and the\nright way to engage with them on their level.</p>\n\n<h3 id=\"sales\">Sales</h3>\n\n<ul>\n  <li><em>How do we match the project’s capabilities to the needs of a particular institution?</em></li>\n</ul>\n\n<p>As developers, we often think of sales and marketing as trying to trick people into buying software.\nThis is only true if your software is bad, and trickery is necessary.\nOtherwise, sales and marketing are much more about having conversations with your users,\nand determining which parts of your software solve which parts of their problems.</p>\n\n<p>Where marketing is broad,\nsales focuses on a particular institution that has already shown interest.</p>\n\n<p>Good sales is mostly about asking questions and listening well.</p>\n\n<ul>\n  <li><em>Why are you interested in this software?  What do you hope to get out of it?</em></li>\n  <li><em>What are you doing now to solve this problem?  Why doesn’t that work for you?</em></li>\n  <li><em>What are your pain points?</em></li>\n</ul>\n\n<p>Once you have a good sense of what their pain points are\nyou can help them to understand how your software might help them if it does,\nor point them towards other solutions if it doesn’t.\nYou likely know much more about this space than they do,\nand they can use your expertise in navigating it.</p>\n\n<p>If you’re spending time one-on-one with an institution then probably you want something from them.\nIn traditional business this might be money,\nbut in general this could be many things,\nincluding engineering time,\nco-marketing,\nor you may just want to support a just cause.\nGood sales is also about clearly communicating the needs of your project to\nthe institution so that they know how to motivate you to help them in the future.\nThey’re probably looking for continued engagement with you and have some things\nto offer.  You now need to negotiate with them to find the right set of things\nthat you can each do for each other to make this a long term relationship.</p>\n\n<p>Sales is a retail match-making process which is often necessary\nin order to have impact with larger and slower-moving institutions.</p>\n\n<h3 id=\"hr\">HR</h3>\n\n<ul>\n  <li><em>How is everyone doing?</em></li>\n  <li><em>Are they happy?  If not, why not, and what can we do about it?</em></li>\n  <li><em>How do we make our current community members as efficient as possible?</em></li>\n  <li><em>How do we add new members to our community and where can we focus this effort?</em></li>\n  <li><em>How do we build the skills of our current team, and how do we help them move on when that time comes?</em></li>\n</ul>\n\n<p>Software is built by people and people have needs.</p>\n\n<p>For example it may be that one of your teammates is suffering from repetitive stress injuries or mental health issues,\nand the most productive action you could take isn’t to fix another bug or review their code,\nbut to send them an ergonomic keyboard, or a map of hiking trails in their area.</p>\n\n<p>Or there may be tension in the community caused by a personality mismatch,\nand you need to engage in conflict management to keep things smooth.</p>\n\n<p>People’s lives change.\nThey have kids, get new jobs, retire, need vacations, or need help finding new positions.\nIt’s important to be there with them, celebrate and console them,\nhelping logistically in whatever way makes sense.</p>\n\n<h3 id=\"the-status-today\">The status today</h3>\n\n<p>There are people in every successful project that serve these roles today.\nOften single individuals serve many of these roles at once, along with more traditional technical roles.\nWe may use different terms like “outreach” over “sales and marketing”\nor “emotional work” over “HR”, but the concepts are the same.</p>\n\n<p>I hope that by naming this non-technical work\nit becomes easier to discuss these roles in our projects,\nand promote and celebrate these efforts among our peers.</p>"
}