{
  "title": "The Edition: The politics of war crimes",
  "link": "https://audioboom.com/posts/8062830",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2507,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is Putin guilty of war crimes?</div>\n<div><br>\n</div>\n<div>For this week’s cover piece, The Spectator’s Editor Fraser Nelson looks at the risks and rewards of labelling Vladimir Putin and Russian soldiers war criminals. He joins the podcast, followed by Michael Bryant, the author of A World History of War Crimes, who writes in the Spectator this week about what the limits put on acts of war in the past can teach us about atrocities committed today. (00:52)</div>\n<div><br>\n</div>\n<div>Also this week: Is Europe facing a political stand-off between progressives and populists? </div>\n<div><br>\n</div>\n<div>This week Hungarian Prime Minister Viktor Orban was elected for a fourth term in office with a large majority. While in France, Emmanuel Macron faces a much harder fight from Marine Le Pen than many expected. Paris-based author, Gavin Mortimer analyses the changing faultline in European politics in this week’s Spectator and joins the podcast along with journalist and author Tibor Fischer. (19:44)</div>\n<div><br>\n</div>\n<div>And finally: Why are overpriced English kitchens so hot right now?</div>\n<div><br>\n</div>\n<div>How much would you be willing to spend on your kitchen? The answer for some seems to be a lot. And the fashionable choice at the moment is faux traditional English. Writer and art critic, Laura Freeman explores this phenomenon in this week’s Spectator and she joins the podcast along with Stacey Sheppard, creator of the design blog The Design Sheppard. (32:25)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 07 Apr 2022 15:17:13 +0000",
  "guid": "tag:audioboom.com,2022-04-07:/posts/8062830",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}