{
  "title": "Cuban Healthcare with Vincent Geloso",
  "pubDate": "Fri, 18 Aug 2017 20:57:35 +0000",
  "guid": "358d46be983b39207c935bccc060e17f",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP61_EDR.mp3",
  "itunes:image": "",
  "description": "<p>This episode’s guest is Vincent Geloso, here to talk about <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2962742\" target=\"_blank\" rel=\"noopener\">his work on Cuban healthcare statistics</a>. He recently released a working paper with coauthor Gilbert Berdine titled \"The Paradox of Good Health and Poverty: Assessing Cuban Health Outcomes under Castro.\" The abstract reads as follows:</p> <blockquote>In spite of being poor and lacking in economic opportunities, the population of Cuba enjoyed significant improvements in health outcomes under the Castro regime. Many have praised the ability of the regime to overcome the barriers of poverty and economic stagnation in order to improve health outcomes. Many have also argued that efficient features of Cuba’s health policy should be imported regardless of political considerations. In this paper, we argue that these improvements are probably overestimated, but that they are real nonetheless. We also argue that some of these improvements were an integral part of health policy and could only have been realized by the use of extremely coercive institutions. While efficient at fighting certain types of diseases, coercive institutions are generally unable to generate economic growth. On the other hand, the poverty such coercive institutions engender may have actually helped improve health outcomes, providing us with a false impression of the efficacy of the health care system in Cuba.</blockquote> <p>We have a wide-ranging discussion about Cuban health statistics, what they mean and don't mean, how good health could be achieved by forcing people into healthy behaviours, and how well other Latin American countries have done in comparison to communist Cuba.</p> <hr /> <p>Photo credit: Eric Marshall</p> <p> </p>",
  "content:encoded": "<p>This episode’s guest is Vincent Geloso, here to talk about <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2962742\" target=\"_blank\" rel=\"noopener\">his work on Cuban healthcare statistics</a>. He recently released a working paper with coauthor Gilbert Berdine titled \"The Paradox of Good Health and Poverty: Assessing Cuban Health Outcomes under Castro.\" The abstract reads as follows:</p> In spite of being poor and lacking in economic opportunities, the population of Cuba enjoyed significant improvements in health outcomes under the Castro regime. Many have praised the ability of the regime to overcome the barriers of poverty and economic stagnation in order to improve health outcomes. Many have also argued that efficient features of Cuba’s health policy should be imported regardless of political considerations. In this paper, we argue that these improvements are probably overestimated, but that they are real nonetheless. We also argue that some of these improvements were an integral part of health policy and could only have been realized by the use of extremely coercive institutions. While efficient at fighting certain types of diseases, coercive institutions are generally unable to generate economic growth. On the other hand, the poverty such coercive institutions engender may have actually helped improve health outcomes, providing us with a false impression of the efficacy of the health care system in Cuba. <p>We have a wide-ranging discussion about Cuban health statistics, what they mean and don't mean, how good health could be achieved by forcing people into healthy behaviours, and how well other Latin American countries have done in comparison to communist Cuba.</p>  <p>Photo credit: Eric Marshall</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "44:12",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "This episode’s guest is Vincent Geloso, here to talk about . He recently released a working paper with coauthor Gilbert Berdine titled \"The Paradox of Good Health and Poverty: Assessing Cuban Health Outcomes under Castro.\" The abstract reads as...",
  "itunes:episodeType": "full"
}