{
  "title": "Quantifying Model Uncertainty for Semantic Segmentation using Operators in the RKHS. (arXiv:2211.01999v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01999",
  "description": "<p>Deep learning models for semantic segmentation are prone to poor performance\nin real-world applications due to the highly challenging nature of the task.\nModel uncertainty quantification (UQ) is one way to address this issue of lack\nof model trustworthiness by enabling the practitioner to know how much to trust\na segmentation output. Current UQ methods in this application domain are mainly\nrestricted to Bayesian based methods which are computationally expensive and\nare only able to extract central moments of uncertainty thereby limiting the\nquality of their uncertainty estimates. We present a simple framework for\nhigh-resolution predictive uncertainty quantification of semantic segmentation\nmodels that leverages a multi-moment functional definition of uncertainty\nassociated with the model's feature space in the reproducing kernel Hilbert\nspace (RKHS). The multiple uncertainty functionals extracted from this\nframework are defined by the local density dynamics of the model's feature\nspace and hence automatically align themselves at the tail-regions of the\nintrinsic probability density function of the feature space (where uncertainty\nis the highest) in such a way that the successively higher order moments\nquantify the more uncertain regions. This leads to a significantly more\naccurate view of model uncertainty than conventional Bayesian methods.\nMoreover, the extraction of such moments is done in a single-shot computation\nmaking it much faster than Bayesian and ensemble approaches (that involve a\nhigh number of forward stochastic passes of the model to quantify its\nuncertainty). We demonstrate these advantages through experimental evaluations\nof our framework implemented over four different state-of-the-art model\narchitectures that are trained and evaluated on two benchmark road-scene\nsegmentation datasets (Camvid and Cityscapes).\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Singh_R/0/1/0/all/0/1\">Rishabh Singh</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Principe_J/0/1/0/all/0/1\">Jose C. Principe</a>"
}