{
  "title": "Interpretable Modeling and Reduction of Unknown Errors in Mechanistic Operators. (arXiv:2211.01373v1 [eess.IV])",
  "link": "http://arxiv.org/abs/2211.01373",
  "description": "<p>Prior knowledge about the imaging physics provides a mechanistic forward\noperator that plays an important role in image reconstruction, although myriad\nsources of possible errors in the operator could negatively impact the\nreconstruction solutions. In this work, we propose to embed the traditional\nmechanistic forward operator inside a neural function, and focus on modeling\nand correcting its unknown errors in an interpretable manner. This is achieved\nby a conditional generative model that transforms a given mechanistic operator\nwith unknown errors, arising from a latent space of self-organizing clusters of\npotential sources of error generation. Once learned, the generative model can\nbe used in place of a fixed forward operator in any traditional\noptimization-based reconstruction process where, together with the inverse\nsolution, the error in prior mechanistic forward operator can be minimized and\nthe potential source of error uncovered. We apply the presented method to the\nreconstruction of heart electrical potential from body surface potential. In\ncontrolled simulation experiments and in-vivo real data experiments, we\ndemonstrate that the presented method allowed reduction of errors in the\nphysics-based forward operator and thereby delivered inverse reconstruction of\nheart-surface potential with increased accuracy.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Toloubidokhti_M/0/1/0/all/0/1\">Maryam Toloubidokhti</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Kumar_N/0/1/0/all/0/1\">Nilesh Kumar</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Li_Z/0/1/0/all/0/1\">Zhiyuan Li</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Gyawali_P/0/1/0/all/0/1\">Prashnna K. Gyawali</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Zenger_B/0/1/0/all/0/1\">Brian Zenger</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Good_W/0/1/0/all/0/1\">Wilson W. Good</a>, <a href=\"http://arxiv.org/find/eess/1/au:+MacLeod_R/0/1/0/all/0/1\">Rob S. MacLeod</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Wang_L/0/1/0/all/0/1\">Linwei Wang</a>"
}