{
  "title": "Episode 24: &#8220;Ko Ko Mo&#8221; by Gene and Eunice",
  "link": "https://500songs.com/podcast/episode-24-ko-ko-mo-by-gene-and-eunice/",
  "pubDate": "Mon, 18 Mar 2019 02:57:16 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-24-ko-ko-mo-by-gene-and-eunice/",
  "description": "Welcome to episode twenty-four of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Ko Ko Mo\" by Gene and Eunice. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-24-ko-ko-mo/\"> Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nFor the most part I have only used two resources for this podcast, because as I explain in the episode itself there is basically no information available anywhere on Gene and Eunice. The resource which I used for all the information about Gene and Eunice themselves, and most of the music, is the now out-of-print 2001 Ace Records CD<a href=\"https://amzn.to/2HAPFYG\"> Go On Ko Ko Mo!,</a> whose eleven-page booklet by Stuart Colman contains about ten and a half pages more information about Gene and Eunice than otherwise seems to exist.\n\nFor the information about John Dolphin, I used the self-published book <a href=\"https://amzn.to/2ObVEof\">Recorded in Hollywood, the John Dolphin Story, by Jamelle Baruck Dolphin</a>. This contains some very incorrect information in parts -- notably, in the couple of paragraphs talking about Gene and Eunice, it mentions \"The Vow\" being covered by Bunny and Rita, which is how I found out about that, but it also says that the song was covered by Jackie and Doreen on the same label. The Jackie and Doreen record called \"The Vow\" is a different song (unless there were two records of that name, which I don't dismiss, but I've only been able to find one), and the book also calls Coxsone Dodd \"Coxton Dodd\". But presumably, given the author's surname and the fact that the book heavily quotes from John Dolphin's children, the book can be relied on to be more or less accurate when it comes to the facts of Dolphin's life, at least.\n\nThe Ace Records CD mentioned above contains *almost* every record released by Gene and Eunice, but it doesn't contain the Aladdin Records version of \"Ko Ko Mo\", just the Combo original. However, <a href=\"https://amzn.to/2HAZxSk\">That's Your Last Boogie</a>, a three-CD compilation of Johnny Otis music I have recommended here before, does have that track on it, as well as many more tracks we've discussed in this series and a few that we're going to look at in future.\n\nAnd finally, it looks like the<a href=\"https://www.kickstarter.com/projects/andrewhickey/a-history-of-rock-music-in-500-songs-vol-1\"> Kickstarter</a> for the first book based on this series is going to fail -- there are two days left to go and it's still short by nearly two hundred pounds. But it's still possible to pledge if you feel like it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n\"Arruba, Jamaica...\" no, sorry, this is not that Kokomo, which much as I love the Beach Boys is *not* going to make this history. Instead it's a song that is now almost completely forgotten but which was one of the most important records in early rock and roll.\n\nAnd I do mean both that it has been almost completely forgotten and that it was hugely important. This song seems just to have fallen out of the collective memory altogether, to the extent that I only found out about it by reading old books and asking \"what is this ko ko mo they're talking about?” Because it was important enough that *all* of the best books on R&B history -- most of which were written in the sixties or seventies, when the events I've been talking about were far fresher in the memory -- mentioned it, and said it was one of the most important records of 1954.\n\nAnd the fact is, there is an interesting story buried in there, the story of how \"Ko Ko Mo\" by Gene and Eunice was *two* of the most important records in early rock and roll.\n\nBut there's another story there too -- the story of how a record can completely disappear from the cultural memory. Because even in those books which mention it... that's all they do. They just mention this record's existence, giving it no more than a few sentences. On most of these podcast episodes, I end up cutting a lot of material, because there's far more to say than will fit into a half-hour podcast. Here... there's nothing to cut. The sum total of all the information out there, in the whole world, as far as I can tell, is in a single eleven-page CD booklet.\n\nTo talk about \"Ko Ko Mo\", first we're going to have to talk about Shirley & Lee. Shirley and Lee were \"the sweethearts of the blues\", a New Orleans R&B duo who recorded in Cosimo Matassa's studio. They weren't a real-life couple, but their publicity suggested that they were, and their songs made up a continuing story of an on-again off-again romance. Their first single, \"I'm Gone\", reached number two on the R&B charts:\n\n[excerpt: \"I'm Gone\", Shirley and Lee]\n\nThey were, as far as I can tell, the first people in *any* genre to do this kind of couple back-and-forth singing, as opposed to duets by singers who clearly weren't in a real relationship. You can trace a line from them through Sonny and Cher or Johnny Cash and June Carter -- duet partners whose appeal was partly due to their offstage relationships. Of course in Shirley and Lee's case this was faked, but the audiences didn't know that, at least at the time.\n\nShirley and Lee were popular enough that they inspired a whole host of imitators. We've mentioned Ike and Tina Turner before, and we're likely to talk about them again, but there was also Mickey and Sylvia, whose \"Love is Strange\" we'll be looking at later.\n\nThe three duo acts we've mentioned all knew each other -- for example, Mickey and Sylvia sang backup on Ike and Tina Turner's \"I Think It's Going to Work Out Fine\".\n\n[excerpt: Ike and Tina Turner: \"I Think It's Going To Work Out Fine\"]\n\nBut there was one other duo act who tried to make a success out of the Shirley and Lee formula, and who didn't know those other groups, and it's them we're going to be talking about today.\n\nUnlike Shirley and Lee, Gene and Eunice were a real-life couple, and so they didn't have to fake things the way Shirley and Lee did. Gene Forrest had been a jobbing singer for several years. He started out recording solo records for John Dolphin's label Recorded In Hollywood.\n\nThe label \"Recorded in Hollywood\" was a bit of a misnomer, but that label name itself tells you something about the rampant racism of American society in the 1950s. You see, John Dolphin wasn't actually based in Hollywood because when he'd tried to open his first business there -- a record shop -- he'd been unable to, because Dolphin was black, and black people weren't allowed to own businesses in Hollywood. So he named his record shop \"Dolphin's of Hollywood\" anyway, and opened it in a different part of Los Angeles.\n\nBut even though Dolphin was a victim of racism, he was also a beneficiary of it, and this just goes to show how revoltingly endemic racism was in the US in this time period. Because the original location for Dolphin's of Hollywood was on Central Ave, which at the time was the centre for black businesses in LA, in the same way that Beale Street was in Memphis or Rampart Street in New Orleans.\n\nBut Central Ave only became a centre for black business because of one of the worst acts of racism in America's history. Most of the businesses there were originally owned by Japanese people. When, during World War II, Japanese people in America, and Japanese-Americans, were interred in concentration camps for the duration of the war, those businesses became vacant, and the white owners of the properties were desperate for someone to rent them to, so they \"allowed\" black people to rent them. There was a big campaign in the black local press at the time to encourage black entrepreneurs to take over these vacant properties, and part of the campaign was to tell people that if they didn't start businesses there then Jews would instead.\n\nYes.\n\nSadly society in the US at that time was just *that* fractally racist.\n\nBut John Dolphin managed to build himself a very successful business, and he essentially dominated rhythm and blues in Los Angeles in the 1950s. As well as having a record shop, which stayed open twenty-four hours a day, he also owned a radio station, which broadcast from the front window of the record shop, with DJs such as Hunter Hancock and Johnny Otis. Those DJs would tell everyone they were broadcasting from Dolphin's, so the listeners would come along to the shop.\n\nAnd Dolphin innovated something that may have changed the whole of music history -- he deliberately targeted both his radio station and his record shop at white teenagers -- realising that they would buy music by black musicians if they knew about it, and that they had more money than the black community. As a result, his record shop often had queues out the door of white teenagers eager to buy the latest R&B records, and through the influence of his DJs the whole of the West Coast music scene became strongly influenced by the music people like Otis and Hancock would play.\n\nAnd then on top of that, in what, depending on how you look at it, was a great act of corporate synergy or something that should have brought action by antitrust agencies. Dolphin owned record labels. And his promise to artists was \"We'll record you today and you'll have a hit tonight\" -- because anything recorded on his labels would instantly go into heavy rotation on his radio station and be pushed in his record shop. Gene Forrest's records were an example:\n\n[excerpt: Gene Forrest, \"Everybody's Got Money\"]\n\nWhat that *didn't* mean for the musicians, though, was any money. Dolphin paid a flat fee for his recordings, took all the publishing rights, and wouldn't pay royalties. But for many musicians this was reasonable enough at the time -- the idea for them was that they'd make records for Dolphin to build themselves a name, then move on to a label which paid them reasonable amounts of money. As Dolphin never signed anyone to a multi-record contract, they could easily move on after making a record or two for him.\n\nSadly for Gene the promise of \"a hit tonight\" didn't pay off, and after three singles for Recorded in Hollywood, he moved first to RPM Records, one of the many blues and R&B labels that was operating at the time, and then to Aladdin Records for a one-off single backed by a band called the Four Feathers. That would be the only record they would make together, but the connection with Aladdin Records would prove to be important.\n\nShortly after that record came out, Forrest met a young singer named Eunice Levy, after she'd done well at Hunter Hancock's talent show. Initially they started working together because the Four Feathers were looking for a female harmony vocalist, but soon they became romantically involved, and started working as a duo rather than as part of a larger group, and recording for Combo Records.\n\nCombo was a tiny label owned by the trumpet player Jake Porter, and most of the records it released were recorded in Porter's basement. A typical example of a Combo release is \"Ting Ting Boom Scat\", by Jonesy's Combo:\n\n[excerpt: \"Ting Ting Boom Scat\", Jonesy's Combo]\n\nGene and Eunice's only record for Combo, \"Ko Ko Mo\", is a fairly typical rhythm and blues record for 1954. It varies simply between a verse in tresillo rhythm, trying for something of the sound of Fats Domino's records, and a more straightforward shuffle on the choruses, going between them rather awkwardly:\n\n[excerpt: \"Ko Ko Mo\" first version, by Gene and Eunice]\n\nThe reason for the awkward transition is simple enough -- it's a song made up from ideas from two different songwriters bolted together. Gene came up with the verse, while Eunice came up with the chorus -- she was inspired by the town of Kokomo, Indiana. Jake Porter is the third credited songwriter, and it's not entirely certain what, if anything, he contributed -- Porter was the owner of the record label, and label owners often took credit they didn't deserve. But on the other hand, Porter was himself a musician, and he'd performed with Lionel Hampton and Benny Goodman, among others, so it's not unreasonable that he might have actually contributed to the songwriting.\n\nThe record was backed by \"Jonesy's Combo\", who are credited on the record along with Gene and Eunice.\n\nNow, listen to this:\n\n[excerpt \"Ko Ko Mo\", second version, by Gene and Eunice]\n\nThat record is Gene and Eunice doing \"Ko Ko Mo\". The record is credited to Gene and Eunice with Johnny's Combo. The Johnny in this case is Johnny Otis, whose band backs the singers on that version. As you can tell, it sounds very close to identical to the original -- even though I'm sure Johnny Otis could easily have got the record sounding smoother and with more of a groove if he had been allowed.\n\nYou see, Gene was still under contract with Aladdin Records as a solo artist following his one single with them, and when they found that he had put out a record that might have some success with a competing label, they decided that they had to have their own version, and pulled rank, getting him to rerecord the track as closely as he could to the original recording. Eunice wasn't contracted to Aladdin, but given that the alternative was presumably a lawsuit, she went along with it. Gene and Eunice were now an Aladdin Records act, and their next few records would all be released on that label.\n\nThe recording replicated the original as closely as possible, and both records even had B-sides which were identical-sounding recordings of the same song.\n\nOnce Combo Records found out, they started an advertising war with Aladdin. It was bad enough that other people were recording the song and having hits with it, but the same act putting out the record on two different labels, that was obviously unacceptable, and the two labels started to put out competing adverts in the trade journals, Aladdin's adverts saying \"Don't Be Fooled, *THIS* is the Gene and Eunice Ko Ko Mo!\", while Combo's said \"This is it! The *original* Ko Ko Mo!\"\n\nBillboard counted the two records as the same for chart purposes -- no-one could be bothered keeping track of *which* version of \"Ko Ko Mo\" it was that was played on the radio or on a jukebox. As far as the public were concerned, it was all one record, and that one record ended up going to number six on the R&B charts.\n\nBut Gene and Eunice weren't the only ones to have a hit with \"Ko Ko Mo\". The song became the subject of almost a feeding frenzy of cover versions. The first, by Marvin and Johnny, came out only a month after the original recording:\n\n[Excerpt: \"Ko Ko Mo\" by Marvin and Johnny]\n\nBut there were dozens upon dozens of them. The Crew Cuts, Louis Armstrong, The Flamingoes, Rosemary Clooney's sister Betty... everyone was recording a version of \"Ko Ko Mo\", within a month or two of the single coming out.\n\nThe best explanation anyone can come up with for the massive, improbable, success of the song in cover versions is that it was one of the few R&B singles of the time to be completely free of sexual innuendo. While R&B records of the time mostly sound completely clean to modern ears, to radio programmers at the time records like \"the Wallflower\" and \"Hound Dog\" were utterly scandalous, and required substantial rewriting if they were going to play to white audiences.\n\nBut \"Ko Ko Mo\" had such a simplistic lyric that there was no problem with it, and the result was that everyone could record it and have a hit with the white audience, leading to it even being recorded by Perry Como:\n\n[excerpt \"Ko Ko Mo\" by Perry Como]\n\nAnd that was the biggest hit of all. Como was the person with whom the song became associated, although thankfully for all concerned he made no further rock and roll records. And even Como's version is probably more rocking than that by Andy Griffith -- yes, that Andy Griffith, the 50s sitcom actor.\n\n[excerpt: Andy Griffith, \"Ko Ko Mo\"]\n\nIt's notable that the trade magazines advertised Como's version of \"Ko Ko Mo\" as a rock and roll record -- this was in very early 1955, after \"Rock Around the Clock\" had been released, but well before it became a hit. But rock and roll was already a phrase that was in use for the style of music, at least among the trade magazines.\n\nNormally this kind of cover version would have brought at least a reasonable amount of money to the songwriters -- and as Gene and Eunice were the writers, that should have given them a large amount of money. However, after they sold the song to one publishing company, Aladdin claimed that they owned the publishing, again due to their existing contract with Gene Forrest. So everybody got a share of the money from the hit record, except for the people who wrote and sang it.\n\nGene and Eunice's next single was \"This is My Story\"\n\n[Excerpt: Gene and Eunice \"This is My Story\"]\n\nThere was a problem, though. \"Ko Ko Mo\" was going up the charts, and \"This is My Story\" was about to be released. They needed to go out on tour to capitalise on the first, promote the second, and generally get themselves into a position where they could have a career with some sort of possibility of lasting.\n\nAnd Eunice was pregnant, with Gene's child.\n\nObviously, she couldn't go out on the road and tour, especially in the kind of conditions in which black artists had to tour in the 1950s, often sleeping on fans' floors because there were no hotels that would take black people.\n\nThere was only one thing for it. They would have to get in a replacement Eunice. They auditioned several singers, before eventually settling on Linda Hayes, the sister of Tony Williams of the Platters. Hayes didn't sound much like Eunice, but she looked enough like her that she could do the job. We heard from Linda Hayes last week, when we looked at one of the Johnny Ace tribute records she sang on, but she had a relatively decent minor career herself, singing lead on several records with her brother's group before putting out a few records of her own. Here, for example, is one of her records with the Platters:\n\n[excerpt: Linda Hayes and the Platters, \"Please Have Mercy\"]\n\nSo Gene toured with Linda as a substitute Eunice while Eunice was on what amounted to maternity leave, and that worked well enough. \"This is My Story\" went to number eight on the R&B charts, and it looked like Gene and Eunice were on their way to permanent stardom.\n\nUnfortunately, that wasn't the case, and by the time Eunice got back from maternity leave, the duo's career stalled. They recorded several more records for Aladdin, and tried various different tactics to repeat their early success, including having their records produced by the great Earl Palmer:\n\n[Excerpt: Gene and Eunice, \"The Angels Gave You To Me\"]\n\nNone of that did any good as far as charting goes. \"This is My Story\" was their last chart hit for Aladdin records, and after the recordings with Earl Palmer in 1958, the label dropped them.\n\nThey recorded for several more labels, with mixed results. For a while, Eunice returned to Combo records -- unsurprisingly, after what had happened with Gene's contract, Jake Porter didn't want to have anything to do with Gene, but Eunice released a couple of unsuccessful tracks with them:\n\n[excerpt: Eunice Levy, \"Only Lovers\"]\n\nSo, why did Gene and Eunice become completely forgotten? Why, outside the liner notes for a single out-of-print CD booklet and a Wikipedia article based substantially on that booklet, have I been able to find a grand total of four paragraphs or so of text about them in any reliable source? And why does even that set of liner notes start with the sentence \"Gene & Eunice's story is muddled, confusing, and largely unknown\"?\n\nI think this comes back to something that has been an underlying theme of this podcast from the start -- the fact that great art comes from scenes as much as it does from individuals.\n\nThis is not the same as saying that great *artists* aren't individuals, but that the music we remember tends to come out of reinforcing groups of artists, not just collaborating but providing networks for each other, acting as each other's support acts, promoting each other's material. I mentioned when I was talking about Mickey and Sylvia, Shirley & Lee, and Ike and Tina Turner that all three of these acts knew and worked with each other. None of them worked with Gene and Eunice, and Gene & Eunice just don't seem to have had any particular network of musicians with whom they collaborated. The collaboration with Johnny Otis just seems to have been a one-off job for him, and bringing in Linda Hayes doesn't seem to have led to any further connections with the people she worked with.\n\nWith almost every act we've talked about, you find them turning up in unexpected places in biographies of other acts, and even the one-hit wonders who had hits that people remembered continued being parts of other musicians' lives. Gene and Eunice just didn't. But without those connections, without making themselves part of a bigger story, they didn't become part of the cultural memory. Most of the acts that covered \"Ko Ko Mo\" were people like Perry Como or Louis Armstrong who aren't part of the rock and roll canon, and so the record seems to have turned into a footnote. But that wasn't quite the end of their influence.\n\nJamaica always had a soft spot for US R&B of the Fats Domino type, and Gene and Eunice, with their adaptations of Dave Bartholomew's New Orleans style, became mildly successful in Jamaica. In particular, their record \"The Vow\", which had been one of their last Aladdin releases, got covered on Coxsone Dodd's Studio One records, the label that basically pioneered ska, rocksteady, and reggae music in Jamaica. In 1965, Studio One released this:\n\n[excerpt: Bunny and Rita: \"The Vow\"]\n\nThat's another version of their song, this time performed by Bunny and Rita -- as in Bunny Wailer, of the Wailers, and Rita Anderson, who would later also join the Wailers and become better known by her married name after she married Bunny's bandmate Bob Marley.\n\nGene and Eunice attempted a reunion in the eighties. They didn't get on well enough to make it work, but Eunice did get to record one last single as a solo artist, under her new married name Eunice Russ Frost. On \"Real Reel Switcher\" she was backed by the classic fifties rhythm section of Red Callender and Earl Palmer:\n\n[excerpt: Eunice Russ Frost, \"Real Reel Switcher\"]\n\nGene remained out of the spotlight until his death in 2003, but Eunice would occasionally perform at conventions for fans of doo-wop and R&B until she died in 2002. She never got to recapture her early success, but she did, at least, know there were still people out there who remembered \"Ko Ko Mo”.",
  "itunes:subtitle": "Welcome to episode twenty-four of A History of Rock Music in Five Hundred Songs. Today were looking at Ko Ko Mo by Gene and Eunice. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs alwa",
  "itunes:keywords": "Aladdin Records,Cosimo Matassa,Earl Palmer,Gene and Eunice,Ike Turner,John Dolphin,Johnny Otis,Linda Hayes,Marvin and Johnny,Mickey and Sylvia,New Orleans,racism,reggae,Shirley and Lee,talent shows,The Platters,Tina Turner,tresillo",
  "itunes:episodeType": "full",
  "itunes:episode": 24,
  "content:encoded": "Welcome to episode twenty-four of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Ko Ko Mo\" by Gene and Eunice. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-24-ko-ko-mo/\"> Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nFor the most part I have only used two resources for this podcast, because as I explain in the episode itself there is basically no information available anywhere on Gene and Eunice. The resource which I used for all the information about Gene and Eunice themselves, and most of the music, is the now out-of-print 2001 Ace Records CD<a href=\"https://amzn.to/2HAPFYG\"> Go On Ko Ko Mo!,</a> whose eleven-page booklet by Stuart Colman contains about ten and a half pages more information about Gene and Eunice than otherwise seems to exist.\n\nFor the information about John Dolphin, I used the self-published book <a href=\"https://amzn.to/2ObVEof\">Recorded in Hollywood, the John Dolphin Story, by Jamelle Baruck Dolphin</a>. This contains some very incorrect information in parts -- notably, in the couple of paragraphs talking about Gene and Eunice, it mentions \"The Vow\" being covered by Bunny and Rita, which is how I found out about that, but it also says that the song was covered by Jackie and Doreen on the same label. The Jackie and Doreen record called \"The Vow\" is a different song (unless there were two records of that name, which I don't dismiss, but I've only been able to find one), and the book also calls Coxsone Dodd \"Coxton Dodd\". But presumably, given the author's surname and the fact that the book heavily quotes from John Dolphin's children, the book can be relied on to be more or less accurate when it comes to the facts of Dolphin's life, at least.\n\nThe Ace Records CD mentioned above contains *almost* every record released by Gene and Eunice, but it doesn't contain the Aladdin Records version of \"Ko Ko Mo\", just the Combo original. However, <a href=\"https://amzn.to/2HAZxSk\">That's Your Last Boogie</a>, a three-CD compilation of Johnny Otis music I have recommended here before, does have that track on it, as well as many more tracks we've discussed in this series and a few that we're going to look at in future.\n\nAnd finally, it looks like the<a href=\"https://www.kickstarter.com/projects/andrewhickey/a-history-of-rock-music-in-500-songs-vol-1\"> Kickstarter</a> for the first book based on this series is going to fail -- there are two days left to go and it's still short by nearly two hundred pounds. But it's still possible to pledge if you feel like it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n\"Arruba, Jamaica...\" no, sorry, this is not that Kokomo, which much as I love the Beach Boys is *not* going to make this history. Instead it's a song that is now almost completely forgotten but which was one of the most important records in early rock and roll.\n\nAnd I do mean both that it has been almost completely forgotten and that it was hugely important. This song seems just to have fallen out of the collective memory altogether, to the extent that I only found out about it by reading old books and asking \"what is this ko ko mo they're talking about?” Because it was important enough that *all* of the best books on R&B history -- most of which were written in the sixties or seventies, when the events I've been talking about were far fresher in the memory -- mentioned it, and said it was one of the most important records of 1954.\n\nAnd the fact is, there is an interesting story buried in there, the story of how \"Ko Ko Mo\" by Gene and Eunice was *two* of the most important records in early rock and roll.\n\nBut there's another story there too -- the story of how a record can completely disappear from the cultural memory. Because even in those books which mention it... that's all they do. They just mention this record's existence, giving it no more than a few sentences. On most of these podcast episodes, I end up cutting a lot of material, because there's far more to say than will fit into a half-hour podcast. Here... there's nothing to cut. The sum total of all the information out there, in the whole world, as far as I can tell, is in a single eleven-page CD booklet.\n\nTo talk about \"Ko Ko Mo\", first we're going to have to talk about Shirley & Lee. Shirley and Lee were \"the sweethearts of the blues\", a New Orleans R&B duo who recorded in Cosimo Matassa's studio. They weren't a real-life couple, but their publicity suggested that they were, and their songs made up a continuing story of an on-again off-again romance. Their first single, \"I'm Gone\", reached number two on the R&B charts:\n\n[excerpt: \"I'm Gone\", Shirley and Lee]\n\nThey were, as far as I can tell, the first people in *any* genre to do this kind of couple back-and-forth singing, as opposed to duets by singers who clearly weren't in a real relationship. You can trace a line from them through Sonny and Cher or Johnny Cash and June Carter -- duet partners whose appeal was partly due to their offstage relationships. Of course in Shirley and Lee's case this was faked, but the audiences didn't know that, at least at the time.\n\nShirley and Lee were popular enough that they inspired a whole host of imitators. We've mentioned Ike and Tina Turner before, and we're likely to talk about them again, but there was also Mickey and Sylvia, whose \"Love is Strange\" we'll be looking at later.\n\nThe three duo acts we've mentioned all knew each other -- for example, Mickey and Sylvia sang backup on Ike and Tina Turner's \"I Think It's Going to Work Out Fine\".\n\n[excerpt: Ike and Tina Turner: \"I Think It's Going To Work Out Fine\"]\n\nBut there was one other duo act who tried to make a success out of the Shirley and Lee formula, and who didn't know those other groups, and it's them we're going to be talking about today.\n\nUnlike Shirley and Lee, Gene and Eunice were a real-life couple, and so they didn't have to fake things the way Shirley and Lee did. Gene Forrest had been a jobbing singer for several years. He started out recording solo records for John Dolphin's label Recorded In Hollywood.\n\nThe label \"Recorded in Hollywood\" was a bit of a misnomer, but that label name itself tells you something about the rampant racism of American society in the 1950s. You see, John Dolphin wasn't actually based in Hollywood because when he'd tried to open his first business there -- a record shop -- he'd been unable to, because Dolphin was black, and black people weren't allowed to own businesses in Hollywood. So he named his record shop \"Dolphin's of Hollywood\" anyway, and opened it in a different part of Los Angeles.\n\nBut even though Dolphin was a victim of racism, he was also a beneficiary of it, and this just goes to show how revoltingly endemic racism was in the US in this time period. Because the original location for Dolphin's of Hollywood was on Central Ave, which at the time was the centre for black businesses in LA, in the same way that Beale Street was in Memphis or Rampart Street in New Orleans.\n\nBut Central Ave only became a centre for black business because of one of the worst acts of racism in America's history. Most of the businesses there were originally owned by Japanese people. When, during World War II, Japanese people in America, and Japanese-Americans, were interred in concentration camps for the duration of the war, those businesses became vacant, and the white owners of the properties were desperate for someone to rent them to, so they \"allowed\" black people to rent them. There was a big campaign in the black local press at the time to encourage black entrepreneurs to take over these vacant properties, and part of the campaign was to tell people that if they didn't start businesses there then Jews would instead.\n\nYes.\n\nSadly society in the US at that time was just *that* fractally racist.\n\nBut John Dolphin managed to build himself a very successful business, and he essentially dominated rhythm and blues in Los Angeles in the 1950s. As well as having a record shop, which stayed open twenty-four hours a day, he also owned a radio station, which broadcast from the front window of the record shop, with DJs such as Hunter Hancock and Johnny Otis. Those DJs would tell everyone they were broadcasting from Dolphin's, so the listeners would come along to the shop.\n\nAnd Dolphin innovated something that may have changed the whole of music history -- he deliberately targeted both his radio station and his record shop at white teenagers -- realising that they would buy music by black musicians if they knew about it, and that they had more money than the black community. As a result, his record shop often had queues out the door of white teenagers eager to buy the latest R&B records, and through the influence of his DJs the whole of the West Coast music scene became strongly influenced by the music people like Otis and Hancock would play.\n\nAnd then on top of that, in what, depending on how you look at it, was a great act of corporate synergy or something that should have brought action by antitrust agencies. Dolphin owned record labels. And his promise to artists was \"We'll record you today and you'll have a hit tonight\" -- because anything recorded on his labels would instantly go into heavy rotation on his radio station and be pushed in his record shop. Gene Forrest's records were an example:\n\n[excerpt: Gene Forrest, \"Everybody's Got Money\"]\n\nWhat that *didn't* mean for the musicians, though, was any money. Dolphin paid a flat fee for his recordings, took all the publishing rights, and wouldn't pay royalties. But for many musicians this was reasonable enough at the time -- the idea for them was that they'd make records for Dolphin to build themselves a name, then move on to a label which paid them reasonable amounts of money. As Dolphin never signed anyone to a multi-record contract, they could easily move on after making a record or two for him.\n\nSadly for Gene the promise of \"a hit tonight\" didn't pay off, and after three singles for Recorded in Hollywood, he moved first to RPM Records, one of the many blues and R&B labels that was operating at the time, and then to Aladdin Records for a one-off single backed by a band called the Four Feathers. That would be the only record they would make together, but the connection with Aladdin Records would prove to be important.\n\nShortly after that record came out, Forrest met a young singer named Eunice Levy, after she'd done well at Hunter Hancock's talent show. Initially they started working together because the Four Feathers were looking for a female harmony vocalist, but soon they became romantically involved, and started working as a duo rather than as part of a larger group, and recording for Combo Records.\n\nCombo was a tiny label owned by the trumpet player Jake Porter, and most of the records it released were recorded in Porter's basement. A typical example of a Combo release is \"Ting Ting Boom Scat\", by Jonesy's Combo:\n\n[excerpt: \"Ting Ting Boom Scat\", Jonesy's Combo]\n\nGene and Eunice's only record for Combo, \"Ko Ko Mo\", is a fairly typical rhythm and blues record for 1954. It varies simply between a verse in tresillo rhythm, trying for something of the sound of Fats Domino's records, and a more straightforward shuffle on the choruses, going between them rather awkwardly:\n\n[excerpt: \"Ko Ko Mo\" first version, by Gene and Eunice]\n\nThe reason for the awkward transition is simple enough -- it's a song made up from ideas from two different songwriters bolted together. Gene came up with the verse, while Eunice came up with the chorus -- she was inspired by the town of Kokomo, Indiana. Jake Porter is the third credited songwriter, and it's not entirely certain what, if anything, he contributed -- Porter was the owner of the record label, and label owners often took credit they didn't deserve. But on the other hand, Porter was himself a musician, and he'd performed with Lionel Hampton and Benny Goodman, among others, so it's not unreasonable that he might have actually contributed to the songwriting.\n\nThe record was backed by \"Jonesy's Combo\", who are credited on the record along with Gene and Eunice.\n\nNow, listen to this:\n\n[excerpt \"Ko Ko Mo\", second version, by Gene and Eunice]\n\nThat record is Gene and Eunice doing \"Ko Ko Mo\". The record is credited to Gene and Eunice with Johnny's Combo. The Johnny in this case is Johnny Otis, whose band backs the singers on that version. As you can tell, it sounds very close to identical to the original -- even though I'm sure Johnny Otis could easily have got the record sounding smoother and with more of a groove if he had been allowed.\n\nYou see, Gene was still under contract with Aladdin Records as a solo artist following his one single with them, and when they found that he had put out a record that might have some success with a competing label, they decided that they had to have their own version, and pulled rank, getting him to rerecord the track as closely as he could to the original recording. Eunice wasn't contracted to Aladdin, but given that the alternative was presumably a lawsuit, she went along with it. Gene and Eunice were now an Aladdin Records act, and their next few records would all be released on that label.\n\nThe recording replicated the original as closely as possible, and both records even had B-sides which were identical-sounding recordings of the same song.\n\nOnce Combo Records found out, they started an advertising war with Aladdin. It was bad enough that other people were recording the song and having hits with it, but the same act putting out the record on two different labels, that was obviously unacceptable, and the two labels started to put out competing adverts in the trade journals, Aladdin's adverts saying \"Don't Be Fooled, *THIS* is the Gene and Eunice Ko Ko Mo!\", while Combo's said \"This is it! The *original* Ko Ko Mo!\"\n\nBillboard counted the two records as the same for chart purposes -- no-one could be bothered keeping track of *which* version of \"Ko Ko Mo\" it was that was played on the radio or on a jukebox. As far as the public were concerned, it was all one record, and that one record ended up going to number six on the R&B charts.\n\nBut Gene and Eunice weren't the only ones to have a hit with \"Ko Ko Mo\". The song became the subject of almost a feeding frenzy of cover versions. The first, by Marvin and Johnny, came out only a month after the original recording:\n\n[Excerpt: \"Ko Ko Mo\" by Marvin and Johnny]\n\nBut there were dozens upon dozens of them. The Crew Cuts, Louis Armstrong, The Flamingoes, Rosemary Clooney's sister Betty... everyone was recording a version of \"Ko Ko Mo\", within a month or two of the single coming out.\n\nThe best explanation anyone can come up with for the massive, improbable, success of the song in cover versions is that it was one of the few R&B singles of the time to be completely free of sexual innuendo. While R&B records of the time mostly sound completely clean to modern ears, to radio programmers at the time records like \"the Wallflower\" and \"Hound Dog\" were utterly scandalous, and required substantial rewriting if they were going to play to white audiences.\n\nBut \"Ko Ko Mo\" had such a simplistic lyric that there was no problem with it, and the result was that everyone could record it and have a hit with the white audience, leading to it even being recorded by Perry Como:\n\n[excerpt \"Ko Ko Mo\" by Perry Como]\n\nAnd that was the biggest hit of all. Como was the person with whom the song became associated, although thankfully for all concerned he made no further rock and roll records. And even Como's version is probably more rocking than that by Andy Griffith -- yes, that Andy Griffith, the 50s sitcom actor.\n\n[excerpt: Andy Griffith, \"Ko Ko Mo\"]\n\nIt's notable that the trade magazines advertised Como's version of \"Ko Ko Mo\" as a rock and roll record -- this was in very early 1955, after \"Rock Around the Clock\" had been released, but well before it became a hit. But rock and roll was already a phrase that was in use for the style of music, at least among the trade magazines.\n\nNormally this kind of cover version would have brought at least a reasonable amount of money to the songwriters -- and as Gene and Eunice were the writers, that should have given them a large amount of money. However, after they sold the song to one publishing company, Aladdin claimed that they owned the publishing, again due to their existing contract with Gene Forrest. So everybody got a share of the money from the hit record, except for the people who wrote and sang it.\n\nGene and Eunice's next single was \"This is My Story\"\n\n[Excerpt: Gene and Eunice \"This is My Story\"]\n\nThere was a problem, though. \"Ko Ko Mo\" was going up the charts, and \"This is My Story\" was about to be released. They needed to go out on tour to capitalise on the first, promote the second, and generally get themselves into a position where they could have a career with some sort of possibility of lasting.\n\nAnd Eunice was pregnant, with Gene's child.\n\nObviously, she couldn't go out on the road and tour, especially in the kind of conditions in which black artists had to tour in the 1950s, often sleeping on fans' floors because there were no hotels that would take black people.\n\nThere was only one thing for it. They would have to get in a replacement Eunice. They auditioned several singers, before eventually settling on Linda Hayes, the sister of Tony Williams of the Platters. Hayes didn't sound much like Eunice, but she looked enough like her that she could do the job. We heard from Linda Hayes last week, when we looked at one of the Johnny Ace tribute records she sang on, but she had a relatively decent minor career herself, singing lead on several records with her brother's group before putting out a few records of her own. Here, for example, is one of her records with the Platters:\n\n[excerpt: Linda Hayes and the Platters, \"Please Have Mercy\"]\n\nSo Gene toured with Linda as a substitute Eunice while Eunice was on what amounted to maternity leave, and that worked well enough. \"This is My Story\" went to number eight on the R&B charts, and it looked like Gene and Eunice were on their way to permanent stardom.\n\nUnfortunately, that wasn't the case, and by the time Eunice got back from maternity leave, the duo's career stalled. They recorded several more records for Aladdin, and tried various different tactics to repeat their early success, including having their records produced by the great Earl Palmer:\n\n[Excerpt: Gene and Eunice, \"The Angels Gave You To Me\"]\n\nNone of that did any good as far as charting goes. \"This is My Story\" was their last chart hit for Aladdin records, and after the recordings with Earl Palmer in 1958, the label dropped them.\n\nThey recorded for several more labels, with mixed results. For a while, Eunice returned to Combo records -- unsurprisingly, after what had happened with Gene's contract, Jake Porter didn't want to have anything to do with Gene, but Eunice released a couple of unsuccessful tracks with them:\n\n[excerpt: Eunice Levy, \"Only Lovers\"]\n\nSo, why did Gene and Eunice become completely forgotten? Why, outside the liner notes for a single out-of-print CD booklet and a Wikipedia article based substantially on that booklet, have I been able to find a grand total of four paragraphs or so of text about them in any reliable source? And why does even that set of liner notes start with the sentence \"Gene & Eunice's story is muddled, confusing, and largely unknown\"?\n\nI think this comes back to something that has been an underlying theme of this podcast from the start -- the fact that great art comes from scenes as much as it does from individuals.\n\nThis is not the same as saying that great *artists* aren't individuals, but that the music we remember tends to come out of reinforcing groups of artists, not just collaborating but providing networks for each other, acting as each other's support acts, promoting each other's material. I mentioned when I was talking about Mickey and Sylvia, Shirley & Lee, and Ike and Tina Turner that all three of these acts knew and worked with each other. None of them worked with Gene and Eunice, and Gene & Eunice just don't seem to have had any particular network of musicians with whom they collaborated. The collaboration with Johnny Otis just seems to have been a one-off job for him, and bringing in Linda Hayes doesn't seem to have led to any further connections with the people she worked with.\n\nWith almost every act we've talked about, you find them turning up in unexpected places in biographies of other acts, and even the one-hit wonders who had hits that people remembered continued being parts of other musicians' lives. Gene and Eunice just didn't. But without those connections, without making themselves part of a bigger story, they didn't become part of the cultural memory. Most of the acts that covered \"Ko Ko Mo\" were people like Perry Como or Louis Armstrong who aren't part of the rock and roll canon, and so the record seems to have turned into a footnote. But that wasn't quite the end of their influence.\n\nJamaica always had a soft spot for US R&B of the Fats Domino type, and Gene and Eunice, with their adaptations of Dave Bartholomew's New Orleans style, became mildly successful in Jamaica. In particular, their record \"The Vow\", which had been one of their last Aladdin releases, got covered on Coxsone Dodd's Studio One records, the label that basically pioneered ska, rocksteady, and reggae music in Jamaica. In 1965, Studio One released this:\n\n[excerpt: Bunny and Rita: \"The Vow\"]\n\nThat's another version of their song, this time performed by Bunny and Rita -- as in Bunny Wailer, of the Wailers, and Rita Anderson, who would later also join the Wailers and become better known by her married name after she married Bunny's bandmate Bob Marley.\n\nGene and Eunice attempted a reunion in the eighties. They didn't get on well enough to make it work, but Eunice did get to record one last single as a solo artist, under her new married name Eunice Russ Frost. On \"Real Reel Switcher\" she was backed by the classic fifties rhythm section of Red Callender and Earl Palmer:\n\n[excerpt: Eunice Russ Frost, \"Real Reel Switcher\"]\n\nGene remained out of the spotlight until his death in 2003, but Eunice would occasionally perform at conventions for fans of doo-wop and R&B until she died in 2002. She never got to recapture her early success, but she did, at least, know there were still people out there who remembered \"Ko Ko Mo”.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-four of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Ko Ko Mo\" by Gene and Eunice. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor the most part I have only used two resources for this podcast, because as I explain in the episode itself there is basically no information available anywhere on Gene and Eunice. The resource which I used for all the information about Gene and Eunice themselves, and most of the music, is the now out-of-print 2001 Ace Records CD Go On Ko Ko Mo!, whose eleven-page booklet by Stuart Colman contains about ten and a half pages more information about Gene and Eunice than otherwise seems to exist.\n\nFor the information about John Dolphin, I used the self-published book Recorded in Hollywood, the John Dolphin Story, by Jamelle Baruck Dolphin. This contains some very incorrect information in parts -- notably, in the couple of paragraphs talking about Gene and Eunice, it mentions \"The Vow\" being covered by Bunny and Rita, which is how I found out about that, but it also says that the song was covered by Jackie and Doreen on the same label. The Jackie and Doreen record called \"The Vow\" is a different song (unless there were two records of that name, which I don't dismiss, but I've only been able to find one), and the book also calls Coxsone Dodd \"Coxton Dodd\". But presumably, given the author's surname and the fact that the book heavily quotes from John Dolphin's children, the book can be relied on to be more or less accurate when it comes to the facts of Dolphin's life, at least.\n\nThe Ace Records CD mentioned above contains *almost* every record released by Gene and Eunice, but it doesn't contain the Aladdin Records version of \"Ko Ko Mo\", just the Combo original. However, That's Your Last Boogie, a three-CD compilation of Johnny Otis music I have recommended here before, does have that track on it, as well as many more tracks we've discussed in this series and a few that we're going to look at in future.\n\nAnd finally, it looks like the Kickstarter for the first book based on this series is going to fail -- there are two days left to go and it's still short by nearly two hundred pounds. But it's still possible to pledge if you feel like it.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\n\"Arruba, Jamaica...\" no, sorry, this is not that Kokomo, which much as I love the Beach Boys is *not* going to make this history. Instead it's a song that is now almost completely forgotten but which was one of the most important records in early rock and roll.\n\nAnd I do mean both that it has been almost completely forgotten and that it was hugely important. This song seems just to have fallen out of the collective memory altogether, to the extent that I only found out about it by reading old books and asking \"what is this ko ko mo they're talking about?” Because it was important enough that *all* of the best books on R&B history -- most of which were written in the sixties or seventies, when the events I've been talking about were far fresher in the memory -- mentioned it, and said it was one of the most important records of 1954.\n\nAnd the fact is, there is an interesting story buried in there, the story of how \"Ko Ko Mo\" by Gene and Eunice was *two* of the most important records in early rock and roll.\n\nBut there's another story there too -- the story of how a record can completely disappear from the cultural memory. Because even in those books which mention it... that's all they do. They just mention this record's existence, giving it no more than a few sentences. On most of these podcast episodes, I end up cutting a lot of material, because there's far more to say than will fit into a half-hour podcast. Here... there's nothi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-four of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Ko Ko Mo\" by Gene and Eunice. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nFor the most part I have only used two resources for this podcast, because as I explain in the episode itself there is basically no information available anywhere on Gene and Eunice. The resource which I used for all the information about Gene and Eunice themselves, and most of the music, is the now out-of-print 2001 Ace Records CD Go On Ko Ko Mo!, whose eleven-page booklet by Stuart Colman contains about ten and a half pages more information about Gene and Eunice than otherwise seems to exist.\n\nFor the information about John Dolphin, I used the self-published book Recorded in Hollywood, the John Dolphin Story, by Jamelle Baruck Dolph",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}