{
  "title": "189: Scott Peterson: One Last Chance (ABC's 20/20)",
  "link": "https://audioboom.com/posts/7908317",
  "itunes:episode": 189,
  "itunes:title": "Scott Peterson: One Last Chance (ABC's 20/20)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4135,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>It's been 18 years since Scott Peterson was convicted of killing his pregnant wife, Laci. In that time, some members of his family have been working tirelessly to prove his innocence--that he couldn't have killed Laci. Some of their evidence is compelling, but so much of Scott's story still doesn't make sense. But Scott's attorneys are certain that if he's granted a new trial--which seems more and more likely--they'll be able to prove beyond reasonable doubt that their client is innocent. <br>\n<br>\n<a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>FAM OUR LIVE SHOW IN BOSTON IS BACK ON AND TICKETS ARE NOW ON SALE!! </strong></a>If you had tickets to the original date, they have been refunded, check your email! Our new date is Saturday, July 31st at 7pm AT THE WILBUR THEATER!!  We're covering Oxygen's \"The Disappearance of Maura Murray\" and we will be joined by Maggie Freleng (who hosted the series) and Tim and Lance from Missing Maura Murray podcast! <a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>TICKETS ARE GOING FAST! GET YOURS AND COME JOIN US!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 20 Jul 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-20:/posts/7908317",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}