{
  "title": "S5 Ep52: Director's Cut: Priorities for the new ECB president",
  "link": "https://audioboom.com/posts/7307651",
  "itunes:episode": 52,
  "itunes:title": "Director's Cut: Priorities for the new ECB president",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1574,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>A difficult proposition faces the new ECB president – monetary union remains incomplete, the bank lacks room to manoeuvre in applying new tools, and it is not yet clear what constitutes the new economic ‘normal’.<br>\n<br>\nIn this episode of 'The Sound of Economics' Bruegel director Guntram Wolff addresses deputy director Maria Demertzis and research fellow Grégory Claeys, who together with senior fellow Francesco Papadia have written <a href=\"http://bruegel.org/2019/07/preparing-for-uncertainty/\">a memo to the incoming ECB president.<br>\n</a><br>\nIn their note, the authors state that the ECB needs to begin this eight-year term by reviewing monetary policy framework to account for the increasingly uncertain environment in which it will have to operate. In that vein, the incoming president will have to be prepared to emulate previous actions, providing certainty when it cannot be found elsewhere.<br>\n<br>\nIn addition, the authors propose methods by which the ECB can bolster the euro-area architecture while continuing to fulfil its role in promoting financial stability.<br>\n<br>\nFor further reading on this topic, we recommend a recent blog post by Grégory Claeys and Tanja Linta on <a href=\"http://bruegel.org/2019/06/the-evolution-of-the-ecb-governing-councils-decision-making/\">the evolution of the ECB governing council's monetary-policy decision-making process.</a>\n</div>\n",
  "itunes:summary": "In this Director's Cut of 'The Sound of Economics', Guntram Wolff talks to two of the authors of Bruegel's memo to the new ECB president, Maria Demertzis and Grégory Claeys, to specify the most important issues at the beginning of this eight-year cycle and to clarify the parameters within which the new incumbent will have to work.",
  "pubDate": "Thu, 04 Jul 2019 11:54:10 +0000",
  "guid": "tag:audioboom.com,2019-07-04:/posts/7307651",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}