{
  "title": "S1E46 - 17 Scars That Paved the Way to Tokyo with Taekwondo Olympian Victoria Stambaugh",
  "guid": "https://pinecast.com/guid/0601eca3-3860-4e9d-84d6-4963db69237e",
  "pubDate": "Wed, 02 Jun 2021 06:30:00 -0000",
  "itunes:duration": "01:12:08",
  "description": "<p>Joining Laura on the podcast today is Olympic Taekwondo athlete, Victoria Stambaugh. The daughter of a professional boxer, Victoria took to Taekwondo at an early age, made the US National Team in her teens, eventually joined the Puerto Rico National Team, and has since qualified to compete for Puerto Rico at the upcoming Tokyo Games. Having suffered a number of injuries and resulting surgeries over her career, Victoria has demonstrated remarkable resilience, and, through her faith in Christ, has persevered to achieve her dream of becoming an Olympian. In today’s conversation, she not only shares her inspirational story, but also turns the tables to pick Laura’s brain for some of her sage advice as well.\n \nAs with all guests, Victoria begins by sharing how she found her way to her chosen sport, and then she goes on to relate the story of her career to date. Starting with how she made the US National Team, Victoria proceeds to recount her battles with injuries over the years, how they have affected both her career and her emotional state, her transition to the Puerto Rico National Team, and how qualifying for the Olympics works in her sport. She also delves deeply into the role that her faith has played in her life and career, the impact of handing control over to God, her 17 scars and what they mean to her, and her work with Master Bang in preparing for Tokyo. Victoria concludes the episode by questioning Laura on her Olympic experiences and advice, and the role that her faith has played in her life and career. As you will hear, Victoria and Laura are very much kindred spirits whose personal, professional, and spiritual lives resonate considerably with each other, and also offer valuable lessons for all listeners here today.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>Victoria’s sports history and how she got into Taekwondo</li>\n<li>Making the US National Team</li>\n<li>How Taekwondo athletes are selected for the Olympics</li>\n<li>Her knee injuries and surgeries</li>\n<li>How Victoria’s faith has helped her</li>\n<li>Her story of not qualifying for Rio and focusing on Tokyo</li>\n<li>The times when God spoke directly to her heart</li>\n<li>Transitioning from the US to the Puerto Rican Team</li>\n<li>How Olympic qualifying works for Taekwondo and diving</li>\n<li>Her knee injuries and surgeries while preparing for Tokyo</li>\n<li>Handing control over to God</li>\n<li>Qualifying for Tokyo</li>\n<li>Her 17 scars and what they mean to her</li>\n<li>Master Bang</li>\n<li>Victoria and her fiance’s Taekwondo and Parkour studio</li>\n<li>Laura’s best advice for someone competing at their first Olympics</li>\n<li>What’s different for Laura now</li>\n<li>Laura’s thoughts during the finals for her gold</li>\n<li>How Laura’s faith has helped her throughout her career</li>\n<li>Laura’s biggest goal when competing at the Olympics</li>\n<li>Her upcoming trials</li>\n<li>Laura’s thoughts on not being able to have family at the Tokyo Olympics</li>\n</ul>\n<p>Quotes: \n </p>\n<ul>\n<li>“When I saw Jackie Chan, Jet Li, I was like, ‘I want to be these guys’.”</li>\n<li>“For the Olympics, only two weight categories can qualify, female and male, per country.”</li>\n<li>“Deep down inside, I knew that my knee was never the same.”</li>\n<li>“I know God put the right person at the right time that I needed to hear those words, ‘not to quit’ and to ‘come back’.”</li>\n<li>“That started the process of three knee surgeries within a period of six months.”</li>\n<li>“What I picture is kind of like God just wrapping His arms around me and giving me a hug. And at that moment, I was able to continue on and it was actually just the very next day where I was like, ‘Okay, I'm going to go for Tokyo’.”</li>\n<li>“He had to take out the rest of the meniscus…in my mind, I was like, ‘You just took my whole career away from me’.”</li>\n<li>“And then, sure enough, God always sends the right message, the right person, at the right time.”</li>\n<li>“God has seen your tears and, and He's with you. Don't give up, keep going.”</li>\n<li>“I was done emotionally, mentally, you know, physically, spiritually. I was just drained. And that's when I just released total control to Christ and let him handle it.”</li>\n<li>“Christ was my confidence…and I qualified for the Olympics.”</li>\n<li>“A reminder of everything I've been through and everything God has brought me out of. And what better reminder, really? It's basically tattooed on my body.”</li>\n<li>“People get so lost in the aura and the bigness and the pressure of the Olympic Games. But, just, you’ve got to be able to let that go.”</li>\n<li>“That's for Him to use this for my good and for His glory.”</li>\n<li>“You don't have to have the lead if you have the heart to come from behind.”</li>\n<li>“I've had a lot of big dreams that I've fallen very short of, but, in that moment, I was living it. And to me that was one of the greatest things that I got to take away.”</li>\n<li>“Now I do want to boast about my weaknesses, because that's the chance for the power of Christ to rest upon me, and for the world to see, you know, exactly what He can do.”</li>\n<li>“The biggest thing that I need to do is stay in the moment.”</li>\n<li>“Maybe I can just really spend that time dependent with God.”</li>\n<li>“You've got to kind of expect the unexpected, and just roll with it.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>                \n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \n<a href=\"https://www.instagram.com/victoriastambaugh/?hl=en\" rel=\"nofollow\">Victoria's Instagram</a>\n<a href=\"https://www.facebook.com/stambaughvictoria/\" rel=\"nofollow\">Victoria's Facebook</a>\n<a href=\"https://www.victoriastambaugh.com/\" rel=\"nofollow\">Victoria's Homepage</a></p>",
  "itunes:title": "17 Scars That Paved the Way to Tokyo with Taekwondo Olympian Victoria Stambaugh",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 46
}