{
  "title": "Episode 81: Talking (and not Talking) in Psychotherapy - Part 2",
  "pubDate": "Tue, 09 Dec 2008 21:57:01 +0000",
  "guid": "episode-81-talking-and-not-talking-in-psychothe",
  "link": "http://www.thepsychfiles.com/2008/12/07/episode-81-talking-and-not-talking-in-psychotherapy-part-2/",
  "itunes:image": "",
  "description": "Are you interested in play therapy or therapy with children and adolescents? Do you have a child in therapy and you wonder how playing with toys is going to possibly help you child?  Learn more about therapy with children and adolescents in this episode of The Psych Files.  In part 2 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis.  In this part of the interview Dr. Strauss talks specifically about No Talk therapy and how she explains her work to the parents of her clients.  Come have a listen to an experienced therapist talk about her work.",
  "content:encoded": "Are you interested in play therapy or therapy with children and adolescents? Do you have a child in therapy and you wonder how playing with toys is going to possibly help you child?  Learn more about therapy with children and adolescents in this episode of The Psych Files.  In part 2 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis.  In this part of the interview Dr. Strauss talks specifically about No Talk therapy and how she explains her work to the parents of her clients.  Come have a listen to an experienced therapist talk about her work.",
  "enclosure": "",
  "itunes:duration": "27:04",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,Psychotherapy",
  "itunes:subtitle": "Are you interested in play therapy or therapy with children and adolescents? Come have a listen to an experienced therapist talk about her work.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Are you interested in play therapy or therapy with children and adolescents? Do you have a child in therapy and you wonder how playing with toys is going to possibly help you child? Learn more about therapy with children and adolescents in this episode of The Psych Files. In part 2 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis. In this part of the interview Dr. Strauss talks specifically about No Talk therapy and how she explains her work to the parents of her clients. Come have a listen to an experienced therapist talk about her work."
}