{
  "title": "Uncertainty-Aware Unsupervised Image Deblurring with Deep Residual Prior. (arXiv:2210.05361v2 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2210.05361",
  "description": "<p>Non-blind deblurring methods achieve decent performance under the accurate\nblur kernel assumption. Since the kernel uncertainty (i.e. kernel error) is\ninevitable in practice, semi-blind deblurring is suggested to handle it by\nintroducing the prior of the kernel (or induced) error. However, how to design\na suitable prior for the kernel (or induced) error remains challenging.\nHand-crafted prior, incorporating domain knowledge, generally performs well but\nmay lead to poor performance when kernel (or induced) error is complex.\nData-driven prior, which excessively depends on the diversity and abundance of\ntraining data, is vulnerable to out-of-distribution blurs and images. To\naddress this challenge, we suggest a dataset-free deep residual prior for the\nkernel induced error (termed as residual) expressed by a customized untrained\ndeep neural network, which allows us to flexibly adapt to different blurs and\nimages in real scenarios. By organically integrating the respective strengths\nof deep priors and hand-crafted priors, we propose an unsupervised semi-blind\ndeblurring model which recovers the latent image from the blurry image and\ninaccurate blur kernel. To tackle the formulated model, an efficient\nalternating minimization algorithm is developed. Extensive experiments\ndemonstrate the favorable performance of the proposed method as compared to\ndata-driven and model-driven methods in terms of image quality and the\nrobustness to the kernel error.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Tang_X/0/1/0/all/0/1\">Xiaole Tang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhao_X/0/1/0/all/0/1\">Xile Zhao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_J/0/1/0/all/0/1\">Jun Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_J/0/1/0/all/0/1\">Jianli Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Miao_Y/0/1/0/all/0/1\">Yuchun Miao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zeng_T/0/1/0/all/0/1\">Tieyong Zeng</a>"
}