{
  "id": "yt:video:bmGqhM-tUk4",
  "yt:videoId": "bmGqhM-tUk4",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "To Master Physics, First Master the Harmonic Oscillator",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2022-01-25T22:09:37+00:00",
  "updated": "2022-08-19T15:35:43+00:00",
  "media:group": {
    "media:title": "To Master Physics, First Master the Harmonic Oscillator",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "It's hard to overstate how important the simple harmonic oscillator is in so many areas of physics. Almost every system is an oscillator near a stable equilibrium! Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nOf all the systems you'll study in your first physics class, the oscillations of a block attached to a spring are a subject you'll meet again and again throughout your physics education. The spring exerts a force on the block (sometimes called Hooke's law) that tries to push it back toward equilibrium, and the result is that the block oscillates around equilibrium in simple harmonic motion. But why is this simple system so prevalent throughout physics? The basic reason is that you can Taylor expand any potential energy function near a stable equilibrium point, and it will almost always look like the parabola of the simple harmonic oscillator potential energy!\n\nPlay with the animations: https://www.physicswithelliot.com/oscillator-help-room\n\nHow to think of the potential energy like a hill: https://youtu.be/NvOvmgHSFx0\n\nAll about pendulums: https://youtu.be/0q0L7Fj4dk8\n\nTutoring inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics help room videos:\nThese are intro-level physics videos aimed at students taking their first physics classes. In each video, I'll teach you the fundamentals of a particular physics topic you're likely to meet in your first classes on mechanics and electromagnetism.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}