{
  "title": "EPISODE 80: The Patriotic Mobsters",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:33:05 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-80-the-patriotic-mobsters",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5e015918c033c414e5bd2",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/551680da-ca3a-4340-b6d1-18504d564722/HOF-80-ThePatrioticMobsters.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5e051c6889b2c70b1bfd5\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/551680da-ca3a-4340-b6d1-18504d564722/HOF-80-ThePatrioticMobsters.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Lucky will not be pleased to hear that you have not been helpful.”</em> — Joe Adonis </p><p class=\"\"><em>“The outcome of the war appeared extremely grave. In addition, there was the most serious concern over possible sabotage in the ports. It was necessary to use every possible means to prevent and forestall sabotage and to prevent the possible supplying of and contact with enemy submarines.” —</em> Captain Roscoe C. MacFall</p><p class=\"\"><em>“There was peace on the waterfront. It was kept with rough methods. But that's what the Navy asked us to do and that's what the Navy go.”</em>  — Meyer Lansky</p><p class=\"\">Just because Lucky Luciano was one of the most famous mobsters of the 20th century doesn’t mean he was not a patriot ready to help the Allies win the war. Well… that’s one way to look at it. Otherwise, we’d have to conclude that during WWII, the government made a deal with the biggest Mafia boss of the times, releasing him from prison in exchange for his cooperation. Back then the government was in a bind—it wanted to protect American shores from sabotage at the hands of Nazi sympathizers, but it had only limited control on the docks. American ports belonged to the Mafia. And so the logical conclusion was that, for the sake of the war effort, the government jumped in bed with organized crime. This is the tale of the marriage of convenience between the American Navy and Lucky Luciano.  </p><p class=\"\">Thank you to Alexander Von Sternberg from History Impossible for his help in crafting this episode.</p>",
  "media:content": {
    "media:title": "EPISODE 80: The Patriotic Mobsters"
  }
}