{
  "guid": "prx_326_b777a01f-adb4-4c73-aaa3-342d3ebbfee4",
  "title": "Why Do We Compete?",
  "pubDate": "Fri, 26 Mar 2021 17:07:53 -0000",
  "link": "https://www.vpr.org/post/why-do-we-compete",
  "description": "<p>Have you ever felt competitive with a friend or a sibling? Competition comes up in a lot of different ways in life. Maybe you're running a race with a friend and you want to beat them! Maybe you're trying to play a song without making a mistake and you're competing against yourself.</p>\n\n<p>Sometimes competition feels good and fun. It can make you want to do better, and make a game more enjoyable. But not always. Sometimes competition feels bad. Like it's too much pressure, or takes away from the fun of being with your friends. Some people really don't like competition at all.</p>\n\n<p>3-year-old Kai from Tokyo, Japan asks: \"Why do we need to compete with other people, especially friends, for example on a sports day or at gym class?\"</p>\n\n<p>In this episode we discuss competition with anthropologist Niko Besnier. And we'll hear from 12-year-old Harini Logan, a competitive speller from San Antonio, Texas, and 10-year-old Del Guilmette, an athlete from Monkton, Vermont.</p>\n\n<p><em>Download our learning guides: <a href=\"https://www.vpr.org/sites/vpr/files/202103/why_do_we_compete_.pdf\" rel=\"nofollow\" target=\"_blank\">PDF</a> | <a href=\"https://docs.google.com/presentation/d/1WfhzRPqaf-aNgrIEqiJSrmHZbvtMf5ZhQxqg2hEkOgg/copy\" rel=\"nofollow\" target=\"_blank\">Google Slide</a> | <a href=\"https://www.vpr.org/sites/vpr/files/202103/But_Why_150_Competition_TRANSCRIPT.pdf\" rel=\"nofollow\" target=\"_blank\">Transcript</a></em></p>\n\n<p>We put Kai's question to Niko Besnier, anthropologist at the University of Amsterdam.  One of his books is called <em><a href=\"https://www.goodreads.com/book/show/37922499-the-anthropology-of-sport\" rel=\"nofollow\" target=\"_blank\">The Anthropology of Sport</a></em>, written with Susan Brownell and Thomas F. Carter. He says there are two reasons that people take part in competitions:</p>\n\n<p>\"One is that sports are fun. It's fun to play with your friends and classmates, to run, jump, play ball. We've all experienced this rush of pleasure and fun doing these things. But the other aspect that's contradictory to the fun part is that it enables us to measure our strength, our speed, our physical ability against those of other people. It's the competition part of sport, and competition can become extremely serious. Frequently, the fun part of sport gets lost.\"</p>\n\n<p>Besnier says when competition gets out of hand it can lead to hurt feelings, and on a larger scale, competition can lead to things like war and inequality.</p>\n\n<p>But with the right attitude, competition, especially when we compete against ourselves, can help us get better at sports and academics.</p>\n\n<p>That's how it is for Harini Logan. She's a competitive speller who has made it to the <a href=\"http://spellingbee.com/\" rel=\"nofollow\" target=\"_blank\">Scripps National Spelling Bee</a> twice!</p>\n\n<p>\"Competition teaches you a lot, whether it's the preparation leading up to that competition or the outcome,\" Logan says. \"It can teach you a lot about not only your abilities, but also new things that can change the way you look at life. When you're preparing for a competition you can learn how to work hard, and how not to give up on something. And during the competition you learn teamwork. That's one thing you learn in spelling bees, because you want to be with your community, your friends. One thing to learn if you win: sportsmanship! You don't gloat about it, you still appreciate yourself but you don't overdo it so others don't feel bad. And if you don't win it doesn't matter. [You just say:] I'm going to try harder next time.\"</p>\n\n<p>Competing also helps us get better. That's how 10-year-old Del Guilmette views it. He likes to play against tough teams when he plays sports, because that's how you get better.</p>\n\n<p>\"The best players at the game, whatever sport it is, they didn't get better because they played teams that they knew they were going to beat. They played those teams that were better than them. They got better and they practiced!\"</p>\n\n<p><strong>Listen to the full episode to hear more about how these mature young competitors think about the value of competition.</strong></p>",
  "enclosure": "",
  "itunes:subtitle": "3-year-old Kai from Tokyo, Japan asks: \"Why do we need to compete with other people, especially friends, for example on a sports day or at gym class?\"",
  "itunes:episodeType": "full",
  "itunes:episode": 150,
  "itunes:duration": "22:57",
  "author": "questions@butwhykids.org (Vermont Public)",
  "category": [
    "kids",
    "sports"
  ],
  "itunes:author": "Vermont Public",
  "itunes:summary": "Have you ever felt competitive with a friend or a sibling? Competition comes up in a lot of different ways in life. Maybe you're running a race with a friend and you want to beat them! Maybe you're trying to play a song without making a mistake and you're competing against yourself. Sometimes competition feels good and fun. It can make you want to do better, and make a game more enjoyable. But not always. Sometimes competition feels bad. Like it's too much pressure, or takes away from the fun of being with your friends. Some people really don't like competition at all. 3-year-old Kai from Tokyo, Japan asks: \"Why do we need to compete with other people, especially friends, for example on a sports day or at gym class?\" In this episode we discuss competition with anthropologist Niko Besnier. And we'll hear from 12-year-old Harini Logan, a competitive speller from San Antonio, Texas, and 10-year-old Del Guilmette, an athlete from Monkton, Vermont. Download our learning guides: <a href=\"https://www.vpr.org/sites/vpr/files/202103/why_do_we_compete_.pdf\">PDF</a> | <a href=\"https://docs.google.com/presentation/d/1WfhzRPqaf-aNgrIEqiJSrmHZbvtMf5ZhQxqg2hEkOgg/copy\">Google Slide</a> | <a href=\"https://www.vpr.org/sites/vpr/files/202103/But_Why_150_Competition_TRANSCRIPT.pdf\">Transcript</a> We put Kai's question to Niko Besnier, anthropologist at the University of Amsterdam.  One of his books is called <a href=\"https://www.goodreads.com/book/show/37922499-the-anthropology-of-sport\">The Anthropology of Sport</a> , written with Susan Brownell and Thomas F. Carter. He says there are two reasons that people take part in competitions: \"One is that sports are fun. It's fun to play with your friends and classmates, to run, jump, play ball. We've all experienced this rush of pleasure and fun doing these things. But the other aspect that's contradictory to the fun part is that it enables us to measure our strength, our speed, our physical ability against those of other people. It's the competition part of sport, and competition can become extremely serious. Frequently, the fun part of sport gets lost.\" Besnier says when competition gets out of hand it can lead to hurt feelings, and on a larger scale, competition can lead to things like war and inequality. But with the right attitude, competition, especially when we compete against ourselves, can help us get better at sports and academics. That's how it is for Harini Logan. She's a competitive speller who has made it to the <a href=\"http://spellingbee.com/\">Scripps National Spelling Bee</a> twice! \"Competition teaches you a lot, whether it's the preparation leading up to that competition or the outcome,\" Logan says. \"It can teach you a lot about not only your abilities, but also new things that can change the way you look at life. When you're preparing for a competition you can learn how to work hard, and how not to give up on something. And during the competition you learn teamwork. That's one thing you learn in spelling bees, because you want to be with your community, your friends. One thing to learn if you win: sportsmanship! You don't gloat about it, you still appreciate yourself but you don't overdo it so others don't feel bad. And if you don't win it doesn't matter. [You just say:] I'm going to try harder next time.\" Competing also helps us get better. That's how 10-year-old Del Guilmette views it. He likes to play against tough teams when he plays sports, because that's how you get better. \"The best players at the game, whatever sport it is, they didn't get better because they played teams that they knew they were going to beat. They played those teams that were better than them. They got better and they practiced!\" Listen to the full episode to hear more about how these mature young competitors think about the value of competition.",
  "itunes:image": "",
  "media:content": "",
  "content:encoded": "\n        <p>Have you ever felt competitive with a friend or a sibling? Competition comes up in a lot of different ways in life. Maybe you're running a race with a friend and you want to beat them! Maybe you're trying to play a song without making a mistake and you're competing against yourself.</p>\n\n<p>Sometimes competition feels good and fun. It can make you want to do better, and make a game more enjoyable. But not always. Sometimes competition feels bad. Like it's too much pressure, or takes away from the fun of being with your friends. Some people really don't like competition at all.</p>\n\n<p>3-year-old Kai from Tokyo, Japan asks: \"Why do we need to compete with other people, especially friends, for example on a sports day or at gym class?\"</p>\n\n<p>In this episode we discuss competition with anthropologist Niko Besnier. And we'll hear from 12-year-old Harini Logan, a competitive speller from San Antonio, Texas, and 10-year-old Del Guilmette, an athlete from Monkton, Vermont.</p>\n\n<p><em>Download our learning guides: <a href=\"https://www.vpr.org/sites/vpr/files/202103/why_do_we_compete_.pdf\" rel=\"nofollow\" target=\"_blank\">PDF</a> | <a href=\"https://docs.google.com/presentation/d/1WfhzRPqaf-aNgrIEqiJSrmHZbvtMf5ZhQxqg2hEkOgg/copy\" rel=\"nofollow\" target=\"_blank\">Google Slide</a> | <a href=\"https://www.vpr.org/sites/vpr/files/202103/But_Why_150_Competition_TRANSCRIPT.pdf\" rel=\"nofollow\" target=\"_blank\">Transcript</a></em></p>\n\n<p>We put Kai's question to Niko Besnier, anthropologist at the University of Amsterdam.  One of his books is called <em><a href=\"https://www.goodreads.com/book/show/37922499-the-anthropology-of-sport\" rel=\"nofollow\" target=\"_blank\">The Anthropology of Sport</a></em>, written with Susan Brownell and Thomas F. Carter. He says there are two reasons that people take part in competitions:</p>\n\n<p>\"One is that sports are fun. It's fun to play with your friends and classmates, to run, jump, play ball. We've all experienced this rush of pleasure and fun doing these things. But the other aspect that's contradictory to the fun part is that it enables us to measure our strength, our speed, our physical ability against those of other people. It's the competition part of sport, and competition can become extremely serious. Frequently, the fun part of sport gets lost.\"</p>\n\n<p>Besnier says when competition gets out of hand it can lead to hurt feelings, and on a larger scale, competition can lead to things like war and inequality.</p>\n\n<p>But with the right attitude, competition, especially when we compete against ourselves, can help us get better at sports and academics.</p>\n\n<p>That's how it is for Harini Logan. She's a competitive speller who has made it to the <a href=\"http://spellingbee.com/\" rel=\"nofollow\" target=\"_blank\">Scripps National Spelling Bee</a> twice!</p>\n\n<p>\"Competition teaches you a lot, whether it's the preparation leading up to that competition or the outcome,\" Logan says. \"It can teach you a lot about not only your abilities, but also new things that can change the way you look at life. When you're preparing for a competition you can learn how to work hard, and how not to give up on something. And during the competition you learn teamwork. That's one thing you learn in spelling bees, because you want to be with your community, your friends. One thing to learn if you win: sportsmanship! You don't gloat about it, you still appreciate yourself but you don't overdo it so others don't feel bad. And if you don't win it doesn't matter. [You just say:] I'm going to try harder next time.\"</p>\n\n<p>Competing also helps us get better. That's how 10-year-old Del Guilmette views it. He likes to play against tough teams when he plays sports, because that's how you get better.</p>\n\n<p>\"The best players at the game, whatever sport it is, they didn't get better because they played teams that they knew they were going to beat. They played those teams that were better than them. They got better and they practiced!\"</p>\n\n<p><strong>Listen to the full episode to hear more about how these mature young competitors think about the value of competition.</strong></p>\n      ",
  "itunes:explicit": "no",
  "itunes:keywords": "Science, Nature, Language",
  "dc:creator": "Vermont Public Radio"
}