{
  "title": "EPISODE 74: The Life of Marcus Aurelius (Part 2): Stoicism, Pandemic and War",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 26 Mar 2021 15:54:14 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2021/3/26/episode-74-the-life-of-marcus-aurelius-part-2-stoicism-pandemic-and-war",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:605e02ead39f2e14c439c180",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616774003485-OYIT453UU1DRYIYYH1HX/HOF-74-MarcusAurelius-II.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-74-MarcusAurelius-II.jpg\" data-load=\"false\" data-image-id=\"605e03710275cb75416cb883\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616774003485-OYIT453UU1DRYIYYH1HX/HOF-74-MarcusAurelius-II.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“No matter how big a guy might be, Nicky would take him on. You beat Nicky with fists, he comes back with a bat. You beat him with a knife, he comes back with a gun. And you beat him with a gun, you better kill him, because he'll keep comin' back and back until one of you is dead.” —</em> From the film <em>Casino</em></p><p class=\"\"><em>“The condition of the people was pitiable to behold. They sickened by the thousands daily and died unattended and without help. Many died in the open street, others dying in their houses, made it known by the stench of their rotting bodies.”</em> — Giovanni Boccaccio</p><p class=\"\"><em>“If anyone can refute me—show me I’m making a mistake or looking at things from the wrong perspective—I’ll gladly change. It’s the truth I’m after, and the truth never harmed anyone. What harms us is to persist in self-deceit and ignorance.”</em> — Marcus Aurelius&nbsp;</p><p class=\"\"><em>“Everything can be taken from a man but one thing: the last of the human freedoms—to choose one’s attitude in any given set of circumstances, to choose one’s own way.”</em> — Viktor Frankl&nbsp;</p><p class=\"\"><em>“Severe to himself, indulgent to the imperfection of others, just and beneficent to all mankind.”</em> — Edward Gibbon&nbsp;</p><p class=\"\">Marcus Aurelius would have loved nothing better than studying philosophy for the rest of his days. Instead, destiny chose him to be the head of the Roman Empire. As a philosopher-emperor, Marcus turned to Stoicism to help him deal with more drama than any human being should have to deal with. Most of his children died before reaching adult age. Rome’s old rival, Parthia, engaged the empire in a brutal war for supremacy. Germanic tribes raided the frontier and invaded Italy. Marcus’ adoptive brother and co-emperor died early, leaving to Marcus the burden to lead the empire under dreadful circumstances. And then there was the pandemic… a terrifying plague that would kill large chunks of the population, cripple the economy, disrupt travel, and create a very well justified climate of fear. Marcus’ ability to navigate all this and more thanks to his philosophical practices enshrined his name among those of the best emperors Rome ever had.&nbsp;</p><p class=\"\">In this final episode of this series about him: the first time Rome is ruled by two emperors at the same time, the party animal that was Lucius Verus, persecuting Christians, war with Parthia, a con man with his glove puppet, the movie <em>Casino</em>, Robert Greene’s book <em>The 48 Laws of Power,</em> Romans reaching China, a deadly pandemic, snake gods & Tulsa Doom, great ideas and not-so-great ideas in <em>The Meditations</em>, the <em>Hagakure</em>, Viktor Frankl, Deepak Chopra vs. Joe Rogan, the Dread Pirate Roberts, Germanic invasions, rebellions, marrying your adoptive uncle who was once engaged to your mom, the strange case of Commodus, and much more.&nbsp;</p>",
  "media:content": {
    "media:title": "EPISODE 74: The Life of Marcus Aurelius (Part 2): Stoicism, Pandemic and War"
  }
}