{
  "id": "tag:blogger.com,1999:blog-17171206.post-6662749976207881997",
  "published": "2010-09-15T13:26:00.000-07:00",
  "updated": "2010-09-17T01:32:03.454-07:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "The end of the Age of Search?",
  "content": "A couple of days ago, there was an interesting <a href=\"http://www.nytimes.com/2010/09/13/technology/13search.html?_r=1\">article in the </a><a href=\"http://www.nytimes.com/2010/09/13/technology/13search.html?_r=1\">New York Times</a> on how social networks are changing the search experience. The truth is that the article is a bit confusing and mixes up several different issues. As a matter of fact, most of the article ends up being an introduction to <a href=\"http://www.hunch.com/\">Hunch</a>, a very interesting recommendation site (thus not \"search\") based on different technologies including social recommendations.<br /><br /><a href=\"http://hunch.com/media/img/graph-bg.png\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 367px; height: 220px;\" src=\"http://hunch.com/media/img/graph-bg.png\" alt=\"\" border=\"0\" /></a><br />I twitted the link to the article and presented it as another prove of the \"End of the Age of Search\". That got me into a very <a href=\"http://www.google.com/buzz/xavier.amatriain/TRHavZcgPte/xamat-social-recsys-and-the-end-of-the-Age-of\">interesting Buzz conversation</a> with <a href=\"http://glinden.blogspot.com/\">Greg Linden</a> on why I thought that the age of search is coming to an end. I promised that I would try to write a more elaborate post to make my point if I had the time... and here I am.<br /><br />The first time I read about the \"end of the age of search\" was in an article titled <a href=\"http://money.cnn.com/magazines/fortune/fortune_archive/2006/11/27/8394347/\">the race to create a smart Google</a> at CNN Money. As a matter of fact, the discussion on how recommender systems were going to render search engines obsolete was cited by Recsys 2009 organizers and turned into <a href=\"http://recsys.acm.org/2009\">their homepage</a> motto.<br /><br /><a href=\"http://4.bp.blogspot.com/_xAtUP4Gu6Zk/TJKiKSv6q8I/AAAAAAAAAIY/GPrnvZoNYkU/s1600/some-questions-cant-be-answered-by-google.jpg\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 320px; height: 257px;\" src=\"http://4.bp.blogspot.com/_xAtUP4Gu6Zk/TJKiKSv6q8I/AAAAAAAAAIY/GPrnvZoNYkU/s320/some-questions-cant-be-answered-by-google.jpg\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5517650791197486018\" border=\"0\" /></a><br />So, credit given to Jeffrey O'Brien at CNN Money and Recsys09 organizers, I picked up on this idea and have been elaborating it in several of my presentations. Two years ago, for instance, I gave a  presentation on <a href=\"http://www.slideshare.net/xamat/recommendations-as-the-future-of-search\">Recommendations as the Future of Search</a> in an open research day organized by our lab. The main story, that I have repeated several time since then, is the<br />following:<br /><story><br />\"<br />Think about it: Search is not an ultimate need for people. What people need is information. The fact that they have been using search and this has been so successful is (mainly) because that is the only tool we gave them.<br /><br />Search by itself is not enough to compensate the ever-growing information overload. First, there is the issue that for most given queries, you will get many more results than a user can ever go through. So you are faced with the problem of how to turn that huge set into the \"ten blue links\" (i.e. first results page). But, there are more or less smart ways to do so by taking into account context, user preferences and so on.<br /><br />The main issue, however, is a different one: every search action requires users to explicitly formulate a query. From our geek perspective, we usually forget how difficult it is for a regular user to formulate a query given an information need. Even if you are fairly proficient, it might be complicated to turn a fairly trivial information need into something you can formulate in a simple query (take a look at<a href=\"http://technocalifornia.blogspot.com/2010/07/being-social.html\"> the experiment</a> I did with some SIGIR attendees when I asked them to search for my daughter's name, which is actually written in <a href=\"http://xavier.amatriain.net/\">my homepage</a>).<br /><br />So, of course, the bottom line of my story has \"traditionally\" been that Recommender Systems represent a step forward since (a) they provide ways to assess relevance taking into account personal preferences and context, and (b) they can provide results without the need for explicit queries. I still believe Recommender Systems will have much to say in the way search is handled in the future. Of course, I work on the area, so you might think my opinion is a bit biased. But you don't have to take my word for it. In this year's <a href=\"http://www.eurospider.com/acm-sigir-industry-track-2010.html\">industry track at the SIGIR conference</a> both Yahoo and Google mentioned \"implicit search\" as one of the most important trends. Now I hear that Google's Schmidt is talking about <a href=\"http://musically.com/blog/2010/09/08/eric-schmidt-talks-google-music-autonomous-search-and-the-launch-of-google-tv-in-the-us-this-autumn/\">autonomous search</a>. They are all different ways of talking of <span style=\"font-weight: bold;\">Recommender Systems</span> (which maybe, as my friend @mramirez suggested, is not the sexiest name for a research/technology area).<br /></story>\"<br /><br />But, we have recently learned some data that can be used as a supporting evidence of the end of the Age of Search. Nielsen just published some results that show a <a href=\"http://blog.nielsen.com/nielsenwire/online_mobile/top-us-search-sites-for-july-2010/\">16% drop in web searches</a> over the last year. And this is something pretty symptomatic! I disagree with some of the comments in that same post by Nielsen saying that this drop is due to the use of mobile devices. Unfortunately, I cannot say that this is due to the huge success of recommender systems either. In my opinion, there is one main reason for this: <span style=\"font-weight: bold;\">Search is being replaced by Social Networks</span>.<br /><br /><a href=\"http://2.bp.blogspot.com/_xAtUP4Gu6Zk/TJKq64FCBGI/AAAAAAAAAIg/cMGt6oeM3mo/s1600/NielsenSearchEngines.png\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 473px; height: 200px;\" src=\"http://2.bp.blogspot.com/_xAtUP4Gu6Zk/TJKq64FCBGI/AAAAAAAAAIg/cMGt6oeM3mo/s320/NielsenSearchEngines.png\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5517660421944902754\" border=\"0\" /></a><br />If you think about it, most information needs users have are not about a particular and concrete piece of information such as \"who wrote War and Piece\". They are actually much less precise needs such as \"what is there to do this weekend\" or \"is there a cool music album I could listen to while I go to work tomorrow\". Or even things like \"what important stuff has happened in the world today\" or \"I need to find a job better than the one I have\". If you consider information needs like this, you will realize that the answer is much more likely to come out of your social network than out of an artificially formulated query.<br /><br />But not only that, I think we would agree that most of the time,  when people go into the Internet, they don't have any information need beyond the prototypical \"see what's up\" or \"catch up\". And what do they do? They log into Facebook or check Twitter. It is clear that in this cases, search is out of the picture.<br /><br />Yet another worrying trend for the future of search is the decrease in the use of the web browser and the increase of \"walled internet gardens\". This idea hit front lines last month with <a href=\"http://www.wired.com/magazine/2010/08/ff_webrip/all/1\">Chris Anderson's piece in Wired</a> and has been covered throughout, so I won't go into it (but this is the main reason I am trying to avoid the use of the word \"Web\" in favor of \"Internet\" in this post).<br /><br />As a finishing note, I don't want anybody to get the wrong impression that by talking about the end of search as the driver for web development, I am implying that search-oriented companies like Google is doomed. Of course not. Google know most of what is in this post as well as I do. As I mentioned, they are more and more talking about implicit or autonomous search as a proxy word for recommender systems. And in the case of social networks taking over search, I am pretty convinced they would agree with such a vision for the future. That is why they have been trying to get into the social scene so hard lately with Buzz, Wave... and more recently the rumors are that they are working in a Facebook killer called <a href=\"http://www.pcworld.com/article/205471/google_gets_serious_about_social_networking_is_google_me_coming_in_2010.html?tk=hp_new\">Google Me</a> or at least they are looking into adding more and more <a href=\"http://mashable.com/2010/09/15/google-social-networking/\">social features into their search engine</a>.<br /><br />Interesting times to be doing research in this area because as Search supremacy comes to an end, we will have more space to fill in the void with newer and much cooler ideas.<br /><br />As always... looking forward to your feedback.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Xavier Amatriain",
    "uri": "http://www.blogger.com/profile/14166119485952054870",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 11
}