{
  "author": {
    "name": "Martin Hiti, Claire Kramer Mills, and Asani Sarkar"
  },
  "title": "How Do Natural Disasters Affect U.S. Small Business Owners?",
  "link": "",
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=17983",
  "updated": "2022-09-06T11:35:36Z",
  "published": "2022-09-06T11:00:00Z",
  "category": [
    "",
    "",
    ""
  ],
  "summary": "Recent research has linked climate change and socioeconomic inequality (see <a href=\"https://www.newyorkfed.org/research/staff_reports/sr991.html\">here</a>, <a href=\"https://www.epa.gov/newsreleases/epa-report-shows-disproportionate-impacts-climate-change-socially-vulnerable\">here</a>, and <a href=\"https://medium.com/new-york-fed/insights-from-the-experts-extreme-heat-and-air-quality-3866c37ff6c9\">here</a>). But what are the effects of climate change on small businesses, particularly those owned by people of color, which tend to be more resource-constrained and less resilient? In a series of two posts, we use the Federal Reserve’s Small Business Credit Survey (<a href=\"https://www.fedsmallbusiness.org/\">SBCS</a>) to document small businesses’ experiences with natural disasters and how these experiences differ based on the race and ethnicity of business owners. This first post shows that small firms owned by people of color sustain losses from natural disasters at a disproportionately higher rate than other small businesses, and that these losses make up a larger portion of their total revenues. In the second post, we explore the ability of small firms to reopen and to obtain disaster relief funding in the aftermath of climate events. ",
  "content": "<p class=\"ts-blog-article-author\">Martin Hiti, Claire Kramer Mills, and Asani Sarkar</p>\n\n\n\n<figure class=\"lse-featured-image\">\n\t<img width=\"460\" height=\"288\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_460.jpg?w=460\" class=\"cover-image asset-image img-responsive wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_460.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_460.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_460.jpg?resize=768,481 768w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></figure>\n\n\n\n<p>Recent research has linked climate change and socioeconomic inequality (see <a href=\"https://www.newyorkfed.org/research/staff_reports/sr991.html\">here</a>, <a href=\"https://www.epa.gov/newsreleases/epa-report-shows-disproportionate-impacts-climate-change-socially-vulnerable\">here</a>, and <a href=\"https://medium.com/new-york-fed/insights-from-the-experts-extreme-heat-and-air-quality-3866c37ff6c9\">here</a>). But what are the effects of climate change on small businesses, particularly those owned by people of color, which tend to be more resource-constrained and less resilient? In a series of two posts, we use the Federal Reserve’s Small Business Credit Survey (<a href=\"https://www.fedsmallbusiness.org/\">SBCS</a>) to document small businesses’ experiences with natural disasters and how these experiences differ based on the race and ethnicity of business owners. This first post shows that small firms owned by people of color sustain losses from natural disasters at a disproportionately higher rate than other small businesses, and that these losses make up a larger portion of their total revenues. In the second post, we explore the ability of small firms to reopen and to obtain disaster relief funding in the aftermath of climate events. </p>\n\n\n\n<h4><strong>What Factors Contribute to Disaster Vulnerabilities?</strong></h4>\n\n\n\n<p>Disaster vulnerability, defined as the susceptibility to severe climate events, is <a href=\"https://www.apha.org/-/media/files/pdf/topics/climate/apha_climate_equity_introduction.ashx?la=en&hash=B40A6A0109D9C5474B7C7362176BEA9E9DFC16CC\">linked</a> to economic, social, and locational factors. For example, people of color and those with low incomes are <a href=\"https://www.frbsf.org/economic-research/wp-content/uploads/sites/4/Bakkensen_Ma_2020.pdf\">more likely</a> to reside in high-risk flood zones. And in states like Florida, a <a href=\"https://www.orlandoweekly.com/news/as-sea-levels-rise-florida-homes-at-higher-elevations-are-getting-more-expensive-14423956\">growing preference for high elevation</a> is increasing housing prices in areas with lower flood risk that were traditionally inhabited by people of color. To the extent that firms owned by people of color are more likely to be located in communities of color, these trends imply that they may be priced out of areas with lower climate risk.</p>\n\n\n\n<p>Disparities in the impact of natural disasters, among those who are exposed to them, are also related to existing inequalities.&nbsp;Practices like “redlining” have continued to keep home values in low-income and predominantly Black areas&nbsp;<a href=\"https://www.redfin.com/news/redlining-real-estate-racial-wealth-gap/\" target=\"_blank\" rel=\"noreferrer noopener\">lower</a>. This may reduce the capacity of communities to finance disaster-resilient infrastructure if, for example, government programs <a href=\"https://www.nytimes.com/2020/07/24/climate/houston-flooding-race.html\" target=\"_blank\" rel=\"noreferrer noopener\">favor areas with higher property values</a>&nbsp;in the allocation of disaster mitigation grants. Indeed, individuals living in formerly redlined districts—many of whom are people of color—remain vulnerable to&nbsp;<a href=\"https://www.redfin.com/news/redlining-flood-risk/\" target=\"_blank\" rel=\"noreferrer noopener\">greater flood risk</a>&nbsp;as compared to non-redlined districts.</p>\n\n\n\n<h4><strong>Are Small Businesses Owned by People of Color More Likely to Report Disaster-Related Losses?</strong></h4>\n\n\n\n<p>We use data from the SBCS for the period 2019-21 to document the impact of natural disasters on small businesses. The annual survey provides detailed information on the operations and financial conditions of businesses with fewer than 500 employees and records the demographics of firm owners. Notably, this information allows us to relate climate outcomes to race directly, rather than to the racial profile of geographic areas, as in some existing research.</p>\n\n\n\n<p>The 2019, 2020, and 2021 surveys included 9,315, 15,234, and 18,190 respondents, respectively. The natural disaster module of the survey asks respondents whether their business sustained any direct or indirect losses from a natural disaster in the past twelve months. The fraction of firms experiencing disaster-related losses rose from 7 percent in 2019 to 14&nbsp;percent in 2021 (see left panel of the chart below). The racial disparities in these losses increased as well. While there were few disparities in 2019, in 2021, 19 percent of Black-owned firms, 21 percent of Hispanic-owned firms, and 17 percent of Asian-owned firms reported disaster-related losses while only 12 percent of white-owned firms did (see right panel below). </p>\n\n\n\n<p>The incidence and racial disparity of losses appear to move together, a pattern that exists even outside our sample period. For example, in 2017 (a year with widespread hurricanes and severe storms), there were <a href=\"https://www.fedsmallbusiness.org/survey/2018/report-on-disaster-affected-firms\">large disparities</a> between Hispanic- and white-owned firms in reported losses among SBCS respondents.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Fraction of Firms with Losses and Disparities in Losses Have Both Increased since 2019</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_ch1.jpg?w=460\" alt=\"Two-panel trend chart showing the percentage of all firms with disaster-related losses on the left and the percentage of Asian-owned, Black-owned, Hispanic-owned, and white-owned firms with disaster-related losses on the right, from 2019 to 2021. Both the fraction of all firms with losses and the disparities in losses between white-owned and minority-owned firms increase over the period. \" class=\"wp-image-18110\" width=\"460\" height=\"283\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_ch1.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_ch1.jpg?resize=460,284 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_ch1.jpg?resize=768,473 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_series_climate-change_sarkar_ch1.jpg?resize=1536,947 1536w\" sizes=\"(max-width: 460px) 100vw, 460px\" /><figcaption>Source: Federal Reserve Banks, 2021, 2020, and 2019 Small Business Credit Surveys.<br><br>Notes: For respondents in each year and race/ethnicity category, the lines show the percentage of firms who answered yes to the question “Within the past 12 months, did your business sustain direct or indirect losses from a natural disaster other than COVID-19 (e.g., hurricane, wildfire, earthquake, etc.)?” A firm is considered Black-, Hispanic-, or Asian-owned if at least 51 percent of its equity stake is held by owners identifying with the group. A firm is defined as white-owned if at least 50 percent of its equity stake is held by non-Hispanic white owners. Race/ethnicity categories are not mutually exclusive. An observation is excluded from the sample if it is missing a response to the question or if the owner’s race is not observed. The sample pools employer and nonemployer firms. Responses by employer and nonemployer firms are weighted separately on a variety of firm characteristics to match the national population of employer and nonemployer firms, respectively. To construct a pooled weight, we use the employer (nonemployer) weight if the firm is an employer (nonemployer).</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Among those in disaster-related areas, more firms owned by people of color face damages than white-owned firms. We show this by focusing on the subsample of small businesses located in counties designated as disaster-affected by the Federal Emergency Management Agency (FEMA) in the period of the survey. We find that 24 percent of Black-owned firms, 23 percent of Hispanic-owned firms, and 22 percent of Asian-owned firms reported disaster-related losses in 2021, compared to 17 percent of white-owned firms.</p>\n\n\n\n<p>Existing disparities, such as the location of communities of color in <a href=\"https://www.scientificamerican.com/article/flooding-disproportionately-harms-black-neighborhoods/\">low-lying areas</a> with poor disaster-resilient investments, can vary within counties. Using county fixed effects regressions, we find that in 2021, Black-owned small businesses were 5 percentage points more likely than their white-owned counterparts to report disaster-related losses, supporting the disparity in climate effects even within relatively small geographic areas.</p>\n\n\n\n<h4><strong>Are Business Owners in Some States More Vulnerable to Disaster-Related Losses?</strong></h4>\n\n\n\n<p>States and cities located in the Southern U.S. are particularly <a href=\"https://nca2018.globalchange.gov/chapter/19/\">susceptible</a> to disasters, as they have older infrastructure and are disproportionately located in floodplains; as the map below shows, the fraction of firms reporting natural disaster-related losses in 2021 is especially high in states along the Gulf Coast. States in the Middle Atlantic (New Jersey and New York) and on the West Coast also have a high fraction of small businesses reporting disaster-related losses. In 2020 Census data, the states with the highest concentration of African Americans—Mississippi, Georgia, and Louisiana, and also Washington, D.C.—overlap with these high-risk areas. This suggests that businesses owned by people of color (also concentrated in these four localities, according to the SBCS) may be vulnerable due to their concentration in particularly susceptible states. When looking within <a href=\"https://www2.census.gov/geo/pdfs/maps-data/maps/reference/us_regdiv.pdf\">Census Divisions</a>, we find that a greater fraction of Black-owned firms report disaster-related losses than white-owned firms, and this disparity has increased between 2019 and 2021. Thus, regional disparities have increased pari passu with national disparities.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Fraction of Firms Reporting Disaster-Related Losses by State, 2021</p>\n\n\n\n<div style=\"height:10px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1840\" height=\"1179\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_map-1.jpg?w=449\" alt=\"Heat map showing the fraction of firms reporting disaster-related losses, by state, in 2021. States along the Gulf Coast are shown as having the highest fraction of firms that suffered losses. States in the Northeast and on the West Coast also show high fractions.\" class=\"wp-image-18062\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_map-1.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_map-1.jpg?resize=460,295 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_map-1.jpg?resize=768,492 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_map-1.jpg?resize=449,288 449w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_map-1.jpg?resize=1536,984 1536w\" sizes=\"(max-width: 1840px) 100vw, 1840px\" /><figcaption>Source: Federal Reserve Banks, 2021 Small Business Credit Survey.<br><br>Notes: The heat map shows the fraction of firms in a given state that answered yes to the question “Within the past 12 months, did your business sustain direct or indirect losses from a natural disaster other than COVID-19 (e.g., hurricane, wildfire, earthquake, etc.)?” All observations that are missing a response to the question are excluded from the sample. The sample pools employer and nonemployer firms. Responses by employer and nonemployer firms are weighted separately on a variety of firm characteristics to match the national population of employer and nonemployer firms, respectively. To construct a pooled weight, we use the employer (nonemployer) weight if the firm is an employer (nonemployer). The survey was fielded September-November 2021.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h4><strong>Do Firms Owned by People of Color Suffer Larger Disaster-Related Losses?</strong></h4>\n\n\n\n<p>The 2020 and 2021 surveys ask respondents that report disaster-related losses to estimate the value of those losses. We note that, since responses are voluntary (with 78 percent of eligible respondents opting in), firms with lower losses may be less likely to complete the climate-related questions, implying an upward bias in the reported losses. However, there is no reason to think that less-impacted firms owned by people of color are more likely to skip these questions than less-impacted white-owned firms.</p>\n\n\n\n<p>We normalize these losses as a percentage of a firm’s total revenue in the year prior. Because people of color faced greater revenue losses as a result of the COVID-19 pandemic, we rely on disaster-loss data from the 2020 survey, which is normalized by total revenues from 2019, before the onset of the pandemic.</p>\n\n\n\n<p>For most small businesses of color, disaster-related losses were a large share of their revenues. For example, 20 percent of Black-owned businesses reported losses that amount to more than 60 percent of 2019 revenue, while just 4 percent of such firms had losses of 0-5 percent of 2019 revenue (see chart below). In contrast, for most white-owned businesses, disaster-related losses were a relatively small share of revenues. For example, 25 percent of white-owned firms experienced disaster-related losses of 0-5 percent of 2019 revenue and 39 percent had losses of 5-30 percent, while only 13 percent had losses of more than 60&nbsp;percent of total revenue.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Black-Owned Firms Have Higher Revenue Shares of Disaster-Related Losses</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_ch2-1.jpg?w=418\" alt=\"This Liberty Street Economics bar chart shows disaster-related losses as a share of revenue for Black-owned firms and white-owned firms, using 2020 revenue losses normalized by total revenue in 2019. It shows larger shares of white-owned firms than Black-owned firms with losses of 0-5% and 5-30%, and larger shares of Black-owned firms than white-owned firms with losses of 30-60% and more than 60%.\" class=\"wp-image-18020\" width=\"463\" height=\"318\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_ch2-1.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_ch2-1.jpg?resize=460,317 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_ch2-1.jpg?resize=768,529 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_ch2-1.jpg?resize=418,288 418w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/LSE_2022_series_climate-change_sarkar_ch2-1.jpg?resize=1536,1058 1536w\" sizes=\"(max-width: 463px) 100vw, 463px\" /><figcaption>Source: Federal Reserve Banks, 2020 Small Business Credit Survey.<br><br>Notes: Among firms that reported disaster-related losses, the 2020 SBCS asks “What is the estimated value of your business&#8217;s losses as a result of the natural disaster?” Respondents can select from six categories. Firms are also asked to report their total revenues from 2019 by selecting from eight ranges. To compute the normalized revenue loss, we divide the midpoint of the disaster-related losses range by the midpoint of the firm’s revenue range. The normalized losses are grouped into four bins, which are shown on the x-axis. The bars show the percentage of firms in each race/ethnicity category with normalized disaster-related losses in a given bin. A firm is considered Black-owned if at least 51 percent of its equity stake is held by owners identifying as Black. A firm is defined as white-owned if at least 50 percent of its equity stake is held by non-Hispanic white owners. Race/ethnicity categories are not mutually exclusive. An observation is excluded from the sample if it is missing a response to the question or if owner race is not observed. The sample pools employer and nonemployer firms. Responses by employer and nonemployer firms are weighted separately on a variety of firm characteristics to match the national population of employer and nonemployer firms, respectively. To construct a pooled weight, we use the employer (nonemployer) weight if the firm is an employer (nonemployer). The survey was fielded September-October 2020.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>It is important to note that, when we compare disaster-related losses on a dollar basis, rather than as a percentage of revenues, there is little evidence of racial disparities. This suggests that our result is driven by the lower revenues of Black-owned firms, implying that natural disasters are a greater burden for firms owned by people of color through their interaction with existing racial disparities that have a negative effect on small business revenues. For example, relative to white-owned firms, Black-owned businesses are <a href=\"https://www.brookings.edu/essay/to-expand-the-economy-invest-in-black-businesses/\">younger</a>, have less access to <a href=\"https://economics.yale.edu/sites/default/files/files/Workshops-Seminars/Labor-Public/fairlie-031107.pdf\">startup capital</a>, <a href=\"https://www.brookings.edu/essay/to-expand-the-economy-invest-in-black-businesses/\">employ fewer people,</a> have a harder time <a href=\"https://www.fedsmallbusiness.org/medialibrary/FedSmallBusiness/files/2022/2022-sbcs-firms-owned-by-people-of-color\">accessing credit</a>, and lack <a href=\"https://www.journals.uchicago.edu/doi/10.1086/510763\">experience in family businesses</a>—all of which are associated with lower revenues.&nbsp;</p>\n\n\n\n<h4><strong>Looking Ahead</strong></h4>\n\n\n\n<p>Our findings suggest that small businesses owned by people of color and located in particular geographic areas are especially vulnerable to natural disasters. Moreover, these disparities have increased over the three years in our sample, in tandem with the <a href=\"https://www.climate.gov/news-features/blogs/beyond-data/2021-us-billion-dollar-weather-and-climate-disasters-historical\">frequency and severity of disaster events</a>. These disparate outcomes are likely to be closely linked to the broader challenges faced by small businesses of color in <a href=\"https://www.clevelandfed.org/newsroom-and-events/publications/economic-commentary/2022-economic-commentaries/ec-202204-access-to-credit-for-small-and-minority-owned-businesses.aspx#:~:text=Minority%2Downed%20businesses%20(with%20the,minority%2Downed%20businesses%20in%202020.\">accessing credit</a> as well as to underinvestment in climate infrastructure in areas where low-income and high-minority communities live. As such, addressing these challenges may prove especially effective in ameliorating disparities in climate outcomes. In our next post, we examine the resources that small businesses can rely on to cope with losses following disasters, such as access to disaster relief.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-bio-contact\">Martin Hiti was a summer research intern in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"722\" height=\"722\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/mills_claire.jpg?w=288\" alt=\"\" class=\"wp-image-18059 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/mills_claire.jpg 722w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/mills_claire.jpg?resize=45,45 45w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/mills_claire.jpg?resize=460,460 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/08/mills_claire.jpg?resize=288,288 288w\" sizes=\"(max-width: 722px) 100vw, 722px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\">Claire Kramer Mills is a Communication Development Research Manager in the Federal Reserve Bank of New York’s Communications and Outreach Group.</p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/sarkar_asani.jpg?w=90\" alt=\"Photo: portrait of Asani Sarkar\" class=\"wp-image-16597 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/sarkar_asani.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/sarkar_asani.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/sarkar\" target=\"_blank\">Asani Sarkar</a> is a financial research advisor in Non-Bank Financial Institution Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-disclaimer\">\n    <strong>How to cite this post:</strong><br/>\n    Martin Hiti, Claire Kramer Mills, and Asani Sarkar, &#8220;How Do Natural Disasters Affect U.S. Small Business Owners?,&#8221; Federal Reserve Bank of New York <em>Liberty Street Economics</em>, September 6, 2022, https://libertystreeteconomics.newyorkfed.org/2022/09/how-do-natural-disasters-affect-u-s-small-business-owners/.</p>\n</p>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/09/small-business-recovery-after-natural-disasters/\">Small Business Recovery after Natural Disasters</a><br><a href=\"https://www.fedsmallbusiness.org/survey\">Small Business Credit Survey</a><br><a href=\"https://www.newyorkfed.org/research/heterogeneity-series\">Economic Inequality: A Research Series</a><br></p>\n\n\n\n<p></p>\n\n\n\n<div>\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n</div>\n"
}