{
  "title": "5 smart ways to decarbonise supply chains and logistics with AI",
  "link": "https://e27.co/five-smart-ways-to-decarbonise-supply-chains-and-logistics-with-ai-20221027/",
  "dc:creator": "Dhruv Agrawal",
  "pubDate": "Mon, 31 Oct 2022 02:00:17 +0000",
  "category": [
    "Artificial Intelligence",
    "Climate Tech & Sustainability",
    "Community",
    "Logistics/Suppy Chain",
    "Climate tech",
    "Logistics",
    "Shipsy"
  ],
  "guid": "https://e27.co/?p=474893",
  "description": "<p>Global supply chains are in desperate need of building agile and resilient operations. A series of disruptions during the last two years reveals many shortcomings of complicated and archaic systems. However, erratic weather patterns and rising mercury levels bring our attention to a critical issue. Climate crisis and the need for green logistics Climate impact [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/five-smart-ways-to-decarbonise-supply-chains-and-logistics-with-ai-20221027/\">5 smart ways to decarbonise supply chains and logistics with AI</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-475108 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/e27-24.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p>Global supply chains are in desperate need of building agile and resilient operations. A series of disruptions during the last two years reveals many shortcomings of complicated and archaic systems. However, erratic weather patterns and rising mercury levels bring our attention to a critical issue.</p>\n<h1>Climate crisis and the need for green logistics</h1>\n<p>Climate impact has put many countries at risk, especially Southeast Asia, with most of its area lying in coastal regions and lowlands. The <u><a rel=\"follow\" href=\"https://www.amnesty.org.uk/philippines-country-most-risk-climate-crisis\">Philippines and Indonesia</a></u> are especially vulnerable to tropical storms and rising sea levels.</p>\n<p>As per Statista, the APAC region produced <u><a rel=\"follow\" href=\"https://www.statista.com/statistics/205966/world-carbon-dioxide-emissions-by-region/\">17.74 billion metric tons</a></u> of CO<sub>2</sub> in 2021, more than the combined emissions of all regions. But there’s more to it than just ecological risk. Southeast Asia’s historical lag in climate action and policy-making <u><a rel=\"follow\" href=\"https://www.adb.org/sites/default/files/publication/684891/adbi-wp1223.pdf\">could shrink its economy by 11 per cent by the end of the century</a></u>.</p>\n<p>Transportation accounts for 24 per cent of global CO<sub>2</sub> emissions, and 30 per cent comes from trucks carrying freight. Much needs to be done by each Southeast Asian country to offset climate change and take collective steps toward a more sustainable supply chain.</p>\n<p>While there is consensus to make supply chains more green, as <a rel=\"follow\" href=\"https://www.iseas.edu.sg/wp-content/uploads/2021/09/Southeast-Asia-Climate-Outlook-2021-Survey-Report.pdf\">78.7 per cent</a> of Southeast Asian countries believe this can help reduce carbon emissions, the proactive action has not quite materialised.</p>\n<h2>Walking the talk: Enabling green logistics through digitisation</h2>\n<p>Green logistics facilitates sustainable logistics operations by reducing energy consumption or using alternative energy sources for logistics processes across various logistics legs. For instance, using an electric fleet for deliveries could significantly curb carbon footprint.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/wavemaker-impact-bill-gates-firm-temasek-set-up-agritech-firm-20221027/\">Wavemaker Impact, Bill Gates’s VC arm, Temasek launch startup to decarbonise rice cultivation in Asia</a></strong></p>\n<p>Order consolidation is another way to reduce emissions by bundling multiple orders from the same customer into one carton so they can be delivered on a single trip. This also lowers the consumption of cardboard, bubble wrap, foam peanuts, air pillows, and other packaging materials.</p>\n<p>So what else can logistics-powered businesses do to execute green deliveries?</p>\n<p>Well, embedding climate-conscious practices while building digital tools can reduce environmental impact and raise business efficiency.</p>\n<p>Here’s how smart logistics management platforms can help:</p>\n<h2>Optimising routes to curb carbon footprint</h2>\n<p>A smart logistics management platform digitises product journeys, allowing businesses to gauge areas where logistical inefficiencies can be tamed. Digital documentation eliminates paper trails. AI and ML-powered route planning and optimisation engines chalk the most efficient travel route across multiple touchpoints throughout logistics operations.</p>\n<p>Efficient routes result in lesser time spent on the road. This is critical to curbing the last mile inefficiencies, a pain point of<u><a rel=\"follow\" href=\"https://soti.net/industries/transportation-and-logistics/mobility-report/\"> 61 per cent of transportation</a></u> and logistics organisations globally. Dynamic route optimisers help eliminate empty miles, reduce the distance travelled by five per cent, prevent vehicle idling, and lower trip volumes by six per cent.</p>\n<p>By extending predictive visibility in terms of ETAs, real-time tracking of delivery progress, and flexible deliveries that allow customers to reschedule the delivery to their preferred time slots, logistics stakeholders will maximise the success rate of the first attempt delivery and reduce multiple attempts, trip volumes and CO2 emissions.</p>\n<p>Intelligent logistics solutions also allow delivery managers to configure and prioritise eco-friendly modes of transportation for short-distance deliveries. Leveraging this pre-fed logic, the system auto-allocates bicycles, EVs, or autonomous vehicles to execute deliveries within a small radius.</p>\n<h2>Enhancing address quality to reduce returns</h2>\n<p>Poor quality addresses or drivers’ inability to navigate to the customer location on time is a big concern for businesses. This is because it leads to greater fuel consumption and CO2 emissions. Moreover, 51 per cent of shoppers go for returns if their order doesn&#8217;t arrive on time, which puts all the logistical efforts to waste.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/as-the-demand-for-energy-soars-climate-tech-is-here-to-save-the-day-20220616/\">As the demand for energy soars, climate tech is here to save the day</a></strong></p>\n<p>Geocoding helps convert poor-quality addresses into exact coordinates. This shows up as a clear polyline on the driver’s mobile app leading them to the exact customer location.</p>\n<h2><strong>Improving capacity utilisation</strong></h2>\n<p>Another method to enhance delivery performance is automating capacity planning. AI-powered logistics management tools leverage intelligent algorithms that seamlessly club consignment and vehicle data.</p>\n<p>They can optimise a vehicle’s capacity by considering parameters such as delivery location, weight, volume, time SLAs, storage type, etc., which helps improve fleet capacity without hampering mileage or vehicle life as it runs on optimum load. It thereby increases vehicle capacity utilisation by <a rel=\"follow\" href=\"https://shipsy.io/route-optimization-and-planning/\">31 per cent</a>.</p>\n<h2><strong>Clubbing orders to reduce trip volumes</strong></h2>\n<p>AI-driven logistics management platforms improve delivery productivity by enabling multi-stop pickups and deliveries for drivers on a single trip. En route order clubbing smartly combines pickups and drops to reduce trip frequencies and improve driver productivity by <a rel=\"follow\" href=\"https://shipsy.io/qsr/\">14 per cent</a>.</p>\n<h2><strong>Drive sustainable cross-border logistics</strong></h2>\n<p>Smart logistics management platforms help cross-border logistics stakeholders gain visibility of a shipment&#8217;s carbon emissions even before it commences its shipping journey by gaining critical knowledge of tank-to-wheel and well-to-wheel CO2 emissions. Intuitive sustainability dashboards help logistics stakeholders monitor emissions across a shipment&#8217;s lifecycle and unearth areas that need immediate attention.</p>\n<p>Such platforms empower businesses to reduce miles travelled, shrink returns, eliminate empty miles and vehicle idling, and enable greater rider productivity. By using technology-powered logistics strategies, businesses can reduce shipment returns by 18 per cent.</p>\n<p>Three factors will drive businesses in SEA to channel greater focus on sustainability, global and UN regulations around emissions, cost optimisation, and a push from customers.</p>\n<p>By embracing smart technologies, businesses can also play a vital role in making a positive long-term ecological impact. Simultaneously, it also ensures customer expectations are met and business costs are lower while saving the planet, one delivery at a time.</p>\n<p>&#8211;</p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image credit: 123rf-<a class=\"ImageDetails__information--link\" rel=\"follow\" href=\"https://www.123rf.com/profile_malp\">malp</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/five-smart-ways-to-decarbonise-supply-chains-and-logistics-with-ai-20221027/\">5 smart ways to decarbonise supply chains and logistics with AI</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}