{
  "title": "How Flyback Rocket Boosters Got Off the Ground",
  "link": "https://spectrum.ieee.org/how-flyback-rocket-boosters-got-off-the-ground",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-rocket-booster-landing-on-a-landing-pad.png?id=29571732&width=1200&height=800&coordinates=0%2C294%2C0%2C295\"/><br/><br/><p><strong>In the popular</strong> conception of a technological breakthrough, a flash of genius is followed quickly by commercial or industrial success, public acclaim, and substantial wealth for a small group of inventors and backers. In the real world, it almost never works out that way. </p><p>Advances that seem to appear suddenly are often backed by decades of development. Consider <a href=\"https://www.thoughtco.com/steam-engines-history-1991933#:~:text=The%20high%2Dpressure%20steam%20expands,creating%20motion%20for%20the%20locomotive.\" target=\"_blank\">steam engines</a>. Starting in the second quarter of the 19th century they began powering trains, and they soon revolutionized the transportation of people and goods. But steam engines themselves had been invented at the beginning of the <em>18th</em> century. For 125 years they had been used to <a href=\"https://www.farmanddairy.com/columns/earliest-steam-engines-used-to-pump-water/549187.html\" target=\"_blank\">pump water out of mines</a> and then to power the mills of the Industrial Revolution.</p><hr/><p>Lately we’ve become accustomed to seeing rocket boosters return to Earth and then land vertically, on their tails, ready to be serviced and flown again. (Much the same <a href=\"https://www.youtube.com/watch?v=TdSxDNnqRlo\" target=\"_blank\">majestic imagery</a> thrilled sci-fi moviegoers in the 1950s.) Today, both SpaceX and Blue Origin are using these techniques, and a third startup, Relativity Space, is on the verge of joining them. Such reusable rocketry is already cutting the cost of access to space and, with other advances yet to come, will help make it possible for humanity to return to the moon and eventually to travel to Mars. </p><p>Vertical landings, too, have a long history, with the same ground being plowed many times by multiple research organizations. From 1993 to 1996 a booster named DCX, for <a href=\"https://www.nmspacemuseum.org/inductee/experimental-delta-clipper/\" target=\"_blank\">Delta Clipper</a> Experimental, took off and landed vertically eight times at White Sands Missile Range. It flew to a height of only 2,500 meters, but it successfully negotiated the very tricky dynamics of landing a vertical cylinder on its end. </p><p>The key innovations that made all this possible happened 50 or more years ago. And those in turn built upon the <a href=\"https://www.history.com/this-day-in-history/first-liquid-fueled-rocket\" target=\"_blank\">invention a century ago of liquid-fueled rockets</a> that can be throttled up or down by pumping more or less fuel into a combustion chamber. </p><p>In August 1954 the Rolls-Royce Thrust Measuring Rig, also known as the “flying bedstead,” took off and landed vertically while carrying a pilot. The <a href=\"http://www.aviastar.org/air/england/rollsroyce_bedstead.php\" target=\"_blank\">ungainly contraption</a> had two downward-pointing Rolls-Royce jet engines with nozzles that allowed the pilot to vector the thrust and control the flight. By 1957 another company, Hawker Siddeley, started work on turning this idea into a vertical take-off and landing (VTOL) fighter jet. It first flew in 1967 and entered service in 1969 as the Harrier Jump Jet, with new Rolls-Royce engines specifically designed for thrust vectoring. Thrust vectoring is a critical component of control for all of today’s reusable rocket boosters. </p><p>During the 1960s another rig, also nicknamed the flying bedstead, was developed in the United States for training astronauts to land on the moon. There was a gimbaled rocket engine that always pointed directly downward, providing thrust equal to five-sixths of the vehicle and the pilot’s weight, simulating lunar gravity. The pilot then controlled the thrust and direction of another rocket engine to land the vehicle safely. </p><p>It was not all smooth flying. Neil Armstrong first flew the trainer in March 1967, but he was nearly killed in May 1968 when <a href=\"https://youtu.be/tUJDbj9Vp5w\" target=\"_blank\">things went awry</a> and he had to use the ejection seat to rocket to safety. The parachute deployed and he hit the ground just 4 seconds later. Rocket-powered vertical descent was harder than it looked. </p><p class=\"pull-quote\">Vertical rocket landings have a long history, with the same ground being plowed many times by multiple research organizations.</p><p>Nevertheless, between 1969 and 1972, Armstrong and then five other astronauts piloted lunar modules to vertical landings on the moon. There were no ejection seats, and these have been the only crewed rocket-powered landings on a spaceflight. All other humans lofted into space have used Earth’s atmosphere to slow down, combining heat shields with either wings or parachutes. </p><p>In the early days of Blue Origin, the company returned to the flying-bedstead approach, and its vehicle took off and landed successfully in March 2005. It was powered by four jet engines, once again from Rolls-Royce, bought secondhand from the South African Air Force. Ten years later, in November 2015, Blue Origin’s New Shepard booster reached an altitude of 100 kilometers and then <a href=\"https://www.youtube.com/watch?v=9pillaOxGCo\" target=\"_blank\">landed vertically</a>. A month later SpaceX had its first successful vertical landing of a Falcon-9 booster. </p><p>Today’s reusable, or flyback, boosters also use something called grid fins, those honeycombed panels sticking out perpendicularly from the top of a booster that guide the massive cylinder as it falls through the atmosphere unpowered. The fins have an even longer history, as they have been part of every crewed <a href=\"https://space.stackexchange.com/questions/22425/what-are-the-grid-fins-on-the-soyuz-escape-system-used-for\" target=\"_blank\">Soyuz</a> launch since the 1960s. They guide the capsule back to Earth if there’s an abort during the climb to orbit. They were last used in October 2018 when a Soyuz failed at 50 km up. The cosmonaut and astronaut who were aboard landed safely and had a successful launch in another Soyuz five months later. </p><p>The next big accomplishment will be crewed vertical landings, 50 years after mankind's last one, on the moon. It will almost certainly happen before this decade is out. </p><p>I’m less confident that we’ll see general-purpose quantum computers and abundant electricity from nuclear fusion in that time frame. But I’m pretty sure we’ll eventually get there with both. The arc of technology development is often long. And sometimes, the longer it is, the more revolutionary it is in the end.</p><p><em>This article appears in the April 2022 print issue as “The Long Road to Overnight Success .”</em></p>",
  "pubDate": "Mon, 21 Mar 2022 20:27:59 +0000",
  "guid": "https://spectrum.ieee.org/how-flyback-rocket-boosters-got-off-the-ground",
  "category": [
    "Human space flight",
    "Reusable rocket boosters",
    "Spacex",
    "Blue origin",
    "Reusable rockets"
  ],
  "dc:creator": "Rodney Brooks",
  "media:content": ""
}