{
  "id": "tag:blogger.com,1999:blog-37798047.post-4008232982979402236",
  "published": "2021-04-29T04:09:00.005-04:00",
  "updated": "2021-04-29T15:19:19.634-04:00",
  "title": "Anatomy of how you get pwned",
  "content": "<p>Today, somebody had a problem: they kept seeing a popup on their screen, and obvious scam trying to sell them McAfee anti-virus. Where was this coming from?</p><p>In this blogpost, I follow this rabbit hole on down. It starts with \"search engine optimization\" links and leads to an entire industry of tricks, scams, exploiting popups, trying to infect your machine with viruses, and stealing emails or credit card numbers.</p><p>Evidence of the attack first appeared with occasional popups like the following. The popup isn't part of any webpage.</p><p><br /></p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-wCXE5Dvamu4/YIo9rD-3UQI/AAAAAAAAGis/cB_vv3sHRQw19AozBJBhtoCrWoPvzs_WACLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"180\" data-original-width=\"542\" height=\"106\" src=\"https://lh3.googleusercontent.com/-wCXE5Dvamu4/YIo9rD-3UQI/AAAAAAAAGis/cB_vv3sHRQw19AozBJBhtoCrWoPvzs_WACLcBGAsYHQ/w320-h106/image.png\" width=\"320\" /></a></div><br /><br /></div><p>This is obviously a trick. But from where? How did it \"get on the machine\"?</p><p></p><p>There's lots of possible answers. But the most obvious answer (to most people), that your machine is infected with a virus, is likely wrong. Viruses are generally silent, doing evil things in the background. When you see something like this, you aren't infected ... yet.</p><p>Instead, things popping with warnings is almost entirely due to evil websites. But that's confusing, since this popup doesn't appear within a web page. It's off to one side of the screen, nowhere near the web browser.</p><p>Moreover, we spent some time diagnosing this. We restarted the webbrowser in \"troubleshooting mode\" with all extensions disabled and went to a clean website like Twitter. The popup still kept happening.</p><p>As it turns out, he had another windows with Firefox running under a different profile. So while he cleaned out everything in this one profile, he wasn't aware the other one was still running</p><p>This happens a lot in investigations. We first rule out the obvious things, and then struggle to find the less obvious explanation -- when it was the obvious thing all along.</p><p>In this case, the reason the popup wasn't attached to a browser window is because it's a new type of popup notification that's suppose to act more like an app and less like a web page. It has a hidden web page underneath called a \"service worker\", so the popups keep happening when you think the webpage is closed.</p><p>Once we figured the mistake of the other Firefox profile, we quickly tracked this down and saw that indeed, it was in the Notification list with Permissions set to Allow. Simply changing this solved the problem.</p><p><a href=\"https://lh3.googleusercontent.com/-cLlC4gu6MV4/YIpPnQuTA1I/AAAAAAAAGjY/ROjVt-Kq68IdV9UUl28wk5Lu-QiRBlRJgCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em; text-align: center;\"><img alt=\"\" data-original-height=\"687\" data-original-width=\"964\" height=\"228\" src=\"https://lh3.googleusercontent.com/-cLlC4gu6MV4/YIpPnQuTA1I/AAAAAAAAGjY/ROjVt-Kq68IdV9UUl28wk5Lu-QiRBlRJgCLcBGAsYHQ/image.png\" width=\"320\" /></a></p><p>Note that the above picture of the popup has a little wheel in the lower right. We are taught not to click on dangerous thing, so the user in this case was avoiding it. However, had the user clicked on it, it would've led him straight here to the solution. I can't recommend you click on such a thing and trust it, because that means in the future, malicious tricks will contain such safe looking icons that aren't so safe.</p><p>Anyway, the next question is: which website did this come from?</p><p>The answer is Google.</p><p>In the news today was the story of the Michigan guys who tried to kidnap the governor. The user googled \"<a href=\"http://google.com/search?q=attempted+kidnap+sentencing+guidelines\">attempted kidnap sentencing guidelines</a>\". This search produced a page with the following top result:</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-zNoi1QzqBQs/YIpKnuFrkQI/AAAAAAAAGi0/gP0MgB2amZcnIGf_s3AsYKQQ9HxcmWGPgCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"676\" data-original-width=\"1159\" height=\"187\" src=\"https://lh3.googleusercontent.com/-zNoi1QzqBQs/YIpKnuFrkQI/AAAAAAAAGi0/gP0MgB2amZcnIGf_s3AsYKQQ9HxcmWGPgCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />Google labels this a \"featured snippet\". This isn't an advertisement, not a \"promoted\" result. But it's a link that Google's algorithms thinks is somehow more worthy than the rest.<div><br /></div><div>This happened because hackers tricked Google's algorithms. It's been a constant cat and mouse game for 20 years, in an industry known as \"search engine optimization\" or SEO. People are always trying to trick google into placing their content highest, both legitimate companies and the quasi-illegitimate that we see here. In this case, they seem to have succeeded.</div><div><br /></div><div>The way this trick works is that the hackers posted a PDF instead of a webpage containing the desired text. Since PDF documents are much less useful for SEO purposes, google apparently trusts them more.</div><div><br /></div><div>But the hackers have found a way to make PDFs more useful. They designed it to appear like a webpage with the standard CAPTCHA. You click anywhere on the page such as saying \"I'm not robot\", and it takes you to the real webstie.</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-o9FNaQAl4DQ/YIpMwfoPpcI/AAAAAAAAGi8/kBgDjWZChqIuw6R-zPBQyic99WojcIRnwCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"676\" data-original-width=\"1159\" height=\"187\" src=\"https://lh3.googleusercontent.com/-o9FNaQAl4DQ/YIpMwfoPpcI/AAAAAAAAGi8/kBgDjWZChqIuw6R-zPBQyic99WojcIRnwCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br /><br /><p>But where is the text I was promised in the Google's search result? It's there, behind the image. PDF files have layers. You can put images on top that hides the text underneath. Humans only see the top layer, but google's indexing spiders see all the layers, and will index the hidden text. You can verify this by downloading the PDF and using tools to examine the raw text:</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-o52B9kwn09I/YIpNdzkm-gI/AAAAAAAAGjE/asg9ALeq3843N4VrdCbb5KrW4-dNgQ1awCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"663\" data-original-width=\"1000\" height=\"212\" src=\"https://lh3.googleusercontent.com/-o52B9kwn09I/YIpNdzkm-gI/AAAAAAAAGjE/asg9ALeq3843N4VrdCbb5KrW4-dNgQ1awCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />If you click on the \"I am not robot\" in the fake PDF, it takes you to a page like the following:<p></p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-4uPgGGpLtBQ/YIpNp1F-QcI/AAAAAAAAGjI/NetGdIyJfIQsFfS5Ia9hXgXVD87nA4U7wCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"471\" data-original-width=\"913\" height=\"165\" src=\"https://lh3.googleusercontent.com/-4uPgGGpLtBQ/YIpNp1F-QcI/AAAAAAAAGjI/NetGdIyJfIQsFfS5Ia9hXgXVD87nA4U7wCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />Here's where the \"hack\" happened. The user misclicked on \"Allow\" instead of \"Block\" -- accidentally. Once they did that, popups started happening, even when this window appeared to go away.</div><div><br /></div><div>The lesson here is that \"misclicks happen\". Even the most knowledgeable users, the smartest of cybersecurity experts, will eventually misclick themselves.</div><div><p>As described above, once we identified this problem, we were able to safely turn off the popups by going to Firefox's \"Notification Permissions\".</p><p>Note that the screenshots above are a mixture of Firefox images from the original user, and pictures of Chrome where I tried to replicate the attack in one of my browsers. I didn't succeed -- I still haven't been able to get any popups appearing on my computer.</p><p>So I tried a bunch of different browsers: Firefox, Chrome, and Brave on both Windows and macOS.</p><p>Each browser produced a different result, a sort of A/B testing based on the User-Agent (the string sent to webservers that identifies which browser you are using). Sometime following the hostile link from that PDF attempted to install a popup script in our original example, but sometimes it tried something else.</p><p>For example, on my Firefox, it tried to download a ZIP file containing a virus:</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-uirAyTE8-mc/YIpS9EuIABI/AAAAAAAAGjw/CHZ-KHPpgdcujRlukNbOEHaHkOq-9RLngCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"637\" data-original-width=\"996\" height=\"205\" src=\"https://lh3.googleusercontent.com/-uirAyTE8-mc/YIpS9EuIABI/AAAAAAAAGjw/CHZ-KHPpgdcujRlukNbOEHaHkOq-9RLngCLcBGAsYHQ/image.png\" width=\"320\" /></a></div></div><p><br /></p>When I attempt to download, Firefox tells me it's a virus -- probably because Firefox knows the site where it came from is evil.<div><br /></div><div>However, Microsoft's free anti-virus didn't catch it. One reason is that it comes as an <i>encrypted zip</i>&nbsp;file. In order to open the file, you have to first read the unencrypted text file to get the password -- something humans can do but anti-virus products aren't able to do (or at least, not well).</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-Z29HYaHuWBY/YIpU3aS78oI/AAAAAAAAGj8/XGdJDHQKKCYk8rCJhwqZT0gnCsJhnc4fgCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"431\" data-original-width=\"1016\" height=\"136\" src=\"https://lh3.googleusercontent.com/-Z29HYaHuWBY/YIpU3aS78oI/AAAAAAAAGj8/XGdJDHQKKCYk8rCJhwqZT0gnCsJhnc4fgCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />So I opened the password file to get the password (\"257048169\") and extracted the virus. This is mostly safe -- as long as I don't <i>run</i> it. Viruses are harmless sitting on your machine as long as they aren't running. I say \"mostly\" because even for experts, \"misclicks happen\", and if I'm not careful, I may infect my machine.</div><div><br /></div><div>Anyway, I want to see what the virus actually is. The easiest way to do that is <a href=\"https://www.virustotal.com/gui/file/aefeb01a28379d3ac99576317a86ba58e6960dccb53792b7010bd1f471914169/detection\">upload it to VirusTotal</a>, a website that runs all the known anti-virus programs on a submission to see what triggers what. It tells me that somebody else uploaded the same sample 2 hours ago, and that a bunch of anti-virus vendors detect it, with the following names:</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-RiPMxgzY91A/YIpV4-qPxPI/AAAAAAAAGkI/4DTMZ1Myfisu52DS_Zh8JiQ3Q9BUmhIQwCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"911\" data-original-width=\"1273\" height=\"229\" src=\"https://lh3.googleusercontent.com/-RiPMxgzY91A/YIpV4-qPxPI/AAAAAAAAGkI/4DTMZ1Myfisu52DS_Zh8JiQ3Q9BUmhIQwCLcBGAsYHQ/image.png\" width=\"320\" /></a></div></div><div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">With VirusTotal, you can investigate why anti-virus products think it may be a virus.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">For example, anti-virus companies will run viruses to see what they do. They run them in \"emulated\" machines that are a lot slower, but safer. If viruses find themselves running in an emulated environment, then they stop doing all the bad behaviors the anti-virus programs might detection. So they repeated check the timestamp to see how fast they are running -- if too slow, they assume emulation.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">But this itself is a bad behavior. This timestamp detection is one of the behaviors the anti-virus programs triggered on as suspicious.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-yJHvayqsUhw/YIpXPEAf9OI/AAAAAAAAGkU/xA-gKJOaWRYRWi6k6JxTlvLaplv6vGLcQCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"911\" data-original-width=\"1273\" height=\"229\" src=\"https://lh3.googleusercontent.com/-yJHvayqsUhw/YIpXPEAf9OI/AAAAAAAAGkU/xA-gKJOaWRYRWi6k6JxTlvLaplv6vGLcQCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br />You can go investigate on VirusTotal <a href=\"https://www.virustotal.com/gui/file/aefeb01a28379d3ac99576317a86ba58e6960dccb53792b7010bd1f471914169/behavior\">other things it found with this virus</a>.</div><br />Viruses and disconnected popups wasn't the only trick. In yet another attempt with web browsers, the hostile site attempt to open lots and lots of windows full of advertising. This is a direct way they earn money -- hacking the advertising companies rather than hacking you.<br /><p></p><p>In yet another attempt with another browser, this time from my MacBook air, it asked for an email address:</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-9BH_d2i28eM/YIpY0p21agI/AAAAAAAAGkc/wQYb4EFJrMYkkUwGmgQZ5uakGvmEEpoSQCLcBGAsYHQ/s1788/Screen%2BShot%2B2021-04-29%2Bat%2B2.54.28%2BAM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1280\" data-original-width=\"1788\" src=\"https://1.bp.blogspot.com/-9BH_d2i28eM/YIpY0p21agI/AAAAAAAAGkc/wQYb4EFJrMYkkUwGmgQZ5uakGvmEEpoSQCLcBGAsYHQ/s320/Screen%2BShot%2B2021-04-29%2Bat%2B2.54.28%2BAM.png\" width=\"320\" /></a></div>I happily obliged, giving it a fake address.</div><div><br /></div><div>At this point, the hackers are going to try to use the same email and password to log into Gmail, into a few banks, and so on. It's one of the top hacks these days (if not the most important hack) -- since most people reuse the same password for everything, even though it's not asking your for your Gmail or bank password, most of the time people will simply reuse them anyway. (This is why you need to keep important passwords separate from unimportant ones -- and write down your passwords or use a password manager).</div><div><br /></div><div>Anyway, I now get the next webpage. This is a straight up attempt to steal my credit card -- maybe.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-JSivWZONCh4/YIpkHaU0kLI/AAAAAAAAGlE/bvukYTFdebQG19BD2CrU2T9e4phyUg6zACLcBGAsYHQ/s1746/Screen%2BShot%2B2021-04-29%2Bat%2B3.03.46%2BAM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1746\" data-original-width=\"1630\" height=\"320\" src=\"https://1.bp.blogspot.com/-JSivWZONCh4/YIpkHaU0kLI/AAAAAAAAGlE/bvukYTFdebQG19BD2CrU2T9e4phyUg6zACLcBGAsYHQ/s320/Screen%2BShot%2B2021-04-29%2Bat%2B3.03.46%2BAM.png\" /></a></div>This is a website called \"AppCine.net\" that promises streaming movies, for free signup, but requires a credit card.<br /><div><br /></div><div>This may be a quasi-legitimate website. I saw \"quasi\" because their goal isn't outright credit card fraud, but a \"dark pattern\" whereby they make it easy to sign up for the first month free with a credit card, and then make it nearly impossible to stop the service, where they continue to bill you month after month. As long as the charges are small each month, most people won't bother going through all the effort canceling the service. And since it's not actually fraud, people won't call their credit card company and reverse the charges, since they actually did sign up for the service and haven't canceled it.</div><div><br /></div><div>It's a <a href=\"https://www.nytimes.com/2021/04/03/us/politics/trump-donations.html\">slimy thing the Trump campaign did</a> in the last election. Their website asked for one time donations but tricked people into unwittingly making it a regular donation. This caused a lot of \"chargebacks\" as people complained to their credit card company.</div><div><br /></div><div>In truth, everyone does the same pattern: makes it easy to sign up, and sign up for more than you realize, and then makes it hard to cancel. I thought I'd canceled an AT&amp;T phone but found out they'd kept billing me for 3 years, despite the phone no longer existing and using their network.</div><div><br /></div><div>They probably have a rewards program. In other words, they aren't out there doing SEO hacking of google. Instead, they pay others to do it for them, and then give a percentage profit, either for incoming links, but probably \"conversion\", money whenever somebody actually enters their credit card number and signs up.</div><div><br /></div><div>Those people are in tern a different middleman. It probably goes like this:</div><div><ul style=\"text-align: left;\"><li>somebody skilled at SEO optimization, who sends links to a broker</li><li>a broker who then forwards those links to other middlemen</li><li>middlemen who then deliver those links to sites like AppCine.net that actually ask for an email address or credit card</li></ul></div><div>There's probably even more layers -- like any fine tuned industry, there are lots of specialists who focus on doing their job well.</div><div><br /></div><div>Okay, I'll play along, and I enter a credit card number to see what happens (I have bunch of used debit cards to play this game). This leads to an error message saying the website is down and they can't deliver videos for me, but then pops up another box asking for my email, from yet another movie website:</div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-rf2trPBX28E/YIpcwrYM4WI/AAAAAAAAGk0/2dmkktcpxBEyg7eTpuZDcb2No2QCzSqEQCLcBGAsYHQ/s1638/Screen%2BShot%2B2021-04-29%2Bat%2B3.13.50%2BAM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1166\" data-original-width=\"1638\" src=\"https://1.bp.blogspot.com/-rf2trPBX28E/YIpcwrYM4WI/AAAAAAAAGk0/2dmkktcpxBEyg7eTpuZDcb2No2QCzSqEQCLcBGAsYHQ/s320/Screen%2BShot%2B2021-04-29%2Bat%2B3.13.50%2BAM.png\" width=\"320\" /></a></div><br /></div>This leads to yet another site:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-uMQytKYjw6o/YIpdf1rCL5I/AAAAAAAAGk8/MBBc4ApLEL064UpLiCSV8fdSEERXAA0TQCLcBGAsYHQ/s1638/Screen%2BShot%2B2021-04-29%2Bat%2B3.16.36%2BAM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1480\" data-original-width=\"1638\" src=\"https://1.bp.blogspot.com/-uMQytKYjw6o/YIpdf1rCL5I/AAAAAAAAGk8/MBBc4ApLEL064UpLiCSV8fdSEERXAA0TQCLcBGAsYHQ/s320/Screen%2BShot%2B2021-04-29%2Bat%2B3.16.36%2BAM.png\" width=\"320\" /></a></div>It's an endless series. Once a site \"converts\" you, it then simply sells the link back to another middleman, who then forwards you on to the next. I could probably sit there all day with fake email addresses and credit cards and still not come to the end of it all.</div><div><br /></div><div><b>Summary</b></div><div><b><br /></b></div><div>So here's what we found.</div><div><br /></div><div>First, there was a \"search engine optimization\" hacker who specializes in getting their content at the top of search results for random terms.</div><div><br /></div><div>Second, they pass hits off to a broker who distributes the hits to various hackers who pay them. These hackers will try to exploit you with:</div><div><ul style=\"text-align: left;\"><li>popups pretending to be anti-virus warnings that show up outside the browser</li><li>actual virus downloads in encrypted zips that try to evade anti-virus, but not well</li><li>endless new windows selling you advertising</li><li>steal your email address and password, hoping that you've simply reused one from legitimate websites, like Gmail or your bank</li><li>signups for free movie websites that try to get your credit card and charge you legally</li></ul></div><div>Even experts get confused. I had trouble helping this user track down exactly where the popup was coming from. Also, any expert can misclick and make the wrong thing happen -- this user had been clicking the right thing \"Block\" for years and accidentally hit \"Allow\" this one time.</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}