{
  "title": "NATO member votes to send arms to Ukraine despite opposition",
  "link": "https://www.rt.com/news/565894-bulgaria-weapons-aid-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565894-bulgaria-weapons-aid-ukraine/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363f15e20302768a7570035.jpg\" /> Bulgarian lawmakers voted on Thursday to provide military assistance to Ukraine, after months of stalling <br/><a href=\"https://www.rt.com/news/565894-bulgaria-weapons-aid-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Bulgaria’s parliament has authorized the sale of weapons to Kiev, despite a third of the country favoring partnership with Russia</strong></p>\n            \n                        \n            <p>Bulgarian lawmakers voted on Thursday to supply Ukraine with arms, with socialist and nationalist MPs resisting the decision. This leaves Hungary as the final NATO member refusing to provide military aid to Kiev.</p>\n<p>A bill authorizing weapons supplies to Ukraine passed Bulgaria&rsquo;s National Assembly by 175 votes to 49, the Novinite news site <a href=\"https://www.novinite.com/articles/217377/It+is+Official%3A+Bulgaria+will+provide+Military+Aid+to+Ukraine\" target=\"_blank\" rel=\"noopener noreferrer\">reported</a>. The pro-Western GERB party, currently the largest faction in the assembly, proposed the bill amid coalition talks following elections last month.</p>\n<p>The issue of arms supplies to Ukraine is a contentious one in Bulgaria, where nearly a third of the population view Russia as their country&rsquo;s most important strategic partner, 35% see Ukraine as a <em>&ldquo;puppet of the West,&rdquo;</em> and 38% want to leave the NATO alliance, according to Globsec, a Slovakian think tank.</p>\n<p>Bulgarian President Rumen Radev has spoken out against weapons transfers to Kiev, arguing that those in favor of arms shipments are <em>&ldquo;warmongers&rdquo;</em> who risk dragging Bulgaria into the conflict with Russia.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/634afcf02030274a9e3898fc.jpg\" alt=\"FILE PHOTO: Ukrainian President Vladimir Zelensky\" />\n            <figcaption><a href=\"https://www.rt.com/news/564737-bulgaria-vice-president-zelensky-parliament/\">Bulgarian vice president opposes plan for Zelensky to address parliament</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Socialist leader Kornelia Ninova, whose party was in a ruling coalition until August, warned on Thursday that <em>&ldquo;the Bulgarian national interest is not to provide weapons, because that would make us a party to the conflict.&rdquo;</em>&nbsp; Kostadin Kostadinov&rsquo;s &lsquo;Revival&rsquo; party also voted against the bill, with the nationalist leader complaining that <em>&ldquo;Bulgaria is supposedly ruled by Bulgarians, and we are talking about providing our little remaining armaments and literally bringing Bulgaria into the war.&rdquo;</em></p>\n<p>While Bulgarian parliamentarians have been debating the country&rsquo;s official stance on arming its neighbor, the country&rsquo;s arms industry has reportedly <a href=\"https://www.euractiv.com/section/all/short_news/bulgaria-doesnt-send-weapons-to-ukraine-but-arms-industry-flourishes/\" target=\"_blank\" rel=\"noopener noreferrer\">sold</a> more than $1 billion worth of weapons to customers in Poland and Romania for re-export to Ukraine since February.</p>\n<p>It is still unclear how much of Bulgaria&rsquo;s predominantly Soviet weapons stock will be sent to Ukraine, and what, if any, NATO equipment the alliance will offer Sofia in replacement. The government now has a month to list equipment for export and negotiate with Western NATO members for replacements.</p>\n<p>With the bill&rsquo;s passage, only one NATO member remains steadfast on refusing to arm Ukraine: Hungary. Hungarian Prime Minister Viktor Orban has refused to supply weapons or allow arms to enter Ukraine via Hungarian territory. Orban has also refused to embargo Russian energy exports and has called for direct talks between Russia and the US to end the conflict.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 17:07:23 +0000",
  "dc:creator": "RT"
}