{
  "title": "65: The Case of the Cannibal Cop",
  "link": "https://audioboom.com/posts/7098228",
  "itunes:episode": 65,
  "itunes:title": "The Case of the Cannibal Cop",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3244,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>In 2015, NYC Police Officer Gilberto Valle was convicted of conspiring to kidnap and eat young women. YES YOU READ THAT RIGHT: KIDNAP AND EAT. Valle argued it was all a fantasy; the prosecution's narrative convinced jurors otherwise. Valle was facing a possible life sentence when filmmaker Erin Lee Carr began visiting him in prison to make this film.</p>\n\n\n<p>There’s no way around it, you guys, this one is full of garbage—the cannibal cop himself (CANNIBAL COP, YOU GUYS), his enabling parents, and the filmmaker who never really tries to understand WHY and/or HOW Valle came to be the way he is. But don’t worry, there’s lots of good New York Post headlines….and one fabulous glamor shot.</p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Binge our 40+ bonus episodes via Patreon</a>! When you join our Patreon fam, you not only support us, you also INSTANTLY get our entire catalog of bonus episodes, including <strong>our episode-by-episode coverage of \"SERIAL,\" \"THE JINX,\" and \"THE STAIRCASE.\"</strong> You also get our interviews with <strong>Asia McClain</strong> (Adnan Syed's alibi witness), <strong>Rabia Chaudry</strong>, <strong>\"Tower\" director Keith Maitland</strong>, all of our mini-episodes, extended outtakes, AND full bonus episodes covering \"Madonna: Truth or Dare\" and \"The Queen of Versailles.\" <strong>AND IT'S ALL COMMERCIAL FREE!</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join here!</a></p>\n\n\n<p><strong>Want to see us LIVE?</strong> <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Go Here</a> for information and tickets to our upcoming live events like our <strong>February live shows</strong> or our <strong>Pride show</strong> in June!</p>\n\n\n<p><strong>Looking for our Advertisers / Promo Codes?</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Go Here!</a> We now have a whole page of our site for you to check out and <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">GET. THOSE. DISCOUNTS!</a></p>\n",
  "pubDate": "Tue, 27 Nov 2018 05:01:00 +0000",
  "guid": "tag:audioboom.com,2018-11-27:/posts/7098228",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}