{
  "id": "tag:theatlantic.com,2020:39-612247",
  "content": "<p class=\"dropcap\">A<span class=\"smallcaps\">fter months</span> of living with the coronavirus pandemic, American citizens are well aware of the toll it has taken on the economy: broken supply chains, record unemployment, failing small businesses. All of these factors are serious and could mire the United States in a deep, prolonged recession. But there’s another threat to the economy, too. It lurks on the balance sheets of the big banks, and it could be cataclysmic. Imagine if, in addition to all the uncertainty surrounding the pandemic, you woke up one morning to find that the financial sector had collapsed.</p><p style=\"background-color: #333; color: #fff; padding: 12px 24px;\"><iframe frameborder=\"no\" height=\"20\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/837062335%3Fsecret_token%3Ds-4cktFKijus9&amp;inverse=true&amp;auto_play=false&amp;show_user=true\" style=\"background-color: #333\" width=\"100%\"></iframe><i class=\"audm--download-cta\">To hear more feature stories, <a href=\"https://www.audm.com/?utm_source=soundcloud&amp;utm_medium=embed&amp;utm_campaign=atlantic&amp;utm_content=worst_worst_case\" style=\"color: #fff; text-decoration: underline;\">get the Audm iPhone app.</a> </i></p><p>You may think that such a crisis is unlikely, with memories of the 2008 crash still so fresh. But banks learned few lessons from that calamity, and new laws intended to keep them from taking on too much risk have failed to do so. As a result, we could be on the precipice of another crash, one different from 2008 less in kind than in degree. This one could be worse.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2019/01/john-lawrence-inside-2008-financial-crash/576574/?utm_source=feed\">John Lawrence: Inside the 2008 financial crash</a>]</i></p><p>The financial crisis of 2008 was about home mortgages. Hundreds of billions of dollars in loans to home buyers were repackaged into securities called collateralized debt obligations, known as CDOs. In theory, CDOs were intended to shift risk away from banks, which lend money to home buyers. In practice, the same banks that issued home loans also bet heavily on CDOs, often using complex techniques hidden from investors and regulators. When the housing market took a hit, these banks were doubly affected. In late 2007, banks began disclosing tens of billions of dollars of subprime-CDO losses. The next year, Lehman Brothers went under, taking the economy with it.</p><p>The federal government stepped in to rescue the other big banks and forestall a panic. The intervention worked—though its success did not seem assured at the time—and the system righted itself. Of course, many Americans suffered as a result of the crash, losing homes, jobs, and wealth. An already troubling gap between America’s haves and have-nots grew wider still. Yet by March 2009, the economy was on the upswing, and the longest bull market in history had begun.</p><p>To prevent the next crisis, Congress in 2010 passed the Dodd-Frank Act. Under the new rules, banks were supposed to borrow less, make fewer long-shot bets, and be more transparent about their holdings. The Federal Reserve began conducting “stress tests” to keep the banks in line. Congress also tried to reform the credit-rating agencies, which were widely blamed for enabling the meltdown by giving high marks to dubious CDOs, many of which were larded with subprime loans given to unqualified borrowers. Over the course of the crisis, more than 13,000 CDO investments that were rated AAA—the highest possible rating—defaulted.</p><p>The reforms were well intentioned, but, as we’ll see, they haven’t kept the banks from falling back into old, bad habits. After the housing crisis, subprime CDOs naturally fell out of favor. Demand shifted to a similar—and similarly risky—instrument, one that even has a similar name: the CLO, or collateralized loan obligation. A CLO walks and talks like a CDO, but in place of loans made to home buyers are loans made to businesses—specifically, troubled businesses. CLOs bundle together so-called leveraged loans, the subprime mortgages of the corporate world. These are loans made to companies that have maxed out their borrowing and can no longer sell bonds directly to investors or qualify for a traditional bank loan. There are more than $1 trillion worth of leveraged loans currently outstanding. The majority are held in CLOs.</p><p>I was part of the group that structured and sold CDOs and CLOs at Morgan Stanley in the 1990s. The two securities are remarkably alike. Like a CDO, a CLO has multiple layers, which are sold separately. The bottom layer is the riskiest, the top the safest. If just a few of the loans in a CLO default, the bottom layer will suffer a loss and the other layers will remain safe. If the defaults increase, the bottom layer will lose even more, and the pain will start to work its way up the layers. The top layer, however, remains protected: It loses money only after the lower layers have been wiped out.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/05/bridge-post-pandemic-world-already-collapsing/611089/?utm_source=feed\">Annie Lowrey: The small-business die-off is here</a>]</i></p><p>Unless you work in finance, you probably haven’t heard of CLOs, but according to many estimates, the CLO market is bigger than the subprime-mortgage CDO market was in its heyday. The Bank for International Settlements, which helps central banks pursue financial stability, has <a href=\"https://www.bis.org/publ/qtrpdf/r_qt1909.pdf\">estimated the overall size of the CDO market in 2007</a> at $640 billion; it estimated the overall size of the CLO market in 2018 at $750 billion. More than $130 billion worth of CLOs have been created since then, some even in recent months. Just as easy mortgages fueled economic growth in the 2000s, cheap corporate debt has done so in the past decade, and many companies have binged on it.</p><aside class=\"callout-placeholder\" data-source=\"magazine-issue\"></aside><p>Despite their obvious resemblance to the villain of the last crash, CLOs have been praised by Federal Reserve Chair Jerome Powell and Treasury Secretary Steven Mnuchin for moving the risk of leveraged loans outside the banking system. Like former Fed Chair Alan Greenspan, who downplayed the risks posed by subprime mortgages, Powell and Mnuchin have downplayed any trouble CLOs could pose for banks, arguing that the risk is contained within the CLOs themselves.</p><p>These sanguine views are hard to square with reality. The Bank for International Settlements estimates that, across the globe, banks held at least $250 billion worth of CLOs at the end of 2018. Last July, one month after <a href=\"https://www.federalreserve.gov/mediacenter/files/FOMCpresconf20190619.pdf\">Powell declared in a press conference</a> that “the risk isn’t in the banks,” <a href=\"https://www.federalreserve.gov/econres/notes/feds-notes/who-owns-us-clo-securities-20190719.htm\">two economists from the Federal Reserve reported</a> that U.S. depository institutions and their holding companies owned more than $110 billion worth of CLOs issued out of the Cayman Islands alone. A more complete picture is hard to come by, in part because banks have been inconsistent about reporting their CLO holdings. The Financial Stability Board, which monitors the global financial system, <a href=\"https://www.fsb.org/2019/12/vulnerabilities-associated-with-leveraged-loans-and-collateralised-loan-obligations/\">warned in December</a> that 14 percent of CLOs—more than $100 billion worth—are unaccounted for.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2017/09/are-index-funds-evil/534183/?utm_source=feed\">From the September 2017 issue: Frank Partnoy on how index funds might be bad for the economy</a>]</i></p><p>I have a checking account and a home mortgage with Wells Fargo; I decided to see how heavily invested my bank is in CLOs. I had to dig deep into the footnotes of <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/72971/000007297120000217/wfc-12312019xex13.htm\">the bank’s most recent annual report, all the way to page 144</a>. Listed there are its “available for sale” accounts. These are investments a bank plans to sell at some point, though not necessarily right away. The list contains the categories of safe assets you might expect: U.S. Treasury bonds, municipal bonds, and so on. Nestled among them is an item called “collateralized loan and other obligations”—CLOs. I ran my finger across the page to see the total for these investments, investments that Powell and Mnuchin have asserted are “outside the banking system.”</p><p>The total is $29.7 billion. It is a massive number. And it is inside the bank.</p><figure><img alt=\"illustration of spreadsheet\" height=\"595\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/WEL_Partnoy_Banks_spot1/99bdd9dd8.jpg\" width=\"672\"><figcaption class=\"credit\">George Wylesol</figcaption></figure><p class=\"dropcap\">S<span class=\"smallcaps\">ince 2008, </span>banks<span class=\"smallcaps\"> </span>have kept more capital on hand to protect against a downturn, and their balance sheets are less leveraged now than they were in 2007. And not every bank has loaded up on CLOs. But in December, <a href=\"https://www.fsb.org/2019/12/vulnerabilities-associated-with-leveraged-loans-and-collateralised-loan-obligations/\">the Financial Stability Board estimated</a> that, for the 30 “global systemically important banks,” the average exposure to leveraged loans and CLOs was roughly 60 percent of capital on hand. <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/831001/000083100120000044/c-3312020x10q.htm\">Citigroup reported</a> $20 billion worth of CLOs as of March 31; <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/19617/000001961720000299/corpq12020.htm\">JPMorgan Chase reported</a> $35 billion (along with an unrealized loss on CLOs of $2 billion). A couple of midsize banks—Banc of California, Stifel Financial—have CLOs totaling more than 100 percent of their capital. If the leveraged-loan market imploded, their liabilities could quickly become greater than their assets.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/international/archive/2020/04/lessons-wartime-economics-coronavirus-covid19/609439/?utm_source=feed\">Read: The pandemic’s economic lessons</a>]</i></p><p>How can these banks justify gambling so much money on what looks like such a risky bet? Defenders of CLOs say they aren’t, in fact, a gamble—on the contrary, they are as sure a thing as you can hope for. That’s because the banks mostly own the least risky, top layer of CLOs. Since the mid-1990s, the highest annual default rate on leveraged loans was about 10 percent, during the previous financial crisis. If 10 percent of a CLO’s loans default, the bottom layers will suffer, but if you own the top layer, you might not even notice. Three times as many loans could default and you’d still be protected, because the lower layers would bear the loss. The securities are structured such that investors with a high tolerance for risk, like hedge funds and private-equity firms, buy the bottom layers hoping to win the lottery. The big banks settle for smaller returns and the security of the top layer. As of this writing, no AAA‑rated layer of a CLO has ever lost principal.</p><p>But that AAA rating is deceiving. The credit-rating agencies grade CLOs and their underlying debt separately. You might assume that a CLO must contain AAA debt if its top layer is rated AAA. Far from it. Remember: CLOs are made up of loans to businesses that are already in trouble.</p><p>So what sort of debt do you find in a CLO? Fitch Ratings has estimated that as of April, more than 67 percent of the 1,745 borrowers in its leveraged-loan database had a B rating. That might not sound bad, but B-rated debt is lousy debt. According to the rating agencies’ definitions, a B-rated borrower’s ability to repay a loan is <i>likely</i> to be impaired in adverse business or economic conditions. In other words, two-thirds of those leveraged loans are likely to lose money in economic conditions like the ones we’re presently experiencing. According to Fitch, 15 percent of companies with leveraged loans are rated lower still, at CCC or below. These borrowers are on the cusp of default.</p><p>So while the banks restrict their CLO investments mostly to AAA‑rated layers, what they really own is exposure to tens of billions of dollars of high-risk debt. In those highly rated CLOs, you won’t find a single loan rated AAA, AA, or even A.</p><p>How can the credit-rating agencies get away with this? The answer is “default correlation,” a measure of the likelihood of loans defaulting <i>at the same time</i>. The main reason CLOs have been so safe is the same reason CDOs seemed safe before 2008. Back then, the underlying loans were risky too, and everyone knew that some of them would default. But it seemed unlikely that many of them would default at the same time. The loans were spread across the entire country and among many lenders. Real-estate markets were thought to be local, not national, and the factors that typically lead people to default on their home loans—job loss, divorce, poor health—don’t all move in the same direction at the same time. Then housing prices fell 30 percent across the board and defaults skyrocketed.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2013/01/whats-inside-americas-banks/309196/?utm_source=feed\">From the January/February 2013 issue: Frank Partnoy and Jesse Eisinger on not knowing what’s inside America’s banks</a>]</i></p><p>For CLOs, the rating agencies determine the grades of the various layers by assessing both the risks of the leveraged loans and their default correlation. Even during a recession, different sectors of the economy, such as entertainment, health care, and retail, don’t necessarily move in lockstep. In theory, CLOs are constructed in such a way as to minimize the chances that all of the loans will be affected by a single event or chain of events. The rating agencies award high ratings to those layers that seem sufficiently diversified across industry and geography.</p><p>Banks do not publicly report which CLOs they hold, so we can’t know precisely which leveraged loans a given institution might be exposed to. But all you have to do is look at a list of leveraged borrowers to see the potential for trouble. Among the dozens of companies Fitch added to its list of “loans of concern” in April were AMC Entertainment, Bob’s Discount Furniture, California Pizza Kitchen, the Container Store, Lands’ End, Men’s Wearhouse, and Party City. These are all companies hard hit by the sort of belt-tightening that accompanies a conventional downturn.</p><p>We are not in the midst of a conventional downturn. The two companies with the largest amount of outstanding debt on Fitch’s April list were Envision Healthcare, a medical-staffing company that, among other things, helps hospitals administer emergency-room care, and Intelsat, which provides satellite broadband access. Also added to the list was Hoffmaster, which makes products used by restaurants to package food for takeout. Companies you might have expected to weather the present economic storm are among those suffering most acutely as consumers not only tighten their belts, but also redefine what they consider necessary.</p><p>Even before the pandemic struck, the credit-rating agencies may have been underestimating how vulnerable unrelated industries could be to the same economic forces. <a href=\"http://www.jgriffin.info/wp-content/uploads/2017/11/corr_pub.pdf\">A 2017 article</a> by John Griffin, of the University of Texas, and Jordan Nickerson, of Boston College, demonstrated that the default-correlation assumptions used to create a group of 136 CLOs should have been three to four times higher than they were, and the miscalculations resulted in much higher ratings than were warranted. “I’ve been concerned about AAA CLOs failing in the next crisis for several years,” Griffin told me in May. “This crisis is more horrifying than I anticipated.”</p><p>Under current conditions, the outlook for leveraged loans in a range of industries is truly grim. Companies such as AMC (nearly $2 billion of debt spread across 224 CLOs) and Party City ($719 million of debt in 183 CLOs) were in dire straits before social distancing. Now moviegoing and party-throwing are paused indefinitely—and may never come back to their pre-pandemic levels.</p><p>The prices of AAA-rated CLO layers tumbled in March, before the Federal Reserve announced that its additional $2.3 trillion of lending would include loans to CLOs. (The program is controversial: Is the Fed really willing to prop up CLOs when so many previously healthy small businesses are struggling to pay their debts? As of mid-May, no such loans had been made.) Far from scaring off the big banks, the tumble inspired several of them to buy low: Citigroup acquired $2 billion of AAA CLOs during the dip, which it flipped for a $100 million profit when prices bounced back. Other banks, including Bank of America, reportedly bought lower layers of CLOs in May for about 20 cents on the dollar.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/business/archive/2014/02/how-the-fed-let-the-world-blow-up-in-2008/284054/?utm_source=feed\">Read: How the Fed let the world blow up in 2008</a>]</i></p><p>Meanwhile, loan defaults are already happening. There were more in April than ever before. Several experts told me they expect more record-breaking months this summer. It will only get worse from there.</p><figure><img alt='illustration of file cabinet with label \"out of order\"' height=\"668\" src=\"https://cdn.theatlantic.com/assets/media/img/posts/2020/06/WEL_Partnoy_Banks_spot2/246ace5a0.jpg\" width=\"672\"><figcaption class=\"credit\">George Wylesol</figcaption></figure><p class=\"dropcap\"><span class=\"smallcaps\">If leveraged-loan </span>defaults continue, how badly could they damage the larger economy? What, precisely, is the worst-case scenario?</p><p>For the moment, the financial system seems relatively stable. Banks can still pay their debts and pass their regulatory capital tests. But recall that the previous crash took more than a year to unfold. The present is analogous not to the fall of 2008, when the U.S. was in full-blown crisis, but to the summer of 2007, when some securities were going underwater but no one yet knew what the upshot would be.</p><p>What I’m about to describe is necessarily speculative, but it is rooted in the experience of the previous crash and in what we know about current bank holdings. The purpose of laying out this worst-case scenario isn’t to say that it will necessarily come to pass. The purpose is to show that it <i>could</i>. That alone should scare us all—and inform the way we think about the next year and beyond.</p><p>Later this summer, leveraged-loan defaults will increase significantly as the economic effects of the pandemic fully register. Bankruptcy courts will very likely buckle under the weight of new filings. (During a two-week period in May, J.Crew, Neiman Marcus, and J. C. Penney all filed for bankruptcy.) We already know that a significant majority of the loans in CLOs have weak covenants that offer investors only minimal legal protection; in industry parlance, they are “cov lite.” The holders of leveraged loans will thus be fortunate to get pennies on the dollar as companies default—nothing close to the 70 cents that has been standard in the past.</p><p>As the banks begin to feel the pain of these defaults, the public will learn that they were hardly the only institutions to bet big on CLOs. The insurance giant AIG—which had massive investments in CDOs in 2008—is now <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/5272/000110465920023889/aig-20191231.htm#Insurance_Reserves\">exposed to more than $9 billion in CLOs</a>. U.S. life-insurance companies as a group in 2018 had an estimated one-fifth of their capital tied up in these same instruments. Pension funds, mutual funds, and exchange-traded funds (popular among retail investors) are also heavily invested in leveraged loans and CLOs.</p><p>The banks themselves may reveal that their CLO investments are larger than was previously understood. In fact, we’re already seeing this happen. On May 5, <a href=\"https://www.sec.gov/Archives/edgar/data/72971/000007297120000236/0000072971-20-000236-index.htm\">Wells Fargo disclosed $7.7 billion worth of CLOs</a> in a different corner of its balance sheet than the $29.7 billion I’d found in its annual report. As defaults pile up, the Mnuchin-Powell view that leveraged loans can’t harm the financial system will be exposed as wishful thinking.</p><p>Thus far, I’ve focused on CLOs because they are the most troubling assets held by the banks. But they are also emblematic of other complex and artificial products that banks have stashed on—and off—their balance sheets. Later this year, banks may very well report quarterly losses that are much worse than anticipated. The details will include a dizzying array of transactions that will recall not only the housing crisis, but the Enron scandal of the early 2000s. Remember all those subsidiaries Enron created (many of them infamously named after<i> Star Wars</i> characters) to keep risky bets off the energy firm’s financial statements? The big banks use similar structures, called “variable interest entities”—companies established largely to hold off-the-books positions. <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/72971/000007297120000217/wfc-12312019xex13.htm\">Wells Fargo has more than $1 trillion of VIE assets</a>, about which we currently know very little, because reporting requirements are opaque. But one popular investment held in VIEs is securities backed by commercial mortgages, such as loans to shopping malls and office parks—two categories of borrowers experiencing severe strain as a result of the pandemic.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/04/were-replicating-mistakes-2008/609586/?utm_source=feed\">Jesse Eisinger: We’re replicating the mistakes of 2008</a>]</i></p><p>The early losses from CLOs will not on their own erase the capital reserves required by Dodd-Frank. And some of the most irresponsible gambles from the last crisis—the speculative derivatives and credit-default swaps you may remember reading about in 2008—are less common today, experts told me. But the losses from CLOs, combined with losses from other troubled assets like those commercial-mortgage-backed securities, will lead to serious deficiencies in capital. Meanwhile, the same economic forces buffeting CLOs will hit other parts of the banks’ balance sheets hard; as the recession drags on, their traditional sources of revenue will also dry up. For some, the erosion of capital could approach the levels Lehman Brothers and Citigroup suffered in 2008. Banks with insufficient cash reserves will be forced to sell assets into a dour market, and the proceeds will be dismal. The prices of leveraged loans, and by extension CLOs, will spiral downward.</p><figure><iframe frameborder=\"0\" height=\"3641\" resizable=\"resizable\" scrolling=\"no\" src=\"https://www.theatlantic.com/media/interactives/2020/06/clo-an-illustrated-guide/index.html?v=3\" width=\"630\"></iframe>\n\n<figcaption class=\"caption\"><i>Image source: Based on data from Fitch Ratings. The fourth CLO depicts an aggregate leveraged-loan default rate of 78 percent.</i></figcaption></figure><p>You can perhaps guess much of the rest: At some point, rumors will circulate that one major bank is near collapse. Overnight lending, which keeps the American economy running, will seize up. The Federal Reserve will try to arrange a bank bailout. All of that happened last time, too.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2015/09/how-wall-streets-bankers-stayed-out-of-jail/399368/?utm_source=feed\">From the September 2015 issue: How Wall Street’s bankers stayed out of jail</a>]</i></p><p>But this time, the bailout proposal will likely face stiffer opposition, from both parties. Since 2008, populists on the left and the right in American politics have grown suspicious of handouts to the big banks. Already irate that banks were inadequately punished for their malfeasance leading up to the last crash, critics will be outraged to learn that they so egregiously flouted the spirit of the post-2008 reforms. Some members of Congress will question whether the Federal Reserve has the authority to buy risky investments to prop up the financial sector, as it did in 2008. (Dodd-Frank limited the Fed’s ability to target specific companies, and precluded loans to failing or insolvent institutions.) Government officials will hold frantic meetings, but to no avail. The faltering bank will fail, with others lined up behind it.</p><p>And then, sometime in the next year, we will all stare into the financial abyss. At that point, we will be well beyond the scope of the previous recession, and we will have either exhausted the remedies that spared the system last time or found that they won’t work this time around. What <i>then</i>?</p><p class=\"dropcap\"><span class=\"smallcaps\">Until recently</span>, at<span class=\"smallcaps\"> </span>least, the U.S. was rightly focused on finding ways to emerge from the coronavirus pandemic that prioritize the health of American citizens. And economic health cannot be restored until people feel safe going about their daily business. But health risks and economic risks must be considered together. In calculating the risks of reopening the economy, we must understand the true costs of remaining closed. At some point, they will become more than the country can bear.</p><p>The financial sector isn’t like other sectors. If it fails, fundamental aspects of modern life could fail with it. We could lose the ability to get loans to buy a house or a car, or to pay for college. Without reliable credit, many Americans might struggle to pay for their daily needs. This is why, in 2008, then–Treasury Secretary Henry Paulson went so far as to get down on one knee to beg Nancy Pelosi for her help sparing the system. He understood the alternative.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2012/06/how-we-got-the-crash-wrong/308984/?utm_source=feed\">From the June 2012 issue: How we got the crash wrong</a>]</i></p><p>It is a distasteful fact that the present situation is so dire in part because the banks fell right back into bad behavior after the last crash—taking too many risks, hiding debt in complex instruments and off-balance-sheet entities, and generally exploiting loopholes in laws intended to rein in their greed. Sparing them for a second time this century will be that much harder.</p><p>If we muster the political will to do so—or if we avert the worst possible outcomes in this precarious time—it will be imperative for the U.S. government to impose reforms stringent enough to head off the next crisis. We’ve seen how banks respond to stern reprimands and modest reform. This time, regulators might need to dismantle the system as we know it. Banks should play a much simpler role in the new economy, making lending decisions themselves instead of farming them out to credit-rating agencies. They should steer clear of whatever newfangled security might replace the CLO. To prevent another crisis, we also need far more transparency, so we can see when banks give in to temptation. A bank shouldn’t be able to keep $1 trillion worth of assets off its books.</p><p>If we do manage to make it through the next year without waking up to a collapse, we must find ways to prevent the big banks from going all in on bets they can’t afford to lose. Their luck—and ours—will at some point run out.</p><hr><p><small><em>This article appears in the July/August 2020 print edition with the headline “The Worst Worst Case.”</em></small></p>",
  "author": {
    "name": "Frank Partnoy",
    "uri": "http://www.theatlantic.com/author/frank-partnoy/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "George Wylesol"
  },
  "title": "The Looming Bank Collapse",
  "published": "2020-06-10T05:00:00-04:00",
  "updated": "2020-07-21T14:38:01-04:00",
  "summary": "The U.S. financial system could be on the cusp of calamity. This time, we might not be able to save it.",
  "link": ""
}