{
  "title": "Patton Oswalt DRAGGED for Taking Photo w/ Dave Chappelle",
  "itunes:title": "Patton Oswalt DRAGGED for Taking Photo w/ Dave Chappelle",
  "pubDate": "Fri, 07 Jan 2022 04:43:08 +0000",
  "guid": "420e445e-ca91-4109-9478-ebc93dfdca06",
  "link": "https://traffic.libsyn.com/secure/thejimmydoreshow/TJDS_20220106_Podcast_-_1622_7.59_PM.mp3",
  "itunes:image": "",
  "description": "<p>Patton Oswalt committed the cardinal sin of... taking a photo with his friend of 34 years, Dave Chappelle. In response Oswalt was raked over the social media coals, and delivered a groveling apology, promising to do better and expressing regret for all the harm he caused. Jimmy and comedian Kurt Metzger discuss Patton's humiliating cave to the social media mob.</p> <p>Plus segments on the censoring of mRNA vaccine technology developer Dr. Robert Malone and Howard Stern's bizarre attack on Oprah for hosting holiday parties.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! Phone calls from Andrew Cuomo and Vince Vaughn!</p>",
  "content:encoded": "<p>Patton Oswalt committed the cardinal sin of... taking a photo with his friend of 34 years, Dave Chappelle. In response Oswalt was raked over the social media coals, and delivered a groveling apology, promising to do better and expressing regret for all the harm he caused. Jimmy and comedian Kurt Metzger discuss Patton's humiliating cave to the social media mob.</p> <p>Plus segments on the censoring of mRNA vaccine technology developer Dr. Robert Malone and Howard Stern's bizarre attack on Oprah for hosting holiday parties.  Also featuring Stef Zamorano and Mike MacRae! Phone calls from Andrew Cuomo and Vince Vaughn!</p>",
  "enclosure": "",
  "itunes:duration": "01:03:13",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Patton Oswalt committed the cardinal sin of... taking a photo with his friend of 34 years, Dave Chappelle. In response Oswalt was raked over the social media coals, and delivered a groveling apology, promising to do better and expressing regret for...",
  "itunes:episodeType": "full",
  "itunes:summary": "Patton Oswalt committed the cardinal sin of... taking a photo with his friend of 34 years, Dave Chappelle. In response Oswalt was raked over the social media coals, and delivered a groveling apology, promising to do better and expressing regret for all the harm he caused. Jimmy and comedian Kurt Metzger discuss Patton's humiliating cave to the social media mob. Plus segments on the censoring of mRNA vaccine technology developer Dr. Robert Malone and Howard Stern's bizarre attack on Oprah for hosting holiday parties. Also featuring Stef Zamorano and Mike MacRae! Phone calls from Andrew Cuomo and Vince Vaughn!"
}