{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-8532478386172607848",
  "published": "2022-10-20T16:10:00.000+05:00",
  "updated": "2022-10-21T13:24:48.030+05:00",
  "title": "The much-awaited movie “Tich Button” featuring the stellar cast Iman Ali, Feroze Khan, and Sonya Hussyn",
  "content": "<p>The much-awaited movie “Tich Button” featuring the stellar cast Iman Ali, Feroze Khan, and Sonya Hussyn, with Farhan Saeed making his silver screen debut, saw the release of its trailer in a star-studded affair at Arts Council, Karachi under the banner of ARY Films on the evening of Tuesday, 18th of October 2022. The action packed rom-com thriller flick is set to release on 11th November 2022 in theatres worldwide.</p><p><br /></p><p><br /></p><p>The action packed rom com “Tich Button” explores the themes of family drama and, at the same time digs into lots of passion, intrigue, ambition, and friendship struggles that come with life’s journey. With the perfect choice of actors and a strong supporting cast comprising of veteran actors like Marina Khan, Muhammad Qavi Khan, Raheela Agha, Gul-e-Rana, Samia Mumtaz, and Humera, this movie is expected to go big at the box office.</p><p>Speaking on the occasion, the executive producer of movie Salman Iqbal commented, “It was such a great experience shooting with an amazing team, and I’m sure this movie will leave the audiences enthralled”.</p><p>“The film is a combination of emotion and dreams that plays out like a classic rom-com, with a talented star-studded cast we look forward to see it become a box-office smash”, stated the producer of the film Jerjees Seja on the trailer launch event.</p><p>Gracing the silver screen for the first time, Farhan Saeed said, “This is truly an exciting point in my career, working on a major film project with such a talented team is a blessing and I enjoyed every moment of it.”</p><p>While the Director Qasim Ali Mureed observed, “For me, ‘Tich Button’ is a labor of love that audiences can relate to. I hope to make more films that give out a positive message along with entertaining people.”</p><p>“Thoroughly enjoyed working on my first debut ‘Tich Button’, mostly due to the topic this film is based on. It was a pleasure working with actors who made every day memorable and fun’, said Urwa Hocane, the producer of the highly anticipated movie.</p><p>The upcoming movie is produced by ARY Films and Shooting Star Studios, with Salman Iqbal Films at the helm as executive producer and set to release nationwide on 11th November 2022</p><p><br /></p><p>Watch the official trailer at the link below:</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"342\" src=\"https://www.youtube.com/embed/wnuNBXsV0t8\" width=\"588\" youtube-src-id=\"wnuNBXsV0t8\"></iframe></div><br /><p><br /></p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}