{
  "title": "Enhancing Image Quality in Microsoft Bing",
  "link": "https://blogs.bing.com/search-quality-insights/september-2021/enhancing-image-quality-in-microsoft-bing",
  "pubDate": "Tue, 21 Sep 2021 08:00:00 -0700",
  "dc:creator": "Bing Team",
  "category": [
    "Artificial Intelligence",
    "Bing",
    "Bing Image Search",
    "Bing Visual Search"
  ],
  "guid": "5e1e4350-4194-4356-a7b9-ca8a15638ea6",
  "description": "Enhancing image quality is a critical but challenging computer vision task. We've released a new AI-based model for improving the quality of images on Microsoft Bing. Not only are the Bing image search results relevant, but they are also beautiful and high-resolution. Our new V3 model outperformed the V2 model by 36% in terms of click-through rate, demonstrating that users find visually appealing images in search results more interesting and inspiring and enjoy aesthetically pleasing visuals. It motivates and enables users to take action, fosters collaboration, and results in innovation, creativity, and positive action through pleasant interactions.",
  "content:encoded": "<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2021/Enhancing%20Image%20Quality/Bing.gif\" style=\"vertical-align: middle;\" />\n<div style=\"text-align: center;\">&nbsp;Aesthetic Model V3 results on Bing Image Search</div>\n<br />\nEnhancing Image quality is an essential yet very challenging computer vision task. Ever since our phones became cameras, always with us, ready to create rich multimedia content, there's been a tremendous growth in online photos. This places great demands on search engines to organize, manage, recommend, and offer high-quality multimedia results to users. The search engines must make sure that the search results are not only relevant but also fresh, beautiful, and of high-resolution.&nbsp;<br />\n<br />\nWhile object categorization and detection have reached human-level accuracy, determining the high quality of an image automatically is far from a solved problem. Aesthetics and high quality are crucial in various multimedia applications, including image retrieval in Microsoft Bing, Google, Pinterest, and others. Users expect rich, high quality multimedia results from a search engine without jeopardizing relevance.<br />\n<br />\nTo improve the image quality in our search and multimedia products, we released the updated version (V3) of the Aesthetic model. The V3 model improves (details below) upon the <a href=\"https://arxiv.org/pdf/1805.00309.pdf\" target=\"_blank\">V2 model</a>, in several ways and helps Bing Search Results come to life with relevant, high-quality, inspiring, and enticing images. &nbsp;You can already see the best-looking images as selected by our Aesthetic model in <a href=\"https://www.linkedin.com/pulse/search-ready-revolution-jordi-ribas/\" target=\"_blank\">several places</a> in Bing. In addition, there are new immersive user experiences in the pipeline &ndash; stay tuned. We will share more details in future posts.<br />\n<br />\nBing uses deep learning models using <a href=\"https://www.microsoft.com/en-us/research/blog/microsoft-vision-model-resnet-50-combines-web-scale-data-and-multi-task-learning-to-achieve-state-of-the-art/\" target=\"_blank\">state-of-the-art pretrained encoder</a>&nbsp;[1] , web scale data and multi-task training objectives to provide stunning and aesthetically pleasing photos. Bing Multimedia team aims to empower customers with media-rich experiences, and our research on Image Aesthetic AI models supports our goal. Aligning with our mission, in 2019, we <a href=\"https://arxiv.org/pdf/1805.00309.pdf\" target=\"_blank\">introduced</a>&nbsp;a unique framework for ranking image aesthetics by training a paired deep network on a huge dataset of side-by-side multi-labeled image pairings. By obtaining a relative ranking between two photos rather than just assigning an absolute score or evaluating any established image feature, we provided a more straightforward and accurate assessment.<br />\n<br />\nWith our V2 Model, we augmented a deep attractiveness rank net (DARN), a hybrid of a deep convolutional neural network and a rank net, with human tagging (crowdsourced) to directly learn the mean and variance of each image's attractiveness score (<a href=\"https://arxiv.org/pdf/1805.00309.pdf\" target=\"_blank\">DARN-V2</a>) [2]. &nbsp;We demonstrated that adding this considerably increased the aesthetics of search results and outperformed other models on our side-by-side online test data and another public aesthetic data set.<br />\n<br />\nIn July of this year, we released a new version of our Aesthetic model &ndash; V3 which improves on a few limitations of the V2 Model. We learned from the V2 model that majority judge voting does not fully capture judges&rsquo; sentiment since it ignores minority judge ratings. As a result, we established the KL Divergence as a metric for model accuracy and approached the problem as regression rather than a classification one. KL Divergence, in particular, takes preference diversity into account. It encourages the model to give a larger score gap if one side is obviously more aesthetically pleasing than the other side and a smaller score gap if two images are of similar quality. Compared with the V2's SBS (side-by-side) accuracy, KL Divergence metric is better aligned with our ranker usage scenario.&nbsp;<br />\n<br />\nAs a result, the new Aesthetic model more accurately captures preference variation across different judges during the training stage and generates Aesthetic ratings that are more consistent with general preference during inference.<br />\n<br />\nAdditionally, the V3 model is size-aware. In the V2 model, the images were resized into a uniform size before training, which introduced distortion in images in the training dataset. The V3 model is size-informed, as size is a critical feature in determining an image's aesthetics. The original-size signal allows the model to compensate for image degradation and distortion suffered by the V2 model. Additionally, we train our model to assign a higher score to a larger image if the images are identical but of different sizes. The V3 model also considers composition, subjects, lightness, contrast, exposure, focus, saturation, and resolution.<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2021/Enhancing%20Image%20Quality/Model-Comparison-New.gif\" />\n<div style=\"text-align: center;\">Example preference differences in image pairs under V2 and V3 models</div>\n<br />\nThe V3 model was evaluated both with in-house data from Bing and Opensource Aesthetic datasets, CHUKPQ [3]&nbsp; and AVA [4], and it generalized very well on these unseen Aesthetic datasets.<br />\n<br />\nCompared to the V2, the V3 model has a better aesthetic taste that is more in line with human perception. We used the KL divergence to measure the distance between Bernoulli distributions output by model and the aggregated opinion of multiple judges on an aesthetics side-by-side (SBS) test set of 53K image pairs. It was discovered that V3 reduced the distance by 48%. Similarly, V3 improves SBS accuracy by 10% on the public aesthetic dataset CUHKPQ. Furthermore, V3 aligns better with the relevance metrics calibration, with a 36% higher correlation with human judgment.<br />\n&nbsp;\n<table border=\"1\" bordercolor=\"#ccc\" cellpadding=\"5\" cellspacing=\"0\" style=\"border-collapse:collapse;\" width=\"100%\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td nowrap=\"nowrap\" style=\"width:22.8%;height:38px;\"><strong>Datasets</strong></td>\n\t\t\t<td style=\"width:30.7%;height:38px;\"><strong>Source</strong></td>\n\t\t\t<td style=\"width:20.18%;height:38px;\"><strong>Size (#Images | #Images Pairs</strong></td>\n\t\t\t<td style=\"width:26.32%;height:38px;\"><strong>SBS Accuracy </strong><br />\n\t\t\t<strong>(%: V2 | V3)</strong></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td nowrap=\"nowrap\" style=\"width:22.8%;height:36px;\">AVA</td>\n\t\t\t<td style=\"width:30.7%;height:36px;\">Photography Forum</td>\n\t\t\t<td style=\"width:20.18%;height:36px;\">256K | 271K</td>\n\t\t\t<td style=\"width:26.32%;height:36px;\">79.79 | 83.04</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td nowrap=\"nowrap\" style=\"width:22.8%;height:58px;\">CUHKPQ</td>\n\t\t\t<td style=\"width:30.7%;height:58px;\">Photography Forum + Students&rsquo; Pictures</td>\n\t\t\t<td style=\"width:20.18%;height:58px;\">30K | 120K</td>\n\t\t\t<td style=\"width:26.32%;height:58px;\">67.54 | 77.20</td>\n\t\t</tr>\n\t</tbody>\n</table>\nThe V3 model outperformed the V2 model in click-through rate by 36%. That is great for the business impact, since it verifies the commonly held notion that people found the aesthetically pleasing images in search results more interesting and inspiring. People enjoy eye-catching visuals that are also aesthetically beautiful. It motivates and enables users to perform actions and stimulates collaboration with pleasant interactions and leads to innovation, creativity, and positive action. Aesthetic images also encourage users to act and complete tasks.&nbsp;<br />\n&nbsp;\n<table border=\"1\" bordercolor=\"#ccc\" cellpadding=\"5\" cellspacing=\"0\" style=\"border-collapse:collapse;\" width=\"458\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td style=\"width:134px;height:22px;\">&nbsp;</td>\n\t\t\t<td style=\"width:178px;height:22px;\"><strong>Aesthetic </strong><strong>SBS Set</strong></td>\n\t\t\t<td style=\"width:147px;height:22px;\"><strong>DCG Calibration Set</strong></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"width:134px;height:21px;\">V3</td>\n\t\t\t<td style=\"width:178px;height:21px;\">1.0033</td>\n\t\t\t<td style=\"width:147px;height:21px;\">0.158</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td style=\"width:134px;height:22px;\">V2</td>\n\t\t\t<td style=\"width:178px;height:22px;\">1.9151</td>\n\t\t\t<td style=\"width:147px;height:22px;\">0.116</td>\n\t\t</tr>\n\t</tbody>\n</table>\n<br />\nTake a look yourself how the Image Aesthetic model V3 performs on <a href=\"https://www.bing.com/images/trending?FORM=ILPTRD\" target=\"_blank\">bing.com/images</a> for your search query and in <a href=\"https://www.bing.com/visualsearch?FORM=ILPVIS\" target=\"_blank\">Visual Search</a>.<br />\n<br />\nShare your experiences and provide feedback so that we can continue to improve our models.<br />\n<br />\n-&nbsp;<a href=\"https://www.linkedin.com/in/jie-chen-b55544a5/\" target=\"_blank\">Jie Chen</a>,&nbsp;<a href=\"https://www.linkedin.com/in/shenyiran/\" target=\"_blank\">Yiran Shen</a>, <a href=\"https://www.linkedin.com/in/ashishjaiman/\" target=\"_blank\">Ashish Jaiman</a>, and&nbsp;The Bing Multimedia team<br />\n<br />\n&nbsp;\n<h4><u>References</u></h4>\n<br />\n[1] <a href=\"https://www.microsoft.com/en-us/research/blog/microsoft-vision-model-resnet-50-combines-web-scale-data-and-multi-task-learning-to-achieve-state-of-the-art/\" target=\"_blank\">Microsoft Vision Model ResNet-50 combines web-scale data and multi-task learning to achieve state of the art - Microsoft Research</a><br />\n<br />\n[2] <a href=\"https://arxiv.org/pdf/1805.00309.pdf\" target=\"_blank\">An Universal Image Attractiveness Ranking Framework</a><br />\n<br />\n[3] CUHKPQ is another Aesthetic dataset with 17,613 photos. It is a mixture of high-quality images derived from photographic communities and low-quality images provided by university students.&nbsp;<br />\n<br />\n[4] <a href=\"http://refbase.cvc.uab.es/files/MMP2012a.pdf\" target=\"_blank\">AVA: A Large-Scale Database for Aesthetic Visual Analysis</a> - AVA is a large-scale database for conducting Aesthetic Visual Analysis (AVA). It contains over 250,000 images collected from the online community of photography amateurs at&nbsp;<a href=\"http://www.dpchallenge.com\" target=\"_blank\">www.dpchallenge.com</a>. The number of votes under each image indicates how aesthetically pleasing it is.&nbsp;<br />\n<br />\n<br />\n&nbsp;"
}