{
  "title": "Bias and unfairness in machine learning models: a systematic literature review. (arXiv:2202.08176v4 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2202.08176",
  "description": "<p>One of the difficulties of artificial intelligence is to ensure that model\ndecisions are fair and free of bias. In research, datasets, metrics,\ntechniques, and tools are applied to detect and mitigate algorithmic unfairness\nand bias. This study aims to examine existing knowledge on bias and unfairness\nin Machine Learning models, identifying mitigation methods, fairness metrics,\nand supporting tools. A Systematic Literature Review found 40 eligible articles\npublished between 2017 and 2022 in the Scopus, IEEE Xplore, Web of Science, and\nGoogle Scholar knowledge bases. The results show numerous bias and unfairness\ndetection and mitigation approaches for ML technologies, with clearly defined\nmetrics in the literature, and varied metrics can be highlighted. We recommend\nfurther research to define the techniques and metrics that should be employed\nin each case to standardize and ensure the impartiality of the machine learning\nmodel, thus, allowing the most appropriate metric to detect bias and unfairness\nin a given context.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Pagano_T/0/1/0/all/0/1\">Tiago Palma Pagano</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Loureiro_R/0/1/0/all/0/1\">Rafael Bessa Loureiro</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lisboa_F/0/1/0/all/0/1\">Fernanda Vit&#xf3;ria Nascimento Lisboa</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cruz_G/0/1/0/all/0/1\">Gustavo Oliveira Ramos Cruz</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Peixoto_R/0/1/0/all/0/1\">Rodrigo Matos Peixoto</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Guimaraes_G/0/1/0/all/0/1\">Guilherme Arag&#xe3;o de Sousa Guimar&#xe3;es</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Santos_L/0/1/0/all/0/1\">Lucas Lisboa dos Santos</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Araujo_M/0/1/0/all/0/1\">Maira Matos Araujo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cruz_M/0/1/0/all/0/1\">Marco Cruz</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Oliveira_E/0/1/0/all/0/1\">Ewerton Lopes Silva de Oliveira</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Winkler_I/0/1/0/all/0/1\">Ingrid Winkler</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Nascimento_E/0/1/0/all/0/1\">Erick Giovani Sperandio Nascimento</a>"
}