{
  "title": "Robots and AI Could Optimize Lithium-Ion Batteries",
  "link": "https://spectrum.ieee.org/lithium-ion-battery",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/battery-icon-with-lightning-bolts-on-sides.jpg?id=31888618&width=1200&height=400&coordinates=0%2C400%2C0%2C400\"/><br/><br/><p>Cutting-edge electronics, including electric vehicles and the latest smartphones, all depend on batteries whose chemistries are still largely developed manually by trial and error. Now, a new study reveals that artificial intelligence can direct robots in rapidly finding advanced new battery formulations. A team of scientists detailed <a href=\"https://www.nature.com/articles/s41467-022-32938-1\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a> online 27 September in the journal <em>Nature</em><em> Communications</em>.</p><p>The conventional techniques for developing new batteries can take years because researchers have to experiment with many possible components. This is complicated by the need to achieve multiple competing goals, such as longer life, greater capacity, faster charging, and improved safety.</p><p>“The kind of lithium-ion battery you might find in a Tesla EV may have one primary salt—typically lithium hexafluorophosphate—as well as two or three liquid solvents in which the salt is dissolved and one or two additives that are secret,” says  Jay Whitacre, an energy technologist at Carnegie Mellon University who was co-senior author of the <em>Nature <em>Communications</em></em> paper. “There are many compelling potential combinations of all these components, potentially with multiple salts, five or six or more solvents, multiple additives, which can be incredibly complicated to rifle through.”</p><p>In the new study, researchers sought to accelerate battery development by coupling a robotics platform named Clio with an AI called Dragonfly in order to find the best combination of battery components in an autonomous manner.</p><p>“It’s like putting peanut butter and chocolate together,” Whitacre says. “I’m the experimentalist who has always wanted to find a way to mix up chemicals for batteries in an automated way,” whereas study co-senior author Venkat Viswanathan “is the computer-modeling machine-learning person who wanted to take people out of the loop.”</p><p>In the new study, the system autonomously experimented with lithium hexafluorophosphate salt and the solvents ethylene carbonate, ethyl-methyl carbonate, and dimethyl carbonate. (In a lithium-ion battery, a salt dissolves in one or more solvents to form a liquid electrolyte. Lithium ions move from one electrolyte to another to carry electric charge.)</p><p>The robotic system used pumps to inject various combinations of solvents into pouches with a lithium nickel manganese cobalt oxide cathode and a graphite anode. “There wasn’t a person telling the system what to do; the system decided what to do,” Whitacre says.</p><p>In 42 experiments over two working days, the system autonomously identified six electrolytes that enable faster charging than a conventional electrolyte composition. This approach hit upon the new chemistry six times as fast as it would likely have taken to discover it via a random search.</p><p>The researchers note their system likely performs more experimental measurements per day than an average human operator and uses about 30 percent as many lab materials. In the future, they suggest their system may prove 20 to 1,000 times as efficient as people doing this work.</p><p>The sole goal of these experiments was a faster-charging battery. However, the scientists note this system can also pursue multiple objectives simultaneously.</p><p>“As we dive more and more into this project, we’re aiming at true exploration and discovery with more complicated possible combinations of electrolytes placed into many test cells to see what does and does not work,” Whitacre says.</p>",
  "pubDate": "Tue, 11 Oct 2022 13:00:01 +0000",
  "guid": "https://spectrum.ieee.org/lithium-ion-battery",
  "category": [
    "Robotics",
    "Artificial intelligence",
    "Electric vehicles",
    "Smartphones",
    "Mobile devices",
    "Electrolytes",
    "Tesla",
    "Lithium-ion batteries"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}