{
  "title": "Thoughts on Sapiens by Yuval Noah Harari",
  "link": "https://awjuliani.medium.com/thoughts-on-sapiens-by-yuval-noah-harari-4d448b2ffe24?source=rss-18dfe63fa7f0------2",
  "guid": "https://medium.com/p/4d448b2ffe24",
  "category": [
    "philosophy",
    "evolution",
    "psychology",
    "biology"
  ],
  "dc:creator": "Arthur Juliani",
  "pubDate": "Sat, 05 Dec 2020 20:36:26 GMT",
  "atom:updated": "2020-12-05T20:38:40.198Z",
  "content:encoded": "<h3>Thoughts on “Sapiens”</h3><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/880/1*nYJbIEVwws5DeINBLcNkQg.jpeg\" /></figure><p><em>Sapiens by Yuval Noah Harari was released in English in 2014, but it was not until last month that I finally read it. As such, the thoughts presented here are likely not new. Though, I hope they are at least of interest.</em></p><p>Before reading <em>Sapiens</em>, my only experience with Harari was watching about fifteen minutes of an interview he gave at Google for his more recent book <em>Homo Deus</em>, which was published in English in 2016. I don’t perfectly remember the conversation but it was far enough into gene editing and cognitive enhancement that I felt I had heard enough. It seemed more or less the same set of sci-fi prophetic ideas Ray Kurzweil has been advocating for the past couple decades. Hearing these ideas led to a vague apprehension about Harari as an intellectual, which consequently delayed my picking up <em>Sapiens</em> until recently.</p><p>Still, when I finally felt compelled to read it this year, after the recommendation of a few friends, I did my best to go into the book with an open mind. Ancient history, human psychology, and evolutionary theory are all topics which I have always enjoyed reading and thinking about. I also enjoy reading bold takes on providing big picture theories about human nature. In many cases, the more outlandish or ambitious the theory is, the more fun it is to read. I went into <em>Sapiens</em> expecting just that, a bold new theory about human nature based on a sweeping integration of prehistoric and ancient-historical sources. Unfortunately, I found myself disappointed. Not only are there no major new theories presented by Harari in the book, but the concepts he does present are philosophically problematic upon anything deeper than a surface-level reading.</p><p>True, there is still much to recommend in the book. <em>Sapiens</em> starts strongly enough, as Harari sets the stage with a discussion of primate evolution and the early landscape of the genus Homo as it evolved many millions of years ago. It is here where Harari’s perspective as a historian provides the insight to tell a compelling story about the beginning of our species, Homo Sapiens. I found myself entertained and engaged by his clear and colorful language. I also admired his willingness to cut against certain idealist pictures of ancient peoples. The description of how ancient hunter-gatherers were responsible for various mass extinctions helps to put humans’ current role in ecological destruction into better context. His explanation of the disaster that was the agricultural revolution, and why it was locally optimal for the individuals who slowly instituted it was likewise fascinating. Not much further after that, I started to have my doubts about the story being presented though. This happened as Harari began to speculate about the cognitive experiences of these early humans, and how these may have given them the edge necessary to start down the path toward becoming the dominant species that we are today.</p><p>While it is clear that he is a gifted historian and storyteller, it struck me that Harari is much less of a philosopher. Philosophers deal with, among other things, the nature of knowledge and truth, two concepts central to Harari’s story of humankind. Harari attempts to provide a macro-scale perspective on Homo Sapiens as a species, a perspective which tries to be as objective as possible. As a historian, taking an objective perspective is appealing, since so many previous stories of our species tend to become bogged down in whatever ideology prevails during the time of its composition. Harari himself calls out a number of various ideologies, such as those held by ancient Romans, or those held by early American colonizers. Speaking objectively is a difficult thing though, and Harari falls into the same pitfalls as so many of his predecessors, both ancient and modern. As <em>Sapiens</em> progresses, the particulars of the modern scientific ideology strongly influence the story Harari tells, to the point that I couldn’t help but begin to question the soundness of the story itself.</p><p>Harari proposes that the main development which made Homo Sapiens so successful as a species is the ability to create and share what he refers to as cognitive fictions, or imagined realities. These fictions can be thought of as abstract concepts which a human might be able to mentally represent, but which does not have a real physical correlate in the world. According to Harari, the development of this capacity for such fictions enabled the cultural and technological advancements which led to our species domination of the planet. Harari provides example after example of these fictions, such as human systems of laws, objects of spiritual practice, and monetary systems. Abstracted beyond the individual, these can be thought of as belief systems, which are maintained by a community over time. In explaining these cognitive fictions, Harari seems to paint a picture in black and white though. Either a mental representation corresponds to true reality, or it is a cognitive fiction, there is no discussion of the all important in-between. My personal view is that most mental representations do indeed exist in-between, with each taking some level of truthfulness, or correspondence to a grounding in reality.</p><p>For example, Harari makes the comparison between belief in the legal entity of a company and belief in a particular deity in a religious context. He suggests that both of these are useful cognitive fictions, which enable certain kinds of human organization. In discussing these two together, Harari suggests that both are equally unreal. It struck me that to so casually group these two things together might not be so justified. As I see it, the belief in a corporation can be thought of as a kind of invention, a cultural game which everyone is in on, but everyone knows is a game. In contrast, belief in a deity is a kind of discovery, which some take on face value, and others verify for themselves. While the reality of various spiritual practices is up for ample debate, the phenomenological evidence which a person who undergoes a religious experience receives is not of the same order as that of the belief in a corporation. Yet, Harari treats these as both simply things humans have made up to serve other purposes.</p><p>Later in the text, Harari compares the beliefs the Founding Fathers of the United States espoused in the declaration of independence to those of the Babylonian King Hammurabi. The implication of this comparison is that both sets of beliefs -those of universal human equality, or those of universal human inequality — are cognitive fictions, and are likewise equally unreal. Harari then employs the “objective” findings of biology and evolutionary psychology as the golden measure by which the fictitiousness of both belief systems could be demonstrated. In doing so, Harari ignores the fact that modern biology is based on a system of intersubjective agreement with exactly the same dynamics as the beliefs of the Babylonians or the early colonizers of the United States. By Harari’s own definition, the theory of evolution by natural selection is as much of a cognitive fiction as any other example in his book, let this is nowhere acknowledged by him. The three sets of beliefs are not of a different type, with modern knowledge somehow being categorically true, and the prior belief systems being categorically untrue. Each can be seen as only having a different quantity of truthfulness, with modern biology representing the accumulation of greater intersubjective agreement. However, just like other belief systems, there is no guarantee that contemporary biological theories are completely true. As such, it is just as mutable as any other fiction. Such a nuance in the discussion is not provided by Harari. Instead, he uses biology to point out the arbitrariness of past beliefs, then moves on to the next topic.</p><p>Throughout the course of the book, Harari again and again relies on the “objectivity” of modern sciences to provide authority to his arguments. This culminates in the final chapter as Harari takes up the Kurzweilian mantle and makes vague gestures towards a possible future for the human species, name-dropping cyborgs and the singularity along the way. As some who have studied belief in the singularity <a href=\"https://aeon.co/essays/why-is-the-language-of-transhumanists-and-religion-so-similar\">point out</a>, it is as much a religious belief as a scientific one. And it is here that we find Harari himself engaging most clearly in the cognitive fictions of our current age. At their best, practicing scientists make a point of avoiding such scientific dogmatism, and instead appeal to skepticism of their findings, treating all knowledge as conditional. It is much more often exercised by those looking to shore up their own arguments with an appeal to the objective, wherever they think they can find it.</p><p>Of course it is impossible to write an objective history of humanity, and I can’t fault Harari for trying. The popularity of the book speaks to the extent to which its accessibility and clear writing have sparked the imaginations of many readers. It is a compelling story, but like all compelling stories, it shouldn’t be mistaken for truth.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=4d448b2ffe24\" width=\"1\" height=\"1\" alt=\"\">"
}