{
  "id": "https://bibleinoneyear.org/en/youth/176",
  "title": "Day 176: The Power of Prayer",
  "description": "Proverbs 15:29, 1 Kings 15:4–5, Acts 16:16–19,22–28.  It is, as Charles Haddon Spurgeon put it, ‘the slender nerve that moves the muscles of omnipotence ’ Prayer has the power to change circumstances, other people and even the course of history",
  "pubDate": "Sat, 25 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/176/",
  "itunes:duration": "14:25",
  "guid": "enyouth25062022-176",
  "length": 865.38,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 176: The Power of Prayer",
  "itunes:subtitle": "Proverbs 15:29, 1 Kings 15:4–5, Acts 16:16–19,22–28.  It is, as Charles Haddon Spurgeon put it, ‘the slender nerve that moves the muscles of omnipotence ’ Prayer has the power to change circumstances, other people and even the course of history",
  "itunes:summary": "Six years ago, The Archbishop of Canterbury, Justin Welby and Pete Greig (founder of 24-7 Prayer) launched an initiative calling hundreds of thousands of Christians, of many churches and denominations to a great wave of prayer for the evangelisation of the nations during the week before Pentecost Sunday. Before COVID-19, the week culminated in beacon events in packed cathedrals and churches around the world over the Pentecost weekend. Justin Welby, asked people to pray for three things: ‘That all Christians find new life in Jesus Christ… That all those you meet… might see something of Jesus… For the church to overflow with the reality of the presence of Jesus.’\nPete Greig has described it as ‘a groundswell; a movement from the grassroots up’. He said he had been very moved to hear of one boy who’d prayed for five friends, three of whom had since become Christians!\nPrayer is spiritual nutrition. Just as the body needs physical food, so the soul needs spiritual food. Prayer changes us. However, the Bible goes much further than this. Prayer is powerful. It is, as Charles Haddon Spurgeon put it, ‘the slender nerve that moves the muscles of omnipotence.’ Prayer has the power to change circumstances, other people and even the course of history.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 541
}