{
  "id": "yt:video:r8c6ws9Tow0",
  "yt:videoId": "r8c6ws9Tow0",
  "yt:channelId": "UCTdw38Cw6jcm0atBPA39a0Q",
  "title": "A Preview of C++ 23 - Daniela Engert - NDC TechTown 2022",
  "link": "",
  "author": {
    "name": "NDC Conferences",
    "uri": "https://www.youtube.com/channel/UCTdw38Cw6jcm0atBPA39a0Q"
  },
  "published": "2022-11-03T14:14:13+00:00",
  "updated": "2022-11-04T08:51:37+00:00",
  "media:group": {
    "media:title": "A Preview of C++ 23 - Daniela Engert - NDC TechTown 2022",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "C++20 was big - very big indeed. Some even say it had brought so many innovations that it might overwhelm not only users, but also the compiler developers and standard library implementers, so that the C++ committee better was not to bring any major innovations in C++23. Nevertheless, there was of course a bold plan for all the exciting new things that should be prioritised as goals for the upcoming standard. And then came the pandemic and with it - by necessity - new approaches of working together on the specification of C++23.\n\nIn the meantime, it has been largely clarified what we can expect with the upcoming standard. Major deviations from it are unlikely to happen, but minor things that are already in the pipeline may still be added in the coming months.\n\nI will present the following main points:\n\n1) what was the Bold Plan that guided us through three years of development?\n2) what is already included in the draft and what is likely to be included?\n3) what could unfortunately not be finished in time?\n4) which changes also affect C++20?\n5) where do the implementations of the major compilers stand in terms of implementation?\n6) show a few highlights from C++23 in code examples\n\n\nCheck out more of our featured speakers and talks at\nhttps://www.ndcconferences.com\nhttps://ndctechtown.com/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}