{
  "title": "Ben Franklin: Founding Father of Microfinance and Open-Source Tech",
  "itunes:title": "Ben Franklin: Founding Father of Microfinance and Open-Source Tech",
  "pubDate": "Sun, 02 Oct 2022 04:00:00 +0000",
  "guid": "536b69c9-4bec-4097-926e-117574aafb26",
  "link": "https://fool.libsyn.com/ben-franklin-founding-father-of-microfinance-and-open-source-tech",
  "itunes:image": "",
  "description": "<p>If you want someone to manage your money then you better pay them. That’s just one lesson from Ben Franklin’s complicated financial life.<br /> <br /> Robert Brokamp talks with Michael Meyer, author of “Benjamin Franklin's Last Bet: The Favorite Founder's Divisive Death, Enduring Afterlife, and Blueprint for American Prosperity” about:<br /> - Franklin's mistakes in estate planning<br /> - The power of small, anonymous donations<br /> - Other fun facts about America's first celebrity<br /> <br /> Host: Robert Brokamp<br /> Guest: Michael Meyer<br /> Producer: Ricky Mulvey<br /> Engineer: Rick Engdahl<br /> <br /></p>",
  "content:encoded": "<p>If you want someone to manage your money then you better pay them. That’s just one lesson from Ben Franklin’s complicated financial life.  Robert Brokamp talks with Michael Meyer, author of “Benjamin Franklin's Last Bet: The Favorite Founder's Divisive Death, Enduring Afterlife, and Blueprint for American Prosperity” about: - Franklin's mistakes in estate planning - The power of small, anonymous donations - Other fun facts about America's first celebrity  Host: Robert Brokamp Guest: Michael Meyer Producer: Ricky Mulvey Engineer: Rick Engdahl </p>",
  "enclosure": "",
  "itunes:duration": "27:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "If you want someone to manage your money then you better pay them. That’s just one lesson from Ben Franklin’s complicated financial life.  Robert Brokamp talks with Michael Meyer, author of “Benjamin Franklin's Last Bet: The Favorite Founder's...",
  "itunes:episodeType": "full"
}