{
  "id": "yt:video:R_KACvTxAQo",
  "yt:videoId": "R_KACvTxAQo",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "The Serotonin 2A Receptor Pt. 2: Effects on thinking and behaviour | The Psychedelic Brain Receptor",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2021-04-09T16:44:05+00:00",
  "updated": "2022-09-08T02:09:19+00:00",
  "media:group": {
    "media:title": "The Serotonin 2A Receptor Pt. 2: Effects on thinking and behaviour | The Psychedelic Brain Receptor",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is the second video in my two part series on the serotonin 2A (aka 5-HT2A) receptor - the brain receptor most important for psychedelic drug effects!\n\nFollowing up on my last video where I described this receptor's effects on the brain, here I dive into the latest theoretical perspectives on what this fascinating brain receptor does in terms of our thinking and behaviour - both with psychedelics and when activated outside the context of drugs.\n\n*** After reflecting on the video - I wanted to add that additional events that could induce serotonin 2A activation could be major life events: a death of a loved one, the end of a break up, getting fired from a job, being extremely overwhelmed by stress related to work or family, etc. An interesting link here is between 2A activation and what some have called 'spiritual emergencies' or 'the dark night of the soul'.\n\nThe video's organization is inspired by the following paper:https://journals.sagepub.com/doi/full/10.1177/0269881117725915\n\nEnjoy!\n\n---\n\nDon't forget to follow me on social media for all the latest updates. Especially Instagram where I post the most!\n\nInstagram\nhttps://www.instagram.com/thepsychede... \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychede... \n\nMore info about me:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}