{
  "title": "Danielle Henderson on THE UGLY CRY",
  "pubDate": "Thu, 10 Jun 2021 04:00:00 +0000",
  "guid": "6c1e619d-53e0-4c94-ac22-4a4770ec5cef",
  "link": "http://pouredover.libsyn.com/danielle-henderson-on-the-ugly-cry",
  "itunes:image": "",
  "description": "<p>You might know Danielle Henderson as the creator of the legendary feminist Ryan Gosling meme (which she later turned into a book); or from her most excellent recaps of Scandal and other shows for Vulture; her work as a television writer; or as the co-host of the screamingly funny movie podcast, I SAW WHAT YOU DID. Danielle’s memoir, THE UGLY CRY, is the unforgettable, darkly comic, true story of her unconventional childhood in the 80s — it’s a complex and wry do-I-laugh-or-do-I-cry memoir, and Danielle’s sublime writing is smart and sharp and not to be missed, but just wait until you meet her wise, horror-movie loving grandmother.<br /> Featured books: The Ugly Cry by Danielle Henderson, Me Talk Pretty One Day by David Sedaris and Running with Scissors by Augusten Burroughs. Hosted and produced by Miwa Messer and engineered by Harry Liang.</p> <div> <div>Follow us here for new episodes on Tuesdays and Thursdays. </div> </div>",
  "content:encoded": "<p>You might know Danielle Henderson as the creator of the legendary feminist Ryan Gosling meme (which she later turned into a book); or from her most excellent recaps of Scandal and other shows for Vulture; her work as a television writer; or as the co-host of the screamingly funny movie podcast, I SAW WHAT YOU DID. Danielle’s memoir, THE UGLY CRY, is the unforgettable, darkly comic, true story of her unconventional childhood in the 80s — it’s a complex and wry do-I-laugh-or-do-I-cry memoir, and Danielle’s sublime writing is smart and sharp and not to be missed, but just wait until you meet her wise, horror-movie loving grandmother. Featured books: The Ugly Cry by Danielle Henderson, Me Talk Pretty One Day by David Sedaris and Running with Scissors by Augusten Burroughs. Hosted and produced by Miwa Messer and engineered by Harry Liang.</p>  Follow us here for new episodes on Tuesdays and Thursdays.  ",
  "enclosure": "",
  "itunes:duration": "38:12",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "You might know Danielle Henderson as the creator of the legendary feminist Ryan Gosling meme (which she later turned into a book); or from her most excellent recaps of Scandal and other shows for Vulture; her work as a television writer; or as the...",
  "itunes:episodeType": "full"
}