{
  "id": "yt:video:uncm8DChdhc",
  "yt:videoId": "uncm8DChdhc",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "The Most Beautiful Result in Classical Mechanics",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2022-01-01T20:41:13+00:00",
  "updated": "2022-08-19T15:50:16+00:00",
  "media:group": {
    "media:title": "The Most Beautiful Result in Classical Mechanics",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Noether's theorem says that a symmetry of a Lagrangian implies a conservation law. But to fully appreciate the connection we need to go to Hamiltonian mechanics and see how symmetries act on phase space! Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nThe connection between symmetries and conservation laws is one of the deepest relationships in physics. Noether's theorem says that for every continuous symmetry of a Lagrangian, you'll find a corresponding conserved quantity. But to fully understand the connection between the two, we need to investigate their relationship in Hamiltonian mechanics. Any function on phase space generates a \"flow,\" similar to how the Hamiltonian generates time evolution. Then the rate of change of any other function along the flow is given by its Poisson bracket with the generator. A quantity will be conserved if and only if the flow that it generates leaves the Hamiltonian invariant!\n\nGet all the links here: https://www.physicswithelliot.com/hamiltonian-noether-mini\n\nWatch these first!:\n\n- The principle of least action: https://youtu.be/sUk9y23FPHk\n\n- Noether's theorem: https://youtu.be/O0NYaO_OnH4\n\n- Poisson brackets: https://youtu.be/Nd4b0_vJZUk\n\nAlso check out:\n\nA 20 minute intro to Lagrangian and Hamiltonian mechanics: https://youtu.be/0DHNGtsmmH8\n\nThe relativistic action: https://youtu.be/KVk1QNTWBxQ\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}