{
  "title": "Just Stop Oil campaigners arrested at 10 Downing Street",
  "link": "https://www.rt.com/news/565770-climate-change-protesters-downing-glue/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565770-climate-change-protesters-downing-glue/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63621a112030276233161550.jpg\" /> ‘Just Stop Oil’ climate change protesters were arrested in front of the PM’s London residence after hopping a gate <br/><a href=\"https://www.rt.com/news/565770-climate-change-protesters-downing-glue/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The protest movement announced a “pause” in its “campaign of civil resistance” after rushing the PM’s residence</strong></p>\n            \n                        \n            <p>Environmental campaigners &lsquo;Just Stop Oil&rsquo; rallied outside 10 Downing Street on Tuesday to demand a moratorium on fossil fuel projects, before announcing a temporary <em>&ldquo;pause&rdquo;</em> to their controversial public stunts.</p>\n<p>Wearing bright orange vests and surrounded by a horde of photographers, the protesters hoisted themselves over a low fence before posing in front of the gates outside the prime minister&rsquo;s official residence. Others glued themselves to the road and unfurled banners.&nbsp;</p>\n<p>Police then arrived on the scene, arresting the demonstrators while a spokeswoman declared they were protesting because of government inaction on both the climate and cost-of-living crises.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">🚨 BREAKING: DOWNING STREET BLOCKED 🚨<br><br>🚧 At 11:15 this morning, 22 Just Stop Oil supporters swarmed towards the gates of Downing St. A number of them attempted to scale the gates while others sat down in the road to block the entrance, with some gluing their hands to the tarmac <a href=\"https://t.co/KzxtOUpQdH\">pic.twitter.com/KzxtOUpQdH</a></p>&mdash; Just Stop Oil ⚖️💀🛢 (@JustStop_Oil) <a href=\"https://twitter.com/JustStop_Oil/status/1587414938066239491?ref_src=twsrc%5Etfw\">November 1, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>In a Twitter thread documenting their protest, the group demanded a <em>&ldquo;serious windfall tax on big oil, without the get-out-of-jail-free tax credits that will encourage more oil and gas that we cannot afford.&rdquo;</em> The government, they said, must abandon <em>&ldquo;new oil and gas projects.&rdquo;</em>&nbsp;</p>\n<p>Another tweet, posted after the Downing Street stunt, promised to <em>&ldquo;pause [Just Stop Oil&rsquo;s] campaign of civil resistance,&rdquo;</em> declaring the reprieve was meant to give <em>&ldquo;those in the government who are in touch with reality&rdquo;</em> a chance to <em>&ldquo;consider their responsibilities to the country at this time.&rdquo;&nbsp;</em></p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">⏸ BREAKING: Just Stop Oil pause disruption<br><br>From today, Just Stop Oil will pause its campaign of civil resistance. We are giving time to those in the Government who are in touch with reality to consider their responsibilities to this country at this time. <a href=\"https://t.co/Wxs02CQ1j2\">pic.twitter.com/Wxs02CQ1j2</a></p>&mdash; Just Stop Oil ⚖️💀🛢 (@JustStop_Oil) <a href=\"https://twitter.com/JustStop_Oil/status/1587476116297682946?ref_src=twsrc%5Etfw\">November 1, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Should government ministers fail to respond adequately by Friday, however, <em>&ldquo;we will step up our legal disturbances against this traitorous government,&rdquo;</em> the group vowed, threatening new <em>&ldquo;actions&rdquo;</em> that would<em> &ldquo;be commensurate with the need to end the crime against humanity of new oil and gas developments.&rdquo;</em>&nbsp;</p>\n<p>In the last month, Just Stop Oil protesters have defaced multiple iconic artworks, including Van Gogh&rsquo;s &lsquo;Sunflowers&rsquo; and Johannes Vermeer&rsquo;s &lsquo;Girl with a Pearl Earring&rsquo;. The group is funded by the nonprofit Climate Emergency Fund, whose co-founder Aileen Getty is the heiress of Getty Oil. The fund provides grants to protesters that use &lsquo;civil disobedience&rsquo; in the service of ending fossil fuel use.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565479-climate-deface-pearl-earring-museum/\">\n            <span>READ MORE: </span>Climate protesters attack iconic painting\n        </a>\n    </p>\n\n    \n\n<p>The Climate Emergency Fund and its fellow travelers insist that they are <em>&ldquo;not trying to be popular,&rdquo;</em>&nbsp;arguing that it is better to be hated than ignored. However, others have argued stunts like Just Stop Oil&rsquo;s food fights with priceless artwork &ndash; or an earlier assault by a group protesting private jets that drenched a memorial to beloved British Covid-19 fundraiser Captain Tom with human waste &ndash; hurt the environmental cause as activists come off looking unhinged and unreasonable.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 07:23:39 +0000",
  "dc:creator": "RT"
}