{
  "id": "https://bibleinoneyear.org/en/youth/216",
  "title": "Day 216: Unity",
  "description": "Proverbs 19:11, 1 Chronicles 17:2, 18:6b,14, 1 Corinthians 1:1–2,4–7,10–13,17. Jesus died to bring reconciliation and unity  Thank God that today, all around the world, we are seeing a lowering of denominational barriers and a greater unity in the church",
  "pubDate": "Wed, 04 Aug 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/216/?ignore",
  "itunes:duration": "12:40",
  "guid": "enyouth04082021-216",
  "length": 760.97,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 216: Unity",
  "itunes:subtitle": "Proverbs 19:11, 1 Chronicles 17:2, 18:6b,14, 1 Corinthians 1:1–2,4–7,10–13,17. Jesus died to bring reconciliation and unity  Thank God that today, all around the world, we are seeing a lowering of denominational barriers and a greater unity in the church",
  "itunes:summary": "Years ago, I was speaking to a friend of mine who is not a Christian. He said this to me:\n‘I don’t understand. You Protestants and you Catholics, you look exactly the same to me. You both have church buildings that look the same. You both say the Lord’s Prayer and do stuff with bread and wine. Whatever it is you disagree about (and I have no idea what it is) has absolutely nothing to do with my life. However, whilst you are fighting each other I am not interested.’\nIt struck me then how damaging disunity is to the church and our witness to the world. No wonder Jesus prayed for ‘complete unity’ (John 17:23) and the apostle Paul was passionate that we should be ‘perfectly united’ (1 Corinthians 1:10).\nUnity is at the core of our faith. We believe in one God: Father, Son and Holy Spirit. There is unity in the Trinity. Disunity, on the other hand, has been the curse of humankind ever since Adam and Eve fell into sin.\nJesus died to bring reconciliation and unity. Thank God that today, all around the world, we are seeing a lowering of denominational barriers and a greater unity in the church.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 216
}