{
  "title": "122: A Tale of Two Thieves",
  "link": "https://audioboom.com/posts/7513444",
  "itunes:episode": 122,
  "itunes:title": "A Tale of Two Thieves",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2925,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>August 1963. Sears Crossing, Buckinghamshire, England. Fifteen men pull off \"The Great Train Robbery,\" netting today's equivalent of almost $70 million. It’s one of the most famous crimes in the history of Great Britain. Movies have been made, books have been written, LOOSE LIPPED CRIMINALS INVOLVED PULLED A PATRICK—GOT HAMMERED AND BRAGGED TO ANYONE WHO WOULD LISTEN! But the true inside story has never been told until now.  In “A Tale of Two Thieves”, we are transported back to a bygone era when criminals lived by a code, a time when the life of a thief was ALMOST honorable and every day held the potential for a new caper.<br>\n<br>\n<a href=\"https://cart.2st.com/true-crime-obsessed/2267?_ga=2.9610037.1609385445.1582578353-216236744.1581368928\"><strong>YOU GUYS WE'RE GOING TO BROADWAY!!!</strong></a><strong> THAT'S RIGHT, TCO WILL BE THE FIRST PODCAST EVER TO PLAY THE GREAT WHITE WAY!</strong> This one-night only event is happening June 1st. We're being joined by our fancy Broadway friends, we're recapping the bonkers 2018 documentary \"Frank Serpico\" AND WE WANT YOU TO COME MAKE HISTORY WITH US! There are only a handful of tickets left! <strong>Get your tickets here!<br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<strong>WE'RE LAUNCHING A NEW PODCAST!</strong> <a href=\"https://www.obsessedwithpod.com/\">(Take a listen to the preview here!) </a>\"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <a href=\"https://www.obsessedwithpod.com/\">LISTEN AND SUBSCRIBE!</a>\n</div>\n",
  "pubDate": "Tue, 25 Feb 2020 05:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-24:/posts/7513444",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}