{
  "title": "&#8220;Depressingly unbothered&#8221;",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/11/depressingly-unbothered/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/11/depressingly-unbothered/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Tue, 11 Oct 2022 13:24:31 +0000",
  "category": [
    "Political Science",
    "Sociology",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47589",
  "description": "I just finished listening to the Trojan Horse Affair podcast, and . . . ok, you might have heard about it already, it&#8217;s the story of a ridiculous hoax leading to a horrible miscarriage of justice . . . I &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/11/depressingly-unbothered/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>I just finished listening to the <a href=\"https://www.nytimes.com/interactive/2022/podcasts/trojan-horse-affair.html\">Trojan Horse Affair</a> podcast, and . . . ok, you might have heard about it already, it&#8217;s the story of a ridiculous hoax leading to a horrible miscarriage of justice . . . I agree with Brian Reed, the co-host of the show, when he says this near the end of the final episode:</p>\n<blockquote><p>Rarely is there one big revelation that undoes years of misinformation and untruth. Most decent journalism is an exercise in incremental understanding. The Trojan Horse letter though, even with my [Reed&#8217;s] tempered expectations, I was surprised by how willing people have been to let it stand unchallenged. People are depressingly unbothered that this harmful myth about Muslims persists.</p></blockquote>\n<p>This reminds me of something we&#8217;ve discussed before, that an important aspect of being a scientist is <a href=\"https://statmodeling.stat.columbia.edu/2016/06/06/29188/\">the capacity for being upset</a>.  We learn so much through the recognition and resolution of anomalies.</p>\n<p>Like Reed, I&#8217;m upset by people not getting upset by clear anomalies.  This annoyed me when New York Times columnist David Brooks <a href=\"https://statmodeling.stat.columbia.edu/2015/06/16/the-david-brooks-files-how-many-uncorrected-mistakes-does-it-take-to-be-discredited/\">promoted</a> anti-Jewish propaganda and nobody seemed to care.  (I wasn&#8217;t saying Brooks should be fired or fined or anything like that, just that the newspaper should run a goddam correction notice.)  And it annoys me when the British national and local government promotes anti-Muslim propaganda and nobody in charge seems to care.  I guess I can also say that I&#8217;m also bothered when Fox News pushes lies, but that&#8217;s a little different because they&#8217;re just in the propaganda business.  We get worked up in a different way about Brooks and the U.K. government because it doesn&#8217;t seem like their original goal is to lie; rather, they act as a sort of flypaper, attracting stories that fit their preconceptions and then sticking with them even after they&#8217;ve been refuted.</p>\n<p>Anyway, to return to the title of this post:  in addition to being bothered by lies, I&#8217;m bothered by how unbothered people are about them.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/11/depressingly-unbothered/feed/",
  "slash:comments": 13
}