{
  "id": "https://bibleinoneyear.org/en/youth/190",
  "title": "Day 190: Trust in the Lord",
  "description": "Psalm 82:3,8, 2 Kings 18:5–36, Acts 27:13–25.  The people of God in the Bible looked out on a world of suffering  But they trusted in the Lord despite what they saw",
  "pubDate": "Fri, 09 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/190/?ignore",
  "itunes:duration": "14:08",
  "guid": "enyouth09072021-190",
  "length": 848.74,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 190: Trust in the Lord",
  "itunes:subtitle": "Psalm 82:3,8, 2 Kings 18:5–36, Acts 27:13–25.  The people of God in the Bible looked out on a world of suffering  But they trusted in the Lord despite what they saw",
  "itunes:summary": "One of the biggest obstacles to faith is the suffering of the innocent. It is usually one of the first questions raised in an Alpha small group: ‘If there is a God who loves us, how come there is so much suffering in the world? How come there is such injustice and oppression?\nThese are very important and necessary questions but there are no easy answers. Yet God is able to meet us in the midst of suffering and struggles. Extraordinarily, it is often the people who have gone through the greatest suffering who have the strongest faith. They testify to the presence of God with them, strengthening and comforting them in the midst of their pain. Betsie ten Boom, as she lay dying in Ravensbrück concentration camp, turned to her sister Corrie and said, ‘We must tell them that there is no pit so deep that He is not deeper still. They will listen to us, Corrie, because we have been here.’\nFaith involves trusting in the Lord. The people of God in the Bible looked out on a world of suffering. But they trusted in the Lord despite what they saw.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 190
}