{
  "title": "Episode 46: &#8220;Brown-Eyed Handsome Man&#8221; by Chuck Berry",
  "link": "https://500songs.com/podcast/episode-46-brown-eyed-handsome-man-by-chuck-berry/",
  "pubDate": "Mon, 19 Aug 2019 02:00:39 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-46-brown-eyed-handsome-man-by-chuck-berry/",
  "description": "Episode forty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Brown-Eyed Handsome Man\" by the Chuck Berry Combo, and how Berry tried to square the circle of social commentary and teen appeal. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/29271529\">on \"Rock and Roll Waltz\" by Kay Starr.</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-46-brown-eyed-handsome-man/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI used two main books as reference here:\n\n<a href=\"https://amzn.to/2KW58Gj\"><em>Brown Eyed Handsome Man: The Life and Hard Times of Chuck Berry</em> by Bruce Pegg</a> is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\n<a href=\"https://amzn.to/2vgii6n\"><em>Long Distance Information: Chuck Berry's Recorded Legacy </em>by Fred Rothwell</a> is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is <a href=\"https://amzn.to/2ZpsF5A\">the double-CD <em>Gold</em></a>, which has every major track without any of the filler.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWhen we left Chuck Berry, he had just recorded and released his third single, \"Roll Over Beethoven\", the single which had established him as the preeminent mythologiser of rock and roll. Today, we're going to talk about the single that came after that, both sides of which were recorded at the same session as \"Beethoven\". Specifically, we're going to talk about a single that is as close as Berry got to being outright political.\n\nWhile these days, both sides of his next single -- \"Brown-Eyed Handsome Man\" and \"Too Much Monkey Business\" -- are considered rock and roll classics, neither hit the pop charts in 1956 when they were released. That's because, although they might not seem it at first glance now, both songs are tied in to a very different culture from the white teen one that was now dominating the rock and roll audience.\n\nTo see why, we have to look at the R&B tradition which Berry grew up in, and in particular we want to look once again at the work of Berry's hero Louis Jordan, and the particular type of entertainment he provided.\n\nYou see, while Louis Jordan was a huge star, and had a certain amount of crossover appeal to the white audience, he was someone whose biggest audience was black people, and in particular black adults.\n\nThe teenager as a separate audience for music didn't really become a thing in a conscious way until the mid-fifties. Before the rise of the doo-wop groups, R&B music, and the jump band music before it, had been aimed at a hard-working, hard-partying, adult audience, and at a defiantly working-class audience at that -- one that had a hard life, and whose reality involved cheating partners, grasping landlords, angry bosses, and a large amount of drinking when they weren't dealing with those things.\n\nBut one mistake that's always made when talking about marginalised people is to equate poverty or being a member of a racial minority with being unsophisticated. And there was a whole seam of complex, clever, ironic humour that shows up throughout the work of the jump band and early R&B musicians -- one that is very different from the cornball humour that was standard in both country music and white pop.\n\nThat style of humour is often referred to as \"hip\" or \"hep\" humour, and the early master of it was probably Cab Calloway, who was also the author of a \"hepster's dictionary\" which remained for many years the most important source for understanding black slang of the twenties through forties. Calloway also sang about it:\n\n[Excerpt: \"Jive: Page One of the Hepster's Dictionary\", Cab Calloway]\n\nThis style of humour, specific to the experiences of black people, was also the basis of much of Louis Jordan's work – and Jordan was clearly influenced by Calloway. You only have to look at songs like \"Open the Door Richard\":\n\n[Excerpt: Louis Jordan, \"Open the Door Richard\"]\n\nOr \"What's the Use of Getting Sober (When You'll Only Get Drunk Again?)\":\n\n[Excerpt: Louis Jordan, \"What's the Use of Getting Sober (When You'll Only Get Drunk Again)?\"]\n\nObviously the experience of being drunk is one that people of all races have had, but the language used there, the specific word choices, roots Jordan's work very firmly in the African-American cultural experience. Jordan did, of course, have a white audience, but he got that audience without compromising the blackness of his language and humour.\n\nThat humour disappears almost totally from the history of rock music when the white people start showing up, and there are only two exceptions to this. There are the Coasters, whose lyrics by Jerry Leiber manage to perfectly capture that cynical adult humour of the old-style jump bands, even when dealing with teenage frustrations rather than adult ones -- and we'll look at how successfully they do that in a few weeks' time.\n\nThe other exception is, of course, Chuck Berry, who would repeatedly cite Jordan as his single biggest influence. As we continue through Berry's career we will see time and again how things that appear original to him are actually Berry's take on something Louis Jordan did.\n\nBerry would later manage to couple Jordan's style of humour to the adolescent topics of school, dancing, cars, and unrequited love, rather than to the more adult topics of jobs, sex, drinking, and rent.\n\nBut, crucially, at the time we're looking at, he was not yet doing so. At the session in April 1956 which produced \"Roll Over Beethoven\", \"Drifting Heart\", \"Too Much Monkey Business\", and \"Brown-Eyed Handsome Man\", there were still relatively few signs that Berry was appealing to a white adolescent audience. \"Very few signs\" does not, of course, mean that there were no signs -- Berry would have been able to see who it was who was turning up to his live performances -- but it seems to have taken him some time to adapt his songwriting to his new audience.\n\nEven \"Roll Over Beethoven\", which was, after all, a song very specifically aimed at mythologising the new music, had referred to \"these rhythm and blues\" rather than to rock and roll. Berry was almost thirty, and he was still in a mindset of writing songs for people his own age, for the audiences that had come to see him play small clubs in St. Louis.\n\nIndeed, the record industry as a whole still saw the teenage audience as almost an irrelevance – other than Bill Haley and Alan Freed, very few people really realised how big that audience was. The combination of disposable income and the changes in technology that had led to the transistor radio and the 45rpm single meant that for the first time teenagers were buying their own records, and listening to them on their own portable radios and record players, rather than having to listen to whatever their parents were buying.\n\n1956 was the year that this new factor stopped being ignorable, and Berry would become the poet laureate of teenage America, the person who more than anyone else would create the vocabulary which would be used by everyone who followed to write about the music and the interests of white teenagers.\n\nBut at this point, Berry's music was very much not that, and both \"Too Much Monkey Business\" and \"Brown-Eyed Handsome Man\" address very, very, adult concerns.\n\n\"Brown-Eyed Handsome Man\", in particular, loses a lot of its context when heard today, but is an explicitly racialised song:\n\n[Excerpt: Chuck Berry Combo, \"Brown-Eyed Handsome Man\"]\n\nNow, it's worth looking at that opening verse in some detail -- \"arrested on charges of unemployment\" is, first of all, a funny line, but it's *also* very much the kind of trumped-up charge that black people, especially black men, would be arrested and tried for. And then we have the judge's wife getting the man freed because he's so attractive. This is a very, very, common motif in black folklore and blues mythology. For example, in \"Back Door Man\", written by Willie Dixon for Howlin' Wolf and released on Chess a few years after the time we're talking about, we have the following verse:\n\n[Excerpt: Howlin' Wolf, \"Back Door Man\"]\n\nThis is a hugely common theme in the blues -- you hear it in various versions of \"Stagger Lee\", for example. Later this would become, thanks to these blues songs, a staple of rock and pop music too -- you get the same thing in \"Maxwell's Silver Hammer\" by the Beatles, or Frank Zappa's \"The Illinois Enema Bandit\", but stripped of its original context, both those songs have a reputation, at least partly deserved, for tastelessness and misogyny.\n\nBut when this motif first came to prominence, it had a very pointed message. There is a terrible stereotype of black men as being more animal than man, and of both having insatiable sexual appetites and being irresistible to white women. This is, of course, no more true of black men than it is of any other demographic, but it was used to fuel very real moral panics about black men raping white women, which led to many men being lynched.\n\nThe trope of the women screaming out for the man to be set free, in this context, is very, very, pointed, and is owning this literally deadly negative stereotype and turning it into something to boast about.\n\nAnd then there's this verse:\n\n[Excerpt: \"Brown-Eyed Handsome Man\", Chuck Berry Combo]\n\nJackie Robinson, the first black man to play for a major league baseball team, had only started playing for the Dodgers in 1947, and was still playing when Berry recorded this. Robinson was a massively influential figure in black culture, and right from the start of his career, he was having records made about him, like this one by Count Basie:\n\n[Excerpt: Count Basie, \"Did You See Jackie Robinson Hit That Ball?\"]\n\nIt's almost impossible to state how important Jackie Robinson was to black culture in the immediate post-war period. He was a huge example of a black man breaking a colour barrier, and not only that but excelling and beating all the white people in the field. Robinson was probably the single most important figurehead for civil rights in the late forties and early fifties, even though he was -- at least in his public statements -- far more interested in his ability to play the game than he was in his ability to affect the course of American politics.\n\nWhile obviously Robinson isn't mentioned by name in Berry's lyric, the description of the baseball player is clearly meant to evoke Robinson's image.\n\nNone of the men mentioned in the song lyric are specifically stated to be black, just \"brown-eyed\" -- though there are often claims, which I've never seen properly substantiated, that the original lyric was \"brown-skinned handsome man\". That does, though, fit with Berry's repeated tendency to slightly tone down politically controversial aspects of his lyrics – \"Johnny B Goode\" originally featured a \"coloured boy\" rather than a \"country boy\", and in \"Nadine\" he was originally \"campaign shouting like a Southern Democrat\" rather than a \"Southern diplomat\".\n\nBut while the men are described in the song in deliberately ambiguous terms, the whole song is very much centred around images from black culture, and images of black men, and especially black men in contexts of white culture, usually high culture, from which they would normally be barred. Much as his idol Jordan had done earlier, Berry is repackaging black culture in a way that is relatable by a white audience, while not compromising that culture in any real way.\n\nThe flip side of \"Brown-Eyed Handsome Man\" is also interesting. \"Too Much Monkey Business\" is much more directly inspired by Jordan, but is less obviously rooted in specific black experiences. But at the same time, it is absolutely geared to adult concerns, rather than those of teenagers:\n\n[Excerpt: Chuck Berry, \"Too Much Monkey Business\"]\n\nWell, at least six of the seven verses dealt with adult concerns. Over the seven verses, Berry complains about working for the US mail and getting bills, being given the hard sell by a salesman, having a woman want him to settle down with her and get married, having to go to school every day, using a broken payphone, fighting in the war, and working in a petrol station.\n\nWith the exception of the verse about going to school, these are far more the concerns of Louis Jordan, and of records like the Drifters' \"Money Honey\" or the records Johnny Otis was making, than they are of the new white teenage audience.\n\nWhile both \"Brown-Eyed Handsome Man\" and \"Too Much Monkey Business\" made the top five on the R&B chart, they didn't hit the pop top forty -- and \"Roll Over Beethoven\" had only just scraped into the top thirty. It was plain that if Berry wanted to repeat the success of \"Maybellene\", he would have to pivot towards a new audience. He couldn't make any more records aimed at black adults. He needed to start making records aimed at white children.\n\nThat wasn't the only change he made. The \"Brown-Eyed Handsome Man\" single was the last one to be released under the name \"the Chuck Berry Combo\". There are at least two different stories about how Berry stopped working with Ebby Hardy and Johnnie Johnson. Berry always claimed that his two band members were getting drunk all the time and not capable of playing properly. Johnson, on the other hand, always said instead that the two of them got tired of all the travelling and just wanted to stay in St. Louis.\n\nJohnson would continue to play piano on many of Berry's recordings -- though from this point on he would never be the sole pianist for Berry, as many sources wrongly claim he was. From now on, Chuck Berry was a solo artist.\n\nThe first fruit of this newfound solo stardom was Berry's first film appearance. Rock! Rock! Rock! is one of the more widely-available rock and roll films now, thanks to it having entered into the public domain -- you can actually even watch the film through its Wikipedia page, which I'll link in the show notes. It's not, though, a film I'd actually recommend watching at all. The plot, such as it is, consists of Tuesday Weld wanting to buy a new dress for the prom, and her dad not wanting to give her the money, and an \"evil\" rival for Weld's boyfriend's attentions (who you can tell is evil because she has dark hair rather than being blonde like Weld) trying to get her in trouble.\n\nYou get something of an idea of the quality of the film by the fact that its writer was also its producer, who was also the composer of the incidental music and the title song:\n\n[Excerpt: \"Rock Rock Rock\", Jimmy Cavallo and the House Rockers]\n\nThat was co-written by Milton Subotsky, the film's producer, who would go on to much better and more interesting things as the co-founder of Amicus Films, a British film company that made a whole host of cheap but enjoyable horror and science fiction films. Oddly enough, we'll be meeting Subotsky again.\n\nHow important the plot is can be summed up by the fact that there is a fifteen-minute sequence in this seventy-minute film, in which Weld and her friend merely watch the TV. The programme they're watching is a fictional TV show, presented by Alan Freed, in which he introduces various rock and roll acts, and this is where Berry appears.\n\nThe song he's singing in the film is his next single, \"You Can't Catch Me\", which had actually been recorded before “Roll Over Beethoven”. But the story of the song's release is one that tells you a lot about the music business in the 1950s, and about how little the artists understood about what it was they were getting into.\n\n[Excerpt: Chuck Berry: \"You Can't Catch Me\"]\n\nAs we discussed last week when talking about Fats Domino, it wasn't normal for R&B acts to put out albums, and so it was a sign of how much the film was aimed at the white teenage audience that a soundtrack album was considered at all. It seems to have been Alan Freed's idea. Freed was the star of the film, and the acts in it -- people like Lavern Baker, the Moonglows, Johnny Burnette, and Frankie Lymon and the Teenagers -- were for the most part people he regularly featured on his radio show (along with a handful of bland white novelty acts that were included in the misguided belief that the teenage audience wanted to hear a pre-teen kid singing about rock and roll).\n\nBut of course, Freed being Freed, what that meant was that the acts he included were from record labels that would bribe him, or with which he had some kind of financial relationship, and as they were on multiple different labels, this caused problems when deciding who got to put out a soundtrack album.\n\nIn particular, both the Chess brothers, whose labels had provided the Flamingos, the Moonglows, and Berry, and Morris Levy, the gangster who controlled the career of Frankie Lymon and the Teenagers, the single biggest act in the film, wanted the right to put out a soundtrack album and profit from the publicity the film would provide. All of them were \"business associates\" of Freed -- Freed managed the Moonglows, and had been given writing credit on songs by both the Moonglows and Berry in return for playing them on his radio show, while Levy was himself Freed's manager, and had been largely responsible for getting Freed his unchallenged dominance of New York radio.\n\nSo they came to a compromise. The soundtrack album would only feature the three Chess acts who appeared in the film, and would include four songs by each of them, rather than the one song each they performed in the film. And the album would be out on Chess. But the album would include the previously-released songs that Freed was credited with co-writing, and the new songs would be published, not by the publishing companies that published those artists' songs, but by one of Levy's companies.\n\nChuck Berry was tricked into signing his rights to the song away by a standard Leonard Chess tactic -- he was called into Chess' office to receive a large royalty cheque, and Chess asked him if while he was there he would mind signing this other document that needed signing, only could he do it in a hurry, because Chess had an urgent appointment? It was six months until Berry realised that he'd signed away the rights to \"You Can't Catch Me\", and twenty-eight years before he was able to reclaim the copyright for himself.\n\nIn the meantime, the rights to that one Chuck Berry song made Levy far more money than he could possibly have expected, because of this one line:\n\n[Excerpt: Chuck Berry, \"You Can't Catch Me\"]\n\nIn 1969, John Lennon took that line and used it as the opening line for the Beatles song \"Come Together\":\n\n[Excerpt: The Beatles, \"Come Together\"]\n\nRather than go through the courts, Levy and Lennon came to an agreement -- Lennon was going to make an album of rock and roll covers, and he would include at least three songs to which Levy owned the copyright, including \"You Can't Catch Me\". As a result, even after Levy finally lost the rights to the song in the early 1980s, he still continued earning money from John Lennon's cover versions of two other songs he owned, which would never have been recorded without him having owned “You Can't Catch Me”.\n\n\"You Can't Catch Me\" was a flop, and didn't even make the R&B charts, let alone the pop charts. This even though its B-side, \"Havana Moon\", would in a roundabout way end up being Berry's most influential song:\n\n[Excerpt: Chuck Berry, \"Havana Moon\"]\n\nWe'll talk about just how influential that song was in a year or so…\n\nBerry knew he had to pivot, and fast. He wrote a new song, \"Rock and Roll Music\", which he thought could maybe have the same kind of success as \"Roll Over Beethoven\", but used the more currently-popular term rock and roll rather than talking about \"rhythm and blues\" as the earlier song did. But while he demoed that, it wasn't a song that he could be certain would directly get right into the head of every teenage kid in America.\n\nFor that, he turned to Johnnie Johnson again. For years, Johnson had had his own theme song at the Cosmopolitan Club. In its original form the song was based on \"Honky Tonk Train Blues\" by Meade \"Lux\" Lewis:\n\n[Excerpt: Meade \"Lux\" Lewis, \"Honky Tonk Train Blues\"]\n\nJohnson's own take on the song had kept Lewis' intro, and had been renamed \"Johnnie's Boogie\":\n\n[Excerpt: Johnnie Johnson, \"Johnnie's Boogie\"]\n\nJohnson suggested to Berry that they take that intro and have Berry play the same thing, but on the guitar. When he did, they found that when he played his guitar, it was like ringing a bell -- a school bell, to be precise. And that gave Berry the idea for the lyric:\n\n[Excerpt: Chuck Berry, \"School Day\"]\n\n\"School Day\" was the pivot point, the song with which Chuck Berry turned wholly towards teenage concerns, and away from those of adults. The description of the drudgery of life in school was not that different from the descriptions of working life in \"Too Much Monkey Business\", but it was infinitely more relatable to the new young rock and roll audience than anything in the earlier song.\n\nAnd not only that, the slow trudge of school life gets replaced, in the final verses, with an anthem to the new music:\n\n[Excerpt: Chuck Berry, \"School Day\"]\n\n\"School Day\" became the biggest-selling single ever to be released by Chess to that point. It hit number one on the R&B charts, knocking \"All Shook Up\" by Elvis off the top, and made number five on the Billboard pop charts. It charted in the UK, which given Chess' lack of distribution over here at that point was a minor miracle, and it stayed on the Billboard pop chart for an astonishing six months.\n\n\"School Day\" was successful enough that Berry was given an album release of his own. \"After School Session\" was a compilation of tracks Berry had released as either the A- or B-sides of singles, including \"School Day\", \"Brown-Eyed Handsome Man\", \"Too Much Monkey Business\", and \"Havana Moon\", but not including \"You Can't Catch Me\" or the other songs on the \"Rock Rock Rock\" compilation. It was filled out with a couple of generic blues instrumentals, but was otherwise a perfect representation of where Berry was artistically, right at this turning point. And that shows even in the title of the record.\n\nThe name \"After School Session\" obviously refers to \"School Day\", and to the kids in the song going to listen to rock and roll after school ended, but it was also a tip of the hat to another song, one which may have inspired the lyrics to \"School Day\" in much the same way that Meade \"Lux\" Lewis had inspired the music:\n\n[Excerpt: Louis Jordan, \"After School Swing Session (Swinging With Symphony Sid)\"]\n\nEven at his most up-to-date, Chuck Berry was still paying homage to Louis Jordan.\n\n\"School Day\" was the point where Chuck Berry went from middling rhythm and blues star to major rock and roll star, and his next twelve records would all make the Billboard pop charts. 1957 was going to be Chuck Berry's year, and we'll hear how in a few weeks time, when we look at another Louis Jordan influenced song, about a kid who played the guitar...",
  "itunes:subtitle": "Episode forty-six of A History of Rock Music in Five Hundred Songs looks at Brown-Eyed Handsome Man by the Chuck Berry Combo, and how Berry tried to square the circle of social commentary and teen appeal. Click the full post to read liner notes, links to",
  "itunes:keywords": "Alan Freed,Chess Records,Chuck Berry,John Lennon,Johnnie Johnson,lawsuits,Louis Jordan,Milton Subotsky,Morris Levy,racism",
  "itunes:episodeType": "full",
  "itunes:episode": 46,
  "content:encoded": "Episode forty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Brown-Eyed Handsome Man\" by the Chuck Berry Combo, and how Berry tried to square the circle of social commentary and teen appeal. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/29271529\">on \"Rock and Roll Waltz\" by Kay Starr.</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-46-brown-eyed-handsome-man/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI used two main books as reference here:\n\n<a href=\"https://amzn.to/2KW58Gj\"><em>Brown Eyed Handsome Man: The Life and Hard Times of Chuck Berry</em> by Bruce Pegg</a> is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\n<a href=\"https://amzn.to/2vgii6n\"><em>Long Distance Information: Chuck Berry's Recorded Legacy </em>by Fred Rothwell</a> is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is <a href=\"https://amzn.to/2ZpsF5A\">the double-CD <em>Gold</em></a>, which has every major track without any of the filler.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWhen we left Chuck Berry, he had just recorded and released his third single, \"Roll Over Beethoven\", the single which had established him as the preeminent mythologiser of rock and roll. Today, we're going to talk about the single that came after that, both sides of which were recorded at the same session as \"Beethoven\". Specifically, we're going to talk about a single that is as close as Berry got to being outright political.\n\nWhile these days, both sides of his next single -- \"Brown-Eyed Handsome Man\" and \"Too Much Monkey Business\" -- are considered rock and roll classics, neither hit the pop charts in 1956 when they were released. That's because, although they might not seem it at first glance now, both songs are tied in to a very different culture from the white teen one that was now dominating the rock and roll audience.\n\nTo see why, we have to look at the R&B tradition which Berry grew up in, and in particular we want to look once again at the work of Berry's hero Louis Jordan, and the particular type of entertainment he provided.\n\nYou see, while Louis Jordan was a huge star, and had a certain amount of crossover appeal to the white audience, he was someone whose biggest audience was black people, and in particular black adults.\n\nThe teenager as a separate audience for music didn't really become a thing in a conscious way until the mid-fifties. Before the rise of the doo-wop groups, R&B music, and the jump band music before it, had been aimed at a hard-working, hard-partying, adult audience, and at a defiantly working-class audience at that -- one that had a hard life, and whose reality involved cheating partners, grasping landlords, angry bosses, and a large amount of drinking when they weren't dealing with those things.\n\nBut one mistake that's always made when talking about marginalised people is to equate poverty or being a member of a racial minority with being unsophisticated. And there was a whole seam of complex, clever, ironic humour that shows up throughout the work of the jump band and early R&B musicians -- one that is very different from the cornball humour that was standard in both country music and white pop.\n\nThat style of humour is often referred to as \"hip\" or \"hep\" humour, and the early master of it was probably Cab Calloway, who was also the author of a \"hepster's dictionary\" which remained for many years the most important source for understanding black slang of the twenties through forties. Calloway also sang about it:\n\n[Excerpt: \"Jive: Page One of the Hepster's Dictionary\", Cab Calloway]\n\nThis style of humour, specific to the experiences of black people, was also the basis of much of Louis Jordan's work – and Jordan was clearly influenced by Calloway. You only have to look at songs like \"Open the Door Richard\":\n\n[Excerpt: Louis Jordan, \"Open the Door Richard\"]\n\nOr \"What's the Use of Getting Sober (When You'll Only Get Drunk Again?)\":\n\n[Excerpt: Louis Jordan, \"What's the Use of Getting Sober (When You'll Only Get Drunk Again)?\"]\n\nObviously the experience of being drunk is one that people of all races have had, but the language used there, the specific word choices, roots Jordan's work very firmly in the African-American cultural experience. Jordan did, of course, have a white audience, but he got that audience without compromising the blackness of his language and humour.\n\nThat humour disappears almost totally from the history of rock music when the white people start showing up, and there are only two exceptions to this. There are the Coasters, whose lyrics by Jerry Leiber manage to perfectly capture that cynical adult humour of the old-style jump bands, even when dealing with teenage frustrations rather than adult ones -- and we'll look at how successfully they do that in a few weeks' time.\n\nThe other exception is, of course, Chuck Berry, who would repeatedly cite Jordan as his single biggest influence. As we continue through Berry's career we will see time and again how things that appear original to him are actually Berry's take on something Louis Jordan did.\n\nBerry would later manage to couple Jordan's style of humour to the adolescent topics of school, dancing, cars, and unrequited love, rather than to the more adult topics of jobs, sex, drinking, and rent.\n\nBut, crucially, at the time we're looking at, he was not yet doing so. At the session in April 1956 which produced \"Roll Over Beethoven\", \"Drifting Heart\", \"Too Much Monkey Business\", and \"Brown-Eyed Handsome Man\", there were still relatively few signs that Berry was appealing to a white adolescent audience. \"Very few signs\" does not, of course, mean that there were no signs -- Berry would have been able to see who it was who was turning up to his live performances -- but it seems to have taken him some time to adapt his songwriting to his new audience.\n\nEven \"Roll Over Beethoven\", which was, after all, a song very specifically aimed at mythologising the new music, had referred to \"these rhythm and blues\" rather than to rock and roll. Berry was almost thirty, and he was still in a mindset of writing songs for people his own age, for the audiences that had come to see him play small clubs in St. Louis.\n\nIndeed, the record industry as a whole still saw the teenage audience as almost an irrelevance – other than Bill Haley and Alan Freed, very few people really realised how big that audience was. The combination of disposable income and the changes in technology that had led to the transistor radio and the 45rpm single meant that for the first time teenagers were buying their own records, and listening to them on their own portable radios and record players, rather than having to listen to whatever their parents were buying.\n\n1956 was the year that this new factor stopped being ignorable, and Berry would become the poet laureate of teenage America, the person who more than anyone else would create the vocabulary which would be used by everyone who followed to write about the music and the interests of white teenagers.\n\nBut at this point, Berry's music was very much not that, and both \"Too Much Monkey Business\" and \"Brown-Eyed Handsome Man\" address very, very, adult concerns.\n\n\"Brown-Eyed Handsome Man\", in particular, loses a lot of its context when heard today, but is an explicitly racialised song:\n\n[Excerpt: Chuck Berry Combo, \"Brown-Eyed Handsome Man\"]\n\nNow, it's worth looking at that opening verse in some detail -- \"arrested on charges of unemployment\" is, first of all, a funny line, but it's *also* very much the kind of trumped-up charge that black people, especially black men, would be arrested and tried for. And then we have the judge's wife getting the man freed because he's so attractive. This is a very, very, common motif in black folklore and blues mythology. For example, in \"Back Door Man\", written by Willie Dixon for Howlin' Wolf and released on Chess a few years after the time we're talking about, we have the following verse:\n\n[Excerpt: Howlin' Wolf, \"Back Door Man\"]\n\nThis is a hugely common theme in the blues -- you hear it in various versions of \"Stagger Lee\", for example. Later this would become, thanks to these blues songs, a staple of rock and pop music too -- you get the same thing in \"Maxwell's Silver Hammer\" by the Beatles, or Frank Zappa's \"The Illinois Enema Bandit\", but stripped of its original context, both those songs have a reputation, at least partly deserved, for tastelessness and misogyny.\n\nBut when this motif first came to prominence, it had a very pointed message. There is a terrible stereotype of black men as being more animal than man, and of both having insatiable sexual appetites and being irresistible to white women. This is, of course, no more true of black men than it is of any other demographic, but it was used to fuel very real moral panics about black men raping white women, which led to many men being lynched.\n\nThe trope of the women screaming out for the man to be set free, in this context, is very, very, pointed, and is owning this literally deadly negative stereotype and turning it into something to boast about.\n\nAnd then there's this verse:\n\n[Excerpt: \"Brown-Eyed Handsome Man\", Chuck Berry Combo]\n\nJackie Robinson, the first black man to play for a major league baseball team, had only started playing for the Dodgers in 1947, and was still playing when Berry recorded this. Robinson was a massively influential figure in black culture, and right from the start of his career, he was having records made about him, like this one by Count Basie:\n\n[Excerpt: Count Basie, \"Did You See Jackie Robinson Hit That Ball?\"]\n\nIt's almost impossible to state how important Jackie Robinson was to black culture in the immediate post-war period. He was a huge example of a black man breaking a colour barrier, and not only that but excelling and beating all the white people in the field. Robinson was probably the single most important figurehead for civil rights in the late forties and early fifties, even though he was -- at least in his public statements -- far more interested in his ability to play the game than he was in his ability to affect the course of American politics.\n\nWhile obviously Robinson isn't mentioned by name in Berry's lyric, the description of the baseball player is clearly meant to evoke Robinson's image.\n\nNone of the men mentioned in the song lyric are specifically stated to be black, just \"brown-eyed\" -- though there are often claims, which I've never seen properly substantiated, that the original lyric was \"brown-skinned handsome man\". That does, though, fit with Berry's repeated tendency to slightly tone down politically controversial aspects of his lyrics – \"Johnny B Goode\" originally featured a \"coloured boy\" rather than a \"country boy\", and in \"Nadine\" he was originally \"campaign shouting like a Southern Democrat\" rather than a \"Southern diplomat\".\n\nBut while the men are described in the song in deliberately ambiguous terms, the whole song is very much centred around images from black culture, and images of black men, and especially black men in contexts of white culture, usually high culture, from which they would normally be barred. Much as his idol Jordan had done earlier, Berry is repackaging black culture in a way that is relatable by a white audience, while not compromising that culture in any real way.\n\nThe flip side of \"Brown-Eyed Handsome Man\" is also interesting. \"Too Much Monkey Business\" is much more directly inspired by Jordan, but is less obviously rooted in specific black experiences. But at the same time, it is absolutely geared to adult concerns, rather than those of teenagers:\n\n[Excerpt: Chuck Berry, \"Too Much Monkey Business\"]\n\nWell, at least six of the seven verses dealt with adult concerns. Over the seven verses, Berry complains about working for the US mail and getting bills, being given the hard sell by a salesman, having a woman want him to settle down with her and get married, having to go to school every day, using a broken payphone, fighting in the war, and working in a petrol station.\n\nWith the exception of the verse about going to school, these are far more the concerns of Louis Jordan, and of records like the Drifters' \"Money Honey\" or the records Johnny Otis was making, than they are of the new white teenage audience.\n\nWhile both \"Brown-Eyed Handsome Man\" and \"Too Much Monkey Business\" made the top five on the R&B chart, they didn't hit the pop top forty -- and \"Roll Over Beethoven\" had only just scraped into the top thirty. It was plain that if Berry wanted to repeat the success of \"Maybellene\", he would have to pivot towards a new audience. He couldn't make any more records aimed at black adults. He needed to start making records aimed at white children.\n\nThat wasn't the only change he made. The \"Brown-Eyed Handsome Man\" single was the last one to be released under the name \"the Chuck Berry Combo\". There are at least two different stories about how Berry stopped working with Ebby Hardy and Johnnie Johnson. Berry always claimed that his two band members were getting drunk all the time and not capable of playing properly. Johnson, on the other hand, always said instead that the two of them got tired of all the travelling and just wanted to stay in St. Louis.\n\nJohnson would continue to play piano on many of Berry's recordings -- though from this point on he would never be the sole pianist for Berry, as many sources wrongly claim he was. From now on, Chuck Berry was a solo artist.\n\nThe first fruit of this newfound solo stardom was Berry's first film appearance. Rock! Rock! Rock! is one of the more widely-available rock and roll films now, thanks to it having entered into the public domain -- you can actually even watch the film through its Wikipedia page, which I'll link in the show notes. It's not, though, a film I'd actually recommend watching at all. The plot, such as it is, consists of Tuesday Weld wanting to buy a new dress for the prom, and her dad not wanting to give her the money, and an \"evil\" rival for Weld's boyfriend's attentions (who you can tell is evil because she has dark hair rather than being blonde like Weld) trying to get her in trouble.\n\nYou get something of an idea of the quality of the film by the fact that its writer was also its producer, who was also the composer of the incidental music and the title song:\n\n[Excerpt: \"Rock Rock Rock\", Jimmy Cavallo and the House Rockers]\n\nThat was co-written by Milton Subotsky, the film's producer, who would go on to much better and more interesting things as the co-founder of Amicus Films, a British film company that made a whole host of cheap but enjoyable horror and science fiction films. Oddly enough, we'll be meeting Subotsky again.\n\nHow important the plot is can be summed up by the fact that there is a fifteen-minute sequence in this seventy-minute film, in which Weld and her friend merely watch the TV. The programme they're watching is a fictional TV show, presented by Alan Freed, in which he introduces various rock and roll acts, and this is where Berry appears.\n\nThe song he's singing in the film is his next single, \"You Can't Catch Me\", which had actually been recorded before “Roll Over Beethoven”. But the story of the song's release is one that tells you a lot about the music business in the 1950s, and about how little the artists understood about what it was they were getting into.\n\n[Excerpt: Chuck Berry: \"You Can't Catch Me\"]\n\nAs we discussed last week when talking about Fats Domino, it wasn't normal for R&B acts to put out albums, and so it was a sign of how much the film was aimed at the white teenage audience that a soundtrack album was considered at all. It seems to have been Alan Freed's idea. Freed was the star of the film, and the acts in it -- people like Lavern Baker, the Moonglows, Johnny Burnette, and Frankie Lymon and the Teenagers -- were for the most part people he regularly featured on his radio show (along with a handful of bland white novelty acts that were included in the misguided belief that the teenage audience wanted to hear a pre-teen kid singing about rock and roll).\n\nBut of course, Freed being Freed, what that meant was that the acts he included were from record labels that would bribe him, or with which he had some kind of financial relationship, and as they were on multiple different labels, this caused problems when deciding who got to put out a soundtrack album.\n\nIn particular, both the Chess brothers, whose labels had provided the Flamingos, the Moonglows, and Berry, and Morris Levy, the gangster who controlled the career of Frankie Lymon and the Teenagers, the single biggest act in the film, wanted the right to put out a soundtrack album and profit from the publicity the film would provide. All of them were \"business associates\" of Freed -- Freed managed the Moonglows, and had been given writing credit on songs by both the Moonglows and Berry in return for playing them on his radio show, while Levy was himself Freed's manager, and had been largely responsible for getting Freed his unchallenged dominance of New York radio.\n\nSo they came to a compromise. The soundtrack album would only feature the three Chess acts who appeared in the film, and would include four songs by each of them, rather than the one song each they performed in the film. And the album would be out on Chess. But the album would include the previously-released songs that Freed was credited with co-writing, and the new songs would be published, not by the publishing companies that published those artists' songs, but by one of Levy's companies.\n\nChuck Berry was tricked into signing his rights to the song away by a standard Leonard Chess tactic -- he was called into Chess' office to receive a large royalty cheque, and Chess asked him if while he was there he would mind signing this other document that needed signing, only could he do it in a hurry, because Chess had an urgent appointment? It was six months until Berry realised that he'd signed away the rights to \"You Can't Catch Me\", and twenty-eight years before he was able to reclaim the copyright for himself.\n\nIn the meantime, the rights to that one Chuck Berry song made Levy far more money than he could possibly have expected, because of this one line:\n\n[Excerpt: Chuck Berry, \"You Can't Catch Me\"]\n\nIn 1969, John Lennon took that line and used it as the opening line for the Beatles song \"Come Together\":\n\n[Excerpt: The Beatles, \"Come Together\"]\n\nRather than go through the courts, Levy and Lennon came to an agreement -- Lennon was going to make an album of rock and roll covers, and he would include at least three songs to which Levy owned the copyright, including \"You Can't Catch Me\". As a result, even after Levy finally lost the rights to the song in the early 1980s, he still continued earning money from John Lennon's cover versions of two other songs he owned, which would never have been recorded without him having owned “You Can't Catch Me”.\n\n\"You Can't Catch Me\" was a flop, and didn't even make the R&B charts, let alone the pop charts. This even though its B-side, \"Havana Moon\", would in a roundabout way end up being Berry's most influential song:\n\n[Excerpt: Chuck Berry, \"Havana Moon\"]\n\nWe'll talk about just how influential that song was in a year or so…\n\nBerry knew he had to pivot, and fast. He wrote a new song, \"Rock and Roll Music\", which he thought could maybe have the same kind of success as \"Roll Over Beethoven\", but used the more currently-popular term rock and roll rather than talking about \"rhythm and blues\" as the earlier song did. But while he demoed that, it wasn't a song that he could be certain would directly get right into the head of every teenage kid in America.\n\nFor that, he turned to Johnnie Johnson again. For years, Johnson had had his own theme song at the Cosmopolitan Club. In its original form the song was based on \"Honky Tonk Train Blues\" by Meade \"Lux\" Lewis:\n\n[Excerpt: Meade \"Lux\" Lewis, \"Honky Tonk Train Blues\"]\n\nJohnson's own take on the song had kept Lewis' intro, and had been renamed \"Johnnie's Boogie\":\n\n[Excerpt: Johnnie Johnson, \"Johnnie's Boogie\"]\n\nJohnson suggested to Berry that they take that intro and have Berry play the same thing, but on the guitar. When he did, they found that when he played his guitar, it was like ringing a bell -- a school bell, to be precise. And that gave Berry the idea for the lyric:\n\n[Excerpt: Chuck Berry, \"School Day\"]\n\n\"School Day\" was the pivot point, the song with which Chuck Berry turned wholly towards teenage concerns, and away from those of adults. The description of the drudgery of life in school was not that different from the descriptions of working life in \"Too Much Monkey Business\", but it was infinitely more relatable to the new young rock and roll audience than anything in the earlier song.\n\nAnd not only that, the slow trudge of school life gets replaced, in the final verses, with an anthem to the new music:\n\n[Excerpt: Chuck Berry, \"School Day\"]\n\n\"School Day\" became the biggest-selling single ever to be released by Chess to that point. It hit number one on the R&B charts, knocking \"All Shook Up\" by Elvis off the top, and made number five on the Billboard pop charts. It charted in the UK, which given Chess' lack of distribution over here at that point was a minor miracle, and it stayed on the Billboard pop chart for an astonishing six months.\n\n\"School Day\" was successful enough that Berry was given an album release of his own. \"After School Session\" was a compilation of tracks Berry had released as either the A- or B-sides of singles, including \"School Day\", \"Brown-Eyed Handsome Man\", \"Too Much Monkey Business\", and \"Havana Moon\", but not including \"You Can't Catch Me\" or the other songs on the \"Rock Rock Rock\" compilation. It was filled out with a couple of generic blues instrumentals, but was otherwise a perfect representation of where Berry was artistically, right at this turning point. And that shows even in the title of the record.\n\nThe name \"After School Session\" obviously refers to \"School Day\", and to the kids in the song going to listen to rock and roll after school ended, but it was also a tip of the hat to another song, one which may have inspired the lyrics to \"School Day\" in much the same way that Meade \"Lux\" Lewis had inspired the music:\n\n[Excerpt: Louis Jordan, \"After School Swing Session (Swinging With Symphony Sid)\"]\n\nEven at his most up-to-date, Chuck Berry was still paying homage to Louis Jordan.\n\n\"School Day\" was the point where Chuck Berry went from middling rhythm and blues star to major rock and roll star, and his next twelve records would all make the Billboard pop charts. 1957 was going to be Chuck Berry's year, and we'll hear how in a few weeks time, when we look at another Louis Jordan influenced song, about a kid who played the guitar...",
  "enclosure": "",
  "itunes:summary": "Episode forty-six of A History of Rock Music in Five Hundred Songs looks at \"Brown-Eyed Handsome Man\" by the Chuck Berry Combo, and how Berry tried to square the circle of social commentary and teen appeal. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Rock and Roll Waltz\" by Kay Starr..\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI used two main books as reference here:\n\nBrown Eyed Handsome Man: The Life and Hard Times of Chuck Berry by Bruce Pegg is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\nLong Distance Information: Chuck Berry's Recorded Legacy by Fred Rothwell is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nThere are a myriad Chuck Berry compilations available. The one I'd recommend if you don't have a spare couple of hundred quid for the complete works box set is the double-CD Gold, which has every major track without any of the filler.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWhen we left Chuck Berry, he had just recorded and released his third single, \"Roll Over Beethoven\", the single which had established him as the preeminent mythologiser of rock and roll. Today, we're going to talk about the single that came after that, both sides of which were recorded at the same session as \"Beethoven\". Specifically, we're going to talk about a single that is as close as Berry got to being outright political.\n\nWhile these days, both sides of his next single -- \"Brown-Eyed Handsome Man\" and \"Too Much Monkey Business\" -- are considered rock and roll classics, neither hit the pop charts in 1956 when they were released. That's because, although they might not seem it at first glance now, both songs are tied in to a very different culture from the white teen one that was now dominating the rock and roll audience.\n\nTo see why, we have to look at the R&B tradition which Berry grew up in, and in particular we want to look once again at the work of Berry's hero Louis Jordan, and the particular type of entertainment he provided.\n\nYou see, while Louis Jordan was a huge star, and had a certain amount of crossover appeal to the white audience, he was someone whose biggest audience was black people, and in particular black adults.\n\nThe teenager as a separate audience for music didn't really become a thing in a conscious way until the mid-fifties. Before the rise of the doo-wop groups, R&B music, and the jump band music before it, had been aimed at a hard-working, hard-partying, adult audience, and at a defiantly working-class audience at that -- one that had a hard life, and whose reality involved cheating partners, grasping landlords, angry bosses, and a large amount of drinking when they weren't dealing with those things.\n\nBut one mistake that's always made when talking about marginalised people is to equate poverty or being a member of a racial minority with being unsophisticated. And there was a whole seam of complex, clever, ironic humour that shows up throughout the work of the jump band and early R&B musicians -- one that is very different from the cornball humour that was standard in both country music and white pop.\n\nThat style of humour is often referred to as \"hip\" or \"hep\" humour, and the early master of it was probably Cab Calloway, who was also the author of a \"hepster's dictionary\" which remained for many years the most important source for understanding black slang of the twenties through forties. Calloway also sang about it:\n\n[Excerpt: \"Jive: Page One of the Hepster's Dictionary\", Cab Calloway]\n\nThis style of humour, specific to the experiences of black people, was also the basis o",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty-six of A History of Rock Music in Five Hundred Songs looks at \"Brown-Eyed Handsome Man\" by the Chuck Berry Combo, and how Berry tried to square the circle of social commentary and teen appeal. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Rock and Roll Waltz\" by Kay Starr..\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI used two main books as reference here:\n\nBrown Eyed Handsome Man: The Life and Hard Times of Chuck Berry by Bruce Pegg is a good narrative biography of Berry, which doesn't shy away from the less salubrious aspects of his personality, but is clearly written by an admirer.\n\nLong Distance Information: Chuck Berry's Recorded Legacy by Fred Rothwell is an extraordinarily researched look at every single recording session of Berry's career up to 2001.\n\nThere are a m",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}