{
  "title": "Banging On The Window | Scary Ghost Stories",
  "link": "https://audioboom.com/posts/8120710",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1865,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Who or what was banging on the windows of a home late in the evening?<br>\nHere is a preview of the story.<br>\n“I was at my friend’s house. She lived about 10 miles out in the country. I wanted to go outside to swing on the tire swing, but she had a bad headache, so she stayed inside. I walked the short distance to the swing. I was outside for maybe five minutes before I began to hear a banging noise. My friend had a two-story home with quite a few windows on the front of the house. So, I looked in the direction of the home thinking maybe my friend was just trying to get my attention. I was looking at the bottom level of the house because that’s where she was at watching tv. No sign of her there so I looked up in her bedroom window which is on the second floor of the home. There in the window I saw a little girl with red hair and a white dress banging on the window with her fists, screaming. What was weird is that I could hear the banging on the window, but I couldn’t hear her screaming. I ran inside to make sure my friend was okay. I ran in the house telling her name and she goes “what?” From the living room which is again on the bottom floor. I ran into the living room and she’s laying there with a rag on her head watching cartoons. She was just as I left her the first time. I asked, “were you upstairs banging on the window?” Looking at me confused Marissa replies “no? I’ve been down here the whole time.” I stated that there was no way and that I just saw her upstairs banging on the window.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 23 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-14:/posts/8120710",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}