{
  "title": "Episode 96: &#8220;The Loco-Motion&#8221; by Little Eva",
  "link": "https://500songs.com/podcast/episode-96-the-loco-motion-by-little-eva/",
  "pubDate": "Tue, 01 Sep 2020 22:28:53 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-96-the-loco-motion-by-little-eva/",
  "description": "Episode ninety-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"The Loco-Motion\" by Little Eva, and how a demo by Carole King's babysitter became one of the biggest hits of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;<a href=\"https://www.patreon.com/posts/41133358\">\"Duke of Earl\" by Gene Chandler</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemantal-96-the-loco-motion/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nThere are no biographies of Little Eva, so I've used a variety of sources, including the articles on Little Eva and The Cookies at <a href=\"http://tims.blackcat.nl/\">This Is My Story</a>. The following books were also of some use:\n\n<a href=\"https://amzn.to/3275Sz8\">A Natural Woman</a>&nbsp;is Carole King's autobiography.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a>&nbsp;by Ken Emerson is a good overview of the whole scene.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era, including articles on both Little Eva and The Cookies.\n\nThere are no decent CDs of Eva's material readily available, but I can recommend two overlapping compilations. <a href=\"https://amzn.to/3jAMHTP\">This compilation</a> contains Little Eva's only sixties album in full, along with some tracks by Carole King, the Cookies, and the Ronettes, while <a href=\"https://amzn.to/2EDT1eH\">Dimension Dolls</a> is a compilation from 1963 that overlaps substantially with that album but contains several tracks not on it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA quick note before this begins -- there is some mention of domestic violence in this episode. If that's something that might upset you, please check the transcript of the episode at 500songs.com if reading it might be easier than listening.\n\nA couple of months back, we talked about Goffin and King, and the early days of the Brill Building sound. Today we're going to take another look at them, and at a singer who recorded some of their best material, both solo and in a group, but who would always be overshadowed by the first single they wrote for her, when she was still working as their childminder. Today, we're going to look at Little Eva and \"The Loco-Motion\", and the short history of Dimension Records:\n\n[Excerpt: Little Eva, \"The Loco-Motion\"]\n\nThe story of Little Eva is intertwined with the story of the Cookies, one of the earliest of the girl groups, and so we should probably start with them. We've mentioned the Cookies earlier, in the episode on \"What'd I Say\", but we didn't look at them in any great detail. The group started out in the mid-fifties, as a group of schoolgirls singing together in New York -- Dorothy Jones, her cousin Beulah Robertson, and a friend, Darlene McRae, who had all been in the choir at their local Baptist Church. They formed a group and made their first appearance at the famous Harlem Apollo talent contests, where they came third, to Joe Tex and a vocal group called the Flairs (not, I think, any of the Flairs groups we've looked at). They were seen at that contest by Jesse Stone, who gave them the name \"The Cookies\". He signed them to Aladdin Records, and produced and co-wrote their first single, \"All-Night Mambo\". That wasn't commercially successful, but Stone liked them enough that he then got them signed to Atlantic, where he again wrote their first single for the label. That first single was relatively unsuccessful, but their second single on Atlantic, \"In Paradise\", did chart, making number nine on the R&B chart:\n\n[Excerpt: The Cookies, \"In Paradise\"]\n\nBut the B-side to that record would end up being more important to their career in the long run. \"Passing Time\" was the very first song by Neil Sedaka and Howie Greenfield to get recorded, even before Sedaka's recordings with the Tokens or his own successful solo records:\n\n[Excerpt: The Cookies, \"Passing Time\"]\n\nBut then two things happened. Firstly, one of the girls, Beulah Robertson, fell out with Jesse Stone, who sacked her from the group. Stone got in a new vocalist, Margie Hendrix, to replace her, and after one more single the group stopped making singles for Atlantic. But they continued recording for smaller labels, and they also had regular gigs as backing vocalists for Atlantic, on records like \"Lipstick, Powder, and Paint\" by Big Joe Turner:\n\n[Excerpt: Big Joe Turner, \"Lipstick, Powder and Paint\"]\n\n\"It's Too Late\" by Chuck Willis:\n\n[Excerpt: Chuck Willis, \"It's Too Late\"]\n\nAnd \"Lonely Avenue\" by Ray Charles:\n\n[Excerpt: Ray Charles, \"Lonely Avenue\"]\n\nIt was working with Ray Charles that led to the breakup of the original lineup of the Cookies -- Charles was putting together his own group, and wanted the Cookies as his backing vocalists, but Dorothy was pregnant, and decided she'd rather stay behind and continue working as a session singer than go out on the road. Darlene and Margie went off to become the core of Charles' new backing group, the Raelettes, and they would play a major part in the sound of Charles' records for the next few years. It's Margie, for example, who can be heard duetting with Charles on \"The Right Time\":\n\n[Excerpt: Ray Charles, \"The Right Time\"]\n\nDorothy stayed behind and put together a new lineup of Cookies. To make sure the group sounded the same, she got Darlene's sister Earl-Jean into the group -- Darlene and Earl-Jean looked and sounded so similar that many histories of the group say they're the same person -- and got another of her cousins, Margaret Ross, to take over the spot that had previously been Beulah's before Margie had taken her place.\n\nThis new version of the Cookies didn't really start doing much for a couple of years, while Dorothy was raising her newborn and Earl-Jean and Margaret were finishing high school. But in 1961 they started again in earnest, when Neil Sedaka remembered the Cookies and called Dorothy up, saying he knew someone who needed a vocal group.\n\nGerry Goffin and Carole King had become hot songwriters, and they'd also become increasingly interested in record production after Carole had been involved in the making of \"Will You Love Me Tomorrow?\" Carole was recording her own demos of the songs she and Goffin were writing, and was increasingly making them fully-produced recordings in their own right. The first record the new Cookies sang on was one that seems to have started out as one of these demos. \"Halfway to Paradise\" by Tony Orlando sounds exactly like a Drifters record, and Orlando was, at the time, a sixteen-year-old demo singer. My guess, and it is only a guess, is that this was a demo intended for the Drifters, that it was turned down, and so the demo was released as a record itself:\n\n[Excerpt: Tony Orlando, \"Halfway to Paradise\"]\n\nThat made the lower reaches of the Hot One Hundred, while a British cover version by Billy Fury made number three in the UK.\n\nFrom this point on, the new lineup of the Cookies were once again the premier session singers. They added extra backing vocals to a lot of the Drifters' records at this time, and would provide backing vocals for most of Atlantic's artists, as the earlier lineup had. They were also effectively the in-house backing singers for Aldon Music -- as well as singing on every Goffin and King demo, they were also singing with Neil Sedaka:\n\n[Excerpt: Neil Sedaka, \"Breaking Up is Hard to Do\"]\n\nBut it was Goffin and King who spent the most time working with the Cookies, and who pushed them as recording artists in their own right. They started with a solo record for Dorothy, \"Taking That Long Walk Home\", a song that was very much \"Will You Love Me Tomorrow?\" part two:\n\n[Excerpt: Dorothy Jones, \"Taking That Long Walk Home\"]\n\nThe Cookies were doing huge amounts of session work, working twelve hours a day, seven days a week. Dorothy Jones described being in the studio working on a King Curtis session until literally fifteen minutes before giving birth.\n\nThey weren't the only ones working hard, though. Goffin and King were writing from their Aldon offices every single day, writing songs for the Drifters, the Shirelles, Bobby Rydell, Bobby Vee, Gene Pitney, the Crickets, the Everly Brothers, and more. And on top of that they had a child and Carole King was pregnant with a second one.\n\nAnd, this being the very early 1960s, it never occurred to either Goffin or King that just because Carole King was working the exact same number of hours as Goffin, that might mean she shouldn't also be doing the housework and looking after the children with no help from Goffin. There was only one way they could continue their level of productivity, and that was to get someone in to help out Carole. She mentioned to the Cookies that she was looking for someone to help her with the children, and Earl-Jean mentioned that a nineteen-year-old acquaintance -- her friend's husband's sister -- had just moved to New York from North Carolina to try to become a singer and was looking for any work she could get while she was trying to make it. Eva Narcissus Boyd, Earl-Jean's acquaintance, moved in with Goffin and King and became their live-in childminder for $35 a week plus room and board.\n\nGoffin and King had known that Eva was a singer before they hired her, and they discovered that her voice was rather good. Not only that, but she blended well with the Cookies, and was friends with them. She became an unofficial \"fourth Cookie\", and was soon in the studio on a regular basis too -- and when she was, that meant that Eva's sister was looking after the kids, as a subcontracted babysitter.\n\nDuring this time, Don Kirshner's attitude was still that he was determined to get the next hit for every artist that had a hit. But that wasn't always possible.\n\nCameo-Parkway had, after the success they'd had with \"The Twist\", fully jumped on the dance-craze bandwagon, and they'd hit on another dance that might be the next Twist. The Mashed Potato was a dance that James Brown had been doing on stage for a few years, and in the wake of \"The Twist\", Brown had had a hit with a song about it \"(Do the) Mashed Potatoes\", which was credited to Nat Kendrick & the Swans rather than to Brown for contractual reasons:\n\n[Excerpt: Nat Kendrick and the Swans, \"(Do the) Mashed Potatoes\"]\n\nCameo-Parkway had picked up on that dance, and had done just what Kirshner always did and created a soundalike of a recent hit -- and in fact they'd mashed up, if you'll pardon the expression, two recent hits. In this case, they'd taken the sound of \"Please Mr. Postman\", slightly reworked the lyrics to be about Brown's dance, and given it to session singer Dee Dee Sharp:\n\n[Excerpt: Dee Dee Sharp, \"Mashed Potato Time\"]\n\nThat had gone to number two on the pop charts and number one on the R&B charts, and even inspired its own rip-offs, like \"The Monster Mash\" by Bobby \"Boris\" Pickett:\n\n[Excerpt: Bobby \"Boris\" Pickett and the Crypt-Kickers, \"The Monster Mash\"]\n\nSo Kirshner just assumed that Sharp would be looking for another dance hit, one that sounded just like \"Mashed Potato Time\", and got Goffin and King to write one to submit to her.\n\nUnfortunately for him, he'd assumed wrong. Cameo-Parkway was owned by a group of successful songwriters, and they didn't need outside writers bringing them hits when they could write their own. Dee Dee Sharp wasn't going to be recording Goffin and King's song.\n\nWhen he listened to the demo, Don Kirshner was astonished that they hadn't taken the song. It had \"hit\" written all over it. He decided that he was going to start his own record label, Dimension Records, and he was just going to release that demo as the single. The Cookies went into the studio to overdub another layer of backing vocals, but otherwise the record that was released was the demo Eva -- now renamed \"Little Eva\" -- had sung:\n\n[Excerpt: Little Eva, \"The Loco-Motion\"]\n\nThe record went to number one, and made Little Eva a star. It also made Gerry Goffin a successful producer, because even though Goffin and King had coproduced it, Goffin got sole production credit on this, and on other records the two produced together. According to King, Goffin was the one in the control room for their productions, while she would be on the studio floor, and she didn't really question whether what she was doing counted as production too until much later -- and anyway, getting the sole credit was apparently important to Gerry.\n\n\"The Loco-Motion\" was such a big hit that it inspired its own knockoffs, including one song cheekily called \"Little Eva\" by a group called \"The Locomotions\" &nbsp;-- so the record label would say \"Little Eva, The Locomotions\", and people might buy it by mistake. You'll be shocked to learn that that one was on a Morris Levy label:\n\n[Excerpt: The Locomotions, \"Little Eva\"]\n\nThat group featured Leon Huff, who would later go on to make a lot of much better records.\n\nMeanwhile, as Little Eva was now a star, Carole King once again had to look for a childminder. This time she insisted that anyone she hired be unable to sing, so she wouldn't keep having to do this.\n\nDimension Records was soon churning out singles, all of them involving the Cookies, and Eva, and Goffin and King. They put out \"Everybody's Got a Dance But Me\" by Big Dee Irwin, a song that excerpted \"The Loco-Motion\", \"Wah Watusi\", \"Hully Gully\" and \"Twist and Shout\" among many others, with the Cookies on backing vocals, and with Goffin as the credited producer:\n\n[Excerpt: Big Dee Irwin, \"Everybody's Got a Dance But Me\"]\n\nThat wasn't a hit, but Dimension soon released two more big hits. One was a solo single by Carole King, \"It Might as Well Rain Until September\", which went to number twenty even though its only national exposure was a disastrous appearance by King on American Bandstand which left her feeling humiliated:\n\n[Excerpt: Carole King, \"It Might as Well Rain Until September\"]\n\nHer solo performing career wouldn't properly take off for a few more years, but that was a step towards it. The Cookies also had a hit on Dimension around this point. Goffin and King had written a song called \"Chains\" for the Everly Brothers, who had recorded it but not released it:\n\n[Excerpt: The Everly Brothers, \"Chains\"]\n\nSo they gave the song to the Cookies instead, with Little Eva on additional vocals, and it made the pop top twenty, and the R&B top ten:\n\n[Excerpt: The Cookies, \"Chains\"]\n\nSeveral people have pointed out that that lyric can be read as having an element of BDSM to it, and it's not the only Goffin and King song from this period that does -- there's a 1964 B-side they wrote for Eva called \"Please Hurt Me\", which is fairly blatant:\n\n[Excerpt: Little Eva, \"Please Hurt Me\"]\n\nBut the BDSM comparison has also been made -- wrongly, in my opinion -- about one of the most utterly misguided songs that Goffin and King ever wrote -- a song inspired by Little Eva telling them that her boyfriend beat her up. They'd asked her why she put up with it, and she said that he only hit her because he loved her. They were inspired by that to write \"He Hit Me (And It Felt Like A Kiss)\", an utterly grotesque song which, in a version produced by Phil Spector for the Crystals, was issued as a single but soon withdrawn due to general horror. I won't be excerpting that one here, though it's easy enough to find if you want to.\n\n(Having said that, I should also say that while people have said that Goffin & King's material at this point flirts with BDSM, my understanding of BDSM, as it has been explained to me by friends who indulge in such activities, is that consent is paramount, so I don't think that \"He Hit Me\" should be talked about in those terms. I don't want anything I've said here to contribute to the blurring of distinctions between consensual kink and abuse, which are too often conflated).\n\nOriginally, Eva's follow-up to \"The Loco-Motion\" was going to be \"One Fine Day\", another Goffin and King song, but no matter how much Goffin and King worked on the track, they couldn't come up with an arrangement, and eventually they passed the song over to the Tokens, who solved the arrangement problems (though they kept King's piano part) and produced a version of it for the Chiffons, for whom it became a hit:\n\n[Excerpt: The Chiffons, \"One Fine Day\"]\n\nInstead, Goffin and King gave Eva \"Keep Your Hands Off My Baby\". This is, in my opinion, the best thing that Eva ever did, and it made the top twenty, though it wasn't as big a hit as \"The Loco-Motion\":\n\n[Excerpt: Little Eva, \"Keep Your Hands Off My Baby\"]\n\nAnd Eva also appeared on another Cookies record, \"Don't Say Nothing Bad About My Baby\", which made the top ten:\n\n[Excerpt: The Cookies, \"Don't Say Nothing Bad About My Baby\"]\n\nThe Cookies, Eva, and Goffin and King were such a package deal that Dimension released an album called Dimension Dolls featuring the first few hits of each act and padded out with demos they'd made for other artists. &nbsp;This hit-making machine was so successful for a brief period in 1962 and 63 that even Eva's sister Idalia got in on the act, releasing a song by Goffin, King, and Jack Keller, \"Hula Hoppin'\":\n\n[Excerpt: Idalia Boyd, \"Hula Hoppin'\"]\n\nFor Eva's third single, Gerry Goffin and Jack Keller wrote a song called \"Let's Turkey Trot\", which also made the top twenty. But that would be the last time that Eva would have a hit of her own.\n\nAt first, the fact that she had a couple of flop singles wasn't a problem -- no artists at this time were consistent hit-makers, and it was normal for someone to have a few top ten hits, then a couple at number 120 or something, before going back to the top. And she was touring with Dick Clark's Caravan of Stars, and still in high demand as a live performer.\n\nShe also, in 1963, recorded a version of \"Swinging on a Star\" with Big Dee Irwin, though she wasn't credited on the label, and that made the top forty (and made number seven in the UK):\n\n[Excerpt: Big Dee Irwin, \"Swinging on a Star\"]\n\nBut everything changed for Little Eva, and for the whole world of Brill Building pop, in 1964. In part, this was because the Beatles became successful and changed the pop landscape, but by itself that shouldn't have destroyed the careers of Eva or the Cookies, who the Beatles admired -- they recorded a cover of \"Chains\", and they used to play \"Keep Your Hands Off My Baby\" in their live sets. But Don Kirshner decided to sell Aldon Music and Dimension Records to Columbia Pictures, and to start concentrating on the West Coast rather than New York. The idea was that they could come up with songs that would be used in films and TV, and make more money that way, and that worked out for many people, including Kirshner himself.\n\nBut even when artists like Eva and the Cookies got hit material, the British Invasion made it hard for them to get a footing. For example, Goffin and King wrote a song for Earl-Jean from the Cookies to record as a solo track just after Dimension was taken over by Columbia. That record did make the top forty:\n\n[Excerpt: Earl-Jean, \"I'm Into Something Good\"]\n\nBut then Herman's Hermits released their version, which became a much bigger hit. That sort of thing kept happening. The Cookies ended up splitting up by 1967.\n\nLittle Eva did end up doing some TV work -- most famously, she sang a dance song in an episode of the Hanna-Barbera cartoon Magilla Gorilla:\n\n[Excerpt: Little Eva \"Makin' With the Magilla\"]\n\nBut Dimension Records was not a priority for anyone -- Columbia already owned their own labels, and didn't need another one -- and the label was being wound down. And then Al Nevins, Don Kirshner's partner in Aldon, died. He'd always been friendly with Eva, and without him to advocate for her, the label sold her contract off to Bell Records. From that point on, she could no longer rely on Goffin and King, and she hopped between a number of different labels, none of them with any great success. After spending seven years going from label to label, and having split up with her husband, she quit the music business in 1971 and moved back to North Carolina. She was sick of the music industry, and particularly sick of the lack of money -- she had signed a lot of bad contracts, and was making no royalties from sales of her records.\n\nShe worked menial day jobs, survived on welfare for a while, became active in her local church, and depending on which reports you read either ran a soul-food restaurant or merely worked there as a waitress. Meanwhile, \"The Loco-Motion\" was a perennial hit. Her version re-charted in the UK in the early seventies, and Todd Rundgren produced a version for the heavy metal band Grand Funk Railroad which went to number one in the US in 1974:\n\n[Excerpt: Grand Funk Railroad, \"The Loco-Motion\"]\n\nAnd then in 1988 an Australian soap star, Kylie Minogue, recorded her own version, which went top five worldwide and started Minogue's own successful pop career:\n\n[Excerpt: Kylie Minogue, \"The Loco-Motion\"]\n\nThat record becoming a hit got a series of \"where are they now?\" articles written about Eva, and she was persuaded to come out of retirement and start performing again -- though having been so badly hurt by the industry, she was very dubious at first, and she also had scruples because of her strong religious faith. She later said that she'd left the contracts on her table for eight months before signing them -- but when she finally did, she found that her audience was still there for her. For the rest of her life, she was a popular performer on the oldies circuit, performing on package tours with people like Bobby Vee and Brian Hyland, playing state fairs and touring Europe. She continued performing until shortly before her death, even after she was diagnosed with the cancer that eventually killed her, as she once again connected with the audiences who had loved her music back when she was still a teenager. She died, aged fifty-nine, in 2003.",
  "itunes:subtitle": "Episode ninety-six of A History of Rock Music in Five Hundred Songs looks at The Loco-Motion by Little Eva, and how a demo by Carole Kings babysitter became one of the biggest hits of the sixties. Click the full post to read liner notes, links to more in",
  "itunes:keywords": "Aldon Music,Atlantic Records,Big Joe turner,Billy Fury,Brill Building,Cameo-Parkway Records,Carole King,dance crazes,Dimension Records,Gerry Goffin,Jesse Stone,Little Eva,Neil Sedaka,Ray Charles,The Cookies,The Everly Brothers,the Twist",
  "itunes:episodeType": "full",
  "itunes:episode": 96,
  "content:encoded": "Episode ninety-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"The Loco-Motion\" by Little Eva, and how a demo by Carole King's babysitter became one of the biggest hits of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;<a href=\"https://www.patreon.com/posts/41133358\">\"Duke of Earl\" by Gene Chandler</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemantal-96-the-loco-motion/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nThere are no biographies of Little Eva, so I've used a variety of sources, including the articles on Little Eva and The Cookies at <a href=\"http://tims.blackcat.nl/\">This Is My Story</a>. The following books were also of some use:\n\n<a href=\"https://amzn.to/3275Sz8\">A Natural Woman</a>&nbsp;is Carole King's autobiography.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a>&nbsp;by Ken Emerson is a good overview of the whole scene.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era, including articles on both Little Eva and The Cookies.\n\nThere are no decent CDs of Eva's material readily available, but I can recommend two overlapping compilations. <a href=\"https://amzn.to/3jAMHTP\">This compilation</a> contains Little Eva's only sixties album in full, along with some tracks by Carole King, the Cookies, and the Ronettes, while <a href=\"https://amzn.to/2EDT1eH\">Dimension Dolls</a> is a compilation from 1963 that overlaps substantially with that album but contains several tracks not on it.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA quick note before this begins -- there is some mention of domestic violence in this episode. If that's something that might upset you, please check the transcript of the episode at 500songs.com if reading it might be easier than listening.\n\nA couple of months back, we talked about Goffin and King, and the early days of the Brill Building sound. Today we're going to take another look at them, and at a singer who recorded some of their best material, both solo and in a group, but who would always be overshadowed by the first single they wrote for her, when she was still working as their childminder. Today, we're going to look at Little Eva and \"The Loco-Motion\", and the short history of Dimension Records:\n\n[Excerpt: Little Eva, \"The Loco-Motion\"]\n\nThe story of Little Eva is intertwined with the story of the Cookies, one of the earliest of the girl groups, and so we should probably start with them. We've mentioned the Cookies earlier, in the episode on \"What'd I Say\", but we didn't look at them in any great detail. The group started out in the mid-fifties, as a group of schoolgirls singing together in New York -- Dorothy Jones, her cousin Beulah Robertson, and a friend, Darlene McRae, who had all been in the choir at their local Baptist Church. They formed a group and made their first appearance at the famous Harlem Apollo talent contests, where they came third, to Joe Tex and a vocal group called the Flairs (not, I think, any of the Flairs groups we've looked at). They were seen at that contest by Jesse Stone, who gave them the name \"The Cookies\". He signed them to Aladdin Records, and produced and co-wrote their first single, \"All-Night Mambo\". That wasn't commercially successful, but Stone liked them enough that he then got them signed to Atlantic, where he again wrote their first single for the label. That first single was relatively unsuccessful, but their second single on Atlantic, \"In Paradise\", did chart, making number nine on the R&B chart:\n\n[Excerpt: The Cookies, \"In Paradise\"]\n\nBut the B-side to that record would end up being more important to their career in the long run. \"Passing Time\" was the very first song by Neil Sedaka and Howie Greenfield to get recorded, even before Sedaka's recordings with the Tokens or his own successful solo records:\n\n[Excerpt: The Cookies, \"Passing Time\"]\n\nBut then two things happened. Firstly, one of the girls, Beulah Robertson, fell out with Jesse Stone, who sacked her from the group. Stone got in a new vocalist, Margie Hendrix, to replace her, and after one more single the group stopped making singles for Atlantic. But they continued recording for smaller labels, and they also had regular gigs as backing vocalists for Atlantic, on records like \"Lipstick, Powder, and Paint\" by Big Joe Turner:\n\n[Excerpt: Big Joe Turner, \"Lipstick, Powder and Paint\"]\n\n\"It's Too Late\" by Chuck Willis:\n\n[Excerpt: Chuck Willis, \"It's Too Late\"]\n\nAnd \"Lonely Avenue\" by Ray Charles:\n\n[Excerpt: Ray Charles, \"Lonely Avenue\"]\n\nIt was working with Ray Charles that led to the breakup of the original lineup of the Cookies -- Charles was putting together his own group, and wanted the Cookies as his backing vocalists, but Dorothy was pregnant, and decided she'd rather stay behind and continue working as a session singer than go out on the road. Darlene and Margie went off to become the core of Charles' new backing group, the Raelettes, and they would play a major part in the sound of Charles' records for the next few years. It's Margie, for example, who can be heard duetting with Charles on \"The Right Time\":\n\n[Excerpt: Ray Charles, \"The Right Time\"]\n\nDorothy stayed behind and put together a new lineup of Cookies. To make sure the group sounded the same, she got Darlene's sister Earl-Jean into the group -- Darlene and Earl-Jean looked and sounded so similar that many histories of the group say they're the same person -- and got another of her cousins, Margaret Ross, to take over the spot that had previously been Beulah's before Margie had taken her place.\n\nThis new version of the Cookies didn't really start doing much for a couple of years, while Dorothy was raising her newborn and Earl-Jean and Margaret were finishing high school. But in 1961 they started again in earnest, when Neil Sedaka remembered the Cookies and called Dorothy up, saying he knew someone who needed a vocal group.\n\nGerry Goffin and Carole King had become hot songwriters, and they'd also become increasingly interested in record production after Carole had been involved in the making of \"Will You Love Me Tomorrow?\" Carole was recording her own demos of the songs she and Goffin were writing, and was increasingly making them fully-produced recordings in their own right. The first record the new Cookies sang on was one that seems to have started out as one of these demos. \"Halfway to Paradise\" by Tony Orlando sounds exactly like a Drifters record, and Orlando was, at the time, a sixteen-year-old demo singer. My guess, and it is only a guess, is that this was a demo intended for the Drifters, that it was turned down, and so the demo was released as a record itself:\n\n[Excerpt: Tony Orlando, \"Halfway to Paradise\"]\n\nThat made the lower reaches of the Hot One Hundred, while a British cover version by Billy Fury made number three in the UK.\n\nFrom this point on, the new lineup of the Cookies were once again the premier session singers. They added extra backing vocals to a lot of the Drifters' records at this time, and would provide backing vocals for most of Atlantic's artists, as the earlier lineup had. They were also effectively the in-house backing singers for Aldon Music -- as well as singing on every Goffin and King demo, they were also singing with Neil Sedaka:\n\n[Excerpt: Neil Sedaka, \"Breaking Up is Hard to Do\"]\n\nBut it was Goffin and King who spent the most time working with the Cookies, and who pushed them as recording artists in their own right. They started with a solo record for Dorothy, \"Taking That Long Walk Home\", a song that was very much \"Will You Love Me Tomorrow?\" part two:\n\n[Excerpt: Dorothy Jones, \"Taking That Long Walk Home\"]\n\nThe Cookies were doing huge amounts of session work, working twelve hours a day, seven days a week. Dorothy Jones described being in the studio working on a King Curtis session until literally fifteen minutes before giving birth.\n\nThey weren't the only ones working hard, though. Goffin and King were writing from their Aldon offices every single day, writing songs for the Drifters, the Shirelles, Bobby Rydell, Bobby Vee, Gene Pitney, the Crickets, the Everly Brothers, and more. And on top of that they had a child and Carole King was pregnant with a second one.\n\nAnd, this being the very early 1960s, it never occurred to either Goffin or King that just because Carole King was working the exact same number of hours as Goffin, that might mean she shouldn't also be doing the housework and looking after the children with no help from Goffin. There was only one way they could continue their level of productivity, and that was to get someone in to help out Carole. She mentioned to the Cookies that she was looking for someone to help her with the children, and Earl-Jean mentioned that a nineteen-year-old acquaintance -- her friend's husband's sister -- had just moved to New York from North Carolina to try to become a singer and was looking for any work she could get while she was trying to make it. Eva Narcissus Boyd, Earl-Jean's acquaintance, moved in with Goffin and King and became their live-in childminder for $35 a week plus room and board.\n\nGoffin and King had known that Eva was a singer before they hired her, and they discovered that her voice was rather good. Not only that, but she blended well with the Cookies, and was friends with them. She became an unofficial \"fourth Cookie\", and was soon in the studio on a regular basis too -- and when she was, that meant that Eva's sister was looking after the kids, as a subcontracted babysitter.\n\nDuring this time, Don Kirshner's attitude was still that he was determined to get the next hit for every artist that had a hit. But that wasn't always possible.\n\nCameo-Parkway had, after the success they'd had with \"The Twist\", fully jumped on the dance-craze bandwagon, and they'd hit on another dance that might be the next Twist. The Mashed Potato was a dance that James Brown had been doing on stage for a few years, and in the wake of \"The Twist\", Brown had had a hit with a song about it \"(Do the) Mashed Potatoes\", which was credited to Nat Kendrick & the Swans rather than to Brown for contractual reasons:\n\n[Excerpt: Nat Kendrick and the Swans, \"(Do the) Mashed Potatoes\"]\n\nCameo-Parkway had picked up on that dance, and had done just what Kirshner always did and created a soundalike of a recent hit -- and in fact they'd mashed up, if you'll pardon the expression, two recent hits. In this case, they'd taken the sound of \"Please Mr. Postman\", slightly reworked the lyrics to be about Brown's dance, and given it to session singer Dee Dee Sharp:\n\n[Excerpt: Dee Dee Sharp, \"Mashed Potato Time\"]\n\nThat had gone to number two on the pop charts and number one on the R&B charts, and even inspired its own rip-offs, like \"The Monster Mash\" by Bobby \"Boris\" Pickett:\n\n[Excerpt: Bobby \"Boris\" Pickett and the Crypt-Kickers, \"The Monster Mash\"]\n\nSo Kirshner just assumed that Sharp would be looking for another dance hit, one that sounded just like \"Mashed Potato Time\", and got Goffin and King to write one to submit to her.\n\nUnfortunately for him, he'd assumed wrong. Cameo-Parkway was owned by a group of successful songwriters, and they didn't need outside writers bringing them hits when they could write their own. Dee Dee Sharp wasn't going to be recording Goffin and King's song.\n\nWhen he listened to the demo, Don Kirshner was astonished that they hadn't taken the song. It had \"hit\" written all over it. He decided that he was going to start his own record label, Dimension Records, and he was just going to release that demo as the single. The Cookies went into the studio to overdub another layer of backing vocals, but otherwise the record that was released was the demo Eva -- now renamed \"Little Eva\" -- had sung:\n\n[Excerpt: Little Eva, \"The Loco-Motion\"]\n\nThe record went to number one, and made Little Eva a star. It also made Gerry Goffin a successful producer, because even though Goffin and King had coproduced it, Goffin got sole production credit on this, and on other records the two produced together. According to King, Goffin was the one in the control room for their productions, while she would be on the studio floor, and she didn't really question whether what she was doing counted as production too until much later -- and anyway, getting the sole credit was apparently important to Gerry.\n\n\"The Loco-Motion\" was such a big hit that it inspired its own knockoffs, including one song cheekily called \"Little Eva\" by a group called \"The Locomotions\" &nbsp;-- so the record label would say \"Little Eva, The Locomotions\", and people might buy it by mistake. You'll be shocked to learn that that one was on a Morris Levy label:\n\n[Excerpt: The Locomotions, \"Little Eva\"]\n\nThat group featured Leon Huff, who would later go on to make a lot of much better records.\n\nMeanwhile, as Little Eva was now a star, Carole King once again had to look for a childminder. This time she insisted that anyone she hired be unable to sing, so she wouldn't keep having to do this.\n\nDimension Records was soon churning out singles, all of them involving the Cookies, and Eva, and Goffin and King. They put out \"Everybody's Got a Dance But Me\" by Big Dee Irwin, a song that excerpted \"The Loco-Motion\", \"Wah Watusi\", \"Hully Gully\" and \"Twist and Shout\" among many others, with the Cookies on backing vocals, and with Goffin as the credited producer:\n\n[Excerpt: Big Dee Irwin, \"Everybody's Got a Dance But Me\"]\n\nThat wasn't a hit, but Dimension soon released two more big hits. One was a solo single by Carole King, \"It Might as Well Rain Until September\", which went to number twenty even though its only national exposure was a disastrous appearance by King on American Bandstand which left her feeling humiliated:\n\n[Excerpt: Carole King, \"It Might as Well Rain Until September\"]\n\nHer solo performing career wouldn't properly take off for a few more years, but that was a step towards it. The Cookies also had a hit on Dimension around this point. Goffin and King had written a song called \"Chains\" for the Everly Brothers, who had recorded it but not released it:\n\n[Excerpt: The Everly Brothers, \"Chains\"]\n\nSo they gave the song to the Cookies instead, with Little Eva on additional vocals, and it made the pop top twenty, and the R&B top ten:\n\n[Excerpt: The Cookies, \"Chains\"]\n\nSeveral people have pointed out that that lyric can be read as having an element of BDSM to it, and it's not the only Goffin and King song from this period that does -- there's a 1964 B-side they wrote for Eva called \"Please Hurt Me\", which is fairly blatant:\n\n[Excerpt: Little Eva, \"Please Hurt Me\"]\n\nBut the BDSM comparison has also been made -- wrongly, in my opinion -- about one of the most utterly misguided songs that Goffin and King ever wrote -- a song inspired by Little Eva telling them that her boyfriend beat her up. They'd asked her why she put up with it, and she said that he only hit her because he loved her. They were inspired by that to write \"He Hit Me (And It Felt Like A Kiss)\", an utterly grotesque song which, in a version produced by Phil Spector for the Crystals, was issued as a single but soon withdrawn due to general horror. I won't be excerpting that one here, though it's easy enough to find if you want to.\n\n(Having said that, I should also say that while people have said that Goffin & King's material at this point flirts with BDSM, my understanding of BDSM, as it has been explained to me by friends who indulge in such activities, is that consent is paramount, so I don't think that \"He Hit Me\" should be talked about in those terms. I don't want anything I've said here to contribute to the blurring of distinctions between consensual kink and abuse, which are too often conflated).\n\nOriginally, Eva's follow-up to \"The Loco-Motion\" was going to be \"One Fine Day\", another Goffin and King song, but no matter how much Goffin and King worked on the track, they couldn't come up with an arrangement, and eventually they passed the song over to the Tokens, who solved the arrangement problems (though they kept King's piano part) and produced a version of it for the Chiffons, for whom it became a hit:\n\n[Excerpt: The Chiffons, \"One Fine Day\"]\n\nInstead, Goffin and King gave Eva \"Keep Your Hands Off My Baby\". This is, in my opinion, the best thing that Eva ever did, and it made the top twenty, though it wasn't as big a hit as \"The Loco-Motion\":\n\n[Excerpt: Little Eva, \"Keep Your Hands Off My Baby\"]\n\nAnd Eva also appeared on another Cookies record, \"Don't Say Nothing Bad About My Baby\", which made the top ten:\n\n[Excerpt: The Cookies, \"Don't Say Nothing Bad About My Baby\"]\n\nThe Cookies, Eva, and Goffin and King were such a package deal that Dimension released an album called Dimension Dolls featuring the first few hits of each act and padded out with demos they'd made for other artists. &nbsp;This hit-making machine was so successful for a brief period in 1962 and 63 that even Eva's sister Idalia got in on the act, releasing a song by Goffin, King, and Jack Keller, \"Hula Hoppin'\":\n\n[Excerpt: Idalia Boyd, \"Hula Hoppin'\"]\n\nFor Eva's third single, Gerry Goffin and Jack Keller wrote a song called \"Let's Turkey Trot\", which also made the top twenty. But that would be the last time that Eva would have a hit of her own.\n\nAt first, the fact that she had a couple of flop singles wasn't a problem -- no artists at this time were consistent hit-makers, and it was normal for someone to have a few top ten hits, then a couple at number 120 or something, before going back to the top. And she was touring with Dick Clark's Caravan of Stars, and still in high demand as a live performer.\n\nShe also, in 1963, recorded a version of \"Swinging on a Star\" with Big Dee Irwin, though she wasn't credited on the label, and that made the top forty (and made number seven in the UK):\n\n[Excerpt: Big Dee Irwin, \"Swinging on a Star\"]\n\nBut everything changed for Little Eva, and for the whole world of Brill Building pop, in 1964. In part, this was because the Beatles became successful and changed the pop landscape, but by itself that shouldn't have destroyed the careers of Eva or the Cookies, who the Beatles admired -- they recorded a cover of \"Chains\", and they used to play \"Keep Your Hands Off My Baby\" in their live sets. But Don Kirshner decided to sell Aldon Music and Dimension Records to Columbia Pictures, and to start concentrating on the West Coast rather than New York. The idea was that they could come up with songs that would be used in films and TV, and make more money that way, and that worked out for many people, including Kirshner himself.\n\nBut even when artists like Eva and the Cookies got hit material, the British Invasion made it hard for them to get a footing. For example, Goffin and King wrote a song for Earl-Jean from the Cookies to record as a solo track just after Dimension was taken over by Columbia. That record did make the top forty:\n\n[Excerpt: Earl-Jean, \"I'm Into Something Good\"]\n\nBut then Herman's Hermits released their version, which became a much bigger hit. That sort of thing kept happening. The Cookies ended up splitting up by 1967.\n\nLittle Eva did end up doing some TV work -- most famously, she sang a dance song in an episode of the Hanna-Barbera cartoon Magilla Gorilla:\n\n[Excerpt: Little Eva \"Makin' With the Magilla\"]\n\nBut Dimension Records was not a priority for anyone -- Columbia already owned their own labels, and didn't need another one -- and the label was being wound down. And then Al Nevins, Don Kirshner's partner in Aldon, died. He'd always been friendly with Eva, and without him to advocate for her, the label sold her contract off to Bell Records. From that point on, she could no longer rely on Goffin and King, and she hopped between a number of different labels, none of them with any great success. After spending seven years going from label to label, and having split up with her husband, she quit the music business in 1971 and moved back to North Carolina. She was sick of the music industry, and particularly sick of the lack of money -- she had signed a lot of bad contracts, and was making no royalties from sales of her records.\n\nShe worked menial day jobs, survived on welfare for a while, became active in her local church, and depending on which reports you read either ran a soul-food restaurant or merely worked there as a waitress. Meanwhile, \"The Loco-Motion\" was a perennial hit. Her version re-charted in the UK in the early seventies, and Todd Rundgren produced a version for the heavy metal band Grand Funk Railroad which went to number one in the US in 1974:\n\n[Excerpt: Grand Funk Railroad, \"The Loco-Motion\"]\n\nAnd then in 1988 an Australian soap star, Kylie Minogue, recorded her own version, which went top five worldwide and started Minogue's own successful pop career:\n\n[Excerpt: Kylie Minogue, \"The Loco-Motion\"]\n\nThat record becoming a hit got a series of \"where are they now?\" articles written about Eva, and she was persuaded to come out of retirement and start performing again -- though having been so badly hurt by the industry, she was very dubious at first, and she also had scruples because of her strong religious faith. She later said that she'd left the contracts on her table for eight months before signing them -- but when she finally did, she found that her audience was still there for her. For the rest of her life, she was a popular performer on the oldies circuit, performing on package tours with people like Bobby Vee and Brian Hyland, playing state fairs and touring Europe. She continued performing until shortly before her death, even after she was diagnosed with the cancer that eventually killed her, as she once again connected with the audiences who had loved her music back when she was still a teenager. She died, aged fifty-nine, in 2003.",
  "enclosure": "",
  "itunes:summary": "Episode ninety-six of A History of Rock Music in Five Hundred Songs looks at \"The Loco-Motion\" by Little Eva, and how a demo by Carole King's babysitter became one of the biggest hits of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;\"Duke of Earl\" by Gene Chandler.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThere are no biographies of Little Eva, so I've used a variety of sources, including the articles on Little Eva and The Cookies at This Is My Story. The following books were also of some use:\n\nA Natural Woman&nbsp;is Carole King's autobiography.\n\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era&nbsp;by Ken Emerson is a good overview of the whole scene.\n\nGirl Groups by John Clemente contains potted biographies of many groups of the era, including articles on both Little Eva and The Cookies.\n\nThere are no decent CDs of Eva's material readily available, but I can recommend two overlapping compilations. This compilation contains Little Eva's only sixties album in full, along with some tracks by Carole King, the Cookies, and the Ronettes, while Dimension Dolls is a compilation from 1963 that overlaps substantially with that album but contains several tracks not on it.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nA quick note before this begins -- there is some mention of domestic violence in this episode. If that's something that might upset you, please check the transcript of the episode at 500songs.com if reading it might be easier than listening.\n\nA couple of months back, we talked about Goffin and King, and the early days of the Brill Building sound. Today we're going to take another look at them, and at a singer who recorded some of their best material, both solo and in a group, but who would always be overshadowed by the first single they wrote for her, when she was still working as their childminder. Today, we're going to look at Little Eva and \"The Loco-Motion\", and the short history of Dimension Records:\n\n[Excerpt: Little Eva, \"The Loco-Motion\"]\n\nThe story of Little Eva is intertwined with the story of the Cookies, one of the earliest of the girl groups, and so we should probably start with them. We've mentioned the Cookies earlier, in the episode on \"What'd I Say\", but we didn't look at them in any great detail. The group started out in the mid-fifties, as a group of schoolgirls singing together in New York -- Dorothy Jones, her cousin Beulah Robertson, and a friend, Darlene McRae, who had all been in the choir at their local Baptist Church. They formed a group and made their first appearance at the famous Harlem Apollo talent contests, where they came third, to Joe Tex and a vocal group called the Flairs (not, I think, any of the Flairs groups we've looked at). They were seen at that contest by Jesse Stone, who gave them the name \"The Cookies\". He signed them to Aladdin Records, and produced and co-wrote their first single, \"All-Night Mambo\". That wasn't commercially successful, but Stone liked them enough that he then got them signed to Atlantic, where he again wrote their first single for the label. That first single was relatively unsuccessful, but their second single on Atlantic, \"In Paradise\", did chart, making number nine on the R&B chart:\n\n[Excerpt: The Cookies, \"In Paradise\"]\n\nBut the B-side to that record would end up being more important to their career in the long run. \"Passing Time\" was the very first song by Neil Sedaka and Howie Greenfield to",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-six of A History of Rock Music in Five Hundred Songs looks at \"The Loco-Motion\" by Little Eva, and how a demo by Carole King's babysitter became one of the biggest hits of the sixties. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on&nbsp;\"Duke of Earl\" by Gene Chandler.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThere are no biographies of Little Eva, so I've used a variety of sources, including the articles on Little Eva and The Cookies at This Is My Story. The following books were also of some use:\n\nA Natural Woman&nbsp;is Carole K",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}