{
  "title": "Some things are more difficult than you might think (literary interviewing edition)",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/03/some-things-are-more-difficult-than-you-might-think-literary-interviewing-edition/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/03/some-things-are-more-difficult-than-you-might-think-literary-interviewing-edition/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Mon, 03 Oct 2022 13:02:18 +0000",
  "category": "Literature",
  "guid": "https://statmodeling.stat.columbia.edu/?p=47853",
  "description": "Awhile ago I picked up this book, &#8220;The Book That Changed My Life,&#8221; which is a collection of interviews with 15 pretty famous authors (Don DeLillo, Diane Johnson, E. L. Doctorow, Grace Paley, and some other names who many middle-aged &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/03/some-things-are-more-difficult-than-you-might-think-literary-interviewing-edition/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Awhile ago I picked up this book, &#8220;The Book That Changed My Life,&#8221; which is a collection of interviews with 15 pretty famous authors (Don DeLillo, Diane Johnson, E. L. Doctorow, Grace Paley, and some other names who many middle-aged and elderly readers of this blog might recognize) on the books that influenced them when they were young, along with more specific questions about influences on their well-known books.  The interviewer, Diane Osen, asks good questions, but the whole thing doesn&#8217;t work for me.  I found the book to be boring and difficult to read.</p>\n<p>OK, that&#8217;s just my reaction.  You might love the book.  I&#8217;m not trying to offer any sort of universal take here.  My point really is just that this idea&#8212;find a bunch of authors of interesting literature, ask them some open-ended questions, and edit the results&#8212;seems like a foolproof formula for a book.  And asking about books that changed their lives, that also seems like a great idea, a good way to structure the whole volume.  I love the Paris Review interviews, and this seems kinda similar.</p>\n<p>But, no, I guess it&#8217;s harder than it looks.  I&#8217;d like to think that if I could have some time to interview Grace Paley (when she was alive), Don DeLillo, etc., I&#8217;d have material for a fun book, but, no, I guess not.  I guess it takes more than a willing supply of quality interview subjects to put together a readable book of this form.</p>\n<p>I like <a href=\"https://statmodeling.stat.columbia.edu/2015/09/09/irwin-shaw-might-mistrust-intellectuals-id-mistrust-nonintellectuals-even/\">interviews with authors</a>, in the same way that I like <a href=\"https://statmodeling.stat.columbia.edu/2018/05/02/anthony-wests-literary-essays/\">book reviews</a> and other <a href=\"https://statmodeling.stat.columbia.edu/2014/01/12/things-like-almost-nobody-else-interested/\">meta-literature</a>, so I&#8217;m really in the sweet spot of the intended audience for this one.  So if this didn&#8217;t interest me, given all it seemed to have going for it, this is evidence that a lot more skill is involved in this endeavor than I&#8217;d imagined.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/03/some-things-are-more-difficult-than-you-might-think-literary-interviewing-edition/feed/",
  "slash:comments": 1
}