{
  "title": "The Edition: Running on empty",
  "link": "https://audioboom.com/posts/7952059",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2320,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: is Boris Johnson running on empty or is a weak opposition giving him the momentum he needs? Kate Andrews asks in her cover story this week if Boris Johnson’s government has run out of ideas – as well as petrol. Katy Balls also writes in the magazine that the opposition seems unable to take advantage of the government’s failures. Katy and Kate join William on the podcast to give their takes on the state of both parties. (00:51)</div>\n<div><br>\n</div>\n<div>Also this week: what is behind China’s latest crackdown on cryptocurrency? Ian Williams writes in this week’s Spectator that the CCP’s latest move to criminalise anyone dealing in cryptocurrency is to clear the decks for China’s new, state-sanctioned digital currency. He along with George Magnus, author of <em>Red Flags, Why Xi’s China is in jeopardy </em>speak on the podcast about<em> </em>Beijing’s crypto future. (14:15)</div>\n<div><br>\n</div>\n<div>And finally: are the Marvel movies – good? Love them or hate them, these superhero blockbusters have dominated the box office for more than a decade and have redefined pop culture. They may not have received particularly positive reviews in the <em>Spectator</em> over the years, but Rosie Millard has jumped to their defence in the magazine’s lead arts feature this week. She guests on the podcast to try and convince William to give Marvel a chance. (26:18)</div>\n<div><br>\n</div>\n<div> Hosted by William Moore</div>\n<div><br>\n</div>\n<div> Produced by Sam Holmes</div>\n",
  "pubDate": "Thu, 30 Sep 2021 15:41:00 +0000",
  "guid": "tag:audioboom.com,2021-09-30:/posts/7952059",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}