{
  "id": "tag:blogger.com,1999:blog-19803222.post-2352863730613492351",
  "published": "2017-03-13T11:19:00.001-06:00",
  "updated": "2017-03-13T11:21:08.511-06:00",
  "title": "Awesome people: Karen Spärck Jones (IWD++)",
  "content": "To honor women this <a href=\"https://www.internationalwomensday.com/\">International Women's Day</a>, I have a several posts, broadly around the topic of women in STEM. Previous posts in this series include: <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-bonnie-dorr-iwd.html\">Awesome People: Bonnie Dorr</a>, <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-ellen-riloff-iwd.html\">Awesome People: Ellen Riloff</a> and <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-lise-getoor-iwd.html\">Awesome People: Lise Getoor</a>.<br /><br /><a href=\"http://www.currybet.net/cbet_blog/2009/03/professor-karen-spark-jones--.php\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img src=\"http://www.currybet.net/images/blog2009/03/20090304_prof-spark-jones.jpg\" height=\"200\" width=\"163\" /></a><br />Today is the continuation of the theme \"who has been influential in my career and helped me get where I am?\" and in that vein, I want to talk about another awesome person: <a href=\"https://en.wikipedia.org/wiki/Karen_Sp%C3%A4rck_Jones\">Karen Spärck Jones</a>. Like Bonnie Dorr, Karen is someone I first met at the Document Understanding Conference series back when I was a graduate student.<br /><br />Karen has done it all. First, she invents inverse document frequency, one of those topics that's so ingrained that no one even cites it anymore. I'm pretty sure I didn't know she invented IDF when I first met her. Frankly, I'm not sure it even occurred to me that this was something someone had to invent: it was like air or water. She's the <a href=\"http://www.cl.cam.ac.uk/misc/obituaries/sparck-jones/cv.html\">recipient</a> of the AAAI Allen Newell Award, the BCS Lovelace Medal, the ACL lifetime achievement award, and ASIS&amp;T Award of Merit, the Gerard Salton Award, was a fellow of the British Academy (and VP thereof), a fellow of AAAI, ECCAI and ACL. I highly recommend reading her speech from her <a href=\"http://www.mitpressjournals.org/doi/abs/10.1162/0891201053630237#.WLiaWldE6-k\">ACL fellow award</a>. Among other things, I didn't realize that IDF was the fourth attempt to get the formulation right!<br /><br />If there are two things I learned from Karen, they are: <br /><ol><li> simple is good </li><li> examples are good </li></ol><a href=\"https://www.cl.cam.ac.uk/misc/obituaries/sparck-jones/video/\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img height=\"179\" src=\"https://www.cl.cam.ac.uk/misc/obituaries/sparck-jones/video/award-lecture-2007.jpg\" width=\"320\" /></a>Although easily stated, these two principles are quite difficult to follow.I distinctly remember given a talk at DUC on <a href=\"https://www.blogger.com/blogger.g?blogID=19803222\">BayeSum</a> and, afterward, Karen coming up to talk to me to try to get to the bottom of what the model was actually doing and why it was working, basically sure that there was a simpler explanation buried under the model.<br /><br />I also can't forget Karen routinely pushing people for examples in talks. Giving a talk on MT that doesn't have example outputs of your translation system? Better hope Karen isn't in the audience.<br /><br />Karen was also a huge proponent of breaking down gender barriers in computing. She's famously quoted as saying:<br /><blockquote>I think it's very important to get more women into computing. My slogan is: <b>\"Computing is too important to be left to men.\"</b></blockquote>This quote is a wonderful reflection both of Karen's seriousness and of her tongue-in-cheek humor. She was truly one of the kindest people I've met.<br /><br /><a href=\"http://savoyplace.theiet.org/engineering-hub/discover/gallery/index.cfm\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img src=\"http://savoyplace.theiet.org/engineering-hub/discover/gallery/img/engineers/images/thumbnails/JPEG/1935_Karen_Spaerck_Jones.jpg\" /></a><br />In particular, more than any of these specifics I just remember being so amazed and grateful that even as a third year graduate student, Karen, who was like this amazing figure in IR and summarization, would come talk to me for a half hour to help me make my research better. I was extremely sad nearly ten years ago when I learned that Karen has passed away. Just a week earlier, we had been exchanging emails about document collections, and the final email I had from her on the topic read as follows:<br /><blockquote>Document collections is a much misunderstood topic -- you have to think what its for and eg where (in retrieval) you are going to get real queries from. Just assembling some bunch of stuff and saying hey giys, what would you like to do with this is useless. </blockquote>This was true in 2007 and it's true today. In fact, I might argue that it's even more true today. We have nearly infinite ability to create datasets today, be them natural, artificial or whatever, and it's indeed not enough just to throw some stuff together and cross your fingers.<br /><br />I miss Karen so much. She had this joy that she brought everywhere and my life is less for that loss.&nbsp;&nbsp;",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}