{
  "title": "NASA’s DART Mission Aims to Save the World",
  "link": "https://spectrum.ieee.org/planetary-protection-nasa-dart",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-cubesat-with-2-large-solar-panels-in-front-of-two-grey-asteroids-in-space-with-a-smaller-cubesat-nearby.jpg?id=31804118&width=1500&height=2000&coordinates=1837%2C0%2C1838%2C0\"/><br/><br/><p>Armageddon ruined everything. <a href=\"https://spectrum.ieee.org/nasa-needs-coders-to-help-prevent-asteroid-armageddon\" target=\"_self\"><em>Armageddon</em></a>—the 1998 movie, not the mythical battlefield—told the story of an asteroid headed straight for Earth, and a bunch of swaggering roughnecks sent in space shuttles to blow it up with a nuclear weapon.</p><p>“<em>Armageddon</em> is big and noisy and stupid and shameless, and it’s going to be huge at the box office,” <a href=\"https://www.rottentomatoes.com/m/armageddon/reviews?intcmp=rt-what-to-know_read-critics-reviews\" rel=\"noopener noreferrer\" target=\"_blank\">wrote</a> Jay Carr of the <a href=\"https://www.newspapers.com/newspage/441533250/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Boston Globe</em></a>.</p><p>Carr was right—the film was <a href=\"https://www.boxofficemojo.com/year/1998/\" target=\"_blank\">the year’s second biggest hit</a> (after <em>Titanic</em>)—and ever since, scientists have had to explain, patiently, that cluttering space with radioactive debris may not be the best way to protect ourselves. NASA is now trying a slightly less dramatic approach with a robotic mission called <a href=\"https://www.nasa.gov/planetarydefense/dart/dart-news\" target=\"_blank\">DART</a>—short for Double Asteroid Redirection Test. On Monday at 7:14 p.m. EDT, if all goes well, the little spacecraft will crash into an asteroid called <a href=\"https://en.wikipedia.org/wiki/Dimorphos\" target=\"_blank\">Dimorphos</a>, about 11 million kilometers from Earth. Dimorphos is about 160 meters across, and orbits a 780-meter asteroid, <a href=\"https://en.wikipedia.org/wiki/65803_Didymos\" target=\"_blank\">65803 Didymos</a>. NASA TV plans to <a href=\"https://www.nasa.gov/nasalive\" rel=\"noopener noreferrer\" target=\"_blank\">cover it live</a>.</p><p>DART’s end will be violent, but not blockbuster-movie-violent. Music won’t swell and girlfriends back on Earth won’t swoon. Mission managers hope the spacecraft, with a mass of about 600 kilograms, hitting at 22,000 km/h, will nudge the asteroid slightly in its orbit, just enough to prove that it’s technologically possible in case a future asteroid has Earth in its crosshairs.</p><p>“Maybe once a century or so, there’ll be an asteroid sizeable enough that we’d like to certainly know, ahead of time, if it was going to impact,” says <a href=\"https://www.nasa.gov/planetarydefense/organization\" rel=\"noopener noreferrer\" target=\"_blank\">Lindley Johnson</a>, who has the title of planetary defense officer at <a href=\"https://www.nasa.gov/planetarydefense\" rel=\"noopener noreferrer\" target=\"_blank\">NASA</a>.</p><p>“If you just take a hair off the orbital velocity, you’ve changed the orbit of the asteroid so that what would have been impact three or four years down the road is now a complete miss.”</p><p>So take that, Hollywood! If DART succeeds, it will show there are better fuels to protect Earth than testosterone.</p><p>The risk of a comet or asteroid that wipes out civilization is really very small, but large enough that policymakers take it seriously. NASA, ordered by the <a href=\"https://www.congress.gov/bill/109th-congress/senate-bill/1281/text\" rel=\"noopener noreferrer\" target=\"_blank\">U.S. Congress</a> in 2005 to scan the inner solar system for hazards, <a href=\"https://cneos.jpl.nasa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">has found nearly 900</a> so-called NEOs—<a href=\"https://www.nasa.gov/planetarydefense/did-you-know\" rel=\"noopener noreferrer\" target=\"_blank\">near-Earth objects</a>—at least a kilometer across, more than 95 percent of all in that size range that probably exist. It has plotted their orbits far into the future, and none of them stand more than a fraction of a percent chance of hitting Earth in this millennium.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"An infographic showing the orientation of Didymos,  Dimorphos, DART, and LICIACube.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"7c5517ee5dbd74e18ecf3b916f814e98\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"bf199\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-infographic-showing-the-orientation-of-didymos-dimorphos-dart-and-liciacube.jpg?id=31804127&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The DART spacecraft should crash into the asteroid Dimorphos and slow it in its orbit around the larger asteroid Didymos. The LICIACube cubesat will fly in formation to take images of the impact.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Johns Hopkins APL/NASA</small></p><p>But there are smaller NEOs, perhaps 140 meters or more in diameter, too small to end civilization but large enough to cause mass destruction if they hit a populated area. There may be 25,000 that come within 50 million km of Earth’s orbit, and NASA estimates telescopes have only found about 40 percent of them. That’s why scientists want to expand the search for them and have good ways to deal with them if necessary. DART is the first test.</p><p>NASA takes pains to say this is a low-risk mission. Didymos and Dimorphos never cross Earth’s orbit, and computer simulations show that no matter where or how hard DART hits, it cannot possibly divert either one enough to put Earth in danger. Scientists want to see if DART can alter Dimorphos’s speed by perhaps a few centimeters per second.</p><p>The DART spacecraft, a 1-meter cube with two long solar panels, is elegantly simple, equipped with a telescope called DRACO, hydrazine maneuvering thrusters, a xenon-fueled <a href=\"https://spectrum.ieee.org/hall-effect-sensor\" target=\"_self\">ion engine</a> and a navigation system called <a href=\"https://www.jhuapl.edu/interactive/navigating-double-asteroid-redirection-test-on-its-own\" rel=\"noopener noreferrer\" target=\"_blank\">SMART Nav</a>. It was <a href=\"https://blogs.nasa.gov/dart/2021/11/24/nasa-spacex-launch-dart-first-planetary-defense-test-mission/\" rel=\"noopener noreferrer\" target=\"_blank\">launched by a SpaceX rocket</a> in November. About 4 hours and 90,000 km before the hoped-for impact, SMART Nav will take over control of the spacecraft, using optical images from the telescope. Didymos, the larger object, should be a point of light by then; Dimorphos, the intended target, will probably not appear as more than one pixel until about 50 minutes before impact. DART will send one image per second back to Earth, but the spacecraft is autonomous; signals from the ground, 38 light-seconds away, would be useless for steering as the ship races in.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A golden cubesat with a bright light and lines\" class=\"rm-shortcode\" data-rm-shortcode-id=\"9c26df105c1880ce4a232d43aff8782b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0d793\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-golden-cubesat-with-a-bright-light-and-lines.jpg?id=31804128&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The DART spacecraft separated from its SpaceX Falcon 9 launch vehicle, 55 minutes after liftoff from Vandenberg Space Force Base, in California, 24 November 2021. In this image from the rocket, the spacecraft had not yet unfurled its solar panels.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA</small></p><p>What’s more, nobody knows the shape or consistency of little Dimorphos. Is it a solid boulder or a loose cluster of rubble? Is it smooth or craggy, round or elongated? “We’re trying to hit the center,” says <a href=\"https://ieeexplore.ieee.org/author/37088208152\" rel=\"noopener noreferrer\" target=\"_blank\">Evan Smith</a>, the deputy mission systems engineer at the <a href=\"https://www.jhuapl.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Johns Hopkins Applied Physics Laboratory</a>, which is running DART. “We don’t want to overcorrect for some mountain or crater on one side that’s throwing an odd shadow or something.”</p><p>So on final approach, DART will cover 800 km without any steering. Thruster firings could blur the last images of Dimorphos’s surface, which scientists want to study. Impact should be imaged from about 50 km away by an Italian-made minisatellite, called <a href=\"https://www.asi.it/en/planets-stars-universe/solar-system-and-beyond/liciacube/\" rel=\"noopener noreferrer\" target=\"_blank\">LICIACube</a>, which DART released two weeks ago.</p><p>“In the minutes following impact, I know everybody is going be high fiving on the engineering side,” said <a href=\"https://www.nasa.gov/planetarydefense/organization\" rel=\"noopener noreferrer\" target=\"_blank\">Tom Statler</a>, DART’s program scientist at NASA, “but I’m going be imagining all the cool stuff that is actually going on on the asteroid, with a crater being dug and ejecta being blasted off.”</p><p>There is, of course, a possibility that DART will miss, in which case there should be enough fuel on board to allow engineers to go after a backup target. But an advantage of the Didymos-Dimorphos pair is that it should help in calculating how much effect the impact had. Telescopes on Earth (plus the Hubble and Webb space telescopes) may struggle to measure infinitesimal changes in the orbit of Dimorphos around the sun; it should be easier to see how much its orbit around Didymos is affected. The simplest measurement may be of the changing brightness of the double asteroid, as Dimorphos moves in front of or behind its partner, perhaps more quickly or slowly than it did before impact.</p><p>“We are moving an asteroid,” said Statler. “We are changing the motion of a natural celestial body in space. Humanity’s never done that before.”</p>",
  "pubDate": "Fri, 23 Sep 2022 15:52:53 +0000",
  "guid": "https://spectrum.ieee.org/planetary-protection-nasa-dart",
  "category": [
    "Asteroids",
    "Nasa",
    "Planetary protection"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}