{
  "title": "Episode 135: &#8220;The Sound of Silence&#8221; by Simon and Garfunkel",
  "link": "https://500songs.com/podcast/episode-135-the-sound-of-silence-by-simon-and-garfunkel/",
  "pubDate": "Thu, 21 Oct 2021 17:55:36 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=907",
  "description": "Episode one hundred and thirty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at “The Sound of Silence\" by Simon and Garfunkel, and the many records they made, together and apart, before their success. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/57687315\">on \"Blues Run the Game\" by Jackson C. Frank</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\nI talk about a tour of Lancashire towns, but some of the towns I mention were in Cheshire at the time, and some are in Greater Manchester or Merseyside now. They're all very close together though.\nI say Mose Rager was Black. I was misremembering, confusing Mose Rager, a white player in the Muhlenberg style, with Arnold Schultz, a Black player who invented it. I got this right in the episode on \"Bye Bye Love\".\nAlso, I couldn't track down a copy of the Paul Kane single version of “He Was My Brother” in decent quality, so I used the version on <em>The Paul Simon Songbook</em> instead, as they're basically identical performances.\n<strong>Resources</strong>\n\nAs usual, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-135-the-sound-of-silence-by-simon-and-garfunkel/\">a Mixcloud playlist</a> of the music excerpted here.\n\n<a href=\"https://amzn.to/3GaZTLq\">This compilation</a> collects all Simon and Garfunkel's studio albums, with bonus tracks, plus a DVD of their reunion concert.\n\nThere are many collections of the pre-S&G recordings by the two, as these are now largely in the public domain. <a href=\"https://amzn.to/3vwkTHs\">This one</a> contains a good selection.\n\nI've referred to several books for this episode:\n\n<a href=\"https://amzn.to/3B5mYLw\"><em>Simon and Garfunkel: Together Alone</em></a> by Spencer Leigh is a breezy, well-researched, biography of the duo.\n\n<a href=\"https://amzn.to/3jowrb7\"><em>Paul Simon: The Life </em>by Robert Hilburn</a> is the closest thing there is to an authorised biography of Simon.\n\nAnd <a href=\"https://amzn.to/3AXSjjv\"><em>What is it All But Luminous?</em> </a>is Art Garfunkel's memoir. It's not particularly detailed, being more a collection of thoughts and poetry than a structured narrative, but gives a good idea of Garfunkel's attitude to people and events in his life.\n\n<a href=\"https://amzn.to/2GNAM63\"><em>Roots, Radicals, and Rockers: How Skiffle Changed the World</em> by Billy Bragg</a> has some great information on the British folk scene of the fifties and sixties.\n\nAnd <a href=\"https://amzn.to/3rnFJq3\"><em>Singing From the Floor</em> </a>is an oral history of British folk clubs, including a chapter on Dylan’s 1962 visit to London.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, we're going to take a look at a hit record that almost never happened -- a record by a duo who had already split up, twice, by the time it became a hit, and who didn't know it was going to come out. We're going to look at how a duo who started off as an Everly Brothers knockoff, before becoming unsuccessful Greenwich Village folkies, were turned into one of the biggest acts of the sixties by their producer. We're going to look at Simon and Garfunkel, and at \"The Sound of Silence\":\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nThe story of Simon and Garfunkel starts with two children in a school play.  Neither Paul Simon or Art Garfunkel had many friends when they met in a school performance of Alice in Wonderland, where Simon was playing the White Rabbit and Garfunkel the Cheshire Cat. Simon was well-enough liked, by all accounts, but he'd been put on an accelerated programme for gifted students which meant he was progressing through school faster than his peers. He had a small social group, mostly based around playing baseball, but wasn't one of the popular kids.\n\nArt Garfunkel, another gifted student, had no friends at all until he got to know Simon, who he described later as his \"one and only friend\" in this time period. One passage in Garfunkel's autobiography seems to me to sum up everything about Garfunkel's personality as a child -- and indeed a large part of his personality as it comes across in interviews to this day. He talks about the pleasure he got from listening to the chart rundown on the radio -- \"It was the numbers that got me. I kept meticulous lists—when a new singer like Tony Bennett came onto the charts with “Rags to Riches,” I watched the record jump from, say, #23 to #14 in a week. The mathematics of the jumps went to my sense of fun.\"\n\nGarfunkel is, to this day, a meticulous person -- on his website he has a list of every book he's read since June 1968, which is currently up to one thousand three hundred and ten books, and he has always had a habit of starting elaborate projects and ticking off every aspect of them as he goes. Both Simon and Garfunkel were outsiders at this point, other than their interests in sport, but Garfunkel was by far the more introverted of the two, and as a result he seems to have needed their friendship more than Simon did.\n\nBut the two boys developed an intense, close, friendship, initially based around their shared sense of humour. Both of them were avid readers of Mad magazine, which had just started publishing when the two of them had met up, and both could make each other laugh easily.\n\nBut they soon developed a new interest, when Martin Block on the middle-of-the-road radio show Make Believe Ballroom announced that he was going to play the worst record he'd ever heard. That record was \"Gee\" by the Crows:\n\n[Excerpt: The Crows, \"Gee\"]\n\nPaul Simon later said that that record was the first thing he'd ever heard on that programme that he liked, and soon he and Garfunkel had become regular listeners to Alan Freed's show on WINS, loving the new rock and roll music they were discovering. Art had already been singing in public from an early age -- his first public performance had been singing Nat \"King\" Cole's hit \"Too Young\" in a school talent contest when he was nine -- but the two started singing together. The first performance by Simon and Garfunkel was at a high school dance and, depending on which source you read, was a performance either of \"Sh'Boom\" or of Big Joe Turner's \"Flip, Flop, and Fly\":\n\n[Excerpt: Big Joe Turner, \"Flip, Flop, and Fly\"]\n\nThe duo also wrote at least one song together as early as 1955 -- or at least Garfunkel says they wrote it together. Paul Simon describes it as one he wrote. They tried to get a record deal with the song, but it was never recorded at the time -- but Simon has later performed it:\n\n[Excerpt: Paul Simon, \"The Girl For Me\"]\n\nEven at this point, though, while Art Garfunkel was putting all his emotional energy into the partnership with Simon, Simon was interested in performing with other people. Al Kooper was another friend of Simon's at the time, and apparently Simon and Kooper would also perform together.\n\nOnce Elvis came on to Paul's radar, he also bought a guitar, but it was when the two of them first heard the Everly Brothers that they realised what it was that they could do together.\n\nSimon fell in love with the Everly Brothers as soon as he heard \"Bye Bye Love\":\n\n[Excerpt: The Everly Brothers, \"Bye Bye Love\"]\n\nUp to this point, Paul hadn't bought many records -- he spent his money on baseball cards and comic books, and records just weren't good value. A pack of baseball cards was five cents, a comic book was ten cents, but a record was a dollar. Why buy records when you could hear music on the radio for free? But he needed that record, he couldn't just wait around to hear it on the radio. He made an hour-long two-bus journey to a record shop in Queens, bought the record, took it home, played it... and almost immediately scratched it.\n\nSo he got back on the bus, travelled for another hour, bought another copy, took it home, and made sure he didn't scratch that one.\n\nSimon and Garfunkel started copying the Everlys' harmonies, and would spend hours together, singing close together watching each other's mouths and copying the way they formed words, eventually managing to achieve a vocal blend through sheer effort which would normally only come from familial closeness. Paul became so obsessed with music that he sold his baseball card collection and bought a tape recorder for two hundred dollars.\n\nThey would record themselves singing, and then sing back along with it, multitracking themselves, but also critiquing the tape, refining their performances.\n\nPaul's father was a bass player -- \"the family bassman\", as he would later sing -- and encouraged his son in his music, even as he couldn't see the appeal in this new rock and roll music. He would critique Paul's songs, saying things like \"you went from four-four to a bar of nine-eight, you can't do that\" -- to which his son would say \"I just did\" -- but this wasn't hostile criticism, rather it was giving his son a basic grounding in song construction which would prove invaluable. But the duo's first notable original song -- and first hit -- came about more or less by accident.\n\nIn early 1956, the doo-wop group the Clovers had released the hit single \"Devil or Angel\". Its B-side had a version of \"Hey Doll Baby\", a song written by the blues singer Titus Turner, and which sounds to me very inspired by Hank Williams' \"Hey, Good Lookin'\":\n\n[Excerpt: The Clovers, \"Hey, Doll Baby\"]\n\nThat song was picked up by the Everly Brothers, who recorded it for their first album:\n\n[Excerpt: The Everly Brothers, \"Hey Doll Baby\"]\n\nHere is where the timeline gets a little confused for me, because that album wasn't released until early 1958, although the recording session for that track was in August 1957. Yet that track definitely influenced Paul Simon and Art Garfunkel to record a song that they released in November 1957. All I can imagine is that they heard the brothers perform it live, or maybe a radio station had an acetate copy.\n\nBecause the way everyone has consistently told the story is that at the end of summer 1957, Simon and Garfunkel had both heard the Everly Brothers perform \"Hey Doll Baby\", but couldn't remember how it went. The two of them tried to remember it, and to work a version of it out together, and their hazy memories combined to reconstruct something that was completely different, and which owed at least as much to \"Wake Up Little Suzie\" as to \"Hey Doll Baby\". Their new song, \"Hey Schoolgirl\", was catchy enough that they thought if they recorded a demo of it, maybe the Everly Brothers themselves would record the song.\n\nAt the demo studio they happened to encounter Sid Prosen, who owned a small record label named Big Records. He heard the duo perform and realised he might have his own Everly Brothers here. He signed the duo to a contract, and they went into a professional studio to rerecord \"Hey Schoolgirl\", this time with Paul's father on bass, and a couple of other musicians to fill out the sound:\n\n[Excerpt: Tom and Jerry, \"Hey Schoolgirl\"]\n\nOf course, the record couldn't be released under their real names -- there was no way anyone was going to buy a record by Simon and Garfunkel. So instead they became Tom and Jerry. Paul Simon was Jerry Landis -- a surname he chose because he had a crush on a girl named Sue Landis. Art became Tom Graff, because he liked drawing graphs.\n\n\"Hey Schoolgirl\" became a local hit. The two were thrilled to hear it played on Alan Freed's show (after Sid Prosen gave Freed two hundred dollars), and were even more thrilled when they got to perform on American Bandstand, on the same show as Jerry Lee Lewis. When Dick Clark asked them where they were from, Simon decided to claim he was from Macon, Georgia, where Little Richard came from, because all his favourite rock and roll singers were from the South.\n\n\"Hey Schoolgirl\" only made number forty-nine nationally, because the label didn't have good national distribution, but it sold over a hundred thousand copies, mostly in the New York area. And Sid Prosen seems to have been one of a very small number of independent label owners who wasn't a crook -- the two boys got about two thousand dollars each from their hit record.\n\nBut while Tom and Jerry seemed like they might have a successful career, Simon and Garfunkel were soon to split up, and the reason for their split was named True Taylor.\n\nPaul had been playing some of his songs for Sid Prosen, to see what the duo's next single should be, and Prosen had noticed that while some of them were Everly Brothers soundalikes, others were Elvis soundalikes. Would Paul be interested in recording some of those, too? Obviously Art couldn't sing on those, so they'd use a different name, True Taylor. The single was released around the same time as the second Tom and Jerry record, and featured an Elvis-style ballad by Paul on one side, and a rockabilly song written by his father on the other:\n\n[Excerpt: True Taylor, \"True or False\"]\n\nBut Paul hadn't discussed that record with Art before doing it, and the two had vastly different ideas about their relationship. Paul was Art's only friend, and Art thought they had an indissoluble bond and that they would always work together. Paul, on the other hand, thought of Art as one of his friends and someone he made music with, but he could play at being Elvis if he wanted, as well as playing at being an Everly brother.\n\nGarfunkel, in his memoir published in 2017, says \"the friendship was shattered for life\" -- he decided then and there that Paul Simon was a \"base\" person, a betrayer. But on the other hand, he still refers to Simon, over and over again, in that book as still being his friend, even as Simon has largely been disdainful of him since their last performance together in 2010. Friendships are complicated.\n\nTom and Jerry struggled on for a couple more singles, which weren't as successful as \"Hey Schoolgirl\" had been, with material like \"Two Teenagers\", written by Rose Marie McCoy:\n\n[Excerpt: Tom and Jerry, \"Two Teenagers\"]\n\nBut as they'd stopped being friends, and they weren't selling records, they drifted apart and didn't really speak for five years, though they would occasionally run into one another. They both went off to university, and Garfunkel basically gave up on the idea of having a career in music, though he did record a couple of singles, under the name \"Artie Garr\":\n\n[Excerpt: Artie Garr, \"Beat Love\"]\n\nBut for the most part, Garfunkel concentrated on his studies, planning to become either an architect or maybe an academic.\n\nPaul Simon, on the other hand, while he was technically studying at university too, was only paying minimal attention to his studies. Instead, he was learning the music business. Every afternoon, after university had finished, he'd go around the Brill Building and its neighbouring buildings, offering his services both as a songwriter and as a demo performer. As Simon was competent on guitar, bass, and drums, could sing harmonies, and could play a bit of piano if it was in the key of C, he could use primitive multitracking to play and sing all the parts on a demo, and do it well:\n\n[Excerpt: Paul Simon, \"Boys Were Made For Girls\"]\n\nThat's an excerpt from a demo Simon recorded for Burt Bacharach, who has said that he tried to get Simon to record as many of his demos as possible, though only a couple of them have surfaced publicly. Simon would also sometimes record demos with his friend Carole Klein, sometimes under the name The Cosines:\n\n[Excerpt: The Cosines, \"Just to Be With You\"]\n\nAs we heard back in the episode on \"Will You Love Me Tomorrow?\", Carole Klein went on to change her name to Carole King, and become one of the most successful songwriters of the era -- something which spurred Paul Simon on, as he wanted to emulate her success. Simon tried to get signed up by Don Kirshner, who was publishing Goffin and King, but Kirshner turned Simon down -- an expensive mistake for Kirshner, but one that would end up benefiting Simon, who eventually figured out that he should own his own publishing.\n\nSimon was also getting occasional work as a session player, and played lead guitar on \"The Shape I'm In\" by Johnny Restivo, which made the lower reaches of the Hot One Hundred:\n\n[Excerpt: Johnny Restivo, \"The Shape I'm In\"]\n\nBetween 1959 and 1963 Simon recorded a whole string of unsuccessful pop singles. including as a member of the Mystics:\n\n[Excerpt: The Mystics, \"All Through the Night\"]\n\nHe even had a couple of very minor chart hits -- he got to number 99 as Tico and the Triumphs:\n\n[Excerpt: Tico and the Triumphs, \"Motorcycle\"]\n\nand number ninety-seven as Jerry Landis:\n\n[Excerpt: Jerry Landis, \"The Lone Teen Ranger\"]\n\nBut he was jumping around, hopping onto every fad as it passed, and not getting anywhere.\n\nAnd then he started to believe that he could do something more interesting in music. He first became aware that the boundaries of what could be done in music extended further than \"ooh-bop-a-loochy-ba\" when he took a class on modern music at university, which included a trip to Carnegie Hall to hear a performance of music by the avant-garde composer Edgard Varese:\n\n[Excerpt: Edgard Varese, \"Ionisation\"]\n\nSimon got to meet Varese after the performance, and while he would take his own music in a very different, and much more commercial, direction than Varese's, he was nonetheless influenced by what Varese's music showed about the possibilities that existed in music.\n\nThe other big influence on Simon at this time was when he heard The Freewheelin' Bob Dylan:\n\n[Excerpt: Bob Dylan, \"Girl From the North Country\"]\n\nSimon immediately decided to reinvent himself as a folkie, despite at this point knowing very little about folk music other than the Everly Brothers' Songs Our Daddy Taught Us album. He tried playing around Greenwich Village, but found it an uncongenial atmosphere, and inspired by the liner notes to the Dylan album, which talked about Dylan's time in England, he made what would be the first of several trips to the UK, where he was given a rapturous reception simply on the grounds of being an American and owning a better acoustic guitar -- a Martin -- than most British people owned. He had the showmanship that he'd learned from watching his father on stage and sometimes playing with him, and from his time in Tom and Jerry and working round the studios, and so he was able to impress the British folk-club audiences, who were used to rather earnest, scholarly, people, not to someone like Simon who was clearly ambitious and very showbiz.\n\nHis repertoire at this point consisted mostly of songs from the first two Dylan albums, a Joan Baez record, Little Willie John's \"Fever\", and one song he'd written himself, an attempt at a protest song called \"He Was My Brother\", which he would release on his return to the US under yet another stage name, Paul Kane:\n\n[Excerpt: Paul Kane, \"He Was My Brother\"]\n\nSimon has always stated that that song was written about a friend of his who was murdered when he went down to Mississippi with the Freedom Riders -- but while Simon's friend was indeed murdered, it wasn't until about a year after he wrote the song, and Simon has confused the timelines in his subsequent recollections.\n\nAt the time he recorded that, when he had returned to New York at the end of the summer, Simon had a job as a song plugger for a publishing company, and he gave the publishing company the rights to that song and its B-side, which led to that B-side getting promoted by the publisher, and ending up covered on one of the biggest British albums of 1964, which went to number two in the UK charts:\n\n[Excerpt: Val Doonican, \"Carlos Dominguez\"]\n\nOddly, that may not end up being the only time we feature a Val Doonican track on this podcast.\n\nSimon continued his attempts to be a folkie, even teaming up again with Art Garfunkel, with whom he'd re-established contact, to perform in Greenwich Village as Kane and Garr, but they went down no better as a duo than Simon had as a solo artist.\n\nSimon went back to the UK again over Christmas 1963, and while he was there he continued work on a song that would become such a touchstone for him that of the first six albums he would be involved in, four would feature the song while a fifth would include a snippet of it. \"The Sound of Silence\" was apparently started in November 1963, but not finished until February 1964, by which time he was once again back in the USA, and back working as a song plugger.\n\nIt was while working as a song plugger that Simon first met Tom Wilson, Bob Dylan's producer at Columbia. Simon met up with Wilson trying to persuade him to use some of the songs that the publishing company were putting out. When Wilson wasn't interested, Simon played him a couple of his own songs. Wilson took one of them, \"He Was My Brother\", for the Pilgrims, a group he was producing who were supposed to be the Black answer to Peter, Paul, and Mary:\n\n[Excerpt: The Pilgrims, \"He Was My Brother\"]\n\nWilson was also interested in \"The Sound of Silence\", but Simon was more interested in getting signed as a performer than in having other acts perform his songs. Wilson was cautious, though -- he was already producing one folkie singer-songwriter, and he didn't really need a second one. But he *could* probably do with a vocal group...\n\nSimon mentioned that he had actually made a couple of records before, as part of a duo. Would Wilson be at all interested in a vocal *duo*? Wilson would be interested. Simon and Garfunkel auditioned for him, and a few days later were in the Columbia Records studio on Seventh Avenue recording their first album as a duo, which was also the first time either of them would record under their own name.\n\nWednesday Morning, 3AM, the duo's first album, was a simple acoustic album, and the only instrumentation was Simon and Barry Kornfeld, a Greenwich Village folkie, on guitars, and Bill Lee, the double bass player who'd played with Dylan and others, on bass.\n\nTom Wilson guided the duo in their song selection, and the eventual album contained six cover versions and six originals written by Simon. The cover versions were a mixture of hootenanny staples like \"Go Tell it on the Mountain\", plus Dylan's \"The Times They Are A-Changin'\", included to cross-promote Dylan's new album and to try to link the duo with the more famous writer, and one unusual one, \"The Sun is Burning\", written by Ian Campbell, a Scottish folk singer who Simon had got to know on his trips to the UK:\n\n[Excerpt: Simon and Garfunkel, \"The Sun is Burning\"]\n\nBut the song that everyone was keenest on was \"The Sound of Silence\", the first song that Simon had written that he thought would stand up in comparison with the sort of song that Dylan was writing:\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence (Wednesday Morning 3AM version)\"]\n\nIn between sessions for the album, Simon and Garfunkel also played a high-profile gig at Gerde's Folk City in the Village, and a couple of shows at the Gaslight Cafe. The audiences there, though, regarded them as a complete joke -- Dave Van Ronk would later relate that for weeks afterwards, all anyone had to do was sing \"Hello darkness, my old friend\", for everyone around to break into laughter. Bob Dylan was one of those who laughed at the performance -- though Robert Shelton later said that Dylan hadn't been laughing at them, specifically, he'd just had a fit of the giggles -- and this had led to a certain amount of anger from Simon towards Dylan.\n\nThe album was recorded in March 1964, and was scheduled for release  in October. In the meantime, they both made plans to continue with their studies and their travels. Garfunkel was starting to do postgraduate work towards his doctorate in mathematics, while Simon was now enrolled in Brooklyn Law School, but was still spending most of his time travelling, and would drop out after one semester. He would spend much of the next eighteen months in the UK.\n\nWhile he was occasionally in the US between June 1964 and November 1965, Simon now considered himself based in England, where he made several acquaintances that would affect his life deeply. Among them were a young woman called Kathy Chitty, with whom he would fall in love and who would inspire many of his songs, and an older woman called Judith Piepe (and I apologise if I'm mispronouncing her name, which I've only ever seen written down, never heard) who many people believed had an unrequited crush on Simon. Piepe ran her London flat as something of a commune for folk musicians, and Simon lived there for months at a time while in the UK. Among the other musicians who stayed there for a time were Sandy Denny, Cat Stevens, and Al Stewart, whose bedroom was next door to Simon's.\n\nPiepe became Simon's de facto unpaid manager and publicist, and started promoting him around the British folk scene. Simon also at this point became particularly interested in improving his guitar playing. He was spending a lot of time at Les Cousins, the London club that had become the centre of British acoustic guitar.\n\nThere are, roughly, three styles of acoustic folk guitar -- to be clear, I'm talking about very broad-brush categorisations here, and there are people who would disagree and say there are more, but these are the main ones. Two of these are American styles -- there's the simple style known as Carter scratching, popularised by Mother Maybelle Carter of the Carter family, and for this all you do is alternate bass notes with your thumb while scratching the chord on the treble strings with one finger, like this:\n\n[Excerpt: Carter picking]\n\nThat's the style played by a lot of country and folk players who were primarily singers accompanying themselves. In the late forties and fifties, though, another style had become popularised -- Travis picking. This is named after Merle Travis, the most well-known player in the style, but he always called it Muhlenberg picking, after Muhlenberg County, where he'd learned the style from Ike Everly -- the Everly Brothers' father -- and Mose Rager, a Black guitarist.\n\nIn Travis picking, the thumb alternates between two bass notes, but rather than strumming a chord, the index and middle fingers play simple patterns on the treble strings, like this:\n\n[Excerpt: Travis picking]\n\nThat's, again, a style primarily used for accompaniment, but it can also be used to play instrumentals by oneself. As well as Travis and Ike Everly, it's also the style played by Donovan, Chet Atkins, James Taylor, and more.\n\nBut there's a third style, British baroque folk guitar, which was largely the invention of Davey Graham. Graham, you might remember, was a folk guitarist who had lived in the same squat as Lionel Bart when Bart started working with Tommy Steele, and who had formed a blues duo with Alexis Korner. Graham is now best known for one of his simpler pieces, “Anji”, which became the song that every British guitarist tried to learn:\n\n[Excerpt: Davey Graham, \"Anji\"]\n\nDozens of people, including Paul Simon, would record versions of that. Graham invented an entirely new style of guitar playing, influenced by ragtime players like Blind Blake, but also by Bach, by Moroccan oud music, and by Celtic bagpipe music. While it was fairly common for players to retune their guitar to an open major chord, allowing them to play slide guitar, Graham retuned his to a suspended fourth chord -- D-A-D-G-A-D -- which allowed him to keep a drone going on some strings while playing complex modal counterpoints on others. While I demonstrated the previous two styles myself, I'm nowhere near a good enough guitarist to demonstrate British folk baroque, so here's an excerpt of Davey Graham playing his own arrangement of the traditional ballad \"She Moved Through the Fair\", recast as a raga and retitled \"She Moved Thru' the Bizarre\":\n\n[Excerpt: Davey Graham, \"She Moved Thru' the Bizarre\"]\n\nGraham's style was hugely influential on an entire generation of British guitarists, people who incorporated world music and jazz influences into folk and blues styles, and that generation of guitarists was coming up at the time and playing at Les Cousins. People who started playing in this style included Jimmy Page, Bert Jansch, Roy Harper, John Renbourn, Richard Thompson, Nick Drake, and John Martyn, and it also had a substantial influence on North American players like Joni Mitchell, Tim Buckley, and of course Paul Simon.\n\nSimon was especially influenced at this time by Martin Carthy, the young British guitarist whose style was very influenced by Graham -- but while Graham applied his style to music ranging from Dave Brubeck to Lutheran hymns to Big Bill Broonzy songs, Carthy mostly concentrated on traditional English folk songs. Carthy had a habit of taking American folk singers under his wing, and he taught Simon several songs, including Carthy's own arrangement of the traditional \"Scarborough Fair\":\n\n[Excerpt: Martin Carthy, \"Scarborough Fair\"]\n\nSimon would later record that arrangement, without crediting Carthy, and this would lead to several decades of bad blood between them, though Carthy forgave him in the 1990s, and the two performed the song together at least once after that.\n\nIndeed, Simon seems to have made a distinctly negative impression on quite a few of the musicians he knew in Britain at this time, who seem to, at least in retrospect, regard him as having rather used and discarded them as soon as his career became successful. Roy Harper has talked in liner notes to CD reissues of his work from this period about how Simon used to regularly be a guest in his home, and how he has memories of Simon playing with Harper's baby son Nick (now himself one of the greats of British guitar) but how as soon as he became successful he never spoke to Harper again.\n\nSimilarly, in 1965 Simon started a writing partnership with Bruce Woodley of the Seekers, an Australian folk-pop band based in the UK, best known for \"Georgy Girl\". The two wrote \"Red Rubber Ball\", which became a hit for the Cyrkle:\n\n[Excerpt: The Cyrke, \"Red Rubber Ball\"]\n\nand also \"Cloudy\", which the Seekers recorded as an album track:\n\n[Excerpt: The Seekers, \"Cloudy\"]\n\nWhen that was recorded by Simon and Garfunkel, Woodley's name was removed from the writing credits, though Woodley still apparently received royalties for it.\n\nBut at this point there *was* no Simon and Garfunkel. Paul Simon was a solo artist working the folk clubs in Britain, and Simon and Garfunkel's one album had sold a minuscule number of copies.\n\nThey did, when Simon briefly returned to the US in March, record two tracks for a prospective single, this time with an electric backing band. One was a rewrite of the title track of their first album, now titled \"Somewhere They Can't Find Me\" and with a new chorus and some guitar parts nicked from Davey Graham's \"Anji\"; the other a Twist-beat song that could almost be Manfred Mann or Georgie Fame -- \"We Got a Groovy Thing Goin'\".\n\nThat was also influenced by “Anji”, though by Bert Jansch's version rather than Graham's original. Jansch rearranged the song and stuck in this phrase:\n\n[Excerpt: Bert Jansch, “Anji”]\n\nWhich became the chorus to “We Got a Groovy Thing Goin'”:\n\n[Excerpt: Simon and Garfunkel, \"We Got a Groovy Thing Goin'\"]\n\nBut that single was never released, and as far as Columbia were concerned, Simon and Garfunkel were a defunct act, especially as Tom Wilson, who had signed them, was looking to move away from Columbia.\n\nArt Garfunkel did come to visit Simon in the UK a couple of times, and they'd even sing together occasionally, but it was on the basis of Paul Simon the successful club act occasionally inviting his friend on stage during the encore, rather than as a duo, and Garfunkel was still seeing music only as a sideline while Simon was now utterly committed to it.\n\nHe was encouraged in this commitment by Judith Piepe, who considered him to be the greatest songwriter of his generation, and who started a letter-writing campaign to that effect, telling the BBC they needed to put him on the radio. Eventually, after a lot of pressure, they agreed -- though they weren't exactly sure what to do with him, as he didn't fit into any of the pop formats they had. He was given his own radio show -- a five-minute show in a religious programming slot. Simon would perform a song, and there would be an introduction tying the song into some religious theme or other.\n\nTwo series of four episodes of this were broadcast, in a plum slot right after Housewives' Choice, which got twenty million listeners, and the BBC were amazed to find that a lot of people phoned in asking where they could get hold of the records by this Paul Simon fellow. Obviously he didn't have any out yet, and even the Simon and Garfunkel album, which had been released in the US, hadn't come out in Britain.\n\nAfter a little bit of negotiation, CBS, the British arm of Columbia Records, had Simon come in and record an album of his songs, titled The Paul Simon Songbook.\n\nThe album, unlike the Simon and Garfunkel album, was made up entirely of Paul Simon originals. Two of them were songs that had previously been recorded for Wednesday Morning 3AM -- \"He Was My Brother\" and a new version of \"The Sound of Silence\":\n\n[Excerpt: Paul Simon, \"The Sound of Silence\"]\n\nThe other ten songs were newly-written pieces like \"April Come She Will\", \"Kathy's Song\", a parody of Bob Dylan entitled \"A Simple Desultory Philippic\", and the song that was chosen as the single, \"I am a Rock\":\n\n[Excerpt: Paul Simon, \"I am a Rock\"]\n\nThat song was also the one that was chosen for Simon's first TV appearance since Tom and Jerry had appeared on Bandstand eight years earlier. The appearance on Ready, Steady, Go, though, was not one that anyone was happy with. Simon had been booked to appear on  a small folk music series, Heartsong, but that series was cancelled before he could appear. Rediffusion, the company that made the series, also made Ready, Steady, Go, and since they'd already paid Simon they decided they might as well stick him on that show and get something for their money.\n\nUnfortunately, the episode in question was already running long, and it wasn't really suited for introspective singer-songwriter performances -- the show was geared to guitar bands and American soul singers. Michael Lindsay-Hogg, the director, insisted that if Simon was going to do his song, he had to cut at least one verse, while Simon was insistent that he needed to perform the whole thing because \"it's a story\". Lindsay-Hogg got his way, but nobody was happy with the performance.\n\nSimon's album was surprisingly unsuccessful, given the number of people who'd called the BBC asking about it -- the joke went round that the calls had all been Judith Piepe doing different voices -- and Simon continued his round of folk clubs, pubs, and birthday parties, sometimes performing with Garfunkel, when he visited for the summer, but mostly performing on his own.\n\nOne time he did perform with a full band, singing “Johnny B Goode” at a birthday party, backed by a band called Joker's Wild who a couple of weeks later went into the studio to record their only privately-pressed five-song record, of them performing recent hits:\n\n[Excerpt: Joker's Wild, \"Walk Like a Man\"]\n\nThe guitarist from Joker's Wild would later join the other band who'd played at that party, but the story of David Gilmour joining Pink Floyd is for another episode.\n\nDuring this time, Simon also produced his first record for someone else, when he was responsible for producing the only album by his friend Jackson C Frank, though there wasn't much production involved as like Simon's own album it was just one man and his guitar. Al Stewart and Art Garfunkel were also in the control room for the recording, but the notoriously shy Frank insisted on hiding behind a screen so they couldn't see him while he recorded:\n\n[Excerpt: Jackson C Frank, \"Blues Run the Game\"]\n\nIt seemed like Paul Simon was on his way to becoming a respected mid-level figure on the British folk scene, releasing occasional albums and maybe having one or two minor hits, but making a steady living. Someone who would be spoken of in the same breath as Ralph McTell perhaps. Meanwhile, Art Garfunkel would be going on to be a lecturer in mathematics whose students might be surprised to know he'd had a minor rock and roll hit as a kid.\n\nBut then something happened that changed everything. Wednesday Morning 3AM hadn't sold at all, and Columbia hadn't promoted it in the slightest. It was too collegiate and polite for the Greenwich Village folkies, and too intellectual for the pop audience that had been buying Peter, Paul, and Mary, and it had come out just at the point that the folk boom had imploded.\n\nBut one DJ in Boston, Dick Summer, had started playing one song from it, \"The Sound of Silence\", and it had caught on with the college students, who loved the song. And then came spring break 1965. All those students went on holiday, and suddenly DJs in places like Cocoa Beach, Florida, were getting phone calls requesting \"The Sound of Silence\" by Simon and Garfunkel. Some of them with contacts at Columbia got in touch with the label, and Tom Wilson had an idea.\n\nOn the first day of what turned out to be his last session with Dylan, the session for \"Like a Rolling Stone\", Wilson asked the musicians to stay behind and work on something. He'd already experimented with overdubbing new instruments on an acoustic recording with his new version of Dylan's \"House of the Rising Sun\", now he was going to try it with \"The Sound of Silence\". He didn't bother asking the duo what they thought -- record labels messed with people's records all the time. So \"The Sound of Silence\" was released as an electric folk-rock single:\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nThis is always presented as Wilson massively changing the sound of the duo without their permission or knowledge, but the fact is that they had *already* gone folk-rock, back in March, so they were already thinking that way.\n\nThe track was released as a single with “We Got a Groovy Thing Going” on the B-side, and was promoted first in the Boston market, and it did very well. Roy Harper later talked about Simon's attitude at this time, saying \"I can remember going into the gents in The Three Horseshoes in Hempstead during a gig, and we’re having a pee together. He was very excited, and he turns round to me and and says, “Guess what, man? We’re number sixteen in Boston with The Sound of Silence'”. A few days later I was doing another gig with him and he made a beeline for me. “Guess what?” I said “You’re No. 15 in Boston”. He said, “No man, we’re No. 1 in Boston”. I thought, “Wow. No. 1 in Boston, eh?” It was almost a joke, because I really had no idea what that sort of stuff meant at all.\"\n\nSimon was even more excited when the record started creeping up the national charts, though he was less enthused when his copy of the single arrived from America. He listened to it, and thought the arrangement was a Byrds rip-off, and cringed at the way the rhythm section had to slow down and speed up in order to stay in time with the acoustic recording:\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nI have to say that, while the tempo fluctuations are noticeable once you know to look for them, it's a remarkably tight performance given the circumstances.\n\nAs the record went up the charts, Simon was called back to America, to record an album to go along with it. The Paul Simon Songbook hadn't been released in the US,  and they needed an album *now*, and Simon was a slow songwriter, so the duo took six songs from that album and rerecorded them in folk-rock versions with their new producer Bob Johnston, who was also working with Dylan now, since Tom Wilson had moved on to Verve records. They filled out the album with \"The Sound of Silence\", the two electric tracks from March, one new song, \"Blessed\", and a version of \"Anji\", which came straight after \"Somewhere They Can't Find Me\", presumably to acknowledge Simon lifting bits of it. That version of “Anji” also followed Jansch's arrangement, and so included the bit that Simon had taken for “We Got a Groovy Thing Going” as well.\n\nThey also recorded their next single, which was released on the British version of the album but not the American one, a song that Simon had written during a thoroughly depressing tour of Lancashire towns (he wrote it in Widnes, but a friend of Simon's who lived in Widnes later said that while it was written in Widnes it was written *about* Birkenhead. Simon has also sometimes said it was about Warrington or Wigan, both of which are so close to Widnes and so similar in both name and atmosphere that it would be the easiest thing in the world to mix them up.)\n\n[Excerpt: Simon and Garfunkel, \"Homeward Bound\"]\n\nThese tracks were all recorded in December 1965, and they featured the Wrecking Crew -- Bob Johnston wanted the best, and didn't rate the New York players that Wilson had used, and so they were recorded in LA with Glen Campbell, Joe South, Hal Blaine, Larry Knechtel, and Joe Osborne. I've also seen in some sources that there were sessions in Nashville with A-team players Fred Carter and Charlie McCoy.\n\nBy January, \"The Sound of Silence\" had reached number one, knocking \"We Can Work it Out\" by the Beatles off the top spot for two weeks, before the Beatles record went back to the top. They'd achieved what they'd been trying for for nearly a decade, and I'll give the last word here to Paul Simon, who said of the achievement:\n\n\"I had come back to New York, and I was staying in my old room at my parents' house. Artie was living at his parents' house, too. I remember Artie and I were sitting there in my car one night, parked on a street in Queens, and the announcer said, \"Number one, Simon & Garfunkel.\" And Artie said to me, \"That Simon & Garfunkel, they must be having a great time.\"\"",
  "itunes:subtitle": "Episode one hundred and thirty-five of A History of Rock Music in Five Hundred Songs looks at “The Sound of Silence by Simon and Garfunkel, and the many records they made, together and apart, before their success. Click the full post to read liner notes,",
  "itunes:keywords": "Al Kooper,Al Stewart,Alan Freed,Art Garfunkel,Bert Jansch,Bob Dylan,Carole King,Dave Gilmour,Davey Graham,Edgard Varese,Jackson C Frank,Martin Carthy,Paul Simon,Ready Steady Go,Roy Harper,Simon and Garfunkel,The Everly Brothers,The Seekers,The Wrecking Crew,Tom Wilson",
  "itunes:episodeType": "full",
  "itunes:episode": 135,
  "content:encoded": "Episode one hundred and thirty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at “The Sound of Silence\" by Simon and Garfunkel, and the many records they made, together and apart, before their success. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/57687315\">on \"Blues Run the Game\" by Jackson C. Frank</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\nI talk about a tour of Lancashire towns, but some of the towns I mention were in Cheshire at the time, and some are in Greater Manchester or Merseyside now. They're all very close together though.\nI say Mose Rager was Black. I was misremembering, confusing Mose Rager, a white player in the Muhlenberg style, with Arnold Schultz, a Black player who invented it. I got this right in the episode on \"Bye Bye Love\".\nAlso, I couldn't track down a copy of the Paul Kane single version of “He Was My Brother” in decent quality, so I used the version on <em>The Paul Simon Songbook</em> instead, as they're basically identical performances.\n<strong>Resources</strong>\n\nAs usual, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-135-the-sound-of-silence-by-simon-and-garfunkel/\">a Mixcloud playlist</a> of the music excerpted here.\n\n<a href=\"https://amzn.to/3GaZTLq\">This compilation</a> collects all Simon and Garfunkel's studio albums, with bonus tracks, plus a DVD of their reunion concert.\n\nThere are many collections of the pre-S&G recordings by the two, as these are now largely in the public domain. <a href=\"https://amzn.to/3vwkTHs\">This one</a> contains a good selection.\n\nI've referred to several books for this episode:\n\n<a href=\"https://amzn.to/3B5mYLw\"><em>Simon and Garfunkel: Together Alone</em></a> by Spencer Leigh is a breezy, well-researched, biography of the duo.\n\n<a href=\"https://amzn.to/3jowrb7\"><em>Paul Simon: The Life </em>by Robert Hilburn</a> is the closest thing there is to an authorised biography of Simon.\n\nAnd <a href=\"https://amzn.to/3AXSjjv\"><em>What is it All But Luminous?</em> </a>is Art Garfunkel's memoir. It's not particularly detailed, being more a collection of thoughts and poetry than a structured narrative, but gives a good idea of Garfunkel's attitude to people and events in his life.\n\n<a href=\"https://amzn.to/2GNAM63\"><em>Roots, Radicals, and Rockers: How Skiffle Changed the World</em> by Billy Bragg</a> has some great information on the British folk scene of the fifties and sixties.\n\nAnd <a href=\"https://amzn.to/3rnFJq3\"><em>Singing From the Floor</em> </a>is an oral history of British folk clubs, including a chapter on Dylan’s 1962 visit to London.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, we're going to take a look at a hit record that almost never happened -- a record by a duo who had already split up, twice, by the time it became a hit, and who didn't know it was going to come out. We're going to look at how a duo who started off as an Everly Brothers knockoff, before becoming unsuccessful Greenwich Village folkies, were turned into one of the biggest acts of the sixties by their producer. We're going to look at Simon and Garfunkel, and at \"The Sound of Silence\":\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nThe story of Simon and Garfunkel starts with two children in a school play.  Neither Paul Simon or Art Garfunkel had many friends when they met in a school performance of Alice in Wonderland, where Simon was playing the White Rabbit and Garfunkel the Cheshire Cat. Simon was well-enough liked, by all accounts, but he'd been put on an accelerated programme for gifted students which meant he was progressing through school faster than his peers. He had a small social group, mostly based around playing baseball, but wasn't one of the popular kids.\n\nArt Garfunkel, another gifted student, had no friends at all until he got to know Simon, who he described later as his \"one and only friend\" in this time period. One passage in Garfunkel's autobiography seems to me to sum up everything about Garfunkel's personality as a child -- and indeed a large part of his personality as it comes across in interviews to this day. He talks about the pleasure he got from listening to the chart rundown on the radio -- \"It was the numbers that got me. I kept meticulous lists—when a new singer like Tony Bennett came onto the charts with “Rags to Riches,” I watched the record jump from, say, #23 to #14 in a week. The mathematics of the jumps went to my sense of fun.\"\n\nGarfunkel is, to this day, a meticulous person -- on his website he has a list of every book he's read since June 1968, which is currently up to one thousand three hundred and ten books, and he has always had a habit of starting elaborate projects and ticking off every aspect of them as he goes. Both Simon and Garfunkel were outsiders at this point, other than their interests in sport, but Garfunkel was by far the more introverted of the two, and as a result he seems to have needed their friendship more than Simon did.\n\nBut the two boys developed an intense, close, friendship, initially based around their shared sense of humour. Both of them were avid readers of Mad magazine, which had just started publishing when the two of them had met up, and both could make each other laugh easily.\n\nBut they soon developed a new interest, when Martin Block on the middle-of-the-road radio show Make Believe Ballroom announced that he was going to play the worst record he'd ever heard. That record was \"Gee\" by the Crows:\n\n[Excerpt: The Crows, \"Gee\"]\n\nPaul Simon later said that that record was the first thing he'd ever heard on that programme that he liked, and soon he and Garfunkel had become regular listeners to Alan Freed's show on WINS, loving the new rock and roll music they were discovering. Art had already been singing in public from an early age -- his first public performance had been singing Nat \"King\" Cole's hit \"Too Young\" in a school talent contest when he was nine -- but the two started singing together. The first performance by Simon and Garfunkel was at a high school dance and, depending on which source you read, was a performance either of \"Sh'Boom\" or of Big Joe Turner's \"Flip, Flop, and Fly\":\n\n[Excerpt: Big Joe Turner, \"Flip, Flop, and Fly\"]\n\nThe duo also wrote at least one song together as early as 1955 -- or at least Garfunkel says they wrote it together. Paul Simon describes it as one he wrote. They tried to get a record deal with the song, but it was never recorded at the time -- but Simon has later performed it:\n\n[Excerpt: Paul Simon, \"The Girl For Me\"]\n\nEven at this point, though, while Art Garfunkel was putting all his emotional energy into the partnership with Simon, Simon was interested in performing with other people. Al Kooper was another friend of Simon's at the time, and apparently Simon and Kooper would also perform together.\n\nOnce Elvis came on to Paul's radar, he also bought a guitar, but it was when the two of them first heard the Everly Brothers that they realised what it was that they could do together.\n\nSimon fell in love with the Everly Brothers as soon as he heard \"Bye Bye Love\":\n\n[Excerpt: The Everly Brothers, \"Bye Bye Love\"]\n\nUp to this point, Paul hadn't bought many records -- he spent his money on baseball cards and comic books, and records just weren't good value. A pack of baseball cards was five cents, a comic book was ten cents, but a record was a dollar. Why buy records when you could hear music on the radio for free? But he needed that record, he couldn't just wait around to hear it on the radio. He made an hour-long two-bus journey to a record shop in Queens, bought the record, took it home, played it... and almost immediately scratched it.\n\nSo he got back on the bus, travelled for another hour, bought another copy, took it home, and made sure he didn't scratch that one.\n\nSimon and Garfunkel started copying the Everlys' harmonies, and would spend hours together, singing close together watching each other's mouths and copying the way they formed words, eventually managing to achieve a vocal blend through sheer effort which would normally only come from familial closeness. Paul became so obsessed with music that he sold his baseball card collection and bought a tape recorder for two hundred dollars.\n\nThey would record themselves singing, and then sing back along with it, multitracking themselves, but also critiquing the tape, refining their performances.\n\nPaul's father was a bass player -- \"the family bassman\", as he would later sing -- and encouraged his son in his music, even as he couldn't see the appeal in this new rock and roll music. He would critique Paul's songs, saying things like \"you went from four-four to a bar of nine-eight, you can't do that\" -- to which his son would say \"I just did\" -- but this wasn't hostile criticism, rather it was giving his son a basic grounding in song construction which would prove invaluable. But the duo's first notable original song -- and first hit -- came about more or less by accident.\n\nIn early 1956, the doo-wop group the Clovers had released the hit single \"Devil or Angel\". Its B-side had a version of \"Hey Doll Baby\", a song written by the blues singer Titus Turner, and which sounds to me very inspired by Hank Williams' \"Hey, Good Lookin'\":\n\n[Excerpt: The Clovers, \"Hey, Doll Baby\"]\n\nThat song was picked up by the Everly Brothers, who recorded it for their first album:\n\n[Excerpt: The Everly Brothers, \"Hey Doll Baby\"]\n\nHere is where the timeline gets a little confused for me, because that album wasn't released until early 1958, although the recording session for that track was in August 1957. Yet that track definitely influenced Paul Simon and Art Garfunkel to record a song that they released in November 1957. All I can imagine is that they heard the brothers perform it live, or maybe a radio station had an acetate copy.\n\nBecause the way everyone has consistently told the story is that at the end of summer 1957, Simon and Garfunkel had both heard the Everly Brothers perform \"Hey Doll Baby\", but couldn't remember how it went. The two of them tried to remember it, and to work a version of it out together, and their hazy memories combined to reconstruct something that was completely different, and which owed at least as much to \"Wake Up Little Suzie\" as to \"Hey Doll Baby\". Their new song, \"Hey Schoolgirl\", was catchy enough that they thought if they recorded a demo of it, maybe the Everly Brothers themselves would record the song.\n\nAt the demo studio they happened to encounter Sid Prosen, who owned a small record label named Big Records. He heard the duo perform and realised he might have his own Everly Brothers here. He signed the duo to a contract, and they went into a professional studio to rerecord \"Hey Schoolgirl\", this time with Paul's father on bass, and a couple of other musicians to fill out the sound:\n\n[Excerpt: Tom and Jerry, \"Hey Schoolgirl\"]\n\nOf course, the record couldn't be released under their real names -- there was no way anyone was going to buy a record by Simon and Garfunkel. So instead they became Tom and Jerry. Paul Simon was Jerry Landis -- a surname he chose because he had a crush on a girl named Sue Landis. Art became Tom Graff, because he liked drawing graphs.\n\n\"Hey Schoolgirl\" became a local hit. The two were thrilled to hear it played on Alan Freed's show (after Sid Prosen gave Freed two hundred dollars), and were even more thrilled when they got to perform on American Bandstand, on the same show as Jerry Lee Lewis. When Dick Clark asked them where they were from, Simon decided to claim he was from Macon, Georgia, where Little Richard came from, because all his favourite rock and roll singers were from the South.\n\n\"Hey Schoolgirl\" only made number forty-nine nationally, because the label didn't have good national distribution, but it sold over a hundred thousand copies, mostly in the New York area. And Sid Prosen seems to have been one of a very small number of independent label owners who wasn't a crook -- the two boys got about two thousand dollars each from their hit record.\n\nBut while Tom and Jerry seemed like they might have a successful career, Simon and Garfunkel were soon to split up, and the reason for their split was named True Taylor.\n\nPaul had been playing some of his songs for Sid Prosen, to see what the duo's next single should be, and Prosen had noticed that while some of them were Everly Brothers soundalikes, others were Elvis soundalikes. Would Paul be interested in recording some of those, too? Obviously Art couldn't sing on those, so they'd use a different name, True Taylor. The single was released around the same time as the second Tom and Jerry record, and featured an Elvis-style ballad by Paul on one side, and a rockabilly song written by his father on the other:\n\n[Excerpt: True Taylor, \"True or False\"]\n\nBut Paul hadn't discussed that record with Art before doing it, and the two had vastly different ideas about their relationship. Paul was Art's only friend, and Art thought they had an indissoluble bond and that they would always work together. Paul, on the other hand, thought of Art as one of his friends and someone he made music with, but he could play at being Elvis if he wanted, as well as playing at being an Everly brother.\n\nGarfunkel, in his memoir published in 2017, says \"the friendship was shattered for life\" -- he decided then and there that Paul Simon was a \"base\" person, a betrayer. But on the other hand, he still refers to Simon, over and over again, in that book as still being his friend, even as Simon has largely been disdainful of him since their last performance together in 2010. Friendships are complicated.\n\nTom and Jerry struggled on for a couple more singles, which weren't as successful as \"Hey Schoolgirl\" had been, with material like \"Two Teenagers\", written by Rose Marie McCoy:\n\n[Excerpt: Tom and Jerry, \"Two Teenagers\"]\n\nBut as they'd stopped being friends, and they weren't selling records, they drifted apart and didn't really speak for five years, though they would occasionally run into one another. They both went off to university, and Garfunkel basically gave up on the idea of having a career in music, though he did record a couple of singles, under the name \"Artie Garr\":\n\n[Excerpt: Artie Garr, \"Beat Love\"]\n\nBut for the most part, Garfunkel concentrated on his studies, planning to become either an architect or maybe an academic.\n\nPaul Simon, on the other hand, while he was technically studying at university too, was only paying minimal attention to his studies. Instead, he was learning the music business. Every afternoon, after university had finished, he'd go around the Brill Building and its neighbouring buildings, offering his services both as a songwriter and as a demo performer. As Simon was competent on guitar, bass, and drums, could sing harmonies, and could play a bit of piano if it was in the key of C, he could use primitive multitracking to play and sing all the parts on a demo, and do it well:\n\n[Excerpt: Paul Simon, \"Boys Were Made For Girls\"]\n\nThat's an excerpt from a demo Simon recorded for Burt Bacharach, who has said that he tried to get Simon to record as many of his demos as possible, though only a couple of them have surfaced publicly. Simon would also sometimes record demos with his friend Carole Klein, sometimes under the name The Cosines:\n\n[Excerpt: The Cosines, \"Just to Be With You\"]\n\nAs we heard back in the episode on \"Will You Love Me Tomorrow?\", Carole Klein went on to change her name to Carole King, and become one of the most successful songwriters of the era -- something which spurred Paul Simon on, as he wanted to emulate her success. Simon tried to get signed up by Don Kirshner, who was publishing Goffin and King, but Kirshner turned Simon down -- an expensive mistake for Kirshner, but one that would end up benefiting Simon, who eventually figured out that he should own his own publishing.\n\nSimon was also getting occasional work as a session player, and played lead guitar on \"The Shape I'm In\" by Johnny Restivo, which made the lower reaches of the Hot One Hundred:\n\n[Excerpt: Johnny Restivo, \"The Shape I'm In\"]\n\nBetween 1959 and 1963 Simon recorded a whole string of unsuccessful pop singles. including as a member of the Mystics:\n\n[Excerpt: The Mystics, \"All Through the Night\"]\n\nHe even had a couple of very minor chart hits -- he got to number 99 as Tico and the Triumphs:\n\n[Excerpt: Tico and the Triumphs, \"Motorcycle\"]\n\nand number ninety-seven as Jerry Landis:\n\n[Excerpt: Jerry Landis, \"The Lone Teen Ranger\"]\n\nBut he was jumping around, hopping onto every fad as it passed, and not getting anywhere.\n\nAnd then he started to believe that he could do something more interesting in music. He first became aware that the boundaries of what could be done in music extended further than \"ooh-bop-a-loochy-ba\" when he took a class on modern music at university, which included a trip to Carnegie Hall to hear a performance of music by the avant-garde composer Edgard Varese:\n\n[Excerpt: Edgard Varese, \"Ionisation\"]\n\nSimon got to meet Varese after the performance, and while he would take his own music in a very different, and much more commercial, direction than Varese's, he was nonetheless influenced by what Varese's music showed about the possibilities that existed in music.\n\nThe other big influence on Simon at this time was when he heard The Freewheelin' Bob Dylan:\n\n[Excerpt: Bob Dylan, \"Girl From the North Country\"]\n\nSimon immediately decided to reinvent himself as a folkie, despite at this point knowing very little about folk music other than the Everly Brothers' Songs Our Daddy Taught Us album. He tried playing around Greenwich Village, but found it an uncongenial atmosphere, and inspired by the liner notes to the Dylan album, which talked about Dylan's time in England, he made what would be the first of several trips to the UK, where he was given a rapturous reception simply on the grounds of being an American and owning a better acoustic guitar -- a Martin -- than most British people owned. He had the showmanship that he'd learned from watching his father on stage and sometimes playing with him, and from his time in Tom and Jerry and working round the studios, and so he was able to impress the British folk-club audiences, who were used to rather earnest, scholarly, people, not to someone like Simon who was clearly ambitious and very showbiz.\n\nHis repertoire at this point consisted mostly of songs from the first two Dylan albums, a Joan Baez record, Little Willie John's \"Fever\", and one song he'd written himself, an attempt at a protest song called \"He Was My Brother\", which he would release on his return to the US under yet another stage name, Paul Kane:\n\n[Excerpt: Paul Kane, \"He Was My Brother\"]\n\nSimon has always stated that that song was written about a friend of his who was murdered when he went down to Mississippi with the Freedom Riders -- but while Simon's friend was indeed murdered, it wasn't until about a year after he wrote the song, and Simon has confused the timelines in his subsequent recollections.\n\nAt the time he recorded that, when he had returned to New York at the end of the summer, Simon had a job as a song plugger for a publishing company, and he gave the publishing company the rights to that song and its B-side, which led to that B-side getting promoted by the publisher, and ending up covered on one of the biggest British albums of 1964, which went to number two in the UK charts:\n\n[Excerpt: Val Doonican, \"Carlos Dominguez\"]\n\nOddly, that may not end up being the only time we feature a Val Doonican track on this podcast.\n\nSimon continued his attempts to be a folkie, even teaming up again with Art Garfunkel, with whom he'd re-established contact, to perform in Greenwich Village as Kane and Garr, but they went down no better as a duo than Simon had as a solo artist.\n\nSimon went back to the UK again over Christmas 1963, and while he was there he continued work on a song that would become such a touchstone for him that of the first six albums he would be involved in, four would feature the song while a fifth would include a snippet of it. \"The Sound of Silence\" was apparently started in November 1963, but not finished until February 1964, by which time he was once again back in the USA, and back working as a song plugger.\n\nIt was while working as a song plugger that Simon first met Tom Wilson, Bob Dylan's producer at Columbia. Simon met up with Wilson trying to persuade him to use some of the songs that the publishing company were putting out. When Wilson wasn't interested, Simon played him a couple of his own songs. Wilson took one of them, \"He Was My Brother\", for the Pilgrims, a group he was producing who were supposed to be the Black answer to Peter, Paul, and Mary:\n\n[Excerpt: The Pilgrims, \"He Was My Brother\"]\n\nWilson was also interested in \"The Sound of Silence\", but Simon was more interested in getting signed as a performer than in having other acts perform his songs. Wilson was cautious, though -- he was already producing one folkie singer-songwriter, and he didn't really need a second one. But he *could* probably do with a vocal group...\n\nSimon mentioned that he had actually made a couple of records before, as part of a duo. Would Wilson be at all interested in a vocal *duo*? Wilson would be interested. Simon and Garfunkel auditioned for him, and a few days later were in the Columbia Records studio on Seventh Avenue recording their first album as a duo, which was also the first time either of them would record under their own name.\n\nWednesday Morning, 3AM, the duo's first album, was a simple acoustic album, and the only instrumentation was Simon and Barry Kornfeld, a Greenwich Village folkie, on guitars, and Bill Lee, the double bass player who'd played with Dylan and others, on bass.\n\nTom Wilson guided the duo in their song selection, and the eventual album contained six cover versions and six originals written by Simon. The cover versions were a mixture of hootenanny staples like \"Go Tell it on the Mountain\", plus Dylan's \"The Times They Are A-Changin'\", included to cross-promote Dylan's new album and to try to link the duo with the more famous writer, and one unusual one, \"The Sun is Burning\", written by Ian Campbell, a Scottish folk singer who Simon had got to know on his trips to the UK:\n\n[Excerpt: Simon and Garfunkel, \"The Sun is Burning\"]\n\nBut the song that everyone was keenest on was \"The Sound of Silence\", the first song that Simon had written that he thought would stand up in comparison with the sort of song that Dylan was writing:\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence (Wednesday Morning 3AM version)\"]\n\nIn between sessions for the album, Simon and Garfunkel also played a high-profile gig at Gerde's Folk City in the Village, and a couple of shows at the Gaslight Cafe. The audiences there, though, regarded them as a complete joke -- Dave Van Ronk would later relate that for weeks afterwards, all anyone had to do was sing \"Hello darkness, my old friend\", for everyone around to break into laughter. Bob Dylan was one of those who laughed at the performance -- though Robert Shelton later said that Dylan hadn't been laughing at them, specifically, he'd just had a fit of the giggles -- and this had led to a certain amount of anger from Simon towards Dylan.\n\nThe album was recorded in March 1964, and was scheduled for release  in October. In the meantime, they both made plans to continue with their studies and their travels. Garfunkel was starting to do postgraduate work towards his doctorate in mathematics, while Simon was now enrolled in Brooklyn Law School, but was still spending most of his time travelling, and would drop out after one semester. He would spend much of the next eighteen months in the UK.\n\nWhile he was occasionally in the US between June 1964 and November 1965, Simon now considered himself based in England, where he made several acquaintances that would affect his life deeply. Among them were a young woman called Kathy Chitty, with whom he would fall in love and who would inspire many of his songs, and an older woman called Judith Piepe (and I apologise if I'm mispronouncing her name, which I've only ever seen written down, never heard) who many people believed had an unrequited crush on Simon. Piepe ran her London flat as something of a commune for folk musicians, and Simon lived there for months at a time while in the UK. Among the other musicians who stayed there for a time were Sandy Denny, Cat Stevens, and Al Stewart, whose bedroom was next door to Simon's.\n\nPiepe became Simon's de facto unpaid manager and publicist, and started promoting him around the British folk scene. Simon also at this point became particularly interested in improving his guitar playing. He was spending a lot of time at Les Cousins, the London club that had become the centre of British acoustic guitar.\n\nThere are, roughly, three styles of acoustic folk guitar -- to be clear, I'm talking about very broad-brush categorisations here, and there are people who would disagree and say there are more, but these are the main ones. Two of these are American styles -- there's the simple style known as Carter scratching, popularised by Mother Maybelle Carter of the Carter family, and for this all you do is alternate bass notes with your thumb while scratching the chord on the treble strings with one finger, like this:\n\n[Excerpt: Carter picking]\n\nThat's the style played by a lot of country and folk players who were primarily singers accompanying themselves. In the late forties and fifties, though, another style had become popularised -- Travis picking. This is named after Merle Travis, the most well-known player in the style, but he always called it Muhlenberg picking, after Muhlenberg County, where he'd learned the style from Ike Everly -- the Everly Brothers' father -- and Mose Rager, a Black guitarist.\n\nIn Travis picking, the thumb alternates between two bass notes, but rather than strumming a chord, the index and middle fingers play simple patterns on the treble strings, like this:\n\n[Excerpt: Travis picking]\n\nThat's, again, a style primarily used for accompaniment, but it can also be used to play instrumentals by oneself. As well as Travis and Ike Everly, it's also the style played by Donovan, Chet Atkins, James Taylor, and more.\n\nBut there's a third style, British baroque folk guitar, which was largely the invention of Davey Graham. Graham, you might remember, was a folk guitarist who had lived in the same squat as Lionel Bart when Bart started working with Tommy Steele, and who had formed a blues duo with Alexis Korner. Graham is now best known for one of his simpler pieces, “Anji”, which became the song that every British guitarist tried to learn:\n\n[Excerpt: Davey Graham, \"Anji\"]\n\nDozens of people, including Paul Simon, would record versions of that. Graham invented an entirely new style of guitar playing, influenced by ragtime players like Blind Blake, but also by Bach, by Moroccan oud music, and by Celtic bagpipe music. While it was fairly common for players to retune their guitar to an open major chord, allowing them to play slide guitar, Graham retuned his to a suspended fourth chord -- D-A-D-G-A-D -- which allowed him to keep a drone going on some strings while playing complex modal counterpoints on others. While I demonstrated the previous two styles myself, I'm nowhere near a good enough guitarist to demonstrate British folk baroque, so here's an excerpt of Davey Graham playing his own arrangement of the traditional ballad \"She Moved Through the Fair\", recast as a raga and retitled \"She Moved Thru' the Bizarre\":\n\n[Excerpt: Davey Graham, \"She Moved Thru' the Bizarre\"]\n\nGraham's style was hugely influential on an entire generation of British guitarists, people who incorporated world music and jazz influences into folk and blues styles, and that generation of guitarists was coming up at the time and playing at Les Cousins. People who started playing in this style included Jimmy Page, Bert Jansch, Roy Harper, John Renbourn, Richard Thompson, Nick Drake, and John Martyn, and it also had a substantial influence on North American players like Joni Mitchell, Tim Buckley, and of course Paul Simon.\n\nSimon was especially influenced at this time by Martin Carthy, the young British guitarist whose style was very influenced by Graham -- but while Graham applied his style to music ranging from Dave Brubeck to Lutheran hymns to Big Bill Broonzy songs, Carthy mostly concentrated on traditional English folk songs. Carthy had a habit of taking American folk singers under his wing, and he taught Simon several songs, including Carthy's own arrangement of the traditional \"Scarborough Fair\":\n\n[Excerpt: Martin Carthy, \"Scarborough Fair\"]\n\nSimon would later record that arrangement, without crediting Carthy, and this would lead to several decades of bad blood between them, though Carthy forgave him in the 1990s, and the two performed the song together at least once after that.\n\nIndeed, Simon seems to have made a distinctly negative impression on quite a few of the musicians he knew in Britain at this time, who seem to, at least in retrospect, regard him as having rather used and discarded them as soon as his career became successful. Roy Harper has talked in liner notes to CD reissues of his work from this period about how Simon used to regularly be a guest in his home, and how he has memories of Simon playing with Harper's baby son Nick (now himself one of the greats of British guitar) but how as soon as he became successful he never spoke to Harper again.\n\nSimilarly, in 1965 Simon started a writing partnership with Bruce Woodley of the Seekers, an Australian folk-pop band based in the UK, best known for \"Georgy Girl\". The two wrote \"Red Rubber Ball\", which became a hit for the Cyrkle:\n\n[Excerpt: The Cyrke, \"Red Rubber Ball\"]\n\nand also \"Cloudy\", which the Seekers recorded as an album track:\n\n[Excerpt: The Seekers, \"Cloudy\"]\n\nWhen that was recorded by Simon and Garfunkel, Woodley's name was removed from the writing credits, though Woodley still apparently received royalties for it.\n\nBut at this point there *was* no Simon and Garfunkel. Paul Simon was a solo artist working the folk clubs in Britain, and Simon and Garfunkel's one album had sold a minuscule number of copies.\n\nThey did, when Simon briefly returned to the US in March, record two tracks for a prospective single, this time with an electric backing band. One was a rewrite of the title track of their first album, now titled \"Somewhere They Can't Find Me\" and with a new chorus and some guitar parts nicked from Davey Graham's \"Anji\"; the other a Twist-beat song that could almost be Manfred Mann or Georgie Fame -- \"We Got a Groovy Thing Goin'\".\n\nThat was also influenced by “Anji”, though by Bert Jansch's version rather than Graham's original. Jansch rearranged the song and stuck in this phrase:\n\n[Excerpt: Bert Jansch, “Anji”]\n\nWhich became the chorus to “We Got a Groovy Thing Goin'”:\n\n[Excerpt: Simon and Garfunkel, \"We Got a Groovy Thing Goin'\"]\n\nBut that single was never released, and as far as Columbia were concerned, Simon and Garfunkel were a defunct act, especially as Tom Wilson, who had signed them, was looking to move away from Columbia.\n\nArt Garfunkel did come to visit Simon in the UK a couple of times, and they'd even sing together occasionally, but it was on the basis of Paul Simon the successful club act occasionally inviting his friend on stage during the encore, rather than as a duo, and Garfunkel was still seeing music only as a sideline while Simon was now utterly committed to it.\n\nHe was encouraged in this commitment by Judith Piepe, who considered him to be the greatest songwriter of his generation, and who started a letter-writing campaign to that effect, telling the BBC they needed to put him on the radio. Eventually, after a lot of pressure, they agreed -- though they weren't exactly sure what to do with him, as he didn't fit into any of the pop formats they had. He was given his own radio show -- a five-minute show in a religious programming slot. Simon would perform a song, and there would be an introduction tying the song into some religious theme or other.\n\nTwo series of four episodes of this were broadcast, in a plum slot right after Housewives' Choice, which got twenty million listeners, and the BBC were amazed to find that a lot of people phoned in asking where they could get hold of the records by this Paul Simon fellow. Obviously he didn't have any out yet, and even the Simon and Garfunkel album, which had been released in the US, hadn't come out in Britain.\n\nAfter a little bit of negotiation, CBS, the British arm of Columbia Records, had Simon come in and record an album of his songs, titled The Paul Simon Songbook.\n\nThe album, unlike the Simon and Garfunkel album, was made up entirely of Paul Simon originals. Two of them were songs that had previously been recorded for Wednesday Morning 3AM -- \"He Was My Brother\" and a new version of \"The Sound of Silence\":\n\n[Excerpt: Paul Simon, \"The Sound of Silence\"]\n\nThe other ten songs were newly-written pieces like \"April Come She Will\", \"Kathy's Song\", a parody of Bob Dylan entitled \"A Simple Desultory Philippic\", and the song that was chosen as the single, \"I am a Rock\":\n\n[Excerpt: Paul Simon, \"I am a Rock\"]\n\nThat song was also the one that was chosen for Simon's first TV appearance since Tom and Jerry had appeared on Bandstand eight years earlier. The appearance on Ready, Steady, Go, though, was not one that anyone was happy with. Simon had been booked to appear on  a small folk music series, Heartsong, but that series was cancelled before he could appear. Rediffusion, the company that made the series, also made Ready, Steady, Go, and since they'd already paid Simon they decided they might as well stick him on that show and get something for their money.\n\nUnfortunately, the episode in question was already running long, and it wasn't really suited for introspective singer-songwriter performances -- the show was geared to guitar bands and American soul singers. Michael Lindsay-Hogg, the director, insisted that if Simon was going to do his song, he had to cut at least one verse, while Simon was insistent that he needed to perform the whole thing because \"it's a story\". Lindsay-Hogg got his way, but nobody was happy with the performance.\n\nSimon's album was surprisingly unsuccessful, given the number of people who'd called the BBC asking about it -- the joke went round that the calls had all been Judith Piepe doing different voices -- and Simon continued his round of folk clubs, pubs, and birthday parties, sometimes performing with Garfunkel, when he visited for the summer, but mostly performing on his own.\n\nOne time he did perform with a full band, singing “Johnny B Goode” at a birthday party, backed by a band called Joker's Wild who a couple of weeks later went into the studio to record their only privately-pressed five-song record, of them performing recent hits:\n\n[Excerpt: Joker's Wild, \"Walk Like a Man\"]\n\nThe guitarist from Joker's Wild would later join the other band who'd played at that party, but the story of David Gilmour joining Pink Floyd is for another episode.\n\nDuring this time, Simon also produced his first record for someone else, when he was responsible for producing the only album by his friend Jackson C Frank, though there wasn't much production involved as like Simon's own album it was just one man and his guitar. Al Stewart and Art Garfunkel were also in the control room for the recording, but the notoriously shy Frank insisted on hiding behind a screen so they couldn't see him while he recorded:\n\n[Excerpt: Jackson C Frank, \"Blues Run the Game\"]\n\nIt seemed like Paul Simon was on his way to becoming a respected mid-level figure on the British folk scene, releasing occasional albums and maybe having one or two minor hits, but making a steady living. Someone who would be spoken of in the same breath as Ralph McTell perhaps. Meanwhile, Art Garfunkel would be going on to be a lecturer in mathematics whose students might be surprised to know he'd had a minor rock and roll hit as a kid.\n\nBut then something happened that changed everything. Wednesday Morning 3AM hadn't sold at all, and Columbia hadn't promoted it in the slightest. It was too collegiate and polite for the Greenwich Village folkies, and too intellectual for the pop audience that had been buying Peter, Paul, and Mary, and it had come out just at the point that the folk boom had imploded.\n\nBut one DJ in Boston, Dick Summer, had started playing one song from it, \"The Sound of Silence\", and it had caught on with the college students, who loved the song. And then came spring break 1965. All those students went on holiday, and suddenly DJs in places like Cocoa Beach, Florida, were getting phone calls requesting \"The Sound of Silence\" by Simon and Garfunkel. Some of them with contacts at Columbia got in touch with the label, and Tom Wilson had an idea.\n\nOn the first day of what turned out to be his last session with Dylan, the session for \"Like a Rolling Stone\", Wilson asked the musicians to stay behind and work on something. He'd already experimented with overdubbing new instruments on an acoustic recording with his new version of Dylan's \"House of the Rising Sun\", now he was going to try it with \"The Sound of Silence\". He didn't bother asking the duo what they thought -- record labels messed with people's records all the time. So \"The Sound of Silence\" was released as an electric folk-rock single:\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nThis is always presented as Wilson massively changing the sound of the duo without their permission or knowledge, but the fact is that they had *already* gone folk-rock, back in March, so they were already thinking that way.\n\nThe track was released as a single with “We Got a Groovy Thing Going” on the B-side, and was promoted first in the Boston market, and it did very well. Roy Harper later talked about Simon's attitude at this time, saying \"I can remember going into the gents in The Three Horseshoes in Hempstead during a gig, and we’re having a pee together. He was very excited, and he turns round to me and and says, “Guess what, man? We’re number sixteen in Boston with The Sound of Silence'”. A few days later I was doing another gig with him and he made a beeline for me. “Guess what?” I said “You’re No. 15 in Boston”. He said, “No man, we’re No. 1 in Boston”. I thought, “Wow. No. 1 in Boston, eh?” It was almost a joke, because I really had no idea what that sort of stuff meant at all.\"\n\nSimon was even more excited when the record started creeping up the national charts, though he was less enthused when his copy of the single arrived from America. He listened to it, and thought the arrangement was a Byrds rip-off, and cringed at the way the rhythm section had to slow down and speed up in order to stay in time with the acoustic recording:\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nI have to say that, while the tempo fluctuations are noticeable once you know to look for them, it's a remarkably tight performance given the circumstances.\n\nAs the record went up the charts, Simon was called back to America, to record an album to go along with it. The Paul Simon Songbook hadn't been released in the US,  and they needed an album *now*, and Simon was a slow songwriter, so the duo took six songs from that album and rerecorded them in folk-rock versions with their new producer Bob Johnston, who was also working with Dylan now, since Tom Wilson had moved on to Verve records. They filled out the album with \"The Sound of Silence\", the two electric tracks from March, one new song, \"Blessed\", and a version of \"Anji\", which came straight after \"Somewhere They Can't Find Me\", presumably to acknowledge Simon lifting bits of it. That version of “Anji” also followed Jansch's arrangement, and so included the bit that Simon had taken for “We Got a Groovy Thing Going” as well.\n\nThey also recorded their next single, which was released on the British version of the album but not the American one, a song that Simon had written during a thoroughly depressing tour of Lancashire towns (he wrote it in Widnes, but a friend of Simon's who lived in Widnes later said that while it was written in Widnes it was written *about* Birkenhead. Simon has also sometimes said it was about Warrington or Wigan, both of which are so close to Widnes and so similar in both name and atmosphere that it would be the easiest thing in the world to mix them up.)\n\n[Excerpt: Simon and Garfunkel, \"Homeward Bound\"]\n\nThese tracks were all recorded in December 1965, and they featured the Wrecking Crew -- Bob Johnston wanted the best, and didn't rate the New York players that Wilson had used, and so they were recorded in LA with Glen Campbell, Joe South, Hal Blaine, Larry Knechtel, and Joe Osborne. I've also seen in some sources that there were sessions in Nashville with A-team players Fred Carter and Charlie McCoy.\n\nBy January, \"The Sound of Silence\" had reached number one, knocking \"We Can Work it Out\" by the Beatles off the top spot for two weeks, before the Beatles record went back to the top. They'd achieved what they'd been trying for for nearly a decade, and I'll give the last word here to Paul Simon, who said of the achievement:\n\n\"I had come back to New York, and I was staying in my old room at my parents' house. Artie was living at his parents' house, too. I remember Artie and I were sitting there in my car one night, parked on a street in Queens, and the announcer said, \"Number one, Simon & Garfunkel.\" And Artie said to me, \"That Simon & Garfunkel, they must be having a great time.\"\"",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-five of A History of Rock Music in Five Hundred Songs looks at “The Sound of Silence\" by Simon and Garfunkel, and the many records they made, together and apart, before their success. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blues Run the Game\" by Jackson C. Frank.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\nI talk about a tour of Lancashire towns, but some of the towns I mention were in Cheshire at the time, and some are in Greater Manchester or Merseyside now. They're all very close together though.\nI say Mose Rager was Black. I was misremembering, confusing Mose Rager, a white player in the Muhlenberg style, with Arnold Schultz, a Black player who invented it. I got this right in the episode on \"Bye Bye Love\".\nAlso, I couldn't track down a copy of the Paul Kane single version of “He Was My Brother” in decent quality, so I used the version on The Paul Simon Songbook instead, as they're basically identical performances.\nResources\n\nAs usual, I've created a Mixcloud playlist of the music excerpted here.\n\nThis compilation collects all Simon and Garfunkel's studio albums, with bonus tracks, plus a DVD of their reunion concert.\n\nThere are many collections of the pre-S&G recordings by the two, as these are now largely in the public domain. This one contains a good selection.\n\nI've referred to several books for this episode:\n\nSimon and Garfunkel: Together Alone by Spencer Leigh is a breezy, well-researched, biography of the duo.\n\nPaul Simon: The Life by Robert Hilburn is the closest thing there is to an authorised biography of Simon.\n\nAnd What is it All But Luminous? is Art Garfunkel's memoir. It's not particularly detailed, being more a collection of thoughts and poetry than a structured narrative, but gives a good idea of Garfunkel's attitude to people and events in his life.\n\nRoots, Radicals, and Rockers: How Skiffle Changed the World by Billy Bragg has some great information on the British folk scene of the fifties and sixties.\n\nAnd Singing From the Floor is an oral history of British folk clubs, including a chapter on Dylan’s 1962 visit to London.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, we're going to take a look at a hit record that almost never happened -- a record by a duo who had already split up, twice, by the time it became a hit, and who didn't know it was going to come out. We're going to look at how a duo who started off as an Everly Brothers knockoff, before becoming unsuccessful Greenwich Village folkies, were turned into one of the biggest acts of the sixties by their producer. We're going to look at Simon and Garfunkel, and at \"The Sound of Silence\":\n\n[Excerpt: Simon and Garfunkel, \"The Sound of Silence\"]\n\nThe story of Simon and Garfunkel starts with two children in a school play.  Neither Paul Simon or Art Garfunkel had many friends when they met in a school performance of Alice in Wonderland, where Simon was playing the White Rabbit and Garfunkel the Cheshire Cat. Simon was well-enough liked, by all accounts, but he'd been put on an accelerated programme for gifted students which meant he was progressing through school faster than his peers. He had a small social group, mostly based around playing baseball, but wasn't one of the popular kids.\n\nArt Garfunkel, another gifted student, had no friends at all until he got to know Simon, who he described later as his \"one and only friend\" in this time period. One passage in Garfunkel's autobiography seems to me to sum up everything about Garfunkel's personality as a child -- and indeed a large part of his personality as it comes across in int",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-five of A History of Rock Music in Five Hundred Songs looks at “The Sound of Silence\" by Simon and Garfunkel, and the many records they made, together and apart, before their success. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blues Run the Game\" by Jackson C. Frank.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\nI talk about a tour of Lancashire towns, but some of the towns I mention were in Cheshire at the time, and some are in Greater Manchester or Merseyside now. They're all very close together though.\nI say Mose Rager was Black. I was misremembering, confusing Mose Rager, a white player in the Muhlenberg style, with Arnold Schultz, a Black play",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}