{
  "title": "Drone Lands on Astonishingly Steep Surfaces",
  "link": "https://spectrum.ieee.org/drone-landing",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-quadcopter-drone-resting-on-the-steep-roof-of-a-house-with-trees-in-the-background.jpg?id=31515370&width=1200&height=600&coordinates=0%2C132%2C0%2C132\"/><br/><br/><p><p>\n<em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em>\n</p></p><p>Drones are able to complete a wide range of useful tasks, but they often require specific conditions in order to land safely. Ideally, most drones need to approach a flat surface at a slow enough speed to avoid bouncing or crashing. One group of researchers in Canada has devised a novel solution to this challenge, which allows drones to land on impressively steep inclines of up to 60 degrees, and at speeds up to 2.75 meters per second.</p><p>Through a series of experiments, the researchers demonstrate how their approach can be used to safely land drones on the steep rooftops of homes. The results are described in a <a href=\"https://ieeexplore.ieee.org/abstract/document/9779538\" rel=\"noopener noreferrer\" target=\"_blank\">study</a> published in the July issue of <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7083369\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Robotics and Automation Letters</em></a>. </p><hr/><p>“At high-impact velocities and on inclined surfaces, commercial multirotors tend to bounce, flip over, or even break upon impact, due to their stiff landing gear,” explains <a href=\"https://ca.linkedin.com/in/john-bass-62273a16a\" target=\"_blank\">John Bass</a>, a Ph.D. student at the <a href=\"https://www.usherbrooke.ca/\" target=\"_blank\">Université de Sherbrooke’s</a> <a href=\"https://www.createk.co/\" target=\"_blank\">Createk design lab</a>, in Québec, who was involved in the study. “Our general approach for landing a quadrotor on a steep incline is to combine two technologies—friction shock absorbers and reverse thrust.”</p><p>Bass’s team first began exploring combinations of friction shock absorbers and reverse thrust through simulations. Based on the simulation data, they then created the landing gear with friction shock absorbers using micro-DC (direct current) motors, springs, and 3D-printed parts.</p><p>“The friction shock absorbers that we integrated on the landing gear slow down the UAV [uncrewed aerial vehicle]’s dynamics enough to successfully exploit reverse thrust,” Bass explains. “[The friction shock absorbers] also promote a continuous contact between the legs and the ground, instead of bouncing indefinitely down the slope as is the case for normal rigid landing gear.”</p><p>The team then put their drone to the test, landing it on roofs and landing pads at various speeds and inclines. Bass notes that because the drone can land on a surface as steep as 60 degrees, it is capable of landing on most North American rooftops, which typically have a pitch of less than 53 degrees. </p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"fa9927dec8c8d3a0e03a5d58383e3336\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/tG1K_63q00Y?rel=0&start=6\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Fast Multirotor Landings on Steep Roofs using Friction Shock Absorbers and Reverse Thrust</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=tG1K_63q00Y&t=6s\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>This capability could be useful for recharging, surveillance, or emergency-landing purposes. The ability to land at high speeds—with less precision and sensing requirements—could be particularly useful  during emergency landings.</p><p>The proposed landing technique may only be feasible for smaller drones, however. Notably, larger and heavier drones dropping down at fast speeds onto a roof could potentially damage the roof. </p><p>The team plans to continue to explore novel ways of landing drones. The lab has previously landed drones on <a href=\"https://youtu.be/RSn62JKIRks\" rel=\"noopener noreferrer\" target=\"_blank\">vertical walls</a> and <a href=\"https://youtu.be/n7awDhdVkCs\" rel=\"noopener noreferrer\" target=\"_blank\">lakes</a>. </p><p>“[Our] goal is to further increase the capabilities of UAVs by landing in other difficult scenarios, such as boats in harsh sea conditions, on icebergs, and on fast-moving ground vehicles,” says <a href=\"https://ncrn-rcrc.mcgill.ca/people/researchers/alexis-lussier-desbiens\" target=\"_blank\">Alexis Lussier Desbiens</a>, a professor of mechanical and robotics engineering at the Createk design lab who was also involved in the study. </p><p>“These scenarios each bring their own new set of challenges, such as a ship’s linear and angular motions when landing on boats, the strong drag force when landing in high wind or at high speed, the turbulent air motion near boats, icebergs, and fast-moving vehicles, and the slippery surfaces of icebergs,” he adds.</p><p><em>This article was updated on 7 September 2022 to clarify that using the landing technique with a larger drone could damage rooftops.</em><br/></p>",
  "pubDate": "Tue, 06 Sep 2022 17:25:26 +0000",
  "guid": "https://spectrum.ieee.org/drone-landing",
  "category": [
    "Drones",
    "Uavs",
    "Landing",
    "Journal watch"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}