{
  "title": "S16 Ep46: Darkness Radio presents Holzer's Ghosts: The Horror & Haunting of Amityville",
  "link": "https://audioboom.com/posts/8098365",
  "itunes:episode": 46,
  "itunes:title": "Darkness Radio presents Holzer's Ghosts: The Horror & Haunting of Amityville",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7570,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts: The Horror & Haunting of Amityville with Special Guests </p>\n\n<p>Dave Schrader takes a deep dive into the accounts leading up to and the fall out of Amityville Horror case. This goes down as the most requested episode of The Holzer Files, tonight we discuss Dr. Holzer's involvement as well as Ed & Lorraine Warren, the deaths of the DeFeo family, the reported haunting of 112 Ocean Avenue, and the aftermath with special guests, Alexandra Holzer, Laura DiDio, Tim Yancey, Eric Walter, and Blain Duncan.  </p>\n\n<p>Is Amityville the most widely played out hoax in the history of the paranormal or was there truth behind the bizarre claims?  With the help of Alexandra Holzer,</p>\n\n<p>Dave discusses the psychic scarring & history and the land that Dr. Holzer exposed in his investigation. </p>\n\n<p>With truly unique access to this sordid tale, Laura DiDio was the reporter with boots on the ground at the time of the murders and subsequent haunting that followed, she was an eyewitness to the circus atmosphere of the house and the alleged haunting.  </p>\n\n<p>Tim Yancey was a personal friend and confidant of George Lutz and shares behind the scene stories and insights into this story and weighs in on if he believes the accounts of paranormal activity.</p>\n\n<p>Filmmaker & Documentarian, Eric Walter revealed personal stories and dug deep to uncover the unknown side of this famous haunting with his documentary, My Amityville Horror that followed the narrative of the story through the eyes of surviving family member, Daniel Lutz. </p>\n\n<p>Blaine Duncan is a paranormal investigator and researcher that has had the truly unique opportunity of having been able to visit and walk the halls of the notorious home only a few years ago. What did he find? What did the owners reveal to him? </p>\n\n<p>Tune in for a powerful and insightful discussion into one of the world's most famous and hotly debated hauntings in history, follow us to Amityville, Long Island. Fact and Fiction unearthed on the best in paranormal talk radio, this is Darkness Radio.</p>\n\n<p>Listen to new episodes of Darkness Radio every week here: <a href=\"http://www.stitcher.com/show/darkness-radio\">www.stitcher.com/show/darkness-radio</a></p>\n\n<p>Check out the documentary here: <a href=\"http://www.myamityvillehorror.com/\">www.MyAmityvilleHorror.com</a></p>\n\n<p>Watch the new Amityville Horror House Shock Doc only on Discovery+ </p>\n",
  "itunes:summary": "Darkness Radio presents Holzer's Ghosts: The Horror & Haunting of Amityville with Special Guests \n\nDave Schrader takes a deep dive into the accounts leading up to and the fall out of Amityville Horror case. This goes down as the most requested episode of The Holzer Files, tonight we discuss Dr. Holzer's involvement as well as Ed & Lorraine Warren, the deaths of the DeFeo family, the reported haunting of 112 Ocean Avenue, and the aftermath with special guests, Alexandra Holzer, Laura DiDio, Tim Yancey, Eric Walter, and Blain Duncan.  \n\nIs Amityville the most widely played out hoax in the history of the paranormal or was there truth behind the bizarre claims?  With the help of Alexandra Holzer,\n\nDave discusses the psychic scarring & history and the land that Dr. Holzer exposed in his investigation. \n\nWith truly unique access to this sordid tale, Laura DiDio was the reporter with boots on the ground at the time of the murders and subsequent haunting that followed, she was an eyewitness...",
  "pubDate": "Fri, 23 Apr 2021 08:00:00 +0000",
  "guid": "600b1cb5-ce5b-4f54-a3a7-ad130056e6bb",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}