{
  "title": "The Geographic Diversity of NLP Conferences",
  "link": "https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/",
  "comments": "https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/#comments",
  "dc:creator": "Andrew Caines",
  "pubDate": "Fri, 04 Oct 2019 10:27:40 +0000",
  "category": "Uncategorized",
  "guid": "http://www.marekrei.com/blog/?p=1317",
  "description": "<p>The growth of interest in NLP technology, fuelled largely by investment in AI applications, has been accompanied by unprecedented expansion of the preeminent NLP conferences:&#8230;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/\">The Geographic Diversity of NLP Conferences</a> appeared first on <a rel=\"nofollow\" href=\"https://www.marekrei.com/blog\">Marek Rei</a>.</p>\n",
  "content:encoded": "<p>The growth of interest in NLP technology, fuelled largely by investment in AI applications, has been accompanied by unprecedented expansion of the preeminent NLP conferences: ACL, NAACL and EMNLP in particular. <a href=\"https://twitter.com/gchrupala/status/1103737749012660231\">Grzegorz Chrupała’s graph</a> shows the rapid growth in submissions to each conference in recent years:</p>\n<figure id=\"attachment_1319\" aria-describedby=\"caption-attachment-1319\" style=\"width: 843px\" class=\"wp-caption aligncenter\"><a href=\"http://www.marekrei.com/blog/wp-content/uploads/2019/09/D1FDoJpXgAc4EDT.jpeg\"><img decoding=\"async\" loading=\"lazy\" class=\"size-large wp-image-1319\" src=\"http://www.marekrei.com/blog/wp-content/uploads/2019/09/D1FDoJpXgAc4EDT-1024x653.jpeg\" alt=\"\" width=\"843\" height=\"538\" srcset=\"https://www.marekrei.com/blog/wp-content/uploads/2019/09/D1FDoJpXgAc4EDT-1024x653.jpeg 1024w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/D1FDoJpXgAc4EDT-150x96.jpeg 150w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/D1FDoJpXgAc4EDT-300x191.jpeg 300w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/D1FDoJpXgAc4EDT-768x490.jpeg 768w\" sizes=\"(max-width: 843px) 100vw, 843px\" /></a><figcaption id=\"caption-attachment-1319\" class=\"wp-caption-text\">Figure 1. Graph of conference submission counts, by Grzegorz Chrupała</figcaption></figure>\n<p>These trends can also be seen in the <a href=\"http://acl2019pcblog.fileli.unipi.it/?p=156\">blog post by the ACL 2019 Chairs</a>. Meanwhile, acceptance rates have tended to remain constant, meaning that the conferences have grown in line with submissions, e.g. <a href=\"http://acl2019pcblog.fileli.unipi.it/?p=161\">from ACL 2019</a>:</p>\n<figure id=\"attachment_1323\" aria-describedby=\"caption-attachment-1323\" style=\"width: 843px\" class=\"wp-caption aligncenter\"><a href=\"http://www.marekrei.com/blog/wp-content/uploads/2019/09/Screenshot-2019-06-17-at-23.56.13-1024x424.png\"><img decoding=\"async\" loading=\"lazy\" class=\"size-large wp-image-1323\" src=\"http://www.marekrei.com/blog/wp-content/uploads/2019/09/Screenshot-2019-06-17-at-23.56.13-1024x424-1024x424.png\" alt=\"\" width=\"843\" height=\"349\" srcset=\"https://www.marekrei.com/blog/wp-content/uploads/2019/09/Screenshot-2019-06-17-at-23.56.13-1024x424.png 1024w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/Screenshot-2019-06-17-at-23.56.13-1024x424-150x62.png 150w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/Screenshot-2019-06-17-at-23.56.13-1024x424-300x124.png 300w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/Screenshot-2019-06-17-at-23.56.13-1024x424-768x318.png 768w\" sizes=\"(max-width: 843px) 100vw, 843px\" /></a><figcaption id=\"caption-attachment-1323\" class=\"wp-caption-text\">Table 1. Acceptance rates at ACL 2019.</figcaption></figure>\n<p>NLP has developed as a field narrowly focused on English, a point highlighted by the recent emergence (and need for) the <a href=\"https://thegradient.pub/the-benderrule-on-naming-the-languages-we-study-and-why-it-matters\">#BenderRule</a>. The ability of NLP models to deal with English is important, due to its status as an international language of politics, commerce and culture, and indeed with these tools we can handle, for instance, <a href=\"https://en.wikipedia.org/wiki/Languages_used_on_the_Internet#Content_languages_for_websites\">more than half the content on the internet</a>. But with such a strong focus on English we miss cross-linguistic insights and lack coverage for the majority of languages in the world.<br />\n<span id=\"more-1317\"></span></p>\n<p>Many NLP researchers work cross-linguistically but still there is a core assumption that the L in NLP means written English, to such an extent that this fact is not always explicitly stated in papers and presentations. One way to continue to diversify the scope of the field would be increased diversity in geographic representation. This would give exposure to wider concerns than those of current participants in NLP research, and (optimistic assumption) lead to evaluation of new methods on a larger set of languages.</p>\n<p>To take a measure of current geographic diversity in NLP, we extracted as many author affiliations as possible from fulltext papers in the <a href=\"https://www.aclweb.org/anthology\">ACL Anthology</a> for 5 major conferences held in 2018: ACL, NAACL, EMNLP, COLING and CoNLL. We associated each author’s institution with a city and country, making some simple assumptions in the case of multinational organisations.<span id='easy-footnote-1-1317' class='easy-footnote-margin-adjust'></span><span class='easy-footnote'><a href='https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/#easy-footnote-bottom-1-1317' title='In the case of multinational companies with an unspecified location we associated it with the location of its headquarters. If the author listed both an academic and industry affiliation we selected the academic one.'><sup>1</sup></a></span></p>\n<p>In total from the N fulltext papers in the Anthology we extracted 2695 author affiliations. Within this set of affiliations we found 653 distinct institutions, in 325 different cities and 56 countries. These counts are impressive at first glance, and they point to a field with a healthy level of global interest. But recall that the United Nations recognises 193 member states, so the 2018 conferences achieved 29% coverage<span id='easy-footnote-2-1317' class='easy-footnote-margin-adjust'></span><span class='easy-footnote'><a href='https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/#easy-footnote-bottom-2-1317' title='This is a simplification of course, as the nationality of an author’s institution does not necessarily equal their own nationality, but at present we have no way to access that information, to the best of our knowledge, other than a questionnaire which not everyone would complete.'><sup>2</sup></a></span> and inevitably there’s a bias towards North America, Asia, and Europe in terms of the regions represented by our list of countries. In particular there is a very stark lack of African representation in the dataset.</p>\n<p><div class=\"table-responsive\"><table  style=\"width:100%; \"  class=\"easy-table easy-table-default \" border=\"0\">\n<thead>\n<tr><th >Region</th>\n<th >N.author affiliations</th>\n</tr>\n</thead>\n<tbody>\n<tr><td >North America</td>\n<td > 1114</td>\n</tr>\n\n<tr><td >Asia</td>\n<td > 826</td>\n</tr>\n\n<tr><td >Europe</td>\n<td > 641</td>\n</tr>\n\n<tr><td >Middle East</td>\n<td > 54</td>\n</tr>\n\n<tr><td >Oceania</td>\n<td > 44</td>\n</tr>\n\n<tr><td >South America</td>\n<td > 11</td>\n</tr>\n\n<tr><td >Africa</td>\n<td > 5</td>\n</tr>\n</tbody></table></div><figcaption class=\"wp-caption-text customcaption\">Table 2. The number of author affiliations by region.</figcaption>We illustrate the count of authors per country for ACL, NAACL, EMNLP, COLING and CoNLL 2018 with the chloropleth maps below. The first shows author counts as they are, the second shows the counts normalised by 2018 population counts.<span id='easy-footnote-3-1317' class='easy-footnote-margin-adjust'></span><span class='easy-footnote'><a href='https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/#easy-footnote-bottom-3-1317' title='Source: World Bank DataBank https://data.worldbank.org/indicator/sp.pop.totl'><sup>3</sup></a></span></p>\n<div id=\"country_chloropleth_2018_count\"></div><figcaption class=\"wp-caption-text customcaption\">Figure 2. Paper count by country at the 2018 NLP conferences.</figcaption><div id=\"country_chloropleth_2018_normcount\"></div><figcaption class=\"wp-caption-text customcaption\">Figure 3. Normalized paper count by country at the 2018 NLP conferences.</figcaption>These findings probably won’t have surprised you. Nevertheless we hope that they are thought-provoking. We wonder how we as a field can encourage wider participation from under-represented regions? We assume that would be a good thing. Do you agree? Comment below.</p>\n<p>It is also a matter of concern that academic research in general lacks demographic diversity, with NLP being no exception. There are root causes here in terms of education systems, gender bias and global inequality, which are wider problems than NLP can solve alone. But doing everything possible to diversify the field would be a very positive move, especially given the link between AI, power and discrimination (see <a href=\"https://ainowinstitute.org/discriminatingsystems.pdf\">the ‘discriminating systems’ report by the AI Now Institute</a>).</p>\n<p>It may inform discussion if we report one other statistic we’ve been able to retrieve thanks to data sharing by Emily Bender & Leon Derczynski, the program chairs for COLING 2018. They provided us with anonymised submissions data from that conference, in which each submission was associated with a country thanks to the contact details provided by the corresponding author, as well as a final decision (accept, reject, ineligible, withdrawn, desk-reject). It became clear that acceptance rates were broadly equal, and gladly a bias against papers from certain regions was not apparent.</p>\n<p><div class=\"table-responsive\"><table  style=\"width:100%; \"  class=\"easy-table easy-table-default \" border=\"0\">\n<thead>\n<tr><th >Country</th>\n<th > Submissions</th>\n<th > Acceptance Rate</th>\n</tr>\n</thead>\n<tbody>\n<tr><td >Belgium</td>\n<td > 5</td>\n<td > 0.8</td>\n</tr>\n\n<tr><td >Netherlands</td>\n<td > 17</td>\n<td > 0.71</td>\n</tr>\n\n<tr><td >Hong Kong</td>\n<td > 8</td>\n<td > 0.63</td>\n</tr>\n\n<tr><td >Norway</td>\n<td > 5</td>\n<td > 0.6</td>\n</tr>\n\n<tr><td >Singapore</td>\n<td > 14</td>\n<td > 0.5</td>\n</tr>\n\n<tr><td >Israel</td>\n<td > 8</td>\n<td > 0.5</td>\n</tr>\n\n<tr><td >Italy</td>\n<td > 13</td>\n<td > 0.46</td>\n</tr>\n\n<tr><td >Switzerland</td>\n<td > 7</td>\n<td > 0.43</td>\n</tr>\n\n<tr><td >Canada</td>\n<td > 24</td>\n<td > 0.42</td>\n</tr>\n\n<tr><td >Denmark</td>\n<td > 5</td>\n<td > 0.4</td>\n</tr>\n\n<tr><td >France</td>\n<td > 28</td>\n<td > 0.39</td>\n</tr>\n\n<tr><td >Germany</td>\n<td > 67</td>\n<td > 0.39</td>\n</tr>\n\n<tr><td >UK</td>\n<td > 36</td>\n<td > 0.36</td>\n</tr>\n\n<tr><td >USA</td>\n<td > 194</td>\n<td > 0.35</td>\n</tr>\n\n<tr><td >Turkey</td>\n<td > 6</td>\n<td > 0.33</td>\n</tr>\n\n<tr><td >Japan</td>\n<td > 59</td>\n<td > 0.32</td>\n</tr>\n\n<tr><td >China</td>\n<td > 297</td>\n<td > 0.3</td>\n</tr>\n\n<tr><td >South Korea</td>\n<td > 20</td>\n<td > 0.25</td>\n</tr>\n\n<tr><td >Czech Republic</td>\n<td > 9</td>\n<td > 0.22</td>\n</tr>\n\n<tr><td >Australia</td>\n<td > 9</td>\n<td > 0.22</td>\n</tr>\n\n<tr><td >India</td>\n<td > 76</td>\n<td > 0.21</td>\n</tr>\n\n<tr><td >Taiwan</td>\n<td > 11</td>\n<td > 0.18</td>\n</tr>\n\n<tr><td >Russia</td>\n<td > 7</td>\n<td > 0.14</td>\n</tr>\n\n<tr><td >Sweden</td>\n<td > 7</td>\n<td > 0.14</td>\n</tr>\n\n<tr><td >Ireland</td>\n<td > 7</td>\n<td > 0.14</td>\n</tr>\n\n<tr><td >Brazil</td>\n<td > 15</td>\n<td > 0.13</td>\n</tr>\n\n<tr><td >Spain</td>\n<td > 16</td>\n<td > 0.13</td>\n</tr>\n\n<tr><td >Iran</td>\n<td > 5</td>\n<td > 0</td>\n</tr>\n</tbody></table></div><figcaption class=\"wp-caption-text customcaption\">Table 3. Acceptance rates at COLING 2018 by country, for countries with at least 3 submissions.</figcaption>This finding suggests that the lack of publications and representation from certain countries may be traced back long before conference submissions are made. The problem must be more deeply-rooted, at the institutional or societal level, hence not one that NLP alone can solve. However we assume that there are still steps we can take to make things better.</p>\n<p>Of course we are not alone in hoping for increased diversity in NLP (conferences). We have noticed some positive developments in this regard especially in the past two years. For instance, COLING 2018 ran a <a href=\"http://coling2018.org/writing-mentoring-program\">writing mentoring programme</a> expressly to help authors new to the field. The importance of guidance for those to whom (scientific) English is not a first language should not be underestimated. Nor should we assume that it is equally straightforward for all to learn English, with teaching quality and access to resources varying enormously by region (see <a href=\"https://academic.oup.com/eltj/article/73/1/89/5270125\">John Clegg’s essay about sub-Saharan Africa</a>, for example). There are also occasional calls for <a href=\"https://twitter.com/BayesForDays/status/1115021208389660680\">papers to be accepted in all languages</a>. Perhaps there could be WMT shared tasks expressly working towards automatic paper translation into many languages.</p>\n<p>NAACL has taken several positive steps including <a href=\"https://naacl2019.org/blog/introducing-the-diversity-and-inclusion-committee\">a diversity & inclusion committee</a> for its 2019 conference, <a href=\"https://naacl2019.org/captions\">live captions by Microsoft</a>, and the <a href=\"https://naacl2019.org/blog/remote-presentations\">option to give remote presentations</a> (good for those who cannot or do not like to travel, or cannot afford it). There’s also a NAACL emerging region fund to foster a <a href=\"https://naacl.org/calls/emerging_regions/2019/index.html\">larger and more cohesive comp-ling community in Latin America</a>; meanwhile it’s been announced that the <a href=\"https://twitter.com/NAACLHLT/status/1136416592051539968\">2021 conference will be located in Mexico City</a>, the first time it&#8217;s gone outside the US and Canada since the 1st conference in 2000.</p>\n<p>2018 saw the launch of the <a href=\"https://aaclweb.org\">Asia-Pacific Chapter of the Association for Computational Linguistics</a> (AACL), which is <a href=\"https://twitter.com/wellformedness/status/1156601620362334208\">organising its first conference next year</a> (co-located with IJCNLP) in Suzhou, China. One good reason to take our major conferences to new countries is to equalise the barrier of obtaining visas to attend. <a href=\"https://twitter.com/dubova_marina/status/1142554924443676673\">Marina Dubova makes the point</a> that potential participants from developing countries might only get visas for a minority of CogSci conference venues in recent times, as they have been almost exclusively held in the US, Canada and western Europe.</p>\n<p>While there are positive signs in the Americas and Asia-Pacific regions, there is still a notable lack of NLP events and activity in Africa. ACL 2022 offers an opportunity to correct that with a call recently sent out to the members’ list for hosts in the Europe/Middle East/Africa region in July or August 2022. The interest and value in NLP (and AI more generally) in Africa is indicated by the <a href=\"https://www.blog.google/around-the-globe/google-africa/google-ai-ghana\">creation of a Google AI office in Accra, Ghana</a>, <a href=\"https://iclr.cc/Conferences/2020\">ICLR 2020 being held in Addis Adaba, Ethiopia</a>, and a heavily over-subscribed <a href=\"https://aimsammi.org\">master’s course run by the African Institute for Mathematical Sciences</a>.</p>\n<p>We set out to write this post with a focus on geographic diversity in NLP. In the meantime <a href=\"https://www.aclweb.org/anthology/P19-1355\">Strubell, Ganesh & McCallum’s paper on CO<sub>2</sub> emission</a> estimates from NLP model training made a telling impact at ACL 2019 and we realised that this issue is of wide interest in the field. We therefore sought to quantify CO<sub>2</sub> emissions from conference attendance, by summing the air travel emissions for all locations in our database to the conference venue. Our calculations, made with some major caveats, suggest that delegate travel to the major NLP conferences in 2018 amounted to 2.1 million kg (4.6m lb) of CO<sub>2</sub> emissions.<span id='easy-footnote-4-1317' class='easy-footnote-margin-adjust'></span><span class='easy-footnote'><a href='https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/#easy-footnote-bottom-4-1317' title='Based on a total of 10.5m kilometres of air travel in the year and a per passenger kilometre multiplier of 200g which is based on a Boeing 747-400 flying at 80% seat occupancy (source: https://www.carbonindependent.org/22.html). Note the several important assumptions we’ve made for this estimate, and the impact of each one on the outcome: (1) That every city has an international airport: this means an overestimate of air miles, as many will travel by road or rail to the nearest international airport. On the other hand it is an underestimate of air miles because many will have to take a connecting flight via another airport, either because of routing or financial restrictions. (2) Similarly, at the other end, an assumption that every conference venue has an international airport: true for Melbourne, Brussels, New Orleans, not so for Santa Fe which has only a regional airport. Making the assumption of flight to Santa Fe is a fair one, rather than guessing which of the nearest international hubs, Dallas, Las Vegas or Denver (or otherwise) each person flew to. (3) That every attendee travels by air to the conference rather than land or sea-based modes of transport (note that those less than 100 miles from the venue are assumed not to have flown). (4) That every paper author attends the conference: no doubt an over-estimate. (5) That there are no conference attendees without a paper to present: no doubt an under-estimate.'><sup>4</sup></a></span> This on top of the tonnes of CO<sub>2</sub> put out training the models described at those conferences! There is of course much that is positive about in-person experience of international conferences, but each of us in the field has a responsibility to consider whether we should cut down on our travel. Some leading academics <a href=\"http://www.russpoldrack.org/2019/06/why-i-will-be-flying-less.html\">have already gone cold turkey</a>, while others call for <a href=\"https://twitter.com/anne_churchland/status/1127935350683447306\">virtual attendance</a> <a href=\"https://twitter.com/JaneEMCallaghan/status/1126766137507602434\">as a normal option</a>. Put this together with a recent study <a href=\"https://doi-org.ezp.lib.cam.ac.uk/10.1016/j.jclepro.2019.04.109\">finding no relationship between air travel and metrics of academic productivity</a> and it’s clear that reducing long-distance conference travel should be something to consider.</p>\n<figure id=\"attachment_1347\" aria-describedby=\"caption-attachment-1347\" style=\"width: 843px\" class=\"wp-caption aligncenter\"><a href=\"http://www.marekrei.com/blog/wp-content/uploads/2019/09/flightpaths-1.png\"><img decoding=\"async\" loading=\"lazy\" src=\"http://www.marekrei.com/blog/wp-content/uploads/2019/09/flightpaths-1-1024x501.png\" alt=\"\" width=\"843\" height=\"412\" class=\"size-large wp-image-1347\" srcset=\"https://www.marekrei.com/blog/wp-content/uploads/2019/09/flightpaths-1-1024x501.png 1024w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/flightpaths-1-150x73.png 150w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/flightpaths-1-300x147.png 300w, https://www.marekrei.com/blog/wp-content/uploads/2019/09/flightpaths-1-768x376.png 768w\" sizes=\"(max-width: 843px) 100vw, 843px\" /></a><figcaption id=\"caption-attachment-1347\" class=\"wp-caption-text\">Figure 4. Flight paths for the major NLP conferences in 2018.</figcaption></figure>\n<p>In summary, we wrote this blog post to highlight a lack of global representation at NLP conferences. This won’t be a surprising finding but we hope it is thought-provoking. How can the situation be improved? Of course, the root causes of the problem are much bigger issues than NLP can address alone. However, we’ve pointed to positive developments relating to NLP conferences, which we think could help improve the situation and should be widely adopted: writing mentoring programmes, diversity officers on conference committees, and remote presentation. In addition, holding more conferences in more regions (rather than allowing the existing few conferences to grow unchecked) is probably the better route to choose, both for diversity and environmental reasons. The first AACL conference in 2020 is very encouraging. We hope that an African bid might come through for ACL 2022, that EACL will take place more frequently, and that we’ll soon see inauguration of a South American (SAACL) and African (AfrACL) chapters of the ACL. How do we lobby for any of these things to happen? Please comment below!</p>\n<hr>\n<p>This is a guest post by <a href=\"https://apc38.user.srcf.net/\">Andrew Caines</a>, written in collaboration with <a href=\"http://www.marekrei.com/\">Marek Rei</a>. Andrew is a postdoctoral researcher at the University of Cambridge, working on automated language teaching and assessment.<br />\nThe statistics in this post are based on the data crawled for the previous post on analysing <a href=\"http://www.marekrei.com/blog/ml-and-nlp-publications-in-2018/\">ML/NLP publications in 2018</a>.<br />\nWe chose to use 2018 papers, as all the publications for 2019 are not available yet. Once these proceedings are published, there will be a new analysis coming for 2019 as well.</p>\n<p><script>\nPlotly.d3.csv('http://www.marekrei.com/blog/wp-content/uploads/2019/09/2018_ACL_conference_countries.csv', function(err, rows){\n      function unpack(rows, key) {\n          return rows.map(function(row) { return row[key]; });\n      }\n    var data = [{\n        type: 'choropleth',\n        locationmode: 'country names',\n        locations: unpack(rows, 'country'),\n        z: unpack(rows, 'count'),\n        zmin: 0,\n        zmax: 1000,\n        text: unpack(rows, 'country'),\n        colorscale: [\n            ['0.0', 'rgb(252,230,145)'],\n            ['1.0', 'rgb(224,30,4)']],\n        autocolorscale: false,\n    }];\n    var layout = {\n      title: {\n          text: ''//'Paper count by country at the 2018 NLP conferences'\n      },\n      geo: {\n          projection: {\n              type: 'equirectangular' //'robinson'\n          }\n      },\n      margin: { l: 0, r: -40, b: 0, t: 0, pad: 0 }\n    };\n    Plotly.plot(country_chloropleth_2018_count, data, layout, {showLink: false, responsive: true});\n});\n</script></p>\n<p><script>\nPlotly.d3.csv('https://www.marekrei.com/blog/wp-content/uploads/2019/09/2018_ACL_conference_countries.csv', function(err, rows){\n      function unpack(rows, key) {\n          return rows.map(function(row) { return row[key]; });\n      }\n    var data = [{\n        type: 'choropleth',\n        locationmode: 'country names',\n        locations: unpack(rows, 'country'),\n        z: unpack(rows, 'per_capita_count'),\n        zmin: 0,\n        zmax: 5,\n        text: unpack(rows, 'country'),\n        colorscale: [\n            ['0.0', 'rgb(252,230,145)'],\n            ['1.0', 'rgb(224,30,4)']],\n        autocolorscale: false,\n    }];\n    var layout = {\n      title: {\n          text: ''//Normalized paper count by country at the 2018 NLP conferences'\n      },\n      geo: {\n          projection: {\n              type: 'equirectangular' //'robinson'\n          }\n      },\n      margin: { l: 0, r: -40, b: 0, t: 0, pad: 0 }\n    };\n    Plotly.plot(country_chloropleth_2018_normcount, data, layout, {showLink: false, responsive: true});\n});\n</script></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/\">The Geographic Diversity of NLP Conferences</a> appeared first on <a rel=\"nofollow\" href=\"https://www.marekrei.com/blog\">Marek Rei</a>.</p>\n",
  "wfw:commentRss": "https://www.marekrei.com/blog/geographic-diversity-of-nlp-conferences/feed/",
  "slash:comments": 4
}