{
  "title": "Religiosity: Good for Society, Bad for Innovation?",
  "link": "https://freakonomics.com/2015/03/religiosity-good-for-society-bad-for-innovation/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Tue, 31 Mar 2015 16:47:26 +0000",
  "category": [
    "Freakonomics Blog",
    "Andrea Vindigni",
    "Davide Ticchi",
    "Guiso",
    "Mokyr",
    "Roland Benabou",
    "Sapienza and Zingales",
    "World Values Survey"
  ],
  "guid": "http://freakonomics.com/?p=109909",
  "description": "<p>In a new working paper, <strong>Roland Benabou</strong>, <strong>Davide Ticchi</strong>, and <strong>Andrea Vindigni</strong>  follow up <a href=\"https://www.princeton.edu/~rbenabou/papers/Religion%20December%201g_snd.pdf\" target=\"_blank\" rel=\"noopener\">their earlier paper</a> which found \"a robust negative association between religiosity and patents per capita.\" Their new paper, \"Religion and Innovation\" (<a href=\"http://www.nber.org/papers/w21052\" target=\"_blank\" rel=\"noopener\">abstract</a>; <a href=\"http://www.princeton.edu/~rbenabou/PP-Article_7.pdf\" target=\"_blank\" rel=\"noopener\">PDF</a>), they look at religiosity on the individual level, \"examining the relationship between religiosity and a broad set of pro- or anti-innovation attitudes.\"</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/religiosity-good-for-society-bad-for-innovation/\">Religiosity: Good for Society, Bad for Innovation?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>In a new working paper, <strong>Roland Benabou</strong>, <strong>Davide Ticchi</strong>, and <strong>Andrea Vindigni</strong>  follow up <a href=\"https://www.princeton.edu/~rbenabou/papers/Religion%20December%201g_snd.pdf\" target=\"_blank\" rel=\"noopener\">their earlier paper</a> which found &#8220;a robust negative association between religiosity and patents per capita.&#8221; Their new paper, &#8220;Religion and Innovation&#8221; (<a href=\"http://www.nber.org/papers/w21052\" target=\"_blank\" rel=\"noopener\">abstract</a>; <a href=\"http://www.princeton.edu/~rbenabou/PP-Article_7.pdf\" target=\"_blank\" rel=\"noopener\">PDF</a>), they look at religiosity on the individual level, &#8220;examining the relationship between religiosity and a broad set of pro- or anti-innovation attitudes.&#8221;</p>\n<p>What do they find?</p>\n<blockquote><p>Across the fifty-two estimated specifications, greater religiosity is almost uniformly and very significantly associated to less favorable views of innovation.</p></blockquote>\n<p>They are careful to note the broad benefits of religiosity on the social fabric:</p>\n<blockquote><p><strong>Guiso</strong>, <strong>Sapienza</strong> and <strong>Zingales</strong> (2003), using the World Values Survey (WVS), found more religious persons to be more trusting – of other people, public institutions, and market outcomes– as well as more trustworthy: less willing to break the law, accept a bribe, cheat on taxes, and the like. Theoretical models, similarly, have emphasized how beliefs in divine rewards and punishments (or a Calvinistic desire to self-signal one’s predestined fate) can induce individuals to behave less opportunistically and more cooperatively, which can in turn make such beliefs self-sustaining at the social level.</p>\n<p>Religiosity thus seems to be associated to what Guiso et al. describe as certain “societal attitudes&#8230; conducive to higher productivity and growth.”</p></blockquote>\n<p>But:</p>\n<blockquote><p>The ultimate driver of long-run growth, on the other hand, is technical progress and more generally the whole spectrum of innovation: from advances in basic science to the diffusion of new technologies (e.g., <strong>Mokyr</strong> (2004)), economic practices and even social change, such as the inclusion of women in production and idea-creation. It therefore seems equally important to examine the extent to which religious beliefs, values and institutions may be conducive or detrimental to creativity and innovation. Doing so means, in a sense, revisiting with modern methodologies the age-old theme of religion’s often tense relationship with science, free thought and disruptively novel ideas.</p></blockquote>\n<p>And so they revisit this theme, and reach this conclusion:</p>\n<blockquote><p>Using all five waves of the World Values Survey, we examined the relationships between eleven indicators of openness to innovation, broadly defined (e.g., attitudes toward science and technology, new versus old ideas, general change, personal risk taking and agency, imagination and independence in children) and five measures of religiosity, involving both beliefs and attendance. Across the fifty-two regression specifications (with controls for sociodemographics, country and year), greater religiosity was almost uniformly and very significantly associated to less favorable views of innovation. In follow-up work, we plan to examine differences in these attitudes across denominations.</p></blockquote>\n<p>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/religiosity-good-for-society-bad-for-innovation/\">Religiosity: Good for Society, Bad for Innovation?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}