{
  "id": "tag:blogger.com,1999:blog-5547907074344788039.post-549284325068487924",
  "published": "2013-11-10T15:47:00.001-08:00",
  "updated": "2013-11-10T15:48:57.703-08:00",
  "category": [
    "",
    ""
  ],
  "title": "The data scene in NYC",
  "content": "<span style=\"font-family: Arial; font-size: 13px;\">I love the NYC data scene. It is vibrant,&nbsp;healthy and&nbsp;welcoming.</span><br /><span style=\"font-family: Arial; font-size: 13px;\"></span><br /><span style=\"font-family: Arial; font-size: 13px;\">Eight months ago I left San Francisco and moved to New York. I had come very close to taking an offer in DC and had been struggling weighing the pros and cons of DC versus NYC. I had previously lived in DC so knew the area, Virginia schools are very good and the cost of living significantly lower than the New York area, all important considerations when you have a young family. <a href=\"http://www.warbyparker.com/\">Warby Parker</a> (my current employer) had set me up to have a chat with <a href=\"http://www.linkedin.com/in/dpatil/\">DJ Patil</a> who at the time was data scientist in residence at Greylock Partners. We had an honest and open discussion of these issues and he asked, \"That is a great offer but what happens if it doesn't work out? New York has a rich and vibrant data scene. It is going to be stimulating and there are lots of opportunities.\" He was right of course.</span><br /><span style=\"font-family: Arial; font-size: 13px;\"></span><br /><span style=\"font-family: Arial; font-size: 13px;\">DC has changed significantly since I left in 2007. There are many more startups and networks for entrepreneurs and <a href=\"http://www.harlan.harris.name/\">Harlan Harris</a> and co have done an amazing job bringing together the data community under the umbrella of <a href=\"http://datacommunitydc.org/blog/\">Data Community DC</a>. The reality, however, is that there are relatively few opportunities. The two big tech companies, AOL and Living Social, are both a mess. There are many other data-related positions, <i>if you have security clearance</i>, and the majority of other positions tend to be with small consulting firms that service the government and Department of Defense.</span><br /><span style=\"font-family: Arial; font-size: 13px;\"></span><br /><span style=\"font-family: Arial; font-size: 13px;\">Contrast this with New York:</span><br /><ul><li><span style=\"font-family: Arial; font-size: 13px;\">New York is </span><i style=\"font-family: Arial; font-size: 13px;\">the</i><span style=\"font-family: Arial; font-size: 13px;\"> place to be for advertising and media.&nbsp;</span></li><li><span style=\"font-family: Arial; font-size: 13px;\">New York is </span><i style=\"font-family: Arial; font-size: 13px;\">the</i><span style=\"font-family: Arial; font-size: 13px;\"> place to be for fashion.&nbsp;</span></li><li><span style=\"font-family: Arial; font-size: 13px;\">New York is </span><i style=\"font-family: Arial; font-size: 13px;\">the</i><span style=\"font-family: Arial; font-size: 13px;\"> place to be for finance.&nbsp;</span></li></ul><span style=\"font-family: Arial; font-size: 13px;\">The tech scene is rich too&nbsp;</span><span style=\"font-family: Arial; font-size: 13px;\">and while I know that this is a gross oversimplification there is somehow something very tangible about the startups here.&nbsp;</span><span style=\"font-family: Arial; font-size: 13px;\">They are more likely to sell real goods and services, physical goods from <a href=\"http://www.etsy.com/\">Etsy</a>, <a href=\"http://www.renttherunway.com/rtr_home\">Rent the Runway</a> or <a href=\"http://www.birchbox.com/\">Birchbox</a>. In other words,&nbsp;</span><span style=\"font-family: Arial; font-size: 13px;\">eCommerce is thriving.&nbsp;</span><span style=\"font-family: Arial; font-size: 13px;\">In addition, under Bloomberg's initiatives, the city is investing heavily in data science and statistics </span><i style=\"font-family: Arial; font-size: 13px;\">per se</i><span style=\"font-family: Arial; font-size: 13px;\"> with new institutes and a campus on Roosevelt Island.</span><br /><span style=\"font-family: Arial; font-size: 13px;\"></span><br /><span style=\"font-family: Arial; font-size: 13px;\">At the O'Reilly Strata + Hadoop World conference last week there was an interesting panel \"<a href=\"http://strataconf.com/stratany2013/public/schedule/detail/30657\">New York City: a Data Science Mecca</a>.\" On the panel were Yann Le Cunn (NYU), Chris Wiggins (HackNY/Columbia) and Deborah Estrin (Cornell NY Tech).&nbsp;</span><span style=\"font-family: Arial; font-size: 13px;\">Yann Le Cunn is the Director of the newly opened <a href=\"http://cds.nyu.edu/\">Center for Data Science</a>, a multi- and inter-disciplinary research institute that plans to churn out 50 data science Masters students per year as well as host a PhD program, all of which will have strong ties to the local tech scene. Similarly, Columbia's new <a href=\"http://idse.columbia.edu/\">Institute for Data Science and Engineering</a> will be hiring 30 new faculty positions, taking up shop in a new 44k square foot building and have an industrial affiliate program. Finally, Cornell will be moving to Roosevelt in 2015 with a broader program than just data science that covers computer science and operations research, all skills the feature in the data science world. The panel made the point that New York is such a great place to be for data because of the density of the ecosystem. On a tiny island with great public transport you have a huge conglomeration of finance, media and advertising companies, other organizations such as Mt Sinai (who recently hired <a href=\"http://www.linkedin.com/in/jhammerb\">Jeff Hammerbacher</a>---the very person who coined the term \"data scientist\" with DJ Patil), a suite of world class universities who are investing faculty, buildings (highly significant given than land is precious) and have both research and training foci, and finally the city itself. Yann also made the point that the density of jobs and other organizations here make it easier to attract part-time students.&nbsp;</span><br /><span style=\"font-family: Arial; font-size: 13px;\"></span><br /><span style=\"font-family: Arial; font-size: 13px;\">The data-related <a href=\"http://www.meetup.com/\">Meetup</a> scene is very strong too. (Meetup is based in NYC.) You could go to a packed and interesting data-or data-tech related meetup almost every night. <a href=\"http://www.datakind.org/\">DataKind</a> are based here too. One of the most prominent data scientists, <a href=\"http://www.hilarymason.com/\">Hilary Mason</a> (now data scientist in residence at Accel Partners) is based here.&nbsp;Strata just took place last week.&nbsp;In Fashion Week, 596 people attended \"Fashion Tech: Demos &amp; Drinks\" that showcased the local fashion related tech companies. I couldn't attend. Why? Because I was attending a <a href=\"http://www.datagotham.com/\">DataGotham</a> event, another important data conference that brings the data community together. Later this month is <a href=\"http://pydata.org/\">pyData</a>. You get the idea.&nbsp;</span><br /><span style=\"font-family: Arial; font-size: 13px;\"><br /></span><span style=\"font-family: Arial; font-size: 13px;\">NYC is a fruitful mix of data-research, data practitioners and a strong data community. I am happy to be both here and at Warby Parker.&nbsp;</span><span style=\"font-family: Arial; font-size: 13px;\">Oh, and the team that I would have joined in DC recently imploded. I dodged a bullet. Thanks DJ.</span><br /><span style=\"font-family: Arial; font-size: 13px;\"></span>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Carl Anderson",
    "uri": "http://www.blogger.com/profile/11930448254473684406",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 5
}