{
  "title": "This Amplifier Chip for Light Is Faint No More",
  "link": "https://spectrum.ieee.org/chip-scale-photonic-amplifier",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-series-of-disks-of-varying-sizes-on-a-flat-square-in-the-center-one-circle-glows-green-with-a-line-coming-from-top-and-from.jpg?id=30008472&width=1200&height=800&coordinates=0%2C220%2C0%2C221\"/><br/><br/><p>Photonics has long held the promise of microchips that operate faster and consume less energy than their electronic counterparts. However, developing such circuitry has proven challenging over the years. One of the primary difficulties involves providing enough output power to yield a strong enough signal. However, researchers have now developed a chip-scale power booster for light with performance roughly as good as those already seen in commercial telecommunications.<br/></p><p>The <a href=\"https://www.infrapedia.com/\" target=\"_blank\">ultrabroadband fiber-optic networks</a> that now connect the globe depend on <a href=\"https://www.rp-photonics.com/erbium_doped_fiber_amplifiers.html\" target=\"_blank\">erbium-doped fiber amplifiers</a> that enable ultrafast data rates worldwide. Optical signals must be amplified many times when transmitted over great distances due to signal losses from the optical fibers and other network components. First developed in the 1980s, erbium-doped fiber amplifiers help boost optical signals without the extra step of converting them into electrical signals beforehand. (Specifically, these devices can amplify light in the <a href=\"https://www.garlandtechnology.com/blog/fiber-facts-yes-you-do-need-to-read-this#:~:text=There%20are%20three%20main%20wavelengths,the%20glass%20and%20causes%20attenuation.\" target=\"_blank\">1.55-micrometer or 1,550-nanometer wavelength region</a>, where optical fibers experience the fewest transmission losses.)</p><p class=\"pull-quote\">“The most exciting part of this work is how well the amplifiers work and that they are on par with commercial amplifiers, despite just being a few hundred microns across in each dimension.”<br/>—Tobias Kippenberg, Swiss Federal Institute of Technology Lausanne</p><p>For decades, scientists have sought to invent similar amplifiers that can work onboard photonic microchips. However, attempts to develop such chip-scale amplifiers resulted in devices whose output power was typically less than a milliwatt—too weak for many practical applications—due mostly to losses from the waveguides used to route light inside the chips. These amplifiers typically also had large footprints, and their fabrication was not compatible with contemporary photonic integrated circuit manufacturing techniques.</p><p>Now researchers have developed a chip-scale version of an erbium-doped fiber amplifier. The new device has a record-high output power of more than 145 milliwatts given just 2.61 mW of input power with more than 30 decibels of small-signal gain. This resulted in a more than a thousandfold amplification in the telecommunication band in continuous operation, a performance already comparable to that of commercial high-end erbium-doped fiber amplifiers.</p><p>“The most exciting part of this work is how well the amplifiers work and that they are on par with commercial amplifiers, despite just being a few hundred microns across in each dimension,” says study senior author Tobias Kippenberg, an optical engineer at the Swiss Federal Institute of Technology Lausanne. “That it would be possible to realize such amplifiers seemed impossible just a few years ago.”</p><p>Moreover, the researchers packed this device’s erbium-doped waveguide of up to a half-meter long into a spiral whose footprint measured just 1.2 millimeters by 3.6 mm across. The device also operates with a high power-conversion efficiency of roughly 60 percent.</p><p>The key to this new device is an ultralow-loss chip-scale photonic waveguide based on <a href=\"https://en.wikipedia.org/wiki/Silicon_nitride\" target=\"_blank\">silicon nitride</a>, a material that has already widely used in the semiconductor industry. Recently, Kippenberg and his colleagues fabricated <a href=\"https://www.nature.com/articles/s41467-021-21973-z\" target=\"_blank\">ultralow-loss silicon nitride waveguides up to meters long</a>. This led them to investigate whether implanting erbium into such waveguides might result in optical amplifiers.</p><p>“Erbium ions can provide amplification of light but only very faintly,” Kippenberg says. “It is only when they are embedded into very-low-loss optical fibers, and when they interact with light for very long distances, typically meters in length, that one can achieve gain.”</p><p>In experiments, the researchers showed they could boost the output power of devices known as <a href=\"https://www.nature.com/articles/s41566-021-00901-z\" target=\"_blank\">soliton microcombs</a> by 100 times. Soliton microcombs, can be used in spectroscopy, metrology, and other applications, but their output power is limited to only tens to hundreds of microwatts, requiring amplification in almost every application.</p><p>The scientists also revealed their device could directly amplify more than 20 <a href=\"https://spectrum.ieee.org/optical-nets-brace-for-even-heavier-traffic\" target=\"_self\">wavelength-division multiplexing</a> channels for data transmission over a 1-kilometer-long optical fiber link. This suggests it could be used in chip-scale amplification for telecommunication networks.</p><p>The researchers noted their optical amplifier still needs a pump laser that dwells off the microchip. Therefore, the entire unit is still not integrated together yet. “This is a key deficiency we need to address in the future via hybrid integration,” Kippenberg says.</p><p>Ultimately, the scientists hope their optical amplifiers may help enable chip-scale, mode-locked lasers delivering bursts just quadrillionths of a second (a.k.a. <a href=\"https://en.wikipedia.org/wiki/Femtosecond\" target=\"_blank\">femtoseconds</a>) long. Such devices may have a wide variety of uses, such as lidar, says study lead author Yang Liu, an optical engineer at the Swiss Federal Institute of Technology Lausanne.</p><p>“The femtosecond mode-locked laser is clearly a holy grail, and what we now are setting our sights on,” Kippenberg says.</p><p>The scientists detailed <u><a href=\"http://www.science.org/doi/10.1126/science.abo2631\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> 16 June in the journal <em>Science</em>.</p>",
  "pubDate": "Wed, 22 Jun 2022 15:48:18 +0000",
  "guid": "https://spectrum.ieee.org/chip-scale-photonic-amplifier",
  "category": [
    "Optical fiber",
    "Amplifiers",
    "Optical communications",
    "Wavelength division multiplexing",
    "Photonic integrated circuit",
    "Photonics chip",
    "Photonics"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}