{
  "title": "Big Learning: Algorithms, Systems, and Tools for Learning at Scale",
  "description": "<p class=\"p1\">We&rsquo;re organizing a <a title=\"Big Learning\" href=\"http://www.biglearn.org\">workshop at NIPS 2011</a>. Submission are solicited for a two day workshop December 16-17 in Sierra Nevada, Spain. </p>\n<p class=\"p3\">This workshop will address tools, algorithms, systems, hardware, and real-world problem domains related to large-scale machine learning (“Big Learning”). The Big Learning setting has attracted intense interest with active research spanning diverse fields including machine learning, databases, parallel and distributed systems, parallel architectures, and programming languages and abstractions. This workshop will bring together experts across these diverse communities to discuss recent progress, share tools and software, identify pressing new challenges, and to exchange new ideas. Topics of interest include (but are not limited to):</p>\n<p class=\"p3\"><strong>Hardware Accelerated Learning</strong>: Practicality and performance of specialized high-performance hardware (e.g. GPUs, FPGAs, ASIC) for machine learning applications.</p>\n<p class=\"p3\"><strong>Applications of Big Learning</strong>: Practical application case studies; insights on end-users, typical data workflow patterns, common data characteristics (stream or batch); trade-offs between labeling strategies (e.g., curated or crowd-sourced); challenges of real-world system building.</p>\n<p class=\"p4\"><strong>Tools, Software, &amp; Systems</strong>: Languages and libraries for large-scale parallel or distributed learning. Preference will be given to approaches and systems that leverage cloud computing (e.g. Hadoop, DryadLINQ, EC2, Azure), scalable storage (e.g. RDBMs, NoSQL, graph databases), and/or specialized hardware (e.g. GPU, Multicore, FPGA, ASIC).</p>\n<p class=\"p4\"><strong>Models &amp; Algorithms</strong>: Applicability of different learning techniques in different situations (e.g., simple statistics vs. large structured models); parallel acceleration of computationally intensive learning and inference; evaluation methodology; trade-offs between performance and engineering complexity; principled methods for dealing with large number of features; </p>\n<p class=\"p4\">Submissions should be written as extended abstracts, no longer than 4 pages (excluding references) in the <a title=\"LaTeX style\" href=\"http://nips.cc/PaperInformation/StyleFiles\">NIPS latex style</a>. Relevant work previously presented in non-machine-learning conferences is strongly encouraged. Exciting work that was recently presented is allowed, provided that the extended abstract mentions this explicitly.  </p>\n<p class=\"p4\">Submission Deadline: September 30th, 2011.</p>\n<p class=\"p4\">Please refer to the <a title=\"Big Learning submission\" href=\"http://biglearn.org/index.php/Authorinfo\">website for detailed submission instructions</a>.</p>",
  "link": "https://blog.smola.org/post/9604982818",
  "guid": "https://blog.smola.org/post/9604982818",
  "pubDate": "Tue, 30 Aug 2011 16:36:51 -0700"
}