{
  "title": "190: Unraveled: The Long Island Serial Killer",
  "link": "https://audioboom.com/posts/7912148",
  "itunes:episode": 190,
  "itunes:title": "Unraveled: The Long Island Serial Killer",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3449,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>It’s been a decade since 11 bodies were found along the coastline of Long Island. The work of a probable serial killer, those homicides were never solved. But just last year, Investigative journalists Billy Jensen and Alexis Linkletter got a new and explosive lead. With unprecedented access to case files and armed with new information, Bill and Alexis head to Long Island to reinvestigate the case and try to solve it once and for all. <br>\n<br>\n<a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>FAM OUR LIVE SHOW IN BOSTON IS BACK ON AND TICKETS ARE NOW ON SALE!! </strong></a>If you had tickets to the original date, they have been refunded, check your email! Our new date is Saturday, July 31st at 7pm AT THE WILBUR THEATER!!  We're covering Oxygen's \"The Disappearance of Maura Murray\" and we will be joined by Maggie Freleng (who hosted the series) and Tim and Lance from Missing Maura Murray podcast! <a href=\"https://thewilbur.com/artist/true-crime-obsessed/\"><strong>TICKETS ARE GOING FAST! GET YOURS AND COME JOIN US!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 27 Jul 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-27:/posts/7912148",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}