{
  "id": "yt:video:yGic8wwhm6g",
  "yt:videoId": "yGic8wwhm6g",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - Watch for Rolling Rocks - 1x A Presses [OUTDATED]",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2015-07-11T22:49:57+00:00",
  "updated": "2022-05-16T09:49:27+00:00",
  "media:group": {
    "media:title": "SM64 - Watch for Rolling Rocks - 1x A Presses [OUTDATED]",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "THIS VIDEO IS OUTDATED - SEE A BETTER VERSION OF THIS VIDEO HERE:\nhttps://youtu.be/kpk2tdsPh0A\n\nI collect the star Watch for Rolling Rocks in Hazy Maze Cave using 1 A press. The A press is to do a hyper speed double jump up to the star from the underground lake.\n\nThis video is an improvement from my previous video in which I collected this star in 2 A presses. You can find that video here: https://youtu.be/DZxaWsnucGM. To understand the improvement since then, we're going to need some background information:\n\nOriginally, Plush figured out we could accumulate hyper speed in the underground lake using hyper speed water sliding, which can be seen here: https://youtu.be/69NMgKGFKC0?t=1m29s. This technique involved using Z to conserve horizontal speed out of water, and C^ to slide down steep slopes while gaining speed. Soon after this, I realized that with enough hyper speed, we could do a very high double jump all the way to the Watch for Rolling Rocks star [https://youtu.be/DahyjxZzRIs]. Unfortunately, this technique required ~1500 horizontal speed, whereas hyper speed water sliding could only accumulate ~500 speed, and this was simply not enough [https://youtu.be/hipaBm6UWUM]. All hope seemed lost, until today when Tyler Kehne discovered that hyper speed walking could be performed in the underground lake as well [https://youtu.be/EX2CCKfXBpc]. With this technique, we could accumulate 1700+ hyper speed, which was more than enough to collect the Watch for Rolling Rocks star using 1 A press.\n\nSo how does hyper speed walking work? It involves a steep slope that descends into water. Normally, Mario wouldn't be able to stand on a slope this steep, but the shallow water gives the ground special properties that allows him to do so. Furthermore, if Mario tries to run uphill on this ground, he will end up running backwards at an increasingly fast rate. Usually, this walking can't be used to accumulate all that much speed, because (1) the slope runs out, (2) the slope connects to a wall at angle that isn't 90 degrees and so running backwards into it moves Mario either uphill or downhill, or (3) Mario gains too much speed and can no longer properly follow along the shallow water. Of course, all of this was already known. What wasn't known (and what Tyler discovered) was that the red wall stops Mario from moving while allowing his backwards speed to increase. With this observation, the Watch for Rolling Rocks strat became 100% doable.\n\nABC Playlist: https://www.youtube.com/playlist?list=PLmvvhlevqC2d6vis077yFHuLJHYtTtqe_\nABC Routes: https://docs.google.com/document/d/1ypRVVRyf4x-v8GqCSmKYnicrfKSIjao3Y1ZVl52RIyM/edit",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}