{
  "title": "Nigeria: Displacement Camp Closures Worsen Suffering",
  "link": "https://www.hrw.org/news/2022/11/02/nigeria-displacement-camp-closures-worsen-suffering",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        A woman carries her belongings at the Bakassi camp in Maiduguri, Nigeria on November 30, 2021, as residents vacate the camp ahead of the Borno State government’s closure of all internally displaced person camps.\n                    © 2021 Audu Marte / AFP via Getty Images\n          \n\n  \nThe decision by Nigeria’s Borno State to shut down its camps for people displaced by the Boko Haram conflict has pushed over 200,000 people into deeper suffering and destitution\n\tBorno State is harming hundreds of thousands of displaced people already living in precarious conditions to advance a dubious agenda to wean people off humanitarian aid.\n\tBorno State authorities should stop closing camps until the authorities have had genuine consultations with the camp residents and other key actors and made adequate plans for them to resume their lives and livelihoods.\n<p>(Abuja) – The decision by Nigeria’s Borno State government to shut down its camps for people displaced by the Boko Haram conflict has pushed over 200,000 people into deeper suffering and destitution, Human Rights Watch said in a report released today. The government has not provided those removed with adequate alternatives, violating their rights to housing, food, and livelihoods.<br /><br />\nThe 59-page report, “‘Those Who Returned Are Suffering’: Impact of Camp Shutdowns on People Displaced by the Boko Haram Conflict in Nigeria,” documents the effect of the shutdowns, which have disrupted food support for internally displaced people and compelled them to leave the camps. The authorities have failed to provide adequate information or sustainable alternatives to ensure their safety and well-being. As a result, displaced people are struggling to meet their most basic needs including food and shelter in the places which they have returned to or where they have resettled.<br /><br />\n“The Borno State government is harming hundreds of thousands of displaced people already living in precarious conditions to advance a dubious government development agenda to wean people off humanitarian aid,” said Anietie Ewang, Nigeria researcher at Human Rights Watch and author of the report. “By forcing people from camps without creating viable alternatives for support, the government is worsening their suffering and deepening their vulnerability.”</p>\n\n<p>From May 2021 to August 2022, Borno State authorities had compelled over 140,000 people to evacuate eight camps in the state capital, Maiduguri. Two other camps are also set to be closed this year, Muna Badawi and 400 Housing Estate (Gubio) Camp, housing a combined total of nearly 74,000 people.</p>\n\n\n\n\n\n\n      \n\n                                                                                                                                                  \n\n\n\n\n\n\n      \n\n  \n          A tent constructed for shelter by an INGO in Dalori I camp in Maiduguri, which is set to be shut down by the Borno State government. IDP camp shutdowns by the government have sustainable alternatives to ensure they can meet basic needs including food and adequate shelter.&#13;\n © 2021 Anietie Ewang/Human Rights WatchGallons, basins and buckets lined up by people in front of a tap to fetch water in Gubio IDP camp, which is set to be shut down by the Borno State government. Displaced people in Gubio Camp live either in tents constructed by international nongovernmental organizations (INGOs) or in buildings already existing on the premises before it was designated as a campsite.&#13;\n © 2021 Anietie Ewang/Human Rights WatchA displaced woman inside her tent constructed by an INGO in Gubio IDP camp in Maiduguri, which is set to be shut down by the Borno State government. IDP camp shutdowns have compelled displaced people to leave the camps without consultation, adequate information, or sustainable alternatives to ensure they can meet basic needs including food and adequate shelter.&#13;\n © 2021 Anietie Ewang/Human Rights WatchCards distributed to enumerated male and female heads of households and wives in male-headed households that identified them to receive money (between 50,000 and 100,000 naira, or US$116 to and US$232) for livelihood support prior to the Bakassi camp shutdowns in November 2021.  Funds distributed were too little to provide any meaningful support for  displaced families forced to move out of the camp and build their lives afresh, and were instead often spent on immediate needs.&#13;\n © 2021 Anietie Ewang/Human Rights WatchTent built for shelter in Musari, a low-income community in Maiduguri, by a family forced to move from Bakassi camp, which the Borno State government shut down in November 2021.&#13;\n © 2021 Anietie Ewang/Human Rights WatchA displaced family outside their home, a thatch tent, in Musari, a low-income community in Maiduguri.  Their belongings include a mattress and clothes left outside to dry following heavy rainfall that destroyed the roof and penetrated the tent.&#13;\n&#13;\n &#13;\n&#13;\nThe family obtained permission to build the tent on privately owned land after they were forced out of Bakassi camp, which the government shut down in November 2021.&#13;\n © 2021 Anietie Ewang/Human Rights WatchInside a thatch tent, home to a displaced family of nine forced to move from Bakassi camp, which the Borno State government shut down in November 2021. The family sought permission from a private land owner in Musari, a low-income community in Maiduguri to build the tent, which has been inadequate to protect them and their belongings from heavy rains.&#13;\n © 2021 Anietie Ewang/Human Rights WatchAn informal camp in Sulumburi, Maiduguri, where some displaced families have sought shelter following the shutdown of IDP camps in Maiduguri. Informal camps exist where private landowners give permission to displaced people to build structures consisting mostly of thatch or tarpaulin for temporary shelter. People live independently in these camps, which are not organized or supported by the government. Humanitarian agencies, however, sometimes provide one-off support to some informal camps by constructing latrines or donating thatch and tarpaulin to enable displaced persons to build shelters.&#13;\n © 2021 Anietie Ewang/Human Rights WatchAn informal camp in Sulumburi, Maiduguri, where some displaced families have sought shelter following the shutdown of IDP camps in Maiduguri. Informal camps exist where private landowners give permission to displaced people to build structures consisting mostly of thatch or tarpaulin for temporary shelter. People live independently in these camps, which are not organized or supported by the government. Humanitarian agencies, however, sometimes provide one-off support to some informal camps by constructing latrines or donating thatch and tarpaulin to enable displaced persons to build shelters.&#13;\n © 2021 Anietie Ewang/Human Rights Watch\n\n  \n\n  \n<p><br />\nBetween April and September 2022, Human Rights Watch interviewed 22 internally displaced people, including 8 in either Dalori I or Gubio camps, as well as 14 who had left Bakassi camp, which was shut down in November 2021. Those who left Bakassi camp sought shelter in Maiduguri or in Bama, their home community. Human Rights Watch also interviewed camp management officials, representatives of international humanitarian agencies, and United Nations officials coordinating assistance in Borno State.<br /><br />\nFood support to the camps stopped soon after Borno State Governor Babagana Umaru Zulum announced in October 2021 that all camps in Maiduguri would be shut down by December 2021. Although several remained open beyond that date, organizations including the UN World Food Program could not provide support because the slated shutdowns and funding gaps made it impossible to scale up their 2022 plans.<br /><br />\nAlthough the Borno State Emergency Management Authority has provided some ad hoc food distribution, deliveries have been sporadic and insufficient to meet needs. Many people said they have been forced to skip meals or go for days without something substantial or nutritious to eat.<br /><br />\nA 29-year-old father of four said: “In the camp in Maiduguri, we could eat protein, like fish, but in Bama we can’t afford this kind of food. My children are not healthy as they are supposed to be. They are now thin and frail.”<br /><br />\nMany children have resorted to begging on the streets to survive despite the dangers of road accidents, kidnapping, trafficking, and sexual violence.<br /><br />\nThe people affected by camp closures are also living in worse accommodations than they had in the camps. While in the camps, many had lived in tarpaulin tents set up by humanitarian organizations or occupied single rooms in houses built on the premises before they became camp sites. The structures outside the camps seen by Human Rights Watch were poorly built, providing little shelter from the rain. The makeshift thatch structures in Maiduguri and Bama had no access to sanitation facilities, relying on pit latrines separate from their homes.<br /><br />\nBorno State authorities assert they had rebuilt houses in places they had urged displaced people to return to, such as Bama, which had been destroyed in the conflict with Boko Haram. But people who returned there said their houses had not been rebuilt.<br /><br />\nThe authorities also said that the camp shutdowns were necessary as part of their development agenda, to remove people from humanitarian assistance and to build their resilience to contribute to the state’s growth. This appears to be closely tied to the Borno State government’s 25-year development framework and 10-year strategic transformation plan, which highlight the resettlement of displaced families in secure, affordable, and self-sustaining communities as a key indicator for success.<br /><br />\nHuman Rights Watch urged the UN, especially its representatives in Nigeria, to respond more actively and effectively to prevent and mitigate harm to displaced people in Borno State, rather than waiting for a more disastrous outcome to emerge. Borno State authorities should suspend the closure of the remaining camps until adequate plans and genuine consultations are made with the camp residents and other key actors.<br /><br />\n“Nigerian authorities should recognize that hasty closure of camps is sabotaging efforts to improve the lives of displaced people,” Ewang said. “Anything short of investment in collective efforts with aid providers to ensure durable and dignified solutions for displaced people will be a step in the wrong direction.”<br /><br /></p>",
  "pubDate": "Wed, 02 Nov 2022 01:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/nigeria-displacement-camp-closures-worsen-suffering"
}