{
  "title": "Will AI Kill Your Job?",
  "link": "https://kavita-ganesan.com/will-ai-kill-your-job/",
  "comments": "https://kavita-ganesan.com/will-ai-kill-your-job/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Fri, 04 Feb 2022 18:27:08 +0000",
  "category": [
    "AI Mindset",
    "Business AI"
  ],
  "guid": "https://kavita-ganesan.com/?p=6806",
  "description": "Will AI *really* steal our jobs? This article performs some reality checks on this topic. You may find some of the thought process counterintuitive to what the media makes you believe.",
  "content:encoded": "\n<p><em><strong>Oh, what will happen to our jobs when my company starts using AI?</strong></em></p>\n\n\n\n<p>This is such a popular question that comes up when I give talks—even to a pseudo technical audience.</p>\n\n\n\n<p>Not surprisingly, this question will land sarcastic smiles on the faces of some data scientists and AI experts; you may even catch some eyes rolling.&nbsp;</p>\n\n\n\n<p><em>But it’s a valid question.&nbsp;</em></p>\n\n\n\n<p>Don’t forget, we had a US political candidate run for the presidency on the theme that <a href=\"https://www.nytimes.com/2019/11/14/opinion/andrew-yang-jobs.html\" target=\"_blank\" rel=\"noopener\">automation is robbing people of good jobs</a> and we should thus be compensated for the crisis. Popular figures take it to extreme levels and even state that <a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/news/elon-musk-artificial-intelligence-ai-singularity-a9640196.html\" target=\"_blank\" rel=\"noopener\">AI will take over the human race</a> very soon.</p>\n\n\n\n<p>With all this noise around automation and AI, of course, this will send shivers down people’s spines; A technology they don’t quite understand is trying to <em>pull the rug from under their feet</em>. Worse still, this technology has the potential of destroying them, according to some.</p>\n\n\n\n<p>The fear is real.</p>\n\n\n\n<p>According to a<a href=\"https://governanceai.github.io/US-Public-Opinion-Report-Jan-2019/public-opinion-on-ai-governance.html.\" target=\"_blank\" rel=\"noopener\"> survey</a> conducted by Oxford University’s Center for the Governance of AI, Americans fear a future where AI becomes too intelligent. &nbsp;When people were asked what kind of impact machine intelligence would have on humanity, 34 percent thought it would be negative, with 12 percent leaning towards <em>human extinction</em>!&nbsp;</p>\n\n\n\n<p>This begs the question of, <em>Will, AI *really* replace our jobs and later us?</em>&nbsp;</p>\n\n\n\n<p>The answer is complicated. There are several parts to this story.</p>\n\n\n\n<h1 id=\"why-ai-will-steal-some-of-our-jobs\">Why AI <em>will</em> steal some of our jobs</h1>\n\n\n\n<p>To recap, the goal of AI is to mimic human intelligence and decision-making within a computer, leveraging computer algorithms.&nbsp;Given the computing power, learning algorithms, and data we have today, there are many repetitive tasks done by humans that can be offloaded to AI.&nbsp;At least, AI can assist humans in completing those tasks.</p>\n\n\n\n<p>For example, AI systems can be taught to handle simple customer support requests, detect defects on manufactured products, and even investigate the possibility of a fraud event.&nbsp;Once these AI systems are trained, they can perform these tasks more efficiently, quicker, and sometimes even with higher accuracy.&nbsp;So, of course, specific jobs, especially those decision-making jobs that are also labor-intensive, can be “replaced”.&nbsp;But not in the way you think.</p>\n\n\n\n<p>Remember that when AI systems fail or make mistakes, you still need humans to rectify the issues.&nbsp;You also need humans in the loop to provide quality assurance–essentially, become the supervisor of these AI systems.&nbsp;Further, as AI systems today rely heavily on data to learn how to perform tasks, you still need humans in the loop to generate high-quality data.&nbsp;More importantly, there’ll be functions around the “stolen” job that no AI is capable of doing single-handedly, such as reporting progress, finding areas of improvement,&nbsp;managing team members, etc.</p>\n\n\n\n<p>So eventually, while tasks that used to take a whole team may now be augmented with AI, the roles within your team can change.&nbsp;The humans may become acting supervisors, AI trainers, and quality assurance managers.</p>\n\n\n\n<p>In the end, teams could shrink.&nbsp;But teams may also stay the same for years, while their roles change.&nbsp;In some cases, teams may grow bigger due to the demand for other related roles.&nbsp;Nevertheless, humans play a critical part in AI-augmented workflows.</p>\n\n\n\n<h1 id=\"why-ai-will-not-replace-us-humans\">Why AI <em>will not</em> replace us humans</h1>\n\n\n\n<p>AI systems are task-oriented machines. If you train these machines to perform a series of tasks, they very well will. For example, if you teach a machine learning algorithm to detect breast cancer by asking it to read thousands of mammogram images, it could very well do it like a radiologist. At the same time, the same AI system will not be able to detect any other types of cancer, unlike a radiologist who could detect other related cancers.</p>\n\n\n\n<p>We must come to terms that AI systems today lack commonsense reasoning, the ability to effectively build upon knowledge, read between the lines, and use logic as humans do. While humans are born with such innate abilities, AI systems today rely heavily on <em>patterns</em> in data.</p>\n\n\n\n<p>Even the famed ​​ GPT-3, the massive language prediction model that seems to do everything, including completing computer source code, answering questions, predicting sentiment, writing articles, etc, gets stumped when you play with its “commonsense abilities”. When you trick it with illogical questions, it produces illogical answers. That’s because it’s trained to learn <em>obvious</em> patterns from huge volumes of data, not conceptualized knowledge, which is more abstract.</p>\n\n\n\n<p>For example, if you ask GPT-3, “How many eyes does your foot have?”, it will answer, “Your <strong>foot</strong> has <strong>two</strong> <strong>eyes</strong>” (<a href=\"https://lacker.io/ai/2020/07/06/giving-gpt-3-a-turing-test.html\" target=\"_blank\" rel=\"noopener\">see examples here</a>). On the contrary, a two-year-old will quickly tell you that feet don’t have eyes!</p>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><a href=\"https://lacker.io/ai/2020/07/06/giving-gpt-3-a-turing-test.html\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-15597\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2022/01/question-and-answer-with-GPT-3-1024x437.png\" alt=\"\" width=\"1024\" height=\"437\"></a>\n<figcaption><strong>Question and answers with GPT-3</strong> (Source: <a href=\"https://lacker.io/ai/2020/07/06/giving-gpt-3-a-turing-test.html\" target=\"_blank\" rel=\"noopener\">lacker.io</a>)</figcaption>\n</figure>\n</div>\n\n\n\n<p>My point here is that while AI systems can perform complex tasks, at present, they’re very much task-oriented machines. AI is a long way from performing humanlike reasoning in a general sense. If one of the more sophisticated AI systems can’t tell you that feet don’t have eyes, do you really think AI robots can plan a complete takeover of the human race? General humanlike reasoning technology just isn’t there yet due to its complexity and it may be so for several decades to come.&nbsp;Nonetheless, this does not diminish the fact that task-oriented AI systems can already enhance human lives in so many ways.</p>\n\n\n\n<h1 id=\"we-need-ai-and-automation-more-than-ever\">We <em>need</em> AI and automation more than ever</h1>\n\n\n\n<p>As we’ve all seen with the COVID-19 pandemic, a 100% human workforce is risky and may no longer be suitable for the world we live in today. Workers resigned in great numbers to either care for their homeschooling kids, fear of the virus itself, or at the realization that many of the jobs were not worth the risk. This has resulted in a <em>shrinking</em> labor force participation which has already been happening over the last several decades due to the aging population and other factors.</p>\n\n\n\n<div width=\"100%\" align=\"center\"><iframe loading=\"lazy\" align=\"center\" src=\"https://d3fy651gv2fhd3.cloudfront.net/embed/?s=unitedstalabforparra&v=202201071504V20200908&d1=19970202&type=type=column&h=300&w=600\" height=\"300\" width=\"600\" frameborder=\"0\" scrolling=\"no\"></iframe><br>source: <a href=\"https://tradingeconomics.com/united-states/labor-force-participation-rate\">tradingeconomics.com</a></div>\n\n\n\n<p class=\"has-text-align-center\"><strong>US Labor force participation over the years</strong></p>\n\n\n\n<p>This means that there will be many unfilled jobs. It could also mean that many businesses won’t survive without alternatives. If enough people aren’t willing to work in roles that were fully filled just a decade ago, companies need to compensate.</p>\n\n\n\n<p>Automation will become necessary.</p>\n\n\n\n<p>We’re already&nbsp;seeing&nbsp;much of this play out in pharmacies and grocery stores throughout the United States, where self-checkout machines, heavily software powered,&nbsp;have become more of a norm after the COVID-19 pandemic.&nbsp;It’s just the beginning. As more and more businesses embrace the digital world and with fewer people wanting to work in roles that earlier generations were comfortable working in,&nbsp;there’ll be a lot more need for software-powered automation.&nbsp;Whether companies use AI, RPA, or simple software automation, all of that is&nbsp;context-dependent.</p>\n\n\n\n<h2 id=\"final-word\">Final Word</h2>\n\n\n\n<p>So, in summary, to answer the question of whether jobs will be lost because of AI, the answer is—maybe. But what’s more certain is that the nature of certain jobs will <em>gradually</em> change. Instead of doing everything manually, we’ll slowly be assisted by AI-powered tools. We may also become the quality assurance managers and data generators for AI-powered systems. And as for the question of AI takeover? Well, that’s probably not even a question for this decade—not until we get a hopeful glimpse into the study of AI as it relates to <a href=\"https://www.quantamagazine.org/common-sense-comes-to-computers-20200430/\" target=\"_blank\" rel=\"noopener\">commonsense reasoning</a>.</p>\n\n\n\n<h1 id=\"references\">References:</h1>\n\n\n\n<ul><li><em>US Bureau of Labor Statistics Latest Numbers. Accessed January 28, 2022. <a href=\"https://www.bls.gov/\" target=\"_blank\" rel=\"noopener\">https://www.bls.gov/</a>.</em></li><li><em>Pavlus, John. 2020. “Common Sense Comes Closer to Computers.” Quanta Magazine. <a href=\"https://www.quantamagazine.org/common-sense-comes-to-computers-20200430/.\" target=\"_blank\" rel=\"noopener\">https://www.quantamagazine.org/common-sense-comes-to-computers-20200430/.</a></em></li><li><em>“Elon Musk claims AI will overtake humans ‘in less than five years.’” 2020. The Independent. <a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/news/elon-musk-artificial-intelligence-ai-singularity-a9640196.html\" target=\"_blank\" rel=\"noopener\">https://www.independent.co.uk/life-style/gadgets-and-tech/news/elon-musk-artificial-intelligence-ai-singularity-a9640196.html</a>.</em></li><li><em>3 Public opinion on AI governance | Artificial Intelligence: American Attitudes and Trends. Accessed January 28, 2022. <a href=\"https://governanceai.github.io/US-Public-Opinion-Report-Jan-2019/public-opinion-on-ai-governance.html\" target=\"_blank\" rel=\"noopener\">https://governanceai.github.io/US-Public-Opinion-Report-Jan-2019/public-opinion-on-ai-governance.html</a>.</em></li><li><em>Lacker, Kevin. 2020. “Giving GPT-3 a Turing Test.” Kevin Lacker’s blog. <a href=\"https://lacker.io/ai/2020/07/06/giving-gpt-3-a-turing-test.html\" target=\"_blank\" rel=\"noopener\">https://lacker.io/ai/2020/07/06/giving-gpt-3-a-turing-test.html</a>.</em></li></ul>\n\n\n\n<p><em>The original post can be found here: <a href=\"https://www.opinosis-analytics.com/blog/ai-job-loss/\" target=\"_blank\" rel=\"noopener\">Will AI Kill Your Job?</a></em></p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/will-ai-kill-your-job/feed/",
  "slash:comments": 0,
  "post-id": 6806
}