{
  "id": "https://bibleinoneyear.org/en/youth/167",
  "title": "Day 167: Following and Not Opposing God",
  "description": "Psalm 74:12–13a, 1 Kings 1:32–34, 2:1–3, Acts 10:30–47, 11:1–4,15,17.  Jesus was opposed: ‘They killed him by hanging him on a tree, but God raised him from the dead on the third day and caused him to be seen’ (10:39–40)  Contrastingly, the most wonderful privilege any human being can have is to be a follower of Jesus of Nazareth whom ‘God anointed… with the Holy Spirit and power’ (10:38)",
  "pubDate": "Thu, 16 Jun 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/167/",
  "itunes:duration": "15:21",
  "guid": "enyouth16062022-167",
  "length": 921.16,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 167: Following and Not Opposing God",
  "itunes:subtitle": "Psalm 74:12–13a, 1 Kings 1:32–34, 2:1–3, Acts 10:30–47, 11:1–4,15,17.  Jesus was opposed: ‘They killed him by hanging him on a tree, but God raised him from the dead on the third day and caused him to be seen’ (10:39–40)  Contrastingly, the most wonderful privilege any human being can have is to be a follower of Jesus of Nazareth whom ‘God anointed… with the Holy Spirit and power’ (10:38)",
  "itunes:summary": "I remember so well the time when Alpha started in the Catholic Church. Bishop Ambrose of Newcastle and Hexham heard what was happening with Alpha in some of the Anglican churches. He became interested and wanted to find out more. However, he did not want to let us know he was interested. So, he sent two Catholic priests to a London Alpha Conference in disguise! They went back to their parishes and started running Alpha, to great success.\nAs a result of that, Cardinal Hume invited us to hold a conference for Catholics at Westminster Cathedral. The place was packed out with 450 Catholic priests and laity. A few people were very critical of us doing a conference for Catholics. One or two churches even threatened to stop running Alpha if we went ahead with the conference. With hindsight it seems quite extraordinary that anybody could object, but at the time it was of some concern.\nOn the first night of the conference there was a great outpouring of the Holy Spirit and singing in tongues like we had never heard before. I went home that night and read the passage for today: ‘If God gave them the same gift as he gave us... who was I to think that I could oppose God?’ (Acts 11:17). It was the same Holy Spirit who was poured out on them as on us. I realised that if we did not continue to work together, I would be opposing God.\nThe most foolish thing that any human being can do is to oppose God. Jesus was opposed: ‘They killed him by hanging him on a tree, but God raised him from the dead on the third day and caused him to be seen’ (10:39–40). Contrastingly, the most wonderful privilege any human being can have is to be a follower of Jesus of Nazareth whom ‘God anointed… with the Holy Spirit and power’ (10:38).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 532
}