{
  "id": "tag:blogger.com,1999:blog-5245696872621940063.post-5116590346601173022",
  "published": "2022-10-21T15:03:00.001-07:00",
  "updated": "2022-10-28T06:13:42.424-07:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Google Workspace Updates Weekly Recap - October 21, 2022",
  "content": "<h3>New updates&nbsp;</h3><h3><span style=\"font-weight: normal;\"><i><span style=\"font-size: xx-small;\">Unless otherwise indicated, the features below are fully launched or in the process of rolling out (rollouts should take no more than 15 business days to complete), launching to both Rapid and Scheduled Release at the same time (if not, each stage of rollout should take no more than 15 business days to complete), and available to all Google Workspace and G Suite customers.&nbsp;</span></i><br /></span><div><br style=\"font-size: medium; font-weight: 400;\" /></div></h3><b>Initiate dialog workflows from the Chat app using message cards</b><div>Previously, the only way for developers and Chat app users to open dialogs was through slash commands. Now, we’re adding the ability to trigger the dialog by using buttons on an in-stream message card. This addition provides a much more convenient way to initiate workflows that involve dialog surfaces. | <a href=\"https://developers.google.com/chat/how-tos/dialogs#apps-script\">Learn more</a>.&nbsp;</div><div><br /></div><div><br /></div><div><b>Add shared drives to specific organizational units, now generally available&nbsp;</b></div><div>Earlier this year, we launched a beta that allows admins to place shared drives into sub organizational units (OUs). Doing so enables admins to configure sharing policies, data regions, access management, and more at a granular level. We’re excited to announce this is now generally available. | Available to Google Workspace Essentials, Business Standard, Business Plus, Enterprise Standard, Enterprise Plus, Education Fundamentals, Education Standard, Education Plus, the Teaching and Learning Upgrade, and Nonprofits customers only. | <a href=\"https://workspaceupdates.googleblog.com/2022/05/shared-drives-in-organizational-units-open-beta.html\">Learn more</a>.&nbsp;</div><div><br /></div><div><br /></div><div><b>See when colleagues are out of the office on Android&nbsp;</b></div><div>When viewing a person information card in Google Voice, Calendar, Gmail, and Chat on Android, you are now able to see your colleagues’ out-of-office status via an out-of-office banner. The banner also shows when the person is expected to return.&nbsp;</div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNpI6lEsXGNejd84XHHv4-sXsXxqwjOGHlo_1r_owiWzmpqpR0z_NQjeb4QUHbaSOg_wiNXPcoJmDO5A4fDT0fX4VEiq8P8kDZ8XcEhu_PPs7Kd87o2eOdi7DpTv_Hm2aG8xXjg8-M-Co4BqYcFNPzVSDExJ5XH3bE6LH4NyBI8UxOwWkp0g6y9MuA/s1784/People_Sheet_OOO.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1784\" data-original-width=\"824\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNpI6lEsXGNejd84XHHv4-sXsXxqwjOGHlo_1r_owiWzmpqpR0z_NQjeb4QUHbaSOg_wiNXPcoJmDO5A4fDT0fX4VEiq8P8kDZ8XcEhu_PPs7Kd87o2eOdi7DpTv_Hm2aG8xXjg8-M-Co4BqYcFNPzVSDExJ5XH3bE6LH4NyBI8UxOwWkp0g6y9MuA/w296-h640/People_Sheet_OOO.png\" width=\"296\" /></a></div><div><b>More ways to work with, display, and organize your content across Google Workspace on Android</b></div><div><a href=\"https://workspaceupdates.googleblog.com/2022/07/improving-workspace-experience-on-large-screen-android-devices.html\">In continuing our mission to provide a top-class user experience on large screen devices</a>, we’re releasing the following updates:&nbsp;</div><div><ul style=\"text-align: left;\"><li><b>Link previews in Google Sheets: </b>We’re improving the Android experience by adding link previews to Sheets. This feature is already available on the web and allows you to get context from linked content without bouncing between apps and screens. | Gradual rollout (up to 15 days for feature visibility) starting on October 24, 2022. | <a href=\"https://workspaceupdates.googleblog.com/2020/08/docs-mobile-link-previews-smart-compose.html\">Learn more</a>.&nbsp;</li></ul><ul style=\"text-align: left;\"><li><b>Google Sheets drag &amp; drop improvements:</b> We’ve enhanced drag &amp; drop support for the Sheets Android app by adding the ability to drag, copy, and share charts and in-cell images.    </li></ul></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg8NvOk4kbWpoAfn2z5WIy1bOAgcvFvDq1HKbC-XdZ67wIh-CaBNNacq8b8VcU3757hhDcvdJaqqNvytSqcU1HgoTaodSW4uoG2_G146vmRc_42tdut1CTgYsrqE3by_Ynw-FWhlfM86cKlwEiB1sC3ArF5KigBs1nDfBsmrSze29KC2NsYNPvM6NDr/s512/sheets-drag-drop-demo.gif\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"320\" data-original-width=\"512\" height=\"374\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg8NvOk4kbWpoAfn2z5WIy1bOAgcvFvDq1HKbC-XdZ67wIh-CaBNNacq8b8VcU3757hhDcvdJaqqNvytSqcU1HgoTaodSW4uoG2_G146vmRc_42tdut1CTgYsrqE3by_Ynw-FWhlfM86cKlwEiB1sC3ArF5KigBs1nDfBsmrSze29KC2NsYNPvM6NDr/w598-h374/sheets-drag-drop-demo.gif\" width=\"598\" /></a></div><div><br /></div><div><br /></div><h3>Previous announcements</h3><h3><div style=\"font-size: medium; font-weight: 400;\"><i><span style=\"font-size: xx-small;\"><br /></span></i></div><div style=\"font-size: medium; font-weight: 400;\"><i><span style=\"font-size: xx-small;\">The announcements below were published on the Workspace Updates blog earlier this week. Please refer to the original blog posts for complete details.</span></i></div></h3><br /><b>Workspace Admins are now notified when Label editing is restricted by set rules</b><br />We’ve added a new Label Manager UI feature showing which rules a label is used within. Specifically, a message identifying and linking the label to the exact rule(s) will now appear in the <a href=\"https://support.google.com/a/answer/9292382#zippy=%2Cmanage-labels-for-your-organization\">Label Manager</a> to ensure admins understand why label modification is disabled. | Available to Google Workspace Essentials, Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, Enterprise Plus, Education Plus, Education Standard customers only. | <a href=\"http://workspaceupdates.googleblog.com/2022/10/google-drive-label-locking.html\">Learn more</a>.<br /><div><br /></div><div><br /><b>Encouraging Working Location coverage across organizations</b>&nbsp;</div><div>Admins now have access to a new tool that aims to drive Working Location usage across their organizations. This setting adds a customizable banner to users’ Calendar either encouraging or requiring them to set up their working location. | Available to Google Workspace Business Plus, Enterprise Standard, Enterprise Plus, Education Fundamentals, Education Plus, Education Standard, and the Teaching and Learning Upgrade, as well as legacy G Suite Business customers only. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/09/admin-setting-working-location-coverage.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Enhanced menus in Google Slides and Drawings improves findability of key features</b>&nbsp;</div><div>We’re updating the menus in Google Slides and Google Drawings to make it easier to locate the most commonly-used features. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/enhanced-menus-google-slides-drawings%20.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Preview or download client-side encrypted files with Google Drive on Android and iOS&nbsp;</b></div><div>Admins for select Google Workspace editions can update their client-side encryption configurations to include Drive Android and iOS. When enabled, users can preview or download client-side encrypted files. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/preview-download-client-side-encrypted-files-drive-android-ios.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Split table cells in Google Docs to better organize information</b></div><div>You can now split table cells into a desired number of rows and columns in Google Docs. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/split-table-cells-in-google-docs.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Updates to storage management tools in the Admin console&nbsp;</b></div><div>To further enhance the&nbsp;<a href=\"https://wsupdates.page.link/admstrg\">set of tools for managing storage</a>, we’re rolling out a new Storage Admin role. The ability to apply storage limits to shared drives and a new column called Shared drive ID in the Manage Shared Drives page are coming soon. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/storage-management-updates.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Hold separate conversations in Google Chat spaces with in-line threading</b>&nbsp;</div><div>You can now reply directly to any message in new spaces and some existing spaces. This creates a separate in-line thread where smaller groups of people can continue a conversation on a specific topic. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/in-line-threading-in-Chat-spaces.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Conversation summaries in Google Chat help you stay on top of messages in Spaces&nbsp;</b></div><div>We've introduced conversation summaries in Google Chat on web, which provide a helpful digest of conversations in a space, allowing you to quickly catch-up on unread messages and navigate to the most relevant threads. | Available to Google Workspace Essentials, Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, Enterprise Plus, Education Plus, Education Standard, the Teaching and Learning Upgrade, Frontline, and Nonprofits customers only. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/conversation-summaries-in-google-chat.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Present Google Slides directly in Google Meet&nbsp;</b></div><div>You will now be able to control your Slides and engage with your audience all in one screen by presenting Slides from Meet. This updated experience can help you present with greater confidence and ultimately make digital interactions feel more like when you’re physically together. | Available to Available to Google Workspace Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, Education Standard, Enterprise Plus, Education Plus, the Teaching and Learning Upgrade, and Nonprofits customers only. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/present-google-slides-in-google-meet.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Easily find Google Workspace Marketplace apps with enhanced search filters&nbsp;</b></div><div>We’ve introduced enhanced search filters in the Google Workspace Marketplace to help you quickly find relevant apps. These new filters allow you to search by category, price, rating whether it’s a private app for the organization, if it works with other apps, and more. | Available to Google Workspace Business Starter, Business Standard, Business Plus, Enterprise Standard, Enterprise Plus, Education Fundamentals, Education Plus, and Nonprofits, as well as legacy G Suite Basic and Business customers only. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/google-workspace-marketplace-enhanced-search-filters.html\">Learn more</a>.</div><div><br /></div><div><br /><b>Improving the Google Chat and Gmail search experience on web and mobile&nbsp;</b></div><div>In order to help you find more accurate and customized search suggestions and results, we’ve introduced three features that improve the Google Chat and Gmail search experience on web and mobile: Search suggestions, Gmail labels, and Related results. |&nbsp;<a href=\"http://workspaceupdates.googleblog.com/2022/10/improving-google-google-chat-and-gmail-search-experience.html\">Learn more.</a><br /><br /><br /><br /><i><span style=\"font-size: xx-small;\">For a recap of announcements in the past six months, check out&nbsp;<a href=\"https://support.google.com/a/table/7314896\">What’s new in Google Workspace (recent releases)</a>.</span></i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Unknown",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}