{
  "title": "Warren Burt (Ritual Community Music MMW)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Ritual Community Music",
  "itunes:summary": "Folk, Noise, Electronics, Improvisation – how can radical music help us manifest new possibilities for thinking and imagine new ways of organising community through ritual behaviours, actions and languages? Across two nights, Liquid Architecture and Melbourne Music Week present a program of electronic music genealogies, featuring artists whose works span the 1970s to today and represent multiple generations of Melbourne’s experimental scene.\n\nWarren Burt is a composer, performer, writer, and instrument builder. He came to Australia in 1975 to found the Music Department at La Trobe University and subsequently assisted in the founding of the Clifton Hill Community Music Centre in 1976. Ahead of his performance for Liquid Architecture and Melbourne Music Week Warren discusses  how he uses software and algorithms to build instruments and collaborative compositions, his work within community music groups, and his curiosity driven approach to exploring sound. \n\nhttps://liquidarchitecture.org.au/events/liquid-architecture-x-melbourne-music-week\n\nRitual Community Music \n10 - 11 December 2021\nMiscellania, Melbourne\nPresented by Liquid Architecture and MMW\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month.\n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/warren-burt-ritual-community-music-mmw",
  "pubDate": "Tue, 14 Dec 2021 08:00:00 +1100",
  "itunes:duration": "17:04",
  "itunes:explicit": "no"
}