{
  "title": "AI in Manufacturing: 4 Real-World Examples",
  "link": "https://kavita-ganesan.com/ai-in-manufacturing-examples/",
  "comments": "https://kavita-ganesan.com/ai-in-manufacturing-examples/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Fri, 08 Oct 2021 20:30:09 +0000",
  "category": [
    "AI Strategy",
    "AI Use Cases",
    "Business AI",
    "text summarization"
  ],
  "guid": "https://kavita-ganesan.com/?p=6175",
  "description": "Explore 4 real-world AI in manufacturing examples. From defect detection to predictive maintenance in beverage manufacturing, silicone wafer production and automotive production.",
  "content:encoded": "<p>Human error causes <a href=\"https://www.businesswire.com/news/home/20171106006370/en/Human-Error-Common-Unplanned-Downtime-Manufacturing-Sector\">23% of unplanned downtime</a> in manufacturing. As you may know, unplanned downtime in manufacturing is a major cause of <a href=\"https://www2.deloitte.com/content/dam/Deloitte/us/Documents/process-and-operations/us-cons-predictive-maintenance.pdf\">lost revenues</a>.</p>\n<p>Can AI help reduce human errors in manufacturing? The quick answer is yes!</p>\n<p>AI can help mimic human decision-making on specific tasks. For example, on analyzing the image of a traffic stop, AI systems can be trained to detect the presence of objects such as a person, a stop sign, or a road bump. Given an image, they can also be trained to find minuscule abnormalities—ones that even humans can miss.</p>\n<p>But, unlike humans, AI systems don’t get bored, tired and can work at optimal levels 24/7 hours of the day, reducing the likelihood of errors, improving workflow productivity, and spotting the minuscule details that can be missed by humans.</p>\n<p>With the vast amount of data generated during manufacturing processes, more and more business leaders across the globe are harnessing the power of AI to eliminate manual tasks and errors in production. Here is a glimpse of how AI is being used in manufacturing today with four real-world AI in manufacturing examples.</p>\n<h2>4 Real-World Uses Cases of AI in Manufacturing</h2>\n<h3>#1: Streamlining Quality Control in Beverage Production</h3>\n<p>Suntory PepsiCo, a beverage production company operates five factories in Vietnam. The soda factories struggled to scan printed manufacturing and expiration date code labels accurately. That’s because sometimes, the code was attached before the surface was completely dry, resulting in smudges. Such mistakes led to production delays and expensive stoppages.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-14195\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/09/matrox-imaging_production-line-scan-mfd-exp-codes_cr.jpeg\" alt=\"AI in manufacturing example\" width=\"665\" height=\"375\"><figcaption>Scanning for code labels in one of Suntory’s factories. Source: <a href=\"https://www.matrox.com/en/imaging/media/case-studies/suntory-pepsico-bottles-perfection-improving-identification-capabilities\">matrox.com</a></figcaption></figure>\n</div>\n<p>To avoid such problems, Suntory PepsiCo asked its integrator Pacific Hi-Tech, and the Matrox Imaging <a href=\"https://www.insight.tech/content/how-machine-vision-puts-the-focus-on-quality-control#main-content\">“Machine Vision” solution</a> was born.</p>\n<p>The AI-powered solution, integrated with cameras, reads code label images and instantly determines if they are attached to the product, that the codes are correct, and if the label is unreadable, smudged, obscured, or absent entirely. If a label is missing or illegible, an ejector removes the <em>offending</em> product without stopping the assembly line. By swiftly reading poorly positioned code labels and removing the products from the assembly line, the Machine Vision System has helped Suntory PepsiCo streamline its quality control process.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img decoding=\"async\" src=\"https://www.matrox.com/sites/default/files/suntory-pepsico-varieties-packaging-mfd-exp-code-single.png\" alt=\"\"><figcaption>Examples of attached code labels that pass on a single production line. Notice that all code here labels are readable. Source: <a href=\"https://www.matrox.com/en/imaging/media/case-studies/suntory-pepsico-bottles-perfection-improving-identification-capabilities\">matrox.com</a></figcaption></figure>\n</div>\n<p>In this scenario, it would be much slower for a human to examine each product and determine if code labels are correctly attached, readable and then determine the next course of action. Machines in combination with AI can do this work many times faster and with fewer errors.</p>\n<h3>#2: BMW Uses AI To Keep Production In Overdrive</h3>\n<p>BMWs are known to be sleek and fast automobiles, and now thanks to AI, they have the production capabilities to match their design. <a href=\"https://iot-automotive.news/bmw-group-artificial-intelligence/\">BMW Group</a> utilizes AI in manufacturing solutions to perform monotonous tasks that used to require human intervention, including quality control, logistics coordination, and virtual layout planning.</p>\n<p>Specifically, AI-based applications can replace camera portals with automated image recognition systems, view images of auto production, and compare them to a database of hundreds of other photos. With automated image recognition, <em>production deviations</em> are detected in real-time and corrected before they pose a more significant problem. For example, at a BMW manufacturing plant in Germany, AI is used to determine if the correct model designation is attached to a vehicle. By seeing hundreds upon hundreds of images of model designation, the AI has learned to recognize permitted combinations with non-permitted ones.</p>\n<div class=\"wp-block-jetpack-tiled-gallery aligncenter is-style-columns\">\n<div class=\"tiled-gallery__gallery\">\n<div class=\"tiled-gallery__row\">\n<div class=\"tiled-gallery__col\" style=\"flex-basis: 54.84134%;\">\n<figure class=\"tiled-gallery__item\"><img decoding=\"async\" src=\"https://i2.wp.com/www.opinosis-analytics.com/wp-content/uploads/2021/09/ai-learns-from-hundreds-of-model-designation-examples-1024x432.png?ssl=1\" alt=\"\" data-height=\"1038\" data-id=\"14251\" data-link=\"https://www.opinosis-analytics.com/?attachment_id=14251\" data-url=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/09/ai-learns-from-hundreds-of-model-designation-examples-1024x432.png\" data-width=\"2460\" data-amp-layout=\"responsive\"></figure>\n</div>\n<div class=\"tiled-gallery__col\" style=\"flex-basis: 45.15866%;\">\n<figure class=\"tiled-gallery__item\"><img decoding=\"async\" src=\"https://i1.wp.com/www.opinosis-analytics.com/wp-content/uploads/2021/09/Model-Designation-Recognition-AI-in-Manufacturing-1024x525.png?ssl=1\" alt=\"\" data-height=\"1274\" data-id=\"14250\" data-link=\"https://www.opinosis-analytics.com/?attachment_id=14250\" data-url=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/09/Model-Designation-Recognition-AI-in-Manufacturing-1024x525.png\" data-width=\"2484\" data-amp-layout=\"responsive\"></figure>\n</div>\n</div>\n</div>\n</div>\n<p class=\"has-text-align-center\"><em>An AI tool learns permitted model designations upon seeing hundreds of model designation images (left). The AI tool can then detect if the model designation on a new car is correct given what it already knows (right). Source: <a href=\"https://www.youtube.com/watch?v=Fo6pWIi-Ixo\">https://www.youtube.com/watch?v=Fo6pWIi-Ixo</a></em></p>\n<p>The AI imaging system not only detects defects during manufacturing but can also see pseudo-defects. For example, BMW uses flat sheet metal parts for the car body. Dust particles or oil residues found on the metal can be labeled as cracks with old quality control systems when they are, in fact, benign issues. With the new AI application, pseudo-defects no longer pose a problem. With so many uses of AI in BMW’s manufacturing line, they’re able to maintain their quality standards while freeing employees from repetitive and error-prone tasks.</p>\n<h3>#3: ExtractAI Gets To The Root Cause Of Microchip Defects</h3>\n<p><a href=\"https://news.samsung.com/global/eight-major-steps-to-semiconductor-fabrication-part-1-creating-the-wafer\">Silicon wafers</a> are a type of semiconductor used in the production of microchips that go into the electronic gadgets we use daily such as cell phones, computers, televisions, and more.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-14261\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/09/ai_in_manufacturing_silicone_wafer_example.jpeg\" alt=\"using AI in silicone wafer manufacturing\" width=\"600\" height=\"400\"><figcaption>Example of Silicon Wafer</figcaption></figure>\n</div>\n<p>These chips can be as small as 10 nanometers, and thus, detecting errors in production requires special tools like electron microscopes, which are accurate but slow. Though an optical scan can find millions of problem areas on silicon wafers, examining further with an electron microscope takes multiple days only to find a small percentage of defects that will cause chip malfunction.&nbsp;In manufacturing terms, these are called “killer” defects.</p>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img decoding=\"async\" loading=\"lazy\" class=\"wp-image-14263\" src=\"https://www.opinosis-analytics.com/wp-content/uploads/2021/09/electron-microscope.jpeg\" alt=\"Example of electron microscope in action\" width=\"480\" height=\"270\"><figcaption>An electron microscope in action</figcaption></figure>\n</div>\n<p>ExtractAI, a new AI-based microchip detection technology from Applied Materials uses AI to spot the killer defects in microchips. <a href=\"https://www.reuters.com/article/us-applied-tech/new-applied-materials-tools-use-ai-to-catch-mistakes-on-chips-idUSKBN2B81JO\">ExtractAI</a> uses a new optical scanner to scan silicon wafers for problem areas, and then an electron microscope zooms in for a closer look.</p>\n<p>High-end optical scanners generate millions of noisy signals. In the midst of those noisy signals also exists defects and sifting out actual defects from the noise is an ongoing problem. The good news is that Applied Material’s AI can differentiate <em>killer </em>defects from noise. The ExtractAI technology is also incredibly efficient; it only needs to check about 0.001% of the samples to characterize all of the potential defects. This equates to about an hour of examination versus the days it takes with the old method.</p>\n<h3>#4: Predictive Maintenance Energized</h3>\n<p>A leading European energy company wanted to take its manufacturing process from reactive to proactive with predictive maintenance. The reliability of systems in the plant is critical for many reasons, from being able to manage maintenance costs to better managing safety and environmental concerns.</p>\n<p>Driven by these needs, the energy firm implemented its Digital Predictive Maintenance Center, according to a case study by <a href=\"https://www.aspentech.com/en/resources/case-studies/energy-company-drives-innovation-in-predictive-maintenance-via-digital-transformation-program\">AspenTech</a>. The Digital Predictive Maintenance Center organizes data so reliability engineers can rapidly assess and correct reliability issues proactively. The center gives staff at the plant an early warning of when an asset failure will occur, how it will happen, and what to do about it. After deploying the solution on over 50 significant assets in a refinery powered by wind farms, the energy company avoided between<strong> €4M </strong>and<strong> €5M </strong>in total losses due to maintenance costs and lost production opportunities in the refinery.</p>\n<h2>Final Word</h2>\n<p>As we’ve seen in the examples in this article, there are many innovative uses ofAI in manufacturing—all of which can solve critical business challenges. Manufacturing facilities worldwide, such as Suntory PepsiCo, BMW, and Applied Materials use AI to reduce the workload on tedious tasks such as defect detection that were once performed by employees manually. This has the greater benefit of reducing costs, limiting human errors, and freeing humans from repetitive and monotonous work.</p>\n<p>But we’ve barely scratched the surface.</p>\n<p>Most of the examples you’ve seen so far relate to making manufacturing lines more efficient. However, within manufacturing itself, there is a significant potential for using AI in other tasks outside production lines. For example, helping managers get to the root cause of defects. This requires a step-by-step investigation into the problems that resulted in the defect. With the help of AI, you can connect incidents, automatically surface causes, and assist managers in quickly getting to the root causes. This will allow them to focus on addressing problems rather than sifting through documentation.</p>\n<p>As the AI in manufacturing examples above prove, AI is no longer an abstract sci-fi dream but an effective business tool with a bright future in manufacturing.</p>\n<p>The post <a href=\"https://www.opinosis-analytics.com/blog/ai-in-manufacturing-examples\" rel=\"nofollow\">AI in Manufacturing: 4 Real-World Examples</a> appeared first on <a href=\"https://www.opinosis-analytics.com\" rel=\"nofollow\">Opinosis Analytics</a>.</p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/ai-in-manufacturing-examples/feed/",
  "slash:comments": 0,
  "post-id": 6175
}