{
  "title": "Wrongful Convictions, Exoneration, and Criminal Justice with Samuel Gross",
  "pubDate": "Fri, 16 Dec 2016 19:43:23 +0000",
  "guid": "3482d12288f7a7b63b17bc04bff48e34",
  "link": "https://economicsdetective.libsyn.com/wrongful-convictions-exoneration-and-criminal-justice-with-samuel-gross",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with Samuel Gross.</p> <hr /> <p><strong>Petersen:</strong> You're listening to Economics Detective Radio. My guest today is <a href= \"https://www.law.umich.edu/FacultyBio/Pages/FacultyBio.aspx?FacID=srgross\" target=\"_blank\">Samuel Gross</a> of the University of Michigan Law School. Sam, welcome to Economics Detective Radio.</p> <p><strong>Gross:</strong> Great to be here.</p> <p><strong>Petersen:</strong> So our topic for today is criminal justice, in particular, we're going to be looking at the issue of wrongful conviction. Dr. Gross was part of the establishment of <a href= \"http://www.law.umich.edu/special/exoneration/Pages/about.aspx\" target=\"_blank\">the National Registry of Exonerations</a> which has provided valuable data in this area. So let's start by talking about the registry. What is it? How was it developed? And what was your part in it?</p> <p><strong>Gross:</strong> I'm the founder of the registry. It was created because after doing work on false convictions and exonerations for half a dozen years it became clear that the only way to get any sort of systematic information on exonerations that have occurred in the United States would be to put together the wherewithal to collect that information directly because nobody else was doing it. There's no official system for gathering information on exonerations or for that matter a single legal definition of what is an exoneration. And from there this project just took off on its own and became what's now a lasting institution that's in the process of handing over to other people to run.</p> <p><strong>Petersen:</strong> Okay, so let's talk about the how an exoneration is defined in the registry. It's a case where someone has been convicted and then later that conviction has been overturned and presumably not just on a technicality but because the person was actually innocent---somehow managed to prove their innocence. Is that correct?</p> <p><strong>Gross:</strong> Something like that. The thing that we're interested in studying is false convictions. Convictions of people who are actually innocent. The problem is there's no way to know when that's happened directly because in cases where by assumption people have made errors, the juries and prosecutors and judges who considered the cases have made errors in deciding who is guilty and who is innocent. It would be foolhardy and presumptuous and not particularly accurate for us to believe that we're going to be better at deciding after the facts which cases involve those sorts of errors and which don't.</p> <p>So, what we've done instead---instead of trying to make any judgment of our own about guilt or innocence based on whatever information we can collect from second or third or fourth hand sources---what we do instead is to consider cases, to classify cases of exonerations if they meet the following criteria: First, the defendant has to have been convicted of a crime, not just charged, the conviction has to be completely removed. That is, at the end of the process the defendant has to have no legal consequences from the original conviction which means the conviction was entirely overturned by dismissal, or by a pardon, or in a small number of cases---or by the acquittal over retrial---or in a small number of cases by one of the few procedures that are available for people who are exonerated posthumously, after they're dead. And then in addition, the process that led to that result has to include substantial evidence of innocence that was not available at the time of the original conviction.</p> <p>If the case meets those criteria we include, if it doesn't we don't. Our belief is---and it's a hypothesis---is that this produces a conservative classification for actual innocence, for errors in determining guilt at trial. We know of quite a few cases of people who are very likely to be innocent who are not included by these criteria in particular. Quite a few cases of people who reach that result having the conviction entirely removed from the record without the production of new evidence of innocence. For example, cases in which the conviction was reversed and then they are dismissed want to appeal because there was insufficient evidence to convict at trial unless some other evidence comes up before the conviction is reversed don't generally count.</p> <p>And our hypothesis is that we include a very small number of cases of guilty people who did meet these criteria. Although there are no doubt some, it's possible, but the process that it takes to get convictions reversed and dismissed in this manner in the United States is very difficult and as a result as far as we can tell there are not very many misclassifications of people who did prison based on the underlying crimes but meet the criteria for exoneration. That is the best we can do.</p> <p><strong>Petersen:</strong> One thing I learned from your research is that the average time it takes a wrongfully convicted person to be exonerated is 10.1 years. So it seems like the system is stacked against it.</p> <p><strong>Gross:</strong> It changes depending on the mix of exonerations we have. In the moment it's probably gone down a little bit, but that's about right. Ten years is close to the average</p> <p><strong>Petersen:</strong> Looking through the registry I noticed some interesting patterns that I wonder if you'd like to comment on. So for instance, I was surprised by how few of these exonerations were about DNA evidence. It seems like it's actually more common for a witness to recant their testimony or for other non-DNA things, but I guess looking at media or just my own intuition I would have thought that DNA would be the big factor in a lot of these.</p> <p><strong>Gross:</strong> And that's a very common misconception. I think most Americans think that exoneration is the second word of a two-word phrase that begins with the letters DNA. And that's of course, as you know, not true. DNA exonerations have always been a minority and in the past 10-15 years, they are an increasingly small minority.</p> <p>The number of DNA exonerations has been relatively steady over the past 10 years, about 20 a year, and the number of not DNA exonerations has been going up rapidly. The basic reason behind this is the DNA, which can be very telling and provide extraordinary strong evidence of guilt or of innocence, is only valuable in a small range of cases. It depends on having biological trace evidence that identifies a particular person as the person who committed a crime.</p> <p>That's relatively straightforward in the case of sexual assaults---rapes in particular---where the trace evidence that's left is very hard to explain except as a consequence of the crime. So if you recover semen from the body of a rape victim and it's identified by DNA as coming from a particular person and that person is not a consensual sexual partner of the victim, then you have the rapist. Assuming that rape really did occur. But if it's a question of identity, which is the case in most of the rape exonerations we know about, that tells you both who the person is if you can identify the profile---and in the case of exonerations who it is not---because DNA comes asymptotically close to being a unique identifier in that type of DNA evidence.</p> <p>But that's rape cases. Some other violent crimes produce DNA evidence that is as valuable or nearly as valuable. Usually murder cases in which there's blood evidence sometimes, other types of biological trace evidence, perspiration, epithelial cells from the skin and other bodily fluids and that can identify people under circumstances where you can determine from other evidence that the biological sample that was retrieved could only have come from the person who committed the crime.</p> <p>But most crimes don't have that. One of the things that's clear in the registry, for example, is that there are almost certainly many many cases of false convictions in robberies that are not exonerated because they don't have the type of evidence that's available in rape cases. And in many rape cases there aren't either, but both robberies and rape cases that resolved in exonerations overwhelmingly are cases in which the suspect was misidentified by the victim or by sometimes more than one victim. There are three to five times as many robbery cases of this sort as rape cases---maybe more than that---and they are typically cases in which errors are more likely because the victims may only get a sidelong glance at the robber whereas rape cases almost by definition require much more close contact with the perpetrator.</p> <p>Nonetheless, despite the fact of the numbers suggest we have many more exonerations in robbery cases. Rape exonerations outnumber robbery exonerations by about 3-5:1. And the reason of that is because the rape cases can be exonerated by DNA but the robbery cases can't because you don't have DNA for the type of conduct that's involved in robberies. You don't have DNA that you can retrieve from threats that are made or guns that are waved or even guns that are used. And as result, those cases are not exonerated at all. Now given the huge disproportion between the cases in which DNA is valuable, and cases in which DNA is never going to play any role, it's not surprising that the great majority of exonerations don't involve DNA. But the availability of DNA in the small number of cases---comparatively small number of cases---in which it is valuable does make those cases ones in which the possibility of correcting a terrible mistake is considerably harder.</p> <p><strong>Petersen:</strong> So, you mentioned the increase in recent years in non-DNA exonerations. I was looking at the data and in 2011 there were only 73 exonerations in the Registry, but in 2015 it had more than doubled to 157. So, I wonder what's changed in recent years to make that number increase so much?</p> <p><strong>Gross:</strong> It is a general change and then there are particular---couple particular strands that stand out. The general change is that the resources that are devoted to reinvestigating cases where defendants were convicted and there are now doubts about the accuracy of the convictions are increasing year by year. And the willingness of everybody involved, the criminal defense attorneys but also more importantly prosecutors, police officers, and judges to consider the possibility that someone who was convicted is innocent has grown greatly.</p> <p>They have come to recognize that mistakes happen and the more exonerations occur the more people realize that this isn't just a once-in-a-lifetime event. And that's I think the force that is behind all of the specific changes that occur.</p> <p>The two strands that have made the most difference in these numbers are---in the last 10 years, I think---are, in the past four or five a proliferation of Conviction Integrity Units across the country. These are specialized units within prosecutors' offices that focus on issues having to do with erroneous convictions. And for the most part, the ones that are most effective, look at cases within the jurisdiction in which there is a possibility that the wrong person is convicted and they work to re-investigate and sometimes exonerate the people involved. They have contributed an increasing proportion of the cases that we see. And to the extent of this becomes more widespread they might someday be a majority of all exonerations.</p> <p>There are something like 25,000 local prosecutorial offices in the United States. I don't have the exact count now, I will in several weeks but my guess is that by now we have something like 30 Conviction Integrity Units around the country which represents a larger proportion of the population than that would suggest because those are some of the most populous counties, but it's still a minority of all cases where the local prosecutor has any organized interest in the issue. And then there is a particular pattern that came up in one county---Harris County, Texas, where Houston is located---that contributed, I think it was 40 some exonerations last year and 40 some so far this year and 30 several years before that. And that's a back-log of cases of defendants in Harris County who pled guilty to possession of drugs and then after they pled guilty the Houston police criminal lab tested the substances they received from them to determine whether they, in fact, contained drugs and found that the material that was the basis for the conviction included no controlled substances whatever.</p> <p>We ran into a number of cases as that over the years but starting in 2014 the attorney who runs the Conviction Integrity Unit in the Harris County district attorney's office noticed there was a whole bunch of these cases and they were being handled very haphazardly and put together a program to identify them all, to clear the backlog and to set up procedures for getting the defendants exonerated and they're still working through that. The thing that's interesting about those cases is that, that procedure testing drugs that were seized from people, the supposed drugs that were seized from suspects after the defendants have already pled guilty to something that as far as we know doesn't happen any place else in the country or didn't---now I think a couple of other jurisdictions have begun to do it at least occasionally---but it's just that there may out there be thousands of cases a year of defendants who pled guilty to possession of drugs when in fact they were not in possession of any illegal drugs. Although they could be exonerated by quite a simple process, it doesn't take an elaborate investigation just running the drugs through the police lab, which could be done. Except in Harris County, until the last year or two nobody's ever done that.</p> <p><strong>Petersen:</strong> That's so strange. Were they caught with a little baggie of oregano or powdered sugar and just everyone assumed it was drugs?</p> <p><strong>Gross:</strong> It's a whole lot of different things but it's a good question. In some cases, they were arrested for possession of pills that were identified by the police officer as likely or actually being a controlled substance---often Xanax---and then tested by the lab and found not to be Xanax. Sometimes ibuprofen, sometimes some other over-the-counter medications.</p> <p>In some cases, they had the smallest amount of white powder. One woman who ended up in the paper had white powder on her face because she had the habit of eating flour, which some people do, eating flour mixed with water and was left with some white powder around her mouth. In cases like that, where small amounts of white powder or something else were tested, they were subjected to field tests for drugs which have become notorious in the past year or two because they are so unreliable.</p> <p>Field tests for drugs are not admissible evidence in court to show that the substance involved was a controlled substance but they're considered good enough to perform the arrest. Then what happens is the defendants who were arrested on these charges show up in court three days later and if they can't make bail, which seems to be true in basically all the cases that we know about---perhaps with a few exceptions---then they're given a choice that amounts to this: Plead guilty today and you'll get some perhaps suspended sentence and go home immediately, or another week and you'll be home in three days, or something like that, or a short-end by Harris County standards where drugs sentences are three weeks or two months or something like that. Or plead not guilty and then you'll be held in jail because you can't make bail for months, after which you'll go to trial and if you are convicted, and obviously you might be because some cop and some test said you were in possession of drugs, then you'll get perhaps years in state prison.</p> <p>No doubt many people refuse to plead guilty in that situation because they're innocent. But some who are innocent do plead guilty and those are the ones we find out about.</p> <p><strong>Petersen:</strong> Right. So that process of being prosecuted, even when you're innocent, can sometimes be more costly than simply pleading guilty. Especially in the small cases.</p> <p><strong>Gross:</strong> If it's a low-level charge and you are held in pretrial detention, the process can be much more costly than a conviction after trial. In Harris County you could spend six months in jail or longer. So, I've heard stories of people who spend a year or more in jail waiting for trial. If you can make bail, then that's still a heavy cost. Having a trial hanging over your head and having to come back to court repeatedly is not a walk in the park. But if you're held in jail for that period it's an extraordinary cost. It obviously disrupts your life and it may tear your family apart, you would lose your job, you may not be able to get other employment, and so on.</p> <p><strong>Petersen:</strong> So one of the things we've learned in recent years is just how easy it is for police to get people to falsely confess, or to falsely accuse someone else of a crime. In fact, I think the number was 12% of the cases in the registry were false confessions and I believe it was a majority involved witness making false accusation or committing some kind of perjury. Why do people confess to things they didn't do, first?</p> <p><strong>Gross:</strong> Well, those are two different issues false confessions and perjury or other false accusations. Although there is sometimes an overlap. I don't think I agree with the statement that it's easy to get false confessions. In some cases, no doubt it is, but the false confessions that we know about are overwhelmingly in murder cases. And as far as we can know---but the information we have is not that good---they appear to be the result of long interrogations. Long would be the ones that really stand out, sometimes they take place over days, two, three days or longer with the defendant sometimes being questioned in relays by different officers.</p> <p>But even interrogations of three, four hours or five hours---which is eternity if you're being questioned unrelentingly by police officers---are fairly uncommon. This costs the police quite a bit. It involves usually more than one officer over that period of time. Certainly one officer taking off that whole period of time and a fair amount of preparation. So it's not done very much, except in homicides, and it does happen in other cases but I think two-thirds or so of the false confessions that we know about are homicides cases, maybe more than that.</p> <p>What's surprising to many people---and those working in the area have gotten used to it, but still somehow surprising---is not that it's easy to get people to falsely confess, but that people will falsely confess to murders that they didn't commit, that they had nothing to do with. It seems like such an unbelievably strange and self-destructive thing to do but it happens and it happens time and time again.</p> <p>And what we see in these cases and what other researchers have shown, is that it's much more likely if the suspect is in one of two general very vulnerable categories: if the suspect is a teenager, or the suspect has some type of mental disability, is intellectually disabled and mentally ill. Those two groups are, as far as we can tell, much more likely to falsely confess than other people who are subject to these interrogations. They are very far less likely to be able to resist the pressures, they're more likely to respond to authorities or more likely to believe the promises and threats that are implied if not directly made in the process of interrogation. They're more likely to become hopeless, and they're more likely to---much more likely---to not grasp the seriousness of what's going on.</p> <p>One of the most common things that people hear when they talk to a suspect who falsely confessed later on and ask why did you do it is \"I confessed because I wanted to go home. I just told them what they wanted to hear so they'd let me go.\" Which of course does not happen or \"I confessed because I just couldn't stand it anymore so I told them what they wanted to hear but I didn't think anybody would believe it. How can anybody take this seriously?\" And they think that because they're there and they've been experiencing this onslaught going on for a while and they imagine that anybody knows what happened would say \"why would anybody take seriously what somebody says after hours of being badgered and humiliated and lied to?\" But of course, the jurors and the judges hear the confession at the end typically don't know what happened but they have a confession that has the defendant's name at the bottom.</p> <p><strong>Petersen:</strong> Right. So the other thing I was asking about is the false accusation. A lot of this comes in child sex abuse cases. There's a pattern in the data.</p> <p><strong>Gross:</strong> Yes, that's correct. Child sex abuse cases are overwhelmingly the cases in which there is no DNA or other physical evidence of the sex abuse. They are typically made on the accusations. The crimes are typically made anywhere from weeks to years after they occurred, way too late to have any kind of physical evidence.</p> <p>And that as far as we can tell is accurate as well as inaccurate child sex abuse accusations. The children who were victimized by adults many, perhaps the majority, probably never report the abuse at all. And those who do, everybody understands, will not necessarily do it right away. Sometimes they have to be encouraged, but that means that false accusations are very hard to detect because what do you have? You have the nine-year-old girl who says that her stepfather molested her in some way, repeatedly over the period of a year. So ending a year or more before she ever tells about this. Nobody can figure out exactly what happened or what date this occurred, where people were, whether anybody else could have observed it, etc. The details of a crime that occurred in that context are essentially impossible to recover. To defend against it using evidence of timing, or the presence of other people, is generally impossible.</p> <p>It becomes a contest of credibility and that means that if somebody is motivated to lie in the situation---and we see that in the cases that result in exoneration---the defendant may well be convicted and that will be the only evidence. And there are many of these cases in the registry. And they seem to often include cases which we don't find out about until years after the exoneration took place.</p> <p>Often cases got little attention in the time for exoneration. I don't think we can come up with anything like an estimate of how come, but we do know that they're not rare.</p> <p><strong>Petersen:</strong> Moving to a different topic, you co-authored a paper published in 2014 on <a href= \"http://www.pnas.org/content/111/20/7230.abstract\" target= \"_blank\">the rate of false convictions among death row inmates</a>. I should say, I first heard of this study when someone quoted a statistic from it, the statistic that at least 4.1% of death row inmates are innocent, and my first thought when I heard that was that it couldn't possibly be right because nobody should have the tools to measure such a thing. So I read the paper and I was impressed with the method. So could you talk a little bit about the methods you used to get to that statistic?</p> <p><strong>Gross:</strong> Well, I have to agree with your initial intuition because having worked in this area for decades, 20 years ago I would have said this is not something that can be estimated. The proportion of false convictions can't be estimated because false convictions, are by their very nature, unobserved and for the most part unobservable.</p> <p>You can't just have to find whether somebody is innocent or we wouldn't have false convictions. A lot of things are unobserved. We don't know the rate, the proportion of prisoners in the prison who have been exposed to tuberculosis, but we can test that if we want to. We can test a sample. But this isn't anything you can test. So the question is \"Is there any way to come up with an estimate?\" And in general, it's impossible because you don't have anything like the post-conviction information that will be necessary to come up with a clue as to how frequently innocent people are convicted and for what it's worth in the United States our background criminal justice statistics on convictions in general, are so bad that a comparison of people who are convicted is nearly impossible to define.</p> <p>Death sentences in the United States are just different. They're different in two ways: First, we have through the Bureau of Justice Statistics a database that tracks everybody sentenced to death in the United States with reasonable precision from the time they're sentenced until the time they're removed from death-row by execution, or by death from natural causes, or by exoneration or by the most common means which is being re-sentenced to life in prison. And second we have an extraordinarily high rate of exonerations in death-sentence cases. Hundreds of times higher than for other crimes. And the reason for that is---depending on what you're comparing it to---perhaps only 10 or 20 times higher than other murders but much higher than other felonies in general and vastly higher than misdemeanors.</p> <p>And the reason for that is that someone who is under sentence of death almost always will have access to resources to reconsider the possibility that he or she is innocent that are simply unavailable to almost everybody else who has been convicted of a serious crime in the United States. They're going to be represented by attorneys with few exceptions from the time they're convicted until the time they leave death-row, their cases are all subject to review in private courts which is not generally true for other people sentenced in the United States and in almost all cases there are multiple levels of review.</p> <p>The resources that are available for attorneys are much greater and probably as important as any of that, the legal system itself---and judges in particular are much more interested in considering the possibility that people who might be executed could be innocent than they are in considering the innocence of anybody else including defendants who are sent to prison without the possibility of parole---and are much more open to reconsidering cases where new evidence of innocence comes up.</p> <p>So the net result is a rate of exoneration that is vastly higher than any other type of case. Which means that if you just look at the rate of exoneration and compare it to the overall number of death sentences that occurred in the time period where the convictions which produces exoneration occurred you already get quite a high number, about 2.3% if you limit yourself to cases that are old enough so that by then anybody who will be exonerated probably was exonerated. That's a paper that one of my co-authors---Barbara O'Brien---and I published several years before the one you are referring to.</p> <p>So that already gets you to a number that is surprisingly high but it's still going to be an underestimate. An underestimate because that also takes into account the many cases of defendants who are sentenced to death who are innocent, who have not been exonerated. The paper you mentioned tends to deal with that by focusing on one of the features of the process of exoneration and review of the cases of defendants who were sentenced to death and that is something I already mentioned.</p> <p>If you're sentenced to death in the United States chances are you will never be executed. What will probably happen is that eventually, by one means or another, your sentence will be reduced from death to life in prison and you will be taken off death row and reassign to the general prison population and then you will die in prison as too many defendants who were convicted of murder and sentenced to life in prison and not sentenced to death. When that happens, the pressure to make sure that no innocent person is executed, which is the backbone motivation for the extraordinary high level of exonerations in death cases, is removed. The defendant is no longer under threat of death and the extraordinary resources and attention that that defendant gets go away. And as a result, what you see is the death penalty exonerations that occurred are overwhelmingly in cases of people who still remain under sentence of death and are on death row. And then once the threat of execution is removed, the rate of death sentencing drops back, as far as we can tell, basically to the same rate as other murder cases.</p> <p>So the question for us was is there a way to estimate from the pattern of the cases that we know about---in particular, their histories as they wend their way through this process---what the rate of exoneration would be if defendants who are sentenced to death remain under threat of death indefinitely? That is, subject to the type of searching investigation and reconsideration that's available to defendants who might still be executed.</p> <p>And there is a technique for doing that, which you're very likely familiar with, and that's survival analysis. Figuring out how to do it is a somewhat complicated process but we went eventually through and that produced the estimate that you see, which is 4.1%. Obviously there's a great level of uncertainty attached to that. But it is a legitimate estimate of the rate of false convictions in that context, given the assumption the underlying rate of exonerations is a decent measure of innocence. And that requires a sensitivity analysis, which we also go through in the paper.</p> <p>And that leads to, I think, a solid conclusion that this is a conservative estimate of the rate of innocence among defendants who were sentenced to death. It's the lower bound of the point estimate, but it really means something between 3.2 to 5 point something percent. It's hard to know what it means, but it's somewhere in that range of 1 in 20 to 1 in 30. Which, I have to say, I was surprised how high it was.</p> <p><strong>Petersen:</strong> So where do you see this research program going in the future?</p> <p><strong>Gross:</strong> Well, unfortunately I cannot see duplicating that type of estimate for any other categories cases because we do not have that information. We don't have the background information on the cases themselves, which is necessary to do the survival analysis. You actually have to know how many cases survived, what the trajectory of each case was through the legal system and you don't have a glimmer of that except for capital cases. And second, the exoneration rate is much lower. So you can't make the leap from the exoneration rate to the false conviction rate. It would be much more tenuous.</p> <p>Our estimate at the end amounts to saying that we detected something like 40% of the innocent people who were sentenced to death in this period in the United States. The rest, the great majority of them ended up in prison---under sentence of life in prison---without the possibility of parole and will probably remain in prison until they die.</p> <p>Some number of them were no doubt executed. Although it follows from the same logic that leads to this estimate, that that will not be anything like 4%. That of the 12,000 of people who've been executed, if they were being executed in proportion to the number of people who were convicted who were innocent, it would be like 50 or something like that. But since so much of the process is geared to avoiding executing innocent people and that produces such a high exoneration rate, my guess would be much lower than that. It would probably translated into execution of probably 10-20-25 of innocent people over the past 30 some years. But that's it.</p> <p>Again we don't know, we can't say which cases they are. But can we do the same thing for robberies, or kidnappings, or for that matters non-capital murders? I can't imagine that.</p> <p><strong>Petersen:</strong> My guest today has been Sam Gross. Sam thanks for being part of Economics Detective Radio.</p> <p><strong>Gross:</strong> My pleasure. Take care.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with Samuel Gross.</p>  <p>Petersen: You're listening to Economics Detective Radio. My guest today is <a href= \"https://www.law.umich.edu/FacultyBio/Pages/FacultyBio.aspx?FacID=srgross\" target=\"_blank\">Samuel Gross</a> of the University of Michigan Law School. Sam, welcome to Economics Detective Radio.</p> <p>Gross: Great to be here.</p> <p>Petersen: So our topic for today is criminal justice, in particular, we're going to be looking at the issue of wrongful conviction. Dr. Gross was part of the establishment of <a href= \"http://www.law.umich.edu/special/exoneration/Pages/about.aspx\" target=\"_blank\">the National Registry of Exonerations</a> which has provided valuable data in this area. So let's start by talking about the registry. What is it? How was it developed? And what was your part in it?</p> <p>Gross: I'm the founder of the registry. It was created because after doing work on false convictions and exonerations for half a dozen years it became clear that the only way to get any sort of systematic information on exonerations that have occurred in the United States would be to put together the wherewithal to collect that information directly because nobody else was doing it. There's no official system for gathering information on exonerations or for that matter a single legal definition of what is an exoneration. And from there this project just took off on its own and became what's now a lasting institution that's in the process of handing over to other people to run.</p> <p>Petersen: Okay, so let's talk about the how an exoneration is defined in the registry. It's a case where someone has been convicted and then later that conviction has been overturned and presumably not just on a technicality but because the person was actually innocent---somehow managed to prove their innocence. Is that correct?</p> <p>Gross: Something like that. The thing that we're interested in studying is false convictions. Convictions of people who are actually innocent. The problem is there's no way to know when that's happened directly because in cases where by assumption people have made errors, the juries and prosecutors and judges who considered the cases have made errors in deciding who is guilty and who is innocent. It would be foolhardy and presumptuous and not particularly accurate for us to believe that we're going to be better at deciding after the facts which cases involve those sorts of errors and which don't.</p> <p>So, what we've done instead---instead of trying to make any judgment of our own about guilt or innocence based on whatever information we can collect from second or third or fourth hand sources---what we do instead is to consider cases, to classify cases of exonerations if they meet the following criteria: First, the defendant has to have been convicted of a crime, not just charged, the conviction has to be completely removed. That is, at the end of the process the defendant has to have no legal consequences from the original conviction which means the conviction was entirely overturned by dismissal, or by a pardon, or in a small number of cases---or by the acquittal over retrial---or in a small number of cases by one of the few procedures that are available for people who are exonerated posthumously, after they're dead. And then in addition, the process that led to that result has to include substantial evidence of innocence that was not available at the time of the original conviction.</p> <p>If the case meets those criteria we include, if it doesn't we don't. Our belief is---and it's a hypothesis---is that this produces a conservative classification for actual innocence, for errors in determining guilt at trial. We know of quite a few cases of people who are very likely to be innocent who are not included by these criteria in particular. Quite a few cases of people who reach that result having the conviction entirely removed from the record without the production of new evidence of innocence. For example, cases in which the conviction was reversed and then they are dismissed want to appeal because there was insufficient evidence to convict at trial unless some other evidence comes up before the conviction is reversed don't generally count.</p> <p>And our hypothesis is that we include a very small number of cases of guilty people who did meet these criteria. Although there are no doubt some, it's possible, but the process that it takes to get convictions reversed and dismissed in this manner in the United States is very difficult and as a result as far as we can tell there are not very many misclassifications of people who did prison based on the underlying crimes but meet the criteria for exoneration. That is the best we can do.</p> <p>Petersen: One thing I learned from your research is that the average time it takes a wrongfully convicted person to be exonerated is 10.1 years. So it seems like the system is stacked against it.</p> <p>Gross: It changes depending on the mix of exonerations we have. In the moment it's probably gone down a little bit, but that's about right. Ten years is close to the average</p> <p>Petersen: Looking through the registry I noticed some interesting patterns that I wonder if you'd like to comment on. So for instance, I was surprised by how few of these exonerations were about DNA evidence. It seems like it's actually more common for a witness to recant their testimony or for other non-DNA things, but I guess looking at media or just my own intuition I would have thought that DNA would be the big factor in a lot of these.</p> <p>Gross: And that's a very common misconception. I think most Americans think that exoneration is the second word of a two-word phrase that begins with the letters DNA. And that's of course, as you know, not true. DNA exonerations have always been a minority and in the past 10-15 years, they are an increasingly small minority.</p> <p>The number of DNA exonerations has been relatively steady over the past 10 years, about 20 a year, and the number of not DNA exonerations has been going up rapidly. The basic reason behind this is the DNA, which can be very telling and provide extraordinary strong evidence of guilt or of innocence, is only valuable in a small range of cases. It depends on having biological trace evidence that identifies a particular person as the person who committed a crime.</p> <p>That's relatively straightforward in the case of sexual assaults---rapes in particular---where the trace evidence that's left is very hard to explain except as a consequence of the crime. So if you recover semen from the body of a rape victim and it's identified by DNA as coming from a particular person and that person is not a consensual sexual partner of the victim, then you have the rapist. Assuming that rape really did occur. But if it's a question of identity, which is the case in most of the rape exonerations we know about, that tells you both who the person is if you can identify the profile---and in the case of exonerations who it is not---because DNA comes asymptotically close to being a unique identifier in that type of DNA evidence.</p> <p>But that's rape cases. Some other violent crimes produce DNA evidence that is as valuable or nearly as valuable. Usually murder cases in which there's blood evidence sometimes, other types of biological trace evidence, perspiration, epithelial cells from the skin and other bodily fluids and that can identify people under circumstances where you can determine from other evidence that the biological sample that was retrieved could only have come from the person who committed the crime.</p> <p>But most crimes don't have that. One of the things that's clear in the registry, for example, is that there are almost certainly many many cases of false convictions in robberies that are not exonerated because they don't have the type of evidence that's available in rape cases. And in many rape cases there aren't either, but both robberies and rape cases that resolved in exonerations overwhelmingly are cases in which the suspect was misidentified by the victim or by sometimes more than one victim. There are three to five times as many robbery cases of this sort as rape cases---maybe more than that---and they are typically cases in which errors are more likely because the victims may only get a sidelong glance at the robber whereas rape cases almost by definition require much more close contact with the perpetrator.</p> <p>Nonetheless, despite the fact of the numbers suggest we have many more exonerations in robbery cases. Rape exonerations outnumber robbery exonerations by about 3-5:1. And the reason of that is because the rape cases can be exonerated by DNA but the robbery cases can't because you don't have DNA for the type of conduct that's involved in robberies. You don't have DNA that you can retrieve from threats that are made or guns that are waved or even guns that are used. And as result, those cases are not exonerated at all. Now given the huge disproportion between the cases in which DNA is valuable, and cases in which DNA is never going to play any role, it's not surprising that the great majority of exonerations don't involve DNA. But the availability of DNA in the small number of cases---comparatively small number of cases---in which it is valuable does make those cases ones in which the possibility of correcting a terrible mistake is considerably harder.</p> <p>Petersen: So, you mentioned the increase in recent years in non-DNA exonerations. I was looking at the data and in 2011 there were only 73 exonerations in the Registry, but in 2015 it had more than doubled to 157. So, I wonder what's changed in recent years to make that number increase so much?</p> <p>Gross: It is a general change and then there are particular---couple particular strands that stand out. The general change is that the resources that are devoted to reinvestigating cases where defendants were convicted and there are now doubts about the accuracy of the convictions are increasing year by year. And the willingness of everybody involved, the criminal defense attorneys but also more importantly prosecutors, police officers, and judges to consider the possibility that someone who was convicted is innocent has grown greatly.</p> <p>They have come to recognize that mistakes happen and the more exonerations occur the more people realize that this isn't just a once-in-a-lifetime event. And that's I think the force that is behind all of the specific changes that occur.</p> <p>The two strands that have made the most difference in these numbers are---in the last 10 years, I think---are, in the past four or five a proliferation of Conviction Integrity Units across the country. These are specialized units within prosecutors' offices that focus on issues having to do with erroneous convictions. And for the most part, the ones that are most effective, look at cases within the jurisdiction in which there is a possibility that the wrong person is convicted and they work to re-investigate and sometimes exonerate the people involved. They have contributed an increasing proportion of the cases that we see. And to the extent of this becomes more widespread they might someday be a majority of all exonerations.</p> <p>There are something like 25,000 local prosecutorial offices in the United States. I don't have the exact count now, I will in several weeks but my guess is that by now we have something like 30 Conviction Integrity Units around the country which represents a larger proportion of the population than that would suggest because those are some of the most populous counties, but it's still a minority of all cases where the local prosecutor has any organized interest in the issue. And then there is a particular pattern that came up in one county---Harris County, Texas, where Houston is located---that contributed, I think it was 40 some exonerations last year and 40 some so far this year and 30 several years before that. And that's a back-log of cases of defendants in Harris County who pled guilty to possession of drugs and then after they pled guilty the Houston police criminal lab tested the substances they received from them to determine whether they, in fact, contained drugs and found that the material that was the basis for the conviction included no controlled substances whatever.</p> <p>We ran into a number of cases as that over the years but starting in 2014 the attorney who runs the Conviction Integrity Unit in the Harris County district attorney's office noticed there was a whole bunch of these cases and they were being handled very haphazardly and put together a program to identify them all, to clear the backlog and to set up procedures for getting the defendants exonerated and they're still working through that. The thing that's interesting about those cases is that, that procedure testing drugs that were seized from people, the supposed drugs that were seized from suspects after the defendants have already pled guilty to something that as far as we know doesn't happen any place else in the country or didn't---now I think a couple of other jurisdictions have begun to do it at least occasionally---but it's just that there may out there be thousands of cases a year of defendants who pled guilty to possession of drugs when in fact they were not in possession of any illegal drugs. Although they could be exonerated by quite a simple process, it doesn't take an elaborate investigation just running the drugs through the police lab, which could be done. Except in Harris County, until the last year or two nobody's ever done that.</p> <p>Petersen: That's so strange. Were they caught with a little baggie of oregano or powdered sugar and just everyone assumed it was drugs?</p> <p>Gross: It's a whole lot of different things but it's a good question. In some cases, they were arrested for possession of pills that were identified by the police officer as likely or actually being a controlled substance---often Xanax---and then tested by the lab and found not to be Xanax. Sometimes ibuprofen, sometimes some other over-the-counter medications.</p> <p>In some cases, they had the smallest amount of white powder. One woman who ended up in the paper had white powder on her face because she had the habit of eating flour, which some people do, eating flour mixed with water and was left with some white powder around her mouth. In cases like that, where small amounts of white powder or something else were tested, they were subjected to field tests for drugs which have become notorious in the past year or two because they are so unreliable.</p> <p>Field tests for drugs are not admissible evidence in court to show that the substance involved was a controlled substance but they're considered good enough to perform the arrest. Then what happens is the defendants who were arrested on these charges show up in court three days later and if they can't make bail, which seems to be true in basically all the cases that we know about---perhaps with a few exceptions---then they're given a choice that amounts to this: Plead guilty today and you'll get some perhaps suspended sentence and go home immediately, or another week and you'll be home in three days, or something like that, or a short-end by Harris County standards where drugs sentences are three weeks or two months or something like that. Or plead not guilty and then you'll be held in jail because you can't make bail for months, after which you'll go to trial and if you are convicted, and obviously you might be because some cop and some test said you were in possession of drugs, then you'll get perhaps years in state prison.</p> <p>No doubt many people refuse to plead guilty in that situation because they're innocent. But some who are innocent do plead guilty and those are the ones we find out about.</p> <p>Petersen: Right. So that process of being prosecuted, even when you're innocent, can sometimes be more costly than simply pleading guilty. Especially in the small cases.</p> <p>Gross: If it's a low-level charge and you are held in pretrial detention, the process can be much more costly than a conviction after trial. In Harris County you could spend six months in jail or longer. So, I've heard stories of people who spend a year or more in jail waiting for trial. If you can make bail, then that's still a heavy cost. Having a trial hanging over your head and having to come back to court repeatedly is not a walk in the park. But if you're held in jail for that period it's an extraordinary cost. It obviously disrupts your life and it may tear your family apart, you would lose your job, you may not be able to get other employment, and so on.</p> <p>Petersen: So one of the things we've learned in recent years is just how easy it is for police to get people to falsely confess, or to falsely accuse someone else of a crime. In fact, I think the number was 12% of the cases in the registry were false confessions and I believe it was a majority involved witness making false accusation or committing some kind of perjury. Why do people confess to things they didn't do, first?</p> <p>Gross: Well, those are two different issues false confessions and perjury or other false accusations. Although there is sometimes an overlap. I don't think I agree with the statement that it's easy to get false confessions. In some cases, no doubt it is, but the false confessions that we know about are overwhelmingly in murder cases. And as far as we can know---but the information we have is not that good---they appear to be the result of long interrogations. Long would be the ones that really stand out, sometimes they take place over days, two, three days or longer with the defendant sometimes being questioned in relays by different officers.</p> <p>But even interrogations of three, four hours or five hours---which is eternity if you're being questioned unrelentingly by police officers---are fairly uncommon. This costs the police quite a bit. It involves usually more than one officer over that period of time. Certainly one officer taking off that whole period of time and a fair amount of preparation. So it's not done very much, except in homicides, and it does happen in other cases but I think two-thirds or so of the false confessions that we know about are homicides cases, maybe more than that.</p> <p>What's surprising to many people---and those working in the area have gotten used to it, but still somehow surprising---is not that it's easy to get people to falsely confess, but that people will falsely confess to murders that they didn't commit, that they had nothing to do with. It seems like such an unbelievably strange and self-destructive thing to do but it happens and it happens time and time again.</p> <p>And what we see in these cases and what other researchers have shown, is that it's much more likely if the suspect is in one of two general very vulnerable categories: if the suspect is a teenager, or the suspect has some type of mental disability, is intellectually disabled and mentally ill. Those two groups are, as far as we can tell, much more likely to falsely confess than other people who are subject to these interrogations. They are very far less likely to be able to resist the pressures, they're more likely to respond to authorities or more likely to believe the promises and threats that are implied if not directly made in the process of interrogation. They're more likely to become hopeless, and they're more likely to---much more likely---to not grasp the seriousness of what's going on.</p> <p>One of the most common things that people hear when they talk to a suspect who falsely confessed later on and ask why did you do it is \"I confessed because I wanted to go home. I just told them what they wanted to hear so they'd let me go.\" Which of course does not happen or \"I confessed because I just couldn't stand it anymore so I told them what they wanted to hear but I didn't think anybody would believe it. How can anybody take this seriously?\" And they think that because they're there and they've been experiencing this onslaught going on for a while and they imagine that anybody knows what happened would say \"why would anybody take seriously what somebody says after hours of being badgered and humiliated and lied to?\" But of course, the jurors and the judges hear the confession at the end typically don't know what happened but they have a confession that has the defendant's name at the bottom.</p> <p>Petersen: Right. So the other thing I was asking about is the false accusation. A lot of this comes in child sex abuse cases. There's a pattern in the data.</p> <p>Gross: Yes, that's correct. Child sex abuse cases are overwhelmingly the cases in which there is no DNA or other physical evidence of the sex abuse. They are typically made on the accusations. The crimes are typically made anywhere from weeks to years after they occurred, way too late to have any kind of physical evidence.</p> <p>And that as far as we can tell is accurate as well as inaccurate child sex abuse accusations. The children who were victimized by adults many, perhaps the majority, probably never report the abuse at all. And those who do, everybody understands, will not necessarily do it right away. Sometimes they have to be encouraged, but that means that false accusations are very hard to detect because what do you have? You have the nine-year-old girl who says that her stepfather molested her in some way, repeatedly over the period of a year. So ending a year or more before she ever tells about this. Nobody can figure out exactly what happened or what date this occurred, where people were, whether anybody else could have observed it, etc. The details of a crime that occurred in that context are essentially impossible to recover. To defend against it using evidence of timing, or the presence of other people, is generally impossible.</p> <p>It becomes a contest of credibility and that means that if somebody is motivated to lie in the situation---and we see that in the cases that result in exoneration---the defendant may well be convicted and that will be the only evidence. And there are many of these cases in the registry. And they seem to often include cases which we don't find out about until years after the exoneration took place.</p> <p>Often cases got little attention in the time for exoneration. I don't think we can come up with anything like an estimate of how come, but we do know that they're not rare.</p> <p>Petersen: Moving to a different topic, you co-authored a paper published in 2014 on <a href= \"http://www.pnas.org/content/111/20/7230.abstract\" target= \"_blank\">the rate of false convictions among death row inmates</a>. I should say, I first heard of this study when someone quoted a statistic from it, the statistic that at least 4.1% of death row inmates are innocent, and my first thought when I heard that was that it couldn't possibly be right because nobody should have the tools to measure such a thing. So I read the paper and I was impressed with the method. So could you talk a little bit about the methods you used to get to that statistic?</p> <p>Gross: Well, I have to agree with your initial intuition because having worked in this area for decades, 20 years ago I would have said this is not something that can be estimated. The proportion of false convictions can't be estimated because false convictions, are by their very nature, unobserved and for the most part unobservable.</p> <p>You can't just have to find whether somebody is innocent or we wouldn't have false convictions. A lot of things are unobserved. We don't know the rate, the proportion of prisoners in the prison who have been exposed to tuberculosis, but we can test that if we want to. We can test a sample. But this isn't anything you can test. So the question is \"Is there any way to come up with an estimate?\" And in general, it's impossible because you don't have anything like the post-conviction information that will be necessary to come up with a clue as to how frequently innocent people are convicted and for what it's worth in the United States our background criminal justice statistics on convictions in general, are so bad that a comparison of people who are convicted is nearly impossible to define.</p> <p>Death sentences in the United States are just different. They're different in two ways: First, we have through the Bureau of Justice Statistics a database that tracks everybody sentenced to death in the United States with reasonable precision from the time they're sentenced until the time they're removed from death-row by execution, or by death from natural causes, or by exoneration or by the most common means which is being re-sentenced to life in prison. And second we have an extraordinarily high rate of exonerations in death-sentence cases. Hundreds of times higher than for other crimes. And the reason for that is---depending on what you're comparing it to---perhaps only 10 or 20 times higher than other murders but much higher than other felonies in general and vastly higher than misdemeanors.</p> <p>And the reason for that is that someone who is under sentence of death almost always will have access to resources to reconsider the possibility that he or she is innocent that are simply unavailable to almost everybody else who has been convicted of a serious crime in the United States. They're going to be represented by attorneys with few exceptions from the time they're convicted until the time they leave death-row, their cases are all subject to review in private courts which is not generally true for other people sentenced in the United States and in almost all cases there are multiple levels of review.</p> <p>The resources that are available for attorneys are much greater and probably as important as any of that, the legal system itself---and judges in particular are much more interested in considering the possibility that people who might be executed could be innocent than they are in considering the innocence of anybody else including defendants who are sent to prison without the possibility of parole---and are much more open to reconsidering cases where new evidence of innocence comes up.</p> <p>So the net result is a rate of exoneration that is vastly higher than any other type of case. Which means that if you just look at the rate of exoneration and compare it to the overall number of death sentences that occurred in the time period where the convictions which produces exoneration occurred you already get quite a high number, about 2.3% if you limit yourself to cases that are old enough so that by then anybody who will be exonerated probably was exonerated. That's a paper that one of my co-authors---Barbara O'Brien---and I published several years before the one you are referring to.</p> <p>So that already gets you to a number that is surprisingly high but it's still going to be an underestimate. An underestimate because that also takes into account the many cases of defendants who are sentenced to death who are innocent, who have not been exonerated. The paper you mentioned tends to deal with that by focusing on one of the features of the process of exoneration and review of the cases of defendants who were sentenced to death and that is something I already mentioned.</p> <p>If you're sentenced to death in the United States chances are you will never be executed. What will probably happen is that eventually, by one means or another, your sentence will be reduced from death to life in prison and you will be taken off death row and reassign to the general prison population and then you will die in prison as too many defendants who were convicted of murder and sentenced to life in prison and not sentenced to death. When that happens, the pressure to make sure that no innocent person is executed, which is the backbone motivation for the extraordinary high level of exonerations in death cases, is removed. The defendant is no longer under threat of death and the extraordinary resources and attention that that defendant gets go away. And as a result, what you see is the death penalty exonerations that occurred are overwhelmingly in cases of people who still remain under sentence of death and are on death row. And then once the threat of execution is removed, the rate of death sentencing drops back, as far as we can tell, basically to the same rate as other murder cases.</p> <p>So the question for us was is there a way to estimate from the pattern of the cases that we know about---in particular, their histories as they wend their way through this process---what the rate of exoneration would be if defendants who are sentenced to death remain under threat of death indefinitely? That is, subject to the type of searching investigation and reconsideration that's available to defendants who might still be executed.</p> <p>And there is a technique for doing that, which you're very likely familiar with, and that's survival analysis. Figuring out how to do it is a somewhat complicated process but we went eventually through and that produced the estimate that you see, which is 4.1%. Obviously there's a great level of uncertainty attached to that. But it is a legitimate estimate of the rate of false convictions in that context, given the assumption the underlying rate of exonerations is a decent measure of innocence. And that requires a sensitivity analysis, which we also go through in the paper.</p> <p>And that leads to, I think, a solid conclusion that this is a conservative estimate of the rate of innocence among defendants who were sentenced to death. It's the lower bound of the point estimate, but it really means something between 3.2 to 5 point something percent. It's hard to know what it means, but it's somewhere in that range of 1 in 20 to 1 in 30. Which, I have to say, I was surprised how high it was.</p> <p>Petersen: So where do you see this research program going in the future?</p> <p>Gross: Well, unfortunately I cannot see duplicating that type of estimate for any other categories cases because we do not have that information. We don't have the background information on the cases themselves, which is necessary to do the survival analysis. You actually have to know how many cases survived, what the trajectory of each case was through the legal system and you don't have a glimmer of that except for capital cases. And second, the exoneration rate is much lower. So you can't make the leap from the exoneration rate to the false conviction rate. It would be much more tenuous.</p> <p>Our estimate at the end amounts to saying that we detected something like 40% of the innocent people who were sentenced to death in this period in the United States. The rest, the great majority of them ended up in prison---under sentence of life in prison---without the possibility of parole and will probably remain in prison until they die.</p> <p>Some number of them were no doubt executed. Although it follows from the same logic that leads to this estimate, that that will not be anything like 4%. That of the 12,000 of people who've been executed, if they were being executed in proportion to the number of people who were convicted who were innocent, it would be like 50 or something like that. But since so much of the process is geared to avoiding executing innocent people and that produces such a high exoneration rate, my guess would be much lower than that. It would probably translated into execution of probably 10-20-25 of innocent people over the past 30 some years. But that's it.</p> <p>Again we don't know, we can't say which cases they are. But can we do the same thing for robberies, or kidnappings, or for that matters non-capital murders? I can't imagine that.</p> <p>Petersen: My guest today has been Sam Gross. Sam thanks for being part of Economics Detective Radio.</p> <p>Gross: My pleasure. Take care.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "36:15",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with Samuel Gross.  Petersen: You're listening to Economics Detective Radio. My guest today is  of the University of Michigan Law School. Sam, welcome to Economics Detective Radio. Gross: Great..."
}