{
  "title": "Over 50 countries vote against anti-Nazism UN measure",
  "link": "https://www.rt.com/news/566021-un-votes-nazism-ukraine-russia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566021-un-votes-nazism-ukraine-russia/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366dd7e85f5402e4d280b48.jpg\" /> Dozens of countries made it clear they’d rather look soft on Nazis than appear insufficiently anti-Russian <br/><a href=\"https://www.rt.com/news/566021-un-votes-nazism-ukraine-russia/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Last year, the resolution combating the glorification of Nazism was opposed by just the US and Ukraine</strong></p>\n            \n                        \n            <p>A UN resolution opposing the celebration of Nazism and related ideologies has met with significant resistance from the US and other western democracies, with 52 countries voting against it on Friday.&nbsp;</p>\n<p>The draft resolution \"<em>Combating glorification of Nazism, neo-Nazism and other practices that contribute to fueling contemporary forms of racism, racial discrimination, xenophobia and related intolerance</em>,\" introduced by Russia&rsquo;s representative to the UN, was adopted with 105 votes in support. In addition to the 52 votes against it, 15 countries abstained from choosing sides.&nbsp;</p>\n<p>The resolution expresses profound concern about glorifying Nazism, neo-Nazism and former Waffen SS members, condemning the construction of monuments and the holding of public ceremonies honoring the Third Reich. Introducing the resolution, the Russian delegate referenced an increase in xenophobia, anti-migrant sentiment, Islamophobia and anti-Semitism, among other forms of discrimination, as necessitating it.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/63490fc585f540048d01a8f4.jpg\" alt=\"FILE PHOTO. Servicemen of the Azov regiment stage a parade in Mariupol in 2019.\" />\n            <figcaption><a href=\"https://www.rt.com/russia/564642-azov-delegation-stanford-university/\">Russia reacts to Azov neo-Nazi’s platform at prestigious US university</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The US and several of its allies attempted to explain their vote against the measure by claiming Russia was exploiting Nazi atrocities to justify its military operation in Ukraine, insisting that to join them in condemning the lionization of Nazis would be letting them get away with weaponizing the Holocaust to serve their nefarious ends.</p>\n<p>The UK accused Moscow of \"<em>furthering lies and distorting history</em>,\" even while acknowledging it was using \"<em>legitimate human rights concerns raised by neo-Nazism mobilization</em>\" to justify its activities in Ukraine. The US went further, arguing that Russia&rsquo;s \"<em>pretextual use of fighting neo-Nazism undermines genuine attempts to combat neo-Nazism</em>.\" And Ukraine claimed Moscow&rsquo;s anti-Nazism message had \"<em>nothing in common with the genuine fight against Nazism and neo-Nazism</em>,\" which Kiev stressed it condemned in all forms.</p>\n<p>Australia, Japan, Liberia and North Macedonia proposed an amendment to clarify that while they were very much anti-Nazi, they were also profoundly anti-Russian. Their addition \"<em>notes with alarm that the Russian Federation has sought to justify its territorial aggression against Ukraine on the purported basis of eliminating neo-Nazism</em>,\" reminding everyone that the \"<em>pretextual use of neo-Nazism to justify territorial aggression seriously undermines genuine attempts to combat neo-Nazism</em>.\"&nbsp;</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/russia/564358-ukraine-commander-swastika-bracelet/\">\n            <span>READ MORE: </span>Ukrainian army’s commander-in-chief poses with swastika bracelet\n        </a>\n    </p>\n\n    \n\n<p>Russia opposed the amendment, accusing the writers of \"<em>trying to drive a wedge between states</em>\" by dropping it on the committee at the last minute. It was adopted with 63 votes approving, 23 against, and 65 abstaining.</p>\n<p>Moscow introduced a similar resolution last year, before the military operation in Ukraine had begun but after the US-backed coup had installed a government that allowed neo-Nazi groups like the Azov Battalion and lionized Stepan Bandera, the Ukrainian Nazi collaborator whose Organization of Ukrainian Nationalists was responsible for the massacre of tens of thousands of Poles and Jews during World War II. The 2021 resolution was opposed by just two states: the US and Ukraine.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 22:13:36 +0000",
  "dc:creator": "RT"
}