{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-6175111240544375906",
  "published": "2019-12-09T12:40:00.000-08:00",
  "updated": "2019-12-09T14:36:31.313-08:00",
  "title": "Our comment on COPPA",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Responsibility is our number one priority at YouTube, and this includes protecting kids and their privacy. Over the last few years, we’ve significantly invested in the <a href=\"https://youtube.googleblog.com/2019/06/an-update-on-our-efforts-to-protect.html\" target=\"_blank\">policies</a>, <a href=\"https://youtube.googleblog.com/2018/04/introducing-new-choices-for-parents-to.html\" target=\"_blank\">products</a> and <a href=\"https://youtube.googleblog.com/2017/11/5-ways-were-toughening-our-approach-to.html\" target=\"_blank\">practices</a> to help us do this, including launching <a href=\"https://www.youtube.com/kids/\" target=\"_blank\">YouTube Kids</a> in 2015. In July 2019, the Federal Trade Commission (FTC) <a href=\"https://www.ftc.gov/news-events/press-releases/2019/07/ftc-seeks-comments-childrens-online-privacy-protection-act-rule\" target=\"_blank\">began accepting comments</a> on the Children’s Online Privacy Protection Act (COPPA). Many creators have already participated in this process and today, we submitted our comment to the FTC as well.<br /><br /><h3 style=\"text-align: left;\">Support access to high-quality kids content</h3><br />YouTube is built on the premise of openness. Based on this open platform, millions of creators around the world have been able to make their content globally accessible, for free, to audiences of diverse backgrounds. On YouTube, creators are bringing visibility and opportunity to kids and families with special needs, using crafts to explore the world, offering fun ways to get kids moving, and more.<br /><br /><br />Many creators have expressed concern about the complexity of COPPA, their ability to comply with it, and its effect on the viability of their businesses. Questions range from what content is directed at children, to how to treat adults who might be watching kids content. This is particularly difficult for smaller creators who might not have access to legal resources. Balanced and clear guidelines will help creators better comply with COPPA and live up to their legal obligations, while enabling them to continue producing high-quality kids content that is accessible to everyone, everywhere.<br /><br /><h3 style=\"text-align: left;\">Treat adults as adults</h3><br />Currently, the FTC’s guidance requires platforms must treat anyone watching primarily child-directed content as children under 13. This does not match what we see on YouTube, where adults watch favorite cartoons from their childhood or teachers look for content to share with their students. <br /><br /><br />Creators of such videos have also conveyed the value of product features that wouldn’t be supported on their content. For example, creators have expressed the value of using comments to get helpful feedback from older viewers. This is why we support allowing platforms to treat adults as adults if there are measures in place to help confirm that the user is an adult viewing kids content.<br /><br /><h3 style=\"text-align: left;\">Provide clarity on what is made for kids</h3><br />The question creators ask us the most is, “What is made for kids content?” Sometimes, content that isn’t intentionally targeting kids can involve a traditional kids activity, such as DIY, gaming and art videos. Are these videos “made for kids,” even if they don’t intend to target kids? This lack of clarity creates uncertainty for creators.<br /><br /><br />The FTC shared <a href=\"https://www.ftc.gov/news-events/blogs/business-blog/2019/11/youtube-channel-owners-your-content-directed-children\" target=\"_blank\">some guidance</a> in November — and while this is a positive step in the right direction, we believe there needs to be more clarity about when content should be considered primarily child-directed, mixed audience or general audience. When providing these distinctions, it’s important to not only consider the actual content of the video, but also its context.<br /><br /><h3 style=\"text-align: left;\">Work with the FTC</h3></div><br />We strongly support COPPA’s goal of providing robust protections for kids and their privacy. We also believe COPPA would benefit from updates and clarifications that better reflect how kids and families use technology today, while still allowing access to a wide range of content that helps them learn, grow and explore. We continue to engage on this issue with the FTC and other lawmakers (we previously participated in the FTC’s <a href=\"https://www.ftc.gov/news-events/audio-video/video/future-coppa-rule-ftc-workshop-session-2\" target=\"_blank\">public workshop</a>) and are committed to continue doing so.<br /><br /><br />The comment period closes Wednesday, December 11. If you’re interested in providing feedback of your own, you can do so on the <a href=\"https://www.ftc.gov/news-events/press-releases/2019/12/ftc-extends-deadline-comments-coppa-rule-until-december-11\" target=\"_blank\">FTC’s website</a>.</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}