{
  "title": "Meet three Asia-Pacific schools evolving digital education",
  "link": "https://blog.google/outreach-initiatives/education/meet-three-asia-pacific-schools-evolving-digital-education/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"eedpx\">Access to education is one of the most important enablers for a child’s future success. School resources can often be limited, especially with the sudden shift to remote learning during COVID. Our team works on creating digital solutions for schools to provide a great learning experience for students, whether it’s collaborating across countries or keeping track of academic records.</p><p data-block-key=\"6aj8o\">Increasingly, we’re seeing schools around the world adopt tools like <a href=\"https://edu.google.com/intl/ALL_sg/chromebooks/find-a-chromebook/\">Chromebooks</a> and <a href=\"https://edu.google.com/intl/ALL_sg/workspace-for-education/editions/overview/\">Google Workspace for Education</a>, transforming the ways teachers deliver lessons, and students learn. And, Asia-Pacific is home to some of the largest user bases for these tools. Let’s meet three teachers from Thailand, Japan, and Australia who have adopted Google for Education tools. </p></div></div><div class=\"block-video\"><div class=\"h-c-page h-c-page--mobile-full-bleed\"><div class=\"h-c-grid\"><div class=\"h-c-grid__col h-c-grid__col-l--10 h-c-grid__col-l--offset-1\"><div class=\"article-module uni-article-video uni-article-video--body\" data-component=\"uni-article-yt-player\" data-page-title=\"\" data-video-id=\"cpi8fDIk8Tg\"><div class=\"uni-article-video__embed-container hidden\"><div id=\"uni-article-yt-player-cpi8fDIk8Tg\"></div></div><figure><a class=\"h-c-video h-c-video--marquee uni-article-video__custom-wrapper\" role=\"link\" tabindex=\"0\"><div class=\"uni-article-video__aspect-image\"><img alt=\"School students and teachers show how they use technology like Google Meets to make learning a better experience.\" data-loading='{\n                        \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/keyframe_h4reM78.max-500x500.png\",\n                        \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/keyframe_h4reM78.max-1000x1000.png\"\n                      }' loading=\"lazy\" src=\"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/keyframe_h4reM78.max-100x100.png\"/><div class=\"uni-article-video__dimmer\"></div><svg class=\"uni-article-video__play-button--active\" role=\"img\"><use xlink:href=\"#yt_video_play_button_no_hole\"></use></svg><svg class=\"uni-article-video__play-button\" role=\"img\"><use xlink:href=\"#yt_video_play_button\"></use></svg><div class=\"uni-article-video__duration loading\"><svg class=\"uni-article-video__duration-icon\" role=\"img\"><use xlink:href=\"#yt_video_duration\"></use></svg><span class=\"uni-article-video__duration-time\">10:25</span></div></div></a></figure></div></div></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"eedpx\"><b>Tell us about your school, and its mission.</b></p><p data-block-key=\"e6ff1\">Pradchayakorn Hodmalee, Deputy Director, Princess Chulabhorn Science High School Loei: We’re a science-focused school in Thailand where students collaborate on projects with peers from affiliate schools across Thailand and Japan. We create our own standardized curriculum, for which our teachers regularly travel from different regions to meet and jointly design syllabuses and exams. We also take pride in organizing overseas immersion trips to Japan for our students.</p><p data-block-key=\"8slj2\">Emil Zankov, Leader of Innovation and Enterprise, Pedare Christian College: We’re located in Golden Grove, South Australia. We focus on ‘bringing industry to the classroom’ - and work hard to build an environment where teamwork, friendly competition, and the messy play of learning are at the forefront. These are things that happen out in the real world, and are what the industry looks at when it comes to hiring.</p><p data-block-key=\"7beim\">Shinsuke Nakamura, English teacher, Kochi Prefectural Sakawa High School: We’re located in Kochi prefecture, in a small sunny town on Japan’s Shikoku island. Kochi recognizes that students have different motivations and ambitions. So our vision is to create a personalized journey of learning for every student throughout their lifelong education, even as they leave our school and start at a new one.</p><p data-block-key=\"85oqm\"></p><p data-block-key=\"dko5u\"><b>Why did you start using Google for Education tools?</b></p><p data-block-key=\"8hkpv\">Emil: What Google for Education tools allow teachers to do is really focus on what they want their students to learn, while the technology sits in the background. We chose Workspace and Chromebooks because of their simplicity and reliability. Knowing that they are going to work time and time again is critical as teachers have very little patience when it comes to technology. In addition, Google’s cloud solutions allow students to easily share their work, which helps them focus on creating content rather than dealing with tech difficulties.</p><p data-block-key=\"5t31j\">Pradchayakorn: With the pandemic’s travel restrictions, in-person meetings among teachers and student trips to Japan had to be canceled. So we quickly rolled out Workspace to enable teachers to continue communicating and working closely with their peers through tools like Google Meet, Drive and Forms. It’s actually more efficient, as teachers no longer have to commute to another province for meetings. To replace the immersion trip to Japan, we used Workspace tools to organize a four-month-long collaborative project with an affiliate school in Japan. We wanted to ensure our students still have the opportunity to work with peers from overseas and learn from others who may not be similar to them.</p><p data-block-key=\"ev3mo\">Shinsuke: Our vision of seamless, personalized learning meant that we needed to keep digital records of our students’ daily learnings through their elementary, junior high and high schools, so that teachers can continuously track their progress and help them work towards their personal goals. To help with that, the Kochi Prefectural Board of Education gives a Chromebook to every student in its public schools, which are sturdy, secure and easy to use. We also deploy Google Workspace for Education Plus and Cloud solutions in our school to help teachers easily access their students’ records and tailor their teaching methods for each student.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"Photo of student smiling and looking at a Chromebook screen\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Smile02.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Smile02.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Smile02.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"eedpx\"><b>In one sentence, what does the future of education look like for you?</b></p><p data-block-key=\"bf9mt\">Shinsuke: If high schools could see what these students have learned (in elementary and junior high) and the achievements they’ve made each year, we can create a seamless journey of learning.</p><p data-block-key=\"4fcoa\">Pradchayakorn: Schools will be less and less about learning in a fixed physical setting, and classrooms will no longer have restrictions on how many students can attend.</p><p data-block-key=\"aj8f0\">Emil: It’s having the industry and students collaborate on real-world problems, breaking the notion that the real world is only outside of school.</p></div></div></body></html>",
  "pubDate": "Thu, 15 Sep 2022 03:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/education/meet-three-asia-pacific-schools-evolving-digital-education/",
  "category": [
    "Chromebooks",
    "Education",
    "Google Cloud"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Meet three Asia-Pacific schools evolving digital education",
    "description": "Asia-Pacific is home to some of the largest user bases for Google’s education tools, changing the way students learn in school.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Princess_Chulabhorn_Science_High_School_Loei.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/education/meet-three-asia-pacific-schools-evolving-digital-education/"
  },
  "author": {
    "name": "Colin Marson",
    "title": "Google for Education JAPAC",
    "department": "",
    "company": ""
  }
}