{
  "title": "Manifold Interpolating Optimal-Transport Flows for Trajectory Inference. (arXiv:2206.14928v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2206.14928",
  "description": "<p>We present a method called Manifold Interpolating Optimal-Transport Flow\n(MIOFlow) that learns stochastic, continuous population dynamics from static\nsnapshot samples taken at sporadic timepoints. MIOFlow combines dynamic models,\nmanifold learning, and optimal transport by training neural ordinary\ndifferential equations (Neural ODE) to interpolate between static population\nsnapshots as penalized by optimal transport with manifold ground distance.\nFurther, we ensure that the flow follows the geometry by operating in the\nlatent space of an autoencoder that we call a geodesic autoencoder (GAE). In\nGAE the latent space distance between points is regularized to match a novel\nmultiscale geodesic distance on the data manifold that we define. We show that\nthis method is superior to normalizing flows, Schr\\\"odinger bridges and other\ngenerative models that are designed to flow from noise to data in terms of\ninterpolating between populations. Theoretically, we link these trajectories\nwith dynamic optimal transport. We evaluate our method on simulated data with\nbifurcations and merges, as well as scRNA-seq data from embryoid body\ndifferentiation, and acute myeloid leukemia treatment.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Huguet_G/0/1/0/all/0/1\">Guillaume Huguet</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Magruder_D/0/1/0/all/0/1\">D.S. Magruder</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tong_A/0/1/0/all/0/1\">Alexander Tong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Fasina_O/0/1/0/all/0/1\">Oluwadamilola Fasina</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kuchroo_M/0/1/0/all/0/1\">Manik Kuchroo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wolf_G/0/1/0/all/0/1\">Guy Wolf</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Krishnaswamy_S/0/1/0/all/0/1\">Smita Krishnaswamy</a>"
}