{
  "title": "SC EP:456 The Pinecone Throwing Incident",
  "itunes:title": "SC EP:456 The Pinecone Throwing Incident",
  "pubDate": "Sun, 29 Jul 2018 23:27:51 +0000",
  "guid": "gid://art19-episode-locator/V0/X6-HJSGwUMOgZrLuA81pZnjBiS0r58xhYAT4UOk52MU",
  "link": "https://traffic.libsyn.com/secure/sasquatchchronicles/45620final.mp3",
  "itunes:image": "",
  "description": "<p>Tonight I will be speaking to Rob and he shares two encounters with us tonight. Both encounters he had something thrown at him.</p> <p>The second encounter he describes seeing a “Hairy man” after having a boulder thrown at him. I will also be speaking to Tony Merkel from The Confessionals podcast. With the upcoming International Bigfoot Conference coming up and Travis Walton will be a guest we discuss the \"fire in the sky\" incident. I will also be playing a clip of Travis talking about his encounter while on the ship to bring everyone up to speed before I interview him at the end of August.</p> <p>Rob writes “My name is Rob and I started listening to your show in August of 2015 while I was stationed at Fort Lee, Virginia for a 4 month leadership course. I found it very interesting, some of the behaviors people were reporting, mostly because of 2 occurrences I had, one in fall of 2011 and the other in the summer of 2014.</p> <p>I say occurrences because I was, and Still am not 100% what exactly happened in 2011 and what I saw in 2014.</p> <p>I am born and raised in Enumclaw Washington. I spent my life going river fishing with my dad. We would not even waste time with se river access and preferred and still do prefer solitude while fishing.</p> <p>So we would leave early in the mornings and head for mounting river fishing wherever we felt like we could make a good hike and be left alone. In 2011 I had just returned back to Washington from attending college in Ohio. For the 2 years I was out there finishing my degree I never quite had the time or opportunity to come home often, to spend much time with family, or fish. Once I graduated and came home, that fall my dad and I left early on a Saturday morning and headed over Snoqualmie to the head waters of the Yakima river just outside of Easton.</p> <p>We took the exit and drove in until we came to a bridge over the river. We crossed it, hoping that the road on the other side might follow the river a little further down stream, mostly just so we didn’t risk being in the first spot any other fisherman might come to. However, once we crossed the bridge and drove for a little while, we found out that the road didn’t follow the river hardly at all, so we turned back, crossed the bridge again and parked. We took our poles and headed down to the bank just upstream of the bridge. While we were talking about the best ways to fish that particular area, a pine cone came out of nowhere and landed just at our feet, about 3 feet from the water of the bank we were standing on.</p> <p>The bank was about 45 feet wide, and while there were pine trees up hill from where we were standing, they were in no way reaching anywhere close to over us. Not even close enough for a generous bounce and roll to reach us. We thought it was odd but kept talking and then pulled out the lures and began fishing. My dad walked upriver from me about 120 feet from me, completely visible to me. It was not even 3 minutes with my lure in the water before another pinecone landed to my left about 2 feet away. I never saw the arc of the fall of the pine cone. It just landed there. Pretty soon my dad called out saying that a pine cone hit him. At this point we started looking around to see if there was anyone, anything, a tree, and how they were flying in to judge where they might be coming from. It was so eerie, and I instantly became uncomfortable, but it didn’t seem to bother my dad too much. So we went back to fishing, but again not even 3 minutes and pinecone started falling so close, one bounced and hit my shoe. At that instant I called up to my dad and told him I had an uneasy feeling about what was happening, and that I was ready to go. He assured me it was alright, but said he was willing to head back to the car and try to work our way down river to find another spot, he just needed to use the wood line to “drop off a package”. So while he headed for the brush, I walked back up to the car to put the gear away. I was seated, just waiting for him, when he finally got back, he seemed pretty hasty, but I just assumed he was eager to get to a peaceful spot on the river and get to fishing ( This becomes important in 2017). So we headed back to I-90 and started to work our way down toward Ellensburg, trying to find spots along the river to fish. The rest of the trip was uneventful.</p> <p>In 2012 I joined the Army Reserve and met my finance, in 2013 I was married, and in 2014 I got divorced. When I got married I moved to Spokane and really didn’t have the chance to fish or spend time with my dad, so when I was divorced and moved back to Enumclaw, we decided that a Sunday on the Ohanapecosh would help get my mind off of things. So we took off, headed for Green Water, entered Mt. Rainier National park and headed over Cayuse pass toward Randall and Packwood.</p> <p>We had stopped along that road once before and walked down to the river to do some fishing, well that day we stopped in the same place only the river had moved. From the time we parked the car and actually got to where the river was at that time took 15 minutes, and we crossed 4 dry river beds with large patches of forest growing back up between them. Once we found the river, it had worked its way along a cliff. Like there had been the foot of a hill there until the water eroded it away. The cliff face was a good 25’ high which really didn’t mean to much, apart from the fact that where we arrived at the river, upstream was an enormous log jam.</p> <p>The log jam was so high that it reached to the top off the cliff wall. The log jam stretched from the cliff face, across the river, and was anchored in the forest of the last dry river bed we had come to. Like I said, it was enormous. The other thing that really didn’t mean much at the time was that the Jam had at some point collected enough sediment that a few small deciduous bushes were growing on the top. Well, my dad headed down stream, out of sight and I stayed there where we had come out to the river, I would guess about 200 feet away from the base of the log jam.</p> <p>I had been fishing about 10 minutes when I heard what sounded like a tree break. I looked up at the log jam but didn’t see anything. So I went back to fishing. About 5 minutes later though, a rock, easily the size of a beach ball hit the face of the log jam, making a breaking sound as it bounced, and then came to a stop in the river bank. As I looked over, having heard the branches it broke, then watching it thud to the ground, I saw movement on top the log jam. Honestly Wes, I don’t know what I saw, but to me, it looked like a furry human backside, up right, had run behind the bushes on top the jam. I saw what looked like a trailing thigh, knee, ass, and foot, ALL BLACK and FURRY or Hairy I guess, disappear into the bushes up top.</p> <p>I was horrified. And for a minute thought maybe it was a black bear. Any way. I turned by face back straight, keeping my eyes right and upstream while I calmly reeled in my line. Once I had my line in, I turned down stream to walk to my dad, all the time, not looking directly back, but keeping my head turned one direction or the other to keep my peripheral vision on the jam. When I found my dad I just told him that I wasn’t feeling too good and that the stress of the divorce was too much and I really wanted to go home and lay down. He was very sympathetic and reeled in his line and we headed back through the forest and dry river beds back to the truck. It was the most heightened state of alert in my life, every time we would cross a river bed and have to forge through the forest growing back in. We got back to the truck and headed home. I never told him what I had seen. Mostly because as terrified as I was I thought maybe there was a chance, in fright and panic, that I misidentified and it was just some normal animal.</p> <p>Fast forward to 2015, I was at Fort Lee, VA for an extended training course and had a lot of free time on m hands. There is not a whole lot to do there, and not a whole lot just off post. However there was a bookstore and I spent a lot of free time just browsing. One day I wandered through the Occult/ mystery / alien/ etc. etc. etc. section, and just perused some books on the subjects. When I got back to the fort that day I just happened to start looking at related videos on YouTube and stumbled across your show. Episode 11. Siege of Honobia. I listened to it, and I listened to more, and then all of the fishing events came back. I spent the rest of my time there reading and listening. I read David Paulides books religiously and listened to your show. When I got home after I started talking to my dad about bigfoot and other fringe topics, and he instantly brought up the Yakima occurrence. He told me that while he was in the wood line, another pinecone hit him, hard, while he was squatted in there, he said he absolutely had no Idea where it came from, and that he was actually pretty disturbed by it. So we started listening to your show when we would get together. We have even made 2 drives out to Yacolt, hoping to see something that would completely confirm the tiny bit of what I saw. We drove up Mt. Yacolt, just off the main road before you come into town by the school. That is an eerie feeling driving that road. The woods seem so claustrophobic and dark, even on the sunny day we went. The second trip down, we drove to Sunset falls, and drove all the way up to ( I believe FSR 50) and the feeling is much the same. Still no confirmation for me though.</p> <p>I don’t really know how to word it. I saw something. That much I know. I know what it kind of looked like. But it was just a 1 second glance. I do believe now, after listening to your show that there is something out there. I just cant say for certain that is what I really saw. But I would like to see one.</p> <p>I also don’t know about the pinecone throwing. That is not one I have heard on your show, or anywhere else, but maybe that is something someone has shared with you privately before?</p> <p>Lastly, I just wonder if you have gotten any reports off the Ohanapecosh or Yakima River in the Easton area?”</p> <p> </p>",
  "content:encoded": "<p>Tonight I will be speaking to Rob and he shares two encounters with us tonight. Both encounters he had something thrown at him.</p> <p>The second encounter he describes seeing a “Hairy man” after having a boulder thrown at him. I will also be speaking to Tony Merkel from The Confessionals podcast. With the upcoming International Bigfoot Conference coming up and Travis Walton will be a guest we discuss the \"fire in the sky\" incident. I will also be playing a clip of Travis talking about his encounter while on the ship to bring everyone up to speed before I interview him at the end of August.</p> <p>Rob writes “My name is Rob and I started listening to your show in August of 2015 while I was stationed at Fort Lee, Virginia for a 4 month leadership course. I found it very interesting, some of the behaviors people were reporting, mostly because of 2 occurrences I had, one in fall of 2011 and the other in the summer of 2014.</p> <p>I say occurrences because I was, and Still am not 100% what exactly happened in 2011 and what I saw in 2014.</p> <p>I am born and raised in Enumclaw Washington. I spent my life going river fishing with my dad. We would not even waste time with se river access and preferred and still do prefer solitude while fishing.</p> <p>So we would leave early in the mornings and head for mounting river fishing wherever we felt like we could make a good hike and be left alone. In 2011 I had just returned back to Washington from attending college in Ohio. For the 2 years I was out there finishing my degree I never quite had the time or opportunity to come home often, to spend much time with family, or fish. Once I graduated and came home, that fall my dad and I left early on a Saturday morning and headed over Snoqualmie to the head waters of the Yakima river just outside of Easton.</p> <p>We took the exit and drove in until we came to a bridge over the river. We crossed it, hoping that the road on the other side might follow the river a little further down stream, mostly just so we didn’t risk being in the first spot any other fisherman might come to. However, once we crossed the bridge and drove for a little while, we found out that the road didn’t follow the river hardly at all, so we turned back, crossed the bridge again and parked. We took our poles and headed down to the bank just upstream of the bridge. While we were talking about the best ways to fish that particular area, a pine cone came out of nowhere and landed just at our feet, about 3 feet from the water of the bank we were standing on.</p> <p>The bank was about 45 feet wide, and while there were pine trees up hill from where we were standing, they were in no way reaching anywhere close to over us. Not even close enough for a generous bounce and roll to reach us. We thought it was odd but kept talking and then pulled out the lures and began fishing. My dad walked upriver from me about 120 feet from me, completely visible to me. It was not even 3 minutes with my lure in the water before another pinecone landed to my left about 2 feet away. I never saw the arc of the fall of the pine cone. It just landed there. Pretty soon my dad called out saying that a pine cone hit him. At this point we started looking around to see if there was anyone, anything, a tree, and how they were flying in to judge where they might be coming from. It was so eerie, and I instantly became uncomfortable, but it didn’t seem to bother my dad too much. So we went back to fishing, but again not even 3 minutes and pinecone started falling so close, one bounced and hit my shoe. At that instant I called up to my dad and told him I had an uneasy feeling about what was happening, and that I was ready to go. He assured me it was alright, but said he was willing to head back to the car and try to work our way down river to find another spot, he just needed to use the wood line to “drop off a package”. So while he headed for the brush, I walked back up to the car to put the gear away. I was seated, just waiting for him, when he finally got back, he seemed pretty hasty, but I just assumed he was eager to get to a peaceful spot on the river and get to fishing ( This becomes important in 2017). So we headed back to I-90 and started to work our way down toward Ellensburg, trying to find spots along the river to fish. The rest of the trip was uneventful.</p> <p>In 2012 I joined the Army Reserve and met my finance, in 2013 I was married, and in 2014 I got divorced. When I got married I moved to Spokane and really didn’t have the chance to fish or spend time with my dad, so when I was divorced and moved back to Enumclaw, we decided that a Sunday on the Ohanapecosh would help get my mind off of things. So we took off, headed for Green Water, entered Mt. Rainier National park and headed over Cayuse pass toward Randall and Packwood.</p> <p>We had stopped along that road once before and walked down to the river to do some fishing, well that day we stopped in the same place only the river had moved. From the time we parked the car and actually got to where the river was at that time took 15 minutes, and we crossed 4 dry river beds with large patches of forest growing back up between them. Once we found the river, it had worked its way along a cliff. Like there had been the foot of a hill there until the water eroded it away. The cliff face was a good 25’ high which really didn’t mean to much, apart from the fact that where we arrived at the river, upstream was an enormous log jam.</p> <p>The log jam was so high that it reached to the top off the cliff wall. The log jam stretched from the cliff face, across the river, and was anchored in the forest of the last dry river bed we had come to. Like I said, it was enormous. The other thing that really didn’t mean much at the time was that the Jam had at some point collected enough sediment that a few small deciduous bushes were growing on the top. Well, my dad headed down stream, out of sight and I stayed there where we had come out to the river, I would guess about 200 feet away from the base of the log jam.</p> <p>I had been fishing about 10 minutes when I heard what sounded like a tree break. I looked up at the log jam but didn’t see anything. So I went back to fishing. About 5 minutes later though, a rock, easily the size of a beach ball hit the face of the log jam, making a breaking sound as it bounced, and then came to a stop in the river bank. As I looked over, having heard the branches it broke, then watching it thud to the ground, I saw movement on top the log jam. Honestly Wes, I don’t know what I saw, but to me, it looked like a furry human backside, up right, had run behind the bushes on top the jam. I saw what looked like a trailing thigh, knee, ass, and foot, ALL BLACK and FURRY or Hairy I guess, disappear into the bushes up top.</p> <p>I was horrified. And for a minute thought maybe it was a black bear. Any way. I turned by face back straight, keeping my eyes right and upstream while I calmly reeled in my line. Once I had my line in, I turned down stream to walk to my dad, all the time, not looking directly back, but keeping my head turned one direction or the other to keep my peripheral vision on the jam. When I found my dad I just told him that I wasn’t feeling too good and that the stress of the divorce was too much and I really wanted to go home and lay down. He was very sympathetic and reeled in his line and we headed back through the forest and dry river beds back to the truck. It was the most heightened state of alert in my life, every time we would cross a river bed and have to forge through the forest growing back in. We got back to the truck and headed home. I never told him what I had seen. Mostly because as terrified as I was I thought maybe there was a chance, in fright and panic, that I misidentified and it was just some normal animal.</p> <p>Fast forward to 2015, I was at Fort Lee, VA for an extended training course and had a lot of free time on m hands. There is not a whole lot to do there, and not a whole lot just off post. However there was a bookstore and I spent a lot of free time just browsing. One day I wandered through the Occult/ mystery / alien/ etc. etc. etc. section, and just perused some books on the subjects. When I got back to the fort that day I just happened to start looking at related videos on YouTube and stumbled across your show. Episode 11. Siege of Honobia. I listened to it, and I listened to more, and then all of the fishing events came back. I spent the rest of my time there reading and listening. I read David Paulides books religiously and listened to your show. When I got home after I started talking to my dad about bigfoot and other fringe topics, and he instantly brought up the Yakima occurrence. He told me that while he was in the wood line, another pinecone hit him, hard, while he was squatted in there, he said he absolutely had no Idea where it came from, and that he was actually pretty disturbed by it. So we started listening to your show when we would get together. We have even made 2 drives out to Yacolt, hoping to see something that would completely confirm the tiny bit of what I saw. We drove up Mt. Yacolt, just off the main road before you come into town by the school. That is an eerie feeling driving that road. The woods seem so claustrophobic and dark, even on the sunny day we went. The second trip down, we drove to Sunset falls, and drove all the way up to ( I believe FSR 50) and the feeling is much the same. Still no confirmation for me though.</p> <p>I don’t really know how to word it. I saw something. That much I know. I know what it kind of looked like. But it was just a 1 second glance. I do believe now, after listening to your show that there is something out there. I just cant say for certain that is what I really saw. But I would like to see one.</p> <p>I also don’t know about the pinecone throwing. That is not one I have heard on your show, or anywhere else, but maybe that is something someone has shared with you privately before?</p> <p>Lastly, I just wonder if you have gotten any reports off the Ohanapecosh or Yakima River in the Easton area?”</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "01:17:05",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "Tonight I will be speaking to Rob and he shares two encounters with us tonight. Both encounters he had something thrown at him. The second encounter he describes seeing a “Hairy man” after having a boulder thrown at him. I will also be speaking to...",
  "itunes:episode": 456,
  "itunes:episodeType": "full"
}