{
  "title": "572: 'Secrets of Dumbledore' Screenplay Review and Revelations, and Perspective-Changing MuggleMail",
  "link": "https://audioboom.com/posts/8130866",
  "itunes:episode": 572,
  "itunes:title": "'Secrets of Dumbledore' Screenplay Review and Revelations, and Perspective-Changing MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4265,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Armed with the brand new <em>Secrets of Dumbledore: The Complete Screenplay</em> book, the MuggleCasters go to work finding answers for mysteries that were not made clear by the 3rd Fantastic Beasts movie, but may have been clearer during production! <br>\n<br>\n\n</div>\n<ul>\n<li>What revelations do we have from the new <em>Fantastic Beasts 3</em> screenplay?</li>\n<li>The MuggleCasters are hosting an Instagram Live event this Wednesday, August 3rd at 8:30 PM ET to celebrate our birthday!</li>\n<li>More birthday fun:  MuggleCast is hosting a LIVE Quizzitch game about ourselves this Saturday at 11 AM ET! Stay tuned to our social media for links.</li>\n<li>\n<a href=\"https://www.patreon.com/posts/introducing-2022-68800529\">Don't miss our 2022 Patreon Gifts</a> - The MuggleCast Collectors Club and the MuggleCast Wand! Pledge to our Patreon by August 7, 2022 and fill out the form(s) to receive your gifts! We are so proud of this year's items and hope you check them out!</li>\n<li>The <em>Secrets of Dumbledore</em> screenplay offers some very tiny moments that did not make it to the movie, but no deleted scenes.</li>\n<li>Dumbledore and Grindelwald's tea time was likely a flashback, the Qilin comes from China, and Jacob's bakery has some vermin trouble!</li>\n<li>Concept art provided with the screenplay includes Lally's Charms book, and Whiskey the Goat!</li>\n<li>Was Yusuf Kama passing secret messages to Queenie?</li>\n<li>Mirror World confirmed! Albus and Credence's battle takes place within the Deluminator. The visual effects department points out a fun fact.</li>\n<li>SUPREME MUGWUMP CONFIRMED! Posters for the candidates reveal the use of word that was omitted from all the dialogue in the movie. Eric cries with joy.</li>\n<li>The 'little lobster creatures' and the giant manticore at the bottom of the pit are the same creature, the screenplay confirms.</li>\n<li>Dumbledore's fist fight is detailed on his family tree, with a mysterious page number we'll be speculating about for years to come.</li>\n<li>MuggleMail includes Sorting Madame Pomfrey, James and Lily's love, whether Squibs can talk to cats, Jedi in <em>Harry Potter</em>, Percy's motives, and a new Marvel version of Voldemort!</li>\n<li>Quizzitch: Who succeeded Albus Dumbledore as Supreme Mugwump of the International Confederation of Wizards?</li>\n<li>This week's episode is brought to you by Indeed (Claim your $75 credit now at <a href=\"https://www.Indeed.com/mugglecast\">Indeed.com/mugglecast</a>), BetterHelp (Get 10% off your first month at <a href=\"https://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>), and MeUndies (Get 20% off your first order and free shipping at <a href=\"https://www.MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 02 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-01:/posts/8130866",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}