{
  "title": "The dream isn&#8217;t over &#8212; AMD&#8217;s RX 7900 XTX may still hit 3GHz",
  "link": "https://www.digitaltrends.com/computing/amd-radeon-rx-7900-xtx-clock-speed-may-go-up/",
  "pubDate": "Fri, 04 Nov 2022 15:23:15 +0000",
  "dc:creator": "Monica J. White",
  "category": [
    "Computing",
    "News",
    "AMD Radeon RX 7900 XTX",
    "RDNA 3",
    "RX 7000-series",
    "RX 7900 XT"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220163",
  "description": "The upcoming AMD Radeon RX 7900 XTX was initially said to have a higher clock speed. Rumors say it might still get there.",
  "content:encoded": "<p>Prior to AMD&#8217;s <a href=\"https://www.digitaltrends.com/computing/how-to-watch-amd-rx-7000-launch/\">launch of its new RDNA 3 GPUs</a>, the rumor mill has been running wild with speculation about clock speeds on the new flagships. Some sources said that the cards would be able to hit 3GHz; 4GHz has also been floated around as a highly unbelievable, but enticing theory. Now that we know more about the <a href=\"https://www.digitaltrends.com/computing/amd-rx-7900-xtx-vs-rx-7900-xt/\">Radeon RX 7900 XTX and RX 7900 XT</a>, it&#8217;s safe to say they won&#8217;t be hitting 3GHz, let alone 4GHz.</p>\n<p>With that said, it seems that 3GHz for RDNA 3 is not entirely out of the question &#8212; it just seems very unlikely to happen on AMD&#8217;s own reference models. Here&#8217;s what we know.</p>\n<iframe src=\"https://www.youtube.com/embed/mUXp4Hqr_lM\" width=\"640\" height=\"360\"></iframe>\n<p>In this generation of graphics cards, AMD appears to be all about the performance per watt. It managed to keep the TDP on the RX 7900 XTX and the RX 7900 XT reasonable, at 355 and 335 watts respectively. Comparing the <a href=\"https://www.digitaltrends.com/computing/amd-rx-7900-xtx-vs-nvidia-rtx-4090/\">RX 7900 XTX to Nvidia&#8217;s RTX 4090</a> reveals a 95W gap between the two, to AMD&#8217;s advantage. The AMD flagship is also much, much cheaper. With all that said, it will likely fall behind Nvidia&#8217;s behemoth GPU in terms of raw performance.</p>\n<p>The 7900 XTX has a 2.3GHz game clock and a 2.5GHz boost clock. While the RTX 4090 has a similar boost clock (2.52GHz), it can also handle a fair bit of overclocking. However, when it comes to the overclocking capabilities of the 7900 XTX, we&#8217;re getting some conflicting information.</p>\n<p>According to what AMD has shared at the event (as can be seen in the above PCWorld video), the Navi 31 GPU has been designed to support as much as 3GHz. This implies that AMD, in its pursuit of performance-per-watt superiority, may have limited the power of its reference models, but that doesn&#8217;t mean that its board partners won&#8217;t be able to unlock higher clock speeds. Mind you, this information comes from Jarred Walton of Tom&#8217;s Hardware, and not directly from AMD.</p>\n<blockquote class=\"h-lazy-embed\" data-width=\"500\" data-dnt=\"true\" data-initial-classes=\"twitter-tweet\" data-embed-name=\"twitter\" data-sdk-src=\"//platform.twitter.com/widgets.js\">\n<p lang=\"en\" dir=\"ltr\">Some people asked during the stream so I asked AIBs and they are saying about only 3% OC over the XTX with preliminary drivers (that have been used mostly for thermal testing, to be fair). If true then it looks like the XTX is already close to maxed out &#128546; <a href=\"https://t.co/X9E7EbSwIQ\">pic.twitter.com/X9E7EbSwIQ</a></p>\n<p>&mdash; coreteks (@coreteks) <a href=\"https://twitter.com/coreteks/status/1588329053530251265?ref_src=twsrc%5Etfw\">November 4, 2022</a></p></blockquote>\n<p>On the other hand, Coreteks, a YouTuber, claims that AMD&#8217;s board partners are only seeing an overclocking potential of around 3%. This can still go up with the final version of the new drivers, though. We also know that there will be different versions of the card with a 3&#215;8-pin connector. This will drive up the power consumption, and consequently, allow higher clock speeds.</p>\n<p>In all likelihood, custom versions of the RX 7900 XTX and RX 7900 XT will be capable of hitting higher clock speeds. It&#8217;s hard to say whether 3GHz will be attainable, but we&#8217;re unlikely to be stuck at the 2.5GHz provided by the reference model.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/AMD-Radeon-RX-7900-XTX_10.jpg?p=1",
  "enclosure": "",
  "post-id": 3220163
}