{
  "title": "What You Need to Know about Affirmative Action at the Supreme Court",
  "link": "https://www.aclu.org/news/racial-justice/what-you-need-to-know-about-affirmative-action-at-the-supreme-court",
  "pubDate": "Mon, 31 Oct 2022 14:45:45 +0000",
  "dc:creator": "ACLU",
  "category": [
    "Affirmative Action",
    "Racial Justice"
  ],
  "guid": "https://www.aclu.org/news/racial-justice/what-you-need-to-know-about-affirmative-action-at-the-supreme-court",
  "description": "<p>After over a hundred years of <a href=\"https://www.unc.edu/story/black-history-month/#:~:text=When%20they%20set%20foot%20on,they%20were%20just%20the%20start.\">total</a> or <a href=\"https://www.thecrimson.com/article/2017/9/11/welcome-black-harvard/#:~:text=Harvard%20College%20admitted%20its%20first,the%201847%2D48%20school%20year.\">near total</a> exclusion of Black students and other students of color, the University of North Carolina and Harvard began admitting larger numbers of students, including students of color, in the 1960s and 70s. For decades, Harvard, UNC, and other universities have had the ability to consider a student’s race along with a wide range of other factors — academic merit, athletics, extra curriculars, and others — when it comes to deciding whether to admit a student. But now, the Supreme Court could change all of this.</p>\n<p>The U.S. Supreme Court is set to hear two cases concerning affirmative action today. If the court strikes down affirmative action — also known as race-conscious admissions policies — it would make it unconstitutional for universities across the country to consider a student’s race as one factor in a holistic admissions review process. The American Civil Liberties Union, ACLU of Massachusetts, and ACLU of North Carolina filed an <a href=\"https://www.aclu.org/legal-document/students-fair-admissions-v-president-and-fellows-harvard-and-students-fair-admissions\">amicus brief</a> urging the Supreme Court to uphold universities’ ability to consider race in college admissions earlier this year.</p>\n  <div class=\"alignfullwidth mb-md wp-pullquote \">\n    <div class=\" wp-pullquote-inner\">\n      <p>If the court strikes down affirmative action — also known as race-conscious admissions policies — it would make it unconstitutional for universities across the country to consider a student’s race as one factor in a holistic admissions review process.</p>\n      \n          </div>\n  </div>\n<p>Below, we answer some of the key questions that you need to know about how race conscious admissions policies work, how students and universities benefit from them, and what’s at stake at the Supreme Court.</p>\n<p><b>Q: What is affirmative action, or race conscious admissions policies? </b></p>\n<p><b>A: </b>Race conscious policies, such as affirmative action, aim to address racial discrimination by recognizing and responding to the structural barriers that have denied underrepresented students access to higher education. Race-conscious admissions practices allow universities to consider a student’s race as one factor in the admissions process in order to help create a diverse student body that enriches the educational experiences of all students.</p>\n<p><b>Q: What cases are before the Supreme Court concerning race conscious admissions policies?</b></p>\n<p><b>A: </b>There are two cases in which the Supreme Court will consider whether to uphold universities’ ability to consider race in college admissions: <i>Students for Fair Admissions v. President and Fellows of Harvard, </i>and<i> Students for Fair Admissions v. University of North Carolina. </i>In both cases, the organization Students for Fair Admissions (SFFA), led by anti-affirmative action crusader Edward Blum, is <a href=\"https://www.supremecourt.gov/opinions/15pdf/14-981_4g15.pdf\">once again</a>, after previous failed efforts, seeking the elimination of all race-conscious admissions practices. Twice already, the Supreme Court has rejected Blum’s arguments and ruled that universities can consider race in admissions to promote diversity on campus and enrich students’ learning experience.</p>\n<p><b>Q: What legal rights do universities and colleges have to consider race in the admissions process? </b></p>\n<p><b>A: </b>Colleges have an important interest in student body diversity that furthers the values of academic freedom and equal protection. A holistic, race-conscious admissions process is the extension of a university’s academic freedom to assemble a diverse student body. Removing the consideration of race in admissions conflicts with the ability of a university to select its student body.</p>\n<p>Additionally, the consideration of race in college admissions furthers the values of equal protection under the Constitution by helping to diminish stereotypes, promoting integration on college campuses, and improving the ability of students of all races to participate in the academic community.</p>\n<p><b>Q: Has the Supreme Court ruled on affirmative action before?</b></p>\n<p><b>A: </b><i> </i>Yes. In <i>Fisher v. University of Texas</i>, the Supreme Court reaffirmed that diversity is a “compelling governmental interest,” permitting schools to consider race as a contributing factor to admissions in higher education. Time and again, lower courts and the Supreme Court have recognized this.</p>\n<p><b>Q: How do colleges, universities and students benefit from affirmative action? </b></p>\n<p><b>A: </b>Race-conscious admissions policies help create a diverse student body, promote integration on college campuses, and create an inclusive educational environment that benefits all students. Students from diverse backgrounds who learn from each other and are exposed to a variety of experiences, backgrounds, interests, and talents are better prepared to be successful in our society. Banning any consideration of race would hamper the growth of generations of students who will be unprepared for an increasingly diverse nation.</p>\n<p><b>Q: What’s at stake if the Supreme Court moves to block race conscious admissions policies? Will this impact affirmative action efforts in other areas, suchs as workplaces? </b></p>\n<p><b>A: </b>A decision blocking universities’ ability to consider race will almost certainly mean a significant drop in the number of students of color being admitted to selective universities. In fact, that’s what lower courts in both cases found after closely studying several race-neutral alternatives like a class-based affirmative action or plans similar to Texas’s top 10 percent plan, which guarantees Texas students who graduated in the top 10 percent of their high school class automatic admission to all state-funded Texas universities. Less diverse campuses will harm students of color and white students alike, and take us backward in our efforts to overcome the country’s shameful legacy of racism and racial inequality.</p>\n<p>A decision outlawing consideration of race in college admissions could also make it harder for employers to take steps to promote equity and diversify their workforce. Dozens of government programs that address past and current discrimination, advance racial equity, and seek to close the racial wealth gap, such as business incubator programs, could also be jeopardized.</p>\n<p><b>Q: What actions can colleges and universities take if the Supreme Court does rule to block race conscious admissions policies? </b></p>\n<p><b>A: </b>Higher ed institutions will still be able to do outreach and recruit students from all backgrounds. Universities will still be able to stop considering factors that have been proven to create unjustifiable barriers for historically underrepresented students of color. For example, many schools have already stopped considering SAT and the ACT.</p>\n<p>No matter what happens, we continue to advocate for race conscious admissions and ensuring higher education is accessible to all.</p>\n\t\t<div class=\"rss-cta__title\">We need you with us to keep fighting</div><a href=\"https://action.aclu.org/give/now\" class=\"rss-cta__button\">Donate today</a></div>",
  "source": "American Civil Liberties Union"
}