{
  "title": "Dust temperature uncertainties hamper the inference of dust and molecular gas masses from the dust continuum emission of quiescent high-redshift galaxies. (arXiv:2211.01526v1 [astro-ph.GA])",
  "link": "http://arxiv.org/abs/2211.01526",
  "description": "<p>Single flux density measurements at observed-frame sub-millimeter and\nmillimeter wavelengths are commonly used to probe dust and gas masses in\ngalaxies. In this Letter, we explore the robustness of this method to infer\ndust mass, focusing on quiescent galaxies, using a series of controlled\nexperiments on four massive haloes from the Feedback in Realistic Environments\n(FIRE) project. Our starting point is four star-forming, central galaxies at\nseven redshifts between z=1.5 and z=4.5. We generate modified quiescent\ngalaxies that have been quenched for 100Myr, 500Myr, or 1Gyr prior to each of\nthe studied redshifts by re-assigning stellar ages. We derive spectral energy\ndistributions for each fiducial and modified galaxy using radiative transfer.\nWe demonstrate that the dust mass inferred is highly dependent on the assumed\ndust temperature, T_dust, which is often unconstrained observationally.\nMotivated by recent work on quiescent galaxies that assumed T_dust~25K, we show\nthat the ratio between dust mass and 1.3mm flux density can be higher than\ninferred by up to an order of magnitude, due to the considerably lower dust\ntemperatures seen in non star-forming galaxies. This can lead to an\nunderestimation of dust mass (and, when sub-mm flux density is used as a proxy\nfor molecular gas content, gas mass). This underestimation is most severe at\nhigher redshifts, where the observed-frame 1.3mm flux density probes rest-frame\nwavelengths far from the Rayleigh-Jeans regime, and hence depends\nsuper-linearly on dust temperature. We fit relations between ratios of\nrest-frame far-infrared flux densities and mass-weighted dust temperature that\ncan be used to constrain dust temperatures from observations and hence derive\nmore reliable dust and molecular gas masses.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Cochrane_R/0/1/0/all/0/1\">R. K. Cochrane</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Hayward_C/0/1/0/all/0/1\">C. C. Hayward</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Angles_Alcazar_D/0/1/0/all/0/1\">D. Angl&#xe9;s-Alc&#xe1;zar</a>"
}