{
  "title": "S1E20 - Recognizing and Overcoming Abuse with Pro Golfer Tracy Hanson",
  "guid": "https://pinecast.com/guid/df8eb419-7892-43cd-b435-f620fc3203c1",
  "pubDate": "Tue, 20 Oct 2020 06:30:00 -0000",
  "itunes:duration": "00:45:44",
  "description": "<p>Laura welcomes professional golfer, Tracy Hanson, to the podcast today. After enjoying a successful All-American College golf career, Tracy went on to enjoy even more success on the Professional Ladies Golf Tour for 15 seasons before retiring in 2009. Within a year of her retirement, she embarked on a new journey, which included unpacking the truth about the harm and abuse she experienced as a child. Today, she joins Laura to courageously share her story and offer sage advice for all listeners.</p>\n<p>In this conversation, Tracy relates her history in sports, particularly in golf, and offers details regarding her role now as a counselor. She also shares the story of her abuse from its start of being ‘groomed’ to finally recognizing it as abuse, and its immense impact upon her life. Along the way she recounts her struggle of wrestling with her identity, the prominent role that her faith has played throughout her life, and how she has become a counselor for others who may be going through what she experienced. She and Laura discuss some organizations that offer help to athletes, including Tracy’s own non-profit, and Tracy offers valuable advice for athletes, parents, coaches, and anyone with similar experiences. So much of today’s episode is centered around a difficult but enormously important topic offering an equally important message delivered by a woman gifted not only with athletic prowess, but with unrivalled strength, perseverance, faith, and courage. This is an episode that needs to be heard by everyone.</p>\n<p>Episode Highlights:</p>\n<p>·       How Tracy got started in sports and specifically golf\n·       Her college experience and her transition to going professional\n·       Her most memorable golf tournament trip\n·       Tracy’s mindset when starting on the professional tour\n·       Tracy’s faith journey\n·       The abuse that she experienced\n·       What ‘grooming’ is\n·       <a href=\"https://safesport.org/\" rel=\"nofollow\">https://safesport.org/</a> resources\n·       Recognizing it as sexual abuse\n·       Wrestling with her identity\n·       Tracy’s advice for others with similar experiences\n·       Her work as a counselor and her motivation to do it\n·       Bringing all of who you are to your sport\n·       Being mind, body, soul, and spirit\n·       How COVID has affected Tracy’s life and ministry\n·       The Faith in Sport Institute\n·       Tracy’s golf experience now\n·       The Tracy Hanson Initiative\n·       Tracy’s parting words</p>\n<p>Quotes:</p>\n<p>“I’m not sure it was my dream to start with.”</p>\n<p>“Golf is just something to something bigger in your life.”</p>\n<p>“One person who started talking to me more about Jesus…also became an abuser in my life.”</p>\n<p>“I didn’t understand what was happening, and I didn’t feel safe to tell anybody.”</p>\n<p>“In the context of the coach who started grooming me, I felt and received a lot of those things that I was longing for from my dad.”</p>\n<p>“For athletes or non-athletes…we don’t understand what’s happening because we’re getting some really good things. We’re getting connectedness, we’re getting somebody who really is speaking life into us and who believes in us.”</p>\n<p>“The grooming is part of the abuse.”</p>\n<p>“Those hunches need to be followed through. So, that’s where I was missed.”</p>\n<p>“My golf career was just one of those numbing agents…I just tried to perform harder.”</p>\n<p>“God was really gentle with me.”</p>\n<p>“I was out there, I was sharing my faith, and I was being the Christian athlete, and yet, so empty inside. And that was the part that people didn’t know.”</p>\n<p>“You’re not alone. You’re not the only one who has experienced something horrific…there is or are people that want to be with you in that pain.”</p>\n<p>“There is somebody…that will believe you…take the risk to speak it out.”</p>\n<p>“I think counseling was the hardest and best thing that I’ve ever done in my life.”</p>\n<p>“I wanted to help young athletes get the help that I needed in my early 20’s instead of having to wait 20 years.”</p>\n<p>“I really just offer myself as a mentor/counselor for really life conversations, and spiritual conversations go, kind of, around that and in and through those conversations as well.”</p>\n<p>“Unfortunately, we don’t give athletes the freedom in our culture to be that human person.”</p>\n<p>“There’s so much power in just being able to name what’s true.”</p>\n<p>“My whole desire and purpose is to provide…safe opportunities for athletes to talk about their stories of trauma.”</p>\n<p>“If the stress and anxiety around the sport is outweighing the joy and the playfulness of it, then there’s something out of balance, and…they need to get some help.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a> \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Tracy:</p>\n<p>Website:   <a href=\"https://tracyhanson.com/\" rel=\"nofollow\">https://tracyhanson.com/</a>\nThe Tracy Hanson Initiative:   <a href=\"https://tracyhanson.com/ministry/\" rel=\"nofollow\">https://tracyhanson.com/ministry/</a></p>",
  "itunes:title": "Recognizing and Overcoming Abuse with Pro Golfer Tracy Hanson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 20
}