{
  "id": "yt:video:eesj3pJF3lA",
  "yt:videoId": "eesj3pJF3lA",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Wood Ash Cement & Fired Brick Hut",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2022-05-05T20:38:34+00:00",
  "updated": "2022-10-23T07:57:03+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Wood Ash Cement & Fired Brick Hut",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Primitive Technology: Wood Ash Cement & Fired Brick Hut\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nWatch my newest content: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nNewest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1&index=2\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1&index=2\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1&index=2\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1&index=2\n\nAbout This Video:\nI built a hut from fired clay bricks and mortared them together with a cement made from wood ash left over from the firing process. When I developed wood ash cement years ago in a previous video, it was in response to the need of a cement made from material other than lime stone, which is absent in my location. Wood ash was suitable because it contains calcium oxide, the active cementitious material for making mortar. I made clay bricks and fired them in a kiln made previously. Then I collected the wood ash and made them into pellets storing them for later use. When it was time to make the mortar, I put the pellets in the kiln and fired them. Here it's important to note that the ash needs to be fired at a high temperature with oxygen, ordinary ash from a camp fire won't work as is because they don't get hot enough. It needs to be pelletized and fired again in a kiln before use. I mixed the fired ash pellets with sand (1:3 ratio by volume) and used it to mortar the bricks together. It's important to use a trowel (flat piece of wood here) instead of bare hands to handle the mortar due to lye burning the skin (I got mild lye burns on my fingers). The ash left over from firing the bricks was enough to mortar those same bricks together. The hut was 2x2 m and 2 m high at the gables. Wooden beams were placed onto the gables to form the roof and secured in place with mortar. Then I made barrel roof tiles and lay them onto these beams. The whole project took 6 and a half months to build. The hut sheds rain well and the mortar is water proof (won't dissolve in water), surviving many rainstorms even before the roof was up. The main take away from this video is to always look for a way to take a waste material (wood ash) and make it into a resource (cement).\n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology #WoodAshCement #FiredBrickHut",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}