{
  "title": "Let The Women: Gemma Hoskins on the Murder of Sister Cathy Cesnik",
  "link": "https://audioboom.com/posts/8086106",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2809,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Gemma Hoskins remembers high school fondly, thanks in large part to her favorite teacher Sister Cathy Cesnik. So, when the beloved nun disappeared one November night in 1969 only to eventually be discovered dead in the woods, grief took hold over this ambiguous story for decades. And then, truth-telling around abuse in those hallowed halls merged with Gemma’s outstanding questions. 40 years after the murder, she got to work with the help of a former classmate of hers, and together they’d uncover more about the past than anyone expected.<br>\n<br>\nTo donate to the Sister Cathy Cesnik Fund for Survivors, visit <a href=\"https://www.srcathyfundforsurvivors.org/\">srcathyfundforsurvivors.org</a>.</div>\n<div>\n<br>\nThis episode is part of a ten-part series called<em> Let The Women Do The Work</em>. Join host Gillian Pensavalle as she follows the stories of ten dynamic, inspiring, badass women in true crime.<br>\n<br>\nThis week's sponsors:<br>\n<br>\nLiquid IV - Grab Liquid IV in bulk nationwide at Costco,<strong> </strong>or you can get 25% off when you go to <a href=\"https://www.liquid-iv.com/\">LiquidIV.com</a> and use the code \"Work\"<strong> </strong>at checkout.<br>\n<br>\nBillion Dollar Box - Build your own Billion Dollar Box at <a href=\"https://billiondollarbeauty.com/\">billiondollarbeauty.com</a> & receive 20% off your entire purchase when you enter code “WORK” at checkout.<br>\n<br>\nAthletic Greens - Athletic Greens will give you a FREE one-year supply of immune-supporting Vitamin D AND 5 FREE travel packs with your first purchase. All you have to do is visit <a href=\"https://athleticgreens.com/partner/d35ctoffer-lifestyle/en?utm_source=podcast&utm_medium=influencer&utm_campaign=womendothework_d35ct__a4060__o27&utm_term=cac__a4060__o27&utm_content=femalelifestyle__a4060__o27\">athleticgreens.com/WOMEN</a>.</div>\n",
  "pubDate": "Thu, 19 May 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-18:/posts/8086106",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}