{
  "title": "SLICER: Learning universal audio representations using low-resource self-supervised pre-training. (arXiv:2211.01519v1 [eess.AS])",
  "link": "http://arxiv.org/abs/2211.01519",
  "description": "<p>We present a new Self-Supervised Learning (SSL) approach to pre-train\nencoders on unlabeled audio data that reduces the need for large amounts of\nlabeled data for audio and speech classification. Our primary aim is to learn\naudio representations that can generalize across a large variety of speech and\nnon-speech tasks in a low-resource un-labeled audio pre-training setting.\nInspired by the recent success of clustering and contrasting learning paradigms\nfor SSL-based speech representation learning, we propose SLICER (Symmetrical\nLearning of Instance and Cluster-level Efficient Representations), which brings\ntogether the best of both clustering and contrasting learning paradigms. We use\na symmetric loss between latent representations from student and teacher\nencoders and simultaneously solve instance and cluster-level contrastive\nlearning tasks. We obtain cluster representations online by just projecting the\ninput spectrogram into an output subspace with dimensions equal to the number\nof clusters. In addition, we propose a novel mel-spectrogram augmentation\nprocedure, k-mix, based on mixup, which does not require labels and aids\nunsupervised representation learning for audio. Overall, SLICER achieves\nstate-of-the-art results on the LAPE Benchmark \\cite{9868132}, significantly\noutperforming DeLoRes-M and other prior approaches, which are pre-trained on\n$10\\times$ larger of unsupervised data. We will make all our codes available on\nGitHub.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Seth_A/0/1/0/all/0/1\">Ashish Seth</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ghosh_S/0/1/0/all/0/1\">Sreyan Ghosh</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Umesh_S/0/1/0/all/0/1\">S. Umesh</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Manocha_D/0/1/0/all/0/1\">Dinesh Manocha</a>"
}