{
  "title": "How (Not) to Reform India's Affirmative Action Policies for its Economically Weaker Segments. (arXiv:2210.10166v2 [econ.GN] UPDATED)",
  "link": "http://arxiv.org/abs/2210.10166",
  "description": "<p>Various groups in India are protected with a vertical reservation (VR)\npolicy, which sets aside a share of public positions for these groups.\nVR-protected positions are processed by law after those open to all, assuring\nthat they are awarded to individuals who do not merit open positions.\nHistorically, VR protections were exclusive to groups who suffered\ndiscrimination due to their caste identities. This structure means that no\nindividual can belong to multiple VR-protected groups, which implies that the\nprocessing sequence of VR-protected groups is immaterial. A Constitutional\nAmendment in 2019 granted economically weaker sections (EWS) VR protections,\nbut limited its eligibility to members of upper castes who are ineligible for\ncaste-based VR protections. The amendment was immediately brought to court, and\nthe exclusion of caste-based VR-protected groups was challenged due to its\nviolation of Right to Equality. A compromise that emerged at the Supreme Court\ninvolves maintaining the amendment, but expanding its scope to include the\nexcluded groups. If this policy is adopted, individuals can belong to multiple\nVR-protected groups. We show that a major loophole will emerge, if the Supreme\nCourt only expands the scope of EWS without specifying how its positions are\nprocessed. Depending on which normative objective the court wants to promote,\nwe formulate and characterize three plausible specifications. If EWS is\nprocessed simultaneously with other VR-protected groups, then the outcome is\none that selects the most meritorious individuals subject to the Court's\nmandates. If EWS is processed before other VR-protected groups, then the\noutcome maintains the elevated status of caste-based VR protections. If EWS is\nprocessed after other VR-protected groups, then the outcome is the smallest\npossible change from the contested amendment that escapes a violation of Right\nto Equality.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/econ/1/au:+Sonmez_T/0/1/0/all/0/1\">Tayfun S&#xf6;nmez</a>, <a href=\"http://arxiv.org/find/econ/1/au:+Unver_U/0/1/0/all/0/1\">Utku &#xdc;nver</a>"
}