{
  "title": "Saudi Arabia fears imminent attack from Iran – WSJ",
  "link": "https://www.rt.com/news/565763-saudi-arabia-iran-attack/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565763-saudi-arabia-iran-attack/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63618a1b85f54015db63a231.jpg\" /> Saudi Arabia has told the US that it is expecting an imminent attack from Iran, the Wall Street Journal reported on Tuesday <br/><a href=\"https://www.rt.com/news/565763-saudi-arabia-iran-attack/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Iran has accused foreign powers of instigating a wave of anti-government demonstrations</strong></p>\n            \n                        \n            <p>Saudi Arabia has warned US intelligence officials of an imminent attack on its territory from Iran, the Wall Street Journal reported on Tuesday. While no details of the intelligence in question was revealed by the newspaper, American, Saudi and allied forces in the Middle East have reportedly been placed on high alert.</p>\n<p>Iran intends to attack both the Kingdom itself and the Iraqi city of Erbil, where US troops are stationed, the officials told their American counterparts, according to the WSJ.</p>\n<p>Later on Tuesday, Pentagon Press Secretary Patrick Ryder told reporters that the US was <em>&ldquo;concerned about the threat situation,&rdquo;</em> and reserved <em>&ldquo;the right to protect and defend ourselves no matter where our forces are serving, whether in Iraq or elsewhere.&rdquo;</em> Just like the Wall Street Journal, Ryder offered no further details of the alleged threat.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635a3f5e2030272f315844b2.jpg\" alt=\"FILE PHOTO. A demonstration in support of protests in Iran in Paris, France, on October 09, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565425-iran-retaliation-eu-sanctions/\">Iran announces retaliation against the EU</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Iranian forces have struck Erbil on several occasions this year, <a href=\"https://www.rt.com/news/553020-us-sanctions-iran-missiles/\" target=\"_blank\" rel=\"noopener noreferrer\">firing</a> a dozen ballistic missiles at the city in March and launching more missiles and drones since late September. Tehran <a href=\"https://archive.ph/Mf10s\" target=\"_blank\" rel=\"noopener noreferrer\">said</a> that the latest strikes were aimed at Kurdish <em>&ldquo;terrorist groups&rdquo;</em> operating near the Iraqi city.</p>\n<p>Iran has accused foreign powers &ndash; specifically the US, Israel, and Saudi Arabia &ndash; of instigating a wave of anti-government demonstrations across the country in recent weeks. The commander of Iran&rsquo;s Islamic Revolutionary Guard Corps, General Hossein Salami, publicly accused Riyadh last month of <em>&ldquo;interfering in our internal affairs&rdquo;</em> through media coverage of the protests.</p>\n<p><em>&ldquo;You are involved in this matter and know that you are vulnerable,&rdquo;</em> Salami warned the Saudis, according to the Wall Street Journal. It is unclear whether the latest alert is connected with the Iranian commander&rsquo;s statement.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Tue, 01 Nov 2022 21:08:42 +0000",
  "dc:creator": "RT"
}