{
  "id": "yt:video:m0G-0VRRu24",
  "yt:videoId": "m0G-0VRRu24",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "MERCURY-REDSTONE 4 SPLASHDOWN & LOSS OF LIBERTY BELL 7 CAPSULE  GUS GRISSOM JULY 21, 1961  XD48204",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-02T16:29:48+00:00",
  "updated": "2022-11-04T17:24:52+00:00",
  "media:group": {
    "media:title": "MERCURY-REDSTONE 4 SPLASHDOWN & LOSS OF LIBERTY BELL 7 CAPSULE  GUS GRISSOM JULY 21, 1961  XD48204",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Want to support this channel and help us preserve old films? Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis television feed shows the splashdown, attempted recovery and loss of the Mercury-Redstone 4's Liberty Bell 7 capsule. The loss occurred as a result of the accidental deployment of the capsule's hatch, which was equipped with an emergency explosive release system. Astronaut Virgil \"Gus\" Grissom was rescued without injury and flown to the aircraft carrier USS Randolph for evaluation. Commentary in the film is provided by Jules Bergman, ABC's science editor, as well as correspondent Robert Lodge. \n\nMercury-Redstone 4 was the second United States human spaceflight, on July 21, 1961. The flight was suborbital and lasted 15 minutes 30 seconds, reached an altitude of more than 102.8 nautical miles (190.4 km), and flew 262.5 nautical miles (486.2 km) downrange, landing in the Atlantic Ocean. The capsule was recovered in 1999. Grissom later flew in Gemini III, and then tragically died in the Apollo 1 fire in 1967.\n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}