{
  "guid": "urn:uuid:da88f60f-7448-4878-8ef0-306ff20bd331",
  "link": "https://www.who.int/news/item/28-10-2022-who-launches-4th-health-for-all-film-festival",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO launches 4th Health for All Film Festival",
  "description": "<p>WHO has launched a call for short films for the 4th edition of the Health for All Film Festival.&nbsp;</p><p>&ldquo;The WHO Health for All Film Festival has become an incredible platform for telling powerful stories from around the world about people who face all kinds of health challenges, and those who devote their lives to improving health,&rdquo; said WHO Director-General, Dr Tedros Adhanom Ghebreyesus. &ldquo;Films provide an authentic way for affected people to connect with others and contribute to a better understanding of the communities we serve.&rdquo;<br /></p><p>The call for short films (up to 8 minutes long) opens on 31 October 2022 and will close on 31 January 2023. WHO invites public institutions, nongovernmental organizations, communities of patients and of health workers, students in public health and film schools from around the world to submit their original short film. The festival is also open to independent film-makers, production companies and TV broadcasters.</p><p>Around 70 shortlisted films will be presented to the public in April 2023 via WHO&rsquo;s Youtube channel and <a href=\"https://www.who.int/initiatives/the-health-for-all-film-festival\">website</a>. From this list, a jury of distinguished professionals, artists, activists and senior experts at WHO will select the award-winning films. Sharon Stone, critically acclaimed actress from the USA and public advocate of health and humanitarian issues, has confirmed that she will join the jury again in 2023, having participated in the 2022 festival. (<a href=\"https://youtu.be/ahM7dwXZs8k\">https://youtu.be/ahM7dwXZs8k</a>). </p><p>Three &ldquo;GRAND PRIX&rdquo; will be awarded, one for each main category, aligned with WHO&rsquo;s major global public health goals: universal health coverage, health emergencies, better health and wellbeing. There will also be special prizes for films about climate change and health, sexual and reproductive health and rights, a student-produced film, and a very short film (1&rsquo; to 2&rsquo;30&rdquo; in length).&nbsp;</p><p>Winning films from the festival are helping to increase awareness and support for key health issues worldwide. With an average of&nbsp;1150 submissions each year from 110 countries, the films are increasingly being used by other institutions and partners for health promotion and education, and future synergies are being explored with WHO Academy and <a href=\"https://www.who.int/initiatives/behavioural-sciences\">WHO Behavioural Insights programme</a>.&nbsp;</p><p>&ldquo;Storytelling is an engagement between people. It&rsquo;s not just someone making a film, it&rsquo;s someone watching a film,&rdquo; said WHO Executive Director of Health Emergencies Programme, Dr Mike Ryan, film festival juror in 2021.&nbsp;&ldquo;This is exactly how WHO should be transforming: Transforming how we engage with the world and this festival is just one example of how we can change our mindset.&rdquo;</p><p>In honour of WHO&rsquo;s 75th anniversary in 2023, this call for films is also exceptionally open to historical films and to recent films by students sharing their vision about current challenges and&nbsp; future solutions to improve health. A special playlist will be created to highlight these testimonies.</p><p align=\"center\">* * *<br /></p><p>For more details, visit the multilingual festival website:&nbsp;<a href=\"https://www.who.int/film-festival\" target=\"_blank\">https://www.who.int/film-festival</a></p><p>&nbsp;</p>",
  "pubDate": "Thu, 27 Oct 2022 17:17:19 Z"
}