{
  "title": "Ten Percent Less Democracy with Garett Jones",
  "pubDate": "Mon, 23 Mar 2020 20:59:26 +0000",
  "guid": "e268044f-f9e4-4bf3-9dcf-40766dd2da2e",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP141Jones_EDR.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/10-Less-Democracy-Should-Elites-ebook/dp/B07ZTN8LRJ/ref=as_li_ss_il?crid=293QXPS5AX2ZF&keywords=garett+jones&qid=1584996925&sprefix=Garett+Jones,aps,203&sr=8-1&linkCode=li3&tag=economicsde0f-20&linkId=55fc17cee020df3d09cdd743e40ab131&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B07ZTN8LRJ&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=B07ZTN8LRJ\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Garett Jones returns to the podcast to discuss his book, <a href=\"https://amzn.to/3acA6Sw\" target=\"_blank\" rel= \"noopener\">10% Less Democracy: Why You Should Trust Elites a Little More and the Masses a Little Less</a>.</p> <blockquote>During the 2016 presidential election, both Donald Trump and Bernie Sanders argued that elites were hurting the economy. But, drawing together evidence and theory from across economics, political science, and even finance, Garett Jones says otherwise. In 10% Less Democracy, he makes the case that the richest, most democratic nations would be better off if they slightly reduced accountability to the voting public, turning up the dial on elite influence.<br /> <br /> To do this, Jones builds on three foundational lines of evidence in areas where he has personal experience. First, as a former staffer in the U.S. Senate, he saw how senators voted differently as elections grew closer. Second, as a macroeconomist, Jones knows the merits of \"independent\" central banks, which sit apart from the political process and are controlled by powerful insiders. The consensus of the field is that this detached, technocratic approach has worked far better than more political and democratic banking systems. Third, his previous research on the effects of cognitive skills on political, social, and economic systems revealed many ways in which well-informed voters improve government.<br /> <br /> Discerning repeated patterns, Jones draws out practical suggestions for fine-tuning, focusing on the length of political terms, the independence of government agencies, the weight that voting systems give to the more-educated, and the value of listening more closely to a group of farsighted stakeholders with real skin in the game—a nation's sovereign bondholders. Accessible to political news junkies while firmly rooted and rigorous, 10% Less Democracy will fuel the national conversation about what optimal government looks like.</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/10-Less-Democracy-Should-Elites-ebook/dp/B07ZTN8LRJ/ref=as_li_ss_il?crid=293QXPS5AX2ZF&keywords=garett+jones&qid=1584996925&sprefix=Garett+Jones,aps,203&sr=8-1&linkCode=li3&tag=economicsde0f-20&linkId=55fc17cee020df3d09cdd743e40ab131&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Garett Jones returns to the podcast to discuss his book, <a href=\"https://amzn.to/3acA6Sw\" target=\"_blank\" rel= \"noopener\">10% Less Democracy: Why You Should Trust Elites a Little More and the Masses a Little Less</a>.</p> During the 2016 presidential election, both Donald Trump and Bernie Sanders argued that elites were hurting the economy. But, drawing together evidence and theory from across economics, political science, and even finance, Garett Jones says otherwise. In 10% Less Democracy, he makes the case that the richest, most democratic nations would be better off if they slightly reduced accountability to the voting public, turning up the dial on elite influence.  To do this, Jones builds on three foundational lines of evidence in areas where he has personal experience. First, as a former staffer in the U.S. Senate, he saw how senators voted differently as elections grew closer. Second, as a macroeconomist, Jones knows the merits of \"independent\" central banks, which sit apart from the political process and are controlled by powerful insiders. The consensus of the field is that this detached, technocratic approach has worked far better than more political and democratic banking systems. Third, his previous research on the effects of cognitive skills on political, social, and economic systems revealed many ways in which well-informed voters improve government.  Discerning repeated patterns, Jones draws out practical suggestions for fine-tuning, focusing on the length of political terms, the independence of government agencies, the weight that voting systems give to the more-educated, and the value of listening more closely to a group of farsighted stakeholders with real skin in the game—a nation's sovereign bondholders. Accessible to political news junkies while firmly rooted and rigorous, 10% Less Democracy will fuel the national conversation about what optimal government looks like. ",
  "enclosure": "",
  "itunes:duration": "57:27",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Garett Jones returns to the podcast to discuss his book, . During the 2016 presidential election, both Donald Trump and Bernie Sanders argued that elites were hurting the economy. But, drawing together evidence and theory from across economics,...",
  "itunes:episode": 141,
  "itunes:episodeType": "full"
}