{
  "title": "527: In Defense of Hufflepuff House",
  "link": "https://audioboom.com/posts/7928734",
  "itunes:episode": 527,
  "itunes:title": "In Defense of Hufflepuff House",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4600,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Coming off of the success of our last episode where we <a href=\"https://www.mugglecast.com/episode-526-in-defense-of-slytherin-house/\">defended Slytherin House</a>, the MuggleCasters turn their sights to that other maligned Hogwarts house: Hufflepuff! Join Andrew, Eric, Micah and Laura as they discuss the qualities possessed by Hufflepuff students, examine why Hufflepuff does not get much glory in the books, and why everyone should want to know a Hufflepuff in real life. All that and more, on MuggleCast episode 527!<br>\n<br>\n\n</div>\n<ul>\n<li>Important: Only one week remains to select your 2021 MuggleCast patrons physical gift! Join us at <a href=\"https://www.patreon.com/mugglecast\">Patreon</a> and make your selection between our retro throwback socks and the customizable wooden car <strong>by September 1st!</strong>\n</li>\n<li>We begin the episode with a fun segment, \"The Top 5 Most Disparaging Scenes Featuring Hufflepuff\"!</li>\n<li>Main Discussion: While they may have been \"picked last for kickball\" in the books, Hufflepuffs may represent the best of us.</li>\n<li>A brief video <a href=\"https://www.youtube.com/watch?v=Smu0RneksxI\">of the author</a> from after the books were published seems conciliatory to all Hufflepuffs burned by their book representation.</li>\n<li>What do traits such as \"just\" and \"loyal\" mean? What are the values of hard work and patience, and why do Hufflepuffs prefer to walk the quiet road to glory?</li>\n<li>Helga Hufflepuff's philosophy of \"I'll teach the lot, and train them up the same\" is actually the best policy when it comes to education, Laura explains.</li>\n<li>Eric shares which moments from the <a href=\"https://www.wizardingworld.com/outcome/hufflepuff\">Hufflepuff Welcome Letter</a> made him feel most at home in his new house.</li>\n<li>Other famous Hufflepuffs: from Newt AND his brother Theseus, to Helga herself, Hepzibah Smith, the founder of Hogsmeade and more, just which witches and wizards wore the badger when they were at Hogwarts?</li>\n<li>Each hosts says something nice about Hufflepuff House and listeners give their thoughts!</li>\n<li>Quizzitch: What conceals the entrance to the Hufflepuff Common Room? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by UE Fits True Wireless, Custom Fit Earbuds (Get 15% off your order by going to <a href=\"http://www.UE.com/fits\">UE.com/fits</a> and using promo code MUGGLECAST at checkout) and BetterHelp (Get 10% off your first month at <a href=\"http://BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 24 Aug 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-08-23:/posts/7928734",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}