{
  "title": "Against the outrage economy: a proposal",
  "link": "https://rinzewind.org/blog-en/2020/against-the-outrage-economy-a-proposal.html",
  "description": "<p>Internet <em>content</em> (be it a news article, a song, a thirty-second clip, etc) is \nmostly paid for by advertising. While subscription models do indeed exist and \nthere is a gradation to them<sup id=\"fnref:paid\"><a class=\"footnote-ref\" href=\"#fn:paid\">1</a></sup>, they are still a minority. Terms like \n<a href=\"https://en.wikipedia.org/wiki/Surveillance_capitalism\"><em>surveillance capitalism</em></a> should surprise absolutely no one at \nthis point. The classical example are social media users, who not only work to \nkeep the machine running by providing content for free, but at the same time \ngenerate information, either directly or in more subtle, second-order ways, that \nis processed to provide advertisers with optimal matches, so that they can place \ntheir advertisements in front of interested customers.</p>\n<p>The key here, from the businesses' point of view, is <em>user engagement</em>, or how \nmuch time a given user spends on a given site. Taking this to the analog (or \nformerly analog) world, remember that <a href=\"https://taibbi.substack.com/p/tape-shows-ethically-cnn-chief-a\">Trump is very good for news \nnetworks</a>. Anything that keeps the largest amount of people glued to \nthe screen for the longest period of time helps achieve the best possible \noutcome, at least according to some metrics. This is why YouTube <a href=\"https://www.buzzfeednews.com/article/carolineodonovan/down-youtubes-recommendation-rabbithole\">is a rabbit \nhole</a> and why the <a href=\"https://novaramedia.com/2020/07/31/outrage-drives-clicks-rage-sells-stories-the-brutal-economy-of-the-culture-war/\"><em>outrage economy</em></a> works. No one will \ncomplain if a network is turned into a cesspool as long as the quarterly earning \nreports go in the <em>correct</em> direction.</p>\n<p>Thus, by design, there is a lack of context in this system. <em>User engagement</em> is \ntypically measured in time, but there are no emotional tags attached to that \ninteraction window: a person was looking at our site for 5 minutes, but we do \nnot know anything about the quality of those 5 minutes. Was the person reading \narticles that were making her be happier? Did she reach those articles because a \nfriend <a href=\"https://www.jamescullenthewriter.com/post/2019/10/22/does-posting-social-media-content-for-hate-shares-work\">hate-shared</a> them, and is probably having a negative reaction? This \nis not important because it runs counter to the basic premise: more <em>engagement</em> \nleads to more ads being shown, so it has to be <em>good</em>. Hence, the Trump effect \nthat we mentioned above, etc. Any other consideration is \nsecondary<sup id=\"fnref:externality\"><a class=\"footnote-ref\" href=\"#fn:externality\">2</a></sup>. </p>\n<p>However, companies (and therefore advertisers) do care about the \ncontext<sup id=\"fnref:friedman\"><a class=\"footnote-ref\" href=\"#fn:friedman\">3</a></sup>; there can be such a thing as bad publicity. We know that in \nthe past ads have been pulled from YouTube videos due to concerns about certain \ncontent (see for instance, <a href=\"https://techcrunch.com/2019/02/20/companies-including-nestle-epic-and-reportedly-disney-suspend-youtube-ads-over-child-exploitation-concerns/\">1</a>, <a href=\"https://www.axios.com/googles-ad-crisis-reaches-the-us-1513301112-d9d2792c-256d-4c36-9c41-b36b8a528b72.html\">2</a>), and the same goes for \n<a href=\"https://www.cnn.com/2020/07/01/tech/facebook-top-advertisers/index.html\">Facebook</a> or <a href=\"https://www.cnbc.com/2020/06/26/unilever-pauses-facebook-and-twitter-advertising-for-rest-of-2020-due-to-polarized-atmosphere-in-us.html\">Twitter</a>. These are blanket bans because the \ngranularity that typical ad management systems provide (allow or deny ad sales \nfor certain keywords, geolocations, etc) does not allow to filter for the \nemotional aspect. Companies might still want to keep their advertisements up if \nthey are shown along content that is not perceived as negative by the eyeballs \nbeing sold to the other side of the screen.</p>\n<p>Right now, there is no way to signal our intentions when sharing a link. Every \nshare is assumed to be neutral, but we know it is not. Plenty of traffic is \ndriven by people that link to news articles, retweet tweets or share posts with\nnegative comments attached to them; other users in their immediate social circle \nwill see in a very similar light.</p>\n<p>A few years back, <a href=\"https://en.wikipedia.org/wiki/Spam_in_blogs\">blog spam</a> was a problem<sup id=\"fnref:blogproblem\"><a class=\"footnote-ref\" href=\"#fn:blogproblem\">4</a></sup>: automated \nbots took over the comment systems of popular blogging software and kept posting \nlinks to the websites of whoever was controlling them with the purpose of \naltering their rank in search engines. After a while, <a href=\"https://en.wikipedia.org/wiki/Nofollow\"><code>rel=nofollow</code></a> \nwas proposed as a solution: it signaled search engines that they should not take \nthose links into account when computing the importance of the target pages. \nAfter a time, most if not all blog engines automatically included this tag in \ncomment links. It was a technical solution, but also an economic one: it was \ndesigned to lower the profitability of spammers' methods by not letting their \npages appear among the first search results. <a href=\"http://taint.org/2006/05/31/111003a.html\">It did not end the \nproblem</a>, but it was something.</p>\n<p>The proposal I am presenting here works in a similar way. Users should be able \nto tag content that is being shared in a negative light, so that advertisers on \nthe target page know that they would be placing their products in an adverse \ncontext; under these conditions, perhaps they would prefer not to bid for any ad \nat all. It is not technology, but business logic.</p>\n<p>Why would someone use this? Let's take a look at the incentives here: users \nwould use this to <em>starve the beast</em>, knowing that now they can link to media \nsites or articles they do not like with the expectation that visits coming from \ntheir links will not be monetized. Advertisers would be better off, as this \nwould help them to better allocate resources. <em>Content</em> sites (for instance, \nnewspapers) might take a look at the type of articles they are publishing. \nLastly, social media sites would absolutely be delighted with the idea<sup id=\"fnref:not\"><a class=\"footnote-ref\" href=\"#fn:not\">5</a></sup>, as \nit would help their stated purpose of bringing communities together in peace and \nlove and harmony.</p>\n<p>A lot would need to change for this to happen. Interfaces would need to change \n(<em>\"I am hate-sharing / mocking / joining the mob here\"</em>); browsers would need to \nrecognize whatever tagging system is used to send the proper headers over to the \ntarget page; ad systems would have to recognize this and let their clients \nrecord their preferences when this tag is present; users would need to \nunderstand why this is an option and what effects it has, etc. I am not saying \nthis would be an easy thing and I'm not offering any particular implementation \ndetails, mostly because I just have a high-level diagram in my head, but having \nthe idea out there in written form cannot hurt.</p>\n<p>Of course, a better solution would be for people to stop contributing to the \noutrage, but that would be asking them to <a href=\"https://arxiv.org/pdf/1309.2402v1.pdf\">stop being humans</a>, so it \nis not even a starting point. This proposal offers a way out: you can still \nshare that thing you want to mock, and at the same time you can send a signal \nthat ad money spent on any resulting traffic would probably we wasted.</p>\n<div class=\"footnote\">\n<hr>\n<ol>\n<li id=\"fn:paid\">\n<p>there is for instance the <a href=\"https://www.ft.com\">Financial Times</a>, which is completely \n  closed to non-subscribers; mini-subscription services such as <a href=\"https://www.substack.com\">Substack</a>, \n  which allow some content to be posted in the open; newspapers like the <a href=\"https://www.nytimes.com\">New \n  York Times</a>, which allow a certain number of articles to be read for free \n  every month, etc.&#160;<a class=\"footnote-backref\" href=\"#fnref:paid\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:externality\">\n<p>meaning that someone else will hopefully deal with the resulting \n  mess.&#160;<a class=\"footnote-backref\" href=\"#fnref:externality\" title=\"Jump back to footnote 2 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:friedman\">\n<p>a more cynical approach (thanks, Milton Friedman) is that companies \n  (should pretend to) care about what consumers think they should care about, if \n  and only if that can potentially impact the bottom line. It would be the \n  sister theory for Keynes' <a href=\"https://en.wikipedia.org/wiki/Keynesian_beauty_contest\"><em>beauty contest</em></a>.&#160;<a class=\"footnote-backref\" href=\"#fnref:friedman\" title=\"Jump back to footnote 3 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:blogproblem\">\n<p>when blogs ruled the Earth.&#160;<a class=\"footnote-backref\" href=\"#fnref:blogproblem\" title=\"Jump back to footnote 4 in the text\">&#8617;</a></p>\n</li>\n<li id=\"fn:not\">\n<p>not.&#160;<a class=\"footnote-backref\" href=\"#fnref:not\" title=\"Jump back to footnote 5 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
  "dc:creator": "José María Mateos",
  "pubDate": "Mon, 14 Sep 2020 15:41:00 -0400",
  "guid": "tag:rinzewind.org,2020-09-14:/blog-en/2020/against-the-outrage-economy-a-proposal.html",
  "category": "Blog"
}