{
  "title": "SyncTalkFace: Talking Face Generation with Precise Lip-Syncing via Audio-Lip Memory. (arXiv:2211.00924v2 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2211.00924",
  "description": "<p>The challenge of talking face generation from speech lies in aligning two\ndifferent modal information, audio and video, such that the mouth region\ncorresponds to input audio. Previous methods either exploit audio-visual\nrepresentation learning or leverage intermediate structural information such as\nlandmarks and 3D models. However, they struggle to synthesize fine details of\nthe lips varying at the phoneme level as they do not sufficiently provide\nvisual information of the lips at the video synthesis step. To overcome this\nlimitation, our work proposes Audio-Lip Memory that brings in visual\ninformation of the mouth region corresponding to input audio and enforces\nfine-grained audio-visual coherence. It stores lip motion features from\nsequential ground truth images in the value memory and aligns them with\ncorresponding audio features so that they can be retrieved using audio input at\ninference time. Therefore, using the retrieved lip motion features as visual\nhints, it can easily correlate audio with visual dynamics in the synthesis\nstep. By analyzing the memory, we demonstrate that unique lip features are\nstored in each memory slot at the phoneme level, capturing subtle lip motion\nbased on memory addressing. In addition, we introduce visual-visual\nsynchronization loss which can enhance lip-syncing performance when used along\nwith audio-visual synchronization loss in our model. Extensive experiments are\nperformed to verify that our method generates high-quality video with mouth\nshapes that best align with the input audio, outperforming previous\nstate-of-the-art methods.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Park_S/0/1/0/all/0/1\">Se Jin Park</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kim_M/0/1/0/all/0/1\">Minsu Kim</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hong_J/0/1/0/all/0/1\">Joanna Hong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Choi_J/0/1/0/all/0/1\">Jeongsoo Choi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ro_Y/0/1/0/all/0/1\">Yong Man Ro</a>"
}