{
  "title": "Boosting (in Machine Learning) as a Metaphor for Diverse Teams",
  "link": "https://www.becomingadatascientist.com/2016/08/06/boosting-in-machine-learning-as-a-metaphor-for-diverse-teams/",
  "comments": "https://www.becomingadatascientist.com/2016/08/06/boosting-in-machine-learning-as-a-metaphor-for-diverse-teams/#comments",
  "pubDate": "Sun, 07 Aug 2016 00:42:08 +0000",
  "dc:creator": "Renee",
  "category": "Uncategorized",
  "guid": "https://www.becomingadatascientist.com/?p=1130",
  "description": "Boosting ensemble algorithms in Machine Learning use an approach that is similar to assembling a diverse team with a variety of strengths and experiences. If machines make better decisions by combining a bunch of “less qualified opinions” vs “asking one expert”, then maybe people would, too.",
  "content:encoded": "<p><strong>Note &#8211; I wrote this article in one sitting, and definitely want to come back later to improve it and add references, but I don&#8217;t want to hold it up from being published just because I&#8217;m hungry for dinner. :) So I&#8217;m hitting publish, but please be aware that the content may change later. And feel free to give suggestions in the comments. -Renee</strong></p>\n<p><em>tl;dr: Boosting ensemble algorithms in Machine Learning use an approach that is similar to assembling a diverse team with a variety of strengths and experiences. If machines make better decisions by combining a bunch of &#8220;less qualified opinions&#8221; vs &#8220;asking one expert&#8221;, then maybe people would, too.</em></p>\n<p><strong>Why is this post on this blog?</strong></p>\n<p>I&#8217;ve been thinking a lot about diversity in tech lately. After the <a href=\"https://twitter.com/search?q=%23FBNoExcuses\" target=\"_blank\">#FBNoExcuses</a> conversations on twitter, I was motivated to start <a href=\"http://www.untappedpipeline.com/\" target=\"_blank\">UntappedPipeline.com</a> (on twitter:<a href=\"https://twitter.com/untappdpipeline\" target=\"_blank\">@untappdpipeline</a>) because I know so many awesome women and people of color in tech, and it amazes me that some companies seem to think they are so rare and hard to find (hence <a href=\"http://www.wsj.com/articles/facebook-blames-lack-of-available-talent-for-diversity-problem-1468526303\" target=\"_blank\">using the &#8220;pipeline problem&#8221; as an excuse</a> for not having a diverse workforce).</p>\n<p>Of course, &#8220;diversity&#8221; can mean a lot of things: gender diversity, racial/ethnic diversity, diversity of educational backgrounds, etc. &#8211; but it all really comes down to diversity of culture/thoughts. If you are interested in learning more about diversity in tech and the benefits of hiring diverse teams, check out <a href=\"http://www.untappedpipeline.com/resources/\" target=\"_blank\">the Resources page on UntappedPipeline.com</a>. Here&#8217;s one study in particular that highlights the economic benefits of a diverse tech workforce: <a href=\"http://www.dalberg.com/wp-content/uploads/2016/06/Diversity_report_6.20.16x.pdf\" target=\"_blank\">Decoding Diversity</a> (Dalberg/Intel, PDF).</p>\n<p>So if this post is about diversity, why am I writing it on my &#8220;Becoming a Data Scientist&#8221; blog instead of at Untapped Pipeline? Because I&#8217;ve been doing some machine learning lately that I just realized is a great metaphor for the benefits of hiring diverse teams, and this is also an opportunity to explain a data science concept. Additionally, <a href=\"https://twitter.com/BecomingDataSci/status/547479599303892992\" target=\"_blank\">I&#8217;ve been talking</a> <a href=\"https://twitter.com/BecomingDataSci/status/731689507691487233\" target=\"_blank\">about data science</a> <a href=\"https://twitter.com/BecomingDataSci/status/714167833781862400\" target=\"_blank\">teams for a</a> <a href=\"https://twitter.com/BecomingDataSci/status/636745462486278144\" target=\"_blank\">long time</a>, and one of my motivations for starting the <a href=\"https://www.becomingadatascientist.com/category/podcast/\" target=\"_blank\">Becoming a Data Scientist podcast</a> was to feature the many paths people take to data science, because <a href=\"https://en.wikipedia.org/wiki/Data_science\" target=\"_blank\">data science in itself is an interdisciplinary job</a> that requires a variety (diversity) of experience: primarily in statistics, computer programming, and &#8220;business&#8221; (or domain knowledge), but really there is a very broad set of skills that come into play when doing data science, and no one has them all (<a href=\"https://ironholds.org/blog/data-science-is-not-magical-unicorn-foo/\" target=\"_blank\">relevant rant</a> by <a href=\"https://twitter.com/quominus\" target=\"_blank\">@quominus</a>). I will list some references about building Data Science teams at the end of the post.</p>\n<p>There are two <a href=\"https://en.wikipedia.org/wiki/Machine_learning\" target=\"_blank\">machine learning</a> algorithms I&#8217;ve used recently that illustrate the specific <a href=\"https://en.wikipedia.org/wiki/Category:Ensemble_learning\" target=\"_blank\">&#8220;ensemble learning&#8221;</a> concept I want to focus on: <a href=\"http://scikit-learn.org/stable/modules/generated/sklearn.ensemble.RandomForestClassifier.html\" target=\"_blank\">Random Forest</a> and <a href=\"http://scikit-learn.org/stable/modules/generated/sklearn.ensemble.GradientBoostingClassifier.html#sklearn.ensemble.GradientBoostingClassifier\" target=\"_blank\">Gradient Boosting</a> Classifiers.</p>\n<p><strong>Random Forest</strong></p>\n<p>A <a href=\"https://en.wikipedia.org/wiki/Random_forest\" target=\"_blank\">Random Forest</a> Classifier works like this: You may have heard of <a href=\"https://en.wikipedia.org/wiki/Decision_tree\" target=\"_blank\">Decision Trees</a>, which are pretty much just &#8220;if then&#8221; classifiers that end up generating a set of rules: &#8220;If Attribute 1 is in this range of values, and Attribute 2 is this boolean value, and Attribute 3 is greater than this value, then out of all of the possible results, this one is most likely.&#8221; Every example you feed into it will drop into one of the possible outcomes, with a certain probability of being correct. The article &#8220;<a href=\"http://www.r2d3.us/visual-intro-to-machine-learning-part-1/\" target=\"_blank\">A Visual Introduction to Machine Learning</a>&#8221; has a great animated illustration of how decision trees work.</p>\n<p>What a Random Forest does is build up a whole bunch of &#8220;dumb&#8221; decision trees by only analyzing a subset of the data at a time. A limited set of features (columns) from a portion of the overall records (rows) is used to generate each decision tree, and the &#8220;depth&#8221; of the tree (and/or size of the &#8220;leaves&#8221;, the number of examples that fall into each final bin) is limited as well. So the trees in the model are &#8220;trained&#8221; with only a portion of the available data and therefore don&#8217;t indivisually generate very accurate classifications. </p>\n<p>However, it turns out that when you combine the results of a bunch of these &#8220;dumb&#8221; trees (also known as &#8220;weak learners&#8221;), the combined result is usually even better than the most finely-tuned single full decision tree. (So you can see how the algorithm got its name &#8211; a whole bunch of small trees, somewhat randomly generated, but used in combination is a random forest!) </p>\n<p>When you combine multiple methods to determine a result in machine learning, it is called ensemble learning. In particular, when you use a bunch of weak learners and combine them by having them vote on the outcome (whichever outcome occurs most often for a particular record wins), iteratively improve the outcome, or average the results in some way to create a result that is stronger than any single-pass approach, that is called <a href=\"https://en.wikipedia.org/wiki/Boosting_(machine_learning)\">boosting</a>.</p>\n<p><strong>Gradient Boosting</strong></p>\n<p>Another type of boosting is called <a href=\"https://en.wikipedia.org/wiki/Gradient_boosting\">Gradient Boosting</a>. The approach is actually very similar to the Random Forest algorithm, except (as far as I understand it), it uses a type of optimization called <a href=\"https://en.wikipedia.org/wiki/Gradient_descent\" target=\"_blank\">Gradient Descent</a>, which minimizes a <a href=\"https://en.wikipedia.org/wiki/Loss_function\" target=\"_blank\">loss function</a>. Basically, each time it generates a decision tree, it&#8217;s using what it learned the last time it generated one to make the next one a little less bad (reducing cost/loss). </p>\n<p>I&#8217;m not going to go to far into the technical details here, partially because that&#8217;s not really the point of this article, and partly because I start having flashbacks to my Optimization class in grad school, which was not a happy experience.</p>\n<p>There are other boosting algorithms like Adaptive Boosting (<a href=\"https://en.wikipedia.org/wiki/AdaBoost\" target=\"_blank\">AdaBoost</a>) and other ensemble methods in machine learning to explore. Some of them are described in the <a href=\"http://scikit-learn.org/stable/modules/ensemble.html\" target=\"_blank\">scikit-learn (machine learning python package) documentation</a> if you want to learn more.</p>\n<p><strong>So back to my original point</strong></p>\n<p>Now that I have the explanations out of the way, I can get back to the point I wanted to make. Notice how these algorithms work. Each &#8220;weak learner&#8221; only has some of the information needed to make a good guess to classify something. In fact, they&#8217;re often incorrect on their own, because they just don&#8217;t have the experience that a big &#8220;solo&#8221; algorithm has with the data. (Imagine a bunch of weird-looking small trees vs one big gorgeous well-developed oak tree.) However, when you combine the wide variety of partial experiences that the &#8220;weak learners&#8221; provide, their combined guess turns out to actually be better than the guess made by the one big fully-formed tree.</p>\n<div id=\"attachment_1136\" style=\"width: 410px\" class=\"wp-caption aligncenter\"><a href=\"http://youngforest.org/\" rel=\"attachment wp-att-1136\"><img src=\"https://www.becomingadatascientist.com/wp-content/uploads/2016/08/young_forest-300x112.jpg\" alt=\"young forest growth photo via The Young Forest Project\" width=\"400\" height=\"112\" class=\"size-medium wp-image-1136\" /></a><p class=\"wp-caption-text\">Many Small Trees (young forest growth via The Young Forest Project)</p></div>\n<div id=\"attachment_1137\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><a href=\"https://commons.wikimedia.org/wiki/File%3AKeeler_Oak_Tree_-_distance_photo%2C_May_2013.jpg\" rel=\"attachment wp-att-1137\"><img src=\"https://www.becomingadatascientist.com/wp-content/uploads/2016/08/keeler_oak-300x241.jpg\" alt=\"Keeler Oak Tree by Msact via Wikimedia Commons\" width=\"300\" height=\"241\" class=\"size-medium wp-image-1137\" srcset=\"https://www.becomingadatascientist.com/wp-content/uploads/2016/08/keeler_oak-300x241.jpg 300w, https://www.becomingadatascientist.com/wp-content/uploads/2016/08/keeler_oak.jpg 746w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a><p class=\"wp-caption-text\">One Big Fully-Formed Tree (Keeler Oak Tree by Msact via Wikimedia Commons)</p></div>\n<p>So, think of the same concept for building a Data Science Team. There is currently a shortage of &#8220;experts&#8221; in data science, and most companies don&#8217;t seem to know what kind of data scientist they need anyway. Some companies are lamenting the lack of &#8220;qualified&#8221; data scientists (i.e. &#8220;unicorns&#8221; that have all of the necessary skills and experience already), while in the meantime, there are plenty of business analysts, software developers, UX designers, subject matter experts, people that do similar work in other fields (like biotechnology, cognitive science, etc etc etc), and people that are on their way to becoming data scientists and only have a portion of the requisite skills and knowledge. Some companies are just &#8220;pattern matching&#8221; and trying to hire people that are exactly like their existing successful employees (though it&#8217;s unlikely they have even defined what they mean by &#8220;successful employees&#8221;).</p>\n<p>However, if you know how to find creative and motivated &#8220;go-getters&#8221; that want to learn on the job and contribute to a team, and each person on the team has a portion of the needed experience and skills, there is a good chance that in combination (if given good support and resources!) that a small group of &#8220;junior data scientists with other relevant skills&#8221; will actually turn out better than hiring one or two &#8220;experts&#8221; in the first place. Plus, they cost less. Plus, they are likely very trainable. Plus, they really want to make a difference and prove themselves as capable data scientists.</p>\n<p>Anyway, I&#8217;m making a lot of generalizations here, and need to go back and fill in some of my comments in this last section with references, but you can see what I&#8217;m getting at. For those in tech that have a really hard time believing that that &#8220;scrappy new business analyst&#8221; with a non-terminal non-computer-science degree from a non-ivy-league school that doesn&#8217;t have many years of experience doing the exact kind of work you want them to do at your company won&#8217;t be &#8220;qualified&#8221; to fill a Data Science position, maybe it will help to think of the problem as one that Boosting will solve. Create an &#8220;ensemble&#8221; of &#8220;learners&#8221; that may individually only have a subset of the experience and may be self-taught and not do everything the &#8220;right&#8221; way when tasked to do it alone, but can each contribute their wide variety of experiences and skills to come up with a final solution as a team. I&#8217;m willing to bet that the solutions generated by a diverse group with less-than-ideal credentials (but a wider breadth of experience) will turn out better than what an &#8220;expert&#8221; (or homogenous group) would come up with on their own anyway, because <a href=\"http://www.npr.org/2014/03/21/292225798/does-diversity-on-research-team-improve-quality-of-science\" target=\"_blank\">the research shows</a> that <a href=\"http://insight.kellogg.northwestern.edu/article/better_decisions_through_diversity\" target=\"_blank\">it usually does</a>. <a href=\"http://www.pnas.org/content/101/46/16385.full\" target=\"_blank\">Just do the math</a>.</p>\n<p>[more links about building data science teams to be added]</p>\n",
  "wfw:commentRss": "https://www.becomingadatascientist.com/2016/08/06/boosting-in-machine-learning-as-a-metaphor-for-diverse-teams/feed/",
  "slash:comments": 1
}