{
  "id": "yt:video:VxTZjW4zszA",
  "yt:videoId": "VxTZjW4zszA",
  "yt:channelId": "UCwLuX0LoZmlIFpfKvCHyELw",
  "title": "Jenna, you're doing terribly sweetie | 30 Rock",
  "link": "",
  "author": {
    "name": "30 Rock Official",
    "uri": "https://www.youtube.com/channel/UCwLuX0LoZmlIFpfKvCHyELw"
  },
  "published": "2022-09-21T17:00:17+00:00",
  "updated": "2022-09-21T21:05:59+00:00",
  "media:group": {
    "media:title": "Jenna, you're doing terribly sweetie | 30 Rock",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Jenna Maroney going into a full-on London cockney accent when she's trying to do a southern accent is hilarious\n\n30 Rock is streaming now on Peacock: https://bit.ly/3E0z4bO \n\nSeason 6 Episode 21, \"The Return Of Avery Jessup\": Avery (guest star Elizabeth Banks) finally returns home from her kidnapping ordeal in North Korea, yet Jack (Alec Baldwin) grows uncertain of her fidelity while she was away. Elsewhere, Criss (guest star James Marsden) is crossed due to Liz's (Tina Fey) role as top wage earner; Jenna (Jane Krakowski) seeks a sponsor for her approaching nuptials.\n\nSubscribe: http://bit.ly/2wnzhDx \n\n30 Rock Synopsis: Emmy®-winner Tina Fey writes, executive produces and stars as writer Liz Lemon in 30 Rock, an irreverent, wildly funny, Emmy®-winning workplace comedy set behind-the-scenes of a live variety show. The series is told through the comedic voice of Fey and features the inimitable and Emmy®-winning Alec Baldwin as Jack Donaghy, the brash network executive who turns Liz's show (and life) upside down with his meddling ways. Set in New York City, 30 Rock also stars Tracy Morgan, Jane Krakowski, Scott Adsit, and Jack McBrayer, and boasts a cavalcade of guest appearances from some of the most respected and recognizable faces in comedy.\n\n#30Rock #TinaFey #AlecBaldwin #Comedy #NBCU #PeacockTV\n\nThis is the official YouTube channel for 30 Rock. Watch all the official clips from the series, the funniest moments and recurring jokes, and follow the adventures of the TGS crew of misfits. Find 30 Rock trailers, full episode highlights, previews, promos, clips, and digital exclusives here. \n\n30 Rock on:\n► Google Play: http://bit.ly/2ffez47 \n► iTunes: http://apple.co/2vxg183 \n\nAbout Peacock: The streaming service from NBCUniversal that’s as free as a bird. Current hits. Timeless classics. Timely updates. Stream Now With Peacock, stream current hits, hundreds of movies, thousands of episodes of TV shows, and exclusive Originals – plus timely news, live sports, WWE, and daily pop culture. Peacock’s got all your faves, including Parks & Rec, Yellowstone, Modern Family, and every episode of The Office.\n\nGet More Peacock: \n► Follow Peacock on TikTok: https://www.tiktok.com/@peacocktv \n► Follow Peacock on Instagram: https://www.instagram.com/peacocktv/ \n► Like Peacock on Facebook: https://www.facebook.com/PeacockTV \n► Follow Peacock on Twitter: https://twitter.com/peacockTV\n\nGet More 30 Rock:\n► Like 30 Rock on Facebook: https://www.facebook.com/30RockTV/ \n► Follow 30 Rock on Twitter: https://twitter.com/30Rock \n► Follow 30 Rock on Instagram: https://www.instagram.com/30rock/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}