{
  "title": "WOF 101: What to Make of the Protestant Reformation?",
  "pubDate": "Mon, 13 Nov 2017 10:00:00 +0000",
  "guid": "434432b2a941bbfe688dbfab943ebd8f",
  "link": "http://wordonfireshow.com/episode101",
  "itunes:image": "",
  "description": "<p>We just passed the 500th anniversary of the start of the Protestant Reformation, when Martin Luther nailed his 95 theses to the door of a Wittenberg church, and initiated a massive split of the Christian community. What should Catholics make of this event 500 years later? How should we view Protestantism and relate to our Protestant brothers and sisters? That's what Bishop Barron discussed today. A listener asks how Catholics should feel about Protestants.</p> <h3><strong>Topics Discussed</strong></h3> <ul> <li><strong>0:05</strong> - Introduction</li> <li><strong>2:00</strong> - What are Bishop Barron's initial thoughts on this anniversary?</li> <li><strong>4:00</strong> - Who is Stanley Hauerwas?</li> <li><strong>6:15</strong> - Why is Hauerwas so friendly to the Catholic tradition?</li> <li><strong>8:00</strong> - Is the Reformation effectively over?</li> <li><strong>13:40</strong> - How does the Reformation continue to fracture the Church Universal?</li> <li><strong>17:50</strong> - What was the difference maker for reform movements that did not splinter the Church, such as the Franciscans and Dominicans?</li> <li><strong>21:00 </strong>- Is the problem of authority the key to Protestantism?</li> <li><strong>24:00</strong> - How should Catholics feel about Protestant denominations?</li> </ul>",
  "content:encoded": "<p>We just passed the 500th anniversary of the start of the Protestant Reformation, when Martin Luther nailed his 95 theses to the door of a Wittenberg church, and initiated a massive split of the Christian community. What should Catholics make of this event 500 years later? How should we view Protestantism and relate to our Protestant brothers and sisters? That's what Bishop Barron discussed today. A listener asks how Catholics should feel about Protestants.</p> Topics Discussed <ul> <li>0:05 - Introduction</li> <li>2:00 - What are Bishop Barron's initial thoughts on this anniversary?</li> <li>4:00 - Who is Stanley Hauerwas?</li> <li>6:15 - Why is Hauerwas so friendly to the Catholic tradition?</li> <li>8:00 - Is the Reformation effectively over?</li> <li>13:40 - How does the Reformation continue to fracture the Church Universal?</li> <li>17:50 - What was the difference maker for reform movements that did not splinter the Church, such as the Franciscans and Dominicans?</li> <li>21:00 - Is the problem of authority the key to Protestantism?</li> <li>24:00 - How should Catholics feel about Protestant denominations?</li> </ul>",
  "enclosure": "",
  "itunes:duration": "27:14",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "We just passed the 500th anniversary of the start of the Protestant Reformation, when Martin Luther nailed his 95 theses to the door of a Wittenberg church, and initiated a massive split of the Christian community. What should Catholics make of this...",
  "itunes:episodeType": "full"
}