{
  "id": "yt:video:hGZdhfDRBNI",
  "yt:videoId": "hGZdhfDRBNI",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "Liberated U.S.prisoners of war burn their former prison compound at Stalag 7A in ...HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T11:31:10+00:00",
  "updated": "2022-04-16T06:44:15+00:00",
  "media:group": {
    "media:title": "Liberated U.S.prisoners of war burn their former prison compound at Stalag 7A in ...HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675040695_liberated-prisoners_Stalag-Luft-III_soldiers-burning-buildings_soldiers-sun-bathing\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nLiberated U.S.prisoners of war burn their former prison compound at Stalag 7A in Moosburg,Germany\n\nLiberated United States prisoners at Stalag 7A in Moosburg, Germany. Repatriated American military prisoners burn buildings at the camp. The camp was overcrowded and included American fliers transferred from the Luft III aviators prison camp, who probably occupy the white tents in the field near the buildings. Several of those fliers are seen sun bathing. Huge fire and smoke seen rising from the burning buildings. Location: Moosburg Germany. Date: May 1945.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}