{
  "title": "TU100: Reflections and Favorites From 100 Episodes",
  "link": "https://therapistuncensored.com/episodes/tu100-reflections-and-favorites-from-100-episodes/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu100-reflections-and-favorites-from-100-episodes",
  "pubDate": "Mon, 08 Jul 2019 11:06:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7283",
  "description": "100 Episodes and Going Strong! A Review of Our Most Popular and Referenced Episodes\nTune in for a review of our listener’s favorite episodes and back stories about the evolution of Therapist Uncensored with co-hosts Ann Kelley and Sue Marriott. This is a show hosted by 2 therapists who share the most usable science on attachment relationships, psychotherapy, and trauma. It combines both host lead conversations and interviews with top experts in their respective fields – neuroscientists, therapists, researchers, musicians, pop-culture celebrities, and so on – that share their wisdom about relationships.\n\nToday we celebrate starting with colleague Patty Olwell, and evolving everything from our messaging, our website, our audio and editing, and our co-host relationship.\n\nThis is the last show of Season 3, BUT we will be back with new shows by early September. In the meantime, we will be re-playing some of these favorites.  We look forward to our next season of deepening our conversations on attachment, neuroscience, polyvagal theory, depth psychotherapy, sexuality, and more!\nMost Popular Episodes By Everyone, Including Us!\nKnown as “the bundle” of attachment, these episodes summarize the attachment spectrum and have building security at their core. They are, by far, the most referenced, reviewed, and appreciated!\nEpisode 59: Dismissing/Avoidant attachment. Are you cool or just cut off?\nEpisode 60: Preoccupation in Relationships-Grow your security by learning signs of Anxious Attachment\nEpisode 61: It’s not crazy, it’s just a solution to an unsolvable problem – Disorganized Attachment\nOther Popular Episodes Include:\n*Note: listed in order of discussion plus a brief summary of the show conversation\nEpisode 54- The Stress Response System –Attachment Across the Lifespan\n\n \tspecifically looking at the elder years and how our attachment system affects us as caretakers of our parents or as the senior who may be undergoing the various losses inherent in aging.\n\nStephen Porges –  Episode 93: Polyvagal Theory in Action: The Practice of Body Regulation\n\n \tThe father of Polyvagal Theory!\n \tfat led to groundbreaking shifts in our understanding of how the nervous system responds to threat and trauma.\n\nDan Siegel – Episode 16: Inside The Mind of Dr. Dan Siegel\n\n \tFather of interpersonal neurobiology\n \tDiscussed how the current political, international and climate crises could be viewed as a chance to transform human connection. He called for us all to become pervasive leaders.\n\nAlan Sroufe – Episode 56: How We Come To Define Ourselves, Attachment Research Across The Decades\n\n \tIf you’ve ever wanted to know how much you can predict a person’s development years in advance, then you’ll enjoy our conversation with Dr. Alan Sroufe.\n \this research findings over the years and how insecure and secure attachment tendencies can develop and affect an individual through their lives.\n\nBonnie Badenock – Episode 83: Establishing Neurological Safety Through Relationships \n\n \tdiscussed how exercising “happy humility” and compassion can allow for an ideal presence in our day-to-day life using our autonomic nervous system.\n \tSympathetic activation happens when there’s a need to control something in light of an obstacle.\n \tInternal systems challenge to remain in an open and receptive state.\n\nPatricia Crittenden – Episode 96, 97, & 98 \n\n \tOne of the originators of attachment theory\n \tstudied under Mary Ainsworth\n\nEp 96: Attachment and Self-protective strategies\nEp 97: Dynamic Maturation Model (DMM) \nEp 98: Diving deeper into the DMM of Attachment – our summary\n \nStan Tatkin – Episode 12: If It’s Not Good For You, It’s Not Good For Us\n\n \ttalking about understanding how attachment plays out in Long term relationships\n \tIn order to get over hidden shame, you need to expose it to safe people. \n \tShame can only be healed interpersonally.\n \tDifferent cultures social constructions of shame.",
  "enclosure": "",
  "itunes:subtitle": "100 Episodes and Going Strong! A Review of Our Most Popular and Referenced Episodes Tune in for a review of our listener’s favorite episodes and back stories about the evolution of Therapist Uncensored with co-hosts Ann Kelley and Sue Marriott.",
  "itunes:summary": "We made it to our 100th episode! Here&apos;s a look at some of the favorite episodes of our listeners as well as our own over the last 3 seasons!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "53:51"
}