{
  "title": "478 - A Trauma Surgeon and Shooting Survivor Speaks Out: How to Make This Moment a Turning Point for Gun Violence",
  "itunes:title": "478 - A Trauma Surgeon and Shooting Survivor Speaks Out: How to Make This Moment a Turning Point for Gun Violence",
  "pubDate": "Wed, 08 Jun 2022 10:00:00 +0000",
  "guid": "491b2254-d2d5-4760-9ded-c1bc95632ed0",
  "link": "https://johnshopkinssph.libsyn.com/478-a-trauma-surgeon-and-shooting-survivor-speaks-out-how-to-make-this-moment-a-turning-point-for-gun-violence",
  "itunes:image": "",
  "description": "<p><strong>Dr. Joe Sakran</strong> <span style= \"font-weight: 400;\">is a Hopkins trauma surgeon and a survivor of gun violence, giving him a unique perspective on this heavy moment in history. He talks with</span> <strong>Dr. Josh Sharfstein</strong> <span style=\"font-weight: 400;\">about what needs to be done to effectively tackle the complex public health problem of gun violence, and how it will require moral and political courage to finally turn the tide on senseless tragedies. </span></p>",
  "content:encoded": "<p>Dr. Joe Sakran is a Hopkins trauma surgeon and a survivor of gun violence, giving him a unique perspective on this heavy moment in history. He talks with Dr. Josh Sharfstein about what needs to be done to effectively tackle the complex public health problem of gun violence, and how it will require moral and political courage to finally turn the tide on senseless tragedies. </p>",
  "enclosure": "",
  "itunes:duration": "10:25",
  "itunes:explicit": false,
  "itunes:keywords": "gun,guns,control,survivor,violence,trauma,weapon",
  "itunes:subtitle": "Dr. Joe Sakran is a Hopkins trauma surgeon and a survivor of gun violence, giving him a unique perspective on this heavy moment in history. He talks with Dr. Josh Sharfstein about what needs to be done to effectively tackle the complex public health...",
  "itunes:season": 6,
  "itunes:episode": 478,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}