{
  "title": "Seth Bernard, \"Building Mid-Republican Rome: Labor, Architecture, and the Urban Economy\" (Oxford UP, 2018)",
  "description": "Building Mid-Republican Rome: Labor, Architecture, and the Urban Economy (Oxford University Press, 2018), offers a holistic treatment of the development of the Mid-Republican city from 396 to 168 BCE. As Romans established imperial control over Italy and beyond, the city itself radically transformed from an ambitious central Italian settlement into the capital of the Mediterranean world. Seth Bernard describes this transformation in terms of both new urban architecture, much of it unprecedented in form and extent, and new socioeconomic structures, including slavery, coinage, and market-exchange. These physical and historical developments were closely linked: building the Republican city was expensive, and meeting such costs had significant implications for urban society. Building Mid-Republican Rome brings both architectural and socioeconomic developments into a single account of urban change. Seth Bernard, an Assistant Professor of Classics at the University of Toronto, assembles a wide array of evidence, from literary sources to coins, epigraphy, and especially archaeological remains, revealing the period's importance for the decline of the Roman state's reliance on obligation and dependency and the rise of slavery and an urban labor market. This narrative is told through an investigation of the evolving institutional frameworks shaping the organization of public construction. A quantitative model of the costs of the Republican city walls reconstructs their economic impact. A new account of building technology in the period allows for a better understanding of the social and demographic profile of the city's builders. Building Mid-Republican Rome thus provides an innovative synthesis of a major Western city's spatial and historical aspects, shedding much-needed light on a seminal period in Rome's development.\nRyan Tripp teaches history in California.\n\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/architecture",
  "pubDate": "Thu, 14 Mar 2019 10:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 9,
  "itunes:author": "Marshall Poe",
  "itunes:subtitle": "As Romans established imperial control over Italy and beyond, the city itself radically transformed from an ambitious central Italian settlement into the capital of the Mediterranean world...",
  "itunes:summary": "Building Mid-Republican Rome: Labor, Architecture, and the Urban Economy (Oxford University Press, 2018), offers a holistic treatment of the development of the Mid-Republican city from 396 to 168 BCE. As Romans established imperial control over Italy and beyond, the city itself radically transformed from an ambitious central Italian settlement into the capital of the Mediterranean world. Seth Bernard describes this transformation in terms of both new urban architecture, much of it unprecedented in form and extent, and new socioeconomic structures, including slavery, coinage, and market-exchange. These physical and historical developments were closely linked: building the Republican city was expensive, and meeting such costs had significant implications for urban society. Building Mid-Republican Rome brings both architectural and socioeconomic developments into a single account of urban change. Seth Bernard, an Assistant Professor of Classics at the University of Toronto, assembles a wide array of evidence, from literary sources to coins, epigraphy, and especially archaeological remains, revealing the period's importance for the decline of the Roman state's reliance on obligation and dependency and the rise of slavery and an urban labor market. This narrative is told through an investigation of the evolving institutional frameworks shaping the organization of public construction. A quantitative model of the costs of the Republican city walls reconstructs their economic impact. A new account of building technology in the period allows for a better understanding of the social and demographic profile of the city's builders. Building Mid-Republican Rome thus provides an innovative synthesis of a major Western city's spatial and historical aspects, shedding much-needed light on a seminal period in Rome's development.\nRyan Tripp teaches history in California.\n\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/architecture",
  "content:encoded": "<p><a href=\"https://aax-us-east.amazon-adsystem.com/x/c/QvdVukXB6rxT2ho3nK-mRHMAAAFpXiNAVAEAAAFKAXR3vOc/https://www.amazon.com/dp/0190878789/?creativeASIN=0190878789&linkCode=w61&imprToken=UKbYofSNSTPjF8laK6jXaw&slotNum=0&tag=newbooinhis-20\"><em>Building Mid-Republican Rome: Labor, Architecture, and the Urban Economy</em></a> (Oxford University Press, 2018), offers a holistic treatment of the development of the Mid-Republican city from 396 to 168 BCE. As Romans established imperial control over Italy and beyond, the city itself radically transformed from an ambitious central Italian settlement into the capital of the Mediterranean world. <a href=\"http://classics.utoronto.ca/people/faculty/seth-bernard/\">Seth Bernard</a> describes this transformation in terms of both new urban architecture, much of it unprecedented in form and extent, and new socioeconomic structures, including slavery, coinage, and market-exchange. These physical and historical developments were closely linked: building the Republican city was expensive, and meeting such costs had significant implications for urban society. <em>Building Mid-Republican Rome</em> brings both architectural and socioeconomic developments into a single account of urban change. Seth Bernard, an Assistant Professor of Classics at the University of Toronto, assembles a wide array of evidence, from literary sources to coins, epigraphy, and especially archaeological remains, revealing the period's importance for the decline of the Roman state's reliance on obligation and dependency and the rise of slavery and an urban labor market. This narrative is told through an investigation of the evolving institutional frameworks shaping the organization of public construction. A quantitative model of the costs of the Republican city walls reconstructs their economic impact. A new account of building technology in the period allows for a better understanding of the social and demographic profile of the city's builders. <em>Building Mid-Republican</em> <em>Rome</em> thus provides an innovative synthesis of a major Western city's spatial and historical aspects, shedding much-needed light on a seminal period in Rome's development.</p><p><em>Ryan Tripp teaches history in California.</p><p></em></p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/architecture\">https://newbooksnetwork.supportingcast.fm/architecture</a></p>",
  "itunes:duration": 2132,
  "itunes:explicit": "no",
  "guid": "b36f1650-4280-11e9-8d4c-eb916e5698e0",
  "enclosure": ""
}