{
  "title": "83: Southwest of Salem: The Story of the San Antonio Four",
  "link": "https://audioboom.com/posts/7246950",
  "itunes:episode": 83,
  "itunes:title": "Southwest of Salem: The Story of the San Antonio Four",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3523,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Southwest of Salem: The Story of the San Antonio Four excavates the nightmarish persecution of Elizabeth Ramirez, Cassandra Rivera, Kristie Mayhugh, and Anna Vasquez - four Latina lesbians wrongfully convicted of gang-raping two little girls in San Antonio, Texas. The film begins its journey inside a Texas prison, after these women have spent nearly a decade behind bars. They were 19 and 20 years old at the time the allegations surfaced. Using the women's home video footage from 21 years ago combined with recent verité footage and interviews, the film explores their personal narratives and their search for exculpatory evidence to help their losing criminal trials.</p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> WHO COULD BLAME YOU! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon fam</a> and instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW!</strong> Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase\"</strong> and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a></p>\n\n\n<p><a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong> </a> Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! <strong>It will be one of our most special and memorable live shows to date!</strong> <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets here!</a></p>\n\n\n<p><strong>To learn about our sponsors AND GET THOSE PROMO CODES,</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click here!</a></p>\n",
  "pubDate": "Tue, 30 Apr 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-04-30:/posts/7246950",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}