{
  "title": "Drew Peterson: American Murder Mystery",
  "link": "https://audioboom.com/posts/7828503",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3367,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>When Stacy Peterson, a 23-year-old mother of 4, vanishes without a trace, authorities look to her husband Drew, a man 30 YEARS HER SENIOR! Peterson, a cop, claims--we swear to Goddess, you guys--that Stacy grabbed $25,000, the deed to the house, AND HER BIKINI-- and took off with another man. AND GUESS WHAT, THERE'S MORE! Turns out, Drew's third wife, Kathy, died under very mysterious circumstances. And so, as the search for Stacy continues, Kathy's body is exhumed....and all hell breaks loose.<br>\n<br>\n<a href=\"https://linktr.ee/patrickjhinds\">FAM: CHECK OUT THE TRAILER FOR OUR BRAND NEW PODCAST: </a><br>\n<strong>\"Strange And Unexplained With Daisy Eagan\" <br>\n</strong>Do you believe in ghosts? How about bigfoot? Do you think it’s strange and fascinating that a 4 year old in Oklahoma could look at a black and white picture of a man from the 1930s and say ‘that was me. Before.” And then provide actual, verifiable details of the man’s life? If so, “Strange and Unexplained With Daisy Eagan” is about to be your new Favorite podcast.<br>\n<br>\nDaisy is a Tony Award winning actor, writer, and true crime fanatic. But she’s also a skeptic. Each week She looks at real stories of hauntings, disappearances, UFO encounters, the Bermuda Triangle, near death experiences, and anything else that feels just beyond what we can easily make sense of. She is your guide into the inexplicable details of these stories. But she’s also like, “show me the receipts.” <a href=\"https://linktr.ee/patrickjhinds\">Listen to the trailer and subscribe HERE!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 23 Mar 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-23:/posts/7828503",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}