{
  "id": "yt:video:2lO_njRbhyA",
  "yt:videoId": "2lO_njRbhyA",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "How PayPal Became The Scummiest Payment Platform",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-24T19:00:00+00:00",
  "updated": "2022-10-28T14:36:15+00:00",
  "media:group": {
    "media:title": "How PayPal Became The Scummiest Payment Platform",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "PayPal is one of the most useful apps out there. It allows us to easily pay our friends and family, private teachers, third-party sellers, and freelancers. Despite its utility though, PayPal has become one of the most hated payment platforms in the world. It just takes one search on Google or YouTube to understand just how much people despise this company. And when we delve into the root of this distaste, it doesn’t take long to understand where all of this is coming from. First of all, PayPal has become notorious for siding with scammers when there is a disputed transaction. This is because scammers are well aware of PayPal’s dispute criteria and they design their scams to perfectly take advantage of PayPal’s loopholes. And unfortunately, PayPal rarely takes a closer look than just their prescribed criteria which results in PayPal seemingly always siding with scammers. This problem is especially frustrating given how high PayPal’s fees are. And it seems that the root problem for all of this is that PayPal acts like a financial institution, but they’re not subject to many of the rules that are applicable to traditional financial institutions like banks. And this has resulted in subpar consumer protection and service. This video explains the top reasons that people despise PayPal and how PayPal became the scummiest payment platform. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - The Hate For PayPal\n2:22 - Siding With Scammers\n6:04 - Exorbitant Fees\n8:16 - The Financial Institution That’s Not\n10:26 - The Future Of PayPal\n\nResources: \nhttps://pastebin.com/aVzQXCwa",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}