{
  "title": "SCL: A Secure Concurrency Layer For Paranoid Stateful Lambdas. (arXiv:2210.11703v2 [cs.CR] UPDATED)",
  "link": "http://arxiv.org/abs/2210.11703",
  "description": "<p>We propose a federated Function-as-a-Service (FaaS) execution model that\nprovides secure and stateful execution in both Cloud and Edge environments. The\nFaaS workers, called Paranoid Stateful Lambdas (PSLs), collaborate with one\nanother to perform large parallel computations. We exploit cryptographically\nhardened and mobile bundles of data, called DataCapsules, to provide persistent\nstate for our PSLs, whose execution is protected using hardware-secured TEEs.\nTo make PSLs easy to program and performant, we build the familiar Key-Value\nStore interface on top of DataCapsules in a way that allows amortization of\ncryptographic operations. We demonstrate PSLs functioning in an edge\nenvironment running on a group of Intel NUCs with SGXv2.\n</p>\n<p>As described, our Secure Concurrency Layer (SCL), provides\neventually-consistent semantics over written values using untrusted and\nunordered multicast. All SCL communication is encrypted, unforgeable, and\nprivate. For durability, updates are recorded in replicated DataCapsules, which\nare append-only cryptographically-hardened blockchain with confidentiality,\nintegrity, and provenance guarantees. Values for inactive keys are stored in a\nlog-structured merge-tree (LSM) in the same DataCapsule. SCL features a variety\nof communication optimizations, such as an efficient message passing framework\nthat reduces the latency up to 44x from the Intel SGX SDK, and an actor-based\ncryptographic processing architecture that batches cryptographic operations and\nincreases throughput by 81x.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Chen_K/0/1/0/all/0/1\">Kaiyuan Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Thomas_A/0/1/0/all/0/1\">Alexander Thomas</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lu_H/0/1/0/all/0/1\">Hanming Lu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mullen_W/0/1/0/all/0/1\">William Mullen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ichnowski_J/0/1/0/all/0/1\">Jeffery Ichnowski</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Arya_R/0/1/0/all/0/1\">Rahul Arya</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Krishnakumar_N/0/1/0/all/0/1\">Nivedha Krishnakumar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Teoh_R/0/1/0/all/0/1\">Ryan Teoh</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_W/0/1/0/all/0/1\">Willis Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Joseph_A/0/1/0/all/0/1\">Anthony Joseph</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kubiatowicz_J/0/1/0/all/0/1\">John Kubiatowicz</a>"
}