{
  "guid": "urn:uuid:999907a8-b505-4f1a-83a6-ead3f8d14cc5",
  "link": "https://www.who.int/news/item/09-03-2022-access-to-safe-abortion-critical-for-health-of-women-and-girls",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO issues new guidelines on abortion to help countries deliver lifesaving care",
  "description": "<p>The World Health Organization (WHO) is releasing <a href=\"https://www.who.int/publications-detail-redirect/9789240039483\">new guidelines</a> on abortion care today, in a bid to protect the health of women and girls and help prevent over 25 million unsafe abortions that currently occur each year.<br /></p><p><a href=\"https://www.who.int/teams/sexual-and-reproductive-health-and-research-(srh)/human-reproduction-programme\"><img src=\"https://www.who.int/images/default-source/departments/reproductive-health/logos/hrp-logo.jpg?Status=Master&amp;sfvrsn=f5dfc11f_6\" style=\"float:right;margin:0px 0px 15px 15px;\" class=\"-align-right\" alt=\"Logo of the HRP special programme\" sf-size=\"20697\" /></a>&ldquo;Being\n able to obtain safe abortion is a crucial part of health care,&rdquo; said <strong>Craig Lissner, acting Director for Sexual and Reproductive Health and Research at WHO</strong>. &ldquo;Nearly every death and injury that results from unsafe abortion\n    is entirely preventable. That&rsquo;s why we recommend women and girls can access abortion and family planning services when they need them.&rdquo;<br /></p><p>Based on the latest scientific evidence, these consolidated guidelines bring together over 50 recommendations spanning clinical practice, health service delivery, and legal and policy interventions to support quality abortion care. </p><h2>New recommendations to improve access to high quality, person-centred services<br /></h2><p>When abortion is carried out using a method recommended by WHO, appropriate to the duration of the pregnancy and assisted by someone with the necessary information or skills, it is a simple and extremely safe procedure. <br /></p><p>Tragically, however, only around half of all abortions take place under such conditions, with unsafe abortions causing around 39 000 deaths every year and resulting in millions more women hospitalized with complications. Most of these deaths are concentrated\n    in lower-income countries &ndash; with over 60% in Africa and 30% in Asia &ndash; and among those living in the most vulnerable situations.&nbsp;</p><p>The <a href=\"https://www.who.int/publications-detail-redirect/9789240039483\">guideline</a> includes\n    recommendations on many simple primary care level interventions that improve the quality of abortion care provided to women and girls. These include task sharing by a wider range of health workers; ensuring access to medical abortion pills, which\n    mean more women can obtain safe abortion services, and making sure that accurate information on care is available to all those who need it.&nbsp;</p><p>For the first time, the guidelines also include recommendations for use where appropriate of telemedicine, which helped support access to abortion and family planning services during the COVID-19 pandemic.<br /></p><h2>Removing unnecessary policy barriers facilitates safe abortion access<strong> </strong></h2><p>Alongside the clinical and service delivery recommendations, the guidelines recommend removing medically unnecessary policy barriers to safe abortion, such as criminalization, mandatory waiting times, the requirement that approval must be given by other\n    people (e.g., partners or family members) or institutions, and limits on when during pregnancy an abortion can take place. Such barriers can lead to critical delays in accessing treatment and put women and girls at greater risk of unsafe&nbsp;abortion,\n    stigmatization, and health complications, while increasing disruptions to education and their ability to work.<br /></p><p>While most countries permit abortion under specified circumstances, about 20 countries provide no legal grounds for abortion. More than 3 in 4 countries have legal penalties for abortion, which can include lengthy prison sentences or heavy fines for people\n    having or assisting with the procedure.&nbsp;</p><p>&ldquo;It&rsquo;s vital that an abortion is safe in medical terms,&rdquo; said <strong>Dr Bela Ganatra, Head of WHO&rsquo;s Prevention of Unsafe Abortion Unit</strong>. &ldquo;But that&rsquo;s not enough on its own. As with any other health services,\n    abortion care needs to respect the decisions and needs of women and girls, ensuring that they are treated with dignity and without stigma or judgement. No one should be exposed to abuse or harms like being reported to the police or put in jail because\n    they have sought or provided abortion care.\"&nbsp;</p><p>Evidence shows that restricting access to abortions <a href=\"https://www.who.int/news/item/23-07-2020-new-estimates-show-worldwide-fall-in-unintended-pregnancies-since-1990-1994\">does not reduce</a> the number of abortions that take place. In fact, restrictions are more likely to drive women and girls towards unsafe procedures. In countries where abortion is most restricted, only 1 in 4 abortions are\n    safe, compared to nearly 9 in 10 in countries where the procedure is broadly legal.&nbsp;</p><p>&ldquo;The evidence is clear &ndash; if you want to prevent unintended pregnancies and unsafe abortions, you need to provide women and girls with a comprehensive package of sexuality education, accurate family planning information and services, and access\n    to quality abortion care,&rdquo; <strong>Dr Ganatra</strong> added. <br /></p><p>Following the launch of the guidelines, WHO will support interested countries to implement these new guidelines and strengthen national policies and programmes related to contraception, family planning and abortion services, helping them provide the highest\n    standard of care for women and girls. <br /></p><h3>Notes<br /></h3><p>Quality abortion care is care that is effective &ndash; delivered by health workers with the right skills, resources, and information; safe; accessible to all those that need it; timely, and respectful of women and girls&rsquo; needs and rights. <br /></p><p>The WHO abortion care guideline updates the former edition, released in 2012, and consolidates existing and new recommendations. The digital version is available at <a href=\"https://srhr.org/abortioncare\">https://srhr.org/abortioncare</a>&nbsp;\n <br /></p><p>An interactive online database containing comprehensive information on the abortion laws, policies, health standards and guidelines for all countries is available at <a href=\"https://abortion-policies.srhr.org/\">https://abortion-policies.srhr.org</a>.<br /></p>",
  "pubDate": "Tue, 08 Mar 2022 13:47:56 Z"
}