{
  "title": "Senator Seeks Antitrust Review of Apartment Price-Setting Software",
  "link": "https://www.propublica.org/article/yieldstar-rent-increase-senate-antitrust-apartment",
  "pubDate": "Tue, 01 Nov 2022 14:10:00 -0400",
  "guid": "https://www.propublica.org/article/yieldstar-rent-increase-senate-antitrust-apartment",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/heather-vogell\">Heather Vogell</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">The chair of a U.S. Senate committee asked the Federal Trade Commission on Tuesday to review whether a Texas-based property tech company’s rent-setting software violates antitrust laws.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">The move comes after ProPublica <a href=\"https://www.propublica.org/article/yieldstar-rent-increase-realpage-rent\">published an investigation</a> Oct. 15 into RealPage’s pricing software, which suggests new rents daily to landlords for all available units in a building. Critics say the software may be helping big landlords operate as a cartel to push rents above competitive levels in some markets.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">“Alarmingly, recent reporting by ProPublica highlighted that RealPage’s algorithm-based price optimization software, YieldStar, is being used by a growing number of property managers and landlords, potentially impacting pricing and the supply of homes in the rental market,” said<a href=\"https://www.documentcloud.org/documents/23254420-ftc_letter?responsive=1&title=1\"> the letter signed by U.S. Sen. Sherrod Brown</a>, the Ohio Democrat who chairs the Senate Committee on Banking, Housing, and Urban Affairs. “Renters should have the power to negotiate fairly priced housing, free from illicit collusion and deceptive pricing techniques.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">RealPage’s software applies a complex set of mathematical rules to a vast trove of data collected by the company from landlords who are its clients. That data includes the otherwise private data of nearby competitors.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">“Troublingly, ProPublica reported that a former RealPage executive stated that the data could give insight into how competitors within a half-mile or mile radius are pricing their units,” said the letter, which was addressed to FTC chair Lina Khan.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">RealPage has said the data fed into its pricing tool is anonymized and aggregated. It said the company “uses aggregated market data from a variety of sources in a legally compliant manner.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">In a statement Tuesday, the company said it had not seen the letter, “but we are always willing to engage with policy stakeholders to ensure they have the facts about the competitive dynamics of the housing market and the value and benefits that RealPage creates for renters and housing providers.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">Critics say the use of private data is one of the reasons the software invites scrutiny from antitrust enforcers such as the FTC. RealPage also claims its analytics “balance supply and demand to maximize revenue growth.” And the company organizes forums for competitors to meet and discuss aspects of its software, including its pricing algorithms. One legal expert told ProPublica that such collaborations “could raise an antitrust red flag.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">In one neighborhood in Seattle, ProPublica found, 70% of apartments were overseen by just 10 property managers, all of which used pricing software sold by RealPage in at least some of their buildings.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">The Senate letter said the recent reporting on RealPage “raises serious concerns about collusion in the rental market.” It said “the FTC should review whether rent setting algorithms that analyze rent prices through the use of competitors’ private data, such as YieldStar, violate antitrust laws.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">RealPage said previously that its revenue management software prioritizes a property’s own internal supply and demand dynamics over external factors such as competitors’ rents. The software helps eliminate the risk of collusion that could occur with manual pricing, which often relies on phone surveys of competitor prices, the company said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">An FTC spokesperson said the agency does not comment on letters or requests from Congress.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">The letter also raised concerns that the pricing software is potentially restricting the supply of apartments. It said that the national rental vacancy rate was just 5.6% at the end of 2021, the lowest since 1984. Even in the tight market, however, it said, there are reports that RealPage’s algorithm sometimes encourages property owners to keep units vacant or push tenants out to increase profits. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">The letter cited ProPublica’s story, which quoted from a 2017 earnings call with RealPage’s then-CEO, Steve Winn. He explained how one large property company found it could increase profits by raising rents and leaving more apartments vacant.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">Winn has not responded to requests for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">“Intentionally holding units vacant, when there are so few homes available, decreases a consumer’s negotiating power and exacerbates the housing shortage,” the letter said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">RealPage’s influence over apartment pricing has grown substantially in recent years, following its 2017 acquisition of its biggest pricing competitor, software called Lease RentOptions, or LRO, from The Rainmaker Group. RealPage was pricing 1.5 million units at the time, and the purchase allowed it to double that number. The Department of Justice’s antitrust division took a close look at the merger, but allowed it to proceed.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">By 2020, RealPage had expanded its number of clients to 31,700 across all its products, which also include accounting, lease management and other software. Private equity firm Thoma Bravo bought RealPage last year for $10.2 billion. It now calls its pricing software AI Revenue Management.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">After ProPublica published its investigation, a group of tenants <a href=\"https://www.propublica.org/article/realpage-accused-of-collusion-in-new-lawsuit\">filed a lawsuit against RealPage</a> and nine of the country’s biggest landlords, alleging they were colluding to artificially inflate rents.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">A RealPage spokesperson has denied the allegations and said the company “will vigorously defend against the lawsuit.” She declined to comment further, saying the company does not comment on pending litigation.</p>\n        \n                                   ",
  "dc:subject": "Regulation",
  "dc:date": "2022-11-01T14:10:00-04:00",
  "dc:creator": "by Heather Vogell"
}