{
  "id": "https://bibleinoneyear.org/en/youth/351",
  "title": "Day 351: How to Read and Understand the Bible",
  "description": "Psalm 144:11–12, Ezra 1:1–5, Revelation 8:1–5,13. 3  ***How does this apply to my life*?**To avoid it becoming a mere intellectual exercise, you must think through how it applies to your daily living",
  "pubDate": "Fri, 17 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/351/?ignore",
  "itunes:duration": "14:01",
  "guid": "enyouth17122021-351",
  "length": 841.9,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 351: How to Read and Understand the Bible",
  "itunes:subtitle": "Psalm 144:11–12, Ezra 1:1–5, Revelation 8:1–5,13. 3  ***How does this apply to my life*?**To avoid it becoming a mere intellectual exercise, you must think through how it applies to your daily living",
  "itunes:summary": "When reading and trying to understand the Bible, you have three helpers. First, you have the Holy Spirit living in you (1 Corinthians 2:2–16). Second, you have the help of the church. It would be arrogant to think that the Holy Spirit only speaks to me. He has spoken to others in history and he continues to speak to his people. Paul prays that ‘you may have power to comprehend, with all the saints’ (Ephesians 3:18, NRSV). Third, you have the benefit of reason – your mind. Paul encourages each person to be ‘fully convinced in their own minds’ (Romans 14:5).\nIn interpreting the Bible, there are three main questions you need to ask:\n\n\nWhat does it actually say?\nThe Old Testament is written in Hebrew (and Aramaic), and the New Testament in Greek. But you can be confident that most modern translations are trustworthy and accurate.\n\n\nWhat does it mean?\nIn order to answer this question, you have to ask: What sort of literature is it? Is it historical writing? Poetry? Prophecy? Apocalyptic? Law? Wisdom? Gospel? The passages for today are each different types of literature (poetry, apocalyptic and history), and therefore we read them in different ways.\nNext, ask what it meant to the person who first wrote it, and to those who first read or heard it. Then ask, ‘Has anything happened subsequently to alter our understanding?’ For example, what difference does the coming of Jesus make to our understanding of Old Testament passages? Ultimately the Bible is all about Jesus (see John 5:39–40).\n\n\nHow does this apply to my life?\nTo avoid it becoming a mere intellectual exercise, you must think through how it applies to your daily living.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 351
}