{
  "title": "Chinese Whispers: Mythbusting the social credit system",
  "link": "https://audioboom.com/posts/8101346",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3276,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>China's social credit system is notorious. This Black Mirror-esque network supposedly gives citizens a score, based on an opaque algorithm that feeds on data from each person's digital and physical lives. With one billion Chinese accessing the Internet and the growing prevalence of facial recognition, it means that their every move can be monitored – from whether they cross the road dangerously, to whether they play too many video games and buy too much junk food. Those with low scores have lower socio-economic status, and may not be able to board planes and trains, or send their children to school. It's all part of a Chinese Communist Party directive to further control and mould its citizens.<br>\n<br>\n\n</div>\n<div>Except it's not. Speak to any Chinese person and you'll quickly realise that their lives are not dictated by some score, with their every move monitored and live-feeding to some kind of governmental evaluation of their social worth. In fact, the western narrative of the social credit system has deviated so far from the situation on the ground that Chinese Internet users went viral <a href=\"https://twitter.com/manyapan/status/1327208138660077569?s=20&amp;t=ouhprNpUl6vMhPWtQ0johw\">mocking </a>western reporting on Weibo: '-278 points: Immediate execution'.<br>\n<br>\n\n</div>\n<div>Telling Cindy Yu this story on this episode of Chinese Whispers is Vincent Brussee, a researcher at the Mercator Institute for China Studies (Merics), who has recently released a detailed paper looking at what the social credit system really entails on the ground (Merics was part of the group of European organisations and individuals sanctioned by Beijing last year).<br>\n<br>\n\n</div>\n<div>The reality of social credit is unfortunately much less exciting and sexy than you might fear. For one, the technology simply isn't there.  ' When the social credit system was envisioned, or when it was designed in the early 2000s, government files in China were still held in dusty drawers… In 2019 when I worked in China I still had to use a fax machine. That was the first time in my life that I ever saw a fax machine', Vincent says. The system is not linked with someone's digital data, but fundamentally only their interactions with the government (for example, permits and licences). Data that e-commerce and social media companies collect on their users, which must be extensive, are not connected with the government's own data (probably because of the CCP's growing suspicion of Chinese tech firms).<br>\n<br>\n\n</div>\n<div>But more fundamentally, the social credit system is not just one system. 'It's more of an umbrella term', Jeremy Daum says. He is the senior research fellow at Yale Law School's Paul Tsai China Center, who also runs the blog <a href=\"https://www.chinalawtranslate.com/en/\">China Law Translate</a> (which does what it says on the tin). Jeremy has spent years myth-busting the social credit system. He says that for some institutions, social credit is a financial record ('credit' as in 'credit card'); for others, it is a way of black-marking unscrupulous companies that in the past fell short of, say, food safety standards (a particularly sensitive topic in China, given the milk powder scandal). In fact, social credit often functionally works as a way of determining how trustworthy a company is, like a government-run Yelp or Trustpilot system (the Merics report found that most targets of are companies rather than individuals).<br>\n<br>\n\n</div>\n<div>So how did reporters get the social credit story so wrong? In reality, though the social credit system itself is fairly boring, the way this narrative exploded and took hold is a cautionary tale for the West in our understanding of China. 'The western coverage of social credit has hardly been coverage of social credit at all. It is coverage of us, seen through a mirror of China', says Jeremy, arguing that it tapped into our deep fear of unbridled technology and surveillance. On the episode Cindy also speaks to Louise Matsakis, a freelance journalist covering tech and China, who was one of the first to point out the disparity in the social credit narrative and the reality on the ground. Together, they unpack what lessons there are for studying, understanding and reporting on China from this whole saga. <br>\n<br>\n\n</div>\n<div>For further reading, here are the sources we mention in the episode:<br>\n<br>\n\n</div>\n<div>- The Chinese Whispers episode with Jeremy Daum on the fightback against facial recognition:  <a href=\"https://www.spectator.co.uk/podcast/the-fightback-against-facial-recognition\">https://www.spectator.co.uk/po...<br>\n</a><br>\n\n</div>\n<div>- The Merics report:  <a href=\"https://merics.org/en/report/chinas-social-credit-system-2021-fragmentation-towards-integration\">https://merics.org/en/report/c...<br>\n</a><br>\n\n</div>\n<div>- China Law Translate's Social Credit section:  <a href=\"https://www.chinalawtranslate.com/en/social-credit-resources/\">https://www.chinalawtranslate....<br>\n</a><br>\n\n</div>\n<div>- Louise Matsakis in WIRED, ' How the West Got China's Social Credit System Wrong':  <a href=\"https://www.wired.com/story/china-social-credit-score-system/\">https://www.wired.com/story/ch...</a>\n</div>\n",
  "pubDate": "Mon, 13 Jun 2022 15:28:54 +0000",
  "guid": "tag:audioboom.com,2022-06-13:/posts/8101346",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}