{
  "title": "#428: Finishing Sorcerer's Stone, 13 Years Later",
  "link": "https://audioboom.com/posts/7333940",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5140,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Join Andrew in Indy for a special Wizards Unite gathering over Labor Day Weekend! On a related note, we discuss our latest thoughts on the game.</li>\n<li>MuggleCasTBT takes us back to a dark Cursed Child prediction </li>\n<li>Chapter-by-Chapter returns with Harry Potter and the Sorcerer's Stone, Chapter 17: The Man With Two Faces</li>\n<li>The last time we analyzed a chapter from Sorcerer's Stone was 2006! A lot has changed since then</li>\n<li>7-Word Summary: Quirrell surprises Harry with Voldemort’s head attacheSurprise! It wasn't Snape! </li>\n<li>We analyze Professor Quirrell as a character pre-Voldemort, with help from Pottermore</li>\n<li>What does it mean to have a \"special gift\" with trolls?</li>\n<li>Snape the Savior: should the debate about his loyalties have ended here? </li>\n<li>How Harry's reliance on his intuition allowed him to defeat Quirrell</li>\n<li>Was there a confrontation between Dumbledore and Voldemort in the chamber?</li>\n<li>Should Dumbledore have confided the prophecy in a 11-year-old?</li>\n<li>Connecting the Threads with Deathly Hallows: Harry awakens to Dumbledore, death as a choice, James and Snape, and endings at King's Cross</li>\n<li>Notable Quotables, MVP of the Week and Rename the Chapter</li>\n<li>Quizzitch: What film actor, who appeared in Movie 1, has the same birthday as the character he portrays?</li>\n<li>Andrew, Micah and Eric will be hosting a meetup in Orlando on Thursday, August 15th! Can you make it? <a href=\"https://forms.gle/qdpvkatDZkmdK1Ca7\">Let us know</a>!</li>\n<li>This week's episode is brought to you by ThirdLove: Visit <a href=\"http://www.ThirdLove.com/MuggleCast\">ThirdLove.com/MuggleCast</a> for 15% off your first order!</li>\n</ul>\n",
  "pubDate": "Mon, 05 Aug 2019 15:49:51 +0000",
  "guid": "tag:audioboom.com,2019-08-05:/posts/7333940",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}