{
  "title": "S14 Ep95: Past Lives: Journeys Revealed",
  "link": "https://audioboom.com/posts/8098535",
  "itunes:episode": 95,
  "itunes:title": "Past Lives: Journeys Revealed",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4782,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Today BEYOND the DARKNESS goes back in time to investigate Past Lives: Journeys Revealed with clinical hypnotherapist Damian Bertrand.<br>\n<br>\nYou saw him on The Holzer Files on Travel Channel, now listen as clinical hypnotherapist Damian Bertrand, <a href=\"http://C.Ht\">C.Ht</a>, shares his findings, he never expected to help others by transporting them decades, or even hundreds of years, into the past to discover the true meaning behind broken relationships, strange phobias, and unexplained behavior. <br>\n<br>\nConfident that reincarnation was nothing but an unsolved puzzle of the subconscious mind, Bertrand performed hypnotic regressions on willing clients, shocked to find that their stories were rich in details that corroborated with research into very real past lives: Existences that span from heartbreaking tales of lost love, to the victories of tribal leaders protecting their ancient villages. <br>\n<br>\nPast life regression quickly became the basis for Bertrand's private practice in Los Angeles, CA, and then the subject of his television show REINCARNATION: PAST LIVES.<br>\n<br>\nVisit his site here: <a href=\"http://damianbertrand.com/\">http://damianbertrand.com/</a><br>\n<br>\nGet his book here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nYou know what’s a sneaky-good holiday gift? Super comfortable Bombas socks. Visit <a href=\"http://Bombas.com/Darkness\">Bombas.com/Darkness</a> to receive 20 percent off of your first order!",
  "itunes:summary": "Today BEYOND the DARKNESS goes back in time to investigate Past Lives: Journeys Revealed with clinical hypnotherapist Damian Bertrand.\n\nYou saw him on The Holzer Files on Travel Channel, now listen as clinical hypnotherapist Damian Bertrand,...",
  "pubDate": "Sun, 17 Nov 2019 10:00:00 +0000",
  "guid": "e9f42376-642a-4bf7-ba7c-803bc50ecfc8",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}