{
  "title": "Special Encore: Mid-Year Economic Outlook - Slowing or Stopping?",
  "description": "<p>Original Release on May 17th, 2022: As we forecast the remainder of an already uncertain 2022, new questions have emerged around economic data, inflation and the potential for a recession. Chief Cross Asset Strategist Andrew Sheets and Chief Global Economist Seth Carpenter discuss.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets:</strong>&nbsp;Welcome to Thoughts on the Market. I'm Andrew Sheets. Morgan Stanley's Chief Cross-Asset Strategist.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;And I'm Seth Carpenter, Morgan Stanley's Chief Global Economist.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;And today on the podcast, we'll be talking about our outlook for strategy and markets and the challenges they may face over the coming months. It's Tuesday, May 17th, at 4 p.m. in London.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;And it's 11 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;So Seth, the global Morgan Stanley Economic and Strategy Team have just completed our mid-year outlook process. And, you know, this is a big collaborative effort where the economists think about what the global economy will look like over the next 12 months, and the strategists think about what that could mean for markets. So as we talk about that outlook, I think the economy is the right place to start. As you're looking across the global economy and thinking about the insights from across your team, how do you think the global economy will look over the next 12 months and how is that going to be different from what we've been seeing?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;So I will say, Andrew, that we titled our piece, the economics piece, slowing or stopping with a question mark, because I think there is a great deal of uncertainty out there about where the economy is going to go over the next six months, over the next 12 months. So what are we looking at as a baseline? Sharp deceleration, but no recession. And I say that with a little bit of trepidation because we also try to put out alternative scenarios, the way things could be better, the way things could be worse. And I have to say, from where I'm sitting right now, I see more ways for the global economy to be worse than the global economy to be better than our baseline scenario.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;So Seth, I want to dig into that a little bit more because we're seeing, you know, more and more people in the market talk about the risk of a slowdown and talk about the risk of a recession. And yet, you know, it's also hard to ignore the fact that a lot of the economic data looks very good. You know, we have one of the lowest unemployment rates that we've seen in the U.S. in some time. Wage growth is high, spending activity all looks quite high and robust. So, what would drive growth to slow enough where people could really start to think that a recession is getting more likely?</p><p><br></p><p><strong>Seth Carpenter</strong>: So here's how I think about it. We've been coming into this year with a fair amount of momentum, but not a perfectly pristine outlook on the economy. If you take the United States, Q1, GDP was actually negative quarter on quarter. Now, there are a lot of special exceptions there, inventories were a big drag, net exports were a big drag. Underlying domestic spending in the U.S. held up reasonably solidly. But the fact that we had a big drag in the U.S. from net exports tells you a little bit about what's going on around the rest of the world. If you think about what's going on in Europe, we feel that the economy in the eurozone is actually quite precarious. The Russian invasion of Ukraine presents a clear and critical risk to the European economy. I mean, already we've seen a huge jump in energy prices, we've seen a huge jump in food prices and all of that has got to weigh on consumer spending, especially for consumers at the bottom end of the income distribution. And what we see in China is these wave after wave of COVID against the policy of COVID zero means that we're going to have both a hit to demand from China and some disruption to supply. Now, for the moment, we think the disruption to supply is smaller than the hit to demand because there is this closed loop approach to manufacturing. But nevertheless, that shock to China is going to hurt the global economy.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;So Seth, the other major economic question that's out there is inflation, and you know where it's headed and what's driving it. So I was hoping you could talk a little bit about what our forecasts for inflation look like going forward.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:&nbsp;</strong>Our view right now is that inflation is peaking or will be peaking soon. I say that again with a fair amount of caution because that's been our view for quite some time, and then we get these additional surprises. It's clear that in many, many economies, a huge amount of the inflation that we are seeing is coming from energy and from food. Now energy prices and food prices are not likely to fall noticeably any time soon. But after prices peak, if they go sideways from there, the inflationary impulse ends up starting to fade away and so we think that's important. We also think, the COVID zero policy in China notwithstanding, that there will be some grudging easing of supply chain frictions globally, and that's going to help bring down goods inflation as well over time. So we think inflation is high, we think inflation will stay high, but we think that it's roughly peaked and over the balance of this year and into next year it should be coming down.</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;As you think about central bank policy going forward, what do you think it will look like and do you think it can get back to, quote, normal?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;I will say, when it comes to monetary policy, that's a question we want to ask globally. Right now, central banks globally are generically either tight or tightening policy. What do I mean by that? Well, we had a lot of EM central banks in Latin America and Eastern Europe that had already started to hike policy a lot last year, got to restrictive territory. And for those central banks, we actually see them starting to ease policy perhaps sometimes next year. For the rest of EM Asia, they're on the steady grind higher because even though inflation had started out being lower in the rest of EM Asia than in the developed market world, we are starting to see those inflationary pressures now and they're starting to normalize policy. And then we get to the developed market economies. There's hiking going on, there's tightening of policy led by the Fed who's out front. What does that mean about getting back to an economy like we had before COVID? One of the charts that we put in the Outlook document has the path for the level of GDP globally. And you can clearly see the huge drop off in the COVID recession, the rapid rebound that got us most of the way, but not all the way back to where we were before COVID hit. And then the question is, how does that growth look as we get past the worst of the COVID cycle? Six months ago, when we did the same exercise, we thought growth would be able to be strong enough that we would get our way back to that pre-COVID trend. But now, because supply has clearly been constrained because of commodity prices, because of labor market frictions, monetary policy is trying to slow aggregate demand down to align itself with this restricted supply. And so what that means is, in our forecast at least, we just never get back to that pre-COVID trend line.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;All right, Andrew, but I've got a question to throw back at you. So the interplay between economics and markets is really uncertain right now. Where do you think we could be wrong? Could it be that the 3%, ten-year rate that we forecast is too low, is too high? Where do you think the risks are to our asset price forecasts?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;Yeah, let me try to answer your question directly and talk about the interest rate outlook, because we are counting on interest rates consolidating in the U.S. around current levels. And our thinking is partly based on that economic outlook. You know, I think where we could be wrong is there's a lot of uncertainty around, you know, what level of interest rate will slow the economy enough to balance demand and supply, as you just mentioned. And I think a path&nbsp;where U.S. interest rates for, say, ten year treasuries are 4% rather than 3% like they are today, I think that's an environment where actually the economy is a little bit stronger than we expect and the consumer is less impacted by that higher rate. And it's going to take a higher rate for people to keep more money in savings rather than spending it in the economy and potentially driving that inflation. So I think the path to higher rates and in our view does flow through a more resilient consumer. And those higher rates could mean the economy holds up for longer but markets still struggle somewhat, because those higher discount rates that you can get from safe government bonds mean people will expect, mean people will expect a higher interest rate on a lot of other asset classes. In short, we think the risk reward here for bonds is more balanced. But I think the yield move so far this year has been surprising, it's been historically extreme, and we have to watch out for scenarios where it continues.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:&nbsp;</strong>Okay. That's super helpful. But another channel of transmission of monetary policy comes through exchange rates. So the Fed has clearly been hiking, they've already done 75 basis points, they've lined themselves up to do 50 basis points at at least the next two meetings. Whereas the ECB hasn't even finished their QE program, they haven't started to raise interest rates yet. The Bank of Japan, for example, still at a really accommodative level, and we've seen both of those currencies against the dollar move pretty dramatically. Are we in one of those normal cycles where the dollar starts to rally as the Fed begins to hike, but eventually peaks and starts to come off? Or could we be seeing a broader divergence here?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;Yeah. So I think this is to your point about a really interesting interplay between markets and Federal Reserve policy, because what the Fed is trying to do is it's trying to slow demand to bring it back in line with what the supply of things in the economy can provide at at current prices rather than it at higher prices, which would mean more inflation. And there's certainly an important interest rate part to that slowing of demand story. There's a stock market part of the story where if somebody's stock portfolio is lower, maybe they're, again, a little bit less inclined to spend money and that could slow the economy. But the currency is also a really important element of it, because that's another way that financial markets can feed back into the real economy and slow growth. And if you know you're an American company that is an exporter and the dollar is stronger, you likely face tougher competition against overseas sellers. And that acts as another headwind to the economy. So we think the dollar strengthens a little bit, you know, over the next month or two, but ultimately does weaken as the market starts to think enough is priced into the Fed. We're not going to get more Federal Reserve interest rates than are already implied by the market, and that helps tamp down some of the dollar strength that we've been seeing.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;And Seth thanks for taking the time to talk.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;Andrew, it's been great talking to you.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.&nbsp;</p>",
  "itunes:title": "Special Encore: Mid-Year Economic Outlook - Slowing or Stopping?",
  "itunes:episodeType": "full",
  "itunes:episode": 630,
  "itunes:summary": "Original Release on May 17th, 2022: As we forecast the remainder of an already uncertain 2022, new questions have emerged around economic data, inflation and the potential for a recession. Chief Cross Asset Strategist Andrew Sheets and Chief Global Economist Seth Carpenter discuss.",
  "content:encoded": "<p>Original Release on May 17th, 2022: As we forecast the remainder of an already uncertain 2022, new questions have emerged around economic data, inflation and the potential for a recession. Chief Cross Asset Strategist Andrew Sheets and Chief Global Economist Seth Carpenter discuss.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets:</strong>&nbsp;Welcome to Thoughts on the Market. I'm Andrew Sheets. Morgan Stanley's Chief Cross-Asset Strategist.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;And I'm Seth Carpenter, Morgan Stanley's Chief Global Economist.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;And today on the podcast, we'll be talking about our outlook for strategy and markets and the challenges they may face over the coming months. It's Tuesday, May 17th, at 4 p.m. in London.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;And it's 11 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;So Seth, the global Morgan Stanley Economic and Strategy Team have just completed our mid-year outlook process. And, you know, this is a big collaborative effort where the economists think about what the global economy will look like over the next 12 months, and the strategists think about what that could mean for markets. So as we talk about that outlook, I think the economy is the right place to start. As you're looking across the global economy and thinking about the insights from across your team, how do you think the global economy will look over the next 12 months and how is that going to be different from what we've been seeing?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;So I will say, Andrew, that we titled our piece, the economics piece, slowing or stopping with a question mark, because I think there is a great deal of uncertainty out there about where the economy is going to go over the next six months, over the next 12 months. So what are we looking at as a baseline? Sharp deceleration, but no recession. And I say that with a little bit of trepidation because we also try to put out alternative scenarios, the way things could be better, the way things could be worse. And I have to say, from where I'm sitting right now, I see more ways for the global economy to be worse than the global economy to be better than our baseline scenario.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;So Seth, I want to dig into that a little bit more because we're seeing, you know, more and more people in the market talk about the risk of a slowdown and talk about the risk of a recession. And yet, you know, it's also hard to ignore the fact that a lot of the economic data looks very good. You know, we have one of the lowest unemployment rates that we've seen in the U.S. in some time. Wage growth is high, spending activity all looks quite high and robust. So, what would drive growth to slow enough where people could really start to think that a recession is getting more likely?</p><p><br></p><p><strong>Seth Carpenter</strong>: So here's how I think about it. We've been coming into this year with a fair amount of momentum, but not a perfectly pristine outlook on the economy. If you take the United States, Q1, GDP was actually negative quarter on quarter. Now, there are a lot of special exceptions there, inventories were a big drag, net exports were a big drag. Underlying domestic spending in the U.S. held up reasonably solidly. But the fact that we had a big drag in the U.S. from net exports tells you a little bit about what's going on around the rest of the world. If you think about what's going on in Europe, we feel that the economy in the eurozone is actually quite precarious. The Russian invasion of Ukraine presents a clear and critical risk to the European economy. I mean, already we've seen a huge jump in energy prices, we've seen a huge jump in food prices and all of that has got to weigh on consumer spending, especially for consumers at the bottom end of the income distribution. And what we see in China is these wave after wave of COVID against the policy of COVID zero means that we're going to have both a hit to demand from China and some disruption to supply. Now, for the moment, we think the disruption to supply is smaller than the hit to demand because there is this closed loop approach to manufacturing. But nevertheless, that shock to China is going to hurt the global economy.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;So Seth, the other major economic question that's out there is inflation, and you know where it's headed and what's driving it. So I was hoping you could talk a little bit about what our forecasts for inflation look like going forward.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:&nbsp;</strong>Our view right now is that inflation is peaking or will be peaking soon. I say that again with a fair amount of caution because that's been our view for quite some time, and then we get these additional surprises. It's clear that in many, many economies, a huge amount of the inflation that we are seeing is coming from energy and from food. Now energy prices and food prices are not likely to fall noticeably any time soon. But after prices peak, if they go sideways from there, the inflationary impulse ends up starting to fade away and so we think that's important. We also think, the COVID zero policy in China notwithstanding, that there will be some grudging easing of supply chain frictions globally, and that's going to help bring down goods inflation as well over time. So we think inflation is high, we think inflation will stay high, but we think that it's roughly peaked and over the balance of this year and into next year it should be coming down.</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;As you think about central bank policy going forward, what do you think it will look like and do you think it can get back to, quote, normal?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;I will say, when it comes to monetary policy, that's a question we want to ask globally. Right now, central banks globally are generically either tight or tightening policy. What do I mean by that? Well, we had a lot of EM central banks in Latin America and Eastern Europe that had already started to hike policy a lot last year, got to restrictive territory. And for those central banks, we actually see them starting to ease policy perhaps sometimes next year. For the rest of EM Asia, they're on the steady grind higher because even though inflation had started out being lower in the rest of EM Asia than in the developed market world, we are starting to see those inflationary pressures now and they're starting to normalize policy. And then we get to the developed market economies. There's hiking going on, there's tightening of policy led by the Fed who's out front. What does that mean about getting back to an economy like we had before COVID? One of the charts that we put in the Outlook document has the path for the level of GDP globally. And you can clearly see the huge drop off in the COVID recession, the rapid rebound that got us most of the way, but not all the way back to where we were before COVID hit. And then the question is, how does that growth look as we get past the worst of the COVID cycle? Six months ago, when we did the same exercise, we thought growth would be able to be strong enough that we would get our way back to that pre-COVID trend. But now, because supply has clearly been constrained because of commodity prices, because of labor market frictions, monetary policy is trying to slow aggregate demand down to align itself with this restricted supply. And so what that means is, in our forecast at least, we just never get back to that pre-COVID trend line.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;All right, Andrew, but I've got a question to throw back at you. So the interplay between economics and markets is really uncertain right now. Where do you think we could be wrong? Could it be that the 3%, ten-year rate that we forecast is too low, is too high? Where do you think the risks are to our asset price forecasts?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;Yeah, let me try to answer your question directly and talk about the interest rate outlook, because we are counting on interest rates consolidating in the U.S. around current levels. And our thinking is partly based on that economic outlook. You know, I think where we could be wrong is there's a lot of uncertainty around, you know, what level of interest rate will slow the economy enough to balance demand and supply, as you just mentioned. And I think a path&nbsp;where U.S. interest rates for, say, ten year treasuries are 4% rather than 3% like they are today, I think that's an environment where actually the economy is a little bit stronger than we expect and the consumer is less impacted by that higher rate. And it's going to take a higher rate for people to keep more money in savings rather than spending it in the economy and potentially driving that inflation. So I think the path to higher rates and in our view does flow through a more resilient consumer. And those higher rates could mean the economy holds up for longer but markets still struggle somewhat, because those higher discount rates that you can get from safe government bonds mean people will expect, mean people will expect a higher interest rate on a lot of other asset classes. In short, we think the risk reward here for bonds is more balanced. But I think the yield move so far this year has been surprising, it's been historically extreme, and we have to watch out for scenarios where it continues.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:&nbsp;</strong>Okay. That's super helpful. But another channel of transmission of monetary policy comes through exchange rates. So the Fed has clearly been hiking, they've already done 75 basis points, they've lined themselves up to do 50 basis points at at least the next two meetings. Whereas the ECB hasn't even finished their QE program, they haven't started to raise interest rates yet. The Bank of Japan, for example, still at a really accommodative level, and we've seen both of those currencies against the dollar move pretty dramatically. Are we in one of those normal cycles where the dollar starts to rally as the Fed begins to hike, but eventually peaks and starts to come off? Or could we be seeing a broader divergence here?&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;Yeah. So I think this is to your point about a really interesting interplay between markets and Federal Reserve policy, because what the Fed is trying to do is it's trying to slow demand to bring it back in line with what the supply of things in the economy can provide at at current prices rather than it at higher prices, which would mean more inflation. And there's certainly an important interest rate part to that slowing of demand story. There's a stock market part of the story where if somebody's stock portfolio is lower, maybe they're, again, a little bit less inclined to spend money and that could slow the economy. But the currency is also a really important element of it, because that's another way that financial markets can feed back into the real economy and slow growth. And if you know you're an American company that is an exporter and the dollar is stronger, you likely face tougher competition against overseas sellers. And that acts as another headwind to the economy. So we think the dollar strengthens a little bit, you know, over the next month or two, but ultimately does weaken as the market starts to think enough is priced into the Fed. We're not going to get more Federal Reserve interest rates than are already implied by the market, and that helps tamp down some of the dollar strength that we've been seeing.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;And Seth thanks for taking the time to talk.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong>&nbsp;Andrew, it's been great talking to you.&nbsp;</p><p><br></p><p><strong>Andrew Sheets:</strong>&nbsp;And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/B7jDDkgSplrOwz7OzrShP8eKNQuYli1_Xkc2VYcL4VA",
  "pubDate": "Fri, 03 Jun 2022 15:26:15 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends,supply-chain",
  "itunes:duration": "00:10:29",
  "enclosure": ""
}