{
  "title": "Poland building fence along border with Russia",
  "link": "https://www.rt.com/news/565811-poland-russia-kaliningrad-border/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565811-poland-russia-kaliningrad-border/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362765a2030270d9d310aa0.jpg\" /> Polish Defense Minister Mariusz Blaszczak says Warsaw is building a 210km barrier along the border with Russia’s Kaliningrad Region <br/><a href=\"https://www.rt.com/news/565811-poland-russia-kaliningrad-border/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Warsaw has accused Moscow of planning to facilitate illegal crossings from Kaliningrad</strong></p>\n            \n                        \n            <p>Poland has ordered the construction of a 210km barrier along the entire Russian-Polish border. Announcing the details, Polish Defense Minister Mariusz Blaszczak accused Moscow of planning to arrange for Asian and African migrants to illegally cross into the EU state through the Russian exclave of Kaliningrad.&nbsp;</p>\n<p>The move follows reports that Kaliningrad began accepting flights from North Africa and the Middle East, Blaszczak told reporters on Wednesday, as officials in Warsaw expressed concern over a repeat of the 2021 migrant crisis on the border with Belarus.</p>\n<p>In October, the head of Khrabrovo airport in Kaliningrad, Aleksandr Korytny, said the hub will actively work to attract airlines from the Persian Gulf, as well as Asia. The official cited the <em>&rdquo;special geographical position&rdquo;</em> of the airport as a bonus for the new carriers. Still, the measure was announced only as a plan for now.</p>\n<p>Blaszczak said the barrier between Poland and the Russian exclave will consist of three lines of razor wire.</p>\n<p>Construction of the barrier will begin this Wednesday, with preparatory work carried out by Polish soldiers specialized in demining, the defense minister said.</p>\n<p>Last year, the border between Poland and Belarus became the site of a major crisis as thousands of migrants attempted to illegally cross into the EU state. Warsaw has since constructed a steel wall along the border with Belarus and has accused Minsk of acting on Russia&rsquo;s behalf to wage a <em>&ldquo;hybrid war&rdquo;</em> and sow chaos and division within the EU.</p>\n<p>Both Moscow and Minsk have denied these accusations. Belarusian President Aleksandr Lukashenko explained that his government simply did not have enough money in the budget to stop illegal immigration due to the EU&rsquo;s sanctions.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635855d685f540652274cba7.jpg\" alt=\"Migrants at Poland-Belarus border, December, 2021\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565340-poland-kaliningrad-building-wall/\">EU member considers building wall on border with Russia</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Russian President Vladimir Putin accused the West of using the migrant crisis to put pressure on Minsk.</p>\n<p>Earlier, when the idea of a fortified border between Russia and Poland was first suggested by the general secretary of Poland&rsquo;s ruling Law and Justice Party, Krzysztof Sobolewski, Kremlin spokesman Dmitry Peskov said Moscow <em>&ldquo;cannot and is not going to interfere with such decisions.&rdquo;</em></p>\n<p><em>&ldquo;History every time proves the silliness of decisions to build walls, because over the years or decades, all walls fall,&rdquo;</em> he added.</p>\n<p>In late September, Russia's Air Transport Agency introduced an &lsquo;open skies&rsquo; policy at the airport in Kaliningrad, which was meant to increase the accessibility of the region and solve issues prompted by the closure of EU airspace for all Russian airlines. Under the regime, foreign airlines are allowed to travel not only between their home nations and Russia, but can also conduct flights from Kaliningrad to other countries.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 13:59:11 +0000",
  "dc:creator": "RT"
}