{
  "title": "The Phone Call | Best of RGSO",
  "link": "https://audioboom.com/posts/8140571",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1863,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Who was the phone call from that came in late one night when everyone was asleep. Here is a preview of the story. “My first experience of anything paranormal in my adult life was when I was in my mid-20s. I had a very close friend, whose mother passed away whom I also had a very close relationship with, especially since I was shunned by my own mother after leaving the church. Her death came by surprise, she was only in her early 50s. I started having dreams of her and figured it was just me missing her…. That was until one evening I was taking a bath. I had left my phone on the sink, and I had all of the lights off with candles lit. I had my phone on silent, but I could see that it was ringing because I saw it lighting up. I ignored it because I was relaxing. When I got out of the tub, I saw a missed call on my phone. It was from my friend’s mother. I got chills all over my body. I immediately texted my friend and asked her if she had her mom’s phone. She said that she had it, but the battery was dead, and she thinks they had cut off service. I told her that I received a call from that number, she was in disbelief, so I sent her a screenshot to show her that it was real. She was really freaked out and didn’t know what to say…” Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a> If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802! If you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a> Follow Tony: Instagram: <a href=\"http://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a> TikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a> Facebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a>\n</div>\n",
  "pubDate": "Sat, 20 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-16:/posts/8140571",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}