{
  "title": "Energy: Oil, Gas and the Clean Energy Transition",
  "description": "<p>As oil and gas prices rise, governments and investors must weigh investment in clean energy initiatives and new capacity in traditional energy commodities. Head of North American Power & Utilities and Clean Energy Research Stephen Byrd and Head of North American Oil and Gas Research Devin McDermott discuss.</p><p><br></p><p><em>Important note regarding economic sanctions. This research references country/ies which are generally the subject of comprehensive or selective sanctions programs administered or enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), the European Union and/or by other countries and multi-national bodies. Any references in this report to entities, debt or equity instruments, projects or persons that may be covered by such sanctions are strictly informational, and should not be read as recommending or advising as to any investment activities in relation to such entities, instruments or projects. Users of this report are solely responsible for ensuring that their investment activities in relation to any sanctioned country/ies are carried out in compliance with applicable sanctions.</em></p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Stephen Byrd: </strong>Welcome to Thoughts on the Market. I'm Stephen Byrd, Morgan Stanley's Head of North American Power and Utilities, and Clean Energy Research.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>And I'm Devin McDermott, Head of Morgan Stanley's North American Oil and Gas Research.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>And today on the podcast, we'll be discussing the key debate around energy security and energy transition amid the Ukraine Russia conflict. It's Tuesday, March 29th, at 9 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>So, Devin, the Russia-Ukraine conflict has, among other concerns, really put a spotlight on energy supply and demand. I want to get into this perceived tension between energy security, that is making sure there's enough supply to meet demand, and the transition to clean energy. But first, maybe let's start with the backdrop. There's been a lot of discussion around higher energy prices. This is a world you live in every day, and I wondered if you could paint us a picture of both oil and natural gas supply and demand globally.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Yeah, certainly, Stephen, and it's definitely been a dynamic market here over the last several years, coming out of COVID and the price declines that we saw then and the sharp recovery that we've been in now for about a year and a half across the energy commodity complex. If we start with oil first, we had record demand destruction in the second quarter of 2020 around global lockdowns, industrial activity slowing and along with that, oil prices broke negative for the first time in history. And then coming out of that, we've had the combination of a few factors that drove prices higher. The first has been demand has been on a very strong recovery path since that bottom in the second quarter of 2020, growing alongside people getting out again, aviation starting to pick up, the economy growing on the back of the stimulus that was injected over the past few years around the world, not just in the US. And then constrained supply, and that constrained supply comes from a mix of different factors, but the biggest of which is a reduction in investment around the world. The other factor is decarbonization goals, in particular with the global oil majors, which are big investors in global oil and gas capacity, and they've put their marginal dollar increasingly into low carbon initiatives, New Energy's platforms, renewables, driving decarbonization goals across their global footprint. Now, shifting over to the gas side, gas is a fascinating market. Globally, it's fairly regionally disconnected historically, but we've had this big investment over the past decade in liquefied natural gas or LNG that's really brought these regional markets together into one global picture. And we've been on, up until COVID, a declining path on prices. LNG projects take many years to build, they're expensive, they have long paybacks, and they were first to get chopped when companies cut capital budgets to preserve liquidity back in 2020, but demand was still growing through that timeframe. So it pushed us into this period of supply shortfall and higher prices. And actually, last year, on three separate occasions, we set new all time highs for global non-U.S. natural gas prices, and that recovery path and period of stronger for longer prices has persisted here into 2022. And even prior to Russia Ukraine, it was something that we thought would persist for at least the next several years.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>You know, it's fascinating before the Russia-Ukraine conflict we already had, you know, tight markets, rising pricing. Now we really need to dig into the Russia-Ukraine conflict and all the impacts. Maybe let's just start Devin with, sort of, how big of a player Russia is in terms of oil and gas, and what the impact is of any current or future sanctions against Russia.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Russia is one of the world's largest producers of oil and also one of the world's largest producers of natural gas. And to put some numbers around that, Russia represents about 10% of the world's oil supply, about half of that gets exported to the rest of the world. And they represent about 17% of the world's natural gas supply, about 7 of that gets exported to the rest of the world. These are big numbers. And if you look at Europe specifically, about 30% of their gas needs are coming from Russia on pipeline gas right now. So any disruptions to those flows have significant impacts to the global oil and gas market on top of this already tight backdrop.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>And Devin I guess as we think about Europe, there's tremendous focus, as you point out Russia is a major player in energy and a major exporter. And I wonder if you could just talk to the current situation and what do you think would be feasible in terms of satisfying energy demand as Europe thinks about looking for other sources of energy?&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Yeah, it's a good question, Stephen and our European energy team has done a lot of work around this and they think that because of the events that have happened so far, not including any potential incremental sanctions or disruption of supply, that we'll lose about a million barrels a day of Russian oil here over the next several months, starting in April through the balance of this year. And again, just to put that in the context, that's about 10% of Russian supply, about 1% of the world's supply on a normalized pre-COVID basis. Now, some of the disruption in flows to Europe will be bought by other countries. You've seen India and China step in and pick up some of this Russian crude that's no longer going to Europe, but it's not going to fill the entire gap. So it leaves us tighter in the oil market than we were just a few weeks ago. On the natural gas side, it'll be a gradual pivot away from Russian pipeline gas within the European market toward a range of different things, one of which is LNG liquefied natural gas. But, as I mentioned before, that market was already in a shortfall, meaning there was not enough supply to meet demand prior to this. So this transition away from Russian gas is going to require substantial investment and take a long time, 5 to 10 years plus, to carry out. It means that these high prices that we're seeing likely have some sustainability to them.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Stephen, that brings me to a question that I wanted to ask you on the clean energy side. Do you think that we might see a greater policy, and even energy consumer push, to clean energy both in the US and globally on the back of these elevated commodity prices and what's going on in Russia and Ukraine at the moment?&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>Yeah, Devin, we've been seeing a lot of interest among investors in exactly what is going to be the policy response both in Europe and the United States and elsewhere. And I'd say the EU has taken action already. The European Commission laid out a repower EU plan that is very aggressive in terms of additional renewables growth, additional growth in green hydrogen. We see quite a few European utilities and clean energy developers benefiting from the EU's increased emphasis and push towards more and more clean energy. And Rob Pulleyn, my colleague who covers European utilities and clean energy developers and is also a commodities strategist with respect to carbon, has been spending a lot of time on this, has laid out a suite of companies that would benefit quite significantly. There does seem to be a really big policy push in Europe. The United States is not clear. The real question is whether some version of build back better legislation will pass. We just don't know. Now, there is a reason to believe that there could be a compromise position in which some elements of a support for fossil fuel production are included, along with the whole suite of clean energy support that we already know is there. That said, it's possible that compromise simply won't be met. And in that case, we won't get any kind of additional support at the federal level. What's fascinating in the United States, though, is frankly, we don't necessarily need to see that support in order to see tremendous growth in clean energy, we are already seeing a big shift. And as we stand today, we think that clean energy in the United States will more than triple between now and 2030. It's one of the fastest growth rates globally. That is driven mostly by economics, in some cases by state policy, but mostly by economics.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>So, Stephen, I wanted to go back to this question on the tension between energy security and the energy transition. Is it an either or?&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>You know, Devin, we get asked that question a great deal, and I strongly believe the answer is no, those two ideas are not mutually exclusive. And in fact, what we're seeing is both the policy push as well as a business push in both directions. And a good example of that would be the U.S. Utilities that I cover. They are certainly very focused on deploying more renewable energy. And as a group, for example, we see that utilities will decarbonize in the United States by about 75% by 2030 off of 2005 baseline. So very aggressive decarbonization. At the same time, those utilities are very focused on ensuring grid reliability. Now, as we deploy more renewable energy, we're learning quite a few lessons. One lesson is the importance of more energy storage, so demand has been picking up a great deal for that. Another lesson we're learning is the importance of nuclear generation, we're learning that they're critical. They provide both reliability and also zero carbon energy. And in the U.S., we've had a very strong operational track record for our nuclear fleet. So we're learning lessons along the way, but what we're seeing is a push in both directions. Now, as you know, clean energy relative to the world that you live in, oil and gas, is still fairly small. It's going to take many years before clean energy really makes a meaningful impact in terms of global energy consumption. That said, for example, coal generation in places like the United States will decline over time and be replaced with mostly renewable energy, but also with some degree of natural gas generation to ensure reliability. So we're seeing really both ideas play out, and both investment theses are very rational, and we see really good opportunities on both of those ideas.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>And let's take it one step further and talk investment opportunities and themes on the back of this. As you think about the different subsets of clean energy and clean tech, where would you be focused for opportunities here?&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>You know, it's interesting. One group of stocks that we generally like are clean energy developers. And the reason we like those stocks is essentially this spread between what we're thinking of as inflationary traditional energy like oil and gas, and this deflationary dynamic of clean energy. One example is in places like California, the traditional utility costs to customers are rising very rapidly above 10% a year. If you look in the long term, the cost of our clean energy solutions are dropping anywhere from 5% a year, to 10, 15% per year. That's a tremendous economic wedge, and we think the developers will be able to essentially capture a lot of that spread. On the manufacturers side there are still some supply chain dynamics, which can cause some near-term margin compression that concerns us, in some cases. I would say another area of really interesting growth is green hydrogen, especially in Europe. A number of our companies are focused on that market as well. So those would be a couple of the buckets of opportunity that we see.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Great. Stephen, thanks so much for the time today. It's really a fascinating topic and one that's unfolding right before our eyes today.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>Well, it was great speaking with you, Devin.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>And thanks for listening. If you enjoy Thoughts on the Market, please give us a review on Apple Podcasts and share the podcast with a friend or colleague today.&nbsp;</p>",
  "itunes:title": "Energy: Oil, Gas and the Clean Energy Transition",
  "itunes:episodeType": "full",
  "itunes:episode": 584,
  "itunes:summary": "As oil and gas prices rise, governments and investors must weigh investment in clean energy initiatives and new capacity in traditional energy commodities. Head of North American Power & Utilities and Clean Energy Research Stephen Byrd and Head of North American Oil and Gas Research Devin McDermott discuss.",
  "content:encoded": "<p>As oil and gas prices rise, governments and investors must weigh investment in clean energy initiatives and new capacity in traditional energy commodities. Head of North American Power & Utilities and Clean Energy Research Stephen Byrd and Head of North American Oil and Gas Research Devin McDermott discuss.</p><p><br></p><p><em>Important note regarding economic sanctions. This research references country/ies which are generally the subject of comprehensive or selective sanctions programs administered or enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), the European Union and/or by other countries and multi-national bodies. Any references in this report to entities, debt or equity instruments, projects or persons that may be covered by such sanctions are strictly informational, and should not be read as recommending or advising as to any investment activities in relation to such entities, instruments or projects. Users of this report are solely responsible for ensuring that their investment activities in relation to any sanctioned country/ies are carried out in compliance with applicable sanctions.</em></p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Stephen Byrd: </strong>Welcome to Thoughts on the Market. I'm Stephen Byrd, Morgan Stanley's Head of North American Power and Utilities, and Clean Energy Research.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>And I'm Devin McDermott, Head of Morgan Stanley's North American Oil and Gas Research.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>And today on the podcast, we'll be discussing the key debate around energy security and energy transition amid the Ukraine Russia conflict. It's Tuesday, March 29th, at 9 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>So, Devin, the Russia-Ukraine conflict has, among other concerns, really put a spotlight on energy supply and demand. I want to get into this perceived tension between energy security, that is making sure there's enough supply to meet demand, and the transition to clean energy. But first, maybe let's start with the backdrop. There's been a lot of discussion around higher energy prices. This is a world you live in every day, and I wondered if you could paint us a picture of both oil and natural gas supply and demand globally.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Yeah, certainly, Stephen, and it's definitely been a dynamic market here over the last several years, coming out of COVID and the price declines that we saw then and the sharp recovery that we've been in now for about a year and a half across the energy commodity complex. If we start with oil first, we had record demand destruction in the second quarter of 2020 around global lockdowns, industrial activity slowing and along with that, oil prices broke negative for the first time in history. And then coming out of that, we've had the combination of a few factors that drove prices higher. The first has been demand has been on a very strong recovery path since that bottom in the second quarter of 2020, growing alongside people getting out again, aviation starting to pick up, the economy growing on the back of the stimulus that was injected over the past few years around the world, not just in the US. And then constrained supply, and that constrained supply comes from a mix of different factors, but the biggest of which is a reduction in investment around the world. The other factor is decarbonization goals, in particular with the global oil majors, which are big investors in global oil and gas capacity, and they've put their marginal dollar increasingly into low carbon initiatives, New Energy's platforms, renewables, driving decarbonization goals across their global footprint. Now, shifting over to the gas side, gas is a fascinating market. Globally, it's fairly regionally disconnected historically, but we've had this big investment over the past decade in liquefied natural gas or LNG that's really brought these regional markets together into one global picture. And we've been on, up until COVID, a declining path on prices. LNG projects take many years to build, they're expensive, they have long paybacks, and they were first to get chopped when companies cut capital budgets to preserve liquidity back in 2020, but demand was still growing through that timeframe. So it pushed us into this period of supply shortfall and higher prices. And actually, last year, on three separate occasions, we set new all time highs for global non-U.S. natural gas prices, and that recovery path and period of stronger for longer prices has persisted here into 2022. And even prior to Russia Ukraine, it was something that we thought would persist for at least the next several years.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>You know, it's fascinating before the Russia-Ukraine conflict we already had, you know, tight markets, rising pricing. Now we really need to dig into the Russia-Ukraine conflict and all the impacts. Maybe let's just start Devin with, sort of, how big of a player Russia is in terms of oil and gas, and what the impact is of any current or future sanctions against Russia.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Russia is one of the world's largest producers of oil and also one of the world's largest producers of natural gas. And to put some numbers around that, Russia represents about 10% of the world's oil supply, about half of that gets exported to the rest of the world. And they represent about 17% of the world's natural gas supply, about 7 of that gets exported to the rest of the world. These are big numbers. And if you look at Europe specifically, about 30% of their gas needs are coming from Russia on pipeline gas right now. So any disruptions to those flows have significant impacts to the global oil and gas market on top of this already tight backdrop.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>And Devin I guess as we think about Europe, there's tremendous focus, as you point out Russia is a major player in energy and a major exporter. And I wonder if you could just talk to the current situation and what do you think would be feasible in terms of satisfying energy demand as Europe thinks about looking for other sources of energy?&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Yeah, it's a good question, Stephen and our European energy team has done a lot of work around this and they think that because of the events that have happened so far, not including any potential incremental sanctions or disruption of supply, that we'll lose about a million barrels a day of Russian oil here over the next several months, starting in April through the balance of this year. And again, just to put that in the context, that's about 10% of Russian supply, about 1% of the world's supply on a normalized pre-COVID basis. Now, some of the disruption in flows to Europe will be bought by other countries. You've seen India and China step in and pick up some of this Russian crude that's no longer going to Europe, but it's not going to fill the entire gap. So it leaves us tighter in the oil market than we were just a few weeks ago. On the natural gas side, it'll be a gradual pivot away from Russian pipeline gas within the European market toward a range of different things, one of which is LNG liquefied natural gas. But, as I mentioned before, that market was already in a shortfall, meaning there was not enough supply to meet demand prior to this. So this transition away from Russian gas is going to require substantial investment and take a long time, 5 to 10 years plus, to carry out. It means that these high prices that we're seeing likely have some sustainability to them.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Stephen, that brings me to a question that I wanted to ask you on the clean energy side. Do you think that we might see a greater policy, and even energy consumer push, to clean energy both in the US and globally on the back of these elevated commodity prices and what's going on in Russia and Ukraine at the moment?&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>Yeah, Devin, we've been seeing a lot of interest among investors in exactly what is going to be the policy response both in Europe and the United States and elsewhere. And I'd say the EU has taken action already. The European Commission laid out a repower EU plan that is very aggressive in terms of additional renewables growth, additional growth in green hydrogen. We see quite a few European utilities and clean energy developers benefiting from the EU's increased emphasis and push towards more and more clean energy. And Rob Pulleyn, my colleague who covers European utilities and clean energy developers and is also a commodities strategist with respect to carbon, has been spending a lot of time on this, has laid out a suite of companies that would benefit quite significantly. There does seem to be a really big policy push in Europe. The United States is not clear. The real question is whether some version of build back better legislation will pass. We just don't know. Now, there is a reason to believe that there could be a compromise position in which some elements of a support for fossil fuel production are included, along with the whole suite of clean energy support that we already know is there. That said, it's possible that compromise simply won't be met. And in that case, we won't get any kind of additional support at the federal level. What's fascinating in the United States, though, is frankly, we don't necessarily need to see that support in order to see tremendous growth in clean energy, we are already seeing a big shift. And as we stand today, we think that clean energy in the United States will more than triple between now and 2030. It's one of the fastest growth rates globally. That is driven mostly by economics, in some cases by state policy, but mostly by economics.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>So, Stephen, I wanted to go back to this question on the tension between energy security and the energy transition. Is it an either or?&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>You know, Devin, we get asked that question a great deal, and I strongly believe the answer is no, those two ideas are not mutually exclusive. And in fact, what we're seeing is both the policy push as well as a business push in both directions. And a good example of that would be the U.S. Utilities that I cover. They are certainly very focused on deploying more renewable energy. And as a group, for example, we see that utilities will decarbonize in the United States by about 75% by 2030 off of 2005 baseline. So very aggressive decarbonization. At the same time, those utilities are very focused on ensuring grid reliability. Now, as we deploy more renewable energy, we're learning quite a few lessons. One lesson is the importance of more energy storage, so demand has been picking up a great deal for that. Another lesson we're learning is the importance of nuclear generation, we're learning that they're critical. They provide both reliability and also zero carbon energy. And in the U.S., we've had a very strong operational track record for our nuclear fleet. So we're learning lessons along the way, but what we're seeing is a push in both directions. Now, as you know, clean energy relative to the world that you live in, oil and gas, is still fairly small. It's going to take many years before clean energy really makes a meaningful impact in terms of global energy consumption. That said, for example, coal generation in places like the United States will decline over time and be replaced with mostly renewable energy, but also with some degree of natural gas generation to ensure reliability. So we're seeing really both ideas play out, and both investment theses are very rational, and we see really good opportunities on both of those ideas.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>And let's take it one step further and talk investment opportunities and themes on the back of this. As you think about the different subsets of clean energy and clean tech, where would you be focused for opportunities here?&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>You know, it's interesting. One group of stocks that we generally like are clean energy developers. And the reason we like those stocks is essentially this spread between what we're thinking of as inflationary traditional energy like oil and gas, and this deflationary dynamic of clean energy. One example is in places like California, the traditional utility costs to customers are rising very rapidly above 10% a year. If you look in the long term, the cost of our clean energy solutions are dropping anywhere from 5% a year, to 10, 15% per year. That's a tremendous economic wedge, and we think the developers will be able to essentially capture a lot of that spread. On the manufacturers side there are still some supply chain dynamics, which can cause some near-term margin compression that concerns us, in some cases. I would say another area of really interesting growth is green hydrogen, especially in Europe. A number of our companies are focused on that market as well. So those would be a couple of the buckets of opportunity that we see.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>Great. Stephen, thanks so much for the time today. It's really a fascinating topic and one that's unfolding right before our eyes today.&nbsp;</p><p><br></p><p><strong>Stephen Byrd: </strong>Well, it was great speaking with you, Devin.&nbsp;</p><p><br></p><p><strong>Devin McDermott: </strong>And thanks for listening. If you enjoy Thoughts on the Market, please give us a review on Apple Podcasts and share the podcast with a friend or colleague today.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/Cb4O8dxt4-f5hrb7pPcx6rqXokP8oI_kLyi0n_7MhwA",
  "pubDate": "Tue, 29 Mar 2022 21:25:34 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:11:12",
  "enclosure": ""
}