{
  "title": "92: Attachment in Adult Relationships & Self-Sovereignty with Briana MacWilliam",
  "pubDate": "Wed, 10 Jun 2020 05:50:05 +0000",
  "guid": "5b2186b5-bfde-46ce-92d7-0f44c0c03f7c",
  "link": "https://lifeonpurpose.libsyn.com/92-attachment-in-adult-relationships-self-sovereignty-with-briana-macwilliam",
  "itunes:image": "",
  "description": "<p>My guest for <strong>Life on Purpose Episode #92</strong> is <a href=\"https://brianamacwilliam.com\" target= \"_blank\" rel=\"noopener\"><strong>Briana MacWilliam</strong></a>, a Love and Relationship Coach with a passion for serving insecurely attached adults who want to experience soul-deep intimacy in their romantic relationships.<br /> <br /> She has more than 14 years of clinical experience as a creative arts therapist and is the Founder of <a href= \"https://creativeartstherapiesonline.com\" target=\"_blank\" rel= \"noopener\">CreativeArtsTherapiesOnline.com</a> an online school for continuing education for creative arts therapists and other mental health practitioners. </p> <p><em>“Using a psycho-spiritual approach to attachment styles (which are four unique blueprints for how you give and receive love), I help insecure lovers go from self-doubting to self-sovereign, and calling in those soul-shaking, passionate partnerships they want, without having to talk in circles around their feelings for hours or even years on end, with no tangible result. And I do this, using my unique service, The MacWilliam Method.”</em> says <strong>Briana</strong>.<br /> <br /> <strong>About Briana’s Work:</strong><br /> <br /> Are you looking for a soul-shaking, passionate partnership, but find yourself trapped in roller-coaster relationships with unhealthy partners that you hate to love?<br /> <br /> Perhaps you have acquired a lot of skills, tips, techniques or \"red flags,\" to help you make better decisions in love, but no matter what you do, no amount of insight seems to help you break free from unhealthy patterns, or stop feeling attracted to the \"wrong\" kind of partner.  If this sounds familiar, you are in the right place.<br /> <br /> Hi, my name is <strong>Briana MacWilliam</strong>, and I am a licensed and board certified creative arts therapist, with more than 14 years in the field, working with individuals, just like you.</p> <div><strong>About Briana MacWilliam:</strong></div> <div> </div> <div><strong>Briana MacWilliam</strong> has over 14 years of clinical experience as a creative arts therapist, and is the Founder and Director of Briana MacWilliam Inc., which offers continuing education to mental health practitioners, through CreativeArtsTherapiesOnline.com. <br /> <br /> She has held two directorial positions in community-based and day-treatment settings, and was a research outcomes coordinator for four years, at the Amen Clinics, Inc.—a brain research and diagnostic facility. She edited and co-authored two books on the subjects of attachment and complicated grief, and working with LGBTQ populations. She is also the Director for Continuing Education for Pratt Institute’s Creative Arts Therapies Department.<br /> <br /> <strong>More About Briana: </strong><br /> Hi, my name is <strong>Briana</strong>, and I love romance novels and campy science fiction shows (anyone else a die-hard Supernatural fan?). I also like being my own boss. Doing what I want to do, when I want to do it. And treating work like play. Through my education, professional experience, and personal life experiences, I have come to passionately serve insecurely attached adults, who want to experience soul-deep intimacy, in their romantic relationships.<br /> <br /> <strong>Why Attachment? </strong><br /> My passion for working with attachment wounds and personal development stems from a rocky childhood. As a child of divorce, I bounced back and forth between my parents, across state lines. We lived below the poverty line for much of my young life. In my parents, I had an example of hard work but constant struggle. I became a high achiever to compensate. It served me well professionally, until my struggles with relationships in adulthood tore down everything I had accomplished.<br /> <br /> <strong>I’ve Been There:</strong><br /> In adulthood, I experienced roller coaster relationships, and ultimately wound up a divorced, single mom.<br /> Then, after losing my job due to budget cuts, within a six-month time frame, one after another, both my parents and my brother were diagnosed with serious, chronic illnesses. And the new partner I had fallen madly in love with– the one all the raw parts of myself wanted so desperately to please and keep – couldn’t prioritize me. When he left, my heart broke anew. I felt my soul was split wide open.<br /> <br /> <strong>Finding Grace:</strong><br /> As I came face-to-face with my greatest fears. I knew I had to find the grace on the other side, or collapse into a victimized identity. I decided that meant stepping into my own authority, on a spiritual level. And this gave me the motivation to radically change the way I was living, loving, working, and perceiving the world.<br /> <br /> <strong>New Horizons:</strong><br /> I decided to dive straight down into my demons, while pursuing certification in Reiki (energy healing), building a private practice, and doing research for a book about attachment and grief. Ultimately, I found several other contributors willing to share their stories of grief, and we got it published!<br /> <br /> Writing the book emboldened me to shed my shame, and  talk about these things in a way I had never thought I would feel safe doing.This led to creating the curriculum for my online courses in personal development, and building an online community for support. Much to my delight, both caught fire, and I have never looked back!<br /> <br /> ###</div>",
  "content:encoded": "<p>My guest for Life on Purpose Episode #92 is <a href=\"https://brianamacwilliam.com\" target= \"_blank\" rel=\"noopener\">Briana MacWilliam</a>, a Love and Relationship Coach with a passion for serving insecurely attached adults who want to experience soul-deep intimacy in their romantic relationships.  She has more than 14 years of clinical experience as a creative arts therapist and is the Founder of <a href= \"https://creativeartstherapiesonline.com\" target=\"_blank\" rel= \"noopener\">CreativeArtsTherapiesOnline.com</a> an online school for continuing education for creative arts therapists and other mental health practitioners. </p> <p><em>“Using a psycho-spiritual approach to attachment styles (which are four unique blueprints for how you give and receive love), I help insecure lovers go from self-doubting to self-sovereign, and calling in those soul-shaking, passionate partnerships they want, without having to talk in circles around their feelings for hours or even years on end, with no tangible result. And I do this, using my unique service, The MacWilliam Method.”</em> says Briana.  About Briana’s Work:  Are you looking for a soul-shaking, passionate partnership, but find yourself trapped in roller-coaster relationships with unhealthy partners that you hate to love?  Perhaps you have acquired a lot of skills, tips, techniques or \"red flags,\" to help you make better decisions in love, but no matter what you do, no amount of insight seems to help you break free from unhealthy patterns, or stop feeling attracted to the \"wrong\" kind of partner.  If this sounds familiar, you are in the right place.  Hi, my name is Briana MacWilliam, and I am a licensed and board certified creative arts therapist, with more than 14 years in the field, working with individuals, just like you.</p> About Briana MacWilliam:   Briana MacWilliam has over 14 years of clinical experience as a creative arts therapist, and is the Founder and Director of Briana MacWilliam Inc., which offers continuing education to mental health practitioners, through CreativeArtsTherapiesOnline.com.   She has held two directorial positions in community-based and day-treatment settings, and was a research outcomes coordinator for four years, at the Amen Clinics, Inc.—a brain research and diagnostic facility. She edited and co-authored two books on the subjects of attachment and complicated grief, and working with LGBTQ populations. She is also the Director for Continuing Education for Pratt Institute’s Creative Arts Therapies Department.  More About Briana:  Hi, my name is Briana, and I love romance novels and campy science fiction shows (anyone else a die-hard Supernatural fan?). I also like being my own boss. Doing what I want to do, when I want to do it. And treating work like play. Through my education, professional experience, and personal life experiences, I have come to passionately serve insecurely attached adults, who want to experience soul-deep intimacy, in their romantic relationships.  Why Attachment?  My passion for working with attachment wounds and personal development stems from a rocky childhood. As a child of divorce, I bounced back and forth between my parents, across state lines. We lived below the poverty line for much of my young life. In my parents, I had an example of hard work but constant struggle. I became a high achiever to compensate. It served me well professionally, until my struggles with relationships in adulthood tore down everything I had accomplished.  I’ve Been There: In adulthood, I experienced roller coaster relationships, and ultimately wound up a divorced, single mom. Then, after losing my job due to budget cuts, within a six-month time frame, one after another, both my parents and my brother were diagnosed with serious, chronic illnesses. And the new partner I had fallen madly in love with– the one all the raw parts of myself wanted so desperately to please and keep – couldn’t prioritize me. When he left, my heart broke anew. I felt my soul was split wide open.  Finding Grace: As I came face-to-face with my greatest fears. I knew I had to find the grace on the other side, or collapse into a victimized identity. I decided that meant stepping into my own authority, on a spiritual level. And this gave me the motivation to radically change the way I was living, loving, working, and perceiving the world.  New Horizons: I decided to dive straight down into my demons, while pursuing certification in Reiki (energy healing), building a private practice, and doing research for a book about attachment and grief. Ultimately, I found several other contributors willing to share their stories of grief, and we got it published!  Writing the book emboldened me to shed my shame, and  talk about these things in a way I had never thought I would feel safe doing.This led to creating the curriculum for my online courses in personal development, and building an online community for support. Much to my delight, both caught fire, and I have never looked back!  ###",
  "enclosure": "",
  "itunes:duration": "01:02:37",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest for Life on Purpose Episode #92 is , a Love and Relationship Coach with a passion for serving insecurely attached adults who want to experience soul-deep intimacy in their romantic relationships.  She has more...",
  "itunes:episodeType": "full"
}