{
  "title": "Picture Yourself on a Dress and Deliver with Jaimee Newberry",
  "pubDate": "Tue, 13 Aug 2019 03:11:31 +0000",
  "link": "https://newdisrupt.org/blog/2019/8/13/picture-yourself-on-a-dress-and-deliver-jaimee-newberry",
  "guid": "tag:soundcloud,2010:tracks/665014106",
  "enclosure": "",
  "itunes:episode": 113,
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:27:09",
  "description": "<p><a href=\"http://www.jaimeejaimee.com\">Jaimee Newberry</a> is the co-founder of <a href=\"https://picturethisclothing.com\">Picture This Clothing</a>. Draw a picture or take a picture and get it put on a dress or a T-shirt. It’s that simple — well, it’s that simple for the maker, which is what Jaimee is all about. She and her partner fell into the business through a tweet. Three years in, there’s no sign of it slowing down.</p>\n<h2>Sponsors</h2>\n<p>This episode is brought to you in part by Disruptor-level patrons Wil Macaulay, Raymond Kloss, and Andrew Fisher. Thanks for your help in bringing this show back on the air. You can find back episodes and spread the word at <a href=\"https://newdisrupt.org\">newdisrupt.org</a>.</p>\n<h2>Show notes</h2>\n<ul>\n<li>Ken Finney’s <a href=\"http://getnarwhal.com\">Narwhal app</a></li>\n<li>Knitter <a href=\"https://www.sambarsky.com\">Sam Barsky</a></li>\n</ul>\n ",
  "itunes:subtitle": "Jaimee Newberry is the co-founder of Picture This Clothing. Three years in, there’s no sign of it slowing down.",
  "itunes:summary": "Jaimee Newberry is the co-founder of Picture This Clothing. Draw a picture or take a picture and get it put on a dress or a T-shirt. It’s that simple — well, it’s that simple for the maker, which is what Jaimee is all about. She and her partner fell into the business through a tweet. Three years in, there’s no sign of it slowing down.\n\nPatrons: This episode is brought to you in part by Disruptor-level patrons Wil Macaulay, Raymond Kloss, and Andrew Fisher. Thanks for your help in bringing this show back on the air. You can find back episodes and spread the word at https://newdisrupt.org/support/"
}