{
  "title": "S1E15 - Being a Mom Can Make You a Better Athlete with Elana Meyers Taylor",
  "guid": "https://pinecast.com/guid/b5ae5e21-c535-4831-98af-354cb1ec0ea7",
  "pubDate": "Tue, 15 Sep 2020 06:30:14 -0000",
  "itunes:duration": "00:40:09",
  "description": "<p>Laura’s guest on the podcast this week is three-time Olympic medalist bobsledder, Elana Meyers Taylor. In addition to her Olympic achievements, Elana is also a four-time World Champion, eight-time World Championship medalist, and she has made history by being the first woman to earn a spot on the US National Team competing with men. On top of all of this, Elana became a mom for the first time earlier this year, and you will hear all about her little Nico throughout the episode today.</p>\n<p>Elana begins the episode by sharing the story of her marriage proposal, her subsequent pregnancy and delivery, and the conditions with which her son, Nico, has been diagnosed. She and Laura then explore the ways in which motherhood can impact an athlete’s training and the many benefits of involving your children in the training. Elana also describes how COVID-19 has impacted her training, the upcoming bobsled season, and her family’s income. The shift in her mindset and how she is feeling now, what it’s like training with and being coached by her husband, her definition of success, and her favorite memory of her bobsledding career are discussed as well. Elana then concludes the episode with her sage advice for fellow elite athletes who are moms. As you listen to her story today, you will discover in Elana a remarkably accomplished woman who sets and pursues her goals relentlessly, providing a sterling example not only for her beloved child, but for the rest of us as well. Prepare to be inspired.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>The story of Elana’s marriage proposal</li>\n<li>The story of her pregnancy and delivery</li>\n<li>Her son’s diagnoses of Down syndrome and profound bilateral sensorineural hearing loss</li>\n<li>How motherhood and COVID-19 have affected her training</li>\n<li>The benefits of involving their children in their training</li>\n<li>Setting an example for their children</li>\n<li>How COVID-19 has affected the bobsled season</li>\n<li>How Elana is feeling right now and how her mindset has shifted</li>\n<li>Training with and being coached by her husband</li>\n<li>The impact of COVID-19 on her family’s income</li>\n<li>Elana’s definition of success</li>\n<li>One of her favorite memories from her bobsledding career</li>\n<li>Elana’s advice for new moms who are also elite athletes</li>\n</ul>\n<p>Quotes:</p>\n<p>“He spent about eight days in the NICU, which was an experience that I wouldn’t wish on anybody at all.”</p>\n<p>“They adapt, you adapt, and you kind of figure it out together, which is kind of the beautiful thing.”</p>\n<p>“I’m going to be a new, different, and, I think, better athlete as a result of everything that’s going on.”</p>\n<p>“For our kids’ sake, they are going to get a lot out of…their mother showing them that they can go on and set goals and achieve something even while still being a mom.”</p>\n<p>“I feel like part of our journey is simply that, is being the best example we can to our kids, and sometimes, yes, bringing them along.”</p>\n<p>“I really want to show my son that I’m out there doing what I love to do and I continue to do what I love to do while being his mother.”</p>\n<p>“He is able to adapt whatever I need and to make it make sense to me.”</p>\n<p>“Communication is such a big, big thing.”</p>\n<p>“Our identity does not lie in our sport.”</p>\n<p>“For me, success is really defined internally by you going after a goal and what steps you took to accomplish it and how you feel the process went.”</p>\n<p>“The couch or the back of a bobsled – I’ll take the back of a bobsled, please.”</p>\n<p>“Be prepared to adapt…trust in yourself and believe in yourself…no challenge you can’t overcome.”</p>\n<p>“Don’t be afraid to ask for help.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Elana:\nInstagram:   <a href=\"https://www.instagram.com/elanameyerstaylor/\" rel=\"nofollow\">https://www.instagram.com/elanameyerstaylor/</a>\nTwitter:   <a href=\"https://twitter.com/eamslider24\" rel=\"nofollow\">https://twitter.com/eamslider24</a>\nFaceBook  <a href=\"https://www.facebook.com/ElanaMeyersTaylor/\" rel=\"nofollow\">https://www.facebook.com/ElanaMeyersTaylor/</a></p>",
  "itunes:title": "Being a Mom Can Make You a Better Athlete with Elana Meyers Taylor",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 15
}