{
  "title": "Episode 38: &#8220;Heartbreak Hotel&#8221; by Elvis Presley",
  "link": "https://500songs.com/podcast/episode-38-heartbreak-hotel-by-elvis-presley/",
  "pubDate": "Mon, 24 Jun 2019 10:41:57 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-38-heartbreak-hotel-by-elvis-presley/",
  "description": "Episode thirty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Heartbreak Hotel\" by Elvis Presley, and is part three of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/27855307\">\"The Flying Saucer\" by Buchanan and Goodman. </a>\n\nAlso, it came too late for me to acknowledge in the episode itself, but I have to mention the sad news that Dave Bartholomew died today, aged 100. He will be missed.\n\n<strong></strong>\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-38-heartbreak-hotel/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\n<a href=\"https://amzn.to/2J3krIS\">This 3-CD box set</a> (expensive on CD, but relatively cheap as MP3s) contains every surviving recording by Elvis from 1956, including outtakes. <a href=\"https://amzn.to/2FtYilZ\">This more reasonably priced ten-CD box</a> contains every official release he put out from 1954 through 62, but without the outtakes.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've talked before, a couple of times, about Elvis Presley and his early recordings. Those Sun records are the ones on which his artistic reputation now largely rests, but they weren't the ones that made him famous. He didn't become the Elvis we all know until he started recording for RCA. So today we're going to look at the first single he put out on a major label, and the way it turned him from a minor regional country star into the King of Rock and Roll, a cultural phenomenon that would eclipse all music prior to him, and lead John Lennon to say \"Before Elvis there was nothing\".\n\nAs you might remember from the last episode on Elvis, a few weeks ago, Elvis' manager, Colonel Tom Parker, had managed to get Elvis signed to RCA Records for a sum of money far greater than anything anyone had paid for a singer before, after Sam Phillips made what seemed like a ludicrous demand just to get Parker out of his hair.\n\nAnd this was a big deal. Sun Records, as we've seen, was a tiny regional operation. It was able to generate massive hits for Carl Perkins and Johnny Cash after Elvis left, but that's only because of the cash the label was able to make from the Elvis deal. It's safe to say that the whole genre of rockabilly was funded by that one deal. RCA, on the other hand, was one of the biggest labels in the world.\n\nThe first thing RCA did was to reissue his last Sun single, \"I Forgot to Remember to Forget\", backed with \"Mystery Train\". With RCA's backing, the single did far better than it had on Sun, hitting number one on the country charts at the beginning of 1956.\n\nBut was that enough to make the money RCA had paid for Elvis worth it? When Elvis went into the studio on January 10 1956, two days after his twenty-first birthday, the pressure was on him to record something very special indeed.\n\nBefore going into the studio, Elvis had been sent ten demos of songs to consider for this first session. The song he ended up choosing as the main one for the session, though, was a song by someone he already knew -- and for which he had a third of the songwriting credit.\n\nMae Axton was an odd figure. She was an English teacher who had a sideline as a freelance journalist. One day she was asked by a magazine she was freelancing for to write a story about hillbilly music, a subject about which she knew nothing. She went to Nashville to interview the singer Minnie Pearl, and while she was working on her story, Pearl introduced her to Fred Rose, the co-owner of Acuff-Rose Publishing, the biggest publishing company in country music. And Pearl, for some reason, told Rose that Mae, who had never written a song in her life, was a songwriter.\n\nRose said that he needed a new novelty song for a recording session for the singer Dub Dickerson that afternoon, and asked Mae to write him one. And so, all of a sudden, Mae Axton was a songwriter, and she eventually wrote over two hundred songs, starting with her early collaborations with Dub Dickerson:\n\n[Excerpt: Dub Dickerson, \"Shotgun Wedding\"]\n\nShe was still also a freelance journalist, though, and it was easy for her to make a sidestep into publicity for hillbilly acts. For a time she was Hank Snow's personal publicist, and she would often work with Colonel Parker on promoting shows when they came through Florida, where she lived.\n\nShe'd interviewed Elvis when he came to Florida, and had immediately been struck by him. He'd talked to her about how amazed he was by how big the ocean was, and how he'd give anything to have enough money to bring his parents down to Florida to live there. She said later, \"That just went through my heart. 'Cause I looked down there, and there were all these other kids, different show members for that night, all the guys looking for cute little girls. But his priority was doing something for his mother and daddy.\"\n\nShe promised she'd write him a song, and by the end of the year, she had one for him.\n\n[Excerpt: Elvis Presley, “Heartbreak Hotel”]\n\n\"Heartbreak Hotel\" was, initially, the work of Tommy Durden, a country singer and songwriter.\n\nAs Durden used to tell it, he was inspired by a newspaper story of a man who'd died by suicide, who had been found with no identification on him and a note that simply read \"I walk a lonely street\".\n\nLater research has suggested that rather than a suicide, the story Durden had read was probably about an armed robber, Alvin Krolik, who had been shot dead in the course of committing a robbery. Krolik had, a few years earlier, after confessing to a string of other robberies, made the news with a partial autobiography he'd written containing the lines “If you stand on a corner with a pack of cigarettes or a bottle and have nothing to do in life, I suggest you sit down and think. This is the story of a person who walked a lonely street. I hope this will help someone in the future.”\n\nWhatever the actual story, it inspired Durden, who had a few lines of the song, and he played what he had to Mae Axton. She thought a lot about the phrase, and eventually came to the conclusion that what you'd find at the end of a lonely street was a heartbreak hotel. The two of them finished the song off, with the help of Glenn Reeves, a rockabilly singer who refused to take credit for his work on the song, because he thought it was ridiculous.\n\nReeves did, though, record the demo for them. They'd already decided that the song should be pitched to Elvis, and so Reeves impersonated Presley:\n\n[Excerpt: Glenn Reeves, \"Heartbreak Hotel\"]\n\nA lot of people have claimed that Elvis copied that recording exactly, phrasing and all. Comparing the two recordings, though, shows that that's not the case. Elvis definitely found it easier to record a song when he'd heard someone else doing it in an approximation of his style, and in the sixties he often *would* just copy the phrasing on demos.\n\nBut in the case of \"Heartbreak Hotel\", Elvis is not copying Reeves' phrasing at all. The two are similar, but that's just because Reeves is imitating Elvis in the first place. There are dozens of tiny choices Elvis makes throughout the song which differ from those made by Reeves, and it's clear that Elvis was thinking hard about the choices he was making.\n\nWhen Mae played him the song, insisting to him that it would be his first million seller, his reaction on hearing it was \"Hot dog, Mae! Play it again!\" He instantly fell in love with the song, which reminded the young blues-lover of Roy Brown's \"Hard Luck Blues\":\n\n[Excerpt: Roy Brown, \"Hard Luck Blues\"]\n\nElvis got a third of the songwriting credit for the song, which most people have said was insisted on by the Colonel – and certainly other songs Elvis recorded around that time gave him a credit for that reason. But to her dying day Mae Axton always said that she'd cut him in on the song so he might be able to get that money to buy his parents a house in Florida.\n\nThe session to record \"Heartbreak Hotel\" started with the engineers trying -- and failing -- to get a replica of Sam Phillips' slapback echo sound, which was a sound whose secret nobody but Phillips knew. Instead they set up a speaker at one end of the room and fed in the sound from the mics at the other end, creating a makeshift echo chamber which satisfied Chet Atkins but threw the musicians, who weren't used to hearing the echo live rather than added after the fact.\n\nAtkins isn't the credited producer for \"Heartbreak Hotel\" -- that's Steve Sholes, the A&R man at RCA Records who had signed Presley -- but by all accounts Atkins was nominally in charge of actually running the session. And certainly there would be no other reason for having Atkins there -- he played guitar on the record, but only adding another acoustic rhythm guitar to the sound, which was frankly a waste of the talents of probably the greatest country guitarist of his generation.\n\nThat said, Atkins didn't do that much production either -- according to Scotty Moore, his only suggestion was that they just keep doing what they'd been doing.\n\nTo start the session off, they recorded a quick version of \"I Got A Woman\", the Ray Charles song, which had been a staple of Elvis' live act since it had been released:\n\n[Excerpt: Elvis Presley, \"I Got A Woman\"]\n\nAfter that, the remainder of the first session was devoted to \"Heartbreak Hotel\", a record that has a sense of thought that's been put into the arrangement that's entirely absent from the Sun Records arrangements, which mostly consist of start the song, play the song through with a single solo, and end the song. The whole point of those records was to capture a kind of spontaneity, and you can't do much to play with the dynamics of an arrangement when there are only three instruments there. But now there were six -- Scotty Moore and Bill Black were there as always, as was D.J. Fontana, who had joined the band on drums in 1955 and was recording for the first time, along with Atkins and piano player Floyd Cramer, who played on many of the biggest hits to come out of Nashville in the fifties and sixties.\n\nAtkins and Cramer are two of the principal architects of what became known as \"the Nashville Sound\" or \"Countrypolitan\" -- there are distinctions between these two styles for those who are interested in the fine details of country music, but for our purposes they're the same, a style of country music that pulled the music away from its roots and towards a sound that was almost a continuation of the pre-rock pop sound, all vocal groups and strings with little in the way of traditional country instrumentation like fiddles, mandolins, banjos, and steel guitars. And there's an element of that with their work with Presley, too -- the rough edges being smoothed off, everything getting a little bit more mannered. But at this point it seems still to be working in the record's favour.\n\nAfter recording \"Heartbreak Hotel\", they took a break before spending another three-hour session recording another R&B cover that was a staple of Elvis' stage show, \"Money Honey\".\n\nAlong with the addition of Atkins and Cramer, there were also backing vocalists for the very first time. Now this is something that often gets treated as a problem by people coming to Elvis' music fresh today. Backing vocals in general have been deprecated in rock and roll music for much of the last fifty years, and people think of them as spoiling Elvis' artistry. There have even been releases of some of Elvis' recordings remixed to get rid of the backing vocals altogether (though that's thankfully not possible with these 1956 records, which were recorded directly to mono).\n\nBut the backing vocals weren't an irritating addition to Elvis' artistry. Rather, they were the essence of it, and if you're going to listen to Elvis at all, and have any understanding of what he was trying to do, you need to understand that before anything else.\n\nElvis' first ambition -- the aspiration he had right at the beginning of his career -- was to be a member of a gospel quartet. Elvis wanted to have his voice be part of a group, and he loved to sing harmony more than anything else. He wanted to sing in a gospel quartet before he ever met Sam Phillips, and as his career went on he only increased the number of backing vocalists he worked with -- by the end of his career he would have J.D. Sumner and the Stamps (a Southern Gospel group), *and* the Sweet Inspirations (the girl group who had backed Aretha Franklin), *and* Kathy Westmoreland, a classically-trained soprano, all providing backing vocals.\n\nHowever, the backing vocalists on this initial session weren't yet the Jordanaires, the group who would back Elvis throughout the fifties and sixties. One of the Jordanaires *was* there -- Gordon Stoker -- but the rest of them weren't hired for the January sessions, as Steve Sholes wanted to use members of a group who were signed with RCA in their own right -- the Speer Family. So Ben and Brock Speer joined Elvis and Stoker to make an unbalanced gospel quartet, with too many tenors and no baritone.\n\nWhen Elvis found out at a later session that this had happened as a cost-cutting measure, he insisted that all the Jordanaires be employed at his future sessions.\n\nThe next day, to end the sessions, they regrouped and cut a couple of ballads. \"I'm Counting On You\" was rather mediocre, but \"I Was The One\" ended up being Elvis' personal favourite track from the sessions:\n\n[Excerpt: Elvis Presley, \"I Was The One\"]\n\nAt the end of the sessions, Steve Sholes was very unsure if he'd made the right choice signing Elvis. He only had five tracks to show for three sessions in two days, when the normal thing was to record four songs per session -- Elvis and his group were so slow partly because they were used to the laid-back feel of the Sun studios, with Sam Phillips never clock-watching, and partly because Elvis was a perfectionist. Several times they'd recorded a take that Sholes had felt would be good enough to release, but Elvis had insisted he could do it better. He'd been right -- the later versions were an improvement -- but they had remarkably few tracks that they could use.\n\nMany of those who'd loved Elvis' earlier work were astonished at how bad \"Heartbreak Hotel\" sounded to them. The reverb, sounding so different from the restrained use of slapback on the Sun records, sounded to many ears, not least Sam Phillips', like a bad joke -- Phillips called the result \"a morbid mess\".\n\n[Excerpt: Elvis Presley, “Heartbreak Hotel”]\n\nYet it became a smash hit. It went to number one on the pop charts, number one in country, and made the top five in R&B. This was the moment when Elvis went from being a minor country singer on a minor label to being Elvis, Elvis the Pelvis, the King of Rock & Roll.\n\nAfter the sessions that produced \"Heartbreak Hotel\", Elvis went back into the studio twice more and recorded a set of songs -- mostly R&B and rockabilly covers -- for his first album. Almost all of these were Elvis' own choice of material, and so while his versions of \"Blue Suede Shoes\" or \"Tutti Frutti\" didn't match the quality of the originals, they were fine performances and perfect for album tracks. While the \"Heartbreak Hotel\" session had been in Nashville -- a natural choice, since it was both relatively close to Elvis' home town of Memphis, and the capital of country music, and Elvis was still supposedly a country artist -- the next couple of sessions were in New York, timed to coincide with Elvis' appearances on TV.\n\nStarting with the low-rated Stage Show, a programme that was presented by the swing bandleaders Tommy and Jimmy Dorsey, Elvis quickly moved up the ladder of TV shows, appearing first with Milton Berle, then with Steve Allen, and then finally on the Ed Sullivan show. On his first appearances, you can see the Elvis that people who knew him talked about – even as he's working the audience with what looks like the utmost confidence, you can see his fingers twitching wildly in a way he's not properly conscious of, and you can tell that under the mask of the sex symbol is the quiet country boy who would never meet anyone's eye.\n\nEach show caused more controversy than the last, as first Elvis' hip gyrations got him branded a moral menace, then he was forced to sing while standing still, and then only filmed from the waist up. Those shows helped propel \"Heartbreak Hotel\" to the top of the charts, but the Colonel decided that Elvis probably shouldn't do too much more TV – if people could see him without paying, why would they pay to see him? No, Elvis was going to be in films instead.\n\nBut all that work meant that Elvis' fourth set of sessions for RCA was fairly disastrous, and ended up with nothing that was usable. Elvis had been so busy promoting \"Heartbreak Hotel\" that he hadn't had any chance to prepare material, and so he just went with Steve Sholes' suggestion of \"I Want You I Need You I Love You\". But the session went terribly, because Elvis had no feel for the song at all. Normally, Elvis would learn a song straight away, after a single listen, but he just couldn't get the song in his head. They spent the whole session working on that single track, and didn't manage to get a usable take recorded at all. Steve Sholes eventually had to cobble together a take using bits of two different performances, and no-one was happy with it, but it reached number one on the country chart and number three on the pop charts. It was hardly \"Heartbreak Hotel\" levels of success, but it was OK.\n\nIt was the B-side of that single that was really worth listening to. A leftover from the album sessions, it was, like Elvis' first single, a cover version of an Arthur Crudup song. And this one also gave D.J. Fontana his first chance to shine.\n\n[Excerpt: Elvis Presley, \"My Baby Left Me\"]\n\nBy this point, it was very clear that if Elvis was given control of the studio and singing material he connected with, he would produce great things. And if he was doing what someone else thought he should be doing, he would be much less successful.\n\nA couple of months later Elvis and the group were back in the studio cutting what would become their biggest double-sided hit, both songs definitely chosen by Elvis. These days their cover version of Big Mama Thornton's \"Hound Dog\" is the better-known of the two sides they cut that day, but while that's an excellent track -- and one that bears almost no relation to Thornton's original -- the A-side, and the song that finally convinced several detractors, including Sam Phillips, that Elvis might be able to make decent records away from Sun, was \"Don't Be Cruel\", a song written by Otis Blackwell, but credited to Blackwell and Presley, as the Colonel insisted that his boy get a cut for making it a hit.\n\nOtis Blackwell is another person who we'll be hearing from a lot over the course of the series, as he wrote a string of hits, including several for Elvis, who he never met -- the one time he did have a chance to meet him, he declined, as he'd developed a superstition about meeting the man who'd given him his biggest hits.\n\nAt this time, Blackwell had just written the song \"Fever\" for Little Willie John:\n\n[Excerpt: \"Fever\", Little Willie John]\n\nThat song had become a big hit for Peggy Lee, in a version with different lyrics, and Blackwell was at the start of an impressive career. We don't have Blackwell's demo of \"Don't Be Cruel\", but he recorded a version in the 1970s which might give some idea of what Elvis heard in 1956:\n\n[Excerpt: Otis Blackwell, \"Don't Be Cruel\"]\n\nElvis' version showed a lightness of touch that had been absent on his earlier RCA records. He was finally in control of the sound he wanted in the studio. \"Don't Be Cruel\" took twenty-eight takes, and \"Hound Dog\" thirty-one, but you'd never believe it from the light, frothy, sound that \"Don't Be Cruel\" has in its finished version, where Elvis sounds as playful as if he was improvising the song on the spot:\n\n[Excerpt: Elvis Presley, \"Don't Be Cruel\"]\n\nBoth sides of the record went to number one – first “Don't Be Cruel” went to number one and “Hound Dog” to number two, and then they swapped over. Between them they spent eleven weeks at the top of the charts.\n\nBut even as Elvis was starting to take complete control in the studio, that control was starting to be taken away from him by events. His next session after the one that produced \"Hound Dog\" and \"Don't Be Cruel\" was one he had not been expecting. When he'd signed to make his first film, a Western called \"The Reno Brothers\", he'd expected it to be a straight acting role with no songs -- he wanted to follow the path of people like Frank Sinatra, who had parallel careers in the cinema and in music, and he also hoped that he could emulate his acting idols, Marlon Brando and James Dean.\n\nBut by the time he came to make the film, several songs had been added -- and he found out, to his annoyance, that he wasn't allowed to use Scotty, Bill, and DJ on the soundtrack, because the film company didn't think they could sound hillbilly enough. They were replaced with Hollywood session musicians, who could do a better job of sounding hillbilly than those country musicians could. Elvis didn't have any say over the material either, although he did like the main ballad that was going to be used in the film -- the other three songs were among the most mediocre he'd do in the fifties.\n\nBy the time \"The Reno Brothers\" was finished, it had been renamed \"Love Me Tender\", and we'll be picking up on Elvis' film career in a future episode...",
  "itunes:subtitle": "Episode thirty-eight of A History of Rock Music in Five Hundred Songs looks at Heartbreak Hotel by Elvis Presley, and is part three of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, ",
  "itunes:keywords": "Acuff-Rose publishing,Bill Black,Chet Atkins,Colonel Tom Parker,D.J. Fontana,Elvis Presley,Floyd Cramer,Hank Snow,Nashville,Otis Blackwell,RCA Records,Sam Phillips,Scotty Moore,Steve Sholes,Sun Records,The Jordanaires",
  "itunes:episodeType": "full",
  "itunes:episode": 38,
  "content:encoded": "Episode thirty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Heartbreak Hotel\" by Elvis Presley, and is part three of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/27855307\">\"The Flying Saucer\" by Buchanan and Goodman. </a>\n\nAlso, it came too late for me to acknowledge in the episode itself, but I have to mention the sad news that Dave Bartholomew died today, aged 100. He will be missed.\n\n<strong></strong>\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-38-heartbreak-hotel/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> by Peter Guralnick</a>, generally considered the best biography of him.\n\n<a href=\"https://amzn.to/2J3krIS\">This 3-CD box set</a> (expensive on CD, but relatively cheap as MP3s) contains every surviving recording by Elvis from 1956, including outtakes. <a href=\"https://amzn.to/2FtYilZ\">This more reasonably priced ten-CD box</a> contains every official release he put out from 1954 through 62, but without the outtakes.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe've talked before, a couple of times, about Elvis Presley and his early recordings. Those Sun records are the ones on which his artistic reputation now largely rests, but they weren't the ones that made him famous. He didn't become the Elvis we all know until he started recording for RCA. So today we're going to look at the first single he put out on a major label, and the way it turned him from a minor regional country star into the King of Rock and Roll, a cultural phenomenon that would eclipse all music prior to him, and lead John Lennon to say \"Before Elvis there was nothing\".\n\nAs you might remember from the last episode on Elvis, a few weeks ago, Elvis' manager, Colonel Tom Parker, had managed to get Elvis signed to RCA Records for a sum of money far greater than anything anyone had paid for a singer before, after Sam Phillips made what seemed like a ludicrous demand just to get Parker out of his hair.\n\nAnd this was a big deal. Sun Records, as we've seen, was a tiny regional operation. It was able to generate massive hits for Carl Perkins and Johnny Cash after Elvis left, but that's only because of the cash the label was able to make from the Elvis deal. It's safe to say that the whole genre of rockabilly was funded by that one deal. RCA, on the other hand, was one of the biggest labels in the world.\n\nThe first thing RCA did was to reissue his last Sun single, \"I Forgot to Remember to Forget\", backed with \"Mystery Train\". With RCA's backing, the single did far better than it had on Sun, hitting number one on the country charts at the beginning of 1956.\n\nBut was that enough to make the money RCA had paid for Elvis worth it? When Elvis went into the studio on January 10 1956, two days after his twenty-first birthday, the pressure was on him to record something very special indeed.\n\nBefore going into the studio, Elvis had been sent ten demos of songs to consider for this first session. The song he ended up choosing as the main one for the session, though, was a song by someone he already knew -- and for which he had a third of the songwriting credit.\n\nMae Axton was an odd figure. She was an English teacher who had a sideline as a freelance journalist. One day she was asked by a magazine she was freelancing for to write a story about hillbilly music, a subject about which she knew nothing. She went to Nashville to interview the singer Minnie Pearl, and while she was working on her story, Pearl introduced her to Fred Rose, the co-owner of Acuff-Rose Publishing, the biggest publishing company in country music. And Pearl, for some reason, told Rose that Mae, who had never written a song in her life, was a songwriter.\n\nRose said that he needed a new novelty song for a recording session for the singer Dub Dickerson that afternoon, and asked Mae to write him one. And so, all of a sudden, Mae Axton was a songwriter, and she eventually wrote over two hundred songs, starting with her early collaborations with Dub Dickerson:\n\n[Excerpt: Dub Dickerson, \"Shotgun Wedding\"]\n\nShe was still also a freelance journalist, though, and it was easy for her to make a sidestep into publicity for hillbilly acts. For a time she was Hank Snow's personal publicist, and she would often work with Colonel Parker on promoting shows when they came through Florida, where she lived.\n\nShe'd interviewed Elvis when he came to Florida, and had immediately been struck by him. He'd talked to her about how amazed he was by how big the ocean was, and how he'd give anything to have enough money to bring his parents down to Florida to live there. She said later, \"That just went through my heart. 'Cause I looked down there, and there were all these other kids, different show members for that night, all the guys looking for cute little girls. But his priority was doing something for his mother and daddy.\"\n\nShe promised she'd write him a song, and by the end of the year, she had one for him.\n\n[Excerpt: Elvis Presley, “Heartbreak Hotel”]\n\n\"Heartbreak Hotel\" was, initially, the work of Tommy Durden, a country singer and songwriter.\n\nAs Durden used to tell it, he was inspired by a newspaper story of a man who'd died by suicide, who had been found with no identification on him and a note that simply read \"I walk a lonely street\".\n\nLater research has suggested that rather than a suicide, the story Durden had read was probably about an armed robber, Alvin Krolik, who had been shot dead in the course of committing a robbery. Krolik had, a few years earlier, after confessing to a string of other robberies, made the news with a partial autobiography he'd written containing the lines “If you stand on a corner with a pack of cigarettes or a bottle and have nothing to do in life, I suggest you sit down and think. This is the story of a person who walked a lonely street. I hope this will help someone in the future.”\n\nWhatever the actual story, it inspired Durden, who had a few lines of the song, and he played what he had to Mae Axton. She thought a lot about the phrase, and eventually came to the conclusion that what you'd find at the end of a lonely street was a heartbreak hotel. The two of them finished the song off, with the help of Glenn Reeves, a rockabilly singer who refused to take credit for his work on the song, because he thought it was ridiculous.\n\nReeves did, though, record the demo for them. They'd already decided that the song should be pitched to Elvis, and so Reeves impersonated Presley:\n\n[Excerpt: Glenn Reeves, \"Heartbreak Hotel\"]\n\nA lot of people have claimed that Elvis copied that recording exactly, phrasing and all. Comparing the two recordings, though, shows that that's not the case. Elvis definitely found it easier to record a song when he'd heard someone else doing it in an approximation of his style, and in the sixties he often *would* just copy the phrasing on demos.\n\nBut in the case of \"Heartbreak Hotel\", Elvis is not copying Reeves' phrasing at all. The two are similar, but that's just because Reeves is imitating Elvis in the first place. There are dozens of tiny choices Elvis makes throughout the song which differ from those made by Reeves, and it's clear that Elvis was thinking hard about the choices he was making.\n\nWhen Mae played him the song, insisting to him that it would be his first million seller, his reaction on hearing it was \"Hot dog, Mae! Play it again!\" He instantly fell in love with the song, which reminded the young blues-lover of Roy Brown's \"Hard Luck Blues\":\n\n[Excerpt: Roy Brown, \"Hard Luck Blues\"]\n\nElvis got a third of the songwriting credit for the song, which most people have said was insisted on by the Colonel – and certainly other songs Elvis recorded around that time gave him a credit for that reason. But to her dying day Mae Axton always said that she'd cut him in on the song so he might be able to get that money to buy his parents a house in Florida.\n\nThe session to record \"Heartbreak Hotel\" started with the engineers trying -- and failing -- to get a replica of Sam Phillips' slapback echo sound, which was a sound whose secret nobody but Phillips knew. Instead they set up a speaker at one end of the room and fed in the sound from the mics at the other end, creating a makeshift echo chamber which satisfied Chet Atkins but threw the musicians, who weren't used to hearing the echo live rather than added after the fact.\n\nAtkins isn't the credited producer for \"Heartbreak Hotel\" -- that's Steve Sholes, the A&R man at RCA Records who had signed Presley -- but by all accounts Atkins was nominally in charge of actually running the session. And certainly there would be no other reason for having Atkins there -- he played guitar on the record, but only adding another acoustic rhythm guitar to the sound, which was frankly a waste of the talents of probably the greatest country guitarist of his generation.\n\nThat said, Atkins didn't do that much production either -- according to Scotty Moore, his only suggestion was that they just keep doing what they'd been doing.\n\nTo start the session off, they recorded a quick version of \"I Got A Woman\", the Ray Charles song, which had been a staple of Elvis' live act since it had been released:\n\n[Excerpt: Elvis Presley, \"I Got A Woman\"]\n\nAfter that, the remainder of the first session was devoted to \"Heartbreak Hotel\", a record that has a sense of thought that's been put into the arrangement that's entirely absent from the Sun Records arrangements, which mostly consist of start the song, play the song through with a single solo, and end the song. The whole point of those records was to capture a kind of spontaneity, and you can't do much to play with the dynamics of an arrangement when there are only three instruments there. But now there were six -- Scotty Moore and Bill Black were there as always, as was D.J. Fontana, who had joined the band on drums in 1955 and was recording for the first time, along with Atkins and piano player Floyd Cramer, who played on many of the biggest hits to come out of Nashville in the fifties and sixties.\n\nAtkins and Cramer are two of the principal architects of what became known as \"the Nashville Sound\" or \"Countrypolitan\" -- there are distinctions between these two styles for those who are interested in the fine details of country music, but for our purposes they're the same, a style of country music that pulled the music away from its roots and towards a sound that was almost a continuation of the pre-rock pop sound, all vocal groups and strings with little in the way of traditional country instrumentation like fiddles, mandolins, banjos, and steel guitars. And there's an element of that with their work with Presley, too -- the rough edges being smoothed off, everything getting a little bit more mannered. But at this point it seems still to be working in the record's favour.\n\nAfter recording \"Heartbreak Hotel\", they took a break before spending another three-hour session recording another R&B cover that was a staple of Elvis' stage show, \"Money Honey\".\n\nAlong with the addition of Atkins and Cramer, there were also backing vocalists for the very first time. Now this is something that often gets treated as a problem by people coming to Elvis' music fresh today. Backing vocals in general have been deprecated in rock and roll music for much of the last fifty years, and people think of them as spoiling Elvis' artistry. There have even been releases of some of Elvis' recordings remixed to get rid of the backing vocals altogether (though that's thankfully not possible with these 1956 records, which were recorded directly to mono).\n\nBut the backing vocals weren't an irritating addition to Elvis' artistry. Rather, they were the essence of it, and if you're going to listen to Elvis at all, and have any understanding of what he was trying to do, you need to understand that before anything else.\n\nElvis' first ambition -- the aspiration he had right at the beginning of his career -- was to be a member of a gospel quartet. Elvis wanted to have his voice be part of a group, and he loved to sing harmony more than anything else. He wanted to sing in a gospel quartet before he ever met Sam Phillips, and as his career went on he only increased the number of backing vocalists he worked with -- by the end of his career he would have J.D. Sumner and the Stamps (a Southern Gospel group), *and* the Sweet Inspirations (the girl group who had backed Aretha Franklin), *and* Kathy Westmoreland, a classically-trained soprano, all providing backing vocals.\n\nHowever, the backing vocalists on this initial session weren't yet the Jordanaires, the group who would back Elvis throughout the fifties and sixties. One of the Jordanaires *was* there -- Gordon Stoker -- but the rest of them weren't hired for the January sessions, as Steve Sholes wanted to use members of a group who were signed with RCA in their own right -- the Speer Family. So Ben and Brock Speer joined Elvis and Stoker to make an unbalanced gospel quartet, with too many tenors and no baritone.\n\nWhen Elvis found out at a later session that this had happened as a cost-cutting measure, he insisted that all the Jordanaires be employed at his future sessions.\n\nThe next day, to end the sessions, they regrouped and cut a couple of ballads. \"I'm Counting On You\" was rather mediocre, but \"I Was The One\" ended up being Elvis' personal favourite track from the sessions:\n\n[Excerpt: Elvis Presley, \"I Was The One\"]\n\nAt the end of the sessions, Steve Sholes was very unsure if he'd made the right choice signing Elvis. He only had five tracks to show for three sessions in two days, when the normal thing was to record four songs per session -- Elvis and his group were so slow partly because they were used to the laid-back feel of the Sun studios, with Sam Phillips never clock-watching, and partly because Elvis was a perfectionist. Several times they'd recorded a take that Sholes had felt would be good enough to release, but Elvis had insisted he could do it better. He'd been right -- the later versions were an improvement -- but they had remarkably few tracks that they could use.\n\nMany of those who'd loved Elvis' earlier work were astonished at how bad \"Heartbreak Hotel\" sounded to them. The reverb, sounding so different from the restrained use of slapback on the Sun records, sounded to many ears, not least Sam Phillips', like a bad joke -- Phillips called the result \"a morbid mess\".\n\n[Excerpt: Elvis Presley, “Heartbreak Hotel”]\n\nYet it became a smash hit. It went to number one on the pop charts, number one in country, and made the top five in R&B. This was the moment when Elvis went from being a minor country singer on a minor label to being Elvis, Elvis the Pelvis, the King of Rock & Roll.\n\nAfter the sessions that produced \"Heartbreak Hotel\", Elvis went back into the studio twice more and recorded a set of songs -- mostly R&B and rockabilly covers -- for his first album. Almost all of these were Elvis' own choice of material, and so while his versions of \"Blue Suede Shoes\" or \"Tutti Frutti\" didn't match the quality of the originals, they were fine performances and perfect for album tracks. While the \"Heartbreak Hotel\" session had been in Nashville -- a natural choice, since it was both relatively close to Elvis' home town of Memphis, and the capital of country music, and Elvis was still supposedly a country artist -- the next couple of sessions were in New York, timed to coincide with Elvis' appearances on TV.\n\nStarting with the low-rated Stage Show, a programme that was presented by the swing bandleaders Tommy and Jimmy Dorsey, Elvis quickly moved up the ladder of TV shows, appearing first with Milton Berle, then with Steve Allen, and then finally on the Ed Sullivan show. On his first appearances, you can see the Elvis that people who knew him talked about – even as he's working the audience with what looks like the utmost confidence, you can see his fingers twitching wildly in a way he's not properly conscious of, and you can tell that under the mask of the sex symbol is the quiet country boy who would never meet anyone's eye.\n\nEach show caused more controversy than the last, as first Elvis' hip gyrations got him branded a moral menace, then he was forced to sing while standing still, and then only filmed from the waist up. Those shows helped propel \"Heartbreak Hotel\" to the top of the charts, but the Colonel decided that Elvis probably shouldn't do too much more TV – if people could see him without paying, why would they pay to see him? No, Elvis was going to be in films instead.\n\nBut all that work meant that Elvis' fourth set of sessions for RCA was fairly disastrous, and ended up with nothing that was usable. Elvis had been so busy promoting \"Heartbreak Hotel\" that he hadn't had any chance to prepare material, and so he just went with Steve Sholes' suggestion of \"I Want You I Need You I Love You\". But the session went terribly, because Elvis had no feel for the song at all. Normally, Elvis would learn a song straight away, after a single listen, but he just couldn't get the song in his head. They spent the whole session working on that single track, and didn't manage to get a usable take recorded at all. Steve Sholes eventually had to cobble together a take using bits of two different performances, and no-one was happy with it, but it reached number one on the country chart and number three on the pop charts. It was hardly \"Heartbreak Hotel\" levels of success, but it was OK.\n\nIt was the B-side of that single that was really worth listening to. A leftover from the album sessions, it was, like Elvis' first single, a cover version of an Arthur Crudup song. And this one also gave D.J. Fontana his first chance to shine.\n\n[Excerpt: Elvis Presley, \"My Baby Left Me\"]\n\nBy this point, it was very clear that if Elvis was given control of the studio and singing material he connected with, he would produce great things. And if he was doing what someone else thought he should be doing, he would be much less successful.\n\nA couple of months later Elvis and the group were back in the studio cutting what would become their biggest double-sided hit, both songs definitely chosen by Elvis. These days their cover version of Big Mama Thornton's \"Hound Dog\" is the better-known of the two sides they cut that day, but while that's an excellent track -- and one that bears almost no relation to Thornton's original -- the A-side, and the song that finally convinced several detractors, including Sam Phillips, that Elvis might be able to make decent records away from Sun, was \"Don't Be Cruel\", a song written by Otis Blackwell, but credited to Blackwell and Presley, as the Colonel insisted that his boy get a cut for making it a hit.\n\nOtis Blackwell is another person who we'll be hearing from a lot over the course of the series, as he wrote a string of hits, including several for Elvis, who he never met -- the one time he did have a chance to meet him, he declined, as he'd developed a superstition about meeting the man who'd given him his biggest hits.\n\nAt this time, Blackwell had just written the song \"Fever\" for Little Willie John:\n\n[Excerpt: \"Fever\", Little Willie John]\n\nThat song had become a big hit for Peggy Lee, in a version with different lyrics, and Blackwell was at the start of an impressive career. We don't have Blackwell's demo of \"Don't Be Cruel\", but he recorded a version in the 1970s which might give some idea of what Elvis heard in 1956:\n\n[Excerpt: Otis Blackwell, \"Don't Be Cruel\"]\n\nElvis' version showed a lightness of touch that had been absent on his earlier RCA records. He was finally in control of the sound he wanted in the studio. \"Don't Be Cruel\" took twenty-eight takes, and \"Hound Dog\" thirty-one, but you'd never believe it from the light, frothy, sound that \"Don't Be Cruel\" has in its finished version, where Elvis sounds as playful as if he was improvising the song on the spot:\n\n[Excerpt: Elvis Presley, \"Don't Be Cruel\"]\n\nBoth sides of the record went to number one – first “Don't Be Cruel” went to number one and “Hound Dog” to number two, and then they swapped over. Between them they spent eleven weeks at the top of the charts.\n\nBut even as Elvis was starting to take complete control in the studio, that control was starting to be taken away from him by events. His next session after the one that produced \"Hound Dog\" and \"Don't Be Cruel\" was one he had not been expecting. When he'd signed to make his first film, a Western called \"The Reno Brothers\", he'd expected it to be a straight acting role with no songs -- he wanted to follow the path of people like Frank Sinatra, who had parallel careers in the cinema and in music, and he also hoped that he could emulate his acting idols, Marlon Brando and James Dean.\n\nBut by the time he came to make the film, several songs had been added -- and he found out, to his annoyance, that he wasn't allowed to use Scotty, Bill, and DJ on the soundtrack, because the film company didn't think they could sound hillbilly enough. They were replaced with Hollywood session musicians, who could do a better job of sounding hillbilly than those country musicians could. Elvis didn't have any say over the material either, although he did like the main ballad that was going to be used in the film -- the other three songs were among the most mediocre he'd do in the fifties.\n\nBy the time \"The Reno Brothers\" was finished, it had been renamed \"Love Me Tender\", and we'll be picking up on Elvis' film career in a future episode...",
  "enclosure": "",
  "itunes:summary": "Episode thirty-eight of A History of Rock Music in Five Hundred Songs looks at \"Heartbreak Hotel\" by Elvis Presley, and is part three of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"The Flying Saucer\" by Buchanan and Goodman. \n\nAlso, it came too late for me to acknowledge in the episode itself, but I have to mention the sad news that Dave Bartholomew died today, aged 100. He will be missed.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally considered the best biography of him.\n\nThis 3-CD box set (expensive on CD, but relatively cheap as MP3s) contains every surviving recording by Elvis from 1956, including outtakes. This more reasonably priced ten-CD box contains every official release he put out from 1954 through 62, but without the outtakes.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe've talked before, a couple of times, about Elvis Presley and his early recordings. Those Sun records are the ones on which his artistic reputation now largely rests, but they weren't the ones that made him famous. He didn't become the Elvis we all know until he started recording for RCA. So today we're going to look at the first single he put out on a major label, and the way it turned him from a minor regional country star into the King of Rock and Roll, a cultural phenomenon that would eclipse all music prior to him, and lead John Lennon to say \"Before Elvis there was nothing\".\n\nAs you might remember from the last episode on Elvis, a few weeks ago, Elvis' manager, Colonel Tom Parker, had managed to get Elvis signed to RCA Records for a sum of money far greater than anything anyone had paid for a singer before, after Sam Phillips made what seemed like a ludicrous demand just to get Parker out of his hair.\n\nAnd this was a big deal. Sun Records, as we've seen, was a tiny regional operation. It was able to generate massive hits for Carl Perkins and Johnny Cash after Elvis left, but that's only because of the cash the label was able to make from the Elvis deal. It's safe to say that the whole genre of rockabilly was funded by that one deal. RCA, on the other hand, was one of the biggest labels in the world.\n\nThe first thing RCA did was to reissue his last Sun single, \"I Forgot to Remember to Forget\", backed with \"Mystery Train\". With RCA's backing, the single did far better than it had on Sun, hitting number one on the country charts at the beginning of 1956.\n\nBut was that enough to make the money RCA had paid for Elvis worth it? When Elvis went into the studio on January 10 1956, two days after his twenty-first birthday, the pressure was on him to record something very special indeed.\n\nBefore going into the studio, Elvis had been sent ten demos of songs to consider for this first session. The song he ended up choosing as the main one for the session, though, was a song by someone he already knew -- and for which he had a third of the songwriting credit.\n\nMae Axton was an odd figure. She was an English teacher who had a sideline as a freelance journalist. One day she was asked by a magazine she was freelancing for to write a story about hillbilly music, a subject about which she knew nothing. She went to Nashville to interview the singer Minnie Pearl, and while she was working on her story, Pearl introduced her to Fred Rose, the co-owner of Acuff-Rose Publishing, the biggest publishing company in country music. And Pearl, for some reason, told Rose that Mae, who ha",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode thirty-eight of A History of Rock Music in Five Hundred Songs looks at \"Heartbreak Hotel\" by Elvis Presley, and is part three of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"The Flying Saucer\" by Buchanan and Goodman. \n\nAlso, it came too late for me to acknowledge in the episode itself, but I have to mention the sad news that Dave Bartholomew died today, aged 100. He will be missed.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are many, many books about Elvis Presley out there, but the one I'm using as my major resource for information on him, and which has guided my views as to the kind of person he was, is Last Train to Memphis by Peter Guralnick, generally considered the best biography of him.\n",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}