{
  "title": "S14 Ep37: Journeying Between the Worlds with Eagle Skyfire",
  "link": "https://audioboom.com/posts/8098593",
  "itunes:episode": 37,
  "itunes:title": "Journeying Between the Worlds with Eagle Skyfire",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4873,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS sets your course for your course for adventure today as we begin Journeying Between the Worlds with Eagle Skyfire.<br>\n<br>\nToday we go into the world of shamanism to make sacred connections with the natural world, divine beings, and your own soul.<br>\n<br>\nVisit her site here: <a href=\"https://eagleskyfire.com/\">https://eagleskyfire.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more!",
  "itunes:summary": "BEYOND the DARKNESS sets your course for your course for adventure today as we begin Journeying Between the Worlds with Eagle Skyfire.\n\nToday we go into the world of shamanism to make sacred connections with the natural world, divine beings,...",
  "pubDate": "Sun, 05 May 2019 08:00:00 +0000",
  "guid": "88537752-e819-4eb2-9b41-402419f6110c",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}