{
  "id": "https://bibleinoneyear.org/en/youth/323",
  "title": "Day 323: Divine Connections",
  "description": "Psalm 129:4, Ezekiel 37:2b–5,6b–10, James 3:1–2a,3–5,9–11,13–18. 3)  The answer is yes, yes, yes",
  "pubDate": "Fri, 19 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/323/?ignore",
  "itunes:duration": "14:39",
  "guid": "enyouth19112021-323",
  "length": 879.88,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 323: Divine Connections",
  "itunes:subtitle": "Psalm 129:4, Ezekiel 37:2b–5,6b–10, James 3:1–2a,3–5,9–11,13–18. 3)  The answer is yes, yes, yes",
  "itunes:summary": "God has divine connections lined up for your life. There is power in connection. Connections lead to life. When a husband and a wife come together, babies are born. When the spirit of a person and the Spirit of God come together, new birth takes place. When brothers and sisters come together in unity, God commands his blessing (Psalm 133). When the disciples came together on the day of Pentecost, there was an outpouring of the Holy Spirit.\nThe devil fears connection. His ultimate aim is to cut you off from God. He tries to split marriages, to split friendships, to divide churches, to divide denominations and to isolate people. Although our culture is more connected than ever before through the internet, phones and social media, people are more isolated and lonely than ever.\nIn 586 BC, Ezekiel had a vision of a battle scene; he saw Death Valley. The valley was full of bones; bones that were very dry because they had separated. They were scattered, fragmented, divided, cut-off, ‘abandoned’ and therefore dried up. The people of God were in exile and had been scattered by the enemy. They were saying, ‘Our bones are dried up and our hope is gone; we are cut off’ (Ezekiel 37:11). God asks Ezekiel, ‘Can these bones live?’ (v.3). The answer is yes, yes, yes.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 323
}