{
  "id": "yt:video:fTIL8QPYfqs",
  "yt:videoId": "fTIL8QPYfqs",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Here's What Happened To Elizabeth Holmes",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-11-04T19:00:23+00:00",
  "updated": "2022-11-04T19:33:57+00:00",
  "media:group": {
    "media:title": "Here's What Happened To Elizabeth Holmes",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Elizabeth Holmes is one of the most infamous founders in the world having pulled off the greatest fraud of silicon valley: Theranos. Theranos promised to revolutionize blood testing by reducing the amount of blood required to conduct various tests to just one drop of blood. While this idea was no doubt ingenious and likely would’ve done extraordinarily well in the real world, the problem was the idea simply wasn’t feasible with current technology. So, Theranos turned to handing out unreliable exam results or diluting the blood before using traditional testing machinery. Eventually, the media and regulators caught on which resulted in Theranos testing being banned and eventually shut down. And Elizabeth Holmes has since been charged with 11 counts of criminal felony and convicted of three charges of wire fraud and one charge of conspiracy to commit wire fraud. Today, Elizabeth is waiting to get her sentence which is scheduled to take place on November 18, 2022. While Elizabeth is subject to up to 20 years in prison, experts doubt that she’ll spend even more than 10 years in prison. With that being said though, experts don’t think she’ll be able to completely avoid jail time either. This video explains what happened to Elizabeth Holmes after Theranos was exposed and the potential consequences that she may face. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - D Day\n2:03 - Fooling Everyone \n5:25 - The Truth Comes Out\n8:20 - The Fallout\n11:20 - Fake It Till You Make It\n\nThumbnail Credit:\nEthan Pines - The Forbes Collection\nhttps://bit.ly/3Dvf8Ov\n\nResources: \nhttps://pastebin.com/GSZsw0HD",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}