{
  "title": "S1E36 - Always be Learning Your Craft with Volleyball Olympic Medalist Rachael Adams",
  "guid": "https://pinecast.com/guid/9774f85f-b7e1-406b-add1-7e933b71c8b4",
  "pubDate": "Tue, 09 Mar 2021 07:30:00 -0000",
  "itunes:duration": "00:50:03",
  "description": "<p>Having had to postpone today’s interview due to the recent winter storm in Texas, Laura is absolutely delighted to finally welcome Rachael Adams to the podcast. After getting off to a relatively late start in the game of volleyball, Rachael has gone on to great success in the sport including being a member of the <a href=\"https://www.teamusa.org/usa-volleyball/usa-teams/indoor-volleyball/women\" rel=\"nofollow\">U.S. Women’s National Volleyball Team</a>, a professional player overseas, and an Olympic medalist. Throughout her career, she has demonstrated a desire to keep learning and to persevere through any challenge, which has served her incredibly well, and which is also clearly evident in her conversation with Laura here today.\n \nRachael begins by sharing her somewhat unique introduction to volleyball, the rapid progress she made, and how her parents’ approach to her career has helped her immensely throughout. She then discusses her experience with recruitment, college, getting to the Olympic squad, and playing professionally overseas. Rachael then finishes up by detailing her return to playing since her surgery, the sense of inner trust and determination which has helped her through it, her definition of success, and the website that she has created to offer support and inspiration to other athletes. A model of  authenticity, Rachael Adams is a true champion in life as well as sport, and we are all truly blessed to be able to soak up the words of wisdom and inspiration which she shares here today.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>How Rachael found volleyball</li>\n<li>Her rapid progress in the sport</li>\n<li>Rachael’s parents and their approach to her career</li>\n<li>Her recruiting process</li>\n<li>Rachael’s college experience</li>\n<li>The process of getting to the Olympic volleyball squad in the past and for Tokyo</li>\n<li>Making the 2016 Olympic squad</li>\n<li>Maintaining her mindset</li>\n<li>How the pandemic and the Tokyo postponement have affected Rachael</li>\n<li>Transitioning from college to professional volleyball</li>\n<li>Rachael’s experience playing overseas</li>\n<li>Her favorite country to play in</li>\n<li>Coming back after surgery</li>\n<li>Rachael’s inner trust and inner determination</li>\n<li>Her definition of success at this point in her career</li>\n<li>Rachael’s most memorable tournament</li>\n<li><a href=\"http://journeystrength.com\" rel=\"nofollow\">journeystrength.com</a></li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“Thank you for being such a great social media person.”</li>\n<li>“Why have the crazy journey if you aren’t going to share and inspire others along the way, you know?”</li>\n<li>“I became addicted to that learning process…my Dad always told me to be a sponge, and that’s what I became.”</li>\n<li>“It’s been a kind of a crazy long journey, but I’ve learned a lot about myself through so many ups and downs.”</li>\n<li>“I still feel like there’s so much left to learn.”</li>\n<li>“So much a part of my career was self-driven.”</li>\n<li>“They let me fail, they let me succeed, and didn’t try to sugarcoat everything.”</li>\n<li>“Would I want to go to this college even if there was no volleyball?”</li>\n<li>“You see more experienced players, more older players, more seasoned players, making Olympic squads than, like, younger players.”</li>\n<li>“All you can do is, like, be your best, show up, put your best skills in front, be a good teammate, and hope that the body of work that you’re building is what the coaches want for the team.”</li>\n<li>“It’s so much out of your control.”</li>\n<li>“I’m literally just focusing on, like, one day at a time, one rep at a time, one accomplishment at a time, one practice, and just building little things from there.”</li>\n<li>“You think you know everything, but you don’t, and you’re just very humbled.”</li>\n<li>“You can’t be mindless in a foreign country.”</li>\n<li>“The lonely grind…that’s what I’m in right now.”</li>\n<li>“I totally feel you on so many levels.”</li>\n<li>“It kind of feels like a little bit of your mission is to make sure other people know that they’re more than they might think they are.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">  Laura's Instagram</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">  Laura's Facebook page</a>\n \nConnect with Rachael: \n<a href=\"https://journeystrength.com/\" rel=\"nofollow\">journeystrength homepage</a>\n<a href=\"https://www.instagram.com/rachaeladams\" rel=\"nofollow\">Rachael's Instagram</a>\n<a href=\"https://www.instagram.com/journeystrength/\" rel=\"nofollow\">journeystrength's Instagram</a></p>",
  "itunes:title": "Always be Learning Your Craft with Volleyball Olympic Medalist Rachael Adams",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 36
}