{
  "id": "yt:video:j7WGP6sJBLk",
  "yt:videoId": "j7WGP6sJBLk",
  "yt:channelId": "UCNSoNc9s67nfOGlCXSu5VsA",
  "title": "A Drepanocyte Caused Vasoocclusion. This Is What Happened To The Renal Medulla.",
  "link": "",
  "author": {
    "name": "Heme Review",
    "uri": "https://www.youtube.com/channel/UCNSoNc9s67nfOGlCXSu5VsA"
  },
  "published": "2021-08-18T23:00:01+00:00",
  "updated": "2022-07-23T11:08:23+00:00",
  "media:group": {
    "media:title": "A Drepanocyte Caused Vasoocclusion. This Is What Happened To The Renal Medulla.",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "​@Chubbyemu video: https://youtu.be/3E75UvmY9GA\nInterview with Herman Connor: https://youtu.be/w5zLOZE-Goc\nAudio version of this podcast available at https://anchor.fm/chubbyemu/episodes/A-Sickle-Cell-Caused-Vasoocclusion--This-Is-What-Happened-To-The-Kidney-Medulla-e1646ln\nTweet Dr Msaouel: https://www.twitter.com/pavlosmsaouel\n\nIG me: https://www.instagram.com/hemereview\nTweet me: https://www.twitter.com/hemereview\n\nThank you Dr Nizar Tannir, Dr Pavlos Msaouel, Cora and Herman Connor, and Dr Loren Stagg\nProduction Assistant: Nick Brown\n\nMusic by @Lifeformed ► https://lifeformed.bandcamp.com\nSome images courtesy Getty Images\n\nRenal Medullary Carcinoma is a sickle cell related kidney malignancy that is usually diagnosed in young patients (median age at diagnosis 28 years old). It is considered a rare malignancy but likely afflicts more people than prior literature suggests given that review of that literature shows patients more in line with Renal Medullary Carcinoma rather than Collecting Duct Carcinoma. 3 year overall survival of RMC is 3%. Upfront chemotherapy then surgery is the suggested treatment. Response rate to platinum based chemotherapies, gemcitabine, doxorubicin is 29%.\n\nReferences:\n\nRenal medullary carcinoma. The seventh sickle cell nephropathy. Am J Surg Pathol. 1995 Jan;19(1):1-11. https://pubmed.ncbi.nlm.nih.gov/7528470/\n\nA Model Linking Sickle Cell Hemoglobinopathies and SMARCB1 Loss in Renal Medullary Carcinoma. Clin Cancer Res. 2018 May 1;24(9):2044-2049. https://pubmed.ncbi.nlm.nih.gov/29440190/\n\nUpdated Recommendations on the Diagnosis, Management, and Clinical Trial Eligibility Criteria for Patients With Renal Medullary Carcinoma. Clin Genitourin Cancer. 2019 Feb;17(1):1-6. https://pubmed.ncbi.nlm.nih.gov/30287223/\n\nFive decades of urologic pathology: the accelerating expansion of knowledge in renal cell neoplasia. Hum Pathol. 2020 Jan;95:24-45. https://pubmed.ncbi.nlm.nih.gov/31655169/\n\nGG Malouf, NM Tannir, P Rao, P Msaouel. Renal Medullary Carcinoma in Rare Kidney Tumors.\n\nComprehensive Molecular Characterization Identifies Distinct Genomic and Immune Hallmarks of Renal Medullary Carcinoma. Cancer Cell. 2020 May 11;37(5):720-734.e13. https://pubmed.ncbi.nlm.nih.gov/32359397/\n\nThe DNA sequence of human chromosome 22. Nature. 1999 Dec 2;402(6761):489-95. https://pubmed.ncbi.nlm.nih.gov/10591208/\n\nHigh-intensity exercise is a risk factor for renal medullary carcinoma in individuals with sickle cell trait. Preprint. \n\nAtypical carcinoma of kidney originating from collecting duct epithelium. Urology. 1982 Jan;19(1):89-92. https://pubmed.ncbi.nlm.nih.gov/7058597/\n\nGenes affecting the regulation of SUC2 gene expression by glucose repression in Saccharomyces cerevisiae. Genetics. 1984 Dec;108(4):845-58. https://pubmed.ncbi.nlm.nih.gov/6392017/\n\nPurification and biochemical heterogeneity of the mammalian SWI-SNF complex. EMBO J. 1996 Oct 1; 15(19): 5370–5382. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC452280/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}