{
  "title": "The Electric Purple Snake-Oil Machine",
  "link": "https://spectrum.ieee.org/violet-ray",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-antique-medical-apparatus-consisting-of-a-black-wand-various-glass-tools-to-plug-into-the-wand-and-a-power-cord.jpg?id=31822581&width=1245&height=700&coordinates=0%2C337%2C0%2C338\"/><br/><br/><p>\n<strong>The violet ray machine </strong>has an awesome name that conjures up images of cartoon supervillains taking out Gotham, but its <em>actual</em> history is even odder—and it includes a superhero, not a villain.\n</p><p>\n\tThe technology underpinning the machine begins with none other than \n\t<a href=\"https://ethw.org/Nikola_Tesla\" rel=\"noopener noreferrer\" target=\"_blank\">Nikola Tesla</a> and his <a href=\"https://handwiki.org/wiki/Engineering:History_of_the_Tesla_coil\" rel=\"noopener noreferrer\" target=\"_blank\">eponymous coil</a>. After Tesla and others made some refinements to the device, an influential clairvoyant named Edgar Cayce popularized violet ray machines for treating just about every kind of ailment—rheumatism and nervous conditions, acne and baldness, gonorrhea and prostate troubles, brain fog and writer’s cramp. Even Wonder Woman had her own health-restoring Purple Ray device. During the first half of the 20th century, a number of companies manufactured and sold the machines, which became ubiquitous for a time. And yet the scientific basis for the healing effects of violet rays was scant. So what accounted for their popularity?\n</p><hr/><h2>The cutting-edge tech of the violet ray machine</h2><p>\n\tViolet ray machines employ a Tesla coil, also known as a resonance transformer, to produce a high-frequency, low-current beam, which is then applied to the skin. Nikola Tesla kicked off this line of invention after traveling to Paris during the summer of 1889 to attend the \n\t<a href=\"https://en.wikipedia.org/wiki/Exposition_Universelle_(1889)\" rel=\"noopener noreferrer\" target=\"_blank\">Exposition Universelle</a>. There he learned of Heinrich Hertz’s electromagnetic discoveries. Intrigued, Tesla returned to New York City to run some experiments of his own. The result was the Tesla coil, which he envisioned being used for wireless lighting and power. In April 1891, he applied for a <a href=\"https://patents.google.com/patent/US454622A/en?oq=454622\" rel=\"noopener noreferrer\" target=\"_blank\">U.S. patent</a> for a “System of Electric Lighting,” which he received two months later. It would be the first in a series of related patents that spanned more than a decade.\n</p><p>\n\tIn May of that year, Tesla unveiled his wondrous invention to members of the American Institute of Electrical Engineers, during a \n\t<a href=\"https://books.google.com/books?id=7YPbAAAAMAAJ&pg=PA145#v=onepage&q&f=false\" rel=\"noopener noreferrer\" target=\"_blank\">lecture</a> on his “Experiments with Alternate Currents of Very High Frequency and Their Application to Methods of Artificial Illumination.” He continued to test different circuit configurations and patented some (but not all) of his improvements, such as a “Means for Generating Electric Currents,” <a href=\"https://patents.google.com/patent/US514168A/en\" rel=\"noopener noreferrer\" target=\"_blank\">U.S. Patent No. 514,168</a>. After more years of tinkering, Tesla perfected his resonance transformer and was granted <a href=\"https://patents.google.com/patent/US1119732A/en?oq=1119732\" rel=\"noopener noreferrer\" target=\"_blank\">U.S. Patent No. 1,119,732</a> for an “Apparatus for Transmitting Electrical Energy” on 1 December 1914.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"An old black and white photo showing a man sitting next to a large electrical apparatus that is emitting sparks.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"a3cb2a38509dbe855371a23276cb8951\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"09a11\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/an-old-black-and-white-photo-showing-a-man-sitting-next-to-a-large-electrical-apparatus-that-is-emitting-sparks.jpg?id=31822607&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Nikola Tesla envisioned his eponymous coil being used for wireless lighting and power. It was also at the heart of the violet ray machine. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Stocktrek Images/Getty Images</small>\n</p><p>\n\tTesla promoted the \n\t<a href=\"https://ieeexplore.ieee.org/document/771079\" target=\"_blank\">medical use</a> of the electromagnetic spectrum, suggesting to physicians that different voltages and currents could be used to treat a variety of conditions. His endorsement came at a time when trained doctors as well as shrewd hucksters were already experimenting with <a href=\"https://spectrum.ieee.org/this-1850s-medical-device-was-said-to-cure-toothache-gangrene-and-ennui\" target=\"_self\">electrotherapy</a> and <a href=\"https://spectrum.ieee.org/weve-been-killing-deadly-germs-with-uv-light-for-more-than-a-century\" target=\"_self\">ultraviolet light</a> to help patients or to make a buck, depending on your perspective.<br/>\n</p><p>\n\tThe market was perfectly primed for the violet ray machine, in other words. Tesla himself never commercialized a medical device based around his coil, but others did. The French physician and electrophysiologist \n\t<a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=7828069\" target=\"_blank\">Jacques-Arsène d’Arsonval</a> modified Tesla’s design to make the device safer for human use. It was further improved by another French doctor and electrotherapy researcher, <a href=\"https://en.wikipedia.org/wiki/Paul_Oudin\" rel=\"noopener noreferrer\" target=\"_blank\">Paul Marie Oudin</a>. In 1893, Oudin crafted the first working prototype of what eventually became the violet ray machine. Four years later, Frederick Strong developed an American version.\n</p><p class=\"pull-quote\">\n\tAn influential clairvoyant named Edgar Cayce popularized violet ray machines for treating just about every kind of ailment—rheumatism and nervous conditions, acne and baldness, gonorrhea and prostate troubles, brain fog and writer’s cramp.\n</p><p>\n\tAnother charismatic individual gets credit for popularizing the device: the psychic \n\t<a href=\"https://psi-encyclopedia.spr.ac.uk/articles/edgar-cayce\" target=\"_blank\">Edgar Cayce</a>. As a young adult, Cayce reportedly lost his voice for over a year. No doctor could cure him, and in desperation he underwent hypnosis. He not only regained the ability to speak, he also began suggesting medical advice and homeopathic remedies. Cayce, who claimed to have had visions from childhood, became a professional clairvoyant, and for the next 40 years he dispensed his wisdom through <a href=\"https://www.edgarcayce.org/edgar-cayce/his-life/\" target=\"_blank\">psychic readings</a>. Out of more than 14,000 recorded readings, Cayce mentioned the violet ray machine almost 900 times. In case you doubt his status as an influencer, Cayce counted Thomas Edison, composer George Gershwin, and U.S. president Woodrow Wilson among his clients.<br/>\n</p><h2>Was there nothing the violet ray machine couldn’t cure?</h2><h3></h3><br/><p>The popularity of violet ray machines exploded after 1915, once all of the components for a portable device could be easily manufactured. They could be plugged into a lamp or wall socket or wired to a battery—remember that most homes and businesses in the early 20th century were not yet electrified, and so most manufacturers offered both alternating and direct current options. The machine’s handheld wand consisted of a Tesla coil wrapped in an insulating material, such as Bakelite. The coil produced 1 to 2 kilovolts, which charged a condenser, and then discharged at a rate between 4 to 10 kilohertz when passed over the skin. A voltage selector controlled the intensity of the spark, creating anything from a mild sensation to something quite intense. This video shows the sparks coming from an antique machine:</p><h3></h3><br/><span class=\"rm-shortcode\" data-rm-shortcode-id=\"9218b56f53f61d6c0c01b85cd8d96085\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/5c8mrnW2evI?rel=0&start=535\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span><h3></h3><br/><div class=\"rblad-ieee_in_content\"></div><p>Glass electrodes—partially evacuated glass tubes known as Geissler tubes—could be inserted into the wand. These came in different shapes depending on their intended use. For example, a rake-shaped attachment worked to massage the scalp, while a narrow tube could be inserted into the mouth, nose, or another orifice. The high voltage ionized the gas within the glass tube, creating the purple glow that gave the device its name.<br/></p><p>\n\tNumerous manufacturers sprang up to produce the portable machines, including Detroit’s \n\t<a href=\"https://americanhistory.si.edu/collections/search/object/nmah_736741\" rel=\"noopener noreferrer\" target=\"_blank\">Renulife Electric Co</a>. Founded by inventor James Henry Eastman in 1917, Renulife sold different models for different uses. According to <a href=\"https://www.sindecusemuseum.org/blog/violet-ray\" rel=\"noopener noreferrer\" target=\"_blank\">company literature</a>, Model M was its most popular general-purpose product, while Model D was for dentistry, and the tricked-out Model R [pictured at top] had finer regulation of current and a built-in ozone generator to help with head and lung congestion.\n</p><p class=\"pull-quote\">\n\tIn 1917, editors at the \n\t<i>Journal of the American Medical Association</i> reported that a violet ray generator certainly couldn’t treat “practically every ailment known to mankind,” as one manufacturer had claimed.\n</p><p>\n<a href=\"https://medicalhistory.uwo.ca/teaching_modules/eletrotherapy/Branston_Violet_Ray_Directions.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Instructions</a> for the violet ray machines manufactured by Charles A. Branston Ltd. contain an alphabetical list of disorders that could be treated, from abscess to writer’s cramp, with dozens of other ailments in between. Like the Renulife products, the Branston machines also came in <a href=\"https://www.cppdigitallibrary.org/items/show/4433\" rel=\"noopener noreferrer\" target=\"_blank\">different flavors</a>. The Branston machine’s high-frequency mode had germicidal effects and purportedly could be used to cure infections as well as relieve pain. Sinusoidal mode was used to gently massage away nervousness and paralysis. Ozone mode was for inhaling, to treat lung disorders. The Branston devices ranged in price from US $30 for the Model 5B (high-frequency mode only) to $100 for the Model 29 (which had all three modes).\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A page from a pamphlet showing the potential uses of an electrotherapeutic machine. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"ef56a9a7f67c1f587c7f8591eaa6db2b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9c209\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-page-from-a-pamphlet-showing-the-potential-uses-of-an-electrotherapeutic-machine.jpg?id=31822651&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The violet ray machines made by Charles A. Branston Ltd. had different modes for treating a wide variety of ailments.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Historical Medical Library/College of Physicians of Philadelphia</small>\n</p><p>\n\tDuring the first half of the 20th century, manufacturers marketed the machines to doctors and consumers alike. By the time Wonder Woman debuted in her own comic book in June 1942, the violet ray machine was a well-known household technology. So it wasn’t too surprising that the superhero had a machine of her own.\n</p><p>\n\tIn the very first issue, Wonder Woman’s future love interest, Steve Trevor, is grievously injured in a plane crash. Seeking to cure his wounds, Diana works tirelessly for five days to complete her Purple Ray machine—but she’s too late. Trevor has died. Undeterred, Diana bathes her patient in the glowing light of the machine. The result might have embarrassed even the admen who wrote the promotional copy for Branston’s products: Wonder Woman’s Purple Ray \n\t<a href=\"https://wonder-woman.fandom.com/wiki/Purple_Ray?file=Purple_Ray_WWv1-01.png\" rel=\"noopener noreferrer\" target=\"_blank\">brings Trevor back to life</a>.\n</p><h2>Science frowns on the violet ray machine </h2><p>\n\tDespite their popularity, the machines didn’t fare quite as well within the medical establishment. In 1917, editors at the \n\t<em>Journal of the American Medical Association</em> reported that a violet ray generator certainly couldn’t treat “practically every ailment known to mankind,” as one manufacturer had claimed. Although the devices emitted a violet color, they were not in fact emitting ultraviolet light, or at least not in amounts that would be beneficial. In 1951, a Maryland district court ruled against a company named Master Appliances in a libel suit. The charge was misbranding, and the court found that the device was not an effective treatment nor capable of producing the claimed results. At the time, Master Appliances was one of the last manufacturers of violet ray machines in the United States, and the ruling effectively ended production in this country.\n</p><p>\n\tAnd yet you can still buy violet ray machines today—both the antique variety and its \n\t<a href=\"https://laserskinsolutions.com.au/skin-problems/what-is-high-frequency-and-why-do-we-use-it/\" rel=\"noopener noreferrer\" target=\"_blank\">modern equivalent</a>. Today’s units are mainly marketed to aestheticians or sold for home use, and some dermatologists are not ready to categorically dismiss their benefits. Although they probably won’t cure indigestion or gray hair, the high frequency can dry out the skin and ozone does kill bacteria, so the machines may help treat acne and other skin conditions. Plus, there’s the placebo effect. As with all consumer electronics for which outrageous claims are made, let the buyer beware.\n</p><p>\n<em>Part of a </em><a href=\"https://spectrum.ieee.org/collections/past-forward/\" target=\"_self\"><em>continuing series</em></a> <em>looking at photographs of historical artifacts that embrace the boundless potential of technology.</em>\n</p><p>\n<em>An abridged version of this article appears in the October 2022 print issue.</em>\n</p>",
  "pubDate": "Fri, 30 Sep 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/violet-ray",
  "category": [
    "Past forward",
    "History of medical devices",
    "Type:departments",
    "Violet ray machine",
    "Tesla coils"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}