{
  "title": "Phy-Taylor: Physics-Model-Based Deep Neural Networks. (arXiv:2209.13511v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2209.13511",
  "description": "<p>Purely data-driven deep neural networks (DNNs) applied to physical\nengineering systems can infer relations that violate physics laws, thus leading\nto unexpected consequences. To address this challenge, we propose a\nphysics-model-based DNN framework, called Phy-Taylor, that accelerates learning\ncompliant representations with physical knowledge. The Phy-Taylor framework\nmakes two key contributions; it introduces a new architectural\nPhysics-compatible neural network (PhN), and features a novel compliance\nmechanism, we call {\\em Physics-guided Neural Network Editing\\}. The PhN aims\nto directly capture nonlinearities inspired by physical quantities, such as\nkinetic energy, potential energy, electrical power, and aerodynamic drag force.\nTo do so, the PhN augments neural network layers with two key components: (i)\nmonomials of Taylor series expansion of nonlinear functions capturing physical\nknowledge, and (ii) a suppressor for mitigating the influence of noise. The\nneural-network editing mechanism further modifies network links and activation\nfunctions consistently with physical knowledge. As an extension, we also\npropose a self-correcting Phy-Taylor framework that introduces two additional\ncapabilities: (i) physics-model-based safety relationship learning, and (ii)\nautomatic output correction when violations of safety occur. Through\nexperiments, we show that (by expressing hard-to-learn nonlinearities directly\nand by constraining dependencies) Phy-Taylor features considerably fewer\nparameters, and a remarkably accelerated training process, while offering\nenhanced model robustness and accuracy.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Mao_Y/0/1/0/all/0/1\">Yanbing Mao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sha_L/0/1/0/all/0/1\">Lui Sha</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shao_H/0/1/0/all/0/1\">Huajie Shao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gu_Y/0/1/0/all/0/1\">Yuliang Gu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Q/0/1/0/all/0/1\">Qixin Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Abdelzaher_T/0/1/0/all/0/1\">Tarek Abdelzaher</a>"
}