{
  "title": "Losses Can Be Blessings: Routing Self-Supervised Speech Representations Towards Efficient Multilingual and Multitask Speech Processing. (arXiv:2211.01522v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01522",
  "description": "<p>Self-supervised learning (SSL) for rich speech representations has achieved\nempirical success in low-resource Automatic Speech Recognition (ASR) and other\nspeech processing tasks, which can mitigate the necessity of a large amount of\ntranscribed speech and thus has driven a growing demand for on-device ASR and\nother speech processing. However, advanced speech SSL models have become\nincreasingly large, which contradicts the limited on-device resources. This gap\ncould be more severe in multilingual/multitask scenarios requiring\nsimultaneously recognizing multiple languages or executing multiple speech\nprocessing tasks. Additionally, strongly overparameterized speech SSL models\ntend to suffer from overfitting when being finetuned on low-resource speech\ncorpus. This work aims to enhance the practical usage of speech SSL models\ntowards a win-win in both enhanced efficiency and alleviated overfitting via\nour proposed S$^3$-Router framework, which for the first time discovers that\nsimply discarding no more than 10\\% of model weights via only finetuning model\nconnections of speech SSL models can achieve better accuracy over standard\nweight finetuning on downstream speech processing tasks. More importantly,\nS$^3$-Router can serve as an all-in-one technique to enable (1) a new\nfinetuning scheme, (2) an efficient multilingual/multitask solution, (3) a\nstate-of-the-art ASR pruning technique, and (4) a new tool to quantitatively\nanalyze the learned speech representation. We believe S$^3$-Router has provided\na new perspective for practical deployment of speech SSL models. Our codes are\navailable at: https://github.com/GATECH-EIC/S3-Router.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Fu_Y/0/1/0/all/0/1\">Yonggan Fu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Y/0/1/0/all/0/1\">Yang Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qian_K/0/1/0/all/0/1\">Kaizhi Qian</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ye_Z/0/1/0/all/0/1\">Zhifan Ye</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yu_Z/0/1/0/all/0/1\">Zhongzhi Yu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lai_C/0/1/0/all/0/1\">Cheng-I Lai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lin_Y/0/1/0/all/0/1\">Yingyan Lin</a>"
}