{
  "title": "Inside the Universe Machine: The Webb Space Telescope’s Staggering Vision",
  "link": "https://spectrum.ieee.org/james-webb-telescope-optics",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/fourteen-technicians-in-clean-room-suits-guide-the-hoisting-of-a-honeycombed-hexagon-mirrored-telescope-inside-a-giant-cleanroo.jpg?id=30063324&width=1500&height=2000&coordinates=1496%2C0%2C184%2C0\"/><br/><br/><p class=\"ieee-editors-note\">\n<em>For a deep dive into the engineering behind the James Webb Space Telescope, <a href=\"https://spectrum.ieee.org/collections/james-webb-telescope/\" rel=\"noopener noreferrer\" target=\"_blank\">see our collection of posts here</a>.</em>\n</p><p>\n<strong>“Build something</strong> that will absolutely, positively work.” This was the mandate from NASA for designing and building the James Webb Space Telescope—at 6.5 meters wide the largest space telescope in history. Last December, <a href=\"https://www.youtube.com/watch?v=7nT7JGZMbtM\" target=\"_blank\">JWST launched famously and successfully</a> to its observing station <a href=\"https://www.nasa.gov/topics/universe/features/webb-l2.html\" target=\"_blank\">out beyond the moon</a>. And now according to NASA, as soon as next week, the JWST will at long last<a rel=\"noopener noreferrer\" target=\"_blank\"> begin</a><a href=\"https://www.nasa.gov/feature/goddard/2022/first-images-from-nasa-s-webb-space-telescope-coming-soon\" rel=\"noopener noreferrer\" target=\"_blank\"> releasing</a> scientific images and data.\n</p><p>\n\tMark Kahan, on JWST’s product integrity team, recalls NASA’s engineering challenge as a call to arms for a worldwide team of thousands that set out to create one of the most ambitious scientific instruments in human history. Kahan—chief electro-optical systems engineer at Mountain View, Calif.–based Synopsys—and many others in JWST’s “pit crew” (as he calls the team) drew hard lessons from three decades ago, having helped repair another world-class space telescope with a debilitating case of flawed optics. Of course the Hubble Space Telescope is in low Earth orbit, and so a special space-shuttle mission to install corrective optics (\n\t<a href=\"https://en.wikipedia.org/wiki/STS-61\" rel=\"noopener noreferrer\" target=\"_blank\">as happened in 1993</a>) was entirely possible.\n</p><p>\n\tNot so with the JWST.\n</p><p>\n\tThe meticulous care NASA demanded of JWST’s designers is all the more a necessity because Webb is well out of reach of repair crews. Its mission is to study the infrared universe, and that requires shielding the telescope and its sensors from both the heat of sunlight and the infrared glow of Earth. A good place to do that without getting too far from Earth is an empty patch of interplanetary space 1.5 million kilometers away (well beyond the moon’s orbit) near a spot physicists call the \n\t<a href=\"https://www.nasa.gov/topics/universe/features/webb-l2.html\" rel=\"noopener noreferrer\" target=\"_blank\">second Lagrange point, or L2</a>.\n</p><p>\n\tThe pit crew’s job was “down at the detail level, error checking every critical aspect of the optical design,” says Kahan. Having learned the hard way from Hubble, the crew insisted that every measurement on Webb’s optics be made in at least two different ways that could be checked and cross-checked. Diagnostics were built into the process, Kahan says, so that “you could look at them to see what to kick” to resolve any discrepancies. Their work had to be done on the ground, but their tests had to assess how the telescope would work in deep space at cryogenic temperatures.\n</p><h2>\nThree New Technologies for the Main Mirror\n</h2><p>\n\tSuperficially, Webb follows the design of all large reflecting telescopes. A big mirror collects light from stars, galaxies, nebulae, planets, comets, and other astronomical objects—and then focuses those photons onto a smaller secondary mirror that sends it to a third mirror that then ultimately directs the light to instruments that record images and spectra.\n</p><p>\n\tWebb’s \n\t<a href=\"https://www.jwst.nasa.gov/content/about/faqs/faq.html#mirrortests\" rel=\"noopener noreferrer\" target=\"_blank\">6.5-meter primary mirror</a> is the first segmented mirror to be launched into space. All the optics had to be made on the ground at room temperature but were deployed in space and operated at 30 to 55 degrees above absolute zero. “We had to develop three new technologies” to make it work, says <a href=\"https://webb.nasa.gov/content/meetTheTeam/people/feinberg.html\" rel=\"noopener noreferrer\" target=\"_blank\">Lee D. Feinberg</a> of the NASA Goddard Space Flight Center, the optical telescope element manager for Webb for the past 20 years.\n</p><p>\n\tThe longest wavelengths that Hubble has to contend with were 2.5 micrometers, whereas \n\t<a href=\"https://www.jwst.nasa.gov/content/about/comparisonWebbVsHubble.html\" rel=\"noopener noreferrer\" target=\"_blank\">Webb is built to observe</a> infrared light that stretches to 28 μm in wavelength. <a href=\"https://svs.gsfc.nasa.gov/13521\" rel=\"noopener noreferrer\" target=\"_blank\">Compared with Hubble</a>, whose primary mirror is a circle of an area 4.5 square meters, “[Webb’s primary mirror] had to be 25 square meters,” says Feinberg. Webb also “needed segmented mirrors that were lightweight, and its mass was a huge consideration,” he adds. No single-component mirror that could provide the required resolution would have fit on the Ariane 5 rocket that launched JWST. That meant the mirror would have to be made in pieces, assembled, folded, secured to withstand the stress of launch, then unfolded and deployed in space to create a surface that was within tens of nanometers of the shape specified by the designers.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Images of the James Webb Space Telescope and Hubble Space Telescope to scale, compared to a human figure, who is dwarfed by their size\" class=\"rm-shortcode\" data-rm-shortcode-id=\"44f8217f64a3054f4d29e41a965301a3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b2811\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/images-of-the-james-webb-space-telescope-and-hubble-space-telescope-to-scale-compared-to-a-human-figure-who-is-dwarfed-by-thei.jpg?id=30063396&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The James Webb Space Telescope [left] and the Hubble Space Telescope side by side—with Hubble’s 2.4-meter-diameter mirror versus Webb’s array of hexagonal mirrors making a 6.5-meter-diameter light-collecting area. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA Goddard Space Flight Center</small>\n</p><p>\n\tNASA and the \n\t<a href=\"https://www.af.mil/News/Article-Display/Article/138691/lab-reflects-mirror-technology/\" target=\"_blank\">U.S. Air Force, which has its own interests in large lightweight space mirrors for surveillance and focusing laser energy</a>, teamed up to develop the technology. The two agencies narrowed eight submitted proposals down to two approaches for building JWST’s mirrors: one based on low-expansion glass made of <a href=\"https://www.corning.com/worldwide/en/products/advanced-optics/product-materials/semiconductor-laser-optic-components/ultra-low-expansion-glass.html\" rel=\"noopener noreferrer\" target=\"_blank\">a mixture of silicon and titanium dioxides</a> similar to that used in Hubble and the other the light but highly toxic metal beryllium. The most crucial issue came down to how well the materials could withstand temperature changes from room temperature on the ground to around 50 K in space. Beryllium won because it could fully release stress after cooling without changing its shape, and it’s not vulnerable to the cracking that can occur in glass. The final beryllium mirror was a 6.5-meter array of 18 hexagonal beryllium mirrors, each weighing about 20 kilograms. The weight per unit area of JWST’s mirror was only <a href=\"https://jwst.nasa.gov/content/observatory/ote/mirrors/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">10 percent of that in Hubble</a>. A 100-nanometer layer of pure gold makes the surface reflect 98 percent of incident light from JWST’s main observing band of 0.6 to 28.5 μm. “Pure silver has slightly higher reflectivity than pure gold, but gold is more robust,” says Feinberg. A thin layer of amorphous silica protects the metal film from surface damage.\n</p><p>\n\tIn addition, a wavefront-sensing control system keeps mirror segment surfaces \n\t<a href=\"https://jwst-docs.stsci.edu/jwst-observatory-hardware/jwst-wavefront-sensing-and-control\" rel=\"noopener noreferrer\" target=\"_blank\">aligned to within tens of nanometers</a>. Built on the ground, the system is expected to keep mirror alignment stabilized throughout the telescope’s operational life. A <a href=\"https://webb.nasa.gov/content/observatory/ote/backplane.html\" rel=\"noopener noreferrer\" target=\"_blank\">backplane</a> kept at a temperature of 35 K holds all 2.4 tonnes of the telescope and instruments rock-steady to within 32 nm while maintaining them at cryogenic temperatures during observations.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Metal superstructure of cages and supports stands on a giant platform in a warehouse-sized clean-room. A man in a cleanroom suit watches the operations.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"5f2636ec033ff78b389bd71d5c19a931\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"05945\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/metal-superstructure-of-cages-and-supports-stands-on-a-giant-platform-in-a-warehouse-sized-clean-room-a-man-in-a-cleanroom-suit.jpg?id=30063381&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The JWST backplane, the “spine” that supports the entire hexagonal mirror structure and carries more than 2,400 kg of hardware, is readied for assembly to the rest of the telescope. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA/Chris Gunn</small>\n</p><p>\n\tHubble’s amazing, long-exposure images of distant galaxies are possible through the use of gyroscopes and reaction wheels. The gyroscopes are used to sense unwanted rotations, and reaction wheels are used to counteract them.\n</p><p>\n\tBut the gyroscopes used on Hubble have had a bad track record and have had to be replaced repeatedly. Only three of Hubble’s six gyros remain operational today, and NASA has devised plans for operating with one or two gyros at reduced capability. \n\t<a href=\"https://www.nasa.gov/content/goddard/hubble-space-telescope-pointing-control-system\" target=\"_blank\">Hubble also includes reaction wheels and magnetic torquers</a>, used to maintain its orientation when needed or to point at different parts of the sky.<br/>\n</p><p>\n\tWebb uses reaction wheels similarly to turn across the sky, but instead of using mechanical gyros to sense direction, \n\t<a href=\"https://jwst.nasa.gov/content/forScientists/faqScientists.html#gyros\" target=\"_blank\">it uses hemispherical resonator gyroscopes</a>, which have no moving parts. Webb also has a small fine-steering mirror in the optical path, which can tilt over an angle of just 5 arc seconds. Those very fine adjustments of the light path into the instruments keep the telescope on target. “It’s a really wonderful way to go,” says Feinberg, adding that it compensates for small amounts of jitter without having to move the whole 6-tonne observatory.\n</p><h2>\nInstruments\n</h2><p>\n\tOther optics distribute light from the fine-steering mirror among four instruments, two of which can observe simultaneously. Three instruments have sensors that observe wavelengths of 0.6 to 5 μm, which astronomers call the near-infrared. The fourth, called the Mid-InfraRed Instrument (MIRI), observes what astronomers call the mid-infrared spectrum, from 5 to 28.5 μm. Different instruments are needed because sensors and optics have limited wavelength ranges. (Optical engineers may blanch slightly at astronomers’ definitions of what constitutes the near- and mid-infrared wavelength ranges. These two groups simply have differing conventions for labeling the various regimes of the infrared spectrum.)\n</p><p>\n\tMid-infrared wavelengths are crucial for observing \n\t<a href=\"https://blogs.nasa.gov/webb/2022/04/07/webbs-cool-view-on-how-stars-planets-form/\" target=\"_blank\">young stars and planetary systems</a> and <a href=\"https://asd.gsfc.nasa.gov/blueshift/index.php/2013/09/12/maggies-blog-why-infrared-earliest-galaxies-edition/\" rel=\"noopener noreferrer\" target=\"_blank\">the earliest galaxies</a>, but they also pose some of the biggest engineering challenges. Namely, everything on Earth and planets out to Jupiter glow in the mid-infrared. So for JWST to observe distant astronomical objects, it must avoid recording extraneous mid-infrared noise from all the various sources inside the solar system. “I have spent my whole career building instruments for wavelengths of 5 μm and longer,” says MIRI instrument scientist Alistair Glasse of the <a href=\"https://www.roe.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">Royal Observatory, in Edinburgh</a>. “We’re always struggling against thermal background.”\n</p><p>\n\tMountaintop telescopes can see the near-infrared, but observing the mid-infrared sky requires telescopes in space. However, the thermal radiation from Earth and its atmosphere can cloud their view, and so can the telescopes themselves unless they are cooled far below room temperature. An ample supply of liquid helium and an orbit far from Earth allowed the \n\t<a href=\"https://www.spitzer.caltech.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Spitzer Space Telescope</a>’s <a href=\"https://en.wikipedia.org/wiki/Spitzer_Space_Telescope\" rel=\"noopener noreferrer\" target=\"_blank\">primary observing mission to last</a> for five years, but once the last of the cryogenic fluid evaporated in 2009, its observations were limited to wavelengths shorter than 5 μm.\n</p><p>\n\tWebb has an elaborate solar shield to block sunlight, and an orbit 1.5 million km from Earth that can keep the telescope to below 55 K, but that’s not good enough for low-noise observations at wavelengths longer than 5 μm. The near-infrared instruments operate at 40 K to minimize thermal noise. \n\t<a href=\"https://jwst.nasa.gov/content/about/innovations/cryocooler.html\" rel=\"noopener noreferrer\" target=\"_blank\">But for observations out to 28.5 μm, MIRI uses a specially developed closed-cycle, helium cryocooler to keep MIRI cooled below 7 K.</a> “We want to have sensitivity limited by the <a href=\"https://en.wikipedia.org/wiki/Shot_noise\" rel=\"noopener noreferrer\" target=\"_blank\">shot noise</a> of astronomical sources,” says Glasse. (<a href=\"https://en.wikipedia.org/wiki/Shot_noise\" rel=\"noopener noreferrer\" target=\"_blank\">Shot noise occurs when optical or electrical signals are so feeble that each photon or electron constitutes a detectable peak.</a>) That will make MIRI 1,000 times as sensitive in the mid-infrared as Spitzer.\n</p><p>\n\tAnother challenge is the limited transparency of optical materials in the mid-infrared. “We use reflective optics wherever possible,” says Glasse, but they also pose problems, he adds. “Thermal contraction is a big deal,” he says, because the instrument was made at room temperature but is used at 7 K. To keep thermal changes uniform throughout MIRI, they made the whole structure of gold-coated aluminum lest other metals cause warping.\n</p><p>\n\tDetectors are another problem. Webb’s near-infrared sensors use mercury cadmium telluride photodetectors with a resolution of 2,048 x 2,048 pixels. This resolution is widely used at wavelengths below 5 μm, but sensing at\n\t<a href=\"https://jwst.nasa.gov/content/about/innovations/infrared.html\" rel=\"noopener noreferrer\" target=\"_blank\"> MIRI’s longer wavelengths required</a> exotic detectors that are limited to offering only 1,024 x 1,024 pixels.\n</p><p>\n\tGlasse says commissioning “has gone incredibly well.” Although some stray light has been detected, he says, “we are fully expecting to meet all our science goals.”\n</p><h2>\nNIRCam Aligns the Whole Telescope\n</h2><p>\n\tThe near-infrared detectors and optical materials used for observing at wavelengths shorter than 5 μm are much more mature than those for the mid-infrared, so the Near-Infrared Camera (NIRCam) does double duty by both recording images and aligning all the optics in the whole telescope. That alignment was the trickiest part of building the instrument, says NIRCam principal investigator \n\t<a href=\"https://www.as.arizona.edu/people/faculty/marcia-j-rieke\" target=\"_blank\">Marcia Rieke</a> of the University of Arizona.\n</p><p>\n\tAlignment means getting all the light collected by the primary mirror to get to the right place in the final image. That’s crucial for Webb, because it has 18 separate segments that have to overlay their images perfectly in the final image, and because all those segments were built on the ground at room temperature but operate at cryogenic temperatures in space at zero gravity. When NASA recorded a test image of a single star after Webb first opened its primary mirror, it showed 18 separate bright spots, one from each segment. \n\t<a href=\"https://www.nasa.gov/press-release/nasa-s-webb-reaches-alignment-milestone-optics-working-successfully\" rel=\"noopener noreferrer\" target=\"_blank\">When alignment was completed on 11 March, the image from NIRcam showed a single star with six spikes caused by diffraction.</a>\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Image of a star with six-pointed spikes caused by diffraction \" class=\"rm-shortcode\" data-rm-shortcode-id=\"900666e39577b81498f3fcd90499ee8b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"09ba9\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image-of-a-star-with-six-pointed-spikes-caused-by-diffraction.jpg?id=30063386&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Even when performing instrumental calibration tasks, JWST couldn’t help but showcase its stunning sensitivity to the infrared sky. The central star is what telescope technicians used to align JWST’s mirrors. But notice the distant galaxies and stars that photobombed the image too!</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA/STScI</small>\n</p><p>\n\tBuilding a separate alignment system would have added to both the weight and cost of Webb, Rieke realized, and in the original 1995 plan for the telescope she proposed designing NIRCam so it could align the telescope optics once it was up in space as well as record images. “The only real compromise was that it required NIRCam to have exquisite image quality,” says Rieke, wryly. From a scientific point, she adds, using the instrument to align the telescope optics “is great because you know you’re going to have good image quality and it’s going to be aligned with you.” Alignment might be just a tiny bit off for other instruments. In the end, it took a team at Lockheed Martin to develop the computational tools to account for all the elements of thermal expansion.\n</p><p>\n\tEscalating costs and delays had troubled Webb for years. But for Feinberg, “commissioning has been a magical five months.” It began with the sight of sunlight hitting the mirrors. The segmented mirror deployed smoothly, and after the near-infrared cameras cooled, the mirrors focused one star into 18 spots, then aligned them to put the spots on top of each other. “Everything had to work to get it to [focus] that well,” he says. It’s been an intense time, but for Feinberg, a veteran of the Hubble repair mission, commissioning Webb was “a piece of cake.”\n</p><p>\n<a href=\"https://www.scientificamerican.com/article/webb-telescopes-giant-mirror-struck-by-micrometeoroid/\" target=\"_blank\">NASA announced that between May 23rd and 25th, one segment of the primary mirror had been dinged by a micrometeorite bigger than the agency had expected</a> when it analyzed the potential results of such impacts. “Things do degrade over time,” Feinberg said. But he added that Webb had been engineered to minimize damage, and <a href=\"https://blogs.nasa.gov/webb/2022/06/08/webb-engineered-to-endure-micrometeoroid-impacts/\" target=\"_blank\">NASA said the event had not affected Webb’s operation schedule.</a>\n</p><p>\n<strong></strong><em> <strong>Corrections 26-28 July 2022: </strong>The story was updated </em><em>a) to reflect the fact that the Lagrange point L2 where Webb now orbits is not that of the \"Earth-moon system\" (as the story had originally reported) <em>but rather the Earth-sun system </em><br/>\n\tand b) to correct misstatements in the original posting about Webb's hardware for controlling its orientation.\n\t</em>\n</p><p>\n<em><strong>Corrections 12 Aug. 2022: </strong>Alistair Glasse's name was incorrectly spelled in a previous version of this story, as was NIRCam (which we'd spelled as NIRcam); Webb's tertiary mirror (we'd originally reported only its primary and secondary mirrors) was also called out in this version. <br/>\n</em>\n</p><p>\n<em>This article appears in the September 2022 print issue as “Inside the Universe Machine.”</em>\n</p>",
  "pubDate": "Wed, 06 Jul 2022 13:00:00 +0000",
  "guid": "https://spectrum.ieee.org/james-webb-telescope-optics",
  "category": [
    "James webb space telescope",
    "Aerospace",
    "Mirror",
    "Nasa",
    "Optics",
    "Space telescopes",
    "Type:cover"
  ],
  "dc:creator": "Jeff Hecht",
  "media:content": ""
}