{
  "title": "How the US government attempts to control public perception of its aid to Ukraine",
  "link": "https://www.rt.com/news/565798-new-yorker-biden-us-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565798-new-yorker-biden-us-ukraine/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362549a2030276233161577.jpg\" /> The New Yorker’s expose on the US aid to Ukraine is an effort by the Biden administration to shape public perception ahead of the midterms <br/><a href=\"https://www.rt.com/news/565798-new-yorker-biden-us-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A recent media expose on the US effort to arm Ukraine looks as if it’s been curated by the Biden administration to shape public perception</strong></p>\n            \n                        \n            <p>NBC News has <a href=\"https://www.cnbc.com/2022/10/31/biden-lost-temper-with-zelenskyy-in-june-phone-call-when-ukrainian-leader-asked-for-more-aid.html?&qsearchterm=biden\" target=\"_blank\" rel=\"noopener noreferrer\">reported that</a>, according to four people familiar with the incident, a phone call between US President Joe Biden and his Ukrainian counterpart, Vladimir Zelensky, turned testy after the Ukrainian leader pressed Biden for more assistance.</p>\n<p>On June 15, Biden called Zelensky to inform him of the recent release of some $1 billion in assistance (<a href=\"https://www.state.gov/1-billion-of-new-u-s-military-assistance-for-ukraine/\" target=\"_blank\" rel=\"noopener noreferrer\">this included</a> the drawdown of arms and equipment from US Department of Defense inventories valued at $350 million, and $650 million in additional assistance under the department&rsquo;s Ukraine Security Assistance Initiative). This type of person-to-person communication had become commonplace since Russia&rsquo;s decision to&nbsp;send troops into Ukraine in February 2022, with Biden informing Zelensky of each major assistance allocation in a program that had, as of June 15, seen the dispatch of some $5.6 billion in American military aid.</p>\n<p>This time, however, rather than thank the US president, as had been the previous practice, Zelensky proceeded to ask for more assistance, citing specific requests for equipment that had not been included in the June allocation of aid. At this point, NBC&rsquo;s sources say, Biden lost his temper. &ldquo;<em>The American people were being quite generous, and his administration and the US military were working hard to help Ukraine, he said, raising his voice, and Zelensky could show a little more gratitude,&rdquo;</em> the NBC story reports.</p>\n<p>According to NBC, the source of Biden&rsquo;s anger went beyond the lack of gratitude shown by Zelensky (NBC reports that the two leaders have since warmed to one another), but rather the growing realization on the part of the Biden White House that support for the blank check being written for Ukraine&rsquo;s war effort is waning among members of Congress on both sides of the aisle. With the Republicans expected to retake control of the House of Representatives and positioned to do the same in the Senate in the upcoming mid-term elections, the Biden administration appears poised to try to squeeze out another $40-60 billion in aid during the lame duck session between the election and when the present term of Congress expires next January. It is expected that this new aid package will be challenged by the Republicans, who will seek to have its consideration postponed until the new Republican-controlled Congress is sworn in.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63613b6285f54002e72ce922.jpg\" alt=\"FILE PHOTO: Members of the 82nd Airborne Division of the US Army prepare for deployment to Poland from Fort Bragg, North Carolina, February 14, 2022\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565747-us-troops-in-ukraine/\">US troops on the ground in Ukraine – media</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Shortly before NBC News broke the story of the contentious Biden-Zelensky phone call, The New Yorker ran a glowing review of the state of US-Ukrainian military cooperation. Entitled &lsquo;<a href=\"https://www.newyorker.com/magazine/2022/10/24/inside-the-us-effort-to-arm-ukraine\" target=\"_blank\" rel=\"noopener noreferrer\">Inside the US Effort to Arm Ukraine</a>, the piece, authored by Joshua Yaffa, a contributing writer for the magazine, provides an expansive and yet intimate look at the complex interaction between the US and Ukraine about not only the provision of military equipment, but also the active cooperation between US and Ukrainian military and intelligence officials concerning the actual conduct of the conflict, including the provision of targeting data in support of US-provided artillery systems such as the M777 howitzer and the HIMARS multiple rocket launch system.</p>\n<p>Its two main messages can be summarized as follows: first, American weapons are helping Ukraine stand up to Russia and showing the world Putin can be defeated, and second, the US is taking every care not to cross any lines that would escalate the conflict into a direct confrontation with Moscow.</p>\n<p>Yaffa is an accomplished writer on Russian affairs. His most recent book, &lsquo;Between Two Fires: Truth, Ambition, and Compromise in Putin&rsquo;s Russia&rsquo;, has won several prizes, and he has published numerous articles in The New Yorker about the Russia-Ukraine conflict. But even this extensive journalistic record doesn&rsquo;t prepare one for the scope and scale of the sources Yaffa was able to draw upon in writing his most recent article. It is a &lsquo;who&rsquo;s who&rsquo; of US and Ukrainian officialdom, both named and unnamed, all of whom are well positioned to provide Yaffa with the kind of inside information that makes his article so attractive, both from an informational aspect, and readability.</p>\n<p>On the Ukrainian side, Yaffa interviewed Aleksey Reznikov, Ukraine&rsquo;s defense minister; Mikhail Podoliak, a top adviser to Zelensky; Aleksey Danilov, Secretary of the Ukrainian National Security and Defense Council; and &ldquo;<em>a senior Ukrainian military official</em>&rdquo; close to the commander in chief of the military, Valery Zaluzhny. Ukrainian officials habitually interact with Western journalists as part of their effort to shape the narrative about the ongoing conflict with Russia. The surprise isn&rsquo;t that Yaffa was able to interview these individuals, but rather what they were willing to open up about &ndash; the hitherto obscure details of the sensitive cooperation between the US and Ukraine in the actual conduct of the conflict.</p>\n<p>The US is very controlling about the release of information about classified cooperation with other nations. This reticence to be transparent extends not only to the US officials involved, but also to the foreign nationals participating in the secret work. In short, there is no way the three Ukrainians would have agreed to sit down and talk to Yaffa about these issues unless their participation had been green-lighted by the Biden administration beforehand.</p>\n<p>The extent to which the Biden administration was behind the decision to cooperate with Yaffa on this story becomes clear upon closer examination of the anonymous sources drawn upon for the article. <em>&ldquo;A Biden administration official involved in Ukraine policy&rdquo;; &ldquo;a senior official at the Defense Department&rdquo;; &ldquo;a person familiar with Biden White House discussions of Ukraine&rdquo;; &ldquo;an administration official&rdquo;; &nbsp;&ldquo;a senior US official&rdquo;; &ldquo;a US military official&rdquo; </em>close to Chairman of the Joint Chiefs of Staff General Milley;<em> &ldquo;a senior Biden administration official&rdquo;;</em> and<em> &ldquo;a senior US intelligence official.&rdquo;</em></p>\n<p>Numerous other sources, both named and unnamed, were also interviewed by Yaffa.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6361278c20302778a51b4114.jpg\" alt=\"Russian Defense Minister Sergey Shoigu\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565740-russia-reservists-ukraine-mobilization/\">Moscow issues update on frontline reinforcements </a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Anyone with any experience with sensitive national security activities knows that there are two hard-fast truths when it comes to such activities &ndash; they are highly classified and compartmentalized, and any unauthorized release of information pertaining to such activities is a serious violation of the law, subject to prosecution and imprisonment for anyone caught leaking such information to the press.</p>\n<p>Accordingly, either every source cited by Yaffa had been simultaneously overcome with a Lemming-like desire to jump off a figurative cliff, risking losing their careers and&nbsp;going to prison in order to help the young New Yorker contributing writer pull off the scoop of a lifetime, or the Yaffa article was part and parcel of a Biden administration information operation designed to inject a positive narrative about US-Ukrainian military relations into the mainstream discussion on Ukraine in a concerted effort to shape public perception in the lead-up to the mid-term elections.</p>\n<p>My money is on the latter.</p>\n<p>Good journalism is all about &lsquo;bottom-up&rsquo; reporting, where a reporter conceives a story and then runs it to the ground by seeking out interviews with relevant sources. Stenography is about having a story spoon fed to you by sources for the purpose of serving an agenda that has nothing to do with the pursuit of fact-based truth, but rather&nbsp;shaping public opinion about a matter of importance.</p>\n<p>Yaffa&rsquo;s &lsquo;Inside the US Effort to Arm Ukraine&rsquo; is a clever piece of government-dictated stenography disguised as journalism and should be treated as such by all who read it.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 18:22:21 +0000",
  "dc:creator": "RT"
}