{
  "title": "#424: Sad Woodstock (HBP 30, The White Tomb)",
  "link": "https://audioboom.com/posts/7310325",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5241,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Fakes News! There is no Potter television series is in the works...for now...</li>\n<li>Puffs is coming to Chicago!</li>\n<li>MuggleCasTBT takes us back to the ultimate Cursed Child prediction!</li>\n<li>Chapter-by-Chapter concludes with Harry Potter and the Half-Blood Prince, Chapter 30 - The White Tomb</li>\n<li>Our final Half-Blood Prince 7-Word Summary: Harry feels really bad about breaking Dumbledore</li>\n<li>The Wizarding World pays tribute to Dumbledore</li>\n<li>Despite everything that has happened, why can't Ginny make amends with Fleur?</li>\n<li>Told ya so, Harry! Hermione's found out the truth about Eileen Prince!</li>\n<li>Harry likens Snape to Voldemort. Is this a fair comparison?</li>\n<li>How bad is Harry's guilt in having trusted the Half-Blood Prince all year long?</li>\n<li>Harry pities Malfoy - will this play into future Deathly Hallows scenes?</li>\n<li>Who is the man giving Dumbledore's eulogy?</li>\n<li>Why don't we get more context to Dumbledore's earlier years? Was this being saved for Deathly Hallows? Fantastic Beasts?</li>\n<li>WHY is Umbridge there? Are there others in attendance who are not mentioned we may have known?</li>\n<li>Is Dumbledore's body bursting into flames typical for wizard funerals or just Dumbledore?</li>\n<li>The honeymoon is over...Harry and Ginny break up!</li>\n<li>Despite Scrimgeour's insensitive timing, should Harry have tried to work with the Ministry?</li>\n<li>What would have happened if Harry came across Snape in his quest for the Horcruxes?</li>\n<li>Deathly Hallows teasers: Privet Drive, Bill & Fleur's Wedding and Godric's Hollow</li>\n<li>The hosts give their MVPs of the Week and Rename the Chapter</li>\n<li>Introducing our 2019 Patron Gift: The MuggleCast tote bag! Perfect for carrying Harry Potter books or jars of pickles around town. Pledge at the Dumbledore's Army level or above by July 31st to receive your own!</li>\n<li>Quizzitch: Which book ends with \"And together they walked back through the gateway to the Muggle world\"?</li>\n<li>We share some exciting news on what's ahead for MuggleCast!</li>\n</ul>\n",
  "pubDate": "Mon, 08 Jul 2019 15:16:14 +0000",
  "guid": "tag:audioboom.com,2019-07-08:/posts/7310325",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}