{
  "title": "Will the Unreal Engine 5 Realize the Metaverse’s Potential?",
  "link": "https://spectrum.ieee.org/unreal-engine-5-metaverse",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-female-avatar-is-repeated-endlessly-in-rows-in-the-front-of-one-area-is-the-same-avatar-positioned-slightly-differently-next.jpg?id=29676354&width=1200&height=600&coordinates=0%2C0%2C0%2C54\"/><br/><br/><p><em></em>The race to build the metaverse is on—but first, developers need the tools to do it.<br/></p><p><a href=\"https://www.unrealengine.com/en-US/unreal-engine-5\" target=\"_blank\">Unreal Engine 5</a>, released on 5 April, is among the leaders. Its creator, Epic Games, is best known for its megahit game <em>Fortnite</em>, but the company’s engine expertise has deep roots. The engine spun off from the 1998 shooter <em>Unreal</em> and seized an early lead when Epic licensed it for use in over a dozen games from 1999 to 2001.</p><p>“I think Unreal Engine 5 is a great step forward for the metaverse and augmented reality/virtual reality, especially when you consider that a lot of what the company has been building is thinking about the metaverse and AR/VR,” said <a href=\"https://moorinsightsstrategy.com/anshel-sag/\" rel=\"noopener noreferrer\" target=\"_blank\">Anshel Sag</a>, principal analyst at Moor Insights & Strategy.</p><p>After all, immersion and real-time, photorealistic rendering that's as all-encompassing an experience as possible is the name of the game.  </p><strong></strong><p>To that end, Unreal Engine 5 (UE5) packs in dozens of features and refinements, but two take the spotlight: Lumen and Nanite.<br/></p><p>Lumen can handle global illuminations that include diffuse reflections with potentially infinite bounces. If you think this sounds like ray tracing, you’re right. Though handled in software, which reduces accuracy, early demos show results that <a href=\"https://www.youtube.com/watch?v=ehuKmbIXvtQ\" rel=\"noopener noreferrer\" target=\"_blank\">hold up well at a glance</a>. Nanite, meanwhile, is a virtualized geometry system that can alter polygon counts in real time to meet a performance target. It helps developers achieve a level of optimization not previously possible.</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"fb42f74daecc6378ae0701c1fb5a7b29\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/-50MJf7hyOw?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">What is virtualized micropolygon geometry? An explainer on Nanite | Unreal Engine 5</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=-50MJf7hyOw\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>“In my opinion, Nanite could be a vital component to helping VR experiences expand in scope for high-end VR, such as [PC-tethered VR a.k.a. <a href=\"https://ryanschultz.com/2021/07/31/is-pcvr-dead\" target=\"_blank\">PCVR</a>] or [Sony’s] <a href=\"https://www.tomsguide.com/news/psvr-2-release-date-price-new-controllers-leaks-and-latest-news\" target=\"_blank\">PSVR 2</a>, if it can help us to add more detail and scale to our worlds,” <a href=\"https://www.linkedin.com/in/alistair-hume-21876276/?originalSubdomain=uk\" rel=\"noopener noreferrer\" target=\"_blank\">Alistair Hume</a>, cofounder of metaverse developer Axon Park, said in an e-mail.</p><p>These features are supported by <a href=\"https://www.unrealengine.com/en-US/metahuman-creator\" target=\"_blank\">MetaHuman</a>, a tool for generating photorealistic avatars; <a href=\"https://docs.unrealengine.com/5.0/en-US/world-partition-in-unreal-engine/\" target=\"_blank\">World Partition</a>, used for dividing world assets into groups for improved optimization; and <a href=\"https://quixel.com/bridge\" target=\"_blank\">Quixel Bridge</a>, used to import objects from <a href=\"https://quixel.com/megascans\" target=\"_blank\">Megascans</a>, a database of high-fidelity 3D assets.</p><p>Epic has leaned into metaverse hype by releasing <em>The Matrix Awakens: An Unreal Engine 5 Experience </em>alongside the film <em><a href=\"https://en.wikipedia.org/wiki/The_Matrix_Resurrections\" target=\"_blank\">The Matrix: Resurrections</a></em>. The demo delivers a virtual world as realistic as that in the first <em>Matrix</em> movie yet runs in real time on modern home consoles and PCs. UE5 includes the demo’s city as a free sample any developer can download—<a href=\"https://twitter.com/volodXYZ/status/1511854672574922757\" rel=\"noopener noreferrer\" target=\"_blank\">which has already led to a viral hit inspired by <em>Superman</em></a><em>.</em></p><p>You could be forgiven for thinking UE5 is ready to dominate AR/VR and metaverse development. This notion is reinforced by the company’s other metaverse efforts, which <a href=\"https://www.epicgames.com/site/en-US/news/the-lego-group-and-epic-games-team-up-to-build-a-place-for-kids-to-play-in-the-metaverse\" rel=\"noopener noreferrer\" target=\"_blank\">includes a partnership with the LEGO Group focused on a kid-friendly metaverse experience</a>.</p><p>Despite this, Lumen and Nanite do not support VR development at launch, and Epic has no timeline for their release. Developers hoping to use them must take a wait-and-see approach.</p><p>“[<a href=\"https://en.wikipedia.org/wiki/Extended_reality\" target=\"_blank\">Extended reality</a> or XR] developers need as much performance as they can get, and not being able to take advantage of Lumen or Nanite is challenging,” said Sag. “Unreal Engine is already a great engine for XR, but the lack of its flagship new features may turn off some developers.”</p><p>Epic thinks developers will look past the omission. “VR developers can leverage most of UE5’s production-ready tools and features now, such as the new [user experience], the new suite of modeling tools, creator tools such as Control Rig and MetaSounds, and World Partition for large open environments,” an Epic spokesperson said in an e-mail.</p><p>Developers have several alternatives, but one stands out: <a href=\"https://en.wikipedia.org/wiki/Unity_(game_engine)\" target=\"_blank\">Unity</a>. Though less frequently used by big-budget releases, <a href=\"https://naavik.co/deep-dives/unity-analysing-the-first-game-engine-ipo\" rel=\"noopener noreferrer\" target=\"_blank\">Unity is the world’s most popular game engine by market share</a>.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Game avatars stand in a group in a city square with a large device including floating cyan gemstones.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"1f3aaf856cb3b3c93e88065d16afa386\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"efbdc\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/game-avatars-stand-in-a-group-in-a-city-square-with-a-large-device-including-floating-cyan-gemstones.jpg?id=29676327&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Zenith: The Last City is a massively multiplayer VR game built with the popular game engine Unity.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Ramen VR</small></p><p>Unity powered 2016’s AR hit <em>Pokémon Go </em>and <em>Beat Saber</em>, a 2018 VR game that’s still among the most popular for Oculus headsets. More recently, <a href=\"https://www.youtube.com/watch?v=7Hl5lS0SI8Q\" rel=\"noopener noreferrer\" target=\"_blank\">Unity has touted the success of Ramen VR’s <em>Zenith: The Last City</em></a>, a VR game with an open multiplayer world. Zenith highlights the strength of <a href=\"https://assetstore.unity.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Unity’s Asset Store, which offers over 60,000 assets for download</a>. Ramen VR used store assets to build <em>Zenith</em> with a team of less than 10 developers.</p><p>It’s unlikely either engine will gain a permanent upper hand. The metaverse is one of several frontiers for game engines, which range from product prototyping to CGI and 3D animation for television and film. In short, both UE5 and Unity have room to grow—and that means metaverse development will be just one of many tasks each engine supports.</p><p>“I think both Epic Games and Unity 3D realize that the broader their engines can be applied, the more scale they will be able to drive,” said Sag. “Thinking of them as just game engines is a 5-year-old mentality.”</p>",
  "pubDate": "Wed, 13 Apr 2022 16:01:13 +0000",
  "guid": "https://spectrum.ieee.org/unreal-engine-5-metaverse",
  "category": [
    "Video games",
    "Metaverse",
    "Unreal engine",
    "Computer graphics"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}