{
  "title": "A Self-Powered HMI That’s Also Waterproof",
  "link": "https://spectrum.ieee.org/a-self-powered-waterproof-hmi",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-hand-covered-in-water-droplets-shows-a-square-sheet-with-4-circular-sensors-affixed-to-the-top-of-the-hand.jpg?id=31169800&width=1200&height=600&coordinates=0%2C261%2C0%2C262\"/><br/><br/><p>Over the past few decades, human-machine interface (HMI) technologies, especially driven by the demands of <a href=\"https://spectrum.ieee.org/tag/wearables\" target=\"_self\"><u>wearables</u></a>, have progressed rapidly—into smaller, lighter, more efficient, more robust forms. Today, we also have various self-powered HMIs, using <a href=\"https://spectrum.ieee.org/concussion-diagnosis-neck-patch\" target=\"_self\"><u>piezoelectricity</u></a> and triboelectricity, for example, for power generation. Despite these advances, most wearable HMIs still remain relatively defenseless to moisture, such as sweating and weather conditions.</p><p>To address this issue, a research team at the Samueli School of Engineering at the University of California, Los Angeles, have come up with a prototype of a waterproof, flexible, and low-cost skin-integrated HMI. The device comprises a magnetoelastic sensor array that converts ambient biomechanical motion into electrical signals. Their <a href=\"https://aip.scitation.org/doi/10.1063/5.0094289\" rel=\"noopener noreferrer\" target=\"_blank\"><u>study</u></a> has been published in <em>Applied Physics Reviews</em>.</p><p>The device is intrinsically waterproof, biocompatible, and able to convert the force induced by pressing a finger on it into a continuous electrical signal. The team demonstrated this by controlling a music player and turning an electric lamp on and off. They tested it in a variety of real-world conditions as well, including in a water spray, in heavy rain, and during vigorous physical activity.</p><p>The researchers, lead by <a href=\"https://samueli.ucla.edu/people/jun-chen/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Jun Chen</u></a> of UCLA’s <a href=\"https://www.junchenlab.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>Wearable Bioelectronics Research Group</u></a>, used what is known as the magnetoelastic effect (also known as inverse magnetorestriction), discovered in the 1860s, describing the variation in magnetization of a material under mechanical stress. In fact, the current study expands upon the group’s earlier work demonstrating the magnetoelastic effect in a soft polymer system.</p><p>The effect is traditionally observed in rigid metals and metal alloys, Chen says, but in 2021, the researchers observed the effect in his lab, in a <a href=\"https://www.ept.ca/2021/10/bioengineers-develop-new-class-of-human-powered-bioelectronics/\" rel=\"noopener noreferrer\" target=\"_blank\">soft system</a> composed of magnets ranging in size from micro to nano and a polymer matrix. “[It showed] a measured magnetoelastic effect with a five times enhancement compared to that in metals and metal alloys.” As a result, they dubbed it the “<a href=\"https://www.bioeng.ucla.edu/giant-magnetoelastic-effect-in-soft-systems-for-bioelectronics/\" rel=\"noopener noreferrer\" target=\"_blank\"><u>giant magnetoelastic effect</u></a>.” Speaking of their current work, he adds, “we harnessed this discovery to develop a fundamentally new and wearable HMI.”</p><p>The prototype was a 4-by-4-centimeter array comprising two components: a layer of nanomagnets in a porous silicone rubber matrix that converts biomechanical pressure (touch of a finger) into a magnetic response; and a magnetic induction layer of patterned liquid metal coils. The latter responds to the magnetic variations and generates electricity (electromagnetic induction).</p><p>“In this way, [our] device works in a self-powered manner,” Chen says. “Compared with conventional HMI devices, which are non-self-powered, our device will [result in] much less power consumption.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Two fingers strecth the magnetoelastic HMI out.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"8d47d3443fb1c221b7f0a3f6dd009b5b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b5589\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-fingers-strecth-the-magnetoelastic-hmi-out.jpg?id=31169808&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Jun Chen Research Group/UCLA</small></p><p>The fabrication processes involved in making magnetoelastic HMI devices are straightforward, Chen says. The research team used methods like 3D printing, the reverse-mold process, and laser patterning, but, he adds, costs can be further reduced by exploring more economical range of micromagnets to nanomagnets and polymer-matrix materials, or replacing the liquid metal coils layer with a fine-design solid conductive wire layer that is suitable for large-scale fabrication.</p><p>The material was flexible, elastic, and durable, generating stable power even when rolled, folded, and stretched.  Additionally, the magnetic field was not particularly affected by the device being wet. It was unperturbed by a strain of up to 150 percent, and exhibited wide pressure sensitivity as well as a response time of 0.2 seconds at a 1-hertz frequency. These characteristics  make it conducive to controlling electronic devices in real time. In their demonstration, the researchers integrated a circuit with buttons to operate a desk lamp and a music player.</p><p>Chen is interested in commercializing the technology. “Since the devices are soft, wearable, and biocompatible, [they] could be widely adopted for HMI applications,” he says. Among the possible uses are mechanosensitive electronics for electronic skins and soft actuators. He also foresees applications in virtual platforms. “Another appealing potential application is for body motion sensing, in which it can operate as a self-powered stretchable strain sensor, capturing the motion of limbs, muscles, and vital-sign signals for lifestyle, fitness, and health-related applications,” he adds.</p><p>Meanwhile, Chen notes, the fundamental science behind the technology needs more basic research so that scientists and engineers can develop a deeper understanding of its attributes and physical limits. He would also like to work on the voltage output: “Faraday’s law [says] the output voltage is linearly proportional to the number of the coils and the variation of total magnetic flux through the coil. Therefore, one possible direction [of research is] more advanced fabrication techniques to increase the magnetomechanical coupling factor and the number of coils.”</p>",
  "pubDate": "Tue, 23 Aug 2022 14:27:13 +0000",
  "guid": "https://spectrum.ieee.org/a-self-powered-waterproof-hmi",
  "category": [
    "Wearables",
    "Biomedical",
    "Wearable devices"
  ],
  "dc:creator": "Payal Dhar",
  "media:content": ""
}