{
  "id": "tag:blogger.com,1999:blog-19803222.post-7033878502963723884",
  "published": "2017-03-16T08:07:00.001-06:00",
  "updated": "2017-03-16T08:40:28.051-06:00",
  "title": "Trying to Learn How to be Helpful (IWD++)",
  "content": "Over the past week, in honor women of this <a href=\"https://www.internationalwomensday.com/\">International Women's Day</a>, I had a several posts, broadly around the topic of women in STEM. Previous posts in this series include: <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-bonnie-dorr-iwd.html\">Awesome People: Bonnie Dorr</a>, <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-ellen-riloff-iwd.html\">Awesome People: Ellen Riloff</a>, <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-lise-getoor-iwd.html\">Awesome People: Lise Getoor</a>,  <a href=\"https://nlpers.blogspot.com/2017/03/awesome-women-karen-sparck-jones-iwd.html\">Awesome People: Karen Spärck Jones</a> and <a href=\"https://nlpers.blogspot.com/2017/03/awesome-people-kathy-mckeown-iwd.html\">Awesome People: Kathy McKeown</a>. (Today's is delayed one day, sorry!)<br /><br />I've been incredibly fortunate to have a <i>huge</i> number of influential women in my life and my career. Probably the other person (of any gender) who contributed to my career as much as those above is my advisor, <a href=\"https://www.isi.edu/~marcu/\">Daniel</a>. I've been amazingly supported by these amazing women, and I've been learning and thinking and trying to do a lot over the past few years to do what I can to support women in our field.<br />There are a lot of really good articles out there on how to be a male ally in \"tech.\" Some of these are more applicable to academia than others and I've linked to a few below.<br /><br />Sometimes \"tech\" is not the same as \"academia\", and in the context of the academy, easily the best resource I've seen is Margaret Mitchell's writeup on a <a href=\"http://m-mitchell.com/gender/papers/5Aug2016.pdf\">Short Essay on Retaining and Increasing Gender Diversity, with Focus on the Role that Men May Play</a>. You should go read this now.<br /><br />No really, go read it. I'll be here when you get back.<br /><br />On Monday I attended a <a href=\"https://local.anitaborg.org/event/role-male-allies-advocates-mentors-retaining-women-tech/\">Male Allies in Tech workshop</a> put on by <a href=\"http://anitaborg.org/\">ABI</a>, with awesome organization by <a href=\"https://twitter.com/rosariorobinson\">Rose Robinson</a> and <a href=\"https://twitter.com/laurennor\">Lauren Murphy</a>, in which many similar points were made. This post is basically a summary of the first half of that workshop, with my own personal attempt to try to interpret some of the material into an academic setting. Many thanks to especially to <a href=\"https://twitter.com/NataliasTweeet\">Natalia Rodriguez</a>, <a href=\"https://twitter.com/therealeringrau\">Erin Grau</a>, <a href=\"https://twitter.com/RFagiri\">Reham Fagiri</a> and <a href=\"https://twitter.com/tastelifewrite\">Venessa Pestritto</a> on the Women perspectives panel, and Dan Storms, Evin Robinson, Chaim Haas and Kip Zahn on the Men perspective panel (especially <a href=\"https://twitter.com/EvinRobinson\">Evin Robinson</a>!).<br /><br />The following summary of the panels has  redundancy with many of Margaret's points, which I have not suppressed and have tried to highlight.<br /><ol><li style=\"margin-bottom: 1em;\"><b>Know that you're going to mess up and own it.</b> I put this one first because I'm entirely sure that even in the writing this post, I'm going to mess up. I'm truly uncomfortable writing this (and my fingernails have paid the price) because it's not about me, and I really don't want to center myself. On the other hand, I also think it's important to discuss how men (ie me) can try to be helpful, and shying away from discussion also feels like a problem. The only place I feel like I can honestly speak from is my own experience. This might be the worst idea ever, and if it is, I hope someone will tell me and talk to me about it. So please, feel free to email me, message me, come find me in person or whatever. <br /> </li><li style=\"margin-bottom: 1em;\"> Pretty much the most common thing I've heard, read, whatever, is: <b>listen to and trust</b> <b>women</b>. Pretty much all the panelists at the workshop mentioned in this in some form, and Margaret mentions this in several places. As an academic, though, there's more that I've tried to do: read some papers. There's lots of research on the topic of things like unconscious bias in all sorts of settings, and studies of differences in how men and women are cited, and suggested for talks, and everything else under the sun. A reasonable \"newbie\" place to start might be Lean In (by Sheryl Sandberg) which, for all the issues that it has, provides some overview of research and includes citations to literature. But in general, doing research and reading papers is something I know how to do, so I've been trying to do it. Beyond being important, I've honestly found it really intellectually engaging.  </li><li style=\"margin-bottom: 1em;\"> Another very frequently raised topic on the panels, and something that Margeret mentions too, is to <b>say something when you see or hear something sexist</b>. Personally, I'm pretty bad at thinking of good responses in these cases: I'm a very non-type-A person, I'm not good with confrontation, and my brain totally goes into \"flight\" mode. I've found it really useful to have a cache of go-to responses. An easy one is something like \"whoah\" or just \"not cool\" whose primary benefit is being easy [3]. Both seem to work pretty well, and take very little thought/planning. A more elaborate alternative is to ask for clarification. If someone says something sexist, ask what's meant by that. Often in the process of trying to explain it, the issue becomes obvious. (I've been on the receiving side of both such tactics, too, and have found them both effective there as well.)<br /><br />Another standard thing in meetings is for men to restate what a woman has stated as their own idea. A suggested response from <a href=\"https://www.linkedin.com/in/rosariorobinson\">Rose Robinson</a> (one of the organizers) at the workshop is \"I'm so glad you brought that up because maybe it wasn't clear when [woman] brought it up earlier.\" I haven't tried this yet, but it's going into my collection of go-to responses so I don't have to think too much. I'd love to hear other suggestions!  </li><li style=\"margin-bottom: 1em;\"> A really interesting suggestion from the panel at the workshop was \"go find a woman in your organization with the same position as you and tell her your salary.\" That said, I've heard personally from two women at two different universities that they were told they could not be given more of a raise because then they'd be making more than (some white guy). I'm not sure what I can do about cases like that. A related topic is startup: startup packages in a university are typically <i>not</i> public, so a variant of this is to tell your peers what your startup was.  </li><li style=\"margin-bottom: 1em;\"> There were a lot of suggestions around the idea of making sure that your company's content has <b>broad representation</b>; I think in academic this is closely related to the first three of Margaret's points about suggesting women for panels, talks or interviews in your stead. I would add leadership roles to that list. One thing I've been trying to do when I'm invited to regular seminar series is to look at their past speakers and decide whether I would be contributing to the problem by accepting. This is harder for one-off things like conference talks/panels (because there's often no history), but even in those cases it's easy enough to ask if I'll be on an all-male panel. In cases where I've done this, the response has been positive. I've also been trying to be more openly intentional recently: if I do accept something, I'll try to explicitly say that I'm accepting because I noticed that past speakers were balanced. Positive feedback is good. A personally useful thing I did was write template emails for <a href=\"http://hal3.name/tmp/response_emails.txt\">turning down invitations or asking for more information</a>, with a list of researchers from historically excluded groups in CS (including but not limited to women) who could be invited in my stead. I almost never send these exactly as is, but they give me a starting point.<br /><br />There's a dilemma here: if every talk series, panel, etc., were gender balanced, women would be spending all their time going around giving talks and would have less time for research. I don't have a great solution here. (I do know that a non-solution is to be paternalistic and make decisions for other people.) One option would be to pay honoraria to women speakers and let the \"market\" work. This doesn't address the dilemma fully (time != money), but I haven't heard of or found other ideas. Please help!<br /><br /> Turning down invitations to things as an academic is really hard. I recognize my relative privilege here that I already have tenure and so the cost to me for turning down this or that is pretty low in comparison to someone who is still a Ph.D. student or an untenured faculty member. That is to say: it's easy for me to say that I'm willing to take a short term negative reward (not giving a talk) in exchange for a long term very positive reward (being part of a more diverse community that both does better science and is also more supportive and inclusive). If I were still pre-tenure, this would definitely get clouded with the problem that it's great if there's a better environment in the future but not so great for me if I'm not part of it. On the other hand, pre-tenure is definitely a major part of the leaky pipeline, and so it's also really important to try to be equitable here. Each person is going to have to find a balance that they're comfortable with.<br /><br /> One last thought on this topic is something that I was very recently inspired to think about by Hanna Wallach. My understanding is that she, like most people, cannot accept honoraria as part of a company, and so she recently started asking places to donate her honoraria to good causes. I <i>can</i> accept honoraria for talks, which hurts the pipeline, but perhaps by donating these funds to organizations like ABI or BlackGirlsCode, I can try to help other parts of the pipeline. (There are tons of organizations out there I've thought about supporting; I like BGC for original intersectionality reasons.)  </li><li style=\"margin-bottom: 1em;\"> I've been working hard to <b>follow women on social media</b> (and to follow members of other historically excluded groups, including women). This has been super valuable to me for expanding my views of tons of topics.  </li><li style=\"margin-bottom: 1em;\"> The final topic at the workshop was a talk by the two authors of a new book on <b>how and why men can mentor women</b> called <a href=\"http://www.publishersweekly.com/978-1-62956-151-6\">Athena Rising</a>. This was really awesome. Mentoring in tech is different than advising in academia, but not <i>that</i> different. Or at least there are certainly some parallels. Looking back at Hal-a-few-years ago, I very much had fallen into the trap of \"okay I advise a diverse group of PhD students ergo I'm supporting diversity.\" This is painfully obvious now when I re-read old grant proposals. A consistent thing I've heard is that this is a pretty low bar, especially because women who do the extra required to get to our PhD program are really really amazing.<br /><br />I still think this is an important factor, but this discussion at the workshop made me realize that I can also go out and learn how to be a better advisor, especially to students whose live experiences are very different than my own. And that it's okay if students don't want the same path in life that I do: \"hone don't clone\" was the catch-phrase here. This discussion reminded me a comment one of the PhD students made to me after going to Grace Hopper: she really appreciated it because she could ask questions there that she couldn't ask me. I think there will always be such questions (because my lived experience is different), but I've decided to try to close the gap a bit by learning more here.  </li><li style=\"margin-bottom: 1em;\"> Finally (and really, thank you if you've read this far), a major problem that was made apparent to me by Bonnie Webber is that one reason that women receive fewer awards in general is because <b>women are nominated for fewer awards</b> (note: this is not the <i>only</i> reason). Nominating women for awards is a <i>super easy</i> thing for me to do. It costs a few hours of my time to nominate someone for an award, or to write a letter (of course for serious awards, it's far more than a few hours to write a letter, but whatev). This includes internal awards at UMD, as well as external awards like ACL (or ACM or whatever) fellows, etc. Whenever I get an email for things like this, I'm trying to think about: who could I nominate for this that might otherwise be overlooked (Margaret's point on page 2!). </li></ol>I promised some other intro resources; I would suggest:  <br /><ol><li> <a href=\"http://geekfeminism.wikia.com/wiki/Allies\">GeekFeminism: Allies</a></li><li> <a href=\"http://geekfeminism.wikia.com/wiki/Resources_for_allies\">GeekFeminism: Resources for Allies</a></li><li> <a href=\"http://geekfeminism.wikia.com/wiki/Good_sexism_comebacks\">GeekFeminism: Good sexism comebacks</a></li><li> <a href=\"http://everydayfeminism.com/2015/01/male-feminist-rules-to-follow/\"> Everyday Feminism: Male Feminist Rules to Follow</a></li><li> <a href=\"http://geekfeminism.wikia.com/wiki/Allies_workshop\">GeekFeminism: Allies Workshop</a></li></ol>Like I said at the beginning, what I really hope is that people will reply here with (a) suggestions for things they've been trying that seem to be working (or not!), (b) critical feedback that something here is really a bad idea and that something else is likely to be much more effective, (c) and general discussion about the broad issues of diversity and inclusion in our communities.<br /><br />Because of the topic of the workshop, this is obviously focused in particular on women, but the broader discussion needs to include topics related to <i>all</i> historically excluded groups because what works for one does not necessary work for another. Especially when intersectionality is involved. Rose Robinson ended the ABI Workshop saying \"To get to the same place, women have to do extra. And Black women have to do extra extra.\" What I'm trying to figure out is what extra <i>I</i> can do to try to balance a bit more. So please, please, help me!",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "hal",
    "uri": "http://www.blogger.com/profile/02162908373916390369",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 12
}