{
  "id": "yt:video:GxjuX5bmifw",
  "yt:videoId": "GxjuX5bmifw",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "New Employment Laws and Updates from the Dept of Labor Under a Biden Administration",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-03-17T21:20:30+00:00",
  "updated": "2022-09-08T11:15:41+00:00",
  "media:group": {
    "media:title": "New Employment Laws and Updates from the Dept of Labor Under a Biden Administration",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "As we transitioned into the Biden Administration in January 2021, questions swirled about what the Department of Labor (“DOL”) would look like and predictions were made as to the issues and initiatives it would prioritize, as well as what would come of Trump-era DOL policies. Now, almost a year and a half into the President Biden’s term, we will review some of the most significant rulemakings and changes we have seen from the DOL under Biden. Though the Emergency Temporary Standards issued by the Occupational Safety and Health Administration generally took center stage, the DOL promulgated other significant and impactful regulations, particularly in the areas of tipped employees and joint employment.\n\nSpecifically, the DOL promulgated a rule that narrowed the standard for whom an employer can take a tip credit under the Fair Labor Standards Act, which had been significantly broadened by the DOL under Trump. It also rescinded a rule issued during the Trump Administration that more clearly defined and restricted when a company will be found to be a joint employer. We will also review what appears to be coming down the pipeline and make more predictions about what employers can expect from the Biden Administration’s DOL throughout the remainder of this presidential term.\n\nParticipants in this webinar will learn about:\n\n• Biden Administration’s DOL Regulatory Agenda, including rulemaking and policy setting priorities\n• New rules from the DOL and their impact on important issues like tip credits, tip pooling, and joint employment\n• Enforcement initiatives and guidance from the DOL and its sub-agencies\n• Predictions for the Department of Labor over the next 2.5 years\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}