{
  "id": "yt:video:_lz1VfI6Wxk",
  "yt:videoId": "_lz1VfI6Wxk",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "The Symmetry at the Heart of the Canonical Commutation Relation",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2022-01-11T23:13:55+00:00",
  "updated": "2022-09-26T17:29:03+00:00",
  "media:group": {
    "media:title": "The Symmetry at the Heart of the Canonical Commutation Relation",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The canonical commutator is one of the most fundamental equations of quantum mechanics. But where does it come from? I'll show you how symmetry leads straight to it! Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nThe canonical commutation relation between the position operator and momentum operator is one of the defining equations of quantum mechanics. It's what leads to the Heisenberg uncertainty principle, that even if you know the quantum state (or wavefunction) of a particle, you can't precisely determine its position and momentum at the same time. In this video, I'll show how the CCR follows by defining the momentum as the generator of spatial translation symmetry. Along the way, we'll take a crash course in the fundamentals of quantum mechanics.\n\nGet all the links here: https://www.physicswithelliot.com/ccr-mini\n\nRelated earlier videos:\n\n- Poisson brackets demystified: https://youtu.be/Nd4b0_vJZUk\n\n- Hamiltonian Noether theorem: https://youtu.be/uncm8DChdhc\n\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}