{
  "id": "https://bibleinoneyear.org/en/youth/113",
  "title": "Day 113: The Gracious Hand of God",
  "description": "Psalm 50:15, Joshua 3:5, 5:10–12, Luke 22:3–37.  Of course, he could do it all on his own, but he chooses to involve you  He gives you freedom, yet he remains in control",
  "pubDate": "Sat, 23 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/113/",
  "itunes:duration": "14:52",
  "guid": "enyouth23042022-113",
  "length": 892.03,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 113: The Gracious Hand of God",
  "itunes:subtitle": "Psalm 50:15, Joshua 3:5, 5:10–12, Luke 22:3–37.  Of course, he could do it all on his own, but he chooses to involve you  He gives you freedom, yet he remains in control",
  "itunes:summary": "Things happen to us. So much of life is simply the set of circumstances we find ourselves in. For example, our parents, our genetic design, the weather, much of our education and our government are all things that we experience as ‘happening to us’. In Greek grammar, these things are expressed in what we call the ‘passive voice’. However, we also make things happen. When I initiate an action and do something, this is expressed in the ‘active voice’.\nBut Greek grammar also has a third voice – the ‘middle voice’. This is neither wholly active nor wholly passive. When I use the middle voice, I am participating in the results of an action.\nChristian prayer is spoken in the middle voice. It cannot be in the active voice because it is not an action I control, as in the ritualistic pagan prayers where the gods do our bidding. Prayer is not in the passive voice either, in which I’m at the mercy of the will of gods and goddesses. In Christian prayer, as Eugene Peterson puts it, ‘I enter into an action begun by another, my creating and saving Lord, and find myself participating in the results of his [gracious] action.’\nIn one sense, the whole of the Christian life is prayer. We welcome God’s gracious hand in our lives, and we participate in what he is doing in the world. God involves you in his plans. Of course, he could do it all on his own, but he chooses to involve you. He gives you freedom, yet he remains in control.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 478
}