{
  "title": "#485: The Biggest Plot Holes in the Harry Potter Books",
  "link": "https://audioboom.com/posts/7698314",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4488,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>PSA for the USA: Many voter registration deadlines are approaching in the United States. Please make sure you are registered to vote in your state right now by visiting <a href=\"http://www.iwillvote.com\">IWillVote.com</a>. You can also find out great ballot information at <a href=\"http://www.BallotReady.org\">BallotReady.org</a> and sign up to be a poll worker at <a href=\"http://www.PowerThePolls.org\">PowerThePolls.org</a>. </li>\n<li>MuggleMail covers Dumbledore and Tom Riddle's first encounter and Voldemort's ability to love</li>\n<li>Our Main Discussion focuses on The Biggest Plot Holes in the Harry Potter books!</li>\n<li>The Lost Day: What was happening in those initial 24 hours after the Potters were killed?</li>\n<li>Why didn’t James Potter become his own Secret Keeper?</li>\n<li>Time Turners galore! Why didn’t anyone go back in time to stop Voldemort? </li>\n<li>How is it Peter Pettigrew was never noticed on the Marauder’s Map by Fred & George?</li>\n<li>Why didn't Lupin warn Harry about Sirius' animagus form?</li>\n<li>How did the Triwizard Cup function as a (reverse) portkey to bring Harry back to Hogwarts at the end of Goblet of Fire?</li>\n<li>Why doesn’t Voldemort have all his Death Eaters make an Unbreakable Vow? </li>\n<li>What's the deal with the trace?</li>\n<li>The truth about Veritaserum... it could have made quite the difference!</li>\n<li>Quizzitch: Who was Fudge’s opponent in running for Minister for Magic?</li>\n<li>You can join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n<li>This week's episode is brought to you by <a href=\"http://www.peacocktv.com\">Peacock</a> (Watch the Harry Potter movies for free all October long!) and MeUndies (get 15% off and free shipping on your first order by visiting <a href=\"http://www.MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>)</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 06 Oct 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-10-05:/posts/7698314",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}