{
  "title": "EPISODE 66: Sex in Ancient Rome",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sat, 05 Sep 2020 09:43:05 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2020/9/4/episode-66",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5f52b4dd904ed03c13602a6a",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1599298968617-XGZUEQR1VD97Y9R9UHGN/HOF-66-SexInAncientRome.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-66-SexInAncientRome.jpg\" data-load=\"false\" data-image-id=\"5f535d920d0691773fef05cc\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1599298968617-XGZUEQR1VD97Y9R9UHGN/HOF-66-SexInAncientRome.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“From an author’s perspective, writing about sex is risky, because if you write well enough, evocatively enough, vividly enough, you make the reader want to put the book aside and go get laid.”</em>&nbsp; — Tom Robbins&nbsp;</p><p class=\"\"><em>“Let's live and love,&nbsp;<br>Caring less than nothing for&nbsp;<br>The moralizing of stern old men.<br>The sun sets and rises back again,<br>But an eternal night of sleep awaits us<br>When our brief light turns to darkness.<br>Give me a thousand kisses, and a hundred more.<br>Then a thousand, and another hundred.<br>And then more thousands and hundreds.<br>Let's scatter them, then,&nbsp;<br>So that no one can envy us<br>By knowing how many kisses we have shared.”</em> — Catullus</p><p class=\"\"><em>“You know how today some people have garden gnomes? Ancient Romans had their own version, and of course... the Romans being Romans, their garden gnomes were endowed huge penises and an enthusiasm for raping anyone entering the garden uninvited.” —</em> Daniele Bolelli&nbsp;</p><p class=\"\">This is a cultural history episode about sexuality in Ancient Rome. I thought the topic would be fun and juicy, but that’s because my memory of Roman sexuality was hazy. After refreshing it with lots of research, I can safely say that ‘fun’ is not a word I would apply to it. ‘Insanely disturbing’ is probably more fitting. Most of the ancient sources, in fact, seem to indicate that little to no attention was paid to the idea of sex being for mutual pleasure. Rather, sex was primarily seen as something to reinforce dominance and hierarchy. In this episode, we’ll cover prison sex, rapey garden gnomes, the similarities and differences between ancient Roman and Christian sexualities, the origin of the word ‘family’ (it’s not pleasant), threatening sexual violence to prove one’s manliness, the violent myths about Rome’s founding, the Rape of the Sabine women, sex and slavery, prostitution, why speaking of homosexuality or heterosexuality made no sense in Ancient Rome, legal trials as rap battles, Cicero & the art of character assassination, Mark Anthony & the art of assassinating Cicero, Augustus’ puritanism, gladiators fighting against their own wildcat-shaped phalli, Roman sexual art, and much, much more.&nbsp;</p><p class=\"\">&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 66: Sex in Ancient Rome"
  }
}