{
  "title": "TU61: It’s Not Crazy; It’s a Solution to an Unsolvable Problem – Disorganized Attachment",
  "link": "https://therapistuncensored.com/episodes/tu61-its-not-crazy-its-a-solution-to-an-unsolvable-problem-disorganized-attachment/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu61-its-not-crazy-its-a-solution-to-an-unsolvable-problem-disorganized-attachment",
  "pubDate": "Tue, 24 Apr 2018 11:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5988",
  "description": "Disorganized Attachment\nLet&#039;s talk about the elusive 4th category of adult attachment, disorganized attachment, and how this state of mind relates to everyone, no matter your trauma history.\n\nDropping into overwhelm and disorganization happens to everyone at times, and some more than others. When we have been exposed to serious danger, unresolved fright or major loss in such a way that it interferes with healthy coping patterns, we are left to our own to manage the world. In research terms they call this disorganized or unresolved, but we’d like to describe it as squirting squid ink to confuse who we think is the predator and making a run for it.\n\nWrapping up this 3-part series focusing specifically on adult attachment, Ann Kelley PhD and Sue Marriott LCSW, CGP discuss how this style of attachment forms and how it appears in adult life. Start the series here with episode 59 on dismissing attachment, Are You Cool or Just Cut Off  and then go to Episode 60 and Anxious Attachment.\n\nFinally, listen here to learn how to organize yourself internally and externally.\n\nLearn how to adjust back into an organized state and conquer your disconnection through focusing on yourself and building and deepening relationships. We’ll talk about how pockets of disorganization and trauma permeate in life and how increasing your bucket can improve your ability to move across the attachment spectrum and establish coherence.\n\n0:00-10:00\n\nRecap on attachment types and the Spectrum of Attachment (this is 3 of 3, with Episode 59 and 60 the first 2)\n\nOverview of disorganized attachment ie. driving without a GPS,\n\n“fear without solution” unintegrated mental states – Lyons-Ruth\n\nDisorganized attachment in childhood certainly happens more often with children who are intentionally mistreated and abused, but also can occur without specific abuse.\n\nChronic fright and/or having a frightning caregiver are both factors, as well as significant loss.\n\nChildren whose parents had significant unprocessed loss or trauma that may have their own disorganization struggles can also unintentionally create a frightening environment that sets their children on developmental pathways to have an incoherent and unorganized coping styles.\n\n10:00-20:00\n\nEstablishing coherence to make sense of the bad things that have occurred in life\n\nIt’s not what happened to you but what sense you’ve made of it\n\nPockets of disorganization as a human condition\n\nPockets of trauma, normalcy of these pockets\n\nThe need to slow down when encountering these pockets, even saying to yourself that you’re disorganized is organizing.\n\nIt’s not me it’s my amygala!\n\n \n\n20:00-30:00\n\nBig step of just moving from disorganized to organized, and eventually if you can get there from insecure to earned secure. But we will take moving from having lost one’s thinking to gaining it back. Grounding from floating. Stopping the spin.\n\nDisassociation\n\nStrengthening and deepening moments of having secure states of mind can eventually move your bucket, or internal working model, towards earned secure!\n\nPractical ideas – use small risks of vulnerability in close relationships, mindfulness, journaling, practicing Grices maxims (increasing coherence) and anchoring scales to ground.\n\nThe more safe you feel, the more steady secure and organized you can get\n\nWhen someone is in a disorganized state, it’s time to get them grounded and more securely inside themselves, not solve relational problems or give a lot of cognitive feedback. This is important both for couples and group therapy especially.\n\n \n\n30:00-40:00\n\nImportance of working on attachment first, then the trauma\n\nIf you’ve had trauma, best thing to do is build and grow safe relationships\n\nYou may never have to unearth all the specific trauma if you focus on your attachment and relationships, and if you do you’ll have much steadier ground to work from.\n\nSecuring safe relationships IS working on trauma!",
  "enclosure": "",
  "itunes:subtitle": "Disorganized Attachment Let&#039;s talk about the elusive 4th category of adult attachment, disorganized attachment, and how this state of mind relates to everyone, no matter your trauma history. - Dropping into overwhelm and disorganization happens to ev...",
  "itunes:summary": "The elusive 4th category of adult attachment, disorganization - and how this state of mind relates to everyone, no matter your trauma history.  <br />\nWrapping up this 3-part series (episode 59, 60 & 61) focusing specifically on adult attachment, Ann Kelley PhD and Sue Marriott LCSW, CGP discuss disorganized attachment, how it forms, how it appears in adult life, and how you can identify when you fall in a pocket of it to organize yourself internally and externally.  Learn how to adjust back into an organized and more secure state of mind and begin to conquer your disconnection through focusing on grounding your mind, developing coherence and building solid relationships!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "36:06"
}