{
  "title": "Dead Pig’s Restored Organs Give Hope for Transplants",
  "link": "https://spectrum.ieee.org/expired-pigs-restored-organs-give-hope-for-transplants",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/rendering-of-a-heart-liver-and-kidneys-with-tubes-of-red-liquid-moving-through-them.jpg?id=31203626&width=1200&height=600&coordinates=0%2C468%2C0%2C469\"/><br/><br/><p>After animals die, rapid biological and chemical processes begin to destroy cells and organs. Previous research on pig brains showed that a treatment the researchers called<a href=\"https://www.nature.com/articles/s41586-019-1099-1\" rel=\"noopener noreferrer\" target=\"_blank\"> BrainEx</a> could slow or reverse some of these processes. Now, the team has shown that a modified version of the previous technology, called OrganEx, can create some of the same effects when applied to the entire body of a pig, reversing the deterioration of cells in the liver, heart, kidneys, and other organs after death. Though the preliminary research is far from being used with humans, the researchers say that it could eventually help keep organs viable for donations for longer after an organ donor dies. The research also raises a number of ethical questions, from the welfare of animals to the future allocation of medical resources.</p><p>“We have shown that certain cellular functions can be restored in the brain following several hours after cessation of blood flow,” said authors<a href=\"https://medicine.yale.edu/profile/david_andrijevic/\" rel=\"noopener noreferrer\" target=\"_blank\"> Dr. David Andrijevic</a>,<a href=\"https://medicine.yale.edu/profile/zvonimir_vrselja/\" rel=\"noopener noreferrer\" target=\"_blank\"> Zvonimir Vrselja</a>, and<a href=\"https://medicine.yale.edu/profile/nenad_sestan/\" rel=\"noopener noreferrer\" target=\"_blank\"> Dr. Nenad Sestan</a>, of Yale University’s department of neuroscience via email. “We wanted to see whether the same observations could also be seen across multiple vital organs in the whole body.”</p><p>Researchers first induced cardiac arrest in anesthetized pigs. Then, they waited one hour before applying their system to the pigs’ bodies. OrganEx is a two-part system, including a device similar to a<a href=\"https://www.mayoclinic.org/tests-procedures/ecmo/about/pac-20484615#:~:text=Overview,to%20tissues%20in%20the%20body.\" rel=\"noopener noreferrer\" target=\"_blank\"> heart-lung machine</a> that's used to keep patients alive during major heart surgery. The device helps to restore blood circulation and distribute the second part of the technology, a special solution containing ingredients designed to protect cells and restore some cell and organ function. These ingredients include an artificial-oxygen-carrier similar to hemoglobin, amino acids, vitamins, and over 13 drugs meant to reduce inflammation and cell death.</p><p>Researchers found that the OrganEx process helped preserve the structure of organs and cells. In addition, they found, many revived organ cells worked similarly to cells in living pigs. These cells—including cells in the heart, liver, and kidneys—also had genetic signatures showing that they were repairing themselves.</p><p>According to <a href=\"https://www.ucladdrcc.med.ucla.edu/members/members/jerzy-kupiec-weglinski-phd\" target=\"_blank\">Jerzy Kupiec-Weglinski</a>, a professor of surgery, pathology, and laboratory medicine at the David Geffen School of Medicine at the University of California, Los Angeles, “the ‘resurrection’ of the brain” under OrganEx’s 6-hour-long treatment is “most striking.” The accomplishment is all the more remarkable, he says, for the hour postmortem that the tissue had been deprived of oxygen. <br/></p><p>The OrganEx treatment preserved the cellular structure of brain cells, and even some electrical activity in the brain, though nowhere near the amount of activity that would mean the pigs were conscious. The pigs also had some sporadic movements that the researchers said they do not completely understand.<br/></p><p>OrganEx is still in the early stages of testing and development and would need to go through more stages of animal research as well as the clinical trial process before it might be used in humans. But, the study’s authors write, the technology ultimately promises to extend the time after death that organs are viable for transplantation.</p><p>“The lack of donor organs is the major problem in our field, and people are dying while waiting for the life-saving organ transplant,” said Kupiec-Weglinski via email. (He is also director of the Dumont-UCLA Transplantation Research Center.) </p><p>The OrganEx research also raises a number of ethical questions, including redefining what death is, says<a href=\"https://ethics.emory.edu/who-we-are/our-people/director.html\" target=\"_blank\"> Paul Root Wolpe</a>, a bioethicist and director of the Center for Ethics at Emory University.</p><p>“Death is the cessation of organized metabolic activity,” he says. “If this process begins to reanimate metabolic activity, then you really are talking about the very, very early first rudimentary possible steps of reversing death.” If researchers were able to restore more activity in the brain, he notes, it could also become difficult to determine if the animals are conscious. <a href=\"https://www.scientificamerican.com/article/how-can-we-tell-if-a-comatose-patient-is-conscious/\" target=\"_blank\">Research on coma patients</a> has shown that we don’t always know if humans are conscious based on brain activity alone.</p><p>Future use of the new technology could also raise questions about the use of medical resources, says<a href=\"https://devcell.bio.uci.edu/faculty/maksim-plikus/\" rel=\"noopener noreferrer\" target=\"_blank\"> Maksim Plikus</a>, a professor of developmental biology at the University of California, Irvine, who was not involved with the study. Right now, people who are brain-dead are sometimes left on life support, even if there is minimal chance of recovery, draining valuable medical resources. If such technologies could one day restore organ function—though not necessarily brain function—in someone who is clinically dead, this dilemma could become more common, he says.</p><p>For their part, the Yale team doesn’t view their research, published this month in the journal<a href=\"https://www.nature.com/articles/s41586-022-05016-1\" rel=\"noopener noreferrer\" target=\"_blank\"> <em>Nature</em></a>, as redefining death.</p><p>“In our work, we are more focused [on] cellular and organ recovery,” the authors said. “That is what we would like to continue focusing on in the future.”</p>",
  "pubDate": "Thu, 25 Aug 2022 13:00:00 +0000",
  "guid": "https://spectrum.ieee.org/expired-pigs-restored-organs-give-hope-for-transplants",
  "category": [
    "Transplants",
    "Life extension"
  ],
  "dc:creator": "Rebecca Sohn",
  "media:content": ""
}