{
  "title": "The Revolt of the Public with Martin Gurri",
  "pubDate": "Sat, 05 Jan 2019 18:48:14 +0000",
  "guid": "7cd35d70957e41f9bb001b818d9a6d80",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP112Gurri_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is Martin Gurri (<a href= \"https://twitter.com/mgurri\" target=\"_blank\" rel= \"noopener\">Twitter</a>, <a href= \"https://thefifthwave.wordpress.com/\" target=\"_blank\" rel= \"noopener\">blog</a>), author of <a href=\"https://amzn.to/2CONy0A\" target=\"_blank\" rel=\"noopener\">The Revolt of the Public</a>. We discuss his book, which deals with the impact of information technology on political trends and populism.</p> <blockquote>In the words of economist and scholar Arnold Kling, “Martin Gurri saw it coming.” Technology has categorically reversed the information balance of power between the public and the elites who manage the great hierarchical institutions of the industrial age—government, political parties, the media. The Revolt of the Public tells the story of how insurgencies, enabled by digital devices and a vast information sphere, have mobilized millions of ordinary people around the world. Originally published in 2014, this updated edition of The Revolt of the Public includes an extensive analysis of Donald Trump’s improbable rise to the presidency and the electoral triumphs of “Brexit” and concludes with a speculative look forward, pondering whether the current elite class can bring about a reformation of the democratic process, and whether new organizing principles, adapted to a digital world, can arise out of the present political turbulence.</blockquote> <hr /> <p> </p>",
  "content:encoded": "<p>Today's guest is Martin Gurri (<a href= \"https://twitter.com/mgurri\" target=\"_blank\" rel= \"noopener\">Twitter</a>, <a href= \"https://thefifthwave.wordpress.com/\" target=\"_blank\" rel= \"noopener\">blog</a>), author of <a href=\"https://amzn.to/2CONy0A\" target=\"_blank\" rel=\"noopener\">The Revolt of the Public</a>. We discuss his book, which deals with the impact of information technology on political trends and populism.</p> In the words of economist and scholar Arnold Kling, “Martin Gurri saw it coming.” Technology has categorically reversed the information balance of power between the public and the elites who manage the great hierarchical institutions of the industrial age—government, political parties, the media. The Revolt of the Public tells the story of how insurgencies, enabled by digital devices and a vast information sphere, have mobilized millions of ordinary people around the world. Originally published in 2014, this updated edition of The Revolt of the Public includes an extensive analysis of Donald Trump’s improbable rise to the presidency and the electoral triumphs of “Brexit” and concludes with a speculative look forward, pondering whether the current elite class can bring about a reformation of the democratic process, and whether new organizing principles, adapted to a digital world, can arise out of the present political turbulence.  <p> </p>",
  "enclosure": "",
  "itunes:duration": "51:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is Martin Gurri (, ), author of . We discuss his book, which deals with the impact of information technology on political trends and populism. In the words of economist and scholar Arnold Kling, “Martin Gurri saw it coming.”...",
  "itunes:episode": 112,
  "itunes:episodeType": "full"
}