{
  "title": "S1E58 - Define Your Role in the World with DEFINE Founder & CEO Hank Richardson",
  "guid": "https://pinecast.com/guid/132fcb28-da36-4d6c-a1e1-a8340d2d7341",
  "pubDate": "Thu, 24 Mar 2022 06:30:00 -0000",
  "itunes:duration": "00:54:19",
  "description": "<p>On today’s episode, Laura’s guest is her dear friend and forever teammate, Hank Richardson. Hank earned a full scholarship for diving to the University of Florida, where he went on to become a ten-time All-American, a US national champion, and a national team member for USA diving. Hank retired from diving when he graduated from college, but some of his old injuries continued to plague him long after he left the pool, the pain becoming so severe that it started to impact his ability to enjoy work. At the urging of a friend, Hank tried a Pilates/yoga/ballet hybrid class and found himself at the beginning of something special: not only did he start managing his pain and experiencing relief, but it led to him teaching classes, opening new studios, and going back to school to get a Master’s in business. His senior project in his MBA program became the foundation on which his health and well-being studio, DEFINE, was created. DEFINE has now expanded throughout Houston, the US, and across the globe, but pain management and physical fitness are only part of Hank’s passion. He is also a well-being and positive psychology expert, and today, he and Laura discuss positive ways to reframe your thinking and how positive psychology can help and impact athletes on their journey to greatness.</p>\n<p>First, Hank gives us the lowdown on his remarkable journey, from learning to dive at Camp Longhorn to becoming a champion diver, and giving up diving because of a back injury, before sharing how he transitioned from teaching to fitness instruction to business school. Then he tells the story of surviving month-to-month when launching DEFINE and how he expanded the business into a global franchise, including how he survived COVID by pivoting into online services. Next, Hank talks about his decision to go back to school to get his Master’s degree in applied positive psychology and how it has influenced his worldview and business, with DEFINE shifting into a well-being hub with a mission to enrich its members’ lives. He also has some advice on how to incorporate positive psychology into your everyday life and how it can help athletes develop resiliency and focus on strengths rather than weaknesses, as well as how meditation and mindfulness can work in partnership to improve self-awareness and enable positivity. Laura then asks Hank about his partnership with Education Based Housing, a nonprofit working with cost-burdened households to provide access to quality housing, and Hank discusses his passion for creating circles of well-being within communities and how DEFINE will offer well-being services through this partnership. And finally, Hank offers his thoughts on what has made DEFINE so successful, pointing to its mission to offer a service that truly helps its communities, and gives some advice to current athletes and coaches, emphasizing the importance of focusing on personal strengths and creatively applying them in challenging situations.</p>\n<p>Hank’s story of determination, resiliency, and willingness to keep learning and developing will captivate and inspire athletes and non-athletes alike to focus on their strengths, keep a positive outlook, and never give up on their dreams.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>How Hank got into diving with lessons at Camp Longhorn</li>\n<li>Transitioning from school athlete to college athlete</li>\n<li>Hank’s back injury and how diving both caused it and kept it in check</li>\n<li>Moving on from diving to teaching sixth graders in the South Bronx</li>\n<li>How Hank followed his passion for movement and interest in health into teaching yoga and Pilates</li>\n<li>Going back to business school and figuring out his dream of opening his own studio</li>\n<li>Launching DEFINE and expanding into a franchise</li>\n<li>Dealing with the impact of COVID by pivoting to online</li>\n<li>Hank’s Master’s in applied positive psychology and how it transformed DEFINE into a well-being hub</li>\n<li>Hank’s advice on incorporating positive psychology in your life</li>\n<li>What Hank would change if he could go back in time with the knowledge he has now</li>\n<li>The importance of resiliency when a setback occurs</li>\n<li>Hank’s opinion on the benefits of mindfulness and meditation</li>\n<li>DEFINE’s partnership with Education Based Housing, a nonprofit working with cost-burdened households to provide access to quality housing</li>\n<li>What Hank believes has made DEFINE successful</li>\n<li>Hank’s advice for current athletes and coaches</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“Diving, it truly was a way of utilizing movement as a self-expression. And you know, the many lessons that all of us learned in diving, the overcoming fears, the setting goals and accomplishing them, the concept of resiliency, even during injuries, etc. It’s such a powerful, powerful sport.”</li>\n<li>“Being a student athlete, you are literally performing a job in some ways. You are studying for school, you’re going to school, you’re training first thing in the morning, you’re training in the evening, you’re eating, I mean, it’s very regimented. Right. And I know for a fact, it made me a much stronger, better person. But I remember that first year being like, oh my gosh, I don’t know if I can continue doing this.”</li>\n<li>“The good thing about the mindset that, really, work being physically hard created is that when we got to the end of the year, I actually really knew I deserved it. I was like, I’ve worked so hard, I deserve to do well at this NCAA championship. And so that worked, but at the same time, by the end of the year, I was a little burnt out physically, mentally, emotionally.”</li>\n<li>“It’s called spondylolisthesis. And you know, it’s manageable. A lot of people have to have fusions done. But that’s really how I started getting into the next phase of my life, which was really getting into yoga and Pilates to help to prevent to have to have the fusion.”</li>\n<li>“When I started thinking about the classes and the things that I really, really loved, it was centered around psychology, it was centered around education, it was around mindset. And so I applied for this program called Teach for America. And they placed me to teach sixth-graders in the South Bronx, and it was truly a life-transforming experience.”</li>\n<li>“I give all the respect in the world to schoolteachers. Any school has its challenges, any grade level has its challenges. And so working with the various teachers that were in our public school setting just gave me the most utmost respect for what school teachers do on a daily basis.”</li>\n<li>“I never really thought of myself as being, like, a fitness instructor as my goal in all of this, but I loved working with clients, I loved working with people. And that has been kind of the consistent theme for me throughout. And when you believe in a product or a service so much because of its own transformative benefits that you’ve received, it’s impossible to not want to share that, truly.”</li>\n<li>“My professor, within that same timeframe, said something that changed my life. He said, ‘You know what? Don’t take a job just because it’s available.’ He said, ‘Do something that will define your role in this world.’ And I, literally, the light bulb went off, the chills in my body. And I’ll be honest, because it’s a process of overcoming fear in many ways, just like diving, that I was like, I don’t know if I’m going to open up a studio, but if I do, I know I’m going to name it ‘Define.’”</li>\n<li>“There are also a lot of negatives, challenges, that can also happen because of the franchise model. And a lot of it is because the mindset of a franchisee is that they own a business, whereas really, they’re just licensing the name and the services of the business.”</li>\n<li>“Once COVID hit, it was a survival mindset and a little bit of a free-for-all. And truly, people felt like they had to do whatever they needed to do to make sure that they survived, and we really responded quickly by pivoting. Within just a few days, our entire business shifted online, we started Zoom classes, we had an on-demand platform.”</li>\n<li>“The concept is that if we’re just focusing on our weaknesses, well, that’s how we’re going to feel when we’re living our lives. Versus if we can put our energy and focus on our strengths, then it’s going to have that ability for us to find more of a state of flow, more of a state of ease and also be able to be more proficient.”</li>\n<li>“It’s not simply about just being focused on the good, right? It’s also coming up with a plan for when things don’t go the way you expected, how to kind of overcome that.”</li>\n<li>“What I ultimately realized is that what meditation is doing is it’s training us simply to become more aware. More aware of our internal dialogue, more aware of the stories we tell about other people or ourselves, more aware of truly how we feel being around certain people, or how we feel about, you know, certain activities that we do.”</li>\n<li>“I love the analogy for meditation where it’s like, you know, you can go a couple of days without showering and not a lot of people notice, but after a while, you know, people are gonna notice, right? And I feel the same way about my meditation. Like, I can go a couple days, and it’s not a big deal. But if I go for more than three, four, or five days, my attitude’s a little stinky.”</li>\n<li>“One of my huge passions is about supporting and providing and helping to create circles of, you know, well-being if you will, and support. I feel like the studio business, it caters to a very specific demographic, and that demographic is people who can afford to come and take those types of services. And there’s so much that could be done and said in our world that could help various people.”</li>\n<li>“Walking into the store of DEFINE, it needs to be an experience, and that experience should be, you know, welcoming, it should be truly nurturing in many ways, but at the same time pushing you and challenging you enough to get something out of it. So I think people come to us for that reason.”</li>\n<li>“It’s important that we focus on strengths. And as a mentor or as an athlete, it’s important for us to help discover that strength, whether it’s a parent role, or a mentor role, or a coaching role, helping to really look at the strength of the individual.”</li>\n<li>“Instead of using some of their weaknesses, which is very common in a challenging situation, we can now train ourselves to look at our strengths and use creative ways of applying that to our lives.”</li>\n</ul>\n<p>**<a href=\"https://kaatsu.com/\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global.**\n</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a> Website\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Hank’s Links:\n<a href=\"https://definebody.com/\" rel=\"nofollow\">DEFINE homepage</a>\n<a href=\"https://definelife.com/\" rel=\"nofollow\">DEFINELIFE homepage</a>\n<a href=\"https://www.instagram.com/define.henry/\" rel=\"nofollow\">Hank’s Instagram</a></p>",
  "itunes:title": "Define Your Role in the World with DEFINE Founder & CEO Hank Richardson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 58
}