{
  "itunes:episodeType": "full",
  "itunes:title": "The Beauty of Sleep (with Eileen Henry)",
  "title": "The Beauty of Sleep (with Eileen Henry)",
  "itunes:author": "JLML Press",
  "description": "<p>Sleep is an essential element of our happiness and well-being. If our child is not sleeping, then chances are good that we aren’t either. Many families are content with the sleep situations in their households, and more power to them. Others seek advice and solutions because they struggle night after night. Still others fear that making any kind of change in their approach could threaten their attachment bond and are resigned to waiting months, even years, for their children's sleep patterns to improve. They've been led to believe that this is the only natural, gentle, or respectful way. Sleep specialist Eileen Henry's perspective is neither \"cry it out\" nor \"wait it out,\" but a middle way that prioritizes attachment and is rooted in science and nature. \"We don't train children to sleep,” she says. “We create a physical and emotional environment that allows sleep to come naturally.\" </p><p>Visit Eileen's website at: http://compassionatesleepsolutions.com/</p><p>Thanks to Ritual Vitamins for sponsoring this episode. Step up your gut health with Ritual's new Synbiotic+ for 10% off during your first 3 months by going to www.Ritual.com/10RESPECT.</p><p>For more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble, and Apple Books. </p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "content:encoded": "<p>Sleep is an essential element of our happiness and well-being. If our child is not sleeping, then chances are good that we aren’t either. Many families are content with the sleep situations in their households, and more power to them. Others seek advice and solutions because they struggle night after night. Still others fear that making any kind of change in their approach could threaten their attachment bond and are resigned to waiting months, even years, for their children&#39;s sleep patterns to improve. They&#39;ve been led to believe that this is the only natural, gentle, or respectful way. Sleep specialist Eileen Henry&#39;s perspective is neither &#34;cry it out&#34; nor &#34;wait it out,&#34; but a middle way that prioritizes attachment and is rooted in science and nature. &#34;We don&#39;t train children to sleep,” she says. “We create a physical and emotional environment that allows sleep to come naturally.&#34; </p><p>Visit Eileen&#39;s website at: http://compassionatesleepsolutions.com/</p><p>Thanks to Ritual Vitamins for sponsoring this episode. Step up your gut health with Ritual&#39;s new Synbiotic&#43; for 10% off during your first 3 months by going to www.Ritual.com/10RESPECT.</p><p>For more advice on common parenting issues, please check out Janet&#39;s best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. Paperbacks and e-books are also available at Amazon, Google Play, Barnes &amp; Noble, and Apple Books. </p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "enclosure": "",
  "guid": "bec501a9-f992-4d85-89a4-7ba6540d6666",
  "link": "https://www.janetlansbury.com/2022/10/the-beauty-of-sleep-with-eileen-henry/",
  "pubDate": "Tue, 18 Oct 2022 09:30:00 &#43;0000",
  "itunes:duration": 2083,
  "itunes:explicit": "no"
}