{
  "title": "When the Voice of the Customer Actually Talks",
  "link": "http://rocketdatascience.org/?p=1622",
  "comments": "http://rocketdatascience.org/?p=1622#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Sun, 22 Aug 2021 23:18:37 +0000",
  "category": [
    "Analytics",
    "Artificial Intelligence",
    "Products",
    "Customer Experience"
  ],
  "guid": "http://rocketdatascience.org/?p=1622",
  "description": "For many years, organizations (mostly consumer-facing) have placed the &#8220;voice of the customer&#8221; (VoC) high on their priority list of top sources for customer intelligence. The goals of such activities are to improve customer service, customer interactions, customer&#160;engagement, and customer&#160;experience (CX) through just-in-time customer assistance, personalization, and loyalty-building activities. In recent years, even government agencies [&#8230;]",
  "content:encoded": "\n<p>For many years, organizations (mostly consumer-facing) have placed the &#8220;voice of the customer&#8221; (VoC) high on their priority list of top sources for customer intelligence. The goals of such activities are to improve customer service, customer interactions, customer&nbsp;engagement, and customer&nbsp;experience (CX) through just-in-time customer assistance, personalization, and loyalty-building activities. In recent years, even government agencies have increased their attention on Citizen Experience (CX) and Voice of the Citizen (VoC), to inform and guide their citizen services.</p>\n\n\n\n<p>CX has become increasingly data-informed and data-driven, with VoC data being one of the key data sources. Other data sources include purchase patterns, online reviews, online shopping behavior analytics, and call center analytics. As good as these data analytics have been, collecting data and then performing pattern-detection and pattern-recognition analytics can be taken so much further now with AI-enabled customer interactions.&nbsp;</p>\n\n\n\n<p>AI is great for pattern recognition, product and service recommendations, anomaly detection, next-best action and next-best decision recommendations, and providing an insights power-boost to all of those. AI can be considered as Accelerated, Actionable, Amplified, Assisted, Augmented, even Awesome Intelligence, both for the customer and for the call center staff.</p>\n\n\n\n<p>Consequently, VoC and AI have wonderfully come together in conversational AI applications, including chatbots. Chatbots can be deployed to answer FAQs, to direct calls to the right service representative, to detect customer sentiment, to monitor call center employee performance, to recall and recognize patterns in the customer&#8217;s prior history with the business, to confirm customer identity, to identify up-sell and cross-sell opportunities, to streamline data entry by automatically capturing intricate details of a customer&#8217;s preferences, concerns, requests, critical information, and callback expectations, and to detect when it&#8217;s time to direct the call to a human agent (the right human agent).</p>\n\n\n\n<p>In short, the VoC reaches its peak value when it captures the full depth and breadth of what the customer is talking about and what they are trying to communicate. AI-enabled chatbots are thus bringing great value and effectiveness in consumers&#8217; call center experiences.&nbsp;</p>\n\n\n\n<p>From the call center representative perspective, AI-enabled chatbots are a tremendous efficiency and effectiveness boost for these persons also. Many details of the initial customer interaction can be&nbsp;automatically&nbsp;captured, recorded, indexed, and made searchable even before the call is directed to the representative, increasing the likelihood that it is the right representative for that customer&#8217;s specific needs. Not only is the CX amplified, but so is the EX (Employee Experience). Surveys and reports have documented that the strong improvement in call center staff EX is a source of significant value to the entire organization.&nbsp;</p>\n\n\n\n<p>One dimension of this EX amplification that should not be overlooked is when advanced case management is required from a human call center agent. In cases like that, the agent is engaged in their best (most satisfying) capacity as the expert and most knowledgeable source to help the customer, in sharp contrast to other calls where they are engaged in answering the standard FAQs, or in quoting customer account information from a database that a chatbot could easily have retrieved, or in asking the customer to repeat the same information that the customer gave to a previous agent. Everybody wins when all those latter activities are handled swiftly, accurately, and non-redundantly prior to the person-to-person engagement that can then provide&nbsp;the best human touch in the entire caller experience.</p>\n\n\n\n<p>Chatbots employ a suite of data-driven technologies, including: machine learning (for pattern detection and recognition, sentiment and emotion detection), natural language processing (covering natural language understanding NLU and natural language generation NLG), voice assistants (for voice search and autonomous action-enablement), cloud computing (to activate actions, services, document creation and document processing), AI (for&nbsp;auto-transcribing conversations, creating real-time action lists, and adding information to appropriate fields automatically), and more.</p>\n\n\n\n<p>When the Voice of the Customer talks, the modern AI-powered Call Center listens and responds.&nbsp;</p>\n\n\n\n<p>Learn more about the modern Call Center and CX Reimagined at&nbsp;<a rel=\"noreferrer noopener\" href=\"https://five9cxsummit.com/insix\" target=\"_blank\">CX Summit 2021</a>, presented by&nbsp;<a rel=\"noreferrer noopener\" href=\"https://www.five9.com/\" target=\"_blank\">Five9</a>. The Summit&#8217;s 5 tracks and multiple sessions will focus on the transformation of the contact center through the evolution of digital channels, AI, Automation and Analytics. By applying the power of data and the cloud we can reimagine CX and realize results in a rapidly changing marketplace. At the Summit, you can connect and network with contact center professionals, ecosystem partners and peers, you can learn to optimize your&nbsp;<a rel=\"noreferrer noopener\" href=\"https://www.five9.com/\" target=\"_blank\">Five9&nbsp;</a>implementation to superpower your contact center, you can hear customer stories and product updates, and you can learn how Five9 can help you deliver a whole new level of customer service. Register here for&nbsp;<a rel=\"noreferrer noopener\" href=\"https://five9cxsummit.com/insix\" target=\"_blank\">CX Summit 2021</a>&nbsp;and see for yourself where the Reimagined becomes the Realized in CX:&nbsp;<a rel=\"noreferrer noopener\" href=\"https://five9cxsummit.com/insix\" target=\"_blank\">https://five9cxsummit.com/insix</a> </p>\n\n\n\n<p>Learn more about the Summit, some highlights and key takeaways, in my follow-up article &#8220;<a rel=\"noreferrer noopener\" href=\"http://rocketdatascience.org/?p=1628\" target=\"_blank\">EX is the New CX</a>.&#8221;</p>\n\n\n\n<p>Note: This article was sponsored. The opinions expressed here are my own and do not represent the opinions of any other person, company, or entity.</p>\n\n\n\n<p>#Five9CXSummit #CXNation</p>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1622",
  "slash:comments": 0
}