{
  "title": "Episode 102: &#8220;Twist and Shout&#8221; by the Isley Brothers",
  "link": "https://500songs.com/podcast/episode-102-twist-and-shout-by-the-isley-brothers/",
  "pubDate": "Mon, 26 Oct 2020 19:49:47 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-102-twist-and-shout-by-the-isley-brothers/",
  "description": "Episode one hundred and two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Twist and Shout\" by the Isley Brothers, and the early career of Bert Berns. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;<a href=\"https://www.patreon.com/posts/43182692\">on \"How Do You Do It?\" by Gerry and the Pacemakers.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, due to the number of songs by the Isleys.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nFor information about the Isley Brothers the main source was&nbsp; <a href=\"https://amzn.to/2YvkwOY\">Icons of R&B and Soul by Bob Gulla</a>.\n\nThe information about Bert Berns comes from <a href=\"https://amzn.to/3kyg4qH\"><em>Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues</em></a> by Joel Selvin.\n\nThere are many compilations of the public-domain recordings of the Isleys.<a href=\"https://amzn.to/2Yx7Ffe\">&nbsp;This one</a>&nbsp;seems the most complete.\n\n<a href=\"https://amzn.to/31Mr4JN\">This three-CD set,</a> though, is the best overview of the group's whole career.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to look at one of the great Brill Building songwriters, and at a song he wrote which became a classic both of soul and of rock music. We're going to look at how a novelty Latin song based around a dance craze was first taken up by one of the greatest soul groups of the sixties, and then reworked by the biggest British rock band of all time. We're going to look at \"Twist and Shout\" by the Isley Brothers.\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nWhen we left the Isley Brothers, they had just signed to Atlantic, and released several singles with Leiber and Stoller, records like \"Standing on the Dance Floor\" that were excellent R&B records, but which didn't sell:\n\n[Excerpt: The Isley Brothers, \"Standing on the Dance Floor\"]\n\nIn 1962 they were dropped by Atlantic and moved on to Wand Records, the third label started by Florence Greenberg, who had already started Tiara and Scepter. As with those labels, Luther Dixon was in charge of the music, and he produced their first single on the label, a relatively catchy dance song called \"The Snake\", which didn't catch on commercially:\n\n[Excerpt: The Isley Brothers, \"The Snake\"]\n\nWhile \"The Snake\" didn't sell, the Isley Brothers clearly had some commercial potential -- and indeed their earlier hit \"Shout\" had just recharted, after Joey Dee and the Starliters had a hit with a cover version of it. All that was needed was the right song, and they could be as big as Luther Dixon's other group, the Shirelles. And Dixon had just the song for them -- a song co-written by Burt Bacharach, and sung on the demo by a young singer called Dionne Warwick. Unfortunately, they spent almost all the session trying and failing to get the song down -- they just couldn't make it work -- and eventually they gave up on it, and Bacharach produced the song for Jerry Butler, the former lead singer of the Impressions, who had a top twenty hit with it:\n\n[Excerpt: Jerry Butler, \"Make it Easy on Yourself\"]\n\nSo they were stuck without a song to record -- and then Dixon's assistant on the session, Bert Berns, suggested that they record one of his songs -- one that had been a flop for another group the previous year.\n\nThe story of \"Twist and Shout\" actually starts with a group called the Five Pearls, who made their first record in 1954:\n\n[Excerpt: The Five Pearls, \"Please Let Me Know\"]\n\nThe Five Pearls recorded under various different names, and in various different combinations, for several different mid-sized record labels like Aladdin throughout the 1950s, but without much success -- the closest they came was when one of the members, Dave \"Baby\" Cortez, went solo and had a hit with \"The Happy Organ\" in 1959:\n\n[Excerpt: Dave \"Baby\" Cortez, \"The Happy Organ\"]\n\nBut in 1960 two members of the Pearls -- who used different names at different points of their career, but at this point were calling themselves Derek Ray and Guy Howard, signed to Atlantic as a new duo called The Top Notes. Their first single under this name, \"A Wonderful Time\", did no better than any of their other records had -- but by their third single, they were being produced by a new staff producer -- Phil Spector, who had started taking on production jobs that Leiber and Stoller weren't interested in doing themselves, like a remake of the old folk song \"Corrina, Corrina\", which had been an R&B hit for Big Joe Turner and which Spector produced for the country singer Ray Peterson:\n\n[Excerpt: Ray Peterson, \"Corrina, Corrina\"]\n\nBut soon after that, Spector had broken with Leiber and Stoller. Spector was given the opportunity to co-write songs for the new Elvis film, Blue Hawaii. But he was signed to a publishing contract with Leiber and Stoller's company, Trio Music, and they told Hill & Range that he could only do the songs if Trio got half the publishing, which Hill & Range refused -- there was apparently some talk of them going ahead anyway, but Hill & Range were scared of Trio's lawyer, one of the best in the entertainment industry. This wouldn't be the last time that Phil Spector and Lee Eastman ended up on the opposite sides of a disagreement.\n\nShortly after that, Spector's contract mysteriously went missing from Trio's office. Someone remembered that Spector happened to have a key to the office.\n\nBut by this point Spector had co-written or co-produced a fair few hits, and so he was taken on by Atlantic on his own merits, and so he and Jerry Wexler co-produced singles for the Top Notes, with arrangements by Teddy Randazzo, who we last heard of singing with accordion accompaniment in The Girl Can't Help It.\n\nThe first of these Top Notes singles, \"Hearts of Stone\", was an obvious attempt at a Ray Charles soundalike, with bits directly lifted both from \"What'd I Say\" and Charles' hit \"Sticks and Stones\":\n\n[Excerpt: The Top Notes, \"Hearts of Stone\"]\n\nBut the next Top Notes release was the song that would make them at least a footnote in music history. The writing credit on it was Bert Russell and Phil Medley, and while Medley would have little impact on the music world otherwise, the songwriter credited as Bert Russell is worth us looking at.\n\nHis actual name was Bertrand Russell Berns -- he had been named after the famous philosopher -- and he was a man on a mission. He was already thirty-one, and he knew he didn't have long to live -- he'd had rheumatic fever as a child and it had given him an incurable heart condition. He had no idea how long he had, but he knew he wasn't going to live to a ripe old age. And he'd wasted his twenties already -- he'd tried various ways to get into showbiz, with no success. He'd tried a comedy double act, and at one point had moved to Cuba, where he'd tried to buy a nightclub but backed out when he'd realised it was actually a brothel.\n\nOn his return to the US, he'd started working as a songwriter in the Brill Building. In the late fifties he worked for a while with the rockabilly singer Ersel Hickey -- no relation to me -- who had a minor hit with \"Bluebirds Over the Mountain\":\n\n[Excerpt: Ersel Hickey, \"Bluebirds Over the Mountain\"]\n\nBerns was proud just to know Hickey, though, because \"Bluebirds Over the Mountain\" had been covered by Ritchie Valens, and \"La Bamba\" was Berns' favourite record -- one he would turn to for inspiration throughout his career. He loved Latin music generally -- it had been one of the reasons he'd moved to Cuba -- but that song in particular was endlessly fascinating to him.\n\nHe'd written and produced a handful of recordings in the early fifties, before his Cuba trip, but it was on his return that he started to be properly productive. He'd started producing novelty records with a friend called Bill Giant, like a song based on the Gettysburg Address:\n\n[Excerpt: Bert and Bill Giant, \"The Gettysburg Address\"]\n\nOr a solo record about the Alamo -- at the time Berns seemed to think that songs about American history were going to be the next big thing:\n\n[Excerpt: Bert Berns, \"The Legend of the Alamo\"]\n\nHe'd co-written a song called \"A Little Bird Told Me\" with Ersel Hickey -- not the same as the song of the same name we talked about a year or so ago -- and it was recorded by LaVern Baker:\n\n[Excerpt: LaVern Baker, \"A Little Bird Told Me\"]\n\nAnd he and Medley co-wrote \"Push Push\" for Austin Taylor:\n\n[Excerpt: Austin Taylor, \"Push Push\"]\n\nBut he was still basically a nobody in the music industry in 1961. But Jerry Wexler had produced that LaVern Baker record of \"A Little Bird Told Me\", and he liked Berns, and so he accepted a Berns and Medley cowrite for the next Top Notes session.\n\nThe song in question had started out as one called \"Shake it Up Baby\", based very firmly around the chords and melody of \"La Bamba\", but reimagined with the Afro-Cuban rhythms that Berns loved so much -- and then further reworked to reference the Twist dance craze. Berns was sure it was a hit -- it was as catchy as anything he could write, and full of hooks.\n\nBerns was allowed into the studio to watch the recording, which was produced by Wexler and Spector, but he wasn't allowed to get involved -- and he watched with horror as Spector flattened the rhythm and totally rewrote the middle section. Spector also added in backing vocals based on the recent hit \"Handy Man\" -- a \"come-a-come-a\" vocal line that didn't really fit the song. The result was actually quite a decent record, but despite being performed by all the usual Atlantic session players like King Curtis, and having the Cookies do their usual sterling job on backing vocals, \"Twist and Shout\" by the Top Notes was a massive flop, and Berns could tell it would be even during the session:\n\n[Excerpt: The Top Notes, \"Twist and Shout\"]\n\nThe Top Notes soon split up, making no real further mark on the industry -- when Guy Howard died in 1977, he had reverted to his original name Howard Guyton, and the Top Notes were so obscure that his obituaries focused on his time in one of the later touring versions of the Platters.\n\nBerns was furious at the way that Spector had wrecked his song, and decided that he was going to have to start producing his own songs, so they couldn't be messed up. But that was put on the back burner for a while, as he started having success. His first chart success as a songwriter was with a song he wrote for a minor group called the Jarmels. By this time, the Drifters were having a lot of success with their use of the same Latin and Caribbean rhythms that Berns liked, and so he wrote \"A Little Bit of Soap\" in the Drifters' style, and it made the top twenty:\n\n[Excerpt: The Jarmels, \"A Little Bit of Soap\"]\n\nHe also started making non-novelty records of his own. Luther Dixon at Wand Records heard one of Berns' demos, and decided he should be singing, not just writing songs. Berns was signed to Wand Records as a solo artist under the name \"Russell Byrd\", and his first single for the label was produced by Dixon. The song itself is structurally a bit of a mess -- Berns seems to have put together several hooks (including some from other songs) but not thought properly about how to link them together, and so it meanders a bit -- but you can definitely see a family resemblance to \"Twist and Shout\" in the melody, and in Carole King's string arrangement:\n\n[Excerpt: Russell Byrd, \"You'd Better Come Home\"]\n\nThat made the top fifty, and got Berns a spot on American Bandstand, but it was still not the breakout success that Berns needed.\n\nWhile Berns had been annoyed at Spector for the way he'd messed up \"Twist and Shout\", he clearly wasn't so upset with him that they couldn't work together, because the second Russell Byrd session, another Drifters knockoff, was produced by Spector:\n\n[Excerpt: Russell Byrd, \"Nights of Mexico\"]\n\nBut Berns was still looking to produce his own material. He got the chance when Jerry Wexler called him up.\n\nAtlantic were having problems -- while they had big vocal groups like the Drifters and the Coasters, they'd just lost their two biggest male solo vocalists, as Bobby Darin and Ray Charles had moved on to other labels. They had recently signed a gospel singer called Solomon Burke, and he'd had a minor hit with a version of an old country song, \"Just Out of Reach\":\n\n[Excerpt: Solomon Burke, \"Just Out of Reach\"]\n\nBurke was the closest thing to a male solo star they now had, and clearly a major talent, but he was also a very opinionated person, and not easy to get on with. His grandmother had had a dream, twelve years before he was born, in which she believed God had told her of her future grandson's importance. She'd founded a church, Solomon's Temple: The House Of God For All People, in anticipation of his birth, and he'd started preaching there from the age of seven as the church's spiritual leader. Rather unsurprisingly, he had rather a large ego, and that ego wasn't made any smaller by the fact that he was clearly a very talented singer.\n\nHis strong opinions included things like how his music was to be marketed. He was fine with singing pop songs, rather than the gospel music he'd started out in, as he needed the money -- he had eight kids, and as well as being a singer and priest, he was also a mortician, and had a side job shovelling snow for four dollars an hour -- but he wasn't keen on being marketed as \"rhythm and blues\" -- rhythm and blues was dirty music, not respectable. His music needed to be called something else. After some discussion with Atlantic, everyone agreed on a new label that would be acceptable to his church, one that had previously been applied to a type of mostly-instrumental jazz influenced by Black gospel music, but from this point on would be applied almost exclusively to Black gospel-influenced pop music in the lineage of Ray Charles and Clyde McPhatter. Burke was not singing rhythm and blues, but soul music.\n\nWexler had produced Burke's first sessions, but he always thought he worked better when he had a co-producer, and he liked a song Berns had written, \"Cry to Me\", another of his Drifters soundalikes. So he asked Berns into the studio to produce Burke singing that song. The two didn't get on very well at first -- Burke's original comment on meeting Berns was \"Who is this Paddy mother--\" except he included the expletive that my general audience content rating prevents me from saying there -- but it's hard to argue with the results, one of the great soul records of all time:\n\n[Excerpt: Solomon Burke, \"Cry to Me\"]\n\nThat made the top five on the R&B chart, and started a run of hits for Burke, whose records would continue to be produced by the team of Berns and Wexler for the next several years.\n\nAfter this initial production success, Berns started producing many other records, most of them again unsuccessful, like a cheap Twist album to cash in on the resurgent Twist craze. And he was still working with Wand records, which is what led to him being invited to assist Dixon with the Isley Brothers session for \"Make it Easy on Yourself\".\n\nWhen they couldn't get a take done for that track, Berns suggested that they make an attempt at \"Twist and Shout\", which he still thought had the potential to be a hit, and which would be perfectly suited to the Isley Brothers -- after all, their one hit was \"Shout!\", so \"Twist and Shout\" would be the perfect way for them to get some relevance.\n\nThe brothers hated the song, and they didn't want to record any Twist material at all -- apparently they were so vehemently against recording the song that furniture got smashed in the argument over it. But Luther Dixon insisted that they do it, and so they reluctantly recorded \"Twist and Shout\", and did it the way Bert Berns had originally envisioned it, Latin feel and all:\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nIt's a testament to Ronald Isley's talent, in particular, that he sounds utterly committed on the record despite it being something he had no wish to take part in at all.\n\nThe record made the top twenty on the pop chart and number two in R&B, becoming the Isleys' first real mainstream hit. It might have even done better, but for an unfortunate coincidence -- \"Do You Love Me\" by the Contours, a song written by Berry Gordy, was released on one of the Motown labels a couple of weeks later, and had a very similar rising vocal hook:\n\n[Excerpt: The Contours, \"Do You Love Me\"]\n\n\"Do You Love Me\" was a bigger hit, making number three in the pop charts and number one R&B, but it's hard not to think that the two records being so similar must have eaten into the market for both records.\n\nBut either way, \"Twist and Shout\" was a proper big hit for the Isleys, and one that established them as real stars, and Berns became their regular producer for a while. Unfortunately, both they and Berns floundered about what to do for a follow-up. The first attempt was one of those strange records that tries to mash up bits of as many recent hits as possible, and seems to have been inspired by Jan & Dean's then-recent hit with a revival of the 1946 song \"Linda\":\n\n[Excerpt: Jan and Dean, \"Linda\"]\n\nThat song was, coincidentally, written about the daughter of Lee Eastman, the lawyer we mentioned earlier. \"Twistin' With Linda\", the brothers' response, took the character from that song, and added the melody to the recent novelty hit \"Hully Gully\", lyrical references to \"Twist and Shout\" and Chubby Checker's Twist hits, and in the tag Ronald Isley sings bits of \"Shout\", \"Don't You Just Know It\", \"Duke of Earl\", and for some reason \"I'm Popeye the Sailor Man\":\n\n[Excerpt: The Isley Brothers, \"Twistin' With Linda\"]\n\nThat only made the lower reaches of the charts. Their next single was \"Nobody But Me\", which didn't make the hot one hundred, but would later be covered by the Human Beinz, making the top ten in their version in 1968:\n\n[Excerpt: The Isley Brothers, \"Nobody But Me\"]\n\nWith Berns still producing, the Isleys moved over to United Artists records, but within a year of \"Twist and Shout\", they were reduced to remaking it as \"Surf and Shout\", with lyrics referencing another Jan and Dean hit, \"Surf City\":\n\n[Excerpt: The Isley Brothers, \"Surf and Shout\"]\n\nOddly, while they were doing this, Berns was producing them on much more interesting material for album tracks, but for some reason, even as Berns was also by now producing regular hits for Solomon Burke, Ben E King and the Drifters, the Isleys were stuck trying to jump on whatever the latest bandwagon was in an attempt at commercial success. Even when they were writing songs that would become hits, they were having no success. The last of the songs that Berns produced for them was another Isleys original, \"Who's That Lady?\":\n\n[Excerpt: The Isley Brothers, \"Who's That Lady?\"]\n\nThat would become one of the group's biggest hits, but not until they remade it nine years later. It was only two years since \"Twist and Shout\", but the Isley Brothers were commercially dead.\n\nBut the success of \"Twist and Shout\" -- and their songwriting royalties from \"Shout\" -- gave them the financial cushion to move to comparatively better surroundings -- and to start their own record label. They moved to Teaneck, New Jersey, and named their new label T-Neck in its honour. They also had one of the best live bands in the US at the time, and the first single on T-Neck, \"Testify\", produced by the brothers themselves, highlighted their new guitar player, Jimmy James:\n\n[Excerpt: The Isley Brothers, \"Testify\"]\n\nBut even while he was employed by the Isleys, Jimmy James was playing on other records that were doing better, like Don Covay's big hit \"Mercy, Mercy\":\n\n[Excerpt: Don Covay and the Goodtimers, \"Mercy, Mercy\"]\n\nAnd he soon left the Isleys, going on first to tour with a minor soul artist supporting Sam Cooke and Jackie Wilson, and then to join Little Richard's band, playing on Richard's classic soul ballad \"I Don't Know What You've Got But It's Got Me\", also written by Don Covay:\n\n[Excerpt: Little Richard, \"I Don't Know What You've Got But It's Got Me\"]\n\nWe'll be picking up the story of Jimmy James in a couple of months' time, by which point he will have reverted to his birth name and started performing as Jimi Hendrix.\n\nBut for the moment, this is where we leave Hendrix and the Isley Brothers, but they will both, of course, be turning up again in the story. But of course, that isn't all there is to say about \"Twist and Shout\", because the most famous version of the song isn't the Isleys'. While the Beatles' first single had been only a minor hit, their second, \"Please Please Me\", went to number one or two in the &nbsp;UK charts, depending on which chart you look at, and they quickly recorded a follow-up album, cutting ten songs in one day to add to their singles to make a fourteen-track album. Most of the songs they performed that day were cover versions that were part of their live act -- versions of songs by Arthur Alexander, the Cookies, and the Shirelles, among others.\n\nJohn Lennon had a bad cold that day, and so they saved the band's live showstopper til last, because they knew that it would tear his throat up. Their version of \"Twist and Shout\" was only recorded in one take -- Lennon's voice didn't hold up enough for a second -- but is an undoubted highlight of the album:\n\n[Excerpt: The Beatles, \"Twist and Shout\"]\n\nSuddenly Bert Berns had a whole new market to work in. And so when we next look at Bert Berns, he will be working with British beat groups, and starting some of the longest-lasting careers in British R&B.",
  "itunes:subtitle": "Episode one hundred and two of A History of Rock Music in Five Hundred Songs looks at Twist and Shout by the Isley Brothers, and the early career of Bert Berns. Click the full post to read liner notes, links to more information, and a transcript of the e",
  "itunes:keywords": "Atlantic Records,Bert Berns,Brill Building,Burt Bacharach,Carole King,Don Covay,Ersel Hickey,Florence Greenberg,gospel,Hill and Range publishing,Jan and Dean,Jerry Wexler,Jimi Hendrix,John Lennon,LaVern Baker,Lee Eastman,Leiber and Stoller,Little Richard,Luther Dixon,Phil Spector,Solomon Burke,soul,Teddy Randazzo,The Beatles,The Isley Brothers,The Top Notes,the Twist,Wand Records",
  "itunes:episodeType": "full",
  "itunes:episode": 102,
  "content:encoded": "Episode one hundred and two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Twist and Shout\" by the Isley Brothers, and the early career of Bert Berns. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;<a href=\"https://www.patreon.com/posts/43182692\">on \"How Do You Do It?\" by Gerry and the Pacemakers.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Resources</strong>\n\nNo Mixcloud this week, due to the number of songs by the Isleys.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nFor information about the Isley Brothers the main source was&nbsp; <a href=\"https://amzn.to/2YvkwOY\">Icons of R&B and Soul by Bob Gulla</a>.\n\nThe information about Bert Berns comes from <a href=\"https://amzn.to/3kyg4qH\"><em>Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues</em></a> by Joel Selvin.\n\nThere are many compilations of the public-domain recordings of the Isleys.<a href=\"https://amzn.to/2Yx7Ffe\">&nbsp;This one</a>&nbsp;seems the most complete.\n\n<a href=\"https://amzn.to/31Mr4JN\">This three-CD set,</a> though, is the best overview of the group's whole career.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday we're going to look at one of the great Brill Building songwriters, and at a song he wrote which became a classic both of soul and of rock music. We're going to look at how a novelty Latin song based around a dance craze was first taken up by one of the greatest soul groups of the sixties, and then reworked by the biggest British rock band of all time. We're going to look at \"Twist and Shout\" by the Isley Brothers.\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nWhen we left the Isley Brothers, they had just signed to Atlantic, and released several singles with Leiber and Stoller, records like \"Standing on the Dance Floor\" that were excellent R&B records, but which didn't sell:\n\n[Excerpt: The Isley Brothers, \"Standing on the Dance Floor\"]\n\nIn 1962 they were dropped by Atlantic and moved on to Wand Records, the third label started by Florence Greenberg, who had already started Tiara and Scepter. As with those labels, Luther Dixon was in charge of the music, and he produced their first single on the label, a relatively catchy dance song called \"The Snake\", which didn't catch on commercially:\n\n[Excerpt: The Isley Brothers, \"The Snake\"]\n\nWhile \"The Snake\" didn't sell, the Isley Brothers clearly had some commercial potential -- and indeed their earlier hit \"Shout\" had just recharted, after Joey Dee and the Starliters had a hit with a cover version of it. All that was needed was the right song, and they could be as big as Luther Dixon's other group, the Shirelles. And Dixon had just the song for them -- a song co-written by Burt Bacharach, and sung on the demo by a young singer called Dionne Warwick. Unfortunately, they spent almost all the session trying and failing to get the song down -- they just couldn't make it work -- and eventually they gave up on it, and Bacharach produced the song for Jerry Butler, the former lead singer of the Impressions, who had a top twenty hit with it:\n\n[Excerpt: Jerry Butler, \"Make it Easy on Yourself\"]\n\nSo they were stuck without a song to record -- and then Dixon's assistant on the session, Bert Berns, suggested that they record one of his songs -- one that had been a flop for another group the previous year.\n\nThe story of \"Twist and Shout\" actually starts with a group called the Five Pearls, who made their first record in 1954:\n\n[Excerpt: The Five Pearls, \"Please Let Me Know\"]\n\nThe Five Pearls recorded under various different names, and in various different combinations, for several different mid-sized record labels like Aladdin throughout the 1950s, but without much success -- the closest they came was when one of the members, Dave \"Baby\" Cortez, went solo and had a hit with \"The Happy Organ\" in 1959:\n\n[Excerpt: Dave \"Baby\" Cortez, \"The Happy Organ\"]\n\nBut in 1960 two members of the Pearls -- who used different names at different points of their career, but at this point were calling themselves Derek Ray and Guy Howard, signed to Atlantic as a new duo called The Top Notes. Their first single under this name, \"A Wonderful Time\", did no better than any of their other records had -- but by their third single, they were being produced by a new staff producer -- Phil Spector, who had started taking on production jobs that Leiber and Stoller weren't interested in doing themselves, like a remake of the old folk song \"Corrina, Corrina\", which had been an R&B hit for Big Joe Turner and which Spector produced for the country singer Ray Peterson:\n\n[Excerpt: Ray Peterson, \"Corrina, Corrina\"]\n\nBut soon after that, Spector had broken with Leiber and Stoller. Spector was given the opportunity to co-write songs for the new Elvis film, Blue Hawaii. But he was signed to a publishing contract with Leiber and Stoller's company, Trio Music, and they told Hill & Range that he could only do the songs if Trio got half the publishing, which Hill & Range refused -- there was apparently some talk of them going ahead anyway, but Hill & Range were scared of Trio's lawyer, one of the best in the entertainment industry. This wouldn't be the last time that Phil Spector and Lee Eastman ended up on the opposite sides of a disagreement.\n\nShortly after that, Spector's contract mysteriously went missing from Trio's office. Someone remembered that Spector happened to have a key to the office.\n\nBut by this point Spector had co-written or co-produced a fair few hits, and so he was taken on by Atlantic on his own merits, and so he and Jerry Wexler co-produced singles for the Top Notes, with arrangements by Teddy Randazzo, who we last heard of singing with accordion accompaniment in The Girl Can't Help It.\n\nThe first of these Top Notes singles, \"Hearts of Stone\", was an obvious attempt at a Ray Charles soundalike, with bits directly lifted both from \"What'd I Say\" and Charles' hit \"Sticks and Stones\":\n\n[Excerpt: The Top Notes, \"Hearts of Stone\"]\n\nBut the next Top Notes release was the song that would make them at least a footnote in music history. The writing credit on it was Bert Russell and Phil Medley, and while Medley would have little impact on the music world otherwise, the songwriter credited as Bert Russell is worth us looking at.\n\nHis actual name was Bertrand Russell Berns -- he had been named after the famous philosopher -- and he was a man on a mission. He was already thirty-one, and he knew he didn't have long to live -- he'd had rheumatic fever as a child and it had given him an incurable heart condition. He had no idea how long he had, but he knew he wasn't going to live to a ripe old age. And he'd wasted his twenties already -- he'd tried various ways to get into showbiz, with no success. He'd tried a comedy double act, and at one point had moved to Cuba, where he'd tried to buy a nightclub but backed out when he'd realised it was actually a brothel.\n\nOn his return to the US, he'd started working as a songwriter in the Brill Building. In the late fifties he worked for a while with the rockabilly singer Ersel Hickey -- no relation to me -- who had a minor hit with \"Bluebirds Over the Mountain\":\n\n[Excerpt: Ersel Hickey, \"Bluebirds Over the Mountain\"]\n\nBerns was proud just to know Hickey, though, because \"Bluebirds Over the Mountain\" had been covered by Ritchie Valens, and \"La Bamba\" was Berns' favourite record -- one he would turn to for inspiration throughout his career. He loved Latin music generally -- it had been one of the reasons he'd moved to Cuba -- but that song in particular was endlessly fascinating to him.\n\nHe'd written and produced a handful of recordings in the early fifties, before his Cuba trip, but it was on his return that he started to be properly productive. He'd started producing novelty records with a friend called Bill Giant, like a song based on the Gettysburg Address:\n\n[Excerpt: Bert and Bill Giant, \"The Gettysburg Address\"]\n\nOr a solo record about the Alamo -- at the time Berns seemed to think that songs about American history were going to be the next big thing:\n\n[Excerpt: Bert Berns, \"The Legend of the Alamo\"]\n\nHe'd co-written a song called \"A Little Bird Told Me\" with Ersel Hickey -- not the same as the song of the same name we talked about a year or so ago -- and it was recorded by LaVern Baker:\n\n[Excerpt: LaVern Baker, \"A Little Bird Told Me\"]\n\nAnd he and Medley co-wrote \"Push Push\" for Austin Taylor:\n\n[Excerpt: Austin Taylor, \"Push Push\"]\n\nBut he was still basically a nobody in the music industry in 1961. But Jerry Wexler had produced that LaVern Baker record of \"A Little Bird Told Me\", and he liked Berns, and so he accepted a Berns and Medley cowrite for the next Top Notes session.\n\nThe song in question had started out as one called \"Shake it Up Baby\", based very firmly around the chords and melody of \"La Bamba\", but reimagined with the Afro-Cuban rhythms that Berns loved so much -- and then further reworked to reference the Twist dance craze. Berns was sure it was a hit -- it was as catchy as anything he could write, and full of hooks.\n\nBerns was allowed into the studio to watch the recording, which was produced by Wexler and Spector, but he wasn't allowed to get involved -- and he watched with horror as Spector flattened the rhythm and totally rewrote the middle section. Spector also added in backing vocals based on the recent hit \"Handy Man\" -- a \"come-a-come-a\" vocal line that didn't really fit the song. The result was actually quite a decent record, but despite being performed by all the usual Atlantic session players like King Curtis, and having the Cookies do their usual sterling job on backing vocals, \"Twist and Shout\" by the Top Notes was a massive flop, and Berns could tell it would be even during the session:\n\n[Excerpt: The Top Notes, \"Twist and Shout\"]\n\nThe Top Notes soon split up, making no real further mark on the industry -- when Guy Howard died in 1977, he had reverted to his original name Howard Guyton, and the Top Notes were so obscure that his obituaries focused on his time in one of the later touring versions of the Platters.\n\nBerns was furious at the way that Spector had wrecked his song, and decided that he was going to have to start producing his own songs, so they couldn't be messed up. But that was put on the back burner for a while, as he started having success. His first chart success as a songwriter was with a song he wrote for a minor group called the Jarmels. By this time, the Drifters were having a lot of success with their use of the same Latin and Caribbean rhythms that Berns liked, and so he wrote \"A Little Bit of Soap\" in the Drifters' style, and it made the top twenty:\n\n[Excerpt: The Jarmels, \"A Little Bit of Soap\"]\n\nHe also started making non-novelty records of his own. Luther Dixon at Wand Records heard one of Berns' demos, and decided he should be singing, not just writing songs. Berns was signed to Wand Records as a solo artist under the name \"Russell Byrd\", and his first single for the label was produced by Dixon. The song itself is structurally a bit of a mess -- Berns seems to have put together several hooks (including some from other songs) but not thought properly about how to link them together, and so it meanders a bit -- but you can definitely see a family resemblance to \"Twist and Shout\" in the melody, and in Carole King's string arrangement:\n\n[Excerpt: Russell Byrd, \"You'd Better Come Home\"]\n\nThat made the top fifty, and got Berns a spot on American Bandstand, but it was still not the breakout success that Berns needed.\n\nWhile Berns had been annoyed at Spector for the way he'd messed up \"Twist and Shout\", he clearly wasn't so upset with him that they couldn't work together, because the second Russell Byrd session, another Drifters knockoff, was produced by Spector:\n\n[Excerpt: Russell Byrd, \"Nights of Mexico\"]\n\nBut Berns was still looking to produce his own material. He got the chance when Jerry Wexler called him up.\n\nAtlantic were having problems -- while they had big vocal groups like the Drifters and the Coasters, they'd just lost their two biggest male solo vocalists, as Bobby Darin and Ray Charles had moved on to other labels. They had recently signed a gospel singer called Solomon Burke, and he'd had a minor hit with a version of an old country song, \"Just Out of Reach\":\n\n[Excerpt: Solomon Burke, \"Just Out of Reach\"]\n\nBurke was the closest thing to a male solo star they now had, and clearly a major talent, but he was also a very opinionated person, and not easy to get on with. His grandmother had had a dream, twelve years before he was born, in which she believed God had told her of her future grandson's importance. She'd founded a church, Solomon's Temple: The House Of God For All People, in anticipation of his birth, and he'd started preaching there from the age of seven as the church's spiritual leader. Rather unsurprisingly, he had rather a large ego, and that ego wasn't made any smaller by the fact that he was clearly a very talented singer.\n\nHis strong opinions included things like how his music was to be marketed. He was fine with singing pop songs, rather than the gospel music he'd started out in, as he needed the money -- he had eight kids, and as well as being a singer and priest, he was also a mortician, and had a side job shovelling snow for four dollars an hour -- but he wasn't keen on being marketed as \"rhythm and blues\" -- rhythm and blues was dirty music, not respectable. His music needed to be called something else. After some discussion with Atlantic, everyone agreed on a new label that would be acceptable to his church, one that had previously been applied to a type of mostly-instrumental jazz influenced by Black gospel music, but from this point on would be applied almost exclusively to Black gospel-influenced pop music in the lineage of Ray Charles and Clyde McPhatter. Burke was not singing rhythm and blues, but soul music.\n\nWexler had produced Burke's first sessions, but he always thought he worked better when he had a co-producer, and he liked a song Berns had written, \"Cry to Me\", another of his Drifters soundalikes. So he asked Berns into the studio to produce Burke singing that song. The two didn't get on very well at first -- Burke's original comment on meeting Berns was \"Who is this Paddy mother--\" except he included the expletive that my general audience content rating prevents me from saying there -- but it's hard to argue with the results, one of the great soul records of all time:\n\n[Excerpt: Solomon Burke, \"Cry to Me\"]\n\nThat made the top five on the R&B chart, and started a run of hits for Burke, whose records would continue to be produced by the team of Berns and Wexler for the next several years.\n\nAfter this initial production success, Berns started producing many other records, most of them again unsuccessful, like a cheap Twist album to cash in on the resurgent Twist craze. And he was still working with Wand records, which is what led to him being invited to assist Dixon with the Isley Brothers session for \"Make it Easy on Yourself\".\n\nWhen they couldn't get a take done for that track, Berns suggested that they make an attempt at \"Twist and Shout\", which he still thought had the potential to be a hit, and which would be perfectly suited to the Isley Brothers -- after all, their one hit was \"Shout!\", so \"Twist and Shout\" would be the perfect way for them to get some relevance.\n\nThe brothers hated the song, and they didn't want to record any Twist material at all -- apparently they were so vehemently against recording the song that furniture got smashed in the argument over it. But Luther Dixon insisted that they do it, and so they reluctantly recorded \"Twist and Shout\", and did it the way Bert Berns had originally envisioned it, Latin feel and all:\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nIt's a testament to Ronald Isley's talent, in particular, that he sounds utterly committed on the record despite it being something he had no wish to take part in at all.\n\nThe record made the top twenty on the pop chart and number two in R&B, becoming the Isleys' first real mainstream hit. It might have even done better, but for an unfortunate coincidence -- \"Do You Love Me\" by the Contours, a song written by Berry Gordy, was released on one of the Motown labels a couple of weeks later, and had a very similar rising vocal hook:\n\n[Excerpt: The Contours, \"Do You Love Me\"]\n\n\"Do You Love Me\" was a bigger hit, making number three in the pop charts and number one R&B, but it's hard not to think that the two records being so similar must have eaten into the market for both records.\n\nBut either way, \"Twist and Shout\" was a proper big hit for the Isleys, and one that established them as real stars, and Berns became their regular producer for a while. Unfortunately, both they and Berns floundered about what to do for a follow-up. The first attempt was one of those strange records that tries to mash up bits of as many recent hits as possible, and seems to have been inspired by Jan & Dean's then-recent hit with a revival of the 1946 song \"Linda\":\n\n[Excerpt: Jan and Dean, \"Linda\"]\n\nThat song was, coincidentally, written about the daughter of Lee Eastman, the lawyer we mentioned earlier. \"Twistin' With Linda\", the brothers' response, took the character from that song, and added the melody to the recent novelty hit \"Hully Gully\", lyrical references to \"Twist and Shout\" and Chubby Checker's Twist hits, and in the tag Ronald Isley sings bits of \"Shout\", \"Don't You Just Know It\", \"Duke of Earl\", and for some reason \"I'm Popeye the Sailor Man\":\n\n[Excerpt: The Isley Brothers, \"Twistin' With Linda\"]\n\nThat only made the lower reaches of the charts. Their next single was \"Nobody But Me\", which didn't make the hot one hundred, but would later be covered by the Human Beinz, making the top ten in their version in 1968:\n\n[Excerpt: The Isley Brothers, \"Nobody But Me\"]\n\nWith Berns still producing, the Isleys moved over to United Artists records, but within a year of \"Twist and Shout\", they were reduced to remaking it as \"Surf and Shout\", with lyrics referencing another Jan and Dean hit, \"Surf City\":\n\n[Excerpt: The Isley Brothers, \"Surf and Shout\"]\n\nOddly, while they were doing this, Berns was producing them on much more interesting material for album tracks, but for some reason, even as Berns was also by now producing regular hits for Solomon Burke, Ben E King and the Drifters, the Isleys were stuck trying to jump on whatever the latest bandwagon was in an attempt at commercial success. Even when they were writing songs that would become hits, they were having no success. The last of the songs that Berns produced for them was another Isleys original, \"Who's That Lady?\":\n\n[Excerpt: The Isley Brothers, \"Who's That Lady?\"]\n\nThat would become one of the group's biggest hits, but not until they remade it nine years later. It was only two years since \"Twist and Shout\", but the Isley Brothers were commercially dead.\n\nBut the success of \"Twist and Shout\" -- and their songwriting royalties from \"Shout\" -- gave them the financial cushion to move to comparatively better surroundings -- and to start their own record label. They moved to Teaneck, New Jersey, and named their new label T-Neck in its honour. They also had one of the best live bands in the US at the time, and the first single on T-Neck, \"Testify\", produced by the brothers themselves, highlighted their new guitar player, Jimmy James:\n\n[Excerpt: The Isley Brothers, \"Testify\"]\n\nBut even while he was employed by the Isleys, Jimmy James was playing on other records that were doing better, like Don Covay's big hit \"Mercy, Mercy\":\n\n[Excerpt: Don Covay and the Goodtimers, \"Mercy, Mercy\"]\n\nAnd he soon left the Isleys, going on first to tour with a minor soul artist supporting Sam Cooke and Jackie Wilson, and then to join Little Richard's band, playing on Richard's classic soul ballad \"I Don't Know What You've Got But It's Got Me\", also written by Don Covay:\n\n[Excerpt: Little Richard, \"I Don't Know What You've Got But It's Got Me\"]\n\nWe'll be picking up the story of Jimmy James in a couple of months' time, by which point he will have reverted to his birth name and started performing as Jimi Hendrix.\n\nBut for the moment, this is where we leave Hendrix and the Isley Brothers, but they will both, of course, be turning up again in the story. But of course, that isn't all there is to say about \"Twist and Shout\", because the most famous version of the song isn't the Isleys'. While the Beatles' first single had been only a minor hit, their second, \"Please Please Me\", went to number one or two in the &nbsp;UK charts, depending on which chart you look at, and they quickly recorded a follow-up album, cutting ten songs in one day to add to their singles to make a fourteen-track album. Most of the songs they performed that day were cover versions that were part of their live act -- versions of songs by Arthur Alexander, the Cookies, and the Shirelles, among others.\n\nJohn Lennon had a bad cold that day, and so they saved the band's live showstopper til last, because they knew that it would tear his throat up. Their version of \"Twist and Shout\" was only recorded in one take -- Lennon's voice didn't hold up enough for a second -- but is an undoubted highlight of the album:\n\n[Excerpt: The Beatles, \"Twist and Shout\"]\n\nSuddenly Bert Berns had a whole new market to work in. And so when we next look at Bert Berns, he will be working with British beat groups, and starting some of the longest-lasting careers in British R&B.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and two of A History of Rock Music in Five Hundred Songs looks at \"Twist and Shout\" by the Isley Brothers, and the early career of Bert Berns. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"How Do You Do It?\" by Gerry and the Pacemakers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nResources\n\nNo Mixcloud this week, due to the number of songs by the Isleys.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nFor information about the Isley Brothers the main source was&nbsp; Icons of R&B and Soul by Bob Gulla.\n\nThe information about Bert Berns comes from Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues by Joel Selvin.\n\nThere are many compilations of the public-domain recordings of the Isleys.&nbsp;This one&nbsp;seems the most complete.\n\nThis three-CD set, though, is the best overview of the group's whole career.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nToday we're going to look at one of the great Brill Building songwriters, and at a song he wrote which became a classic both of soul and of rock music. We're going to look at how a novelty Latin song based around a dance craze was first taken up by one of the greatest soul groups of the sixties, and then reworked by the biggest British rock band of all time. We're going to look at \"Twist and Shout\" by the Isley Brothers.\n\n[Excerpt: The Isley Brothers, \"Twist and Shout\"]\n\nWhen we left the Isley Brothers, they had just signed to Atlantic, and released several singles with Leiber and Stoller, records like \"Standing on the Dance Floor\" that were excellent R&B records, but which didn't sell:\n\n[Excerpt: The Isley Brothers, \"Standing on the Dance Floor\"]\n\nIn 1962 they were dropped by Atlantic and moved on to Wand Records, the third label started by Florence Greenberg, who had already started Tiara and Scepter. As with those labels, Luther Dixon was in charge of the music, and he produced their first single on the label, a relatively catchy dance song called \"The Snake\", which didn't catch on commercially:\n\n[Excerpt: The Isley Brothers, \"The Snake\"]\n\nWhile \"The Snake\" didn't sell, the Isley Brothers clearly had some commercial potential -- and indeed their earlier hit \"Shout\" had just recharted, after Joey Dee and the Starliters had a hit with a cover version of it. All that was needed was the right song, and they could be as big as Luther Dixon's other group, the Shirelles. And Dixon had just the song for them -- a song co-written by Burt Bacharach, and sung on the demo by a young singer called Dionne Warwick. Unfortunately, they spent almost all the session trying and failing to get the song down -- they just couldn't make it work -- and eventually they gave up on it, and Bacharach produced the song for Jerry Butler, the former lead singer of the Impressions, who had a top twenty hit with it:\n\n[Excerpt: Jerry Butler, \"Make it Easy on Yourself\"]\n\nSo they were stuck without a song to record -- and then Dixon's assistant on the session, Bert Berns, suggested that they record one of his songs -- one that had been a flop for another group the previous year.\n\nThe story of \"Twist and Shout\" actually starts with a group called the Five Pearls, who made their first record in 1954:\n\n[Excerpt: The Five Pearls, \"Please Let Me Know\"]\n\nThe Five Pearls recorded under various different names, and in various different combinations, for several different mid-sized record ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and two of A History of Rock Music in Five Hundred Songs looks at \"Twist and Shout\" by the Isley Brothers, and the early career of Bert Berns. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"How Do You Do It?\" by Gerry and the Pacemakers.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nResources\n\nNo Mixcloud this week, due to the number of songs by the Isleys.\n\nAmazingly, there are no books on the Isley Brothers, unless you count a seventy-two page self-published pamphlet by Rudolph Isley's daughter, so I've had to piece this together from literally dozens of different sources.\n\nFor information about the Isley Brothers the main source was&nbsp; Icons of R",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}