{
  "id": "https://bibleinoneyear.org/en/youth/65",
  "title": "Day 65: Turn Your Life Around",
  "description": "Psalm 30:8,11–12, Leviticus 14:19–20, Mark 13:1–26.  He constantly turns people’s lives around  He turns despair into joy (Psalm 30:11)",
  "pubDate": "Sat, 06 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/65/?ignore",
  "itunes:duration": "12:47",
  "guid": "enyouth06032021-65",
  "length": 767.35,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 65: Turn Your Life Around",
  "itunes:subtitle": "Psalm 30:8,11–12, Leviticus 14:19–20, Mark 13:1–26.  He constantly turns people’s lives around  He turns despair into joy (Psalm 30:11)",
  "itunes:summary": "‘Big John’ had been living on the streets of London for almost ten years. Before that he had spent over nine years in prison. Most of his teeth were missing. He was addicted to methadone. His nickname on the streets of London was ‘Big John’ because he was a big guy who had once boxed for the Army.\n‘Big John’ walked into our night shelter for the homeless at HTB. He came with his friend ‘Little John’. ‘Big John’ loved it and appreciated all the young people who cared for him. He started coming to church. He came on Alpha. He encountered Jesus. He was filled with the Holy Spirit on the Alpha Weekend. He came off the drugs. God turned his life right around – from despair to joy.\nHe started telling his friends on the streets about Jesus. Each week he would turn up at church with more friends. His nickname, on the streets, changed from ‘Big John’ to ‘John the Baptist’!\nOne of the guys he had met on the Alpha weekend was in the property business and found him accommodation. A dentist in our congregation volunteered to replace all his missing teeth. He reconciled with his mother and his daughter and built a relationship with his grandchildren, whom he had never met before.\nFollowing Jesus is life-changing. He constantly turns people’s lives around. He turns despair into joy (Psalm 30:11).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 65
}