{
  "title": "153: Death at the Mansion: Rebecca Zahau Part 1",
  "link": "https://audioboom.com/posts/7703675",
  "itunes:episode": 153,
  "itunes:title": "Death at the Mansion: Rebecca Zahau Part 1",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3472,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On July 13, 2011, the body of 32 year-old Rebecca Zahau was found naked, bound, and hanging from a balcony at the Spreckels Mansion in Coronado, California. The death was quickly ruled a suicide, but many strange facts surround the case. The son of Rebecca's boyfriend, the Billionaire Jonah Shacknai, had fallen from a staircase inside the mansion just 2 days before and was now in critical condition. Jonah's brother, his ex-wife, and ex-wife's sister all had access to the mansion and felt that Rebecca was at least partially responsible for the accident. AND there was a SUPER FREAKING CREEPY 'NOTE' SCRAWLED ON THE WALL INSIDE THE HOUSE. This case has LAYERS, you guys! AND OH MY GOD, BILLY JENSEN AND PAUL HOLES ARE HERE!!!!<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 13 Oct 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-10-12:/posts/7703675",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}