{
  "title": "My first commit to Pandas",
  "link": "https://ianozsvald.com/2021/03/10/my-first-commit-to-pandas/",
  "dc:creator": "Ian",
  "pubDate": "Wed, 10 Mar 2021 14:15:10 +0000",
  "category": "Python",
  "guid": "https://ianozsvald.com/?p=3955",
  "description": "I&#8217;ve used the Pandas data science toolkit for over a decade and I&#8217;ve filed a couple of issues, but I&#8217;ve never contributed to the source. At the weekend I got to balance the books a little by making my first commit. With this pull request I fixed the recent request to update the pct_change docs [&#8230;]",
  "content:encoded": "<p>I&#8217;ve used the Pandas data science toolkit for over a decade and I&#8217;ve filed a couple of issues, but I&#8217;ve never contributed to the source. At the weekend I got to balance the books a little by making my first commit. With this <a href=\"https://github.com/pandas-dev/pandas/pull/40266\">pull request</a> I fixed the <a href=\"https://github.com/pandas-dev/pandas/issues/39672\">recent request</a> to update the pct_change docs to make the final example more readable.</p>\n<p>The change was trivial &#8211; adding &#8220;periods=-1&#8221; to the argument and updating the docstring. The build process was a lot more involved &#8211; thankfully I was on a call with PyLadies London to try to help others make their first contribution to Pandas and I had organiser Marco Gorelli (a core contributor) to help when needed.</p>\n<p>Ultimately it boiled down to <a href=\"https://pandas.pydata.org/pandas-docs/stable/development/contributing.html#creating-a-development-environment\">setting up</a> a docker environment, running a new example in my shell, updating the <a href=\"https://github.com/pandas-dev/pandas/pull/40266/files\">relevant docstring</a> on the local filesystem and then following the &#8220;<a href=\"https://pandas.pydata.org/pandas-docs/stable/development/contributing.html#contributing-to-the-documentation\">contributing to the documentation</a>&#8221; guide. My initial commit fell foul of the docstring style rules and the automated checking tools in the docker environment point this out. Once the local filesystem checker scripts were happy I pushed to my fork, created a PR and shortly after everything was done.</p>\n<p>All in it took 45 minutes to get the environment setup, another 45 minutes to make my changes and figure out how to run the right scripts, then a bit longer to push and submit a PR (followed by overnight patience before it got picked up by the team).</p>\n<p>When I teach my classes I always recommend that a good way to learn new development practices (like the automated use of black & flake8 in a precommit process) is to submit small fixes to open source projects &#8211; you learn so much along the way. I&#8217;ve not used docker in years and I don&#8217;t use automated docstring checking tools, so both presented nice little points for learning. I also have never used the pct_change function in Pandas&#8230;and now I have.</p>\n<p>If you&#8217;ve not yet made a commit to an open source project, do have a think about it &#8211; you&#8217;ll get lots of hand holding (just be patient, positive and friendly when you leave comments) and you can stick a reference to the result on your CV for bragging rights. And you&#8217;ll have made the world a slightly better place.</p>\n<hr>\nIan is a Chief Interim Data Scientist via his <a href=http://morconsulting.com>Mor Consulting</a>. Sign-up for <a href=http://eepurl.com/Z44HT>Data Science tutorials in London</a> and to hear about his <a href=https://ianozsvald.com/data-science-jobs/>data science thoughts and jobs</a>. He lives in London, is walked by his high energy Springer Spaniel and is a consumer of fine coffees."
}