{
  "title": "#448: Have a Biscuit (OOTP 12, Professor Umbridge)",
  "link": "https://audioboom.com/posts/7471543",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4983,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Andy from <a href=\"https://www.harrypotterfanzone.com/\">Harry Potter Fan Zone</a> joins the show and shares the history of his website and how he received the prestigious J.K. Rowling Fan Site Award</li>\n<li>The hosts share the Harry Potter gifts they received during the holidays</li>\n<li>Chapter-by-Chapter returns with Order of the Phoenix - Chapter 12: Professor Umbridge</li>\n<li>Seven Word Summary: Classes begin for the term despite attitudes</li>\n<li>Harry’s troubles continue: Seamus bolts early in the morning, Dean is at a loss for words and Lavender isn’t buying Harry’s story either.</li>\n<li>Hermione once again raises the importance of House unity. But is Hogwarts set up well for such a thing?</li>\n<li>Does Dumbledore, in fact, not want to draw attention to Hagrid's absence?</li>\n<li>Fred & George are in search of test subjects! Why couldn’t the Gryffindor Head Boy or Head Girl handle them?</li>\n<li>Why doesn't Harry own up to giving the Weasley twins their money for the joke shop?</li>\n<li>Kissy Kissy! Cho is back. Enter Ron - Master Wandblocker! </li>\n<li>Is J.K. Rowling trying to tell the reader something about jumping on bandwagons?</li>\n<li>Harry has his worst day of classes: History of Magic, Potions, Divination, DADA</li>\n<li>What classes when we were kids could we just not get through?</li>\n<li>With Hagrid gone and Umbridge teaching DADA, Harry really has no classes he enjoys! </li>\n<li>Does Snape ride Harry hard because he sees potential in him or because he's an ass?</li>\n<li>Umbridge raises the point that Defense Against The Dark Arts at Hogwarts has been rather disrupted and fragmented. She's not wrong, is she?</li>\n<li>So, we’re going back to basics? We could see doing this for one or two lessons, but the entire year?</li>\n<li>What does Umbridge having a short wand mean?</li>\n<li>Do we believe this new DADA class was really carefully devised by experts at the Ministry?</li>\n<li>Is Umbridge wrong about Lupin?</li>\n<li>Parvati raises a great point about the practical nature of their O.W.L.s. So, the students should just show up and perform a spell? Isn’t Umbridge setting the students up for failure? Wouldn’t it be a poor reflection on her if all of her students fail their O.W.L.s?</li>\n<li>Have a biscuit, Potter!</li>\n<li>Umbridge Suck Count, Connecting The Threads, MVP of the Week, Rename The Chapter return</li>\n<li>Quizzitch: What has Hermione been making over the summer?</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 07 Jan 2020 03:02:20 +0000",
  "guid": "tag:audioboom.com,2020-01-07:/posts/7471543",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}