{
  "id": "yt:video:o_JLTmIFq_A",
  "yt:videoId": "o_JLTmIFq_A",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "Is it dangerous to wake a sleepwalker? - Emmanuel During",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-10-25T15:00:56+00:00",
  "updated": "2022-10-26T17:45:25+00:00",
  "media:group": {
    "media:title": "Is it dangerous to wake a sleepwalker? - Emmanuel During",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Download a free audiobook version of “The Midnight Library“ and support TED-Ed's nonprofit mission: https://www.audible.com/ted-ed\n\n--\n\nMumbling fantastical gibberish; devouring blocks of cheese in the nude; peeing in places that aren’t toilets; and jumping out of windows. These are all things people have reportedly done while sleepwalking, a behavior that can be dangerous in some cases. It’s estimated that around 18% of people sleepwalk at least once in their lives. So, what exactly is sleepwalking? Emmanuel During investigates.\n\nLesson by Emmanuel During, directed by Laura Jayne Hodkin.\n\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/what-causes-sleepwalking-emmanuel-during\nDig deeper with additional resources: https://ed.ted.com/lessons/what-causes-sleepwalking-emmanuel-during#digdeeper \n\nCheck out our full book recommendation: https://shop.ed.ted.com/collections/ted-ed-book-recommendations/products/the-midnight-library\n\nAnimator's website: https://www.laurajaynehodkin.com\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Doreen Reynolds-Consolati, Manognya Chakrapani, Ayala Ron, Eunsun Kim, Phyllis Dubrow, Ophelia Gibson Best, Paul Schneider, Joichiro Yamada, Henrique Cassús, Karthik Cherala, Clarence E. Harper Jr., Vignan Velivela, Ana Maria, Exal Enrique Cisneros Tuch, Tejas Dc, Khalifa Alhulail, Martin Stephen, Jose Henrique Leopoldo e Silva, Mandeep Singh, Abhijit Kiran Valluri, Morgan Williams, Devin Harris, Pavel Zalevskiy, Karen Goepen-Wee, Filip Dabrowski, Barbara Smalley, Megan Douglas, Tim Leistikow, Ka-Hei Law, Hiroshi Uchiyama, Mark Morris, Misaki Sato, EdoKun, SookKwan Loong, Bev Millar, Lex Azevedo, Michael Aquilina, Jason A Saslow, Yansong Li, Cristóbal Moenne, Dawn Jordan, Prasanth Mathialagan, Samuel Doerle, David Rosario, Dominik Kugelmann - they-them, Siamak Hajizadeh, Ryohky Araya, Mayank Kaul, Christophe Dessalles and Heather Slater.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}