{
  "id": "yt:video:rZuvXWxOJTE",
  "yt:videoId": "rZuvXWxOJTE",
  "yt:channelId": "UCUMZ7gohGI9HcU9VNsr2FJQ",
  "title": "Hijacking and Murder in Global Shipping’s Grim Underbelly",
  "link": "",
  "author": {
    "name": "Bloomberg Quicktake: Originals",
    "uri": "https://www.youtube.com/channel/UCUMZ7gohGI9HcU9VNsr2FJQ"
  },
  "published": "2022-09-21T14:28:27+00:00",
  "updated": "2022-09-28T19:28:16+00:00",
  "media:group": {
    "media:title": "Hijacking and Murder in Global Shipping’s Grim Underbelly",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In July 2011, the oil tanker Brillante Virtuoso was drifting through the treacherous Gulf of Aden when a crew of pirates attacked and set her ablaze. When David Mockett, a maritime surveyor, inspected the vessel, he was left with more questions than answers. Soon after his inspection, Mockett was killed in a car bombing. \n\nStorylines follows Bloomberg reporters as they uncover some of the biggest financial crimes of the modern era. Watch more:  https://youtube.com/playlist?list=PLqq4LnWs3olW48FfG_5s1jL_ru47Z3QGq\n\n#BrillanteVirtuoso #Storylines #BloombergQuicktake \n\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\nBecome a Quicktake Member for exclusive perks: http://www.youtube.com/bloomberg/join\nSubscribe to Quicktake Explained: https://bit.ly/3iERrup \n\nQuickTake Originals is Bloomberg's official premium video channel. We bring you insights and analysis from business, science, and technology experts who are shaping our future. We’re home to Hello World, Giant Leap, Storylines, and the series powering CityLab, Bloomberg Businessweek, Bloomberg Green, and much more.\n\nSubscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel QuickTake News for breaking global news and insight in an instant.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}