{
  "title": "As China’s Quantum-Encrypting Satellites Shrink, Their Networking Abilities Grow",
  "link": "https://spectrum.ieee.org/satellite-qkd-china",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-conceptual-image-showing-a-ground-based-station-connecting-with-satellites.jpg?id=31214800&width=1200&height=800&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>The orbiting Tiangong-2 space lab has transmitted quantum-encryption keys to four ground stations, researchers <a href=\"https://opg.optica.org/optica/fulltext.cfm?uri=optica-9-8-933&id=492969\" rel=\"noopener noreferrer\" target=\"_blank\">reported on 18 August</a>. The same network of ground stations is also able to receive quantum keys from the orbiting Micius satellite, which is in a much higher orbit, using the space station as a repeater. It comes just after the late July launch of Jinan 1, China’s second quantum-encrypting satellite, by the University of Science and Technology of China. USTC told the <a href=\"https://news.satnews.com/2022/07/31/china-launches-new-satellite-in-important-step-towards-global-quantum-communications-network/\" target=\"_blank\">Xinhua News Agency</a> that the new satellite is one-sixth the mass of its 2016 predecessor. </p><p>“The launch is significant,” says physicist <a href=\"https://physics.illinois.edu/people/directory/profile/kwiat\" rel=\"noopener noreferrer\" target=\"_blank\">Paul Kwiat</a> of the University of Illinois in Urbana-Champaign, because it means the team are starting to build, not just plan, a quantum network. USTC researchers did not reply to <em>IEEE Spectrum’s</em> request for comments. </p><p>In quantum-key distribution (QKD), the quantum states of a single photon, such as polarization, encode and distribute random information that can be used to encrypt a classical message. Because it is impossible to copy the quantum state without changing it, senders and recipients can verify that their transmission got through without tampering or reading by third parties. In some scenarios it involves sending just one well-described photon at a time, but single photons are difficult to produce, and in this case, researchers used an attenuated laser to send small pulses that might also come out a couple of photons at a time, or not at all.</p><p>The USTC research team, led by Jian-Wei Pan, had already <a href=\"https://www.nature.com/articles/nature23655\" rel=\"noopener noreferrer\" target=\"_blank\">established quantum-key distribution from Micius to a single ground station</a> in 2017, not long after the 2016 launch of the satellite. The work that Pan and colleagues reported this month, but which took place in 2018 and 2019, is a necessary step for building a constellation of quantum-encryption-compatible satellites across a range of orbits, to ensure more secure long-distance communications.</p><p>Several other research groups have <a href=\"https://www.optica-opn.org/home/articles/volume_29/february_2018/features/satellite-based_qkd/\" rel=\"noopener noreferrer\" target=\"_blank\">transmitted quantum keys</a>, and others are now building microsatellites for the same purpose. However, the U.S. National Security Agency’s site about QKD lists several technical limitations, such as requiring an initial verification of the counterparty’s identity, the need for special equipment, the cost, and the risk of hardware-based security vulnerabilities. In the absence of fixes, <a href=\"https://www.nsa.gov/Cybersecurity/Quantum-Key-Distribution-QKD-and-Quantum-Cryptography-QC/\" rel=\"noopener noreferrer\" target=\"_blank\">the NSA does not anticipate approving QKD for national security</a> communications.</p><p>However, attenuated laser pulses are just one way of implementing QKD. Another is to use quantum entanglement, by which a pair of photons will behave the same way, even at a distance, when someone measures one of their quantum properties. In earlier experiments, Pan and colleagues also reported <a href=\"https://www.nature.com/articles/s41586-020-2401-y\" rel=\"noopener noreferrer\" target=\"_blank\">using quantum entanglement for QKD</a> and mixing satellite and fiber-optic links to establish a <a href=\"https://www.nature.com/articles/s41586-020-03093-8.epdf?sharing_token=1CW5z-80KWF4rgRGti-ZLNRgN0jAjWel9jnR3ZoTv0MNVpe6EvGQLTY7KE8U5lpv1AcqqXD5K2i3SN7zSU9K-dIX_fTfOWh3AkcjO3lLZZQSom5J0UumeoZfz1ZIXNNoNUSoEMYhZmfqWAO_FJy0sAa0ur09z2pHIX00xbdt4Y22R3sPuCz9nadZZORyizjpkFYizVoGYKpYleWnrNiIIG-n2Q-KiOo9HdosHMD_WoM%3D&tracking_referrer=spectrum.ieee.org\" target=\"_blank\">mixed-modality QKD network spanning almost 5,000 kilometers</a>. </p><p>“A quantum network with entangled nodes is the thing that would be really interesting, enabling distributed quantum computing and sensing, but  that’s a hard thing to make. Being able to do QKD is a necessary but not sufficient first step,” Kwiat says. The USTC experiments are a chance to establish many technical abilities, such as the precise control of the pulse duration and direction of the lasers involved, or the ability to accurately transfer and measure the quantum signals to the standard necessary for a more complex quantum network. </p><p>That is a step ahead of the many other QKD efforts made so far on laboratory benchtops, over ground-to-ground cables, or aboard balloons or aircraft. “You have to do things very differently if you’re not allowed to fiddle with something once it’s launched into space,” Kwiat says.</p><p>The U.S. CHIPS and Science Act of 2022, signed on 9 August, <a href=\"https://www.quantum.gov/quantum-in-the-chips-and-science-act-of-2022/\" target=\"_blank\">allocated more than US $153 million a year for quantum computing and networks</a>. While that’s unlikely to drive more American work toward an end goal of QKD, Kwiat says, “maybe we do it on the way to these more interesting applications.”</p>",
  "pubDate": "Thu, 25 Aug 2022 18:37:07 +0000",
  "guid": "https://spectrum.ieee.org/satellite-qkd-china",
  "category": [
    "Qkd",
    "Satellites",
    "Networking",
    "Qkd"
  ],
  "dc:creator": "Lucas Laursen",
  "media:content": ""
}