{
  "title": "PLEDGE WEEK: &#8220;Winchester Cathedral&#8221; by the New Vaudeville Band",
  "link": "https://500songs.com/podcast/pledge-week-winchester-cathedral-by-the-new-vaudeville-band/",
  "pubDate": "Sun, 10 Jul 2022 22:20:19 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1217",
  "description": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to <a href=\"http://patreon.com/andrewhickey\">patreon.com/andrewhickey</a> and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\n<strong>Transcript</strong>\n\nA few episodes back, we took a look at the Who's early records, and in passing we talked about the Ivy League, the studio group who sang backing vocals on their first single under that name. In this bonus episode, we're going to look at one of the biggest hits any of the members of the Ivy League were involved in -- a record that became a massive hit, won a Grammy, and changed the career direction of one of the most important comedy bands in Britain. We're going to look at \"Winchester Cathedral\" by the New Vaudeville Band:\n\n[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]\n\nIn his book Revolution in the Head, Ian MacDonald makes the point that the quintessential line in British psychedelia is from George Harrison's \"It's All Too Much\", where Harrison sings \"Show me that I'm everywhere, and get me home for tea\". Whereas American psychedelia is often angry and rebellious -- understandably, since it was often being made by people who were scared of being drafted to fight in a senseless war, and who were living through a time of great instability more generally -- British psychedelia was tinged with nostalgia, both for childhood and for a lost past of the Empire that had now ended.\n\nNow, we're going to get into that in much, much, greater detail when we look at the records the Beatles, the Kinks, the Who and others made in this period, but suffice to say that *one* of the several streams of thought that shaped the youth culture of Britain in the 1960s was a nationalistic one, partly in reaction to a perceived dominance by American culture and a belief that there were things about British culture that deserved celebrating too. And part and parcel of that was a celebration of the popular culture of the 1920s and thirties, the height of Britain's influence in the world.\n\nThis nationalism, incidentally, was *not* necessarily an entirely regressive or reactionary thing, though it certainly had those elements -- there was a strong progressive element to it, and we'll be unpacking the tensions in it in future episodes. For the moment, just take it that we're not talking about the sort of flag-waving xenophobia that has tainted much of modern politics, but something more complicated.\n\nThis complex relationship with the past had been evident as early as the very early 1960s, with acts like the Alberts and the Temperance Seven reviving 1920s novelty songs in what would now be considered a postmodern style:\n\n[Excerpt: The Temperance Seven, \"You're Driving Me Crazy \"]\n\nThat had temporarily gone into abeyance with the rise of the Beatles and the bands that followed in their wake, making guitar music inspired by American Black musicians the new popular thing in British culture. But that stream of the culture was definitely there, and it was only a matter of time before music business professionals would notice it again and start to try to capitalise on it.\n\nAnd Geoff Stephens did just that. Stephens was an odd character, who had entered the music business at a relatively late age. Until the age of thirty he worked in a variety of jobs, including as a teacher and an air traffic controller, but he was also involved in amateur theatrics, putting on revues with friends for which he co-wrote songs and sketches.\n\nHe then went on to write satirical sketches for radio comedy, writing for a programme hosted by Basil Boothroyd, the editor of Punch, and started submitting songs to Denmark Street publishers. Through his submissions, he got a job as a song plugger with a publishing company, and from there moved into writing songs professionally himself. His first hit, co-written as many of his songs were with Les Reed, was \"Tell Me When\", the debut single for the Applejacks, which made the top ten:\n\n[Excerpt: The Applejacks, \"Tell Me When\"]\n\nMany hits as a writer and producer soon followed, including writing \"The Crying Game\" for Dave Berry:\n\n[Excerpt: Dave Berry, \"The Crying Game\"]\n\nAnd signing Donovan and co-producing his first two albums and earliest hit singles:\n\n[Excerpt: Donovan, \"Catch the Wind\"]\n\nStephens had been making hits for a couple of years when he conceived the novelty record \"Winchester Cathedral\", which he recorded with John Carter of the Ivy League on lead vocals, imitating the style of Rudy Vallee, one of the most popular singers of the 1920s, who sang through a megaphone -- he became popular before electronic amplification was a big thing. The record was made by session players, and released under the name \"The New Vaudeville Band\":\n\n[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]\n\nThe record immediately began to sell. It became a massive, massive, worldwide hit, selling three million copies and inspiring a cover version by Rudy Vallee himself:\n\n[Excerpt: Rudy Vallee, \"Winchester Cathedral\"]\n\nOddly, this wasn't the last time in the sixties that a major hit would be inspired by the sound of Rudy Vallee...\n\nBut Stephens had a problem. People wanted the New Vaudeville Band to tour, and he didn't actually have a touring act. So he turned to the next best thing.\n\nThe Bonzo Dog Doo-Dah Band were a band of dadaist comedy performers who had a wonderful stage act, which among other things involved their lead singer Vivian Stanshall wearing a gold lame Elvis suit, their drummer Sam Spoons playing spoons and washboard, and comedy moments like band members holding up speech bubbles, so for example when someone took a solo, one of the other members might hold up a cardboard speech bubble saying \"Wow! I'm really expressing myself!\"\n\nTheir repertoire largely consisted of novelty tunes -- some from the fifties, but mostly songs they'd learned from old 78s from the 1920s, like their first single:\n\n[Excerpt: The Bonzo Dog Doo-Dah Band, \"My Brother Makes the Noises for the Talkies\"]\n\nAs Bonzos guitarist Neil Innes always told the story, Geoff Stephens was friends with the band's trumpet player Bob Kerr, and called him up asking if the Bonzo Dog  Doo-Dah Band wanted to be the touring New Vaudeville Band. Kerr was excited -- his band would get to be proper pop stars! But when he went to talk to the rest of the group, they were dismissive. They were conceptual artists and creative people, and didn't want to be a manufactured pop band.\n\nBob Kerr, on the other hand, thought that being paid vastly more money to do exactly the same stuff he was doing for next to nothing sounded like a great idea, and quit the band. The next thing the rest of his bandmates knew, they were watching him on Top of the Pops, performing with a band with a spoons player, a lead singer who wore a gold lame suit, and band members holding up cardboard speech bubbles. Kerr had taken the group's entire act, and they had to reinvent themselves, turning from 1920s pastiche to modern rock music -- and the chances are very good that we'll be following them up in the future.\n\nBut of course, as well as an act, the new group needed a singer, and for that Stephens turned to Alan Klein. Now, this is not the Allen Klein who we've mentioned in the main podcast, and who will be coming up again in future episodes. This Alan Klein was someone who had been on the margins of the music industry as a writer and performer for some time. He'd made records with Joe Meek:\n\n[Excerpt: Alan Klein, \"Striped Purple Shirt\"]\n\nand he'd co-written the musical What A Crazy World, which had been made into a film which featured his songs being sung by Joe Brown, Marty Wilde, Freddie and the Dreamers, and...Harry H Corbett:\n\n[Excerpt: Harry H Corbett: \"Things We Never Had\"]\n\nHe'd also made a single solo album, \"Well, At Least it's British\", which took a satirical look at British life in the 1960s that was hugely influential on Britpop in the 1990s, though the record sold almost nothing at the time:\n\n[Excerpt: Alan Klein, \"Twentieth-Century Englishman\"]\n\nWith Klein as the new lead singer, the New Vaudeville Band were a real band. And indeed, they had three more top forty hits in the UK, though their most successful song after \"Winchester Cathedral\" was a song that Stephens and Les Reed wrote for them which wasn't a hit for them:\n\n[Excerpt: The New Vaudeville Band, \"There's a Kind of Hush\"]\n\nThat *did*, though, become a big hit for Herman's Hermits:\n\n[Excerpt: Herman's Hermits, \"There's a Kind of Hush\"]\n\nThe New Vaudeville Band were shortlived -- they only had a handful of hits, and Bob Kerr soon left the group after falling out with their manager, Peter Grant -- another figure who we'll definitely be hearing a lot more from in future episodes of the main podcast. Kerr formed Bob Kerr's Whoopee Band with Sam Spoons and Vernon Dudley Bohay-Nowell, two other former members of the Bonzo Dog Doo Dah Band, and they had a quietly successful career doing the same act that the early Bonzos had -- all three men also joined in Bonzo Dog Doo Dah Band reunion tours in 2006 and 2016. A revived version of the New Vaudeville Band, featuring only the drummer from the touring lineup, performed in the 70s and 80s to little success.\n\nBut the group's biggest legacy remained their first hit, which actually won the Grammy for Best Contemporary (Rock & Roll) Recording in 1967, beating out a shortlist of \"Eleanor Rigby\", \"Monday Monday\", \"Cherish\", \"Good Vibrations\", and \"Last Train to Clarksville\". You can decide for yourselves if \"Winchester Cathedral\" was, in hindsight, a better record than those.\n\nBut whether it was or not, it was a fun record that made a lot of people happy. Geoff Stephens, its creator, is unlikely to feature further in this podcast. He wrote many more hit records, but they were almost exclusively for artists like Dana, Tom Jones, Wayne Newton, Ken Dodd, and Mary Hopkin, whose careers lie largely outside the scope of a history of rock music, however broadly defined. He had a long and successful career, but died last Christmas Eve, aged eighty-six, from pneumonia, having been weakened by an earlier bout of covid. So as we enter a second Covid Christmas, I'd just like to say I hope you're all vaccinated, boosted, and otherwise safe. I'm hoping to get one more episode and bonus out before Xmas Eve, and I hope to see you all still here in the New Year.\n\nVo-de-o-do\n\n[Excerpt: The New Vaudeville Band, “Winchester Cathedral”]",
  "itunes:subtitle": "This episode is part of Pledge Week 2022. Every day this week, Ill be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying back",
  "itunes:keywords": "Bonzo Dog Band,Herman&#039;s Hermits,New Vaudeville Band,Temperance Seven,The Ivy League",
  "itunes:episodeType": "bonus",
  "content:encoded": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to <a href=\"http://patreon.com/andrewhickey\">patreon.com/andrewhickey</a> and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\n<strong>Transcript</strong>\n\nA few episodes back, we took a look at the Who's early records, and in passing we talked about the Ivy League, the studio group who sang backing vocals on their first single under that name. In this bonus episode, we're going to look at one of the biggest hits any of the members of the Ivy League were involved in -- a record that became a massive hit, won a Grammy, and changed the career direction of one of the most important comedy bands in Britain. We're going to look at \"Winchester Cathedral\" by the New Vaudeville Band:\n\n[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]\n\nIn his book Revolution in the Head, Ian MacDonald makes the point that the quintessential line in British psychedelia is from George Harrison's \"It's All Too Much\", where Harrison sings \"Show me that I'm everywhere, and get me home for tea\". Whereas American psychedelia is often angry and rebellious -- understandably, since it was often being made by people who were scared of being drafted to fight in a senseless war, and who were living through a time of great instability more generally -- British psychedelia was tinged with nostalgia, both for childhood and for a lost past of the Empire that had now ended.\n\nNow, we're going to get into that in much, much, greater detail when we look at the records the Beatles, the Kinks, the Who and others made in this period, but suffice to say that *one* of the several streams of thought that shaped the youth culture of Britain in the 1960s was a nationalistic one, partly in reaction to a perceived dominance by American culture and a belief that there were things about British culture that deserved celebrating too. And part and parcel of that was a celebration of the popular culture of the 1920s and thirties, the height of Britain's influence in the world.\n\nThis nationalism, incidentally, was *not* necessarily an entirely regressive or reactionary thing, though it certainly had those elements -- there was a strong progressive element to it, and we'll be unpacking the tensions in it in future episodes. For the moment, just take it that we're not talking about the sort of flag-waving xenophobia that has tainted much of modern politics, but something more complicated.\n\nThis complex relationship with the past had been evident as early as the very early 1960s, with acts like the Alberts and the Temperance Seven reviving 1920s novelty songs in what would now be considered a postmodern style:\n\n[Excerpt: The Temperance Seven, \"You're Driving Me Crazy \"]\n\nThat had temporarily gone into abeyance with the rise of the Beatles and the bands that followed in their wake, making guitar music inspired by American Black musicians the new popular thing in British culture. But that stream of the culture was definitely there, and it was only a matter of time before music business professionals would notice it again and start to try to capitalise on it.\n\nAnd Geoff Stephens did just that. Stephens was an odd character, who had entered the music business at a relatively late age. Until the age of thirty he worked in a variety of jobs, including as a teacher and an air traffic controller, but he was also involved in amateur theatrics, putting on revues with friends for which he co-wrote songs and sketches.\n\nHe then went on to write satirical sketches for radio comedy, writing for a programme hosted by Basil Boothroyd, the editor of Punch, and started submitting songs to Denmark Street publishers. Through his submissions, he got a job as a song plugger with a publishing company, and from there moved into writing songs professionally himself. His first hit, co-written as many of his songs were with Les Reed, was \"Tell Me When\", the debut single for the Applejacks, which made the top ten:\n\n[Excerpt: The Applejacks, \"Tell Me When\"]\n\nMany hits as a writer and producer soon followed, including writing \"The Crying Game\" for Dave Berry:\n\n[Excerpt: Dave Berry, \"The Crying Game\"]\n\nAnd signing Donovan and co-producing his first two albums and earliest hit singles:\n\n[Excerpt: Donovan, \"Catch the Wind\"]\n\nStephens had been making hits for a couple of years when he conceived the novelty record \"Winchester Cathedral\", which he recorded with John Carter of the Ivy League on lead vocals, imitating the style of Rudy Vallee, one of the most popular singers of the 1920s, who sang through a megaphone -- he became popular before electronic amplification was a big thing. The record was made by session players, and released under the name \"The New Vaudeville Band\":\n\n[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]\n\nThe record immediately began to sell. It became a massive, massive, worldwide hit, selling three million copies and inspiring a cover version by Rudy Vallee himself:\n\n[Excerpt: Rudy Vallee, \"Winchester Cathedral\"]\n\nOddly, this wasn't the last time in the sixties that a major hit would be inspired by the sound of Rudy Vallee...\n\nBut Stephens had a problem. People wanted the New Vaudeville Band to tour, and he didn't actually have a touring act. So he turned to the next best thing.\n\nThe Bonzo Dog Doo-Dah Band were a band of dadaist comedy performers who had a wonderful stage act, which among other things involved their lead singer Vivian Stanshall wearing a gold lame Elvis suit, their drummer Sam Spoons playing spoons and washboard, and comedy moments like band members holding up speech bubbles, so for example when someone took a solo, one of the other members might hold up a cardboard speech bubble saying \"Wow! I'm really expressing myself!\"\n\nTheir repertoire largely consisted of novelty tunes -- some from the fifties, but mostly songs they'd learned from old 78s from the 1920s, like their first single:\n\n[Excerpt: The Bonzo Dog Doo-Dah Band, \"My Brother Makes the Noises for the Talkies\"]\n\nAs Bonzos guitarist Neil Innes always told the story, Geoff Stephens was friends with the band's trumpet player Bob Kerr, and called him up asking if the Bonzo Dog  Doo-Dah Band wanted to be the touring New Vaudeville Band. Kerr was excited -- his band would get to be proper pop stars! But when he went to talk to the rest of the group, they were dismissive. They were conceptual artists and creative people, and didn't want to be a manufactured pop band.\n\nBob Kerr, on the other hand, thought that being paid vastly more money to do exactly the same stuff he was doing for next to nothing sounded like a great idea, and quit the band. The next thing the rest of his bandmates knew, they were watching him on Top of the Pops, performing with a band with a spoons player, a lead singer who wore a gold lame suit, and band members holding up cardboard speech bubbles. Kerr had taken the group's entire act, and they had to reinvent themselves, turning from 1920s pastiche to modern rock music -- and the chances are very good that we'll be following them up in the future.\n\nBut of course, as well as an act, the new group needed a singer, and for that Stephens turned to Alan Klein. Now, this is not the Allen Klein who we've mentioned in the main podcast, and who will be coming up again in future episodes. This Alan Klein was someone who had been on the margins of the music industry as a writer and performer for some time. He'd made records with Joe Meek:\n\n[Excerpt: Alan Klein, \"Striped Purple Shirt\"]\n\nand he'd co-written the musical What A Crazy World, which had been made into a film which featured his songs being sung by Joe Brown, Marty Wilde, Freddie and the Dreamers, and...Harry H Corbett:\n\n[Excerpt: Harry H Corbett: \"Things We Never Had\"]\n\nHe'd also made a single solo album, \"Well, At Least it's British\", which took a satirical look at British life in the 1960s that was hugely influential on Britpop in the 1990s, though the record sold almost nothing at the time:\n\n[Excerpt: Alan Klein, \"Twentieth-Century Englishman\"]\n\nWith Klein as the new lead singer, the New Vaudeville Band were a real band. And indeed, they had three more top forty hits in the UK, though their most successful song after \"Winchester Cathedral\" was a song that Stephens and Les Reed wrote for them which wasn't a hit for them:\n\n[Excerpt: The New Vaudeville Band, \"There's a Kind of Hush\"]\n\nThat *did*, though, become a big hit for Herman's Hermits:\n\n[Excerpt: Herman's Hermits, \"There's a Kind of Hush\"]\n\nThe New Vaudeville Band were shortlived -- they only had a handful of hits, and Bob Kerr soon left the group after falling out with their manager, Peter Grant -- another figure who we'll definitely be hearing a lot more from in future episodes of the main podcast. Kerr formed Bob Kerr's Whoopee Band with Sam Spoons and Vernon Dudley Bohay-Nowell, two other former members of the Bonzo Dog Doo Dah Band, and they had a quietly successful career doing the same act that the early Bonzos had -- all three men also joined in Bonzo Dog Doo Dah Band reunion tours in 2006 and 2016. A revived version of the New Vaudeville Band, featuring only the drummer from the touring lineup, performed in the 70s and 80s to little success.\n\nBut the group's biggest legacy remained their first hit, which actually won the Grammy for Best Contemporary (Rock & Roll) Recording in 1967, beating out a shortlist of \"Eleanor Rigby\", \"Monday Monday\", \"Cherish\", \"Good Vibrations\", and \"Last Train to Clarksville\". You can decide for yourselves if \"Winchester Cathedral\" was, in hindsight, a better record than those.\n\nBut whether it was or not, it was a fun record that made a lot of people happy. Geoff Stephens, its creator, is unlikely to feature further in this podcast. He wrote many more hit records, but they were almost exclusively for artists like Dana, Tom Jones, Wayne Newton, Ken Dodd, and Mary Hopkin, whose careers lie largely outside the scope of a history of rock music, however broadly defined. He had a long and successful career, but died last Christmas Eve, aged eighty-six, from pneumonia, having been weakened by an earlier bout of covid. So as we enter a second Covid Christmas, I'd just like to say I hope you're all vaccinated, boosted, and otherwise safe. I'm hoping to get one more episode and bonus out before Xmas Eve, and I hope to see you all still here in the New Year.\n\nVo-de-o-do\n\n[Excerpt: The New Vaudeville Band, “Winchester Cathedral”]",
  "enclosure": "",
  "itunes:summary": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to patreon.com/andrewhickey and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\nTranscript\n\nA few episodes back, we took a look at the Who's early records, and in passing we talked about the Ivy League, the studio group who sang backing vocals on their first single under that name. In this bonus episode, we're going to look at one of the biggest hits any of the members of the Ivy League were involved in -- a record that became a massive hit, won a Grammy, and changed the career direction of one of the most important comedy bands in Britain. We're going to look at \"Winchester Cathedral\" by the New Vaudeville Band:\n\n[Excerpt: The New Vaudeville Band, \"Winchester Cathedral\"]\n\nIn his book Revolution in the Head, Ian MacDonald makes the point that the quintessential line in British psychedelia is from George Harrison's \"It's All Too Much\", where Harrison sings \"Show me that I'm everywhere, and get me home for tea\". Whereas American psychedelia is often angry and rebellious -- understandably, since it was often being made by people who were scared of being drafted to fight in a senseless war, and who were living through a time of great instability more generally -- British psychedelia was tinged with nostalgia, both for childhood and for a lost past of the Empire that had now ended.\n\nNow, we're going to get into that in much, much, greater detail when we look at the records the Beatles, the Kinks, the Who and others made in this period, but suffice to say that *one* of the several streams of thought that shaped the youth culture of Britain in the 1960s was a nationalistic one, partly in reaction to a perceived dominance by American culture and a belief that there were things about British culture that deserved celebrating too. And part and parcel of that was a celebration of the popular culture of the 1920s and thirties, the height of Britain's influence in the world.\n\nThis nationalism, incidentally, was *not* necessarily an entirely regressive or reactionary thing, though it certainly had those elements -- there was a strong progressive element to it, and we'll be unpacking the tensions in it in future episodes. For the moment, just take it that we're not talking about the sort of flag-waving xenophobia that has tainted much of modern politics, but something more complicated.\n\nThis complex relationship with the past had been evident as early as the very early 1960s, with acts like the Alberts and the Temperance Seven reviving 1920s novelty songs in what would now be considered a postmodern style:\n\n[Excerpt: The Temperance Seven, \"You're Driving Me Crazy \"]\n\nThat had temporarily gone into abeyance with the rise of the Beatles and the bands that followed in their wake, making guitar music inspired by American Black musicians the new popular thing in British culture. But that stream of the culture was definitely there, and it was only a matter of time before music business professionals would notice it again and start to try to capitalise on it.\n\nAnd Geoff Stephens did just that. Stephens was an odd character, who had entered the music business at a relatively late age. Until the age of thirty he worked in a variety of jobs, including as a teacher and an air traffic controller, but he was also involved in amateur theatrics, putting on revues with friends for which he co-wrote songs and sketches.\n\nHe then went on to write satirical sketches for radio comedy, writing for a programme hosted by Basil Boothroyd, the",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to patreon.com/andrewhickey and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\nTranscript\n\nA few episodes back, we took a look at the Who's early records, and in passing we talked about the Ivy League, the studio group who sang backing vocals on their first single under that name. In this bonus episode, we're going to look at one of the biggest hits any of the members of the Ivy League were involved in -- a record that became a massive hit, won a Grammy, and ch",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}