{
  "title": "Federal Regulators Should Approve Election Prediction Markets",
  "link": "https://www.aei.org/technology-and-innovation/prediction-markets-are-facing-a-key-regulatory-test/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Wed, 26 Oct 2022 10:00:00 +0000",
  "category": [
    "Technology and Innovation",
    "Elections",
    "Innovation",
    "markets",
    "Midterm elections",
    "Public opinion",
    "Stock market"
  ],
  "guid": "https://www.aei.org/?p=1008663640",
  "description": "<p>Election prediction markets, if allowed, offer a financial tech solution that could clear up much of the uncertainty surrounding the election cycle for the budgets of both businesses and bureaucracies. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/prediction-markets-are-facing-a-key-regulatory-test/\">Federal Regulators Should Approve Election Prediction Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>The US Commodity Futures Trading Commission (CFTC) continues to wrestle with how to best regulate prediction markets. The commission is expected to make a decision as soon as this week on whether the startup <a href=\"https://kalshi.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Kalshi</a> can offer a market on the outcome of the upcoming midterms. Approving Kalshi’s submission would be a step in the right direction for the commission and promotes the public interest. Election prediction markets have <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0169207008000320\" target=\"_blank\" rel=\"noreferrer noopener\">proven</a> to be a powerful tool for forecasting elections and are typically more accurate, timely, and complete than conventional methods.</p>\n\n\n\n<p>Kalshi was designated by the CFTC in 2020 as a <a href=\"https://kalshi.com/blog/kalshi-designation\" target=\"_blank\" rel=\"noreferrer noopener\">Designated Contract Market</a>. The company facilitates the trading of a <a href=\"https://kalshi.com/events\" target=\"_blank\" rel=\"noreferrer noopener\">wide range of contracts</a> for predictions on phenomena such as peak inflation, the results of the Federal Reserve’s December interest rate–setting meeting, China’s gross domestic product growth, and new COVID-19 variants emerging in the near future. In July, Kalshi <a href=\"https://www.cftc.gov/sites/default/files/filings/ptc/22/08/ptc082422kexdcm001.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">asked the CFTC for permission</a> to launch two contracts related to the outcome of this fall’s midterm elections.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"4798\" height=\"3205\" src=\"https://www.aei.org/wp-content/uploads/2022/10/I-Would-Bet-100-That-Nevada-Goes-Red.jpg?x91208\" alt=\"\" class=\"wp-image-1008663642\"/><figcaption>via Reuters</figcaption></figure>\n\n\n\n<p>The CFTC has previously denied similar requests, <a href=\"https://www.reuters.com/article/cftc-election-futures/futures-regulator-rejects-gambling-on-obamas-future-idUSL2E8F307W20120403\" target=\"_blank\" rel=\"noreferrer noopener\">ruling that</a> election prediction markets are online gambling and do not serve the public interest. This time, the CFTC launched a <a href=\"https://www.cftc.gov/sites/default/files/filings/documents/2022/orgkexpublicquestions220829.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">public comment process</a> to inform its decision on whether an election market creates more risks or actually helps hedge against them.</p>\n\n\n\n<p>It would be a mistake for the CFTC to limit these markets and the valuable forecasting information they provide. In typical financial markets, the price of a stock, bond, or commodity future is in a sense a forecast of the value of an unknown future, be it the value of a commodity or a business’s expected revenues. The forecasts represented by these prices provide information that drives decisions in a variety of sectors. Farmers, for example, routinely use futures markets to decide which crops to plant. Political prediction markets can do the same for those who are navigating a constantly evolving political landscape to manage risk and maximize their organization’s impact.</p>\n\n\n\n<p>Prediction markets offer several <a href=\"https://www.nber.org/papers/w18222\" target=\"_blank\" rel=\"noreferrer noopener\">benefits</a> across the private and public sectors. First, tools such as public polling offer a snapshot in time and often lag in reflecting consequential shifts in public sentiment as conditions change. In contrast, prediction markets allow for real-time incorporation of new information signaled by the price of the contract.&nbsp;</p>\n\n\n\n<p>Second, the market mechanism creates a financial incentive for individuals to express what they <em>believe</em> will happen, not what they <em>hope</em> will happen. Participants are only paid for being right, even if that outcome is not necessarily what they wanted. This too is better than solely relying on many of the alternatives. For example, political analysts provide important insight but may have financial incentives to generate support for a particular position or have their own biases incorporated into the analysis. As a <a href=\"https://populace.org/\" target=\"_blank\" rel=\"noreferrer noopener\">Populace</a> survey recently <a href=\"https://static1.squarespace.com/static/59153bc0e6f2e109b2a85cbc/t/62fd07b49271c657d243505d/1660749762686/Private+Opinion+in+America\" target=\"_blank\" rel=\"noreferrer noopener\">found</a>, social pressure can sometimes lead individuals to share what they believe is the “right” opinion even if it differs from their private views, which can complicate responses in polling and focus groups.&nbsp;</p>\n\n\n\n<p>Finally, participants may not individually have all the information, but the market mechanism creates an incentive to reveal what they know, which is then pooled to produce the best estimate or forecast, reflected in the price. This kind of information is useful for making better strategic decisions in both the private and public sectors, particularly in heavily regulated sectors that need to navigate dynamic policy and political environments. Reducing even a little uncertainty can unlock the capital to support entrepreneurs tackling climate change, improving student education outcomes, or expanding access to health care.</p>\n\n\n\n<p>Far from undermining election integrity, these markets can help strengthen it. Jason Furman, the chair of President Obama’s Council of Economic Advisers, <a href=\"https://comments.cftc.gov/PublicComments/ViewComment.aspx?ID=69708&GUID=264324ac-75cb-4c97-9d45-62baa1877335\" target=\"_blank\" rel=\"noreferrer noopener\">noted</a> in his comments to the CFTC that “election markets can also allow businesses and others to participate directly and hedge against the consequences of elections. Absent prediction markets businesses have no simple and transparent way to hedge against these risks.”</p>\n\n\n\n<p>We need a clearer regulatory road map that would allow for more, not fewer, prediction markets covering not only election outcomes but other events. For example, we should leverage prediction markets to better manage our pandemic response. A 2005 prediction market correctly <a href=\"https://academic.oup.com/cid/article/44/2/272/330878\" target=\"_blank\" rel=\"noreferrer noopener\">predicted</a> seasonal flu activity 71 percent of the time nearly two weeks ahead of clinical data that year. Such a market would have been invaluable to inform our nation’s pandemic response and indeed could still be valuable information given the uncertainty of future COVID-19 waves and variants as <a href=\"https://www.statnews.com/2022/09/02/prediction-markets-and-the-future-of-covid-19/\" target=\"_blank\" rel=\"noreferrer noopener\">COVID Collaborative&#8217;s</a> Steven Phillips has suggested.</p>\n\n\n\n<p>Kalshi’s proposal does not pose a risk to the integrity of the US election system. Election futures trading is a normal procedure in other established, strong democracies such as Australia, Ireland, and the UK. The valuable insights provided through a regulated election market far outweigh any of the potential risks.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/politics-and-public-opinion/elections/elections-and-demography-one-month-to-go/\">Elections and Demography: One Month to Go</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-signs-of-a-tightening-race/\">Elections and Demography: Signs of a Tightening Race</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-who-are-the-likely-voters/\">Elections and Demography: Who Are the Likely Voters?</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-small-shifts-big-implications/\">Elections and Demography: Small Shifts, Big Implications?</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/prediction-markets-are-facing-a-key-regulatory-test/\">Federal Regulators Should Approve Election Prediction Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}