{
  "title": "Episode 138: &#8220;I Fought the Law&#8221; by the Bobby Fuller Four",
  "link": "https://500songs.com/podcast/episode-138-i-fought-the-law-by-the-bobby-fuller-four/",
  "pubDate": "Wed, 01 Dec 2021 01:52:57 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=958",
  "description": "Episode one hundred and thirty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at “I Fought the Law\", and at the mysterious death of Bobby Fuller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/59354436\">on \"Hanky Panky\" by Tommy James and the Shondells</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com</a>\n\n\n\nNo Mixcloud this week due to the large number of tracks by the Bobby Fuller Four\n\n<strong>Resources</strong>\n\nInformation about the Crickets' post-Holly work comes from <a href=\"https://amzn.to/2PrUozx\">Buddy Holly: Learning the Game</a>, by Spencer Leigh.\n\nThere are two books available about Bobby Fuller -- the one I consulted most is <em>Rock and Roll Mustangs</em> by Stephen McParland, which can be bought as a PDF from <a href=\"https://payhip.com/cmusicbooks\">https://payhip.com/cmusicbooks</a>\n\nI also consulted <a href=\"https://amzn.to/3d3NQ51\"><em>I Fought the Law: The Life and Strange Death of Bobby Fuller</em> </a>by Miriam Linna and Randell Fuller.\n\nOne minor note -- both these books spell Bob Keane's name Keene. Apparently he spelled it multiple ways, but I have chosen to use the spelling he used on his autobiography, which is also the spelling I have used for him previously.\n\nThere are several compilations available of the Bobby Fuller Four's material, but the best collection of the hit singles is <a href=\"https://amzn.to/3xGK5fr\"><em>Magic Touch: The Complete Mustang Singles Collection</em>. </a>\n\nAnd <a href=\"https://amzn.to/3EbSBWk\">this</a> is an expanded edition of the Crickets' <em>In Style</em> album.\n\n<strong>Erratum</strong>\n\nI say Sonny Curtis wrote \"Oh Boy!\" -- I meant Sonny West.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\nA warning, before I begin. This episode, more than most, deals with events you may find disturbing, including graphic descriptions of violent death. Please check the transcript on the podcast website at 500songs.com if you are worried that you might be upset by this. This episode will not be a pleasant listen. Now on with the episode...\n\nMore than anything, Bobby Fuller wanted desperately to be Buddy Holly. His attitude is best summed up in a quote from Jim Reese, the guitarist with the Bobby Fuller Four, who said \"Don't get me wrong, I thought the world of Bobby Fuller and I cared a lot for him, so I say this with the best intentions -- but he was into Buddy Holly so much that if Buddy Holly decided to wear one red sock and one blue sock and Bobby Fuller found out about it, Bobby Fuller would've had one red sock and one blue sock. He figured that the only way to accomplish whatever Buddy Holly had accomplished was to be as much like Buddy Holly as possible.\"\n\nAnd Reese was right -- Bobby Fuller really was as much like Buddy Holly as possible. Buddy Holly was from Texas, so was Bobby Fuller. Buddy Holly played a Fender Stratocaster, Bobby Fuller played a Fender Stratocaster. Buddy Holly performed with the Crickets, Bobby Fuller's biggest hit was with a Crickets song. Buddy Holly recorded with Norman Petty, Bobby Fuller recorded with Norman Petty.\nOf course, there was one big difference. Buddy Holly died in an accident when he was twenty-two. Bobby Fuller lived to be twenty-three. And his death was no accident...\n\n[Excerpt: The Bobby Fuller Four, \"I Fought the Law\"]\n\nAfter Buddy Holly quit the Crickets in 1958, they continued recording with Norman Petty, getting in guitarist Sonny Curtis, who had been an associate of the band members even before they were a band, and who had been a frequent collaborator with Buddy, and vocalist Earl Sinks. But while they kept recording, Petty didn't release any of the recordings, and the group became convinced that he wasn't really interested in doing so. Rather, they thought that he was just using them as leverage to try to get Buddy back.\n\n\"Love's Made a Fool of You\" was the record that made the Crickets lose their faith in Norman Petty. The song was one that Buddy Holly and Bob Montgomery had written way back in 1954, and Holly had revived it for a demo in 1958, recording it not as a potential song for himself but to give to the Everly Brothers, reworked in their style, though they never recorded it:\n\n[Excerpt: Buddy Holly, \"Love's Made a Fool of You\"]\n\nWhen Holly and the Crickets had parted ways, the Crickets had recorded their own version of the song with Petty producing, which remained unreleased like everything they'd recorded since Buddy left.\nBut on the very day that Buddy Holly died, Petty shipped a copy of the tape to Decca, express mail, so that a single could be released as soon as possible:\n\n[Excerpt: The Crickets, \"Love's Made a Fool of You\"]\n\nThe Crickets never worked with Norman Petty again after that, they were so disgusted at his determination to cash in on the death of their friend and colleague. Petty continued to exploit Holly's work, getting in a band called the Fireballs to add new instrumental backing to Holly's old demos so they could be released as new singles, but the split between Petty and Holly's living colleagues was permanent.\n\nBut the Crickets didn't give up performing, and continued recording new material, mostly written either by Sonny Curtis or by the group's drummer Jerry Allison, who had co-written several of the group's earlier hits with Holly.\n\n\"More Than I Can Say\" was written by Curtis and Allison, and didn't make the top forty in the US, but did become a top thirty hit in the UK:\n\n[Excerpt: The Crickets, \"More Than I Can Say\"]\n\nThat was later also covered in hit versions by Bobby Vee and Leo Sayer. The B-side, \"Baby My Heart\", wasn't a hit for the Crickets, but was covered by the Shadows on their first album, which made number one on the UK charts. That performance was one of the few Shadows records at this point to have vocals:\n\n[Excerpt: The Shadows, \"Baby My Heart\"]\n\nThe group's first post-Holly album collected all their singles without Holly to that point, plus a few new filler tracks. The album, In Style With the Crickets, didn't chart in the US, but was a success in the UK.\nAround the time that album was released, Earl Sinks quit the group, and became a songwriter. He collaborated with Buddy Holly's old musical partner Bob Montgomery on a variety of hits for people like Brenda Lee, and in the seventies went back into performing for a while, having minor solo country hits as Earl Richards, and then bought a chain of abbatoirs.\n\nAllison and Curtis supplemented their income from the Crickets with session work -- Allison backed the Everly Brothers on \"Til I Kissed You\":\n\n[Excerpt: The Everly Brothers, \"Til I Kissed You\"]\n\nand both of them played on Eddie Cochran's last studio session, playing on \"Three Steps to Heaven\", with Curtis playing the electric lead while Cochran played the acoustic:\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nAfter that, the group went on tour in the UK as the backing band for the Everly Brothers, where they coincidentally bumped into Cochran, who told them \"If I knew you guys were coming, I’d have asked you to bring me a bottle of American air.” They would never see Cochran again.\n\nShortly after that tour, Sonny Curtis was drafted -- though while he was in the army, he wrote \"Walk Right Back\" for the Everly Brothers, as we discussed in the episode on \"Cathy's Clown\":\n\n[Excerpt: The Everly Brothers, \"Walk Right Back\"]\n\nJoe Mauldin gave up on music for a while, and so for a while The Crickets consisted of just Jerry Allison, new singer Jerry Naylor, and guitarist Tommy Allsup, who had played with Holly after Holly left the Crickets. That lineup recorded the \"Bobby Vee Meets the Crickets\" album, with Bobby Vee singing lead:\n\n[Excerpt: Bobby Vee and the Crickets, \"Well... All Right\"]\n\nCurtis would return once his time in the army was over, and eventually, in the 1970s, the group would stabilise on a lineup of Curtis, Mauldin, and Allison,  who would play together more or less consistently until 2015. But for a few years in the early sixties there was a lot of lineup shuffling, especially as Allison got drafted not long after Curtis got out of the Army -- there was one UK tour where there were no original members at all, thanks to Allison's absence.\n\nWhen Curtis was out of the group around the time of the Bobby Vee album, Snuff Garrett tried to get a friend of his to join as the group's new lead singer, and brought him to LA, but it didn't work out. Garrett later said \"He and Jerry didn’t hit it off in the way I imagined. After a few months, it was over and the guy started playing clubs around LA. I did demos with him and took them to my boss, the president of Liberty, and he said, ‘You’ve got enough of your friends signed to the label. You’ve signed the Crickets and Buddy Knox and they’re not doing much business, and this guy can hardly speak English.’ I said, ‘Well, I think he’s going to be something.’ ‘Okay,’ he said, ‘Drop one of the acts you’ve got and you can sign him.’ I said, ‘Forget it.’ A year later, he was an international star and his name was Trini Lopez\"\nLopez's big hit, \"If I Had a Hammer\", was recorded in a live show at a club called PJs:\n\n[Excerpt: Trini Lopez, \"If I Had a Hammer\"]\n\nPJs was owned by a gangster named Eddie Nash, who is now best known as the prime suspect in a notorious case known as the Wonderland Murders, when in 1981 four people were horribly beaten to death, either with the assistance of or to send a message to the porn star John Holmes, depending on which version of the story you believe. If you're unfamiliar with the case, I advise you not to google it, as it's very far from pretty.\n\nI bring this up because PJs would soon play a big part in the career of the Bobby Fuller Four.\nBobby Fuller was born in the Gulf Coast of Texas, but his family moved about a lot during his formative years, mostly in the Southwestern US, living in Lubbock, Texas, Hobbs, New Mexico, and Salt Lake City, Utah, among other places, before finally settling down in El Paso.\n\nEl Paso is a border town, right up close to the border with Mexico, and that meant that it had a complicated relationship with Juarez, the nearest large town on the Mexican side of the border. Between 1919 and 1933, the selling and consumption of alcohol had been made illegal in the United States, a period known as Prohibition, but of course it had not been criminalised in Mexico, and so during those years any time anyone from El Paso wanted to get drunk they'd travel to Juarez. Even after Prohibition ended, Juarez had a reputation as a party town, and Randy Fuller, Bobby's brother, would later tell a teen magazine \"You can grow up in El Paso and get really bad -- it's Juarez that makes it that way. Whatever personality you have, you have it 100%. You can go to Juarez and get drunk, or stay in El Paso and get religion\"\n\nOf course, from the outside, that sounds a whole lot like \"now look what YOU made ME do\". It's not the fault of those white people from Texas that they travel to someone else's city in someone else's country and get falling-down drunk and locked up in their jails every weekend, but it's the fault of those tempting Mexicans.\n\nAnd when Bobby and Randy Fuller's older brother Jack disappeared in 1961, while Bobby was off at university, that was at first what everyone thought had happened -- he'd gone to Juarez, got drunk, and got locked up until he could sleep it off. But when he didn't reappear after several days, everyone became more concerned. It turned out that Jack had met a man named Roy Handy at a bus depot and started chatting with him. They'd become friendly, and had gone off to do some target shooting together in the desert. But Handy had seen what looked like a wad of thousand-dollar bills in Jack's sun visor, and had decided to turn the gun on Jack rather than the target, killing him.\n\nThe thousand-dollar bills had been play money, a gift bought for a small child who lived nearby.\nBecause of the murder, Bobby Fuller moved back to El Paso from Denton in North Texas, where he had been studying music at university. He did enroll in a local college, but gave up his studies very quickly. Bobby had been something of a musical prodigy -- his original plan before going to North Texas State University had actually been to go to Juilliard, where he was going to study jazz drumming. Instead, while Bobby continued his drumming, he started living a party lifestyle, concentrating on his car, on women -- he got multiple women pregnant in his late teens and early twenties -- and on frequent trips to Juarez, where he would spend a lot of time watching a local blues musician, Long John Hunter:\n\n[Excerpt: Long John Hunter, \"El Paso Rock\"]\n\nMeanwhile, a music scene had been growing in El Paso since the late 1950s. A group called the Counts were at the forefront of it, with instrumentals like \"Thunder\":\n\n[Excerpt: The Counts, \"Thunder\"]\n\nThe Counts splintered into various groups, and one of them became The Embers, who Bobby Fuller joined on drums. Fuller was also one of a tiny number of people at this time who actually had a home studio. Fuller had started out with a simple bedroom studio, but thanks to his parents' indulgence he had repurposed a big chunk of their house as a studio, including building, with his brother Randy, an echo chamber (though it didn't work very well and he stuck with tape echo).\n\nIt was in that home studio that the Embers recorded their first single, \"Jim's Jive\", with Fuller on drums and Jim Reese on lead guitar:\n\n[Excerpt: Jerry Bright and The Embers, \"Jim's Jive\"]\n\nThat was released on a tiny local label, Yucca Records, which also released the Embers' second single -- and also released two Bobby Fuller solo singles, starting with \"You're in Love\":\n\n[Excerpt: Bobby Fuller, \"You're in Love\"]\n\nThat was recorded at Fuller's home studio, with the Embers backing him, and became the number one single locally, but Yucca Records had no national distribution, and the record didn't get a wider release.\nFuller's second single, though, was the first time his Buddy Holly fixation came to the forefront. Fuller was, by many accounts, *only* interested in sounding like Buddy Holly -- though his musical tastes were broad enough that he also wanted to sound like Eddie Cochran, Ritchie Valens, and the Crickets. But that was the extent of Fuller's musical world, and so obviously he wanted to work with the people who had worked with Holly. So his second single was recorded at Norman Petty's studio in Clovis, New Mexico, with Petty's wife Vi, who had played keyboards on some Buddy Holly records, on keyboards and backing vocals:\n\n[Excerpt: Bobby Fuller, \"Gently My Love\"]\n\nBut as it turned out, Fuller was very underwhelmed by the experience of working with Petty, and decided that he was going to go back to recording in his home studio.\n\nFuller left the Embers and started performing on his own, playing rhythm guitar rather than drums, with a band that initially consisted of his brother Randy on bass, Gaylord Grimes on drums, and Jim Reese on lead guitar, though there would be constant lineup changes.\n\nTwo of the many musicians who drifted in and out of Fuller's revolving band lineup, Larry Thompson and Jerry Miller, were from the Pacific Northwest, and were familiar with the scene that I talked about in the episode on \"Louie, Louie\". Thompson was a fan of one of the Pacific Northwest bands, the Frantics, who had hits with tracks like \"Werewolf\":\n\n[Excerpt: The Frantics, \"Werewolf\"]\n\nThompson believed that the Frantics had split up, and so Fuller's group took on that name for themselves. When they found out that the group *hadn't* split up, they changed their name to the Fanatics, though the name on their bass drum still read \"The Frantics\" for quite a while. Jerry Miller later moved back to Seattle, where he actually joined the original Frantics, before going on to become a founder member of Moby Grape.\n\nFuller started his own record label, Eastwood Records, and put out another solo single, which covered the full breadth of his influences. The B-side was \"Oh Boy!\", the song Sonny Curtis had written for Buddy Holly, while the A-side was \"Nervous Breakdown\", which had originally been recorded by Eddie Cochran:\n\n[Excerpt: Bobby Fuller, \"Nervous Breakdown\"]\n\nEverything was very fluid at this point, with musicians coming and going from different lineups, and none of these musicians were only playing in one band. For example, as well as being lead guitarist in the Fanatics, Jim Reese also played on \"Surfer's Paradise\" by Bobby Taylor and the Counts:\n\n[Excerpt: Bobby Taylor and the Counts, \"Surfer's Paradise\"]\n\nAnd Bobby's record label, renamed from Eastwood to Exeter, was releasing records  by other artists as well as Bobby and the Fanatics, though none of these records had any success.\nIn early 1963 Fuller and his latest lineup of Fanatics -- Randy, drummer Jimmy Wagnon, and guitarist Tex Reed -- travelled to LA to see if they could become successful outside El Paso. They got a residency at the Hermosa Biltmore, and also regularly played the Rendezvous Ballroom in Balboa, where the Beach Boys and Dick Dale had both played not long before, and there they added some surf instrumentals to their repertoire. Bobby soon became almost as keen on surf music as he was on rockabilly. While in LA, they tried all the record companies, with no success. The most encouragement they got came from Bob Keane at Del-Fi, the label that had previously been Ritchie Valens' label, who told him that the tapes they brought him of their El Paso recordings sounded good but they needed better songs, and to come back to him when they had a hit song. Bobby determined to do just that.\n\nOn their return to El Paso, Bobby Fuller and the Fanatics recorded \"Stringer\" for Todd Records, a small label owned by Paul Cohen, the former Decca executive who had signed Buddy Holly but not known what to do with him:\n\n[Excerpt: Bobby Fuller and the Fanatics, \"Stringer\"]\n\nFuller also opened his own teen nightclub, the Teen Rendezvous, which he named after the Balboa ballroom. The Fanatics became the regular band there, and at this point they started to build up a serious reputation as live performers. The Teen Rendezvous only stayed open for a few months, though -- there were complaints about the noise, and also they booked Bobby Vee as a headliner one night. Vee charged a thousand dollars for his appearance, which the club couldn't really afford, and they didn't make it back on the doors. They'd hoped that having a prestigious act like Vee play there might get more people to come to the club regularly, but it turned out that Vee gave a sub-par performance, and the gamble didn't pay off.\n\nIt was around this time that Fuller made his first recording of a song that would eventually define him, though it wasn't his idea. He was playing the Crickets In Style album to his brother Randy, and Randy picked up on one song, a Sonny Curtis composition which had never been released as a single:\n\n[Excerpt: The Crickets, \"I Fought the Law\"]\n\nRandy thought the Crickets' actual record sounded horrible, but he also thought the song had the potential to be a really big hit. He later explained \"The James Dean movie Rebel Without a Cause had made a big impression on me, and I told Bobby, 'Man, let's do that one... it oughta sell a million copies'. Everyone was into the whole rebel thing, with switchblades and stuff like that. It just seemed like a natural thing for us to do.\"\n\nFuller recorded his own version of the song, which once again became a local hit:\n\n[Excerpt: Bobby Fuller, \"I Fought The Law (El Paso version)\"]\n\nBut even though the record did get some national distribution, from VeeJay Records, it didn't get any airplay outside the Southwest, and Fuller remained a local star with absolutely no national profile.\nMeanwhile, he was still trying to do what Bob Keane had asked and come up with a hit song, but he was stuck in a musical rut. As Jim Reese would later say, \"Bobby was a great imitator. He could sing just like Holly, McCartney, Lennon, or Eddie Cochran. And he could imitate on the guitar, too. But Bobby never did Bobby\".\n\nTo make matters worse, the Beatles came on to the American musical scene, and caused an immediate shift in the public taste. And Bobby Fuller had a very complicated relationship with the Beatles. He had to play Beatles songs live because that's what the audiences wanted, but he felt that rock and roll was *American* music, and he resented British people trying to play it. He respected them as songwriters, but didn't actually like their original material. He could tell that they were huge Buddy Holly fans, like him, and he respected that, but he loathed Motown, and he could tell they were listening to that too. He ended up trying to compromise by playing Buddy Holly songs on stage but introducing them by talking about how much the Beatles loved Buddy Holly.\n\nAnother person who was negatively affected by the British Invasion was Bob Keane, the man who had given Fuller some encouragement. Keane's Del-Fi Records had spent the previous few years making a steady income from churning out surf records like \"Surf Rider\" by the Lively Ones:\n\n[Excerpt: The Lively Ones, \"Surf Rider\"]\n\nAnd the Surfer's Pajama Party album by the Bruce Johnston Surfing Band:\n\n[Excerpt: Bruce Johnston, \"The Surfer Stomp\"]\n\nBut as surf music had suddenly become yesterday's news, Del-Fi were in financial trouble, and Keane had had to take on a partner who gave the label some financial backing, Larry Nunes. Now, I am going to be very, very, careful about exactly what I say about Nunes here. I am aware that different people give very, very, different takes on Nunes' personality -- Barry White, for example, always said that knowing Nunes was the best thing that ever happened to him, credited Nunes with everything good in his career, and gave him credit on all his albums as his spiritual advisor.\n\nHowever, while White made Nunes out to be pretty much a saint, that is not the impression one gets from hearing Bob Keane or any of Bobby Fuller's circle talk about him.\n\nNunes had started out in the music business as a \"rack jobber\", someone who ran a small distribution company, selling to small family-owned shops and to secondary markets like petrol stations and grocery stores. The business model for these organisations was to get a lot of stock of records that hadn't sold, and sell them at a discount, to be sold in discount bins. But they were also a perfect front for all sorts of criminal activity. Because these were bulk sales of remaindered records, dead stock, the artists weren't meant to get royalties on them, and no real accounting was done of the sales. So if a record label \"accidentally\" pressed up a few thousand extra copies of a hit record and sold it on to a rack jobber, the artists would never know. And if the Mafia made a deal with the record pressing plant to press up a few thousand extra copies, the *record label* would never know. And so very, very, quickly this part of the distribution system became dominated by organised crime.\n\nI have seen no proof, only rumours, that Nunes was directly involved in organised crime, but Bob Keane in particular later became absolutely convinced he was. Keane would later write in his autobiography: “I wondered if I had made a deal with the Devil. I had heard that Larry had a reputation for being associated with the Mob, and as it turned out three years later our relationship ended in deception, dishonesty, and murder. I consider myself very lucky to have come out of my relationship with Nunes in one piece, virtually unscathed.\"\n\nAgain, this is Keane's interpretation of events. I am not saying that Larry Nunes was a mobster, I am saying that Bob Keane repeatedly made that accusation many times, and that other people in this story have said similar things.\n\nBy late 1964, Bobby Fuller had come up with a song he was pretty sure *would* be a successful single, like Keane had wanted, a song called \"Keep on Dancing\" he'd written with Randy:\n\n[Excerpt: Bobby Fuller, “Keep On Dancing”]\n\nAfter some discussion he managed to persuade Randy, Jim Reese, and drummer DeWayne Quirico to move with him to LA -- Bobby and Randy's mother also moved with them, because after what had happened to her eldest son she was very protective of her other children.\n\nJim Reese was less keen on the move than the others, as he thought that Fuller was only interested in himself, not in the rest of the Fanatics. As Reese would later say, \"Bobby wanted us all to go to California, but I was leery because it always had been too one-sided with Bobby. He ran everything, hired and fired at the least whim, and didn't communicate well with other people. He was never able to understand that a musician, like other people, needs food, gasoline, clothes, a place to live, etc. I often felt that Bobby thought we should be following him anywhere just for the thrill of it.\"\n\nEventually, Fuller got them to go by agreeing that when they got to LA, everything would be split equally -- one for all and all for one, though when they finally made a deal with Keane, Fuller was the only one who ended up receiving royalties. The rest of the group got union scale.\n\nKeane agreed that \"Keep on Dancing\" could be a hit, but that wasn't the first record the group put out through one of Keane's labels. The first was an instrumental titled \"Thunder Reef\":\n\n[Excerpt: The Shindigs, \"Thunder Reef\"]\n\nThat wasn't released as by the Fanatics, but as by The Shindigs -- Keane had heard that Shindig! needed a house band and thought that naming the group after the show might be a way to get them the position. As it happened, the TV show went with another group, led by James Burton, who they called the Shindogs, and Keane's plan didn't work out.\n\nThe Shindigs single was released on a new Del-Fi subsidiary, Mustang, on which most future records by the group would be released. Mustang was apparently set up specifically for the group, but the first record released on that label was actually by a studio group called The Surfettes:\n\n[Excerpt: The Surfettes, \"Sammy the Sidewalk Surfer\"]\n\nThe Surfettes consisted of Carol Connors, the former lead singer of the Teddy Bears and writer of \"Hey Little Cobra\", and her sister Cheryl. Carol had written the single with Buzz Cason, of Brenda Lee's band, and the session musicians on that single included several other artists who were recording for Del-Fi at the time -- David Gates, Arthur Lee, and Johnny Echols, all of whom we'll be hearing more about in future episodes.\n\nAlmost simultaneously with the Shindigs single, another single by the Fanatics was released, \"Those Memories of You\":\n\n[Excerpt: Bobby Fuller and the Fanatics, \"Those Memories of You\"]\n\nThat single, backed by a surf instrumental called \"Our Favourite Martian\", was released on Donna Records, another Del-Fi subsidiary, as by Bobby Fuller and the Fanatics, which made the other group members furious -- what had happened to one for all and all for one? Randy Fuller, who was a very aggressive young man, was so annoyed that he stormed into Bob Keane's office and frisbeed one of the singles at his head.\n\nThey didn't want to be Bobby's backing band, they wanted to be a proper group, so it was agreed the group's name would be changed.\n\nIt was changed to The Bobby Fuller Four.\n\nJim Reese claimed that Keane and Fuller formed The Bobby Fuller Four Inc, without the other three members having participation, and made them employees of the corporation. Reese said \"this didn't fit in with my concept of the verbal agreement I had with Bobby, but at least it was better than nothing\".\n\nThe group became the house band at the Rendezvous, playing their own sets and backing people like Sonny and Cher. They then got a residency at the Ambassador Hotel in Hollywood, and then Jim Reese quit the band. Fuller phoned him and begged him to come back, and as Reese said later \"I again repeated my conditions about equal treatment and he agreed, so I went back -- probably the biggest mistake I ever made.\"\n\nThe group's first single as the Bobby Fuller Four, released on Mustang as all their future records were, was \"Take My Word\":\n\n[Excerpt: The Bobby Fuller Four, \"Take My Word\"]\n\nThe record was unsuccessful -- Keane's various labels, while they were better distributed than Bobby's own labels back in El Paso, still only had spotty distribution, and Mustang being a new label it was even more difficult to get records in stores.\n\nBut the group were getting a reputation as one of the best live acts in the LA area at the time. When the club Ciro's, on the Sunset Strip, closed and reopened under its new name It's Boss, the group were chosen to perform at its grand reopening, and they played multiple four- to six-week residencies at PJ's.\n\nThe next record the group released, \"Let Her Dance\", was a slight rewrite of \"Keep on Dancing\", the song the Fuller brothers had written together, though Bobby was the only credited writer on the label:\n\n[Excerpt: The Bobby Fuller Four, \"Let Her Dance\"]\n\nThat was the first single they recorded at a new state-of-the-art studio Keane had opened up. That studio had one of the first eight-track machines in LA, and a truly vast echo chamber, made up from a couple of unused vaults owned by a bank downstairs from the studio.\n\nBut there were big arguments between Fuller and Keane, because Fuller wanted only to make music that could be reproduced live exactly as it was on the record, while Keane saw the record as the important thing.\n\nKeane put a percussion sound on the record, made by hitting a bottle, which Fuller detested as they couldn't do it live, and the two would only end up disagreeing more as they continued working together.\nThere's a lot of argument among Fuller fans about this -- personally I can see both sides, but there are people who are very much Team Bobby and think that nothing he recorded for Mustang is as good as the El Paso recordings, because of Bob Keane diluting the raw power of his live sound. But in an era  where studio experimentation was soon to lead to records like \"Strawberry Fields Forever\" or \"Good Vibrations\", I think a bit of extra percussion is hardly an unforgivable dilution:\n\n[Excerpt: The Bobby Fuller Four, \"Let Her Dance\"]\n\nKRLA radio started playing \"Let Her Dance\" every hour, at the instigation of Larry Nunes -- and most of the people talking about this have implied that he bribed people in order to get this to happen, or that it was through his alleged Mob connections. Certainly, he knew exactly when they would start playing the record, and how frequently, before they did.\n\nAs a result of this exposure, \"Let Her Dance\" became a massive local hit, but they still didn't have the distribution to make it a hit outside California.\n\nIt did, though, do well enough that Liberty Records asked about putting the record out nationally. Keane came to a verbal agreement, which he thought was an agreement for Liberty to distribute the Mustang Records single, and Liberty thought was an agreement to put out the single on their own label and have an option on future Fuller recordings.\n\nLiberty put the record out on their own label, without Keane having signed anything, and Keane had to sue them. The result was that the record was out on two different labels, which were suing each other, and so it hardly had any chance at any kind of success.\n\nThe legal action also affected the next single, \"Never to Be Forgotten\":\n\n[Excerpt: The Bobby Fuller Four, \"Never to Be Forgotten\"]\n\nThat's often considered the best of the band's originals for Mustang, and was written by the Fuller brothers -- and both of them were credited this time -- but Liberty sued Keane, claiming that because they'd released \"Let Her Dance\", they also had an option on the next single.\n\nBut even though the group still weren't selling records, they were getting other opportunities for exposure, like their appearance in a film which came out in April 1966. Though admittedly, this film was hardly A Hard Day's Night.\n\nIndeed, a lot of people have claimed that The Ghost in the Invisible Bikini was cursed. The film, which went through the working titles Pajama Party in a Haunted House, Slumber Party in a Haunted House, Bikini Party in a Haunted House, and Ghost in a Glass Bikini, was made by the cheapy exploitation company American International Pictures, and several people involved in it would die in the next four years, starting with Buster Keaton, who was meant to appear in the film, but had to back out due to his health problems and died before the film came out. Then on the first day of filming, a grip fell to his death. In the next four years, two of the film's young stars, Sue Hamilton and John Macchia, would die, as would Philip Bent, an actor with a minor role who died in July 1966 in a plane crash which also took the life of Peter Sachse, an extra on the film who was married to a cast member. Three more stars of the film, Francis X Bushman, Basil Rathbone, and Boris Karloff would also all be dead within a handful of years, but they were all elderly and unwell when filming started.\n\nI don't believe in curses myself, but it is a horrible run of bad luck for a single film.\n\nTo make matters worse, the group weren't even playing their own music in the film, but lipsynching to tracks by other musicians. And they had to play Vox instruments in the film, because of a deal the filmmakers had made, when the group all hated Vox instruments, which Jim Reese thought of as only good for starting bonfires.\n\nFor the next single, Keane had discussed with Fuller what songs the group had that were \"different\", but Fuller apparently didn't understand what he meant. So Keane went to the rest of the group and asked them what songs always went over well in live performances.\n\nAll three band members said that \"I Fought the Law\" should be the next single. Bobby disagreed, and\nalmost got into a fistfight with his brother over it -- they'd already released it as a single once, on his own label, and he didn't want to do it again. He also wanted to record his own material not cover versions. But the others prevailed, and \"I Fought the Law\" became the record that would define the group:\n\n[Excerpt: The Bobby Fuller Four, \"I Fought the Law\"]\n\n\"I Fought the Law\" became the group's breakthrough hit. It made the top ten, and turned the song, which had previously been one of the Crickets' most obscure songs, into a rock and country standard. In the seventies, the song would be recorded by Hank Williams Jr, the Clash, the Dead Kennedys and more, and all of them would be inspired by the Bobby Fuller Four's version of the song, not the Crickets' original.\nAround this time, the group also recorded a live album at PJs, in the hope of duplicating Trini Lopez's success with his earlier album. The album was shelved, though, because it didn't capture the powerhouse live act of the group's reputation, instead sounding rather dull and lifeless, with an unenthused audience:\n\n[Excerpt: The Bobby Fuller Four, \"Oh Boy!\"]\n\nWhile \"I Fought the Law\" was a huge success, it started a period of shifts within the band. Shortly after the PJs album was recorded, DeWayne Quirico quit the band and moved back to El Paso. He was temporarily replaced by Johnny Barbata, who would later become a member of the Turtles, before Fuller's preferred replacement Dalton Powell was able to get to LA to join the band. There seems to have been some shuffling about, as well, because as far as I can tell, Powell joined the band, then quit and was replaced by Barbata returning, and then rejoined again, all in about a six month period.\nGiven the success of \"I Fought the Law\", it only made sense that at their first recording session with Powell, the group would record more tracks that had originally been on the Crickets' In Style album. One of these, their version of \"Baby My Heart\", went unreleased at the time, though to my taste it's the best thing the group ever did:\n\n[Excerpt: The Bobby Fuller Four, \"Baby My Heart\"]\n\nThe other, \"Love's Made a Fool of You\", became the group's next single:\n\n[Excerpt: The Bobby Fuller Four, \"Love's Made a Fool of You\"]\n\n\"Love's Made a Fool of You\" was also a success, making number twenty-six in the charts, but the group's next session, which would produce their last single, was the cause of some conflict.\n\nKeane had noticed that soul music was getting bigger, and so he'd decided to open up a sister label to Mustang, Bronco, which would release soul and R&B music. As he didn't know much about that music himself, though of course he had worked with Sam Cooke, he decided to hire an A&R man to deal with that kind of music. The man he chose was a piano player named Barry White, still several years from making his own hit records.\n\nWhite had had some success as an arranger and producer already, having arranged \"The Harlem Shuffle\" for Bob and Earl, on which he also played piano:\n\n[Excerpt: Bob and Earl, \"The Harlem Shuffle\"]\n\nDespite White's remit, the records he produced for Bronco and Mustang weren't especially soulful. \"Back Seat 38 Dodge\" by Opus 1, for example, is a psychedelic updating of the kind of car songs that the Beach Boys and Jan and Dean had been doing a couple of years earlier:\n\n[Excerpt: Opus 1, \"Back Seat 38 Dodge\"]\n\nWhite was present at what became the final Bobby Fuller Four session, though accounts differ as to his involvement. Some have him arranging \"The Magic Touch”, others have him playing drums on the session, some have him co-producing. Bob Keane always said that the record had no involvement from White whatsoever, that he was there but not participating, but various band members, while differing on other things, have insisted that White and Fuller got into huge rows, as Fuller thought that White was trying to turn his music into Motown, which he despised.\n\nThe finished record does sound to me like it's got some of White's fingerprints on it:\n\n[Excerpt: The Bobby Fuller Four, \"The Magic Touch\"]\n\nBut \"The Magic Touch\" flopped -- it departed too far from the updated Buddy Holly sound of the group's hit singles, and audiences weren't responding. “The Ghost in the Invisible Bikini” came out and was an embarrassment to the band – and on July the eleventh the next in that horrible series of deaths linked to the film happened, the plane crash that killed Philip Bent and Peter Sachse.\n\nOn July the sixteenth, William Parker, the long-serving chief of the LAPD, had died. If, hypothetically, someone wanted to commit a crime in LA and not have it investigated too closely, the few days after Parker's death, when the entire department was in mourning and making preparations for a massive public funeral, would have been a good time to do so.\n\nTwo days after Parker's death, July the eighteenth 1966, was going to be the crunch point for the Bobby Fuller Four. They had a recording session scheduled for 8:30AM, but they also were planning on having a band meeting after the session, at which it was likely the group were going to split up. Jim Reese had just got his draft notice, Bobby and Randy were getting on worse, and nobody was happy with the music they were making. They were going to finish the album they were working on, and then Bobby was going to go solo.\n\nOr at least that was what everyone assumed -- certainly Ahmet Ertegun had been sniffing round Bobby as a solo artist, though Bobby kept saying publicly he wanted to continue working with the band. There were also later rumours that Morris Levy had been after Bobby, and had even signed him to a deal, though no documentary evidence of such a deal has surfaced. It seemed that if there was to be a group at all, it would just be a name for any random musicians Bobby hired.\n\nBobby also wanted to become a pure recording artist, and not tour any more -- he hated touring, thought people weren't listening to the band properly, and that being away from home meant he didn't have time to write songs, which in turn meant that he had to record what he thought of as substandard material by other people rather than his own original material. He wanted to stay in LA, play clubs, and make records.\nBut even though making records was what he wanted to do, Bobby never turned up for the recording session, and nor did he turn up for the group meeting afterwards.\n\nThe group's next single had been announced as \"It's Love Come What May\":\n\n[Excerpt: Randy Fuller, \"It's Love Come What May\"]\n\nWhen that was released, it was released as a Randy Fuller solo single, with Randy's voice overdubbed on top of Bobby's. Because there was no use putting out a record by a dead man.\n\nHere's what we actually know about Bobby Fuller's death, as far as I can tell. There are a lot of conflicting claims, a lot of counternarratives, and a lot of accusations that seek to tie in everyone from Charles Manson to Frank Sinatra, but this is as close as I can get to the truth.\n\nBobby and Randy were living together, with their mother, though Randy was out a lot of the time, and the two brothers at that point could barely stand to be in the same room with each other, as often happens in bands where brothers work together. On the night of July the seventeenth, Bobby Fuller left the house for a couple of hours after getting a phone call -- some people who were around said he was going to see a girlfriend named Melody to buy some acid from her, but she says he didn't see her that night.\n\nMelody was a sex worker, who was also reputedly the girlfriend of a local nightclub owner who had Mob connections and was jealous of her attachments to other men -- though she denies this. Nobody has ever named which club owner, but it's generally considered to be Eddie Nash, the owner of PJs. Melody was also friends with Larry Nunes, and says she acted as a go-between for Nunes and Fuller. Fuller got back in around 2:30 AM and spent some time having beer with the building manager.  Then at some point he went out again -- Bobby was a night owl.\n\nWhen his mother, Lorraine, woke up, she noticed her car, which Bobby often used to borrow, wasn't there. She had a terrible bad feeling about her son's whereabouts -- though she often had such feelings, after the murder of her eldest son. She kept checking outside every half hour or so to see if he was coming home.\nAt 5PM, two musicians from El Paso, Ty Grimes and Mike Ciccarelli, who'd come to LA to see Fuller, pulled into the parking lot near his apartment block. There were no other cars nearby. A car pulled in beside them, but they didn't pay any attention. They went up the stairs and rang the doorbell.\n\nWhile they were ringing the doorbell, Lorraine Fuller was out checking the mail, and noticed her car, which hadn't been there earlier. She opened the door.\n\nTy Grimes later said \"When we walked back to Mike's car, Bobby's car was now parked next to Mike's, and he was laying in the front seat already dead. We also saw his mom being helped toward the apartment.\"\nFuller had been dead long enough for rigor mortis to have set in. While Lorraine Fuller later said that his hand had been on the ignition key, there was actually no key found in the car. He had apparently died from inhaling petrol. His body was covered in bruises, and the slippers he was wearing looked like they'd been dragged across the ground. His body was covered in petrol, and his right index finger was broken.\n\nBob Keane has later said that Larry Nunes knew some details of the crime scene before he was told them. According to the other members of the band, there was an eight hundred thousand dollar life insurance policy on Bobby's life, held by the record company. Keane didn't get any money from any such policy, and stated that if such a policy existed it must have been taken out by Nunes, who soon stopped working with Keane, as Keane's labels collapsed without their one remaining star.\n\nThe death was initially ruled a suicide, which would not pay out on an insurance claim, and later changed to accidental death, which would. Though remember, of course, we have only the word of Bobby's other band members that any insurance policy existed. No real police investigation was ever carried out, because it was such an open-and-shut case. At no point was it ever considered a murder by the famously corrupt LAPD.\n\nBob Keane hired private investigators to investigate the case. One of them was shot at, and the others gave up on the investigation, scared to continue. The autopsy report that was issued months after the fact bore no resemblance to what any of the witnesses said they saw of the state of Fuller's body.\nMore than thirty years later, Keane tried to get the information the LAPD held about the case, and was told that it could only be accessed by a family member. Keane contacted Randy Fuller, who was then told that the entire case file was missing.\n\nSo all we can go on as far as the official records go is the death certificate. Which means that I lied to you at the start of the episode. Because officially, no matter what impression you might have got from everything I just said, Bobby Fuller's death *was* an accident.",
  "itunes:subtitle": "Episode one hundred and thirty-eight of A History of Rock Music in Five Hundred Songs looks at “I Fought the Law, and at the mysterious death of Bobby Fuller. Click the full post to read liner notes, links to more information, and a transcript of the epi",
  "itunes:keywords": "Arthur Lee,Barry White,Bob Keane,Bobby Fuller,Bobby Vee,Buddy Holly,Carol Connors,David Gates,Eddie Cochran,Jerry Allison,Johnny Echols,Norman Petty,Sonny Curtis,the Crickets,The Everly Brothers,Trini Lopez",
  "itunes:episode": 138,
  "content:encoded": "Episode one hundred and thirty-eight of <em>A History of Rock Music in Five Hundred Songs</em> looks at “I Fought the Law\", and at the mysterious death of Bobby Fuller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, <a href=\"https://www.patreon.com/posts/59354436\">on \"Hanky Panky\" by Tommy James and the Shondells</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com</a>\n\n\n\nNo Mixcloud this week due to the large number of tracks by the Bobby Fuller Four\n\n<strong>Resources</strong>\n\nInformation about the Crickets' post-Holly work comes from <a href=\"https://amzn.to/2PrUozx\">Buddy Holly: Learning the Game</a>, by Spencer Leigh.\n\nThere are two books available about Bobby Fuller -- the one I consulted most is <em>Rock and Roll Mustangs</em> by Stephen McParland, which can be bought as a PDF from <a href=\"https://payhip.com/cmusicbooks\">https://payhip.com/cmusicbooks</a>\n\nI also consulted <a href=\"https://amzn.to/3d3NQ51\"><em>I Fought the Law: The Life and Strange Death of Bobby Fuller</em> </a>by Miriam Linna and Randell Fuller.\n\nOne minor note -- both these books spell Bob Keane's name Keene. Apparently he spelled it multiple ways, but I have chosen to use the spelling he used on his autobiography, which is also the spelling I have used for him previously.\n\nThere are several compilations available of the Bobby Fuller Four's material, but the best collection of the hit singles is <a href=\"https://amzn.to/3xGK5fr\"><em>Magic Touch: The Complete Mustang Singles Collection</em>. </a>\n\nAnd <a href=\"https://amzn.to/3EbSBWk\">this</a> is an expanded edition of the Crickets' <em>In Style</em> album.\n\n<strong>Erratum</strong>\n\nI say Sonny Curtis wrote \"Oh Boy!\" -- I meant Sonny West.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\nA warning, before I begin. This episode, more than most, deals with events you may find disturbing, including graphic descriptions of violent death. Please check the transcript on the podcast website at 500songs.com if you are worried that you might be upset by this. This episode will not be a pleasant listen. Now on with the episode...\n\nMore than anything, Bobby Fuller wanted desperately to be Buddy Holly. His attitude is best summed up in a quote from Jim Reese, the guitarist with the Bobby Fuller Four, who said \"Don't get me wrong, I thought the world of Bobby Fuller and I cared a lot for him, so I say this with the best intentions -- but he was into Buddy Holly so much that if Buddy Holly decided to wear one red sock and one blue sock and Bobby Fuller found out about it, Bobby Fuller would've had one red sock and one blue sock. He figured that the only way to accomplish whatever Buddy Holly had accomplished was to be as much like Buddy Holly as possible.\"\n\nAnd Reese was right -- Bobby Fuller really was as much like Buddy Holly as possible. Buddy Holly was from Texas, so was Bobby Fuller. Buddy Holly played a Fender Stratocaster, Bobby Fuller played a Fender Stratocaster. Buddy Holly performed with the Crickets, Bobby Fuller's biggest hit was with a Crickets song. Buddy Holly recorded with Norman Petty, Bobby Fuller recorded with Norman Petty.\nOf course, there was one big difference. Buddy Holly died in an accident when he was twenty-two. Bobby Fuller lived to be twenty-three. And his death was no accident...\n\n[Excerpt: The Bobby Fuller Four, \"I Fought the Law\"]\n\nAfter Buddy Holly quit the Crickets in 1958, they continued recording with Norman Petty, getting in guitarist Sonny Curtis, who had been an associate of the band members even before they were a band, and who had been a frequent collaborator with Buddy, and vocalist Earl Sinks. But while they kept recording, Petty didn't release any of the recordings, and the group became convinced that he wasn't really interested in doing so. Rather, they thought that he was just using them as leverage to try to get Buddy back.\n\n\"Love's Made a Fool of You\" was the record that made the Crickets lose their faith in Norman Petty. The song was one that Buddy Holly and Bob Montgomery had written way back in 1954, and Holly had revived it for a demo in 1958, recording it not as a potential song for himself but to give to the Everly Brothers, reworked in their style, though they never recorded it:\n\n[Excerpt: Buddy Holly, \"Love's Made a Fool of You\"]\n\nWhen Holly and the Crickets had parted ways, the Crickets had recorded their own version of the song with Petty producing, which remained unreleased like everything they'd recorded since Buddy left.\nBut on the very day that Buddy Holly died, Petty shipped a copy of the tape to Decca, express mail, so that a single could be released as soon as possible:\n\n[Excerpt: The Crickets, \"Love's Made a Fool of You\"]\n\nThe Crickets never worked with Norman Petty again after that, they were so disgusted at his determination to cash in on the death of their friend and colleague. Petty continued to exploit Holly's work, getting in a band called the Fireballs to add new instrumental backing to Holly's old demos so they could be released as new singles, but the split between Petty and Holly's living colleagues was permanent.\n\nBut the Crickets didn't give up performing, and continued recording new material, mostly written either by Sonny Curtis or by the group's drummer Jerry Allison, who had co-written several of the group's earlier hits with Holly.\n\n\"More Than I Can Say\" was written by Curtis and Allison, and didn't make the top forty in the US, but did become a top thirty hit in the UK:\n\n[Excerpt: The Crickets, \"More Than I Can Say\"]\n\nThat was later also covered in hit versions by Bobby Vee and Leo Sayer. The B-side, \"Baby My Heart\", wasn't a hit for the Crickets, but was covered by the Shadows on their first album, which made number one on the UK charts. That performance was one of the few Shadows records at this point to have vocals:\n\n[Excerpt: The Shadows, \"Baby My Heart\"]\n\nThe group's first post-Holly album collected all their singles without Holly to that point, plus a few new filler tracks. The album, In Style With the Crickets, didn't chart in the US, but was a success in the UK.\nAround the time that album was released, Earl Sinks quit the group, and became a songwriter. He collaborated with Buddy Holly's old musical partner Bob Montgomery on a variety of hits for people like Brenda Lee, and in the seventies went back into performing for a while, having minor solo country hits as Earl Richards, and then bought a chain of abbatoirs.\n\nAllison and Curtis supplemented their income from the Crickets with session work -- Allison backed the Everly Brothers on \"Til I Kissed You\":\n\n[Excerpt: The Everly Brothers, \"Til I Kissed You\"]\n\nand both of them played on Eddie Cochran's last studio session, playing on \"Three Steps to Heaven\", with Curtis playing the electric lead while Cochran played the acoustic:\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nAfter that, the group went on tour in the UK as the backing band for the Everly Brothers, where they coincidentally bumped into Cochran, who told them \"If I knew you guys were coming, I’d have asked you to bring me a bottle of American air.” They would never see Cochran again.\n\nShortly after that tour, Sonny Curtis was drafted -- though while he was in the army, he wrote \"Walk Right Back\" for the Everly Brothers, as we discussed in the episode on \"Cathy's Clown\":\n\n[Excerpt: The Everly Brothers, \"Walk Right Back\"]\n\nJoe Mauldin gave up on music for a while, and so for a while The Crickets consisted of just Jerry Allison, new singer Jerry Naylor, and guitarist Tommy Allsup, who had played with Holly after Holly left the Crickets. That lineup recorded the \"Bobby Vee Meets the Crickets\" album, with Bobby Vee singing lead:\n\n[Excerpt: Bobby Vee and the Crickets, \"Well... All Right\"]\n\nCurtis would return once his time in the army was over, and eventually, in the 1970s, the group would stabilise on a lineup of Curtis, Mauldin, and Allison,  who would play together more or less consistently until 2015. But for a few years in the early sixties there was a lot of lineup shuffling, especially as Allison got drafted not long after Curtis got out of the Army -- there was one UK tour where there were no original members at all, thanks to Allison's absence.\n\nWhen Curtis was out of the group around the time of the Bobby Vee album, Snuff Garrett tried to get a friend of his to join as the group's new lead singer, and brought him to LA, but it didn't work out. Garrett later said \"He and Jerry didn’t hit it off in the way I imagined. After a few months, it was over and the guy started playing clubs around LA. I did demos with him and took them to my boss, the president of Liberty, and he said, ‘You’ve got enough of your friends signed to the label. You’ve signed the Crickets and Buddy Knox and they’re not doing much business, and this guy can hardly speak English.’ I said, ‘Well, I think he’s going to be something.’ ‘Okay,’ he said, ‘Drop one of the acts you’ve got and you can sign him.’ I said, ‘Forget it.’ A year later, he was an international star and his name was Trini Lopez\"\nLopez's big hit, \"If I Had a Hammer\", was recorded in a live show at a club called PJs:\n\n[Excerpt: Trini Lopez, \"If I Had a Hammer\"]\n\nPJs was owned by a gangster named Eddie Nash, who is now best known as the prime suspect in a notorious case known as the Wonderland Murders, when in 1981 four people were horribly beaten to death, either with the assistance of or to send a message to the porn star John Holmes, depending on which version of the story you believe. If you're unfamiliar with the case, I advise you not to google it, as it's very far from pretty.\n\nI bring this up because PJs would soon play a big part in the career of the Bobby Fuller Four.\nBobby Fuller was born in the Gulf Coast of Texas, but his family moved about a lot during his formative years, mostly in the Southwestern US, living in Lubbock, Texas, Hobbs, New Mexico, and Salt Lake City, Utah, among other places, before finally settling down in El Paso.\n\nEl Paso is a border town, right up close to the border with Mexico, and that meant that it had a complicated relationship with Juarez, the nearest large town on the Mexican side of the border. Between 1919 and 1933, the selling and consumption of alcohol had been made illegal in the United States, a period known as Prohibition, but of course it had not been criminalised in Mexico, and so during those years any time anyone from El Paso wanted to get drunk they'd travel to Juarez. Even after Prohibition ended, Juarez had a reputation as a party town, and Randy Fuller, Bobby's brother, would later tell a teen magazine \"You can grow up in El Paso and get really bad -- it's Juarez that makes it that way. Whatever personality you have, you have it 100%. You can go to Juarez and get drunk, or stay in El Paso and get religion\"\n\nOf course, from the outside, that sounds a whole lot like \"now look what YOU made ME do\". It's not the fault of those white people from Texas that they travel to someone else's city in someone else's country and get falling-down drunk and locked up in their jails every weekend, but it's the fault of those tempting Mexicans.\n\nAnd when Bobby and Randy Fuller's older brother Jack disappeared in 1961, while Bobby was off at university, that was at first what everyone thought had happened -- he'd gone to Juarez, got drunk, and got locked up until he could sleep it off. But when he didn't reappear after several days, everyone became more concerned. It turned out that Jack had met a man named Roy Handy at a bus depot and started chatting with him. They'd become friendly, and had gone off to do some target shooting together in the desert. But Handy had seen what looked like a wad of thousand-dollar bills in Jack's sun visor, and had decided to turn the gun on Jack rather than the target, killing him.\n\nThe thousand-dollar bills had been play money, a gift bought for a small child who lived nearby.\nBecause of the murder, Bobby Fuller moved back to El Paso from Denton in North Texas, where he had been studying music at university. He did enroll in a local college, but gave up his studies very quickly. Bobby had been something of a musical prodigy -- his original plan before going to North Texas State University had actually been to go to Juilliard, where he was going to study jazz drumming. Instead, while Bobby continued his drumming, he started living a party lifestyle, concentrating on his car, on women -- he got multiple women pregnant in his late teens and early twenties -- and on frequent trips to Juarez, where he would spend a lot of time watching a local blues musician, Long John Hunter:\n\n[Excerpt: Long John Hunter, \"El Paso Rock\"]\n\nMeanwhile, a music scene had been growing in El Paso since the late 1950s. A group called the Counts were at the forefront of it, with instrumentals like \"Thunder\":\n\n[Excerpt: The Counts, \"Thunder\"]\n\nThe Counts splintered into various groups, and one of them became The Embers, who Bobby Fuller joined on drums. Fuller was also one of a tiny number of people at this time who actually had a home studio. Fuller had started out with a simple bedroom studio, but thanks to his parents' indulgence he had repurposed a big chunk of their house as a studio, including building, with his brother Randy, an echo chamber (though it didn't work very well and he stuck with tape echo).\n\nIt was in that home studio that the Embers recorded their first single, \"Jim's Jive\", with Fuller on drums and Jim Reese on lead guitar:\n\n[Excerpt: Jerry Bright and The Embers, \"Jim's Jive\"]\n\nThat was released on a tiny local label, Yucca Records, which also released the Embers' second single -- and also released two Bobby Fuller solo singles, starting with \"You're in Love\":\n\n[Excerpt: Bobby Fuller, \"You're in Love\"]\n\nThat was recorded at Fuller's home studio, with the Embers backing him, and became the number one single locally, but Yucca Records had no national distribution, and the record didn't get a wider release.\nFuller's second single, though, was the first time his Buddy Holly fixation came to the forefront. Fuller was, by many accounts, *only* interested in sounding like Buddy Holly -- though his musical tastes were broad enough that he also wanted to sound like Eddie Cochran, Ritchie Valens, and the Crickets. But that was the extent of Fuller's musical world, and so obviously he wanted to work with the people who had worked with Holly. So his second single was recorded at Norman Petty's studio in Clovis, New Mexico, with Petty's wife Vi, who had played keyboards on some Buddy Holly records, on keyboards and backing vocals:\n\n[Excerpt: Bobby Fuller, \"Gently My Love\"]\n\nBut as it turned out, Fuller was very underwhelmed by the experience of working with Petty, and decided that he was going to go back to recording in his home studio.\n\nFuller left the Embers and started performing on his own, playing rhythm guitar rather than drums, with a band that initially consisted of his brother Randy on bass, Gaylord Grimes on drums, and Jim Reese on lead guitar, though there would be constant lineup changes.\n\nTwo of the many musicians who drifted in and out of Fuller's revolving band lineup, Larry Thompson and Jerry Miller, were from the Pacific Northwest, and were familiar with the scene that I talked about in the episode on \"Louie, Louie\". Thompson was a fan of one of the Pacific Northwest bands, the Frantics, who had hits with tracks like \"Werewolf\":\n\n[Excerpt: The Frantics, \"Werewolf\"]\n\nThompson believed that the Frantics had split up, and so Fuller's group took on that name for themselves. When they found out that the group *hadn't* split up, they changed their name to the Fanatics, though the name on their bass drum still read \"The Frantics\" for quite a while. Jerry Miller later moved back to Seattle, where he actually joined the original Frantics, before going on to become a founder member of Moby Grape.\n\nFuller started his own record label, Eastwood Records, and put out another solo single, which covered the full breadth of his influences. The B-side was \"Oh Boy!\", the song Sonny Curtis had written for Buddy Holly, while the A-side was \"Nervous Breakdown\", which had originally been recorded by Eddie Cochran:\n\n[Excerpt: Bobby Fuller, \"Nervous Breakdown\"]\n\nEverything was very fluid at this point, with musicians coming and going from different lineups, and none of these musicians were only playing in one band. For example, as well as being lead guitarist in the Fanatics, Jim Reese also played on \"Surfer's Paradise\" by Bobby Taylor and the Counts:\n\n[Excerpt: Bobby Taylor and the Counts, \"Surfer's Paradise\"]\n\nAnd Bobby's record label, renamed from Eastwood to Exeter, was releasing records  by other artists as well as Bobby and the Fanatics, though none of these records had any success.\nIn early 1963 Fuller and his latest lineup of Fanatics -- Randy, drummer Jimmy Wagnon, and guitarist Tex Reed -- travelled to LA to see if they could become successful outside El Paso. They got a residency at the Hermosa Biltmore, and also regularly played the Rendezvous Ballroom in Balboa, where the Beach Boys and Dick Dale had both played not long before, and there they added some surf instrumentals to their repertoire. Bobby soon became almost as keen on surf music as he was on rockabilly. While in LA, they tried all the record companies, with no success. The most encouragement they got came from Bob Keane at Del-Fi, the label that had previously been Ritchie Valens' label, who told him that the tapes they brought him of their El Paso recordings sounded good but they needed better songs, and to come back to him when they had a hit song. Bobby determined to do just that.\n\nOn their return to El Paso, Bobby Fuller and the Fanatics recorded \"Stringer\" for Todd Records, a small label owned by Paul Cohen, the former Decca executive who had signed Buddy Holly but not known what to do with him:\n\n[Excerpt: Bobby Fuller and the Fanatics, \"Stringer\"]\n\nFuller also opened his own teen nightclub, the Teen Rendezvous, which he named after the Balboa ballroom. The Fanatics became the regular band there, and at this point they started to build up a serious reputation as live performers. The Teen Rendezvous only stayed open for a few months, though -- there were complaints about the noise, and also they booked Bobby Vee as a headliner one night. Vee charged a thousand dollars for his appearance, which the club couldn't really afford, and they didn't make it back on the doors. They'd hoped that having a prestigious act like Vee play there might get more people to come to the club regularly, but it turned out that Vee gave a sub-par performance, and the gamble didn't pay off.\n\nIt was around this time that Fuller made his first recording of a song that would eventually define him, though it wasn't his idea. He was playing the Crickets In Style album to his brother Randy, and Randy picked up on one song, a Sonny Curtis composition which had never been released as a single:\n\n[Excerpt: The Crickets, \"I Fought the Law\"]\n\nRandy thought the Crickets' actual record sounded horrible, but he also thought the song had the potential to be a really big hit. He later explained \"The James Dean movie Rebel Without a Cause had made a big impression on me, and I told Bobby, 'Man, let's do that one... it oughta sell a million copies'. Everyone was into the whole rebel thing, with switchblades and stuff like that. It just seemed like a natural thing for us to do.\"\n\nFuller recorded his own version of the song, which once again became a local hit:\n\n[Excerpt: Bobby Fuller, \"I Fought The Law (El Paso version)\"]\n\nBut even though the record did get some national distribution, from VeeJay Records, it didn't get any airplay outside the Southwest, and Fuller remained a local star with absolutely no national profile.\nMeanwhile, he was still trying to do what Bob Keane had asked and come up with a hit song, but he was stuck in a musical rut. As Jim Reese would later say, \"Bobby was a great imitator. He could sing just like Holly, McCartney, Lennon, or Eddie Cochran. And he could imitate on the guitar, too. But Bobby never did Bobby\".\n\nTo make matters worse, the Beatles came on to the American musical scene, and caused an immediate shift in the public taste. And Bobby Fuller had a very complicated relationship with the Beatles. He had to play Beatles songs live because that's what the audiences wanted, but he felt that rock and roll was *American* music, and he resented British people trying to play it. He respected them as songwriters, but didn't actually like their original material. He could tell that they were huge Buddy Holly fans, like him, and he respected that, but he loathed Motown, and he could tell they were listening to that too. He ended up trying to compromise by playing Buddy Holly songs on stage but introducing them by talking about how much the Beatles loved Buddy Holly.\n\nAnother person who was negatively affected by the British Invasion was Bob Keane, the man who had given Fuller some encouragement. Keane's Del-Fi Records had spent the previous few years making a steady income from churning out surf records like \"Surf Rider\" by the Lively Ones:\n\n[Excerpt: The Lively Ones, \"Surf Rider\"]\n\nAnd the Surfer's Pajama Party album by the Bruce Johnston Surfing Band:\n\n[Excerpt: Bruce Johnston, \"The Surfer Stomp\"]\n\nBut as surf music had suddenly become yesterday's news, Del-Fi were in financial trouble, and Keane had had to take on a partner who gave the label some financial backing, Larry Nunes. Now, I am going to be very, very, careful about exactly what I say about Nunes here. I am aware that different people give very, very, different takes on Nunes' personality -- Barry White, for example, always said that knowing Nunes was the best thing that ever happened to him, credited Nunes with everything good in his career, and gave him credit on all his albums as his spiritual advisor.\n\nHowever, while White made Nunes out to be pretty much a saint, that is not the impression one gets from hearing Bob Keane or any of Bobby Fuller's circle talk about him.\n\nNunes had started out in the music business as a \"rack jobber\", someone who ran a small distribution company, selling to small family-owned shops and to secondary markets like petrol stations and grocery stores. The business model for these organisations was to get a lot of stock of records that hadn't sold, and sell them at a discount, to be sold in discount bins. But they were also a perfect front for all sorts of criminal activity. Because these were bulk sales of remaindered records, dead stock, the artists weren't meant to get royalties on them, and no real accounting was done of the sales. So if a record label \"accidentally\" pressed up a few thousand extra copies of a hit record and sold it on to a rack jobber, the artists would never know. And if the Mafia made a deal with the record pressing plant to press up a few thousand extra copies, the *record label* would never know. And so very, very, quickly this part of the distribution system became dominated by organised crime.\n\nI have seen no proof, only rumours, that Nunes was directly involved in organised crime, but Bob Keane in particular later became absolutely convinced he was. Keane would later write in his autobiography: “I wondered if I had made a deal with the Devil. I had heard that Larry had a reputation for being associated with the Mob, and as it turned out three years later our relationship ended in deception, dishonesty, and murder. I consider myself very lucky to have come out of my relationship with Nunes in one piece, virtually unscathed.\"\n\nAgain, this is Keane's interpretation of events. I am not saying that Larry Nunes was a mobster, I am saying that Bob Keane repeatedly made that accusation many times, and that other people in this story have said similar things.\n\nBy late 1964, Bobby Fuller had come up with a song he was pretty sure *would* be a successful single, like Keane had wanted, a song called \"Keep on Dancing\" he'd written with Randy:\n\n[Excerpt: Bobby Fuller, “Keep On Dancing”]\n\nAfter some discussion he managed to persuade Randy, Jim Reese, and drummer DeWayne Quirico to move with him to LA -- Bobby and Randy's mother also moved with them, because after what had happened to her eldest son she was very protective of her other children.\n\nJim Reese was less keen on the move than the others, as he thought that Fuller was only interested in himself, not in the rest of the Fanatics. As Reese would later say, \"Bobby wanted us all to go to California, but I was leery because it always had been too one-sided with Bobby. He ran everything, hired and fired at the least whim, and didn't communicate well with other people. He was never able to understand that a musician, like other people, needs food, gasoline, clothes, a place to live, etc. I often felt that Bobby thought we should be following him anywhere just for the thrill of it.\"\n\nEventually, Fuller got them to go by agreeing that when they got to LA, everything would be split equally -- one for all and all for one, though when they finally made a deal with Keane, Fuller was the only one who ended up receiving royalties. The rest of the group got union scale.\n\nKeane agreed that \"Keep on Dancing\" could be a hit, but that wasn't the first record the group put out through one of Keane's labels. The first was an instrumental titled \"Thunder Reef\":\n\n[Excerpt: The Shindigs, \"Thunder Reef\"]\n\nThat wasn't released as by the Fanatics, but as by The Shindigs -- Keane had heard that Shindig! needed a house band and thought that naming the group after the show might be a way to get them the position. As it happened, the TV show went with another group, led by James Burton, who they called the Shindogs, and Keane's plan didn't work out.\n\nThe Shindigs single was released on a new Del-Fi subsidiary, Mustang, on which most future records by the group would be released. Mustang was apparently set up specifically for the group, but the first record released on that label was actually by a studio group called The Surfettes:\n\n[Excerpt: The Surfettes, \"Sammy the Sidewalk Surfer\"]\n\nThe Surfettes consisted of Carol Connors, the former lead singer of the Teddy Bears and writer of \"Hey Little Cobra\", and her sister Cheryl. Carol had written the single with Buzz Cason, of Brenda Lee's band, and the session musicians on that single included several other artists who were recording for Del-Fi at the time -- David Gates, Arthur Lee, and Johnny Echols, all of whom we'll be hearing more about in future episodes.\n\nAlmost simultaneously with the Shindigs single, another single by the Fanatics was released, \"Those Memories of You\":\n\n[Excerpt: Bobby Fuller and the Fanatics, \"Those Memories of You\"]\n\nThat single, backed by a surf instrumental called \"Our Favourite Martian\", was released on Donna Records, another Del-Fi subsidiary, as by Bobby Fuller and the Fanatics, which made the other group members furious -- what had happened to one for all and all for one? Randy Fuller, who was a very aggressive young man, was so annoyed that he stormed into Bob Keane's office and frisbeed one of the singles at his head.\n\nThey didn't want to be Bobby's backing band, they wanted to be a proper group, so it was agreed the group's name would be changed.\n\nIt was changed to The Bobby Fuller Four.\n\nJim Reese claimed that Keane and Fuller formed The Bobby Fuller Four Inc, without the other three members having participation, and made them employees of the corporation. Reese said \"this didn't fit in with my concept of the verbal agreement I had with Bobby, but at least it was better than nothing\".\n\nThe group became the house band at the Rendezvous, playing their own sets and backing people like Sonny and Cher. They then got a residency at the Ambassador Hotel in Hollywood, and then Jim Reese quit the band. Fuller phoned him and begged him to come back, and as Reese said later \"I again repeated my conditions about equal treatment and he agreed, so I went back -- probably the biggest mistake I ever made.\"\n\nThe group's first single as the Bobby Fuller Four, released on Mustang as all their future records were, was \"Take My Word\":\n\n[Excerpt: The Bobby Fuller Four, \"Take My Word\"]\n\nThe record was unsuccessful -- Keane's various labels, while they were better distributed than Bobby's own labels back in El Paso, still only had spotty distribution, and Mustang being a new label it was even more difficult to get records in stores.\n\nBut the group were getting a reputation as one of the best live acts in the LA area at the time. When the club Ciro's, on the Sunset Strip, closed and reopened under its new name It's Boss, the group were chosen to perform at its grand reopening, and they played multiple four- to six-week residencies at PJ's.\n\nThe next record the group released, \"Let Her Dance\", was a slight rewrite of \"Keep on Dancing\", the song the Fuller brothers had written together, though Bobby was the only credited writer on the label:\n\n[Excerpt: The Bobby Fuller Four, \"Let Her Dance\"]\n\nThat was the first single they recorded at a new state-of-the-art studio Keane had opened up. That studio had one of the first eight-track machines in LA, and a truly vast echo chamber, made up from a couple of unused vaults owned by a bank downstairs from the studio.\n\nBut there were big arguments between Fuller and Keane, because Fuller wanted only to make music that could be reproduced live exactly as it was on the record, while Keane saw the record as the important thing.\n\nKeane put a percussion sound on the record, made by hitting a bottle, which Fuller detested as they couldn't do it live, and the two would only end up disagreeing more as they continued working together.\nThere's a lot of argument among Fuller fans about this -- personally I can see both sides, but there are people who are very much Team Bobby and think that nothing he recorded for Mustang is as good as the El Paso recordings, because of Bob Keane diluting the raw power of his live sound. But in an era  where studio experimentation was soon to lead to records like \"Strawberry Fields Forever\" or \"Good Vibrations\", I think a bit of extra percussion is hardly an unforgivable dilution:\n\n[Excerpt: The Bobby Fuller Four, \"Let Her Dance\"]\n\nKRLA radio started playing \"Let Her Dance\" every hour, at the instigation of Larry Nunes -- and most of the people talking about this have implied that he bribed people in order to get this to happen, or that it was through his alleged Mob connections. Certainly, he knew exactly when they would start playing the record, and how frequently, before they did.\n\nAs a result of this exposure, \"Let Her Dance\" became a massive local hit, but they still didn't have the distribution to make it a hit outside California.\n\nIt did, though, do well enough that Liberty Records asked about putting the record out nationally. Keane came to a verbal agreement, which he thought was an agreement for Liberty to distribute the Mustang Records single, and Liberty thought was an agreement to put out the single on their own label and have an option on future Fuller recordings.\n\nLiberty put the record out on their own label, without Keane having signed anything, and Keane had to sue them. The result was that the record was out on two different labels, which were suing each other, and so it hardly had any chance at any kind of success.\n\nThe legal action also affected the next single, \"Never to Be Forgotten\":\n\n[Excerpt: The Bobby Fuller Four, \"Never to Be Forgotten\"]\n\nThat's often considered the best of the band's originals for Mustang, and was written by the Fuller brothers -- and both of them were credited this time -- but Liberty sued Keane, claiming that because they'd released \"Let Her Dance\", they also had an option on the next single.\n\nBut even though the group still weren't selling records, they were getting other opportunities for exposure, like their appearance in a film which came out in April 1966. Though admittedly, this film was hardly A Hard Day's Night.\n\nIndeed, a lot of people have claimed that The Ghost in the Invisible Bikini was cursed. The film, which went through the working titles Pajama Party in a Haunted House, Slumber Party in a Haunted House, Bikini Party in a Haunted House, and Ghost in a Glass Bikini, was made by the cheapy exploitation company American International Pictures, and several people involved in it would die in the next four years, starting with Buster Keaton, who was meant to appear in the film, but had to back out due to his health problems and died before the film came out. Then on the first day of filming, a grip fell to his death. In the next four years, two of the film's young stars, Sue Hamilton and John Macchia, would die, as would Philip Bent, an actor with a minor role who died in July 1966 in a plane crash which also took the life of Peter Sachse, an extra on the film who was married to a cast member. Three more stars of the film, Francis X Bushman, Basil Rathbone, and Boris Karloff would also all be dead within a handful of years, but they were all elderly and unwell when filming started.\n\nI don't believe in curses myself, but it is a horrible run of bad luck for a single film.\n\nTo make matters worse, the group weren't even playing their own music in the film, but lipsynching to tracks by other musicians. And they had to play Vox instruments in the film, because of a deal the filmmakers had made, when the group all hated Vox instruments, which Jim Reese thought of as only good for starting bonfires.\n\nFor the next single, Keane had discussed with Fuller what songs the group had that were \"different\", but Fuller apparently didn't understand what he meant. So Keane went to the rest of the group and asked them what songs always went over well in live performances.\n\nAll three band members said that \"I Fought the Law\" should be the next single. Bobby disagreed, and\nalmost got into a fistfight with his brother over it -- they'd already released it as a single once, on his own label, and he didn't want to do it again. He also wanted to record his own material not cover versions. But the others prevailed, and \"I Fought the Law\" became the record that would define the group:\n\n[Excerpt: The Bobby Fuller Four, \"I Fought the Law\"]\n\n\"I Fought the Law\" became the group's breakthrough hit. It made the top ten, and turned the song, which had previously been one of the Crickets' most obscure songs, into a rock and country standard. In the seventies, the song would be recorded by Hank Williams Jr, the Clash, the Dead Kennedys and more, and all of them would be inspired by the Bobby Fuller Four's version of the song, not the Crickets' original.\nAround this time, the group also recorded a live album at PJs, in the hope of duplicating Trini Lopez's success with his earlier album. The album was shelved, though, because it didn't capture the powerhouse live act of the group's reputation, instead sounding rather dull and lifeless, with an unenthused audience:\n\n[Excerpt: The Bobby Fuller Four, \"Oh Boy!\"]\n\nWhile \"I Fought the Law\" was a huge success, it started a period of shifts within the band. Shortly after the PJs album was recorded, DeWayne Quirico quit the band and moved back to El Paso. He was temporarily replaced by Johnny Barbata, who would later become a member of the Turtles, before Fuller's preferred replacement Dalton Powell was able to get to LA to join the band. There seems to have been some shuffling about, as well, because as far as I can tell, Powell joined the band, then quit and was replaced by Barbata returning, and then rejoined again, all in about a six month period.\nGiven the success of \"I Fought the Law\", it only made sense that at their first recording session with Powell, the group would record more tracks that had originally been on the Crickets' In Style album. One of these, their version of \"Baby My Heart\", went unreleased at the time, though to my taste it's the best thing the group ever did:\n\n[Excerpt: The Bobby Fuller Four, \"Baby My Heart\"]\n\nThe other, \"Love's Made a Fool of You\", became the group's next single:\n\n[Excerpt: The Bobby Fuller Four, \"Love's Made a Fool of You\"]\n\n\"Love's Made a Fool of You\" was also a success, making number twenty-six in the charts, but the group's next session, which would produce their last single, was the cause of some conflict.\n\nKeane had noticed that soul music was getting bigger, and so he'd decided to open up a sister label to Mustang, Bronco, which would release soul and R&B music. As he didn't know much about that music himself, though of course he had worked with Sam Cooke, he decided to hire an A&R man to deal with that kind of music. The man he chose was a piano player named Barry White, still several years from making his own hit records.\n\nWhite had had some success as an arranger and producer already, having arranged \"The Harlem Shuffle\" for Bob and Earl, on which he also played piano:\n\n[Excerpt: Bob and Earl, \"The Harlem Shuffle\"]\n\nDespite White's remit, the records he produced for Bronco and Mustang weren't especially soulful. \"Back Seat 38 Dodge\" by Opus 1, for example, is a psychedelic updating of the kind of car songs that the Beach Boys and Jan and Dean had been doing a couple of years earlier:\n\n[Excerpt: Opus 1, \"Back Seat 38 Dodge\"]\n\nWhite was present at what became the final Bobby Fuller Four session, though accounts differ as to his involvement. Some have him arranging \"The Magic Touch”, others have him playing drums on the session, some have him co-producing. Bob Keane always said that the record had no involvement from White whatsoever, that he was there but not participating, but various band members, while differing on other things, have insisted that White and Fuller got into huge rows, as Fuller thought that White was trying to turn his music into Motown, which he despised.\n\nThe finished record does sound to me like it's got some of White's fingerprints on it:\n\n[Excerpt: The Bobby Fuller Four, \"The Magic Touch\"]\n\nBut \"The Magic Touch\" flopped -- it departed too far from the updated Buddy Holly sound of the group's hit singles, and audiences weren't responding. “The Ghost in the Invisible Bikini” came out and was an embarrassment to the band – and on July the eleventh the next in that horrible series of deaths linked to the film happened, the plane crash that killed Philip Bent and Peter Sachse.\n\nOn July the sixteenth, William Parker, the long-serving chief of the LAPD, had died. If, hypothetically, someone wanted to commit a crime in LA and not have it investigated too closely, the few days after Parker's death, when the entire department was in mourning and making preparations for a massive public funeral, would have been a good time to do so.\n\nTwo days after Parker's death, July the eighteenth 1966, was going to be the crunch point for the Bobby Fuller Four. They had a recording session scheduled for 8:30AM, but they also were planning on having a band meeting after the session, at which it was likely the group were going to split up. Jim Reese had just got his draft notice, Bobby and Randy were getting on worse, and nobody was happy with the music they were making. They were going to finish the album they were working on, and then Bobby was going to go solo.\n\nOr at least that was what everyone assumed -- certainly Ahmet Ertegun had been sniffing round Bobby as a solo artist, though Bobby kept saying publicly he wanted to continue working with the band. There were also later rumours that Morris Levy had been after Bobby, and had even signed him to a deal, though no documentary evidence of such a deal has surfaced. It seemed that if there was to be a group at all, it would just be a name for any random musicians Bobby hired.\n\nBobby also wanted to become a pure recording artist, and not tour any more -- he hated touring, thought people weren't listening to the band properly, and that being away from home meant he didn't have time to write songs, which in turn meant that he had to record what he thought of as substandard material by other people rather than his own original material. He wanted to stay in LA, play clubs, and make records.\nBut even though making records was what he wanted to do, Bobby never turned up for the recording session, and nor did he turn up for the group meeting afterwards.\n\nThe group's next single had been announced as \"It's Love Come What May\":\n\n[Excerpt: Randy Fuller, \"It's Love Come What May\"]\n\nWhen that was released, it was released as a Randy Fuller solo single, with Randy's voice overdubbed on top of Bobby's. Because there was no use putting out a record by a dead man.\n\nHere's what we actually know about Bobby Fuller's death, as far as I can tell. There are a lot of conflicting claims, a lot of counternarratives, and a lot of accusations that seek to tie in everyone from Charles Manson to Frank Sinatra, but this is as close as I can get to the truth.\n\nBobby and Randy were living together, with their mother, though Randy was out a lot of the time, and the two brothers at that point could barely stand to be in the same room with each other, as often happens in bands where brothers work together. On the night of July the seventeenth, Bobby Fuller left the house for a couple of hours after getting a phone call -- some people who were around said he was going to see a girlfriend named Melody to buy some acid from her, but she says he didn't see her that night.\n\nMelody was a sex worker, who was also reputedly the girlfriend of a local nightclub owner who had Mob connections and was jealous of her attachments to other men -- though she denies this. Nobody has ever named which club owner, but it's generally considered to be Eddie Nash, the owner of PJs. Melody was also friends with Larry Nunes, and says she acted as a go-between for Nunes and Fuller. Fuller got back in around 2:30 AM and spent some time having beer with the building manager.  Then at some point he went out again -- Bobby was a night owl.\n\nWhen his mother, Lorraine, woke up, she noticed her car, which Bobby often used to borrow, wasn't there. She had a terrible bad feeling about her son's whereabouts -- though she often had such feelings, after the murder of her eldest son. She kept checking outside every half hour or so to see if he was coming home.\nAt 5PM, two musicians from El Paso, Ty Grimes and Mike Ciccarelli, who'd come to LA to see Fuller, pulled into the parking lot near his apartment block. There were no other cars nearby. A car pulled in beside them, but they didn't pay any attention. They went up the stairs and rang the doorbell.\n\nWhile they were ringing the doorbell, Lorraine Fuller was out checking the mail, and noticed her car, which hadn't been there earlier. She opened the door.\n\nTy Grimes later said \"When we walked back to Mike's car, Bobby's car was now parked next to Mike's, and he was laying in the front seat already dead. We also saw his mom being helped toward the apartment.\"\nFuller had been dead long enough for rigor mortis to have set in. While Lorraine Fuller later said that his hand had been on the ignition key, there was actually no key found in the car. He had apparently died from inhaling petrol. His body was covered in bruises, and the slippers he was wearing looked like they'd been dragged across the ground. His body was covered in petrol, and his right index finger was broken.\n\nBob Keane has later said that Larry Nunes knew some details of the crime scene before he was told them. According to the other members of the band, there was an eight hundred thousand dollar life insurance policy on Bobby's life, held by the record company. Keane didn't get any money from any such policy, and stated that if such a policy existed it must have been taken out by Nunes, who soon stopped working with Keane, as Keane's labels collapsed without their one remaining star.\n\nThe death was initially ruled a suicide, which would not pay out on an insurance claim, and later changed to accidental death, which would. Though remember, of course, we have only the word of Bobby's other band members that any insurance policy existed. No real police investigation was ever carried out, because it was such an open-and-shut case. At no point was it ever considered a murder by the famously corrupt LAPD.\n\nBob Keane hired private investigators to investigate the case. One of them was shot at, and the others gave up on the investigation, scared to continue. The autopsy report that was issued months after the fact bore no resemblance to what any of the witnesses said they saw of the state of Fuller's body.\nMore than thirty years later, Keane tried to get the information the LAPD held about the case, and was told that it could only be accessed by a family member. Keane contacted Randy Fuller, who was then told that the entire case file was missing.\n\nSo all we can go on as far as the official records go is the death certificate. Which means that I lied to you at the start of the episode. Because officially, no matter what impression you might have got from everything I just said, Bobby Fuller's death *was* an accident.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-eight of A History of Rock Music in Five Hundred Songs looks at “I Fought the Law\", and at the mysterious death of Bobby Fuller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Hanky Panky\" by Tommy James and the Shondells.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com\n\n\n\nNo Mixcloud this week due to the large number of tracks by the Bobby Fuller Four\n\nResources\n\nInformation about the Crickets' post-Holly work comes from Buddy Holly: Learning the Game, by Spencer Leigh.\n\nThere are two books available about Bobby Fuller -- the one I consulted most is Rock and Roll Mustangs by Stephen McParland, which can be bought as a PDF from https://payhip.com/cmusicbooks\n\nI also consulted I Fought the Law: The Life and Strange Death of Bobby Fuller by Miriam Linna and Randell Fuller.\n\nOne minor note -- both these books spell Bob Keane's name Keene. Apparently he spelled it multiple ways, but I have chosen to use the spelling he used on his autobiography, which is also the spelling I have used for him previously.\n\nThere are several compilations available of the Bobby Fuller Four's material, but the best collection of the hit singles is Magic Touch: The Complete Mustang Singles Collection. \n\nAnd this is an expanded edition of the Crickets' In Style album.\n\nErratum\n\nI say Sonny Curtis wrote \"Oh Boy!\" -- I meant Sonny West.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\nA warning, before I begin. This episode, more than most, deals with events you may find disturbing, including graphic descriptions of violent death. Please check the transcript on the podcast website at 500songs.com if you are worried that you might be upset by this. This episode will not be a pleasant listen. Now on with the episode...\n\nMore than anything, Bobby Fuller wanted desperately to be Buddy Holly. His attitude is best summed up in a quote from Jim Reese, the guitarist with the Bobby Fuller Four, who said \"Don't get me wrong, I thought the world of Bobby Fuller and I cared a lot for him, so I say this with the best intentions -- but he was into Buddy Holly so much that if Buddy Holly decided to wear one red sock and one blue sock and Bobby Fuller found out about it, Bobby Fuller would've had one red sock and one blue sock. He figured that the only way to accomplish whatever Buddy Holly had accomplished was to be as much like Buddy Holly as possible.\"\n\nAnd Reese was right -- Bobby Fuller really was as much like Buddy Holly as possible. Buddy Holly was from Texas, so was Bobby Fuller. Buddy Holly played a Fender Stratocaster, Bobby Fuller played a Fender Stratocaster. Buddy Holly performed with the Crickets, Bobby Fuller's biggest hit was with a Crickets song. Buddy Holly recorded with Norman Petty, Bobby Fuller recorded with Norman Petty.\nOf course, there was one big difference. Buddy Holly died in an accident when he was twenty-two. Bobby Fuller lived to be twenty-three. And his death was no accident...\n\n[Excerpt: The Bobby Fuller Four, \"I Fought the Law\"]\n\nAfter Buddy Holly quit the Crickets in 1958, they continued recording with Norman Petty, getting in guitarist Sonny Curtis, who had been an associate of the band members even before they were a band, and who had been a frequent collaborator with Buddy, and vocalist Earl Sinks. But while they kept recording, Petty didn't release any of the recordings, and the group became convinced that he wasn't really interested in doing so. Rather, they thought that he was just using them as leverage to try to get Buddy back.\n\n\"Love's Made a Fool of You\" was the record that made the Crickets lose their faith in Norman Petty. The song was ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-eight of A History of Rock Music in Five Hundred Songs looks at “I Fought the Law\", and at the mysterious death of Bobby Fuller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"Hanky Panky\" by Tommy James and the Shondells.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com\n\n\n\nNo Mixcloud this week due to the large number of tracks by the Bobby Fuller Four\n\nResources\n\nInformation about the Crickets' post-Holly work comes from Buddy Holly: Learning the Game, by Spencer Leigh.\n\nThere are two books available about Bobby Fuller -- the one I consulted most is Rock and Roll Mustangs by Stephen McParland, which can be bought as a PDF from https://payhip.com/cmusicbooks\n\nI",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}