{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-5433272995422834472",
  "published": "2020-01-06T12:00:00.000-08:00",
  "updated": "2020-01-06T12:00:10.126-08:00",
  "title": "YouTube Originals announces new documentary, “Coachella: 20 Years in the Desert.\" Premieres March 31.",
  "content": "In celebration of Coachella's 20th anniversary, YouTube Originals is partnering with Coachella Valley Music and Arts Festival for a feature-length documentary, “Coachella: 20 Years in the Desert.” It is set to premiere March 31. The announcement comes on the heels of Coachella’s official <a href=\"https://www.coachella.com/\" target=\"_blank\">2020 lineup</a>, and for the tenth year in a row, YouTube is back as the exclusive live stream partner for both weekends of the iconic music festival. Watch the first teaser of “Coachella: 20 Years in the Desert” <a href=\"https://www.youtube.com/watch?v=7CO--JwYeec&amp;feature=youtu.be\" target=\"_blank\">here</a>. <br /><br />A documentary feature two decades in the making, “Coachella: 20 Years in the Desert” opens up the vault for the very first time to present the performances and behind-the-scenes stories that shaped the music festival. The film gives a rare look at Coachella’s colorful beginning, presents exclusive, never-before-seen footage and interviews, and features key performances from some of the biggest names in music, including Billie Eilish, Kanye West, Daft Punk, Travis Scott, BLACKPINK, LCD Soundsystem, Rage Against The Machine, Pixies, Swedish House Mafia, Jane’s Addiction, Björk, The White Stripes, Madonna, Moby, Beck, Radiohead and more. <br /><br />YouTube also announced today that it will return for the tenth year in a row as the official playlist and live stream partner for both weekends of Coachella. This year, YouTube Premium members will receive exclusive Coachella perks, including access to a members-only allocation of passes for purchase. As general on-sale Weekend 1 passes are sold out, YouTube Premium members are one of the only groups with access to this limited supply. YouTube continues to take the magic of Coachella beyond the Indio desert and into the homes and phones of millions of people around the world, providing a global stage for artists and fans to connect with live stream performances from headliners to some of the biggest artists on the rise.",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}