{
  "title": "How the Biden Administration Caved to Republicans on Fighting Election Disinformation",
  "link": "https://www.propublica.org/article/dhs-disinformation-elections-biden-gop-midterms",
  "pubDate": "Tue, 01 Nov 2022 05:00:00 -0400",
  "guid": "https://www.propublica.org/article/dhs-disinformation-elections-biden-gop-midterms",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/andrea-bernstein\">Andrea Bernstein</a> and <a class=\"name\" href=\"https://www.propublica.org/people/ilya-marritz\">Ilya Marritz</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">On his first full day in office, President Joe Biden directed his national security team to make a plan to confront domestic terrorism. In their ensuing report, Biden’s advisers homed in on “<a href=\"https://www.whitehouse.gov/wp-content/uploads/2021/06/National-Strategy-for-Countering-Domestic-Terrorism.pdf\">a crisis of disinformation and misinformation</a>.” The new administration, they pledged, would work to “counter the influence and impact of dangerous conspiracy theories that can provide a gateway to terrorist violence.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">But the reality of the administration’s efforts has been less robust than its rhetoric. Instead, a ProPublica review found, the Biden administration has backed away from a comprehensive effort to address disinformation after accusations from Republicans and right-wing influencers that the administration was trying to stifle dissent.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">In May, one Department of Homeland Security office instructed staffers that work on “sensitive” topics including disinformation should be put on “immediate hold,” according to material reviewed by ProPublica. In the months that followed, DHS canceled a series of planned contracts that would have tracked and studied the proliferation of disinformation and its connection with violent attacks. And after issuing six nationwide warnings about domestic terrorism fueled by disinformation in the first 13 months of the Biden administration, DHS has only issued one in the eight months since.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">The government’s retreat comes ahead of midterms in which election officials throughout the country are being inundated with <a href=\"https://www.propublica.org/article/north-carolina-election-denial-voting-surry\">false rumors about their work</a>. After talks on a project to help election officials monitor and respond to threats stalled, election officials from Colorado and Florida wrote a private letter in August to DHS Secretary Alejandro Mayorkas <a href=\"https://www.documentcloud.org/documents/23209406-ei-isac-ex-com-approved-letter-to-dhs\">pleading for help</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">“Threats and harassment of election officials has become an extremely serious concern and terribly frequent experience for election workers,” they warned, adding, “We are ourselves a crucial part of the nation’s critical infrastructure, in need of and deserving of protection.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">“Time is of the essence,” the officials wrote.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Weeks later, DHS scrapped the project.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">DHS’ change of course began after a storm erupted in May in reaction to the <a href=\"https://www.washingtonpost.com/technology/2022/05/18/disinformation-board-dhs-nina-jankowicz/\">administration’s creation of a Disinformation Governance Board</a>. Congressional Republicans called it a “Ministry of Truth.” The board was terminated just months later.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">Aspects of the administration’s retreat on disinformation have been reported, including a <a href=\"https://www.cnn.com/2022/09/20/politics/dhs-rejects-proposal-protect-election-officials-disinformation\">CNN story about the DHS’ rejection of a project</a> to protect election workers from harassment. But the extent of the turnabout has not been fully examined.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">“They paused all the work on disinformation, not just the board,” Nina Jankowicz, the former executive director of the DHS Disinformation Governance Board, told ProPublica. “The administration kowtowed to the disinformation rather than fighting it.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">It is not clear whether DHS’ initiatives would have made a significant difference in combating the tsunami of false rumors. But the current and former employees are frustrated that the agency’s efforts have been hobbled in response to political pressure.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">DHS maintains it has not retreated on its disinformation efforts. “We have worked for over a decade to address disinformation that poses a threat to that security. This critical work continues today across several DHS components, consistent with the law and in a manner that is transparent and upholds the privacy, civil rights and civil liberties of the American people,” a DHS spokesperson said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">The agency has stepped up some activity in recent weeks, increasing alerts and training for election workers. On Friday, DHS, along with the FBI, the Capitol Police and the National Counterterrorism Center, issued a bulletin warning that “election-related perceptions of fraud” will “likely” drive some extremists to attempt acts of violence.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">But, despite the initiatives, election administrators remain deeply concerned.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">“States need more support. It is clear that threats to election officials and workers are not dissipating and may only escalate around the 2022 and 2024 elections,” Colorado Secretary of State Jena Griswold, a Democrat, said in an email to ProPublica. “Election offices need immediate meaningful support from federal partners.”</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">The new administration moved quickly after Biden’s inauguration. Experts welcomed the increased pace of domestic terrorism warnings and their focus on false rumors that could be weaponized for violent ends. In September 2021, Mayorkas’ top aides suggested creating the disinformation board after identifying the problem as a “serious homeland security risk.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">In early 2022, the Cybersecurity and Infrastructure Security Agency, or CISA, which is part of DHS, was in talks to deploy a federally funded nonprofit to protect election workers from harassment and violence.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">The effort would have allowed elections officials to sign up for a service to protect them from having their identities and personal information exposed on the internet, known as doxxing. It also would have created a system to track and alert elections officials who were subject to serious threats on social media, including from foreign actors.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">Around the same time, as lies about elections were becoming a central plank of GOP candidates, Republicans also began to attack the administration’s efforts. Some free-speech advocates also expressed concerns about government overreach.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.19\">An early Republican critic was <a href=\"https://projects.propublica.org/represent/members/B001243-marsha-blackburn\">Sen. Marsha Blackburn, R-Tenn.</a> DHS had sent out an alert about “false or misleading narratives regarding unsubstantiated widespread election fraud.” <a href=\"https://www.foxnews.com/us/sen-blackburn-dhs-letter-anti-terrorism-bulletin\">Blackburn objected in </a><a href=\"https://www.foxnews.com/us/sen-blackburn-dhs-letter-anti-terrorism-bulletin\">a February letter</a> to Mayorkas, writing, “The Department comes dangerously close to suggesting that publicly disagreeing with the current administration is akin to domestic terrorism.” Blackburn did not respond to a request for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.20\">At that time, DHS was establishing the Disinformation Governance Board. It hired Jankowicz, an expert on disinformation, as its executive director. The board was tasked with coordinating all the efforts to confront the problem across the sprawling agency. The board’s charter was careful to note that the government needed to respect privacy and free speech.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.21\">Nevertheless, just hours after word leaked of its formation, right-wing media influencer Jack Posobiec issued a <a href=\"https://twitter.com/JackPosobiec/status/1519379124070068224\">series of tweets slamming the board</a>. Soon, Republican lawmakers like <a href=\"https://projects.propublica.org/represent/members/C001116-andrew-clyde\">Rep. Andrew Clyde, R-Ga.</a>, were calling the board a “Ministry of Truth,” an apparent reference to a fictional government body that feeds people lies in George Orwell’s “1984.” Clyde did not respond to a request for comment. About 70% of Fox News’ one-hour segments over the next week contained a reference to the board, according to a report by Advance Democracy, a nonprofit media research group. The New York Post ran a <a href=\"https://nypost.com/wp-content/uploads/sites/2/2022/04/Front_Cover-3.jpg?quality=75&strip=all&w=644\">cover with an image of Jankowicz</a> and the headline: “Big Sister Is Watching You.” Jankowicz was subject to an outpouring of degrading comments and death threats.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.22\">A senior DHS official who spoke for the administration said to ProPublica that the board had become “a distraction that was making it harder for us to do the work we thought was essential.” In May, DHS “paused” the board and Jankowicz resigned, just 10 weeks after she had begun work.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.23\">That’s when the word went out to DHS staffers that work on “sensitive” topics like disinformation should be put on hold. DHS had been negotiating with a security firm called Moonshot, which specializes in monitoring online threats for governments and social media platforms. After the criticism of the board, discussions were halted and the contract was not signed. Eventually, DHS also froze millions of dollars for disinformation research contracts with two universities and the Rand Corporation, according to three people familiar with the matter. And a CISA “Rumor Control” webpage for election workers issued no updates from May to October.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.24\">DHS’ rollback in an election year alarmed former senior officials in homeland security. One of them, Bob Kolasky, a former top CISA official under Trump and Biden, warned in <a href=\"https://www.hstoday.us/featured/column-the-country-cant-afford-a-pause-on-combating-disinformation-and-violence/\">an opinion piece</a> in a professional journal, “Many of our foreign allies, notably the Swedes and the French, have been much more aggressive in organizing to deal with the disinformation risk.” Without the board, “the country remains at risk.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.25\">The pausing of the board and Jankowicz’s exit did not placate critics on the right. On the House floor, <a href=\"https://projects.propublica.org/represent/members/B001302-andy-biggs\">Rep. Andy Biggs, R-Ariz.</a>, accused the Biden administration of trying “to target and silence citizens who disagree with government actions.” Biggs did not respond to a request for comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.26\">In August, with the disinformation board still leaderless and frozen, <a href=\"https://www.dhs.gov/news/2022/08/24/following-hsac-recommendation-dhs-terminates-disinformation-governance-board\">Mayorkas killed it for good</a>. The agency also <a href=\"https://www.cnn.com/2022/09/20/politics/dhs-rejects-proposal-protect-election-officials-disinformation\">canceled the CISA project with the nonprofit</a> that would have tracked online death threats to election workers and offered them enhanced protection of their personal information.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.27\">The DHS is not the only federal agency confronting the problem. The FBI, which is under the Department of Justice, also monitors such threats, but it is focused on gathering evidence of crimes. In 2021, the DOJ formed a <a href=\"https://www.justice.gov/opa/blog/justice-department-launches-task-force-combat-threats-against-election-workers-0\">task force</a> to investigate threats to election workers, inviting them to submit tips to the FBI. So far, more than 1,000 have come in, and the DOJ has filed eight cases against people who allegedly threatened workers with violence.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.28\">But experts say prosecutors and the FBI alone cannot effectively deal with the problem. DHS’ mission — to gather and share information with partners in government and law enforcement before crimes occur — is critical to prevention.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.29\">Today inside the department “scrutiny is over the top on anything to do with terrorism, extremism, violence prevention — especially domestic terrorism,” a current DHS official said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.30\">“The answer is not how do we do it better; in the face of criticism, it’s to shut it all down,” one former high-level DHS official told ProPublica. The officials were granted anonymity so that they didn’t suffer reprisals.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.31\">The bitter irony is not lost on experts in the field, who say that the attacks can have a chilling effect on outside researchers, too.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.32\">“The very thing we are studying is being used against us because the tactics work,” said University of Washington’s Kate Starbird, who advises DHS on disinformation and who herself has recently been subject to harassment based on rumors. “They undermine trust in institutions and in government and tie our hands when we try to protect ourselves.”</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.33\">With DHS stymied, election officials report it’s up to them to keep abreast of the false information and respond. Julie Slomski, clerk of Erie County, Pennsylvania, said she now spends about half of her workday explaining how elections work to angry or suspicious constituents. She gives out her cellphone number and tells people to call or text with questions. “Here in Erie County, we’re an open book,” she said. But she’s taking precautions. Slomski now wears a bulletproof backpack her sister bought her.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.34\">In lieu of a robust official government effort, the nonprofit Center for Internet Security, which had once hoped for government resources and sponsorship, is briefing election workers on how to keep track of false information and respond effectively.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.35\">“I was surprised at the number of people who came up to me afterwards saying, no one had told us about any of this,” said John Cohen, a former top DHS official in the Biden administration and currently in leadership at the Center for Internet Security.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.36\">Some elections officials, however, question whether the federal government should be involved in this effort at all. Michael Adams, Kentucky’s Republican secretary of state, said the election denialism he encounters is so disconnected from facts that “sometimes I’m at a loss to even know how to reason with these people.” Adams has <a href=\"https://www.governing.com/now/kentuckys-michael-adams-takes-on-election-conspiracies\">called out election conspiracies</a>, but he believes his constituents are more likely to accept information about elections as trustworthy if it comes from local officials.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.37\">“I don’t think that the federal government, the so-called deep state, putting out information and saying ‘trust us’ is an effective strategy for persuasion,” he said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.38\">But others say the federal government is doing too little, too late.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.39\">“We’re getting help, but much more is needed in certain areas,” Wesley Wilcox, supervisor of elections in Marion County, Florida, and one of the authors of the August letter to DHS pleading for help, said in a recent email to ProPublica. “I am NOT a proponent of a massive Federal Government intrusion. But, there are some very specialized areas that are a ‘best fit’ for the Federal Government.”</p>\n        \n    \n                    \n\n    <p>\n        <strong><a href=\"https://www.propublica.org/getinvolved/help-propublica-investigate-threats-to-u-s-democracy\">Help ProPublica Investigate Threats to U.S. Democracy</a></strong>\n    </p>\n\n        \n             \n\n                                    \n        \n                        <p><strong>Update, Nov. 1, 2022:</strong> This story was updated to include a reference to a CNN story about the DHS’ rejection of a project to protect election workers from harassment.</p>\n\n        \n\n    \n                                         ",
  "dc:subject": "Democracy",
  "dc:date": "2022-11-01T05:00:00-04:00",
  "dc:creator": "by Andrea Bernstein and Ilya Marritz"
}