{
  "id": "https://bibleinoneyear.org/en/youth/105",
  "title": "Day 105: Choose What You Remember",
  "description": "Psalm 45:17, Deuteronomy 24:17–22, 25:19, Luke 16:19–31, 17:1–6.  It is important to look back at your own life as well as the history of the church, both local and global, to remember all that God has done At the Last Supper, Jesus instituted the service of communion so that we would not forget the central events of world history – the death and resurrection of Jesus",
  "pubDate": "Fri, 15 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/105/",
  "itunes:duration": "13:56",
  "guid": "enyouth15042022-105",
  "length": 836.86,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 105: Choose What You Remember",
  "itunes:subtitle": "Psalm 45:17, Deuteronomy 24:17–22, 25:19, Luke 16:19–31, 17:1–6.  It is important to look back at your own life as well as the history of the church, both local and global, to remember all that God has done At the Last Supper, Jesus instituted the service of communion so that we would not forget the central events of world history – the death and resurrection of Jesus",
  "itunes:summary": "Memory is strange. There are some things I would prefer not to remember but find difficult to forget. There are other things that I would love to remember that are all too easily forgotten.\nThere are some things that are important for societies as a whole not to forget. All over the world, we see war memorials with the names of those who have died for their country. Often in Britain these memorials feature the words ‘Lest We Forget’. A plaque at Auschwitz Concentration Camp reads, ‘The one who does not remember history is bound to live through it again’ (George Santayana).\nWe do have some control over our memory. There are some things we are told in the Bible to ‘forget’. There are other things we are repeatedly called to ‘remember’. You can make choices about what you choose to ‘forget’ and what you choose to ‘remember’.\nThe word ‘remember’ in its various Hebrew and Greek forms occurs over 250 times in the Bible. It is so easy to forget all that God has done for you. It is important to look back at your own life as well as the history of the church, both local and global, to remember all that God has done.\nAt the Last Supper, Jesus instituted the service of communion so that we would not forget the central events of world history – the death and resurrection of Jesus.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 470
}