{
  "title": "A Bourgeoisie Primer",
  "link": "https://danielmiessler.com/blog/a-bourgeoisie-primer/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Sun, 24 Jul 2022 05:37:15 +0000",
  "category": "Culture",
  "guid": "https://danielmiessler.com/?p=138072",
  "description": "In my reading the term (and concept) Bourgeoisie comes up so often that I cannot afford to have a light grasp of it. I have learned, mis-learned, forgotten, and relearned its definition so many times that I&#8217;m forced to create this page to remind myself. Here&#8217;s my summary: Other languages also have a town-like word that also starts&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/dalle-bougey.png\" alt=\"dalle-bougey\" width=\"650\" height=\"586\" class=\"aligncenter size-full wp-image-138078\" /></p>\n\n<p>In my reading the term (and concept) <em>Bourgeoisie</em> comes up so often that I cannot afford to have a light grasp of it. I have learned, mis-learned, forgotten, and relearned its definition so many times that I&#8217;m forced to create this page to remind myself.</p>\n\n<p>Here&#8217;s my summary:</p>\n\n<p class=\"note\">Other languages also have a town-like word that also starts with something like &#8220;burg&#8221;.</p>\n\n<ul>\n<li>The term comes from &#8220;city&#8221;, or town, which is where the &#8220;bourg&#8221; bit. Think Hamburg. Berg means town. It&#8217;s French, from Old French, from Old Frankish. Burg. So the bourgeoisie were a class of people rising up in prominence from cities.</li>\n<li>City is important because of what came before that, which was feudal and land-based. So basically in the old world you were important if you owned land, and then when the industrial revolution happens you have the creation of machines and lots of wealth starts getting concentrated in cities.</li>\n<li>In the 18th century the bourgeois and bourgeoise (male and female versions) also represented the rich among the common people, meaning among the people who were not part of the aristocracy. So they were the &#8220;people&#8221; who ousted the King and the aristocracy in the French Revolution.</li>\n<li>Since the 19th century the term has come to mean the ruling class of a capitalist society, and its also associated with a social class based around economic materialism and hedonism. Think Great Gatsby.</li>\n<li>Early on this was made up of people who lived in cities and included people like craftsmen, artisans, and merchants. They are between the owners and the peasants. This slowly grew to include managers of such people. But still not the owners.</li>\n<li>There&#8217;s another connotation of the term which is materialistic to the point of being philistine, i.e., unsophisticated and unrefined. Think someone who&#8217;s shallow and would rather go to a high-end mall rather than to an art gallery to see and discuss actual art.</li>\n<li>In the late 20th century we saw terms like &#8220;bougie&#8221; or &#8220;boujee&#8221; being a negative term meaning someone of lower or middle class who is doing pretentious things like driving EVs or eating avocado toast try to appear upper class.</li>\n<li>The transition of <em>bourgs</em> to cities in Central and Western Europe happened in the 11th century. So, around the year 1000-1100. Guilds were a big part of this. </li>\n</ul>\n\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/bougey-650x386.png\" alt=\"bougey\" width=\"650\" height=\"386\" class=\"aligncenter size-medium wp-image-138076\" /></p>\n\n<ul>\n<li>Kings had a problem with Feudal lords because they were a threat to power, and so they partnered with this new ruling class in cities (the bourgeoisoi) to topple the feudal lords and thus feudalism, resulting in the move towards capitalism.</li>\n<li>Feudalism &#8211;> Capitalism, helped by cooperation between monarchies and the bourgeoisie. </li>\n<li>According to Marxist thought, the bourgeoisie were supporters of the concepts of constitutions, natural rights, and opposition to the idea of divine right to rule.</li>\n<li>The English Civil War, American War of Independence, and French Revolution were motivated by the bourgeoisie wanting to abolish not just the feudal rule over them, but also the royal rule over them.</li>\n<li>This is the start of liberalism, <a href=\"https://danielmiessler.com/blog/the-difference-between-classical-liberalism-and-libertarianism/\">which I wrote about here</a>, which is fundamentally the idea of throwing off a controlling authority to gain one&#8217;s own freedom.</li>\n<li>According to Marx, the bourgeoisie were originally self-employeed business people, like merchants, bankers, or entrepreneurs (this is during the middle ages). But after the industrial revolution (1750-1850) they became the owners and the ruling economic class. Specifically, they owned the means of production and also the means of cohesion (police, military, prisons, etc.).</li>\n<li>This is where the transition took place of bourgeoisie vs. the worker. So it&#8217;s bourgeoisie vs. the proletariat or the working class.</li>\n<li>In English bourgeoisie means middle classes, but in French it means both middle and upper classes. The bourgeoisie in France and many French-speaking countries consists of five tiered social layers: petite bourgeoisie, moyenne bourgeoisie, grande bourgeoisie, haute bourgeoisie and ancienne bourgeoisie.</li>\n</ul>\n\n<h2>What GPT-3 thinks</h2>\n\n<div id=\"attachment_138082\" style=\"width: 660px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-138082\" decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/modern-bougie.png\" alt=\"modern-bougie\" width=\"650\" height=\"650\" class=\"size-full wp-image-138082\" /><p id=\"caption-attachment-138082\" class=\"wp-caption-text\">What GPT-3 thinks a modern bourgeois party looks like</p></div>\n\n<p>Here&#8217;s what OpenAI&#8217;s GPT-3 thinks bourgeoisie means:</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<blockquote>\n  <p>The term bourgeoisie refers to a social class who are considered to be the elite of society. They typically have a high level of education and hold positions of power and influence. They are often characterized by their wealth and luxurious lifestyle.<br /><br /><cite>GPT-3</cite></p>\n</blockquote>\n\n<p>So this one is weighted towards elite.</p>\n\n<blockquote>\n  <p>The word &#8220;bourgeoisie&#8221; is used to describe the middle and upper class of a society. These people are typically educated and have high-paying jobs. They often enjoy a comfortable lifestyle with many material possessions.<br /><br /><cite>GPT-3</cite></p>\n</blockquote>\n\n<p>This one says middle and upper.</p>\n\n<blockquote>\n  <p>The word &#8220;bourgeoisie&#8221; is used to describe the middle class in a society. It is typically used in countries where there is a significant difference between the wealthy and poor classes. The bourgeois class is typically seen as being wealthy, but not as wealthy as the aristocracy. They are also often considered to be more educated and cultured than the working class.<br /><br /><cite>GPT-3</cite></p>\n</blockquote>\n\n<p>And this one says middle, but mentions that they&#8217;re more educated and cultured than the workers.</p><div data-inline-related-post data-inline-related-post-index=1></div>\n\n<h2>Analysis</h2>\n\n<p>These GPT-3 summaries are quite interesting, and they capture well the conflicting messaging in the basic points in the content above.</p>\n\n<p>Basically, there seem to be two main definitions and uses, and it&#8217;s hard to know exactly which one is using without more context. 1) Middle class in a society where there are poor people and super-rich or aristocrats, and 2) the upper class.</p>\n\n<p>I think if you&#8217;re talking about a historical context, the term means a city-based middle class that broke away from the poor to gain increasing power in society. And if you&#8217;re talking about a more modern interpretation, the bourgeoisie are merged with the rich to become the upper class.</p>\n</p>"
}