{
  "id": "yt:video:gq5xLI77TGA",
  "yt:videoId": "gq5xLI77TGA",
  "yt:channelId": "UCBn6YYmhnruGtEtlKxYbQ9A",
  "title": "Let's Talk About Singular They.",
  "link": "",
  "author": {
    "name": "K Klein",
    "uri": "https://www.youtube.com/channel/UCBn6YYmhnruGtEtlKxYbQ9A"
  },
  "published": "2022-10-14T17:09:25+00:00",
  "updated": "2022-10-31T19:50:41+00:00",
  "media:group": {
    "media:title": "Let's Talk About Singular They.",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A sequel to the video: https://www.youtube.com/watch?v=iQNdkdqoIdw\n\nThanks to my patrons!!\nPatreon: https://www.patreon.com/user?u=73482298\nSpecial thanks to Calvin for pestering me until I made this video.\n\nSources:\nBaron, D. (1981-2015). The Words that Failed: A chronology of early nonbinary pronouns.\nBaron, D. (1986). Grammar and Gender. New Haven.\nBaron, D. (2018). A brief history of singular ‘they’. Oxford English Dictionary Blogs.\nFisher, A. (1745). A New Grammar [2nd ed. 1750]. Newcastle upon Tyne.\nGerner, J. (1998). Singular and Plural Anaphors of Indefinite Personal Pronouns in Spoken British English. Corpora Galore: Analyses and Techniques in Describing English: Papers from the Nineteenth International Conference on English Language Research on Computerised Corpora.\nGraham, S. (2001). Sulawesi's fifth gender. Inside Indonesia.\nMcWhorter, J. (1745). The Royal They: Fighting against the tyranny of pronouns. The New Republic.\nLaScotte, D. (2016). Singular they: An Empirical Study of Generic Pronoun Use. American Speech. 91 (1): 62–80.\nMiller, C. & Swift, K. (1980). The Handbook of Nonsexist Writing. New York. Harper & Row.\nSafire, W. (1985). On Language; You Not Tarzan, Me Not Jane. The New York Times.\nWagner, S. (2003). Gender in English Pronouns: Myth and Reality. University of Freiburg.\n(1881). Detroit Free Press. May 13 edition.\n(2018). Collins COBUILD English Dictionary.\n(2022). they. The American Heritage Dictionary of the English Language.\nConstitution of the United States of America. Article 1 §2.\n\nWritings mentioned with examples of the singular “they”:\nAusten, Jane. (1814). Mansfield Park.\nShakespeare, William. (p. 1623). The Comedy of Errors.\nShaw, George Bernard. (1898). Plays Pleasant and Unpleasant.\nAnonymous writer. (c.1350). William and the Werewolf. Translated c. 1350-1375 to English from the original French written c. 1200.\n\nNOTES FROM VIDEO:\n[Note 1] When I say “is from”, I am arguing purely from a synchronic perspective – I mean it as a shorthand for the fact that the plural mixed gender and plural masculine are the same, and distinct from the plural feminine in French. I am not making an argument from etymology here.\n\n[Note 2] Wagner argues that “the choice of a supposedly masculine personal pronoun (him) said nothing about the gender or sex of the referent” in Middle English. However, I would argue that the association with the masculine over the feminine still applies. Wagner herself writes that this pronoun can be used for any combination of the genders “masculine” and “neuter”, or sexes “male” and “asexual”, deliberately excluding the “feminine” or “female”. Despite being gender-neutral in some contexts, this pronoun was never epicene, not even in Middle English.\n\n[Note 3] Note, of course, that “man” was originally the word for “human”, and only later came to mean “male adult”. In Old English, “man” was “wer”, and “woman” was “wif”.\n\n[Note 4] Joke.\n\n[Note 5] Note the significantly lower percentages found only three years earlier, in Erdmann (1995), with singular “they” only being used in just under 50% of cases. This study was, firstly, done on Americans, who may be more biased against the singular “they”, and was also a study of written language, reflecting how the singular “they” is often seen as too informal by publishers, and therefore either avoided by authors, or changed by the editors.\n\n[Note 6] Actually, in the examples given from Shakespeare’s Comedy of Errors and Austen’s Mansfield Park, the gender of the referent is known (masculine in the former case, feminine in the latter), but an epicene pronoun is used regardless. Go figure.\n\n[Note 7] I am aware that people have been identifying as non-binary for a long time, even in Europe and colonial America. The sociology and history of this is worth looking into, but I am personally less interested in it and therefore didn’t want to go into the topic in the video.\n\n[Note 8] When it is a subject, this “sie/Sie” can be separated out into “she/feminine it” with the 3rd person singular verb ending, and “they/you” with the 3rd person plural verb ending. In the dative, the same split accords, as the former take the dative “ihr” and the latter the dative “ihnen/Ihnen”. When in the accusative or genitive, there is no difference in spoken language between the four. However, in writing, the formal “you” is distinguished from the others because it, and all its forms, are capitalised.\n\nChapters:\n0:00 – The Epicene “They”\n2:48 – The Generic “He”\n5:28 – The Non-Binary “They”\n7:21 – Credits\n\nWritten and Created by me\nArt by kvd102\nMusic by me\n\nTranslations:\nFerr - Indonesian\nD'ignoranza & Marco Lisoni - Italian\nLeeuwe van den Heuvel - Dutch\nGergő Kulman - Hungarian\nRay Karr - Spanish\nOllie - French\n千雨 Chisame - Standard Mandarin, Japanese\nRisto Kynkäänniemi - Finnish\nJafar - Arabic\nNatália - Brazilian Portuguese\nÁlftanes - Cantonese\nMaymun - Turkish\nEneko Andonegi - Basque\n\n#theythem #nonbinary #historyofenglish #pronouns",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}