{
  "title": "Lessons From the Badass Muscular Neurobiologist",
  "link": "https://www.mrmoneymustache.com/2022/09/30/lessons-from-the-badass-muscular-neurobiologist/",
  "comments": "https://www.mrmoneymustache.com/2022/09/30/lessons-from-the-badass-muscular-neurobiologist/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Fri, 30 Sep 2022 18:26:50 +0000",
  "category": [
    "The MMM Blog",
    "fitness",
    "Food",
    "health"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=18339",
  "description": "Have you ever noticed that as a whole, our society has its daily habits almost completely backwards? We’re generally so “busy” that we don’t have time to get much exercise. And then we spend countless sedentary hours sitting in our cars each week because we think that car driving saves us time. To fuel our [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2022/09/30/lessons-from-the-badass-muscular-neurobiologist/\"><img style=\"max-width:100%;height:auto\" width=\"390\" height=\"239\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-crop.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-crop.jpg 390w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-crop-300x184.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-crop-200x123.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-crop-150x92.jpg 150w\" sizes=\"(max-width: 390px) 100vw, 390px\" /></a>\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2.jpg\" alt=\"\" class=\"wp-image-18355\" width=\"408\" height=\"299\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2.jpg 882w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2-300x220.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2-200x146.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2-768x563.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman2-150x110.jpg 150w\" sizes=\"(max-width: 408px) 100vw, 408px\" /></a></figure></div>\n\n\n<p>Have you ever noticed that as a whole, our society has its daily habits almost completely backwards?</p>\n\n\n\n<p>We’re generally so “busy” that we don’t have time to get much exercise. And then we spend countless sedentary hours sitting in our cars each week because we think that car driving saves us time.</p>\n\n\n\n<p>To fuel our bodies during these chaotic days, we pack ourselves with whatever convenient or tasty food we happen to crave at the moment, then add in additional snacks between meals, while watching TV, and perhaps a final treat before bed.&nbsp;</p>\n\n\n\n<p>In any leftover shreds of free time, we pack our minds with similarly tasty or convenient blobs of entertainment or “content” that happen to successfully push their way in front of our face like a pen full of hungry pigs fighting for the scraps of our attention.</p>\n\n\n\n<p>And our food factories, magazines, newspapers, TV and streaming services and even politicians are only too happy to keep pushing out the crap. And the results are just as you would predict: crappy.</p>\n\n\n\n<p>But there is some good news too: <strong>You </strong>can do everything in the opposite way, and the results tend to be astonishingly good. The biggest difference you’ll notice is dramatically better physical and mental health, which multiply together to create a better, happier, longer and more generous life in all dimensions.&nbsp;</p>\n\n\n\n<p>In other words if there’s <em>anything </em>worth striving for &#8211; even more than financial independence or early retirement or any other individual goals &#8211; it’s probably the overall package of <em>a healthier you.</em></p>\n\n\n\n<p>Over the past few months, I have found myself settling into a new routine that seems to be getting better and better as the positive results feed back onto themselves. It has become so good that I thought it would be worth sharing and comparing notes with you.&nbsp;</p>\n\n\n\n<p>To cut straight to the good part, let’s compare the flow of two hypothetical days, side-by-side: the typical American default life, and a somewhat optimized Science-backed Life. Then, we’ll go back and fill in the details on where all these details come from, and the reason for this blog post’s strange title.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" width=\"573\" height=\"1024\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-573x1024.jpg\" alt=\"\" class=\"wp-image-18390\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-573x1024.jpg 573w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-168x300.jpg 168w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-101x180.jpg 101w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-768x1373.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-859x1536.jpg 859w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-84x150.jpg 84w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2-900x1609.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/two-lifestyles-v2.jpg 1046w\" sizes=\"(max-width: 573px) 100vw, 573px\" /></a><figcaption>Two different lifestyles (click for larger version). Text version of this table also available <a href=\"https://www.mrmoneymustache.com/two-lifestyles-table-from-huberman-article/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</figcaption></figure></div>\n\n\n<p><strong>So What is This All About?</strong></p>\n\n\n\n<p>If you didn’t recognize the man in the picture above, these ideas have been meticulously stacked into my head by Dr. Andrew Huberman, the Stanford professor of Neurobiology and Ophthalmology who has now also risen to the top of the podcasting field.</p>\n\n\n\n<p>The basic information is only partially new &#8211; Huberman covers almost every aspect of the brain and body, and the field of science has been working on some of this stuff for a long time. But the rate of progress is faster than ever, so he has become my trained guide to filter and pass on the most useful findings, in an accessible and engaging style. I find the episodes thorough, detailed, and relentlessly focused on <em>actual science</em> instead of just speculation.&nbsp;</p>\n\n\n\n<p>The packaging is important to me too. I’ve been a health and fitness enthusiast since I was sixteen, but until now the field always had an uncomfortable split down the middle: there were the glossy and buff <em>promoters</em> &#8211; mostly salespeople for their own products with very little substance (and an inherent conflict of interest). And then there were the actual <em>scientists</em>, lacking in style and presentation skills and often sporting unenviable physical forms as well, making them less inspiring to follow even before the fact that they typically communicate mostly in the form of academic papers.</p>\n\n\n\n<p>Huberman unites both personas into one &#8211; he’s a real scientist, but also a great presenter. And every time he shoots another two hour Laser Beam of Focus from his intensely intelligent eyes through the screen directly into yours, while gesturing precisely with that highly athletic form packed into a classy black dress shirt, it’s a lot easier to convince yourself that “Hey, this is probably pretty good advice if it will make me even a bit more like this guy*.”</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><a href=\"https://www.instagram.com/p/CgAkD4zpS7g/\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot.jpg\" alt=\"\" class=\"wp-image-18395\" width=\"543\" height=\"279\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot.jpg 990w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot-300x154.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot-200x103.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot-768x394.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot-150x77.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/instagram-screenshot-900x462.jpg 900w\" sizes=\"(max-width: 543px) 100vw, 543px\" /></a></figure></div>\n\n\n<p>Back in July as I was starting to work on this article, I posted a silly teaser to my <a href=\"https://www.instagram.com/mrmoneymustache/\" target=\"_blank\" rel=\"noreferrer noopener\">Instagram account</a> of me sitting in my roasting hot &#8220;car sauna&#8221; out in the sun-baked concrete driveway behind my house. This was the start of my experimentation with deliberate hot and cold exposure. I found it both fun and incredibly mood-lifting (Huberman reveals in certain episodes that the mood elevation from a cold water plunge is quite literally about equal to taking a dose of cocaine. Except this drug is actually <em>good </em>for you!)</p>\n\n\n\n<p><strong>The Molecule of More</strong></p>\n\n\n\n<p>It all started when a friend sent me a link to <a rel=\"noreferrer noopener\" href=\"https://www.youtube.com/watch?v=hFL6qRIJZ_Y&t=2098s&ab_channel=AndrewHuberman\" target=\"_blank\">this episode on ADHD</a>, knowing it’s something I am always trying to optimize my life around. It immediately revolutionized my understanding of how my own brain works, which led me to <a rel=\"noreferrer noopener\" href=\"https://www.youtube.com/watch?v=Xu1FMCxoEFc&t=1448s&ab_channel=AndrewHuberman\" target=\"_blank\">this episode on depression</a>, and this one on <a rel=\"noreferrer noopener\" href=\"https://www.youtube.com/watch?v=QmOF0crdyRU&ab_channel=AndrewHuberman\" target=\"_blank\">Dopamine and its effect on our motivation and drive</a>.&nbsp;</p>\n\n\n\n<p>Everything started to fall into place as I learned about the role of brain chemicals in general, but specifically the effects of Dopamine and Adrenaline on my own life. As it turns out, the flow of these molecules dictate not only my classic ADHD symptoms of difficulty focusing and remembering where I put things, but also my ability to feel happy, feel like making plans, and feel like doing anything at all. Which helped me understand why days with strong “ADHD” symptoms can also feel like depression symptoms.&nbsp;</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><a href=\"https://amzn.to/3BzmvUf\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-of-more.jpg\" alt=\"\" class=\"wp-image-18356\" width=\"211\" height=\"316\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-of-more.jpg 400w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-of-more-200x300.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-of-more-120x180.jpg 120w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/molecule-of-more-100x150.jpg 100w\" sizes=\"(max-width: 211px) 100vw, 211px\" /></a></figure></div>\n\n\n<p>This led me to an entire side journey into Dopamine research, as I followed Huberman’s recommendation to read a book called <a href=\"https://amzn.to/3BzmvUf\" target=\"_blank\" rel=\"noreferrer noopener\">The Molecule of More</a>, which turned out to be a life-changing experience on its own. Not only does the book peel away some of the biggest mysteries of Human nature and leave you with a new level of understanding of why we feel and act the way we do, but it also has a compelling flow that’s much closer to a thriller novel than a science book.</p>\n\n\n\n<p>I learned that while Dopamine is often labeled as <strong>the molecule of pleasure</strong>, this characterization is not quite accurate. In reality, it’s <strong>the molecule of <em>motivation</em></strong> &#8211; the substance that causes us to be interested and take actions towards something that our mind expects to bring us pleasure (which in turn usually means food, mating or social benefits). But the actual attainment of that pleasure tends to temporarily quench our desire and decrease motivation.</p>\n\n\n\n<p>Until our brain comes up with the <em>next </em>thing we don’t currently have, which triggers more dopamine, more motivation, and more seeking. Which can either lead to good things like healthy living and self-actualization, or addictions to drugs, success and status for its own sake, or the hedonic treadmill we talk about so much here in the personal finance world.</p>\n\n\n\n<p>Applying this knowledge to my own life: ADHD is a condition which often comes with suppressed dopamine levels. When in this state, we sufferers have trouble with things like maintaining focus, keeping track of objects in the physical world or remembering names and faces, and making future plans. Some of us compensate with hyperactive and impulsive novelty-seeking behaviors, unconsciously seeking things that trigger more dopamine release. But for others like me it manifests as a mildly depressive state &#8211; turning away from the outside world and focusing on things that are more familiar and require less planning.&nbsp;</p>\n\n\n\n<p>By doing more of the things that help release and stabilize my dopamine levels (basically everything in the table above), I was able to start feeling more consistently energized and motivated, which gave me even <em>more </em>ability to keep the good routines going, and so on. It has become a virtuous circle that has me exercising more, sleeping better, eating better, seeing positive physical changes, saying “yes” to more plans with more people, and getting more done with my days.</p>\n\n\n\n<p><strong>70 Hours of Speed Learning</strong></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-1024x736.jpg\" alt=\"\" class=\"wp-image-18358\" width=\"762\" height=\"547\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-1024x736.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-300x216.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-200x144.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-768x552.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-1536x1104.jpg 1536w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-2048x1472.jpg 2048w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-150x108.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/huberman-report-card-900x647.jpg 900w\" sizes=\"(max-width: 762px) 100vw, 762px\" /></a><figcaption>Here&#8217; my &#8220;Huberman Report Card&#8221; so far. Each one of these red bars represents about 80 minutes of concentrated learning time, even when listening at an accelerated pace. This is how much I am drawn to this material (which means even more in my case because I&#8217;m easily bored by anything but the most interesting stuff!)</figcaption></figure></div>\n\n\n<p>So I kept listening to more and more of his episodes. And as the knowledge flowed in, I started noticing the overlapping patterns in every area of health. It all seems to boil down to the same few things.</p>\n\n\n\n<ul><li><strong>Exercise (especially outdoors plus lifting heavy things)&nbsp;</strong></li><li><strong>Nutrition&nbsp;</strong></li><li><strong>Mindfulness and Meditation-style breaks</strong></li><li><strong>Sleep</strong></li></ul>\n\n\n\n<p>These things in turn affect the plumbing and the hormones in both our bodies and brains, which in turn controls EVERYTHING &#8211; from mood and energy to body composition to the immune system and even our chances of chronic diseases &#8211; including cancer.</p>\n\n\n\n<p>It sounds somewhat obvious, but I think the key is understanding this stuff down to the deepest fibers of your soul: <em><strong>everything affects everything.</strong> </em>So if you want a better life, take care of every part of yourself, by making the entirety of your day something that improves you, rather than wears you down.</p>\n\n\n\n<p>You don’t have to be perfect, of course. But you do have to understand which stuff is good for you, which is neutral, and which is counterproductive. At that moment, a little Scientist Angel will materialize on your shoulder and start advising you on every decision. And it will just naturally become easier to make positive choices. And when you do decide to be decadent and naughty, it will be a deliberate conscious and fun choice, which you will do in moderation.</p>\n\n\n\n<p><strong>Call To Action</strong></p>\n\n\n\n<p>The best way to live life is to combine a constant appreciation of the present moment, with a general program of consistent improvement. That way, you get to feel good about both the present and the future.&nbsp;</p>\n\n\n\n<p>So if you’re up for the challenge, I’d love to see both of us &#8211; you and me &#8211; continue to iron out our daily routines so they bring us both more moments of feeling great and more decades of personal growth. That means doing our best to learn something new every day, and do something hard every day.&nbsp;</p>\n\n\n\n<p>And if you’re looking for somewhere specific to start, I think that taking a long walk with a great podcast is one of the most simple yet powerful options.&nbsp;</p>\n\n\n\n<p><strong>Listening Tips:</strong></p>\n\n\n\n<p>I typically enjoy listening to podcasts and audio books with the playback speed set to 1.5x, which helps make them more engaging (it gives my easily distracted brain less time to wander because the information flow is faster plus it saves a lot of time). It&#8217;s definitely worth experimenting with speeds if you have never done so before.</p>\n\n\n\n<p>The next revolution for me was switching from standard headphones to good quality wireless earbuds* so I can combine the learning with my long daily walks, workouts, carpentry and chores around the house. The better models even have good microphones built in so you can use them for phone calls and meetings.</p>\n\n\n\n<p>Finally, many of these podcasts have a long &#8220;sponsors&#8221; section built in which can be a chore to listen to more than once. On the YouTube app on your phone, you can do a two-finger double-tap on the right side of the screen to <em>immediately </em>jump through this section and get to the good stuff. Other media and podcast players have similar things, or at the very minimum a double-tap feature to jump ahead 10 seconds.</p>\n\n\n\n<p><strong>Bonus Technique: Successful Transformation through a Madwoman’s Scribblings</strong></p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/journal-squares.jpg\" alt=\"\" class=\"wp-image-18359\" width=\"211\" height=\"281\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/09/journal-squares.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/journal-squares-225x300.jpg 225w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/journal-squares-135x180.jpg 135w, https://www.mrmoneymustache.com/wp-content/uploads/2022/09/journal-squares-113x150.jpg 113w\" sizes=\"(max-width: 211px) 100vw, 211px\" /></figure></div>\n\n\n<p>As I was writing this article, I happened to reconnect with a longtime friend who revealed that she too had made some great progress in feeling better and improving her health and fitness after a rough patch in life. Her secret to success was revealed in the strange photograph at left.</p>\n\n\n\n<p>The idea is that you put your ideal daily activities down the left hand side of a page, and the days of an entire month along the top, and stick this thing on your fridge. Then you color in the squares for each day as you achieve each activity.&nbsp;</p>\n\n\n\n<p>You probably won’t get them all, but every square counts. And because this chart is right in your face every time you visit your kitchen, you are reminded and motivated to get as many as possible. Easy accountability, and you can just keep it going and making adjustments for month after month. I just printed out my first one today!</p>\n\n\n\n<p>Shortcut: Here&#8217;s a first version of a <a href=\"https://docs.google.com/spreadsheets/d/1beZ-iHmgc0POqqZRN1jtRgueglV3BEU7LO9DKtETIiU/\"><strong><span style=\"text-decoration: underline;\">Badassity Tracker chart</span></strong></a> I made for myself:</p>\n\n\n\n<p>&#8212;</p>\n\n\n\n<p><strong>In the Comments:</strong> What habits and self-inflicted problems do you struggle with the most? And if you feel you’re doing well at something, what has been the cause of that success? I’d love to see more people working and sharing with their peer groups, to make healthy self-improvement much more of a national pastime.</p>\n\n\n\n<p>* <strong>Superstar Scientists:</strong> An article like this would not be complete without also mentioning Peter Attia, an equally prolific researcher, doctor and educator who has also pulled me in to dozens of hours of his teachings on health, medicine and longevity. For best results, I recommend following any and all of these types of people &#8211; as long as they seek and present real science, choose whoever inspires you the most.</p>\n\n\n\n<p><strong>** Wireless earbuds</strong> &#8211; if you’re looking for a research shortcut, I’ve been using this <a href=\"https://amzn.to/3dYpJsR\" target=\"_blank\" rel=\"noreferrer noopener\"><span style=\"text-decoration: underline;\">Anker Liberty Air 2 Pro set</span></a> (affiliate link) for about 6 hours every single day for the last year. Here&#8217;s <a rel=\"noreferrer noopener\" href=\"https://amzn.to/3SJgnQj\" target=\"_blank\"><span style=\"text-decoration: underline;\">another similar option</span></a>, on sale at the time of writing. Insanely good yet cheap which makes you wonder why the hell Apple airpods cost so much (!?). And they were transformative for me because the noise canceling feature eliminates not only airplane noise during flights, but all the engine noise of urban life, making walks much more pleasant. </p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/09/30/lessons-from-the-badass-muscular-neurobiologist/feed/",
  "slash:comments": 179,
  "post-id": 18339
}