{
  "id": "yt:video:eba3JQQctZ8",
  "yt:videoId": "eba3JQQctZ8",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "If You Don't Learn Story Structure You May Never Work In The Film Industry - Pete Chatmon",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-23T00:00:25+00:00",
  "updated": "2022-10-23T00:00:27+00:00",
  "media:group": {
    "media:title": "If You Don't Learn Story Structure You May Never Work In The Film Industry - Pete Chatmon",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "BUY THE BOOK - TRANSITIONS: A Director’s Journey and Motivational Handbook\nhttps://amzn.to/3Jye6lP \n\nOTHER BOOKS MENTIONED\n\nTHE WRITER'S JOURNEY - 25th Anniversary Edition: Mythic Structure for Writers \nhttps://amzn.to/3CX5q7t\n\nSTORY: Substance, Structure, Style and the Principles of Screenwriting\nhttps://amzn.to/3MYWiUE\n\nWith a deft ability to balance both half-hour single camera comedies and one-hour dramas, Pete Chatmon has directed over 50 episodes of television including HBO Max’s The Flight Attendant, Insecure, Silicon Valley, and Love Life, Netflix’s You, ABC’s Grey’s Anatomy and Black-ish, Starz’ Blindspotting, FX’s It’s Always Sunny in Philadelphia, and the Apple TV+ series Mythic Quest. He is in development on The Education of Matt Barnes with Showtime, for which he will direct the pilot and serve as executive producer and is currently co-executive producer and producing director on Reasonable Doubt, the first project to be produced via Hulu’s Onyx Collective. His debut feature as writer/director, Premium, starred Dorian Missick, Zoe Saldana, and Hill Harper, and premiered on Showtime after a limited theatrical run. Chatmon also wrote, produced, and directed 761st, a documentary on the first Black tank battalion in WWII, narrated by Andre Braugher. Through TheDirector, his Digital Studio, he has directed, shot, and edited content for advertising agencies and Fortune 500 brands.  Chatmon’s career began in 2001 with the Sundance selection of his NYU thesis film, 3D, starring Kerry Washington. His most recent short film, BlackCard, premiered on HBO, and his narrative podcast, Wednesday Morning, engaged voters around the 2020 election. His podcast, Let’s Shoot! with Pete Chatmon is available on YouTube, iTunes, and all podcast platforms. In January 2022 his book, Transitions: A Director’s Journey + Motivational Handbook was released by Michael Wiese Productions. \n\nSUBSCRIBE TO PETE CHATMON'S YOUTUBE CHANNEL\nhttps://www.youtube.com/channel/UCpecW07kN9swag5PNGTRJ-A\n\nCONNECT WITH PETE CHATMON\nhttps://petechatmon.com\nhttps://www.imdb.com/name/nm0154079\nhttps://www.instagram.com/petechatmon\nhttps://twitter.com/petechatmon\nhttps://www.youtube.com/channel/UCpecW07kN9swag5PNGTRJ-A\n\nMORE MICHAEL WIESE PRODUCTIONS AUTHORS\nhttps://mwp.com\n\nRELATED VIDEOS\nLearning Screenplay Story Structure - https://youtu.be/iywvNIWKbPI\n21 Ways To Structure A Screenplay - https://youtu.be/OPxxJ2wBNTA\nSolve Your Story Structure Problems In 11 Steps - https://youtu.be/RPGTIqHBmUE\nThe Mistake Screenwriters Make With Structure - https://youtu.be/bbMbRskTjfI\nIf You Can't Answer These 6 Questions You Don't Have A Story - https://youtu.be/uL0atQFZzL8\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#movies #film #tv",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}