{
  "title": "Ada Limón and Natalie Diaz Discuss “Envelopes of Air”",
  "link": "http://www.wnyc.org/story/ada-limon-and-natalie-diaz-discuss-envelopes-air/",
  "description": "<p>Ada Limón and Natalie Diaz join Kevin Young to discuss their collaborative poetry project, “Envelopes of Air,” a series of eight poems written in correspondence between the two poets, currently featured on <a href=\"https://www.newyorker.com/magazine/poems/envelopes-of-air-ada-limon-and-natalie-diaz-forge-a-bond-amid-the-shifting-landscape-of-contemporary-america\">newyorker.com</a>. Below, Limón and Diaz reflect on the project’s origins, context, and process.</p>\n<p>“The original context for the poems was quite simple really: to write poem-letters to each other. We wanted to collaborate somehow and I was originally scared Natalie was going to ask me to draw or something. But instead, we began these poem-letters. Natalie and I both travel a lot, with my home base being in Lexington, Kentucky, most of the time, and hers in Tempe, Arizona. We soon realized that the poems were giving us a new, intimate way of thinking on the page—a reader that knows you, a reader with some shared history, a poet reader, a woman reader, a brown-woman reader. In terms of symbolism, both green and red play important roles in the work (the red of the desert and the green of the Bluegrass and spring). You can see those colors moving through the poems, winding around the words. Also, when we talk about Kimmerer and sweetgrass, it’s in reference to the book “<a href=\"https://www.amazon.com/Braiding-Sweetgrass-Indigenous-Scientific-Knowledge/dp/1571313567/\">Braiding Sweetgrass</a>.\" (That has proven to be important to both of us.) I have planted sweetgrass in my raised beds. (It’s come back and is thriving this year!)</p>\n<p>Also, I might add, that we both talk about our inner selves—our own anxiety, insomnia, health concerns—things we might not always share in other poems, because we are truly writing to one another, someone we trust, someone that we can recognize ourselves in, mirror and be seen. She has become an essential person for me to write to, for me to listen to. Of course, there’s more and I could go on, but I also don't want to say too much. I think the main thing is: these are real letters, and real poems, at the same time.”</p>\n<p>-Ada Limón</p>\n<p>“What is interesting about the poems as well is that we never had any context outside of the poems. They were their own space, a third space, maybe, of Ada’s and my friendship. We met sometimes in person, crossing paths at events, and we never discussed the poem-letters. They were that intimate time and space for us, of a poem, of a letter, of a room that was a new room for us to inhabit, individually, as we moved toward or away from ourselves and one another, and together, as we became a new space for each other to fill with words.</p>\n<p>These poems are in some ways very different than anything I’ve ever written—I’ve written about dark and bright emotionalities before, but this is a new, more vulnerable, more open field of myself that I found through my correspondence with Ada. We borrow one another’s phrases and language at times, we incorporate friends and lovers, we thread through what we are reading and what is happening in our lives and our worlds, like any letter would. Ada is one of the most important audiences I have written for, because I love her, she is my friend, and I also admire her as a poet and thinker and person. In some ways, I have risked more of myself in these poems than in other poems I have written. She has become one of the beloveds I write toward, as are my family, my friends, my lovers, my peoples and communities.”</p>\n<p>-Natalie Diaz</p>",
  "pubDate": "Wed, 23 May 2018 12:00:00 -0400",
  "guid": "735afb70-4631-4087-9cb9-c403328df187",
  "enclosure": "",
  "category": [
    "arts",
    "books",
    "correspondence",
    "emirates_tnypoetry",
    "environment",
    "friendship",
    "history",
    "life",
    "poetry",
    "storytelling",
    "the_new_yorker"
  ],
  "media:content": "",
  "media:description": "Ada Limón and Natalie Diaz Discuss “Envelopes of Air”",
  "media:thumbnail": "",
  "itunes:duration": "29:28",
  "content:encoded": "<p>Ada Limón and Natalie Diaz join Kevin Young to discuss their collaborative poetry project, “Envelopes of Air,” a series of eight poems written in correspondence between the two poets, currently featured on <a href=\"https://www.newyorker.com/magazine/poems/envelopes-of-air-ada-limon-and-natalie-diaz-forge-a-bond-amid-the-shifting-landscape-of-contemporary-america\">newyorker.com</a>. </p>",
  "itunes:title": "Ada Limón and Natalie Diaz Discuss “Envelopes of Air”",
  "itunes:summary": "<p>Ada Limón and Natalie Diaz join Kevin Young to discuss their collaborative poetry project, “Envelopes of Air,” a series of eight poems written in correspondence between the two poets, currently featured on <a href=\"https://www.newyorker.com/magazine/poems/envelopes-of-air-ada-limon-and-natalie-diaz-forge-a-bond-amid-the-shifting-landscape-of-contemporary-america\">newyorker.com</a>. </p>",
  "itunes:episodeType": "full",
  "dc:creator": "wnycdigital@gmail.com (WNYC Studios and The New Yorker)",
  "itunes:explicit": "no",
  "itunes:subtitle": "Ada Limón and Natalie Diaz join Kevin Young to discuss their collaborative poetry project, “Envelopes of Air,” a series of eight poems written in correspondence between the two poets, currently featured on newyorker.com. Below, Limón and Diaz reflect on the project’s origins, context, and process. “The original context for the poems was quite simple really: to write poem-letters to each other. We wanted to collaborate somehow and I was originally scared Natalie was going to ask me to draw or something. But instead, we began these poem-letters. Natalie and I both travel a lot, with my home base being in Lexington, Kentucky, most of the time, and hers in Tempe, Arizona. We soon realized that the poems were giving us a new, intimate way of thinking on the page—a reader that knows you, a reader with some shared history, a poet reader, a woman reader, a brown-woman reader. In terms of symbolism, both green and red play important roles in the work (the red of the desert and the green of the Bluegrass and spring). You can see those colors moving through the poems, winding around the words. Also, when we talk about Kimmerer and sweetgrass, it’s in reference to the book “Braiding Sweetgrass.\" (That has proven to be important to both of us.) I have planted sweetgrass in my raised beds. (It’s come back and is thriving this year!) Also, I might add, that we both talk about our inner selves—our own anxiety, insomnia, health concerns—things we might not always share in other poems, because we are truly writing to one another, someone we trust, someone that we can recognize ourselves in, mirror and be seen. She has become an essential person for me to write to, for me to listen to. Of course, there’s more and I could go on, but I also don't want to say too much. I think the main thing is: these are real letters, and real poems, at the same time.” -Ada Limón “What is interesting about the poems as well is that we never had any context outside of the poems. They were their own space, a third space, maybe, of Ada’s and my friendship. We met sometimes in person, crossing paths at events, and we never discussed the poem-letters. They were that intimate time and space for us, of a poem, of a letter, of a room that was a new room for us to inhabit, individually, as we moved toward or away from ourselves and one another, and together, as we became a new space for each other to fill with words. These poems are in some ways very different than anything I’ve ever written—I’ve written about dark and bright emotionalities before, but this is a new, more vulnerable, more open field of myself that I found through my correspondence with Ada. We borrow one another’s phrases and language at times, we incorporate friends and lovers, we thread through what we are reading and what is happening in our lives and our worlds, like any letter would. Ada is one of the most important audiences I have written for, because I love her, she is my friend, and I also admire her as a poet and thinker and person. In some ways, I have risked more of myself in these poems than in other poems I have written. She has become one of the beloveds I write toward, as are my family, my friends, my lovers, my peoples and communities.” -Natalie Diaz",
  "itunes:author": "WNYC Studios and The New Yorker",
  "itunes:keywords": "poetry,new,yorker,literature,wnyc,studios"
}