{
  "title": "Desperate Dems Cheer FBI & Raid On Mar-A-Lago",
  "itunes:title": "Desperate Dems Cheer FBI & Raid On Mar-A-Lago",
  "pubDate": "Fri, 19 Aug 2022 05:00:45 +0000",
  "guid": "e6d54828-3520-4029-abed-de4a97dbd361",
  "link": "https://thejimmydoreshow.libsyn.com/desperate-dems-cheer-fbi-raid-on-mar-a-lago",
  "itunes:image": "",
  "description": "<p>The political world was rocked last week when FBI agents descended on Mar-a-Lago, Donald Trump’s Florida estate, and scoured the former president’s home, making off with boxes and boxes of documents. Later reports emerged that Trump may have held on to highly sensitive classified materials relating to the nation’s nuclear program and will be accused of violating the Espionage Act. Democrats cheered the FBI raid while Trump supporters accused the Justice Department of engaging in a partisan witch hunt.<br /> <br /> Jimmy and his panel of The Grayzone’s Max Blumenthal and America’s comedian Kurt Metzger discuss what might have really motivated this unprecedented raid on a former president’s home.<br /> <br /> Plus a segment on Andrew Yang's inability to defend his new third party effort under wilting questioning from CNN's Jim Acosta.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from Chuck Schumer and Andrew Cuomo!</p>",
  "content:encoded": "<p>The political world was rocked last week when FBI agents descended on Mar-a-Lago, Donald Trump’s Florida estate, and scoured the former president’s home, making off with boxes and boxes of documents. Later reports emerged that Trump may have held on to highly sensitive classified materials relating to the nation’s nuclear program and will be accused of violating the Espionage Act. Democrats cheered the FBI raid while Trump supporters accused the Justice Department of engaging in a partisan witch hunt.  Jimmy and his panel of The Grayzone’s Max Blumenthal and America’s comedian Kurt Metzger discuss what might have really motivated this unprecedented raid on a former president’s home.  Plus a segment on Andrew Yang's inability to defend his new third party effort under wilting questioning from CNN's Jim Acosta.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from Chuck Schumer and Andrew Cuomo!</p>",
  "enclosure": "",
  "itunes:duration": "01:05:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The political world was rocked last week when FBI agents descended on Mar-a-Lago, Donald Trump’s Florida estate, and scoured the former president’s home, making off with boxes and boxes of documents. Later reports emerged that Trump may have held...",
  "itunes:episodeType": "full",
  "itunes:summary": "The political world was rocked last week when FBI agents descended on Mar-a-Lago, Donald Trump’s Florida estate, and scoured the former president’s home, making off with boxes and boxes of documents. Later reports emerged that Trump may have held on to highly sensitive classified materials relating to the nation’s nuclear program and will be accused of violating the Espionage Act. Democrats cheered the FBI raid while Trump supporters accused the Justice Department of engaging in a partisan witch hunt. Jimmy and his panel of The Grayzone’s Max Blumenthal and America’s comedian Kurt Metzger discuss what might have really motivated this unprecedented raid on a former president’s home. Plus a segment on Andrew Yang's inability to defend his new third party effort under wilting questioning from CNN's Jim Acosta. Also featuring Stef Zamorano and Mike MacRae! And phone calls from Chuck Schumer and Andrew Cuomo!"
}