{
  "id": "yt:video:XR0VKqfSHBk",
  "yt:videoId": "XR0VKqfSHBk",
  "yt:channelId": "UC9_p50tH3WmMslWRWKnM7dQ",
  "title": "Cheesy broiled sheet pan pasta with vegetables",
  "link": "",
  "author": {
    "name": "Adam Ragusea",
    "uri": "https://www.youtube.com/channel/UC9_p50tH3WmMslWRWKnM7dQ"
  },
  "published": "2022-11-03T18:00:20+00:00",
  "updated": "2022-11-05T04:52:50+00:00",
  "media:group": {
    "media:title": "Cheesy broiled sheet pan pasta with vegetables",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Thanks to Audible for sponsoring this video! Let Audible help you discover new ways to laugh, be inspired, or be entertained. New members can try it free for 30 days. Visit https://audible.com/adamragusea or text adamragusea to 500-500.\n\n***RECIPE, SERVES 4-6***\n\n8 oz (223g) cascatelli or other large pasta shape\n1 lemon\n2 lb (908g) brussels sprouts\n2 carrots\n2 shallots\n4 oz (113g) thick diced pancetta (or any fatty cured meat, or none at all)\n8 oz (223g) mozarella\n8 oz (223g) ricotta\n1 red chili\n2 garlic cloves\npanko breadcrumbs\npecorino or parmesan cheese\nfennel seeds\nthyme (or other fresh herb)\n\nStart by making the breadcrumb topping. Zest the lemon, grate up a little pile or pecorino or parmesan cheese, thin-slice the chili, pick some thyme leaves, peel the garlic, and chop all of these ingredients into each other until fine. Combine with an equal quantity of panko and set aside. Save the rest of the lemon for later.\n\nGrate the mozzarella and set aside. Prep the brussels sprouts by trimming off the stem ends and any decaying outer leaves and then quarter them. Slice the carrots thinly. Peel and chop the shallots.\n\nGet a pot of salted water coming to a boil for the pasta. Lay the pancetta out on a sheet pan in an even layer, put it in the oven and turn on the broiler/grill. Get the pasta boiling — you'll cook it until it's a couple minutes away from being done, then drain and reserve.\n\nWhen the pancetta has leaked out a lot of fat and it's about as crispy as you want it, pull the pan out, toss in the sprouts, carrots, fennel seeds, and enough salt for all the veg. Spread into an even layer and return to the broiler until the veg looks almost cooked.\n\nTake the pan back out, toss in the drained pasta and about a third of the mozzarella. Use a spoon to drop the ricotta onto the pan in dollops. Scatter the remaining mozzarella across the top, avoiding the ricotta dollops (you want to leave them exposed on top so they brown). Do the same with the breadcrumb topping.\n\nReturn the pan to the broiler and cooked until brown and crispy on top. Squeeze lemon juice over everything and eat.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}