{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-8933544183484893826",
  "published": "2022-10-21T18:27:00.004+05:00",
  "updated": "2022-10-21T18:27:24.575+05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "Mondelez International Facilitates Over 22 million PKR for Flood Rehabilitation in Pakistan",
  "content": "<p>&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiaggcEjSkaHLWsjC8F0HYrQnDSm5yH5REQC-Q5bRInJdlFU38HwJFn04wbN3HKN_gnHoRt98RvAIOrmZlJqg1pVpuWeiO3wQL3ZTV6lnRfgYYZMzl-xATGE4yoOtfR-NKGn2o_PgTiFwpBgUs8jM_4FA0mTqs1AFAsdp4gX5asL7aM3mZS5nUtdMX24Q/s2716/20221021_102722.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"Mondelez International Facilitates Over 22 million PKR for Flood Rehabilitation in Pakistan\" border=\"0\" data-original-height=\"1760\" data-original-width=\"2716\" height=\"414\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiaggcEjSkaHLWsjC8F0HYrQnDSm5yH5REQC-Q5bRInJdlFU38HwJFn04wbN3HKN_gnHoRt98RvAIOrmZlJqg1pVpuWeiO3wQL3ZTV6lnRfgYYZMzl-xATGE4yoOtfR-NKGn2o_PgTiFwpBgUs8jM_4FA0mTqs1AFAsdp4gX5asL7aM3mZS5nUtdMX24Q/w640-h414/20221021_102722.jpg\" width=\"640\" /></a></div><br /><p></p><p class=\"MsoNormal\" style=\"text-align: justify;\"><b><i>Karachi&nbsp;</i></b>With the entire country standing in unison to aid rehabilitation efforts in flood-affected regions of Pakistan, Mondelez Pakistan Limited, being one of the country’s leading socially responsible corporate entities has played its part by contributing over 100,000/- USD in cash along with in-kind donations to support families in building their homes and livelihoods once again. To ensure that our contribution have been given to the right impacted people, Mondelez Pakistan Limited has partnered with Akhuwat and Pakistan Red Crescent Society (PRCS), both leading institutions in the country working round the clock to facilitate affected people in Pakistan.</p><p class=\"MsoNormal\" style=\"text-align: justify;\"><o:p></o:p></p> <p class=\"MsoNormal\" style=\"text-align: justify;\">Recent flooding across Pakistan affected more than 33 million families and there is a lot more that still needs to be done to return these people to their normal lives. In playing its part, Mondelez Pakistan Limited has disbursed cash donations as well as supplies including clothes, medical supplies, food and a variety of other necessary items to continue facilitating people and their journey towards rehabilitation. The donations will be channeled to assist not just in reconstruction of homes but also to provide sustainable avenues for families to rebuild what they’ve lost and to provide for their loved ones. <span style=\"mso-spacerun: yes;\">&nbsp;</span><o:p></o:p></p> <p class=\"MsoNormal\" style=\"text-align: justify;\">Commenting at the occasion, Mr. Sami A. Wahid - Managing Director, Mondelēz Pakistan Limited has stated; <b><i>Mondelez Changemakers</i></b><i>&nbsp;is our global community involvement program that closely ties to Snacking Made Right and allows us to make an impact by giving back to community.&nbsp;These are trying times for a significant chunk of the population of Pakistan and People have lost their homes, livelihood and loved ones. Although flood waters are receding across the country, there is a lot that still needs to be done. As a nation and more importantly as an empathetic social entity, we at Mondelez Pakistan Limited are pleased to play a role with our partners doing the same for rehabilitation initiatives being carried out across the country.”<o:p></o:p></i></p> <p class=\"MsoNormal\" style=\"text-align: justify;\"><span style=\"mso-bidi-font-style: italic;\">While expressing his gratitude, Mr. Kanwar Waseem, PRCS Provincial Secretary thanked Mondelez Pakistan for standing with the people of Pakistan in these testing times. He also added,<i> “The unprecedented floods have played havoc across the country. We need joint efforts for alleviating the sufferings of the flood victims and need speedy compensation for those families who had lost their loved ones and whose property had been damaged during the floods</i>.” <o:p></o:p></span></p> <p class=\"MsoNormal\" style=\"text-align: justify;\"><span style=\"mso-bidi-font-style: italic;\">Dr. Amjad Saqib, Founder of Akhuwat also appreciated the contributions of Mondelez International and said<i> “I offer my heartfelt gratitude towards Mondelez Pakistan for their cash and in-kind donation. In this hour of difficulty, the responsibility falls on everyone to share the pain and suffering of the flood victims while also helping them with their difficulties. As a nation, we must work together to rebuild and rehabilitate families from flood affected areas across the country.”<o:p></o:p></i></span></p> <p class=\"MsoNormal\" style=\"text-align: justify;\">Mondelez Pakistan Limited is organizing extensive efforts to support all flood affected families, including its own employees, who have suffered on account of these unprecedented floods. <o:p></o:p></p> <p class=\"MsoNormal\" style=\"text-align: justify;\">Mondelēz Pakistan Limited is a wholly owned subsidiary of Mondelēz International, Inc. which is a world leader in chocolates, biscuits, gum, candy, and powdered beverages. Mondelēz Pakistan Limited portfolio includes flagship brands such as Cadbury Dairy Milk and Tang which enjoy a market leadership position in their respective categories.</p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}