{
  "title": "Hot Mic! Hot Mic!  The Best Military Hot Mic Moments",
  "description": "<p>On today's ZBT we've got 4 rounds in the magazine ...\n\nRound 1: Hot mic, hot mic, hot mic. The South Korean President got caught with his verbal pants around his ankles calling our beloved, very smart Congress either fucking idiots or fucking morons. There’s an argument over the translation but not if congress is filled with morons. \n\nROUND 2: Scientists have determined “the worst smell in the world” and spoiler alert, it’s a military smell. Warning - this is a Katie-Rabbit-Hole round that also involves McDonalds\n\nROUND 3: Over the last several years Fort Bragg has stood out for a shocking rise in overdose deaths & drug offenses, including an MP selling drugs out of his cop car on base. We talk about the fentanyl epidemic & how it’s affecting the troops. \n\nROUND 4: They’re calling it Putin’s “Dad Army” as thousands of aging men report for Russia’s draft. No word on if they’ve been issued New Balance. \n\nSUPPORT THE SHOW!\n\nWhistlePig Whiskey\t\n- Get your bottle at https://barstool.link/WPZBT or at a local retailer.\nCross Country Mortgage\t\n- Visit CCM.com/barstool now. Equal Housing Opportunity. CrossCountry Mortgage. NMLS 3029. All loans are subject to underwriting approval. NMLSconsumeraccess.org.\nRhoback\t\n- Go to https://barstool.link/RhobackBSS and use the code “ZERO” for 20% off your first purchase\nRocky Boots\t\n- Go to https://barstool.link/RockyBootsBSS and enter the code ZBT at check out for 25% off your next pair of boots.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "0b2055b3-cff4-4fe6-b14e-c87c977002d7",
  "pubDate": "Fri, 30 Sep 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "00:59:59",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}