{
  "title": "#23/Reviving Modern: Michael Miner & Liz Waytkus",
  "pubDate": "Mon, 03 Apr 2017 07:00:00 +0000",
  "guid": "5f994d271d46cc8cad71e160f92ae8dc",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM23.mp3",
  "itunes:image": "",
  "description": "<p>Today we explore two different approaches to reviving Modernist buildings: preserving them or building them from scratch!</p> <p><strong>Michael Miner</strong> is a documentary filmmaker who since 2002 has devoted his career entirely to the work of Frank Lloyd Wright, chronicling the master architect’s buildings in a series of films. Miner’s first Wright film, <em>Sacred Spaces</em>, was completed in 2005 followed by <em>A Child of the Sun</em>, the story of the West Campus of Florida Southern College in Lakeland and <em>Romanza,</em> which was released in 2011. Miner's fourth film is called <em>Masterpieces</em>. But here what's really interesting - <a href= \"http://flwrevivalinitiative.org/\"><span class=\"auto-style13\">he's on a mission to actually build some of Wright's unbuilt buildings</span></a> starting in Banff, Canada.<br /> <br /> <strong>Liz Waytkus</strong> is the Executive Director of <a href= \"http://www.docomomo-us.org/\"><span class=\"auto-style13\">Docomomo US</span></a>, the leading preservation organization dedicated to the preservation of modern architecture, landscapes, and design. She has worked to increase the awareness of and appreciation for significant modern sites and developed annual Docomomo US National Symposium and the Modernism in America Awards. Her organization's most recent success was preserving the Ambassador Grill near the United Nations in NYC.</p>",
  "content:encoded": "<p>Today we explore two different approaches to reviving Modernist buildings: preserving them or building them from scratch!</p> <p>Michael Miner is a documentary filmmaker who since 2002 has devoted his career entirely to the work of Frank Lloyd Wright, chronicling the master architect’s buildings in a series of films. Miner’s first Wright film, <em>Sacred Spaces</em>, was completed in 2005 followed by <em>A Child of the Sun</em>, the story of the West Campus of Florida Southern College in Lakeland and <em>Romanza,</em> which was released in 2011. Miner's fourth film is called <em>Masterpieces</em>. But here what's really interesting - <a href= \"http://flwrevivalinitiative.org/\">he's on a mission to actually build some of Wright's unbuilt buildings</a> starting in Banff, Canada.  Liz Waytkus is the Executive Director of <a href= \"http://www.docomomo-us.org/\">Docomomo US</a>, the leading preservation organization dedicated to the preservation of modern architecture, landscapes, and design. She has worked to increase the awareness of and appreciation for significant modern sites and developed annual Docomomo US National Symposium and the Modernism in America Awards. Her organization's most recent success was preserving the Ambassador Grill near the United Nations in NYC.</p>",
  "enclosure": "",
  "itunes:duration": "34:59",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today we explore two different approaches to reviving Modernist buildings: preserving them or building them from scratch! Michael Miner is a documentary filmmaker who since 2002 has devoted his career entirely to the work of Frank Lloyd Wright,...",
  "itunes:episodeType": "full"
}