{
  "title": "The Evidence Lower Bound of Variational Autoencoders Converges to a Sum of Three Entropies. (arXiv:2010.14860v4 [stat.ML] UPDATED)",
  "link": "http://arxiv.org/abs/2010.14860",
  "description": "<p>The central objective function of a variational autoencoder (VAE) is its\nvariational lower bound (the ELBO). Here we show that for standard (i.e.,\nGaussian) VAEs the ELBO converges to a value given by the sum of three\nentropies: the (negative) entropy of the prior distribution, the expected\n(negative) entropy of the observable distribution, and the average entropy of\nthe variational distributions (the latter is already part of the ELBO). Our\nderived analytical results are exact and apply for small as well as for\nintricate deep networks for encoder and decoder. Furthermore, they apply for\nfinitely and infinitely many data points and at any stationary point (including\nlocal maxima and saddle points). The result implies that the ELBO can for\nstandard VAEs often be computed in closed-form at stationary points while the\noriginal ELBO requires numerical approximations of integrals. As a main\ncontribution, we provide the proof that the ELBO for VAEs is at stationary\npoints equal to entropy sums. Numerical experiments then show that the obtained\nanalytical results are sufficiently precise also in those vicinities of\nstationary points that are reached in practice. Furthermore, we discuss how the\nnovel entropy form of the ELBO can be used to analyze and understand learning\nbehavior. More generally, we believe that our contributions can be useful for\nfuture theoretical and practical studies on VAE learning as they provide novel\ninformation on those points in parameters space that optimization of VAEs\nconverges to.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Damm_S/0/1/0/all/0/1\">Simon Damm</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Forster_D/0/1/0/all/0/1\">Dennis Forster</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Velychko_D/0/1/0/all/0/1\">Dmytro Velychko</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Dai_Z/0/1/0/all/0/1\">Zhenwen Dai</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Fischer_A/0/1/0/all/0/1\">Asja Fischer</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Lucke_J/0/1/0/all/0/1\">J&#xf6;rg L&#xfc;cke</a>"
}