{
  "title": "559: 'Fantastic Beasts: The Secrets of Dumbledore' Review!",
  "link": "https://audioboom.com/posts/8068681",
  "itunes:episode": 559,
  "itunes:title": "'Fantastic Beasts: The Secrets of Dumbledore' Review!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4658,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, it's all about reviewing Fantastic Beasts: The Secrets of Dumbledore! It's finally here, so just how many secrets were there, and did they live up to expectations? We touch on some of the film's biggest moments and discuss whether or not this could be the last installment in the Fantastic Beasts franchise.<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome Slug Club member, <a href=\"https://www.instagram.com/jemimaskelley/?hl=en\">Jemima</a>!</li>\n<li>Main Discussion: Our review of Fantastic Beasts: The Secrets of Dumbledore</li>\n<li>The hosts given their spoiler-free initial reactions to the third Fantastic Beasts film before jumping into all the details and spoilers</li>\n<li>Did this movie course-correct like we hoped it would?</li>\n<li>The Top 7 Moments from The Secrets of Dumbledore...</li>\n<li>Say what, kid?!? Aurelius is Aberforth's lovechild?!?</li>\n<li>Ariana WAS an obscurus! Were we satisfied with the reveal?</li>\n<li>Tea time with Albus and Gellert</li>\n<li>Is Mads the Grindelwald we've been waiting for?</li>\n<li>The Brothers Scamander take on the Manticore</li>\n<li>Could any of us make sense of The Election?</li>\n<li>The Blood Pact: Explained & Destroyed</li>\n<li>Queenie & Jacob: Going to the bakery andddd gonna get marrrried!</li>\n<li>Next week: More on The Secrets of Dumbledore, including our favorite characters, scenes, and beasts</li>\n<li>Be sure to check out Micah on Everyone's A Reel Critic (where they discuss movies with at least a 20% differential between the critic and audience rating) to talk about Crimes of Grindelwald!</li>\n<li>This week's episode is brought to you by AMC Shudder (stream your first 30 days of Shudder for FREE by going to <a href=\"https://www.shudder.com/\">Shudder.com</a> and using code mugglecast) & MeUndies (get 25% off your first Membership item or 15% off your first order and a 100% satisfaction guarantee by visiting <a href=\"https://www.MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a>)!</li>\n</ul>\n",
  "pubDate": "Mon, 18 Apr 2022 17:30:24 +0000",
  "guid": "tag:audioboom.com,2022-04-18:/posts/8068681",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}