{
  "id": "yt:video:yZ8Tv8zn59Q",
  "yt:videoId": "yZ8Tv8zn59Q",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "Psychedelic Science in 2020 | An overview of the psychedelic renaissance",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2020-06-21T18:52:03+00:00",
  "updated": "2022-08-04T05:58:49+00:00",
  "media:group": {
    "media:title": "Psychedelic Science in 2020 | An overview of the psychedelic renaissance",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We are in the midst of a huge resurgence of scientific interest in psychedelic substances. They are now being shown to have great potential for a variety of applications - from treating mental conditions, to enhancing our meditation practice, to increasing our connection to nature.\n\nIn this video, I give a broad overview of the latest exciting psychedelic research being conducted at leading institutions across the globe!\n\nDon't forget to follow me on social media for all the latest updates: \n\nInstagram\nhttps://www.instagram.com/thepsychedelicscientist \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychedelic-Scientist-113887593677455 \n\nMore info about the host:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/Manesh_Girn\n\n---\n\nOn popular request, here are the papers I refer to in this video (in no particular order):\n\n1. Carhart-Harris, R.L., et al., Psilocybin with psychological support for treatment-resistant depression: an open-label feasibility study. The Lancet Psychiatry, 2016. 3(7): p. 619-627.\n2. Lyons, T. and R.L. Carhart-Harris, Increased nature relatedness and decreased authoritarian political views after psilocybin for treatment-resistant depression. Journal of Psychopharmacology, 2018. 32(7): p. 811-819.\n3. Johnson, M.W., et al., Classic psychedelics: An integrative review of epidemiology, therapeutics, mystical experience, and brain network function. Pharmacology & therapeutics, 2019. 197: p. 83-102.\n4. Griffiths, R.R., et al., Psilocybin produces substantial and sustained decreases in depression and anxiety in patients with life-threatening cancer: A randomized double-blind trial. Journal of psychopharmacology, 2016. 30(12): p. 1181-1197.\n5. Johnson, M.W., et al., Pilot study of the 5-HT2AR agonist psilocybin in the treatment of tobacco addiction. Journal of Psychopharmacology, 2014. 28(11): p. 983-992.\n6. MacLean, K.A., M.W. Johnson, and R.R. Griffiths, Mystical experiences occasioned by the hallucinogen psilocybin lead to increases in the personality domain of openness. Journal of Psychopharmacology, 2011. 25(11): p. 1453-1461.\n7. Griffiths, R.R., et al., Mystical-type experiences occasioned by psilocybin mediate the attribution of personal meaning and spiritual significance 14 months later. Journal of Psychopharmacology, 2008. 22(6): p. 621-632.\n8. Griffiths, R.R., et al., Psilocybin can occasion mystical-type experiences having substantial and sustained personal meaning and spiritual significance. Psychopharmacology, 2006. 187(3): p. 268-283.\n9. Carhart-Harris, R.L. and K.J. Friston, REBUS and the Anarchic Brain: Toward a Unified Model of the Brain Action of Psychedelics. Pharmacological Reviews, 2019. 71(3): p. 316-344.\n10. Carhart-Harris, R.L., et al., Neural correlates of the LSD experience revealed by multimodal neuroimaging. Proceedings of the National Academy of Sciences, 2016. 113(17): p. 4853-4858.\n11. Carhart-Harris, R.L., et al., Neural correlates of the psychedelic state as determined by fMRI studies with psilocybin. Proceedings of the National Academy of Sciences, 2012. 109(6): p. 2138-2143.\n12. Krebs, T.S. and P.-Ø. Johansen, Lysergic acid diethylamide (LSD) for alcoholism: meta-analysis of randomized controlled trials. Journal of Psychopharmacology, 2012. 26(7): p. 994-1002.\n13. Girn, M., et al., Updating the dynamic framework of thought: Creativity and psychedelics. NeuroImage, 2020: p. 116726.\n14. Baggott, M.J., Psychedelics and creativity: a review of the quantitative literature. PeerJ PrePrints, 2015. 3: p. e1202v1.\n15. Ross, S., et al., Rapid and sustained symptom reduction following psilocybin treatment for anxiety and depression in patients with life-threatening cancer: a randomized controlled trial. Journal of psychopharmacology, 2016. 30(12): p. 1165-1180.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}