{
  "title": "Packages Considered Slightly Harmful",
  "link": "",
  "updated": "2013-07-02T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2013/07/02/Packages",
  "content": "<p><em>I originally presented this idea as a lightning talk at SciPy-2013.  It is <a href=\"http://www.youtube.com/watch?v=ywHqIEv3xXg\">on youtube</a> starting around 6:25</em></p>\n\n<p>We start with the following principle</p>\n\n<p>Principle: <em>Refactor general code into a separate module/package</em></p>\n\n<p>This principle is illustrated with the following pair of images (left: siloed code, right: open code)</p>\n\n<table>\n  <thead>\n    <tr>\n      <th style=\"text-align: center\">Before: General and specific code linked</th>\n      <th style=\"text-align: center\">After: Specific code imports general code</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td style=\"text-align: center\"><img src=\"https://mrocklin.github.io/blog/images/care.png\" width=\"90%\" /></td>\n      <td style=\"text-align: center\"><img src=\"https://mrocklin.github.io/blog/images/care2.png\" width=\"90%\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Invariably packages contain code of varying general utility.  Scientific codes often target specific applications (like genome sequencing of the fruit fly) but also contain some generally applicable routines (like fuzzy string matching).  These general routines have great potential value to the broader community but are unfortunately sequestered within the special-case application code.</p>\n\n<p>Problem:  Packages unnecessarily tie together general code and application specific code.</p>\n\n<p>Solution:  Extract general components to separate packages.  Import these packages into application specific code.</p>\n\n<h2 id=\"absurdity\">Absurdity</h2>\n\n<p>As with all good lightning talks, we take the idea to absurdity.</p>\n\n<p>Invariably even the extracted general project will have components of more or less generality.  We repeat our principle and separate the “general” package into its more general and less general components.  We do this until no package contains components of varying generality.  This process produces packages of boundless granularity.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th style=\"text-align: center\">Separate super-general code from general code</th>\n      <th style=\"text-align: center\">Absurd separation to many tiny projects</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td style=\"text-align: center\"><img src=\"https://mrocklin.github.io/blog/images/care4.png\" width=\"90%\" /></td>\n      <td style=\"text-align: center\"><img src=\"https://mrocklin.github.io/blog/images/care6.png\" width=\"90%\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Intermediate projects become empty collections of imports.  We remove them and find a sea of atomic packages with dependencies.  Our application code becomes much smaller due to the sea of generally applicable code.</p>\n\n<h2 id=\"groupby\">GroupBy</h2>\n\n<p>The talk then discussed <code class=\"language-plaintext highlighter-rouge\">groupby</code>, a particular general function to group a collection by the action of a function.  Groupby is discussed in more detail in <a href=\"http://matthewrocklin.com/blog/work/2013/05/21/GroupBy/\">a previous blog post.</a></p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>names = ['Alice', 'Bob', 'Charlie', 'Dan', 'Edith', 'Frank']\nassert groupby(len, names) == {3: ['Bob', 'Dan'],\n                               5: ['Alice', 'Edith', 'Frank'],\n                               7: ['Charlie']}\n</code></pre></div></div>\n\n<p>I love <code class=\"language-plaintext highlighter-rouge\">groupby</code>.  I implement it in most of my projects.  A quick grep of my workspace directory shows that it is separately defined in six different projects.</p>\n\n<p>Clearly this is sub-optimal.  We should put the <code class=\"language-plaintext highlighter-rouge\">groupby</code> function into a package.  This raises the following difficult design decision:</p>\n\n<p><em>In which package does <code class=\"language-plaintext highlighter-rouge\">groupby</code> belong?</em></p>\n\n<p>One could imagine placing it in a new <a href=\"https://github.com/mrocklin/itertoolz/\"><code class=\"language-plaintext highlighter-rouge\">itertoolz</code></a> library because it consumes iterators.  Or perhaps a <code class=\"language-plaintext highlighter-rouge\">dicttoolz</code> because it produces a dict.  Or perhaps a new <code class=\"language-plaintext highlighter-rouge\">functoolz</code> because it is a higher order function like <code class=\"language-plaintext highlighter-rouge\">map</code> or <code class=\"language-plaintext highlighter-rouge\">filter</code>.  Each of these utility libraries could use <code class=\"language-plaintext highlighter-rouge\">groupby</code>.  The principle to <em>separate general code from specific code</em> dictates that the ideal package must be the intersection of all larger packages.</p>\n\n<p><img src=\"https://mrocklin.github.io/blog/images/groupby0.png\" width=\"100%\" /></p>\n\n<p>The result is that <code class=\"language-plaintext highlighter-rouge\">groupby</code> lives in its own project</p>\n\n<figure class=\"highlight\">\n  <pre><code class=\"language-python\" data-lang=\"python\"><span class=\"kn\">from</span> <span class=\"nn\">groupby</span> <span class=\"kn\">import</span> <span class=\"n\">groupby</span></code></pre>\n</figure>\n\n<p>This seems absurd.</p>\n\n<h2 id=\"discussion\">Discussion</h2>\n\n<p>This talk generated significantly more discussion than my real talk.  Here are some of the thoughts that came out of subsequent conversations with other SciPy developers.  If you have thoughts please list them in the comments.  I’m happy to modify this post to reflect your views.</p>\n\n<h4 id=\"cross-package-testing-is-difficult\">Cross package testing is difficult</h4>\n\n<p>We often test interactions between different functions.  If these functions are separated between different packages it’s not clear where the tests should go.  We don’t have good tooling or practices for cross package testing.</p>\n\n<h4 id=\"development-across-repositories-is-difficult\">Development across repositories is difficult</h4>\n\n<p>Developing new code with uncertain and dynamic interfaces is challenging.  This challenge is compounded by the constant juggling of repository state.  Cross developing different functions in many repositories imposes a significant mental load.</p>\n\n<h4 id=\"package-management-has-issues\">Package management has issues</h4>\n\n<p>I made the claim during my talk that managing dependencies is cheap.  Many people brought up good issues with this and rightly so.  Particularly non-Python dependencies and versioning both cause significant issues with dependency management.</p>\n\n<h2 id=\"my-thoughts\">My Thoughts</h2>\n\n<p>Dividing packages with boundless granularity clearly breaks current models of development.  I do not recommend this development model literally for day-to-day work.  Instead, I hope that people move somewhat in the direction of separating general code from specific code and using dependency managers more aggressively.  Principles must be moderated with pragmatism.</p>\n\n<p>Given that, I’m now going to talk about how one might resolve the issues above in an ideal world.  I don’t think this is idle thinking.  Programming communities constantly amaze me with their ability to overhaul their development models.  The driving motivation for this work is</p>\n\n<p><em>granular software ecosystems enable software evolution</em>.</p>\n\n<h4 id=\"separate-source-from-tests\">Separate <code class=\"language-plaintext highlighter-rouge\">source</code> from <code class=\"language-plaintext highlighter-rouge\">tests</code></h4>\n\n<p>Placing source code and test code into separate projects specifies a clear interface and enables open competition.  It demotes the original implementation and encourages alternative efforts.</p>\n\n<p>Testing code need not be associated one-to-one with source code.   Several different implementations can satisfy the same tests.  We want to encourage several competing implementations; this competition enables growth and flexibility.  Ease of competition is critical for a healthy and dynamic ecosystem.</p>\n\n<p>For example, the testing function <a href=\"https://gist.github.com/mrocklin/5722155\"><code class=\"language-plaintext highlighter-rouge\">test_groupby</code></a> clearly specifies the requirements for the <code class=\"language-plaintext highlighter-rouge\">groupby</code> function.  I satisfy this test with my implementation of <a href=\"https://gist.github.com/mrocklin/5618992\"><code class=\"language-plaintext highlighter-rouge\">groupby</code></a>.  Because these exist separately my implementation has no elevated status.  Others may implement code to satisfy this test with equal voice.  <em>Elevating test suites to first class packages establishes clear interfaces and promotes competition</em></p>\n\n<p>Source code does not depend on other source code; it depends on a consistent interface.  Tests are used to specify this interface.  It is not the case that <code class=\"language-plaintext highlighter-rouge\">scipy</code> depends on <code class=\"language-plaintext highlighter-rouge\">numpy</code> but rather that <code class=\"language-plaintext highlighter-rouge\">scipy</code> depends on code that satisfies the <code class=\"language-plaintext highlighter-rouge\">numpy</code> test suite.  Accepting this separation enables alternative implementations (like <a href=\"https://github.com/ContinuumIO/dynd-python\"><code class=\"language-plaintext highlighter-rouge\">DyND</code></a> or <a href=\"http://blog.enthought.com/general/enthought-awarded-1m-doe-sbir-grant-to-develop-open-source-python-hpc-framework/\"><code class=\"language-plaintext highlighter-rouge\">Odin</code></a>) to more easily displace NumPy.  This evolution is critical to the evolution of existing scientific Python software to adapt to changing hardware.</p>\n\n<h4 id=\"tooling-can-follow-need\">Tooling can follow need</h4>\n\n<p>Many of the problems with granular dependencies involve existing tools (Python package managers, git.)  These problems are surmountable.  Recent experience with surmounting tool deficiencies is encouraging.  <code class=\"language-plaintext highlighter-rouge\">git</code> was developed to support a single large open source community when <code class=\"language-plaintext highlighter-rouge\">svn</code> failed to scale.  Frustrations with existing package managers have lead to new developments like <a href=\"http://docs.continuum.io/conda/\"><code class=\"language-plaintext highlighter-rouge\">conda</code></a>.</p>\n\n<p>If programmers adopt higher standards of package granularity then I am confident that tool developers and enthusiasts will move to support those practices.</p>\n\n<h2 id=\"final-thoughts\">Final Thoughts</h2>\n\n<p>The main point is this before and after pair of images.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th style=\"text-align: center\">Before: General and specific code linked</th>\n      <th style=\"text-align: center\">After: Specific code imports general code</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td style=\"text-align: center\"><img src=\"https://mrocklin.github.io/blog/images/care.png\" width=\"90%\" /></td>\n      <td style=\"text-align: center\"><img src=\"https://mrocklin.github.io/blog/images/care2.png\" width=\"90%\" /></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The second point is that the challenges of software distribution have changed in recent years.  The demands on the end user of organized software construction have been considerably lessened.  This changes how we should approach software development, particularly within community codebases.  We should consider how these practices affect the strength and adaptability of the ecosystem.  This isn’t perfect yet but it seems to be improving.  How do we want future development to look like to take advantage of these advancements?</p>"
}