{
  "title": "Wilderei und Artenschutz - Stille im Wald - Illegaler Vogelfang in Deutschland",
  "link": "https://www.deutschlandfunk.de/wilderei-und-artenschutz-stille-im-wald-illegaler-vogelfang-100.html",
  "description": "<img src=\"https://assets.deutschlandfunk.de/FILE_945afd51f414fbb84b0b6517f50c8ebc/1280x720.jpg?t=1636093005827\" alt=\"In einer Voliere des Tierschützers Matthias Borkmann aus Frankfurt (Oder) sitzen am 15.11.2002 unzählige gerettete Distelfinken (Stieglitze). Fast 1000 geschmuggelte Stieglitze hat der Zoll am Autobahngrenzübergang Frankfurt (Oder) im doppelten Boden eines Pkw-Anhängers gefunden. 257 der in Käfigen versteckten 992 Singvögel waren bereits tot, wie eine Sprecherin des Frankfurter Hauptzollamts am 15.11.2002 mitteilte. Die noch lebenden Vögel wurden zu einem Tierschützer in der Oderstadt gebracht und am gleichen Tag wieder in die Freiheit entlassen. Die europäischen Singvögel stehen unter Naturschutz.\" title=\"In einer Voliere des Tierschützers Matthias Borkmann aus Frankfurt (Oder) sitzen am 15.11.2002 unzählige gerettete Distelfinken (Stieglitze). Fast 1000 geschmuggelte Stieglitze hat der Zoll am Autobahngrenzübergang Frankfurt (Oder) im doppelten Boden eines Pkw-Anhängers gefunden. 257 der in Käfigen versteckten 992 Singvögel waren bereits tot, wie eine Sprecherin des Frankfurter Hauptzollamts am 15.11.2002 mitteilte. Die noch lebenden Vögel wurden zu einem Tierschützer in der Oderstadt gebracht und am gleichen Tag wieder in die Freiheit entlassen. Die europäischen Singvögel stehen unter Naturschutz.\"\n                    width=\"144\" height=\"81\" border=\"0\" align=\"left\" hspace=\"4\" vspace=\"4\"/>Wer beim Stichwort \"illegaler Vogelhandel“ nur an Südostasien denkt, liegt falsch. Auch hierzulande ist die Nachfrage nach Singvögeln groß - ein lukratives Geschäft für Wilderer. Das Risiko einer Strafverfolgung ist bislang gering. Aber das könnte sich dank neuer Gen-Analyse-Methoden ändern.<br clear=\"all\"/><br/>Von Joachim Budde<br/>www.deutschlandfunk.de, Forschung aktuell<br/>Hören bis: 19. Januar 2038, 04:14<br/><a title=\"Direkter Link zur Audiodatei\" href=\"https://podcast-mp3.dradio.de/podcast/2021/11/07/stille_im_wald_ueber_illegalen_vogelfang_in_deutschland_dlf_20211107_1630_efd804b4.mp3\">Direkter Link zur Audiodatei</a><br/><p><br/></p>",
  "guid": "https://podcast-mp3.dradio.de/podcast/2021/11/07/stille_im_wald_ueber_illegalen_vogelfang_in_deutschland_dlf_20211107_1630_efd804b4.mp3",
  "pubDate": "Sun, 29 May 2022 16:30:00 +0200",
  "enclosure": "",
  "itunes:author": "Budde, Joachim",
  "itunes:duration": "27:47"
}