{
  "title": "TextCraft: Zero-Shot Generation of High-Fidelity and Diverse Shapes from Text. (arXiv:2211.01427v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01427",
  "description": "<p>Language is one of the primary means by which we describe the 3D world around\nus. While rapid progress has been made in text-to-2D-image synthesis, similar\nprogress in text-to-3D-shape synthesis has been hindered by the lack of paired\n(text, shape) data. Moreover, extant methods for text-to-shape generation have\nlimited shape diversity and fidelity. We introduce TextCraft, a method to\naddress these limitations by producing high-fidelity and diverse 3D shapes\nwithout the need for (text, shape) pairs for training. TextCraft achieves this\nby using CLIP and using a multi-resolution approach by first generating in a\nlow-dimensional latent space and then upscaling to a higher resolution,\nimproving the fidelity of the generated shape. To improve shape diversity, we\nuse a discrete latent space which is modelled using a bidirectional transformer\nconditioned on the interchangeable image-text embedding space induced by CLIP.\nMoreover, we present a novel variant of classifier-free guidance, which further\nimproves the accuracy-diversity trade-off. Finally, we perform extensive\nexperiments that demonstrate that TextCraft outperforms state-of-the-art\nbaselines.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Sanghi_A/0/1/0/all/0/1\">Aditya Sanghi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Fu_R/0/1/0/all/0/1\">Rao Fu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_V/0/1/0/all/0/1\">Vivian Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Willis_K/0/1/0/all/0/1\">Karl Willis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shayani_H/0/1/0/all/0/1\">Hooman Shayani</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khasahmadi_A/0/1/0/all/0/1\">Amir Hosein Khasahmadi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sridhar_S/0/1/0/all/0/1\">Srinath Sridhar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ritchie_D/0/1/0/all/0/1\">Daniel Ritchie</a>"
}