{
  "title": "526 - Robert de Vico",
  "description": "<p>To boil it waaay down … After suffering a freak road-rage incident in LA, <a target=\"_blank\" href=\"http://robertdevico.com\">Robert</a> came to Spain to visit an old friend seven years ago, then went back to LA, quit his job, sold his house under the Hollywood sign, and brought his two daughters to live in a village by the “Playa de los Muertos,” where hundreds of dead sailors washed ashore after the <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Battle_of_Trafalgar\">Battle of Trafalgar</a> two hundred and a few years ago. These days, you might see Robert riding his horse down that beach. Or you’ll find him painting, reading, swimming in the Atlantic, or just looking up at the night sky, taking in the majesty of it all. What more is there? It’s been a long road, and it’s led to an amazing place for this man.</p><p>The Ancient Order of the Hermetics can be found <a target=\"_blank\" href=\"https://www.facebook.com/groups/AncientOrderOfTheHermetics/?ref=share\">here</a>.</p><p>Intro music “Brightside of the Sun,” by <a target=\"_blank\" href=\"https://basinandrange.bandcamp.com/track/brightside-of-the-sun\">Basin and Range</a>. Outro: “Smoke Alarm,” by <a target=\"_blank\" href=\"https://www.carsieblanton.com/\">Carsie Blanton</a>.</p><p><p>Tangentially Speaking with Chris Ryan is a reader-supported publication. To get access to bonus content including bonus episodes, newsletters, and exclusive blog posts, please become a paid subscriber.</p></p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/523-robert-de-vico",
  "guid": "substack:post:55613554",
  "dc:creator": "Chris Ryan",
  "pubDate": "Thu, 19 May 2022 15:13:41 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:explicit": "No",
  "itunes:duration": 8411,
  "itunes:image": ""
}