{
  "title": "Getting started with neural networks",
  "link": "",
  "updated": "2015-07-30T00:00:00+00:00",
  "id": "http://yerevann.github.io//2015/07/30/getting-started-with-neural-networks",
  "content": "<h2 id=\"who-we-are\">Who we are</h2>\n\n<p>We are a group of students from the department of <a href=\"http://ysu.am/faculties/en/Informatics-and-Applied-Mathematics\">Informatics and Applied Mathematics</a> at <a href=\"http://ysu.am/main/en\">Yerevan State University</a>. In 2014, inspired by successes of neural nets in various fields, especially by <a href=\"http://karpathy.github.io/2014/09/02/what-i-learned-from-competing-against-a-convnet-on-imagenet/\">GoogLeNet’s</a> excellent performance in ImageNet 2014, we decided to dive into the topic of neural networks. We study calculus, combinatorics, graph theory, algebra and many other topics in the university but we learn nothing about machine learning. Just a few students take some <a href=\"https://www.coursera.org/learn/machine-learning/home/info\">ML courses</a> from Coursera or elsewhere.</p>\n\n<!--more-->\n\n<h2 id=\"choosing-a-video-course\">Choosing a video course</h2>\n<p>At the beginning of 2015 the <a href=\"http://ysu.am/sss/en\">Student Scientific Society</a> of the department initiated a project to study neural networks. We had to choose some video course on the internet, then watch and discuss the videos once per week in the university. We wanted a course that would cover everything from the very basics to convolutional networks and deep learning. We followed <a href=\"http://www.iro.umontreal.ca/~bengioy/yoshua_en/index.html\">Yoshua Bengio’s</a> advice given during his <a href=\"http://www.reddit.com/r/MachineLearning/comments/1ysry1/ama_yoshua_bengio\">interview on Reddit</a> and chose <a href=\"https://www.youtube.com/playlist?list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH\">this excellent class</a> by <a href=\"http://www.dmi.usherb.ca/~larocheh/index_en.html\">Hugo Larochelle</a>.</p>\n\n<p>Hugo’s lectures are really great. First two chapters teach the <a href=\"https://www.youtube.com/watch?v=SGZ6BttHMPw&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=1\">basic structure</a> of neural networks and describe the <a href=\"https://www.youtube.com/watch?v=5adNQvSlF50&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=7\">backpropagation</a> algorithm in details. We loved that he showed the derivation of the gradients of the loss function. Because of this, <a href=\"https://github.com/Harhro94\">Hrayr</a> managed to implement a simple multilayer neural net on his own. Next two chapters (which we skipped) talk about Conditional Random Fields. The fifth chapter introduces unsupervised learning with <a href=\"https://www.youtube.com/watch?v=p4Vh_zMw-HQ&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=36\">Restricted Boltzmann Machines</a>. This was the hardest part for us, mainly because of our lack of knowledge in probabilistic graphical models. The sixth chapter on <a href=\"https://www.youtube.com/watch?v=FzS3tMl4Nsc&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=44\">autoencoders</a> is our favorite: the magic of denoising autoencoders is very surprising. Then there are chapters on <a href=\"https://www.youtube.com/watch?v=vXMpKYRhpmI&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=51\">deep learning</a>, another unsupervised learning technique called <a href=\"https://www.youtube.com/watch?v=7a0_iEruGoM&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=60\">sparse coding</a> (which we also skipped due to time limits) and <a href=\"https://www.youtube.com/watch?v=rxKrCa4bg1I&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=69\">computer vision</a> (with strong emphasis on convolutional networks). The last chapter is about <a href=\"https://www.youtube.com/watch?v=OzZIOiMVUyM&amp;list=PL6Xpj9I5qXYEcOhn7TqghAJ6NAPrNmUBH&amp;index=79\">natural language processing</a>.</p>\n\n<p><img src=\"/public/2015-07-30/denoising-autoencoder-slide.png\" alt=\"Denoising autoencoders\" title=\"A slide on denoising autoencoders from Hugo Larochelle's video course\" /></p>\n\n<p>The lectures contain lots of references to papers and demonstrations, the slides are full of visualizations and graphs, and, last but not least, Hugo kindly answers all questions posed in the comments of Youtube videos. After watching the chapter on convolutional networks we decided to apply what we learned on some computer vision contest. We looked at the list of active competitions on Kaggle and the only one related to computer vision was the <a href=\"https://www.kaggle.com/c/diabetic-retinopathy-detection\">Diabetic retinopathy detection contest</a>. It seemed to be very hard as a first project in neural nets, but we decided to try. We’ll describe our experience with this contest in the next post.</p>"
}