{
  "title": "EPISODE 92: Jujitsuffragettes With Attitude",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 15 Jul 2022 16:01:03 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/7/14/episode-92-jujitsuffragettes-with-attitude",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:62d04a874cec7c4c37aa809e",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/9f6d671c-017a-4247-a932-a963fb9dc13a/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"62d04b05646a7f7c4eafb6d9\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/9f6d671c-017a-4247-a932-a963fb9dc13a/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“…a mad, wicked folly…”</em> — Queen Victoria about the notion of women having the right to vote</p><p class=\"\"><em>“When I watched a policeman fell a girl to the ground and kick her across the platform, my only regret was that I had no weapon with which to strike him an effective blow.” —</em> Eunice G. Murray</p><p class=\"\"><em>“£100 to any man who can defeat him. Notwithstanding the physical disadvantages against heavier men (for Tani weighs 9 stone only), Apollo will pay any living man twenty guineas who Tani fails to defeat in fifteen minutes: Professional champion wrestlers specially invited.” —</em> Music Hall advertisement&nbsp;</p><p class=\"\">“Physical force seems to be the only thing in which women have not demonstrated their equality to men, and whilst we are waiting for the evolution which is slowly taking place and bringing about that equality, we might just as well take time by the forelock and use ju-jitsu.\" — Edith Garrud</p><p class=\"\">These days, pretty much any time I run into a movie or a book or a tv series with a strong woman among the lead characters, almost inevitably I run into comments by people whining about it, basically implying that strong women are a Hollywood invention created purely to satisfy some PC, affirmative action requirement. What we play with today is not that kind of a story. There’s nothing fictional about the rather intense ladies starring in this episode. One of them, in particular, Edith Garrud is Exhibit A when it comes to real life tough women from humanity’s past.&nbsp;</p><p class=\"\">Our story takes place at the very beginning of the 1900s in England, and it weaves together some rather unlikely elements: how the upper classes’ fear of crime associated with urbanization led to the popularization of Asian martial arts, how the very legitimate request for women to have the right to vote unleashed some rather extreme violence… We’ll talk about suffragettes and terrorism, the early days of pro wrestling, Sherlock Holmes, and some Japanese expats (including that Mitsuyo Maeda destined to set in motion a sequence of events leading to the creation of modern MMA and the UFC.) And most of all, we’ll talk about Edith Garrud, one of the very first women to become a martial arts teacher and to star in the granddaddy of martial arts movies.&nbsp;</p><p class=\"\">Please support History on Fire at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a> &nbsp;</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "2:24:26",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 92,
  "itunes:title": "EPISODE 92: Jujitsuffragettes With Attitude",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 92: Jujitsuffragettes With Attitude"
  }
}