{
  "title": "To Serve Man, with Software",
  "description": "<!--kg-card-begin: markdown--><p>I didn't choose to be a programmer. Somehow, it seemed, <a href=\"https://blog.codinghorror.com/if-loving-computers-is-wrong-i-dont-want-to-be-right/\">the computers chose me</a>. For a long time, that was fine, that was enough; that was all I needed. But along the way I never felt that being a programmer was this <a href=\"https://blog.codinghorror.com/please-dont-learn-to-code/\">unambiguously great-for-everyone</a> career field with zero</p>",
  "link": "https://blog.codinghorror.com/to-serve-man-with-software/",
  "guid": "5a481e5fb392750022285b5b",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Sun, 31 Dec 2017 02:01:52 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>I didn't choose to be a programmer. Somehow, it seemed, <a href=\"https://blog.codinghorror.com/if-loving-computers-is-wrong-i-dont-want-to-be-right/\">the computers chose me</a>. For a long time, that was fine, that was enough; that was all I needed. But along the way I never felt that being a programmer was this <a href=\"https://blog.codinghorror.com/please-dont-learn-to-code/\">unambiguously great-for-everyone</a> career field with zero downsides. There are absolutely occupational hazards of being a programmer, and <a href=\"https://blog.codinghorror.com/your-favorite-programming-quote/\">one of my favorite programming quotes</a> is an allusion to one of them:</p>\n<blockquote>\n<p>It should be noted that no ethically-trained software engineer would ever consent to write a <code>DestroyBaghdad</code> procedure. Basic professional ethics would instead require him to write a <code>DestroyCity</code> procedure, to which Baghdad could be given as a parameter.</p>\n</blockquote>\n<p>Which reminds me of <a href=\"https://waxy.org/2015/12/tracking_the_trump_is_a_comment_section_running_for_president_joke/\">another joke that people were telling in 2015</a>:</p>\n<blockquote>\n<p>Donald Trump is basically a comment section running for president</p>\n</blockquote>\n<p>Which is troubling because technically, <em>technically</em>, I run a company that <a href=\"https://discourse.org\">builds comment sections</a>.</p>\n<p>Here at the tail end of 2017, from where I sit neither of these jokes seem particularly funny to me any more. Perhaps I have lost the capacity to feel joy as a human being? <em>Haha just kidding!</em> <em>... kinda.</em></p>\n<p>Remember <a href=\"https://www.wsj.com/articles/SB10001424053111903480904576512250915629460\">in 2011</a> when Marc Andreeseen said that \"Software is eating the world?\"</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/12/software-is-eating-the-world-marc-andreessen.jpg\" alt=\"software is eating the world, Marc Andreessen\" loading=\"lazy\"></p>\n<p>That used to sound all hip and cool and inspirational, like \"Wow! We software developers really <em>are</em> making a difference in the world!\" and now for the life of me I can't read it as anything other than an ominous warning that we just weren't smart enough to translate properly at the time. But <a href=\"https://en.wikipedia.org/wiki/To_Serve_Man_(The_Twilight_Zone)\">maybe now we are</a>.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/To_Serve_Man_(The_Twilight_Zone)\"><img src=\"https://blog.codinghorror.com/content/images/2017/12/to-serve-man.jpg\" alt=\"to-serve-man\" loading=\"lazy\"></a></p>\n<p>I've said many, many times that the key to becoming an experienced software developer is to understand that you are, at all times, <a href=\"https://blog.codinghorror.com/on-the-meaning-of-coding-horror/\">your own worst enemy</a>. I don't mean this in a negative way &#x2013; you have to constantly plan for and design around your inevitable human mistakes and fallibility. It's fundamental to good software engineering because, well, we're all human. The good-slash-bad news is that you're only <a href=\"https://blog.codinghorror.com/the-trap-you-set-for-yourself/\"><em>accidentally</em> out to get yourself</a>. But what happens when we're infinitely connected and software is suddenly <em>everywhere</em>, in everyone's pockets every moment of the day, starting to approximate a natural extension of our bodies? All of a sudden those little collective social software accidents become <a href=\"https://www.wired.com/story/the-other-tech-bubble/\">considerably more dangerous</a>:</p>\n<blockquote>\n<p>The issue is bigger than any single scandal, I told him. As headlines have exposed the troubling inner workings of company after company, startup culture no longer feels like fodder for gentle parodies about ping pong and hoodies. It feels ugly and rotten. Facebook, the greatest startup success story of this era, isn&#x2019;t a merry band of hackers building cutesy tools that allow you to digitally Poke your friends. It&#x2019;s a powerful and potentially sinister collector of personal data, a propaganda partner to government censors, and an enabler of discriminatory advertising.</p>\n</blockquote>\n<p>I'm reminded of a particular Mitchell and Webb skit: <em>\"Are we the baddies?\"</em></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/qv2XGQBcvxQ\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen></iframe>\n<p>On the topic of unanticipated downsides to technology, there is no show more essential than <a href=\"https://www.netflix.com/title/70264888\">Black Mirror</a>. If you haven't watched Black Mirror yet, do not pass go, do not collect $200, go immediately to Netflix and watch it. Go on! Go ahead!</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jDiYGjp5iFg\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen></iframe>\n<blockquote>\n<p>&#x26A0; Fair warning: please DO NOT start with season 1 episode 1 of Black Mirror! Start with season 3, and go forward. If you like those, dip into season 2 and the just-released season 4, then the rest. But humor me and please at least watch the first episode of season 3.</p>\n</blockquote>\n<p>The technology described in Black Mirror can be fanciful at times, but several episodes portray disturbingly plausible scenarios with <em>today's</em> science and tech, much less what we'll have 20 to 50 years from now. These are very real cautionary tales, and some of this stuff is well on its way toward being realized.</p>\n<p>Programmers don't think of themselves as people with the power to change the world. Most programmers I know, including myself, grew up as nerds, geeks, social outcasts. Did I ever tell you about the time I wrote a self-destructing Apple // boot disk program to let a girl in middle school know that I liked her? I was (and still am) a terrible programmer, but oh man did I ever test the heck out of <em>that</em> code before copying on to her school floppy disc. But I digress. What do you do when you wake up one day and software <em>has</em> kind of eaten the world, and <strong>it is no longer clear if software is in fact an unambiguously good thing, like we thought, like everyone told us &#x2026; like we <em>wanted it to be?</em></strong></p>\n<p>Months ago I submitted a brief interview for a <a href=\"https://www.amazon.com/dp/1465462333/?tag=codihorr-20\">children's book about coding</a>.</p>\n<p><a href=\"https://www.amazon.com/dp/1465462333/?tag=codihorr-20\"><img src=\"https://blog.codinghorror.com/content/images/2017/12/9780241285060.jpg\" width=\"400\"></a></p>\n<p>I recently recieved a complimentary copy of the book in the mail. I paged to <a href=\"https://blog.codinghorror.com/content/images/2017/12/dk-findout-coding-page-50.jpg\">my short interview</a>, alongside the very cool <a href=\"http://www.prottsman.com/\">Kiki Prottsman</a>. I had no real recollection of the interview questions after the months of lead time it takes to print a physical book, but reading the printed page, I suddenly hit myself over the head with the very answer I had been searching my soul for these past 6 months:</p>\n<p><a href=\"https://blog.codinghorror.com/content/images/2017/12/dk-findout-coding-page-50.jpg\"><img src=\"https://blog.codinghorror.com/content/images/2017/12/dk-findout-coding-page-50-quote.jpg\" alt=\"Jeff Atwood quote: what do you love most about coding?\" loading=\"lazy\"></a></p>\n<p>In attempting to simplify my answers for an audience of kids, I had concisely articulated the one thing that keeps me coming back to software: <strong>to serve man</strong>. Not on a platter, for bullshit monetization &#x2013; but software that <a href=\"https://blog.codinghorror.com/the-just-in-time-theory/\">helps people</a> be the best version of themselves.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/cNi_HC839Wo?start=118\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen></iframe>\n<p>And you know why I do it? I need that help, too. I get tired, angry, upset, emotional, cranky, irritable, frustrated and I need to be reminded from time to time to choose to be the better version of myself. I don't always succeed. But <em>I want to</em>. And I believe everyone else &#x2013; for some reasonable statistical value of everyone else &#x2013; fundamentally does, too.</p>\n<p>That was the not-so-secret design philosophy behind Stack Overflow, that <strong>by helping others become better programmers, you too would become a better programmer</strong>. It's unavoidable. And, even better, if we leave enough helpful breadcrumbs behind for those that follow us, <em>we collectively advance the whole of programming for everyone</em>.</p>\n<p>I apologize for not blogging much in 2017.  I've certainly been busy with Discourse which is actually going great; we grew to 21 people and <a href=\"https://blog.discourse.org/2017/12/discourse-gives-back-2017/\">gave $55,000 back</a> this year to the open source ecosystem we build on. But that's no excuse. The truth is that it's been hard to write because this has been a deeply troubling year in so many dimensions &#x2014; for men, for tech, for American democracy. I'm ashamed of much that happened, and I think one of the first and most important steps we can take is to <a href=\"https://blog.codinghorror.com/the-hugging-will-continue-until-morale-improves/\">embrace explicit codes of conduct</a> throughout our industry. I also continue to believe, if we start to think more holistically about what our software can do to <strong>serve all people</strong>, not just ourselves personally (or, even worse, the company we work for) &#x2014; that software can and should be part of the solution.</p>\n<p>I tried to amplify on these thoughts in recent podcasts:</p>\n<table>\n    <tr>\n        <td><img src=\"https://blog.codinghorror.com/content/images/2017/12/kim-crayton.jpg\" width=\"100\" height=\"100\"></td>\n        <td>&#xA0;<a href=\"http://www.kimcrayton.com/commengreport-jeff-atwood/\">Community Engineering Report</a> with Kim Crayton</td>\n    </tr>\n    <tr>\n        <td><img src=\"https://blog.codinghorror.com/content/images/2017/12/dave-rael.jpg\" width=\"100\" height=\"100\"></td>\n        <td>&#xA0;<a href=\"http://developeronfire.com/podcast/episode-258-jeff-atwood-sharing-the-house\">Developer on Fire</a> with Dave Rael</td>\n    </tr>\n    <tr>\n        <td><img src=\"https://blog.codinghorror.com/content/images/2017/12/william-channer.jpg\" width=\"100\" height=\"100\"></td>\n        <td>&#xA0;<a href=\"https://drt.fm/jeff-atwood\">Dorm Room Tycoon</a> with William Channer</td>\n    </tr>\n</table>\n<p>Software is easy to change, but people ... aren't. So in the new year, as software developers, let's make a resolution to focus on the part we <em>can</em> change, and keep asking ourselves one very important question: <strong>how can our software help people become the best version of themselves?</strong></p>\n<!--kg-card-end: markdown-->"
}