{
  "title": "238: How to Win the Next Six Months",
  "pubDate": "Tue, 06 Jul 2021 14:29:30 +0000",
  "guid": "499c0592-f76f-4133-831c-85fb89e96bd0",
  "link": "https://sites.libsyn.com/94610/238-how-to-win-the-next-six-month",
  "itunes:image": "",
  "description": "<p>What are the steps to win the next six months?<br /> <br /> These last six months have been challenging for many, but one step in another direction can completely change your destination. No matter what challenges you’ve faced, or if you feel stuck, you can always take one more step.</p> <p>Today, this is a special live podcast where we’re going to talk about the six steps you can take to reset your trajectory and move you forward as you tackle the next six months of your life.</p> <p>If you want to make small changes with a big impact, this episode is for you.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "content:encoded": "<p>What are the steps to win the next six months?  These last six months have been challenging for many, but one step in another direction can completely change your destination. No matter what challenges you’ve faced, or if you feel stuck, you can always take one more step.</p> <p>Today, this is a special live podcast where we’re going to talk about the six steps you can take to reset your trajectory and move you forward as you tackle the next six months of your life.</p> <p>If you want to make small changes with a big impact, this episode is for you.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "enclosure": "",
  "itunes:duration": "16:08",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What are the steps to win the next six months?  These last six months have been challenging for many, but one step in another direction can completely change your destination. No matter what challenges you’ve faced, or if you feel stuck, you can...",
  "itunes:episodeType": "full"
}