{
  "title": "Jordan D. Rosenblum, “The Jewish Dietary Laws in the Ancient World” (Cambridge UP, 2016)",
  "description": "In The Jewish Dietary Laws in the Ancient World Jordan D. Rosenblum explores how cultures critique and defend their religious food practices. In particular he focuses on how ancient Jews defended the kosher laws, or kashrut, and how ancient Greek, Romans, and early Christians critiqued these practices. As the kosher laws are first encountered in the Hebrew Bible, this study is rooted in ancient biblical interpretation. Rosenblum explores how commentators in antiquity understood, applied, altered, innovated upon, and contemporized biblical dietary regulations. He shows that these differing interpretations do not exist in a vacuum; rather, they are informed by a variety of motives, including theological, moral, political, social, and financial considerations. In analyzing these ancient conversations about culture and cuisine, he dissects three rhetorical strategies deployed when justifying various interpretations of ancient Jewish dietary regulations: reason, revelation, and allegory. Finally, Rosenblum reflects upon wider, contemporary debates about food ethics.\n\n\n\nPhillip Sherman is Associate Professor of Religion at Maryville College in Maryville, TN.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/religion",
  "pubDate": "Thu, 09 Mar 2017 21:14:39 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "New Books Network",
  "itunes:subtitle": "In The Jewish Dietary Laws in the Ancient World Jordan D. Rosenblum explores how cultures critique and defend their religious food practices. In particular he focuses on how ancient Jews defended the kosher laws, or kashrut, and how ancient Greek,",
  "itunes:summary": "In The Jewish Dietary Laws in the Ancient World Jordan D. Rosenblum explores how cultures critique and defend their religious food practices. In particular he focuses on how ancient Jews defended the kosher laws, or kashrut, and how ancient Greek, Romans, and early Christians critiqued these practices. As the kosher laws are first encountered in the Hebrew Bible, this study is rooted in ancient biblical interpretation. Rosenblum explores how commentators in antiquity understood, applied, altered, innovated upon, and contemporized biblical dietary regulations. He shows that these differing interpretations do not exist in a vacuum; rather, they are informed by a variety of motives, including theological, moral, political, social, and financial considerations. In analyzing these ancient conversations about culture and cuisine, he dissects three rhetorical strategies deployed when justifying various interpretations of ancient Jewish dietary regulations: reason, revelation, and allegory. Finally, Rosenblum reflects upon wider, contemporary debates about food ethics.\n\n\n\nPhillip Sherman is Associate Professor of Religion at Maryville College in Maryville, TN.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/religion",
  "content:encoded": "<p>In <a href=\"http://www.amazon.com/dp/1107090342/?tag=newbooinhis-20\">The Jewish Dietary Laws in the Ancient World</a> <a href=\"http://jewishstudies.wisc.edu/faculty/jordan-rosenblum-assistant-professor/\">Jordan D. Rosenblum</a> explores how cultures critique and defend their religious food practices. In particular he focuses on how ancient Jews defended the kosher laws, or kashrut, and how ancient Greek, Romans, and early Christians critiqued these practices. As the kosher laws are first encountered in the Hebrew Bible, this study is rooted in ancient biblical interpretation. Rosenblum explores how commentators in antiquity understood, applied, altered, innovated upon, and contemporized biblical dietary regulations. He shows that these differing interpretations do not exist in a vacuum; rather, they are informed by a variety of motives, including theological, moral, political, social, and financial considerations. In analyzing these ancient conversations about culture and cuisine, he dissects three rhetorical strategies deployed when justifying various interpretations of ancient Jewish dietary regulations: reason, revelation, and allegory. Finally, Rosenblum reflects upon wider, contemporary debates about food ethics.</p><p>\n</p><p>\nPhillip Sherman is Associate Professor of Religion at Maryville College in Maryville, TN.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/religion\">https://newbooksnetwork.supportingcast.fm/religion</a></p>",
  "itunes:duration": 2864,
  "itunes:explicit": "no",
  "guid": "http://newbooksnetwork.com/?p=63116",
  "enclosure": ""
}