{
  "title": "Poisoned Just Enough: Why I&#8217;m so Optimistic About 2021",
  "link": "https://www.mrmoneymustache.com/2020/12/17/poisoned-just-enough-why-im-so-optimistic-about-2021/",
  "comments": "https://www.mrmoneymustache.com/2020/12/17/poisoned-just-enough-why-im-so-optimistic-about-2021/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Fri, 18 Dec 2020 01:22:05 +0000",
  "category": "The MMM Blog",
  "guid": "https://www.mrmoneymustache.com/?p=17395",
  "description": "A close friend of mine was diagnosed with cancer this year. It was the serious kind, where you need to treat it quickly and aggressively or it will spread through your body, stick to all of your organs, and kill you. The diagnosis was a shock to my friend and her loved ones &#8211; she’s [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2020/12/17/poisoned-just-enough-why-im-so-optimistic-about-2021/\"><img style=\"max-width:100%;height:auto\" width=\"800\" height=\"535\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/boulder-fire.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/boulder-fire.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/boulder-fire-200x134.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/boulder-fire-300x201.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/boulder-fire-768x514.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/boulder-fire-150x100.jpg 150w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset.jpg\" alt=\"\" class=\"wp-image-17399\" width=\"388\" height=\"291\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset-200x150.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset-300x225.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset-768x576.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset-150x113.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/longmont-winter-sunset-320x240.jpg 320w\" sizes=\"(max-width: 388px) 100vw, 388px\" /></a></figure></div>\n\n\n\n<p>A close friend of mine was diagnosed with cancer this year. It was the serious kind, where you need to treat it quickly and aggressively or it will spread through your body, stick to all of your organs, and kill you.</p>\n\n\n\n<p>The diagnosis was a shock to my friend and her loved ones &#8211; she’s fairly young, had always been healthy in the past, and had no warning it was coming. But she decided against self-pity and just took the diagnosis with complete seriousness.&nbsp;</p>\n\n\n\n<p>In the brief week of calm that she had before the storm of chemotherapy, she warned her children and her colleagues that she would need to make space, because things were going to be much more difficult for a good part of the next year. And then she laid down to accept the intravenous injection of the Red Devil &#8211; a chemotherapy medicine so toxic that the doctor needs to wear a hazardous materials suit to administer it.</p>\n\n\n\n<p>Every two weeks for the next four months, this primitive and painful treatment would be repeated, beating her down further every time. She lost all her hair, strength, energy, even some of her cognition and ability to speak. Or sleep. Or eat. Then there was some painful surgery and a couple dozen sessions of searing radiation.</p>\n\n\n\n<p>And finally, when there was just a faint wisp left of her physical form, some very fortunate news came: the cancer was completely gone.</p>\n\n\n\n<p>Thankfully, the very bright spark of her soul remained. It had been kept alive by her own incredible will to survive, but also by the superhero dedication of her family and closest friends, who stepped up in almost unimaginable ways to support her and pull her through that dark tunnel. So this spark began to rekindle as the body around it was allowed to start rebuilding itself.</p>\n\n\n\n<p>Her recovery gathered speed as the poisoning receded into the past, and many of the long-lost pleasures of the past felt new and better than ever before. She appreciated physical strength, and good food, and most importantly connections with loved ones in a way that she could never have done before having it all taken away.&nbsp;</p>\n\n\n\n<p>And now this woman is back, like a truly badass superhero emerging from the flames and smoke of a wrecked city, ready to make Act Two a thousand times better than her admittedly impressive first act had already been.</p>\n\n\n\n<p>This is a real story, and I’m elated and happy that this loved one is still alive and feeling well again. But it’s also a hell of a metaphor for what has just happened to our world in 2020. As one of her doctors put it, she was “poisoned just enough” to cure the cancer, while the underlying human being survived and now has a chance for an unprecedented rebirth.&nbsp;</p>\n\n\n\n<p>You and I are now presented with this same opportunity, should we choose to accept it.</p>\n\n\n\n<p>Because of COVID-19, billions of people worldwide have just been through a pretty shitty year. The effects have been very unequal and unfair &#8211; the world reported about 1.7 million deaths from the virus this year, increasing the <a href=\"https://ourworldindata.org/causes-of-death#:~:text=In%202017%2C%20there%20were%2056,under%20the%20age%20of%205.\">human race’s death toll</a> by a full three percentage points compared to a normal year. Here in the US, deaths are a full ten percent higher than normal. But <em>hundreds of millions</em> of people are also unemployed, some having lost their business or livelihood forever. And almost every person on the planet has had to give up some of the most fundamental human need of all: contact with each other.&nbsp;</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death.png\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-1024x460.png\" alt=\"\" class=\"wp-image-17402\" width=\"475\" height=\"213\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-1024x460.png 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-200x90.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-300x135.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-768x345.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-150x67.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death-900x404.png 900w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/cdc-covid-excess-death.png 1676w\" sizes=\"(max-width: 475px) 100vw, 475px\" /></a><figcaption>From the US CDC: The ongoing forest fire of COVID-related deaths (blue) versus our deaths from other causes (green). </figcaption></figure></div>\n\n\n\n<p>Friendships, family gatherings, people in love, companies, collaboration, hikes, even kids playing together in nature &#8211; they have all been strained and pulled apart to varying degrees. Some of us were lucky to have a big enough bubble of close family and friends to sustain our mental health, but many were not. And we watched the fabric of society get torn apart as we battled and shamed each other over two sides of an issue that are inherently impossible to resolve: a desire to protect other people, versus a desire to have human contact &#8211; which is at the core of being human itself.&nbsp;</p>\n\n\n\n<p>This shit has gone on for month after month, wave after wave, just like the poisonous flow of chemotherapy, stripping us down relentlessly and fraying nerves and sanity everywhere. But thankfully, it is Just. About. Over.</p>\n\n\n\n<p>And instead of mourning and throwing ourselves a pity party for this past year, I think it’s worth looking at all the positive things we have put in place to help us survive, which will start to look even more positive as the Coronatimes recede rapidly into the rearview mirror. (Note: some of these points were provided by my cancer-beating friend, who happens to be a director at a human resources startup firm.)</p>\n\n\n\n<p><strong>The Future of Work</strong> has suddenly accelerated: working from home has been greatly expanded, with almost universal approval. In the future, we will still be able to hang out with our coworkers in person, but we can do it on our own terms instead of 9-to-5 every day just because the boss says so.&nbsp;</p>\n\n\n\n<p>I believe this is <strong>much bigger than most people realize &#8211; </strong>the drastic reduction in commuting, the ability of people to leave expensive metro areas and repopulate small towns that provide a better quality of life, and the ability of companies to lock in the best talent regardless of geography. On top of greater happiness, these changes all provide huge increases in productivity and efficiency, which are the building blocks of all future human prosperity.</p>\n\n\n\n<p><strong>Education</strong>: Remote learning has shown us that kids can often learn more quickly when we set them free to run at their own pace, and that some (although certainly not all) kids feel safer without the social pressures of school environments . The pandemic has accelerated education-related technology, something that had been lagging in the past just because we were too complacent to make the changes.</p>\n\n\n\n<p><strong>Health Care: </strong>&nbsp;Phone, video and text calls with your doctor, which should have been a thing since about 1995, are now truly a thing. I hope this trend continues, because it’s more pleasant <em>and </em>more efficient. And you know how I feel about efficiency &#8211; it’s the <a href=\"https://www.mrmoneymustache.com/2016/11/24/efficiency-is-the-highest-form-of-beauty/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"highest form of beauty (opens in a new tab)\">highest form of beauty</a>.</p>\n\n\n\n<p>On top of this, the massive infusion of money and effort that went into creating and distributing the COVID-19 vaccine has permanently blazed some useful new trails. For example, the &#8220;messenger RNA&#8221; vaccines from BioNTech/Pfizer and Moderna are just the tip of the iceberg of some incredible new stuff based on the same technology. It could even become the eventual <a rel=\"noreferrer noopener\" aria-label=\"cure for cancer (opens in a new tab)\" href=\"https://www.nature.com/articles/d41586-019-03072-8\" target=\"_blank\"><span style=\"text-decoration: underline;\">cure for cancer</span></a>.</p>\n\n\n\n<p><strong>Slowing Down: </strong>When the pandemic shut down most of our travel and busy appointments, suddenly the streets and parks filled with people, just out there enjoying a stroll with their kids and their friends. Bicycle sales went through the roof, and remain there to this day.&nbsp;</p>\n\n\n\n<p>This is how we <em>should </em>have been spending more of our free time in the first place, because while some travel is valuable and important, to be honest a lot of it was just bullshit. People were packing too much into their lives. Travel and appointments should be like a <em>hot sauce </em>you shake upon your life to add a luxurious layer of spice, rather than the basis of what you do every single day. The reward is greater health, happiness, and wealth and more connected communities.&nbsp;</p>\n\n\n\n<p><strong>A More Resilient Economy:&nbsp;</strong></p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-1024x443.png\" alt=\"\" class=\"wp-image-17403\" width=\"467\" height=\"201\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-1024x443.png 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-200x87.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-300x130.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-768x332.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-150x65.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020-900x389.png 900w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/stocks-2020.png 1253w\" sizes=\"(max-width: 467px) 100vw, 467px\" /><figcaption>The 2020 roller coaster for US large-company stocks</figcaption></figure></div>\n\n\n\n<p>In just one month leading up to March 23rd, more than a third of the value of all US businesses was erased in a Ten Trillion dollar ($10,000,000,000,000) nuclear explosion of fear. Even Warren Buffett, famous for the world’s steadiest investing hand and for the expression “Be greedy when others are fearful and fearful when others are greedy”, became fearful and dumped all of his airline stocks at the worst time.&nbsp;</p>\n\n\n\n<p>Five months later, that same stock market was back at an all-time record, the future of the largest companies was looking rosier than ever, and even the regular economy was experiencing a faster rebound than almost anybody had expected.</p>\n\n\n\n<p>How did this happen? With the simple combination of human resilience, and <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"the safety margin (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/2011/10/17/its-all-about-the-safety-margin/\" target=\"_blank\">the safety margin</a></span> that is inherent in any well-run life or business. People couldn’t go to movie theaters, so they spent more on Netflix. Lumber prices spiked, but steel prices dropped so we changed some of our house construction to reflect it. Restaurants were forced to close their dining rooms, but we supported them by ordering more take-out.&nbsp;</p>\n\n\n\n<p><em>(</em><strong><em>Note:</em></strong><em> some parts of the economy, especially in other countries, are still in the middle of an economic and humanitarian nightmare &#8211; there is still much more we can do to help out and we&#8217;ll get into some of that below.)</em></p>\n\n\n\n<p>And the toilet paper hoarding? That was just plain herd-mentality stupidity and it should never have happened. But even that eventually came back to the shelves.</p>\n\n\n\n<p>So I’ve now watched us come though the Corona Crash, on top of the 2008 Great Financial Crisis and the 2000 Dot-com bubble and bust, all in my investing lifetime.&nbsp; And we just keep going, and we get a bit better at everything with each passing year. Despite all of the disasters, the pockets of corruption, and the dim-witted and power-hungry politicians that we are all too aware of. This has galvanized my confidence that in the big picture, <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"we are not really all doomed (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/2014/03/03/why-we-are-not-really-all-doomed/\" target=\"_blank\">we are not really all doomed</a></span>.&nbsp;</p>\n\n\n\n<p>The world is a good place, humans are fundamentally good creatures, and the more we can nurture this goodness (and avoid fanning the flames of fear, which is the only thing that causes us to be bad), the faster we will continue our rise to an ever-better state of existence.</p>\n\n\n\n<p><strong>IMPORTANT: Speaking of Making Things Better!</strong></p>\n\n\n\n<p>2020 was a year of increased inequality, which pushed many people further into poverty, while making many rich people even richer. Because of my investments and my ownership of this website, I was (yet again) in that lucky second group. And I suspect <em>you </em>were probably on this side of fortune as well.</p>\n\n\n\n<p>Because of these high earnings, and the fact that the total bill for my lifestyle keeps coming in at only around <a rel=\"noreferrer noopener\" aria-label=\"$20,000 per year (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/2020/01/27/mmm-2019-spending/\" target=\"_blank\"><strong><span style=\"text-decoration: underline;\">$20,000 per year</span></strong></a>, this means that I now have the chance to give away yet another $100,000. This brings the total of this blog’s donations to <strong>over $400,000</strong> in the last five years, which is starting to sound like some real money!</p>\n\n\n\n<p><strong>Where the money went:</strong></p>\n\n\n\n<p><strong>$95,000 to </strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"GiveWell (opens in a new tab)\" href=\"https://www.givewell.org/\" target=\"_blank\"><strong>GiveWell</strong></a></span> via my <a rel=\"noreferrer noopener\" aria-label=\"Betterment (opens in a new tab)\" href=\"https://www.betterment.com/\" target=\"_blank\"><strong><span style=\"text-decoration: underline;\">Betterment</span></strong></a> investment account.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/giving-from-bettermemt.png\" alt=\"\" class=\"wp-image-17401\" width=\"326\" height=\"398\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/giving-from-bettermemt.png 628w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/giving-from-bettermemt-147x180.png 147w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/giving-from-bettermemt-246x300.png 246w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/giving-from-bettermemt-123x150.png 123w\" sizes=\"(max-width: 326px) 100vw, 326px\" /><figcaption>Betterment&#8217;s super-convenient charitable giving interface.</figcaption></figure></div>\n\n\n\n<p>This is by far the most effective way I’m aware of, to make each dollar do the most good for people. The nonprofit organization GiveWell does tireless ongoing research on world charities, and keeps an updated list of which can do the most work with your money, right now. </p>\n\n\n\n<p>On top of this, donating appreciated shares from my Betterment account gives me the maximum tax benefit &#8211; on my 2020 taxes and all subsequent years. This further multiplies my money’s ability to do good. (And it’s a <em>very </em>easy way to give &#8211; overcoming one of the biggest hurdles to getting it done)</p>\n\n\n\n<p><strong>$2500 to <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"Bicycle Colorado (opens in a new tab)\" href=\"https://www.bicyclecolorado.org/\" target=\"_blank\">Bicycle Colorado</a></span></strong> &#8211; it’s not solving world health, but increasing bike friendliness here in the US is deceptively powerful, because we have so much low-hanging fruit. There is still far too much <a rel=\"noreferrer noopener\" aria-label=\"car clown (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/2013/04/22/curing-your-clown-like-car-habit/\" target=\"_blank\"><span style=\"text-decoration: underline;\">car clown</span></a> behavior and far too little cycling, but that is changing rapidly in Colorado and other states because of organizations like this one. Our numbers have been growing by enormous percentages every year, and now the city planners and governors have learned to consider bike (and foot) transportation when they allocate their massive transportation budgets each year.</p>\n\n\n\n<p><strong>&nbsp;$1500 to the <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"Against Malaria foundation (opens in a new tab)\" href=\"https://www.againstmalaria.com/default.aspx\" target=\"_blank\">Against Malaria foundation</a></span></strong>. Although similar to the GiveWell donation above, I gave this amount to support an effort put together by readers of the MMM forum, who have collectively given over $20,000.</p>\n\n\n\n<p><strong>$1000</strong> (doubled to $2000 because of an external donor) to plant TWO THOUSAND MORE TREES! to the <strong><span style=\"text-decoration: underline;\"><a href=\"https://www.nationalforests.org/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"National Forest Foundation (opens in a new tab)\">National Forest Foundation</a></span></strong>.</p>\n\n\n\n<p><strong>Total: $100,000</strong></p>\n\n\n\n<p><strong>Bonus: </strong>In last year&#8217;s philanthropy summary, I planned to invest $5000 in building and expanding a local solar farm. I didn’t fully reach that goal, but I did manage to add almost 3 kilowatts of extra capacity to the MMM-HQ solar array (my co-owners and I split this expense and my friends at <span style=\"text-decoration: underline;\"><strong><a href=\"https://www.shawsolar.com/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Shaw Solar (opens in a new tab)\">Shaw Solar</a></strong></span> gave us a great deal on the equipment).  </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-1024x768.jpg\" alt=\"\" class=\"wp-image-17400\" width=\"419\" height=\"314\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-1024x768.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-200x150.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-300x225.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-768x576.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-150x112.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-900x675.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2020/12/solar-additions-320x240.jpg 320w\" sizes=\"(max-width: 419px) 100vw, 419px\" /></a><figcaption>Coworking members help me install another eight panels of solar panel onto more of the roof of the HQ building.</figcaption></figure></div>\n\n\n\n<p>We also upgraded other aspects of the building’s energy efficiency, and we are soon about to “cut the pipe” &#8211; by switching the old gas furnace over to a high efficiency <a rel=\"noreferrer noopener\" aria-label=\"heat pump system (opens in a new tab)\" href=\"https://iwae.com/shop/4-to-5-ton-18-seer-variable-speed-mrcool-universal-central-heat-pump-split-system-upflow-horizontal-ha20920.html?gclid=CjwKCAiAoOz-BRBdEiwAyuvA6_1mAf-y7FgHQHRVNSxET14w-YgYul7-HUMfcwyc6u2y1s4SJvQPNhoCfr4QAvD_BwE\" target=\"_blank\"><span style=\"text-decoration: underline;\">heat pump system</span></a> ($3200), and canceling our entire account with the gas company. This allows us to be a 100% clean-energy facility, as well as ending the surprisingly high monthly fee that Xcel Energy charges us as commercial customers, whether we burn any gas or not.</p>\n\n\n\n<p><strong>Where the money came from:&nbsp;</strong></p>\n\n\n\n<p>Initially, the sudden recession slammed the brakes on almost all of my income. Many of the companies that allow this website to earn money had paused or canceled their referral programs, most notably things like travel and rewards credit cards, which were sometimes the biggest source of cash. </p>\n\n\n\n<p>On top of that, many of our cherished members of the <a rel=\"noreferrer noopener\" aria-label=\"HQ Coworking (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/hq/\" target=\"_blank\"><strong>H<span style=\"text-decoration: underline;\">Q Coworking</span></strong></a> space paused or canceled their memberships as they either lost their jobs or decided to work entirely from home for childraising or virus-related reasons.</p>\n\n\n\n<p>But then an unexpected boom rose in its place: the aftermath of absurdly low interest rates. I encouraged readers to take advantage of them and refinance their mortgages and student loans, and thousands of people did. This led to a different but equally sized windfall, which has brought in enough profit to keep my donations going. </p>\n\n\n\n<p>(Note: although my personal spending doesn’t increase, I did also invest the rest of my earnings this year into other businesses, and gave or loaned some to personal, local projects. )</p>\n\n\n\n<p><strong>You Should Do it Too!</strong></p>\n\n\n\n<p>If you have more than enough money, you should give some away. </p>\n\n\n\n<p>Try it. It feels good and this good feeling lasts forever, making your entire life feel more worthwhile. If you are willing, please share some of your donations in the comments (you can do so under a pseudonym if you like).</p>\n\n\n\n<p>I will also list this blog&#8217;s own main sources of income for 2020 &#8211; if even a small portion of readers find these companies useful as I do, it will generate tens or hundreds of thousands of dollars, which I will get to keep using to try to do some more good!</p>\n\n\n\n<p><strong>Credible:</strong> super efficient (good user interface) and low-cost originating and refinancing of <br><strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"Mortgages (opens in a new tab)\" href=\"https://www.credible.com/a/mrmoneymustachemortgage/?utm_source=mrmoneymustache&utm_medium=referral&utm_campaign=mortgage_hp\" target=\"_blank\">Mortgages</a></span></strong>  <-Well under 3% these days, under 2.5% for 15-year<br>and<br><strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"Student Loans (opens in a new tab)\" href=\"https://www.credible.com/a/mrmoneymustachestudentrefi/?utm_source=mrmoneymustache&utm_medium=referral&utm_campaign=slr_lp\" target=\"_blank\">Student Loans</a></span></strong> <-<strong>temporary $1000 bonus(?!)</strong> currently in place with this link!<br>(See their mortgage disclosure <a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/credible-mortgage-disclosure/\" target=\"_blank\">here</a>) <em>(NMLS No. 1681276)</em></p>\n\n\n\n<p><strong><a rel=\"noreferrer noopener\" aria-label=\"Travel and cash-back rewards cards (opens in a new tab)\" href=\"https://www.cardratings.com/advisors/mrmoneymustache?SRC=636824\" target=\"_blank\"><span style=\"text-decoration: underline;\">Travel and cash-back rewards cards</span></a></strong>: aside from the usual benefits, one good hack I have discovered is to put some of my charitable giving on a new high-roller card, to instantly reach the minimum spend requirement. The charity gets a large gift, and I get the big signing bonus and things like airport lounge access, free hotel stays, etc.</p>\n\n\n\n<p><strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"The Coverage Critic mobile phone comparison page (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/coveragecritic/\" target=\"_blank\">The Coverage Critic mobile phone comparison page</a></span></strong>: This has been unexpectedly successful, with thousands of people upgrading to cheaper phone plans thanks to my friend and HQ coworker Chris Smith&#8217;s expert nerdy-detailed-level advice.</p>\n\n\n\n<p><strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"Bluehost web hosting: (opens in a new tab)\" href=\"https://www.bluehost.com/track/mrmoneymustache\" target=\"_blank\">Bluehost web hosting:</a></span></strong> the place I got my own start blogging, this company offers super-cheap <strong>$3 per month</strong> web hosting with easy point-and-click site design and setup, year after year, while maintaining a generous referral program that keeps many websites in business. (They also sponsored one of our pop-up business schools!)</p>\n\n\n\n<p><strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" aria-label=\"Sedera health share organization (opens in a new tab)\" href=\"https://www.mrmoneymustache.com/sedera/\" target=\"_blank\">Sedera health share organization</a></span></strong>: my friends serve as advisors to members who they refer to Sedera though their group The Fire Guild. They have agreed to share proceeds with me, and I&#8217;m donating 100% of this year&#8217;s share to <strong><span style=\"text-decoration: underline;\"><a href=\"https://ripmedicaldebt.org/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"RIP Medical Debt (opens in a new tab)\">RIP Medical Debt</a>.</span></strong> Every $100 you donate here, forgives about $10,000 of medical debt, so I hope we will be able to get to $1 million of wiped-out-debt within a year.<br></p>\n\n\n\n<p>That&#8217;s it for ol&#8217; MMM for 2020 &#8211; I will see you in the bright and sparkly future of 2021!</p>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2020/12/17/poisoned-just-enough-why-im-so-optimistic-about-2021/feed/",
  "slash:comments": 166,
  "post-id": 17395
}