{
  "title": "Episode 111: Evolutionary Psychology - David Buss Responds to Critics",
  "pubDate": "Sun, 06 Dec 2009 23:36:42 +0000",
  "guid": "episode-111-evolutionary-psychology-david-buss",
  "link": "http://www.thepsychfiles.com/2009/12/episode-111-evolutionary-psychology-david-buss-responds-to-critics/",
  "itunes:image": "",
  "description": "There has been a lot of criticism of evolutionary psychology. How do researchers respond?  One of the leading researchers in this field - Dr. David Buss of the University of Texas responds to these critics in part 1 of this 2 part episode.  Find out how he responds to these questions: a) is evolutionary psychology sexist?, b) doesn't evolutionary psychology just give people the ammunition they need to not take responsibility for themselves? c) theories from evolutionary psychology are not falsifiable, this it's not scientific and d) human society is always changing - it hasn't been stable enough long enough for any human behavior to have evolved.",
  "content:encoded": "There has been a lot of criticism of evolutionary psychology. How do researchers respond?  One of the leading researchers in this field - Dr. David Buss of the University of Texas responds to these critics in part 1 of this 2 part episode.  Find out how he responds to these questions: a) is evolutionary psychology sexist?, b) doesn't evolutionary psychology just give people the ammunition they need to not take responsibility for themselves? c) theories from evolutionary psychology are not falsifiable, this it's not scientific and d) human society is always changing - it hasn't been stable enough long enough for any human behavior to have evolved.",
  "enclosure": "",
  "itunes:duration": "28:39",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,David,Evolution,psychology,lecture,evolutionary,buss",
  "itunes:subtitle": "There has been a lot of criticism of evolutionary psychology - how to critics respond?  One of the leading researchers in this field - Dr. David Buss of the University of Texas responds to these critics in part 1 of this 2 part episode.  ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "There has been a lot of criticism of evolutionary psychology. How do researchers respond? One of the leading researchers in this field - Dr. David Buss of the University of Texas responds to these critics in part 1 of this 2 part episode. Find out how he responds to these questions: a) is evolutionary psychology sexist?, b) doesn't evolutionary psychology just give people the ammunition they need to not take responsibility for themselves? c) theories from evolutionary psychology are not falsifiable, this it's not scientific and d) human society is always changing - it hasn't been stable enough long enough for any human behavior to have evolved."
}