{
  "title": "Episode 64: A Scientist Goes Looking for a Self Help Book....",
  "pubDate": "Mon, 21 Jul 2008 10:31:28 +0000",
  "guid": "episode-64-a-scientist-goes-looking-for-a-self-he",
  "link": "http://www.thepsychfiles.com/2008/07/21/episode-64-a-scientist-goes-looking-for-a-self-help-book/",
  "itunes:image": "",
  "description": "Self Help books: there are so many such books out there.  How do you choose?  Can they cure depression?  Help you lose weight?  Stop smoking?  Can they replace psychotherapy?  Find out how critical thinking can help you weed out the best self-help book.  Here's a list of the top 14 things that really bother psychologists or any scientists about self-help books.  Agree?  Disagree?  Want to add something to the list?",
  "content:encoded": "Self Help books: there are so many such books out there.  How do you choose?  Can they cure depression?  Help you lose weight?  Stop smoking?  Can they replace psychotherapy?  Find out how critical thinking can help you weed out the best self-help book.  Here's a list of the top 14 things that really bother psychologists or any scientists about self-help books.  Agree?  Disagree?  Want to add something to the list?",
  "enclosure": "",
  "itunes:duration": "31:05",
  "itunes:explicit": false,
  "itunes:keywords": "help,self,selfhelp,depression,Esteem",
  "itunes:subtitle": "Self Help books: there are so many such books out there. Can they cure depression? Find out how critical thinking can help you weed out the best self-help book. Here's a list of the top 14 things that really bother psychologists about self-help books.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Self Help books: there are so many such books out there. How do you choose? Can they cure depression? Help you lose weight? Stop smoking? Can they replace psychotherapy? Find out how critical thinking can help you weed out the best self-help book. Here's a list of the top 14 things that really bother psychologists or any scientists about self-help books. Agree? Disagree? Want to add something to the list?"
}