{
  "title": "Pentagon predicts what could end Kim’s rule in North Korea",
  "link": "https://www.rt.com/news/565965-north-korea-end-regime/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565965-north-korea-end-regime/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63654ce685f54026b81a4d08.jpg\" /> US Defense Secretary Lloyd Austin warned on Thursday that any nuclear action by North Korea “will lead to the end of the Kim regime” <br/><a href=\"https://www.rt.com/news/565965-north-korea-end-regime/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The US warned that the use of nuclear weapons would spell the end of Kim's government</strong></p>\n            \n                        \n            <p>US Defense Secretary Lloyd Austin declared on Thursday that any nuclear attack against the US or its allies by North Korea <em>&ldquo;is unacceptable, and will lead to the end of the Kim regime.&rdquo;</em> With the US and South Korea holding military exercises, Pyongyang has launched hundreds of projectiles, including an intercontinental ballistic missile.</p>\n<p>Austin delivered his warning in a joint communique with South Korean Defense Minister Lee Jong-sup, explaining that the US would defend South Korea <em>&ldquo;utilizing the full range of [its] defense capabilities, including nuclear, conventional, and missile defense capabilities and advanced non-nuclear capabilities.&rdquo;</em></p>\n<p>In the document, released after a meeting with Lee, Austin <em>&ldquo;noted that any nuclear attack against the United States or its Allies and partners, including the use of non-strategic nuclear weapons, is unacceptable and will result in the end of the Kim regime.&rdquo;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363cc1f85f5404eeb7b622c.jpg\" alt=\"KF-16 fighter jets are seen on the runway during the &#039;Vigilant Storm&#039; US-South Korea joint drill at Gunsan Air Base on October 31, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565874-north-korea-us-drills/\">North Korea hits out at ‘awful’ mistake by US</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Meanwhile, the US National Defense Strategy, published last week, states that Washington&rsquo;s strategy for North Korea recognizes <em>&ldquo;there is no scenario in which the Kim regime could employ nuclear weapons and survive.&rdquo;</em></p>\n<p>The US and South Korean&nbsp;armed forces have been taking part in joint military exercises since Sunday, involving hundreds of aircraft and thousands of combat troops from both nations. North Korea views drills such as these as provocations, and preparations for invasion.</p>\n<p>North Korea, which has stepped up its missile testing in recent months, responded to the exercises by firing around 100 artillery shells and six ballistic missiles into the sea between the Korean Peninsula and Japan on Wednesday. The Democratic People&rsquo;s Republic of Korea also tested an intercontinental ballistic missile on Thursday morning, its first such test since 2017.</p>\n<p>The US requested a meeting of the UN Security Council in response, and extended its ongoing military exercises beyond their scheduled end on Friday. Pyongyang called this an <em>&ldquo;awful mistake&rdquo;</em> and an <em>&ldquo;irresponsible decision.&rdquo;</em></p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 18:38:50 +0000",
  "dc:creator": "RT"
}