{
  "guid": "urn:uuid:7f2d56e5-174d-4a57-a38e-c2132972efde",
  "link": "https://www.who.int/news/item/16-10-2022-henrietta-lacks--family-appointed-world-health-organization-goodwill-ambassadors-for-cervical-cancer-elimination",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Henrietta Lacks’ family appointed World Health Organization Goodwill Ambassadors for Cervical Cancer Elimination",
  "description": "<p>WHO&rsquo;s Director-General Dr Tedros Adhanom Ghebreyesus today appointed the Lacks family as WHO Goodwill Ambassadors for Cervical Cancer Elimination. The appointment recognizes their efforts to champion cervical cancer prevention and to preserve the memory of Henrietta Lacks, who died from cervical cancer in 1951.</p><p>Henrietta Lacks&rsquo; story is one of injustice, with the vast contribution she made to science hidden from the world for many years. While she sought treatment for her cancer, researchers took biopsies from her body without her knowledge or consent. The cells they took, known as HeLa cells, subsequently became the first &ldquo;immortal&rdquo; cell line - meaning they are the only cells which have continued to live outside the human body and replicate. </p><p>Since the procedure was undertaken, these HeLa cells have contributed to countless medical breakthroughs, including the development of the human papillomavirus (HPV) vaccine, as well as COVID-19 research.</p><p>&ldquo;Much like the injustice of Henrietta Lacks&rsquo; story, women all over the world from racial and minority ethnic groups face disproportionately higher risks from cervical cancer,&rdquo; said Dr Tedros. &ldquo;WHO&rsquo;s goal is to eliminate cervical cancer, which means the innovations created with Henrietta Lacks&rsquo; cells must be made available equitably to all women and girls. We look forward to working with the Lacks family to raise awareness on cervical cancer and advance racial equity in health and science.&rdquo;</p><p>The family, represented by Henrietta Lacks' son Lawrence Lacks, Sr., and his granddaughters, Victoria Baptiste and Veronica Robinson; and Alfred Lacks Carter, Jr., Henrietta Lacks&rsquo; grandson, accepted the appointment at the World Health Summit in Berlin, during a session titled, &ldquo;A Next Era for Women's Cancer Control.&rdquo; </p><p>On behalf of the Lacks family, Alfred Lacks Carter, Jr. said, \"Today, I humbly accept this honour to serve as a WHO Goodwill Ambassador for Cervical Cancer Elimination in the spirit of my mother - Deborah Lacks, who lost her mother, Henrietta, to Cervical Cancer, and worked to make certain the world recognizes her impact. Our Hennie's legacy lives on in us, and we will continue to stand in solidarity with WHO, patients, survivors, and families around the world to ensure that no other wife, mother, or sister dies needlessly from cervical cancer.\"</p><p>The appointment of the Lacks family as WHO Goodwill Ambassadors for Cervical Cancer Elimination adds momentum to the <a href=\"https://www.who.int/initiatives/cervical-cancer-elimination-initiative#:~:text=Achieving%20elimination&amp;text=Vaccination%3A%2090%25%20of%20girls%20fully,women%20with%20invasive%20cancer%20managed.\">global strategy to eliminate cervical cancer</a>, launched by WHO in 2020. The global effort represents the first time ever that WHO Member States have collectively committed to eliminate a cancer.</p><p>The strategy lists three goals that countries should reach by the year 2030: First, 90% of eligible girls should be fully vaccinated with the HPV vaccine. Second, 70% of women should be screened using a high-performance test. And third, 90% of women with pre-cancer should have access to treatment and 90% of women with invasive cancer should be managed appropriately, including access to palliative care.</p><p>Currently, a woman dies of cervical cancer every two minutes. Nearly 90% of these deaths occur in low- and middle-income countries due to inadequate access to cancer prevention, diagnosis and care. In all geographies, women in marginalized communities are disproportionately affected.</p><p>The Lacks family joins other ambassadors from WHO, including Ivorian footballer Didier Drogba, Brazilian world champion footballer Alisson Becker, Michael Bloomberg, founder of Bloomberg Philanthropies and three-term Mayor of the City of New York, Cynthia Germanotta, President of the Born This Way Foundation, and former UK Prime Minister Gordon Brown. </p><p>The Ambassadorship follows the bestowment of a special posthumous award to Henrietta Lacks from the   <a href=\"https://www.who.int/news/item/13-10-2021-who-director-general-bestows-posthumous-award-on-the-late-henrietta-lacks\">WHO Director-General,</a> given to her family on her behalf in 2021. It reflects WHO&rsquo;s ongoing commitment to the active participation of people affected by cervical cancer as central to the elimination effort.<br /></p><p><strong>About Henrietta Lacks</strong><br /></p><p>As a young mother, Henrietta Lacks and her husband were raising five children near Baltimore when she fell ill.&nbsp; She went to Johns Hopkins after experiencing extensive vaginal bleeding and was diagnosed with cervical cancer.&nbsp; Despite treatment, it cut her life short on 4 October 1951. She was only 31 years old.</p><p>During treatment, researchers took samples of her tumour. That &ldquo;HeLa&rdquo; cell line became a scientific breakthrough: the first immortal line of human cells to divide indefinitely in a laboratory.&nbsp; The cells were mass produced, for profit, without recognition to her family. Over 50 million metric tonnes of HeLa cells have been distributed around the world.</p><p>In addition to the HPV vaccine, HeLa cells allowed for development of the polio vaccine; drugs for HIV, haemophilia, leukaemia, and Parkinson&rsquo;s disease; breakthroughs in reproductive health, including in vitro fertilization; research on chromosomal conditions, cancer, gene mapping, and precision medicine; and are used in studies responding to the COVID-19 pandemic.</p><p>Lawrence Lacks, Mrs. Lacks&rsquo; 87-year-old son, is one of the last living relatives who personally knew her. Mr. Lacks shares this honor with his granddaughters Victoria Baptiste and Veronica Robinson, and his nephew Alfred Lacks Carter, Jr.<br /></p><p><strong>Quotes from the Lacks family</strong><br /></p><p><strong>Lawrence Lacks, Sr.</strong></p><p>Son of Henrietta Lacks</p><p>&ldquo;Thank you to the World Health Organization for the honour of appointing us as WHO Goodwill Ambassadors for Cervical Cancer Elimination. I am humbled to join my granddaughters Victoria and Veronica and my nephew Alfred in accepting this commitment in honour of my mother, Henrietta Lacks. I want to thank Dr Tedros, Dr Nono, and WHO for recognizing all the good my mother has done for the world.\"<br /></p><p><strong>Victoria Baptiste, BSN, RN</strong></p><p>Lacks Family Descendant</p><p>&ldquo;As a Registered Nurse, I am deeply moved to accept this honour today to serve as a World Health Organization Goodwill Ambassador for Cervical Cancer Elimination. We know Cervical Cancer can be prevented and treated if caught early - that's why I remain committed to this mission in honour of Henrietta Lacks, who has helped make these breakthroughs possible. Together, we can end cervical cancer by educating, empowering, and mobilizing patient advocates, health-care providers, clinicians, researchers, community leaders, and policy-makers to increase prevention, screening, and treatment worldwide.\"<br /></p><p><strong>Veronica Robinson</strong></p><p>Lacks Family Descendant</p><p>\"As a patient advocate, I am dedicated to working with WHO to advance the Global Strategy to Eliminate Cervical Cancer and am grateful for the opportunity to serve as a Goodwill Ambassador. From our home in Baltimore, Maryland, to communities around the world, we are resolute in taking action to end Cervical Cancer disparities. Henrietta's HeLa cells contributed to life-saving innovations like the HPV vaccine and cervical cancer treatment. As advocates, we call upon global leaders, policy-makers, and civil society organisations to honour her legacy by providing equal access to cervical cancer education, screening, vaccination, and treatment for all people.\"</p>",
  "pubDate": "Fri, 14 Oct 2022 08:34:47 Z"
}