{
  "title": "Communication Efficient Generalized Tensor Factorization for Decentralized Healthcare Networks. (arXiv:2109.01718v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2109.01718",
  "description": "<p>Tensor factorization has been proved as an efficient unsupervised learning\napproach for health data analysis, especially for computational phenotyping,\nwhere the high-dimensional Electronic Health Records (EHRs) with patients'\nhistory of medical procedures, medications, diagnosis, lab tests, etc., are\nconverted to meaningful and interpretable medical concepts. Federated tensor\nfactorization distributes the tensor computation to multiple workers under the\ncoordination of a central server, which enables jointly learning the phenotypes\nacross multiple hospitals while preserving the privacy of the patient\ninformation. However, existing federated tensor factorization algorithms\nencounter the single-point-failure issue with the involvement of the central\nserver, which is not only easily exposed to external attacks but also limits\nthe number of clients sharing information with the server under restricted\nuplink bandwidth. In this paper, we propose CiderTF, a communication-efficient\ndecentralized generalized tensor factorization, which reduces the uplink\ncommunication cost by leveraging a four-level communication reduction strategy\ndesigned for a generalized tensor factorization, which has the flexibility of\nmodeling different tensor distribution with multiple kinds of loss functions.\nExperiments on two real-world EHR datasets demonstrate that CiderTF achieves\ncomparable convergence with a communication reduction up to 99.99%.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Ma_J/0/1/0/all/0/1\">Jing Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_Q/0/1/0/all/0/1\">Qiuchen Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lou_J/0/1/0/all/0/1\">Jian Lou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xiong_L/0/1/0/all/0/1\">Li Xiong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bhavani_S/0/1/0/all/0/1\">Sivasubramanium Bhavani</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ho_J/0/1/0/all/0/1\">Joyce C. Ho</a>"
}