{
  "title": "Eat This Drone",
  "link": "https://spectrum.ieee.org/edible-robots",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-drone-airplane-sits-on-a-lab-bench-it-has-a-normal-propeller-and-motor-and-tail-but-its-wings-are-made-of-rice-crackers-cover.jpg?id=32019267&width=1200&height=400&coordinates=0%2C864%2C0%2C864\"/><br/><br/><p>Drones have the potential to be very useful in disaster scenarios by transporting food and water to people in need. But whenever you ask a drone to transport anything, anywhere, the bulk of what gets moved is the drone itself. Most delivery drones can carry only about 30 percent of their mass as payload, because most of their mass is both critical, like wings, and comes in the form of things that are essentially useless to the end user, like wings.</p><p>At the IEEE/RSJ International Conference on Intelligent Robots and Systems (<a href=\"https://iros2022.org/\" target=\"_blank\">IROS</a>) conference in Kyoto last week, researchers from the <a href=\"https://www.epfl.ch/labs/lis/\" target=\"_blank\">Swiss Federal Institute of Technology Lausanne (EPFL)</a> presented a paper describing a drone that can boost its payload of food from 30 percent to 50 percent of its mass. It does so with the ingenious use of wings made from rice cakes that contain the caloric equivalent of an average, if unbalanced, breakfast. For anyone interested in digesting the paper, it is titled “Towards Edible Drones for Rescue Missions: Design and Flight of Nutritional Wings,” by Bokeon Kwak, Jun Shintake, Lu Zhang, and Dario Floreano from EPFL.</p><hr/><p>The reason why this drone exists is to work toward the effective and efficient delivery of food to someone who, for whatever reason, really, really needs food and is not in a position to gain access to it in any other way. The idea is that you could fly this drone directly to them and keep them going for an extra day or two. You obviously won’t get the drone back afterward (because its wings will have been eaten off), but that’s a small price to pay for potentially keeping someone alive via the delivery of vital calories.<br/></p><p>The researchers designed the wing of this partially edible drone out of compressed puffed rice (rice cakes or rice cookies, depending on whom you ask) because of the foodstuff’s similarity to expanded polypropylene (EPP) foam. EPP foam is something that’s commonly used as wing material in drones because it’s strong and lightweight; puffed rice shares those qualities. Though it’s not quite as strong as the EPP, it’s not bad. And it’s also affordable, accessible, and easy to laser cut. The puffed rice also has a respectable calorie density—at 3,870 kilocalorie per kilogram, rice cakes aren’t as good as something like chocolate, but they’re about on par with pasta, just with a much lower density.</p><p>Out of the box, the rice cakes are round, so the first step in fabricating the wing is to laser cut them into hexagons to make them easier to stick together. The glue is just gelatin, and after it all dries, the wing is packaged in plastic and tape to make sure that it doesn’t break down in wet or humid environments. It’s a process that’s fast, simple, and cheap.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"\" class=\"rm-shortcode\" data-rm-shortcode-id=\"34ff74f7de5643c072335f12a54277bf\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4db39\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.gif?id=32019265&width=980\"/>\n</p><p>The size of the wing is actually driven not by flight requirements but by nutrition requirements. In this case, a wingspan of about 70 centimeters results in enough rice cake and gelatin glue to deliver 300 kcal, or the equivalent of one breakfast serving, with 80 grams remaining for a payload of vitamins or water or something like that. The formula the researchers came up with to calculate the design of this avian appetite quencher assumes that the rest of the drone is not edible, because it isn’t. The structure and tail surfaces are made of carbon fiber and foam.</p><p>While this is just a prototype, the half-edible drone does actually fly, achieving speeds of about 10 meters per second with the addition of a motor, some servos to actuate the tail surfaces for control, and a small battery. The next step is to figure out a way to make as many of those nonedible pieces out of edible materials instead, as well as finding a way to carry a payload (like water) in an edible container.</p><p>For a bit more about this drone, we spoke with the lead author of the paper, Bokeon Kwak.</p><p><strong>It sounds like your selection of edible wing material was primarily optimized for its mechanical properties and low weight. Are there other options that could work if the goal was to instead optimize for calories while still maintaining functionality?</strong></p><p><strong>Bokeon Kwak: </strong>As you pointed out, achieving sufficient mechanical properties while maintaining low weight (with food materials) was the foremost design criteria in designing the edible wing. We can expand the design criteria to contain higher calories by using fat-based material—for example, edible wax; fat has higher calories per gram than proteins and carbohydrates. On the other hand, containing more calories also implies the increase of structural weight, which is a price we need to pay toward higher calories. This aspect also requires further study to find a sweet spot! </p><p><strong>What does the drone taste like?</strong></p><p><strong>Kwak:</strong> The edible wing tastes like a crunchy rice crisp cookie with a little touch of raw gelatin (which worked as an edible glue to hold the rice cookies as a flat plate shape). No artificial flavor has been added yet. </p><p><strong>Would there be any significant advantages to making the wing into a more complex shape, for example with an airfoil cross-section instead of a flat plate?</strong></p><p><strong>Kwak:</strong> Making a well-streamlined airfoil (instead of a flat plate) is actually our next goal to achieve more efficient aerodynamic properties, such as lower drag and higher lift. These advantages let an edible drone carry more payload (which is useful to carry water) and have prolonged flight time and distance. Our team is testing 3D food printing and molding to create such an edible wing, including material characterization to make sure the edible wing has sufficient mechanical properties (for example, higher Young’s modulus, low density). </p><p><strong>What else will you be working on next?</strong></p><p><strong>Kwak:</strong> Other structural components such as wing control surfaces (such as an aileron or a rudder) will be made of edible material by 3D food printing or molding. Other things that will be considered are an edible/water-resistant coating on the surface of the edible wing, and degradation testing of the edible wing upon time (and water exposure).</p><div class=\"horizontal-rule\"></div><p>This drone is just one application of a broader European research initiative called <a href=\"https://www.robofood.org/\" rel=\"noopener noreferrer\" target=\"_blank\">RoboFood</a>, which seeks to develop edible robots in a way that maximizes both performance and nutritional value. Edible sensing, actuation, and computation are all parts of this project, and the researchers (<a href=\"https://www.epfl.ch/labs/lis/\" rel=\"noopener noreferrer\" target=\"_blank\">led by Dario Floreano at EPFL</a>) can now start to focus on some of those more challenging edible components. </p>",
  "pubDate": "Tue, 01 Nov 2022 16:00:01 +0000",
  "guid": "https://spectrum.ieee.org/edible-robots",
  "category": [
    "Drones",
    "Iros 2022",
    "Epfl",
    "Robotics",
    "Edible robots"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}