{
  "title": "#21/Evil Lairs - Adele Cygelman & Christine Madrid French",
  "pubDate": "Mon, 06 Mar 2017 08:00:00 +0000",
  "guid": "f85bc0c0eb539f233bf5241a61c7d0cb",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_21a.mp3",
  "itunes:image": "",
  "description": "<div class=\"auto-style4\"> <p>If you’ve seen a thriller like North By Northwest or Diamonds are Forever (or many others since) you may have noticed that the bad guy has impeccable taste.  The classic villain has custom-tailored suits (or dresses, let’s not be sexist), a high-end car you can’t even buy used at Carmax, a British or vaguely Russian accent, and a gorgeous Modernist house, preferably with a killer view as certainly there will be some killing going on. </p> <p>We're talking about Evil Lairs, the tricked-out Modoernist houses no self-respecting villain intent on world domination would be without.  Our guests are two authors who have written about some of these infamous houses, both real and imagined.</p> <p><strong>Adele Cygelman</strong> was editor-in-chief of the Robb Report Collection and Senior editor at Architectural Digest, both of which surely had villain Ernst Blofeld as well as James Bond as readers.  She is the author of “Palm Springs Modern” which was the first book to focus on desert modern architecture and its talented architects.  The book has been a best-seller since 1999 and was re-issued in 2015 to rediscover the timeless, cool appeal of the mid-century modern.  Adele spoke at Modernism Week this year on Arthur Elrod, who you’ll learn about shortly.</p> <span style=\"color: #000000;\"><span class= \"auto-style43\"><strong>Christine Madrid French</strong> is a nationally known advocate for the study and preservation of American architecture. After working as a historian for the National Park Service, she directed the Modernism Program for the National Trust for Historic Preservation and taught at the University of Florida and the University of Central Florida.  I consider her ten-year fight to save Neutra’s Cyclorama in Pennsylvania is considered one of the heroic legends in preservation, even though the bulldozer ultimately prevailed.  Her new book, Critical Insights Series: Alfred Hitchcock, will be out soon.  </span></span></div> <div class=\"auto-style4\"><span style= \"color: #000000;\"> </span></div>",
  "content:encoded": " <p>If you’ve seen a thriller like North By Northwest or Diamonds are Forever (or many others since) you may have noticed that the bad guy has impeccable taste.  The classic villain has custom-tailored suits (or dresses, let’s not be sexist), a high-end car you can’t even buy used at Carmax, a British or vaguely Russian accent, and a gorgeous Modernist house, preferably with a killer view as certainly there will be some killing going on. </p> <p>We're talking about Evil Lairs, the tricked-out Modoernist houses no self-respecting villain intent on world domination would be without.  Our guests are two authors who have written about some of these infamous houses, both real and imagined.</p> <p>Adele Cygelman was editor-in-chief of the Robb Report Collection and Senior editor at Architectural Digest, both of which surely had villain Ernst Blofeld as well as James Bond as readers.  She is the author of “Palm Springs Modern” which was the first book to focus on desert modern architecture and its talented architects.  The book has been a best-seller since 1999 and was re-issued in 2015 to rediscover the timeless, cool appeal of the mid-century modern.  Adele spoke at Modernism Week this year on Arthur Elrod, who you’ll learn about shortly.</p> Christine Madrid French is a nationally known advocate for the study and preservation of American architecture. After working as a historian for the National Park Service, she directed the Modernism Program for the National Trust for Historic Preservation and taught at the University of Florida and the University of Central Florida.  I consider her ten-year fight to save Neutra’s Cyclorama in Pennsylvania is considered one of the heroic legends in preservation, even though the bulldozer ultimately prevailed.  Her new book, Critical Insights Series: Alfred Hitchcock, will be out soon.    ",
  "enclosure": "",
  "itunes:duration": "31:09",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "If you’ve seen a thriller like North By Northwest or Diamonds are Forever (or many others since) you may have noticed that the bad guy has impeccable taste.  The classic villain has custom-tailored suits (or dresses, let’s not be sexist), a...",
  "itunes:episodeType": "full"
}