{
  "title": "123. A Fieldguide to Sub-Saharan African Architecture with Adil Dalbai and Livingstone Mukasa",
  "itunes:title": "123. A Fieldguide to Sub-Saharan African Architecture with Adil Dalbai and Livingstone Mukasa",
  "pubDate": "Thu, 24 Mar 2022 19:05:54 +0000",
  "guid": "a3ede9e0-a832-4a9b-91b8-50f59bf5526f",
  "link": "http://ArchitectureTalk.org/123ADLM",
  "itunes:image": "",
  "description": "<p><img src= \"https://assets.libsyn.com/secure/show/97895/adil_dilbai_illustration.jpg\" alt=\"Original Drawing by Tori Haynes\" width=\"500\" height= \"500\" /></p> <p>How does the idea of a “Nation” come through in architectural language? Is there such a thing as a Nigerian architecture, for example? Are there national identifications visible in architectural makeup? On the other hand, how does architecture transcend borders? What is the status of Modernism in architecture in these various places? This week, we dive into these larger questions as we dissect the recently published series <a href= \"https://dom-publishers.com/products/sub-saharan-africa\"><span style=\"text-decoration: underline;\"> Sub-Saharan Africa</span></a> Edited by Philipp Meuser, Adil Dalbai, and Livingstone Mukasa.</p>",
  "content:encoded": "<p></p> <p>How does the idea of a “Nation” come through in architectural language? Is there such a thing as a Nigerian architecture, for example? Are there national identifications visible in architectural makeup? On the other hand, how does architecture transcend borders? What is the status of Modernism in architecture in these various places? This week, we dive into these larger questions as we dissect the recently published series <a href= \"https://dom-publishers.com/products/sub-saharan-africa\"> Sub-Saharan Africa</a> Edited by Philipp Meuser, Adil Dalbai, and Livingstone Mukasa.</p>",
  "enclosure": "",
  "itunes:duration": "01:01:22",
  "itunes:explicit": false,
  "itunes:keywords": "modernism,subsaharanafrica",
  "itunes:subtitle": "How does the idea of a “Nation” come through in architectural language? Is there such a thing as a Nigerian architecture, for example? Are there national identifications visible in architectural makeup? On the other hand, how does architecture...",
  "itunes:season": 4,
  "itunes:episode": 27,
  "itunes:episodeType": "full"
}