{
  "title": "A Would-Be Freakonomist in Kyrgyzstan Needs Your Help",
  "link": "https://freakonomics.com/2015/03/a-would-be-freakonomist-in-kyrgyzstan-needs-your-help/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Mon, 30 Mar 2015 20:22:26 +0000",
  "category": "Freakonomics Blog",
  "guid": "http://freakonomics.com/?p=109831",
  "description": "<p>From a reader named John Keaney: I just finished your book Think Like a Freak, and I&#8217;m trying to use the lessons in the book while I&#8217;m in Kyrgyzstan. I&#8217;m an undergraduate at University of South Carolina, and I&#8217;ve decided to pursue my very first, independent research project while I&#8217;m living in Kyrgyzstan on the effects of Kyrgyz accession to . . .</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/a-would-be-freakonomist-in-kyrgyzstan-needs-your-help/\">A Would-Be Freakonomist in Kyrgyzstan Needs Your Help</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>From a reader named <strong>John Keaney</strong>:</p>\n<blockquote><p>I just finished your book <em>Think Like a Freak</em>, and I&#8217;m trying to use the lessons in the book while I&#8217;m in Kyrgyzstan. I&#8217;m an undergraduate at University of South Carolina, and I&#8217;ve decided to pursue my very first, independent research project while I&#8217;m living in Kyrgyzstan on the effects of Kyrgyz accession to the Eurasian Economic Union on the Kyrgyz informal economy and, ultimately, Kyrgyzstan&#8217;s political stability.</p>\n<p>I&#8217;m almost ready to go out to the bazaars and do my data collection, but I&#8217;ve been trying to pick the best possible questions to ask the people working in the stalls. Thus far I&#8217;ve been focusing on questions regarding past prices and what they expect in the future, what they feel the EEU&#8217;s effect will be on them, how much they depend on bazaar money, whether or not they have any sons that are migrant workers (and if they&#8217;ll be returning home soon), etc.</p>\n<p>I&#8217;ve been struggling to come up with a good Freakonometric for the questionnaire, but I&#8217;ve been struggling to find an unusual, but important, common thread between the EEU, bazaars, household income, etc. and was wondering if you would have any advice for this filthy undergrad.</p></blockquote>\n<p>Who can give John a good suggestion or two?</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/a-would-be-freakonomist-in-kyrgyzstan-needs-your-help/\">A Would-Be Freakonomist in Kyrgyzstan Needs Your Help</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}