{
  "title": "The MoSM",
  "link": "",
  "published": "2019-12-14T00:00:00+00:00",
  "updated": "2019-12-14T00:00:00+00:00",
  "id": "http://inverseprobability.com/2019/12/14/ministry-of-silly-models",
  "content": "<p>This is an imagined future, one that I believe could place the UK at the forefront of AI today. It builds upon our traditional strengths, but is forward looking.</p>\n\n<p>I’ve set the scene below by imagining the application process. Imagine a 1970s style office just off Whitehall (with apologies to John Cleese and Michael Palin).</p>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/commons/3/38/Owo_whitehall_south.jpg\" alt=\"\" /></p>\n\n<p><em>Whitehall where our action takes place</em></p>\n\n<p>Minister: Good morning. I’m sorry to have kept you waiting, but I’m afraid my model has become rather sillier recently, and so it takes me rather longer to train it. (sits at desk) Now then, what was it again?</p>\n\n<p>Mr. Pudey: Well sir, I have a silly model and I’d like to obtain a Government grant to help me develop it.</p>\n\n<p>Minister: I see. May I see your silly model?</p>\n\n<p>Mr. Pudey: Yes, certainly, yes.</p>\n\n<p>(Shows laptop with PyTorch open in Jupyter notebook)</p>\n\n<p>Minister: That’s it, is it?</p>\n\n<p>Mr. Pudey: Yes, that’s it, yes.</p>\n\n<p>Minister: It’s not particularly silly, is it? I mean, the first layer isn’t silly at all and second layer merely does a forward pass with a partial recursion every alternate iteration.</p>\n\n<p>Mr. Pudey: Yes, but I think that with Government backing I could make it very silly.</p>\n\n<p>Minister: (rising) Mr. Pudey, (he walks about behind the desk) the very real problem is one of money. I’m afraid that the Ministry of Silly Models is no longer getting the kind of support it needs. You see there’s Defense, Social Security, Health, Housing, Education, Silly Models … they’re all supposed to get the same. But last year, the Government spent less on the Ministry of Silly Models than it did on National Defense! Now we get £348,000,000 a year, which is supposed to be spent on all our available products. (he sits down) Coffee?</p>\n\n<p>Mr. Pudey: Yes please.</p>\n\n<p>(Context: many of you may not yet have heard of the UK’s National Smart Assistant project, “Two-Lumps”, now widely deployed across our civil service)</p>\n\n<p>Minister:  Two-Lumps, would you bring us in two coffees please?</p>\n\n<p>Disembodied Voice: Yes, Mr. Teabag.</p>\n\n<p>Minister: … Out of its mind. Now the Japanese have a model which inverts each of its layers over its head and back again with every single iteration. While the Israelis… here’s the coffee.</p>\n\n<p>(Enter a robot with tray with two cups on it. Its motor system has been trained via reinforcement learning through an evolutionary search strategy. This gives it a particularly jerky movement which means that by the time it reaches the minister there is no coffee left in the cups. The minister has a quick look in the cups, and smiles understandingly.)</p>\n\n<p>Minister: Thank you - lovely. (robot exits still carrying tray and cups) You’re really interested in silly models, aren’t you?</p>\n\n<p>Mr. Pudey: Oh rather. Yes.</p>\n\n<p>Minister: Well take a look at this, then.</p>\n\n<p><img src=\"http://www.lecun.org/gallery/libpro/19860701-cmu/0000-m.jpg\" alt=\"\" /></p>\n\n<p>(He produces a projector from beneath his desk already spooled up and plugged in. He flicks a switch and it beams onto the opposite wall. The film shows a sequence of six old-fashioned silly modelers at the first Connectionist Models Summer School. Geoff Hinton, David Rumelhart, Michael Mozer, Terry Sejnowski, Mike Jordan, John Hopfield. The film is old silent-movie type, scratchy, jerky and 8mm quality. All the participants wear 1980’s type costume. One model has a huge input layer, one has no hidden units. Cut back to office. The minister hurls the projector away. Along with papers and everything else on his desk. He leans forward.)</p>\n\n<p>Minister: Now Mr. Pudey. I’m not going to mince words with you. I’m going to offer you a Research Fellowship on the Anglo-French Silly Model.</p>\n\n<p>Mr. Pudey: La Modèle Futile?</p>\n\n<p>(Cut to two Frenchmen, wearing striped jerseys and berets, standing in a field with a third man who is entirely covered by a sheet.)</p>\n\n<p>First Frenchman: Bonjour … et maintenant … comme d’habitude, au sujet du Le Modèle Commun. Et maintenant, je vous presente, encore une fois, mon ami, le pouf célèbre, Yann LeCun. (he removes his moustache and sticks it onto the other Frenchman)</p>\n\n<p>Second Frenchman: Merci, mon petit chou-chou Leon Bottou. Et maintenant avec les couplages causales à droite, et les couplages dirigés au gauche, et maintenant l’Anglais-Française Modèle Futile, et voilà.</p>",
  "author": {
    "name": "Neil D. Lawrence"
  },
  "summary": "This is an imagined future, one that I believe could place the UK at the forefront of AI today. It builds upon our traditional strengths, but is forward looking."
}