{
  "title": "Last-Minute Leadership Reshuffle Caused Hu’s Removal",
  "description": "Ex Chinese President&#8217;s allies deleted from final list of top leaders without his knowledge",
  "link": "https://www.asiasentinel.com/p/leadership-reshuffle-hu-jintao-removal",
  "guid": "https://www.asiasentinel.com/p/leadership-reshuffle-hu-jintao-removal",
  "dc:creator": "Our Correspondent",
  "pubDate": "Wed, 26 Oct 2022 03:38:22 GMT",
  "enclosure": "",
  "content:encoded": "<div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg\" width=\"722\" height=\"542.5255681818181\" data-attrs=\"{\"src\":\"https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg\",\"fullscreen\":null,\"imageSize\":null,\"height\":529,\"width\":704,\"resizeWidth\":722,\"bytes\":119571,\"alt\":null,\"title\":null,\"type\":\"image/jpeg\",\"href\":null,\"belowTheFold\":false,\"internalRedirect\":null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F05e61e56-18d1-48c9-84ac-2aa3024d53d6_704x529.jpeg 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>The list of China&#8217;s new Politburo Standing Committee was changed at the last minute to remove former Chinese President Hu Jintao allies without his knowledge, leading to Hu&#8217;s removal from the closing ceremony of the 20th Communist Party Congress, according to two sources.</p><p>The public ejection on television of the 79-year-old former president from the head table, apparently against his will, caused shock waves in international circles as a demonstration of Chinese leader Xi Jinping&#8217;s raw power. While foreign media were allowed to broadcast the incident, the video footage of Hu&#8217;s removal was censored in Chinese media and social media.</p><p>Although officials attempted to downplay Hu&#8217;s abrupt departure as due to health issues, unofficial <a href=\"https://twitter.com/Doranimated/status/1584724117202341888?s=20&t=Qmb1FwpJzfWm64a6KMioMg\">video made public here</a> made it clear it was against Hu&#8217;s wishes.</p><p>The earlier standing committee list of the handful of the most powerful Chinese leaders governing the country included at least one person allied with Hu, but the final list of the seven members of the committee dropped any Hu prot&#233;g&#233;, said these sources.</p><p>The new Politburo Standing Committee, unveiled on October 23, consisted of Xi and six other men who were all Xi&#8217;s loyalists, Asia Sentinel <a href=\"https://www.asiasentinel.com/p/hu-jintao-ejection-highlights-xi-jinping-power\">reported</a> on October 23. The week-long congress ended with Xi getting an unprecedented third term as Chinese president, while his predecessors Hu and Jiang Zemin had served only two, according to the two-term limit laid down by the late Chinese leader Deng Xiaoping.</p><p>&#8220;It seems pretty clear that the final list was not the list of names Hu had been led to expect, which suggests he thought he had a deal that there would be one or two Youth League names in the standing committee,&#8221; said one of the sources. The Communist Youth League is Hu&#8217;s faction.</p><p>Xi substituted his own list of the Politburo Standing Committee at the last minute, denying Hu any chance to oppose it in the closing ceremony of the congress, the source added. &#8220;Hence Hu&#8217;s removal from the open session, in case he said anything.&#8221;</p><p>Hu was escorted out of the closing ceremony of the congress on October 22, Asia Sentinel <a href=\"https://www.asiasentinel.com/p/hu-jintao-ejection-highlights-xi-jinping-power\">reported</a> on October 23. The video of the moment just before Hu was taken away showed Li Zhanshu, seated next to Hu, taking away a red document from Hu while talking to him. Li was a member of the previous Politburo Standing Committee but not the latest committee.</p><p>Then Xi, who was seated on the other side next to Hu, gave instructions to what appeared to be an aide.</p><p>The man, holding a red document, and another person then escorted Hu out. Hu was seen in the video trying to get hold of the document in the man&#8217;s hands and having a prolonged discussion with the two men, indicating his reluctance to leave. It is unclear whether the red document held by the aide was the same document which Hu initially possessed.</p><p>Peter Humphrey, a British analyst, commented on the video on Linkedin on October 25: &#8220;It is very clear in these photos that Xi was personally calling the shots during this ugly incident when Xi personally called in his goons to purge Mr. Hu from the conference room in classic Stalinist style and (Li) on his left was trying to prevent Hu from using a document folder on the table in front of the elderly cadre. Hu was clearly about to do something that Xi jumped in to prevent.&#8221;</p><p>Humphrey previously ran a risk consultancy in Shanghai, was jailed in China and now lives in the UK.</p><p>&#8220;I think one of the key reasons for Xi's predecessor Hu Jintao to be removed from the conference was that he withheld applause for Xi in order to express disapproval of Xi's power grab throughout the 'congress', while everybody else obsequiously and fearfully clapped,&#8221; said Humphrey on Linkedin on October 24.</p><p>&#8220;And Hu was seated right next to Xi, so his protest was very obvious, and Xi would inevitably take offense.&#8221;</p><p>In the video, Hu looked tired and dazed, giving credence to the explanation in Chinese state media that the 79-year-old was unwell and taken to an adjacent room to recover. However, evidence in another video suggests ill health could not be the only reason that the former president was taken away from the congress. According to this other <a href=\"https://twitter.com/ianbremmer/status/1583782347245166592?s=20&t=Qmb1FwpJzfWm64a6KMioMg\">video</a>, everybody else at the congress, except for Li, ignored Hu while he was escorted out.</p><p>Normally, if an important person suddenly suffered ill health in a meeting, many people would react in surprise and try to help him. For example, when Singapore Prime Minister Lee Hsien Loong fainted during a speech on August 21, 2016, several people rushed to Lee&#8217;s assistance.</p><p>Moreover, if an attendee at a meeting suffered from ill health, doctors and nurses would normally attend to him. Instead, one of the two men who took Hu away was Kong Shaoxun, deputy director of the general office of the Central Committee of the Chinese Communist Party, a holder of a political office, <a href=\"https://twitter.com/dakekang/status/1583807633588654080?s=20&t=z2mpGZAabapNlXColB80rQ\">tweeted</a> Dake Kang, an AP journalist, on October 22.</p><p><strong>Hu Jintao&#8217;s prot&#233;g&#233; demoted</strong></p><p>One of Hu Jintao&#8217;s proteges who failed to make it to the new Politburo Standing Committee was deputy prime minister Hu Chunhua (no relation to Hu Jintao). Previously, there was speculation that Chunhua would be promoted to prime minister, which would have guaranteed him a place in the standing committee. Instead, Chunhua lost his place in the Politburo, the government body below the Politburo Standing Committee, which means he has been demoted.</p><p>Hu Chunhua was once seen as a possible successor to Xi. If Xi had stepped down this year in accordance with Deng&#8217;s two-term rule, Chunhua could possibly have succeeded him, an analyst told Asia Sentinel. The analyst recalled that in 2008, he told a Chinese intelligence officer that he thought Hu Chunhua would be the next president after Xi. The Chinese intelligence officer replied, &#8220;Very perceptive, your understanding of our system is good.&#8221;</p><p>The previous Politburo Standing Committee included two of Hu Jintao&#8217;s allies, prime minister Li Keqiang and Wang Yang, chairman of the national committee of the Chinese People&#8217;s Political Consultative Conference. Both are due to retire.</p><p>&#8220;Outgoing premier Li Keqiang, the stalwart of the Communist Youth League faction, recently remarked that &#8220;the waters of the Yellow and Yangtze Rivers won&#8217;t flow backwards.&#8221; The comment was seen as a rebuke of Xi&#8217;s statist policies,&#8221; said Enodo Economics, a UK research house focusing on China&#8217;s economy.</p><p>&#8220;But Li&#8217;s preferred candidate for premier, Hu Chunhua, didn&#8217;t make it onto the PBSC (Politburo Standing Committee), leaving the moderates without a standard-bearer,&#8221; Enodo added.</p><p>&#8220;President Xi&#8217;s overwhelming victory at the 20th Party Congress ensures that most of his conservative, quasi-Maoist economic and political policies, including an ironclad Covid lockdown policy, will endure for the foreseeable future,&#8221; Enodo forecast.</p><p>So far, Hu Jintao has not been purged, as old articles mentioning him are still available on Chinese state media websites.</p>"
}