{
  "title": "PLEDGE WEEK: &#8220;You&#8217;re Gonna Miss Me&#8221; by The Thirteenth Floor Elevators",
  "link": "https://500songs.com/podcast/pledge-week-youre-gonna-miss-me-by-the-thirteenth-floor-elevators/",
  "pubDate": "Sat, 16 Jul 2022 22:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1243",
  "description": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to <a href=\"http://patreon.com/andrewhickey\">patreon.com/andrewhickey</a> and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\n<strong>Transcript</strong>\n\nJust a note before I begin, this episode deals with mental illness and with the methods, close to torture, used to treat it in the middle of the last century, so anyone for whom that's a delicate subject may want to skip this one.\n\nThere's a term that often gets used about some musicians, \"outsider music\", and it's a term that I'm somewhat uncomfortable with. It's a term that gets applied to anyone eccentric, whether someone like Jandek who releases his own albums through mail order and just does his own thing, or someone like Hasil Adkins who made wild rockabilly music, or an entertainer like Tiny Tim who had a bizarre but consistent view of showbusiness, or a band like the Shaggs who were just plain incompetent, or people like Wesley Willis or Wild Man Fischer who had serious mental health problems.\n\nThe problem with the term is that it erases these differences, and that it assumes that the most interesting thing about the music is the person behind it. It also erases talent, especially in the case of mentally ill artists.\n\nThere are several mutually incompatible assumptions about creative artists who have mental health problems. One is that their music should be treated like a freak show, and either appreciated for that reason (if you're someone who gets their entertainment from someone else's suffering) or disdained (if you don't want to do that).\n\nOther people think that the mental illness *makes* the music, that great art comes from mental health problems, while yet others will argue that someone's art has nothing at all to do with their mental health, and is not influenced by it in any way.\n\nAll of these positions are, of course, wrong. Mental illness doesn't stop someone from making great art -- except when it takes away the ability to make art at all of course -- people like Brian Wilson or Vincent Van Gogh are testament to that, and their best work has nothing to do with a freak show. But nor does it grant the ability to make great art. Someone with no musical talent who develops schizophrenia just becomes a schizophrenic person with no musical talent.\n\nBut to say that mental illness doesn't affect the work is also nonsense. Everything about someone's life affects their art, especially something as important as their mental health.\n\nAnd the real problem with these labels comes with those artists who don't manage to develop a substantial body of work before their illness sets in. Those with real musical talent, but who end up getting put in the outsider artist bucket because their work is so obviously affected by their illness.\n\nAnd one of those is Roky Erickson, of the Thirteenth Floor Elevators.\n\nErickson started his career aged fifteen with a group based in Austin, Texas, called the Spades -- and I hope that this wasn't intended as a racial slur, as the word was sometimes used at this time. Their first single, \"We Sell Soul\", released in 1965, shows the clear influence of \"Gloria\" by Them:\n\n[Excerpt: The Spades, \"We Sell Soul\"]\n\nThat was a regional hit, and so their second single, the first song that Erickson had ever written, was recorded in the same style:\n\n[Excerpt: The Spades, \"You're Gonna Miss Me\"]\n\nBut by December 1965, Erickson had left the Spades, and joined Stacy Sutherland, Benny Thurman, and John Ike Walton, the members of another band called the Lingsmen. They were joined by a fifth man, Tommy Hall, who became the band's lyricist, liner-note writer, and general spokesman, and who played an electric jug, creating an effect somewhere between bubbling and a wobble board.\n\nHall started calling the group's music \"psychedelic rock\" in late 1965 after being influenced by Timothy Leary, and I've seen some people say he was the first person ever to use the term. The group released a rerecorded version of \"You're Gonna Miss Me\" on a small local label:\n\n[Excerpt: The Thirteenth Floor Elevators, \"You're Gonna Miss Me\"]\n\nThat was released in January 1966, and later picked up by a larger label, International Artists, which was the home of a lot of Texan psychedelic bands, like the Golden Dawn and the Red Crayola. It spent most of the year slowly climbing the charts, eventually reaching number fifty-five -- the highest chart position the group would ever have.\n\nIt was included on their debut album, The Psychedelic Sounds of the Thirteenth Floor Elevators, released towards the end of the year, by which time Thurman had been replaced by Ronnie Leatherman on bass. The album's liner notes were written by Hall and had a large amount of advocacy for the use of psychedelic drugs -- as did the music itself, though some of this was a little more subtle, like the song \"Fire Engine\", where the line \"let me take you to the empty place\" was meant to sound like \"DMT place\", DMT being a psychedelic drug:\n\n[Excerpt: The Thirteenth Floor Elevators, \"Fire Engine\"]\n\nAround this time, the band crossed paths with Janis Joplin, who was a big fan of the group and who they tried to get to join them, but Joplin decided to move to California instead.\n\nTommy Hall was a huge advocate for both the potential of LSD to open people's minds, and of the general semantics of Alfred Korzybski, and his enthusiasm for both showed up on the group's second album. Unfortunately, not all of the group were of quite the same mind, and Leatherman and Walton left early in the sessions for that album, Easter Everywhere, which was considered not quite up to the standards of the previous album, though Erickson and Hall's eight-minute long \"Slip Inside This House\" is a favourite of most of the fans.\n\n[Excerpt: The Thirteenth Floor Elevators, \"Slip Inside This House\"]\n\nUnfortunately, the band started to disintegrate. The core of Erickson, Hall, and Sutherland remained together, but various bass players and drummers came and went -- though one of the band's rhythm sections, Duke Davis and Danny Thomas, was good enough that the band's label got them to back Lightnin' Hopkins on his album Free Form Patterns. According to reports I've read, Davis and Thomas were both on acid during the session, but they still play solidly throughout:\n\n[Excerpt: Lightnin' Hopkins, \"Give Me Time to Think\"]\n\nAnother potential bass player at this point was a roommate of Erickson's, who Erickson tried to get into the band but who Hall turned down. Townes Van Zandt later went on to rather bigger things.\n\nErickson also started to have some mental problems -- apparently taking LSD literally every day for years is not great for you. And when he was arrested for marijuana possession, he decided to use his mental health as a way to get out of a potential ten-year jail sentence, by getting three years in a psychiatric hospital instead. He later claimed that he was lying about his problems and acting mad to get this sentence, but he had been having problems before then.\n\nHall and Sutherland and their current rhythm section finished up a few demos, and the record label put out one final album made up of outtakes, plus a faked live album with crowd noise overdubbed on some earlier studio recordings, but with their lead singer in hospital for three years the band split up. Hall became a Scientologist and quit the music industry altogether.\n\nIf Erickson *was* faking his illness when he went into the hospital, he wasn't faking it by the time he came out. Psychiatric medicine was still in its infancy then. It's far from wonderful today, but at least in general you can be relatively sure that the treatment won't make you worse. That wasn't the case in the late sixties and early seventies, and Erickson was forced through multiple sessions of electro-shock therapy. (To be clear, electro-shock therapy can sometimes be effective for some conditions when done properly and with the patient's consent. This wasn't either.)\n\nWhen Erickson finally got out, he tried to put his life back together, and formed a new band called Bleib Alien, later renamed Roky Erickson and the Aliens, who made hard rock records with lyrics about science fiction and horror themes like zombies, fire demons, medical experimentation, and two-headed dogs:\n\n[Excerpt: Roky Erickson and the Aliens, \"Two-Headed Dog\"]\n\nErickson became a cult artist, cited as an influence by everyone from Henry Rollins to ZZ Top, and intermittently released recordings for the next few decades, but he spent much of the time dealing with severe, untreated, schizophrenia. There are many stories about this time that get shared, and are easy to find online, but which I'm not going to repeat here because they tend to be shared in a freak-show manner.\n\nBut by 2001 he was placed in the legal custody of his brother . This kind of situation is often abused, but in Erickson's case it seems to have done him good. His brother got him legal and medical help, and helped him start finally receiving royalties on some of his records. There was a one-off fiftieth anniversary reunion of most of the living original members of the Thirteenth Floor Elevators, and in 2010 Erickson released his finest album, a collaboration with the band Okkervil River, True Love Cast Out All Evil:\n\n[Excerpt: Roky Erickson and Okkervil River, \"Ain't Blues Too Bad\"]\n\nBy all accounts the last years of Erickson's life were happier and more comfortable than any he'd had. He got to tour the world, playing for appreciative crowds, he got his schizophrenia under control, and he was able to live a relatively independent life, and to know that new generations of musicians admired his work. He died in 2019, aged seventy-one.",
  "itunes:subtitle": "This episode is part of Pledge Week 2022. Every day this week, Ill be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying back",
  "itunes:keywords": "Janis Joplin,Lightnin&#039; Hopkins,Roky Erickson,Thirteenth Floor Elevators,Townes Van Zandt",
  "content:encoded": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to <a href=\"http://patreon.com/andrewhickey\">patreon.com/andrewhickey</a> and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\n<strong>Transcript</strong>\n\nJust a note before I begin, this episode deals with mental illness and with the methods, close to torture, used to treat it in the middle of the last century, so anyone for whom that's a delicate subject may want to skip this one.\n\nThere's a term that often gets used about some musicians, \"outsider music\", and it's a term that I'm somewhat uncomfortable with. It's a term that gets applied to anyone eccentric, whether someone like Jandek who releases his own albums through mail order and just does his own thing, or someone like Hasil Adkins who made wild rockabilly music, or an entertainer like Tiny Tim who had a bizarre but consistent view of showbusiness, or a band like the Shaggs who were just plain incompetent, or people like Wesley Willis or Wild Man Fischer who had serious mental health problems.\n\nThe problem with the term is that it erases these differences, and that it assumes that the most interesting thing about the music is the person behind it. It also erases talent, especially in the case of mentally ill artists.\n\nThere are several mutually incompatible assumptions about creative artists who have mental health problems. One is that their music should be treated like a freak show, and either appreciated for that reason (if you're someone who gets their entertainment from someone else's suffering) or disdained (if you don't want to do that).\n\nOther people think that the mental illness *makes* the music, that great art comes from mental health problems, while yet others will argue that someone's art has nothing at all to do with their mental health, and is not influenced by it in any way.\n\nAll of these positions are, of course, wrong. Mental illness doesn't stop someone from making great art -- except when it takes away the ability to make art at all of course -- people like Brian Wilson or Vincent Van Gogh are testament to that, and their best work has nothing to do with a freak show. But nor does it grant the ability to make great art. Someone with no musical talent who develops schizophrenia just becomes a schizophrenic person with no musical talent.\n\nBut to say that mental illness doesn't affect the work is also nonsense. Everything about someone's life affects their art, especially something as important as their mental health.\n\nAnd the real problem with these labels comes with those artists who don't manage to develop a substantial body of work before their illness sets in. Those with real musical talent, but who end up getting put in the outsider artist bucket because their work is so obviously affected by their illness.\n\nAnd one of those is Roky Erickson, of the Thirteenth Floor Elevators.\n\nErickson started his career aged fifteen with a group based in Austin, Texas, called the Spades -- and I hope that this wasn't intended as a racial slur, as the word was sometimes used at this time. Their first single, \"We Sell Soul\", released in 1965, shows the clear influence of \"Gloria\" by Them:\n\n[Excerpt: The Spades, \"We Sell Soul\"]\n\nThat was a regional hit, and so their second single, the first song that Erickson had ever written, was recorded in the same style:\n\n[Excerpt: The Spades, \"You're Gonna Miss Me\"]\n\nBut by December 1965, Erickson had left the Spades, and joined Stacy Sutherland, Benny Thurman, and John Ike Walton, the members of another band called the Lingsmen. They were joined by a fifth man, Tommy Hall, who became the band's lyricist, liner-note writer, and general spokesman, and who played an electric jug, creating an effect somewhere between bubbling and a wobble board.\n\nHall started calling the group's music \"psychedelic rock\" in late 1965 after being influenced by Timothy Leary, and I've seen some people say he was the first person ever to use the term. The group released a rerecorded version of \"You're Gonna Miss Me\" on a small local label:\n\n[Excerpt: The Thirteenth Floor Elevators, \"You're Gonna Miss Me\"]\n\nThat was released in January 1966, and later picked up by a larger label, International Artists, which was the home of a lot of Texan psychedelic bands, like the Golden Dawn and the Red Crayola. It spent most of the year slowly climbing the charts, eventually reaching number fifty-five -- the highest chart position the group would ever have.\n\nIt was included on their debut album, The Psychedelic Sounds of the Thirteenth Floor Elevators, released towards the end of the year, by which time Thurman had been replaced by Ronnie Leatherman on bass. The album's liner notes were written by Hall and had a large amount of advocacy for the use of psychedelic drugs -- as did the music itself, though some of this was a little more subtle, like the song \"Fire Engine\", where the line \"let me take you to the empty place\" was meant to sound like \"DMT place\", DMT being a psychedelic drug:\n\n[Excerpt: The Thirteenth Floor Elevators, \"Fire Engine\"]\n\nAround this time, the band crossed paths with Janis Joplin, who was a big fan of the group and who they tried to get to join them, but Joplin decided to move to California instead.\n\nTommy Hall was a huge advocate for both the potential of LSD to open people's minds, and of the general semantics of Alfred Korzybski, and his enthusiasm for both showed up on the group's second album. Unfortunately, not all of the group were of quite the same mind, and Leatherman and Walton left early in the sessions for that album, Easter Everywhere, which was considered not quite up to the standards of the previous album, though Erickson and Hall's eight-minute long \"Slip Inside This House\" is a favourite of most of the fans.\n\n[Excerpt: The Thirteenth Floor Elevators, \"Slip Inside This House\"]\n\nUnfortunately, the band started to disintegrate. The core of Erickson, Hall, and Sutherland remained together, but various bass players and drummers came and went -- though one of the band's rhythm sections, Duke Davis and Danny Thomas, was good enough that the band's label got them to back Lightnin' Hopkins on his album Free Form Patterns. According to reports I've read, Davis and Thomas were both on acid during the session, but they still play solidly throughout:\n\n[Excerpt: Lightnin' Hopkins, \"Give Me Time to Think\"]\n\nAnother potential bass player at this point was a roommate of Erickson's, who Erickson tried to get into the band but who Hall turned down. Townes Van Zandt later went on to rather bigger things.\n\nErickson also started to have some mental problems -- apparently taking LSD literally every day for years is not great for you. And when he was arrested for marijuana possession, he decided to use his mental health as a way to get out of a potential ten-year jail sentence, by getting three years in a psychiatric hospital instead. He later claimed that he was lying about his problems and acting mad to get this sentence, but he had been having problems before then.\n\nHall and Sutherland and their current rhythm section finished up a few demos, and the record label put out one final album made up of outtakes, plus a faked live album with crowd noise overdubbed on some earlier studio recordings, but with their lead singer in hospital for three years the band split up. Hall became a Scientologist and quit the music industry altogether.\n\nIf Erickson *was* faking his illness when he went into the hospital, he wasn't faking it by the time he came out. Psychiatric medicine was still in its infancy then. It's far from wonderful today, but at least in general you can be relatively sure that the treatment won't make you worse. That wasn't the case in the late sixties and early seventies, and Erickson was forced through multiple sessions of electro-shock therapy. (To be clear, electro-shock therapy can sometimes be effective for some conditions when done properly and with the patient's consent. This wasn't either.)\n\nWhen Erickson finally got out, he tried to put his life back together, and formed a new band called Bleib Alien, later renamed Roky Erickson and the Aliens, who made hard rock records with lyrics about science fiction and horror themes like zombies, fire demons, medical experimentation, and two-headed dogs:\n\n[Excerpt: Roky Erickson and the Aliens, \"Two-Headed Dog\"]\n\nErickson became a cult artist, cited as an influence by everyone from Henry Rollins to ZZ Top, and intermittently released recordings for the next few decades, but he spent much of the time dealing with severe, untreated, schizophrenia. There are many stories about this time that get shared, and are easy to find online, but which I'm not going to repeat here because they tend to be shared in a freak-show manner.\n\nBut by 2001 he was placed in the legal custody of his brother . This kind of situation is often abused, but in Erickson's case it seems to have done him good. His brother got him legal and medical help, and helped him start finally receiving royalties on some of his records. There was a one-off fiftieth anniversary reunion of most of the living original members of the Thirteenth Floor Elevators, and in 2010 Erickson released his finest album, a collaboration with the band Okkervil River, True Love Cast Out All Evil:\n\n[Excerpt: Roky Erickson and Okkervil River, \"Ain't Blues Too Bad\"]\n\nBy all accounts the last years of Erickson's life were happier and more comfortable than any he'd had. He got to tour the world, playing for appreciative crowds, he got his schizophrenia under control, and he was able to live a relatively independent life, and to know that new generations of musicians admired his work. He died in 2019, aged seventy-one.",
  "enclosure": "",
  "itunes:summary": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to patreon.com/andrewhickey and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\nTranscript\n\nJust a note before I begin, this episode deals with mental illness and with the methods, close to torture, used to treat it in the middle of the last century, so anyone for whom that's a delicate subject may want to skip this one.\n\nThere's a term that often gets used about some musicians, \"outsider music\", and it's a term that I'm somewhat uncomfortable with. It's a term that gets applied to anyone eccentric, whether someone like Jandek who releases his own albums through mail order and just does his own thing, or someone like Hasil Adkins who made wild rockabilly music, or an entertainer like Tiny Tim who had a bizarre but consistent view of showbusiness, or a band like the Shaggs who were just plain incompetent, or people like Wesley Willis or Wild Man Fischer who had serious mental health problems.\n\nThe problem with the term is that it erases these differences, and that it assumes that the most interesting thing about the music is the person behind it. It also erases talent, especially in the case of mentally ill artists.\n\nThere are several mutually incompatible assumptions about creative artists who have mental health problems. One is that their music should be treated like a freak show, and either appreciated for that reason (if you're someone who gets their entertainment from someone else's suffering) or disdained (if you don't want to do that).\n\nOther people think that the mental illness *makes* the music, that great art comes from mental health problems, while yet others will argue that someone's art has nothing at all to do with their mental health, and is not influenced by it in any way.\n\nAll of these positions are, of course, wrong. Mental illness doesn't stop someone from making great art -- except when it takes away the ability to make art at all of course -- people like Brian Wilson or Vincent Van Gogh are testament to that, and their best work has nothing to do with a freak show. But nor does it grant the ability to make great art. Someone with no musical talent who develops schizophrenia just becomes a schizophrenic person with no musical talent.\n\nBut to say that mental illness doesn't affect the work is also nonsense. Everything about someone's life affects their art, especially something as important as their mental health.\n\nAnd the real problem with these labels comes with those artists who don't manage to develop a substantial body of work before their illness sets in. Those with real musical talent, but who end up getting put in the outsider artist bucket because their work is so obviously affected by their illness.\n\nAnd one of those is Roky Erickson, of the Thirteenth Floor Elevators.\n\nErickson started his career aged fifteen with a group based in Austin, Texas, called the Spades -- and I hope that this wasn't intended as a racial slur, as the word was sometimes used at this time. Their first single, \"We Sell Soul\", released in 1965, shows the clear influence of \"Gloria\" by Them:\n\n[Excerpt: The Spades, \"We Sell Soul\"]\n\nThat was a regional hit, and so their second single, the first song that Erickson had ever written, was recorded in the same style:\n\n[Excerpt: The Spades, \"You're Gonna Miss Me\"]\n\nBut by December 1965, Erickson had left the Spades, and joined Stacy Sutherland, Benny Thurman, and John Ike Walton, the members of another band called the Lingsmen. They were joined by a fifth man, ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This episode is part of Pledge Week 2022. Every day this week, I'll be posting old Patreon bonus episodes of the podcast which will have this short intro. These are short, ten- to twenty-minute bonus podcasts which get posted to Patreon for my paying backers every time I post a new main episode -- there are well over a hundred of these in the archive now. If you like the sound of these episodes, then go to patreon.com/andrewhickey and subscribe for as little as a dollar a month or ten dollars a year to get access to all those bonus episodes, plus new ones as they appear.\n\nClick below for the transcript\n\n\n\nTranscript\n\nJust a note before I begin, this episode deals with mental illness and with the methods, close to torture, used to treat it in the middle of the last century, so anyone for whom that's a delicate subject may want to skip this one.\n\nThere's a term that often gets used about some musicians, \"outsider music\", and it's a term that I'm somewhat uncomfortable with. It's a term ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}