{
  "title": "Intel Demos Sapphire Rapids Hardware Accelerator Blocks In Action At Innovation 2022",
  "dc:creator": "Ryan Smith",
  "description": " <p>With Intel&rsquo;s annual Innovation event taking place this week in San Jose, the company is looking to recapture a lot of technical momentum that has slowly been lost over the past couple of years. While Intel has remained hard at work releasing new products over the time, the combination of schedule slips and an inability to show off their wares to in-person audiences has taken some of the luster off the company and its products. So for their biggest in-person technical event since prior to the pandemic, the company is showing off as much silicon as they can, to convince press, partners, and customers alike that CEO Pat Gelsinger&rsquo;s efforts have put the company back on track.</p>\n\n<p>Of all of Intel&rsquo;s struggles over the past couple of years, there is no better poster child than their Sapphire Rapids server/workstation CPU. A true next-generation product from Intel that brings everything from PCIe 5 and DDR5 to CXL and a slew of hardware accelerators, there&rsquo;s really nothing to write about Sapphire Rapids&rsquo; delays that hasn&rsquo;t already been said &ndash; it&rsquo;s going to end up over a year late.</p>\n\n<p>But Sapphire Rapids is coming. And Intel is finally able to see the light at the end of the tunnel on those development efforts. With general availability slated for Q1 of 2023, just over a quarter from now, Intel is finally in a position to show off Sapphire Rapids to a wider audience &ndash; or at least, members of the press. Or to take a more pragmatic read on matters, Intel now needs to start seriously promoting Sapphire Rapids ahead of its launch, and that of its competition.</p>\n\n<p>For this year&rsquo;s show, Intel invited members of the press to see a live demo of pre-production Sapphire Rapids silicon in action. The purpose of the demos, besides to give the press the ability to say &ldquo;we saw it; it exists!&rdquo; is to start showing off one of the more unique features of Sapphire Rapids: its collection of dedicated accelerator blocks.</p>\n\n<p>Along with delivering a much-needed update to the CPU&rsquo;s processor cores, Sapphire Rapids is also adding/integrating dedicated accelerator blocks for several common CPU-critical server/workstation workloads. The idea, simply put, is that fixed function silicon can do the task as quickly or better than CPU cores for a fraction of the power, and for only a fractional increase in die size. And with hyperscalers and other server operators looking for big improvements in compute density and energy efficiency, domain specific accelerators such as these are a good way for Intel to deliver that kind of edge to their customers. And it doesn&rsquo;t hurt either that rival AMD isn&rsquo;t expected to have similar accelerator blocks.</p>\n",
  "link": "https://www.anandtech.com/show/17596/intel-demos-sapphire-rapids-accelerators-at-innovation-2022",
  "pubDate": "Wed, 28 Sep 2022 19:20:00 EDT",
  "guid": "tag:www.anandtech.com,17596:news",
  "category": " CPUs"
}