{
  "title": "Episode 70: Coincidence or Synchronicity? You Be The Judge",
  "pubDate": "Wed, 10 Sep 2008 02:03:31 +0000",
  "guid": "episode-70-coincidence-or-synchronicity-you-be",
  "link": "http://www.thepsychfiles.com/2008/09/09/episode-70-coincidence-or-synchronicity-you-be-the-judge/",
  "itunes:image": "",
  "description": "Have you heard that president Abraham Lincoln had a secretary named Kennedy and president John F. Kennedy had a secretary named Lincoln?  In this episode of The Psych Files we explore strange coincidences like this one and we also examine Carl Jung's concept of Synchronicity.  Does it mean that everything happens for a reason - or is the idea more complex than that?  Let's find out.  Oh and by the way - turns out Lincoln never had a secretary named Kennedy.  This and more revealed on The Psych Files podcast.",
  "content:encoded": "Have you heard that president Abraham Lincoln had a secretary named Kennedy and president John F. Kennedy had a secretary named Lincoln?  In this episode of The Psych Files we explore strange coincidences like this one and we also examine Carl Jung's concept of Synchronicity.  Does it mean that everything happens for a reason - or is the idea more complex than that?  Let's find out.  Oh and by the way - turns out Lincoln never had a secretary named Kennedy.  This and more revealed on The Psych Files podcast.",
  "enclosure": "",
  "itunes:duration": "39:28",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,carl,psychology,Critical,thinking,Jung,synchronicity",
  "itunes:subtitle": "Have you heard that president Lincoln had a secretary named Kennedy and president Kennedy had a secretary named Lincoln? In this episode we explore strange coincidences like this one and we also examine Carl Jung's concept of Synchronicity.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Have you heard that president Abraham Lincoln had a secretary named Kennedy and president John F. Kennedy had a secretary named Lincoln? In this episode of The Psych Files we explore strange coincidences like this one and we also examine Carl Jung's concept of Synchronicity. Does it mean that everything happens for a reason - or is the idea more complex than that? Let's find out. Oh and by the way - turns out Lincoln never had a secretary named Kennedy. This and more revealed on The Psych Files podcast."
}