{
  "title": "UFYB 254: Conditional Self-Esteem",
  "itunes:title": "Conditional Self-Esteem",
  "pubDate": "Thu, 08 Sep 2022 07:00:00 +0000",
  "guid": "ac805252-cd7b-482e-8f0a-80d7e348bde6",
  "link": "https://unfuckyourbrain.com/254",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Self-confidence goes by many names - self-love, self-esteem, self-regard. But no matter what you call it, it’s important to dig deep and examine whether yours is conditional or unconditional.</span> <span style= \"font-weight: 400;\">When you’re constantly looking to outside factors to feel good about yourself, that’s conditional self-confidence. Conditional self-confidence has a big impact on our relationship with ourselves, but what are the larger implications?</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Listen to this week’s podcast episode to learn the impact conditional self-confidence has on the way we seek out security, how it can create unhealthy patterns in our relationships with others, and how you can start cultivating unconditional self-confidence.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Get full show notes and more information here: <a href=\"https://unfuckyourbrain.com/254\" target= \"_blank\" rel= \"noopener\">https://unfuckyourbrain.com/254</a></span></p>",
  "content:encoded": "<p>Self-confidence goes by many names - self-love, self-esteem, self-regard. But no matter what you call it, it’s important to dig deep and examine whether yours is conditional or unconditional. When you’re constantly looking to outside factors to feel good about yourself, that’s conditional self-confidence. Conditional self-confidence has a big impact on our relationship with ourselves, but what are the larger implications?</p> <p> </p> <p>Listen to this week’s podcast episode to learn the impact conditional self-confidence has on the way we seek out security, how it can create unhealthy patterns in our relationships with others, and how you can start cultivating unconditional self-confidence.</p> <p> </p> <p>Get full show notes and more information here: <a href=\"https://unfuckyourbrain.com/254\" target= \"_blank\" rel= \"noopener\">https://unfuckyourbrain.com/254</a></p>",
  "enclosure": "",
  "itunes:duration": "24:18",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Self-confidence goes by many names - self-love, self-esteem, self-regard. But no matter what you call it, it’s important to dig deep and examine whether yours is conditional or unconditional. When you’re constantly looking to outside factors to...",
  "itunes:episode": 254,
  "itunes:episodeType": "full",
  "itunes:author": "Kara Loewentheil"
}