{
  "title": "Data Science Book: Everybody Lies",
  "link": "http://www.dataminingblog.com/data-science-book-everybody-lies/",
  "pubDate": "Fri, 15 Jun 2018 19:17:03 +0000",
  "dc:creator": "Sandro Saitta",
  "category": "data mining",
  "guid": "http://www.dataminingblog.com/?p=2510",
  "description": "Seth Stephens-Davidowitz has written a very entertaining book on big data and how it can be used to understand Humankind. The main idea of Seth is that Google searches is the most powerful source of information to understand what people really think about. Seth argues that the main advantage of Big Data is our ability [&#8230;]",
  "content:encoded": "<p><img class=\"alignleft size-medium wp-image-2511\" src=\"http://www.dataminingblog.com/wp-content/uploads/lies-199x300.jpg\" alt=\"\" width=\"199\" height=\"300\" srcset=\"http://www.dataminingblog.com/wp-content/uploads/lies-199x300.jpg 199w, http://www.dataminingblog.com/wp-content/uploads/lies-768x1161.jpg 768w, http://www.dataminingblog.com/wp-content/uploads/lies-678x1024.jpg 678w, http://www.dataminingblog.com/wp-content/uploads/lies.jpg 1600w\" sizes=\"(max-width: 199px) 100vw, 199px\" />Seth Stephens-Davidowitz has written a very entertaining book on big data and how it can be used to understand Humankind. The main idea of Seth is that Google searches is the most powerful source of information to understand what people really think about. Seth argues that the main advantage of Big Data is our ability to zoom in the data. When referring to Big Data, Seth is only dealing with the notion of Volume (not the other Vs). He defines Big Data by providing use cases with new kinds of data in large volume that were not available before.</p>\n<p>On Facebook and other social media sites, people tend to lie and try to show a nice story about themselves. They want to look good and to be seen as happy individuals. When using Google search engine, the story is different. The anonymous nature of the tool makes people ask about their real concerns. I would have appreciated a chapter on the limitations of such approaches. Mainly, not everyone is using Google search and the ones using it represent a biased sample of the world population.</p>\n<p>While plenty of other topics are covered in the book (e.g. A/B tests), Seth focus primarily on examples related to sexuality. According to him, this is the most interesting subject for which people are more likely to lie. Seth provides plenty of meaningful examples of how people lie.</p>\n<p>The book often mentions Data Science and Machine Learning. Seth is mainly performing data analysis using huge volume of data. <em>Everybody Lies</em> is definitely an interesting reading, with the same kind of freshness as <em>Weapons of Math Destruction</em>, which I also recommend.</p>\n<p><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=http%3A%2F%2Fwww.dataminingblog.com%2Fdata-science-book-everybody-lies%2F&title=Data%20Science%20Book%3A%20Everybody%20Lies\" data-a2a-url=\"http://www.dataminingblog.com/data-science-book-everybody-lies/\" data-a2a-title=\"Data Science Book: Everybody Lies\"><img src=\"https://static.addtoany.com/buttons/share_save_171_16.png\" alt=\"Share\"></a></p>"
}