{
  "title": "Ditch p-values. Use Bootstrap confidence intervals instead",
  "link": "https://datascienceplus.com/ditch-p-values-use-bootstrap-confidence-intervals-instead/",
  "comments": "https://datascienceplus.com/ditch-p-values-use-bootstrap-confidence-intervals-instead/#respond",
  "dc:creator": "Florent Buisson",
  "pubDate": "Mon, 08 Nov 2021 19:55:39 +0000",
  "category": [
    "Basic Statistics",
    "Exploratory Analysis",
    "Tips & Tricks"
  ],
  "guid": "https://datascienceplus.com/?p=31741",
  "description": "<div style=\"border-top: 1px solid; font-size: 14px;text-align: center; border-bottom: 1px solid; padding: 5px 2px;\"><a href=\"https://datascienceplus.com/posting-from-r-markdown-to-datascienceplus/\">Are you interested in guest posting? Publish at DataScience+  via your RStudio editor.</a></div><h2>Category</h2><ul><li><a href=\"https://datascienceplus.com/category/basic-statistics/\" rel=\"bookmark\" title=\"Permanent Link toBasic Statistics\">Basic Statistics</a></li></ul><h2>Tags</h2><ul><li><a href=\"https://datascienceplus.com/tag/basic-statistics/\" rel=\"bookmark\" title=\"Permanent Link toBasic Statistics\">Basic Statistics</a></li><li><a href=\"https://datascienceplus.com/tag/exploratory-analysis/\" rel=\"bookmark\" title=\"Permanent Link toExploratory Analysis\">Exploratory Analysis</a></li><li><a href=\"https://datascienceplus.com/tag/rstats/\" rel=\"bookmark\" title=\"Permanent Link toR Programming\">R Programming</a></li><li><a href=\"https://datascienceplus.com/tag/tips-tricks/\" rel=\"bookmark\" title=\"Permanent Link toTips & Tricks\">Tips & Tricks</a></li></ul>P-values don&#8217;t mean what people think they mean; they rely on hidden assumptions that are unlikely to be fulfilled; they detract from the real questions. Here&#8217;s how to use the Bootstrap in R instead This post was first published on Towards Data Science and is based on my book &#8220;Behavioral Data Analysis with R and Python&#8221; [&#8230;]<strong><p>Related Post</p></strong><ul><li><a href=\"https://datascienceplus.com/an-r-alternative-to-pairs-for-omics-qc/\" rel=\"bookmark\" title=\"Permanent Link toAn R alternative to pairs for -omics QC\">An R alternative to pairs for -omics QC</a></li><li><a href=\"https://datascienceplus.com/how-i-selected-my-starting-word-for-wordle-using-simulations-and-r/\" rel=\"bookmark\" title=\"Permanent Link toHow I selected my starting word for Wordle using simulations and R\">How I selected my starting word for Wordle using simulations and R</a></li><li><a href=\"https://datascienceplus.com/introduction-for-decision-tree/\" rel=\"bookmark\" title=\"Permanent Link toIntroduction for Decision Tree\">Introduction for Decision Tree</a></li><li><a href=\"https://datascienceplus.com/correlation-vs-pps-in-python/\" rel=\"bookmark\" title=\"Permanent Link toCorrelation vs PPS in Python\">Correlation vs PPS in Python</a></li><li><a href=\"https://datascienceplus.com/earthquake-analysis-4-4-cluster-analysis/\" rel=\"bookmark\" title=\"Permanent Link toEarthquake Analysis (4/4): Cluster Analysis\">Earthquake Analysis (4/4): Cluster Analysis</a></li></ul>",
  "content:encoded": "<div style=\"border-top: 1px solid; font-size: 14px;text-align: center; border-bottom: 1px solid; padding: 5px 2px;\"><a href=\"https://datascienceplus.com/posting-from-r-markdown-to-datascienceplus/\">Are you interested in guest posting? Publish at DataScience+  via your RStudio editor.</a></div><h2>Category</h2><ul><li><a href=\"https://datascienceplus.com/category/basic-statistics/\" rel=\"bookmark\" title=\"Permanent Link toBasic Statistics\">Basic Statistics</a></li></ul><h2>Tags</h2><ul><li><a href=\"https://datascienceplus.com/tag/basic-statistics/\" rel=\"bookmark\" title=\"Permanent Link toBasic Statistics\">Basic Statistics</a></li><li><a href=\"https://datascienceplus.com/tag/exploratory-analysis/\" rel=\"bookmark\" title=\"Permanent Link toExploratory Analysis\">Exploratory Analysis</a></li><li><a href=\"https://datascienceplus.com/tag/rstats/\" rel=\"bookmark\" title=\"Permanent Link toR Programming\">R Programming</a></li><li><a href=\"https://datascienceplus.com/tag/tips-tricks/\" rel=\"bookmark\" title=\"Permanent Link toTips & Tricks\">Tips & Tricks</a></li></ul><p>P-values don&#8217;t mean what people think they mean; they rely on hidden assumptions that are unlikely to be fulfilled; they detract from the real questions. Here&#8217;s how to use the Bootstrap in R instead</p>\n<p><i>This post was first published on <a href=\"https://towardsdatascience.com/ditch-p-values-use-bootstrap-confidence-intervals-instead-bba56322b522\" rel=\"noopener\" target=\"_blank\">Towards Data Science</a> and is based on my book &#8220;Behavioral Data Analysis with R and Python&#8221;</I></p>\n<p>A few years ago, I was hired by one of the largest insurance companies in the US to start and lead their behavioral science team. I had a PhD in behavioral economics from one of the top 10 economics departments in the world and half a decade of experience as a strategy consultant, so I was confident my team would be able to drive business decisions through well-crafted experiments and data analyses.<br />\nAnd indeed, I worked with highly-skilled data scientists who had a very sharp understanding of statistics. But after years of designing and analyzing experiments, I grew dissatisfied with the way we communicated results to decision-makers. I felt that the over-reliance on p-values led to sub-optimal decisions. After talking to colleagues in other companies, I realized that this was a broader problem, and I set up to write <a href=\"https://amzn.to/3mRcHyS\" rel=\"noopener\" target=\"_blank\">a guide to better data analysis</a>. In this article, I&#8217;ll present one of the biggest recommendations of the book, which is to ditch p-values and use Bootstrap confidence intervals instead.</p>\n<h2>Ditch p-values</h2>\n<p>There are many reasons why you should abandon p-values, and I&#8217;ll examine three of the main ones here:</p>\n<ul>\n<li>They don&#8217;t mean what people think they mean</li>\n<li>They rely on hidden assumptions that are unlikely to be fulfilled</li>\n<li>They detract from the real questions</li>\n</ul>\n<h3>1. They don&#8217;t mean what people think they mean</h3>\n<p>When you&#8217;re running applied data analyses, whether in the private, non-profit or public sectors, your goal is to inform decisions. A big part of the problem we need to solve is uncertainty: the data tells us that the number is 10, but could it be 5 instead? Maybe 100? Can we rely on the number that the data analysis spouted? After years, sometimes decades, of educating business partners on the matter, they generally understand the risks of uncertainty. Unfortunately, they often jump from there to assuming that the p-value represents the probability that a result is due to chance: a p-value of 0.03 would mean that there&#8217;s a 3% chance a number we thought were positive is indeed null or negative. It does not. In fact, it represents the probability of seeing the result we saw assuming that the real value is indeed zero.<br />\nIn scientific jargon, the real value being zero or negative is called the null hypothesis (abbreviated H0), and the real value being strictly above zero is called the alternative hypothesis (abbreviated H1). People mistakenly believe that the p-value is the probability of H0 given the data, P(H0|data), when in reality it is the probability of the data given H0, P(data|H0). You may be thinking: potato po-tah-to, that&#8217;s hair splitting and a very small p-value is indeed a good sign that a result is not due to chance. In many circumstances, you&#8217;ll be approximately correct, but in some cases, you&#8217;ll be utterly wrong.<br />\nLet&#8217;s take a simplified but revealing example: we want to determine Robert&#8217;s citizenship. Null hypothesis: H0, Robert is a US citizen. Alternative hypothesis: H1, he is not. Our data: we know that Robert is a US senator. There are 100 senators out of 330 million US citizens, so under the null hypothesis, the probability of our data (i.e., the p-value) is 100 / 300,000,000 ≈ 0.000000303. Per the rules of statistical significance, we can safely conclude that our null hypothesis is rejected and Robert is not a US citizen. That&#8217;s obviously false, so what went wrong? The probability that Robert is a US senator is indeed very low if he is a US citizen, but it&#8217;s even lower if he is not (namely zero!). P-values cannot help us here, even with a stricter 0.01 or even 0.001 threshold (for an alternative illustration of this problem, see <a href=\"https://xkcd.com/1132/\">xkcd</a>).</p>\n<h3>2. They rely on hidden assumptions</h3>\n<p>P-values were invented at a time when all calculations had to be done by hand, and so they rely on simplifying statistical assumption. Broadly speaking, they assume that the phenomenon you&#8217;re observing obeys some regular statistical distribution, often the normal distribution (or a distribution from the same family). Unfortunately, that&#8217;s rarely true²:</p>\n<ul>\n<li>Unless you&#8217;re measuring some low-level psycho-physiological variable, your population of interest is generally made up of heterogeneous groups. Let&#8217;s say you&#8217;re a marketing manager for Impossible Burgers looking at the demand for meat substitutes. You would have to account for two groups: on the one hand, vegetarians, for whom the relevant alternative is a different vegetarian product; on the other hand, meat eaters, who can be enticed but will care much more about taste and price compared to meat itself.</li>\n<li>A normal distribution is symmetrical and extends to infinity in both directions. In real life, there are asymmetries, threshold and limits. People never buy negative quantities, nor infinite ones. They don&#8217;t vote at all before they&#8217;re 18 and the market of 120-year-old is much narrower than the market for 90-year-old and 60-year-old would suggest.</li>\n<li>Conversely, we see &#8220;fat-tailed&#8221; distributions, where extreme values are much more frequent than expected from a normal distribution. There are more multi-billionaires than you would expect from looking at the number of millionaires and billionaires.</li>\n</ul>\n<p>This implies that the p-values coming from a standard model are often wrong. Even if you correctly treat them as P(data|H0) and not P(H0|data), they&#8217;ll often be significantly off.</p>\n<h3>3. They detract from the real questions</h3>\n<p>Let&#8217;s say that you have taken to heart the two previous issues and built a complete Bayesian model that finally allows you to properly calculate P(H0|data), the probability that the real value is zero or negative given the observed data. Should you bring it to your decision-maker? I would argue that you shouldn&#8217;t, because it doesn&#8217;t reflect economic outcomes.<br />\nLet&#8217;s say that a business decision-maker is pondering two possible actions, A and B. Based on observed data, the probability of zero or negative benefits is:</p>\n<ul>\n<li>0.08 for action A</li>\n<li>0.001 for action B</li>\n</ul>\n<p>Should the decision-maker pick action B based on these numbers? What if I told you that the corresponding 90% confidence intervals are:</p>\n<ul>\n<li>[-$0.5m; $99.5m] for action A</li>\n<li>[$0.1m; $0.2m] for action B</li>\n</ul>\n<p>Action B may have a lower probability of leading to a zero or negative outcome, but its expected value for the business is much lower, unless the business is incredibly risk-averse. In most situations, &#8220;economic significance&#8221; for a decision-maker hangs on two questions:<br />\nHow much money are we likely to gain? (aka, the expected value)<br />\nIn a &#8220;reasonably-likely worst-case scenario&#8221;, how much money do we stand to lose? (aka, the lower bound of the confidence interval)<br />\nConfidence intervals are a much better tool to answer these questions than a single probability number.</p>\n<h2>Use the Bootstrap instead</h2>\n<p>Let&#8217;s take a concrete example, adapted and simplified from my book¹. A company has executed a time study of how long it takes its bakers to prepare made-to-order cakes depending on their level of experience. Having an industrial engineer measure how long it takes to make a cake in various stores across the country is expensive and time-consuming, so the data set has only 10 points, as you can see in the following figure.<br />\n<a href=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-1.png\"><img src=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-1.png\" alt=\"Scatterplot of baking time vs months of experience\" width=\"700\" height=\"432\" class=\"aligncenter size-full wp-image-31742\" srcset=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-1.png 700w, https://datascienceplus.com/wp-content/uploads/2021/11/fig7-1-490x302.png 490w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></p>\n<p>In addition to the very small size of the sample, it contains an an outlier, in the upper left corner: a new employee spending most of a day working on a complex cake for a corporate retreat. How should the data be reported to business partners? One could discard the extreme observation. But that observation, while unusual, is not an aberration per se. There was no measurement error, and those circumstances probably occur from time to time. An other option would be to only report the overall mean duration, 56 minutes, but that would also be misleading because it would not convey the variability and uncertainty in the data.<br />\nAlternatively, one could calculate a normal confidence interval (CI) based on the traditional statistical assumptions. Normal confidence intervals are closely linked to the p-value: an estimate is statistically significant if and only if the corresponding confidence interval does not include zero. As you&#8217;ll learn in any stats class, the lower limit of a normal 95%-CI is equal to the mean minus 1.96 times the standard error, and the upper limit is equal to the mean plus 1.96 times the standard error. Unfortunately, in the present case the confidence interval is [-23;135] and we can imagine that business partners would not take too kindly to the possibility of negative baking duration…<br />\nThis issue comes from the assumption that baking times are normally distributed, which they are obviously not. One could try to fit a better distribution, but using a Bootstrap confidence interval is much simpler.</p>\n<p><3>1. The Bootstrap works by drawing with replacement</3><br />\nTo build Bootstrap confidence intervals, you simply need to build &#8220;a lot of similar samples&#8221; by drawing with replacement from your original sample. Drawing with replacement is very simple in R, we just set &#8220;replace&#8221; to true:<br />\n<code>boot_dat <- slice_sample(dat, n=nrow(dat), replace = TRUE)</code><br />\n<i>Why are we drawing with replacement? To really grasp what&#8217;s happening with the Bootstrap, it&#8217;s worth taking a step back and remembering the point of statistics: we have a population that we cannot fully examine, so we&#8217;re trying to make inferences about this population based on a limited sample. To do so, we create an &#8220;imaginary&#8221; population through either statistical assumptions or the Bootstrap. With statistical assumptions we say, &#8220;imagine that this sample is drawn from a population with a normal distribution,&#8221; and then make inferences based on that. With the Bootstrap we&#8217;re saying, &#8220;imagine that the population has exactly the same probability distribution as the sample,&#8221; or equivalently, &#8220;imagine that the sample is drawn from a population made of a large (or infinite) number of copies of that sample.&#8221; Then drawing with replacement from that sample is equivalent to drawing without replacement from that imaginary population. As statisticians will say, &#8220;the Bootstrap sample is to the sample what the sample is to the population.&#8221;</i></p>\n<p>We repeat that process many times (let&#8217;s say 2,000 times):<br />\n<code>mean_lst <- list()<br />\nB <- 2000<br />\nN <- nrow(dat)<br />\nfor(i in 1:B){<br />\n boot_dat <- slice_sample(dat, n=N, replace = TRUE)<br />\n M <- mean(boot_dat$times)<br />\n mean_lst[[i]] <- M}<br />\nmean_summ <- tibble(means = unlist(mean_lst))</code><br />\nThe result of the procedure is a list of Bootstrap sample means, which we can plot with an histogram:<br />\n<a href=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-2.png\"><img src=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-2.png\" alt=\"Histogram of Bootstrap sample means\" width=\"700\" height=\"432\" class=\"aligncenter size-full wp-image-31745\" srcset=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-2.png 700w, https://datascienceplus.com/wp-content/uploads/2021/11/fig7-2-490x302.png 490w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a><br />\nAs you can see, the histogram is very irregular: there is a peak close to the mean of our original data set along with smaller peaks corresponding to certain patterns. Given how extreme our outlier is, each of the seven peaks corresponds to its number of repetitions in the Bootstrap sample, from zero to six. In other words, it doesn&#8217;t appear at all in the samples whose means are in the first (leftmost) peak, it appears exactly once in the samples whose means are in the second peak, and so on.</p>\n<h3>2. Calculating the confidence interval from the Bootstrap samples</h3>\n<p>From there, we can calculate the Bootstrap confidence interval (CI). The bounds of the CI are determined from the empirical distribution of the preceding means. Instead of trying to fit a statistical distribution (e.g., normal), we can simply order the values from smallest to largest and then look at the 2.5% quantile and the 97.5% quantile to find the two-tailed 95%-CI. With 2,000 samples, the 2.5% quantile is equal to the value of the 50th smallest mean (because 2,000 * 0.025 = 50), and the 97.5% quantile is equal to the value of the 1950th mean from smaller to larger, or the 50th largest mean (because both tails have the same number of values). Fortunately, we don&#8217;t have to calculate these by hand:<br />\n<code>LL_b <- as.numeric(quantile(mean_summ$means, c(0.025)))<br />\nUL_b <- as.numeric(quantile(mean_summ$means, c(0.975)))</code><br />\nThe following figure shows the same histogram as before but adds the mean of the means, the normal CI bounds and the Bootstrap CI bounds.</p>\n<p><a href=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-3.png\"><img src=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-3.png\" alt=\"Histogram of Bootstrap sample means\" width=\"700\" height=\"432\" class=\"aligncenter size-full wp-image-31746\" srcset=\"https://datascienceplus.com/wp-content/uploads/2021/11/fig7-3.png 700w, https://datascienceplus.com/wp-content/uploads/2021/11/fig7-3-490x302.png 490w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a> </p>\n<p>Distribution of the means of 2,000 samples, with mean of the means (thick blue line), normal 95%-CI bounds (dotted black lines), and Bootstrap CI bounds (dashed blue lines)[/caption]<br />\nThe Bootstrap 95%-CI is [7.50; 140.80] (plus or minus some sampling difference), which is much more realistic. No negative values as with the normal assumptions!</p>\n<h3>3. The Bootstrap is more flexible and relevant for business decisions</h3>\n<p>Once you start using the Bootstrap, you&#8217;ll be amazed at its flexibility. Small sample size, irregular distributions, business rules, expected values, A/B tests with clustered groups: the Bootstrap can do it all!<br />\nLet&#8217;s imagine, for example, that the company in our previous example is considering instituting a time promise - &#8221;your cake in three hours or 50% off&#8221; - and wants to know how often a cake currently takes more than three hours to be baked. Our estimate would be the sample percentage: it happens in 1 of the 10 observed cases, or 10%. But we can&#8217;t leave it at that, because there is significant uncertainty around that estimate, which we need to convey. Ten percent out of 10 observations is much more uncertain than 10% out of 100 or 1,000 observations. So how could we build a CI around that 10% value? With the Bootstrap, of course!<br />\nThe histogram of Bootstrap estimates also offers a great visualization to show business partners: &#8220;This vertical line is the result of the actual measurement, but you can also see all the possible values it could have taken&#8221;. The 90% or 95% lower bound offers a &#8220;reasonable worst case scenario&#8221; based on available information.<br />\nFinally, if your boss or business partners are dead set on p-values, the Bootstrap offers a similar metric, the Achieved Significance Level (ASL). The ASL is simply the percentage of Bootstrap values that are zero or less. That interpretation is very close to the one people wrongly assign to the p-value, so there&#8217;s very limited education needed: <i>&#8220;the ASL is 3% so there&#8217;s a 3% chance that the true value is zero or less; the ASL is less than 0.05 so we can treat this result as significant&#8221;.</i></p>\n<h2>Conclusion</h2>\n<p>To recap, even though p-values remain ubiquitous in applied data analysis, they have overstayed their welcome. They don&#8217;t mean what people generally think they mean; and even if they did, that&#8217;s not the answer that decision-makers are looking for. Even in academia, there&#8217;s currently a strong push towards reducing the blind reliance on p-values (see the ASA statement below⁴).<br />\nUsing Bootstrap confidence intervals is both easier and more compelling. They don&#8217;t rely on hidden statistical assumptions, only on a straightforward one: the overall population looks the same as our sample. They provide information on possible outcomes that is richer and more relevant to business decisions.</p>\n<h3>But wait, there&#8217;s more!</h3>\n<p>Here comes the final shameless plug. If you want to learn more about the Bootstrap, my book will show you:</p>\n<ul>\n<li>How to determine the number of Bootstrap samples to draw;</li>\n<li>How to apply the Bootstrap to regression, A/B test and ad-hoc statistics;</li>\n<li>How to write high-performance code that will not have your colleagues snickering at your FOR loops;</li>\n<li>And a lot of other cool things about analyzing customer data in business.</li>\n</ul>\n<p><a href=\"https://datascienceplus.com/wp-content/uploads/2021/11/Book_cover.jpeg\"><img src=\"https://datascienceplus.com/wp-content/uploads/2021/11/Book_cover.jpeg\" alt=\"Cover of book \"Behavioral Data Analysis with R and Python\"\" width=\"500\" height=\"656\" class=\"aligncenter size-full wp-image-31747\" srcset=\"https://datascienceplus.com/wp-content/uploads/2021/11/Book_cover.jpeg 500w, https://datascienceplus.com/wp-content/uploads/2021/11/Book_cover-373x490.jpeg 373w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></p>\n<h3>References</h3>\n<p>[1] F. Buisson, <a href=\"https://amzn.to/3mRcHyS\" rel=\"noopener\" target=\"_blank\">Behavioral Data Analysis with R and Python (2021)</a>. My book, obviously! The code for the example is available on the book&#8217;s <a href=\"https://github.com/FlorentBuissonOReilly/BehavioralDataAnalysis\">Github repo</a>.<br />\n[2] R. Wilcox, <a href=\"https://smile.amazon.com/Fundamentals-Modern-Statistical-Methods-Substantially/dp/1441955240/\" rel=\"noopener\" target=\"_blank\">Fundamentals of Modern Statistical Methods: Substantially Improving Power and Accuracy (2010)</a>. We routinely assume that our data is normally distributed &#8220;enough.&#8221; Wilcox shows that this is unwarranted and can severely bias analyses. A very readable book on an advanced topic.<br />\n[3] See my earlier post on Medium <a href=\"https://medium.com/behavior-design-hub/is-your-behavioral-data-truly-behavioral-efb258a24a6c\" rel=\"noopener\" target=\"_blank\">&#8220;Is Your Behavioral Data Truly Behavioral?&#8221;</a>.<br />\n[4] R. L. Wasserstein & N. A. Lazar (2016) <a href=\"https://amstat.tandfonline.com/doi/pdf/10.1080/00031305.2016.1154108?needAccess=true&\" rel=\"noopener\" target=\"_blank\">&#8220;The ASA Statement on p-Values: Context, Process, and Purpose&#8221;</a>, The American Statistician, 70:2, 129–133, DOI:10.1080/00031305.2016.1154108.</p>\n<strong><p>Related Post</p></strong><ul><li><a href=\"https://datascienceplus.com/an-r-alternative-to-pairs-for-omics-qc/\" rel=\"bookmark\" title=\"Permanent Link toAn R alternative to pairs for -omics QC\">An R alternative to pairs for -omics QC</a></li><li><a href=\"https://datascienceplus.com/how-i-selected-my-starting-word-for-wordle-using-simulations-and-r/\" rel=\"bookmark\" title=\"Permanent Link toHow I selected my starting word for Wordle using simulations and R\">How I selected my starting word for Wordle using simulations and R</a></li><li><a href=\"https://datascienceplus.com/introduction-for-decision-tree/\" rel=\"bookmark\" title=\"Permanent Link toIntroduction for Decision Tree\">Introduction for Decision Tree</a></li><li><a href=\"https://datascienceplus.com/correlation-vs-pps-in-python/\" rel=\"bookmark\" title=\"Permanent Link toCorrelation vs PPS in Python\">Correlation vs PPS in Python</a></li><li><a href=\"https://datascienceplus.com/earthquake-analysis-4-4-cluster-analysis/\" rel=\"bookmark\" title=\"Permanent Link toEarthquake Analysis (4/4): Cluster Analysis\">Earthquake Analysis (4/4): Cluster Analysis</a></li></ul>",
  "wfw:commentRss": "https://datascienceplus.com/ditch-p-values-use-bootstrap-confidence-intervals-instead/feed/",
  "slash:comments": 0
}