{
  "title": "Emmy Award Winner’s Algorithms Bring High-Quality Video to Your TV",
  "link": "https://spectrum.ieee.org/alan-bovik-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/portrait-of-alan-bovik.jpg?id=30849849&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p><a href=\"https://ethw.org/Alan_Conrad_Bovik\" rel=\"noopener noreferrer\" target=\"_blank\">Alan Conrad Bovik</a>’s passion for science fiction inspired him to pursue a career in engineering. His favorite sci-fi authors when he was young were <a href=\"https://en.wikipedia.org/wiki/Arthur_C._Clarke\" rel=\"noopener noreferrer\" target=\"_blank\">Arthur C. Clarke</a>, who penned <em>2001: A Space Odyssey,</em> and <a href=\"https://en.wikipedia.org/wiki/Isaac_Asimov\" rel=\"noopener noreferrer\" target=\"_blank\">Isaac Asimov</a>, author of the Foundation series. Bovik says they wrote from a “very scientific point of view”—which made him want to help develop aerospace technology that would send humans “to other worlds.”</p><p>But he decided to study nuclear engineering in school—which then seemed like the future of energy. He discovered, however, that he didn't like the subject because it “required too much chemistry and memorization,” he says with a laugh. When he took a course in computer programming, he fell in love with it and ended up changing his major to computer engineering.</p><hr/><p>While pursuing a Ph.D. at the <a href=\"https://illinois.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Illinois Urbana-Champaign,</a> Bovik found his calling: digital image processing. It is a technology, he says, that back then didn’t have many applications and seemed like something out of a sci-fi novel. </p><p>The IEEE Fellow has since done groundbreaking work in the field.</p><p>He created theoretical models of how people will perceive the quality of an image or video after it has been compressed. He has used the models to develop algorithms that automatically measure picture quality.</p><h3>ABOUT ALAN BOVIK</h3><br/><p>\n<strong>Employer:</strong> University of Texas\n</p><p>\n<strong>Title:</strong> Professor of engineering\n</p><p>\n<strong>Member grade: </strong>Fellow\n</p><p>\n<strong>Alma mater: </strong>University of Illinois\n</p><p>\n<strong>What TV shows or movies have you watched and enjoyed recently?</strong> “The Vikings” and “The Last Kingdom”\n</p><p>\n<strong>What book would you recommend to others?</strong> <em>The Fifth Season</em> by N.K. Jemisin\n</p><p><strong>If you weren’t an engineer, what would be your job?</strong> Neuroscientist or cinematographer</p><p>Programs he helped develop include the <a href=\"https://en.wikipedia.org/wiki/Structural_similarity\" rel=\"noopener noreferrer\" target=\"_blank\">Structural SIMilarity</a> (SSIM) index, the MOtion-tuned Video Integrity Evaluation (<a href=\"https://en.wikipedia.org/wiki/MOVIE_Index\" rel=\"noopener noreferrer\" target=\"_blank\">MOVIE</a>) index, <a href=\"https://en.wikipedia.org/wiki/Visual_Information_Fidelity\" rel=\"noopener noreferrer\" target=\"_blank\">visual information fidelity</a> algorithms, and the Video Multimethod Assessment Fusion (<a href=\"https://en.wikipedia.org/wiki/VMAF\" rel=\"noopener noreferrer\" target=\"_blank\">VMAF</a>) metric. His video quality prediction technology is used by streaming services, broadcasting companies, movie studios, and technology companies worldwide. </p><p>Bovik has received several awards for his work. The <a href=\"https://www.emmys.com/academy\" rel=\"noopener noreferrer\" target=\"_blank\">Academy of Television Arts and Sciences</a> honored him in 2015 with a <a href=\"http://live.ece.utexas.edu/emmy_award.php#:~:text=Professor%20Al%20Bovik%20and%20two,Development%20from%20the%20Television%20Academy.\" rel=\"noopener noreferrer\" target=\"_blank\">Primetime Emmy for Outstanding Achievement in Engineering Development</a> and with a 2020 <a href=\"https://theemmys.tv/tech/\" rel=\"noopener noreferrer\" target=\"_blank\">Technology and Engineering Emmy</a>. IEEE recognized Bovik with this year’s <a href=\"https://corporate-awards.ieee.org/award/ieee-edison-medal/\" rel=\"noopener noreferrer\" target=\"_blank\">Edison Medal</a> “for pioneering high-impact scientific and engineering contributions leading to the perceptually optimized global streaming and sharing of visual media.” The award is sponsored by <a href=\"https://www.samsung.com/us/aboutsamsung/home/\" rel=\"noopener noreferrer\" target=\"_blank\">Samsung Electronics Co.</a></p><p>“The IEEE Edison Medal is the most important award I’ve received,” he says, “because of its history, the amazing past recipients, and because it’s from my peers.”</p><p>For nearly 40 years, he has been a professor of electrical and computer engineering at the <a href=\"https://www.utexas.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Texas</a> <a href=\"https://cockrell.utexas.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Cockrell School of Engineering</a>, in Austin. He serves as director of Cockrell’s <a href=\"https://live.ece.utexas.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Laboratory for Image and Video Engineering</a>, where graduate students and faculty members develop psychometric databases, theories, and algorithms to advance modern perceptual video processing technologies.</p><p>Bovik says he plans to remain at the university for another 40 years because “being an educator and video research is the best.”</p><p>“I didn't really know how much I would enjoy the academic experience until I started teaching,” he says. </p><h2>Developing the SSIM index</h2><p>At the University of Illinois, Bovik took a class on digital image processing taught by <a href=\"https://ethw.org/Oral-History:Thomas_Huang\" rel=\"noopener noreferrer\" target=\"_blank\">Thomas Huang</a>, a professor of electrical and computer engineering. The IEEE Life Fellow was a pioneer in computer vision, image processing, and image compression. </p><p>Bovik enjoyed the course so much that he joined Huang’s <a href=\"http://ifp-uiuc.github.io/\" rel=\"noopener noreferrer\" target=\"_blank\">Image Formation and Processing Group</a>, part of the university’s <a href=\"https://beckman.illinois.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Beckman Institute for Advanced Science and Technology</a>. The group conducted research in image and video coding, computer vision, pattern recognition, and machine learning. The professor became one of Bovik’s doctoral advisors. Bovik’s research focused on nonlinear statistical methods for image analysis and enhancement.</p><p>Huang suggested that Bovik consider applying for a job at the University of Texas after he graduated because he thought “it had a great future.” Bovik took his mentor’s advice and moved to Texas in 1984 to work for the Austin school as an assistant professor.</p><p>Bovik soon became interested in visual neuroscience and how it could be applied to video engineering. He spoke with several visual neuroscientists and visual psychologists to gain a better understanding of the brain’s visual cortex, which receives, integrates, and processes visual information. Bovik and his team of researchers created mathematical models of the visual cortex as well as the retina, which converts light into neural signals and sends them to the brain.</p><p class=\"pull-quote\">“The IEEE Edison Medal is the most significant award I’ve received because it’s an award from my peers.”</p><p>In the early 2000s, he began studying how people perceive distortions—such as blurring, resizing, and noise—in pictures and videos, as video compression was becoming important because of digital television.</p><p>Video images take up a lot of space, and because bandwidth is limited, videos generally need to be compressed before being distributed. But the process can distort the images, causing people to perceive them as blurry or jagged. At the time, there was no program that could accurately predict how badly the images would be distorted before they were distributed, Bovik says, because the algorithms in use didn’t account for how people perceive the images. </p><p>Using the mathematical models he and his team previously developed, they created computational algorithms that accurately gauged the way humans would see distortions in compressed images. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"portrait of 3 people on a step and repeat background with edison medal\" class=\"rm-shortcode\" data-rm-shortcode-id=\"66428339401d6aee0202e054597ead70\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"32558\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/portrait-of-3-people-on-a-step-and-repeat-background-with-edison-medal.jpg?id=30849889&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Bovik with IEEE President Ray Liu [left] and President-Elect Saifur Rahman at the IEEE Honors Ceremony held in San Diego in May.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Alan Bovik</small></p><p>Bovik says the key to creating the algorithms was understanding how people process visual information when they first see an image.</p><p>“If an image is blurry, you don't have to think about it,” he says. “You sense that it’s blurry instantly.”</p><p>In 2001 he and his team developed SSIM. The program predicts how people will perceive a compressed image on a screen by measuring three factors: luminance masking (distortion visibility depending on an image’s brightness), contrast masking (distortion visibility depending on an image’s texture), and structural similarity.</p><p>If SSIM predicts an image will appear distorted, the errors can be fixed before the image is shared.</p><p>The algorithm has since become part of the <a href=\"https://www.itu.int/\" rel=\"noopener noreferrer\" target=\"_blank\">International Telecommunication Union</a>’s<a href=\"https://nisp.nw3.dk/standard/itu-t-h.264.html\" rel=\"noopener noreferrer\" target=\"_blank\"> H.264 video coding reference software standard</a>. The standard allows streaming services, broadcasting companies, and technology companies to include the program in their products and services.</p><h2>Preparing for the metaverse</h2><p>Bovik continues to develop algorithms for image processing and video quality assessment. He and his team are working with<a href=\"https://about.facebook.com/\" rel=\"noopener noreferrer\" target=\"_blank\"> Meta</a>’s<a href=\"https://en.wikipedia.org/wiki/Reality_Labs\" rel=\"noopener noreferrer\" target=\"_blank\"> Reality Labs</a> to develop an algorithm to be used in the metaverse, a <a href=\"https://about.fb.com/news/2021/10/founders-letter/\" rel=\"noopener noreferrer\" target=\"_blank\">simulated “embodied internet”</a> experienced in 3D, as defined by Meta founder <a href=\"https://www.forbes.com/profile/mark-zuckerberg/\" rel=\"noopener noreferrer\" target=\"_blank\">Mark Zuckerberg</a>. Virtual and augmented reality will let users feel as if they can move through space at will and pick up objects with ease, Zuckerberg says.</p><p class=\"pull-quote\">“Back in 1991, when we formed <em>Transactions</em>, not many people understood image processing. It seemed like something out of a science-fiction novel. But things have changed, and now it’s everywhere.”</p><p>“Nobody can predict how quickly the metaverse will be upon us,” Bovik says, “but it introduces all kinds of new challenges that are related to visual neuroscience.” The metaverse will require high-resolution images, he says, because the viewer’s eyes are centimeters away from the augmented-reality technology displays.</p><p>By developing perception-based algorithms, Bovik says, he hopes to “perceptually optimize the way videos are transmitted, compressed, and displayed in VR and AR.” </p><h2>Image processing at IEEE</h2><p>Bovik says he joined IEEE as a student member so he could access the organization’s journals. Maintaining that access is why he continues to be a member, he says.</p><p>He frequently attends IEEE conferences, where he has met engineers who have become his lifelong friends and mentors, he says. He often brings his students along. “I used to call the opportunity to go to a conference with me the <em>Alan Bovik Motivational System</em>,” he says, laughing.</p><p>Because he believed that image processing was going to have “a great feature,” he says, he helped launch the <a href=\"https://2022.ieeeicip.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE International Conference on Image Processing</a> and the <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=83\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Transactions on Image Processing</em></a>. He is the publication’s longest-serving editor-in-chief.</p><p>“When I helped form <em>Transactions </em>in 1991, not many people understood the future applications of image processing,” Bovik says. “The technology seemed like something out of a science-fiction novel, but now it’s everywhere.”</p>",
  "pubDate": "Tue, 16 Aug 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/alan-bovik-profile",
  "category": [
    "Ieee member news",
    "Profiles",
    "Image processing",
    "Video compression",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}