{
  "title": "ZBT's Best of 2019",
  "description": "<p><p>Listen up platoon: This is our Best of 2019. The Top 10 segments from the past year. In no particular order except for which they appear in the pod:</p>1) The squad went to Fort Bragg and some Commanding General tried to fuck all our shit up. Then we talked about the time a Cpl emailed the Commandant for funsies.  2) Astronaut Scott Kelly agreed to do an interview so he could surprise us by reading an old Barstool blog about how hot his wife is compared to how ugly he is. Our pal Feitelberg comes on afterwards to explain himself.  3) RIP Doris.  4) A probe into 2017 USS Fitzgerald collision reveals harsh conditions of the ship. That shit was gross. 5) Cancel The Code 6) Remember the time one LCpl tried to take out the entire cartel by himself?. Us too, and this is the first time the 'LCpl voice' is used on show 7)  A Milfur went viral for participating an award ceremony dressed in their furry outfit. Kate fell down a furry rabbithole and hasn't been the same since.  8) Five veterans were among group of 8 arrested in Haiti, and they couldn't lie their way out of trouble. Also don't mess with the Serbians 9) Wearing pajamas to chow hall while the Commandant is on base was one of the best stories of the year. Our LCpl underground tells us what really happened at Camp Lejeune 10) Chaps basically becomes Varys from Game of Thrones. His little birds sing him a song from the Air Force's 735th Squadron at Hickam AFB. We've got one motivator who sick of everyone's shit so he takes an ALL CAPS dump on the entire unit's chest. Thanks for a great 2019 and happy holidays from the entire squad. Make sure to tell your friends about us so you have more people to share the laughs with in 2020!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "7ddcad98-4047-45f9-ae7f-cd86bb2401fa",
  "pubDate": "Mon, 23 Dec 2019 08:15:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "02:08:28",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}