{
  "title": "The Vacuum Tube’s Forgotten Rival",
  "link": "https://spectrum.ieee.org/the-vacuum-tubes-forgotten-rival",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-an-older-woman-in-front-of-an-early-generation-computer.jpg?id=29534788&width=1200&height=800&coordinates=0%2C0%2C84%2C0\"/><br/><br/><p>\n<strong>During the Second </strong>World War, the German military developed what were at the time some very sophisticated technologies, including the \n\t<a href=\"https://en.wikipedia.org/wiki/V-2_rocket\" target=\"_blank\">V-2 rockets</a> it used to rain destruction on London. Yet the V-2, along with much other German military hardware, depended on an obscure and seemingly antiquated component you’ve probably never heard of, something called the magnetic amplifier or mag amp.\n</p><p>\n\tIn the United States, mag amps had long been considered obsolete—“too slow, cumbersome, and inefficient to be taken seriously,” according to one source. So U.S. military-electronics experts of that era were baffled by the extensive German use of this device, which they first learned about from interrogating German prisoners of war. What did the Third Reich’s engineers know that had eluded the Americans?\n</p><hr/><p>\n\tAfter the war, U.S. intelligence officers scoured Germany for useful scientific and technical information. Four hundred experts sifted through billions of pages of documents and shipped 3.5 million microfilmed pages back to the United States, along with almost 200 tonnes of German industrial equipment. Among this mass of information and equipment was the secret of Germany’s magnetic amplifiers: metal alloys that made these devices compact, efficient, and reliable.\n</p><p>\n\tU.S. engineers were soon able to reproduce those alloys. As a result, the 1950s and ’60s saw a renaissance for magnetic amplifiers, during which they were used extensively in the military, aerospace, and other industries. They even appeared in some early solid-state digital computers before giving way entirely to transistors. Nowadays, that history is all but forgotten. So here I’ll offer the little-known story of the mag amp.\n</p><p>\n\tAn amplifier, by \n\t<span style=\"background-color: initial;\">definition, is a device that allows a small signal to control a larger one. An old-fashioned </span><a href=\"https://en.wikipedia.org/wiki/Triode\" rel=\"noopener noreferrer\" target=\"_blank\">triode</a> vacuum tube does that using a voltage applied to its grid electrode. A modern <a href=\"https://en.wikipedia.org/wiki/Field-effect_transistor\" rel=\"noopener noreferrer\" target=\"_blank\">field-effect transistor</a> does it using a voltage applied to its gate. The mag amp exercises control electromagnetically.\n</p><div class=\"ieee-sidebar-medium\">\n<p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A photo of a rocket on a launcher with trees in the background. \" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"1ed9632956d30a79a7b69ee12ff8b394\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"aa0d5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-rocket-on-a-launcher-with-trees-in-the-background.jpg?id=29583518&width=980\" style=\"max-width: 100%\"/>\n</p>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A photo of a man sitting at an early computer next to a typewriter.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"6bd9ace981c115f2a72aa816d082e1d8\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"cd239\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-of-a-man-sitting-at-an-early-computer-next-to-a-typewriter.jpg?id=29583522&width=980\" style=\"max-width: 100%\"/>\n</p>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A photo of two men sitting at a terminal in front of an early computer.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"41a4d01ff0ce2791a10a83f65a75009c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"81829\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-of-two-men-sitting-at-a-terminal-in-front-of-an-early-computer.png?id=29583533&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Magnetic amplifiers were used for a variety of applications, including in the infamous V-2 rockets [top] that the Germany military employed during the Second World War and in the Magstec computer [middle], completed in 1956. The British Elliot 803 computer of 1961 [bottom] used related core-transistor logic.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">From top: Fox photos/Getty Images; Remington Rand Univac; Smith Archive/Alamy</small>\n</p>\n</div><p>\n\tTo understand how it works, first consider a simple inductor, say, a wire coiled around an iron rod. Such an inductor will tend to block the flow of alternating current through the wire. That’s because when current flows, the coil creates an alternating magnetic field, concentrated in the iron rod. And that varying magnetic field induces voltages in the wire that act to oppose the alternating current that created the field in the first place.\n</p><p>\n\tIf such an inductor carries a lot of current, the rod can reach a state called saturation, whereby the iron cannot become any more magnetized than it already is. When that happens, current passes through the coil virtually unimpeded. Saturation is usually undesirable, but the mag amp exploits this effect.\n</p><p>\n\tPhysically, a magnetic amplifier is built around a metallic core of material that can easily be saturated, typically a ring or square loop with a wire wrapped around it. A second wire also wrapped around the core forms a control winding. The control winding includes many turns of wire, so by passing a relatively small direct current through it, the iron core can be forced into or out of saturation.\n</p><p>\n\tThe mag amp thus behaves like a switch: When saturated, it lets the AC current in its main winding pass unimpeded; when unsaturated, it blocks that current. Amplification occurs because a relatively small DC control current can modify a much larger AC load current.\n</p><p>\n\tThe history of magnetic amplifiers starts in the United States with some patents filed in 1901. By 1916, large magnetic amplifiers were being used for transatlantic radio telephony, carried out with an invention called an \n\t<a href=\"https://en.wikipedia.org/wiki/Alexanderson_alternator\" target=\"_blank\">Alexanderson alternator</a>, which produced a high-power, high-frequency alternating current for the radio transmitter. A magnetic amplifier <a href=\"https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=1645957\" target=\"_blank\">modulated the output of the transmitter</a> according to the strength of the voice signal to be transmitted.\n</p><p class=\"pull-quote\">\n\tOne Navy training manual of 1951 explained magnetic amplifiers in detail—although with a defensive attitude about their history.\n</p><p>\n\tIn the 1920s, improvements in vacuum tubes made this combination of Alexanderson alternator and magnetic amplifier obsolete. This left the magnetic amplifier to play only minor roles, such as for light dimmers in theaters.\n</p><p>\n\tGermany’s later successes with magnetic amplifiers hinged largely on the development of advanced magnetic alloys. A magnetic amplifier built from these materials switched sharply between the on and off states, providing greater control and efficiency. These materials were, however, exquisitely sensitive to impurities, variations in crystal size and orientation, and even mechanical stress. So they required an exacting manufacturing process.\n</p><p>\n\tThe best-performing German material, developed in 1943, was called Permenorm 5000-Z. It was an extremely pure fifty/fifty nickel-iron alloy, melted under a partial vacuum. The metal was then cold-rolled as thin as paper and wound around a nonmagnetic form. The result resembled a roll of tape, with thin Permenorm metal making up the tape. After winding, the module was annealed in hydrogen at 1,100 °C for 2 hours and then rapidly cooled. This process oriented the metal crystals so that they behaved like one large crystal with uniform properties. Only after this was done were wires wrapped around the core.\n</p><p>\n\tBy 1948, scientists at the U.S. \n\t<a href=\"https://en.wikipedia.org/wiki/Naval_Ordnance_Laboratory\" target=\"_blank\">Naval Ordnance Laboratory</a>, in Maryland, had figured out how to manufacture this alloy, which was soon marketed by <a href=\"https://dome.mit.edu/bitstream/handle/1721.3/38909/MC665_r04_E-422.pdf?sequence=1\" target=\"_blank\">an outfit called Arnold Engineering</a> Co. under the name Deltamax. The arrival of this magnetic material in the United States led to renewed enthusiasm for magnetic amplifiers, which tolerated extreme conditions and didn’t burn out like vacuum tubes. Mag amps thus found many applications in demanding environments, especially military, space, and industrial control.\n</p><p>\n\tDuring the 1950s, the U.S. military was using magnetic amplifiers in automatic pilots, fire-control apparatus, servo systems, radar and sonar equipment, the \n\t<a href=\"https://en.wikipedia.org/wiki/RIM-2_Terrier\" target=\"_blank\">RIM-2 Terrier surface-to-air missile</a>, and many other roles. One <a href=\"https://www.google.com/books/edition/Magnetic_Amplifiers/d74EGQAACAAJ?hl=en\" target=\"_blank\">Navy training manual</a> of 1951 explained magnetic amplifiers in detail—although with a defensive attitude about their history: “Many engineers are under the impression that the Germans invented the magnetic amplifier; actually it is an American invention. The Germans simply took our comparatively crude device, improved the efficiency and response time, reduced weight and bulk, broadened its field of application, and handed it back to us.”\n</p><p>\n\tThe U.S. space program also made extensive use of magnetic amplifiers because of their reliability. For example, the \n\t<a href=\"https://www.thespacereview.com/article/1836/1\" target=\"_blank\">Redstone rocket</a>, which launched Alan Shepard into space in 1961, used magnetic amplifiers. In the Apollo missions to the moon during the 1960s and ’70s, magnetic amplifiers controlled power supplies and fan blowers. Satellites of that era used magnetic amplifiers for signal conditioning, for current sensing and limiting, and for telemetry. Even the space shuttle used magnetic amplifiers to dim its fluorescent lights.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"The image shows a Redstone rocket at the launch pad, with three space-suit-wearing astronauts in the foreground.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"3acc7ce4aa3c310b496b4708af8b346a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"30a85\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-image-shows-a-redstone-rocket-at-the-launch-pad-with-three-space-suit-wearing-astronauts-in-the-foreground.png?id=29535245&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Magnetic amplifiers were also used in Redstone rockets, like the one shown here behind astronauts John Glenn, Virgil Grissom, and Alan Shepard.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Universal Images Group/Getty Images</small>\n</p><p>\n\tMagnetic amplifiers also found heavy use in industrial control and automation, with many products containing them being marketed under such brand names as General Electric’s \n\t<a href=\"https://ieeexplore.ieee.org/document/6444917\" target=\"_blank\">Amplistat</a>, CGS Laboratories’ <a href=\"https://www.steampoweredradio.com/jim%20garrett/manufacturers%20data/trak%20electronics/Trak%20Electronics%20Increductor%20Notes%20Number%201.pdf\" target=\"_blank\">Increductor</a>, Westinghouse’s <a href=\"https://worldradiohistory.com/Archive-Company-Publications/Westinghouse-Engineer/Westinghouse-Engineer-1955-07.pdf\" target=\"_blank\">Cypak</a> (cybernetic package), and <a href=\"https://en.wikipedia.org/wiki/Librascope\" target=\"_blank\">Librascope</a>’s Unidec (universal decision element).\n</p><p>\n<strong>The magnetic materials </strong>developed in Germany during the Second World War had their largest postwar impact of all, though, on the computer industry. In the late 1940s, researchers immediately recognized the ability of the new magnetic materials to store data. A circular magnetic core could be magnetized counterclockwise or clockwise, storing a 0 or a 1. Having what’s known as <a href=\"https://www.sciencedirect.com/science/article/pii/S1474667017702741\" target=\"_blank\">a rectangular hysteresis</a> loop ensured that the material would stay solidly magnetized in one of these states after power was removed.\n</p><p>\n\tResearchers soon constructed what was called core memory from dense grids of magnetic cores. And these technologists soon switched from using wound-metal cores to cores made from ferrite, a ceramic material containing iron oxide. By the mid-1960s, ferrite cores were stamped out by the billions as manufacturing costs dropped to a fraction of a cent per core.\n</p><p>\n\tBut core memory is not the only place where magnetic materials had an influence on early digital computers. The first generation of those machines, starting in the 1940s, computed using vacuum tubes. These were replaced in the late 1950s with a second generation based on transistors, followed by third-generation computers built from integrated circuits.\n</p><p class=\"pull-quote\">\n\tTransistors weren’t an obvious winner for early computers, and many other alternatives were developed, including magnetic amplifiers.\n</p><p>\n\tBut technological progress in computing wasn’t, in fact, this linear. Early transistors weren’t an obvious winner, and many other alternatives were developed. Magnetic amplifiers were one of several largely forgotten computing technologies that fell between the generations.\n</p><p>\n\tThat’s because researchers in the early 1950s realized that magnetic cores could not only hold data but also perform logic functions. By putting multiple windings around a core, inputs could be combined. A winding in the opposite direction could inhibit other inputs, for example. Complex logic circuits could be implemented by connecting such cores together in various arrangements.\n</p><div class=\"ieee-sidebar-medium\">\n<h3>How Magnetic Amplifiers Amplify</h3>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img class=\"rm-shortcode\" data-rm-shortcode-id=\"1857e348d612af7fb38b7d0ff9d762e1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b8e51\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.jpg?id=29585172&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The magnetic amplifier exploits the fact that the presence of magnetizable material [tan] in the core of an induction coil increases its impedance. Reducing the influence of that magnetic material by physically withdrawing it from a coil would reduce its impedance, allowing more power to flow to an AC load. </small>\n</p>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img class=\"rm-shortcode\" data-rm-shortcode-id=\"5985de901f75129578459c8e0f55b863\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4300c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.jpg?id=29583388&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The influence of a magnetizable material, here taking the form of a toroidal core [tan], can be changed by applying a DC bias using a second coil [left side of toroid]. Applying a DC bias current sufficient to force the material into a condition called saturation—a state in which it cannot become more magnetized—is functionally equivalent to removing the material from the coil, which allows more power to flow to the AC load.</small>\n</p>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"This sidebar contains three diagrams of increasing complexity showing how a magnetic amplifier works. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"2a07c3d4c6e405e4d8da473b3a390c23\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"33aa7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/this-sidebar-contains-three-diagrams-of-increasing-complexity-showing-how-a-magnetic-amplifier-works.jpg?id=29535276&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">A more realistic circuit would include two counter-wound AC coils, to avoid inducing currents in the control winding. It would also include diodes, shown here in a bridge configuration, allowing the circuit to control a DC load. Feedback coils [not shown] can be used to increase amplification.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">David Schneider</small>\n</p>\n</div><p>\n\tIn 1956, the \n\t<a href=\"https://en.wikipedia.org/wiki/Sperry_Corporation\" target=\"_blank\">Sperry Rand Co.</a> developed a high-speed magnetic amplifier called the <a href=\"https://books.google.com/books?id=P10pDwAAQBAJ&pg=PA151&lpg=PA151&dq=Ferractor&source=bl&ots=LoGtBxTlzf&sig=ACfU3U3McMb0ZgGopfCMWQ6c1qvICjYoAQ&hl=en&sa=X&ved=2ahUKEwiwmp-SvKr1AhWwrHIEHWWrBBwQ6AF6BAgMEAM#v=onepage&q=Ferractor&f=false\" target=\"_blank\">Ferractor</a>, capable of operating at several megahertz. Each Ferractor was built by winding a dozen wraps of one-eighth-mil (about 3 micrometers) Permalloy tape around a 0.1-inch (2.5-mm) nonmagnetic stainless-steel bobbin.\n</p><p>\n\tThe Ferractor’s performance was due to the remarkable thinness of this tape in combination with the tiny dimensions of the bobbin. Sperry Rand used the Ferractor in a military computer called the Univac Magnetic Computer, also known as the Air Force Cambridge Research Center (AFCRC) computer. This machine contained 1,500 Ferractors and 9,000 germanium diodes, as well as a few transistors and vacuum tubes.\n</p><p>\n\tSperry Rand later created business computers based on the AFCRC computer: the \n\t<a href=\"https://en.wikipedia.org/wiki/UNIVAC_Solid_State\" target=\"_blank\">Univac Solid State</a> (known in Europe as the Univac Calculating Tabulator) followed by the less expensive STEP (Simple Transition Electronic Processing) computer. Although the Univac Solid State didn't completely live up to its name—its processor used 20 vacuum tubes—it was moderately popular, with hundreds sold.\n</p><p>\n\tAnother division of Sperry Rand built a computer called \n\t<a href=\"http://vipclubmn.org/Articles/SperryMilitaryComputersbyGG.pdf\" target=\"_blank\">Bogart</a> to help with codebreaking at the U.S. National Security Agency. Fans of <em>Casablanca</em> and <em>Key Largo</em> will be disappointed to learn that this computer was named after the well-known <em>New York Sun</em> editor John Bogart. This relatively small computer earned that name because it edited cryptographic data before it was processed by the NSA’s larger computers.\n</p><p>\n\tFive Bogart computers were delivered to the NSA between 1957 and 1959. They employed a novel magnetic-amplifier circuit designed by \n\t<a href=\"https://en.wikipedia.org/wiki/Seymour_Cray\" target=\"_blank\">Seymour Cray</a>, who later created the famous Cray supercomputers. Reportedly, out of his dozens of patents, Cray was <a href=\"https://doomedengineers.wordpress.com/2016/01/19/seymour-cray-1925-1996-supercomputers/\" target=\"_blank\">most proud of his magnetic-amplifier design</a>.\n</p><p>\n\tComputers based on magnetic amplifiers didn’t always work out so well, though. For example, in the early 1950s, Swedish billionaire industrialist \n\t<a href=\"https://en.wikipedia.org/wiki/Axel_Wenner-Gren\" target=\"_blank\">Axel Wenner-Gren</a> created a line of vacuum-tube computers, called the ALWAC (Axel L. Wenner-Gren Automatic Computer). In 1956, he told the U.S. Federal Reserve Board that he could deliver a magnetic-amplifier version, the ALWAC 800, in 15 months. After the Federal Reserve Board paid US $231,800, development of the computer ran into engineering difficulties, and the project ended in total failure.\n</p><p>\n\tAdvances in transistors during the 1950s led, of course, to the decline of computers using magnetic amplifiers. But for a time, it wasn’t clear which technology was superior. In the mid-1950s, for example, Sperry Rand was debating between magnetic amplifiers and transistors for the \n\t<a href=\"https://en.wikipedia.org/wiki/ATHENA_computer\" target=\"_blank\">Athena</a>, a 24-bit computer to control the <a href=\"https://en.wikipedia.org/wiki/LGM-25C_Titan_II\" target=\"_blank\">Titan nuclear missile</a>. Cray built two equivalent computers to compare the technologies head-to-head: the Magstec (magnetic switch test computer) used magnetic amplifiers, while the Transtec (transistor test computer) used transistors. Although the Magstec performed slightly better, it was becoming clear that transistors were the wave of the future. So Sperry Rand built the Univac Athena computer from transistors, relegating mag amps to minor functions inside the computer’s power supply.\n</p><p>\n<strong>In Europe, too</strong>, <span style=\"background-color: initial;\">the transistor was battling it out with the magnetic amplifier. For example, engineers at </span><a href=\"https://en.wikipedia.org/wiki/Ferranti\" target=\"_blank\">Ferranti</a><span style=\"background-color: initial;\">, in the United Kingdom, developed magnetic</span><span style=\"background-color: initial;\">-</span><span style=\"background-color: initial;\">amplifier circuits for their computers. But they found that transistors provided more reliable amplification, so they replaced the magnetic amplifier with a transformer in conjunction with a transistor. They called this circuit the </span><a href=\"https://collection.sciencemuseumgroup.org.uk/objects/co8711551/neuron-compartment-from-ferranti-sirius-computer-mainframe-computer-component\" target=\"_blank\">Neuron</a> because it produced an output if the inputs exceeded a threshold, analogous to a biological neuron. The Neuron became the heart of Ferranti’s Sirius and Orion business computers.\n</p><p>\n\tAnother example is the Polish EMAL-2 computer of 1958, which used magnetic-core logic along with 100 vacuum tubes. This 34-bit computer was Poland’s first truly productive digital computer. It was compact but slow, performing only 150 or so operations per second.\n</p><p>\n<span style=\"background-color: initial;\">And in the Soviet Union, the 15-bit </span><a href=\"https://dl.acm.org/doi/10.1145/368453.368456\" target=\"_blank\">LEM-1 computer</a> from 1954 used 3,000 ferrite logical elements (along with 16,000 selenium diodes). It could perform 1,200 additions per second.\n</p><p>\n\tIn France, magnetic amplifiers were used in the \n\t<a href=\"https://ieeexplore.ieee.org/document/4637513\" target=\"_blank\">CAB 500</a> (Calculatrice Arithmétique Binaire 500), sold in 1960 for scientific and technical use by a company called Société d’Electronique et d’Automatisme (SEA). This 32-bit desk-size computer used a magnetic logic element called the Symmag, along with transistors and a vacuum-tube power supply. As well as being programmed in Fortran, Algol, or SEA’s own language, PAF (Programmation Automatique des Formules), the CAB 500 could be used as a desk calculator.\n</p><p>\n\tSome computers of this era used multiaperture cores with complex shapes to implement logic functions. In 1959, engineers at Bell Laboratories developed a ladder-shaped magnetic element called \n\t<a href=\"https://ieeexplore.ieee.org/document/6773051\" target=\"_blank\">the Laddic</a>, which implemented logic functions by sending signals around different “rungs.” This device was later used in some nuclear-reactor safety systems.\n</p><p>\n\tAnother approach along these lines was something called the \n\t<a href=\"https://www.sciencedirect.com/science/article/abs/pii/0032063361903002\" target=\"_blank\">Biax logic element</a>—a ferrite cube with holes along two axes. Another was dubbed the <a href=\"https://patents.google.com/patent/US3376427A/en\" target=\"_blank\">transfluxor</a>, which had two circular openings. Around 1961, engineers at the Stanford Research Institute built the <a href=\"https://www.sri.com/hoi/all-magnetic-logic-computer/#:~:text=In%20the%201950s%2C%20SRI%20began,of%20magnetic%20ferrite%20memory%20cores.\" target=\"_blank\">all-magnetic logic computer</a> for the U.S. Air Force using such multi-aperture magnetic devices. <a href=\"https://en.wikipedia.org/wiki/Douglas_Engelbart\" target=\"_blank\">Doug Engelbart</a>, who famously went on to invent the mouse and much of the modern computer user interface, was a key engineer on this computer.\n</p><p>\n\tSome computers of the time used transistors in combination with magnetic cores. The idea was to minimize the number of then-expensive transistors. This approach, called core transistor logic (CTL), was used in the British \n\t<a href=\"https://en.wikipedia.org/wiki/Elliott_803\" target=\"_blank\">Elliott 803</a> computer, a small system introduced in 1959 with an unusual 39-bit word length. The <a href=\"http://ed-thelen.org/comp-hist/BRL64-b.html\" target=\"_blank\">Burroughs D210</a> magnetic computer of 1960, a compact computer of just 35 pounds (about 16 kilograms) designed for aerospace applications, also used core-transistor logic.\n</p><div class=\"ieee-sidebar-medium\">\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img class=\"rm-shortcode\" data-rm-shortcode-id=\"aafe761bd727283d36e37f7c1acfaed1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e0abe\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/image.jpg?id=29535184&width=980\"/>\n</p>\n<p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"One image shows a portion of a computer board with many tiny rings through which wires pass. The other image is an enlargement, which makes it possible to see that the rings have different orientations.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"53ff9458169d3d1b8126d4c43cbeb9ac\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"55f64\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/one-image-shows-a-portion-of-a-computer-board-with-many-tiny-rings-through-which-wires-pass-the-other-image-is-an-enlargement.png?id=29535165&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">This board from a 1966 IBM System/360 [top] shows some of the machine’s magnetic-core memory, which made use of small ferrite rings through which wires were strung [bottom].</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Top: Maximilian Schönherr/picture-alliance/dpa/AP; Bottom: Sheila Terry/Rutherford Appleton Laboratory/Science Source</small>\n</p>\n</div><p>\n\tCore-transistor logic was particularly popular for space applications. A company called Di/An Controls produced a line of logic circuits and claimed that “most space vehicles are packed with them.” The company’s Pico-Bit was a competing core-transistor-logic product, advertised in 1964 as “Your best bit in space.” Early prototypes of NASA’s \n\t<a href=\"https://en.wikipedia.org/wiki/Apollo_Guidance_Computer\" target=\"_blank\">Apollo Guidance Computer</a> were built with core transistor logic, but in 1962 the designers at MIT made a risky switch to integrated circuits.\n</p><p>\n\tEven some “fully transistorized” computers made use of magnetic amplifiers here and there. The MIT \n\t<a href=\"https://www.ll.mit.edu/sites/default/files/page/doc/2018-05/LookingBack_19_1.pdf\" target=\"_blank\">TX-2</a> of 1958 used them to control its tape-drive motors, while the <a href=\"https://www.ibm.com/ibm/history/exhibits/mainframe/mainframe_PP7090.html\" target=\"_blank\">IBM 7090</a>, introduced in 1959, and the popular IBM <a href=\"https://www.ibm.com/ibm/history/ibm100/us/en/icons/system360/\" target=\"_blank\">System/360</a> mainframes, introduced in 1964, used magnetic amplifiers to regulate their power supplies. Control Data Corp.’s <a href=\"https://en.wikipedia.org/wiki/CDC_160_series\" target=\"_blank\">160 minicomputer</a> of 1960 used a magnetic amplifier in its console typewriter. Magnetic amplifiers were too slow for the logic circuits in the <a href=\"https://en.wikipedia.org/wiki/UNIVAC_LARC\" target=\"_blank\">Univac LARC</a> supercomputer of 1960, but they were used to drive its core memory.\n</p><p>\n<strong>In the 1950s, </strong><span style=\"background-color: initial;\">engineers in the U.S. Navy had called magnetic amplifiers “a rising star” and one of “the marvels of postwar electronics.” As late as 1957, more than 400 engineers attended a conference on magnetic amplifiers.</span> <span style=\"background-color: initial;\">But interest in these devices steadily declined during the 1960s when transistors and other semiconductors took over.</span>\n</p><p>\n\tYet long after everyone figured that these devices were destined for the dust heap of history, mag amps found a new application. In the mid-1990s, the \n\t<a href=\"https://en.wikipedia.org/wiki/ATX\" target=\"_blank\">ATX</a> standard for personal computers required a carefully regulated 3.3-volt power supply. It turned out that magnetic amplifiers were an inexpensive yet efficient way to control this voltage, making the mag amp a key part of most PC power supplies. As before, this revival of magnetic amplifiers didn’t last: DC-DC regulators have largely replaced magnetic amplifiers in modern power supplies.\n</p><p>\n\tAll in all, the history of magnetic amplifiers spans about a century, with them becoming popular and then dying out multiple times. You’d be hard pressed to find a mag amp in electronic hardware produced today, but maybe some new application—perhaps for quantum computing or wind turbines or electric vehicles—will breathe life into them yet again.\n\t<span class=\"ieee-end-mark\"></span>\n</p>",
  "pubDate": "Sun, 27 Mar 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/the-vacuum-tubes-forgotten-rival",
  "category": [
    "Amplifiers",
    "Tubes",
    "Military"
  ],
  "dc:creator": "Ken Shirriff",
  "media:content": ""
}