{
  "id": "tag:blogger.com,1999:blog-8474926331452026626.post-7123003530389096578",
  "published": "2022-10-26T10:18:00.001-07:00",
  "updated": "2022-10-27T13:07:25.856-07:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Natural Language Assessment: A New Framework to Promote Education",
  "content": "<span class=\"byline-author\">Posted by Kedem Snir, Software Engineer, and Gal Elidan, Senior Staff Research Scientist, Google Research</span> <p>Whether it's a professional honing their skills or a child learning to read, coaches and educators play a key role in assessing the learner's answer to a question in a given context and guiding them towards a goal. These interactions have unique characteristics that set them apart from other forms of dialogue, yet are not available when learners practice alone at home. In the field of natural language processing, this type of capability has not received much attention and is technologically challenging. We set out to explore how we can use machine learning to assess answers in a way that facilitates learning. </p><a name='more'></a><p>In this blog, we introduce an important natural language understanding (NLU) capability called Natural Language Assessment (NLA), and discuss how it can be helpful in the context of education. While typical NLU tasks focus on the user's intent, NLA allows for the assessment of an answer from multiple perspectives. In situations where a user wants to know how good their answer is, NLA can offer an analysis of how close the answer is to what is expected. In situations where there may not be a “correct” answer, NLA can offer subtle insights that include topicality, relevance, verbosity, and beyond. We formulate the scope of NLA, present a practical model for carrying out topicality NLA, and showcase how NLA has been used to help job seekers practice answering interview questions with Google's new interview prep tool, <a href=\"https://blog.google/outreach-initiatives/grow-with-google/interview-warmup/\">Interview Warmup</a>. </p>  <div style=\"line-height: 40%;\">    <br /></div><h2>Overview of Natural Language Assessment (NLA)</h2><p>The goal of NLA is to evaluate the user's answer against a set of expectations. Consider the following components for an NLA system interacting with students: </p><ul> <li><em>A question</em> presented to the student  </li><li><em>Expectations</em> that define what we expect to find in the answer (e.g., a concrete textual answer, a set of topics we expect the answer to cover, conciseness)  </li><li><em>An answer</em> provided by the student  </li><li><em>An assessment output</em> (e.g., correctness, missing information, too specific or general, stylistic feedback, pronunciation, etc.)  </li><li>[Optional] <em>A context</em> (e.g., a chapter in a book or an article) </li></ul><p>With NLA, both the expectations about the answer and the assessment of the answer can be very broad. This enables teacher-student interactions that are more expressive and subtle. Here are two examples: </p><ol> <li><em>A question with a concrete correct answer</em>: Even in situations where there is a clear correct answer, it can be helpful to assess the answer more subtly than simply correct or incorrect. Consider the following:  <blockquote style=\"border: none; margin: -10px 0px 0px 40px; padding: 0px; text-align: left;\"><p>   <b>Context</b>: <em>Harry Potter and the Philosopher's Stone</em><br />  <b>Question</b>: <em>“What is Hogwarts?”</em><br />  <b>Expectation</b>: <em>“Hogwarts is a school of Witchcraft and Wizardry” [expectation is given as text]</em><br />  <b>Answer</b>: <em>“I am not exactly sure, but I think it is a school.”</em>  </p></blockquote><p>The answer may be missing salient details but labeling it as incorrect wouldn’t be entirely true or useful to a user. NLA can offer a more subtle understanding by, for example, identifying that the student’s answer is too general, and also that the student is uncertain. </p>    <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNwF8YrXFz2iqbVrKP5LS0lJPNDVAsqozOzz-Ut8075ogDQhWd1bXaVBTfpWLmzjcyB2XxeXzEpXB1eO5RA0Q8iO8j1zC3Cpsn8PDj8YNLywLFD2THrJovvowrUTlrOvslYMwFsTyApSvWo3JOkd_KysHV8Chg7sk3PrAr4aMERjEBWttxjez89Wnszw/s1200/image21.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"614\" data-original-width=\"1200\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNwF8YrXFz2iqbVrKP5LS0lJPNDVAsqozOzz-Ut8075ogDQhWd1bXaVBTfpWLmzjcyB2XxeXzEpXB1eO5RA0Q8iO8j1zC3Cpsn8PDj8YNLywLFD2THrJovvowrUTlrOvslYMwFsTyApSvWo3JOkd_KysHV8Chg7sk3PrAr4aMERjEBWttxjez89Wnszw/s16000/image21.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Illustration of the NLA process from input question, answer and expectation to assessment output.</td></tr></tbody></table>  <p>This kind of subtle assessment, along with noting the uncertainty the student expressed, can be important in helping students build skills in conversational settings. </p> </li><li><em>Topicality expectations</em>: There are many situations in which a concrete answer is not expected. For example, if a student is asked an opinion question, there is no concrete textual expectation. Instead, there's an expectation of relevance and opinionation, and perhaps some level of succinctness and fluency. Consider the following interview practice setup: <blockquote style=\"border: none; margin: -10px 0px 0px 40px; padding: 0px; text-align: left;\"><p>         <b>Question</b>: <em>“Tell me a little about yourself?”</em><br />  <b>Expectations</b>: <em>{ “Education”, “Experience”, “Interests” } (a set of topics)</em><br />        <b>Answer</b>: <em>“Let’s see. I grew up in the Salinas valley in California and went to Stanford where I majored in economics but then got excited about technology so next I ….”</em>  </p></blockquote><p>In this case, a useful assessment output would map the user’s answer to a subset of the topics covered, possibly along with a markup of which parts of the text relate to which topic. This can be challenging from an NLP perspective as answers can be long, topics can be mixed, and each topic on its own can be multi-faceted.    </p></li></ol>  <div style=\"line-height: 40%;\">    <br /></div><h2>A Topicality NLA Model</h2><p>In principle, topicality NLA is a standard multi-class task for which one can readily train a classifier using standard techniques. However, training data for such scenarios is scarce and it would be costly and time consuming to collect for each question and topic. Our solution is to break each topic into granular components that can be identified using large language models (LLMs) with a straightforward generic tuning.  </p><p>We map each topic to a list of underlying questions and define that if the sentence contains an answer to one of those underlying questions, then it covers that topic. For the topic “Experience” we might choose underlying questions such as: </p><ul> <li>Where did you work?  </li><li>What did you study?  </li><li>… </li></ul><p>While for the topic “Interests” we might choose underlying questions such as: </p><ul> <li>What are you interested in?  </li><li>What do you enjoy doing?  </li><li>… </li></ul><p>These underlying questions are designed through an iterative manual process. Importantly, since these questions are sufficiently granular, current language models (see details below) can capture their semantics. This allows us to offer a zero-shot setting for the NLA topicality task: once trained (more on the model below), it is easy to add new questions and new topics, or adapt existing topics by modifying their underlying content expectation without the need to collect topic specific data. See below the model’s predictions for the sentence “<em>I’ve worked in retail for 3 years”</em> for the two topics described above: </p>  <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjhOjKY5O1qBOyFYNcboWvDaDnZj9CpBhZNGkODUMh-oF7F01FcUlaVtZJ9vOfkmgRJKBuRVJk0wk1VNl-VWVLfkfkWAIKALH3dkFmeiJgd6AuCULJT-WDTfRN8qLV6z4mpvCUGTsDJIalOx5zEbpuMvosCGEOiuXSGQ2B55nB03R1K0bFJdLLnhkid_w/s1680/Diagram%2010%20(1).png\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"660\" data-original-width=\"1680\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjhOjKY5O1qBOyFYNcboWvDaDnZj9CpBhZNGkODUMh-oF7F01FcUlaVtZJ9vOfkmgRJKBuRVJk0wk1VNl-VWVLfkfkWAIKALH3dkFmeiJgd6AuCULJT-WDTfRN8qLV6z4mpvCUGTsDJIalOx5zEbpuMvosCGEOiuXSGQ2B55nB03R1K0bFJdLLnhkid_w/s16000/Diagram%2010%20(1).png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">A diagram of how the model uses underlying questions to predict the topic most likely to be covered by the user’s answer.</td></tr></tbody></table>   <p>Since an underlying question for the topic “Experience” was matched, the sentence would be classified as “Experience”. </p> <div style=\"line-height: 40%;\">    <br /></div><h2>Application: Helping Job Seekers Prepare for Interviews</h2>  <p><a href=\"https://blog.google/outreach-initiatives/grow-with-google/interview-warmup/\">Interview Warmup</a> is a new tool developed in collaboration with job seekers to help them prepare for interviews in fast-growing fields of employment such as IT Support and UX Design. It allows job seekers to practice answering questions selected by industry experts and to become more confident and comfortable with interviewing. As we worked with job seekers to understand their challenges in preparing for interviews and how an interview practice tool could be most useful, it inspired our research and the application of topicality NLA. </p><p>We build the topicality NLA model (once for all questions and topics) as follows: we train an encoder-only T5 model (<a href=\"https://arxiv.org/pdf/2110.08426.pdf\">EncT5</a> architecture) with 350 million parameters on Question-Answers data to predict the compatibility of an <code>&lt;underlying question, answer&gt;</code> pair. We rely on data from <a href=\"https://rajpurkar.github.io/SQuAD-explorer/\">SQuAD 2.0</a> which was processed to produce <code>&lt;question, answer, label&gt;</code> triplets. </p>    <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEirInL-Tue-1LTGLBbt_o_uXoDMr8Hl8ERvuxYUt9hrT95-rptv-VORYi6ZZq4jLnGsGk2wEGLF7bnT8Vqgo74uO4ElEqSU9atwQn2-FqFKMRS1302FrLib7xCz4IEEHPrs49MAvKKYnB8glHUdCb2ECg3Te7fB4H8oZW38er5WV1UV0Ku7W3buEZmEHA/s1069/image4.gif\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"668\" data-original-width=\"1069\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEirInL-Tue-1LTGLBbt_o_uXoDMr8Hl8ERvuxYUt9hrT95-rptv-VORYi6ZZq4jLnGsGk2wEGLF7bnT8Vqgo74uO4ElEqSU9atwQn2-FqFKMRS1302FrLib7xCz4IEEHPrs49MAvKKYnB8glHUdCb2ECg3Te7fB4H8oZW38er5WV1UV0Ku7W3buEZmEHA/s16000/image4.gif\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">In the Interview Warmup tool, users can switch between talking points to see which ones were detected in their answer.</td></tr></tbody></table>   <p>The tool does not grade or judge answers. Instead it enables users to practice and identify ways to improve on their own. After a user replies to an interview question, their answer is parsed sentence-by-sentence with the Topicality NLA model. They can then switch between different talking points to see which ones were detected in their answer. We know that there are many potential pitfalls in signaling to a user that their response is “good”, especially as we only detect a limited set of topics.  Instead, we keep the control in the user’s hands and only use ML to help users make <em>their own discoveries</em> about how to improve.  </p><p>So far, the tool has had great results helping job seekers around the world, including in the US, and we have recently expanded it to <a href=\"https://blog.google/around-the-globe/google-africa/how-ai-is-helping-african-communities-and-businesses/\">Africa</a>. We plan to continue working with job seekers to iterate and make the tool even more helpful to the millions of people searching for new jobs.<br /></p> <div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" frameborder=\"0\" height=\"360\" rel=\"0&amp;\" src=\"https://www.youtube.com/embed/KKfAuQrwzTY\" width=\"640\" youtube-src-id=\"KKfAuQrwzTY\"></iframe></div>     <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td class=\"tr-caption\" style=\"text-align: center;\">A short film showing how Interview Warmup and its NLA capabilities were developed in collaboration with job seekers.</td></tr></tbody></table>    <h2>Conclusion</h2><p>Natural Language Assessment (NLA) is a technologically challenging and interesting research area. It paves the way for new conversational applications that promote learning by enabling the nuanced assessment and analysis of answers from multiple perspectives. Working together with communities, from job seekers and businesses to classroom teachers and students, we can identify situations where NLA has the potential to help people learn, engage, and develop skills across an array of subjects, and we can build applications in a responsible way that empower users to assess their own abilities and discover ways to improve. </p>  <div style=\"line-height: 40%;\">    <br /></div><h2>Acknowledgements</h2><p><em>This work is made possible through a collaboration spanning several teams across Google. We’d like to acknowledge contributions from Google Research Israel, Google Creative Lab, and Grow with Google teams among others. </em></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google AI",
    "uri": "http://www.blogger.com/profile/12098626514775266161",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}