{
  "title": "Tap water ‘recycled’ ten times before you drink it – study",
  "link": "https://www.rt.com/news/565841-waste-water-recycled-formula/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565841-waste-water-recycled-formula/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362e69085f54007ca563688.jpg\" /> The water humans drink is the same water urinated by dinosaurs, recycled at least ten times, an economics professor claims <br/><a href=\"https://www.rt.com/news/565841-waste-water-recycled-formula/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>An economics professor devised a formula to calculate how many times water has been consumed</strong></p>\n            \n                        \n            <p>The tap water people drink in 2022 is the same water the dinosaurs urinated millions of years ago, having been drunk and excreted 10-25 times previously, according to London School of Economics Professor Paul Frijters.</p>\n<p>Frijters devised a complex formula to attempt to calculate how many creatures a molecule of water passes through before it ends up in your mouth, posting his creation to the Core Economics blog last month. Acknowledging <em>&ldquo;a few guesstimates&rdquo;</em> were required for some variables as exact figures were impossible to come by, he gave the (rather crude) formula thus:</p>\n<p><em>&ldquo;Piss ratio = (total water pissed)/(total water) = (total vertebrate biomass ever lived*piss rate)/(total water) = (average biomass vertebrates*piss rate per year*years of vertebrates)/(total water)&rdquo;</em></p>\n<p>The professor cited a US government statistic positing 1.386 billion cubic kilometers of water exists on Earth before plucking the figure 800 cubic kilometers for <em>&ldquo;total water pissed&rdquo;</em> out of thin air, admitting it was only his <em>&ldquo;best guess&rdquo;</em> &ndash; but it was a reassuring guess, as it meant <em>&ldquo;only one 2-millionth of the atoms in the average water molecule will have been pissed out by a human.&rdquo;</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.08/thumbnail/630def4f85f5402ea321c338.jpg\" alt=\"FILE PHOTO: A swimming pool at a private house. © Henri-Alain SEGALEN / Gamma-Rapho via Getty Images\" />\n            <figcaption><a href=\"https://www.rt.com/news/561798-france-tax-ai-pools/\">French officials using AI to tax private pools</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Working with similarly vague figures, Frijters calculated that the atoms in the average water molecule have been urinated about ten times &ndash; <em>&ldquo;a conservative estimate,&rdquo;</em> he wrote, suggesting the reality may be as many as 25 times.&nbsp;</p>\n<p>But those squeamish about consuming recycled human urine shouldn&rsquo;t be &ndash; only two of those cycles involved mammals, with most coming from fish and <em>&ldquo;only a trickle&rdquo;</em> from primates. While humanity only recently devised a process for directly purifying wastewater in order to make it safe to drink again, indirect reuse is unavoidable.</p>\n<p>Frijters advises the UK government on public health policy,&nbsp;a discipline with a keen interest in acclimatizing skittish humans to the notion of drinking their own (purified) wastewater. The process once derided by media as <em>&ldquo;toilet to tap&rdquo;&nbsp;</em>is increasingly appealing to local governments as drought, overpopulation, and water shortages put a strain on resources. So-called &lsquo;direct potable reuse&rsquo;, in which &lsquo;highly treated&rsquo; sewage is sent to a central drinking water system for distribution to communities, has been legalized in Texas, while Arizona allowed it in some cases as of August. Colorado, Florida, and California are in the process of legalizing it.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 05:57:21 +0000",
  "dc:creator": "RT"
}