{
  "author": {
    "name": "Jacob Goss, Daniel Mangrum, and Joelle Scally"
  },
  "title": "Revisiting Federal Student Loan Forgiveness: An Update Based on the White House Plan",
  "link": [
    "",
    "",
    ""
  ],
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=18283",
  "updated": "2022-09-29T21:52:13Z",
  "published": "2022-09-27T11:00:00Z",
  "category": [
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "summary": "On August 24, 2022, the White House <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/08/24/fact-sheet-president-biden-announces-student-loan-relief-for-borrowers-who-need-it-most/\">released a plan </a>to cancel federal student loans for most borrowers. In April,  we wrote about the costs and <a href=\"https://libertystreeteconomics.newyorkfed.org/2022/04/who-are-the-federal-student-loan-borrowers-and-who-benefits-from-forgiveness/\">who most benefits</a> from a few hypothetical loan forgiveness proposals using our <a href=\"https://www.newyorkfed.org/research/staff_reports/sr479.html\">Consumer Credit Panel</a>, based on Equifax credit report data.  In this post, we update our framework to consider the White House plan now that parameters are known, with estimates for the total amount of forgiven loans and the distribution of who holds federal student loans before and after the proposed <a href=\"https://www.washingtonpost.com/opinions/2020/03/21/debt-jubilee-is-only-way-avoid-depression/\">debt jubilee</a>.",
  "content": "<p class=\"ts-blog-article-author\">Jacob Goss, Daniel Mangrum, and Joelle Scally</p>\n\n\n\n<p><em>Editors’ note:&nbsp;The second chart in this post has been updated to correct for a slight undercount of the adult population in some deciles. The adjustments were minor and do not affect the substantive conclusions of this analysis. (5:30 p.m. ET, Sept. 29)</em></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"920\" height=\"576\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_460-1.jpg?w=460\" alt=\"\" class=\"wp-image-18384\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_460-1.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_460-1.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_460-1.jpg?resize=768,481 768w\" sizes=\"(max-width: 920px) 100vw, 920px\" /></figure>\n\n\n<p>On August 24, 2022, the White House <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/08/24/fact-sheet-president-biden-announces-student-loan-relief-for-borrowers-who-need-it-most/\">released a plan </a>to cancel federal student loans for most borrowers. In April,  we wrote about the costs and <a href=\"https://libertystreeteconomics.newyorkfed.org/2022/04/who-are-the-federal-student-loan-borrowers-and-who-benefits-from-forgiveness/\">who most benefits</a> from a few hypothetical loan forgiveness proposals using our <a href=\"https://www.newyorkfed.org/research/staff_reports/sr479.html\">Consumer Credit Panel</a>, based on Equifax credit report data.  In this post, we update our framework to consider the White House plan now that parameters are known, with estimates for the total amount of forgiven loans and the distribution of who holds federal student loans before and after the proposed <a href=\"https://www.washingtonpost.com/opinions/2020/03/21/debt-jubilee-is-only-way-avoid-depression/\">debt jubilee</a>.</p>\n\n\n\n<p class=\"is-style-default\">We estimate that the plan will cancel roughly $441&nbsp;billion in federal student loans which would eliminate federally-held balances for 40.5&nbsp;percent of federal borrowers, forgiving 31.1&nbsp;percent of the total outstanding federal student loan balance. In our estimation, 5.1 percent of borrowers will be ineligible for forgiveness due to the income threshold. Distributionally, we find that the plan, particularly because of the additional forgiveness for Pell grant recipients, pushes more forgiveness dollars toward borrowers living in lower- and middle-income neighborhoods than borrowers living in higher-income communities. By our count, 65&nbsp;percent of federal student loans are held by borrowers living in neighborhoods with median household income below $83,000, and borrowers in these neighborhoods receive 72&nbsp;percent of proposed loan forgiveness. Student loan borrowers residing in lower- and middle-income neighborhoods are more likely to have delinquent or defaulted balances and are more likely to have their loans completely forgiven by the plan. Overall, we find that the White House plan directs modestly higher average forgiveness amounts to lower- and middle-income areas. Because these borrowers have higher delinquency rates and balances that are larger relative to their incomes, forgiveness will have a more substantial impact on lower-income student loan borrowers.</p>\n\n\n\n<h4>Data and Methods</h4>\n\n\n\n<p class=\"is-style-default\">For this analysis, we use data from the New York Fed Consumer Credit Panel, which is a 5&nbsp;percent anonymized sample of credit reports from Equifax. We directly observe loan balances, delinquencies, risk scores, and the U.S. Census block group associated with a borrower’s address. We limit the sample of student loans to only those owned by the federal government in the second quarter of 2022. This exclusion results in a total of 38&nbsp;million borrowers with outstanding student debt totaling $1.418&nbsp;trillion. This aligns closely with publicly available <a href=\"https://studentaid.gov/sites/default/files/fsawg/datacenter/library/PortfoliobyLoanStatus.xls\">data on holdings by the U.S. Department of Education</a> which report a total of $1.476&nbsp;trillion combined across Direct loans, Family Federal Education Loan (FFEL) balances owned by the federal government, and defaulted FFEL balances which are all eligible for forgiveness. We attribute the $58&nbsp;billion shortfall in our estimate of total outstanding loans to balances that were defaulted more than seven years ago and thus no longer appear on credit reports.</p>\n\n\n\n<p>The White House plan calls for cancelling loans for borrowers earning less than $125,000 (individuals) or $250,000 (households). Borrowers who received a Pell grant while in college would receive up to $20,000 in cancellation, while those who never received a Pell grant would receive up to $10,000. We estimate the probability of Pell grant receipt for each borrower by combining information about the household income distribution of each borrower’s neighborhood when they first borrowed federal student loans with data from the National Center for Education Statistics on Pell grant receipt by income and dependency status. Our algorithm produces a Pell grant rate among federal borrowers of 59.6&nbsp; percent which is on par with <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2022/08/24/fact-sheet-president-biden-announces-student-loan-relief-for-borrowers-who-need-it-most/\">the estimate from the administration</a> of 60&nbsp;percent. We estimate the probability that each borrower is under the income threshold using the household income distribution from the American Community Survey and the national income distribution of student loan borrowers by age and credit score from the New York Fed’s <a href=\"https://www.newyorkfed.org/microeconomics/sce/credit-access\">SCE Credit Access Survey</a>. More details, including a discussion of the advantages of our data and methods, can be found in our<a href=\"https://www.newyorkfed.org/medialibrary/media/research/blog/2022/Mangrum_RevisitingForgiveness_TechnicalAppendix\"> Technical Appendix</a>.</p>\n\n\n\n<h4>How Much Debt Is Forgiven?</h4>\n\n\n\n<p>As noted above, we estimate that the White House plan would cancel $441 billion in outstanding loans, accounting for 31.1&nbsp;percent of the student loan portfolio owned by the federal government. This plan would also cancel 42&nbsp;percent of student debts that were in default or severely delinquent prior to the pandemic. Our analysis indicates that 40.5&nbsp;percent of borrowers with loans owned by the federal government would have their outstanding federal balance completely forgiven. In addition, we estimate that 5.1&nbsp;percent of borrowers will be ineligible for loan cancellation due to the income restrictions.</p>\n\n\n\n<h4><strong>Who Benefits?</strong></h4>\n\n\n\n<p>As in our <a href=\"https://libertystreeteconomics.newyorkfed.org/2022/04/who-are-the-federal-student-loan-borrowers-and-who-benefits-from-forgiveness/\">prior post</a>, we consider the effects of the cancellation plan through the lens of income level and geography. First, we examine the distribution of beneficiaries by deciles of median neighborhood income. In aggregate, between $40&nbsp;billion and $47&nbsp;billion in debt would be cancelled for each income decile, and the amounts are relatively stable up to the highest-income decile, which sees a decline due to the income criteria. In the chart below, we plot the average federal student loan balance held in each decile alongside the average amount of forgiveness. Although the average forgiveness amount per eligible borrower is relatively stable across income (but declining throughout), lower-income borrowers tend to have smaller balances, so the forgiveness amount is a much larger share of their balances. The average forgiveness amount makes up nearly two-thirds of the average balance in the lowest income areas, where borrowers are also likelier to be receiving Pell grants. But the highest income areas will see a more modest reduction of their balances. Average balances in the wealthiest areas topped $35,000 before the forgiveness event and these borrowers were less likely to receive a Pell grant. Considering the extremely high debt-to-income ratios of borrowers in the lower-income deciles, the cancellation of balances will significantly improve these borrowers’ financial positions. For example, borrowers in the second income decile had student loan balances more than 50&nbsp;percent of their annual income before forgiveness, but post-forgiveness will see more than a 20-percentage-point reduction in their implied debt-to-income ratios.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Borrowers in lower-income neighborhoods would receive the largest reductions in balances</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch2.jpg?w=398\" alt=\"Two-color bar chart plotting the average federal student loans balance held in each decile before forgiveness (red color) and the average amount of forgiveness (blue color). Percent declines depicted within the bars denote the percent reduction in average balances for each decile relative to the average forgiveness amount for each decile. \" class=\"wp-image-18314\" width=\"457\" height=\"330\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch2.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch2.jpg?resize=460,333 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch2.jpg?resize=768,555 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch2.jpg?resize=398,288 398w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch2.jpg?resize=1536,1110 1536w\" sizes=\"(max-width: 457px) 100vw, 457px\" /><figcaption>Sources: New York Fed/Equifax Consumer Credit Panel; American Community Survey; authors’ calculations.<br>Note: The percentage figures depicted within the bars denote the percent reduction in average balances for each decile relative to the average forgiveness amount for each decile.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>In the next chart, we show that the prevalence of federal student loans is relatively constant across the bottom nine deciles with each decile having between 11&nbsp;percent to 13&nbsp;percent of the adult population owing federal student loans. This share drops to 10.3&nbsp;percent for the highest income neighborhoods. After the proposed cancellation, the share with federal loans is cut roughly in half for the lowest-income neighborhoods, largely because borrowers in these neighborhoods have smaller balances and a greater probability of having received a Pell grant.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Student loan prevalence in the lowest-income areas will be nearly halved after forgiveness</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch3-1.png?w=408\" alt=\"Two-color bar chart showing the share of adult population with federal student loans before forgiveness (red color) and shares of adult population with federal student loans after forgiveness. Percentage point declines depicted within the bars denote the reduction in the share of the adult population holding federal student loans due to borrowers whose loans are completely canceled due to the forgiveness event.\" class=\"wp-image-18443\" width=\"456\" height=\"322\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch3-1.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch3-1.png?resize=460,325 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch3-1.png?resize=768,543 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch3-1.png?resize=408,288 408w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch3-1.png?resize=1536,1085 1536w\" sizes=\"(max-width: 456px) 100vw, 456px\" /><figcaption>Sources: New York Fed/Equifax Consumer Credit Panel; American Community Survey; authors’ calculations.<br>Notes: Under the forgiveness plan, some borrowers will see their debts completely cancelled. The percentage point figures within the bars denote the percentage point decline in the shares of the adult population holding federal student loans as a result of the forgiveness event.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Next, we examine how loan cancellation affects the stock of delinquent and defaulted federal student loans. Since the administrative forbearance on federal student loans, which began in 2020 and has been extended since, marked all delinquent loans as current, we hold fixed the loan status for each loan at its value in February 2020 but use reported balances as of the second quarter of 2022. As we note in the introduction, approximately 42&nbsp;percent of balances that were delinquent or in default prior to the pandemic will be forgiven. But these forgiven delinquent balances are not evenly distributed—lower-income areas previously held higher shares of delinquent debt and will see a substantial reduction in the balances that were delinquent or in default. This total amount and the share are declining across the income deciles.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Previously delinquent and defaulted debt is reduced by more than 40 percent in lower- and middle-income communities</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch4.jpg?w=394\" alt=\"Two-color bar chart showing delinquent or defaulted balances outstanding (red color) and delinquent or defaulted balances canceled (blue color) as of February 2020). Percent declines depicted within the bars denote the percent reduction in (pre-pandemic) delinquent or defaulted debt for each decile due to loan cancellation.\" class=\"wp-image-18318\" width=\"456\" height=\"333\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch4.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch4.jpg?resize=460,336 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch4.jpg?resize=768,561 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch4.jpg?resize=394,288 394w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch4.jpg?resize=1536,1123 1536w\" sizes=\"(max-width: 456px) 100vw, 456px\" /><figcaption>Sources: New York Fed/Equifax Consumer Credit Panel; American Community Survey; authors’ calculations.<br>Note: The percentage figures depicted within the bars denote the percent reduction in (pre-pandemic) delinquent or defaulted debt for each income decile due to loan forgiveness.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Lastly, we present statistics for federal student loan cancellation by borrower’s state of residence. On the left of the panel chart below, we present the average amount of debt forgiven per eligible borrower by state. The seven with the highest average amounts are in the Southern Census region: Washington, D.C. (largest), North Carolina, Georgia, South Carolina, Alabama, Mississippi, and West Virginia. The six states with the lowest average forgiveness amount per eligible borrower are all in the West: Utah (smallest), Wyoming, Hawaii, Alaska, Nevada, and California. In the right chart panel, we present the share of the adult population receiving any forgiveness. Again, many Southern states lead in this metric with Ohio joining Georgia, Washington, D.C., South Carolina, and Mississippi as the areas with the largest share benefitting, and Western states have the smallest share of the adult population receiving any loan cancellation.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Income limits and regional income disparities send more average benefit to Southern states</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1840\" height=\"597\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch5.jpg?w=460\" alt=\"U.S. maps showing the statistics for federal student loan cancelation by borrower’s state of residence. The map on the left presents the average amount of debt forgiven per eligible borrower by state, while the map on the right presents the share of the adult population receiving any forgiveness. Southern states disproportionately benefit from loan cancellation while Western states receive less forgiveness.  \" class=\"wp-image-18319\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch5.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch5.jpg?resize=460,149 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch5.jpg?resize=768,249 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_forgiveness_mangrum_ch5.jpg?resize=1536,498 1536w\" sizes=\"(max-width: 1840px) 100vw, 1840px\" /><figcaption>Sources: New York Fed/Equifax Consumer Credit Panel; American Community Survey; authors’ calculations.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h4><strong>State of Student Loans after Forgiveness</strong></h4>\n\n\n\n<p>This<a href=\"https://www.washingtonpost.com/opinions/2020/03/21/debt-jubilee-is-only-way-avoid-depression/\"> debt jubilee</a> event, if it comes to pass, will be the most significant policy in the financing of higher education since the introduction of modern Pell grants fifty years ago. While the premise of a large-scale debt forgiveness <a href=\"https://www.mhpbooks.com/books/debt/\">has existed since ancient times</a>, there are few recent equivalents to use as a historic baseline to understand future impact, particularly since student loans are <a href=\"https://www.americanbar.org/groups/business_law/safeborrowing/student/bankruptcy/\">difficult to discharge in bankruptcy</a>. The only other (albeit smaller-scale) <a href=\"https://www.nber.org/digest/jul19/cancellation-student-loans-led-general-deleveraging\">debt cancellation event studied recently</a> resulted in a large reduction in defaults for other debts, higher geographic and labor mobility, and higher earnings for borrowers whose debts were cancelled. Without prior large-scale experiences to look to, the fact remains that student loan borrowers have experienced more credit distress than non-borrowers. Troubled student loan borrowers have lower credit scores, and <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2423377\">often struggle with repaying their credit card and auto loan debts</a>, and are <a href=\"https://libertystreeteconomics.newyorkfed.org/2017/04/diplomas-to-doorsteps-education-student-debt-and-homeownership/\">less likely</a> to own <a href=\"https://libertystreeteconomics.newyorkfed.org/2014/05/just-released-young-student-loan-borrowers-remained-on-the-sidelines-of-the-housing-market-in-2013/\">homes</a>. The reduction in student debt prevalence and balances will create a substantial financial improvement for borrowers, particularly among those with lower incomes. As details of the plan continue to emerge, we will monitor the borrowing appetite of the forgiven borrowers, as well as the credit performance on their other debts, to study the extent of the effect of the broad loan cancellation.</p>\n\n\n\n<p><a href=\"https://newyorkfed.org/medialibrary/media/research/blog/2022/Mangrum_RevisitingForgiveness_data\">Data for Charts and State Maps</a></p>\n\n\n\n<p><a href=\"https://www.newyorkfed.org/medialibrary/media/research/blog/2022/Mangrum_RevisitingForgiveness_TechnicalAppendix\">Technical Appendix</a></p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"800\" height=\"800\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/Goss_Jacob.jpg?w=288\" alt=\"\" class=\"wp-image-18347 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/Goss_Jacob.jpg 800w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/Goss_Jacob.jpg?resize=45,45 45w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/Goss_Jacob.jpg?resize=460,460 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/Goss_Jacob.jpg?resize=768,768 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/Goss_Jacob.jpg?resize=288,288 288w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></figure><div class=\"wp-block-media-text__content\">\n\n<p class=\"is-style-bio-contact\">Jacob Goss is a senior research analyst in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"91\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/Daniel-Mangrum-90-x-90.png?w=91\" alt=\"Photo: portrait of Daniel Mangrum\" class=\"wp-image-16003 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/Daniel-Mangrum-90-x-90.png 91w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/Daniel-Mangrum-90-x-90.png?resize=45,45 45w\" sizes=\"(max-width: 91px) 100vw, 91px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact\"><a href=\"https://www.newyorkfed.org/research/economists/mangrum\" target=\"_blank\" rel=\"noreferrer noopener\">Daniel Mangrum</a> is a research economist in Equitable Growth Studies in the Federal Reserve Bank of New York’s Research and Statistics Group. </p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/scally_joelle.jpg?w=90\" alt=\"Photo: portrait of Joelle Scally\" class=\"wp-image-16004 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/scally_joelle.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/scally_joelle.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a href=\"https://www.newyorkfed.org/microeconomics/staff#jscally.html\">Joelle Scally</a> is a senior data strategist in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-disclaimer\">\n    <strong>How to cite this post:</strong><br/>\n    Jacob Goss, Daniel Mangrum, and Joelle Scally, &#8220;Revisiting Federal Student Loan Forgiveness: An Update Based on the White House Plan,&#8221; Federal Reserve Bank of New York <em>Liberty Street Economics</em>, September 27, 2022, https://libertystreeteconomics.newyorkfed.org/2022/09/revisiting-federal-student-loan-forgiveness-an-update-based-on-the-white-house-plan/.</p>\n</p>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/04/who-are-the-federal-student-loan-borrowers-and-who-benefits-from-forgiveness/\">Who Are the Federal Student Loan Borrowers and Who Benefits from Forgiveness?</a> (April 2022)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/04/what-might-happen-when-student-loan-forbearance-ends/\">What Might Happen When Student Loan Forbearance Ends?</a>&nbsp;(April 2022)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/03/student-loan-repayment-during-the-pandemic-forbearance/\">Student Loan Repayment during the Pandemic Forbearance</a>&nbsp;(March 2022)<br><a href=\"https://www.newyorkfed.org/microeconomics/topics/student-debt\">Center for Microeconomic Data—Student Debt</a></p>\n\n\n\n<div>\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n</div>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>An author of this post holds federal student loans.</p>\n",
  "thr:total": 2
}