{
  "title": "The Angsana Council is here to explain SEA to global investors",
  "link": "https://e27.co/the-angsana-council-is-here-to-explain-sea-to-global-investors-20221103/",
  "dc:creator": "Mili Semlani",
  "pubDate": "Thu, 03 Nov 2022 03:31:40 +0000",
  "category": [
    "People",
    "Singapore",
    "Bain & Company",
    "Monk's Hill Ventures"
  ],
  "guid": "https://e27.co/?p=475184",
  "description": "<p>Southeast Asia is a melting pot of various ethnicities &#8212; Chinese, Indian, indigenous and western bubbling over four decades.   However, the outside world doesn&#8217;t fully understand the region. People outside the region see SEA simply as a westerner (foreigner) or a local. Worse, most Southeast Asians only know their own country very well but [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/the-angsana-council-is-here-to-explain-sea-to-global-investors-20221103/\">The Angsana Council is here to explain SEA to global investors</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475249\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475249\" loading=\"lazy\" class=\"wp-image-475249 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/e27-28-1.png\" alt=\"\" width=\"690\" height=\"390\" /><p id=\"caption-attachment-475249\" class=\"wp-caption-text\">From L-R: George Yeo, Peng T. Ong, Charles Ormiston, Gita Wirjawan</p></div>\n<p><span >Southeast Asia is a melting pot of various ethnicities &#8212; Chinese, Indian, indigenous and western bubbling over four decades.  </span></p>\n<p><span >However, the outside world doesn&#8217;t</span><span > fully understand the region. People outside the region see SEA simply as a westerner (foreigner) or a local. </span><span >Worse, most Southeast Asians only know their own country very well but very little about other countries. </span></p>\n<p><span >The region needs to have a rich view of what&#8217;s happening inside to effectively influence policy to communicate outside Southeast Asia. </span></p>\n<p><span >A group of venture capitalists and former policymakers felt the need to have a foundational understanding and a shared understanding of the region&#8217;s prospects that go well beyond the investing community. </span></p>\n<p><span >With this goal in mind, they joined hands to launch a new non-profit. </span></p>\n<p><span >Called the Angsana Council, the non-profit is committed to increasing the growth and prosperity of the societies and economies in the region. </span></p>\n<p><span >Built on strong personal and professional ties, the Angsana Council members have worked extensively in various government, business, education and community service spheres. Its founding members are Charles Ormiston (Founding Partner, Southeast Asia, Bain & Company), Peng T. Ong (Co-Founder and Managing Partner, Monk&#8217;s Hill Ventures), Gita Wirjawan (ex-Minister of Trade of the Republic of Indonesia, educator and entrepreneur), and George Yeo (ex-Singapore cabinet minister and visiting scholar at Lee Kuan Yew School of Public Policy and the National University of Singapore). </span></p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/a-stroll-through-the-mohammed-bin-rashid-al-maktoum-solar-park-in-dubai-20220324/\">A stroll through Mohammed bin Rashid Al Maktoum Solar Park in Dubai</a></strong></p>\n<p>&#8220;The council is the coming together of a group of people that are excited about the growth prospects for Southeast Asia but don&#8217;t necessarily feel the world understands,&#8221; according to <span >Ormiston, who stepped out of the equity world to be part of the council</span>.</p>\n<p><span >This group of changemakers advocate that technology-enabled disruption will be a vital contributor to the future of the thriving region. Each shares the same passion for the region and resonates strongly with the mission of getting the world to understand Southeast Asia.</span></p>\n<p><span > &#8220;We at Monk&#8217;s Hill thought it is a worthwhile mission to sponsor,&#8221; said Ong.</span></p>\n<p><span >The council does not aim to be a prominent think tank but instead a cosy focus group that has open and transparent conversations about the policy about technology to foster growth in the SEA economy. </span></p>\n<p><span >&#8220;We expect to reach six or seven more people over the next year to join the council. We will look for people in Vietnam, the Philippines and Thailand with similar backgrounds, such that they have been involved in problem-solving but are also intellectually accepted,&#8221; said Ormiston.</span></p>\n<h1><span >Understanding the region</span></h1>\n<p><span >Since the 1998-99 financial crisis, the world&#8217;s attention shifted to India and China. SEA as a region was sidelined, even though it houses 25 per cent of Asia&#8217;s population. Only recently have people started paying attention to the region thanks to tech innovation.</span></p>\n<p><span >As the council members dug deep to gather data and information for their first report, they realised that not many spoke exclusively about the region. There were specific reports for certain sectors, but none looked at the region and explored its investment potential. </span></p>\n<p><span >So the Angsana Council&#8217;s first major work is a report</span><span >. The report &#8212; <em>Southeast Asia&#8217;s Pursuit of the Emerging Markets Growth Crown: How four factors could step up Southeast Asian growth &#8212; </em>highlights the growth potential in SEA despite global economic headwinds. </span></p>\n<p><span >According to Ormiston, the report attempts to share a data-driven understanding of the region to contribute to its growth.</span></p>\n<p><span >With this report, the council decodes the question: Why Southeast Asia? Will it talk about different types of technology and how it impacts various parts of the region?</span></p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/the-thesis-for-cross-border-e-commerce-in-southeast-asia-20220914/\">The thesis for cross-border e-commerce in Southeast Asia</a></strong></p>\n<p><span >It is a concrete analysis to showcase why Southeast Asia has been one of the world&#8217;s most stable places to invest in the last 25 years. Backed with data and meticulously fact-checked, the report gives fund managers, investors, and VCs worldwide a solid understanding of the region. </span></p>\n<p><span >As the council also has former policymakers as members, the report hopes to bag the attention of the government that could enable tech to move faster in Southeast Asia. The report and the council&#8217;s work are a starting point for a dialogue between technology-enabled disruptors, tech startups and governments to see how they can collaboratively increase the region&#8217;s productivity.</span></p>\n<p><span >The report forecasts the SEA economy to grow by four to five per cent annually over the next ten years, with Vietnam leading the charge at a projected growth of five to seven per cent. The report&#8217;s optimism is centred around two critical sources of additional growth: </span></p>\n<ul>\n<li><span >The growing impact of tech-enabled entrepreneurs (TEDs) on investment, productivity and economic inclusion</span></li>\n<li><span >That SEA&#8217;s largest trading relationships are with China, and SEA grows as China grows</span></li>\n</ul>\n<p><span >The report provides deeper insights into factors such as pro-growth policies, stable macroeconomics, vibrant demographics of SEA, the impact of TEDs driving growth and the benefits of remaining neutral amidst geopolitical headwinds.</span></p>\n<p><span >The council aims to tackle one topic every quarter and dig deep into discussions with experts and research to map out the potential of SEA. Innovation stories of Air Asia and what it did to the aviation sectors of ASEAN countries and local players like Shopee superseding Amazon and Grab are testimony that the region can employ deep tech and novel business models based on a thorough understanding of the people.</span></p>\n<p><span >&#8220;And those are the stories we want to understand and help the world understand better. So that they look at Southeast Asia differently and see the opportunities to invest in this in what we call Tetra Tech-enabled disruptors,&#8221; said Ormiston.</span></p>\n<p>—</p>\n<p data-pm-slice=\"1 1 []\">Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/the-angsana-council-is-here-to-explain-sea-to-global-investors-20221103/\">The Angsana Council is here to explain SEA to global investors</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}