{
  "title": "Millionaire Interview 340",
  "link": "https://esimoney.com/millionaire-interview-340/",
  "comments": "https://esimoney.com/millionaire-interview-340/#comments",
  "dc:creator": "ESI",
  "pubDate": "Mon, 31 Oct 2022 09:00:30 +0000",
  "category": [
    "Interviews",
    "Millionaires"
  ],
  "guid": "https://esimoney.com/?p=8795",
  "description": "<p>Here’s our latest interview with a millionaire as we seek to learn from those who have grown their wealth to high heights. If you’d like to be considered for an interview, drop me a note and we can chat about specifics. This interview took place in June. My questions are in bold italics and their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-340/\">Millionaire Interview 340</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/Older-couple-walking-bridge-in-mountains-new.jpg\"><img class=\"alignleft size-medium wp-image-8800\" src=\"https://esimoney.com/wp-content/uploads/2022/06/Older-couple-walking-bridge-in-mountains-new-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/Older-couple-walking-bridge-in-mountains-new-300x200.jpg 300w, https://esimoney.com/wp-content/uploads/2022/06/Older-couple-walking-bridge-in-mountains-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Here’s our latest <a href=\"https://esimoney.com/category/millionaires/\">interview with a millionaire</a> as we seek to learn from those who have grown their wealth to high heights.</p>\n<p>If you’d like to be considered for an interview, <a href=\"https://esimoney.com/contact/\">drop me a note</a> and we can chat about specifics.</p>\n<p>This interview took place in June.</p>\n<p>My questions are in bold italics and their responses follow in black.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>OVERVIEW</strong></span></h4>\n<p><em><strong>How old are you (and spouse if applicable, plus how long you&#8217;ve been married)?</strong></em></p>\n<p>I am 64 and my wife recently turned 65.</p>\n<p>We have been married for 40 years though it seems like a much shorter period of time!</p>\n<p>We’ve had some amazing experiences together and look forward to many more.</p>\n<p><em><strong>Do you have kids/family (if so, how old are they)?</strong></em></p>\n<p>We have 3 children.</p>\n<p>Our two oldest are each in their mid-thirties, married and working.</p>\n<p>Our third child is a 16 year old 11th grader who keeps us smiling!</p>\n<p><em><strong>What area of the country do you live in (and urban or rural)?</strong></em></p>\n<p>For the last 5 years we’ve lived in a suburb of a midsize Midwestern city.</p>\n<p>Prior to that we lived in a smaller town as well as overseas.</p>\n<p><em><strong>What is your current net worth?</strong></em></p>\n<p>Our current net worth is $4,425,000.</p>\n<p><em><strong>What are the main assets that make up your net worth (stocks, real estate, business, home, retirement accounts, etc.) and any debt that offsets part of these?</strong></em></p>\n<p>Our net worth is invested primarily in low cost, ETF’s and mutual funds although we are currently holding a lot of cash. It breaks down like this:</p>\n<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-1-new.png\"><img class=\"aligncenter size-large wp-image-8796\" src=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-1-new-777x1024.png\" alt=\"\" width=\"777\" height=\"1024\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-1-new-777x1024.png 777w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-1-new-228x300.png 228w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-1-new-768x1012.png 768w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-1-new.png 937w\" sizes=\"(max-width: 777px) 100vw, 777px\" /></a></p>\n<h4><span style=\"text-decoration: underline;\"><strong>EARN</strong></span></h4>\n<p><em><strong>What is your job?</strong></em></p>\n<p>I think I’ve always had an entrepreneurial spirit. When I was in Jr. High School I was selling little trinkets that my friends and I made. I’d also buy candy bars at a discount and sell them at full price in school. The kids were happy to get the candy and trinkets and I was happy to make a small profit.</p>\n<p>I started working my first real job part-time at 16 making $1.65 an hour. This was great and I was really thrilled when I received a .10 cent an hour raise for no apparent reason other than doing my job!</p>\n<p>I participated in a number of different service and sales jobs working my way through college. Before completing my bachelor’s degree I took some time off from school and worked in the manufacturing sector with a small company where I enjoyed the opportunity to go from the lowest paid entry level job on the manufacturing floor through a number of positions to become Director of Operations. Moving through many positions in the company and learning how everything is connected and being able to contribute in a meaningful way confirmed that I really enjoyed business and in particular learning how businesses work and participating in improving them.</p>\n<p>I moved on to other business opportunities but more importantly I fell in love with my future wife and then determined that the responsible thing to do was go back to school to complete my bachelor’s degree. During this time I started a business and continued developing it. About a year after graduating from college I sold that business and my wife and I used the proceeds to travel around the world for a year. We learned a lot, grew closer together and developed an appreciation for people and cultures around the world. We traveled to dozens of countries, experienced great hospitality and grew in our faith.</p>\n<p>Returning home I had the opportunity to purchase a partnership interest in a small service business and it looked like a great opportunity for growth. This turned into a 15 year career in which the value of the business increased from $50,000 to a little over $2,000,000 culminating in the sale of the business in 2001.</p>\n<p>Following the sale of the business both my wife and I have been involved with a non-profit organization as volunteers. As volunteers we did not receive any salary so in that sense we have been retired since 2002.</p>\n<p><em><strong>What is your annual income?</strong></em></p>\n<p>Currently we have no earned income.</p>\n<p>We are trying to be more tax efficient at this stage of life. Our Adjusted Gross Income over the past 15 years has ranged from 49K to 134K. Some of the variation has to do with Roth IRA conversions.</p>\n<p><em><strong>Tell us about your income performance over time. What was the starting salary of your first job, how did it grow from there (and what you did to make it grow), and where are you now?</strong></em></p>\n<p>I started working part time while in high school at $1.65/hr in 1973. I don’t have good records of my earnings over the next 14 years but a good part of that time I was working part time while in school. I worked in various service jobs and sometimes operated my own businesses during this time.</p>\n<p>The following table is my salary and bonus from 1987 – 2001. This was during the time that I was growing a service business. Over this 15 year period my average salary and bonus was about 105K per year.</p>\n<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-chart-2-new.png\"><img class=\"aligncenter size-full wp-image-8797\" src=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-chart-2-new.png\" alt=\"\" width=\"397\" height=\"975\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-chart-2-new.png 397w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-chart-2-new-122x300.png 122w\" sizes=\"(max-width: 397px) 100vw, 397px\" /></a></p>\n<p>2001 was really the end of my earning period. From 2002 – 2017 I had an average earned income of 12K per year (this was the value of an insurance benefit received from the non-profit, which was treated as income for tax purposes).</p>\n<p><em><strong>What tips do you have for others who want to grow their career-related income?</strong></em></p>\n<p>My career income has been primarily from self-employment. In that arena you look for ways to be more efficient and increase profit which allows you to increase wages.</p>\n<p>I did go back to college again while running the business in order to obtain an <a href=\"https://esimoney.com/the-value-of-an-mba/\">MBA</a>. The ideas and skills I learned in the MBA program helped to increase our revenue, profits and business value.</p>\n<p>In addition, participating in industry conferences and meetings helped us develop in ways we might never have been aware of otherwise. I think <a href=\"https://esimoney.com/7-steps-to-millions-more-continue-learning-and-developing-skills/\">continual learning</a> and application of what you learn is a key to growing career-related income.</p>\n<p><em><strong>What&#8217;s your work-life balance look like?</strong></em></p>\n<p>Work-life balance has been pretty good most of the time. I think spending a year with my wife as we traveled early in our marriage had a positive impact on that.</p>\n<p>As an owner and manager of the business I worked long hours at times but we also had opportunities for extended time away with our kids.</p>\n<p>When becoming full time volunteers we considered ourselves “employees” but we included our kids in trips and various “work” activities all along the way.</p>\n<p><em><strong>Do you have any sources of income besides your career? If so, can you list them, give us a feel for how much you earn with each, and offer some insight into how you developed them?</strong></em></p>\n<p>We have 3 sources of current taxable income. The approximate amounts are:</p>\n<ul>\n<li>Rental income &#8211; 20K per year.</li>\n<li><a href=\"https://esimoney.com/seven-steps-to-creating-passive-income-through-dividend-investing/\">Dividend and interest income</a> – 25K. This is from our taxable accounts.</li>\n<li>Social Security income – 39K</li>\n</ul>\n<p>I am temporarily taking Social Security income. Since we have a minor child at home there is an additional child benefit (about 66% of my benefit) which makes <a href=\"https://esimoney.com/a-case-for-claiming-social-security-early/\">taking Social Security early</a> more attractive.</p>\n<p>I plan to stop Social Security at age 66-1/2 when our child benefit ends and then wait until age 70 to start Social Security again in order to maximize the total payout.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>SAVE</strong></span></h4>\n<p><em><strong>What is your annual spending?</strong></em></p>\n<p>Our annual spending is about 90,000.</p>\n<p><em><strong>What are the main categories (expenses) this spending breaks into?</strong></em></p>\n<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-3-new.png\"><img class=\"aligncenter size-large wp-image-8798\" src=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-3-new-618x1024.png\" alt=\"\" width=\"618\" height=\"1024\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-3-new-618x1024.png 618w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-3-new-181x300.png 181w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-3-new-768x1272.png 768w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-3-new.png 812w\" sizes=\"(max-width: 618px) 100vw, 618px\" /></a></p>\n<p><em><strong>Do you have a budget? If so, how do you implement it?</strong></em></p>\n<p>Early in our marriage we used a formal budget and tracked everything to the penny. This was a big help at the time and helped us set up good habits so that spending has never gotten out of control for us.</p>\n<p>We do not have a formal budget now. I take a look at credit card purchases and online bank statements fairly regularly. I set up email notifications on both so I get notified when there is a transaction.</p>\n<p>I try to review transactions every few months to see if there is anything amiss and I look at the budgeting tool in Personal Capital to see a current breakdown of expenses. (I like the overview of the Personal Capital tool but I do have to go in and correct auto-generated categories that get mixed up quite regularly.)</p>\n<p>My wife and I will agree on a projected (budget?) amount to set spending targets in major categories and we make any major purchases together.</p>\n<p><em><strong>What percentage of your gross income do you save and how has that changed over time?</strong></em></p>\n<p>Since we are not earning salaries at this time we are not saving.</p>\n<p>I think we saved at a fairly high rate from 1987 to 2000 as our net worth during those 15 years went from 31K to 1,547K excluding the value of the business.</p>\n<p><em><strong>What&#8217;s your best tip for saving (accumulating) money?</strong></em></p>\n<p>Saving money for retirement should be viewed as a required expense which is paid out before many of life’s other “necessities”.</p>\n<p>While flexibility and the freedom to vary from plans is an important part of making good decisions in order to enjoy life’s experiences, developing a habit of funding a savings program is foundational to acquiring a reasonable net worth.</p>\n<p>Developing habits early on like giving regularly to church/charities, saving for retirement and saving for other purposes becomes a way of life. Over time the amounts can be increased but getting started early and being consistent is key.</p>\n<p><em><strong>What&#8217;s your best tip for spending less money?</strong></em></p>\n<p>We have found that spending can easily become such a habit that we don’t realize we are doing it. Many of our best experiences have been in other countries with people who don’t have the same basic resources that we have in western societies. Realizing that many of our own perceived needs are really luxuries for much of the world has helped us consider our spending more carefully.</p>\n<p>We’ve learned to move a little more slowly in making major purchases. We purchase used vehicles and some of our furniture and household items were also purchased used. We are happy to take hand-me-downs from friends or neighbors when appropriate. We use the local library for online books and audio books as well as physical books. We look for local events that we can attend while paying little or nothing in entry fees. We walk a lot which is a great form of exercise and doesn’t cost much… we probably buy more shoes than we would need if not walking so much.</p>\n<p><em><strong>What is your favorite thing to spend money on/your secret splurge?</strong></em></p>\n<p>It’s not a secret that we love to travel and experience cultures different from our own.</p>\n<p>We travel mostly as budget travelers which saves money but also allows us to experience things more like the locals in many settings.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>INVEST</strong></span></h4>\n<p><em><strong>What is your investment philosophy/plan?</strong></em></p>\n<p>We target a long-term average return that will support our retirement plans with a high degree of certainty.</p>\n<p>I think of myself as fairly risk tolerant in investments primarily because I have always had a long-term horizon. So if investments dropped in value I felt fine riding it out over the long haul.</p>\n<p>Now that we are in our mid-sixties we are becoming more interested in the shorter term since we actually are using our investment returns to fund our current expenses.</p>\n<p>We are learning more about retirement planning and appropriate investing and will be developing a written plan in the near future.</p>\n<p>Even though we have been living off of our retirement assets for the past 20 years I think we felt that if we ever had the need, we could stop what we were doing and go get a paying job to increase or replace income if we ever needed to. Now we are looking at a more traditional retirement timing and want to increase security and limit potential losses if possible.</p>\n<p><em><strong>What has been your best investment?</strong></em></p>\n<p>My best investment was buying into and then developing a business over 15 years.</p>\n<p>This provided a good income and a good return on the investment allowing us to be retired by age 45.</p>\n<p><em><strong>What has been your worst investment?</strong></em></p>\n<p>My worst investment was some sort of a futures contract on Mexican Pesos in the late 70’s or early 80’s.</p>\n<p>It was a $5,000 “investment” that turned into $0 overnight.</p>\n<p>It was a good lesson and helped me really take to heart that investing in something you don’t understand is not a good idea. In fact it’s not really an investment at that point – just wild speculation.</p>\n<p><em><strong>What&#8217;s been your overall return?</strong></em></p>\n<p>I don’t have good data to determine my overall return but I do have a pretty good estimate of our net worth each year since 1987.</p>\n<p>Here is that info:</p>\n<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-4-new.png\"><img class=\"aligncenter size-large wp-image-8799\" src=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-4-new-291x1024.png\" alt=\"\" width=\"291\" height=\"1024\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-4-new-291x1024.png 291w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-4-new-85x300.png 85w, https://esimoney.com/wp-content/uploads/2022/06/MI-340-Chart-4-new.png 412w\" sizes=\"(max-width: 291px) 100vw, 291px\" /></a></p>\n<p><em><strong>How often do you monitor/review your portfolio?</strong></em></p>\n<p>I keep track of our portfolio in Personal Capital. At the end of each month I capture the values of each account and copy that into a spreadsheet. I use the spreadsheet to be able to look at different types of assets from a tax perspective.</p>\n<p>I find it’s good to type in the numbers each month, looking at the previous month’s numbers to see how we are doing.</p>\n<p>I don’t get too concerned about up or down movements as history indicates that we are heading in the right direction over time.</p>\n<p>I don’t “watch” the financial markets but I will take a look from time to time.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>NET WORTH</strong></span></h4>\n<p><em><strong>How did you accumulate your net worth?</strong></em></p>\n<p>Consistent savings and investing along with developing the value of a business were our primary accumulation tools.</p>\n<p>Lack of debt was also a factor in increasing our net worth. When we got married my wife had a small amount of student loan debt but that was it. Other than mortgages for the purchase of our homes we have not carried any additional personal debt.</p>\n<p>In the late 1980’s I joined a local investment club and started investing in stocks. We would meet to discuss particular companies and decide whether or not to invest. We invested through Dividend Reinvestment Plans (DRIPs) which allowed small dollar purchases of partial shares and reinvestment of dividends. These transactions had no fees which was not the case with stock brokers in those days!</p>\n<p>I learned about researching and investing and this was a major factor in growing our net worth in the 1990’s.</p>\n<p><em><strong>What would you say is your greatest strength in the ESI wealth-building model (Earn, Save or Invest) and why would you say it&#8217;s tops?</strong></em></p>\n<p>When I consider Earn &#8211; I feel like I have not earned that much in my lifetime. My highest earnings were the 15 years from 1987 to 2001 in which I average about 105K. Before that I made less and since then I have not really had any real earned income.</p>\n<p>I think we have done well with both Save and Invest. I think in both of those categories our strength was not a super power or secret method but rather consistency over time.</p>\n<p><em><strong>What road bumps did you face along the way to becoming a millionaire and how did you handle them?</strong></em></p>\n<p>I can’t really identify any significant road bumps. Well maybe one…</p>\n<p>While we were living internationally, and in a very remote area of the world, I had our investment accounts managed by an advisory firm back home. I felt that since I wasn’t accessible it would be wise to have someone else making decisions with our investments. I didn’t want to have everything crash and just ride it into the ground unaware.</p>\n<p>It turned out that our accounts did go down substantially and then the advisor took us out of equities near the bottom and we missed out on a lot of the upside growth that followed.</p>\n<p>I can’t really say if I would have done anything differently in the situation but I learned that I’d rather be the one making decisions no matter what the outcome when it comes to our investments!</p>\n<p><em><strong>What are you currently doing to maintain/grow your net worth?</strong></em></p>\n<p>Since we are not generating any additional capital to add to the base we are spending whatever we need and reinvesting any excess generated by our net worth.</p>\n<p><em><strong>Do you have a target net worth you are trying to attain?</strong></em></p>\n<p>We do not have a target net worth we are trying to attain.</p>\n<p>Surprisingly it seems like whatever level we attain I’m always interested to see if we can get a little farther ahead of the game.</p>\n<p>I have to say that I’m not primarily motivated by money but it is a way of keeping score in the game and I’m drawn to that.</p>\n<p><em><strong>How old were you when you made your first million and have you had any significant behavior shifts since then?</strong></em></p>\n<p>From preparing this interview I see that I was 40 or 41 when our net worth hit 1,000,000 excluding the value of the business we were building.</p>\n<p>I don’t think it made an impact since we knew the business had some value but placing an accurate value on it was an exercise in futility.</p>\n<p>When I was younger I knew I’d like to be a millionaire someday but it wasn’t a clear goal for me.</p>\n<p>My lifetime goals in those days were to get married at 25 and be able to retire at 50. I beat them both getting married at 24 and being retired by 45.</p>\n<p><em><strong>What money mistakes have you made along the way that others can learn from?</strong></em></p>\n<p>If I was a little younger and planning to stay in one area I think I would get more involved with real estate rentals. This seems like a good fit as a side gig if you follow a good management system.</p>\n<p>I did invest in a number of single family residences before I was married but then moved to another part of the country and had to work hard to sell off my highly leveraged properties since I wasn’t doing a great job of managing them from a long distance.</p>\n<p><em><strong>What advice do you have for ESI Money readers on how to become wealthy?</strong></em></p>\n<p>It’s never too late. Get started and keep at it.</p>\n<p><a href=\"https://esimoney.com/the-best-way-to-maximize-your-investment-return/\">Time is your friend in building wealth</a>.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>FUTURE</strong></span></h4>\n<p><em><strong>What are your plans for the future regarding lifestyle?</strong></em></p>\n<p>We don’t anticipate significant changes in lifestyle.</p>\n<p>We might downsize the home to a condo and/or decide to buy some kind of recreational vehicle to travel/live in part time at some point in the future but not seeing this as a major lifestyle change.</p>\n<p><em><strong>What are your retirement plans?</strong></em></p>\n<p>Since we are already 20 years into retirement we want to have a more definitive plan that allows us to travel and participate in our chosen activities while providing a sense of long term security.</p>\n<p><em><strong>Are there any issues in retirement that concern you? If so, how are you planning to address them?</strong></em></p>\n<p>We navigated the health insurance issue with some years of group coverage as volunteers, some years of high deductible private insurance and some years of healthcare sharing ministries.</p>\n<p>This year my wife and I will be covered by Medicare and we will look at the options for our 16 year old.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>MISCELLANEOUS</strong></span></h4>\n<p><em><strong>How did you learn about finances and at what age did it &#8220;click&#8221;?</strong></em></p>\n<p>I’ve always been interested in business and finance.</p>\n<p>I don’t know when it clicked but I must have been a child. I remember going to the savings and loan association to open an account and get a passbook so I could ride my bicycle over to make deposits and increase my savings.</p>\n<p><em><strong>Who inspired you to excel in life? Who are your heroes?</strong></em></p>\n<p>Both of my parents were great role models. They worked hard but also played hard with the family going on camping trips, boating, dune buggies, etc.</p>\n<p>They were generous with their possessions and I am blessed to have them as my parents.</p>\n<p><em><strong>Do you have any favorite money books you like/recommend? If so, can you share with us your top three and why you like them?</strong></em></p>\n<p>Three money books I read many years ago and enjoyed are:</p>\n<ul>\n<li><a href=\"https://esimoney.com/the-best-personal-finance-books-of-all-time-your-money-or-your-life/\">Your Money Or Your Life</a>&nbsp;</li>\n<li><a href=\"https://esimoney.com/the-best-personal-finance-books-of-all-time-the-richest-man-in-babylon/\">The Richest Man in Babylon</a>&nbsp;</li>\n<li><a href=\"https://esimoney.com/the-best-personal-finance-books-of-all-time-the-millionaire-next-door/\">The Millionaire Next Door</a>&nbsp;</li>\n</ul>\n<p>These days I enjoy reading a few blogs (like this one) and listening to a few podcasts in the personal finance space.</p>\n<p>I also think the Bible has lots of good practical advice about finances and generosity.</p>\n<p><em><strong>Do you give to charity? Why or why not? If you do, what percent of time/money do you give?</strong></em></p>\n<p>We do give to charity. This is something I’ve done since first earning money. My parents taught me to put money in the offering at church when I was a child and it’s a good habit that stuck!</p>\n<p>We always included giving to our church, missions and other charities as part of our everyday expenses. We have both volunteered on various boards of organizations and volunteered full-time for a number of years after selling the business.</p>\n<p>Currently we continue to give to charities. We have set up a <a href=\"https://esimoney.com/the-advantages-of-using-a-donor-advised-fund/\">Donor Advised Fund</a> (DAF) which is not part of our net worth since we have legally given the money to the fund. Currently the DAF has a balance of 256K which we direct to charitable organizations.</p>\n<p>Giving to charity is part of who we are and we want to continue doing this throughout our lives.</p>\n<p><em><strong>Do you plan to leave an inheritance for your heirs (how do you plan to distribute your wealth at your death)? What are your reasons behind this plan?</strong></em></p>\n<p>Currently our will/trust provides some benefit for our children and some benefit for charities.</p>\n<p>We need to work on this in more detail to update and determine appropriate amounts to share with our children and with charities. As we develop a more formal retirement plan it will help us define this more clearly in the near future. I think a part of our plan will include amounts to share with our kids in ways that will benefit and not harm them while we are still alive.</p>\n<p>Overall we are so grateful and feel very blessed to have such wonderful opportunities.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-340/\">Millionaire Interview 340</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-interview-340/feed/",
  "slash:comments": 4
}