{
  "title": "Why Is Hydroelectricity So Green, and Yet Unfashionable?",
  "link": "https://spectrum.ieee.org/hydroelectric-power",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-aerial-view-of-a-long-concrete-dam-the-farther-end-of-yangtze-river-which-rests-on-the-bank-of-a-river-at-which-point-the.jpg?id=31978226&width=1200&height=800&coordinates=0%2C131%2C0%2C131\"/><br/><br/><p>\n<strong>I live in Manitoba</strong>, a province of Canada where all but a tiny fraction of electricity is generated from the potential energy of water. Unlike in British Columbia and Quebec, where generation relies on huge dams, our dams on the Nelson River are low, with hydraulic heads of no more than 30 meters, which creates only small reservoirs. Of course, the potential is the product of mass, the gravitational constant, and height, but the dams’ modest height is readily compensated for by a large mass, as the mighty river flowing out of Lake Winnipeg continues its course to Hudson Bay.\n</p>\n<p>\n\tYou would think this is about as “green” as it can get, but in 2022 that would be a mistake. There is no end of gushing about China’s cheap solar panels—but when was the last time you saw a paean to hydroelectricity?\n</p>\n<hr/>\n<p>\n\tConstruction of large dams began before World War II. The United States got the Grand Coulee on the Columbia River, the Hoover Dam on the Colorado, and the dams of the Tennessee Valley Authority. After the war, construction of large dams moved to the Soviet Union, Africa, South America (Brazil’s Itaipu, at its completion in 1984 the world’s largest dam, with 14 gigawatts capacity), and Asia, where it culminated in China’s unprecedented effort. China now has three of the world’s six largest hydroelectric stations: Three Gorges, 22.5 GW (the largest in the world); Xiluodu, 13.86 GW; and Wudongde, 10.2 GW. Baihetan on the Jinsha River should soon begin full-scale operation and become the world’s second-largest station (16 GW).\n</p>\n<p>\n\tBut China’s outsize drive for hydroelectricity is unique. By the 1990s, large hydro stations had lost their green halo in the West and come to be seen as environmentally undesirable. They are blamed for displacing populations, disrupting the flow of sediments and the migration of fish, destroying natural habitat and biodiversity, degrading water quality, and for the decay of submerged vegetation and the consequent release of methane, a greenhouse gas. There is thus no longer a place for Big Hydro in the pantheon of electric greenery. Instead, that pure status is now reserved above all for wind and solar. This ennoblement is strange, given that wind projects require enormous quantities of embodied energy in the form of steel for towers, plastics for blades, and concrete for foundations. The manufacture of solar panels involves the environmental costs from mining, waste disposal, and carbon emissions.\n</p>\n<p class=\"pull-quote\">\n\tIn 2020 the world’s hydro stations produced 75 percent more electricity than wind and solar combined and accounted for 16 percent of all global generation\n</p>\n<p>\n\tAnd hydro still matters more than any other form of renewable generation. In 2020, the world’s hydro stations produced 75 percent more electricity than wind and solar combined (4,297 versus 2,447 terawatt-hours) and accounted for 16 percent of all global generation (compared with nuclear electricity’s 10 percent). The share rises to about 60 percent in Canada and 97 percent in Manitoba. And some less affluent countries in Africa and Asia are still determined to build more such stations. The largest projects now under construction outside China are the \n\t<a href=\"https://spectrum.ieee.org/squabbling-over-the-waters-of-the-river-nile\" target=\"_self\">Grand Ethiopian Renaissance Dam</a> on the White Nile (6.55 GW) and Pakistan’s Diamer-Bhasha (4.5 GW) and Dasu (4.3 GW) on the Indus.\n</p>\n<p>\n\tI never understood why dams have suffered such a reversal of fortune. There is no need to build megastructures, with their inevitable undesirable effects. And everywhere in the world there are still plenty of opportunities to develop modest projects whose combined capacities could provide not only excellent sources of clean electricity but also serve as long-term \n\t<a href=\"https://spectrum.ieee.org/4-new-ways-to-store-renewable-energy-with-water\" target=\"_self\">stores of energy</a>, as reservoirs for drinking water and irrigation, and for recreation and aquaculture.\n</p>\n<p>\n\tI am glad to live in a place that is reliably supplied by electricity generated by low-head turbines powered by flowing water. Manitoba’s six stations on the Nelson River have a combined capacity slightly above 4 GW. Just try to get the equivalent here from solar in January, when the snow is falling and the sun barely rises above the horizon!\n</p>\n<div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/11327493?672664\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div>\n<p>\n<em>This article appears in the November 2022 print issue as “Hydropower, the Forgotten Renewable.”</em>\n</p>",
  "pubDate": "Thu, 27 Oct 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/hydroelectric-power",
  "category": [
    "Renewable energy",
    "Hydroelectric power",
    "Hydroelectric dam"
  ],
  "dc:creator": "Vaclav Smil",
  "media:content": ""
}