{
  "id": "yt:video:8nOk2emgad4",
  "yt:videoId": "8nOk2emgad4",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Gotham Knights is the Batman game we need but don't deserve",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-21T15:00:08+00:00",
  "updated": "2022-10-31T05:58:28+00:00",
  "media:group": {
    "media:title": "Gotham Knights is the Batman game we need but don't deserve",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Thank you to WB Games for sponsoring this video! #GothamKnightsSponsored\nClick here to buy the game: https://www.inflcr.co/SHF5A\n\nGotham Knights is a brand-new open-world, third-person action RPG featuring the Batman Family. Step into the roles of Batgirl, Nightwing, Red Hood and Robin, and rise up as the new protectors of Gotham City in the wake of Batman’s death.\nCustomize your Knight with new gear and looks as you play through all the new, original story solo or in online co-op with a friend and come face to face with some of the most infamous villains in DC’s Batman Universe (such as Mr. Freeze, Harley Quinn, Clayface, and the mysterious Court of Owls).\nGotham Knights is available now on Playstation 5, Xbox Series S/X, and PC.\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nGotham Knights is an upcoming action role-playing game developed by WB Games Montréal and published by Warner Bros. Interactive Entertainment. It is set to be released on October 21, 2022, for Microsoft Windows, PlayStation 5, and Xbox Series X/S. Inspired by the Batman: Gotham Knights comic series based on the DC Comics character Batman and his supporting cast, the game focuses on the characters Nightwing, Batgirl, Robin, and Red Hood as they attempt to restore justice to Gotham City during a period of decline in the immediate aftermath of Batman's death. While investigating Batman's disappearance, the heroes come into conflict with the Court of Owls, a secret society that is as old as Gotham itself, and their legion of brainwashed assassins called Talons.\n\nGotham Knights is an upcoming action role-playing game set in an open world Gotham City.[2] The game features four playable characters: Nightwing, Batgirl, Robin, and Red Hood. Each character has their own unique playstyle and abilities,[3] such as Robin being able to teleport via the Justice League's satellite.[4] Players can level up their characters, but enemies will be automatically leveled up as well.[5] They can also use vehicles such as the Batcycle to explore the city.[6] During the daytime, players will occupy the Belfry, which acts as the team's base of operations and allows players to switch characters and prepare for the next mission by managing progression, and upon leaving the Belfry, the game will fast forward to the nighttime.[7]\n\nWhile the narrative campaign can be played solo, the game also features a two-player cooperative multiplayer mode, wherein the second player can drop in and out at any time without affecting the other one.[8] A separate four-player cooperative mode named \"Heroic Assault\" will be introduced in November 2022. In this mode, players must battle enemies in an arena-like environment while completing various objectives.[9]\n\nThe game is set in Gotham City after the deaths of Bruce Wayne / Batman (Michael Antonakos)[10] and Police Commissioner James Gordon, which has resulted in a rise of crime and police corruption.[11] Players assume the role of four of Batman's former protégés—Dick Grayson / Nightwing (Christopher Sean),[12] Barbara Gordon / Batgirl (America Young),[13] Tim Drake / Robin (Sloane Morgan Siegel),[14] and Jason Todd / Red Hood (Stephen Oyoung)[15]—as they attempt to continue his legacy by protecting Gotham upon receiving a pre-recorded message from Batman.[16] During the game, the heroes encounter several supervillains, including the Court of Owls, Mr. Freeze (Donald Chang),[17][18] Harley Quinn (Kari Wahlgren),[19] Clayface (Brian Keane),[20] and Penguin (Elias Toufexis).[21][22] Supporting characters include Bruce's former butler Alfred Pennyworth (Gildart Jackson)[23] and Police Captain Renee Montoya (Krizia Bajos),[24] one of the few honest cops left in the city.[25]",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}