{
  "title": "A Retrospective Study on the Investigation of Potential Clinical Benefits of Online Adaptive Proton Therapy for Head and Neck Cancer. (arXiv:2211.02035v1 [physics.med-ph])",
  "link": "http://arxiv.org/abs/2211.02035",
  "description": "<p>Online adaptive proton therapy (APT) is an ideal solution theoretically,\nwhich however is challenging to proton clinics. Although multiple groups have\nbeen endeavoring to develop online APT technology, there is a concern in the\nradiotherapy community about the necessity of online APT because of its unknown\nimpact on treatment outcomes. Hence, we have performed a retrospective study to\ninvestigate the potential clinical effects of online APT for HN cancer patients\nin relative to the current offline APT via simulations. To mimic an online APT\ntreatment course, we have recalculated and evaluated the actual dose of the\ncurrent treatment plan on patient actual treatment anatomy captured by cone\nbeam CT for each fraction. The cumulative dose of simulated online APT courses\nwas compared to actual offline APT courses and the initially designed treatment\nplan dose. For patients 1 and 2, the simulated online ART course maintained a\nrelatively higher CTV dose coverages than the offline ART course, particularly\nfor CTV-Low, which led to an improvement of 2.66% and 4.52% in TCP of CTV-Low.\nFor patients 3 and 4, with clinically comparable CTV dose coverages, the\nsimulated online ART course achieved better OAR sparing than the offline ART\ncourse. The mean doses of right parotid and oral cavity were decreased from\n29.52 Gy relative biological effectiveness (RBE) and 41.89 Gy RBE to 22.16 Gy\nRBE and 34.61 Gy RBE for patient 3, leading to a reduce of 1.67% and 3.40% in\nNTCP for the two organs. Compared to the current clinical practice, the\nretrospective study indicated that online APT tended to spare more normal\ntissues by achieving the clinical goal with merely half of the positional\nuncertainty margin. Future studies are needed to help identify the patients\nwith large potential benefits prior to treatment to conserve scarce clinical\nresources.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Chang_C/0/1/0/all/0/1\">Chih-Wei Chang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Bohannon_D/0/1/0/all/0/1\">Duncan Bohannon</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Tian_Z/0/1/0/all/0/1\">Zhen Tian</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Wang_Y/0/1/0/all/0/1\">Yinan Wang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Mcdonald_M/0/1/0/all/0/1\">Mark W. Mcdonald</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Yu_D/0/1/0/all/0/1\">David S. Yu</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Liu_T/0/1/0/all/0/1\">Tian Liu</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Zhou_J/0/1/0/all/0/1\">Jun Zhou</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Yang_X/0/1/0/all/0/1\">Xiaofeng Yang</a>"
}