{
  "title": "E-Skin Sensors Go Chipless and Batteryless",
  "link": "https://spectrum.ieee.org/electronic-skin-chipless-batteryless",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-a-golden-patch-on-a-forearm-a-red-ring-attached-to-gold-piping-hovers-above-it-with-colored-rings-radiating-be.jpg?id=31371138&width=1245&height=700&coordinates=0%2C530%2C0%2C530\"/><br/><br/><p>Wearable sensors now often help keep track of vital signs, but these devices usually rely on bulky microchips and batteries. Now scientists have invented a new microscopically thin “electronic skin” that can wirelessly transmit data about the body’s heart rate and chemistry, all without chips or batteries.<br/></p><p>Recent advances in <a href=\"https://spectrum.ieee.org/laserprinted-polysilicon-transistors-on-paper\" target=\"_self\">flexible</a> and <a href=\"https://spectrum.ieee.org/stretchy-touchpad-could-find-use-in-gaming\" target=\"_self\">stretchable</a> circuits and sensors have enabled the emergence of <a href=\"https://spectrum.ieee.org/skin-circuits\" target=\"_self\">electronic skin</a>, or e-skin, which sticks onto the body like an electronic version of tape. These devices often find use as health-monitoring platforms to keep track of wellness and fitness.</p><p>In order for e-skin devices to find broader use in daily life, they need to communicate data wirelessly. However, this means e-skins typically rely on rigid microchips that limit flexibility and consume a lot of power.</p><p>Now scientists have devised new chipless, wireless electronic skins that “are very thin and imperceptible, because our e-skins do not use thick and rigid integrated-circuit chips,” says study cosenior author <a href=\"http://jeehwanlab.mit.edu/\" target=\"_blank\">Jeehwan Kim</a>, a materials scientist at MIT. “Also, whereas integrated-circuit chips generate a lot of heat because of high power consumption, our e-skins do not. Thus, our e-skins can be worn over long periods—for example, weeks—without causing discomfort or skin injury.”</p><p>The new electronic skin employs sensors that examine acoustic waves rippling across the surfaces of materials. Modern cellphones now each possess dozens of acoustic devices to manipulate these kinds of <a href=\"https://spectrum.ieee.org/acoustic-integrated-circuit\" target=\"_self\">surface acoustic waves</a>.</p><p>These sensors are made of pure single-crystalline gallium nitride membranes only 200 nanometers thick. These <a href=\"https://www.nature.com/articles/nature22053\" target=\"_blank\">extraordinarily thin</a> piezoelectric films can convert electric signals to sound waves and vice versa.</p><p>The scientists reasoned that each gallium nitride membrane would possess its own inherent vibration frequency that its piezoelectric nature would convert into an electrical signal, the frequency of which a smartphone wireless receiver could detect. Any change in the electronic skin’s physical condition would affect its mechanical vibrations, resulting in detectable changes to its electrical signals, all without the need for a chip or battery in the sensor.</p><p>In the new study, the researchers combined these gallium nitride membranes with gold, titanium, and other materials to help serve as the e-skin's antenna. They incorporated the device onto a silicone rubber patch just 20 micrometers thick, or about one-fifth the diameter of the average human hair.</p><p>In experiments, the scientists placed the e-skin on volunteers’ wrists and necks. They were able to monitor changes in the surface acoustic waves of the device related to pulse and heart rate, “which can be useful when tracking exercise and trying to detect heart abnormalities,” Kim says.</p><p>The researchers found e-skin can continuously monitor heart rate and pulse for about 17 hours per day for a week, demonstrating its wearable and reusable nature. Such wireless mechanical sensors could also find use in virtual reality and other entertainment applications that wirelessly detect motions of users, Kim says.</p><p>When the researchers paired the sensors with thin-membrane detectors, changing sodium levels on the skin could be sensed—for instance, when a volunteer held onto a heat pad and began to sweat. The electronic skin could be paired with other sensors to help analyze other chemicals, such as glucose to help monitor diabetes, or the stress hormone cortisol to keep track of depression and panic disorders, Kim says.</p><p>In addition, the scientists found that the sensors were sensitive to ultraviolet light. “Ultraviolet light information can be used to track the exact amount of sun exposure and prevent sunburns, or too little exposure to sunlight that might lead to vitamin D deficiency,” Kim says.</p><p>The scientists detailed <a href=\"http://www.science.org/doi/10.1126/science.abn7325\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a> in the 19 August issue of the journal <em>Science</em>.</p>",
  "pubDate": "Thu, 01 Sep 2022 14:52:12 +0000",
  "guid": "https://spectrum.ieee.org/electronic-skin-chipless-batteryless",
  "category": [
    "E-skin",
    "Wearable sensors",
    "Flexible electronics",
    "Stretchable electronics",
    "Surface acoustic waves",
    "Gallium nitride",
    "Piezoelectric",
    "Electronic skin"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}