{
  "id": "yt:video:l5a9jEtP-vg",
  "yt:videoId": "l5a9jEtP-vg",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Even Microsoft Uses Linux, So Why Don't We??",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-19T19:00:19+00:00",
  "updated": "2022-10-23T13:00:25+00:00",
  "media:group": {
    "media:title": "Even Microsoft Uses Linux, So Why Don't We??",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I’m sure you’ve all heard of Linux. It’s that one open-source operating system that nerds love talking about. But, Linux isn’t just meant for nerds. In fact, virtually all of the largest tech companies in the world use Linux in one form or other thanks to its superior performance when it comes to back-end development. In fact, even Microsoft has switched over from Windows to Linux for their networks, databases, and cloud infrastructure. But, if Linux is so good, why hasn’t the average person even tried it, especially when it's free? Well, one of the main reasons that Linux never gained that much popularity is because its low cost doesn’t really mean much to the vast majority of customers. The vast majority of people just be prebuilt machines and Windows/macOS comes preinstalled for no extra cost. Also, even if you were building your own PC, Microsoft has made it extremely easy to get an unlicensed version of Windows running permanently. On top of this, Linux is usually not as user-friendly because it doesn’t come preinstalled with much software. Not to mention, you often have to use the command line to accomplish simple tasks. This video explains the top reasons that Linux is not very popular despite its free nature and apparent superiority. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - The State Of Linux\n1:45 - Uselessly Free\n4:58 - The Command Line\n7:58 - Virtually No Need\n10:42 - The Truth About Linux\n\nThumbnail Credit:\nShannon Stapleton - Reuters\nhttps://yhoo.it/3ESFT20\n\nResources:\nhttps://pastebin.com/sKG8S6mt",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}