{
  "title": "S14 Ep24: Visions: True Stories of Spiritualism, Secret Societies and Murder",
  "link": "https://audioboom.com/posts/8098606",
  "itunes:episode": 24,
  "itunes:title": "Visions: True Stories of Spiritualism, Secret Societies and Murder",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5958,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Today BEYOND the DARKNESS has Visions: True Stories of Spiritualism, Secret Societies and Murder with Michael T. Keene<br>\n<br>\nMichael walks us thru unsolved mysteries of Masonic-secrets, murder-conspiracies, Native American folklore and the paranormal!<br>\n<br>\nVisit his site and watch get the documentary here: <a href=\"http://www.ad-hoc-productions.com/#\">http://www.ad-hoc-productions.com/#</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nHas life piled on the anxiety to an overwhelming crescendo? Sunday Scaries can give you relief! Sunday Scaries are CBD Gummies custom formulated with a 10mg of blend of broad spectrum and isolate CBD as well as vitamins B12 and D3 for mood boosters. They are made with natural ingredients and are free of gluten, dairy, yeast, egg, soy and peanuts. Get 10 percent off and free shipping  at <a href=\"http://sundayscaries.com\">sundayscaries.com</a> and use the code word DARKNESS .",
  "itunes:summary": "Today BEYOND the DARKNESS has Visions: True Stories of Spiritualism, Secret Societies and Murder with Michael T. Keene\n\nMichael walks us thru unsolved mysteries of Masonic-secrets, murder-conspiracies, Native American folklore and the paranormal!\n\nVisit.",
  "pubDate": "Sun, 24 Mar 2019 08:00:00 +0000",
  "guid": "43fa1b75-0540-4433-9eb6-3a2dbaf04137",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}