{
  "title": "Hermann Morris: The Nail Hub as the Adaptive Entrepreneurial Method in Practice",
  "link": "https://mises.org/node/60843",
  "description": "<p>Breakthrough theory becomes effective practice when it is successful applied by real-life entrepreneurs. The E4B entrepreneurial method is actualized by Hermann and Elizabeth Morris in the very distinctive business model for their brand, The Nail Hub.</p>\n<h3>Knowledge Capsule</h3>\n<h4>The true purpose of a B2B business is to help your customers succeed.</h4>\n<p>While outside observers focus on transactions — how much does this business sell, what are its revenues? — entrepreneurial business owners and operators focus on customers and customer relationships. Revenues follow from relationships. This insight is critical, since it guides business model development.</p>\n<p>Business-to-business models are especially responsive to relationship strategies. When a customer feels that the relationship with a supplier makes their business performance better, they can become a customer for life. That’s a recipe for strong and sustainable growth.</p>\n<h4>First, observe the ecosystem in which you operate, and identify gap opportunities.</h4>\n<p>Systems thinking is an important component of the entrepreneurial method. A firm is a component or a node in a network of interconnected services we can call an ecosystem. Hermann’s and Elizabeth’s ecosystem is the Nail Fashion industry. Nodes include salons and salon owners, the nail technicians (sometimes employees, sometimes independent contractors) who provide service to consumers in the salons, equipment manufacturers and suppliers, product manufacturers and suppliers (for nail gel, etc.), and product distributors.</p>\n<div class=\"media media-element-container media-image_no_caption media-wysiwyg-align-center\"><a href=\"https://cdn.mises.org/evolving-the-nail-hub-business-model.png\" title=\"E4B Graphic: Evolving The Nail Hub Business Model\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-X1tLJbUZ2cw\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"E4B Graphic: Evolving The Nail Hub Business Model\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"1\" alt=\"E4B Graphic: Evolving The Nail Hub Business Model\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/evolving-the-nail-hub-business-model.png?itok=r3by5r_s\" width=\"1160\" height=\"2068\" title=\"\" /></a></div>\n<p>Hermann and Elizabeth were able to identify a number of gaps in the ecosystem. Many salon owners were enthusiastic about their industry but not well-trained or experienced in the basic economics of business. Many of the technicians were passionate about their trade, but not highly trained in the latest techniques and technologies and in product selection. There were aspects of marketing that were underdeveloped, such as audience segmentation. And there were inconsistencies between products in both quality and safety.</p>\n<p>In the mind of the entrepreneur, these gaps are opportunities. The entrepreneurial question is: how best to fit in and contribute to the ecosystem. The business model response is determined by individual entrepreneurial orientation.</p>\n<h4>The beginning orientation was that of an operator.</h4>\n<p>Given their knowledge of both the high potential of the industry and the gaps to be addressed / problems to solve, the Morrises’ entry point was as an operator. They embarked upon the journey to design a differentiated salon experience with superior nail technique, better products, better trained technicians. They ran the salon with better business acumen (they both came from high-level corporate positions and were able to bring sophisticated operating and financial experience). They segmented with an unusual and especially comfortable in-salon appeal, and via location.</p>\n<p>They were successful. There was a lot of learning, which Hermann identifies as overcoming pain points.</p>\n<h4>The next growth step comes from re-orientation to larger scale.</h4>\n<p>How could the Morrises scale their salon business? They thought through multiple openings (e.g., open and operate 20 salons), acquisition (acquire 20 salons), and franchising (sell franchises to multiple independent owners).</p>\n<p>All of these alternatives would require new capability development: establishing standards and a repeatable business model, including a reliable financial model, designing a multi-unit system of supply chains, capital deployment, décor, training and location scouting, and a new kind of marketing to salon managers or franchisees.</p>\n<p>The Morrises were reorienting to thinking as proprietors of a new kind of multi-division business. It’s a different orientation, seeing the same ecosystem from a different perspective.</p>\n<p>Meanwhile, Elizabeth had the idea for a podcast to share her expertise and knowledge and passion for the industry. It was free business advice, free guidance, free technical training, teaching different aspects of running a salon and technical aspects for nail technicians. Its purpose was a service to consumers (better salon experiences), to technicians (better craftsmanship) and owners (better business operations). The podcast was called The Nail Hub. It generated a great positive reputation in the ecosystem and a lot of positive feedback. The knowledge that The Nail Hub podcast shared was enthusiastically welcomed.</p>\n<h4>The Nail Hub podcast feedback resulted in a further re-orientation.</h4>\n<p>The Nail Hub podcast was helping salon owners and those technicians who were independent contractors renting positions in salons to improve the way they ran their businesses: better management, better understanding of customer needs and segmentation, better approaches to pricing, revenue and profits, better techniques, and better products.</p>\n<p>What if a podcast can become a business model? Hermann and Elizabeth developed an entirely new B2B services business model which could be summarized as “educate the industry on how to operate a business, and supply them with the highest quality products to fit their business”.</p>\n<p>Importantly, the education is free to consume. The Nail Hub YouTube channel is free to access, and offers over 140 videos on every aspect of business operations, finances, equipment, products, and techniques. The videos are expensive to produce. The model is that the investment in education will be repaid through loyal customers buying the products that The Nail Hub offers for purchase.</p>\n<p>The curation of products itself is a service. The Nail Hub has identified a distinctive set of criteria for product selection (health, safety, non-toxic ingredients, cruelty-free) and does the research and validation so that purchasers can be confident in their choices and tin he integrity of their promises to the end-consumer.</p>\n<p>The products are not the lowest price, they are the highest quality. Salon owners who have not fully absorbed The Nail Hub’s education on consumer segmentation, pricing, and customer experience will not be a good fit within The Nail Hub’s customer set. The Nail Hub business model has a high internal consistency and integrity.</p>\n<p>The Nail Hub has re-oriented to B2B service provider educating an entire industry to provide superior consumer experiences, better product quality and profitable operations — i.e., re-orienting from facing those challenges to helping others to face and overcome them.</p>\n<h4>One of the cornerstones of the B2B services model is authentic subject matter expertise.</h4>\n<p>The Nail Hub can help salon owners and nail technicians thrive through their independent action because Hermann and Elizabeth developed a deep subject matter expertise. They’ve been salon owners and faced all the developmental issues that owners face. They’ve trained nail technicians. They’ve evaluated salon equipment and they’ve committed their resources and time to researching high quality, innovative products that meet their highest standards. Hermann stresses that the arduous development of subject matter expertise is the necessary foundation for a trusted service business.</p>\n<h4>Another is to choose customers carefully.</h4>\n<p>The Nail Hub is making a substantial investment in their customers via their free training and education. The business model that they enable is specific: the highest standards, with the best trained operators, providing a reliably superior consumer experience. The pricing model is premium, which supports the use of the highest quality products and the provision of the highest quality salon environment. Race-to-the-bottom operators who pursue the lowest prices as a competitive edge are not a good fit in The Nail Hub ecosystem, and Hermann makes this a clear element of The Nail Hub’s B2B communications. Choose your customers to match your positioning.</p>\n<h4>The evaluation of the business model does not lie in conventional metrics.</h4>\n<p>When the business model is to invest in the success of customers, the conventional metrics of revenue, margins and annual profits are not the primary measures of success (although, of course, they must be acknowledged). The evaluation of the model comes via the feedback loops. Is the educational service welcomed? Does it result in better operations on the part of salon owners? Do salon owners and independent technicians become customers for life? Do product manufacturers clamor for entry into The Nail Hub’s curated product set? Are product trends — safe, non-toxic, healthy, etc. — moving in the desired direction?</p>\n<p>This is the entrepreneurial ethic: make customers more successful, make the world a better place.</p>\n<h3>Additional Resources</h3>\n<p>\"Evolving The Nail Hub Business Model\" E4B Graphic (PDF): <strong><a href=\"https://Mises.org/E4B_194_PDF\" target=\"_blank\">Mises.org/E4B_194_PDF</a></strong></p>\n<p>The Nail Hub YouTube Channel: <strong><a href=\"https://www.youtube.com/TheNailHub\" target=\"_blank\">YouTube.com/TheNailHub</a></strong></p>\n<p>The Nail Hub Website: <strong><a href=\"https://www.thenailhub.com/\" target=\"_blank\">TheNailHub.com</a></strong></p>\n\n",
  "author": "Hunter Hastings",
  "guid": 60843,
  "pubDate": "Tue, 01 Nov 2022 10:45:00 -0500",
  "source": "Mises Wire"
}