{
  "title": "How to Fix a Toxic Culture",
  "link": "https://sloanreview.mit.edu/article/how-to-fix-a-toxic-culture/",
  "comments": "https://sloanreview.mit.edu/article/how-to-fix-a-toxic-culture/#respond",
  "pubDate": "Wed, 28 Sep 2022 11:00:54 +0000",
  "dc:creator": "Donald Sull and Charles Sull . <p>Donald Sull (<a href=\"https://twitter.com/culturexinsight\">@culturexinsight</a>) is a senior lecturer at the MIT Sloan School of Management and a cofounder of CultureX. Charles Sull is a cofounder of CultureX. </p>\n",
  "category": [
    "Corporate Culture",
    "Employee Evaluation",
    "Employee Recruitment and Satisfaction",
    "Human Resources",
    "Culture",
    "Leading Change",
    "Organizational Behavior",
    "Workplace, Teams, & Culture"
  ],
  "description": "More than 90% of North American CEOs and CFOs believe that improving their corporate culture would boost financial performance.1 Most of these executives ranked a healthy culture as one of the top three among all factors — including strategy, innovation, brand, patents, and others — in terms of its impact on results. More than 80% [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/09/S2E-Culture-500-Sull-Culture-Detox-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>More than 90% of North American CEOs and CFOs believe that improving their corporate culture would boost financial performance.<a id=\"reflink1\" class=\"reflink\" href=\"#ref1\">1</a> Most of these executives ranked a healthy culture as one of the top three among <em>all</em> factors — including strategy, innovation, brand, patents, and others — in terms of its impact on results. More than 80% also acknowledged that their organization’s culture was not as healthy as it should be. </p>\n<p>If leaders view culture as crucial and needing improvement, you might expect them to focus on improving it. Surprisingly, among executives who said their culture wasn’t working as well as it could, nearly all agreed that leadership failed to invest enough time upgrading corporate culture.<a id=\"reflink2\" class=\"reflink\" href=\"#ref2\">2</a> Lack of leadership investment was, by far, the most important obstacle to closing the gap between cultural aspirations and current reality.</p>\n<p></p>\n<p>If corporate culture is critical and needs work, why don’t top leaders do more to improve it? Part of the reason is that many leaders aren’t sure where to start. For many executives “fixing culture” feels like a hopelessly daunting and amorphous undertaking. Which specific aspects of corporate culture should they focus on fixing? What concrete actions can they take? And how can they measure progress over time? </p>\n<p>In an earlier study, we analyzed 128 topics that employees discussed in Glassdoor reviews, to identify those that best predicted extremely negative reviews. Our analysis identified five attributes of culture — disrespectful, noninclusive, unethical, cutthroat, and abusive — that rendered a culture toxic in the eyes of employees.<a id=\"reflink3\" class=\"reflink\" href=\"#ref3\">3</a></p>\n<p>Toxic workplaces impose serious and lasting harm on affected employees. Workers who experience the elements of a toxic culture are more likely to suffer from greater stress, anxiety, depression, and burnout.<a id=\"reflink4\" class=\"reflink\" href=\"#ref4\">4</a> They are also 35% to 55% more likely to be diagnosed with a serious physical disease.<a id=\"reflink5\" class=\"reflink\" href=\"#ref5\">5</a></p>\n<p>Over time, a toxic culture also takes a heavy toll on organizational performance. For employees with medical benefits, their employer typically pays for health care costs, including those caused by a toxic workplace. When toxic subcultures are allowed to fester within an organization, affected employees are more likely to disengage from their work, bad-mouth their employer on employee review sites like Glassdoor or Indeed, or look for another job.<a id=\"reflink6\" class=\"reflink\" href=\"#ref6\">6</a></p>\n<p>Toxic workplaces are not only costly — they are also common. Our research on large U.S. employers found that approximately 1 in 10 workers experience their workplace culture as toxic, an estimate that is in line with other studies.<a id=\"reflink7\" class=\"reflink\" href=\"#ref7\">7</a> Even companies with healthy cultures overall typically contain pockets of toxicity, due to abusive managers or dysfunctional social norms among certain teams. </p>\n<p>By identifying and addressing these toxic subcultures, a process we refer to as a <em>cultural detox</em>, leaders can dramatically improve employees’ experience and minimize unwanted attrition, disengagement, negative word of mouth, and other costs associated with a toxic workplace.</p>\n<p></p>\n<h3>The Drivers of Toxic Culture</h3>\n<p>For leaders who want to detox their culture, the next question is where to begin. The biggest obstacle, in practical terms, is not too little guidance but <em>too much</em>. A search for “culture change” in Amazon’s Business & Money section returns more than 10,000 books that offer conflicting advice and approaches.<a id=\"reflink8\" class=\"reflink\" href=\"#ref8\">8</a> It’s difficult to know which recommendations to follow because most are grounded in personal anecdotes rather than systematic research. </p>\n<p>To find evidence-based insights on culture change, we began with the large body of existing research on unhealthy corporate culture.<a id=\"reflink9\" class=\"reflink\" href=\"#ref9\">9</a> We first identified 11 meta-analyses, each of which synthesized existing research on specific elements of toxic culture.<a id=\"reflink10\" class=\"reflink\" href=\"#ref10\">10</a> One meta-analysis, for example, aggregated the results of 140 separate studies analyzing the drivers of unethical behavior. </p>\n<p>We then looked for common findings across the meta-analyses.<a id=\"reflink11\" class=\"reflink\" href=\"#ref11\">11</a> Although they focused on different aspects of toxicity, such as disrespect, unethical behavior, and abusive management, the 11 meta-analyses converged on the same three factors as the most powerful predictors of toxic behavior in the workplace: toxic leadership, toxic social norms, and poor work design. </p>\n<p>The figure below shows the average correlation between each driver and the elements of toxic culture. (See “Leadership, Social Norms, and Work Design Drive Toxic Culture.”) When looking at these values, the most important aspect is the relative magnitude of each driver. How leaders behave and the social norms in work groups, for example, are an order of magnitude more important than age or seniority in predicting whether an employee is likely to experience toxic behavior. </p>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Leadership, Social Norms, and Work Design Drive Toxic Culture</h4>\n<p class=\"caption\">A meta-analysis of thousands of studies of corporate culture shows a remarkable level of convergence on the factors that best predict toxic behavior in the workplace. This chart shows the average correlation between each factor and elements of toxic culture across these studies. How leaders behave and the social norms in work groups, for example, are 10 times more highly correlated than an employee’s age or seniority regarding whether they will experience toxic behavior.</p>\n<p><img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/09/Finals_Toxic_Fig1.png\" alt=\"Leadership, Social Norms, and Work Design Drive Toxic Culture\" /></p>\n<p class=\"attribution\">\n</article>\n</aside>\n</div>\n<p>Leadership consistently emerged as the best predictor of toxic culture. The importance of leadership will surprise no one, but it does underscore a fundamental reality: Leaders cannot improve corporate culture unless they are willing to hold themselves and their colleagues accountable for toxic behavior. Our discussion of leadership will focus on both senior executives who set the tone for the organization as a whole, and middle managers and front-line supervisors who create distinctive microcultures within their teams.</p>\n<p>Social norms define what behavior is expected and acceptable in day-to-day social interactions.<a id=\"reflink12\" class=\"reflink\" href=\"#ref12\">12</a> A company might list “respect” among its core values, but its social norms, such as taking “take the time to learn employees’ names” and “don’t keep colleagues waiting for meetings” translate abstract values into concrete behaviors. Social norms can exist within a specific team or unit and shape its subculture. Alternatively, they can be shared across the organization as a whole and constitute an element of corporate culture.<a id=\"reflink13\" class=\"reflink\" href=\"#ref13\">13</a></p>\n<p>Leadership and social norms are densely intertwined. Managers reinforce or undermine norms through their actions, and entrenched social norms influence who is promoted to leadership positions. It is important, however, to recognize that norms and leadership are distinct drivers and not to reflexively blame bad culture on jerk managers. Toxic social norms can take on a life of their own in a team or an organization and persist through multiple changes in leadership.</p>\n<p>Along with leadership behavior and social norms, work design is the third area where leaders can focus effort to detox culture. More than a century of research has pinpointed a handful of elements of work design, such as overall workload and conflicting job demands, that consistently predict important outcomes, including toxic behavior.<a id=\"reflink14\" class=\"reflink\" href=\"#ref14\">14</a>  </p>\n<p>When it comes to whether employees experience a culture as toxic, most demographic attributes — such as age, tenure with the organization, or educational background — have virtually no effect, with a few crucial exceptions. Women and racial minorities are more likely to experience their employer’s culture as toxic for reasons rooted in discrimination and harassment. (See “Race, Gender, and Toxic Culture.”)</p>\n<div class=\"callout-highlight\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Race, Gender, and Toxic Culture</h4>\n<p>Early studies found little relationship between race or gender and the likelihood that an employee would experience their workplace as toxic. A recent and comprehensive meta-analysis of nearly 400 studies, however, documents that women are more likely to experience toxic culture than men, and most of this difference is driven by mistreatment linked to their gender, specifically sexual discrimination and sexual harassment.<a id=\"reflink15\" class=\"reflink\" href=\"#ref15\">15</a></p>\n<p>The same meta-analysis found that racial minorities are also more likely to experience a toxic culture. The gap between racial minorities and White employees was largest in terms of racial discrimination and racial harassment. Historically underrepresented minorities were also more likely to experience bullying and disrespectful behavior in the workplace.</p>\n</article>\n</aside>\n</div>\n<p>There is no one-size-fits-all approach to fixing a toxic culture. The best approach will depend on the individual organization, its strategy, and specific situation.<a id=\"reflink16\" class=\"reflink\" href=\"#ref16\">16</a> In the following sections, we summarize a variety of evidence-based interventions that leaders and companies can implement, organized around these key drivers of toxic culture: leadership (with top leadership and distributed leadership interventions broken out separately), social norms, and work design. (See “Key Drivers for Addressing a Toxic Workplace.”) Leaders can select the approaches best suited to their own context.</p>\n<p></p>\n<h3>Top Leaders Commit to and Sustain Focus on Cultural Detox</h3>\n<p>“The only thing of real importance that leaders do is to create and manage culture,” observed Ed Schein, who pioneered the study of corporate culture.<a id=\"reflink17\" class=\"reflink\" href=\"#ref17\">17</a> The tight link between leadership and culture is underscored by a survey of North American executives, who identified the CEO as the single most important factor in setting corporate culture.<a id=\"reflink18\" class=\"reflink\" href=\"#ref18\">18</a></p>\n<p>Without a commitment from the top team, any organizationwide culture change — including a cultural detox — is destined to fail. Cultural change requires a holistic approach that incorporates multiple interventions and a sustained focus over time.<a id=\"reflink19\" class=\"reflink\" href=\"#ref19\">19</a> Only the top team has access to all the levers of cultural change, including hiring and promotion decisions, budgets for coaching, organizationwide measurement, and the ability to roll out these actions in a coordinated fashion. </p>\n<p>A large body of research highlights the powerful effect the top team has on corporate culture. If a company’s CEO has served in the military, for example, it is 70% less likely to engage in corporate fraud compared with similar organizations.<a id=\"reflink20\" class=\"reflink\" href=\"#ref20\">20</a> Unfortunately, toxic management also trickles downward.<a id=\"reflink21\" class=\"reflink\" href=\"#ref21\">21</a> If a senior team tolerates opportunistic behavior, employees are more likely to commit accounting fraud and insider trading.<a id=\"reflink22\" class=\"reflink\" href=\"#ref22\">22</a></p>\n<p>Top leadership can use the following evidence-based interventions to effect positive cultural change throughout their organizations. </p>\n<p><strong>Quantify the benefits of cultural detox to keep it on the top team’s agenda.</strong> Employees are understandably baffled when the top team fails to address toxicity. In the C-suite, however, dozens of worthwhile objectives vie for the leadership team’s attention.<a id=\"reflink23\" class=\"reflink\" href=\"#ref23\">23</a> Once you layer on external shifts that demand executive attention, including ideological polarization, the pandemic, geopolitical instability, and macroeconomic uncertainty, it’s easier to understand why senior leaders lose focus on cultural change. </p>\n<p>In our experience, the vast majority of CEOs are genuinely concerned about their employees and want to do the right thing. They can keep cultural detox on the agenda by explicitly linking cultural improvements to bottom-line benefits, such as lower attrition or employee health care costs. To be clear, leaders should address cultural toxicity because it’s the right thing to do, but quantifying the benefits can help keep culture detox a priority for top teams that are being pulled in many directions.</p>\n<p><strong>Publicly report progress to keep the pressure on.</strong> Transparency and external pressure can help senior leaders maintain focus when it comes to detoxing their culture. Top teams can invite external pressure to stay the course by publicly reporting progress against their cultural aspirations (rather than simply posting a list of core values on the corporate website).</p>\n<p>Any U.S. employer with more than 100 workers is required to file an annual report with the Equal Employment Opportunity Commission listing the race, ethnicity, and gender of employees by job category. These reports are confidential, but companies can voluntarily disclose how well they are doing in terms of diversity. As of September 2021, only 11% of the largest 1,000 U.S. companies disclosed their results or more granular data.<a id=\"reflink24\" class=\"reflink\" href=\"#ref24\">24</a> Large public companies might feel more pressure to report progress in the future as institutional investors push for clarity on how they treat their employees.<a id=\"reflink25\" class=\"reflink\" href=\"#ref25\">25</a></p>\n<p><strong>Model the behavior you expect from employees.</strong> Employees look to leaders for guidance on culture, but they tend to discount lofty statements about abstract values. Instead, they closely observe what leaders <em>do</em> for signals about what behavior is encouraged, expected, and tolerated. </p>\n<p>Many employees are justifiably skeptical about how well their leaders live corporate values in their daily actions. More than 80% of large U.S. companies have official core values, with integrity, respect, and diversity among the most frequently listed, but there is no correlation between what companies aspire to and how employees assess them on corporate core values.<a id=\"reflink26\" class=\"reflink\" href=\"#ref26\">26</a> When leaders act consistently with core values, however, it is one of the most powerful predictors of how positively employees rate their corporate culture.<a id=\"reflink27\" class=\"reflink\" href=\"#ref27\">27</a></p>\n<p></p>\n<p><strong>Track progress with honest data.</strong> In many organizations, bad news about toxic behaviors gets filtered out as it moves up the hierarchy. As a result, top leaders often think they’ve done a better job addressing toxic culture than they actually have.<a id=\"reflink28\" class=\"reflink\" href=\"#ref28\">28</a> In a survey of 16,000 managers across nearly 500 companies, top executives were 24% more likely to say that they addressed unethical behavior quickly and consistently compared with how well middle managers thought the C-suite dealt with unethical actions.<a id=\"reflink29\" class=\"reflink\" href=\"#ref29\">29</a> Top executives were 48% more likely to believe they dealt effectively with cutthroat managers.</p>\n<p>External data from job sites like Glassdoor or Indeed can provide <a href=\"https://sloanreview.mit.edu/projects/measuring-culture-in-leading-companies/#chapter-3\">unvarnished feedback</a> on how well an organization is doing in addressing toxic culture throughout its ranks. The topics employees discuss in online reviews can reliably predict whether a company is likely to commit corporate misconduct or be sued.<a id=\"reflink30\" class=\"reflink\" href=\"#ref30\">30</a> Leaders cannot afford to disregard external employee reviews when trying to assess their corporate culture, warts and all. </p>\n<h3>Distributed Leaders Shape Healthy Microcultures</h3>\n<p>Senior leaders shape corporate culture through their actions and the example they set. They also influence culture indirectly based on the distributed leaders they hire, retain, and promote. Middle managers and supervisors at every level in the organization can create distinctive microcultures, even when they are subject to the same corporate policies, compensation plans, and other organizationwide practices. </p>\n<p>Misconduct among financial advisers illustrates the profound influence distributed leaders have when it comes to creating a toxic subculture.<a id=\"reflink31\" class=\"reflink\" href=\"#ref31\">31</a> A recent study found that middle managers are 2.5 times more important in predicting employee misconduct compared with companywide factors. The relative importance of middle managers was even greater (six times the company-level effect) among managers who were farther away from headquarters and could exercise more discretion with less oversight.<a id=\"reflink32\" class=\"reflink\" href=\"#ref32\">32</a> Empowering managers has many advantages, but autonomy also leaves more scope to create a toxic subculture.</p>\n<p>Local leaders are twice as important as company-level policies in terms of whether an employee with a track record of misconduct is promoted or fired. Not dealing with unethical employees comes at a high cost because, for example, financial advisers who have committed misconduct in the past are five times more likely to do so in the future.<a id=\"reflink33\" class=\"reflink\" href=\"#ref33\">33</a> Cumulatively, the personnel decisions made by distributed leaders can have a large impact on overall corporate culture. At USAA Financial Advisors, for example, less than 3% of brokers had committed misconduct, compared with nearly 20% at Oppenheimer & Co.<a id=\"reflink34\" class=\"reflink\" href=\"#ref34\">34</a></p>\n<p>Below are some evidence-based interventions to decrease toxic behavior among distributed leaders. These same steps can, of course, also help top teams improve their behavior.  </p>\n<p><strong>Coach distributed leaders on nontoxic behavior.</strong> A substantial body of research finds that coaching enhances managers’ attitudes, helps them achieve work goals, and boosts resilience.<a id=\"reflink35\" class=\"reflink\" href=\"#ref35\">35</a> There is less evidence on toxic behavior, but a few studies suggest that coaching may help managers avoid toxic behaviors.</p>\n<p>In one study across four hospitals, nursing supervisors were randomly assigned to coaching sessions offering practical tips to treat employees with dignity and respect, demonstrate emotional support, and avoid bullying behavior.<a id=\"reflink36\" class=\"reflink\" href=\"#ref36\">36</a> The researchers measured the impact of the coaching by tracking insomnia among the nurses who reported to the managers. Insomnia is a well-documented and objectively measurable consequence of a toxic workplace. Nurses whose managers had received the coaching had much lower levels of insomnia, and those benefits persisted at least six months after the training ended. </p>\n<p>Not all managers, however, respond well to coaching. Some are primarily concerned about presenting a positive public image rather than genuinely treating people better.<a id=\"reflink37\" class=\"reflink\" href=\"#ref37\">37</a> Managers who score higher on measures of psychopathy, for example, are more likely to abuse other people.<a id=\"reflink38\" class=\"reflink\" href=\"#ref38\">38</a> These managers, characterized by aggression and a lack of empathy, are also less likely to modify their behavior even when they understand the pain they cause subordinates. Although the term “psychopath” is bandied about frequently in the business literature, the actual prevalence of such individuals is very low. Approximately 1% of the total population qualify as psychopaths (with a slightly higher percentage among managers), which suggests that the majority of managers struggling with toxic behaviors might benefit from coaching.<a id=\"reflink39\" class=\"reflink\" href=\"#ref39\">39</a></p>\n<p><strong>Make distributed leaders aware of the negative impact of their toxic behavior on colleagues.</strong> Organizations can reduce toxic behavior by making managers aware of the pain their behavior causes for their team, along with the impact that abusive behavior has on their own reputation. Two studies analyzed 271 managers across a range of industries and found that managers felt less valued at work after they mistreated a subordinate.<a id=\"reflink40\" class=\"reflink\" href=\"#ref40\">40</a> To regain their feeling of social worth, managers treated team members better afterward to make amends for their earlier abuse. </p>\n<p>Initiatives to improve workplace safety show that informing leaders about how their behavior affects subordinates can inspire positive change. Half of the supervisors in a manufacturing factory were randomly assigned to receive two coaching sessions. In each session, the shop supervisors received feedback on how their subordinates perceived the supervisor’s prioritization of safety (relative to other concerns, such as productivity or speed).<a id=\"reflink41\" class=\"reflink\" href=\"#ref41\">41</a> The shop-floor supervisors also received tips and discussed tactics for reinforcing social norms that promoted safety. The teams led by leaders who received coaching reduced unsafe behavior and accidents, while there was no change in the control group.<a id=\"reflink42\" class=\"reflink\" href=\"#ref42\">42</a></p>\n<p><strong>Make behavioral expectations crystal clear.</strong> Organizations can also decrease the odds of toxic behavior simply by ensuring that managers are clear about the behavior that is expected of them. Financial advisers must pass an exam (known as the Series 66) to be licensed. Studying for the exam requires a significant time investment, typically at least 50 hours of preparation. Historically, 80% of the questions focused on knowledge of rules and ethical considerations, while the remaining 20% were devoted to technical topics like financial reporting and finance theory.<a id=\"reflink43\" class=\"reflink\" href=\"#ref43\">43</a> Studying for the ethical component of the exam helped potential brokers build a clear understanding of exactly which behaviors were not acceptable. </p>\n<p>In 2010, the Series 66 exam reduced the ethics and rules portion to half of all questions. Advisers who passed the exam with more emphasis on ethics were 25% less likely to commit misconduct than colleagues who took the ethics-light version of the exam. The advisers who passed the more ethics-intensive version of the exam were also more likely to quit companies that tolerated financial misconduct, such as Wells Fargo.</p>\n<p></p>\n<p><strong>Deal with distributed leaders who deliver results but create toxic subcultures.</strong> Top leaders can send a strong signal about their commitment to a healthy culture by dealing with managers who achieve their financial objectives but contribute to a toxic culture. Unfortunately, this is more rare than one might imagine. In a survey of 16,000 managers, only 39% of respondents said that leaders dealt promptly with employees who hit their numbers but cut corners ethically.<a id=\"reflink44\" class=\"reflink\" href=\"#ref44\">44</a> In the same survey, fewer than 1 in 5 managers reported that top executives promptly and consistently addressed leaders who delivered results but failed to collaborate with other teams. </p>\n<p>Companies can nip the problem in the bud by not promoting toxic individuals to management positions in the first place. Unfortunately, companies too often make promotion decisions based on performance as an individual contributor rather than on a candidate’s ability to create a healthy subculture. A recent study of sales representatives and managers at 131 companies across multiple industries found that companies were more likely to promote “lone wolves” (who did not share leads or sales credits) to sales management positions, and bypass candidates who collaborated better with their colleagues.<a id=\"reflink45\" class=\"reflink\" href=\"#ref45\">45</a> Promoting uncollaborative employees to management can foster cutthroat subcultures that ultimately hurt the bottom line. Sales teams led by lone wolves booked 30% less sales compared with teams led by more collaborative managers.</p>\n<p>Firing abusive managers is another way to address toxic culture, and leaders should not shy away from making that decision when it’s warranted. But we view this as a last rather than first resort for a few reasons. In many cases, managers can be coached to smooth out their rough edges. It’s also important to verify that a manager truly is toxic rather than outspoken, demanding, or gruff. As Robert Sutton argues in his 2007 book <cite>The No Asshole Rule</cite>, it’s critical to exercise caution when labeling someone a jerk.<a id=\"reflink46\" class=\"reflink\" href=\"#ref46\">46</a></p>\n<p></p>\n<p>Finally, it’s critical to guard against implicit biases when dealing with managers who are perceived as toxic. In the financial advising industry, for example, women are less likely to commit financial misconduct than men, and their misconduct is, on average, less serious.<a id=\"reflink47\" class=\"reflink\" href=\"#ref47\">47</a> Women nevertheless are 20% more likely than men to be fired for misconduct and 30% less likely to find a new position after losing their job.</p>\n<h3>Establish Healthy Social Norms</h3>\n<p>It’s hard to overstate how powerfully social norms shape behavior, as the case of workplace safety illustrates. Although every worker has a strong incentive to avoid personal injury, there were over 2 million workplace injuries in the U.S. in 2020.<a id=\"reflink48\" class=\"reflink\" href=\"#ref48\">48</a> The strongest predictor of on-the-job accidents is social norms around safety, which have a greater impact on workplace injuries than employees’ individual characteristics (such as how conscientious or risk-averse employees are), work pressure, or the riskiness of the job itself.<a id=\"reflink49\" class=\"reflink\" href=\"#ref49\">49</a></p>\n<p>Toxic social norms increase the odds that even good people will behave poorly. Less than 8% of financial advisers commit financial fraud.<a id=\"reflink50\" class=\"reflink\" href=\"#ref50\">50</a> If a broker moves to a branch office where colleagues have a history of misconduct, however, they are 37% more likely to commit misconduct in the following three years.<a id=\"reflink51\" class=\"reflink\" href=\"#ref51\">51</a> To give another example, when groups tolerate disrespectful behavior, their rudeness invites retaliation. Reciprocal retaliation hardens into social norms that fuel a downward spiral of continued incivility.<a id=\"reflink52\" class=\"reflink\" href=\"#ref52\">52</a></p>\n<p></p>\n<p>When it comes to improving toxic norms, the most important thing to remember is that norms act at the group level rather than the individual level. People follow social norms because their colleagues do the same. Any improvement of social norms, therefore, requires a coordinated change in expectations and behavior for the group as a whole, rather than one or two team members making unilateral changes.<a id=\"reflink53\" class=\"reflink\" href=\"#ref53\">53</a>  </p>\n<p>The following evidence-based interventions provide concrete guidance on improving toxic norms. </p>\n<p><strong>Let work groups define their own social norms.</strong> The best-documented case of changing social norms to improve a toxic culture comes from the Veterans Health Administration (VHA), the health system that provides medical care to veterans of the U.S. military.<a id=\"reflink54\" class=\"reflink\" href=\"#ref54\">54</a> The Civility, Respect, and Engagement in the Workplace (CREW) intervention was launched in 2005 after a series of internal studies revealed that disrespectful and abusive behaviors were widespread and contributed to increased medical staff stress, employee attrition, and patient dissatisfaction.  </p>\n<p>The CREW process takes place in an intact work group (typically 10 to 15 employees) who meet weekly for six months to brainstorm, test, and adopt new social norms to improve respect in the workplace. In the early sessions, teams discuss evidence on how respectful interactions improve outcomes and discuss what respectful interactions look like in their context. (Norms of civility in a rural Southern clinic might vary from those in a large hospital in New York City, for example.) The teams collect initial data on employee and patient perceptions of civility to establish a baseline and measure future progress. Rather than implementing a one-size-fits-all methodology dictated by corporate, each group develops social norms customized to its unique situation — and is thus more likely to adhere to those norms.<a id=\"reflink55\" class=\"reflink\" href=\"#ref55\">55</a></p>\n<p>Throughout the course of their weekly meetings, participants brainstorm concrete ideas to improve respectful interactions. Facilitators help keep the discussions on track, but the team members themselves identify the sources of incivility in their work group and take responsibility for developing and incorporating new ways of interacting, tailored to their unique team dynamics.<a id=\"reflink56\" class=\"reflink\" href=\"#ref56\">56</a> Team members track progress over the course of the week, logging acts of civility or disrespect they observe during the week, for example, or calling out colleagues who violate emerging norms. </p>\n<p>The initial pilots of the CREW process significantly improved respectful behavior in the VHA work groups, and these benefits persisted over time. As of 2022, the VHA has rolled out the CREW program to over 1,200 work groups.<a id=\"reflink57\" class=\"reflink\" href=\"#ref57\">57</a></p>\n<p>CREW has proved to be effective outside the VHA network as well. An experiment in a Canadian hospital system, for instance, found that compared with control teams, groups that implemented CREW achieved significant improvements in respectful behavior, job satisfaction, and trust in management, while employee burnout and absenteeism dropped.<a id=\"reflink58\" class=\"reflink\" href=\"#ref58\">58</a> The CREW model works only when team members voluntarily choose to participate and they have the slack and staffing to participate in the weekly discussions.<a id=\"reflink59\" class=\"reflink\" href=\"#ref59\">59</a></p>\n<p><strong>Have distributed leaders lead discussions of social norms.</strong> Leaders at every level in the organization can reduce toxic behavior by explicitly discussing social norms with their teams. Consider, for example, a program to bolster ethical behavior among combat troops in the U.S. Army. In the wake of human rights violations and detainee abuse at the Abu Ghraib prison in Iraq, the U.S. Army administered a survey to assess the state of battlefield ethics among soldiers.<a id=\"reflink60\" class=\"reflink\" href=\"#ref60\">60</a> The results were sobering. Fewer than half of the soldiers said they were willing to report a member of their unit for unethical behavior, 13% said they had damaged a civilian’s property, and 6% admitted to striking noncombatants. </p>\n<p>In response, the commanding general in Iraq commissioned a program to improve battlefield ethics. The program was designed to ensure that every soldier participated in at least one highly interactive discussion of the norms of acceptable behavior in combat situations.<a id=\"reflink61\" class=\"reflink\" href=\"#ref61\">61</a> The sessions focused on common battlefield scenarios, including the treatment of noncombatants, rules of engagement, and the reporting of ethical violations.<a id=\"reflink62\" class=\"reflink\" href=\"#ref62\">62</a> Soldiers watched short vignettes of battlefield scenes from movies like <cite>Platoon</cite> and <cite>Black Hawk Down</cite>, discussed them, and then talked through similar situations they faced in Iraq. </p>\n<p>The discussions were led not by external consultants but by commanders in the field — signaling that officers from the top brass down considered battlefield ethics important. Each officer led a discussion with their immediate subordinates in a small group setting using the video vignettes as a framework to discuss common ethical dilemmas. After participating in a discussion led by their commanding officer, a subordinate would then lead a similar discussion with their own direct reports. Similar to medical education, which has long relied on the approach of “see one, do one, teach one” to accelerate and solidify learning among interns, this cascading approach allowed combat leaders to consolidate how they would approach ethical dilemmas by discussing it with their commanding officer and then with their subordinates.<a id=\"reflink63\" class=\"reflink\" href=\"#ref63\">63</a></p>\n<p>The Army surveyed a random sample of soldiers a few months after the training program and found sharp reductions in unethical behavior. Soldiers reported a 63% reduction in damage to private property and an even larger reduction in the mistreatment of noncombatants. Soldiers also said they were 80% more likely to report a member of their unit for destroying private property. </p>\n<p><strong>Collect credible, granular data on subcultures and leaders.</strong> When it comes to toxicity, you cannot manage what you do not measure. Unfortunately, in most organizations, formal reporting procedures do not surface bad behavior. One study of sexual harassment found that only 30% of employees told anyone at their employer about their experience and an even smaller percentage lodged a formal complaint.<a id=\"reflink64\" class=\"reflink\" href=\"#ref64\">64</a></p>\n<p>A comprehensive study by one mining company found that less than 8% of employees who experienced bullying, sexual harassment, or racism reported the incidents through formal reporting channels.<a id=\"reflink65\" class=\"reflink\" href=\"#ref65\">65</a> Employees, especially women and minority men in management positions, avoid speaking up because they are afraid of being fired or passed over for promotions in retaliation for surfacing issues.<a id=\"reflink66\" class=\"reflink\" href=\"#ref66\">66</a></p>\n<p>Most large organizations collect cultural and leadership data from multiple sources, including engagement surveys, pulse surveys, upward feedback, 360-degree reviews, and exit interviews. They often fail, however, to combine these data sources into a holistic view of leadership and culture throughout the organization. </p>\n<p>Leaders need holistic, granular data to identify toxic microcultures, root out abusive leaders, and understand the perspectives of distinctive demographic groups. The principles below summarize what we’ve learned about translating the voices of employees into actionable insights to eliminate toxicity and achieve other cultural objectives.</p>\n<p></p>\n<ul>\n<li><strong>Mine the powerful insights buried in free-text responses.</strong> Most employee surveys include a series of multiple-choice questions, with one or two open-ended questions tacked on as an afterthought. Employees’ free-text responses, however, often provide the most powerful and actionable insights. The choice of which topics an employee mentions surfaces the issues that matter most to <em>them</em> rather than limiting their feedback to the topics covered by the multiple-choice questions. Free-text responses provide rich and nuanced insights on the reasons underlying employees’ numerical ratings. Free-text questions also prevent employees from switching to autopilot. We’ve found that when employees are faced with a long list of multiple-choice questions, nearly three-quarters of them answer virtually every question — regardless of topic — with the same two responses.</li>\n<li><strong>Check in on a regular basis.</strong> Short surveys that ask a few open-ended questions are less cumbersome to complete compared to a long list of five-point items. With short, free-text based surveys, organizations can check in with employees on a regular basis without overwhelming them with long surveys.</li>\n<li><strong>Benchmark against competitors and peers.</strong> Managers sometimes dismiss toxic behavior as par for the course in their industry, but companies like HEB and Costco have built extremely healthy cultures in industries plagued by toxicity. Benchmarking allows leaders to understand what is possible. Employee review platforms such as Glassdoor or Indeed are valuable resources for understanding how a culture compares with those of industry peers and an aspirational set of benchmark companies.</li>\n<li><strong>Measure microcultures at a granular level.</strong> When fielding surveys and opportunities for feedback, it’s important to remember that distinctive pockets of culture can coexist within the organization and diverge widely from one another. Relying solely on corporate culture averages obscures crucial differences across teams.</li>\n<li><strong>Measure subcultures created by individual leaders.</strong> A front-line supervisor or middle manager is often the most powerful determinant of toxicity at the team level. By aggregating employee feedback from a manager’s direct and indirect reports, you can build a rich picture of the subculture distributed leaders have built.</li>\n<li><strong>Measure leadership traits and capabilities.</strong> The free text of performance reviews or terms employees use in upward feedback often provide important clues about toxic behavior among managers. Even if employees avoid harsh criticisms like “toxic” or “abusive,” their feedback couched in disclaimers (“could appear that you are aggressive”) or watered-down terms (“overly assertive”) collectively provides important clues to potentially toxic behavior. Similarly, if a leader is never described as “supportive” or “inclusive,” whereas such terms are frequently used to describe their peers, you may have uncovered a problem. Combining feedback on individual managers with the subcultures of their teams provides powerful insights on which leadership traits have the biggest impact on culture.</li>\n<li><strong>Make it safe for employees to provide useful feedback.</strong> <a href=\"https://sloanreview.mit.edu/article/fostering-ethical-conduct-through-psychological-safety\">Psychological safety</a> is critical to surfacing and rooting out toxic behavior. Employees will not provide candid feedback if they fear that managers can figure out who said what and retaliate for negative comments. Managers must guarantee anonymity and protect employees from retribution.</li>\n<li><strong>Take action based on employee feedback.</strong> One of the most common complaints we hear is that management administers survey after survey but never acts on the feedback it receives. If employees are going to take the time and effort to provide their insights, leaders owe it to them to act on the key findings, communicate actions taken, and make progress visible.</li>\n</ul>\n<h3>Redesign Work to Reduce Stress</h3>\n<p>A large body of evidence supports what most of us know instinctively — that high-stress workplaces contribute to negative outcomes, including employee attrition, mental health issues, physical illness, burnout, and increased risk of death.<a id=\"reflink67\" class=\"reflink\" href=\"#ref67\">67</a> Less well known, but equally important, is that stressful jobs are a breeding ground for toxic behavior.<a id=\"reflink68\" class=\"reflink\" href=\"#ref68\">68</a></p>\n<p>Regulating emotions and resisting negative impulses require energy.<a id=\"reflink69\" class=\"reflink\" href=\"#ref69\">69</a> Mental stress depletes limited stores of energy, making it harder for people to control their negative impulses. Research has documented that managers who are stressed out and exhausted are more likely to lapse into abusive behavior. The employees on the receiving end of abuse are themselves more likely to exhibit toxic behavior when they, too, are stressed.<a id=\"reflink70\" class=\"reflink\" href=\"#ref70\">70</a></p>\n<p>Dozens of factors go into work design, but a few specific aspects are especially important in predicting employee stress.<a id=\"reflink71\" class=\"reflink\" href=\"#ref71\">71</a> When rethinking work design, it’s best to focus on elements of the job known to influence employee stress, such as the following.</p>\n<p><strong>Reduce nuisance work.</strong> It might seem that the most obvious way to mitigate occupational stress is to reduce workloads by removing tasks from employees' plates, capping the number of hours they work per week, or providing more resources and staffing without increasing job demands. Not all work, however, has the same effect on stress.</p>\n<p>Employees may frame certain elements of a heavy workload, such as expanded job responsibilities or tight deadlines, as a challenge that will help them advance their career or develop new skills. When work is framed as a positive challenge, it is still associated with higher levels of stress but also with increased employee engagement.<a id=\"reflink72\" class=\"reflink\" href=\"#ref72\">72</a></p>\n<p>Other elements of the job, such as dealing with red tape, unclear roles and responsibilities, or insufficient resources, are typically viewed as nuisances that provide no tangible benefits to employees. Annoying job demands are more highly correlated with employee stress and burnout than work that employees frame as challenging.<a id=\"reflink73\" class=\"reflink\" href=\"#ref73\">73</a></p>\n<p><strong>Clarify job descriptions and responsibilities.</strong> Employees are more likely to find their job stressful and their workplace toxic when their duties are ambiguous, or when their job requires them to balance conflicting demands.<a id=\"reflink74\" class=\"reflink\" href=\"#ref74\">74</a> Leaders can reduce stress by clearly structuring job descriptions and defining roles and responsibilities. One recent study found that team members who work for an abusive boss are less likely to resort to toxic behaviors themselves when they have more structured job descriptions.<a id=\"reflink75\" class=\"reflink\" href=\"#ref75\">75</a> </p>\n<p>Although role conflict is a major source of stress, eliminating it is difficult in cases where jobs require employees to manage trade-offs across multiple stakeholders and objectives.<a id=\"reflink76\" class=\"reflink\" href=\"#ref76\">76</a> In these situations, providing employees with more frequent, high-quality feedback on their performance can help them manage conflicting demands with less stress.<a id=\"reflink77\" class=\"reflink\" href=\"#ref77\">77</a></p>\n<p><strong>Give employees more control over their work.</strong> In our synthesis of toxic culture meta-analyses, giving employees autonomy over their work was almost as powerful at predicting reductions in toxic behavior as reducing employees’ workloads. Providing employees more control over their work can mitigate the negative impact of unclear or conflicting roles and responsibilities.<a id=\"reflink78\" class=\"reflink\" href=\"#ref78\">78</a> Leaders should not, however, view this as a license to pile ever more tasks on their employees, because empowerment cannot offset extreme levels of work.<a id=\"reflink79\" class=\"reflink\" href=\"#ref79\">79</a> </p>\n<p>Allowing remote work may — or may not — increase employee stress and the likelihood of toxic behavior. A few studies conducted before the COVID-19 pandemic provide suggestive evidence that remote work may reduce employee stress.<a id=\"reflink80\" class=\"reflink\" href=\"#ref80\">80</a> The physical demands of a job — including temperature, noise, and ergonomics — are strongly correlated with stress.<a id=\"reflink81\" class=\"reflink\" href=\"#ref81\">81</a> To the extent an employee’s home workspace is more pleasant than their office, working from home might well reduce stress. On the other hand, social support is an important factor in reducing workplace stress, and remote work may increase worker isolation.<a id=\"reflink82\" class=\"reflink\" href=\"#ref82\">82</a> At this stage, the jury is still out about whether, and under what circumstances, remote work reduces employee stress. </p>\n<p><strong>Help employees get a good night’s sleep.</strong> A stressful job can cause insomnia, both by leaving fewer hours to sleep and causing stress that results in sleepless nights.<a id=\"reflink83\" class=\"reflink\" href=\"#ref83\">83</a> Sleep-deprived managers are more likely to abuse their subordinates or act in an unethical manner. This can fuel a vicious cycle, because a toxic workplace further interferes with employees’ sleep.<a id=\"reflink84\" class=\"reflink\" href=\"#ref84\">84</a></p>\n<p>Fortunately, interventions such as cognitive behavioral therapy have proved effective in helping employees improve their sleep.<a id=\"reflink85\" class=\"reflink\" href=\"#ref85\">85</a> Although improving sleep hygiene might not directly reduce workplace stress, it does help employees cope, and can attenuate the link between stress and toxic behavior.</p>\n<p></p>\n<p>Employees can respond to a toxic workforce through exit (disengaging from their work or quitting the organization), voice (lodging complaints with management or posting negative reviews of their employer), or loyalty (sticking with the employer despite the toxicity).<a id=\"reflink86\" class=\"reflink\" href=\"#ref86\">86</a> Employers that have ignored feedback about toxic behavior — whether widespread or in small pockets — should not be surprised when employees’ loyalty wears thin and they head for the exits.</p>\n<p></p>\n<p>Many leaders bemoaned employee turnover during the Great Resignation. High rates of job switching, however, provide powerful signals that corporate culture is not working for many employees. A tight labor market can also provide a much-needed impetus to address toxicity. Surgical interns complained about 100-hour workweeks for decades, but it wasn’t until applications for surgical internships dropped in the early 2000s that teaching hospitals began to improve working conditions for doctors in training.<a id=\"reflink87\" class=\"reflink\" href=\"#ref87\">87</a></p>\n<p>Employees who vote with their feet send a clear signal that they will no longer tolerate disrespect, exclusionary behavior, abuse, and other toxic behaviors. In such situations, organizational leaders face two choices. They can detox their corporate culture or lose the war for talent. We hope this article serves as a useful resource for leaders as they begin to address toxic culture, stop unwanted attrition, and create a healthy work environment that respects the dignity of all employees. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/how-to-fix-a-toxic-culture/feed/",
  "slash:comments": 0
}