{
  "title": "21: Episode 21",
  "link": "https://audioboom.com/posts/7336357",
  "itunes:episode": 21,
  "itunes:title": "Episode 21",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4289,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our December 25th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>If there is so much to talk about concerning Christmas in the <em>Harry Potter</em> series, just why do we know so little about Professor Sinistra and her Astronomy class? Are a person’s Patronus and Animagus form the same? Is Tom Felton too different from Draco’s character to be a success in later films? And while the crew debates the disappearance of Harry’s scar upon the fall of the Dark Lord, will the veil and Sirius’ mirror reappear in the Final Book? Plus, who initiated contact first: Wormtail or Voldemort?<br>\n<br>\n\n</div>\n<div>From MuggleCast Christmas stories to song parodies…all that and more ahead with Andrew, Ben, Eric, Kevin, Jamie, and Laura on this week’s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Our biggest group ever with six co-hosts</li>\n<li>GOF Soundtrack winners to be announced next week</li>\n<li>10 Things NOT to get Harry for Christmas</li>\n<li>Does Christmas matter in the <em>Harry Potter</em> series?</li>\n<li>We hit the voicemail box and go in-depth</li>\n<li>Why did the Dursleys get Harry glasses?</li>\n<li>What role will Neville play in the series?</li>\n<li>What’s up with Sinistra?</li>\n<li>Who initiated contact first, Voldemort or Wormtail?</li>\n<li>Is Draco’s portrayal in the movies adequate enough for the future of the series?</li>\n<li>Did JKR exclude the veil and Sirius’s mirror purposely? Will we hear of them again?</li>\n<li>Are a person’s Animagus form and Patronus the same?</li>\n<li>How binding is the contract made by the Triwizard cup?</li>\n<li>Will Harry’s scar disappear upon Voldemort’s demise?</li>\n<li>Jamie tells his Christmas-themed British Joke of the Day</li>\n<li>We recite “The Night Before MuggleCast,” courtesy of Kelly Egan</li>\n<li>Listen to the singing/writing talent of your fellow fans through Song Parodies.</li>\n</ul>\n",
  "pubDate": "Sun, 25 Dec 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-08-08:/posts/7336357",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}