{
  "title": "Apple’s Metaverse Snub Highlights AR/VR Tech Woes",
  "link": "https://spectrum.ieee.org/apple-virtual-reality-metaverse-snub",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/apple-s-roomplan-was-the-company-s-only-key-ar-innovation-at-wwdc.jpg?id=29985046&width=1245&height=700&coordinates=0%2C231%2C0%2C232\"/><br/><br/><p>\n<a href=\"https://developer.apple.com/wwdc22/\" target=\"_blank\">Apple’s Worldwide Developer Conference</a> (WWDC) earlier this month was headlined by Apple’s new <a href=\"https://en.wikipedia.org/wiki/Apple_M2\" target=\"_blank\">M2 processor</a> and <a href=\"https://en.wikipedia.org/wiki/IOS_16\" target=\"_blank\">dramatic changes to iOS</a>. But what stood out most was Apple’s silence on the metaverse. Its <a href=\"https://spectrum.ieee.org/this-is-the-year-for-apples-ar-glassesmaybe\" rel=\"nofollow\" target=\"_self\">rumored AR/VR headset, and the RealityOS operating system it may use</a>, was nowhere to be seen.\n</p>\n<p>\n\tThis could be interpreted as a snub. But Apple has a very particular target in mind: Meta.\n</p>\n<p>\n\t“Metaverse, as a term, only really gained momentum when Meta started talking about it,” says <a href=\"https://moorinsightsstrategy.com/anshel-sag/\" rel=\"noopener noreferrer\" target=\"_blank\">Anshel Sag, principal analyst at Moor Insights & Strategy</a>. Facebook’s rebrand immediately generated headlines on every major tech website, spiked Google searches for the term, and <a href=\"https://spectrum.ieee.org/metaverse-real-estate\" target=\"_self\">drove a boom in virtual real estate</a>.\n</p>\n<p>\n\tThis, of course, is not to Apple’s benefit, and gives Tim Cook plenty of reason to keep the term out of his mouth. But it’s more than a marketing ploy. The vision of the metaverse put forward by Meta is fundamentally opposed to what Apple might embrace should it bring an AR/VR (augmented reality/virtual reality) headset to market.\n</p>\n<p class=\"pull-quote\">\n\t“There was a lot of anxiety in the industry about what Apple was going to announce. Now that they didn’t, there’s almost a sense of relief.”<br/>\n\t—Anshel Sag, Moor Insights & Strategy\n</p>\n<p>\n\t“Meta has shipped 15 million [Oculus Quest] units, but they’re doing it in a way that costs them,” says Sag. “They’re probably shipping at a loss on hardware.”<br/>\n</p>\n<p>\n\tZuckerberg’s vision of an “embodied Internet” is focused on social platforms and services. The Quest headset is impressive and, <a href=\"https://www.polygon.com/23068620/meta-quest-cambria-vr-headset-virtual-pet-facebook\" target=\"_blank\">if projects like the Cambria VR headset come to market</a>, will soon see a generational leap. But Meta’s real goal is the establishment of a new social platform—not developing and selling AR/VR headsets.\n</p>\n<p>\n\tFor Apple, innovative hardware is the entire point. Whether that hardware is used to access Meta’s metaverse, another company’s platform, or isolated experiences crafted by small developers, is almost irrelevant.\n</p>\n<p>\n\tApple’s alternative to Meta’s embodied Internet will likely be a broad offering spanning the iPhone, iPad, Mac, and a future AR/VR headset. The metaverse may simply be an app (or apps) competing with other AR/VR experiences across multiple devices.\n</p>\n<p>\n\t“I wouldn’t read too much into Apple not using the word <em>metaverse</em>,” says <a href=\"https://omdia.tech.informa.com/authors/george-jijiashvili\" rel=\"noopener noreferrer\" target=\"_blank\">George Jijiashvili, principal analyst at Omdia</a>. “Rather, focus on what it’s actually doing to enable experiences which could support virtual social interactions in the future.”\n</p>\n<h2>Competitors breathe a sigh of relief</h2>\n<p>\n\tAside from the new RoomPlan Swift API, a technology that developers can use to quickly create 3D floor plans of real-world spaces, Apple had no all-new AR/VR announcements. RealityOS, the operating system rumored to power Apple’s upcoming headset, wasn’t even teased.\n</p>\n<p>\n\tThis seems a vote of no confidence in all things metaverse and, perhaps, the entire AR/VR space. However, Jijiashvili warns against such pessimism. “The reality is that Apple has many strengths in this space, which it continues to gradually improve,” says Jijiashvili.\n</p>\n<p>\n\tHe points out Apple has acquired over eight AR/VR startups since 2015. <a href=\"https://developer.apple.com/augmented-reality/\" target=\"_blank\">ARKit</a>, Apple’s augmented-reality development platform for iOS devices, continues to see interest from developers, including big names like Snapchat and even Instagram, which is owned by Meta.\n</p>\n<p>\n\tHowever, Apple’s lack of news gives the rest of the industry the chance to prepare for its seemingly inevitable push into the space. Though consumer headsets are dominated by Meta, which produces <a href=\"https://www.idc.com/promo/arvr\" rel=\"noopener noreferrer\" target=\"_blank\">nearly 80 percent of all headsets sold</a>, the industry is rife with midsize companies like HTC, Valve, DPVR, Magic Leap, Pico, Lumus, Vuzix, Pimax, and Varjo—to name just a few. Apple’s arrival in the space could threaten these innovators.\n</p>\n<p>\n\t“There was a lot of anxiety in the industry about what Apple was going to announce,” says Sag. “Now that they didn’t, there’s almost a sense of relief.”\n</p>\n<h2>AR headsets face headwinds</h2>\n<p>\n\tApple’s decision not to show its headset, which is believed to support both AR and VR, strongly hints the company isn’t satisfied with its progress.\n</p>\n<p>\n\tIt’s not alone. <a href=\"https://www.theinformation.com/articles/meta-scales-back-ar-glasses-plan-amid-reality-labs-shakeup\" rel=\"noopener noreferrer\" target=\"_blank\">Meta reportedly delayed an upcoming AR headset</a>, known as Project Nazare. The Magic Leap 2 and Microsoft HoloLens 2 seem trapped in the niche world of high-end enterprise solutions despite years of work by both companies.\n</p>\n<p>\n\tAR, it seems, is hard to get right.\n</p>\n<p>\n\tThis leaves no serious alternative to Meta’s Quest 2 on the horizon. Its successor, Project Cambria, is rumored to target a 2022 release and may have little competition if launched this year. “The focus may have shifted more towards VR than people really expected,” says Sag.\n</p>\n<p>\n<a href=\"https://spectrum.ieee.org/is-the-metaverse-even-feasible\" target=\"_self\">The metaverse faces serious challenges</a>, but the dearth of AR alternatives gives Meta time to work out issues. And there’s always the possibility Apple’s headset will, like <a href=\"https://spectrum.ieee.org/whats-apples-filings-say-about-its-selfdriving-car-program\" rel=\"nofollow\" target=\"_self\">the company’s rumored self-driving car</a>, fail to appear. Meta’s vision of a fully embodied metaverse could win by default if the alternatives never show up on store shelves.\n</p>",
  "pubDate": "Thu, 16 Jun 2022 14:59:49 +0000",
  "guid": "https://spectrum.ieee.org/apple-virtual-reality-metaverse-snub",
  "category": [
    "Metaverse",
    "Virtual reality",
    "Augmented reality",
    "Meta",
    "Apple",
    "Oculus"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}