{
  "title": "New York City: Data Science’s Best Bet for Growth and Opportunity",
  "link": "https://blog.insightdatascience.com/new-york-city-data-sciences-best-bet-for-growth-and-opportunity-5349983e0490?source=rss-de04a04c4ff3------2",
  "guid": "https://medium.com/p/5349983e0490",
  "category": [
    "new-york-city",
    "insight-data-science",
    "data-science"
  ],
  "dc:creator": "Drew Conway",
  "pubDate": "Fri, 29 Sep 2017 16:08:43 GMT",
  "atom:updated": "2017-09-30T00:11:09.846Z",
  "content:encoded": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*2M3P6cMl_vTtJdDxVmzOuQ.png\" /></figure><p><em>New York has had a </em><a href=\"http://mattturck.com/2012/05/07/the-thriving-data-ecosystem-in-nyc/\"><em>thriving data science scene</em></a><em> for some time, and while there are a few </em><a href=\"http://mattturck.com/2016/07/13/the-nyc-tech-ecosystem-catching-up-to-the-hype/\"><em>reasons to be cautious</em></a><em> about its continued capacity for expansion, the data world is </em><a href=\"http://www.businessinsider.com/heres-why-new-yorks-tech-sector-will-surpass-silicon-valleys-2017-2\"><em>predicting great things</em></a><em> for New York City’s tech ecosystem.</em></p><p><em>However, in light of some of the hurdles New York can present to tech companies, the tech community is prone to asking: “Why New York?”</em></p><p><em>Drew Conway has the answer. Founder of </em><a href=\"http://www.alluvium.io/\"><em>Alluvium</em></a><em>, Venn-diagram aficionado, and </em><a href=\"http://insightdatascience.com/?utm_source=whydsny&utm_medium=blog&utm_content=top\"><em>Insight Data Science</em></a><em> mentor, Drew has been a mainstay in New York’s data science community for nearly a decade. He’s launched companies, built teams, and contributed to the underlying tech infrastructure that has ensured the ongoing success of NYC’s data community. In this post, we get Drew’s take on </em><strong><em>why New York has always been and continues to be the best place to be a data scientist, and the best place to grow a data science company and build a data science team.</em></strong></p><h3>Why New York City?</h3><blockquote>“The [2008 financial crisis] created a perfect storm of talent exiting afflicted institutions and investment money fleeing the public sector markets.”</blockquote><h4>First, some history</h4><p>Contrary to popular belief, New York has actually always been a major data science hub. The reason New York is often overlooked as a cornerstone of the data science community is because almost all the city’s data scientists were previously locked within enormous institutions like banks, ad agencies, and major media companies. They held vague and cryptic titles like <em>quant</em>, <em>statistician</em>, or <em>business intelligence analyst</em>.</p><p>Instead of thinking of themselves as a community that could leverage their expertise to transform how data is used, they maintained focus on building specific analytical tools and products for their own particular domains of expertise. This went on for years.</p><p>But then something really tragic happened: the financial crisis of 2008, which delivered a huge blow to the city of New York; to both its denizens and its businesses. However, out of this calamity came an opportunity. The crisis created a perfect storm of talent exiting afflicted institutions and investment money fleeing the public sector markets.</p><p>Most significantly, New York’s data scientists started coming together to talk about their work and ideas. This gathering of diverse backgrounds and experiences spawned a unique, cohesive data science community that, quite frankly, doesn’t exist anywhere else in the world.</p><h4>Diversity of talent and of thought</h4><blockquote>“As a diverse group comprised of skeptical academics, social sector employees, and public and municipal organizations, data scientists in NYC deal with the question of how data is really serving people on a daily basis.”</blockquote><p>One of the reasons New York’s data community stands out from the rest is that it is the best at recognizing the need for both natural sciences and social sciences to come together to do truly great and innovative data work. Part of our job as data scientists is to be good at math and modeling complex systems, while also incorporating a deep understanding of human decision making, the most complex system there is. New York’s data science community is a diverse collection of talented data scientists who are uniquely able to balance and implement both of these components into their work.</p><p>New York’s data scientists have not only helped to build many innovative and successful businesses (AppNexus, Bitly, Tumblr, Kickstarter, Jet.com, Vimeo, Oscar Health, Enigma, Greenhouse, MongoDB, ZocDoc, OnDeck, Etsy, Venmo, Blue Apron, Fast Forward Labs, Clarifai, etc. etc.) but the Data for Good movement started here too. There are numerous New York-based organizations that have put using data for social good at the core of what they do, such as DataKind, Crisis Text Line, Murmuration, Mt. Sinai’s Arnhold Institute for Global Health, and Teachers Pay Teachers, as well as the NYC Mayor’s Office for Data & Analytics, founded in 2013 under Mayor Bloomberg.</p><p>As a diverse group comprised of skeptical academics, social sector employees, and public and municipal organizations, data scientists in NYC deal with the question of how data is really serving people on a daily basis. They also take the time to step back and ask “Okay, there’s lots of good work happening, but what are the limits?” New York City’s density and diversity support this kind of questioning, by keeping all of us in direct contact with the users and consumers we’re hoping to serve.</p><h4>Density as a forcing function</h4><blockquote>“If you work at a software firm where you sit by yourself and imagine what your customer needs or wants are, you’ll never be as successful as you could if you’re able to walk down the street from your office and talk directly to your customers.”</blockquote><p>Bustling sidewalks and crowded subways aside, New Yorkers living in close proximity to one another has benefits for folks in enterprise businesses as well. A common challenge for many startups is the constant need to better understand their users. Who is using our product? How are they using it? What issues are they having? If you work at a software firm where you sit by yourself and imagine what your customer needs or wants are, you’ll never be as successful as you could if you’re able to walk down the street from your office and talk directly to your customers. New York City has more Fortune 500 companies than any other city in the US. It’s HQ central for so many industries: media, advertising, financial services, banking, fashion, large-scale retail… the list goes on and on.</p><p>In New York, we almost take it for granted that on any given day, whether it’s at <a href=\"https://datasociety.net/\">Data & Society</a>, at <a href=\"http://insightdatascience.com/\">Insight Data Science</a>, or at <a href=\"http://civichall.org/\">Civic Hall</a>, there are conversations going on about what it means to be a professional data scientist. Instead of staying buried in a text editor all day, many of us are grappling with the ethical and social challenges that come with data science. And in New York City, there is an appetite to discuss and share the latest trends and topics in data science.</p><p>The community’s diversity and willingness to ask the “hard questions” about what we’re capable of are reflected in the ecosystem of companies that have emerged in New York. One of the biggest challenges currently facing all data scientists is a lack of a clear career trajectory. What does it mean to be a “Head of Data Science” or “Chief Data Officer”? At the moment there are now a lot of data scientists but not a lot of data science managers. What does it mean to develop leadership inside this community? What are the things that we need to do to create the <em>next</em> generation of data science leaders from all the people sitting in our big tent?</p><p>The good news for the world’s future data scientists and managers is that building an innovative data team in New York is not only possible, but their best bet for opportunity and growth. The community’s diversity will allow them to combine methodologies that work well from fields with more established pathways like software engineering, scientific research careers, or product management, and mesh them with less obvious systems modeled after those in finance, healthcare, design, and media. Our ability to foster conversation and collaboration across these areas is what will eventually allow those of us in NYC to shape the trajectory of data science careers well into the future.</p><p><strong><em>Interested in transitioning to a career in data science?</em></strong><em> Find out more about the </em><a href=\"http://insightdatascience.com/?utm_source=whydsny&utm_medium=blog&utm_content=bottom\"><em>Insight Data Science Fellows Program</em></a><em> in Boston, New York, Seattle, and Silicon Valley, </em><a href=\"http://insightdatascience.com/apply?utm_source=whydsny&utm_medium=blog&utm_content=bottom\"><em>apply</em></a><em> today, or </em><a href=\"http://insightdatascience.com/notify?utm_source=whydsny&utm_medium=blog&utm_content=bottom\"><em>sign up</em></a><em> for program updates.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=5349983e0490\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://blog.insightdatascience.com/new-york-city-data-sciences-best-bet-for-growth-and-opportunity-5349983e0490\">New York City: Data Science’s Best Bet for Growth and Opportunity</a> was originally published in <a href=\"https://blog.insightdatascience.com\">Insight</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}