{
  "title": "Anthropometric History, Quebec, and the Antebellum Height Puzzle with Vincent Geloso",
  "pubDate": "Sat, 25 Mar 2017 00:22:40 +0000",
  "guid": "c9e5fc1cdb62c4a4804bf3765b5d0351",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP49Geloso2_EDR.mp3",
  "itunes:image": "",
  "description": "<p><a href= \"http://economicsdetective.com/2016/11/re-thinking-u-curve-inequality-vincent-geloso/\" target=\"_blank\">Returning to the podcast</a> is Vincent Geloso of Texas Tech University.</p> <p>Our topic for this episode is anthropometric history, the study of history by means of measuring humans. Doing serious historical research into the distant past is difficult work, because the further you look back in time, the less information you can access. For the 20th century we have wonderful thing like chain-weighted real GDP. Going back further, we have some statistics, lots of surviving physical evidence, and loads of documents and writings. Going further than that, we're left with the odd scrap of thrice-copied surviving manuscripts and second-hand accounts from people who lived centuries after the events they describe. And going even further than that, we have just bones and dilapidated temples with the occasional inscription.</p> <p>Anthropometric history allows us to look into the distant past at what economic historians like Vincent hope might be a good measure of different populations' health and standards of living: their heights. People who have healthy upbringings with lots of access to food tend to be taller than people who don't; that's why modern humans are much taller than they were a thousand or even a hundred years ago.</p> <p>Vincent has contributed to this literature with his latest co-authored paper, <a href= \"http://www.sciencedirect.com/science/article/pii/S1570677X17300643\" target=\"_blank\">The Heights of French-Canadian Convicts, 1780s to 1820s</a>. The abstract reads as follows:</p> <blockquote>This paper uses a novel dataset of heights collected from the records of the Quebec City prison between 1813 and 1847 to survey the French-Canadian population of Quebec—which was then known either as Lower Canada or Canada East. Using a birth-cohort approach with 10 year birth cohorts from the 1780s to the 1820s, we find that French-Canadian prisoners grew shorter over the period. Through the whole sample period, they were short compared to Americans. However, French-Canadians were taller either than their cousins in France or the inhabitants of Latin America (except Argentinians). In addition to extending anthropometric data in Canada to the 1780s, we are able to extend comparisons between the Old and New Worlds as well as comparisons between North America and Latin America. We highlight the key structural economic changes and shocks and discuss their possible impact on the anthropometric data.</blockquote> <p>Listen to the full episode for our fascinating discussion of this branch of historical research, including the so-called \"Antebellum puzzle,\" the anomalous observation that American heights decreased in the years prior to the Civil War even though the economy was apparently growing rapidly. We also discuss the heights of slaves in the American South, who were taller than their white counterparts despite being oppressed as slaves.</p> <hr /> <p> </p>",
  "content:encoded": "<p><a href= \"http://economicsdetective.com/2016/11/re-thinking-u-curve-inequality-vincent-geloso/\" target=\"_blank\">Returning to the podcast</a> is Vincent Geloso of Texas Tech University.</p> <p>Our topic for this episode is anthropometric history, the study of history by means of measuring humans. Doing serious historical research into the distant past is difficult work, because the further you look back in time, the less information you can access. For the 20th century we have wonderful thing like chain-weighted real GDP. Going back further, we have some statistics, lots of surviving physical evidence, and loads of documents and writings. Going further than that, we're left with the odd scrap of thrice-copied surviving manuscripts and second-hand accounts from people who lived centuries after the events they describe. And going even further than that, we have just bones and dilapidated temples with the occasional inscription.</p> <p>Anthropometric history allows us to look into the distant past at what economic historians like Vincent hope might be a good measure of different populations' health and standards of living: their heights. People who have healthy upbringings with lots of access to food tend to be taller than people who don't; that's why modern humans are much taller than they were a thousand or even a hundred years ago.</p> <p>Vincent has contributed to this literature with his latest co-authored paper, <a href= \"http://www.sciencedirect.com/science/article/pii/S1570677X17300643\" target=\"_blank\">The Heights of French-Canadian Convicts, 1780s to 1820s</a>. The abstract reads as follows:</p> This paper uses a novel dataset of heights collected from the records of the Quebec City prison between 1813 and 1847 to survey the French-Canadian population of Quebec—which was then known either as Lower Canada or Canada East. Using a birth-cohort approach with 10 year birth cohorts from the 1780s to the 1820s, we find that French-Canadian prisoners grew shorter over the period. Through the whole sample period, they were short compared to Americans. However, French-Canadians were taller either than their cousins in France or the inhabitants of Latin America (except Argentinians). In addition to extending anthropometric data in Canada to the 1780s, we are able to extend comparisons between the Old and New Worlds as well as comparisons between North America and Latin America. We highlight the key structural economic changes and shocks and discuss their possible impact on the anthropometric data. <p>Listen to the full episode for our fascinating discussion of this branch of historical research, including the so-called \"Antebellum puzzle,\" the anomalous observation that American heights decreased in the years prior to the Civil War even though the economy was apparently growing rapidly. We also discuss the heights of slaves in the American South, who were taller than their white counterparts despite being oppressed as slaves.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "40:06",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "is Vincent Geloso of Texas Tech University. Our topic for this episode is anthropometric history, the study of history by means of measuring humans. Doing serious historical research into the distant past is difficult work, because the further you..."
}