{
  "title": "S1E5 - From World Champion Gymnast to World Renowned Coach with Kim Zmeskal",
  "guid": "https://pinecast.com/guid/af17bc09-97a1-4074-9eec-309de9842754",
  "pubDate": "Tue, 07 Jul 2020 07:30:49 -0000",
  "itunes:duration": "00:57:33",
  "description": "<p>This week, Laura is extremely excited (and geeking out a little bit) as she welcomes one of her childhood heroes, Kim Zmeskal. to the podcast. Kim is a National Champion, World Champion, Olympic Bronze Medalist, and the first American to win the All-Around World Championship title in gymnastics. Currently, she co-owns Texas Dreams Gymnastics with her husband Chris Burdette in Coppell, Texas, and coaches there as well.</p>\n<p>Today, Laura talks to Kim about her illustrious career in gymnastics, including the 1991 World Championships, as well as the times that she retired and then returned to the sport. They also delve into her transition into coaching, what she has learned through it, how her coaching style compares to the coaches she had, and her opinion on the top qualities for being a coach. Kim also offers some valuable advice for recognizing and acting upon abuse. As you listen, you will soon discover that Kim has a great deal of wisdom to share not only about gymnastics, but about life as well, proving that she truly deserves the heroic status which Laura has bestowed upon her.</p>\n<p>Episode Highlights:</p>\n<p>Kim’s gymnastic career and her reflections upon it\n1991 World Championships\nThe times that Kim retired from and returned to gymnastics\nHer transition to coaching and what she has learned from it\nComparing how she coaches to how she was coached\nKim’s opinion on the most important qualities in a coach\nHer advice regarding recognizing and acting upon abuse</p>\n<p>Quotes:</p>\n<p>“You’re living through history, and sometimes living through history is not always comfortable.”</p>\n<p>“Define before you go into something what is going to make you happy with it.”</p>\n<p>“It’s okay to grieve a broken or lost dream, but you can’t stay there.”</p>\n<p>“How do I help convince them that they have the tools to do it, is really more what it is.”</p>\n<p>“This is both ways, we’re all learning through this.”</p>\n<p>“Keep encouraging openness.”</p>\n<p>“We are all evolving humans, and I think if we can be there for each other, and own things, that we can do better and be there to inspire people.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a></p>\n<p>Kim’s Twitter:   <a href=\"https://twitter.com/KimZmeskal\" rel=\"nofollow\">https://twitter.com/KimZmeskal</a></p>\n<p>Kim’s Instagram: <a href=\"https://www.instagram.com/kimzb/\" rel=\"nofollow\">https://www.instagram.com/kimzb/</a> </p>\n<p>Texas Dreams homepage:   <a href=\"http://texasdreams.com/\" rel=\"nofollow\">http://texasdreams.com/</a></p>",
  "itunes:title": "From World Champion Gymnast to World Renowned Coach with Kim Zmeskal",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 5
}