{
  "title": "Ukraine Military Officially Adopts Nazi Slogan",
  "itunes:title": "Ukraine Military Officially Adopts Nazi Slogan",
  "pubDate": "Fri, 11 Mar 2022 09:16:19 +0000",
  "guid": "d9f36762-cf0a-4a69-8a18-9bda6e156cf8",
  "link": "https://thejimmydoreshow.libsyn.com/ukraine-military-officially-adopts-nazi-slogan",
  "itunes:image": "",
  "description": "NATO apologists have sought to portray the Ukrainian military as free of neo-Nazis, but one point undermining the argument is the fact that the nation's armed forces adopted as its official slogan \"Slava Ukraini!\" or \"Glory to Ukraine!\" which was first popularized during World War II by a Nazi-affiliated nationalist militia.<br /> <br /> Plus segments on the Biden administration's humiliating efforts to persuade the \"dictatorial\" Venezuelan government to sell us oil and sad examples of high-minded liberals like Larry Summers, George Takei and Stephen Colbert explaining that paying higher gas prices is YOUR moral duty to support Ukraine.<br /> <br /> Also featuring Stef Zamorano, Lee Camp, Kurt Metzger and Mike MacRae! And phone calls from George Clooney and Andrew Cuomo!",
  "content:encoded": "NATO apologists have sought to portray the Ukrainian military as free of neo-Nazis, but one point undermining the argument is the fact that the nation's armed forces adopted as its official slogan \"Slava Ukraini!\" or \"Glory to Ukraine!\" which was first popularized during World War II by a Nazi-affiliated nationalist militia.  Plus segments on the Biden administration's humiliating efforts to persuade the \"dictatorial\" Venezuelan government to sell us oil and sad examples of high-minded liberals like Larry Summers, George Takei and Stephen Colbert explaining that paying higher gas prices is YOUR moral duty to support Ukraine.  Also featuring Stef Zamorano, Lee Camp, Kurt Metzger and Mike MacRae! And phone calls from George Clooney and Andrew Cuomo!",
  "enclosure": "",
  "itunes:duration": "01:01:10",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "NATO apologists have sought to portray the Ukrainian military as free of neo-Nazis, but one point undermining the argument is the fact that the nation's armed forces adopted as its official slogan \"Slava Ukraini!\" or \"Glory to Ukraine!\" which was...",
  "itunes:episodeType": "full",
  "itunes:summary": "NATO apologists have sought to portray the Ukrainian military as free of neo-Nazis, but one point undermining the argument is the fact that the nation's armed forces adopted as its official slogan \"Slava Ukraini!\" or \"Glory to Ukraine!\" which was first popularized during World War II by a Nazi-affiliated nationalist militia. Plus segments on the Biden administration's humiliating efforts to persuade the \"dictatorial\" Venezuelan government to sell us oil and sad examples of high-minded liberals like Larry Summers, George Takei and Stephen Colbert explaining that paying higher gas prices is YOUR moral duty to support Ukraine. Also featuring Stef Zamorano, Lee Camp, Kurt Metzger and Mike MacRae! And phone calls from George Clooney and Andrew Cuomo!"
}