{
  "title": "Episode 51: &#8220;Matchbox&#8221; by Carl Perkins",
  "link": "https://500songs.com/podcast/episode-51-matchbox-by-carl-perkins/",
  "pubDate": "Mon, 07 Oct 2019 01:08:38 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-51-matchbox-by-carl-perkins/",
  "description": "Episode fifty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Matchbox\" by Carl Perkins, and at the session that turned into the historic Million Dollar Quartet jam session. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a title=\"on \"Ain't Got No Home\" by Clarence \"Frogman\" Henry\" href=\"https://www.patreon.com/posts/30557827\">on \"Blue Yodel #9\" by Jimmie Rodgers.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-51-matchbox/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI've used multiple books for this episode, as it deals with multiple artists.\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. And another book by Guralnick. <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> </a>, is undoubtedly the best book on Elvis ever written.\n\nInformation on Carl Perkins comes from comes from <a href=\"https://amzn.to/2Wqgi6n\"><em>Go Cat Go! The Life and Times of Carl Perkins</em>, by Carl Perkins and David McGee.</a>\n\nInformation on Johnny Cash came from <a href=\"https://amzn.to/2IjcTm9\"><em>Johnny Cash: The Life</em> by Robert Hilburn.</a>\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. <a href=\"https://amzn.to/2IImoLJ\">This one by Rick Bragg</a> is better than most.\n\n<a href=\"https://amzn.to/31kw5HH\">This double-CD collection of Carl Perkins' Sun recordings</a> seems as good as any.\n\nThe early Sun singles are all on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for \"Matchbox\", in a way hearing it in isolation wouldn't, including the first recordings by all the participants in the Million Dollar Quartet.\n\nAnd the complete Million Dollar Quartet recordings themselves can be found <a href=\"https://amzn.to/2LT6sYO\">on this CD</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe're coming to the end of 1956, and with it the end of the first wave of rockabilly. As we've discussed before, by December 1956, only Elvis was left standing as a white rock and roll star from the first wave -- Carl Perkins, Gene Vincent, and Bill Haley had stopped having hits, and Johnny Cash had started to be promoted as a country singer rather than a rock and roller.\n\nBut just because someone has stopped having hits doesn't mean they've stopped making good music, and that was certainly the case for Carl Perkins, who spent the rest of 1956 making records that were every bit as good as his one hit, \"Blue Suede Shoes\". After \"Boppin' the Blues\", the song's unsuccessful follow-up, he released \"Dixie Fried\":\n\n[Excerpt: Carl Perkins, \"Dixie Fried\"]\n\nBut that was no more successful. Perkins was increasingly dissatisfied with the way Sam Phillips was promoting his work, and like Johnny Cash was strongly considering moving to another label.\n\nBut on December the fourth, 1956, Perkins was still working for Sun, and so he was in the studio with his brothers, recording another single that was destined to do very little.\n\nThe A-side, \"Your True Love\", charted, but not very high -- it went to number thirteen on the country charts and only number sixty-seven on the pop charts. It was a decent country record, but not much more than that. The B-side, though, was more interesting:\n\n[Excerpt: Carl Perkins, \"Matchbox\"]\n\n\"Matchbox\" was a song that came from an idea Carl had been given by his father. His father had been sitting around in the session, watching his sons play, and remembered an old song he used to like with the line \"sitting here wondering will a matchbox hold my clothes/Ain't got no matches, but I've got a long way to go\". Carl had never heard the song before, and he wasn't particularly impressed by the line his dad sang -- he thought the line made no sense. His dad also couldn't remember any of the rest of the song, but Carl took that line and built a new song around it.\n\nGiven Carl's father's musical tastes, it's likely that the record he was remembering was \"Matchbox Blues\" by Roy Newman and His Boys\n\n[Excerpt: Roy Newman and His Boys, \"Match Box Blues\"]\n\nThat's a country cover of an old blues song by Blind Lemon Jefferson:\n\n[Excerpt: Blind Lemon Jefferson, \"Match Box Blues\"]\n\nThat was in turn inspired by this from Ma Rainey:\n\n[Excerpt: Ma Rainey, \"Lost Wandering Blues\"]\n\nIn a coincidence which once again shows how interconnected the different musicians we're looking at are, Jefferson's song also contained the line “Brown ’cross town going to be my teddy bear / Put a string on me, I’ll follow you everywhere.” -- a line which may well have inspired this song, with a very different feel, recorded by Perkins' ex-labelmate Elvis Presley:\n\n[Excerpt: Elvis Presley, \"(Let Me Be Your) Teddy Bear\"]\n\nBut by Perkins' own account, he never heard the original \"Match Box Blues\", and was just going from his dad's description. And certainly after the chorus the song diverges totally from Jefferson's song. Instead, he uses floating lyrics that one can find in all sorts of other blues songs. For example, the verse starting \"I'm a poor boy and I'm a long way from home\" comes from the old traditional blues song usually called, unsurprisingly, \"Poor Boy, Long Way From Home\":\n\n[Excerpt: Bo Weavil Jackson: \"Poor Boy Blues\"]\n\n\"Matchbox\" shows all the signs of having been put together in the studio, largely improvised, as most of Perkins' songs were -- you might remember from the episode on \"Blue Suede Shoes\" that most of his records were at least semi-improvised. And interviews back this up -- it was a throwaway B-side and Perkins was just making anything up to fill out a couple of minutes of vinyl.\n\nBut in this case the song, while it's credited to Carl Perkins, probably deserves at least one more co-author credit. Because the way Perkins told the story, Perkins didn't come up with the music. Somebody else did.\n\nThat someone else, surprisingly, wasn't one of the Perkins Brothers Band. While Jay, Clayton, and Fluke Holland were all there, present and accounted for, there was a fifth musician at the session.\n\nJerry Lee Lewis was a new piano player who had been discovered by Sam Phillips' assistant, Cowboy Jack Clement, the previous month. He'd cut his first record for Sun a couple of weeks earlier, and it had been released three days before this session. We'll be talking more about how Jerry Lee started with Sun, and his own early recordings, in a few weeks' time, but right now he wasn't there in his capacity as a performer, but he was just working as a session musician, trying to earn enough money to buy his parents some Christmas presents by sitting in on the session.\n\nLewis was, by every account I've ever read, one of the most musically fecund people who ever lived. He was a Louisiana piano player like Fats Domino, but his biggest influence was Moon Mullican -- but he'd absorbed everything, every piece of music he'd ever heard, and was desperate to show off and play for people no matter what the song.\n\nAnd so when Carl Perkins started singing the lines from \"Match Box Blues\", Jerry Lee immediately started playing a boogie piano part. The Perkins brothers fell in with what Lewis was playing, and the result, while Carl's singing lead, sounds exactly like a Jerry Lee Lewis record -- at least up until the guitar solo.\n\n[Excerpt: Carl Perkins, \"Matchbox\", first guitar solo]\n\nBecause Perkins was hugely impressed by Lewis as a musician, but he was less impressed by him as a person, at least at first. He'd got Perkins' back up after they'd finished recording \"Your True Love\", when he'd said, bluntly, \"that song ain't worth a damn\". Perkins had also heard him showing off at the piano, singing his new record in a break, and he'd thought that Lewis had no originality -- he could hear bits of himself, and bits of Elvis, and bits of Hank Williams, but not a lot that was new.\n\nWhat Lewis was playing on this new record was great, but Perkins wasn't going to let the new kid show him up, and he decided to up his game as a guitar player, playing a hard-driving riff on the bass strings of his guitar while he was singing, but really letting rip on the guitar solos, which he played on the top three strings on his guitar. As he later said, \"I took some of my best guitar breaks on that song. Triple string is what I was doing, playing all three strings at the same time with a pick, which is usually done finger-style. But fooling around and practising I knew it would work, and that was the time to try it, because I was shooting at Jerry Lee's head. It was never rehearsed.\"\n\nAnd the reason Perkins took two solos... is because he could tell that Jerry Lee Lewis really wanted to show him exactly what he could do, and Carl Perkins wasn't going to let him. As he said later, \"I thought, No, you smart aleck, I'm going to play both breaks on this guitar. Next time I'm going to try to burn the neck off of it. I knew he was itching for me to holler, 'Get it, Jerry!' I kinda wished I had of, I'd like to have seen what he would've done, 'cause he was hot that day. He was going after it. I let myself get in the way of probably a phenomenal piano break. He would have *shown* me how to play a piano. So the world probably missed the greatest piano break Jerry Lee would have ever taken\".\n\nBut the result was, still, extraordinary -- the absolute ultimate definition of rockabilly, with two huge musical egos pushing each other to greater heights. Who knows what would have happened had it not been buried on the B-side to \"Your True Love\"?\n\n[Excerpt: Carl Perkins, \"Matchbox\", second guitar solo]\n\nBecause Jerry Lee was right. I wouldn't go so far as to say “Your True Love” is not worth a damn, like he said, but I definitely don't think it's worth a millionth of \"Matchbox\", and certainly the fact that \"Matchbox\" went on to become a rock and roll standard once the Beatles unearthed it and brought it to prominence seems to suggest that it could have been a bigger hit.\n\nBut either way, everyone was happy with the second take of the song, and they were listening back to it when Elvis Presley walked into the room.\n\nElvis had been driving past with a girlfriend, and had been able to tell that there was a session on that day because, as Marion Keisker later put it, it looked like a Cadillac showroom outside. So he'd popped in to see who was playing.\n\nCarl Perkins was astonished to see Elvis there. While the two of them were friendly, he'd not seen Elvis in several months, and his appearance had changed considerably. Elvis was now dyeing his hair, which had previously been a light brown, a dark black. His acne had cleared up so much that he was no longer keeping his collars up to avoid showing his neck. He'd gone from being a spotty, shy, adolescent to being a major sex symbol.\n\nElvis went over and started noodling on the piano.\n\nThis immediately caused Jerry Lee Lewis to start showing off. He went over to Elvis and said \"I didn't know you could play\".\n\nElvis responded \"I can't\", at which point Jerry Lee said, \"Well then, why don't you let me sit down?\"\n\nElvis just replied \"Well, I'd like to try\", and carried on noodling. At this point Elvis had largely dismissed Jerry Lee Lewis -- Elvis was not, himself, an arrogant person, and he detested those who were, and Jerry Lee clearly was one.\n\nSam Phillips invited Elvis into the control room to listen to \"Matchbox\", and Elvis was duly impressed.\n\nAnd then everything changed, as the session turned in to a jam session. And it was a jam session that *possibly* involved a fourth person.\n\n[Excerpt: Million Dollar Quartet, \"When God Dips His Love In My Heart/Just A Little Talk With Jesus\"]\n\nEvery single account of what became known as the Million Dollar Quartet session disagrees as to how much, if at all, Johnny Cash participated in the proceedings. Cash always claimed he was the first there and last to leave -- that he'd turned up at the session before it had even started, because he'd wanted to watch his friends make their latest record, and he stayed through the whole jam session afterwards.\n\nOther accounts have Cash turning up part way through the session in order to pick up a royalty cheque that Sam Phillips had for him, singing a couple of songs with the others before the tape machine started running, but having to go off and do some Christmas shopping before everything really got going. And yet other accounts have Sam Phillips realising that he had a good opportunity for publicity here, calling Cash -- who was at the time by far the biggest act on Sun records -- at the same time he called journalists and photographers, and Cash just turning up for a photo and then immediately leaving again.\n\nWhatever the truth, it's definitely not easy to hear Cash on the tapes of the jam session, which finally got released in the 1980s. It was recorded on a single microphone – Phillips just started recording after they'd already started jamming, realising he may never have another chance to record these people together – and Cash always said that he was there, just the furthest from the microphone, and that he was singing in a higher register than normal because he was trying to sing in the keys that were comfortable for the other three.\n\nEither way, the legendary \"Million Dollar Quartet\" recordings are completely dominated by Elvis Presley and Jerry Lee Lewis, with Carl Perkins a distant third.\n\nWhen they start out, there are other musicians -- Carl Perkins' backing band play on the early tracks, before giving up -- but the majority of the recording consists of Elvis on acoustic guitar or piano, Jerry Lee on piano when Elvis isn't playing it, and them all singing together, with Elvis or Jerry Lee taking most of the lead vocals. Various other people join in at different points, but what this really is is two immense talents, both trying to size each other up, outdo each other, and also at the same time share in their joy at making music together.\n\n[Excerpt: Million Dollar Quartet, \"I Shall Not Be Moved\"]\n\nThe interesting thing about the music they play is how little of it is actually rock and roll. There's some, of course -- they're all hugely impressed with Chuck Berry's \"Brown-Eyed Handsome Man\" and have several goes at playing it -- and they talk about \"Too Much Monkey Business\", though Elvis was less impressed by that one than \"Brown-Eyed Handsome Man\". Elvis also sings a single line of Little Richard's \"Rip It Up\", but otherwise what they're playing is either pure country music or what's euphemistically called Southern Gospel -- the gospel music performed primarily by white people from the Deep South, rather than the gospel music primarily performed by black people.\n\nBoth Elvis and Jerry Lee were brought up in the Assembly of God, a Pentecostal \"holy roller\" church, which we'll talk more about when we get to an episode on Jerry Lee himself, but that meant they shared even more of a religious culture than they did with Cash or Perkins, both of whom were deeply religious men but neither of whom were brought up in that particular tradition.\n\nMost interesting is their take on \"Jesus Walked that Lonesome Valley\", which unfortunately includes a verse about John the Baptist that could be interpreted as mildly antisemitic. I'm not going to include that line in here -- and it is *very* mild antisemitism at worst, not hate speech or anything -- but I thought I'd flag that for anyone going to listen to the Mixcloud after hearing this, as in the current political climate people might not want to hear that without a warning.\n\nHowever, that aside, the track is interesting, as even though it's a call-and-response song and starts with Elvis taking the lead and Jerry Lee doing the responses, by the first verse Jerry Lee has already taken over the lead and left Elvis echoing him, rather than vice versa.\n\n[Excerpt: the Million Dollar Quartet: \"Jesus Walked that Lonesome Valley\"]\n\nYou can hear there exactly how this friendly rivalry was already working. Remember, at this time, Jerry Lee Lewis was nobody at all, someone who had one single out which had been out a matter of days. But here he is duetting with the \"King of Rock and Roll\", and seeing himself as the person who should naturally be taking the lead. When we get to Jerry Lee's work in a few weeks' time, you'll see just how completely in character this is.\n\nIt was also completely in character for Elvis, at least at this time, to defer to another musician, even though he was the biggest star around. One of the most fascinating elements of the Million Dollar Quartet session is Elvis talking of his experience in Las Vegas, watching Billy Ward and the Dominoes sing Elvis' own hit, \"Don't Be Cruel\":\n\n[Excerpt: Elvis session chatter and \"Don't Be Cruel\"]\n\nThe Yankee singer he's talking about there, who he's so convinced did the song better than he did, was Jackie Wilson, who was at the time the lead singer for the Dominoes, before striking out as a solo singer. You can hear just how influenced Elvis was by Wilson's performance -- and that \"Yankee\" pronunciation \"telly-phone\" that he makes fun of -- by listening to his performance of the song on the Ed Sullivan show a few weeks later, where he pronounces the word the same way:\n\n[Excerpt: Elvis Presley, \"Don't Be Cruel\", Ed Sullivan Show version]\n\nIt's worth seeking out the video of that, if you're not someone who has objections to using YouTube, as just seeing the expression on Elvis' face when he sings that line is priceless.\n\nBut listening to him talk about Jackie Wilson's performance, he keeps talking about how much better Wilson did the song, and the others keep insisting that he couldn't have been that much better than Elvis, but Elvis insists.\n\nFor the first part of the session, Elvis is on the piano, and while he claimed to not be able to play, he actually does a perfectly decent job. But when Jerry Lee Lewis took over the piano, things would kick up a notch, as Lewis was desperate to show off.\n\n[Excerpt: the Million Dollar Quartet, \"When the Saints Go Marching In\"]\n\nAnd when Elvis was called into the control room again, towards the end of the jam session, Jerry Lee took over completely, just playing by himself and showing off what he could do.\n\n[Excerpt: Jerry Lee Lewis, \"Black Bottom Stomp\"]\n\nThe last few songs in the jam session are essentially Lewis playing by himself, singing \"Crazy Arms\" and Gene Autry's \"You're the Only Star in My Blue Heaven\", and playing the old Jelly Roll Morton piano piece \"Black Bottom Stomp\". Right at the end we hear Elvis leaving, and him saying goodbye to someone called \"Johnny\", which suggests that Cash was right when he said that he was there all along.\n\nThe Million Dollar Quartet session might well have been the making of Jerry Lee Lewis, even though the recordings weren't released until decades later. Sam Phillips took the opportunity to publicise his stars far and wide. and that publicity placed the four of them on the same level. Jerry Lee, by virtue of being at the session, was an equal with Elvis, Carl Perkins, and Johnny Cash.\n\nThe Million Dollar Quartet tape isn't great music, except at odd moments -- it's an interesting historical document, rather than anything else. But those odd moments when it *does* become great are frankly electrifying, as a group of musicians at the height of their powers just play for each other for the sheer pleasure of playing.\n\nTo me, the very best moment in the whole session comes near the end, when Elvis plays a solo version of \"That's When Your Heartaches Begin\", the Ink Spots song he had performed three years earlier, when he had first walked into that studio to record himself for his mother:\n\n[Excerpt: Elvis Presley, \"That's When Your Heartaches Begin\"]\n\nHearing how much his voice had matured, and how much his performance had improved, in the three years between his first and last recordings in that Memphis studio, sends shivers down my spine.\n\nThere were a couple of attempts at \"Million Dollar Quartet\" reunions over the years, as the session became legendary among rockabilly fans. None, however, featured the quartet's full line-up, as they happened after Elvis' death.\n\nThe first, and the one that was more in the spirit of the original sessions, was a live performance released as \"The Survivors\", when on April 23 1981 Perkins and Lewis joined Cash on stage in Stuttgart for an impromptu performance. All three of them ran through their biggest hits:\n\n[Excerpt: Carl Perkins, Johnny Cash, and Jerry Lee Lewis, \"Matchbox\"]\n\nBut again, a substantial proportion of the show was taken up with the old gospel and country songs they all knew, with them trading off vocals on \"I'll Fly Away\", \"I Saw the Light\", \"Will the Circle Be Unbroken?\", and one song they'd performed at the earlier session, which they dedicated to Elvis, \"Peace in the Valley\":\n\n[Excerpt: Jerry Lee Lewis, Johnny Cash, and Carl Perkins, \"Peace in the Valley\"]\n\n20) Four years later they would get together again, for a studio album recorded at Sun Studios, with Roy Orbison filling in for Elvis. Class of '55 has its moments, but isn't a highlight of any of those men's discographies:\n\n[Excerpt: Johnny Cash, Roy Orbison, Jerry Lee Lewis, and Carl Perkins, \"Waymore's Blues\"]\n\nThis is the point that Johnny Cash and Carl Perkins leave our story, at least as main players, though no doubt we'll be hearing about them again when we talk about Jerry Lee Lewis and other Sun artists over the next few months. They both moved increasingly towards country music, and away from rockabilly. December 4, 1956, is as good a date as any, then, to nominate as the border between periods in rock and roll history -- the last point at which rock and roll, rockabilly, gospel, and country music could all be considered as the same kind of thing, before rock and roll became the dominant genre, with artists like Jerry Lee Lewis who started their career after rock and roll was already established.\n\nThe world of music had changed irreparably in the year since Elvis had last been in the Sun Studios, and it was going to keep on changing.\n\n[Excerpt, Elvis saying “Johnny, I'll see you later...”]",
  "itunes:subtitle": "Episode fifty-one of A History of Rock Music in Five Hundred Songs looks at Matchbox by Carl Perkins, and at the session that turned into the historic Million Dollar Quartet jam session. Click the full post to read liner notes, links to more information,",
  "itunes:keywords": "Billy Ward and his Dominoes,Blind Lemon Jefferson,Carl Perkins,Elvis Presley,Jackie Wilson,Jerry Lee Lewis,Johnny Cash,Marion Keisker,Million Dollar Quartet,rockabilly,Sam Phillips,Sun Records,the blues",
  "itunes:episodeType": "full",
  "itunes:episode": 51,
  "content:encoded": "Episode fifty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Matchbox\" by Carl Perkins, and at the session that turned into the historic Million Dollar Quartet jam session. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a title=\"on \"Ain't Got No Home\" by Clarence \"Frogman\" Henry\" href=\"https://www.patreon.com/posts/30557827\">on \"Blue Yodel #9\" by Jimmie Rodgers.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-51-matchbox/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI've used multiple books for this episode, as it deals with multiple artists.\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. And another book by Guralnick. <a href=\"https://amzn.to/2EjL4b9\"><em>Last Train to Memphis</em> </a>, is undoubtedly the best book on Elvis ever written.\n\nInformation on Carl Perkins comes from comes from <a href=\"https://amzn.to/2Wqgi6n\"><em>Go Cat Go! The Life and Times of Carl Perkins</em>, by Carl Perkins and David McGee.</a>\n\nInformation on Johnny Cash came from <a href=\"https://amzn.to/2IjcTm9\"><em>Johnny Cash: The Life</em> by Robert Hilburn.</a>\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. <a href=\"https://amzn.to/2IImoLJ\">This one by Rick Bragg</a> is better than most.\n\n<a href=\"https://amzn.to/31kw5HH\">This double-CD collection of Carl Perkins' Sun recordings</a> seems as good as any.\n\nThe early Sun singles are all on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for \"Matchbox\", in a way hearing it in isolation wouldn't, including the first recordings by all the participants in the Million Dollar Quartet.\n\nAnd the complete Million Dollar Quartet recordings themselves can be found <a href=\"https://amzn.to/2LT6sYO\">on this CD</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe're coming to the end of 1956, and with it the end of the first wave of rockabilly. As we've discussed before, by December 1956, only Elvis was left standing as a white rock and roll star from the first wave -- Carl Perkins, Gene Vincent, and Bill Haley had stopped having hits, and Johnny Cash had started to be promoted as a country singer rather than a rock and roller.\n\nBut just because someone has stopped having hits doesn't mean they've stopped making good music, and that was certainly the case for Carl Perkins, who spent the rest of 1956 making records that were every bit as good as his one hit, \"Blue Suede Shoes\". After \"Boppin' the Blues\", the song's unsuccessful follow-up, he released \"Dixie Fried\":\n\n[Excerpt: Carl Perkins, \"Dixie Fried\"]\n\nBut that was no more successful. Perkins was increasingly dissatisfied with the way Sam Phillips was promoting his work, and like Johnny Cash was strongly considering moving to another label.\n\nBut on December the fourth, 1956, Perkins was still working for Sun, and so he was in the studio with his brothers, recording another single that was destined to do very little.\n\nThe A-side, \"Your True Love\", charted, but not very high -- it went to number thirteen on the country charts and only number sixty-seven on the pop charts. It was a decent country record, but not much more than that. The B-side, though, was more interesting:\n\n[Excerpt: Carl Perkins, \"Matchbox\"]\n\n\"Matchbox\" was a song that came from an idea Carl had been given by his father. His father had been sitting around in the session, watching his sons play, and remembered an old song he used to like with the line \"sitting here wondering will a matchbox hold my clothes/Ain't got no matches, but I've got a long way to go\". Carl had never heard the song before, and he wasn't particularly impressed by the line his dad sang -- he thought the line made no sense. His dad also couldn't remember any of the rest of the song, but Carl took that line and built a new song around it.\n\nGiven Carl's father's musical tastes, it's likely that the record he was remembering was \"Matchbox Blues\" by Roy Newman and His Boys\n\n[Excerpt: Roy Newman and His Boys, \"Match Box Blues\"]\n\nThat's a country cover of an old blues song by Blind Lemon Jefferson:\n\n[Excerpt: Blind Lemon Jefferson, \"Match Box Blues\"]\n\nThat was in turn inspired by this from Ma Rainey:\n\n[Excerpt: Ma Rainey, \"Lost Wandering Blues\"]\n\nIn a coincidence which once again shows how interconnected the different musicians we're looking at are, Jefferson's song also contained the line “Brown ’cross town going to be my teddy bear / Put a string on me, I’ll follow you everywhere.” -- a line which may well have inspired this song, with a very different feel, recorded by Perkins' ex-labelmate Elvis Presley:\n\n[Excerpt: Elvis Presley, \"(Let Me Be Your) Teddy Bear\"]\n\nBut by Perkins' own account, he never heard the original \"Match Box Blues\", and was just going from his dad's description. And certainly after the chorus the song diverges totally from Jefferson's song. Instead, he uses floating lyrics that one can find in all sorts of other blues songs. For example, the verse starting \"I'm a poor boy and I'm a long way from home\" comes from the old traditional blues song usually called, unsurprisingly, \"Poor Boy, Long Way From Home\":\n\n[Excerpt: Bo Weavil Jackson: \"Poor Boy Blues\"]\n\n\"Matchbox\" shows all the signs of having been put together in the studio, largely improvised, as most of Perkins' songs were -- you might remember from the episode on \"Blue Suede Shoes\" that most of his records were at least semi-improvised. And interviews back this up -- it was a throwaway B-side and Perkins was just making anything up to fill out a couple of minutes of vinyl.\n\nBut in this case the song, while it's credited to Carl Perkins, probably deserves at least one more co-author credit. Because the way Perkins told the story, Perkins didn't come up with the music. Somebody else did.\n\nThat someone else, surprisingly, wasn't one of the Perkins Brothers Band. While Jay, Clayton, and Fluke Holland were all there, present and accounted for, there was a fifth musician at the session.\n\nJerry Lee Lewis was a new piano player who had been discovered by Sam Phillips' assistant, Cowboy Jack Clement, the previous month. He'd cut his first record for Sun a couple of weeks earlier, and it had been released three days before this session. We'll be talking more about how Jerry Lee started with Sun, and his own early recordings, in a few weeks' time, but right now he wasn't there in his capacity as a performer, but he was just working as a session musician, trying to earn enough money to buy his parents some Christmas presents by sitting in on the session.\n\nLewis was, by every account I've ever read, one of the most musically fecund people who ever lived. He was a Louisiana piano player like Fats Domino, but his biggest influence was Moon Mullican -- but he'd absorbed everything, every piece of music he'd ever heard, and was desperate to show off and play for people no matter what the song.\n\nAnd so when Carl Perkins started singing the lines from \"Match Box Blues\", Jerry Lee immediately started playing a boogie piano part. The Perkins brothers fell in with what Lewis was playing, and the result, while Carl's singing lead, sounds exactly like a Jerry Lee Lewis record -- at least up until the guitar solo.\n\n[Excerpt: Carl Perkins, \"Matchbox\", first guitar solo]\n\nBecause Perkins was hugely impressed by Lewis as a musician, but he was less impressed by him as a person, at least at first. He'd got Perkins' back up after they'd finished recording \"Your True Love\", when he'd said, bluntly, \"that song ain't worth a damn\". Perkins had also heard him showing off at the piano, singing his new record in a break, and he'd thought that Lewis had no originality -- he could hear bits of himself, and bits of Elvis, and bits of Hank Williams, but not a lot that was new.\n\nWhat Lewis was playing on this new record was great, but Perkins wasn't going to let the new kid show him up, and he decided to up his game as a guitar player, playing a hard-driving riff on the bass strings of his guitar while he was singing, but really letting rip on the guitar solos, which he played on the top three strings on his guitar. As he later said, \"I took some of my best guitar breaks on that song. Triple string is what I was doing, playing all three strings at the same time with a pick, which is usually done finger-style. But fooling around and practising I knew it would work, and that was the time to try it, because I was shooting at Jerry Lee's head. It was never rehearsed.\"\n\nAnd the reason Perkins took two solos... is because he could tell that Jerry Lee Lewis really wanted to show him exactly what he could do, and Carl Perkins wasn't going to let him. As he said later, \"I thought, No, you smart aleck, I'm going to play both breaks on this guitar. Next time I'm going to try to burn the neck off of it. I knew he was itching for me to holler, 'Get it, Jerry!' I kinda wished I had of, I'd like to have seen what he would've done, 'cause he was hot that day. He was going after it. I let myself get in the way of probably a phenomenal piano break. He would have *shown* me how to play a piano. So the world probably missed the greatest piano break Jerry Lee would have ever taken\".\n\nBut the result was, still, extraordinary -- the absolute ultimate definition of rockabilly, with two huge musical egos pushing each other to greater heights. Who knows what would have happened had it not been buried on the B-side to \"Your True Love\"?\n\n[Excerpt: Carl Perkins, \"Matchbox\", second guitar solo]\n\nBecause Jerry Lee was right. I wouldn't go so far as to say “Your True Love” is not worth a damn, like he said, but I definitely don't think it's worth a millionth of \"Matchbox\", and certainly the fact that \"Matchbox\" went on to become a rock and roll standard once the Beatles unearthed it and brought it to prominence seems to suggest that it could have been a bigger hit.\n\nBut either way, everyone was happy with the second take of the song, and they were listening back to it when Elvis Presley walked into the room.\n\nElvis had been driving past with a girlfriend, and had been able to tell that there was a session on that day because, as Marion Keisker later put it, it looked like a Cadillac showroom outside. So he'd popped in to see who was playing.\n\nCarl Perkins was astonished to see Elvis there. While the two of them were friendly, he'd not seen Elvis in several months, and his appearance had changed considerably. Elvis was now dyeing his hair, which had previously been a light brown, a dark black. His acne had cleared up so much that he was no longer keeping his collars up to avoid showing his neck. He'd gone from being a spotty, shy, adolescent to being a major sex symbol.\n\nElvis went over and started noodling on the piano.\n\nThis immediately caused Jerry Lee Lewis to start showing off. He went over to Elvis and said \"I didn't know you could play\".\n\nElvis responded \"I can't\", at which point Jerry Lee said, \"Well then, why don't you let me sit down?\"\n\nElvis just replied \"Well, I'd like to try\", and carried on noodling. At this point Elvis had largely dismissed Jerry Lee Lewis -- Elvis was not, himself, an arrogant person, and he detested those who were, and Jerry Lee clearly was one.\n\nSam Phillips invited Elvis into the control room to listen to \"Matchbox\", and Elvis was duly impressed.\n\nAnd then everything changed, as the session turned in to a jam session. And it was a jam session that *possibly* involved a fourth person.\n\n[Excerpt: Million Dollar Quartet, \"When God Dips His Love In My Heart/Just A Little Talk With Jesus\"]\n\nEvery single account of what became known as the Million Dollar Quartet session disagrees as to how much, if at all, Johnny Cash participated in the proceedings. Cash always claimed he was the first there and last to leave -- that he'd turned up at the session before it had even started, because he'd wanted to watch his friends make their latest record, and he stayed through the whole jam session afterwards.\n\nOther accounts have Cash turning up part way through the session in order to pick up a royalty cheque that Sam Phillips had for him, singing a couple of songs with the others before the tape machine started running, but having to go off and do some Christmas shopping before everything really got going. And yet other accounts have Sam Phillips realising that he had a good opportunity for publicity here, calling Cash -- who was at the time by far the biggest act on Sun records -- at the same time he called journalists and photographers, and Cash just turning up for a photo and then immediately leaving again.\n\nWhatever the truth, it's definitely not easy to hear Cash on the tapes of the jam session, which finally got released in the 1980s. It was recorded on a single microphone – Phillips just started recording after they'd already started jamming, realising he may never have another chance to record these people together – and Cash always said that he was there, just the furthest from the microphone, and that he was singing in a higher register than normal because he was trying to sing in the keys that were comfortable for the other three.\n\nEither way, the legendary \"Million Dollar Quartet\" recordings are completely dominated by Elvis Presley and Jerry Lee Lewis, with Carl Perkins a distant third.\n\nWhen they start out, there are other musicians -- Carl Perkins' backing band play on the early tracks, before giving up -- but the majority of the recording consists of Elvis on acoustic guitar or piano, Jerry Lee on piano when Elvis isn't playing it, and them all singing together, with Elvis or Jerry Lee taking most of the lead vocals. Various other people join in at different points, but what this really is is two immense talents, both trying to size each other up, outdo each other, and also at the same time share in their joy at making music together.\n\n[Excerpt: Million Dollar Quartet, \"I Shall Not Be Moved\"]\n\nThe interesting thing about the music they play is how little of it is actually rock and roll. There's some, of course -- they're all hugely impressed with Chuck Berry's \"Brown-Eyed Handsome Man\" and have several goes at playing it -- and they talk about \"Too Much Monkey Business\", though Elvis was less impressed by that one than \"Brown-Eyed Handsome Man\". Elvis also sings a single line of Little Richard's \"Rip It Up\", but otherwise what they're playing is either pure country music or what's euphemistically called Southern Gospel -- the gospel music performed primarily by white people from the Deep South, rather than the gospel music primarily performed by black people.\n\nBoth Elvis and Jerry Lee were brought up in the Assembly of God, a Pentecostal \"holy roller\" church, which we'll talk more about when we get to an episode on Jerry Lee himself, but that meant they shared even more of a religious culture than they did with Cash or Perkins, both of whom were deeply religious men but neither of whom were brought up in that particular tradition.\n\nMost interesting is their take on \"Jesus Walked that Lonesome Valley\", which unfortunately includes a verse about John the Baptist that could be interpreted as mildly antisemitic. I'm not going to include that line in here -- and it is *very* mild antisemitism at worst, not hate speech or anything -- but I thought I'd flag that for anyone going to listen to the Mixcloud after hearing this, as in the current political climate people might not want to hear that without a warning.\n\nHowever, that aside, the track is interesting, as even though it's a call-and-response song and starts with Elvis taking the lead and Jerry Lee doing the responses, by the first verse Jerry Lee has already taken over the lead and left Elvis echoing him, rather than vice versa.\n\n[Excerpt: the Million Dollar Quartet: \"Jesus Walked that Lonesome Valley\"]\n\nYou can hear there exactly how this friendly rivalry was already working. Remember, at this time, Jerry Lee Lewis was nobody at all, someone who had one single out which had been out a matter of days. But here he is duetting with the \"King of Rock and Roll\", and seeing himself as the person who should naturally be taking the lead. When we get to Jerry Lee's work in a few weeks' time, you'll see just how completely in character this is.\n\nIt was also completely in character for Elvis, at least at this time, to defer to another musician, even though he was the biggest star around. One of the most fascinating elements of the Million Dollar Quartet session is Elvis talking of his experience in Las Vegas, watching Billy Ward and the Dominoes sing Elvis' own hit, \"Don't Be Cruel\":\n\n[Excerpt: Elvis session chatter and \"Don't Be Cruel\"]\n\nThe Yankee singer he's talking about there, who he's so convinced did the song better than he did, was Jackie Wilson, who was at the time the lead singer for the Dominoes, before striking out as a solo singer. You can hear just how influenced Elvis was by Wilson's performance -- and that \"Yankee\" pronunciation \"telly-phone\" that he makes fun of -- by listening to his performance of the song on the Ed Sullivan show a few weeks later, where he pronounces the word the same way:\n\n[Excerpt: Elvis Presley, \"Don't Be Cruel\", Ed Sullivan Show version]\n\nIt's worth seeking out the video of that, if you're not someone who has objections to using YouTube, as just seeing the expression on Elvis' face when he sings that line is priceless.\n\nBut listening to him talk about Jackie Wilson's performance, he keeps talking about how much better Wilson did the song, and the others keep insisting that he couldn't have been that much better than Elvis, but Elvis insists.\n\nFor the first part of the session, Elvis is on the piano, and while he claimed to not be able to play, he actually does a perfectly decent job. But when Jerry Lee Lewis took over the piano, things would kick up a notch, as Lewis was desperate to show off.\n\n[Excerpt: the Million Dollar Quartet, \"When the Saints Go Marching In\"]\n\nAnd when Elvis was called into the control room again, towards the end of the jam session, Jerry Lee took over completely, just playing by himself and showing off what he could do.\n\n[Excerpt: Jerry Lee Lewis, \"Black Bottom Stomp\"]\n\nThe last few songs in the jam session are essentially Lewis playing by himself, singing \"Crazy Arms\" and Gene Autry's \"You're the Only Star in My Blue Heaven\", and playing the old Jelly Roll Morton piano piece \"Black Bottom Stomp\". Right at the end we hear Elvis leaving, and him saying goodbye to someone called \"Johnny\", which suggests that Cash was right when he said that he was there all along.\n\nThe Million Dollar Quartet session might well have been the making of Jerry Lee Lewis, even though the recordings weren't released until decades later. Sam Phillips took the opportunity to publicise his stars far and wide. and that publicity placed the four of them on the same level. Jerry Lee, by virtue of being at the session, was an equal with Elvis, Carl Perkins, and Johnny Cash.\n\nThe Million Dollar Quartet tape isn't great music, except at odd moments -- it's an interesting historical document, rather than anything else. But those odd moments when it *does* become great are frankly electrifying, as a group of musicians at the height of their powers just play for each other for the sheer pleasure of playing.\n\nTo me, the very best moment in the whole session comes near the end, when Elvis plays a solo version of \"That's When Your Heartaches Begin\", the Ink Spots song he had performed three years earlier, when he had first walked into that studio to record himself for his mother:\n\n[Excerpt: Elvis Presley, \"That's When Your Heartaches Begin\"]\n\nHearing how much his voice had matured, and how much his performance had improved, in the three years between his first and last recordings in that Memphis studio, sends shivers down my spine.\n\nThere were a couple of attempts at \"Million Dollar Quartet\" reunions over the years, as the session became legendary among rockabilly fans. None, however, featured the quartet's full line-up, as they happened after Elvis' death.\n\nThe first, and the one that was more in the spirit of the original sessions, was a live performance released as \"The Survivors\", when on April 23 1981 Perkins and Lewis joined Cash on stage in Stuttgart for an impromptu performance. All three of them ran through their biggest hits:\n\n[Excerpt: Carl Perkins, Johnny Cash, and Jerry Lee Lewis, \"Matchbox\"]\n\nBut again, a substantial proportion of the show was taken up with the old gospel and country songs they all knew, with them trading off vocals on \"I'll Fly Away\", \"I Saw the Light\", \"Will the Circle Be Unbroken?\", and one song they'd performed at the earlier session, which they dedicated to Elvis, \"Peace in the Valley\":\n\n[Excerpt: Jerry Lee Lewis, Johnny Cash, and Carl Perkins, \"Peace in the Valley\"]\n\n20) Four years later they would get together again, for a studio album recorded at Sun Studios, with Roy Orbison filling in for Elvis. Class of '55 has its moments, but isn't a highlight of any of those men's discographies:\n\n[Excerpt: Johnny Cash, Roy Orbison, Jerry Lee Lewis, and Carl Perkins, \"Waymore's Blues\"]\n\nThis is the point that Johnny Cash and Carl Perkins leave our story, at least as main players, though no doubt we'll be hearing about them again when we talk about Jerry Lee Lewis and other Sun artists over the next few months. They both moved increasingly towards country music, and away from rockabilly. December 4, 1956, is as good a date as any, then, to nominate as the border between periods in rock and roll history -- the last point at which rock and roll, rockabilly, gospel, and country music could all be considered as the same kind of thing, before rock and roll became the dominant genre, with artists like Jerry Lee Lewis who started their career after rock and roll was already established.\n\nThe world of music had changed irreparably in the year since Elvis had last been in the Sun Studios, and it was going to keep on changing.\n\n[Excerpt, Elvis saying “Johnny, I'll see you later...”]",
  "enclosure": "",
  "itunes:summary": "Episode fifty-one of A History of Rock Music in Five Hundred Songs looks at \"Matchbox\" by Carl Perkins, and at the session that turned into the historic Million Dollar Quartet jam session. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blue Yodel #9\" by Jimmie Rodgers.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used multiple books for this episode, as it deals with multiple artists.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. And another book by Guralnick. Last Train to Memphis , is undoubtedly the best book on Elvis ever written.\n\nInformation on Carl Perkins comes from comes from Go Cat Go! The Life and Times of Carl Perkins, by Carl Perkins and David McGee.\n\nInformation on Johnny Cash came from Johnny Cash: The Life by Robert Hilburn.\n\nBooks on Jerry Lee Lewis tend to be very flawed, as the authors all tend to think they're Faulkner rather than giving the facts. This one by Rick Bragg is better than most.\n\nThis double-CD collection of Carl Perkins' Sun recordings seems as good as any.\n\nThe early Sun singles are all on this ten-disc set, which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for \"Matchbox\", in a way hearing it in isolation wouldn't, including the first recordings by all the participants in the Million Dollar Quartet.\n\nAnd the complete Million Dollar Quartet recordings themselves can be found on this CD.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe're coming to the end of 1956, and with it the end of the first wave of rockabilly. As we've discussed before, by December 1956, only Elvis was left standing as a white rock and roll star from the first wave -- Carl Perkins, Gene Vincent, and Bill Haley had stopped having hits, and Johnny Cash had started to be promoted as a country singer rather than a rock and roller.\n\nBut just because someone has stopped having hits doesn't mean they've stopped making good music, and that was certainly the case for Carl Perkins, who spent the rest of 1956 making records that were every bit as good as his one hit, \"Blue Suede Shoes\". After \"Boppin' the Blues\", the song's unsuccessful follow-up, he released \"Dixie Fried\":\n\n[Excerpt: Carl Perkins, \"Dixie Fried\"]\n\nBut that was no more successful. Perkins was increasingly dissatisfied with the way Sam Phillips was promoting his work, and like Johnny Cash was strongly considering moving to another label.\n\nBut on December the fourth, 1956, Perkins was still working for Sun, and so he was in the studio with his brothers, recording another single that was destined to do very little.\n\nThe A-side, \"Your True Love\", charted, but not very high -- it went to number thirteen on the country charts and only number sixty-seven on the pop charts. It was a decent country record, but not much more than that. The B-side, though, was more interesting:\n\n[Excerpt: Carl Perkins, \"Matchbox\"]\n\n\"Matchbox\" was a song that came from an idea Carl had been given by his father. His father had been sitting around in the session, watching his sons play, and remembered an old song he used to like with the line \"sitting here wondering will a matchbox hold my clothes/Ain't got no matches, but I've got a long way to go\". Carl had never heard the song before, and he wasn't particularly impressed by the line his dad sang -- he thought the line made no sense. His dad also couldn't remember any of the rest of the song, but Carl took that line and built a new song around it.\n\nGiven Carl's father's musical tastes, it's likely that the record he was remembering",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-one of A History of Rock Music in Five Hundred Songs looks at \"Matchbox\" by Carl Perkins, and at the session that turned into the historic Million Dollar Quartet jam session. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blue Yodel #9\" by Jimmie Rodgers.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used multiple books for this episode, as it deals with multiple artists.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records. And another book by Guralnick. Last Train to Memphis , is undoubtedly the best book on Elvis ever written.\n\nInformation on Carl Perkins comes from comes from Go Cat Go! The Life and Times of Carl Perkins, by Carl Perkins and David McGee.\n\nInformation on J",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}