{
  "id": "yt:video:2ptFnIj71SM",
  "yt:videoId": "2ptFnIj71SM",
  "yt:channelId": "UCzBjutX2PmitNF4avysL-vg",
  "title": "The derivative isn't what you think it is.",
  "link": "",
  "author": {
    "name": "Aleph 0",
    "uri": "https://www.youtube.com/channel/UCzBjutX2PmitNF4avysL-vg"
  },
  "published": "2020-11-03T21:39:18+00:00",
  "updated": "2022-06-08T05:38:55+00:00",
  "media:group": {
    "media:title": "The derivative isn't what you think it is.",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The derivative's true nature lies in its connection with topology. In this video, we'll explore what this connection is through two fields of algebraic topology: homology and cohomology.\n \n__\nSOURCES and REFERENCES for Further Reading!\n\nIn this video, I give a quick-and-dirty introduction to differential forms and cohomology. But as with any quick introduction, there are details that I gloss over for the sake of brevity. To learn these details rigorously, I've listed a few resources down below that I found helpful.\n \nDifferential Forms: The book “A Geometric Approach to Differential Forms” by David Bachman is a treasure. Instead of leading with the formalism, it gives a nice intuitive picture of what forms do, and then provides the precise definitions.\n\nHomology: This lecture series by Pierre Albin is a beauty. There are a few lectures that cover homology in a slow, accessible way with lots of computational examples. (https://www.youtube.com/watch?v=I2GbdKDN9zg&t=3s)\n\nCohomology and De Rham’s Theorem: The amazing Fredrich Schuller (who I have raved about in previous videos) has a crystal-clear lecture on Cohomology. (https://www.youtube.com/watch?v=QLnzIOGIvfo)\n\nMore on Cohomology: I also came across the book “Differential Forms in Algebraic Topology” by Bott and Tu, which starts off with De Rham’s Theorem and goes into much more depth about the relationship between the boundary and the exterior derivative. This is quite advanced (read: I only got through the first few chapters before I stopped understanding what all the words meant ...), but if you’re up for it, read along!\n_____\n\nLINKS\n\nThe Work of Emmy Noether, one of the great pioneers of Homology: https://www.britannica.com/biography/Emmy-Noether\n\nThurston’s Paper about the Interpretations of the Derivative: https://arxiv.org/abs/math/9404236\n\n___\nMUSIC CREDITS:\n\nMusic: https://www.purple-planet.com\n\nSong: Thinking Ahead\n\nSOFTWARE USED:\nAdobe Premiere Elements for Editing\nBlender 2.8 for Animations\n\nFollow me!\nTwitter: @00aleph00\nInstagram: @00aleph00\n\nIntro: (0:00)\nHomology: (1:08)\nCohomology: (3:41)\nDe Rham's Theorem: (7:45)\nThe Punch Line: (9:02)",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}