{
  "title": "535: Harry Potter Halloween Extravaganza, New 'Secrets of Dumbledore' Info Revealed",
  "link": "https://audioboom.com/posts/7962363",
  "itunes:episode": 535,
  "itunes:title": "Harry Potter Halloween Extravaganza, New 'Secrets of Dumbledore' Info Revealed",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3703,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, it's our annual Halloween extravaganza! We invent some of our own wizarding world candy, discuss what treats Potter characters would hand out for Halloween and Potter-ize your favorite Halloween movies! Plus, some new and exciting info about <em>The Secrets of Dumbledore </em>following a test screening in Los Angeles last week!<br>\n<br>\n\n</div>\n<ul>\n<li>A new behind-the-scenes look at <em>Fantastic Beasts: The Secrets of Dumbledore </em>sheds light on where the film will pick up and what countries we will be visiting! But what happened to Rio?</li>\n<li>We have a small, exciting, and spoiler-free tidbit about <em>The Secrets of Dumbledore</em> from someone who attended a test screening in Los Angeles last week.</li>\n<li>It's our annual Halloween episode!</li>\n<li>Have any of the hosts ever dressed up as Harry Potter characters for Halloween? (Here's Andrew's <a href=\"https://www.youtube.com/watch?v=YqTEB_oKpBA&t=218s&ab_channel=kelazma\">Morning Show appearance</a> as Harry Potter)</li>\n<li>Laura has a great costume recommendation for Micah this year!</li>\n<li>We try our hand at inventing Wizarding World candy</li>\n<li>What kinds of goodies would Snape, Molly, Mad-Eye and McGonagall give trick-or treaters? How about Remus, Sirius, Arabella Figg and Xenophilus Lovegood?</li>\n<li>Ron as Carrot Top? Dumbledore as a Lemon Drop Martini? We discuss what Potter characters would dress up as for Halloween!</li>\n<li>Night of the Living Fred! Horcrux Pocus! Who has the best Potter-ized Halloween movie title?</li>\n<li>Quizzitch: What sweet treat does Professor Flitwick give to Harry after his interview is published in <em>The Quibbler</em>? <a href=\"https://www.mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week’s episode is brought to you  BetterHelp – get 10% off your first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/MuggleCast!</a>\n</li>\n</ul>\n",
  "pubDate": "Tue, 19 Oct 2021 08:00:00 +0000",
  "guid": "tag:audioboom.com,2021-10-18:/posts/7962363",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}