{
  "title": "Reimagining private practice",
  "itunes:season": 1,
  "itunes:title": "Reimagining private practice",
  "itunes:episodeType": "full",
  "guid": "8c633186-0842-4076-a241-62516009acd9",
  "link": "https://share.transistor.fm/s/5eb3173e",
  "description": "<p>Dr. Nitin Gupta is the founder of Rivertowns Pediatrics, a very different type of private practice. Having practiced from Newark, NJ to Caribou, ME, he’s landed on a value-based, concierge model that works. Boiling things down, Dr. Gupta told Daniel, “You're spending more time on that computer than you are face to face with that patient.  This gives you the opportunity to be the doctor that you were meant to be, and so that's why I started this.”</p>",
  "content:encoded": "<p>Dr. Nitin Gupta is the founder of Rivertowns Pediatrics, a very different type of private practice. Having practiced from Newark, NJ to Caribou, ME, he’s landed on a value-based, concierge model that works. Boiling things down, Dr. Gupta told Daniel, “You're spending more time on that computer than you are face to face with that patient.  This gives you the opportunity to be the doctor that you were meant to be, and so that's why I started this.”</p>",
  "pubDate": "Thu, 16 Sep 2021 03:00:00 -0400",
  "author": "CVS Health",
  "enclosure": "",
  "itunes:author": "CVS Health",
  "itunes:image": "",
  "itunes:duration": 1187,
  "itunes:summary": "Dr. Nitin Gupta is the founder of Rivertowns Pediatrics, a very different type of private practice. Having practiced from Newark, NJ to Caribou, ME, he’s landed on a value-based, concierge model that works. Boiling things down, Dr. Gupta told Daniel, “You're spending more time on that computer than you are face to face with that patient.  This gives you the opportunity to be the doctor that you were meant to be, and so that's why I started this.”",
  "itunes:subtitle": "Dr. Nitin Gupta is the founder of Rivertowns Pediatrics, a very different type of private practice. Having practiced from Newark, NJ to Caribou, ME, he’s landed on a value-based, concierge model that works. Boiling things down, Dr. Gupta told Daniel, “You",
  "itunes:keywords": 403121,
  "itunes:explicit": "No"
}