{
  "title": "63: The Power of Questions with Cal Fussman",
  "pubDate": "Fri, 08 Jun 2018 15:59:19 +0000",
  "guid": "c2ad3e46fc234e5aa46578762fb9ee0c",
  "link": "https://sites.libsyn.com/94610/63-the-power-of-questions-with-cal-fussman",
  "itunes:image": "",
  "description": "<p class=\"p1\">What is the secret to asking great questions?<br /> <br /> If you’re a long time or a new listener to my training, you know that I always tell people that the questions are the answer. If you want a greater understanding and comprehension when you read, then ask better questions.<br /> <br /> In today’s episode, we’re going to talk about how to ask better questions that will give you better answers. And I can’t think of a better person to talk about this than my friend, Cal.<br /> <br /> Calvin \"Cal\" Fussman is an American journalist and author. He is a Writer at Large for Esquire magazine, known for the What I've Learned column, where he interviews leaders in various fields, which have included Mikhail Gorbachev, Jimmy Carter, Ted Kennedy, Jeff Bezos, Richard Branson, Jack Welch, Robert De Niro, Clint Eastwood, Al Pacino, George Clooney, Leonardo DiCaprio, Tom Hanks, Bruce Springsteen, Dr. Dre, Quincy Jones, Woody Allen, Barbara Walters, Pelé, Yao Ming, Serena Williams, John Wooden, and Muhammad Ali.<br /> <br /> This is a powerful episode, and I hope it will help you to re-activate your curiosity and creativity.<br /> <br /> *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "content:encoded": "<p class=\"p1\">What is the secret to asking great questions?  If you’re a long time or a new listener to my training, you know that I always tell people that the questions are the answer. If you want a greater understanding and comprehension when you read, then ask better questions.  In today’s episode, we’re going to talk about how to ask better questions that will give you better answers. And I can’t think of a better person to talk about this than my friend, Cal.  Calvin \"Cal\" Fussman is an American journalist and author. He is a Writer at Large for Esquire magazine, known for the What I've Learned column, where he interviews leaders in various fields, which have included Mikhail Gorbachev, Jimmy Carter, Ted Kennedy, Jeff Bezos, Richard Branson, Jack Welch, Robert De Niro, Clint Eastwood, Al Pacino, George Clooney, Leonardo DiCaprio, Tom Hanks, Bruce Springsteen, Dr. Dre, Quincy Jones, Woody Allen, Barbara Walters, Pelé, Yao Ming, Serena Williams, John Wooden, and Muhammad Ali.  This is a powerful episode, and I hope it will help you to re-activate your curiosity and creativity.  *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "21:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What is the secret to asking great questions?  If you’re a long time or a new listener to my training, you know that I always tell people that the questions are the answer. If you want a greater understanding and comprehension when you read, then...",
  "itunes:episodeType": "full"
}