{
  "title": "Strange Topological Physics Could Help Enable 6G Tech",
  "link": "https://spectrum.ieee.org/photonic-topological-insulators-2658324693",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-pattern-of-red-triangles-with-some-that-are-yellow.jpg?id=31821727&width=2000&height=1500&coordinates=21%2C0%2C21%2C0\"/><br/><br/><p>The next generation of wireless communications, <a href=\"https://spectrum.ieee.org/6g-geopolitics\" target=\"_self\">6G</a>, will likely rely on terahertz rays to help reach unprecedented speeds. Now research suggests that unusual topological physics may help control terahertz radiation on chips for 6G applications.</p><p><a href=\"https://spectrum.ieee.org/terahertz-chip\" target=\"_self\">Terahertz waves</a> (also called <a href=\"https://en.wikipedia.org/wiki/Terahertz_radiation\" rel=\"noopener noreferrer\" target=\"_blank\">submillimeter radiation or far-infrared light</a>) fall between optical waves and microwaves on the electromagnetic spectrum. Ranging in frequency from 0.1 to 10 terahertz, these waves could be key to <a href=\"https://spectrum.ieee.org/memristor-6g-switches\" target=\"_self\">future 6G wireless networks</a>.</p><p>“Terahertz technologies are the critical enabler for developing 6G devices, products, services, and ubiquitous connectivity that will redefine how we create, consume, and deliver data,” says study senior author <a href=\"http://web.spms.ntu.edu.sg/~ranjans/prof.html\" rel=\"noopener noreferrer\" target=\"_blank\">Ranjan Singh</a>, a photonics researcher at <a href=\"https://www.ntu.edu.sg/\" target=\"_blank\">Nanyang Technological University</a>, in Singapore.</p><p>The vision for 6G includes blazingly fast speeds of <a href=\"https://spectrum.ieee.org/terabit-second\" target=\"_self\">terabits</a> (trillions of bits) per second to support applications such as autonomous vehicles, augmented reality, and immersive telepresence. These goals require on-chip communication technologies providing data rates beyond 100 gigabits (billions of bits) per second.</p><p>However, existing terahertz on-chip communication devices suffer from signal scattering, crosstalk—signals leaking between channels—and the inability to actively tune across multiple channels. These problems have limited these devices to data-transmission speeds of a few dozen gigabits per second.</p><p>“A novel integrated-circuit architecture is required to compute, process, and transport a massive volume of data using terahertz carrier frequencies,” Singh says.</p><p>Singh and his colleagues now reveal that the growing field of topological photonics may help overcome these challenges. They detailed <a href=\"https://www.nature.com/articles/s41467-022-32909-6\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a> online 15 September in the journal <em>Nature Communications</em>.</p><p><a href=\"https://spectrum.ieee.org/a-beginners-guide-to-topological-materials\" target=\"_self\">Topology</a> is the branch of mathematics that investigates what features of shapes may survive deformation. For example, an object shaped like a doughnut can be pushed and pulled into the shape of a mug, so that the doughnut’s hole forms the hole in the cup’s handle. However, the object could not lose its hole without changing into a fundamentally different shape.</p><p>Using insights from topology, researchers developed the first electronic topological insulators in 2007. Electrons zipping along the edges or surfaces of these materials strongly resist any disturbances that might hamper their flow, much like how a doughnut-shaped object will retain the same basic topology no matter how much it gets deformed—so long as the hole remains intact. This breakthrough won <a href=\"https://www.nobelprize.org/prizes/physics/2016/press-release/\" rel=\"noopener noreferrer\" target=\"_blank\">the Nobel Prize in Physics in 2016</a>.</p><p>Recently, scientists have created <a href=\"https://spectrum.ieee.org/photonic-topological-insulators\" target=\"_self\">photonic topological insulators</a> in which photons of light are similarly “topologically protected.” These materials usually possess regular variations in their structures that let specific wavelengths of light flow within them without scattering or losses, even around corners and imperfections. One possible application for such materials could be <a href=\"https://spectrum.ieee.org/roomtemp-topolaser\" target=\"_self\">lasers that incorporate topological protection</a>, which may be more efficient and robust against defects than conventional devices. Another application might be helping <a href=\"https://spectrum.ieee.org/terahertz-chip\" target=\"_self\">data flow through chips at a trillion bits per second</a>.</p><p>In the new study, researchers fabricated a silicon chip that was 200 micrometers thick and roughly 20 centimeters wide. They perforated it with rows of triangular holes. Each triangle alternated in width between 72.75 and 169.75 micrometers, with the smaller triangles pointing in the opposite direction of the larger ones. These rows of holes were arranged in clusters in which all the larger triangles either pointed up or down. Light entering this chip flowed, topologically protected, along the interface between the different sets of holes.</p><p>The new on-chip topological waveguide could support a single-channel broadband-communication link with data rates of up to 160 Gb/s. The researchers showed that they could use light to actively turn the chip on and off.</p><p>The scientists also coupled this device to an on-chip topological demultiplexer that enabled simultaneous multiple independent signals in the communications network. They found they could achieve two perfectly isolated data signals without any crosstalk. One channel permitted real-time uncompressed high-definition video streaming at 1.5 Gb/s, while the other supported data transmission at 40 Gb/s.</p><p>The new topological chip “will be a stepping stone for developing terahertz integrated circuits for emerging 6G devices,” Singh says.</p>",
  "pubDate": "Mon, 26 Sep 2022 16:00:00 +0000",
  "guid": "https://spectrum.ieee.org/photonic-topological-insulators-2658324693",
  "category": [
    "Photonics",
    "Terahertz",
    "Terabit",
    "6g",
    "Topological insulators"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}