{
  "itunes:episode": 74,
  "title": "Threes A Magic Number with Greg Wohlwend",
  "pubDate": "Thu, 08 May 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/5/8/threes-a-magic-number-with-greg-wohlwend-episode-74",
  "description": "<p><a href=\"http://aeiowu.com/\">Greg Wohlwend</a> developed the popular game <a href=\"http://asherv.com/threes/\">Threes</a> with his colleague <a href=\"http://ashervollmer.tumblr.com/home\">Asher Vollmer</a>. Greg is a games illustrator and designer who was part of teams that made <a href=\"http://playhundreds.com/\">Hundreds</a>, <a href=\"http://gasketball.com/\">Gasketball</a>, <a href=\"http://mikengreg.com/solipskier/\">Solipskier</a>, and <a href=\"http://www.ridiculousfishing.com/\">Ridiculous Fishing</a>. Threes is his breakout game — and has inspired lots of admiration, frustration, and imitation. He and I talk in this episode about the joy of success, the burden of being independent, and the problems with parasites.</p>\n\n<h2>Sponsors & Patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons. Thanks to patrons George O'Toole, Jonathan Mann, and Sean Wickett for <a href=\"http://www.patreon.com/newdisruptors\">supporting us directly through Patreon</a>! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts!</p>\n\n<h2>Show notes</h2>\n\n<p><a href=\"http://theoatmeal.com/\">The Oatmeal</a>'s Matthew Inman <a href=\"https://secure.comic-con.org/awards/will-eisner-comic-industry-award-nominees-2014\">was nominated</a> for two 2014 Eisner Awards. Greg wrote this post to <a href=\"http://aeiowu.tumblr.com/post/53234753408/dont-quit-your-day-job-a-letter-to-the-hobbyist-on\">the hobbyist on the ledge</a>. Greg designed the logo for <em><a href=\"http://buy.indiegamethemovie.com/\">Indie Game: The Movie</a></em>; the creators of that film are two-time guests on the show, <a href=\"http://newdisrupt.org/blog/2012/12/5/episode-1\">first in December 2012</a>, and then <a href=\"http://newdisrupt.org/blog/2013/12/12/a-year-of-living-disruptively-with-guests-from-early-episodes-53\">a year later</a> for a check in.</p>\n\n<p>The money in Minecraft is in YouTube videos of people playing through levels. We ran <a href=\"http://the-magazine.com/39/attention-mining\">a story about this</a> in <em>The Magazine</em>. The <a href=\"http://scratch.mit.edu/\">Scratch</a> programming language leads to the <a href=\"http://pencilcode.net/\">Pencil programming language</a> which led to JavaScript for my older son. <a href=\"http://coderdojo.com/\">CoderDojo</a> uses Scratch to mentor kids in programming.</p>\n\n<p>Max Temkin <a href=\"https://twitter.com/MaxTemkin/status/449566364781383680\">baited</a> a <em>Los Angeles Times</em> reporter who <a href=\"http://articles.latimes.com/2014/mar/27/business/la-fi-tn-2048-hit-game-creator-gabriele-cirulli-20140327\">wrote an uninformed piece</a> about the Threes ripoff 2048. The <a href=\"http://asherv.com/threes/threemails/\">extended account</a> of Threes development reveals the exhaustive and useful process of iteration, testing, and killing one's darlings.</p>\n\n<p>The Pop Culture Happy Hour podcast <a href=\"http://www.npr.org/blogs/monkeysee/2014/04/04/299062684/pop-culture-happy-hour-captain-america-and-the-pitiless-march-of-time\">had a very nice discussion</a> at the end of an episode where one panelist recommend 2048, and another explained kindly that Threes was the original and the thing to which one graduates as it's tougher. (Listen around minute 37.)</p>\n\n<p>Greg recommends <a href=\"http://www.amazon.com/s?ie=UTF8&page=1&rh=n%3A2620099011%2Cp_4%3AIndomie\">the Indomie brand</a> of ramen.</p>",
  "guid": "tag:soundcloud,2010:tracks/148435105",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:15:02",
  "itunes:subtitle": "Greg Wohlwend developed the popular game Threes with his colleague Asher Vollmer.",
  "itunes:summary": "Greg Wohlwend developed the popular game Threes with his colleague Asher Vollmer. Greg is a games illustrator and designer who was part of teams that made Hundreds, Gasketball, Solipskier, and Ridiculous Fishing. Threes is his breakout game — and has inspired lots of admiration, frustration, and imitation. He and I talk in this episode about the joy of success, the burden of being independent, and the problems with parasites."
}