{
  "title": "3: Episode 3",
  "link": "https://audioboom.com/posts/7316359",
  "itunes:episode": 3,
  "itunes:title": "Episode 3",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2710,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our August 21, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>While Dumbledore got a black hand in The Half-Blood Prince, will Goblet of Fire get a black eye at the box office? New clips were revealed this week of the fourth Harry Potter film, as well as its official PG-13 rating. As the time frame for the release of the final book gets debated, just how long will HP 7 be? One fan suggested it will rival War and Peace. And just who will help Harry with his heroic Horcrux hunt? Plus, did somebody forget to clean up underneath Fawkes’ perch? Why did everybody’s favorite phoenix fail to come to Dumbledore’s aid?<br>\n<br>\n\n</div>\n<div>From the Ministry of Magic to the Order of the Phoenix…all that and more ahead with Andrew, Ben, Eric, and Jamie on this edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Special co-hosts: Eric Scull and Jamie Lawrence</li>\n<li>Our take on the international teaser trailer</li>\n<li>How will WB handle filming of future movies?</li>\n<li>What about an extended version on DVD for diehard fans?</li>\n<li>Eric’s dentist goes through a chapter of the books each night with his child</li>\n<li>Where was Fawkes when Dumbledore was in danger?</li>\n<li>We consider the options for a HP 7 release date of 7-7-07</li>\n<li>And how about length?</li>\n<li>Andrew’s closing MuggleNet the moment HP7 is released, but Eric will keep his Caption Contest open forever</li>\n<li>Who will help Harry search for Horcruxes?</li>\n<li>Was Dumbledore’s hand burnt because of his weakness?</li>\n<li>Is the Order in danger of being found out?</li>\n<li>An interesting theory on where Ollivander went</li>\n<li>Ministry of Magic’s role in HP7</li>\n<li>No cheating on iTunes!</li>\n<li>Thanks to Andrew and Kenneth for their great rendition of Hedwig’s theme!</li>\n</ul>\n",
  "pubDate": "Sun, 21 Aug 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316359",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}