{
  "title": "The Power of Netflix",
  "pubDate": "Fri, 22 Jan 2021 18:43:53 +0000",
  "guid": "45d05f3a-9e2b-44eb-87a5-bf0b47508b7f",
  "link": "https://fool.libsyn.com/the-power-of-netflix",
  "itunes:image": "",
  "description": "<p class=\"wsjtheme--share-item-2skoksarwa9emairihe5ht\">Netflix hits an all-time high on strong subscriber growth. Bank of America, IBM, Intuitive Surgical, and Procter & Gamble slip on earnings. Intel stays flat despite surprising PC sales. Lumentum joins forces with fellow laser maker Coherent. Google grounds its balloon initiative. And Fiat Chrysler and PSA Group complete their merger and take on a new name: Stellantis. Motley Fool analysts Ron Gross and Jason Moser discuss those stories and share two stocks on their radar: McCormick and Schrodinger. Plus, Professor Erin Meyer talks about her best-selling book, <span class=\"fl-heading-text\"><em>No Rules Rules: Netflix and the Culture of Reinvention.</em></span></p>",
  "content:encoded": "<p class=\"wsjtheme--share-item-2skoksarwa9emairihe5ht\">Netflix hits an all-time high on strong subscriber growth. Bank of America, IBM, Intuitive Surgical, and Procter & Gamble slip on earnings. Intel stays flat despite surprising PC sales. Lumentum joins forces with fellow laser maker Coherent. Google grounds its balloon initiative. And Fiat Chrysler and PSA Group complete their merger and take on a new name: Stellantis. Motley Fool analysts Ron Gross and Jason Moser discuss those stories and share two stocks on their radar: McCormick and Schrodinger. Plus, Professor Erin Meyer talks about her best-selling book, <em>No Rules Rules: Netflix and the Culture of Reinvention.</em></p>",
  "enclosure": "",
  "itunes:duration": "38:37",
  "itunes:explicit": false,
  "itunes:keywords": "motleyfool,chrishill,jasonmoser,rongross,netflixstock,stellantis,intelstock,mccormickstock,ibmstock,intuitivesurgicalstock,proctergamblestock,bankofamericastock,lumentumstock,googleballoon,schrodingerstock,erinmeyer,norulesrules,netflixbook",
  "itunes:subtitle": "Netflix hits an all-time high on strong subscriber growth. Bank of America, IBM, Intuitive Surgical, and Procter & Gamble slip on earnings. Intel stays flat despite surprising PC sales. Lumentum joins forces with fellow laser maker Coherent....",
  "itunes:episodeType": "full"
}