{
  "title": "Fights",
  "description": "This month, Christina, Bryan, and Brandon look at the debates that can sometimes divide the queer family. After the usual Pride and Provocations, they dig into three fights happening in our community, including how critical we should be of queer art, authenticity of queer artists, and what we should all think about Marianne Williamson. Then we hear an interview with the late gay and lesbian rights activist Jean O’Leary, thanks to our friends at the Making Gay History podcast. We close it out with the gay agenda before saying farewell to Brandon, who is heading off to a new job at CNN.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Wed, 21 Aug 2019 07:00:00 -0000",
  "itunes:title": "Fights",
  "itunes:episodeType": "full",
  "itunes:author": "Slate Podcasts",
  "itunes:subtitle": "Picking apart the debates that rile up our queer family.",
  "itunes:summary": "This month, Christina, Bryan, and Brandon look at the debates that can sometimes divide the queer family. After the usual Pride and Provocations, they dig into three fights happening in our community, including how critical we should be of queer art, authenticity of queer artists, and what we should all think about Marianne Williamson. Then we hear an interview with the late gay and lesbian rights activist Jean O’Leary, thanks to our friends at the Making Gay History podcast. We close it out with the gay agenda before saying farewell to Brandon, who is heading off to a new job at CNN.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>This month, Christina, Bryan, and Brandon look at the debates that can sometimes divide the queer family. After the usual Pride and Provocations, they dig into three fights happening in our community, including how critical we should be of queer art, authenticity of queer artists, and what we should all think about Marianne Williamson. Then we hear an interview with the late gay and lesbian rights activist Jean O’Leary, thanks to our friends at the <a href=\"https://makinggayhistory.com/\"><em>Making Gay History</em></a><em> </em>podcast. We close it out with the gay agenda before saying farewell to Brandon, who is heading off to a new job at CNN.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 3641,
  "guid": "c24943d8-b1f0-11e8-8d12-3f960b981258",
  "enclosure": ""
}