{
  "title": "Introduction to Semi-Supervised Learning with Ladder Networks",
  "link": "",
  "published": "2016-01-19T00:00:00+00:00",
  "updated": "2016-01-19T00:00:00+00:00",
  "id": "/2016/01/19/ladder-network",
  "content": "<p>Today, deep learning is mostly about pure supervised learning. A major drawback of supervised learning is that it requires a lot of labeled data and It is quite expensive to collect them. So, deep learning in the future is expected to unsupervised, more human-like.</p>\n\n<blockquote>\n  <p>“We expect unsupervised learning to become far more important in the longer term. Human and animal learning is largely unsupervised: we discover the  structure of the world by observing it, not by being told the name of every object.”<br />\n– LeCun, Bengio, Hinton, Nature 2015</p>\n</blockquote>\n\n<h2 id=\"semi-supervised-learning\">Semi-Supervised Learning</h2>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Semi-supervised_learning\">Semi-supervised learning</a> is a class of supervised learning tasks and techniques that also make use of unlabeled data for training - typically a small amount of labeled data with a large amount of unlabeled data.</p>\n\n<p>So, how can unlabeled data help in classification? Consider the following example (taken from <a href=\"https://users.ics.aalto.fi/praiko/papers/ladder2.pdf\">these slides</a>) consisting of only two data points with labels.</p>\n\n<p><img src=\"/img/semi1.png\" alt=\"semi1\" class=\"center-image\" /></p>\n\n<p>How would you label this point?</p>\n\n<p><img src=\"/img/semi2.png\" alt=\"semi2\" class=\"center-image\" /></p>\n\n<p>What if you see all the unlabeled data?<br />\n <br />\n <br />\n<img src=\"/img/semi3.png\" alt=\"semi3\" class=\"center-image\" />\n <br />\nIn order to make any use of unlabeled data, we must assume some structure to the underlying distribution of data. Labels are homogeneous in densely populated space ie., data points close to each other belong to the same class (smoothness assumption). Iterating this assumption over the data points until all data points are assigned a label,<br />\n <br />\n <br />\n<img src=\"/img/semi4.png\" alt=\"semi4\" class=\"center-image\" />\n <br />\n <br />\n<img src=\"/img/semi5.png\" alt=\"semi5\" class=\"center-image\" />\n <br />\n <br />\n<img src=\"/img/semi6.png\" alt=\"semi6\" class=\"center-image\" />\n <br />\n <br />\n<img src=\"/img/semi7.png\" alt=\"semi7\" class=\"center-image\" />\n </p>\n\n<p>It has been discovered that the use of unlabeled data together with a small amount of labeled data can improve accuracy considerably. The collection of unlabeled data is inexpensive relative to labeled data. Often labeled data is scarce and unlabeled data is plentiful. In such situations, semi-supervised learning can be used. Also, much of human learning involves a small amount of direct instruction (labeled data) combined with large amounts of observation (unlabeled data). Hence, semi-supervised learning is a plausible model for human learning.</p>\n\n<h2 id=\"ladder-networks\">Ladder Networks</h2>\n\n<p>Ladder networks combine supervised learning with unsupervised learning in deep neural networks. Often, unsupervised learning was used only for pre-training the network, followed by normal supervised learning. In case of ladder networks, it is trained to simultaneously minimize the sum of supervised and unsupervised cost functions by backpropagation, avoiding the need for layer-wise pre-training. Ladder network is able to achieve state-of-the-art performance in semi-supervised MNIST and CIFAR-10 classification, in addition to permutation-invariant MNIST classification with all labels.</p>\n\n<h3 id=\"key-aspects\">Key Aspects</h3>\n\n<h4 id=\"compatibility-with-supervised-methods\">Compatibility with supervised methods</h4>\n\n<p>It can be added to existing feedforward neural networks. The unsupervised part focuses on relevant details found by supervised learning. It can also be extended to be added to recurrent neural networks.</p>\n\n<h4 id=\"scalability-resulting-from-local-learning\">Scalability resulting from local learning</h4>\n\n<p>In addition to a supervised learning target on the top layer, the model has local unsupervised learning targets on every layer, making it suitable for very deep neural networks.</p>\n\n<h4 id=\"computational-efficiency\">Computational efficiency</h4>\n\n<p>Adding a decoder (part of the ladder network) approximately triples the computation during training but not necessarily the training time since the same result can be achieved faster through the better utilization of the available information.</p>\n\n<h3 id=\"implementation\">Implementation</h3>\n\n<p><em>This is a brief introduction to the implementation of Ladder networks. A detailed and in-depth explanation of Ladder network can be found in the paper <a href=\"http://arxiv.org/abs/1507.02672\">“Semi-Supervised Learning with Ladder Networks”</a>.</em></p>\n\n<p>The steps involved in implementing the Ladder network are typically as follows:</p>\n\n<ol>\n  <li>Take a feedforward model which serves supervised learning as the encoder. The network consists of 2 encoder paths - clean and corrupted encoder. The only difference is that the corrupted encoder adds Gaussian noise at all layers.</li>\n  <li>Add a decoder which can invert the mappings on each layer of the encoder and supports unsupervised learning. Decoder uses a denoising function to reconstruct the activations of each layer given the corrupted version. The target at each layer is the clean version of the activation and the difference between the reconstruction and the clean version serves as the denoising cost of that layer.</li>\n  <li>The supervised cost is calculated from the output of the corrupted encoder and the output target. The unsupervised cost is the sum of denoising cost of all layers scaled by a hyperparameter that denotes the significance of each layer. The final cost is the sum of supervised and unsupervised cost.</li>\n  <li>Train the whole network in a fully-labeled or semi-supervised setting using standard optimization techniques (such as stochastic gradient descent) to minimize the cost.</li>\n</ol>\n\n<p>An illustration of a 2 layer ladder network,\n <br />\n <br />\n<img src=\"/img/ladder_net.png\" alt=\"ladder network\" />\n <br />\nBatch normalization is applied to each preactivation including the topmost layer to improve convergence (due to reduced covariate shift) and to prevent the denoising cost from encouraging the trivial solution (encoder outputs constant values as these are the easiest to denoise). Direct connection between a layer and it’s decoded reconstruction are used. The network is called a Ladder network because the resulting encoder/decoder architecture resembles a ladder.\n <br />\n <br />\n <br />\n<img src=\"/img/ladder_algorithm.png\" alt=\"ladder algorithm\" />\n <br />\n </p>\n\n<h3 id=\"conclusion\">Conclusion</h3>\n\n<p>The performance of Ladder networks is very impressive. On MNIST, it achieves an error rate of 1.06% with only 100 labeled examples! This is much better than previous published results, which shows that the method is capable of making good use of unsupervised learning. However, the same model also achieves state-of-the-art results and a significant improvement over the base-line model with full labels in permutation invariant MNIST classification, which suggests that the unsupervised task does not disturb supervised learning.</p>\n\n<p>Ladder network is simple and easy to implement with many existing feedforward architectures, as the training is based on backpropagation from a simple cost function. It is quick to train and the convergence is fast, thanks to batch normalization.</p>\n\n<h3 id=\"code\">Code</h3>\n\n<p>The code published along with the original paper is available here - <a href=\"https://github.com/CuriousAI/ladder\">https://github.com/CuriousAI/ladder</a>. My implementation of Ladder networks in <a href=\"http://tensorflow.org/\">TensorFlow</a> is available here - <a href=\"https://github.com/rinuboney/ladder\">https://github.com/rinuboney/ladder</a>. <em>Note: The TensorFlow implementation achieves an error rate about 0.2% - 0.3% more than the error rates published in the paper.</em></p>\n\n<h3 id=\"related-papers\">Related papers</h3>\n\n<p>Semi-supervised learning using Ladder networks was introduced in this paper:</p>\n\n<ul>\n  <li><a href=\"http://arxiv.org/abs/1507.02672\">Rasmus, Antti, et al. “Semi-Supervised Learning with Ladder Networks.” Advances in Neural Information Processing Systems. 2015.</a></li>\n</ul>\n\n<p>Ladder network was further analyzed and some improvements that attained an even better performance were suggested in this paper:</p>\n\n<ul>\n  <li><a href=\"http://arxiv.org/abs/1511.06430\">Pezeshki, Mohammad, et al. “Deconstructing the Ladder Network Architecture.” arXiv preprint arXiv:1511.06430 (2015).</a></li>\n</ul>\n\n<p>and finally, these are the papers that led to the development of Ladder networks:</p>\n\n<ul>\n  <li><a href=\"http://arxiv.org/abs/1412.7210\">Rasmus, Antti, Tapani Raiko, and Harri Valpola. “Denoising autoencoder with modulated lateral connections learns invariant representations of natural images.” arXiv preprint arXiv:1412.7210 (2014).</a></li>\n  <li><a href=\"http://arxiv.org/abs/1504.08215\">Rasmus, Antti, Harri Valpola, and Tapani Raiko. “Lateral Connections in Denoising Autoencoders Support Supervised Learning.” arXiv preprint arXiv:1504.08215 (2015).</a></li>\n  <li><a href=\"http://arxiv.org/abs/1411.7783\">Valpola, Harri. “From neural PCA to deep unsupervised learning.” arXiv preprint arXiv:1411.7783 (2014).</a></li>\n</ul>",
  "author": {
    "name": ""
  },
  "summary": "Today, deep learning is mostly about pure supervised learning. A major drawback of supervised learning is that it requires a lot of labeled data and It is quite expensive to collect them. So, deep learning in the future is expected to unsupervised, more human-like."
}