{
  "title": "S14 Ep82: The Holzer Files",
  "link": "https://audioboom.com/posts/8098548",
  "itunes:episode": 82,
  "itunes:title": "The Holzer Files",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 8921,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS reopens The Holzer Files today! A look at the life, death and paranormal research of legendary investigator Dr. Hans Holzer. <br>\n<br>\nToday we are joined by the entire cast of The Holzer Files from Travel Channel's New Series! Join Alexandra Holzer, Cindy Kaza, Shane Pittman, Gabe Roth and Dave Schrader as they give insights into the man, his work and long last contributions to the field of paranormal research. <br>\n<br>\nListen to the show but watch the new series every Thursday on Travel Channel.<br>\n<a href=\"https://www.travelchannel.com/shows/holzer-files\">https://www.travelchannel.com/shows/holzer-files</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL games and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a>",
  "itunes:summary": "BEYOND the DARKNESS reopens The Holzer Files today! A look at the life, death and paranormal research of legendary investigator Dr. Hans Holzer. \n\nToday we are joined by the entire cast of The Holzer Files from Travel Channel's New...",
  "pubDate": "Sun, 06 Oct 2019 08:00:00 +0000",
  "guid": "8f337d4d-a92e-4262-ad82-147c68dd2c2e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}