{
  "published": "2022-11-05T08:00:00-04:00",
  "updated": "2022-11-05T08:00:00-04:00",
  "title": "The most interesting EV concepts at the 2022 SEMA conference",
  "content": "<figure>\n      <img alt=\"Nissan Sunny restomod truck\" src=\"https://cdn.vox-cdn.com/thumbor/m2iLifeDgsT4HwIVJTo-9KG3O7s=/0x0:6000x4000/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/71588105/Sunny_LEAF_Hero.0.jpg\" />\n        <figcaption>Image: Nissan</figcaption>\n    </figure>\n\n  <p id=\"bpzOkD\">The Specialty Equipment Market Association, or SEMA, held its annual conference in Las Vegas this week. Billed as one of the biggest car shows in the world, the event typically brings together more than 135,000 attendees in the automotive aftermarket industry to see the newest trends in vehicle repairs and modifications. </p>\n<p id=\"6XIZ4p\">And this year, EVs were a particular focus. The event featured a dedicated space for EVs, labeled “SEMA Electrified,” and according to the <em>Las Vegas Review-Journal, </em>it was 740 percent larger compared to 2019, when it was first debuted. Several major automakers showed up with a bunch of unique EV concepts in tow. Here are some of the ones that stood out the most. </p>\n<h2 id=\"dmj0PZ\">Ford</h2>\n  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/HLETXccfo-840oe18aAlagZdX28=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24169298/cq5dam.web.951.535__4_.jpeg\">\n      <cite>Image: Ford</cite>\n  </figure>\n  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/yGyN_Rth9C7KPZonGICjrzq-NsA=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168418/cq5dam.web.951.535.jpeg\">\n      <cite>Image: Ford</cite>\n  </figure>\n<p id=\"ggUhDr\">Ford brought 10 vehicles to SEMA this year, including three EVs based on the Mustang Mach-E and F-150 Lightning. </p>\n<p id=\"bHwxWR\">First up is the <strong>Mustang Mach-E True Mustang Persona</strong> built by Dom Tucci Design (Tucci Hot Rods) and Kay Automotive Graphics. The vehicle, which is based on a dual-motor 2022 Ford Mustang Mach-E GT, features a muscular custom lift-gate spoiler, fender arches with 3D-printed fender flares, vacuum-formed transparent wheel covers, and a 3D-printed front lip. </p>\n  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/ph4j50N5ta0HPKhbona2mhCNsLw=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168437/cq5dam.web.951.535__1_.jpeg\">\n      <cite>Image: Ford</cite>\n  </figure>\n<p id=\"kM6AG7\">Up next is the <strong>Ford F-150 Lightning Race Support</strong> built by Real Truck and Motor City Solutions. Equipped with an air compressor, leveling kit, off-road recovery boards, and Recaro seats along with a fully mobile toolbox and welding equipment, Ford says that this electric pickup is “equally at home on the road and at a Baja race as a support vehicle.” </p>\n  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/6oeMAdCCBloF1HPMWe_cde8uUFo=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168447/cq5dam.web.951.535__3_.jpeg\">\n      <cite>Image: Ford</cite>\n  </figure>\n<p id=\"3bh2Lq\">The <strong>F-150 Lightning Swiss Army Knife</strong> is built by Tjin Edition and Thule. Ford calls it a “jack-of-all-trades” with its solar charging capability, portable air compressor, refrigerator, console vault, Recaro front and rear seats, and Thule cargo accessories. Two Super73 e-bikes mounted on the back of the truck offer some options for those who prefer two wheels to four.</p>\n<p id=\"qx4rY9\"><a href=\"https://media.ford.com/content/fordmedia/fna/us/en/media-kits/2022/sema-2022.html\">Ford says</a> its personalization and accessories business has grown 40 percent in the last two years, with the Bronco being the most accessorized vehicle in the lineup.</p>\n<h2 id=\"7TWpHI\">Volkswagen</h2>\n  <figure class=\"e-image\">\n        <img alt=\" \" data-mask-text=\"false\" src=\"https://cdn.vox-cdn.com/thumbor/cIv3CvYVz_716iFfG2MIc_MZ7UI=/400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/24168481/16129_VolkswagenID.4.jpg\">\n      <cite>Image: VW</cite>\n  </figure>\n<p id=\"HtJ7JA\">VW was awarded SEMA’s first-ever Electric Vehicle of the Year prize for its ID.4 crossover. Show exhibitors selected the ID.4 for its potential for customization, its ability to handle a variety of terrain, and as a leading example of the possibilities in the electric vehicle market.</p>\n<div id=\"uxP00q\"><div data-anthem-component=\"gallery:11603972\"></div></div>\n<p id=\"k8GQHH\">The automaker brought out two ID.4-based concepts, including one it calls a <strong>Mobile Drone Response Vehicle</strong> with a big roof rack designed to carry and launch large drones. The drone response vehicle will be put to use by the Tennessee Valley Authority, which has the goal of operating a 100 percent electric fleet by the year 2030. The modified ID.4 is certainly eye-catching, featuring a custom storage unit for drone and field equipment and a portable power station. </p>\n<p id=\"jEuVBF\"><strong>The ID.4 Accessories concept</strong> comes equipped with a Thule Canyon Basket to haul gear and an Apex XT 9025XT hitch-mounted bike rack. Splash guards protect the 18-inch wheels with H&amp;R Trak Plus wheel spacers and 245/60R18 all-terrain tires.</p>\n<h2 id=\"rZKBxt\">Nissan</h2>\n<p id=\"AcxP8I\">The Japanese automaker didn’t come to play. It brought two striking concepts to SEMA: a <strong>1987 Sunny restomod</strong> running a Leaf engine as well as a pretty unusual looking <strong>Ariya Surfwagon woodie</strong> with teal hubcaps and two surfboards on the roof.</p>\n<div id=\"MftUaH\"><div data-anthem-component=\"gallery:11603875\"></div></div>\n<p id=\"LNwJNU\">The California-style wagon was created by South Carolina-based Tommy Pike Customs. With a custom vinyl wrap and chrome trim, the Surfwagon features “smoothie” 20-inch wheels with white-wall tires, a custom roof rack, and a custom lowered suspension.</p>\n<div id=\"6sTL6j\"><div data-anthem-component=\"gallery:11603884\"></div></div>\n<p id=\"XLqMk2\">The Sunny truck will definitely put a smile on your face. The 1987-era truck has been converted to run on a Leaf battery, also by Tommy Pike Customs. Rated at 147 horsepower and 236 pound-feet of torque, the Leaf motor has around twice the power and more than three times the torque of the gasoline four-cylinder engine originally equipped in the Sunny.</p>\n<h2 id=\"xpbE5W\">Stellantis</h2>\n<div id=\"Qu68oE\"><div data-anthem-component=\"gallery:11603952\"></div></div>\n<p id=\"aq26Yq\">Mopar, Stellantis’ auto parts division, brought a bunch of concepts, including the <strong>Jeep CJ Surge</strong>, an open-body, battery-powered vehicle that is meant to showcase the possibility of EV conversion kits for vintage Jeeps. The electromod is meant to give the automaker’s engineers a better understanding of EV parts kit applications, which could lead to a future product lineup for enthusiasts to convert their vintage vehicles to EVs. </p>\n<p id=\"42LEBl\">The Jeep CJ Surge is powered by a custom propulsion system. Under the hood, you’ll find a scalable 400-volt, 200kW motor mounted to the frame. Battery modules, of which there are 24, are enclosed in a custom shell mounted in the rear of the passenger cabin. The Jeep’s body is perched on 35-inch BFGoodrich all-terrain tires, paired with a two-inch lift kit.</p>\n<p id=\"vVmTYJ\">Jeep also fits a custom roll cage and bikini top, while the center console comes from a JK Wrangler (built from 2007 to 2017) and features a rotary shift knob in place of the stock lever.</p>",
  "link": "",
  "id": "https://www.theverge.com/2022/11/5/23440408/sema-2022-ev-restomod-ford-nissan-vw-jeep",
  "author": {
    "name": "Andrew J. Hawkins"
  }
}