{
  "title": "EPISODE 53 Diogenes: The Punk Rocker of Ancient Greece",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sat, 31 Aug 2019 14:06:49 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/8/31/episode-53-diogenes-the-punk-rocker-of-ancient-greece",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5d6a7d5e426fc00001386dfb",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1567260216212-V6R10NQG1OFL2EUKC06F/HOF-53-Diogenes.JPG\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-53-Diogenes.JPG\" data-load=\"false\" data-image-id=\"5d6a7e33426fc000013884ae\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1567260216212-V6R10NQG1OFL2EUKC06F/HOF-53-Diogenes.JPG?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“A Socrates gone mad.”</em> — Plato referring to Diogenes&nbsp;</p><p class=\"\"><em>“Had I not been Alexander, I would have liked to have been Diogenes.”</em> — Alexander the Great&nbsp;</p><p class=\"\"><em>\"If I wasn't Diogenes, I would be wishing to be Diogenes too.\"</em> — Diogenes</p><p class=\"\"><em>“There are nowadays professors of philosophy, but not philosophers… To be a philosopher is not merely to have subtle thoughts, nor even to found a school, but so to love wisdom as to live according to its dictates, a life of simplicity, independence, magnanimity, and trust. It is to solve some of the problems of life, not only theoretically, but practically.” —</em> Henry David Thoreau&nbsp;</p><p class=\"\"><em>“I am a citizen of the world.” —</em> Diogenes</p><p class=\"\"><em>“Free from what? As if that mattered. . . . But your eyes should tell me brightly: free for what?”</em> — Friedrich Nietzsche&nbsp;</p><p class=\"\"><em>“He maintained, moreover, that nothing in life has any chance of succeeding without strenuous practice, which is capable of overcoming any obstacles.” —</em> Diogenes Laertius&nbsp;</p><p class=\"\">2,400 years ago, long before punk rock was created, there was a man in ancient Greece who embodied the spirit of punk as much as anyone ever did. He was known as Diogenes The Dog. And Sid Vicious had nothing on him.&nbsp;</p><p class=\"\">Between the end of the Peloponnesian War, the bloody reign of the Thirty Tyrants, Socrates’ death… the times he lived in were wild ones, but Diogenes was considerably wilder than his historical context. As a master of frugality, he lived on the streets as a homeless philosopher inviting people to stop being slaves of their possessions. In this episode, we’ll see him clashing with the father of Western philosophy, getting busted for manipulating the currency, being the recipient of the good graces of celebrity sex workers, planting the seeds at the roots of Stoicism, defying Alexander the Great, getting kidnapped by pirates, rejecting nationalism, and pushing forward ideas that were as outlandish in Ancient Greece as they are today. The Amazons, the Oracle at Delphi, Game of Thrones, The Clash, The Temptations, The Princess Bride, and Nicki Minai also make an appearance in this episode.&nbsp; And before we wrap things up, we’ll consider the limitations of punk as a worldview.&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">Onnit has shown me love from day 1. So, please check out their supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;<br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:47:35",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 53,
  "itunes:title": "EPISODE 53 Diogenes: The Punk Rocker of Ancient Greece",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 53 Diogenes: The Punk Rocker of Ancient Greece"
  }
}