{
  "id": "https://bibleinoneyear.org/en/youth/328",
  "title": "Day 328: Your Example",
  "description": "Proverbs 28:26, Ezekiel 45:1,3b,9,15, 1 Peter 3:1–3a,4,7–17.  What they see they believe!’*As we read yesterday, you are called to follow Jesus’ example in your life (1 Peter 2:21)  Today we see some of the implications of this",
  "pubDate": "Wed, 24 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/328/?ignore",
  "itunes:duration": "14:21",
  "guid": "enyouth24112021-328",
  "length": 861.99,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 328: Your Example",
  "itunes:subtitle": "Proverbs 28:26, Ezekiel 45:1,3b,9,15, 1 Peter 3:1–3a,4,7–17.  What they see they believe!’*As we read yesterday, you are called to follow Jesus’ example in your life (1 Peter 2:21)  Today we see some of the implications of this",
  "itunes:summary": "Pope Francis paused for a moment after one of his general audiences to pray, embrace and lay hands on a man with neurofibromatosis, a severely disfiguring disease. The man’s face was covered in tumours. The image of the Pope’s embrace in St Peter’s Square went viral on social media, inspiring millions by his poignant example of the love of Christ.\nThere is great power in example. It is hard to improve if we have no other model than ourselves to follow. A good example is not only inspirational, it also gives us a pattern to copy and learn from.\nNot only do you benefit most from following the example of others, but your example is vital if you are to have any influence on other people. Albert Schweitzer, the French theologian, philosopher and physician said, ‘Example is not the main thing in influencing others – it is the only thing.’ More depends on your walk than on your talk, what you practice than what you preach, what you do than what you say.\nWhat people see is far more important than what they hear. People do what people see. As John Maxwell writes, ‘Eighty-nine per cent of what people learn comes through visual stimulation; ten per cent through audible stimulation and one per cent through other senses... What they hear they understand. What they see they believe!’\nAs we read yesterday, you are called to follow Jesus’ example in your life (1 Peter 2:21). Today we see some of the implications of this.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 328
}