{
  "id": "yt:video:nSx3Ekx2hTM",
  "yt:videoId": "nSx3Ekx2hTM",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "How One Game Rocked A Community - The Story Behind Hunt Down The Freeman | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2021-01-20T21:59:59+00:00",
  "updated": "2022-06-24T08:37:50+00:00",
  "media:group": {
    "media:title": "How One Game Rocked A Community - The Story Behind Hunt Down The Freeman | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Right Opinion: How One Game Rocked A Community - The Story Behind Hunt Down The Freeman | TRO\n\n0:00 - Hunt Down The Freeman\n6:30 - Hunt Down The Backstory\n13:39 - Hunt Down The Funding\n20:49 - Hunt Down The Release\n27:29 - Hunt Down The Response\n42:30 - Hunt Down The Refund\n52:23 - Hunt Down The Controversy\n58:32 - Hunt Down The Berkan\n1:05:54 - Hunt Down The Conclusion\n1:13:11 - Outro & Credits\n\nIntro:  \n\nRecently, I have been the recipient of shocking allegations, that I, am frankly astounded anyone would suggest, these are of course, the allegations, that I am in fact, not a gamer. \n\nFitting reaction of shock\n\nI know my friends, I am as outraged as you are, once again, the pineapple on pizza loving heathens have the audacity to cast doubt on my gamer credentials, needless to say, I would be crying at the club, if it was open. So I guess I will have to debunk these claims by taking on another gamer topic, one which will serve as indisputable evidence for my unflinching gamer status, but for this intro, let’s talk about another curious video game that serves as the backdrop for today’s subject. \n\nHalf-Life, it’s a video game, for gamers, like me, who wish to immerse themselves in a first-person shooter with a bit more depth, with the first being released in 1998, the second in 2004, and further successive instalments being released in 2006 and 2007, as well as some additional expansion packs in between. The first game focuses around an individual by the name of Gordon Freeman, who, like many people, triggers an alien invasion when an experiment that he’s running opens up a dimensional rift in time and space. Obviously, antics ensue, and he finds himself up against a diverse plethora of enemies in his mission to return stability to this facility, and the planet alike. Obviously, my synopsis of these games will remain relatively short so I don’t spoil it for anyone planning to play it themselves, but generally speaking it’s considered by many to be one of the greatest games ever published. This is the same story with Half-Life 2, which follows our good friend Gordon a couple decades on after the events of the first, it incorporates many elements present in its predecessor, while adding new features and improving on existing ones. In spite of their shooter status, the series was characterised by its heightened sense of ambition, with Valve President Gabe Newell stating that “if Half-Life 2 isn't viewed as the best PC game of all time, it's going to completely bum out most of the guys on this team”. But Gabe need not have feared, it was released to universal acclaim from reviewers and audiences alike, and is also regarded by many as one of the greatest games of all time.\n\nAfter the success of the first two games, the developers decided to further metamorphose their approach, with the plan to release a trilogy of episodes, continuing the story from the lens of our protagonist, and a new non-player character by the name of Alyx Vance, a lovely young lady who was present in the previous game, but was now receiving a more prominent role as a companion to Mr. Freeman here. The first two episodes were released to highly positive reception, however, it wasn’t quite equivalent to the rampant appraisal that the previous games had received, though this did not appear to deter them. Episode 3 should have completed the trilogy, and was planned for release in Christmas 2007, however, was initially postponed, and then cancelled following a sequence of delays and changes to company trajectory. \n\nSince then there has been a lot of speculation as to when the long anticipated “Half-Life 3” will be released. In fact, as I’m sure many of you know, there is an infamous meme, revolving around people’s rather excitable nature to seek confirmation of the game’s announcement, indulged by many throughout the industry. On Wikipedia, there is a page exclusively dedicated to documenting unreleased Half-Life games, it seems that in spite of their revered status within gamer society, the hype surrounding prospective Half-Life projects precedes them. \n\nThe series have elevated itself to this cult-level status, and wherever there’s a devoted fanbase, there’s typically market potential, combine this with the desire simply for more Half-Life content, yet a significant lack of it in the decade following the uncompleted trilogy, and people were longing for a saviour, holding out for a hero to give them what they wanted, and from the darkness, came an unlikely salvation, but was it the one we needed, or the one we deserved.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}