{
  "title": "Episode 146: &#8220;Good Vibrations&#8221; by the Beach Boys",
  "link": "https://500songs.com/podcast/episode-146-good-vibrations-by-the-beach-boys/",
  "pubDate": "Fri, 25 Mar 2022 04:54:51 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1099",
  "description": "Episode one hundred and forty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Good Vibrations” by the Beach Boys, and the history of the theremin. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/64241985\">\"You're Gonna Miss Me\" by the Thirteenth Floor Elevators</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I’ve checked for specific things.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe’s <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins’ <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert’s <em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nI have also referred to Brian Wilson’s autobiography, <em><a href=\"https://amzn.to/3AMbmys\">I Am Brian Wilson</a></em>, and to Mike Love’s, <em><a href=\"https://amzn.to/3AMbmys\">Good Vibrations: My Life as a Beach Boy</a>.</em>\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it, including the single version of \"Good Vibrations\".\n\nOddly, the single version of \"Good Vibrations\" is <em>not</em> on the <a href=\"https://amzn.to/3wC2Ylh\"><em>The Smile Sessions </em></a>box set. But an entire CD of outtakes of the track is, and that was the source for the session excerpts here.\n\nInformation on Lev Termen comes from <a href=\"https://amzn.to/36MSXGT\"><em>Theremin: Ether Music and Espionage</em> </a>by Albert Glinsky\n\n<strong>Transcript</strong>\n\nIn ancient Greece, the god Hermes was a god of many things, as all the Greek gods were. Among those things, he was the god of diplomacy, he was a trickster god, a god of thieves, and he was a messenger god, who conveyed messages between realms. He was also a god of secret knowledge. In short, he was the kind of god who would have made a perfect spy.\n\nBut he was also an inventor. In particular he was credited in Greek myth as having invented the lyre, an instrument somewhat similar to a guitar, harp, or zither, and as having used it to create beautiful sounds. But while Hermes the trickster god invented the lyre, in Greek myth it was a mortal man, Orpheus, who raised the instrument to perfection. Orpheus was a legendary figure, the greatest poet and musician of pre-Homeric Greece, and all sorts of things were attributed to him, some of which might even have been things that a real man of that name once did. He is credited with the \"Orphic tripod\" -- the classification of the elements into earth, water, and fire -- and with a collection of poems called the Rhapsodiae.\n\nThe word Rhapsodiae comes from the Greek words rhaptein, meaning to stitch or sew, and ōidē, meaning song -- the word from which we get our word \"ode\", and  originally a rhapsōdos was someone who \"stitched songs together\" -- a reciter of long epic poems composed of several shorter pieces that the rhapsōdos would weave into one continuous piece. It's from that that we get the English word \"rhapsody\", which in the sixteenth century, when it was introduced into the language, meant a literary work that was a disjointed collection of patchwork bits, stitched together without much thought as to structure, but which now means a piece of music in one movement, but which has several distinct sections. Those sections may seem unrelated, and the piece may have an improvisatory feel, but a closer look will usually reveal relationships between the sections, and the piece as a whole will have a sense of unity.\n\nWhen Orpheus' love, Eurydice, died, he went down into Hades, the underworld where the souls of the dead lived, and played music so beautiful, so profound and moving, that the gods agreed that Orpheus could bring the soul of his love back to the land of the living. But there was one condition -- all he had to do was keep looking forward until they were both back on Earth. If he turned around before both of them were back in the mortal realm, she would disappear forever, never to be recovered.\n\nBut of course, as you all surely know, and would almost certainly have guessed even if you didn't know because you know how stories work, once Orpheus made it back to our world he turned around and looked, because he lost his nerve and didn't believe he had really achieved his goal. And Eurydice, just a few steps away from her freedom, vanished back into the underworld, this time forever.\n\n[Excerpt: Blake Jones and the Trike Shop: \"Mr. Theremin's Miserlou\"]\n\nLev Sergeyevich Termen was born in St. Petersburg, in what was then the Russian Empire, on the fifteenth of August 1896, by the calendar in use in Russia at that time -- the Russian Empire was still using the Julian calendar, rather than the Gregorian calendar used in most of the rest of the world, and in the Western world the same day was the twenty-seventh of August.\n\nYoung Lev was fascinated both by science and the arts. He was trained as a cellist from an early age, but while he loved music, he found the process of playing the music cumbersome -- or so he would say later. He was always irritated by the fact that the instrument is a barrier between the idea in the musician's head and the sound -- that it requires training to play. As he would say later \"I realised there was a gap between music itself and its mechanical production, and I wanted to unite both of them.\"\n\nMusic was one of his big loves, but he was also very interested in physics, and was inspired by a lecture he saw from the physicist Abram Ioffe, who for the first time showed him that physics was about real, practical, things, about the movements of atoms and fields that really existed, not just about abstractions and ideals. When Termen went to university, he studied physics -- but he specifically wanted to be an experimental physicist, not a theoretician. He wanted to do stuff involving the real world.\n\nOf course, as someone who had the misfortune to be born in the late 1890s, Termen was the right age to be drafted when World War I started, but luckily for him the Russian Army desperately needed people with experience in the new invention that was radio, which was vital for wartime communications, and he spent the war in the Army radio engineering department, erecting radio transmitters and teaching other people how to erect them, rather than on the front lines, and he managed not only to get his degree in physics but also a diploma in music.\n\nBut he was also becoming more and more of a Marxist sympathiser, even though he came from a relatively affluent background, and after the Russian Revolution he stayed in what was now the Red Army, at least for a time.\n\nOnce Termen's Army service was over, he started working under Ioffe, working with him on practical applications of the audion, the first amplifying vacuum tube. The first one he found was that the natural capacitance of a human body when standing near a circuit can change the capacity of the circuit. He used that to create an invisible burglar alarm -- there was an antenna sending out radio waves, and if someone came within the transmitting field of the antenna, that would cause a switch to flip and a noise to be sounded.\n\nHe was then asked to create a device for measuring the density of gases, outputting a different frequency for different densities. Because gas density can have lots of minor fluctuations because of air currents and so forth, he built a circuit that would cut out all the many harmonics from the audions he was using and give just the main frequency as a single pure tone, which he could listen to with headphones. That way,  slight changes in density would show up as a slight change in the tone he heard. But he noticed that again when he moved near the circuit, that changed the capacitance of the circuit and changed the tone he was hearing.\n\nHe started moving his hand around near the circuit and getting different tones. The closer his hand got to the capacitor, the higher the note sounded. And if he shook his hand a little, he could get a vibrato, just like when he shook his hand while playing the cello.\n\nHe got Ioffe to come and listen to him, and Ioffe said \"That's an electronic Orpheus' lament!\"\n\n[Excerpt: Blake Jones and the Trike Shop, \"Mr. Theremin's Miserlou\"]\n\nTermen figured out how to play Massenet's \"Elegy\" and Saint-Saens' \"The Swan\" using this system. Soon the students were all fascinated, telling each other \"Termen plays Gluck on a voltmeter!\"\n\nHe soon figured out various refinements -- by combining two circuits, using the heterodyne principle, he could allow for far finer control. He added a second antenna, for volume control, to be used by the left hand -- the right hand would choose the notes, while the left hand would change the volume, meaning the instrument could be played without touching it at all.\n\nHe called the instrument the \"etherphone\",  but other people started calling it the termenvox -- \"Termen's voice\".\n\nTermen's instrument was an immediate sensation, as was his automatic burglar alarm, and he was invited to demonstrate both of them to Lenin. Lenin was very impressed by Termen -- he wrote to Trotsky later talking about Termen's inventions, and how the automatic burglar alarm might reduce the number of guards needed to guard a perimeter. But he was also impressed by Termen's musical invention. Termen held his hands to play through the first half of a melody, before leaving the Russian leader to play the second half by himself -- apparently he made quite a good job of it.\n\nBecause of Lenin's advocacy for his work, Termen was sent around the Soviet Union on a propaganda tour -- what was known as an \"agitprop tour\", in the familiar Soviet way of creating portmanteau words.\n\nIn 1923 the first piece of music written specially for the instrument was performed by Termen himself with the Leningrad Philharmonic, Andrey Paschenko's Symphonic Mystery for Termenvox and Orchestra. The score for that was later lost, but has been reconstructed, and the piece was given a \"second premiere\" in 2020\n\n[Excerpt: Andrey Paschenko, \"Symphonic Mystery for Termenvox and Orchestra\" ]\n\nBut the musical instrument wasn't the only scientific innovation that Termen was working on. He thought he could reverse death itself, and bring the dead back to life.  He was inspired in this by the way that dead organisms could be perfectly preserved in the Siberian permafrost. He thought that if he could only freeze a dead person in the permafrost, he could then revive them later -- basically the same idea as the later idea of cryogenics, although Termen seems to have thought from the accounts I've read that all it would take would be to freeze and then thaw them, and not to have considered the other things that would be necessary to bring them back to life.\n\nTermen made two attempts to actually do this, or at least made preliminary moves in that direction. The first came when his assistant, a twenty-year-old woman, died of pneumonia. Termen was heartbroken at the death of someone so young, who he'd liked a great deal, and was convinced that if he could just freeze her body for a while he could soon revive her. He talked with Ioffe about this -- Ioffe was friends with the girl's family -- and Ioffe told him that he thought that he was probably right and probably could revive her. But he also thought that it would be cruel to distress the girl's parents further by discussing it with them, and so Termen didn't get his chance to experiment.\n\nHe was even keener on trying his technique shortly afterwards, when Lenin died. Termen was a fervent supporter of the Revolution, and thought Lenin was a great man whose leadership was still needed -- and he had contacts within the top echelons of the Kremlin. He got in touch with them as soon as he heard of Lenin's death, in an attempt to get the opportunity to cryopreserve his corpse and revive him. Sadly, by this time it was too late. Lenin's brain had been pickled, and so the opportunity to resurrect him as a zombie Lenin was denied forever.\n\nTermen was desperately interested in the idea of bringing people back from the dead, and he wanted to pursue it further with his lab, but he was also being pushed to give demonstrations of his music, as well as doing security work -- Ioffe, it turned out, was also working as a secret agent, making various research trips to Germany that were also intended to foment Communist revolution.\n\nFor now, Termen was doing more normal security work -- his burglar alarms were being used to guard bank vaults and the like, but this was at the order of the security state.\n\nBut while Termen was working on his burglar alarms and musical instruments and attempts to revive dead dictators, his main project was his doctoral work, which was on the TV. We've said before in this podcast that there's no first anything, and that goes just as much for inventions as it does for music. Most inventions build on work done by others, which builds on work done by others, and so there were a lot of people building prototype TVs at this point. In Britain we tend to say \"the inventor of the TV\" was John Logie Baird, but Baird was working at the same time as people like the American Charles Francis Jenkins and the Japanese inventor Kenjiro Takayanagi, all of them building on earlier work by people like Archibald Low.\n\nTermen's prototype TV, the first one in Russia, came slightly later than any of those people, but was created more or less independently, and was more advanced in several ways, with a bigger screen and better resolution. Shortly after Lenin's death, Termen was invited to demonstrate his invention to Stalin, who professed himself amazed at the \"magic mirror\".\n\n[Excerpt: Blake Jones and the Trike Shop, \"Astronauts in Trouble\"]\n\nTermen was sent off to tour Europe giving demonstrations of his inventions, particularly his musical instrument. It was on this trip that he started using the Romanisation \"Leon Theremin\", and this is how Western media invariably referred to him. Rather than transliterate the Cyrillic spelling of his birth name, he used the French spelling his Huguenot ancestors had used before they emigrated to Russia, and called himself Leo or Leon rather than Lev. He was known throughout his life by both names, but said to a journalist in 1928 \"First of all, I am not Tair-uh-MEEN. I wrote my name with French letters for French pronunciation. I am Lev Sergeyevich Tair-MEN.\".\n\nWe will continue to call him Termen, partly because he expressed that mild preference (though again, he definitely went by both names through choice) but also to distinguish him from the instrument, because while his invention remained known in Russia as the termenvox, in the rest of the world it became known as the theremin.\n\nHe performed at the Paris Opera, and the New York Times printed a review saying \"Some musicians were extremely pessimistic about the possibilities of the device, because at times M. Theremin played lamentably out of tune. But the finest Stradivarius, in the hands of a tyro, can give forth frightful sounds. The fact that the inventor was able to perform certain pieces with absolute precision proves that there remains to be solved only questions of practice and technique.\"\n\nTermen also came to the UK, where he performed in front of an audience including George Bernard Shaw, Arnold Bennett, Henry Wood and others. Arnold Bennett was astonished, but Bernard Shaw, who had very strong opinions about music, as anyone who has read his criticism will be aware, compared the sound unfavourably to that of a comb and paper.\n\nAfter performing in Europe, Termen made his way to the US, to continue his work of performance, propagandising for the Soviet Revolution, and trying to license the patents for his inventions, to bring money both to him and to the Soviet state. He entered the US on a six-month visitor's visa, but stayed there for eleven years, renewing the visa every six months.\n\nHis initial tour was a success, though at least one open-air concert had to be cancelled because, as the Communist newspaper the Daily Worker put it, \"the weather on Saturday took such a counter-revolutionary turn\".\n\nNicolas Slonimsky, the musicologist we've encountered several times before, and who would become part of Termen's circle in the US, reviewed one of the performances, and described the peculiar audiences that Termen was getting -- \"a considerable crop of ladies and gentlemen engaged in earnest exploration of the Great Beyond...the mental processes peculiar to believers in cosmic vibrations imparted a beatific look to some of the listeners. Boston is a seat of scientific religion; before he knows it Professor Theremin may be proclaimed Krishnamurti and sanctified as a new deity\".\n\nTermen licensed his patents on the invention to RCA, who in 1929 started mass-producing the first ever theremins for general use. Termen also started working with the conductor Leopold Stokowski, including developing a new kind of theremin for Stokowski's orchestra to use, one with a fingerboard played like a cello. Stokowski said \"I believe we shall have orchestras of these electric instruments. Thus will begin a new era in music history, just as modern materials and methods of construction have produced a new era of architecture.\"\n\nPossibly of more interest to the wider public, Lennington Sherwell, the son of an RCA salesman, took up the theremin professionally, and joined the band of Rudy Vallee, one of the most popular singers of the period. Vallee was someone who constantly experimented with new sounds, and has for example been named as the first band leader to use an electric banjo, and Vallee liked the sound of the theremin so much he ordered a custom-built left-handed one for himself.\n\nSherwell stayed in Vallee's band for quite a while, and performed with him on the radio and in recording sessions, but it's very difficult to hear him in any of the recordings -- the recording equipment in use in 1930 was very primitive, and Vallee had a very big band with a lot of string and horn players, and his arrangements tended to have lots of instruments playing in unison rather than playing individual lines that are easy to differentiate. On top of that, the fashion at the time when playing the instrument was to try and have it sound as much like other instruments as possible -- to duplicate the sound of a cello or violin or clarinet, rather than to lean in to the instrument's own idiosyncracies.\n\nI *think* though that I can hear Sherwell's playing in the instrumental break of Vallee's big hit \"You're Driving Me Crazy\" -- certainly it was recorded at the time that Sherwell was in the band, and there's an instrument in there with a very pure tone, but quite a lot of vibrato, in the mid range, that seems only to be playing in the break and not the rest of the song. I'm not saying this is *definitely* a theremin solo on one of the biggest hits of 1930, but I'm not saying it's not, either:\n\n[Excerpt: Rudy Vallee, \"You're Driving Me Crazy\" ]\n\nTermen also invented a light show to go along with his instrument -- the illumovox, which had a light shining through a strip of gelatin of different colours, which would be rotated depending on the pitch of the theremin, so that lower notes would cause the light to shine a deep red, while the highest notes would make it shine a light blue, with different shades in between.\n\nBy 1930, though, Termen's fortunes had started to turn slightly. Stokowski kept using theremins in the orchestra for a while, especially the fingerboard models to reinforce the bass, but they caused problems. As Slonimsky said \"The infrasonic vibrations were so powerful...that they hit the stomach physically, causing near-nausea in the double-bass section of the orchestra\".\n\nFairly soon, the Theremin was overtaken by other instruments, like the ondes martenot, an instrument very similar to the theremin but with more precise control, and with a wider range of available timbres.\n\nAnd in 1931, RCA was sued by another company for patent infringement with regard to the Theremin -- the De Forest Radio Company had patents around the use of vacuum tubes in music, and they claimed damages of six thousand dollars, plus RCA had to stop making theremins. Since at the time, RCA had only made an initial batch of five hundred instruments total, and had sold 485 of them, many of them as promotional loss-leaders for future batches, they had actually made a loss of three hundred dollars even before the six thousand dollar damages, and decided not to renew their option on Termen's patents.\n\nBut Termen was still working on his musical ideas. Slonimsky also introduced Termen to the avant-garde composer and theosophist Henry Cowell, who was interested in experimental sounds, and used to do things like play the strings inside the piano to get a different tone:\n\n[Excerpt: Henry Cowell, \"Aeolian Harp and Sinister Resonance\"]\n\nCowell was part of a circle of composers and musicologists that included Edgard Varese, Charles Ives, and Charles Seeger and Ruth Crawford, who Cowell would introduce to each other. Crawford would later marry Seeger, and they would have several children together, including the folk singer Peggy Seeger, and Crawford would also adopt Seeger's son Pete.\n\nCowell and Termen would together invent the rhythmicon, the first ever drum machine, though the rhythmicon could play notes as well as rhythms. Only two rhythmicons were made while Termen was in the US. The first was owned by Cowell. The second, improved, model was bought by Charles Ives, but bought as a gift for Cowell and Slonimsky to use in their compositions. Sadly, both rhythmicons eventually broke down, and no recording of either is known to exist.\n\nTermen started to get further and further into debt, especially as the Great Depression started to hit, and he also had a personal loss -- he'd been training a student and had fallen in love with her, although he was married. But when she married herself, he cut off all ties with her, though Clara Rockmore would become one of the few people to use the instrument seriously and become a real virtuoso on it.\n\nHe moved into other fields, all loosely based around the same basic ideas of detecting someone's distance from an object. He built electronic gun detectors for Alcatraz and Sing-Sing prisons, and he came up with an altimeter for aeroplanes. There was also a \"magic mirror\" -- glass that appeared like a mirror until it was backlit, at which point it became transparent. This was put into shop windows along with a proximity detector -- every time someone stepped close to look at their reflection, the reflection would disappear and be replaced with the objects behind the mirror.\n\nHe was also by this point having to spy for the USSR on a more regular basis. Every week he would meet up in a cafe with two diplomats from the Russian embassy, who would order him to drink several shots of vodka -- the idea was that they would loosen his inhibitions enough that he would not be able to hide things from them -- before he related various bits of industrial espionage he'd done for them. Having inventions of his own meant he was able to talk with engineers in the aerospace industry and get all sorts of bits of information that would otherwise not have been available, and he fed this back to Moscow.\n\nHe eventually divorced his first wife, and remarried -- a Black American dancer many years his junior named Lavinia Williams, who would be the great love of his life. This caused some scandal in his social circle, more because of her race than the age gap.\n\nBut by 1938 he had to leave the US. He'd been there on a six-month visa, which had been renewed every six months for more than a decade, and he'd also not been paying income tax and was massively in debt. He smuggled himself back to the USSR, but his wife was, at the last minute, not allowed on to the ship with him. He'd had to make the arrangements in secret, and hadn't even told her of the plans, so the first she knew was when he disappeared.\n\nHe would later claim that the Soviets had told him she would be sent for two weeks later, but she had no knowledge of any of this. For decades, Lavinia would not even know if her husband was dead or alive.\n\n[Excerpt: Blake Jones and the Trike Shop, \"Astronauts in Trouble\"]\n\nWhen Termen got back to the USSR, he found it had changed beyond recognition. Stalin's reign of terror was now well underway, and not only could he not find a job, most of the people who he'd been in contact with at the top of the Kremlin had been purged.\n\nTermen was himself arrested and tortured into signing a false confession to counter-revolutionary activities and membership of fascist organisations. He was sentenced to eight years in a forced labour camp, which in reality was a death sentence -- it was expected that workers there would work themselves to death on starvation rations long before their sentences were up -- but relatively quickly he was transferred to a special prison where people with experience of aeronautical design were working.\n\nHe was still a prisoner, but in conditions not too far removed from normal civilian life, and allowed to do scientific and technical work with some of the greatest experts in the field -- almost all of whom had also been arrested in one purge or another.\n\nOne of the pieces of work Termen did was at the direct order of Laventy Beria, Stalin's right-hand man and the architect of most of the terrors of the Stalinist regime. In Spring 1945, while the USA and USSR were still supposed to be allies in World War II, Beria wanted to bug the residence of the US ambassador, and got Termen to design a bug that would get past all the normal screenings.\n\nThe bug that Termen designed was entirely passive and unpowered -- it did nothing unless a microwave beam of a precise frequency was beamed at it, and only then did it start transmitting. It was placed in a wooden replica of the Great Seal of the United States, presented to the ambassador by a troupe of scouts as a gesture of friendship between the two countries. The wood in the eagle's beak was thin enough to let the sound through. It remained there for seven years, through the tenures of four ambassadors, only being unmasked when a British radio operator accidentally tuned to the frequency it was transmitting on and was horrified to hear secret diplomatic conversations.\n\nUpon its discovery, the US couldn't figure out how it worked, and eventually shared the information with MI5, who took eighteen months to reverse-engineer Termen's bug and come up with their own, which remained the standard bug in use for about a decade. The CIA's own attempts to reverse-engineer it failed altogether.\n\nIt was also Termen who came up with that well-known bit of spycraft -- focussing an infra-red beam on a window pane, to use it to pick up the sound of conversations happening in the room behind it. Beria was so pleased with Termen's inventions that he got Termen to start bugging Stalin himself, so Beria would be able to keep track of Stalin's whims.\n\nTermen performed such great services for Beria that Beria actually allowed him to go free not long after his sentence was served. Not only that, but Beria nominated Termen for the Stalin Award, Class II, for his espionage work -- and Stalin, not realising that Termen had been bugging *him* as well as foreign powers, actually upgraded that to a Class I, the highest honour the Soviet state gave.\n\nWhile Termen was free, he found himself at a loose end, and ended up volunteering to work for the organisation he had been working for -- which went by many names but became known as the KGB from the 1950s onwards. He tried to persuade the government to let Lavinia, who he hadn't seen in eight years, come over and join him, but they wouldn't even allow him to contact her, and he eventually remarried.\n\nMeanwhile, after Stalin's death, Beria was arrested for his crimes, and charged under the same law that he had had Termen convicted under. Beria wasn't as lucky as Termen, though, and was executed. By 1964, Termen had had enough of the KGB, because they wanted him to investigate obvious pseudoscience -- they wanted him to look into aliens, UFOs, ESP... and telepathy.\n\n[Excerpt, The Beach Boys, \"Good Vibrations (early version)\" \"She's already working on my brain\"]\n\nHe quit and went back to civilian life.  He started working in the acoustics lab in Moscow Conservatory, although he had to start at the bottom because everything he'd been doing for more than a quarter of a century was classified. He also wrote a short book on electronic music. In the late sixties an article on him was published in the US -- the first sign any of his old friends had that he'd not  died nearly thirty years earlier. They started corresponding with him, and he became a minor celebrity again, but this was disapproved of by the Soviet government -- electronic music was still considered bourgeois decadence and not suitable for the Soviet Union, and all his instruments were smashed and he was sacked from the conservatory.\n\nHe continued working in various technical jobs until the 1980s, and still continued inventing refinements of the theremin, although he never had any official support for his work.\n\nIn the eighties, a writer tried to get him some sort of official recognition -- the Stalin Prize was secret -- and the university at which he was working sent a reply saying, in part, \"L.S. Termen took part in research conducted by the department as an ordinary worker and he did not show enough creative activity, nor does he have any achievements on the basis of which he could be recommended for a Government decoration.\"\n\nBy this time he was living in shared accommodation with a bunch of other people, one room to himself and using a shared bathroom, kitchen, and so on. After Glasnost he did some interviews and was asked about this, and said \"I never wanted to make demands and don't want to now. I phoned the housing department about three months ago and inquired about my turn to have a new flat. The woman told me that my turn would come in five or six years. Not a very reassuring answer if one is ninety-two years old.\"\n\nIn 1989 he was finally allowed out of the USSR again, for the first time in fifty-one years, to attend a UNESCO sponsored symposium on electronic music. Among other things, he was given, forty-eight years late, a letter that his old colleague Edgard Varese had sent about his composition Ecuatorial, which had originally been written for theremin. Varese had wanted to revise the work, and had wanted to get modified theremins that could do what he wanted, and had asked the inventor for help, but the letter had been suppressed by the Soviet government. When he got no reply, Varese had switched to using ondes martenot instead.\n\n[Excerpt: Edgard Varese, \"Ecuatorial\"]\n\nIn the 1970s, after the death of his third wife, Termen had started an occasional correspondence with his second wife, Lavinia, the one who had not been able to come with him to the USSR and hadn't known if he was alive for so many decades.\n\nShe was now a prominent activist in Haiti, having established dance schools in many Caribbean countries, and Termen still held out hope that they could be reunited, even writing her a letter in 1988 proposing remarriage. But sadly, less than a month after Termen's first trip outside the USSR, she died -- officially of a heart attack or food poisoning, but there's a strong suspicion that she was murdered by the military dictatorship for her closeness to Jean-Bertrand Aristide, the pro-democracy activist who later became President of Haiti.\n\nTermen was finally allowed to join the Communist Party in the spring of 1991, just before the USSR finally dissolved -- he'd been forbidden up to that point because of his conviction for counter-revolutionary crimes. He was asked by a Western friend why he'd done that when everyone else was trying to *leave* the Communist Party, and he explained that he'd made a promise to Lenin.\n\nIn his final years he was researching immortality, going back to the work he had done in his youth, working with biologists, trying to find a way to restore elderly bodies to youthful vigour. But sadly he died in 1993, aged ninety-seven, before he achieved his goal.\n\nOn one of his last trips outside the USSR, in 1991, he visited the US, and in California he finally got to hear the song that most people associate with his invention, even though it didn't actually feature a theremin:\n\n[Excerpt: The Beach Boys, \"Good Vibrations\"]\n\nBack in the 1930s, when he was working with Slonimsky and Varese and Ives and the rest, Termen had set up the Theremin Studio, a sort of experimental arts lab, and in 1931 he had invited the musicologist, composer, and theoretician Joseph Schillinger to become a lecturer there.\n\nSchillinger had been one of the first composers to be really interested in the theremin, and had composed a very early piece written specifically for the instrument, the First Airphonic Suite:\n\n[Excerpt: Joseph Schillinger, \"First Airphonic Suite\"]\n\nBut he was most influential as a theoretician. Schillinger believed that all of the arts were susceptible to rigorous mathematical analysis, and that you could use that analysis to generate new art according to mathematical principles, art that would be perfect.\n\nSchillinger planned to work with Termen to try to invent a machine that could compose, perform, and transmit music. The idea was that someone would be able to tune in a radio and listen to a piece of music in real time as it was being algorithmically composed and transmitted.\n\nThe two men never achieved this, but Schillinger became very, very, respected as someone with a rigorous theory of musical structure -- though reading his magnum opus, the Schillinger System of Musical Composition, is frankly like wading through treacle. I'll read a short excerpt just to give an idea of his thinking:\n\"On the receiving end, phasic stimuli produced by instruments encounter a metamorphic auditory integrator. This integrator represents the auditory apparatus as a whole and is a complex interdependent system. It consists of two receivers (ears), transmitters, auditory nerves, and a transformer, the auditory braincenter. \n\nThe response to a stimulus is integrated both quantitatively and selectively. The neuronic energy of response becomes the psychonic energy of auditory image. The response to stimuli and the process of integration are functional operations and, as such, can be described in mathematical terms , i.e., as  synchronization, addition, subtraction, multiplication, etc. But these integrative processes alone do not constitute the material of orchestration either. \n\nThe auditory image, whether resulting from phasic stimuli of an excitor or from selfstimulation of the auditory brain-center, can be described only in Psychological terms, of loudness, pitch, quality, etc. This leads us to the conclusion that the material of orchestration can be defined only as a group of conditions under which an integrated image results from a sonic stimulus subjected to an auditory response. \n\nThis constitutes an interdependent tripartite system, in which the existence of one component necessitates the existence of two others. The composer can imagine an integrated sonic form, yet he cannot transmit it to the auditor (unless telepathicaliy) without sonic stimulus and hearing apparatus.\"\nThat's Schillinger's way of saying that if a composer wants someone to hear the music they've written, the composer needs a musical instrument and the listener needs ears and a brain.\n\nThis kind of revolutionary insight made Schillinger immensely sought after in the early 1930s, and among his pupils were the swing bandleaders Benny Goodman and Tommy Dorsey, and the songwriter George Gershwin, who turned to Schillinger for advice when he was writing his opera Porgy and Bess:\n\n[Excerpt: Ella Fitzgerald and Louis Armstrong, \"Here Come De Honey Man\"]\n\nAnother of his pupils was the trombonist and arranger Glenn Miller, who at that time was a session player working in pickup studio bands for people like Red Nichols. Miller spent some time studying with him in the early thirties, and applied those lessons when given the job of putting together arrangements for Ray Noble, his first prominent job.\n\nIn 1938 Glenn Miller walked into a strip joint to see a nineteen-year-old he'd been told to take a look at. This was another trombonist, Paul Tanner, who was at the time working as a backing musician for the strippers. Miller had recently broken up his first big band, after a complete lack of success, and was looking to put together a new big band, to play arrangements in the style he had worked out while working for Noble.\n\nAs Tanner later put it \"he said, `Well, how soon can you come with me?' I said, `I can come right now.' I told him I was all packed, I had my toothbrush in my pocket and everything. And so I went with him that night, and I stayed with him until he broke the band up in September 1942.\"\n\nThe new band spent a few months playing the kind of gigs that an unknown band can get, but they soon had a massive success with a song Miller had originally written as an arranging exercise set for him by Schillinger, a song that started out under the title \"Miller's Tune\", but soon became known worldwide as \"Moonlight Serenade\":\n\n[Excerpt: Glenn Miller, \"Moonlight Serenade\"]\n\nThe Miller band had a lot of lineup changes in the four and a bit years it was together, but other than Miller himself there were only four members who were with that group throughout its career, from the early dates opening for  Freddie Fisher and His Schnickelfritzers right through to its end as the most popular band in America. They were piano player Chummy MacGregor, clarinet player Wilbur Schwartz, tenor sax player Tex Beneke, and Tanner.\n\nThey played on all of Miller's big hits, like \"In the Mood\" and \"Chattanooga Choo-Choo\":\n\n[Excerpt: Glenn Miller, \"Chattanooga Choo-Choo\"]\n\nBut in September 1942, the band broke up as the members entered the armed forces, and Tanner found himself in the Army while Miller was in the Air Force, so while both played in military bands, they weren't playing together, and Miller disappeared over the Channel, presumed dead, in 1944.\n\nTanner became a session trombonist, based in LA, and in 1958 he found himself on a session for a film soundtrack with Dr. Samuel Hoffman. I haven't been able to discover for sure which film this was for, but the only film on which Hoffman has an IMDB credit for that year is that American International Pictures classic, Earth Vs The Spider:\n\n[Excerpt: Earth Vs The Spider trailer]\n\nHoffman was a chiropodist, and that was how he made most of his living, but as a teenager in the 1930s he had been a professional violin player under the name Hal Hope. One of the bands he played in was led by a man named Jolly Coburn, who had seen Rudy Vallee's band with their theremin and decided to take it up himself.\n\nHoffman had then also got a theremin, and started his own all-electronic trio, with a Hammond organ player, and with a cello-style fingerboard theremin played by William Schuman, the future Pulitzer Prize winning composer.\n\nBy the 1940s, Hoffman was a full-time doctor, but he'd retained his Musicians' Union card just in case the odd gig came along, and then in 1945 he received a call from Miklos Rozsa, who was working on the soundtrack for Alfred Hitchcock's new film, Spellbound. Rozsa had tried to get Clara Rockmore, the one true virtuoso on the theremin playing at the time, to play on the soundtrack, but she'd refused -- she didn't do film soundtrack work, because in her experience they only wanted her to play on films about ghosts or aliens, and she thought it damaged the dignity of the instrument.\n\nRozsa turned to the American Federation of Musicians, who as it turned out had precisely one theremin player who could read music and wasn't called Clara Rockmore on their books. So Dr. Samuel Hoffman, chiropodist, suddenly found himself playing on one of the most highly regarded soundtracks of one of the most successful films of the forties:\n\n[Excerpt: Miklos Rozsa, \"Spellbound\"]\n\nRozsa soon asked Hoffman to play on another soundtrack, for the Billy Wilder film The Lost Weekend, another of the great classics of late forties cinema. Both films' soundtracks were nominated for the Oscar, and Spellbound's won, and Hoffman soon found himself in demand as a session player.\n\nHoffman didn't have any of Rockmore's qualms about playing on science fiction and horror films, and anyone with any love of the genre will have heard his playing on genre classics like The Five Thousand Fingers of Dr T, The Thing From Another World, It Came From Outer Space, and of course Bernard Hermann's score for The Day The Earth Stood Still:\n\n[Excerpt: The Day The Earth Stood Still score]\n\nAs well as on such less-than-classics as The Devil's Weed, Voodoo Island, The Mad Magician, and of course Billy The Kid Vs Dracula.\n\nHoffman became something of a celebrity, and also recorded several albums of lounge music with a band led by Les Baxter, like the massive hit Music Out Of The Moon, featuring tracks like “Lunar Rhapsody”:\n\n[Excerpt: Samuel Hoffman, \"Lunar Rhapsody”]\n\n[Excerpt: Neil Armstrong]\n\nThat voice you heard there was Neil Armstrong, on Apollo 11 on its way back from the moon. He took a tape of Hoffman's album with him.\n\nBut while Hoffman was something of a celebrity in the fifties, the work dried up almost overnight in 1958 when he worked at that session with Paul Tanner. The theremin is a very difficult instrument to play, and while Hoffman was a good player, he wasn't a great one -- he was getting the work because he was the best in a very small pool of players, not because he was objectively the best there could be.\n\nTanner noticed that Hoffman was having quite some difficulty getting the pitching right in the session, and realised that the theremin must be a very difficult instrument to play because it had no markings at all. So he decided to build an instrument that had the same sound, but that was more sensibly controlled than just waving your hands near it. He built his own invention, the electrotheremin, in less than a week, despite never before having had any experience in electrical engineering. He built it using an oscillator, a length of piano wire and a contact switch that could be slid up and down the wire, changing the pitch.\n\nTwo days after he finished building it, he was in the studio, cutting his own equivalent of Hoffman's forties albums, Music For Heavenly Bodies, including a new exotica version of \"Moonlight Serenade\", the song that Glenn Miller had written decades earlier as an exercise for Schillinger:\n\n[Excerpt: Paul Tanner, \"Moonlight Serenade\"]\n\nNot only could the electrotheremin let the player control the pitch more accurately, but it could also do staccato notes easily -- something that's almost impossible with an actual theremin. And, on top of that, Tanner was cheaper than Hoffman. An instrumentalist hired to play two instruments is paid extra, but not as much extra as paying for another musician to come to the session, and since Tanner was a first-call trombone player who was likely to be at the session *anyway*, you might as well hire him if you want a theremin sound, rather than paying for Hoffman.\n\nTanner was an excellent musician -- he was a professor of music at UCLA as well as being a session player, and he authored one of the standard textbooks on jazz -- and soon he had cornered the market, leaving Hoffman with only the occasional gig. We will actually be seeing Hoffman again, playing on a session for an artist we're going to look at in a couple of months, but in LA in the early sixties, if you wanted a theremin sound, you didn't hire a theremin player, you hired Paul Tanner to play his electrotheremin -- though the instrument was so obscure that many people didn't realise he wasn't actually playing a theremin. Certainly Brian Wilson seems to have thought he was when he hired him for \"I Just Wasn't Made For These Times\":\n\n[Excerpt: The Beach Boys, \"I Just Wasn't Made For These Times\"]\n\nWe talked briefly about that track back in the episode on \"God Only Knows\",   but three days after recording that, Tanner was called back into the studio for another session on which Brian Wilson wanted a theremin sound.\n\nThis was a song titled \"Good, Good, Good Vibrations\", and it was inspired by a conversation he'd had with his mother as a child. He'd asked her why dogs bark at some people and not at others, and she'd said that dogs could sense vibrations that people sent out, and some people had bad vibrations and some had good ones.\n\nIt's possible that this came back to mind as he was planning the Pet Sounds album, which of course ends with the sound of his own dogs barking. It's also possible that he was thinking more generally about ideas like telepathy -- he had been starting to experiment with acid by this point, and was hanging around with a crowd of people who were proto-hippies, and reading up on a lot of the mystical ideas that were shared by those people. As we saw in the last episode, there was a huge crossover between people who were being influenced by drugs, people who were interested in Eastern religion, and people who were interested in what we now might think of as pseudo-science but at the time seemed to have a reasonable amount of validity, things like telepathy and remote viewing.\n\nWilson had also had exposure from an early age to people claiming psychic powers. Jo Ann Marks, the Wilson family's neighbour and the mother of former Beach Boy David Marks, later had something of a minor career as a psychic to the stars (at least according to obituaries posted by her son) and she would often talk about being able to sense \"vibrations\".\n\nThe record Wilson started out making in February 1966 with the Wrecking Crew was intended as an R&B single, and was also intended to sound *strange*:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-02-18\"]\n\nAt this stage, the song he was working on was a very straightforward verse-chorus structure, and it was going to be an altogether conventional pop song. The verses -- which actually ended up used in the final single, are dominated by organ and Ray Pohlman's bass:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-02-18\"]\n\nThese bear a strong resemblance to the verses of \"Here Today\", on the Pet Sounds album which the Beach Boys were still in the middle of making:\n\n[Excerpt: The Beach Boys, \"Here Today (instrumental)\"]\n\nBut the chorus had far more of an R&B feel than anything the Beach Boys had done before:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-02-18\"]\n\nIt did, though, have precedent. The origins of the chorus feel come from \"Can I Get a Witness?\", a Holland-Dozier-Holland song that had been a hit for Marvin Gaye in 1963:\n\n[Excerpt: Marvin Gaye, \"Can I Get a Witness?\"]\n\nThe Beach Boys had picked up on that, and also on its similarity to the feel of Lonnie Mack's instrumental cover version of Chuck Berry's \"Memphis, Tennessee\", which, retitled \"Memphis\", had also been a hit in 1963, and in 1964 they recorded an instrumental which they called \"Memphis Beach\" while they were recording it but later retitled \"Carl's Big Chance\", which was credited to Brian and Carl Wilson, but was basically just playing the \"Can I Get a Witness\" riff over twelve-bar blues changes, with Carl doing some surf guitar over the top:\n\n[Excerpt: The Beach Boys, \"Carl's Big Chance\"]\n\nThe \"Can I Get a Witness\" feel had quickly become a standard piece of the musical toolkit – you might notice the resemblance between that riff and the “talking 'bout my generation” backing vocals on “My Generation” by the Who, for example. It was also used on \"The Boy From New York City\", a hit on Red Bird Records by the Ad-Libs:\n\n[Excerpt: The Ad-Libs, \"The Boy From New York City\"]\n\nThe Beach Boys had definitely been aware of that record -- on their 1965 album Summer Days... And Summer Nights! they recorded an answer song to it, \"The Girl From New York City\":\n\n[Excerpt: The Beach Boys, \"The Girl From New York City\"]\n\nAnd you can see how influenced Brian was by the Ad-Libs record by laying the early instrumental takes of the \"Good Vibrations\" chorus from this February session under the vocal intro of \"The Boy From New York City\". It's not a perfect match, but you can definitely hear that there's an influence there:\n\n[Excerpt: \"The Boy From New York City\"/\"Good Vibrations\"]\n\nA few days later, Brian had Carl Wilson overdub some extra bass, got a musician in to do a jaw harp overdub, and they also did a guide vocal, which I've sometimes seen credited to Brian and sometimes Carl, and can hear as both of them depending on what I'm listening for. This guide vocal used a set of placeholder lyrics written by Brian's collaborator Tony Asher, which weren't intended to be a final lyric:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (first version)\"]\n\nBrian then put the track away for a month, while he continued work on the Pet Sounds album. At this point, as best we can gather, he was thinking of it as something of a failed experiment. In the first of the two autobiographies credited to Brian (one whose authenticity is dubious, as it was largely put together by a ghostwriter and Brian later said he'd never even read it) he talks about how he was actually planning to give the song to Wilson Pickett rather than keep it for the Beach Boys, and one can definitely imagine a Wilson Pickett version of the song as it was at this point.\n\nBut Brian's friend Danny Hutton, at that time still a minor session singer who had not yet gone on to form the group that would become Three Dog Night, asked Brian if *he* could have the song if Brian wasn't going to use it. And this seems to have spurred Brian into rethinking the whole song. And in doing so he was inspired by his very first ever musical memory. Brian has talked a lot about how the first record he remembers hearing was when he was two years old, at his maternal grandmother's house, where he heard the Glenn Miller version of \"Rhapsody in Blue\", a three-minute cut-down version of Gershwin's masterpiece, on which Paul Tanner had of course coincidentally played:\n\n[Excerpt: The Glenn Miller Orchestra, \"Rhapsody in Blue\"]\n\nHearing that music, which Brian's mother also played for him a lot as a child, was one of the most profoundly moving experiences of Brian's young life, and \"Rhapsody in Blue\" has become one of those touchstone pieces that he returns to again and again. He has recorded studio versions of it twice, in the mid-nineties with Van Dyke Parks:\n\n[Excerpt: Brian Wilson and Van Dyke Parks, \"Rhapsody in Blue\"]\n\nand in 2010 with his solo band, as the intro and outro of an album of Gershwin covers:\n\n[Excerpt: Brian Wilson, \"Rhapsody in Blue\"]\n\nYou'll also often see clips of him playing \"Rhapsody in Blue\" when sat at the piano -- it's one of his go-to songs.\n\nSo he decided he was going to come up with a song that was structured like \"Rhapsody in Blue\" -- what publicist Derek Taylor would later describe as a \"pocket symphony\", but \"pocket rhapsody\" would possibly be a better term for it. It was going to be one continuous song, but in different sections that would have different instrumentation and different feelings to them -- he'd even record them in different studios to get different sounds for them, though he would still often have the musicians run through the whole song in each studio. He would mix and match the sections in the edit.\n\nHis second attempt to record the whole track, at the start of April, gave a sign of what he was attempting, though he would not end up using any of the material from this session:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-04-09\" around 02:34]\n\nNearly a month later, on the fourth of May, he was back in the studio -- this time in Western Studios rather than Gold Star where the previous sessions had been held, with yet another selection of musicians from the Wrecking Crew, plus Tanner, to record another version. This time, part of the session was used for the bridge for the eventual single:\n\n[Excerpt: The Beach Boys: \"Good Vibrations: Western 1966-05-04 Second Chorus and Fade\"]\n\nOn the twenty-fourth of May the Wrecking Crew, with Carl Wilson on Fender bass (while Lyle Ritz continued to play string bass, and Carol Kaye, who didn't end up on the finished record at all, but who was on many of the unused sessions, played Danelectro), had another attempt at the track, this time in Sunset Studios:\n\n[Excerpt: The Beach Boys: \"Good Vibrations: Sunset Sound 1966-05-24 (Parts 2&3)\"]\n\nThree days later, another group of musicians, with Carl now switched to rhythm guitar, were back in Western Studios recording this:\n\n[Excerpt: The Beach Boys: \"Good Vibrations: Western 1966-05-27 Part C\" from 2:52]\n\nThe fade from that session was used in the final track.\n\nA few days later they were in the studio again, a smaller group of people with Carl on guitar and Brian on piano, along with Don Randi on electric harpsichord, Bill Pitman on electric bass, Lyle Ritz on string bass and Hal Blaine on drums. This time there seems to have been another inspiration, though I've never heard it mentioned as an influence. In March, a band called The Association, who were friends with the Beach Boys, had released their single \"Along Comes Mary\", and by June it had become a big hit:\n\n[Excerpt: The Association, \"Along Comes Mary\"]\n\nNow the fuzz bass part they were using on the session on the second of June sounds to my ears very, very, like that intro:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (Inspiration) Western 1966-06-02\" from 01:47]\n\nThat session produced the basic track that was used for the choruses on the final single, onto which the electrotheremin was later overdubbed as Tanner wasn't at that session.\n\nSome time around this point, someone suggested to Brian that they should use a cello along with the electrotheremin in the choruses, playing triplets on the low notes. Brian has usually said that this was Carl's idea, while Brian's friend Van Dyke Parks has always said that he gave Brian the idea. Both seem quite certain of this, and neither has any reason to lie, so I suspect what might have happened is that Parks gave Brian the initial idea to have a cello on the track, while Carl in the studio suggested having it specifically play triplets. Either way, a cello part by Jesse Erlich was added to those choruses.\n\nThere were more sessions in June, but everything from those sessions was scrapped. At some point around this time, Mike Love came up with a bass vocal lyric, which he sang along with the bass in the choruses in a group vocal session. On August the twenty-fourth, two months after what one would think at this point was the final instrumental session, a rough edit of the track was pulled together.\n\nBy this point the chorus had altered quite a bit. It had originally just been eight bars of G-flat, four bars of B-flat, then four more bars of G-flat. But now Brian had decided to rework an idea he had used in \"California Girls\". In that song, each repetition of the line \"I wish they all could be California\" starts a tone lower than the one before. Here, after the bass hook line is repeated, everything moves up a step, repeats the line, and then moves up another step:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: [Alternate Edit] 1966-08-24\"]\n\nBut Brian was dissatisfied with this version of the track. The lyrics obviously still needed rewriting, but more than that, there was a section he thought needed totally rerecording -- this bit:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: [Alternate Edit] 1966-08-24\"]\n\nSo on the first of September, six and a half months after the first instrumental session for the song, the final one took place. This had Dennis Wilson on organ, Tommy Morgan on harmonicas, Lyle Ritz on string bass, and Hal Blaine and Carl Wilson on percussion, and replaced that with a new, gentler, version:\n\n[Excerpt: The Beach Boys: \"Good Vibrations (Western 1966-09-01) [New Bridge]\"]\n\nWell, that was almost the final instrumental session -- they called Paul Tanner in to a vocal overdub session to redo some of the electrotheremin parts, but that was basically it.\n\nNow all they had to do was do the final vocals. Oh, and they needed some proper lyrics. By this point Brian was no longer working with Tony Asher. He'd started working with Van Dyke Parks on some songs, but Parks wasn't interested in stepping into a track that had already been worked on so long, so Brian eventually turned to Mike Love, who'd already come up with the bass vocal hook, to write the lyrics.\n\nLove wrote them in the car, on the way to the studio, dictating them to his wife as he drove, and they're actually some of his best work. The first verse grounds everything in the sensory, in the earthy. He makes a song originally about *extra* -sensory perception into one about sensory perception -- the first verse covers sight, sound, and smell:\n\n[Excerpt: The Beach Boys, \"Good Vibrations\"]\n\nCarl Wilson was chosen to sing the lead vocal, but you'll notice a slight change in timbre on the line \"I hear the sound of a\" -- that's Brian stepping into double him on the high notes. Listen again:\n\n[Excerpt: The Beach Boys, \"Good Vibrations\"]\n\nFor the second verse, Love's lyric moves from the sensory grounding of the first verse to the extrasensory perception that the song has always been about, with the protagonist knowing things about the woman who's the object of the song without directly perceiving them.\n\nThe record is one of those where I wish I was able to play the whole thing for you, because it's a masterpiece of structure, and of editing, and of dynamics. It's also a record that even now is impossible to replicate properly on stage, though both its writers in their live performances come very close. But while someone in the audience for either the current touring Beach Boys led by Mike Love or for Brian Wilson's solo shows might come away thinking \"that sounded just like the record\", both have radically different interpretations of it even while sticking close to the original arrangement. The touring Beach Boys' version is all throbbing strangeness, almost garage-rock, emphasising the psychedelia of the track:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (live 2014)\"]\n\nWhile Brian Wilson's live version is more meditative, emphasising the gentle aspects:\n\n[Excerpt Brian Wilson, \"Good Vibrations (live at the Roxy)\"]\n\nBut back in 1966, there was definitely no way to reproduce it live with a five-person band. According to Tanner, they actually asked him if he would tour with them, but he refused -- his touring days were over, and also he felt he would look ridiculous, a middle-aged man on stage with a bunch of young rock and roll stars, though apparently they offered to buy him a wig so he wouldn't look so out of place. When he wouldn't tour with them, they asked him where they could get a theremin, and he pointed them in the direction of Robert Moog.\n\nMoog -- whose name is spelled M-o-o-g and often mispronounced \"moog\", had been a teenager in 1949, when he'd seen a schematic for a theremin in an electronic hobbyist magazine, after Samuel Hoffman had brought the instrument back into the limelight. He'd built his own, and started building others to sell to other hobbyists, and had also started branching out into other electronic instruments by the mid-sixties.\n\nHis small company was the only one still manufacturing actual theremins, but when the Beach Boys came to him and asked him for one, they found it very difficult to control, and asked him if he could do anything simpler. He came up with a ribbon-controlled oscillator, on the same principle as Tanner's electro-theremin, but even simpler to operate, and the Beach Boys bought it and gave it to Mike Love to play on stage. All he had to do was run his finger up and down a metallic ribbon, with the positions of the notes marked on it, and it would come up with a good approximation of the electro-theremin sound. Love played this \"woo-woo machine\" as he referred to it, on stage for several years:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (live in Hawaii 8/26/67)\"]\n\nMoog was at the time starting to build his first synthesisers, and having developed that ribbon-control mechanism he decided to include it in the early models as one of several different methods of controlling the Moog synthesiser, the instrument that became synonymous with the synthesiser in the late sixties and early seventies:\n\n[Excerpt: Gershon Kingsley and Leonid Hambro, \"Rhapsody in Blue\" from Switched-On Gershwin]\n\n\"Good Vibrations\" became the Beach Boys' biggest ever hit -- their third US number one, and their first to make number one in the UK. Brian Wilson had managed, with the help of his collaborators, to make something that combined avant-garde psychedelic music and catchy pop hooks, a truly experimental record that was also a genuine pop classic. To this day, it's often cited as the greatest single of all time.\n\nBut Brian knew he could do better. He could be even more progressive. He could make an entire album using the same techniques as \"Good Vibrations\", one where themes could recur, where sections could be edited together and songs could be constructed in the edit. Instead of a pocket symphony, he could make a full-blown teenage symphony to God. All he had to do was to keep looking forward, believe he could achieve his goal, and whatever happened, not lose his nerve and turn back.\n\n[Excerpt: The Beach Boys, \"Smile Promo\" ]",
  "itunes:subtitle": "Episode one hundred and forty-six of A History of Rock Music in Five Hundred Songs looks at “Good Vibrations” by the Beach Boys, and the history of the theremin. Click the full post to read liner notes, links to more information, and a transcript of the ",
  "itunes:keywords": "Brian Wilson,Carl Wilson,Danny Hutton,Dennis Wilson,Edgard Varese,George Gershwin,Glenn Miller,Henry Cowell,Leon Theremin,Lev Termen,Mike Love,Nicolas Slonimsky,Paul Tanner,Robert Moog,Samuel Hoffman,The Beach Boys,theremin",
  "itunes:episodeType": "full",
  "itunes:episode": 146,
  "content:encoded": "Episode one hundred and forty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Good Vibrations” by the Beach Boys, and the history of the theremin. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/64241985\">\"You're Gonna Miss Me\" by the Thirteenth Floor Elevators</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I’ve checked for specific things.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe’s <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins’ <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert’s <em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nI have also referred to Brian Wilson’s autobiography, <em><a href=\"https://amzn.to/3AMbmys\">I Am Brian Wilson</a></em>, and to Mike Love’s, <em><a href=\"https://amzn.to/3AMbmys\">Good Vibrations: My Life as a Beach Boy</a>.</em>\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it, including the single version of \"Good Vibrations\".\n\nOddly, the single version of \"Good Vibrations\" is <em>not</em> on the <a href=\"https://amzn.to/3wC2Ylh\"><em>The Smile Sessions </em></a>box set. But an entire CD of outtakes of the track is, and that was the source for the session excerpts here.\n\nInformation on Lev Termen comes from <a href=\"https://amzn.to/36MSXGT\"><em>Theremin: Ether Music and Espionage</em> </a>by Albert Glinsky\n\n<strong>Transcript</strong>\n\nIn ancient Greece, the god Hermes was a god of many things, as all the Greek gods were. Among those things, he was the god of diplomacy, he was a trickster god, a god of thieves, and he was a messenger god, who conveyed messages between realms. He was also a god of secret knowledge. In short, he was the kind of god who would have made a perfect spy.\n\nBut he was also an inventor. In particular he was credited in Greek myth as having invented the lyre, an instrument somewhat similar to a guitar, harp, or zither, and as having used it to create beautiful sounds. But while Hermes the trickster god invented the lyre, in Greek myth it was a mortal man, Orpheus, who raised the instrument to perfection. Orpheus was a legendary figure, the greatest poet and musician of pre-Homeric Greece, and all sorts of things were attributed to him, some of which might even have been things that a real man of that name once did. He is credited with the \"Orphic tripod\" -- the classification of the elements into earth, water, and fire -- and with a collection of poems called the Rhapsodiae.\n\nThe word Rhapsodiae comes from the Greek words rhaptein, meaning to stitch or sew, and ōidē, meaning song -- the word from which we get our word \"ode\", and  originally a rhapsōdos was someone who \"stitched songs together\" -- a reciter of long epic poems composed of several shorter pieces that the rhapsōdos would weave into one continuous piece. It's from that that we get the English word \"rhapsody\", which in the sixteenth century, when it was introduced into the language, meant a literary work that was a disjointed collection of patchwork bits, stitched together without much thought as to structure, but which now means a piece of music in one movement, but which has several distinct sections. Those sections may seem unrelated, and the piece may have an improvisatory feel, but a closer look will usually reveal relationships between the sections, and the piece as a whole will have a sense of unity.\n\nWhen Orpheus' love, Eurydice, died, he went down into Hades, the underworld where the souls of the dead lived, and played music so beautiful, so profound and moving, that the gods agreed that Orpheus could bring the soul of his love back to the land of the living. But there was one condition -- all he had to do was keep looking forward until they were both back on Earth. If he turned around before both of them were back in the mortal realm, she would disappear forever, never to be recovered.\n\nBut of course, as you all surely know, and would almost certainly have guessed even if you didn't know because you know how stories work, once Orpheus made it back to our world he turned around and looked, because he lost his nerve and didn't believe he had really achieved his goal. And Eurydice, just a few steps away from her freedom, vanished back into the underworld, this time forever.\n\n[Excerpt: Blake Jones and the Trike Shop: \"Mr. Theremin's Miserlou\"]\n\nLev Sergeyevich Termen was born in St. Petersburg, in what was then the Russian Empire, on the fifteenth of August 1896, by the calendar in use in Russia at that time -- the Russian Empire was still using the Julian calendar, rather than the Gregorian calendar used in most of the rest of the world, and in the Western world the same day was the twenty-seventh of August.\n\nYoung Lev was fascinated both by science and the arts. He was trained as a cellist from an early age, but while he loved music, he found the process of playing the music cumbersome -- or so he would say later. He was always irritated by the fact that the instrument is a barrier between the idea in the musician's head and the sound -- that it requires training to play. As he would say later \"I realised there was a gap between music itself and its mechanical production, and I wanted to unite both of them.\"\n\nMusic was one of his big loves, but he was also very interested in physics, and was inspired by a lecture he saw from the physicist Abram Ioffe, who for the first time showed him that physics was about real, practical, things, about the movements of atoms and fields that really existed, not just about abstractions and ideals. When Termen went to university, he studied physics -- but he specifically wanted to be an experimental physicist, not a theoretician. He wanted to do stuff involving the real world.\n\nOf course, as someone who had the misfortune to be born in the late 1890s, Termen was the right age to be drafted when World War I started, but luckily for him the Russian Army desperately needed people with experience in the new invention that was radio, which was vital for wartime communications, and he spent the war in the Army radio engineering department, erecting radio transmitters and teaching other people how to erect them, rather than on the front lines, and he managed not only to get his degree in physics but also a diploma in music.\n\nBut he was also becoming more and more of a Marxist sympathiser, even though he came from a relatively affluent background, and after the Russian Revolution he stayed in what was now the Red Army, at least for a time.\n\nOnce Termen's Army service was over, he started working under Ioffe, working with him on practical applications of the audion, the first amplifying vacuum tube. The first one he found was that the natural capacitance of a human body when standing near a circuit can change the capacity of the circuit. He used that to create an invisible burglar alarm -- there was an antenna sending out radio waves, and if someone came within the transmitting field of the antenna, that would cause a switch to flip and a noise to be sounded.\n\nHe was then asked to create a device for measuring the density of gases, outputting a different frequency for different densities. Because gas density can have lots of minor fluctuations because of air currents and so forth, he built a circuit that would cut out all the many harmonics from the audions he was using and give just the main frequency as a single pure tone, which he could listen to with headphones. That way,  slight changes in density would show up as a slight change in the tone he heard. But he noticed that again when he moved near the circuit, that changed the capacitance of the circuit and changed the tone he was hearing.\n\nHe started moving his hand around near the circuit and getting different tones. The closer his hand got to the capacitor, the higher the note sounded. And if he shook his hand a little, he could get a vibrato, just like when he shook his hand while playing the cello.\n\nHe got Ioffe to come and listen to him, and Ioffe said \"That's an electronic Orpheus' lament!\"\n\n[Excerpt: Blake Jones and the Trike Shop, \"Mr. Theremin's Miserlou\"]\n\nTermen figured out how to play Massenet's \"Elegy\" and Saint-Saens' \"The Swan\" using this system. Soon the students were all fascinated, telling each other \"Termen plays Gluck on a voltmeter!\"\n\nHe soon figured out various refinements -- by combining two circuits, using the heterodyne principle, he could allow for far finer control. He added a second antenna, for volume control, to be used by the left hand -- the right hand would choose the notes, while the left hand would change the volume, meaning the instrument could be played without touching it at all.\n\nHe called the instrument the \"etherphone\",  but other people started calling it the termenvox -- \"Termen's voice\".\n\nTermen's instrument was an immediate sensation, as was his automatic burglar alarm, and he was invited to demonstrate both of them to Lenin. Lenin was very impressed by Termen -- he wrote to Trotsky later talking about Termen's inventions, and how the automatic burglar alarm might reduce the number of guards needed to guard a perimeter. But he was also impressed by Termen's musical invention. Termen held his hands to play through the first half of a melody, before leaving the Russian leader to play the second half by himself -- apparently he made quite a good job of it.\n\nBecause of Lenin's advocacy for his work, Termen was sent around the Soviet Union on a propaganda tour -- what was known as an \"agitprop tour\", in the familiar Soviet way of creating portmanteau words.\n\nIn 1923 the first piece of music written specially for the instrument was performed by Termen himself with the Leningrad Philharmonic, Andrey Paschenko's Symphonic Mystery for Termenvox and Orchestra. The score for that was later lost, but has been reconstructed, and the piece was given a \"second premiere\" in 2020\n\n[Excerpt: Andrey Paschenko, \"Symphonic Mystery for Termenvox and Orchestra\" ]\n\nBut the musical instrument wasn't the only scientific innovation that Termen was working on. He thought he could reverse death itself, and bring the dead back to life.  He was inspired in this by the way that dead organisms could be perfectly preserved in the Siberian permafrost. He thought that if he could only freeze a dead person in the permafrost, he could then revive them later -- basically the same idea as the later idea of cryogenics, although Termen seems to have thought from the accounts I've read that all it would take would be to freeze and then thaw them, and not to have considered the other things that would be necessary to bring them back to life.\n\nTermen made two attempts to actually do this, or at least made preliminary moves in that direction. The first came when his assistant, a twenty-year-old woman, died of pneumonia. Termen was heartbroken at the death of someone so young, who he'd liked a great deal, and was convinced that if he could just freeze her body for a while he could soon revive her. He talked with Ioffe about this -- Ioffe was friends with the girl's family -- and Ioffe told him that he thought that he was probably right and probably could revive her. But he also thought that it would be cruel to distress the girl's parents further by discussing it with them, and so Termen didn't get his chance to experiment.\n\nHe was even keener on trying his technique shortly afterwards, when Lenin died. Termen was a fervent supporter of the Revolution, and thought Lenin was a great man whose leadership was still needed -- and he had contacts within the top echelons of the Kremlin. He got in touch with them as soon as he heard of Lenin's death, in an attempt to get the opportunity to cryopreserve his corpse and revive him. Sadly, by this time it was too late. Lenin's brain had been pickled, and so the opportunity to resurrect him as a zombie Lenin was denied forever.\n\nTermen was desperately interested in the idea of bringing people back from the dead, and he wanted to pursue it further with his lab, but he was also being pushed to give demonstrations of his music, as well as doing security work -- Ioffe, it turned out, was also working as a secret agent, making various research trips to Germany that were also intended to foment Communist revolution.\n\nFor now, Termen was doing more normal security work -- his burglar alarms were being used to guard bank vaults and the like, but this was at the order of the security state.\n\nBut while Termen was working on his burglar alarms and musical instruments and attempts to revive dead dictators, his main project was his doctoral work, which was on the TV. We've said before in this podcast that there's no first anything, and that goes just as much for inventions as it does for music. Most inventions build on work done by others, which builds on work done by others, and so there were a lot of people building prototype TVs at this point. In Britain we tend to say \"the inventor of the TV\" was John Logie Baird, but Baird was working at the same time as people like the American Charles Francis Jenkins and the Japanese inventor Kenjiro Takayanagi, all of them building on earlier work by people like Archibald Low.\n\nTermen's prototype TV, the first one in Russia, came slightly later than any of those people, but was created more or less independently, and was more advanced in several ways, with a bigger screen and better resolution. Shortly after Lenin's death, Termen was invited to demonstrate his invention to Stalin, who professed himself amazed at the \"magic mirror\".\n\n[Excerpt: Blake Jones and the Trike Shop, \"Astronauts in Trouble\"]\n\nTermen was sent off to tour Europe giving demonstrations of his inventions, particularly his musical instrument. It was on this trip that he started using the Romanisation \"Leon Theremin\", and this is how Western media invariably referred to him. Rather than transliterate the Cyrillic spelling of his birth name, he used the French spelling his Huguenot ancestors had used before they emigrated to Russia, and called himself Leo or Leon rather than Lev. He was known throughout his life by both names, but said to a journalist in 1928 \"First of all, I am not Tair-uh-MEEN. I wrote my name with French letters for French pronunciation. I am Lev Sergeyevich Tair-MEN.\".\n\nWe will continue to call him Termen, partly because he expressed that mild preference (though again, he definitely went by both names through choice) but also to distinguish him from the instrument, because while his invention remained known in Russia as the termenvox, in the rest of the world it became known as the theremin.\n\nHe performed at the Paris Opera, and the New York Times printed a review saying \"Some musicians were extremely pessimistic about the possibilities of the device, because at times M. Theremin played lamentably out of tune. But the finest Stradivarius, in the hands of a tyro, can give forth frightful sounds. The fact that the inventor was able to perform certain pieces with absolute precision proves that there remains to be solved only questions of practice and technique.\"\n\nTermen also came to the UK, where he performed in front of an audience including George Bernard Shaw, Arnold Bennett, Henry Wood and others. Arnold Bennett was astonished, but Bernard Shaw, who had very strong opinions about music, as anyone who has read his criticism will be aware, compared the sound unfavourably to that of a comb and paper.\n\nAfter performing in Europe, Termen made his way to the US, to continue his work of performance, propagandising for the Soviet Revolution, and trying to license the patents for his inventions, to bring money both to him and to the Soviet state. He entered the US on a six-month visitor's visa, but stayed there for eleven years, renewing the visa every six months.\n\nHis initial tour was a success, though at least one open-air concert had to be cancelled because, as the Communist newspaper the Daily Worker put it, \"the weather on Saturday took such a counter-revolutionary turn\".\n\nNicolas Slonimsky, the musicologist we've encountered several times before, and who would become part of Termen's circle in the US, reviewed one of the performances, and described the peculiar audiences that Termen was getting -- \"a considerable crop of ladies and gentlemen engaged in earnest exploration of the Great Beyond...the mental processes peculiar to believers in cosmic vibrations imparted a beatific look to some of the listeners. Boston is a seat of scientific religion; before he knows it Professor Theremin may be proclaimed Krishnamurti and sanctified as a new deity\".\n\nTermen licensed his patents on the invention to RCA, who in 1929 started mass-producing the first ever theremins for general use. Termen also started working with the conductor Leopold Stokowski, including developing a new kind of theremin for Stokowski's orchestra to use, one with a fingerboard played like a cello. Stokowski said \"I believe we shall have orchestras of these electric instruments. Thus will begin a new era in music history, just as modern materials and methods of construction have produced a new era of architecture.\"\n\nPossibly of more interest to the wider public, Lennington Sherwell, the son of an RCA salesman, took up the theremin professionally, and joined the band of Rudy Vallee, one of the most popular singers of the period. Vallee was someone who constantly experimented with new sounds, and has for example been named as the first band leader to use an electric banjo, and Vallee liked the sound of the theremin so much he ordered a custom-built left-handed one for himself.\n\nSherwell stayed in Vallee's band for quite a while, and performed with him on the radio and in recording sessions, but it's very difficult to hear him in any of the recordings -- the recording equipment in use in 1930 was very primitive, and Vallee had a very big band with a lot of string and horn players, and his arrangements tended to have lots of instruments playing in unison rather than playing individual lines that are easy to differentiate. On top of that, the fashion at the time when playing the instrument was to try and have it sound as much like other instruments as possible -- to duplicate the sound of a cello or violin or clarinet, rather than to lean in to the instrument's own idiosyncracies.\n\nI *think* though that I can hear Sherwell's playing in the instrumental break of Vallee's big hit \"You're Driving Me Crazy\" -- certainly it was recorded at the time that Sherwell was in the band, and there's an instrument in there with a very pure tone, but quite a lot of vibrato, in the mid range, that seems only to be playing in the break and not the rest of the song. I'm not saying this is *definitely* a theremin solo on one of the biggest hits of 1930, but I'm not saying it's not, either:\n\n[Excerpt: Rudy Vallee, \"You're Driving Me Crazy\" ]\n\nTermen also invented a light show to go along with his instrument -- the illumovox, which had a light shining through a strip of gelatin of different colours, which would be rotated depending on the pitch of the theremin, so that lower notes would cause the light to shine a deep red, while the highest notes would make it shine a light blue, with different shades in between.\n\nBy 1930, though, Termen's fortunes had started to turn slightly. Stokowski kept using theremins in the orchestra for a while, especially the fingerboard models to reinforce the bass, but they caused problems. As Slonimsky said \"The infrasonic vibrations were so powerful...that they hit the stomach physically, causing near-nausea in the double-bass section of the orchestra\".\n\nFairly soon, the Theremin was overtaken by other instruments, like the ondes martenot, an instrument very similar to the theremin but with more precise control, and with a wider range of available timbres.\n\nAnd in 1931, RCA was sued by another company for patent infringement with regard to the Theremin -- the De Forest Radio Company had patents around the use of vacuum tubes in music, and they claimed damages of six thousand dollars, plus RCA had to stop making theremins. Since at the time, RCA had only made an initial batch of five hundred instruments total, and had sold 485 of them, many of them as promotional loss-leaders for future batches, they had actually made a loss of three hundred dollars even before the six thousand dollar damages, and decided not to renew their option on Termen's patents.\n\nBut Termen was still working on his musical ideas. Slonimsky also introduced Termen to the avant-garde composer and theosophist Henry Cowell, who was interested in experimental sounds, and used to do things like play the strings inside the piano to get a different tone:\n\n[Excerpt: Henry Cowell, \"Aeolian Harp and Sinister Resonance\"]\n\nCowell was part of a circle of composers and musicologists that included Edgard Varese, Charles Ives, and Charles Seeger and Ruth Crawford, who Cowell would introduce to each other. Crawford would later marry Seeger, and they would have several children together, including the folk singer Peggy Seeger, and Crawford would also adopt Seeger's son Pete.\n\nCowell and Termen would together invent the rhythmicon, the first ever drum machine, though the rhythmicon could play notes as well as rhythms. Only two rhythmicons were made while Termen was in the US. The first was owned by Cowell. The second, improved, model was bought by Charles Ives, but bought as a gift for Cowell and Slonimsky to use in their compositions. Sadly, both rhythmicons eventually broke down, and no recording of either is known to exist.\n\nTermen started to get further and further into debt, especially as the Great Depression started to hit, and he also had a personal loss -- he'd been training a student and had fallen in love with her, although he was married. But when she married herself, he cut off all ties with her, though Clara Rockmore would become one of the few people to use the instrument seriously and become a real virtuoso on it.\n\nHe moved into other fields, all loosely based around the same basic ideas of detecting someone's distance from an object. He built electronic gun detectors for Alcatraz and Sing-Sing prisons, and he came up with an altimeter for aeroplanes. There was also a \"magic mirror\" -- glass that appeared like a mirror until it was backlit, at which point it became transparent. This was put into shop windows along with a proximity detector -- every time someone stepped close to look at their reflection, the reflection would disappear and be replaced with the objects behind the mirror.\n\nHe was also by this point having to spy for the USSR on a more regular basis. Every week he would meet up in a cafe with two diplomats from the Russian embassy, who would order him to drink several shots of vodka -- the idea was that they would loosen his inhibitions enough that he would not be able to hide things from them -- before he related various bits of industrial espionage he'd done for them. Having inventions of his own meant he was able to talk with engineers in the aerospace industry and get all sorts of bits of information that would otherwise not have been available, and he fed this back to Moscow.\n\nHe eventually divorced his first wife, and remarried -- a Black American dancer many years his junior named Lavinia Williams, who would be the great love of his life. This caused some scandal in his social circle, more because of her race than the age gap.\n\nBut by 1938 he had to leave the US. He'd been there on a six-month visa, which had been renewed every six months for more than a decade, and he'd also not been paying income tax and was massively in debt. He smuggled himself back to the USSR, but his wife was, at the last minute, not allowed on to the ship with him. He'd had to make the arrangements in secret, and hadn't even told her of the plans, so the first she knew was when he disappeared.\n\nHe would later claim that the Soviets had told him she would be sent for two weeks later, but she had no knowledge of any of this. For decades, Lavinia would not even know if her husband was dead or alive.\n\n[Excerpt: Blake Jones and the Trike Shop, \"Astronauts in Trouble\"]\n\nWhen Termen got back to the USSR, he found it had changed beyond recognition. Stalin's reign of terror was now well underway, and not only could he not find a job, most of the people who he'd been in contact with at the top of the Kremlin had been purged.\n\nTermen was himself arrested and tortured into signing a false confession to counter-revolutionary activities and membership of fascist organisations. He was sentenced to eight years in a forced labour camp, which in reality was a death sentence -- it was expected that workers there would work themselves to death on starvation rations long before their sentences were up -- but relatively quickly he was transferred to a special prison where people with experience of aeronautical design were working.\n\nHe was still a prisoner, but in conditions not too far removed from normal civilian life, and allowed to do scientific and technical work with some of the greatest experts in the field -- almost all of whom had also been arrested in one purge or another.\n\nOne of the pieces of work Termen did was at the direct order of Laventy Beria, Stalin's right-hand man and the architect of most of the terrors of the Stalinist regime. In Spring 1945, while the USA and USSR were still supposed to be allies in World War II, Beria wanted to bug the residence of the US ambassador, and got Termen to design a bug that would get past all the normal screenings.\n\nThe bug that Termen designed was entirely passive and unpowered -- it did nothing unless a microwave beam of a precise frequency was beamed at it, and only then did it start transmitting. It was placed in a wooden replica of the Great Seal of the United States, presented to the ambassador by a troupe of scouts as a gesture of friendship between the two countries. The wood in the eagle's beak was thin enough to let the sound through. It remained there for seven years, through the tenures of four ambassadors, only being unmasked when a British radio operator accidentally tuned to the frequency it was transmitting on and was horrified to hear secret diplomatic conversations.\n\nUpon its discovery, the US couldn't figure out how it worked, and eventually shared the information with MI5, who took eighteen months to reverse-engineer Termen's bug and come up with their own, which remained the standard bug in use for about a decade. The CIA's own attempts to reverse-engineer it failed altogether.\n\nIt was also Termen who came up with that well-known bit of spycraft -- focussing an infra-red beam on a window pane, to use it to pick up the sound of conversations happening in the room behind it. Beria was so pleased with Termen's inventions that he got Termen to start bugging Stalin himself, so Beria would be able to keep track of Stalin's whims.\n\nTermen performed such great services for Beria that Beria actually allowed him to go free not long after his sentence was served. Not only that, but Beria nominated Termen for the Stalin Award, Class II, for his espionage work -- and Stalin, not realising that Termen had been bugging *him* as well as foreign powers, actually upgraded that to a Class I, the highest honour the Soviet state gave.\n\nWhile Termen was free, he found himself at a loose end, and ended up volunteering to work for the organisation he had been working for -- which went by many names but became known as the KGB from the 1950s onwards. He tried to persuade the government to let Lavinia, who he hadn't seen in eight years, come over and join him, but they wouldn't even allow him to contact her, and he eventually remarried.\n\nMeanwhile, after Stalin's death, Beria was arrested for his crimes, and charged under the same law that he had had Termen convicted under. Beria wasn't as lucky as Termen, though, and was executed. By 1964, Termen had had enough of the KGB, because they wanted him to investigate obvious pseudoscience -- they wanted him to look into aliens, UFOs, ESP... and telepathy.\n\n[Excerpt, The Beach Boys, \"Good Vibrations (early version)\" \"She's already working on my brain\"]\n\nHe quit and went back to civilian life.  He started working in the acoustics lab in Moscow Conservatory, although he had to start at the bottom because everything he'd been doing for more than a quarter of a century was classified. He also wrote a short book on electronic music. In the late sixties an article on him was published in the US -- the first sign any of his old friends had that he'd not  died nearly thirty years earlier. They started corresponding with him, and he became a minor celebrity again, but this was disapproved of by the Soviet government -- electronic music was still considered bourgeois decadence and not suitable for the Soviet Union, and all his instruments were smashed and he was sacked from the conservatory.\n\nHe continued working in various technical jobs until the 1980s, and still continued inventing refinements of the theremin, although he never had any official support for his work.\n\nIn the eighties, a writer tried to get him some sort of official recognition -- the Stalin Prize was secret -- and the university at which he was working sent a reply saying, in part, \"L.S. Termen took part in research conducted by the department as an ordinary worker and he did not show enough creative activity, nor does he have any achievements on the basis of which he could be recommended for a Government decoration.\"\n\nBy this time he was living in shared accommodation with a bunch of other people, one room to himself and using a shared bathroom, kitchen, and so on. After Glasnost he did some interviews and was asked about this, and said \"I never wanted to make demands and don't want to now. I phoned the housing department about three months ago and inquired about my turn to have a new flat. The woman told me that my turn would come in five or six years. Not a very reassuring answer if one is ninety-two years old.\"\n\nIn 1989 he was finally allowed out of the USSR again, for the first time in fifty-one years, to attend a UNESCO sponsored symposium on electronic music. Among other things, he was given, forty-eight years late, a letter that his old colleague Edgard Varese had sent about his composition Ecuatorial, which had originally been written for theremin. Varese had wanted to revise the work, and had wanted to get modified theremins that could do what he wanted, and had asked the inventor for help, but the letter had been suppressed by the Soviet government. When he got no reply, Varese had switched to using ondes martenot instead.\n\n[Excerpt: Edgard Varese, \"Ecuatorial\"]\n\nIn the 1970s, after the death of his third wife, Termen had started an occasional correspondence with his second wife, Lavinia, the one who had not been able to come with him to the USSR and hadn't known if he was alive for so many decades.\n\nShe was now a prominent activist in Haiti, having established dance schools in many Caribbean countries, and Termen still held out hope that they could be reunited, even writing her a letter in 1988 proposing remarriage. But sadly, less than a month after Termen's first trip outside the USSR, she died -- officially of a heart attack or food poisoning, but there's a strong suspicion that she was murdered by the military dictatorship for her closeness to Jean-Bertrand Aristide, the pro-democracy activist who later became President of Haiti.\n\nTermen was finally allowed to join the Communist Party in the spring of 1991, just before the USSR finally dissolved -- he'd been forbidden up to that point because of his conviction for counter-revolutionary crimes. He was asked by a Western friend why he'd done that when everyone else was trying to *leave* the Communist Party, and he explained that he'd made a promise to Lenin.\n\nIn his final years he was researching immortality, going back to the work he had done in his youth, working with biologists, trying to find a way to restore elderly bodies to youthful vigour. But sadly he died in 1993, aged ninety-seven, before he achieved his goal.\n\nOn one of his last trips outside the USSR, in 1991, he visited the US, and in California he finally got to hear the song that most people associate with his invention, even though it didn't actually feature a theremin:\n\n[Excerpt: The Beach Boys, \"Good Vibrations\"]\n\nBack in the 1930s, when he was working with Slonimsky and Varese and Ives and the rest, Termen had set up the Theremin Studio, a sort of experimental arts lab, and in 1931 he had invited the musicologist, composer, and theoretician Joseph Schillinger to become a lecturer there.\n\nSchillinger had been one of the first composers to be really interested in the theremin, and had composed a very early piece written specifically for the instrument, the First Airphonic Suite:\n\n[Excerpt: Joseph Schillinger, \"First Airphonic Suite\"]\n\nBut he was most influential as a theoretician. Schillinger believed that all of the arts were susceptible to rigorous mathematical analysis, and that you could use that analysis to generate new art according to mathematical principles, art that would be perfect.\n\nSchillinger planned to work with Termen to try to invent a machine that could compose, perform, and transmit music. The idea was that someone would be able to tune in a radio and listen to a piece of music in real time as it was being algorithmically composed and transmitted.\n\nThe two men never achieved this, but Schillinger became very, very, respected as someone with a rigorous theory of musical structure -- though reading his magnum opus, the Schillinger System of Musical Composition, is frankly like wading through treacle. I'll read a short excerpt just to give an idea of his thinking:\n\"On the receiving end, phasic stimuli produced by instruments encounter a metamorphic auditory integrator. This integrator represents the auditory apparatus as a whole and is a complex interdependent system. It consists of two receivers (ears), transmitters, auditory nerves, and a transformer, the auditory braincenter. \n\nThe response to a stimulus is integrated both quantitatively and selectively. The neuronic energy of response becomes the psychonic energy of auditory image. The response to stimuli and the process of integration are functional operations and, as such, can be described in mathematical terms , i.e., as  synchronization, addition, subtraction, multiplication, etc. But these integrative processes alone do not constitute the material of orchestration either. \n\nThe auditory image, whether resulting from phasic stimuli of an excitor or from selfstimulation of the auditory brain-center, can be described only in Psychological terms, of loudness, pitch, quality, etc. This leads us to the conclusion that the material of orchestration can be defined only as a group of conditions under which an integrated image results from a sonic stimulus subjected to an auditory response. \n\nThis constitutes an interdependent tripartite system, in which the existence of one component necessitates the existence of two others. The composer can imagine an integrated sonic form, yet he cannot transmit it to the auditor (unless telepathicaliy) without sonic stimulus and hearing apparatus.\"\nThat's Schillinger's way of saying that if a composer wants someone to hear the music they've written, the composer needs a musical instrument and the listener needs ears and a brain.\n\nThis kind of revolutionary insight made Schillinger immensely sought after in the early 1930s, and among his pupils were the swing bandleaders Benny Goodman and Tommy Dorsey, and the songwriter George Gershwin, who turned to Schillinger for advice when he was writing his opera Porgy and Bess:\n\n[Excerpt: Ella Fitzgerald and Louis Armstrong, \"Here Come De Honey Man\"]\n\nAnother of his pupils was the trombonist and arranger Glenn Miller, who at that time was a session player working in pickup studio bands for people like Red Nichols. Miller spent some time studying with him in the early thirties, and applied those lessons when given the job of putting together arrangements for Ray Noble, his first prominent job.\n\nIn 1938 Glenn Miller walked into a strip joint to see a nineteen-year-old he'd been told to take a look at. This was another trombonist, Paul Tanner, who was at the time working as a backing musician for the strippers. Miller had recently broken up his first big band, after a complete lack of success, and was looking to put together a new big band, to play arrangements in the style he had worked out while working for Noble.\n\nAs Tanner later put it \"he said, `Well, how soon can you come with me?' I said, `I can come right now.' I told him I was all packed, I had my toothbrush in my pocket and everything. And so I went with him that night, and I stayed with him until he broke the band up in September 1942.\"\n\nThe new band spent a few months playing the kind of gigs that an unknown band can get, but they soon had a massive success with a song Miller had originally written as an arranging exercise set for him by Schillinger, a song that started out under the title \"Miller's Tune\", but soon became known worldwide as \"Moonlight Serenade\":\n\n[Excerpt: Glenn Miller, \"Moonlight Serenade\"]\n\nThe Miller band had a lot of lineup changes in the four and a bit years it was together, but other than Miller himself there were only four members who were with that group throughout its career, from the early dates opening for  Freddie Fisher and His Schnickelfritzers right through to its end as the most popular band in America. They were piano player Chummy MacGregor, clarinet player Wilbur Schwartz, tenor sax player Tex Beneke, and Tanner.\n\nThey played on all of Miller's big hits, like \"In the Mood\" and \"Chattanooga Choo-Choo\":\n\n[Excerpt: Glenn Miller, \"Chattanooga Choo-Choo\"]\n\nBut in September 1942, the band broke up as the members entered the armed forces, and Tanner found himself in the Army while Miller was in the Air Force, so while both played in military bands, they weren't playing together, and Miller disappeared over the Channel, presumed dead, in 1944.\n\nTanner became a session trombonist, based in LA, and in 1958 he found himself on a session for a film soundtrack with Dr. Samuel Hoffman. I haven't been able to discover for sure which film this was for, but the only film on which Hoffman has an IMDB credit for that year is that American International Pictures classic, Earth Vs The Spider:\n\n[Excerpt: Earth Vs The Spider trailer]\n\nHoffman was a chiropodist, and that was how he made most of his living, but as a teenager in the 1930s he had been a professional violin player under the name Hal Hope. One of the bands he played in was led by a man named Jolly Coburn, who had seen Rudy Vallee's band with their theremin and decided to take it up himself.\n\nHoffman had then also got a theremin, and started his own all-electronic trio, with a Hammond organ player, and with a cello-style fingerboard theremin played by William Schuman, the future Pulitzer Prize winning composer.\n\nBy the 1940s, Hoffman was a full-time doctor, but he'd retained his Musicians' Union card just in case the odd gig came along, and then in 1945 he received a call from Miklos Rozsa, who was working on the soundtrack for Alfred Hitchcock's new film, Spellbound. Rozsa had tried to get Clara Rockmore, the one true virtuoso on the theremin playing at the time, to play on the soundtrack, but she'd refused -- she didn't do film soundtrack work, because in her experience they only wanted her to play on films about ghosts or aliens, and she thought it damaged the dignity of the instrument.\n\nRozsa turned to the American Federation of Musicians, who as it turned out had precisely one theremin player who could read music and wasn't called Clara Rockmore on their books. So Dr. Samuel Hoffman, chiropodist, suddenly found himself playing on one of the most highly regarded soundtracks of one of the most successful films of the forties:\n\n[Excerpt: Miklos Rozsa, \"Spellbound\"]\n\nRozsa soon asked Hoffman to play on another soundtrack, for the Billy Wilder film The Lost Weekend, another of the great classics of late forties cinema. Both films' soundtracks were nominated for the Oscar, and Spellbound's won, and Hoffman soon found himself in demand as a session player.\n\nHoffman didn't have any of Rockmore's qualms about playing on science fiction and horror films, and anyone with any love of the genre will have heard his playing on genre classics like The Five Thousand Fingers of Dr T, The Thing From Another World, It Came From Outer Space, and of course Bernard Hermann's score for The Day The Earth Stood Still:\n\n[Excerpt: The Day The Earth Stood Still score]\n\nAs well as on such less-than-classics as The Devil's Weed, Voodoo Island, The Mad Magician, and of course Billy The Kid Vs Dracula.\n\nHoffman became something of a celebrity, and also recorded several albums of lounge music with a band led by Les Baxter, like the massive hit Music Out Of The Moon, featuring tracks like “Lunar Rhapsody”:\n\n[Excerpt: Samuel Hoffman, \"Lunar Rhapsody”]\n\n[Excerpt: Neil Armstrong]\n\nThat voice you heard there was Neil Armstrong, on Apollo 11 on its way back from the moon. He took a tape of Hoffman's album with him.\n\nBut while Hoffman was something of a celebrity in the fifties, the work dried up almost overnight in 1958 when he worked at that session with Paul Tanner. The theremin is a very difficult instrument to play, and while Hoffman was a good player, he wasn't a great one -- he was getting the work because he was the best in a very small pool of players, not because he was objectively the best there could be.\n\nTanner noticed that Hoffman was having quite some difficulty getting the pitching right in the session, and realised that the theremin must be a very difficult instrument to play because it had no markings at all. So he decided to build an instrument that had the same sound, but that was more sensibly controlled than just waving your hands near it. He built his own invention, the electrotheremin, in less than a week, despite never before having had any experience in electrical engineering. He built it using an oscillator, a length of piano wire and a contact switch that could be slid up and down the wire, changing the pitch.\n\nTwo days after he finished building it, he was in the studio, cutting his own equivalent of Hoffman's forties albums, Music For Heavenly Bodies, including a new exotica version of \"Moonlight Serenade\", the song that Glenn Miller had written decades earlier as an exercise for Schillinger:\n\n[Excerpt: Paul Tanner, \"Moonlight Serenade\"]\n\nNot only could the electrotheremin let the player control the pitch more accurately, but it could also do staccato notes easily -- something that's almost impossible with an actual theremin. And, on top of that, Tanner was cheaper than Hoffman. An instrumentalist hired to play two instruments is paid extra, but not as much extra as paying for another musician to come to the session, and since Tanner was a first-call trombone player who was likely to be at the session *anyway*, you might as well hire him if you want a theremin sound, rather than paying for Hoffman.\n\nTanner was an excellent musician -- he was a professor of music at UCLA as well as being a session player, and he authored one of the standard textbooks on jazz -- and soon he had cornered the market, leaving Hoffman with only the occasional gig. We will actually be seeing Hoffman again, playing on a session for an artist we're going to look at in a couple of months, but in LA in the early sixties, if you wanted a theremin sound, you didn't hire a theremin player, you hired Paul Tanner to play his electrotheremin -- though the instrument was so obscure that many people didn't realise he wasn't actually playing a theremin. Certainly Brian Wilson seems to have thought he was when he hired him for \"I Just Wasn't Made For These Times\":\n\n[Excerpt: The Beach Boys, \"I Just Wasn't Made For These Times\"]\n\nWe talked briefly about that track back in the episode on \"God Only Knows\",   but three days after recording that, Tanner was called back into the studio for another session on which Brian Wilson wanted a theremin sound.\n\nThis was a song titled \"Good, Good, Good Vibrations\", and it was inspired by a conversation he'd had with his mother as a child. He'd asked her why dogs bark at some people and not at others, and she'd said that dogs could sense vibrations that people sent out, and some people had bad vibrations and some had good ones.\n\nIt's possible that this came back to mind as he was planning the Pet Sounds album, which of course ends with the sound of his own dogs barking. It's also possible that he was thinking more generally about ideas like telepathy -- he had been starting to experiment with acid by this point, and was hanging around with a crowd of people who were proto-hippies, and reading up on a lot of the mystical ideas that were shared by those people. As we saw in the last episode, there was a huge crossover between people who were being influenced by drugs, people who were interested in Eastern religion, and people who were interested in what we now might think of as pseudo-science but at the time seemed to have a reasonable amount of validity, things like telepathy and remote viewing.\n\nWilson had also had exposure from an early age to people claiming psychic powers. Jo Ann Marks, the Wilson family's neighbour and the mother of former Beach Boy David Marks, later had something of a minor career as a psychic to the stars (at least according to obituaries posted by her son) and she would often talk about being able to sense \"vibrations\".\n\nThe record Wilson started out making in February 1966 with the Wrecking Crew was intended as an R&B single, and was also intended to sound *strange*:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-02-18\"]\n\nAt this stage, the song he was working on was a very straightforward verse-chorus structure, and it was going to be an altogether conventional pop song. The verses -- which actually ended up used in the final single, are dominated by organ and Ray Pohlman's bass:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-02-18\"]\n\nThese bear a strong resemblance to the verses of \"Here Today\", on the Pet Sounds album which the Beach Boys were still in the middle of making:\n\n[Excerpt: The Beach Boys, \"Here Today (instrumental)\"]\n\nBut the chorus had far more of an R&B feel than anything the Beach Boys had done before:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-02-18\"]\n\nIt did, though, have precedent. The origins of the chorus feel come from \"Can I Get a Witness?\", a Holland-Dozier-Holland song that had been a hit for Marvin Gaye in 1963:\n\n[Excerpt: Marvin Gaye, \"Can I Get a Witness?\"]\n\nThe Beach Boys had picked up on that, and also on its similarity to the feel of Lonnie Mack's instrumental cover version of Chuck Berry's \"Memphis, Tennessee\", which, retitled \"Memphis\", had also been a hit in 1963, and in 1964 they recorded an instrumental which they called \"Memphis Beach\" while they were recording it but later retitled \"Carl's Big Chance\", which was credited to Brian and Carl Wilson, but was basically just playing the \"Can I Get a Witness\" riff over twelve-bar blues changes, with Carl doing some surf guitar over the top:\n\n[Excerpt: The Beach Boys, \"Carl's Big Chance\"]\n\nThe \"Can I Get a Witness\" feel had quickly become a standard piece of the musical toolkit – you might notice the resemblance between that riff and the “talking 'bout my generation” backing vocals on “My Generation” by the Who, for example. It was also used on \"The Boy From New York City\", a hit on Red Bird Records by the Ad-Libs:\n\n[Excerpt: The Ad-Libs, \"The Boy From New York City\"]\n\nThe Beach Boys had definitely been aware of that record -- on their 1965 album Summer Days... And Summer Nights! they recorded an answer song to it, \"The Girl From New York City\":\n\n[Excerpt: The Beach Boys, \"The Girl From New York City\"]\n\nAnd you can see how influenced Brian was by the Ad-Libs record by laying the early instrumental takes of the \"Good Vibrations\" chorus from this February session under the vocal intro of \"The Boy From New York City\". It's not a perfect match, but you can definitely hear that there's an influence there:\n\n[Excerpt: \"The Boy From New York City\"/\"Good Vibrations\"]\n\nA few days later, Brian had Carl Wilson overdub some extra bass, got a musician in to do a jaw harp overdub, and they also did a guide vocal, which I've sometimes seen credited to Brian and sometimes Carl, and can hear as both of them depending on what I'm listening for. This guide vocal used a set of placeholder lyrics written by Brian's collaborator Tony Asher, which weren't intended to be a final lyric:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (first version)\"]\n\nBrian then put the track away for a month, while he continued work on the Pet Sounds album. At this point, as best we can gather, he was thinking of it as something of a failed experiment. In the first of the two autobiographies credited to Brian (one whose authenticity is dubious, as it was largely put together by a ghostwriter and Brian later said he'd never even read it) he talks about how he was actually planning to give the song to Wilson Pickett rather than keep it for the Beach Boys, and one can definitely imagine a Wilson Pickett version of the song as it was at this point.\n\nBut Brian's friend Danny Hutton, at that time still a minor session singer who had not yet gone on to form the group that would become Three Dog Night, asked Brian if *he* could have the song if Brian wasn't going to use it. And this seems to have spurred Brian into rethinking the whole song. And in doing so he was inspired by his very first ever musical memory. Brian has talked a lot about how the first record he remembers hearing was when he was two years old, at his maternal grandmother's house, where he heard the Glenn Miller version of \"Rhapsody in Blue\", a three-minute cut-down version of Gershwin's masterpiece, on which Paul Tanner had of course coincidentally played:\n\n[Excerpt: The Glenn Miller Orchestra, \"Rhapsody in Blue\"]\n\nHearing that music, which Brian's mother also played for him a lot as a child, was one of the most profoundly moving experiences of Brian's young life, and \"Rhapsody in Blue\" has become one of those touchstone pieces that he returns to again and again. He has recorded studio versions of it twice, in the mid-nineties with Van Dyke Parks:\n\n[Excerpt: Brian Wilson and Van Dyke Parks, \"Rhapsody in Blue\"]\n\nand in 2010 with his solo band, as the intro and outro of an album of Gershwin covers:\n\n[Excerpt: Brian Wilson, \"Rhapsody in Blue\"]\n\nYou'll also often see clips of him playing \"Rhapsody in Blue\" when sat at the piano -- it's one of his go-to songs.\n\nSo he decided he was going to come up with a song that was structured like \"Rhapsody in Blue\" -- what publicist Derek Taylor would later describe as a \"pocket symphony\", but \"pocket rhapsody\" would possibly be a better term for it. It was going to be one continuous song, but in different sections that would have different instrumentation and different feelings to them -- he'd even record them in different studios to get different sounds for them, though he would still often have the musicians run through the whole song in each studio. He would mix and match the sections in the edit.\n\nHis second attempt to record the whole track, at the start of April, gave a sign of what he was attempting, though he would not end up using any of the material from this session:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: Gold Star 1966-04-09\" around 02:34]\n\nNearly a month later, on the fourth of May, he was back in the studio -- this time in Western Studios rather than Gold Star where the previous sessions had been held, with yet another selection of musicians from the Wrecking Crew, plus Tanner, to record another version. This time, part of the session was used for the bridge for the eventual single:\n\n[Excerpt: The Beach Boys: \"Good Vibrations: Western 1966-05-04 Second Chorus and Fade\"]\n\nOn the twenty-fourth of May the Wrecking Crew, with Carl Wilson on Fender bass (while Lyle Ritz continued to play string bass, and Carol Kaye, who didn't end up on the finished record at all, but who was on many of the unused sessions, played Danelectro), had another attempt at the track, this time in Sunset Studios:\n\n[Excerpt: The Beach Boys: \"Good Vibrations: Sunset Sound 1966-05-24 (Parts 2&3)\"]\n\nThree days later, another group of musicians, with Carl now switched to rhythm guitar, were back in Western Studios recording this:\n\n[Excerpt: The Beach Boys: \"Good Vibrations: Western 1966-05-27 Part C\" from 2:52]\n\nThe fade from that session was used in the final track.\n\nA few days later they were in the studio again, a smaller group of people with Carl on guitar and Brian on piano, along with Don Randi on electric harpsichord, Bill Pitman on electric bass, Lyle Ritz on string bass and Hal Blaine on drums. This time there seems to have been another inspiration, though I've never heard it mentioned as an influence. In March, a band called The Association, who were friends with the Beach Boys, had released their single \"Along Comes Mary\", and by June it had become a big hit:\n\n[Excerpt: The Association, \"Along Comes Mary\"]\n\nNow the fuzz bass part they were using on the session on the second of June sounds to my ears very, very, like that intro:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (Inspiration) Western 1966-06-02\" from 01:47]\n\nThat session produced the basic track that was used for the choruses on the final single, onto which the electrotheremin was later overdubbed as Tanner wasn't at that session.\n\nSome time around this point, someone suggested to Brian that they should use a cello along with the electrotheremin in the choruses, playing triplets on the low notes. Brian has usually said that this was Carl's idea, while Brian's friend Van Dyke Parks has always said that he gave Brian the idea. Both seem quite certain of this, and neither has any reason to lie, so I suspect what might have happened is that Parks gave Brian the initial idea to have a cello on the track, while Carl in the studio suggested having it specifically play triplets. Either way, a cello part by Jesse Erlich was added to those choruses.\n\nThere were more sessions in June, but everything from those sessions was scrapped. At some point around this time, Mike Love came up with a bass vocal lyric, which he sang along with the bass in the choruses in a group vocal session. On August the twenty-fourth, two months after what one would think at this point was the final instrumental session, a rough edit of the track was pulled together.\n\nBy this point the chorus had altered quite a bit. It had originally just been eight bars of G-flat, four bars of B-flat, then four more bars of G-flat. But now Brian had decided to rework an idea he had used in \"California Girls\". In that song, each repetition of the line \"I wish they all could be California\" starts a tone lower than the one before. Here, after the bass hook line is repeated, everything moves up a step, repeats the line, and then moves up another step:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: [Alternate Edit] 1966-08-24\"]\n\nBut Brian was dissatisfied with this version of the track. The lyrics obviously still needed rewriting, but more than that, there was a section he thought needed totally rerecording -- this bit:\n\n[Excerpt: The Beach Boys, \"Good Vibrations: [Alternate Edit] 1966-08-24\"]\n\nSo on the first of September, six and a half months after the first instrumental session for the song, the final one took place. This had Dennis Wilson on organ, Tommy Morgan on harmonicas, Lyle Ritz on string bass, and Hal Blaine and Carl Wilson on percussion, and replaced that with a new, gentler, version:\n\n[Excerpt: The Beach Boys: \"Good Vibrations (Western 1966-09-01) [New Bridge]\"]\n\nWell, that was almost the final instrumental session -- they called Paul Tanner in to a vocal overdub session to redo some of the electrotheremin parts, but that was basically it.\n\nNow all they had to do was do the final vocals. Oh, and they needed some proper lyrics. By this point Brian was no longer working with Tony Asher. He'd started working with Van Dyke Parks on some songs, but Parks wasn't interested in stepping into a track that had already been worked on so long, so Brian eventually turned to Mike Love, who'd already come up with the bass vocal hook, to write the lyrics.\n\nLove wrote them in the car, on the way to the studio, dictating them to his wife as he drove, and they're actually some of his best work. The first verse grounds everything in the sensory, in the earthy. He makes a song originally about *extra* -sensory perception into one about sensory perception -- the first verse covers sight, sound, and smell:\n\n[Excerpt: The Beach Boys, \"Good Vibrations\"]\n\nCarl Wilson was chosen to sing the lead vocal, but you'll notice a slight change in timbre on the line \"I hear the sound of a\" -- that's Brian stepping into double him on the high notes. Listen again:\n\n[Excerpt: The Beach Boys, \"Good Vibrations\"]\n\nFor the second verse, Love's lyric moves from the sensory grounding of the first verse to the extrasensory perception that the song has always been about, with the protagonist knowing things about the woman who's the object of the song without directly perceiving them.\n\nThe record is one of those where I wish I was able to play the whole thing for you, because it's a masterpiece of structure, and of editing, and of dynamics. It's also a record that even now is impossible to replicate properly on stage, though both its writers in their live performances come very close. But while someone in the audience for either the current touring Beach Boys led by Mike Love or for Brian Wilson's solo shows might come away thinking \"that sounded just like the record\", both have radically different interpretations of it even while sticking close to the original arrangement. The touring Beach Boys' version is all throbbing strangeness, almost garage-rock, emphasising the psychedelia of the track:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (live 2014)\"]\n\nWhile Brian Wilson's live version is more meditative, emphasising the gentle aspects:\n\n[Excerpt Brian Wilson, \"Good Vibrations (live at the Roxy)\"]\n\nBut back in 1966, there was definitely no way to reproduce it live with a five-person band. According to Tanner, they actually asked him if he would tour with them, but he refused -- his touring days were over, and also he felt he would look ridiculous, a middle-aged man on stage with a bunch of young rock and roll stars, though apparently they offered to buy him a wig so he wouldn't look so out of place. When he wouldn't tour with them, they asked him where they could get a theremin, and he pointed them in the direction of Robert Moog.\n\nMoog -- whose name is spelled M-o-o-g and often mispronounced \"moog\", had been a teenager in 1949, when he'd seen a schematic for a theremin in an electronic hobbyist magazine, after Samuel Hoffman had brought the instrument back into the limelight. He'd built his own, and started building others to sell to other hobbyists, and had also started branching out into other electronic instruments by the mid-sixties.\n\nHis small company was the only one still manufacturing actual theremins, but when the Beach Boys came to him and asked him for one, they found it very difficult to control, and asked him if he could do anything simpler. He came up with a ribbon-controlled oscillator, on the same principle as Tanner's electro-theremin, but even simpler to operate, and the Beach Boys bought it and gave it to Mike Love to play on stage. All he had to do was run his finger up and down a metallic ribbon, with the positions of the notes marked on it, and it would come up with a good approximation of the electro-theremin sound. Love played this \"woo-woo machine\" as he referred to it, on stage for several years:\n\n[Excerpt: The Beach Boys, \"Good Vibrations (live in Hawaii 8/26/67)\"]\n\nMoog was at the time starting to build his first synthesisers, and having developed that ribbon-control mechanism he decided to include it in the early models as one of several different methods of controlling the Moog synthesiser, the instrument that became synonymous with the synthesiser in the late sixties and early seventies:\n\n[Excerpt: Gershon Kingsley and Leonid Hambro, \"Rhapsody in Blue\" from Switched-On Gershwin]\n\n\"Good Vibrations\" became the Beach Boys' biggest ever hit -- their third US number one, and their first to make number one in the UK. Brian Wilson had managed, with the help of his collaborators, to make something that combined avant-garde psychedelic music and catchy pop hooks, a truly experimental record that was also a genuine pop classic. To this day, it's often cited as the greatest single of all time.\n\nBut Brian knew he could do better. He could be even more progressive. He could make an entire album using the same techniques as \"Good Vibrations\", one where themes could recur, where sections could be edited together and songs could be constructed in the edit. Instead of a pocket symphony, he could make a full-blown teenage symphony to God. All he had to do was to keep looking forward, believe he could achieve his goal, and whatever happened, not lose his nerve and turn back.\n\n[Excerpt: The Beach Boys, \"Smile Promo\" ]",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and forty-six of A History of Rock Music in Five Hundred Songs looks at “Good Vibrations” by the Beach Boys, and the history of the theremin. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"You're Gonna Miss Me\" by the Thirteenth Floor Elevators.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I’ve checked for specific things.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at https://payhip.com/CMusicBooks\n\nAndrew Doe’s Bellagio 10452 site is an invaluable resource.\n\nJon Stebbins’ The Beach Boys FAQ is a good balance between accuracy and readability.\n\nAnd Philip Lambert’s Inside the Music of Brian Wilson is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nI have also referred to Brian Wilson’s autobiography, I Am Brian Wilson, and to Mike Love’s, Good Vibrations: My Life as a Beach Boy.\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend this budget-priced three-CD set, which has a surprisingly good selection of their material on it, including the single version of \"Good Vibrations\".\n\nOddly, the single version of \"Good Vibrations\" is not on the The Smile Sessions box set. But an entire CD of outtakes of the track is, and that was the source for the session excerpts here.\n\nInformation on Lev Termen comes from Theremin: Ether Music and Espionage by Albert Glinsky\n\nTranscript\n\nIn ancient Greece, the god Hermes was a god of many things, as all the Greek gods were. Among those things, he was the god of diplomacy, he was a trickster god, a god of thieves, and he was a messenger god, who conveyed messages between realms. He was also a god of secret knowledge. In short, he was the kind of god who would have made a perfect spy.\n\nBut he was also an inventor. In particular he was credited in Greek myth as having invented the lyre, an instrument somewhat similar to a guitar, harp, or zither, and as having used it to create beautiful sounds. But while Hermes the trickster god invented the lyre, in Greek myth it was a mortal man, Orpheus, who raised the instrument to perfection. Orpheus was a legendary figure, the greatest poet and musician of pre-Homeric Greece, and all sorts of things were attributed to him, some of which might even have been things that a real man of that name once did. He is credited with the \"Orphic tripod\" -- the classification of the elements into earth, water, and fire -- and with a collection of poems called the Rhapsodiae.\n\nThe word Rhapsodiae comes from the Greek words rhaptein, meaning to stitch or sew, and ōidē, meaning song -- the word from which we get our word \"ode\", and  originally a rhapsōdos was someone who \"stitched songs together\" -- a reciter of long epic poems composed of several shorter pieces that the rhapsōdos would weave into one continuous piece. It's from that that we get the English word \"rhapsody\", which in the sixteenth century, when it was introduced into the language, meant a literary work that was a disjointed collection of patchwork bits, stitched together without much thought as to structure, but which now means a piece of",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and forty-six of A History of Rock Music in Five Hundred Songs looks at “Good Vibrations” by the Beach Boys, and the history of the theremin. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"You're Gonna Miss Me\" by the Thirteenth Floor Elevators.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}