{
  "id": "https://bibleinoneyear.org/en/youth/130",
  "title": "Day 130: God Turns Your Weakness into Strength",
  "description": "Psalm 59:1,4b, Judges 11:29-31, John 6:35–40. ’As someone who is very aware of my own weaknesses, I find it encouraging that when I feel weak, I am not alone  As you put your *faith* in God he turns your weakness into strength",
  "pubDate": "Mon, 10 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/130/?ignore",
  "itunes:duration": "13:32",
  "guid": "enyouth10052021-130",
  "length": 812.36,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 130: God Turns Your Weakness into Strength",
  "itunes:subtitle": "Psalm 59:1,4b, Judges 11:29-31, John 6:35–40. ’As someone who is very aware of my own weaknesses, I find it encouraging that when I feel weak, I am not alone  As you put your *faith* in God he turns your weakness into strength",
  "itunes:summary": "The great Christian leader, John Stott, was speaking on one occasion at a university mission in Sydney, Australia. On the last night of the mission, as a result of an infection, he had virtually lost his voice.\nNevertheless, he was persuaded to speak. Waiting in the side room beforehand, he whispered a request that the words of the ‘thorn in the flesh’ verses from 2 Corinthians 12 be read to him. The conversation between Jesus and the apostle Paul came alive.\nStott (Paul): ‘I beg you to take it away from me.’\nJesus: ‘My grace is sufficient for you, for my power is made perfect in weakness.’\nStott (Paul): ‘I will all the more gladly boast of my weaknesses, that the power of Christ may rest upon me… for when I am weak, then I am strong.’\nWhen the time came to speak he croaked the gospel through the microphone in a monotone, utterly unable to modulate his voice or exert his personality in any way. But all the time he was crying to the Lord to perfect Christ’s power through his weakness.\nHe went back to Australia many times after that, and on every occasion somebody came up to him and said, ‘Do you remember that final service in the University Great Hall, when you had lost your voice? I came to Christ that night.’\nAs someone who is very aware of my own weaknesses, I find it encouraging that when I feel weak, I am not alone. As you put your faith in God he turns your weakness into strength.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 130
}