{
  "itunes:episode": 78,
  "title": "I Never MetaFilter I Didn't Like with Matt Haughey",
  "pubDate": "Thu, 05 Jun 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/6/5/i-never-metafilter-i-didnt-like-with-matt-haughey-episode-78",
  "description": "<p>Matt Haughey founded <a href=\"http://www.metafilter.com/\">MetaFilter</a>, a well-moderated forum for discussions about interesting things that expanded to also answer questions. At just a few months over 15 years old, it's a veterans of many Internet lifecycles. In the last couple of years, however, MetaFilter began to face an existential challenge, which we'll talk about in this episode, along with its history, nature, and future. </p>\n\n<h2>Sponsors & patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p>Thanks to our sponsor, <a href=\"https://www.harrys.com\">Harry's</a>: A great shaving experience for a fraction of the price of its competitors. $15 gets you a set that includes a handle, three blades, and shaving cream shipped to your door. Use coupon code <strong>DISRUPT</strong> for $5 off your first order.</p>\n\n<p>We've started a new kind of ad: <a href=\"http://newdisrupt.org/blog/2014/5/27/indie-ads-on-the-new-disruptors\">\"indie ads\"</a>! If you're a solo creator or small firm, we're offering discounted short ads with the kind underwriting of <a href=\"http://cardsagainsthumanity.com/\">Cards Against Humanity</a>. (CAH just launched a site where you can buy directly from them, including their Bigger Blacker Box and their 2012 and 2013 holiday packs, the profits from which are donated to charity.)</p>\n\n<p>Thanks also to patrons Bryan Clark, Rönne Ogland, and Mike Mansor for <a href=\"http://www.patreon.com/newdisruptors\">supporting us directly through Patreon</a>! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts!</p>\n\n<h2>Show notes</h2>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Atex_%28software%29\">Atex</a> was the first digital composition system, used widely in the newspaper and magazine world into the 1990s, when PageMaker, QuarkXPress, and other software superceded it. Matt worked at <a href=\"http://en.wikipedia.org/wiki/Pyra_Labs\">Pyra Labs</a> on <a href=\"https://www.blogger.com/about\">Blogger</a> for a short stint in its early days with <a href=\"http://evhead.com/\">Ev Williams</a>, <a href=\"http://megnut.com/\">Meg Hourihan</a>.</p>\n\n<p>We mention <a href=\"http://www.oreilly.com/tim/\">Tim O'Reilly</a>, a publisher and thinker who invested in Blogger and a number of other interesting early-stage ventures. He founded <a href=\"http://en.wikipedia.org/wiki/Global_Network_Navigator\">Global Network Navigator (GNN)</a> in 1993, which was sold to AOL in 1995. He is part of <a href=\"http://oatv.com/are.html\">O'Reilly Alphatech Ventures</a>.</p>\n\n<p>David Carr, the <em>New York Times</em>' media critic, used the terrible, terrible term <em>platisher</em> to refer to Medium, which is a combination of a platform and a publisher <a href=\"http://www.nytimes.com/2014/05/26/business/media/a-platform-and-blogging-tool-medium-charms-writers.html?_r=0\">in a recent article</a>. </p>\n\n<p>An OC-12 line is up to 622 Mbps of throughput. MAE-West was once the major interconnection point for ISPs on the west coast. The MAE stands for Metropolitan Area Exchange. In 1995, I wrote \"<a href=\"http://tidbits.com/article/1501\">The Experiment Is Over</a>,\" about the how the National Science Foundation was shutting down its contracts for NSFNet, because commercial organizations could now directly operate the Internet backbone.</p>\n\n<p>A <a href=\"http://en.wikipedia.org/wiki/Virtual_private_server\">Virtual Private Server</a> (VPS) is a virtualized instance of an operating system running on a host alongside potentially many others, each of which is allotted guaranteed amounts of CPU usage, storage, and the like. VPSes are just like running a virtual machine on one's own computer, but designed for efficiency and reliability.</p>\n\n<p>Glenn uses <a href=\"https://www.linode.com/\">Linode</a>, which recently switched all its drives to SSDs and doubled many system parameters. <a href=\"https://www.digitalocean.com/\">Digital Ocean</a> is slightly cheaper (it used to be much more so). <a href=\"http://aws.amazon.com/ec2/?sc_channel=PS&sc_campaign=AWS_Free_Tier_2013_C&sc_country=US&sc_publisher=Google&sc_medium=b_core_compute_ec2_e-ec2&sc_content=40951034682&sc_detail=Amazon%20ec2&sc_category=compute_networking&sc_segment=EC2&sc_matchtype=e\">Amazon EC2</a> is another alternative for rapid scaling.</p>\n\n<p>After years of pictures of cats in scanners, MetaFilter set up <a href=\"http://cat-scan.com/\">cat-scan.com</a> to house those and its memories. </p>\n\n<p>BREAKING! Cat-scan is dead and its file lost forever!</p>\n\n<p>BREAKING! File were found and it's fixed. As you were.</p>\n\n<p>The community at Ask MetaFilter produces some remarkable answers. A poster <a href=\"http://ask.metafilter.com/255675/Decoding-cancer-addled-ramblings\">asked for help</a> deciphering coded messages her grandmother on index cards before she died in 1996. Within 15 minutes, there was an answer. <a href=\"http://waxy.org/\">Andy Baio</a> <a href=\"http://ask.metafilter.com/261595/Impossible-question-Can-you-identify-this-portion-of-an-album-cover\">asked about an image</a> he used a decade ago for the soon-to-be-revived Upcoming, and Boing Boing's <a href=\"http://beschizza.flavors.me/\">Rob Beschizza</a> had an answer four minutes later.</p>\n\n<p>Einstein <a href=\"http://quoteinvestigator.com/2012/02/24/telegraph-cat/\">probably didn't tell a story</a> about \"no cat,\" but it's an interesting history of where the apocryphal quote came from; and <a href=\"http://answers.google.com/answers/threadview?id=62956\">my original Google Answers query</a>, for which I was willing to pay $15 if someone had an accurate reply.</p>\n\n<p><a href=\"http://www.jessamyn.com/\">Jessamyn West</a> is part of the lifeblood of the interesting part of the Internet. Matt blames his <a href=\"http://www.pvrblog.com/\">PVRblog</a> for the rise of content farms.</p>\n\n<p>On Medium, <a href=\"https://medium.com/technology-musings/on-the-future-of-metafilter-941d15ec96f0\">Matt explained</a> MetaFilter's Google search and AdSense predicament. But the good news is that even after we recorded this episode, <a href=\"http://metatalk.metafilter.com/23272/MeFi-Fundraising-Update\">donations continued to pour in</a>. They've now received about $40,000 in one-time donations and a commitment of $10,000 per month in recurring ones. That monthly figure is about one-third of the site's Google ad revenue, and thus a good cushion against future drops.</p>\n\n<p>(Photo by Chris Ryan.)</p>\n",
  "guid": "tag:soundcloud,2010:tracks/152892486",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:47:47",
  "itunes:subtitle": "Matt Haughey founded MetaFilter, a well-moderated forum for discussions about interesting things that expanded to also answer questions.",
  "itunes:summary": "Matt Haughey founded MetaFilter, a well-moderated forum for discussions about interesting things that expanded to also answer questions. At just a few months over 15 years old, it's a veterans of many Internet lifecycles. In the last couple of years, however, MetaFilter began to face an existential challenge, which we'll talk about in this episode, along with its history, nature, and future. (Photo by Chris Ryan.)"
}