{
  "id": "https://bibleinoneyear.org/en/youth/150",
  "title": "Day 150: Your Trial Will Become Your Triumph",
  "description": "Psalm 68:24-26, 1 Samuel 26:23–25, John 19:7–11,16a,19–22. The supreme example of triumph coming out of apparent catastrophe is the cross  What seemed to the world to be the ultimate defeat was in fact the ultimate triumph",
  "pubDate": "Sun, 30 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/150/?ignore",
  "itunes:duration": "16:28",
  "guid": "enyouth30052021-150",
  "length": 988.08,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 150: Your Trial Will Become Your Triumph",
  "itunes:subtitle": "Psalm 68:24-26, 1 Samuel 26:23–25, John 19:7–11,16a,19–22. The supreme example of triumph coming out of apparent catastrophe is the cross  What seemed to the world to be the ultimate defeat was in fact the ultimate triumph",
  "itunes:summary": "‘Houston, we’ve had a problem,’ were the words of Jim Lovell on the evening of 13 April 1970. Nearly fifty-six hours into the mission to the moon, an explosion aboard the spacecraft plunged the crew into a fight for their survival. Within less than a minute there was a cascade of systems failures throughout the spacecraft. ‘It was all at one time – a monstrous failure,’ said NASA’s flight controller.\nThe spacecraft looped around the moon, using its gravity to return to earth. Millions of people followed the drama on television. Eventually, the capsule splashed down in the Pacific Ocean near Tonga.\nIn an article headed ‘Apollo 13: From Disaster to Triumph’ the BBC science reporter wrote, ‘Although the mission was not a success from a conventional perspective, it was a triumph of ingenuity and determination.’ Jim Lovell said it showed the people of the world that even if there was a great catastrophe, it could be turned into a success.\nThe supreme example of triumph coming out of apparent catastrophe is the cross. What seemed to the world to be the ultimate defeat was in fact the ultimate triumph.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 150
}