{
  "id": "https://bibleinoneyear.org/en/youth/56",
  "title": "Day 56: How to Make the Most of Your Life",
  "description": "Proverbs 6:1–2,5–11, Exodus 38:22–23, Mark 8:14–36. Life is an extraordinary and wonderful gift  In the Bible we are constantly urged not to waste this gift, but instead to make the most of our lives",
  "pubDate": "Fri, 25 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/56/",
  "itunes:duration": "13:24",
  "guid": "enyouth25022022-56",
  "length": 804.02,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 56: How to Make the Most of Your Life",
  "itunes:subtitle": "Proverbs 6:1–2,5–11, Exodus 38:22–23, Mark 8:14–36. Life is an extraordinary and wonderful gift  In the Bible we are constantly urged not to waste this gift, but instead to make the most of our lives",
  "itunes:summary": "‘People often ask me what Mother Teresa was like,’ writes Shane Claiborne in his book The Irresistible Revolution. ‘Sometimes it’s like they wonder if she glowed in the dark or had a halo. She was short, wrinkled, and precious, maybe even a little ornery, like a beautiful, wise old granny. But there is one thing I will never forget – her feet. Her feet were deformed.\nEach morning I would stare at them. I wondered if she had contracted leprosy. One day a Sister explained, “Her feet are deformed because we get just enough donated shoes for everyone, and Mother does not want anyone to get stuck with the worst pair, so she digs through and finds them. And years of doing that have deformed her feet.” Years of loving her neighbour as herself deformed her feet.’\nWhen people are asked about the person whose life they most admire, so often the answer is ‘Mother Teresa’. She made the most of her life. It is a paradox, because her life was a life of self-denial, taking up her cross and following Jesus.\nLife is an extraordinary and wonderful gift. In the Bible we are constantly urged not to waste this gift, but instead to make the most of our lives.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 421
}