{
  "title": "Special Episode: New Challenges for The US Consumer",
  "description": "<p>Consumer prices reached an all-time high this past December, and a new year brings new challenges across inflation, wage growth and interest rates.</p><p><br></p><p>----- Transcript -----</p><p><strong>Ellen Zentner </strong>Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>And I'm Sarah Wolfe, also on Morgan Stanley's U.S. Economics team.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>And on this episode of the podcast, we'll be talking about the outlook for consumer spending in the face of inflation, Omicron, rising interest rates and other headwinds. It's Friday, January 28th at 10:00 a.m. in New York.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So Sarah, as most listeners have observed since the Fall, inflation is on everyone's mind, with consumer prices reaching a 39-year high in December, and we're forecasting inflation to recede throughout this year from about 7% now down to 2.9% by the fourth quarter. But let's talk about right now.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, you've got your finger on the pulse of the consumer. You're a consumer specialist on the team. And so, I want to ask, how quickly have consumers adjusted their spending over the past few months because of inflation? What evidence have we seen?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>The consumer buying power has been very resilient in the face of high inflation. This week we got the fourth quarter GDP data and we saw the real PCE expanded by 3.3%. So that is another very strong quarter for consumer spending. And that brings spending to nearly 8% year over year in 2021, so very elevated. However, we are beginning to see that consumers may be reaching the upper echelon of their price tolerance in December. We got the retail sales report a couple of weeks ago for December, and we saw a very large contraction in consumer spending declined by more than 3%, and the decline was pretty broad based across all categories that have seen very high inflation, and this is largely reflective of goods spending. So, this is a pretty clear signal to us that while Omicron may be weighing on spending, inflation is largely at play here. And we still expect inflation to be peaking in January and February, so we likely will see some deterioration in consumer spending as we enter the first quarter of 2022.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>How weak could consumer spending be this quarter?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>Right now, we just started our tracking for the first quarter of 2022 at 1.5% GDP growth, but within that, we have 1-2% contraction in real PCE. I will note that inflation's high so nominal PCE is still tracking positive, but it's not looking very good as we enter the first quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Yeah, it seems clear that inflation is taking a bite. And remind me, we have this great consumer pulse survey that we've been putting out, and I think it was back in November, right? That the people were actually saying, \"Look, I'm more worried about inflation than Omicron or than COVID 19\". And that's incredible. I mean, that's a pandemic that's been weighing on people's minds and yet inflation usurped.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>We're also seeing it in the consumer sentiment surveys. The University of Michigan surveys inflation expectations each month. Near term inflation expectations have reached all-time highs. They're at 4.9%, and we're starting to see longer term expectations also start to tick up. In January, they hit 3.1%, which is a high since 2011. So, it's definitely being felt by consumers and causing a lot of uncertainty among them as well.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>But now, because we have this forecast that inflation is going to peak in February, which is data we have in hand in March, if we're right on that, can that give us a lot of confidence that at least households can see that there's light at the end of the tunnel and start to breathe a sigh of relief?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>Yeah. As you mentioned, there are few headwinds facing the consumer right now. We think most of them are going to recede by the end of the first quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Another big change for the consumer versus last year, that you've been writing about is the roll off of government stimulus for a lot of Americans. That had really helped bolster consumer spending, getting us to that big growth rate in 2021 that you mentioned. But now that that's rolling off, what impact might it have on spending this year?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So, the big impact to spending is going to be felt this quarter in the beginning of 2022. And that's for two reasons. The first is that the child tax credits have come to an end. That did not get extended because the Build Back Better plan was not passed in time. and the child tax credits were boosting income for lower, middle-income households by $15B a month. And that included $300-360 payments per child per month. A lot of that was going straight into spending, food, other essential items, school supplies. So, we're going to get a level shift down in income and spending in January alone just because of the expiration. So, the other reason that first quarter is going to be hard for consumers is because a lot of the stimulus came through one year ago in 1Q21. That's when we got the $600 checks per person, then the $1400 checks and then also the supplemental $300 unemployment insurance benefit. So, when you're looking at income and spending year over year, especially for lower middle-income households, this is going to be a tough quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>All right. So that's a lot of stimulus that came in, not just over 2020, but all the way into early 2021. So, does that mean that they spent all of that money that they got? Because you've been writing a lot about this idea of an excess savings. So, what do you mean by that? How do we define excess savings? Who's holding that excess savings, and can it make its way into the economy?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So, to define what excess savings is, it's basically cumulative savings above the pre-COVID savings trend. And how does that compare to the savings rate? The savings rate is just a monthly snapshot of income and spending, but excess savings is looking at how much is building up over time. And so excess savings, as many have heard this number, was over $2T throughout 2020 and 2021. We have data that shows that some of it was held all the way across the income distribution, but 80% of that was held among the top 20%. And so, a lot of that excess savings is still sitting with the wealthiest people.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>What about the excess savings for lower income people? It's a smaller dollar amount, and for that reason, it just does not go as far. We have been dealing with, I mentioned, with six to eight months of high inflation. We've seen consumer spending throughout all of this high inflation. And part of that was likely driven by the drawdown in excess savings for lower income households. And so, when I think about spending for 2022, excess savings is not the main driver.</p><p>&nbsp;</p><p><strong>Ellen Zentner</strong> So in this battle that households have with inflation, right? You got excess savings. There's a lot of uncertainty around how and when that might filter into the economy. And so, it seems that in the face of higher inflation then it makes labor income all that much more important. So, when you're looking at income or prices, how do you weigh that tug of war?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So it's OK if prices are going up as long as wages are going up by more. And so, people continue to spend. What we're seeing in the data right now is that, on net, real wages are negative. I mean, we're dealing with 7% inflation. However, and this is very important, real wages for the lowest income group are actually positive. They're the group that's seen the strongest wage growth and it actually is outpacing inflation. I say this is really important because of all we have discussed. The rolling off of fiscal stimulus - this is a group that gets hurt the most by that. Inflation - this is also the group that gets hurt the most by that. When we think about the spending bucket of lower middle-income households, most of their spending goes to essential items like food, energy and shelter. Energy prices alone have increased by over 8% in the last three months.</p><p><s>&nbsp;</s></p><p><strong>Sarah Wolfe </strong>So, seeing real wage growth is very important, and we expect real wages to enter a positive territory for middle- and higher-income households as well as we enter mid 2022, and inflation comes down to about 4% or so.</p><p>&nbsp;</p><p><strong>Ellen Zentner</strong> Yeah, so for those of you not able to see us, Sarah rolls her eyeballs when she says \"come down to 4%\" because that's still such a high rate of inflation. But it is quite a few percentage points lower than where we've peaked. So, it's really about the direction. Households can start to breathe a sigh of relief that indeed this is not some sort of permanently higher inflation and ultimately just that labor market improvement, remains the most important piece of the consumer spending outlook. Would you agree?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>I would agree. Fundamentally, income is what drives spending and a large chunk of income is labor compensation. So as long as we're seeing job gains and wage growth outpacing inflation, we should continue to see spending as we move through a tough first quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>But importantly, we've got to be right on those inflation forecasts. You know, finally, let me just say a couple of things about the Fed's meeting here. So, we do believe that the Fed has laid the groundwork to start raising rates in March, and so higher interest rates are meant to slow activity and specifically through the credit channel, right? They're going to raise the cost of access to credit this year. But in terms of, sort of what contributes most to, say, downturns when the Fed is tightening is the interest expense on the household balance sheet, right? All that debt we carry, which is a tremendous amount, that interest expense rises. So, should we be worried about household balance sheets in this environment because the Fed is going to be raising rates?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>Yeah, I mean, households are carrying over $14T in debt, but things are not as bad as they sound. 70% of household debt is in mortgages and another 10% is in auto debt. And luckily, those are largely locked in at fixed rates. 90% of mortgages are at fixed rates, so that alone is 68% of the household balance sheet.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So, the picture looks better on net for households. Obviously, you need to be a homeowner for it to be in that fixed rate. So, there are non-homeowners that are more susceptible to changing rates. So, people that are holding more credit card debt, that's more lower income people. So that is the group that's going to be the most affected by a raising rates environment.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Right. Good point. And so, it's even more important that we keep the labor market strong and wage growth strong for those lower income cohorts.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So we've talked a lot about the consumer, Sarah, but I could do this all day long. So, thanks for taking the time today.</p><p>&nbsp;</p><p><strong>Sarah Wolfe</strong> It was great talking with you, Ellen. Thanks for having me on.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>And thanks for listening. If you enjoy the show, please leave us a review on Apple Podcasts and share Thoughts on the Market with a friend or colleague today.</p>",
  "itunes:title": "Special Episode: New Challenges for The US Consumer",
  "itunes:episodeType": "full",
  "itunes:episode": 543,
  "itunes:summary": "Consumer prices reached an all-time high this past December, and a new year brings new challenges across inflation, wage growth and interest rates.",
  "content:encoded": "<p>Consumer prices reached an all-time high this past December, and a new year brings new challenges across inflation, wage growth and interest rates.</p><p><br></p><p>----- Transcript -----</p><p><strong>Ellen Zentner </strong>Welcome to Thoughts on the Market. I'm Ellen Zentner, Chief U.S. Economist for Morgan Stanley Research.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>And I'm Sarah Wolfe, also on Morgan Stanley's U.S. Economics team.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>And on this episode of the podcast, we'll be talking about the outlook for consumer spending in the face of inflation, Omicron, rising interest rates and other headwinds. It's Friday, January 28th at 10:00 a.m. in New York.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So Sarah, as most listeners have observed since the Fall, inflation is on everyone's mind, with consumer prices reaching a 39-year high in December, and we're forecasting inflation to recede throughout this year from about 7% now down to 2.9% by the fourth quarter. But let's talk about right now.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So, you've got your finger on the pulse of the consumer. You're a consumer specialist on the team. And so, I want to ask, how quickly have consumers adjusted their spending over the past few months because of inflation? What evidence have we seen?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>The consumer buying power has been very resilient in the face of high inflation. This week we got the fourth quarter GDP data and we saw the real PCE expanded by 3.3%. So that is another very strong quarter for consumer spending. And that brings spending to nearly 8% year over year in 2021, so very elevated. However, we are beginning to see that consumers may be reaching the upper echelon of their price tolerance in December. We got the retail sales report a couple of weeks ago for December, and we saw a very large contraction in consumer spending declined by more than 3%, and the decline was pretty broad based across all categories that have seen very high inflation, and this is largely reflective of goods spending. So, this is a pretty clear signal to us that while Omicron may be weighing on spending, inflation is largely at play here. And we still expect inflation to be peaking in January and February, so we likely will see some deterioration in consumer spending as we enter the first quarter of 2022.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>How weak could consumer spending be this quarter?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>Right now, we just started our tracking for the first quarter of 2022 at 1.5% GDP growth, but within that, we have 1-2% contraction in real PCE. I will note that inflation's high so nominal PCE is still tracking positive, but it's not looking very good as we enter the first quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Yeah, it seems clear that inflation is taking a bite. And remind me, we have this great consumer pulse survey that we've been putting out, and I think it was back in November, right? That the people were actually saying, \"Look, I'm more worried about inflation than Omicron or than COVID 19\". And that's incredible. I mean, that's a pandemic that's been weighing on people's minds and yet inflation usurped.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>We're also seeing it in the consumer sentiment surveys. The University of Michigan surveys inflation expectations each month. Near term inflation expectations have reached all-time highs. They're at 4.9%, and we're starting to see longer term expectations also start to tick up. In January, they hit 3.1%, which is a high since 2011. So, it's definitely being felt by consumers and causing a lot of uncertainty among them as well.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>But now, because we have this forecast that inflation is going to peak in February, which is data we have in hand in March, if we're right on that, can that give us a lot of confidence that at least households can see that there's light at the end of the tunnel and start to breathe a sigh of relief?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>Yeah. As you mentioned, there are few headwinds facing the consumer right now. We think most of them are going to recede by the end of the first quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Another big change for the consumer versus last year, that you've been writing about is the roll off of government stimulus for a lot of Americans. That had really helped bolster consumer spending, getting us to that big growth rate in 2021 that you mentioned. But now that that's rolling off, what impact might it have on spending this year?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So, the big impact to spending is going to be felt this quarter in the beginning of 2022. And that's for two reasons. The first is that the child tax credits have come to an end. That did not get extended because the Build Back Better plan was not passed in time. and the child tax credits were boosting income for lower, middle-income households by $15B a month. And that included $300-360 payments per child per month. A lot of that was going straight into spending, food, other essential items, school supplies. So, we're going to get a level shift down in income and spending in January alone just because of the expiration. So, the other reason that first quarter is going to be hard for consumers is because a lot of the stimulus came through one year ago in 1Q21. That's when we got the $600 checks per person, then the $1400 checks and then also the supplemental $300 unemployment insurance benefit. So, when you're looking at income and spending year over year, especially for lower middle-income households, this is going to be a tough quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>All right. So that's a lot of stimulus that came in, not just over 2020, but all the way into early 2021. So, does that mean that they spent all of that money that they got? Because you've been writing a lot about this idea of an excess savings. So, what do you mean by that? How do we define excess savings? Who's holding that excess savings, and can it make its way into the economy?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So, to define what excess savings is, it's basically cumulative savings above the pre-COVID savings trend. And how does that compare to the savings rate? The savings rate is just a monthly snapshot of income and spending, but excess savings is looking at how much is building up over time. And so excess savings, as many have heard this number, was over $2T throughout 2020 and 2021. We have data that shows that some of it was held all the way across the income distribution, but 80% of that was held among the top 20%. And so, a lot of that excess savings is still sitting with the wealthiest people.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>What about the excess savings for lower income people? It's a smaller dollar amount, and for that reason, it just does not go as far. We have been dealing with, I mentioned, with six to eight months of high inflation. We've seen consumer spending throughout all of this high inflation. And part of that was likely driven by the drawdown in excess savings for lower income households. And so, when I think about spending for 2022, excess savings is not the main driver.</p><p>&nbsp;</p><p><strong>Ellen Zentner</strong> So in this battle that households have with inflation, right? You got excess savings. There's a lot of uncertainty around how and when that might filter into the economy. And so, it seems that in the face of higher inflation then it makes labor income all that much more important. So, when you're looking at income or prices, how do you weigh that tug of war?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So it's OK if prices are going up as long as wages are going up by more. And so, people continue to spend. What we're seeing in the data right now is that, on net, real wages are negative. I mean, we're dealing with 7% inflation. However, and this is very important, real wages for the lowest income group are actually positive. They're the group that's seen the strongest wage growth and it actually is outpacing inflation. I say this is really important because of all we have discussed. The rolling off of fiscal stimulus - this is a group that gets hurt the most by that. Inflation - this is also the group that gets hurt the most by that. When we think about the spending bucket of lower middle-income households, most of their spending goes to essential items like food, energy and shelter. Energy prices alone have increased by over 8% in the last three months.</p><p><s>&nbsp;</s></p><p><strong>Sarah Wolfe </strong>So, seeing real wage growth is very important, and we expect real wages to enter a positive territory for middle- and higher-income households as well as we enter mid 2022, and inflation comes down to about 4% or so.</p><p>&nbsp;</p><p><strong>Ellen Zentner</strong> Yeah, so for those of you not able to see us, Sarah rolls her eyeballs when she says \"come down to 4%\" because that's still such a high rate of inflation. But it is quite a few percentage points lower than where we've peaked. So, it's really about the direction. Households can start to breathe a sigh of relief that indeed this is not some sort of permanently higher inflation and ultimately just that labor market improvement, remains the most important piece of the consumer spending outlook. Would you agree?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>I would agree. Fundamentally, income is what drives spending and a large chunk of income is labor compensation. So as long as we're seeing job gains and wage growth outpacing inflation, we should continue to see spending as we move through a tough first quarter.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>But importantly, we've got to be right on those inflation forecasts. You know, finally, let me just say a couple of things about the Fed's meeting here. So, we do believe that the Fed has laid the groundwork to start raising rates in March, and so higher interest rates are meant to slow activity and specifically through the credit channel, right? They're going to raise the cost of access to credit this year. But in terms of, sort of what contributes most to, say, downturns when the Fed is tightening is the interest expense on the household balance sheet, right? All that debt we carry, which is a tremendous amount, that interest expense rises. So, should we be worried about household balance sheets in this environment because the Fed is going to be raising rates?</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>Yeah, I mean, households are carrying over $14T in debt, but things are not as bad as they sound. 70% of household debt is in mortgages and another 10% is in auto debt. And luckily, those are largely locked in at fixed rates. 90% of mortgages are at fixed rates, so that alone is 68% of the household balance sheet.</p><p>&nbsp;</p><p><strong>Sarah Wolfe </strong>So, the picture looks better on net for households. Obviously, you need to be a homeowner for it to be in that fixed rate. So, there are non-homeowners that are more susceptible to changing rates. So, people that are holding more credit card debt, that's more lower income people. So that is the group that's going to be the most affected by a raising rates environment.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>Right. Good point. And so, it's even more important that we keep the labor market strong and wage growth strong for those lower income cohorts.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>So we've talked a lot about the consumer, Sarah, but I could do this all day long. So, thanks for taking the time today.</p><p>&nbsp;</p><p><strong>Sarah Wolfe</strong> It was great talking with you, Ellen. Thanks for having me on.</p><p>&nbsp;</p><p><strong>Ellen Zentner </strong>And thanks for listening. If you enjoy the show, please leave us a review on Apple Podcasts and share Thoughts on the Market with a friend or colleague today.</p>",
  "guid": "gid://art19-episode-locator/V0/trFS0em7DUXT-2ErclPrMT1Yz-cJS5LQ1JYWQqJ52p8",
  "pubDate": "Fri, 28 Jan 2022 23:49:09 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:10:15",
  "enclosure": ""
}