{
  "title": "521: Young Albus Dumbledore's Motives and Manipulations",
  "link": "https://audioboom.com/posts/7903242",
  "itunes:episode": 521,
  "itunes:title": "Young Albus Dumbledore's Motives and Manipulations",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4768,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>With one year to go until the film's release (we think), our Fantastic Beasts character discussions return! Up first... Albus Percival Wulfric Brian Dumbledore in his younger years!</li>\n<li>Jude Law: Youngledore, DumbleDAMN, Yumbledore!</li>\n<li>How did Deathly Hallows help inform our knowledge of the Dumbledores before seeing Crimes of Grindelwald? Aunt Muriel and Rita Skeeter weigh in!</li>\n<li>Did Albus fail in his responsibility to take care of both Ariana and Aberforth?</li>\n<li>What was so terrifying about the duel between Dumbledore and Grindelwald?</li>\n<li>Exactly what happened during the fight that killed Ariana?</li>\n<li>Why was Ariana seemingly kept a secret from the larger wizarding world?</li>\n<li>Gellert the Manipulator: did Grindelwald go to Godric's Hollow with the intent of meeting the Dumbledores?</li>\n<li>Was Ariana Dumbledore the first person to die “for the greater good”?</li>\n<li>Why does Dumbledore have such a close & trusting relationship with Newt?</li>\n<li>Even at a young age, Dumbledore didn't see eye-to-eye with the Ministry</li>\n<li>The Blood Pact : does it really need to exist? Is it too Horcruxy?</li>\n<li>We revisit the Credence/Aurelius Dumbledore reveal! Do we buy it?</li>\n<li>What's next for Dumbledore in the Fantastic Beasts storyline?</li>\n<li>Quizzitch:  Ciaran Hinds, who portrays Aberforth Dumbledore in Harry Potter and the Deathly Hallows - Part 2, starred alongside fellow Potter alums Gary Oldman, Toby Jones and John Hurt in the film adaptation of this novel by John le Carre, what is the name of the movie? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (Get 20% off your first purchase) and <a href=\"http://getquip.com/muggle5\">Quip</a> (Try their new mouthwash today!).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! On this month's Bonus MuggleCast, we talk about our favorite Jude Law Dumbledore moments from Crimes of Grindelwald!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 13 Jul 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-12:/posts/7903242",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}