{
  "id": "yt:video:TDAXW0iAIQo",
  "yt:videoId": "TDAXW0iAIQo",
  "yt:channelId": "UCaay7_gi9Fq6WwWopuYHpug",
  "title": "The Magic of a Rolling Wheel",
  "link": "",
  "author": {
    "name": "All Things Physics",
    "uri": "https://www.youtube.com/channel/UCaay7_gi9Fq6WwWopuYHpug"
  },
  "published": "2021-12-21T18:54:05+00:00",
  "updated": "2022-07-22T08:44:41+00:00",
  "media:group": {
    "media:title": "The Magic of a Rolling Wheel",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video takes an in-depth look at a rolling wheel, and demonstrates that the point on the wheel that's in contact with the ground is instantaneously at rest.  In addition, this point acts as the instantaneous center of rotation, which means that all points on the wheel are (instantaneously) rotating about the point in contact with the ground.  In my opinion, the fact that the contact point is the instantaneous center of rotation is probably the most interesting aspect of a rolling wheel.  And of course, if you're going to talk about a rolling wheel, it would be criminal not to mention that the path of a point on the periphery of wheel traces out a cycloid.\n\nSpecial thanks to my partner in crime, Marc Renault, for helping get the video footage of a speeding car.  Thanks also to Jonathan Barrick, for making the beautiful wheel, and to Noah Lape for helping record the intro/outro clips.\n\nMusic credit for the car scene:\nStock Media provided by AudioSphere / Pond5\n\nBackground music for the rest of the video:\nMusic by Vincent Rubinetti\nDownload the music on Bandcamp:\nhttps://vincerubinetti.bandcamp.com/album/the-music-of-3blue1brown\nStream the music on Spotify:\nhttps://open.spotify.com/album/1dVyjwS8FBqXhRunaG5W5u\n\nThe wheel graphic was adapted from https://github.com/sparshg/animations, and was used in a similar rolling motion video at https://youtu.be/PWvIYU_Z8z8.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}