{
  "id": "yt:video:whs9-is6Pjc",
  "yt:videoId": "whs9-is6Pjc",
  "yt:channelId": "UCRCPQvTs96frBB8X5eGVE4w",
  "title": "Egyptian Arabic: Easy Stories With English Translations is now available [Paperback]",
  "link": "",
  "author": {
    "name": "The Mezzofanti Guild",
    "uri": "https://www.youtube.com/channel/UCRCPQvTs96frBB8X5eGVE4w"
  },
  "published": "2019-03-22T00:36:38+00:00",
  "updated": "2022-06-22T22:06:20+00:00",
  "media:group": {
    "media:title": "Egyptian Arabic: Easy Stories With English Translations is now available [Paperback]",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Egyptian Arabic: Easy Stories With English Translations available here: https://amzn.to/2TjQgAk\nPage sample images here: https://www.talkinarabic.com/egyptian-arabic-short-stories/\n\nThe first paperback edition of our new series called Egyptian Arabic: Easy Stories With English Translations is up now on Amazon. It consists of 12 mini stories in colloquial Egyptian that incrementally rise in length and difficulty.\n\nHere’s what you’ll find in the book:\n\n* 12 mini stories on various focus topics, full of high-frequency vocabulary and expressions pertaining to those topics.\n* Stories that incrementally rise in length and difficulty.\n* Each story has a comprehension exercise section at the end of the chapter.\n* Key vocabulary lists for each story (most of the main vocab used throughout the story).\n* Full English translations in the back of the book (away from the Arabic so you’re not tempted by it).\n* Large, clear font and moderate use of tashkeel (vowel markings) to improve readability for lower-level learners.\n* All dialogues are bolded so they’re easy to distinguish.\n* Lined, note-taking sections.\n\nI really need to emphasize that this book is NOT for absolute beginners. If you’ve never studied Arabic before then I’d advise coming back to this later on.\n\nSince it’s a first edition and a totally new venture for us, I’d love to hear your thoughts and feedback on the book.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}