{
  "title": "S1E60 - It's Only Gymnastics with Olympic Gold Medalist Coach Cecile Landi",
  "guid": "https://pinecast.com/guid/d19167f7-b7fb-4d77-9ce9-17daf52ae6d0",
  "pubDate": "Thu, 07 Apr 2022 06:30:00 -0000",
  "itunes:duration": "00:55:29",
  "description": "<p>You may know today’s guest Cecile Landi as Simone Biles’ coach or for coaching multiple gymnasts to Olympic medals, World Championship titles, and numerous full-ride scholarships to D1 schools. What you might not know is that Cecile was an Olympian herself; she claims to have been a late-bloomer, but once she made the French Senior National Gymnastics team at fifteen, there was no stopping her. Cecile competed at three European Championships, three World Championships, and the 1996 Olympic Games. She’s always up for a challenge and constantly wants to be pushed to the next level in everything she does, yet manages to maintain her calm throughout it all. Today, she walks us through her journey from gymnast to coach and how she and her husband Laurent make an unstoppable coaching duo. She also discusses the difficult time during the Tokyo Olympics last summer and the beautiful silver lining that came from it.</p>\n<p>Cecile starts the episode with her story of growing up in gymnastics, telling her parents at age seven that she wanted to be an Olympian, and getting invited to the National Team Training Center at age nine. She discusses her transition from not being the hardest worker to deciding she wanted to be pushed to be better and how that let her break through to the Senior National Gymnastics Team. Cecile then gives an insight into her competitive experience, describing her favorite memories of going to her first World Championships and to the 1996 Olympics in Atlanta, before moving on to describe how she decided to continue with gymnastics at the club level following her Olympics experience. She follows that up with the story of how she got into coaching and moved to the US, how she and Laurent balance their professional partnership and their marriage, and their journey to coaching at the elite level, a journey that brought them an amazing opportunity. Cecile and Laurent were on a break from coaching and in the process of buying their own gym when they got a remarkable offer—to coach record-breaking gymnast Simone Biles at the 2021 Tokyo Olympics. Cecile discusses how the couple couldn’t turn down the opportunity, how she coped with the pressure of training a superstar, and the impact of the pandemic on their preparations. She also goes into detail about what happened when Simone began experiencing the twisties, including how they dealt with the fallout and put together a beam routine that would win Simone and Team USA a bronze medal. And finally, Cecile discusses her latest success, winning level ten in Texas, and gives her trademark advice to other coaches—be there for your athletes and remember that it’s only gymnastics and the sun will rise tomorrow.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Cecile’s experience growing up in gymnastics</li>\n<li>Breaking through to the national team</li>\n<li>Cecile’s most memorable experiences at the national level</li>\n<li>Going to the ’96 Olympics</li>\n<li>Choosing to continue in the club world</li>\n<li>Becoming a coach</li>\n<li>Moving to the US with Laurent</li>\n<li>Coaching at the World Olympic Gymnastics Academy</li>\n<li>How Cecile and Laurent work together and maintain their marriage</li>\n<li>Stepping up to coaching elite athletes</li>\n<li>Taking a break in 2017</li>\n<li>Getting the call from Simone Biles</li>\n<li>Coaching Simone and coping with pressure</li>\n<li>The impact of the pandemic on training</li>\n<li>What happened at the Tokyo Games</li>\n<li>Dealing with the fallout of Simone’s decision</li>\n<li>Figuring out the medal-winning beam routine</li>\n<li>Winning level ten in Texas</li>\n<li>Cecile’s advice for other coaches</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“I started when I was five. And it was just one club in my city of 40,000 people. And I just started because my sister started. She’s three years older than me. And by the age of nine, doing some little competition, I ended up being invited to the national team training center.”</li>\n<li>“I didn’t feel pushed. And I wanted to feel it. So we had a couple of Chinese coaches that were there. And they had the best kids. And I wanted my chance to be there. And most of the people there were like, 'I don’t think you’re going to survive. I don’t think you’re strong enough to do it.' And actually, it helps me. When someone tells me I can’t do it, I’m going to prove to you that I can.”</li>\n<li>“When I was younger, I wanted to be a nurse like my mom. And then she told me really early on, 'Don’t do it, it’s too hard, you don’t make money, you work too much.' And I look at her now and say, 'Look what I do. I work way too much. I don’t make a lot of money. And I’m not a nurse.'”</li>\n<li>“I have a lot more respect for my coaches and anyone who coaches because it does not get any easier as the years go on. It’s just, it’s a hard job. It’s a hard job. Sometimes, a lot of people think it’s a hobby. It’s more than that. It has to be more than that.”</li>\n<li>“Year by year, we just kept working. Kept working with the girls, and they were just learning so fast. And they followed our leads and the process and trusted that we had the best interest for them. And it just worked out.”</li>\n<li>“We went back to Dallas, and we looked at each other, we’re like, man, we can’t pass this opportunity. We can always open a gym later. But working with the most talented athlete I’ve ever seen in my life, it’s not going to happen again.”</li>\n<li>“The pressure for us was toward her, we didn’t want to disappoint her. We wanted to make sure she got the chance that she deserved. And other than that, I didn’t really care what anyone else was saying. You’re not in my shoes, and I do know that I’m doing the best that I can to help her. And as long as she knows that, then the rest doesn’t matter.”</li>\n<li>“The pandemic had been such a mental struggle for everybody, but nobody wanted to talk about it. And I think she was the one who said, ‘Hey, I’m not okay. And it’s okay to not be okay. And I’m struggling.’”</li>\n<li>“We started training, and something was said by our national team staff that she took wrong. And her demeanor changed. And I saw that pressure on her shoulders even showing up more, and she was not practicing as well. And that’s when she started having her first case of the twisties on the floor.”</li>\n<li>“She looked at me, she looked really good. I was pretty confident that, you know, she was okay. But she said as soon as she stepped into the arena and the lights, something just clicked, and she just lost her confidence in everything, and she started panicking, but didn’t want to say anything, so went for the vault.”</li>\n<li>“She said, ‘Those girls, they need a medal, they deserve a medal, and they will get a medal without me. If I compete, we’re done.’”</li>\n<li>“In a sport like gymnastics where, like you said, you’re landing on a hard surface, and if you don’t know right side up from upside down, and you land on your head, you break your neck, like this could be it, you know, like, like life-altering, ending.”</li>\n<li>“Understanding what she couldn’t do in that moment, to say she couldn’t compete, I feel like was a very impressive thing to do. I’m actually really, really impressed by that choice that she made. I think that was really smart. But it had to be excruciatingly hard.”</li>\n<li>“When she hit that dismount, that was just, the relief, like, she did it, she’s safe, she competed the way she wanted to compete. She proved to herself that she could do it, and it’s going to help her on the healing process. For me, that was what was important. It was, I know if she can do this, it’s going to help her.”</li>\n<li>“Time will tell what she decides to do. We told her, if you come back again, it has to be for you. Can’t be for us, can’t be for anyone else but yourself. And we’ll be here if you want us to be.”</li>\n<li>“Even if it’s an individual sport, they’ve noticed that they only get better if the team is better. And so that’s why, really, we want them to understand, the stronger your team is, the stronger you’re going to be.”</li>\n<li>“At the end of the day, you are here for the athletes. They’re not here for you. You’re here for them. It’s your job to figure out how you can help them become their best. And the sun will rise tomorrow. It’s only gymnastics. It’s going to be okay if today is not perfect.”</li>\n</ul>\n<p><strong><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a><a href=\"https://kaatsu.com/\" rel=\"nofollow\">.</a></strong></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Cecile's Social Media:\n<a href=\"https://www.instagram.com/cecilelandi/\" rel=\"nofollow\">Cecile's Instagram</a>\n<a href=\"https://twitter.com/CLcecile\" rel=\"nofollow\">Cecile's Twitter</a></p>",
  "itunes:title": "It's Only Gymnastics with Olympic Gold Medalist Coach Cecile Landi",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 60
}