{
  "title": "Remarks by President-Elect Sally Kornbluth to the MIT community",
  "link": "https://news.mit.edu/2022/kornbluth-remarks-community-1020",
  "description": "MIT's 18th president greeted community members at an event held on campus and online.",
  "pubDate": "Thu, 20 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/kornbluth-remarks-community-1020",
  "dc:creator": "MIT News Office",
  "content:encoded": "<p><em>The following remarks were given by President-Elect&nbsp;Sally Kornbluth to a gathering of community members in room 10-250 on Thursday, Oct. 20.</em></p>\n\n<p></p>\n\n<p>Thank you, Madam Chair, for the warm introduction. And thank you also for the careful and thorough way that you led the search process, and for the outstanding questions you and your colleagues posed. (It’s always a good sign when you leave a job interview wanting the job even more!)</p>\n\n<p></p>\n\n<p>I was so impressed by John Jarve and all of the Presidential Search Committee, who inspired me to see the world of opportunities ahead for the Institute. And of course, I could not be more grateful to the Executive Committee, and all the members of the MIT Corporation, for trusting me with the profound responsibility of leading MIT.</p>\n\n<p></p>\n\n<p>To President and Mrs. Reif: Thank you so much for welcoming my family and me with such warmth and graciousness.</p>\n\n<p></p>\n\n<p>And a big hello to the entire MIT community: To all of you here in the room and online – students, staff, post-docs, faculty, alumni – as well as our Cambridge neighbors!</p>\n\n<p></p>\n\n<p>#</p>\n\n<p></p>\n\n<p>As anyone knows who has ever held a major leadership role, it would be impossible to do the job without great support from your family. In my case, that’s my husband, Danny, a superb scientist and always my greatest constructive critic and sounding board, and our two children.</p>\n\n<p></p>\n\n<p>But the truth is, I’m here because of <em>one</em> other person who will never know it – the most transformative teacher of my life – the late Bill DeWitt. He was a biology professor at my undergraduate institution, Williams, and he taught a class that I only took because <em>I had to take some science to graduate</em>.</p>\n\n<p></p>\n\n<p>I was majoring in <em>political</em> science – and I desperately needed to fulfill my science distribution requirement. I wound up in his class on human biology and social issues – and for me,<br />\nit changed everything.</p>\n\n<p></p>\n\n<p>As a poli-sci major, I should have been drawn to the “social issues” side of the class. But suddenly – because of Bill’s brilliant gifts as a teacher – I found myself fascinated by how cells function<em>.</em> I signed up for every biology class I could possibly cram in before I graduated, including an amazing course during winter study, which is similar to IAP here at MIT. And I wound up getting a fellowship to study genetics at Cambridge. (This time, when I say “Cambridge,” I mean the <em>other</em> Cambridge!)</p>\n\n<p></p>\n\n<p>Those two years in England introduced me to the subjects and intellectual obsessions that would define my career. Not incidentally, they also introduced me to Danny. And they set me on the path that has brought me to the doorstep of MIT.</p>\n\n<p></p>\n\n<p>So for all of you out there who are teachers – from graduate students to senior faculty – never underestimate your impact. It’s amazing what can blossom when you sow the seeds of curiosity and inspiration!</p>\n\n<p></p>\n\n<p>#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #</p>\n\n<p>Though I grew up in the Northeast, living in North Carolina for nearly 30 years has given me a real appreciation for Southern hospitality. But I have to tell you: The warmth and welcome I’ve received from all of you at MIT has been incredible.</p>\n\n<p></p>\n\n<p>Of course, this is not my first time on the MIT campus. And each time, I’ve gotten a glimpse of what makes MIT so remarkable.</p>\n\n<p>I have been here several times as an MIT parent, so I got to have a close look at one slice of the intense world of MIT research, as well as a sense of the amazing creative energy of your grad students and post-docs.</p>\n\n<p></p>\n\n<p>Before that, I came once as part of a small herd of visiting provosts. I’ll never forget looking out the window on the grand space of Killian Court to see a huge crowd of students making what looked like – go-karts? – or maybe catapults? (I’m told I will come to know this delightful phenomenon as “2.009.” MIT education at its hands-on best!)</p>\n\n<p></p>\n\n<p>And here, as your president-elect, II see the most important thing of all: this remarkable creative community.</p>\n\n<p></p>\n\n<p>#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #</p>\n\n<p>I have really loved my life and my many roles at Duke. I had lots of reasons to stay, and no reason pushing me to leave. Which tells you the strength of the <em>pull</em> I felt, drawing me to MIT.</p>\n\n<p></p>\n\n<p>It was overwhelming, to see how much people loved the place and how proud they were to be a part of it. I’ve always felt that my greatest professional strength and pleasure are in enabling the success of other people. Who would not want to do that, for the best-of-the-best, here at MIT?</p>\n\n<p></p>\n\n<p>I wanted to be part of a place that celebrates new advances in science and technology the way some other schools celebrate a basketball game! 02139, the world capital of intellectual fun!</p>\n\n<p></p>\n\n<p>A place that faces hard problems with honesty and facts, and comes up with outstanding solutions, from MIT’s legendary Women in Science reports to the work you’re doing now<br />\nto develop shared principles on the vital importance of free expression.</p>\n\n<p></p>\n\n<p>I wanted to join a community that is leading the way on educational outreach and access – and that has a long, proud tradition of selecting for potential, not pedigree.</p>\n\n<p></p>\n\n<p>A community that brings together people from an incredible diversity of cultures and backgrounds – all of you brimming with curiosity and ingenuity, and united in your drive to<br />\nmake a difference.</p>\n\n<p></p>\n\n<p>And maybe above all, I was drawn here because I believe MIT is uniquely poised to harness the power of science and technology, all along the continuum from fundamental science to engineering innovations for society, and deeply enriched by the wisdom and inventive power of the humanities, the arts, the social sciences, management and design.</p>\n\n<p></p>\n\n<p>From climate change to pandemic disease to the ethical use of AI, this is a moment when humanity faces huge global problems – problems that urgently demand the attention of the world’s most skillful minds and hands.</p>\n\n<p></p>\n\n<p>In short, I believe this is <em>your</em> <em>moment</em> – and I couldn’t imagine a greater privilege than helping all of you seize its full potential.</p>\n\n<p></p>\n\n<p>#&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; #</p>\n\n<p></p>\n\n<p>My mother was an opera singer. And I am definitely not one!&nbsp; But back in college, I sang with an <em>a cappella</em> group, and it is still one of my greatest pleasures.</p>\n\n<p></p>\n\n<p>One thing that experience has taught me: It’s exciting to sing solo, and to take responsibility for leading the performance. But the most exhilarating feeling in the world is <em>close harmony</em> – those moments when all your voices come together, to make something wonderful that none of you could make alone.&nbsp;</p>\n\n<p></p>\n\n<p><em>That</em> is the spirit I want to bring to my leadership of MIT.&nbsp; And I can’t wait to get started.</p>\n\n<p></p>\n\n<p>Thank you so much!</p>\n\n<p></p>",
  "media:content": {
    "media:description": "President-Elect Sally Kornbluth speaks to the MIT community on Thursday, Oct. 20.",
    "media:credit": "Photo: M. Scott Brauer"
  },
  "category": [
    "Special events and guest speakers",
    "Community",
    "Students",
    "Faculty",
    "Staff",
    "Administration",
    "MIT Corporation",
    "President Sally Kornbluth"
  ]
}