{
  "id": "yt:video:JhNrMgT90lA",
  "yt:videoId": "JhNrMgT90lA",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "The battle for Milwaukee’s black vote | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-10-24T16:00:10+00:00",
  "updated": "2022-10-25T13:39:42+00:00",
  "media:group": {
    "media:title": "The battle for Milwaukee’s black vote | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Two years into Joe Biden's presidency, the rift between the political camps in the US remains deep. Now midterm elections are around the corner. The Republican Party is confident, while the Democrats fear they'll lose ground – including in Wisconsin.\n\nTwo years ago, Joe Biden won the presidential election - now voters are giving him and his Democratic Party an interim report card. In the midterms on November 8, a new House of Representatives will be elected, along with one-third of the Senate. In the city of Milwaukee, Wisconsin the political wind have shifted of late. Many voters there have grown disenchanted with President Biden's policies. That's also true for Milwaukee's Black community, which played a decisive role in the outcome of the 2020 elections. That's why campaign managers of both parties have ramped up their efforts to win over the city's African American voters. A report by Sumi Somaskanda.\n\n#documentary #dwdocumentary #midterms2022 #blackcommunity \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}