{
  "title": "SC EP:537 Do Not Point A Weapon At These Things",
  "itunes:title": "SC EP:537 Do Not Point A Weapon At These Things",
  "pubDate": "Sat, 27 Apr 2019 07:03:27 +0000",
  "guid": "gid://art19-episode-locator/V0/uR-MhvUABS5aHAGv-S0tfJU3gIxnn5Ll78LIjEW2SLs",
  "link": "https://traffic.libsyn.com/secure/sasquatchchronicles/53720FINAL.mp3",
  "itunes:image": "",
  "description": "<p>Dylan writes \"Wes, I want to tell you about an experience that I had with Bigfoot around Lena Lake in Washington state in the Olympic National Park.</p> <p>It was during a camping trip that I had with my dad and the interaction occurred while we were sleeping in our hammocks. We both awoke to what I first assumed was a bear because of the breathing noise it made. It wasn't until I looked through the gap in my tarp that I realized that the creature was standing and had arms. This camping trip was cut a little short because of some other concerns that we had while we were hiking. My dad and I only spoke once about this the next morning and after he told me that he was convinced that we had a bear problem I decided not to tell him what I saw.</p> <p>Shoot me an email if you'd like to hear more about the experience and why we decided to cut our trip short. To this day I haven't told anyone about the encounter because I've always thought of Bigfoot as a dumb joke and I never wanted to sound like a hypocrite to my friends.\"</p> <p> </p> <p>My second guest is Joe. Joe writes \"Hi Wes, I’m from Ohio. I’m a huge fan of your show and I have been wrestling with the idea of mailing you and telling my story. But I guess if I’m going to tell anyone (outside my family) it would be you.</p> <p>Im an avid outdoorsman and have been spending as much time in the woods hunting, fishing, and hiking since I was six years old. My brother and I started out as our fathers hunting dogs, tromping on brush piles kicking up rabbits and pheasant for our dad and I’ve been hooked ever since. My Bigfoot story starts a few years back when we started hunting a new lease. Our second season in, It started out with hearing what sounded like someone talking far off in the woods , but you just couldn’t make it out. Which seemed odd but there are some(not many) but some people who live around the area. I brushed it off the first time, then a few days later my brother and I went hunting again and I heard the same thing, I was beginning to wonder what it was and was going to tell my brother about it, but I didn’t have to say anything to him. When I came out of the woods that evening he meet me at the truck and the first thing he said was “did you hear those people talking?” Not wanting to tip my hand I said I thought I did but couldn’t make it out,,, and he said “yeah same here. But it got kinda close and it was like they were talking gibberish!” That ride home was spent talking about what we both heard and then I introduced him to ur show. He wasn’t sure what he wanted to believe but he was about to get on board really soon. We both hunt pretty often and two weeks later we had both been to the woods multiple times and each had a few more “odd” things go on. A few more talking episodes a whoop or two a rock clacking incident, a few weird things but nothing that was definitively anything.</p> <p>All could possibly be explained away essentially. Then one morning about 3weeks after the initial incidents I had a work commitment and couldn’t join my brother in the woods. At about 530-6 in the morning I get a call from my brother, hoping nothing went wrong as I knew he’d be walking into his stand I answered and he immediately sounded upset. After a few minutes of calming him down, I finally got it out of him that something had “screamed at him as he was almost to his stand”. My brother is a tough guy, always was the bigger brother, my protector. And I had never heard him sound as scared as he was in that call. He told me it was like nothing he had ever heard before, it sounded like it was wanting to rip him apart he said. He also said there was something that sounded like grunting and growling together after the screaming, he said he could feel it shaking in his chest. He wanted to run, and hide all at the same time. He chose getting up in his stand and waiting on the sun to rise. He called me from his stand. He made me stay on the phone with him until he was ready to walk out.. I should probably mention that this is taking place in mid October. Ohio’s hunting season starts the last weekend of sept and my second time in the stand(which was day two of the season) is when this all began. It had been a pretty wet year so the majority of the leaves and foliage were still hanging on. My brothers stand was in a pretty thick area of our property. So as I tried to keep him calm and quiet and have him listen for things moving around him. Suddenly as we were on the phone he heard something and shushed me and said he thought he heard something. It was approaching that point in the morning when the woods seem to suddenly appear b4 ur eyes, that special morning time. Suddenly he panicked and said something exploded out of some brush about 75yds away and sounded like a freight train going thru the woods,, luckily going away from him and not towards the car. He waited till he couldn’t hear anything else and high tailed it outta there. A few days later after the shock of it all kinda subsided we went back to our land and tried to find some signs of the thing. Other than a few broken branches there wasn’t much and needless to say my brother, who I credited for even going back, wasn’t wanting to stay real long. So we got his stand and left the area.</p> <p>We stayed outta the woods for a few days, but the rut was about to start and we couldn’t stay away forever. We’re just to big of hunters and as I was thinking about it and discussing it, my brother and I convinced ourselves that if whatever made those screams wanted to hurt him it could have done whatever it wanted. It was probably just a warning. So we decided to give whatever it was that side of the property and we’d move to another part of the lease and just be careful. So back to the woods we went. A few hunts later, about a week or so, I was in my stand enjoying a beautiful afternoon. Now the woods at this time end of October early November are starting to thin out a little bit. It was one of those days when a strong breeze makes it look like it’s snowing leaves. It was about the last hour or two of the day when I heard it again,, the chatter. Only this time it was a little higher pitched than I remembered. I was on full alert at this point, then I started to hear something that sounded like it was approaching,, but it just didn’t sound right.. now my stand sits on top of ridge there’s about 30yds of flat(that is loaded with oaks) then it goes into valleys on either side. On my left which is the side my stand is on,, on the hillside there is two natural shelves one about 20ish yds down (which by the way the bucks love to cruise and scent check) and another about 50-60yds down. I can always see the closer shelf but the further one down is hard to see because of all the brush. But I do have two shooting lanes cut down there for gun season. Anyway just laying out what I’m looking at. So like said I could hear something coming my way but sounded weird. As I’m studying the woods the chatter and sounds start to become clearer. The chatter sounded like two monkeys chitchatting and the sounds seemed to be coming from the up in the trees and something walking on the ground. Suddenly I swore I could see the trees moving out in front of me to left. And it seemed as soon as I thought I was seeing that, I heard a noise I never heard in my life. It was like a grunt and huff and deep bark all rolled into one. And after that everything went silent. It was eerily quiet, no sound no movement nothing. Sat for what seemed like an eternity, probably two minutes lol,, but then the wind started moving and as a bigger gust came along the leaves began snowing again and I heard it again only in two tsk tsk sounds and at that point I heard some limbs breaking and what sounded like two tree stumps landed with two distinct thuds and was followed by two clearly running down the hill sounds. I never saw what made that noise but definitely sounded like two separate things running away and wasn’t bounding away like deer or anything else in the woods I had ever heard b4. Those ended kinda quickly. After the initial shock of that my attention immediately turned to what made the deeper grunts and tsk sounds. It sound like it came from the lower shelf but out in front of me. I studied and studied the woods for anything!! Any sort of something wrong in the woods, any sound any movement anything. Then the usually bane of my existence in the woods, the squirrels that seem to constantly run all around my stand came again. One of those furry bastards came from the other side of the flat and started down the other side towards the sounds.</p> <p>I was looking at the squirrel,, staring in the direction of the noises when suddenly the squirrel, which had got pretty close to where I thought the sounds came from, shot up a tree and immediately began barking his head off. As I again began studying the woods I caught the slightest movement.. a movement that changed my life. I finally remembered I took my crossbow that day instead of my usual compound, so I slowly raised and looked through my scope and saw it. A hand, just a hand that was wrapped around a big oak holding on. I stared at it and stared. Not believing it at first I looked off the scope blinking and looked again and it moved. Repositioning itself very slowly and methodically. I stared into that scope looking on both sides of that tree looking for what that hand was attached to. When suddenly very slowly and methodically a face began to creep around the tree looking directly at me. I was frozen and knew that she was looking at me and immediately knew by her expression that she knew I was seeing her. She looked panicked for a split second then immediately withdrew her face. At this point I’m in a state of disbelief not believing what my eyes just saw. It was dark skinned and had longer hair hanging down on the face but not very much hair on the face. I continue to stare down at the tree. When she moved her face back she also pulled her hand back. I sat there looking intently for what I instantly knew what I had saw. There was no mistaking it. Finally the long wait was interrupted by a loud clacking sound. Like someone taking two rocks and banging them together rapidly. It came in three quick bursts and was followed by a quick higher pitched whistle. This definitely got my and the attention of the mother that was below me. She made a sound like she was shushing the little ones down the hill. Or what I assume was the little ones. She then peeked her head out from behind the tree and was looking at me again. I instinctively lifted my bow and looked down at her and her face had taken on new much more fierce and clearly was not happy I was there and I assume wasn’t happy I was so close to her and her babies.</p> <p>She then stepped from one tree to another,, to another every few minutes whenever the leaves would start falling heavy again. I’d catch glimpses of her and see her for a second or so. she was about 7ft tall and had a bigger but still somehow lean build. I could see breasts on her, which is why I keep calling her mom. Another long pause with her outta sight, but I knew she hadn’t left the area. The exact spot she was in she would’ve had to either drop down a weird drop off which I felt I woulda heard, go back the way she came, or cross thru one of my shooting lanes. I was scanning the area with my scope looking for anything and that’s when she stepped into the lane and turned to face me. she was about 80-100yds or so away, and when she did this I was looking at her through the scope and I regret doing that now. I don’t know if she took it as aggression but as she stopped and turned she stood there for a sec and then got into a (for lack of a better way of saying it) an aggressive stance and began to growl and show her teeth to me and took two or three steps towards me. I lowered my bow instantly and even went as far as to hang it up on my extendable hanger. As I did that she stopped gave me one more mean look and walked briskly away. I could hear her moving down the hill, I then heard a louder whistle and heard the two (I assume babies) start moving down the hill away from me. They cleared about 400yds of downhill in a matter of seconds and when I could barely hear them I heard a loud grunt and suddenly a giant pop and crashing. Sounded like a larger tree being pushed over and snapping. I felt very shaken and extremely unwelcome instantly. After the woods settled down for a second and I was able to shake the shock and shakes enough to climb down from my stand and made the walk back to the vehicle ASAP.</p> <p>On my way home I tried calling my brother but he and his fiancé were at a function and he wasn’t able to answer me, so I left him a message and just hoped he would call me back. He unfortunately didn’t and the next morning he went hunting and went down the hill and past where I heard the Bigfoot exit the area I wAs in the night b4. On his stand he finally took some time to check his voicemail and heard my abbreviated story and on his way out was intrigued, searched around for a lil bit, and saw a tree that was broken and fallen. I’ll include a picture he took of the tree. It’s a tree that for no other reason should have been broken or damaged, as it was a perfectly healthy tree and there were no storms or anything else that could have done what happened to this tree. It has been two years since this has happened and I and my family have still been hunting this land. We have been extra careful and have adopted a live and let live attitude about this property.</p> <p>I and my brother have each shot deer and left them as “presents” for the Bigfoot. We love this piece of land and we also have our children who we bring with us to hunt (but we never let them hunt alone) and we can’t help but be hunters and enthusiasts about the search for an unknown species. As we’ve hunted over the last few years we have both shot deer and have left them over night, only to find significant blood trails that lead to pools of blood, hair everywhere, but no deer. We looked on these as “peace offerings” and haven’t ever pushed the issue on finding these deer. We have always had an extra agenda on our minds, and we have had a few more experiences (also floating lights which we were able to get a pic of one) and “things” go on.. but nothing like what I saw that day. I believe that our land is more of a summer into fall location, bcuz as soon as our land loses its leaves and we get into full winter the activity drops off and as full winter hits we lose all activity. We are pretty close to the Tappan Lake region(like two miles or less) which has had its fair share of sightings and claims over the years. And is about 20miles from the famed salt fork state park. I am more than a believer, just like you Wes. I am “knower” that we as humans share this land with an unknown biped.</p> <p>I also believe that our government is definitely aware of these creatures and is actively protecting them, monitoring them, and possibly even protecting and possibly moving them as they see fit. I’ve saved this last bit for the ending of my message to you as it may be the most unexplainable part of my experiences. This past fall I was in my stand for another hunt when I heard a helicopter approaching. Odd, but not totally extraordinary. But as it came closer I could see the heli beginning to slow down about 3/4 to 1 mile away and began slowly circling a smaller in size area. Suddenly the chopper blades became extremely loud and making an odd but very loud, bum bum bum slow and steady sound as it circled and began lowering. As it started to drop out of sight all of a sudden there was no sound anymore!! Even though I could still see the heli for a few seconds b4 it dropped out of visuals. And when I say no sound I mean no sound whatsoever! Then there was about a 5min gap of zero sound from the area where I knew the helicopter had circled down.</p> <p>I was dumbfounded by all of this, and as u know 5mins in the woods can seem like a day when exciting things are going on. When all of a sudden the extremely loud bum bum bum erupted again and I saw the heli rise up from the same spot. It lasted for about 30 seconds as it slowly rose and circled again then the sound of regular chopper began again and the heli moved around behind and I lost sight of it, but could still hear it and even though I couldn’t see it the loud bum bum bum sounds came and went again where I couldn’t see it. Only this time I heard something else. As the loud noises came the second time I heard some loud huffs and smaller scream/whooping noises accompanied by crashing and what sounded like something throwing something big and some more crashing noises from out in front of me. For some “visuals”.... the heli came from my back and to the left to out in front of me to the left. It then circled back from the same way it came,,, my left and circled behind me to 45degrees to my rear right shoulder. The noises I heard came from in front of my right shoulder about 45degrees. Just so you can picture it...... Now my rational thought immediately tried to explain this away as maybe there was an emergency that an emergency rescue or life flight was being executed. That seems logical as there are boaters, hunters and outdoor enthusiasts in the area. So I began to research that. I have friends who work at the two closest hospitals that would and are able to accommodate life flights and they both looked into the matter and neither had any flights come in within a week b4 or after the date in which this happened. So I struck out to try and find another resident of the area that had heard or saw anything weird. It had been about 4-5 days since the incident and a few people had heard something weird but no one close to where I knew the heli had went down. The area I saw the noise come from was particularly weird. I knew there was a home pretty close to that area and so I went there to try and start a dialogue. I started out as “neighbor” who had just got permission to the neighboring property and was wanting some hunting and property line info. The man and woman were extremely nice and were more than willing to help. We chatted for a about 10mins when I started to put out there that I was hunting another property close by. At the first mention of that there demeanor instantly began to change. We had ventured about 100yds or so from their house as we were chatting. And as i saw their attitude change I immediately decided to drop the bomb on them.</p> <p>I said I was hunting and had saw a helicopter circling around close to their property and they immediately shut down!!! They started walking back to their house and I kept right with them and began asking every question I could about seeing it hearing it, what they saw and everything else I could. They didn’t answer a single question. They just kept saying they didn’t know what I was talking about and were actively trying to get away from me. I went as far as sticking my foot in the door to keep them from shutting it in my face. The last thing I heard from these people was “we didn’t see anything, and if we did we wouldn’t tell you!!!” This obviously piqued my interest quite a bit. But I’ve yet to get any farther with anyone else around the area either....??? So Wes that’s my long story. Sorry for the lengthy message but as I was writing you it just kept coming out, and believe it or not I’ve left out some stuff. If you’d like to chat I’d be happy to, if not I understand. I’m sure you get a lot of people that contact you. Im just happy that there is someone like you who does what you do and helps people out as much as you do. You truly are a much needed outlet for people like us who come away from these encounters and “strange things” not knowing what or how to feel or deal with the stress of it all. Thanks again Wes have a great week.\"</p>",
  "content:encoded": "<p>Dylan writes \"Wes, I want to tell you about an experience that I had with Bigfoot around Lena Lake in Washington state in the Olympic National Park.</p> <p>It was during a camping trip that I had with my dad and the interaction occurred while we were sleeping in our hammocks. We both awoke to what I first assumed was a bear because of the breathing noise it made. It wasn't until I looked through the gap in my tarp that I realized that the creature was standing and had arms. This camping trip was cut a little short because of some other concerns that we had while we were hiking. My dad and I only spoke once about this the next morning and after he told me that he was convinced that we had a bear problem I decided not to tell him what I saw.</p> <p>Shoot me an email if you'd like to hear more about the experience and why we decided to cut our trip short. To this day I haven't told anyone about the encounter because I've always thought of Bigfoot as a dumb joke and I never wanted to sound like a hypocrite to my friends.\"</p> <p> </p> <p>My second guest is Joe. Joe writes \"Hi Wes, I’m from Ohio. I’m a huge fan of your show and I have been wrestling with the idea of mailing you and telling my story. But I guess if I’m going to tell anyone (outside my family) it would be you.</p> <p>Im an avid outdoorsman and have been spending as much time in the woods hunting, fishing, and hiking since I was six years old. My brother and I started out as our fathers hunting dogs, tromping on brush piles kicking up rabbits and pheasant for our dad and I’ve been hooked ever since. My Bigfoot story starts a few years back when we started hunting a new lease. Our second season in, It started out with hearing what sounded like someone talking far off in the woods , but you just couldn’t make it out. Which seemed odd but there are some(not many) but some people who live around the area. I brushed it off the first time, then a few days later my brother and I went hunting again and I heard the same thing, I was beginning to wonder what it was and was going to tell my brother about it, but I didn’t have to say anything to him. When I came out of the woods that evening he meet me at the truck and the first thing he said was “did you hear those people talking?” Not wanting to tip my hand I said I thought I did but couldn’t make it out,,, and he said “yeah same here. But it got kinda close and it was like they were talking gibberish!” That ride home was spent talking about what we both heard and then I introduced him to ur show. He wasn’t sure what he wanted to believe but he was about to get on board really soon. We both hunt pretty often and two weeks later we had both been to the woods multiple times and each had a few more “odd” things go on. A few more talking episodes a whoop or two a rock clacking incident, a few weird things but nothing that was definitively anything.</p> <p>All could possibly be explained away essentially. Then one morning about 3weeks after the initial incidents I had a work commitment and couldn’t join my brother in the woods. At about 530-6 in the morning I get a call from my brother, hoping nothing went wrong as I knew he’d be walking into his stand I answered and he immediately sounded upset. After a few minutes of calming him down, I finally got it out of him that something had “screamed at him as he was almost to his stand”. My brother is a tough guy, always was the bigger brother, my protector. And I had never heard him sound as scared as he was in that call. He told me it was like nothing he had ever heard before, it sounded like it was wanting to rip him apart he said. He also said there was something that sounded like grunting and growling together after the screaming, he said he could feel it shaking in his chest. He wanted to run, and hide all at the same time. He chose getting up in his stand and waiting on the sun to rise. He called me from his stand. He made me stay on the phone with him until he was ready to walk out.. I should probably mention that this is taking place in mid October. Ohio’s hunting season starts the last weekend of sept and my second time in the stand(which was day two of the season) is when this all began. It had been a pretty wet year so the majority of the leaves and foliage were still hanging on. My brothers stand was in a pretty thick area of our property. So as I tried to keep him calm and quiet and have him listen for things moving around him. Suddenly as we were on the phone he heard something and shushed me and said he thought he heard something. It was approaching that point in the morning when the woods seem to suddenly appear b4 ur eyes, that special morning time. Suddenly he panicked and said something exploded out of some brush about 75yds away and sounded like a freight train going thru the woods,, luckily going away from him and not towards the car. He waited till he couldn’t hear anything else and high tailed it outta there. A few days later after the shock of it all kinda subsided we went back to our land and tried to find some signs of the thing. Other than a few broken branches there wasn’t much and needless to say my brother, who I credited for even going back, wasn’t wanting to stay real long. So we got his stand and left the area.</p> <p>We stayed outta the woods for a few days, but the rut was about to start and we couldn’t stay away forever. We’re just to big of hunters and as I was thinking about it and discussing it, my brother and I convinced ourselves that if whatever made those screams wanted to hurt him it could have done whatever it wanted. It was probably just a warning. So we decided to give whatever it was that side of the property and we’d move to another part of the lease and just be careful. So back to the woods we went. A few hunts later, about a week or so, I was in my stand enjoying a beautiful afternoon. Now the woods at this time end of October early November are starting to thin out a little bit. It was one of those days when a strong breeze makes it look like it’s snowing leaves. It was about the last hour or two of the day when I heard it again,, the chatter. Only this time it was a little higher pitched than I remembered. I was on full alert at this point, then I started to hear something that sounded like it was approaching,, but it just didn’t sound right.. now my stand sits on top of ridge there’s about 30yds of flat(that is loaded with oaks) then it goes into valleys on either side. On my left which is the side my stand is on,, on the hillside there is two natural shelves one about 20ish yds down (which by the way the bucks love to cruise and scent check) and another about 50-60yds down. I can always see the closer shelf but the further one down is hard to see because of all the brush. But I do have two shooting lanes cut down there for gun season. Anyway just laying out what I’m looking at. So like said I could hear something coming my way but sounded weird. As I’m studying the woods the chatter and sounds start to become clearer. The chatter sounded like two monkeys chitchatting and the sounds seemed to be coming from the up in the trees and something walking on the ground. Suddenly I swore I could see the trees moving out in front of me to left. And it seemed as soon as I thought I was seeing that, I heard a noise I never heard in my life. It was like a grunt and huff and deep bark all rolled into one. And after that everything went silent. It was eerily quiet, no sound no movement nothing. Sat for what seemed like an eternity, probably two minutes lol,, but then the wind started moving and as a bigger gust came along the leaves began snowing again and I heard it again only in two tsk tsk sounds and at that point I heard some limbs breaking and what sounded like two tree stumps landed with two distinct thuds and was followed by two clearly running down the hill sounds. I never saw what made that noise but definitely sounded like two separate things running away and wasn’t bounding away like deer or anything else in the woods I had ever heard b4. Those ended kinda quickly. After the initial shock of that my attention immediately turned to what made the deeper grunts and tsk sounds. It sound like it came from the lower shelf but out in front of me. I studied and studied the woods for anything!! Any sort of something wrong in the woods, any sound any movement anything. Then the usually bane of my existence in the woods, the squirrels that seem to constantly run all around my stand came again. One of those furry bastards came from the other side of the flat and started down the other side towards the sounds.</p> <p>I was looking at the squirrel,, staring in the direction of the noises when suddenly the squirrel, which had got pretty close to where I thought the sounds came from, shot up a tree and immediately began barking his head off. As I again began studying the woods I caught the slightest movement.. a movement that changed my life. I finally remembered I took my crossbow that day instead of my usual compound, so I slowly raised and looked through my scope and saw it. A hand, just a hand that was wrapped around a big oak holding on. I stared at it and stared. Not believing it at first I looked off the scope blinking and looked again and it moved. Repositioning itself very slowly and methodically. I stared into that scope looking on both sides of that tree looking for what that hand was attached to. When suddenly very slowly and methodically a face began to creep around the tree looking directly at me. I was frozen and knew that she was looking at me and immediately knew by her expression that she knew I was seeing her. She looked panicked for a split second then immediately withdrew her face. At this point I’m in a state of disbelief not believing what my eyes just saw. It was dark skinned and had longer hair hanging down on the face but not very much hair on the face. I continue to stare down at the tree. When she moved her face back she also pulled her hand back. I sat there looking intently for what I instantly knew what I had saw. There was no mistaking it. Finally the long wait was interrupted by a loud clacking sound. Like someone taking two rocks and banging them together rapidly. It came in three quick bursts and was followed by a quick higher pitched whistle. This definitely got my and the attention of the mother that was below me. She made a sound like she was shushing the little ones down the hill. Or what I assume was the little ones. She then peeked her head out from behind the tree and was looking at me again. I instinctively lifted my bow and looked down at her and her face had taken on new much more fierce and clearly was not happy I was there and I assume wasn’t happy I was so close to her and her babies.</p> <p>She then stepped from one tree to another,, to another every few minutes whenever the leaves would start falling heavy again. I’d catch glimpses of her and see her for a second or so. she was about 7ft tall and had a bigger but still somehow lean build. I could see breasts on her, which is why I keep calling her mom. Another long pause with her outta sight, but I knew she hadn’t left the area. The exact spot she was in she would’ve had to either drop down a weird drop off which I felt I woulda heard, go back the way she came, or cross thru one of my shooting lanes. I was scanning the area with my scope looking for anything and that’s when she stepped into the lane and turned to face me. she was about 80-100yds or so away, and when she did this I was looking at her through the scope and I regret doing that now. I don’t know if she took it as aggression but as she stopped and turned she stood there for a sec and then got into a (for lack of a better way of saying it) an aggressive stance and began to growl and show her teeth to me and took two or three steps towards me. I lowered my bow instantly and even went as far as to hang it up on my extendable hanger. As I did that she stopped gave me one more mean look and walked briskly away. I could hear her moving down the hill, I then heard a louder whistle and heard the two (I assume babies) start moving down the hill away from me. They cleared about 400yds of downhill in a matter of seconds and when I could barely hear them I heard a loud grunt and suddenly a giant pop and crashing. Sounded like a larger tree being pushed over and snapping. I felt very shaken and extremely unwelcome instantly. After the woods settled down for a second and I was able to shake the shock and shakes enough to climb down from my stand and made the walk back to the vehicle ASAP.</p> <p>On my way home I tried calling my brother but he and his fiancé were at a function and he wasn’t able to answer me, so I left him a message and just hoped he would call me back. He unfortunately didn’t and the next morning he went hunting and went down the hill and past where I heard the Bigfoot exit the area I wAs in the night b4. On his stand he finally took some time to check his voicemail and heard my abbreviated story and on his way out was intrigued, searched around for a lil bit, and saw a tree that was broken and fallen. I’ll include a picture he took of the tree. It’s a tree that for no other reason should have been broken or damaged, as it was a perfectly healthy tree and there were no storms or anything else that could have done what happened to this tree. It has been two years since this has happened and I and my family have still been hunting this land. We have been extra careful and have adopted a live and let live attitude about this property.</p> <p>I and my brother have each shot deer and left them as “presents” for the Bigfoot. We love this piece of land and we also have our children who we bring with us to hunt (but we never let them hunt alone) and we can’t help but be hunters and enthusiasts about the search for an unknown species. As we’ve hunted over the last few years we have both shot deer and have left them over night, only to find significant blood trails that lead to pools of blood, hair everywhere, but no deer. We looked on these as “peace offerings” and haven’t ever pushed the issue on finding these deer. We have always had an extra agenda on our minds, and we have had a few more experiences (also floating lights which we were able to get a pic of one) and “things” go on.. but nothing like what I saw that day. I believe that our land is more of a summer into fall location, bcuz as soon as our land loses its leaves and we get into full winter the activity drops off and as full winter hits we lose all activity. We are pretty close to the Tappan Lake region(like two miles or less) which has had its fair share of sightings and claims over the years. And is about 20miles from the famed salt fork state park. I am more than a believer, just like you Wes. I am “knower” that we as humans share this land with an unknown biped.</p> <p>I also believe that our government is definitely aware of these creatures and is actively protecting them, monitoring them, and possibly even protecting and possibly moving them as they see fit. I’ve saved this last bit for the ending of my message to you as it may be the most unexplainable part of my experiences. This past fall I was in my stand for another hunt when I heard a helicopter approaching. Odd, but not totally extraordinary. But as it came closer I could see the heli beginning to slow down about 3/4 to 1 mile away and began slowly circling a smaller in size area. Suddenly the chopper blades became extremely loud and making an odd but very loud, bum bum bum slow and steady sound as it circled and began lowering. As it started to drop out of sight all of a sudden there was no sound anymore!! Even though I could still see the heli for a few seconds b4 it dropped out of visuals. And when I say no sound I mean no sound whatsoever! Then there was about a 5min gap of zero sound from the area where I knew the helicopter had circled down.</p> <p>I was dumbfounded by all of this, and as u know 5mins in the woods can seem like a day when exciting things are going on. When all of a sudden the extremely loud bum bum bum erupted again and I saw the heli rise up from the same spot. It lasted for about 30 seconds as it slowly rose and circled again then the sound of regular chopper began again and the heli moved around behind and I lost sight of it, but could still hear it and even though I couldn’t see it the loud bum bum bum sounds came and went again where I couldn’t see it. Only this time I heard something else. As the loud noises came the second time I heard some loud huffs and smaller scream/whooping noises accompanied by crashing and what sounded like something throwing something big and some more crashing noises from out in front of me. For some “visuals”.... the heli came from my back and to the left to out in front of me to the left. It then circled back from the same way it came,,, my left and circled behind me to 45degrees to my rear right shoulder. The noises I heard came from in front of my right shoulder about 45degrees. Just so you can picture it...... Now my rational thought immediately tried to explain this away as maybe there was an emergency that an emergency rescue or life flight was being executed. That seems logical as there are boaters, hunters and outdoor enthusiasts in the area. So I began to research that. I have friends who work at the two closest hospitals that would and are able to accommodate life flights and they both looked into the matter and neither had any flights come in within a week b4 or after the date in which this happened. So I struck out to try and find another resident of the area that had heard or saw anything weird. It had been about 4-5 days since the incident and a few people had heard something weird but no one close to where I knew the heli had went down. The area I saw the noise come from was particularly weird. I knew there was a home pretty close to that area and so I went there to try and start a dialogue. I started out as “neighbor” who had just got permission to the neighboring property and was wanting some hunting and property line info. The man and woman were extremely nice and were more than willing to help. We chatted for a about 10mins when I started to put out there that I was hunting another property close by. At the first mention of that there demeanor instantly began to change. We had ventured about 100yds or so from their house as we were chatting. And as i saw their attitude change I immediately decided to drop the bomb on them.</p> <p>I said I was hunting and had saw a helicopter circling around close to their property and they immediately shut down!!! They started walking back to their house and I kept right with them and began asking every question I could about seeing it hearing it, what they saw and everything else I could. They didn’t answer a single question. They just kept saying they didn’t know what I was talking about and were actively trying to get away from me. I went as far as sticking my foot in the door to keep them from shutting it in my face. The last thing I heard from these people was “we didn’t see anything, and if we did we wouldn’t tell you!!!” This obviously piqued my interest quite a bit. But I’ve yet to get any farther with anyone else around the area either....??? So Wes that’s my long story. Sorry for the lengthy message but as I was writing you it just kept coming out, and believe it or not I’ve left out some stuff. If you’d like to chat I’d be happy to, if not I understand. I’m sure you get a lot of people that contact you. Im just happy that there is someone like you who does what you do and helps people out as much as you do. You truly are a much needed outlet for people like us who come away from these encounters and “strange things” not knowing what or how to feel or deal with the stress of it all. Thanks again Wes have a great week.\"</p>",
  "enclosure": "",
  "itunes:duration": "01:03:10",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "Dylan writes \"Wes, I want to tell you about an experience that I had with Bigfoot around Lena Lake in Washington state in the Olympic National Park. It was during a camping trip that I had with my dad and the interaction occurred while we were...",
  "itunes:episode": 537,
  "itunes:episodeType": "full"
}