{
  "title": "S14 Ep77: Supernatural News/Parashare: Storm The Castle Edition",
  "link": "https://audioboom.com/posts/8098553",
  "itunes:episode": 77,
  "itunes:title": "Supernatural News/Parashare: Storm The Castle Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5853,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS Storm The Castle Edition of Supernatural News & Parashare is available NOW!<br>\n<br>\nWe'll let you storm Area 51 this weekend, we might go see Downton Abbey!  We do bring you the stories this weekend of the Navy confirming videos of Unidentified Aerial Phenomena, Britain asks who should greet aliens if they land!, Brad Pitt talks about his religious beliefs and a monkey is loose in Texas!<br>\n<br>\nPLUS Your stories today on the best in paranormal talk radio! Beyond the Darkness<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nBombas’ has a new line of Merino Wool socks that are made from soft, warm, and naturally moisture-wicking merino wool, designed with all of Bombas’ classic comfort features.  Get 20 percent off your first purchase at <a href=\"http://Bombas.com/Darkness\">Bombas.com/Darkness</a>  .<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS Storm The Castle Edition of Supernatural News & Parashare is available NOW!\n\nWe'll let you storm Area 51 this weekend, we might go see Downton Abbey!  We do bring you the stories this weekend of the Navy confirming...",
  "pubDate": "Sat, 21 Sep 2019 08:00:00 +0000",
  "guid": "40ae921c-9d07-45f0-a0b6-cab5ec3f7ae0",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}