{
  "title": "From an Unapologetic Safety Regulator",
  "link": "https://conversableeconomist.com/2022/10/18/from-an-unapologetic-safety-regulator/",
  "dc:creator": "conversableeconomist",
  "pubDate": "Tue, 18 Oct 2022 19:22:57 +0000",
  "category": "Uncategorized",
  "guid": "https://conversableeconomist.com/?p=12963",
  "description": "<p>Consumers may want more safety from the products they buy than unfettered market competition provides. Sure, market forces allow for certain firms to build up a reputation for safety (or lack of it) over time. Moreover, lawsuits can punish firms for unsafe products. But these forces operate imperfectly. After all, an &#8220;unsafe&#8221; product may be &#8230; <a href=\"https://conversableeconomist.com/2022/10/18/from-an-unapologetic-safety-regulator/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">From an Unapologetic Safety Regulator</span></a></p>\n<p>The post <a href=\"https://conversableeconomist.com/2022/10/18/from-an-unapologetic-safety-regulator/\">From an Unapologetic Safety Regulator</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "content:encoded": "<p>Consumers may want more safety from the products they buy than unfettered market competition provides. Sure, market forces allow for certain firms to build up a reputation for safety (or lack of it) over time. Moreover, lawsuits can punish firms for unsafe products. But these forces operate imperfectly. After all, an &#8220;unsafe&#8221; product may be one that poses higher but not immediate risks, like when an electrical appliance is more likely to start a home fire and the stuffing in your future is more ignitable than you would have preferred. Also, the idea that reputation and lawsuits will provide an adequate level of safety  operate by first letting a sufficient number of accidents happen so that a pattern is broadly recognized and publicized.       It seems possible that a broad-scale effort in collecting information and looking patterns might at least in some cases accelerate the move to safer products </p>\n\n\n\n<p>The Consumer Product Safety Commission came into existence in 1972, and by 1973, Robert S. Adler was a special assistant to one of the original commissioners. Adler&#8217;s career moved between academia (research and teaching on business law at the University of North Carolina) and government (among other stops, counsel to the Subcommittee on Health and the Environment of the Committee on Energy and Commerce in the U.S. House of Representatives). But he eventually came full circle back to the CPSC, where he was a commissioner from 2009-2021 (and acting chair the last two years). As practitioner, student, and teacher of business regulation, he has walked the walk. He offers some lessons about his experiences in &#8220;Reflections of an Unapologetic Safety Regulator&#8221; (Regulatory Review, October 17, 2022). </p>\n\n\n\n<p>We&#8217;ve had the CPSC for 50 years now, and so we can observe some actual safety trends. Adler writes: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Similarly, in its almost 50 years of operation, the CPSC has <a href=\"https://www.cpsc.gov/Newsroom/News-Releases/2022/CPSC-Celebrates-50-Years-of-Making-Consumer-Safety-our-Mission\">seen</a> substantial declines in death and injury in the face of a growing population: 43 percent reduction in residential fires, 80 percent reduction in crib deaths, 88 percent decline in baby walker injuries, 80 percent reduction in child poisonings, 35 percent decline in bicycle injury rates, 55 percent decline in injuries from in-ground swimming pools, and the virtual elimination of child suffocations in refrigerators and fatalities from garage doors.</p>\n</blockquote>\n\n\n\n<p>It is of course theoretically possible that these sorts of declines would have happened just as quickly, or faster, without a CPSC&#8211;under pressure of reputation effects and lawsuits. This leads to what Adler calls the Great Safety Paradox: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Paradoxically, the more successful regulators are in protecting the public, the less anyone notices. This paradox occurs because well-crafted safety rules do not raise prices or interfere with products’ utility. In such cases, no one notices the improvement in safety. Most parents do not realize that the cribs they place their infants in no longer permit them to slip between the slats and strangle. Nor do they understand how much safer and less lead-laden their children’s toys are. Similarly, most consumers will never recognize that their children no longer face being crushed by a garage door that unexpectedly closes on them or that infants do not suffocate in refrigerators because the doors can now be easily opened from within. Numerous government safety rules operate in a similar fashion, with life-saving benefits but little public recognition.</p>\n</blockquote>\n\n\n\n<p>What about the costs of such regulations? As Adler emphasizes, the costs of a rule that makes the slats of infant cribs closer together is pretty minimal. The costs of people being injured by unsafe products are quite real. Adler: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>When health and safety agencies write a safety rule, they do so to eliminate or reduce deaths and injuries that consumers suffer in product-related accidents. The CPSC <a href=\"https://www.nytimes.com/2011/10/17/opinion/safety-regulators-dont-add-costs-they-decide-who-pays-them.html\">estimates</a> that roughly 31,000 people die and 34 million people suffer product-related injuries every year. These deaths and injuries <a href=\"https://unctad.org/news/unsafe-consumer-products-cost-us-economy-1-trillion-each-year#:~:text=When%20people%20are%20injured%20or,US%20Consumer%20Product%20Safety%20Commission\">impose</a> significant costs on the economy—roughly one trillion dollars annually. They do so first as medical costs and lost wages, then as higher premiums for health insurance—or higher taxes to pay for the uninsured. Moreover, product-related tragedies almost always result in a loss of economic productivity of the victims, not to mention the pain and suffering they experience. Accordingly, the argument that regulations necessarily impose new costs on society is not persuasive. The costs in the form of deaths and injuries are already there, and often they impose as much of a drag on the economy as any safety rule.</p>\n</blockquote>\n\n\n\n<p>What about alternative, like, recalls of unsafe products? This can work to some extent, but a common patterns is that a relatively small share of products are returned to the manufacturer&#8211;and this typically only happens after the CPSC is involves. What about education about safe use? This can sometime be effective, over time, as in the case of government anti-smoking announcements and warning requirements. But public safety campaigns often cost a lot, for at best modest responses: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>As former CPSC Commissioner <a href=\"https://www.cpsc.gov/Newsroom/News-Releases/1976/CPSC-Chooses-Pittle-As-Vice-Chairman\">R. David Pittle</a> once <a href=\"https://www.nytimes.com/1981/11/01/weekinreview/the-rational-consumer-may-be-just-a-deregulator-s-dream.html\">said</a>, “it is far easier to redesign products than it is to redesign consumers.” Regulators have undertaken education campaigns intending to produce substantial changes in consumer behavior with limited success. &#8230; </p>\n\n\n\n<p>In the early 1980s, for example, NHTSA&nbsp;<a href=\"https://www.nhtsa.gov/sites/nhtsa.gov/files/811413.pdf#page=13\">undertook</a>&nbsp;a massive multiyear national campaign to encourage consumers to wear seatbelts. After spending millions of dollars on the campaign, the agency&nbsp;<a href=\"https://www.nhtsa.gov/sites/nhtsa.gov/files/811413.pdf#page=13\">revealed</a>&nbsp;that the rate of seatbelt use rose only from about 11 percent to 14 percent—a disappointing result however one looks at it. The seatbelt usage rate did not significantly&nbsp;<a href=\"https://www.nhtsa.gov/sites/nhtsa.gov/files/811413.pdf#page=14\">increase</a>&nbsp;until the U.S. Department of Transportation pressured the states to enact mandatory seatbelt laws.</p>\n</blockquote>\n\n\n\n<p>What about industry getting together to set standards? For example,  the companies that make portable generators recently got together to set voluntary standards for mitigating the risk of carbon monoxide poisoning. <a href=\"http://psc.gov/Newsroom/News-Releases/2022/New-CPSC-Report-Finds-Industry-Voluntary-Standards-Can-Reduce-Risk-of-Carbon-Monoxide-Death-and-Injury-from-Portable-Generators-Yet-Compliance-with-Standards-Is-Minimal-Supports-Mandatory-Rulemaking-Process\">The CPSC had no big quarrel with the standards themselves&#8211;except that the same companies that had promulgated the standards were not actually living up to them,</a> and 500 or so people each year are dying as a result. Industry participation in making safer products can be truly useful, but without a government agency, industry compliance with voluntary standards may not be high. </p>\n\n\n\n<p>Adler is clearly a regulation fan-boy (not that there&#8217;s anything wrong with that!), and he probably has a tendency to overstate benefits and understate costs. It&#8217;s also worth noting that requiring safer design of consumer products is a particular regulatory task, with different types of tradeoffs than other prominent regulators like the Environmental Protection Agency or the Food and Drug Administration. I know regulators can overreach on safety issues, or become focused on overly costly approaches. But markets can also underreach on consumer safety issues. The real-world answer would seem to involve pushing-and-pulling between the two, with the arguments conducted quantitatively and out in the open. </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p></p>\n</blockquote>\n<p><a class=\"a2a_button_facebook\" href=\"https://www.addtoany.com/add_to/facebook?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F18%2Ffrom-an-unapologetic-safety-regulator%2F&linkname=From%20an%20Unapologetic%20Safety%20Regulator\" title=\"Facebook\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_twitter\" href=\"https://www.addtoany.com/add_to/twitter?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F18%2Ffrom-an-unapologetic-safety-regulator%2F&linkname=From%20an%20Unapologetic%20Safety%20Regulator\" title=\"Twitter\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_email\" href=\"https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F18%2Ffrom-an-unapologetic-safety-regulator%2F&linkname=From%20an%20Unapologetic%20Safety%20Regulator\" title=\"Email\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F18%2Ffrom-an-unapologetic-safety-regulator%2F&#038;title=From%20an%20Unapologetic%20Safety%20Regulator\" data-a2a-url=\"https://conversableeconomist.com/2022/10/18/from-an-unapologetic-safety-regulator/\" data-a2a-title=\"From an Unapologetic Safety Regulator\"></a></p><p>The post <a href=\"https://conversableeconomist.com/2022/10/18/from-an-unapologetic-safety-regulator/\">From an Unapologetic Safety Regulator</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "post-id": 12963
}