{
  "title": "Mechanochemical synthesis of pseudobinary Ti-V hydrides and their conversion reaction with Li and Na. (arXiv:2211.01550v1 [cond-mat.mtrl-sci])",
  "link": "http://arxiv.org/abs/2211.01550",
  "description": "<p>Lithium-ion batteries (LiBs) based on insertion electrodes reach intrinsic\ncapacity limits. Performance improvements and cost reduction require\nalternative reaction mechanisms and novel battery chemistries such as\nconversion reactions and sodium-ion batteries (NaBs), respectively. We here\nstudy the formation of Ti1-xVxH2 hydrides (0 &lt; x &lt; 1) and their electrochemical\nproperties as anodes in LiBs and NaBs half-cells. Hydrides were synthesized by\nmechanochemistry of the metal powders under hydrogen atmosphere (PH2~ 8 MPa).\nFor V contents below 80 at.% (x &lt; 0.8), single-phase pseudobinary dihydride\ncompounds Ti1-xVxH2 are formed. They crystallize in the fluorite-type structure\nand are highly nanostructured (crystallite size &lt; 10 nm). Their lattice\nparameter decreases linearly with the V content leading to hydride\ndestabilization. Electrochemical studies were first carried out in Li-ion half\ncells with full conversion between Ti1-xVxH2 hydrides and lithium. The\npotential of the conversion reaction can be gradually tuned with the vanadium\ncontent due to its destabilization effect. Furthermore, different paths for the\nconversion reaction are observed for Ti-rich (x &lt; 0.25) and V-rich (x &gt; 0.7)\nalloys. Na-ion half-cell measurements prove the reactivity between (V,Ti)H2\nhydrides and sodium, albeit with significant kinetic limitations\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Cuevas_F/0/1/0/all/0/1\">Fermin Cuevas</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Laik_B/0/1/0/all/0/1\">Barbara La&#xef;k</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zhang_J/0/1/0/all/0/1\">Junxian Zhang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Mateos_M/0/1/0/all/0/1\">Micka&#xeb;l Mateos</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Pereira_Ramos_J/0/1/0/all/0/1\">Jean-Pierre Pereira-Ramos</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Latroche_M/0/1/0/all/0/1\">Michel Latroche</a>"
}