{
  "guid": "prx_137_90b370d3-c97b-4a6c-a56a-7bb32aabf720",
  "title": "803 - Neverending Introduction | All Intros 676-680",
  "pubDate": "Sun, 01 Sep 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/274134",
  "description": "<p>Let’s take some sleepy spins five times round and round the meanderwheel. No need to sing along with that song from the story that never ended like Dustin and Suzy.<br>\n<br>\n(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 20:00)<br>\n<br>\nCommission a song from the Mystery Bard over at <a href=\"http://www.jonathanmann.net/\" rel=\"nofollow\" target=\"_blank\">http://www.jonathanmann.net<br>\n</a><br>\nTonight’s episode is sponsored by Brooklinen, luxury bedding, at amazing prices. You have to try these sheets today! There is an exclusive offer just for Sleep With Me listeners.<br>\nGet $20 off AND free shipping when you use promo code [WITHME] at <a href=\"http://www.brooklinen.com\" rel=\"nofollow\" target=\"_blank\">http://www.brooklinen.com</a>.<br>\nBrooklinen is SO confident that they offer **a risk-free 60-night satisfaction guarantee and a lifetime warranty on all of their sheets and comforters! **<br>\n<br>\nWelcome our newest sponsor <a href=\"http://www.feals.com/sleep\" rel=\"nofollow\" target=\"_blank\">Feals</a>! Feals offers premium CBD delivered directly to your doorstep. New to CBD? Feals offers real human support via a free CBD hotline and text message support to help guide your personal experience. Join the Feals community to get Feals delivered to your door every month via membership. You’ll save money on every order and you can pause or cancel any time**.** Become a member today and get 50% off your first order with FREE shipping by going to <a href=\"http://www.feals.com/sleep\" rel=\"nofollow\" target=\"_blank\">www.feals.com/sleep</a>.<br>\n<br>\nCheck out our sponsor <a href=\"http://www.betterhelp.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">Betterhelp</a> -Betterhelp offers licensed professional counselors who are specialized in issues, such as depression, stress, anxiety, relationships, sleeping, and more. Best of all, it’s a truly affordable option and our listeners get 10% off your first month with discount code “sleepwithme”. Go over to <a href=\"http://www.betterhelp.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">www.betterhelp.com/sleepwithme</a> and simply fill out a questionnaire to help them assess your needs and get matched with a counselor you’ll love. <br>\n<br>\nUse our sponsor Wix! Create a stunning website via <a href=\"http://wix.com/sleep\" rel=\"nofollow\" target=\"_blank\">wix.com/sleep</a> and get 20% a Wix premium plan today! Wix has over 500 amazing templates to start with and over 140 million people use Wix for their website. I’m working on a special Wix website you can check out soon!! So get over to <a href=\"http://wix.com/sleep20\" rel=\"nofollow\" target=\"_blank\">wix.com/sleep20</a>!</p>",
  "enclosure": "",
  "itunes:title": "Neverending Introduction | All Intros 676-680",
  "itunes:subtitle": "Let’s take some sleepy spins five times round and round the meanderwheel. No need to sing along with that song from the story that never ended like Dustin and Suzy.",
  "itunes:episodeType": "full",
  "itunes:episode": 803,
  "itunes:duration": "01:11:51"
}