{
  "title": "Photorealistic Facial Wrinkles Removal. (arXiv:2211.01930v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01930",
  "description": "<p>Editing and retouching facial attributes is a complex task that usually\nrequires human artists to obtain photo-realistic results. Its applications are\nnumerous and can be found in several contexts such as cosmetics or digital\nmedia retouching, to name a few. Recently, advancements in conditional\ngenerative modeling have shown astonishing results at modifying facial\nattributes in a realistic manner. However, current methods are still prone to\nartifacts, and focus on modifying global attributes like age and gender, or\nlocal mid-sized attributes like glasses or moustaches. In this work, we revisit\na two-stage approach for retouching facial wrinkles and obtain results with\nunprecedented realism. First, a state of the art wrinkle segmentation network\nis used to detect the wrinkles within the facial region. Then, an inpainting\nmodule is used to remove the detected wrinkles, filling them in with a texture\nthat is statistically consistent with the surrounding skin. To achieve this, we\nintroduce a novel loss term that reuses the wrinkle segmentation network to\npenalize those regions that still contain wrinkles after the inpainting. We\nevaluate our method qualitatively and quantitatively, showing state of the art\nresults for the task of wrinkle removal. Moreover, we introduce the first\nhigh-resolution dataset, named FFHQ-Wrinkles, to evaluate wrinkle detection\nmethods.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Sanchez_M/0/1/0/all/0/1\">Marcelo Sanchez</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Triginer_G/0/1/0/all/0/1\">Gil Triginer</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ballester_C/0/1/0/all/0/1\">Coloma Ballester</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Raad_L/0/1/0/all/0/1\">Lara Raad</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ramon_E/0/1/0/all/0/1\">Eduard Ramon</a>"
}