{
  "title": "143: King Richard (Trial By Media Episode 4)",
  "link": "https://audioboom.com/posts/7648977",
  "itunes:episode": 143,
  "itunes:title": "King Richard (Trial By Media Episode 4)",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2994,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>THIS ONE IS ALL ABOUT THE PIZZAZZ FACTOR, YOU GUY! CUE. THOSE. JAZZ. HANDS.<br>\n<br>\nRichard Scrushy (a name you can't say without sounding hammered) is a mediocre, yet very rich, white dude. He runs a huge company! AND GUESS WHAT? HE'S BEEN STEALING HUNDREDS OF MILLIONS OF DOLLARS FROM IT! Or, so says the government.....and the 5 CFOs who worked for him. But who cares! Scrushy is rich and totally the victim here...or so says his attorney Donald Watkins. So what is a mediocre super rich white guy to do when he get's indicted? GRAB HIS WIFE AND START A RELIGIOUS TALK SHOW, OF COURSE! This one is bananas, you guys, Kirk Cameron makes an appearance and God(dess) makes herself known in Gillian's apartment during the recording. Let's get to it, shall we?<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a>\n</div>\n",
  "pubDate": "Tue, 04 Aug 2020 10:02:00 +0000",
  "guid": "tag:audioboom.com,2020-08-04:/posts/7648977",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}