{
  "id": "https://bibleinoneyear.org/en/youth/101",
  "title": "Day 101: Eight Things That Really Matter to God",
  "description": "Psalm 44:6-8, Deuteronomy 15:4-15, 16:18,20, Luke 13:31–34, 14:1–14.  My father may have been a little extreme, but my sister and I were in no doubt about what mattered to him: honesty  In our passages today, we see some of the things that *really matter to God*",
  "pubDate": "Sun, 11 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/101/?ignore",
  "itunes:duration": "14:00",
  "guid": "enyouth11042021-101",
  "length": 840.15,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 101: Eight Things That Really Matter to God",
  "itunes:subtitle": "Psalm 44:6-8, Deuteronomy 15:4-15, 16:18,20, Luke 13:31–34, 14:1–14.  My father may have been a little extreme, but my sister and I were in no doubt about what mattered to him: honesty  In our passages today, we see some of the things that *really matter to God*",
  "itunes:summary": "My mother and father were great parents. They had strong values. My sister and I were left in no doubt about what mattered to them.\nWhat mattered most to my father was honesty. I remember how my father used to say, ‘I expect to be believed.’ He regarded honesty as the highest possible value and sometimes went to absurd lengths to retain that standard.\nOn one occasion, when they were engaged, but not yet married, he and my mother got on the wrong bus. The bus conductor refused to accept any money as they had only travelled a few yards. My father was unhappy to have been unable to pay what he felt he owed. He sent the money for the fare to the bus company. They sent it back. This resulted in a long correspondence, which my mother found hard to understand (she joked that she almost broke off the engagement).\nI remember, in my childhood, many similar incidents. My father may have been a little extreme, but my sister and I were in no doubt about what mattered to him: honesty. In our passages today, we see some of the things that really matter to God.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 101
}