{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-5077099391598959349",
  "published": "2018-11-12T10:17:00.003-08:00",
  "updated": "2018-11-13T11:31:59.166-08:00",
  "title": "New ways to create and watch VR videos",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">VR videos deliver a powerful way to share and experience the world. From going behind the curtain with<a href=\"https://www.youtube.com/watch?v=tGzF9yawei4&amp;t=316s\" target=\"_blank\">&nbsp;Cirque du Soleil</a>,&nbsp;to&nbsp;<a href=\"https://www.youtube.com/watch?v=ecajlIKwlCg\" target=\"_blank\">diving into iconic pieces of art</a>, to a&nbsp;<a href=\"https://www.youtube.com/watch?v=mI8ELfmmG0w&amp;feature=youtu.be\" target=\"_blank\">behind-the-scenes studio tour</a>&nbsp;with a TV super star, you can transport your viewers to experience moments as if they’re actually there.<br /><br />We’ve heard that you want to make and see even more immersive videos on YouTube. That’s why we’re continuing to expand the ways anyone can create and watch VR content.<br /><br /><h3 style=\"text-align: left;\">More ways to watch YouTube VR</h3><br />With all the great content that’s available on YouTube today, we want to continue our effort to bring the YouTube VR app to everyone with a VR headset. Starting today, the app will be available on Oculus Go headsets via the&nbsp;<a href=\"https://www.oculus.com/experiences/go/1458129140982015/\" target=\"_blank\">Oculus Store</a>.<br /><br /><h3 style=\"text-align: left;\">Making it easier to create VR180 content</h3><br />Last year we introduced VR180, a new video format that focuses on what’s in front of the camera while delivering a 3D effect in a VR headset. By focusing only on the 180-degree view of what’s in front of the camera, it made VR video production easier for creators like you, encouraging&nbsp;<a href=\"https://www.youtube.com/playlist?list=PLU8wpH_Lfhmu_kk955BFwvV0yT0PEcenA\" target=\"_blank\">more VR videos</a>&nbsp;than ever before.<br /><br />Since then we’ve introduced new tools to make this type of video creation even easier. We launched the&nbsp;<a href=\"https://vr.google.com/vr180/apps/\" target=\"_blank\">VR180 Creator Tool</a>&nbsp;that makes it faster to process footage, add metadata and publish. The tool is available on MacOS, Linux and now on Windows.<br /><br />With the latest<a href=\"https://theblog.adobe.com/creative-editorial-with-faster-workflows/\" target=\"_blank\">&nbsp;editing tools</a>&nbsp;from Adobe, it’s also significantly easier for you to edit, add effects and publish your content. And with new VR180 capable cameras from&nbsp;<a href=\"https://www.kandaovr.com/en/qoocam/#/overview?keywords=qoocam&amp;camp=1525110401&amp;adgroup=56808458325&amp;placement=\" target=\"_blank\">Kandao</a>&nbsp;and&nbsp;<a href=\"https://www.kandaovr.com/en/qoocam/#/overview?keywords=qoocam&amp;camp=1525110401&amp;adgroup=56808458325&amp;placement=\" target=\"_blank\">Vuze</a>, you now have more options for capturing VR180 to complement cameras from&nbsp;<a href=\"http://www.z-cam.com/180-vr-camera-k1-pro/\" target=\"_blank\">Z-Cam</a>&nbsp;and&nbsp;<a href=\"https://www.lenovo.com/us/en/daydreamvr/\" target=\"_blank\">Lenovo</a>.<br /><br /><h3 style=\"text-align: left;\">Creating more immersive VR videos</h3><br />Spatial audio can help make&nbsp;<a href=\"https://www.youtube.com/watch?v=iCIaNFr2Nfg\" target=\"_blank\">haunted houses more scary</a>&nbsp;and imaginary&nbsp;<a href=\"https://www.youtube.com/watch?v=8ieIar09dRk\" target=\"_blank\">video game worlds</a>&nbsp;more real. That’s because it matches realistic sounds and picture together for a more immersive experience. We’ve recently added support for head-locked audio, which means that you can add narration and background music that will sound the same no matter where you look.<br /><br />VR videos unlock a world of experiences. With new and easier ways to create and watch VR content, we look forward to seeing what stories you tell, locations you transport viewers to and experiences you uncover.<br /><br /><i>Posted by Erin Teague, VR Product Lead, who recently watched&nbsp;<a href=\"https://www.youtube.com/watch?v=9GlIfC8UlXw&amp;feature=youtu.be\" target=\"_blank\">\"Alvin Ailey's Judith Jamison Speaks on Cry in VR180 | Black Girls Rock!\"</a></i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 1
}