{
  "id": "yt:video:gMeIAybupeI",
  "yt:videoId": "gMeIAybupeI",
  "yt:channelId": "UCfWNZIJkm268rLO_yeRlcww",
  "title": "Chinese Governments are going Bankrupt, Mortgage Crisis Getting Worse",
  "link": "",
  "author": {
    "name": "Business Basics",
    "uri": "https://www.youtube.com/channel/UCfWNZIJkm268rLO_yeRlcww"
  },
  "published": "2022-10-17T18:07:26+00:00",
  "updated": "2022-10-27T18:21:32+00:00",
  "media:group": {
    "media:title": "Chinese Governments are going Bankrupt, Mortgage Crisis Getting Worse",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Sign up to Morning Brew for free today https://morningbrewdaily.com/BusinessBasics\nSponsored by Morning Brew\n\nGet New Merch: https://www.businessbasics.shop/\n\nSupport the channel on Patreon:  https://www.patreon.com/businessbasics1\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCfWNZIJkm268rLO_yeRlcww/join\n\n\n\n⚠️Webull: 5 x Free Stocks: https://a.webull.com/i/BusinessBasics\n\n\n\n\n\n\nInvesting For Beginners | Learn Investing (Free Course)\nhttps://youtu.be/GCg7joUeU-k\n\nPassive Income: How To Retire Early Through Passive Income!\nhttps://youtu.be/LyF89paHkSM\n\nHow you can focus like Warren Buffett? (2020)\nhttps://youtu.be/TLAJkTHfMSo\n\nsome links above are affiliate links\n\nCCP is KILLING China's Economy, GDP Crashed.\n\nCCP's Existential Crisis, Facing Bankruptcy, Housing Crisis Getting Worse, Protest Everywhere.\nChina's ECONOMIC Crisis is Getting Worse, Government Facing Bankruptcy, Protest Everywhere.\nChina's Mortgage Crisis is Getting Worse, Government Facing Bankruptcy, Protest Everywhere.\n\nChina's Government Going Bankrupt, Mortgage Crisis is Getting Worse, Protest Everywhere. \n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, businessbasicsyt@gmail.com , and we can sort it out.\n\n\nDISCLAIMER: All of my strategies, and news coverage are based on my own opinions alone and are only done for entertainment purposes. If you are watching my videos, please Don't take any of this content as guidance for buying or selling any type of investment or security.  I am not a financial advisor and anything said on this YouTube channel should not be seen as financial advice. Please keep in mind that there are a lot of risks associated with investing in the stock market so do your own research and due diligence before making any investment decisions.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}