{
  "title": "Will an EV-Filled World Pass the Sulfuric-Acid Test?",
  "link": "https://spectrum.ieee.org/sulfuric-acid-shortage",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/overhead-view-of-mounds-of-yellow-pelletized-sulfur.jpg?id=31464451&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>Look at the periodic table, and think of the elements needed for a prosperous planet powered by renewable energy. Sulfur likely won’t be the first to come to mind.</p><p>It probably doesn’t help the yellow element’s noxious reputation to learn that most of the world’s sulfur comes as a by-product of refining fossil fuels. In a net-zero future, a future where petroleum and natural-gas production enter terminal decline and never return to their past carbon-spewing heights, sulfur production will fall away, too.</p><p>Therein lies the problem. Sulfur—easily turned into sulfuric acid—is a necessary tool for <a href=\"https://www.essentialchemicalindustry.org/chemicals/sulfuric-acid.html#:~:text=By%20far%20the%20largest%20amount,important%20fertilizer%20in%20sulfur%2Ddeficient.\" target=\"_blank\">creating fertilizer</a> and <a href=\"https://www.researchgate.net/post/Why_do_we_use_acids_for_heavy_metal_extraction\" target=\"_blank\">extracting heavy metals from their ores</a> before they can go into batteries, wind turbines, and electric-vehicle components. Even as sulfur production is set to fall, sulfuric-acid demand is set to rise. </p><p>That’s a recipe for an impending crisis, researchers <a href=\"https://doi.org/10.1111/geoj.12475\" target=\"_blank\">warn in a paper published 21 August</a> in <em>The Geographical Journal</em>.</p><p>Today, the world uses 246 million tonnes of sulfuric acid in a year. The researchers project that number might increase to 400 million tonnes by 2040.</p><p class=\"pull-quote\">Sulfuric acid is necessary for extracting heavy metals such as nickel, cobalt, and rare earths for batteries, magnets, and other renewable-energy technologies. The world’s needs are going up—from 246 million tonnes today to 400 million tonnes by 2040—but the supply could be drying out. Sulfur is most cheaply obtained as a by-product of petroleum refineries. </p><p>That’s because, when it comes to renewable energy, sulfuric acid has a very critical use. Extracting heavy metals, such as nickel, cobalt, and rare earths, relies on chemical processes that use sulfuric acid to separate the metals from their ores. Those heavy metals are key elements in lithium-ion batteries, electric motors, and other technologies crucial for the renewable transition.</p><p>(Sulfur has other roles, too. Perhaps even more significantly than renewables, sulfuric acid is a <a href=\"https://www.sulphurinstitute.org/about-sulphur/sulphur-the-fourth-major-plant-nutrient/\" target=\"_blank\">key element in manufacturing fertilizers</a>. Sulfuric acid <a href=\"http://www.utahbiodieselsupply.com/blog/how-using-sulfuric-acid-works-when-making-biodiesel/\" target=\"_blank\">goes into biofuels</a>, and sulfur is used <a href=\"https://en.wikipedia.org/wiki/Sulfur_vulcanization\" target=\"_blank\">to vulcanize and harden rubber</a>.)</p><p>Where does that sulfur come from, then? Decades ago, most of it came from mining. In 1894, a German chemist named <a href=\"https://en.wikipedia.org/wiki/Herman_Frasch\" target=\"_blank\">Herman Frasch</a> plotted a <a href=\"https://en.wikipedia.org/wiki/Frasch_process\" target=\"_blank\">process</a> of tapping a sulfur-containing mineral deposit by pumping it with superheated water. The sulfur will melt and bubble up to the surface. Sulfur miners have used the same process ever since.</p><p>The Frasch process can be tremendously damaging to the surrounding environment and mineworkers’ health. The minerals that contain sulfur often also tend to contain toxic metals like mercury, arsenic, and thallium. The process also spews out wastewater that contains <a href=\"https://www.osha.gov/hydrogen-sulfide\" target=\"_blank\">hydrogen sulfide</a>, which causes poisoning symptoms similar to those of carbon monoxide. (Although hydrogen sulfide is in fact some ten times more toxic than CO.) </p><p>By the 1950s, the world had exhausted the most easily available sulfur deposits. Mining costs skyrocketed, rapidly inflating the element’s market price. Analysts warned of an impending <a href=\"https://www.jstor.org/stable/40392456\" target=\"_blank\">“sulphur famine.”</a></p><p class=\"pull-quote\">“A lot of people, they take sulfur for granted.”<br/>—Jean-Michel Lavoie, University of Sherbrooke, Québec</p><p>In swept the fossil-fuel industry’s waste to save the day. By coincidence, sulfur’s presence in petroleum makes it harder to refine into diesel, jet fuel, and other assorted products. To sort it out, refineries have to filter out the sulfur—thereby making it available to the rest of the world. Today, more than 80 percent of the world’s sulfur comes from these acts of waste management. As dirty as it sounds, it’s actually cleaner than mining.</p><p>However, naturally, if carbon-emitting fossil fuels go, refineries like this will likely go too. It’s hard to know how quickly that will happen, but in a scenario where the world reaches net-zero carbon dioxide emissions by 2050, the researchers estimate that sulfur production would drop by one-half or even more. </p><p>“It’s an eye-opener,” <a href=\"https://www.usherbrooke.ca/genie-chimique-biotech//departement/professeurs/jean-michel-lavoie/\" rel=\"noopener noreferrer\" target=\"_blank\">Jean-Michel Lavoie</a>, a chemist at the <a href=\"https://www.ltb-btl.ca/en/home/\" target=\"_blank\">Laboratoire des Technologies de la Biomasse</a>, on the campus of the University of Sherbrooke, in Québec, who was not an author of the paper. “We never really focus on trying to solve these problems, but I think we’re going to start looking into solutions.”</p><p>The world could swing back to sourcing sulfur directly from mines. That may happen if the economics favor it. But it’s costlier than getting it from petroleum, and the Frasch process carries an unacceptable ecological burden (not to mention unpleasant <a href=\"https://www.nature.com/articles/s41467-020-18661-9\" rel=\"noopener noreferrer\" target=\"_blank\">social impacts</a> that disproportionately affect people in developing countries).</p><p>“Research is urgently needed to develop low-cost, low environmental impact methods of extracting large quantities of elemental sulfur,” said <a href=\"https://www.geog.ucl.ac.uk/people/academic-staff/mark-maslin\" rel=\"noopener noreferrer\" target=\"_blank\">Mark Maslin</a>, a geographer at University College London and one of the paper's authors, in a <a href=\"https://phys.org/news/2022-08-sulfur-shortage-potential-resource-crisis.html\" rel=\"noopener noreferrer\" target=\"_blank\">press release</a>. </p><p>Maslin and his colleagues believe, however, that there won’t be a single solution to a sulfur shortage. In some fields, like biofuel production, recycling sulfuric acid is quite common. A few scientists have begun tinkering with sulfuric-acid substitutes—nitric acid, for example—though that’s still quite speculative.</p><p>Reducing the future need for sulfuric-acid certainly wouldn’t hurt. Already, there are batteries (such as lithium iron phosphate batteries) that have lower energy-capacity-to-weight ratios but take in less nickel, cobalt, and heavy metals, and thus need less sulfuric acid. Future research could shape batteries that deliver the best of both worlds.</p><p>What is clear is that weaning off fossil fuels may have quite a number of intended side effects—bad or good—and a sulfur shortage is just one of them.</p><p>“A lot of people, they take sulfur for granted,” says Lavoie.</p><p><br/></p><p><em><strong>Update 7 September:</strong> The previous version of this story compared toxicities of carbon monoxide and hydrogen sulfide but did not specify that the latter is in fact 10 times more toxic than CO. That ambiguity has now been corrected. </em><br/></p>",
  "pubDate": "Sat, 03 Sep 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/sulfuric-acid-shortage",
  "category": [
    "Sulfur",
    "Petroleum",
    "Renewable energy"
  ],
  "dc:creator": "Rahul Rao",
  "media:content": ""
}