{
  "title": "TU58: Improving the Interpersonal World of the Internet for Both Kids and Adults with Guest Catherine Knibbs",
  "link": "https://therapistuncensored.com/episodes/tu58-improving-the-interpersonal-world-of-the-internet-for-both-kids-and-adults-with-guest-catherine-knibbs/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu58-improving-the-interpersonal-world-of-the-internet-for-both-kids-and-adults-with-guest-catherine-knibbs",
  "pubDate": "Wed, 28 Mar 2018 04:34:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5952",
  "description": "Enjoyable one – learn the problematic and adaptive psychology behind online social interactions as Therapist Uncensored host Dr. Ann Kelley interviews this delightful UK-based psychotherapist and author. Catherine Knibbs coined the phrase “cyber trauma” and is the author of The Darker Side of the Internet for Children And Young People. This is not conservative doom and gloom. We get into attachment and neuroscience and provide realistic recommendations to help you and your children navigate the web, unpack myths, identify cyber bullying, discuss consent and provide proactive strategies that lead towards integration and health.\n\nRespond more adaptively to the internet and social media rather than swinging guardrail-to-guardrail with unkept promises and overreactions. Explore the positive and negative elements of having a global “village” you can access instantly, anywhere via our phones and discuss the impact of the internet on developing minds and the interpersonal realm of young people and adults.\n\nIt’s not too late to SIGN UP FOR OUR LIVE CONFERENCE ON ATTACHMENT APRIL 7, 2018 –  Healing Adult Attachment, the 3 Pillars of Integrated Treatment  with Dr. David Elliott (Thank you to our fabulous co-sponsor Austin IN Connection.)\n\n \n\n \n\nOnline reading group to start April 20, 2018 for  Attachment Disturbances in Adults Comprehensive Treatment and Repair (Norton 2016) by Daniel Brown and David Elliott.  Reserve your slot today!\n\n\n\n0:00-15:00\n\nIntro\n\nCatherine’s interest in “cyber trauma” and personal experience with bullying, re-traumatizing experience of seeing photos posted online.\n\nSharing images online and the loss of choice, loss of consent even with OS updates. Trauma happens without choice.\n\nInternet increases chances of exposure to traumatic images but also expands our “village”.\n\nRetraumatization process\n\nCyberbullying\n\n15:00-30:00\n\nExclusion in the cyber world is very comparable to physical bullying in terms of mental and emotional trauma. Exclusion from a party can be a much more intense experience in the social media realm as pictures are being posted\n\n“Kicking” in online gaming, “doxxing” in online forums\n\nIssue of sensitive material being downloaded and re-uploaded even if removed, teenagers don’t think through the long term behavior of risky behavior\n\n“Trawling”: a continued unwanted presence on someone’s online profile\n\nAttachment and pressure to like and post\n\nOnline interactions as a valuable social learning skill for those who might be too dysregulated by physical interactions BUT you can’t just interact online all the time. Importance of socializing in a normal social setting on brain and social development (like making eye contact).\n\n30:00-45:00\n\nDifficulty in disengaging while engrossed in a game, “Spaghetti Test”\n\nImportance of becoming tech savvy, not just switching off video games without understanding how the game works, e.g. reaching save points, receiving XP\n\nRecognition of video games and social media impacting complex ideas like death (“respawning”)\n\nIdea of children being afraid to talk to parents after seeing traumatizing images on the internet because they think they’ll get in trouble, creating a forum for open discussion\n\nPolyvagal theory related to internet impact\n\n45:00-60:00\n\nSexting and the permanence of an online upload\n\nStudy of sexual images online\n\nPressure to share images, revenge porn, difficulty of trusting others with images once sent, hyper-rational thinking from adolescents, not considering outcomes especially with lack of education\n\nCyber signups, global synaptic connections\n\nSuggestions for parents and the internet, issue of adolescents and children having instant access to shocking images they’re not developmentally ready for, importance of co-regulation\n\nWrap up and outro\n\nResources:\n\nReach Catherine Knibbs here \nThe Impact of the Online World on the Developing Brain,",
  "enclosure": "",
  "itunes:subtitle": "Enjoyable one – learn the problematic and adaptive psychology behind online social interactions as Therapist Uncensored host Dr. Ann Kelley interviews this delightful UK-based psychotherapist and author. Catherine Knibbs coined the phrase “cyber trauma...",
  "itunes:summary": "Enjoyable one -  learn the problematic and adaptive psychology behind online social interactions as Therapist Uncensored host Ann Kelley interviews the delightful UK-based psychotherapist.  Catherine Knibbs coined the phrase “cyber trauma” and is author of The Darker Side of the Internet for Children And Young People.  This is not conservative doom and gloom, they get into attachment and neuroscience and provide realistic recommendations to help your children navigate the web,  unpack myths, identify cyber bullying, discuss consent and provide proactive strategies that lead toward towards integration and health.<br />\n<br />\nRespond more adaptively to the to the internet and social media rather than swinging guardrail-to-guardrail with unkept promises and overreactions.  Explore the positive and negative elements of having a global “village” you can access instantly, anywhere via our phones and discuss the impact of the internet on developing minds and the interpersonal realm of young people and adults.<br />\nIt&apos;s not to late to SIGN UP FOR OUR LIVE CONFERENCE ON ATTACHMENT APRIL 7, 2018 –  Healing Adult Attachment, the 3 Pillars of Integrated Treatment  with Dr. David Elliott (Thank you to our fabulous co-sponsor Austin IN Connection.)<br />\n<br />\nOnline reading group to start April 20, 2018 for  Attachment Disturbances in Adults Comprehensive Treatment and Repair (Norton 2016) by Daniel Brown and David Elliott.  Reserve your slot today!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:02:44"
}