{
  "title": "Joy Zhou: A Creek Story",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "",
  "itunes:summary": "A Creek Story is a newly commissioned moving image and concrete poetry work by artist Joy Zhou. Collaging text, images, and audio in a series of moving image works and gifs, Zhou builds on their interest in visually and sonically mapping the plurality of encounters one may have with such waterways and creeks on Wurundjeri Woi-wurrung land.\n\nInspired by the hidden waterway of Williams creek that runs underneath Melbourne’s CBD, Zhou has thought up a fictional story that follows two cities — one above ground, the other buried deep underground — that are connected by The Waltzing Creek.\n\nJoy Zhou talks through their process of active listening to form knowledge; the exploration of the Williams Creek that inspired the fictional narrative of A Creek Story; and the links formed between language, sound and environment as an action to give voice to those often unseen. \n\nJoy Zhou is a China born emerging artist and design practitioner based in Naarm/. Informed by their background in Interior Design, Joy’s practice entails gestures of queering which unfold encounters and events that draw relationships between people, places, and spaces.\n\nhttps://disclaimer.org.au/contents/a-creek-story\n\nProduced by Mara Schwerdtfeger. \n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.\n\nhttps://liquidarchitecture.org.au/",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/joy-zhou-a-creek-story",
  "pubDate": "Tue, 27 Sep 2022 08:00:00 +1000",
  "itunes:duration": "15:21",
  "itunes:explicit": "no"
}