{
  "title": "S17 Ep43: TCT: Captive Audience: A Real American Horror Story w/ Jessica Dimmock",
  "link": "https://audioboom.com/posts/8098214",
  "itunes:episode": 43,
  "itunes:title": "TCT: Captive Audience: A Real American Horror Story w/ Jessica Dimmock",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3709,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>True Crime Tuesday presents Captive Audience: A Real American Horror Story w/ Jessica Dimmock!</p>\n\n<p>Siblings Ashley and Steven Stayner Jr. never knew their famous father, Steven, he childhood victim of a kidnapping who tragically died in an accident when they were young. </p>\n\n<p>In 1972, Steven went to school and never returned.  His mother Kay struggled to keep the media and everyone engaged and hold her family together. Then, seven years later, a miracle happens, Steven returns! But this isn't the Hollywood ending everyone hopes it will be! The director of Hulu's new series, Captive Audience joins TCT to talk about this disturbing story!</p>\n\n<p>Then, Jessica Freeburg joins us for Ripped From The Headlines!</p>\n\n<p>AND A BRAND NEW DUMB CRIMES/STUPID CRIMINALS! </p>\n\n<p>Want to check out Captive Audience on April 21st, but don't have Hulu, click on this link to get it now:  <a href=\"https://www.hulu.com/welcome\">https://www.hulu.com/welcome</a></p>\n\n<p>Check out what is going on with Jessica here: <a href=\"https://jessicafreeburg.com/\">https://jessicafreeburg.com/</a></p>\n\n<p>Darkness Radio has partnered with the UFO Disclosure Symposium in late May! Be part of this newsworthy conference and get your tickets here: <a href=\"https://ufodisclosuresymposium.com/?ref=tim%40darknessradio.com\">https://ufodisclosuresymposium.com/?ref=tim%40darknessradio.com</a></p>\n",
  "pubDate": "Tue, 12 Apr 2022 09:30:00 +0000",
  "guid": "f58cfc8f-e876-46ba-868a-ae75008ad687",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}