{
  "title": "#178/No More Federal Modernism: Classicist Catesby Leigh + Musical Guest Lucy Woodward",
  "pubDate": "Mon, 11 Jan 2021 08:00:00 +0000",
  "guid": "5e68f3eb-732f-4b0e-b092-560a87ae0118",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_178_Leigh-Woodward_updated.mp3",
  "itunes:image": "",
  "description": "<p><span class=\"auto-style3\">Some Classicists are so passionate about Modernist architecture they create a well-financed, highly effective organization to point out the flaws of Modernist buildings and actively discourage new Modernist projects. Every Classicist we talk to mentions today’s guest, Catesby Leigh, who</span> <span class=\"auto-style3\">has written about architecture for over 30 years</span><span class=\"auto-style4\">. He co-founded the National Classical Art Society, headed by past podcast guest Justin Shubow, which advocates the classical tradition in Federal buildings and monuments.  He's a gifted writer and essayist and organizer, and we're surprised he hasn't won the Henry Hope Reed Award, the Oscar of Classicism, because no one is more deserving. If they accept nominations from us Modernist heathens, we’d like to be first to put his name in the hat.</span> <span class=\"auto-style3\">Later in the show, we sing to, and listen to, the charming Lucy Woodward. </span></p>",
  "content:encoded": "<p>Some Classicists are so passionate about Modernist architecture they create a well-financed, highly effective organization to point out the flaws of Modernist buildings and actively discourage new Modernist projects. Every Classicist we talk to mentions today’s guest, Catesby Leigh, who has written about architecture for over 30 years. He co-founded the National Classical Art Society, headed by past podcast guest Justin Shubow, which advocates the classical tradition in Federal buildings and monuments.  He's a gifted writer and essayist and organizer, and we're surprised he hasn't won the Henry Hope Reed Award, the Oscar of Classicism, because no one is more deserving. If they accept nominations from us Modernist heathens, we’d like to be first to put his name in the hat. Later in the show, we sing to, and listen to, the charming Lucy Woodward. </p>",
  "enclosure": "",
  "itunes:duration": "01:12:21",
  "itunes:explicit": false,
  "itunes:keywords": "Art,architecture,woodward,modernism,catesby,classicist",
  "itunes:subtitle": "Some Classicists are so passionate about Modernist architecture they create a well-financed, highly effective organization to point out the flaws of Modernist buildings and actively discourage new Modernist projects. Every Classicist we talk to...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}