{
  "title": "MERCURY: Accelerating DNN Training By Exploiting Input Similarity. (arXiv:2110.14904v2 [cs.AR] UPDATED)",
  "link": "http://arxiv.org/abs/2110.14904",
  "description": "<p>Deep Neural Networks (DNN) are computationally intensive to train. It\nconsists of a large number of multidimensional dot products between many\nweights and input vectors. However, there can be significant similarity among\ninput vectors. If one input vector is similar to another, its computations with\nthe weights are similar to those of the other and, therefore, can be skipped by\nreusing the already-computed results. We propose a novel scheme, called\nMERCURY, to exploit input similarity during DNN training in a hardware\naccelerator. MERCURY uses Random Projection with Quantization (RPQ) to convert\nan input vector to a bit sequence, called Signature. A cache (MCACHE) stores\nsignatures of recent input vectors along with the computed results. If the\nSignature of a new input vector matches that of an already existing vector in\nthe MCACHE, the two vectors are found to have similarities. Therefore, the\nalready-computed result is reused for the new vector. To the best of our\nknowledge, MERCURY is the first work that exploits input similarity using RPQ\nfor accelerating DNN training in hardware. The paper presents a detailed\ndesign, workflow, and implementation of the MERCURY. Our experimental\nevaluation with twelve different deep learning models shows that MERCURY saves\na significant number of computations and speeds up the model training by an\naverage of 1.97X with an accuracy similar to the baseline system.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Janfaza_V/0/1/0/all/0/1\">Vahid Janfaza</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Weston_K/0/1/0/all/0/1\">Kevin Weston</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Razavi_M/0/1/0/all/0/1\">Moein Razavi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mandal_S/0/1/0/all/0/1\">Shantanu Mandal</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Mahmud_F/0/1/0/all/0/1\">Farabi Mahmud</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hilty_A/0/1/0/all/0/1\">Alex Hilty</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Muzahid_A/0/1/0/all/0/1\">Abdullah Muzahid</a>"
}