{
  "id": "yt:video:YmFTK-rnzfk",
  "yt:videoId": "YmFTK-rnzfk",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Hut burned down, built new one",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2019-08-09T21:06:07+00:00",
  "updated": "2022-02-14T21:39:33+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Hut burned down, built new one",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join me for my first Reddit AMA on Friday 1st November 9am BST / 6pm AEST. My username is u/JohnPlant. The AMA will be on the “r/IAmA” subreddit. \nPrimitive Technology: My hut burned down, so I built new one - Building a hut from scratch.\nGet my new book:  http://po.st/PrimTechBook| Subscribe: http://bit.ly/subPT\nMe building the hut, before it burned down: https://youtube.com/watch?v=Ka2Eu6LxAKo&list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nMy hut burned down after I left a fire untended in it. I needed a new one quickly. Fortunately I had already cleared a new spot earlier in the wet season for such a purpose. I constructed the new hut from wood and palm thatch. It was 3 x 3m in floor plan and a total of 3m high with 1.5m high side walls. 4 posts were put into the ground and a pyramidal roof was built on top of this. The frame was then thatched with palm fronds (which are less flammable than grass thatch but don't tend to last as long in wet weather). After finishing the hut I collected the possessions from the last hut and moved them into the new one. Yams from the garden were dug up but there weren't many due to the soil being compacted and low in organic matter. A yam was cooked by wrapping it in clay and baking it in the hot coals for 30 minutes. Now I have a larger hut where I can continue to make projects despite the minor set back that has just occurred.\n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}