{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-5663750506474401705",
  "published": "2021-11-18T11:41:00.001-08:00",
  "updated": "2021-11-19T08:58:04.914-08:00",
  "title": "Chrome 97: WebTransport, New Array Static Methods and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links. Chrome 97 is beta as of November 18, 2021.</p> <h1>Preparing for a Three Digit Version Number</h1><p>Next year, Chrome will release version 100. This will add a digit to the version number reported in Chrome's user agent string. To help site owners test for the new string, Chrome 96 introduces a runtime flag that causes Chrome to return '100' in its user agent string. This new flag called <code>chrome://flags/#force-major-version-to-100</code> is available from Chrome 96 onward. For more information, see&nbsp;<a href=\"https://developer.chrome.com/blog/force-major-version-to-100/\">Force Chrome major version to 100 in the User-Agent string.</a></p> <h1>Features in this Release</h1> <h2>Auto-expand Details Elements</h2><p>Closed details elements are now searchable and can now be linked to. These hidden elements will also automatically expand when <code>find-in-page</code>, <code>ScrollToTextFragment</code>, and element fragment navigation are used. </p> <h2>Content-Security-Policy Delivery via Response Headers for Dedicated Workers.</h2><p>Dedicated workers are <a href=\"https://www.chromestatus.com/feature/5715844005888000\">now governed by Content Security Policy</a>. Previously, Chrome incorrectly applied the Content Security Policy of the owner document.</p> <h2>CSS</h2><h3 style=\"text-align: left;\">font-synthesis Property</h3><p>The <a href=\"https://www.chromestatus.com/feature/5640605355999232\"><code>font-synthesis</code> CSS property</a> controls whether user agents are allowed to synthesize oblique, bold, and small-caps font faces when a font family lacks oblique, bold, and small-caps faces, respectively. Without the <code>font-synthesis</code> property some web pages that do not have font families with the required variations may have unnatural forms of fonts</p> <h3>transform: perspective(none)</h3><p>The <code>perspective()</code> function now <a href=\"https://www.chromestatus.com/feature/5687325523705856\">supports the value <code>'none'</code> as an argument</a>. This causes the function to behave as though it were passed an argument that is infinite. This makes it easier (or, in some cases, possible) to do animations involving the <code>perspective()</code> function where one of the endpoints of the animation is the identity matrix.</p> <h2>Feature Policy for Keyboard API</h2><p>Chrome supports a <a href=\"https://www.chromestatus.com/feature/5657965899022336\">new <code>keyboard-map</code> value</a> for the allow list of a feature policy. <code>Keyboard.getLayoutMap()</code> helps identify a key pressed key for different keyboard layouts such as English and French. This method is unavailable in iframe elements. The architecture of some web apps (Excel, Word, and PowerPoint) that could not use the Keyboard API can now do so.</p> <h2>HTMLScriptElement.supports() Method</h2><p>The <a href=\"https://www.chromestatus.com/feature/5712146835963904\"><code>HTMLScriptElement.supports()</code> method</a> provides a unified way to detect new features that use script elements. Currently there is no simple way to know what kind of types can be used for the type attribute of <code>HTMLScriptElement</code>.</p> <h2>Late Newline Normalization in Form Submission</h2><p>Newlines in form entries are <a href=\"https://www.chromestatus.com/feature/5654547184746496\">now normalized the same as Gecko and WebKit</a>, solving a long-standing interoperability problem where Gecko and WebKit normalized newlines late, while Chrome did them early. Starting in Chrome 97, early normalization is removed and late normalization is extended to all encoding types.</p> <h2>Standardize Existing Client Hint Naming</h2><p>Chrome 97 standardizes client hint names by <a href=\"https://www.chromestatus.com/feature/6658223894429696\">prefixing them with <code>Sec-CH-</code></a>. Affected client hints are <code>dpr</code>, <code>width</code>, <code>viewport-width</code>, <code>device-memory</code>, <code>rtt</code>, <code>downlink</code>, and <code>ect</code>. Chrome will continue to support existing versions of these hints. Nevertheless, web developers should plan for their eventual deprecation and removal. </p> <h2>WebTransport</h2><p>WebTransport is a protocol framework that enables clients constrained by the Web security model to communicate with a remote server using a secure multiplexed transport.</p> <p>Currently, Web application developers have two APIs for bidirectional communications with a remote server: <code>WebSockets</code> and <code>RTCDataChannel</code>.  <code>WebSockets</code> are TCP-based, thus having all of the drawbacks of TCP (head of line blocking, lack of support for unreliable data transport) that make it a poor fit for latency-sensitive applications.  <code>RTCDataChannel</code> is based on the Stream Control Transmission Protocol (SCTP), which does not have these drawbacks; however, it is designed to be used in a peer-to-peer context, which causes its use in client-server settings to be fairly low.  <code>WebTransport</code> provides a client-server API that supports bidirectional transfer of both unreliable and reliable data, using UDP-like datagrams and cancellable streams. <code>WebTransport</code> calls are visible in the Network panel of DevTools and identified as such in the Type column. </p> <p>For more information, see <a href=\"https://web.dev/webtransport/\">Experimenting with WebTransport</a>. </p> <h1>JavaScript</h1><p>This version of Chrome incorporates version x.x of the V8 JavaScript engine. It specifically includes the changes listed below. You can find a complete <a href=\"https://v8.dev/blog\">list of recent features</a> in the V8 release notes.</p> <h2>Array and TypedArray findLast() and findLastIndex()</h2><p><code>Array</code> and <code>TypedArray</code> now support the <a href=\"https://chromestatus.com/feature/5693639729610752\"><code>findLast()</code> and <code>fileLastIndex()</code> static methods</a>. These functions are analogous to <code>find()</code> and <code>findIndex()</code> but search from the end of an array instead of the beginning.</p> <h1>Deprecations and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Remove SDES Key Exchange for WebRTC</h2><p>The SDES key exchange mechanism for WebRTC has been declared a MUST NOT in the relevant IETF standards since 2013. The SDES specification has been declared historic by the IETF. Its usage in Chrome has declined significantly over the recent year. Consequently <a href=\"https://www.chromestatus.com/feature/5695324321480704\">it is removed</a> as of Chrome 97.</p> <h2>Remove WebSQL in Third-Party Contexts</h2><p><a href=\"https://www.chromestatus.com/feature/5684870116278272\">WebSQL in third-party contexts is now removed</a>. The Web SQL Database standard was first proposed in April 2009 and abandoned in November 2010. Gecko never implemented this feature and WebKit deprecated it in 2019. The W3C encourages <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Storage_API\">Web Storage</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/IndexedDB_API\">Indexed Database</a> for those needing alternatives.</p> <h2>Remove SDP Plan B</h2><p>The Session Description Protocol (SDP) used to establish a session in WebRTC has been implemented with two different dialects in Chromium: Unified Plan and Plan B. Plan B is not cross-browser compatible and <a href=\"https://www.chromestatus.com/features/5823036655665152\">is hereby removed</a>. </p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}