{
  "id": "tag:blogger.com,1999:blog-6747621709757476971.post-2994086368166329103",
  "published": "2022-02-07T09:07:00.005-08:00",
  "updated": "2022-05-31T12:03:31.664-07:00",
  "category": "",
  "title": "STEM Gems Conference Helps Girls Pursue their STEM Dreams",
  "content": "<blockquote>Google Fiber is proud to host guest blogger Stephanie Espy, the author of <a href=\"https://stemgemsbook.com/stem-gems-book/\" style=\"text-decoration-line: none;\">STEM Gems</a> and the founder of the conference of the same name. As a chemical engineer, Stephanie understands the challenges facing women in science and technology. As a sponsor of <a href=\"https://www.eventbrite.com/e/2022-stem-gems-summit-women-empowering-girls-tickets-250369811847\" style=\"text-decoration-line: none;\">this year’s conference</a>, Google Fiber continues to look for new ways to encourage women to pursue careers in STEM. </blockquote><br /><br />Think back to your preteen/teen self. What were your career interests, and why? What inspired you? Who inspired you? Was it a teacher or family member? Was it a summer camp experience? Was it something you saw in a movie or tv show or read in a book or magazine? <br /><br />Women remain underrepresented in STEM fields. Cybersecurity, engineering, computing, data science, and physical sciences are just a few examples of careers where women represent less than a quarter of jobs, in some areas even single digit percentages. If we want to see more girls choosing STEM, it is our responsibility to inspire them early and often. <br /><br />The <a href=\"http://www.stemgemsbook.com/\" style=\"text-decoration-line: none;\">STEM Gems</a> movement is centered on girls and was designed based on my life experiences. As a girl who was stimulated by math and science, I wish I had an organization like STEM Gems to inspire my exploration of STEM careers, introduce me to women in STEM role models, and demonstrate how a STEM career can make a difference in the world and help people.&nbsp; <br /><br />I started this movement by writing the <a href=\"http://www.stemgemsbook.com/buy\" style=\"text-decoration-line: none;\">STEM Gems book</a>, and our programming now includes the STEM Gems Club, Summit, summer camp, and social media campaign. Each component exposes and supports girls with the goal of expanding their STEM fluency and helping them break through stereotypes and build confidence.&nbsp;&nbsp; <br /><br />All too often, girls are not exposed to STEM careers or encouraged to develop the skills necessary to pursue STEM careers. STEM Gems places them at the center of what is possible. I know how critical it is to help girls create their unique STEM footprint as I was able to persist throughout middle and high school, study chemical engineering at MIT and UC Berkeley, and become one of the 3% of underrepresented women of color to earn a bachelor’s degree in engineering. The vision for STEM Gems is to strengthen the pipeline and help to provide the support and structure necessary for girls to see themselves as researchers, innovators, creators, and problem solvers.&nbsp; <br /><br />The <b>STEM Gems Summit: Women Empowering Girls</b> is one way in which girls are inspired to choose STEM careers. The Summit brings together girls and young women, parents, educators, and mentors and introduces them to professional women in a diversity of STEM careers underrepresented by women. The Summit opens with each speaker doing a short “pitch” of their respective STEM career to attendees. The women then share what inspired them to choose their STEM career, their journey to where they are now, how they make a difference in the world using STEM, and advice for girls to create their unique STEM footprint in the world. <br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"415\" src=\"https://www.youtube.com/embed/40MCy3mAu78?rel=0\" width=\"768\"></iframe><br /><br />The <a href=\"https://www.eventbrite.com/e/2022-stem-gems-summit-women-empowering-girls-tickets-250369811847\" style=\"text-decoration-line: none;\">2022 STEM Gems Summit: Women Empowering Girls</a> presented by AWS is co-sponsored by Google Fiber. Our sponsors have enabled us to increase our impact and dream big, reaching girls, parents, and educators across the country in both rural and urban cities. This year’s Summit will be held virtually on Saturday, March 19 at 11am EST / 8am PST. All are encouraged to attend and be inspired by an amazing group of women using STEM to better the world! Register today! (And you can follow STEM Gems on <a href=\"https://www.instagram.com/stemgemsbook/?hl=en\" style=\"text-decoration-line: none;\">Instagram</a>, <a href=\"https://twitter.com/STEMGemsBook\" style=\"text-decoration-line: none;\">Twitter</a>, <a href=\"https://www.linkedin.com/in/stephanie-espy/\" style=\"text-decoration-line: none;\">LinkedIn</a>, or <a href=\"https://www.facebook.com/stemgemsbook/\" style=\"text-decoration-line: none;\">Facebook</a>.) <br /><br />Posted by Stephanie Espy, author of STEM Gems, founder of STEM Gems and MathSP <br /><br /><img height=\"200\" src=\"https://lh5.googleusercontent.com/Tsc4vS8nGo11zcZdU7N8Lun0EXzwQg6lSJJLT0dFcKRJ55dPhBbI4QtIcwvdZ25Q3PEN_-HbnkItHAIbOZElGphsQ1QAL8UuZtVhPtj32Q_vPeRPZW7ZzHVbXBcowFk=w143-h200\" title=\"Stephanie Espy, author of STEM Gems, founder of STEM Gems and MathSP\" width=\"143\" /><br /><br /><br /><br />",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Fiber",
    "uri": "http://www.blogger.com/profile/08137833201549488546",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}