{
  "id": "yt:video:mUrxtsKaqng",
  "yt:videoId": "mUrxtsKaqng",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "The Importance of Injury and Illness Recordkeeping",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-09-20T16:01:24+00:00",
  "updated": "2022-09-22T10:09:40+00:00",
  "media:group": {
    "media:title": "The Importance of Injury and Illness Recordkeeping",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Although OSHA’s injury and illness recordkeeping and reporting rules may seem clear on their face, there are many nuances in the applicable standards that can create challenges to accurately making and maintaining those required records and reports. And the accuracy of injury and illness records could be becoming even more essential in light of the changes OSHA has proposed to the current e-recordkeeping rule, which would increase the availability and use of injury and illness data.\n\nAlready, e-recordkeeping data is collected by OSHA and used in developing and executing its Site-Specific Targeting (“SST”) Program based on an employer’s 300A Summary. Per the changes proposed in the current rulemaking effort, OSHA intends to expand who is required to submit recordkeeping data, what data is collected, and what data is shared with the public. This would result in more employers’ injury and illness data being under the microscope and incorporated into OSHA’s enforcement efforts. Indeed, as COVID-19 recordkeeping continues to drive up DART rates for a number of employers due to the need for COVID-19 positive employees to isolate, more may be pulled in OSHA’s SST Program. Thus, it is important for employers to understand the changes possibly to come in e-recordkeeping, as well as what those changes could mean in the context of evaluating and recording/reporting injuries and illnesses.\n\nParticipants in this webinar learned about:\n\n• Why its more important than ever to get recordkeeping right\n• Requirements for submission to OSHA under the current E-Recordkeeping Rule\n• Enforcement efforts related to injury and illness recordkeeping\n• Proposed changes to the E-Recordkeeping Rule and their impact\n• Examples of recordkeeping challenges\n• Evaluating cases of COVID-19 for recordability and reportability\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}