{
  "id": "tag:blogger.com,1999:blog-3211409948956809184.post-3645904846670669393",
  "published": "2021-11-03T20:31:00.006-07:00",
  "updated": "2021-11-03T20:51:23.642-07:00",
  "title": "Having fun with Macaw - or - Dinosaurs meat is sour!",
  "content": "<p>&nbsp;Following the <a href=\"https://pnw.ai/article/question-answering-ai-macaw-outperforms-gpt-3-by-more-than-10-percent/69436699\" target=\"_blank\">announcement from Prof. Oren Etzioni</a> about their new Macaw NLP model which should be up to 10% better than OpenAI's model, I spent a fun afternoon playing with the <a href=\"https://github.com/allenai/macaw\" target=\"_blank\">released model</a>.</p><p>So far 3 models have been released: large, 3b and 11b. Documentation says large is a lightweight model (indeed a good naming convention here) and should not be fully trusted, the other ones are 3b (medium) and 11b (the big one).</p><p>I started with the large model and my conclusion that besides solving the demo question about the sky's color, it is completely non functional.&nbsp;&nbsp;</p><ul style=\"text-align: left;\"><li>Who killed Jesus? The romans (correct)</li><li>Who is Carlos Guestrin? a leading authority on space and human exploration (wrong)</li><li>Who is Oren Etzioni? a leading authority on migration and conservation&nbsp; (wrong)</li><li>What is Belgian Malinois? a kind of dog that carries a large amount of weight (wrong)</li><li>Who came first the Romans or the Greeks? The Romans (wrong)</li><li>What is the population of Israel? 2.4 Billion (wrong)</li><li>Who is larger a bird or an elephant? the bird, the elephant (wrong)&nbsp;</li><li>Who is Benjamin Netanyahu? &nbsp;the prime minister of new york (funny and wrong)</li><li>Are you drunk? Yes (maybe right?)</li><li>Name a book by Alexander Dumas? The Comedy of Errors (again wrong).</li></ul><div>To summerize since the model is so often wrong, it would help to get an additional confidence estimation that tells you that the answer is most likely junk.</div><div><br /></div><div>After getting familiar with the small and weird model I moved to the medium model and continued to have fun there.    <ul><li>How many cents in one dollar? 100 (correct) </li><li>What is the main cause of global warming? greenhouse effect (correct). Some other good answers: volcanic eruptions (B) ocean currents (C) soil erosion (D) human population growth</li><li>What is the best vertical to open a startup in machine learning? healthcare, additional answers: (A) finance (B) healthcare (C) retail (D) technology. Not bad! Not that some answers are repeating, there is no pruning of answers.</li><li>What should I do when my boss is upset with me at work? apologize. Additional options: (A) leave the office (B) <b>call the police </b>(C) <b>go to the mall </b>(D) stay late. I like the apologize and stay late! Call the police answer is hilarious. And go to the mall is the favorite approach of my wife!</li><li>What is the best way to defend against Covid virus vaccinating (correct). Additional answers: (A) using a flu vaccine (B) using a tetanus shot (C) using a gamma ray to destroy the virus (D) using a gamma ray to destroy the virus.  </li><li>What is the recommended number of whiskey shots to drink before driving? Two (wrong!) </li><li>If I love her does she love me back? yes (wrong) Additional answers start to look better: (A) she will love me back (B) she will hate me (C) she will leave me (D) she will never love me. </li><li>How many calories in marble ball? 0 (correct) </li><li>Who is the best venture capital firm? SBI (wrong, never heard of them) </li><li>What is the taste of dinosaur meat? sour ; Additional option (A) salty (B) sweet (C) savory (D) <b>a little bit sour.</b> Who knows? </li><li>Is there life on other planets? yes. Additional option (A) no life is found on other planets (B) there is life on other planets (C) there is life on Mars (D) there is life on other planets. Who knows? </li><li>Were there weapons for mass destruction in Iraq? yes (wrong). Additional options (A) no weapons of mass destruction were found in Iraq (B) there were no weapons of mass destruction in Iraq (C) there were weapons of mass destruction in Iraq but they were destroyed (D) there were weapons of mass destruction but they were not destroyed. Interestingly both Iraq and Mars are capital letters (probably identified name entities) while some entities are in small letters.</li><li>Who is behind the nine eleven attack? al qaeda (correct). Additional conspiracies (A) the government (B) the military (C) the intelligence community (D) the religious right </li><li>What year will the aliens attack us?&nbsp;<b>2100</b>. Who knows? </li><li>Do ghosts exist? yes. Additional options: (A) they are just a kind of animal (B) they are made of air (C) they are made of water (D) they exist in the sky. </li></ul><div>To conclude some answers are totally correct and some answers are totally hilarious. Maybe one should invent a don't know answer where the confidence is very low give it instead.</div><div><br /></div><div>The handling of keyword names is a bit weird, for example Iraq with capital letters but new york and al qaeda without. I wonder if there is a post processing the puts some named entities as capital letters?</div><div><br /></div><div>In terms of running time the models are pretty slow. It take s a couple of minutes on the latest Mac M1 to get an answer.</div><div>I will next try to test 11b model, it is 40Gb and thus slooooow to download locally.</div>  </div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Danny Bickson",
    "uri": "http://www.blogger.com/profile/01517237836051035400",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}