{
  "title": "Expected Signature For the Lorentz Invariance Violation Effects on $\\gamma-\\gamma$ Absorption. (arXiv:2211.01836v1 [astro-ph.HE])",
  "link": "http://arxiv.org/abs/2211.01836",
  "description": "<p>There are still some important unanswered questions about the unexpected very\nhigh energy $\\gamma$-ray signatures. To help understand the mechanism, focusing\non the linear and quadratic perturbation mode for subliminal case, the present\npaper revisited the expected signature for the Lorentz invariance violation\neffects on $\\gamma-\\gamma$ absorption in TeV spectra of Gamma-ray bursts\n(GRBs). We note that the existence of minimum photon energy threshold for the\npair production process leads up to a break energy, which is sensitive to the\nquantum gravity energy scale. We suggest that energy spectral break in the few\ntens of TeV is a rough observational diagnostic for the LIV effects. The\nexpected spectra characteristics are applied to a GRB 221009A. The results show\nthat the cosmic opacity with Lorentz invariance violation effects considered\nhere is able to roughly reproduce the observed $\\gamma$-ray spectra for the\nsource, which enabled us to constrain the lower limit of the linear values of\nenergy scale at $E_{\\rm QG,1}=3.35\\times10^{20}$ GeV for the linear\nperturbation and $E_{\\rm QG,2}=9.19\\times10^{13}$ GeV for the quadratic\nperturbation. This value corresponds to a break energy $E_{\\rm \\gamma,\nbreak,1}\\simeq 55.95~\\rm TeV$ for the linear and $E_{\\rm \\gamma, break,2}\\simeq\n73.66~\\rm TeV$ for the quadratic in the observed frame respectively.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Zheng_Y/0/1/0/all/0/1\">Y.G. Zheng</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kang_S/0/1/0/all/0/1\">S.J. Kang</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Zhu_K/0/1/0/all/0/1\">K.R. Zhu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Yang_C/0/1/0/all/0/1\">C.Y. Yang</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bai_J/0/1/0/all/0/1\">J.M. Bai</a>"
}