{
  "title": "Q&A: Melissa Nobles on guest-editing Nature to examine racism in science",
  "link": "https://news.mit.edu/2022/nobles-nature-racism-science-1019",
  "description": "MIT chancellor and colleagues help lead special project examining how bias has distorted the scientific enterprise — and how to make things better.",
  "pubDate": "Wed, 19 Oct 2022 11:00:00 -0400",
  "guid": "https://news.mit.edu/2022/nobles-nature-racism-science-1019",
  "dc:creator": "Peter Dizikes | MIT News Office",
  "content:encoded": "<p><em>The venerable British journal </em>Nature<em> is publishing four special issues in 2022 that delve into matters of racism and science, including the way racist thinking has imbued the content of biological thinking, the downplaying of knowledge accumulated by non-Western societies, and the exclusion of people of color from the scientific establishment. </em></p>\n\n<p></p>\n\n<p><em>MIT Chancellor Melissa Nobles is one of four guest editors of these issues, along with Elizabeth Wathuti, an environmental and climate activist from Kenya and founder of the Green Generation Initiative; Chad Womack, a scientist, vice-president of national STEM programs and Tech initiatives at the education philanthropic charity UNCF, in Washington DC, and founder of the Ernest E. Just Life Science Initiative and Society; and Ambroise Wonkam, professor of genetic medicine and director of the McKusick-Nathans Institute and the Department of Genetic Medicine at Johns Hopkins University. These are the first signed guest editorials in </em>Nature’s<em> 153-year history; the first special issue is being published today. </em></p>\n\n<p></p>\n\n<p>MIT News<em> discussed the series with Nobles — who, before becoming chancellor, served as head of the Department of Political Science and dean of the School of Humanities, Arts, and Social Sciences. </em></p>\n\n<p></p>\n\n<p><strong>Q: </strong>What is it that <em>Nature</em> has asked you to do here, as a scholar, along with the team it assembled?</p>\n\n<p></p>\n\n<p><strong>A:</strong> <em>Nature</em> wanted to <a href=\"https://www.nature.com/articles/d41586-022-01527-z\" target=\"_blank\">think critically</a>, examine the past, and also think about the future. Their editorial board invited the four of us to be guest editors and help them think through the question, how should <em>Nature</em> discuss racism in science? They gave us a lot of leeway. As organizers we thought broadly, providing different views about how important history has been in shaping our current moment, and then thinking about how we can get past this. For instance, we commissioned one article that discusses efforts at U.K. universities to make changes in the scientific curriculum. There are two guest editorials, one published in June and one out today, and four special issues, the first of which appears today.</p>\n\n<p></p>\n\n<p><strong>Q: </strong>What are the main topics that you examine in these editorials and special issues — and, by extension, that we should examine when we think about the presence of racism in science?</p>\n\n<p></p>\n\n<p><strong>A:</strong> A large part of what concerned us has two components: One is the way in which racist ideas have helped to form scientific knowledge itself. So, for example, in the first editorial, we point to the eugenics movement and efforts to create a “scientific” rationale for racial hierarchies, looking back at figures such as the statistician and eugencist Francis Galton, and examining the roots of such thinking.</p>\n\n<p></p>\n\n<p>Another aspect is calling attention to all of the history that has been denied, the ways in which science was so circumscribed in its meaning that the contributions of all non-Western civilizations were either ignored or minimized — even if Western scientists were building on local knowledge and borrowing from indigenous people. They were simultaneously colonizing and ignoring other contributions, not only from Africans, but Latin Americans, Asians, and indigenous peoples throughout the world. Our message is that science is a human endeavor, and that requires taking in all human knowledge.</p>\n\n<p></p>\n\n<p>Our second editorial, today, is about diversity as a scientific imperative. Not out of charity, but because science is better when it takes into account the diversity of human knowledge and abilities. Relatedly, we’re also exploring the experiences of people of color in scientific professions, as well as presenting straight numbers about how many people of color are in scientific professions. The situation is substantively dismal in the U.S., but we have some of the best data in the world. In the U.K., South Africa, India, and other parts of the world, for example, the situation appears to be worse, and we have worse data. Data collection is so bad in some places and nonexistent in others that we really don’t even know the scope of the problem.</p>\n\n<p></p>\n\n<p><strong>Q: </strong>Given that many people practice science with at least the intention of performing value-neutral inquiry, are there difficulties in starting a dialogue about the biases within science?</p>\n\n<p></p>\n\n<p><strong>A: </strong>We think about science being neutral, but so often, people have an idea of what a scientist looks like, or who’s qualified to be a scientist, and that often comes with preconceptions about color. We’re trying to explode those myths. If science belongs to everyone, with a spirit of inquiry and methods that can be learned to explain the natural world and human life, there can be many different people involved.</p>\n\n<p></p>\n\n<p>An additional question, and this can be a contentious debate, is how much you consider or weigh the larger context in which science is created, or do you offer an account of science that seemingly rides above history — that is, scientists talking to each other across the centuries, unencumbered by experiences. Our approach doesn’t endorse the latter, and by my lights, I think most people believe we must take into account the ways scientific endeavors are socially, politically, and historically rooted.</p>\n\n<p></p>\n\n<p>Meanwhile, science is also evolving — in terms of the type of data we have, how we process and interpret data, the means of discovery through new instruments, and the appreciation of different ways of knowing. And that’s what we’re calling for, a widening of the aperture of the scientific imagination. Our approach is accompanied by the acknowledgement that, for all we have accomplished as humans, we also have done a lot of damage, and there is a lot of work still to do. We’re calling for a wide lens in viewing these topics, and a generosity of spirit.</p>\n\n<p></p>\n\n<p><strong>Q:</strong> One of the aims of the series, as stated in the first guest editorial, is to “provide readers with hope and optimism.” What are examples of this?</p>\n\n<p></p>\n\n<p><strong>A:</strong> As we detail in one issue, some schools in the U.K. are rethinking how they’re teaching science, including incorporating new figures into the history of science, because there were many people whose work and intellectual contributions were not recognized. There is more than one woman in the history of science, beyond Madame Curie. Indeed, there were many women working in laboratories or as calculators, and part of this reexamination is just repopulating our imagination as to who was involved, not based on fantasy, but by giving due recognition. That’s something we think is hopeful because it begins to complicate the history of science in a useful way.</p>\n\n<p></p>\n\n<p>In terms of who is doing science today, we can work to understand who is being excluded and what obstacles they face. We can examine computer science and emerging technologies like AI and say, “If we’re not being careful, we’re going to make the same mistakes,” if we don’t deal with the nondiversification of this field. It’s hopeful, though it’s also a warning about the future.</p>\n\n<p></p>\n\n<p><strong>Q.</strong> As chancellor of MIT, you focus on student life and learning at the Institute. How do the subjects and themes of the special <em>Nature</em> issues relate to today’s MIT students?</p>\n\n<p></p>\n\n<p><strong>A. </strong>I would want the MIT community to be interested in, among other things, the topline of our second editorial, the one appearing today, which holds that diversity is a scientific imperative. Looking forward, being diverse goes with greater collaboration across disciplines to help address our complex societal problems. We’re also suggesting that the composition of people participating in these endeavors matters, and we ought to be concerned about having a scientific population who can bring diverse experiences and points of view to bear on problem-solving. We think it makes for better science.</p>\n\n<p></p>\n\n<p>In some ways our students are demanding that. I think many students in this generation come in with a disposition that’s more inclined toward collaboration and diversity, and we ought to celebrate that. Each one of those students sees themselves as part of a larger story. We have a campus of students from everywhere in the United States and all over the world, and we want to make clear that MIT can work for everybody.</p>",
  "media:content": {
    "media:description": "“Our message is that science is a human endeavor, and that requires taking in all human knowledge,” says MIT Chancellor Melissa Nobles, who is one of four guest editors of special issues of Nature.",
    "media:credit": "Photo: Gretchen Ertl"
  },
  "category": [
    "Interview",
    "Political science",
    "Chancellor",
    "Faculty",
    "Social justice",
    "Diversity and inclusion",
    "History of science",
    "Race and gender",
    "School of Humanities Arts and Social Sciences",
    "Women in STEM"
  ]
}