{
  "title": "Open-sourcing TAOBench: An end-to-end social network benchmark",
  "link": "https://engineering.fb.com/2022/09/07/open-source/taobench/",
  "dc:creator": "",
  "pubDate": "Wed, 07 Sep 2022 16:30:20 +0000",
  "category": [
    "Core Data",
    "Open Source"
  ],
  "guid": "https://engineering.fb.com/?p=19313",
  "description": "<p>What the research is: The continued emergence of large social network applications has introduced a scale of data and query volume that challenges the limits of existing data stores. However, few benchmarks accurately simulate these request patterns, leaving researchers in short supply of tools to evaluate and improve upon these systems.  To address this issue, [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2022/09/07/open-source/taobench/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2022/09/07/open-source/taobench/\">Open-sourcing TAOBench: An end-to-end social network benchmark</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
  "content:encoded": "<h2><span style=\"font-weight: 400;\">What the research is:</span></h2>\n<p><span style=\"font-weight: 400;\">The continued emergence of large social network applications has introduced a scale of data and query volume that challenges the limits of existing data stores. However, few benchmarks accurately simulate these request patterns, leaving researchers in short supply of tools to evaluate and improve upon these systems. </span></p>\n<p><span style=\"font-weight: 400;\">To address this issue, we are open-sourcing </span><a href=\"http://taobench.org\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">TAOBench</span></a><span style=\"font-weight: 400;\">, a new benchmark that captures the social graph workload at Meta. We’re making </span><a href=\"https://github.com/audreyccheng/taobench\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">workload configurations</span></a><span style=\"font-weight: 400;\"> available, as well as a benchmarking framework that leverages these request features to accurately model production workloads and generate emergent application behavior. We’re ensuring the integrity of TAOBench’s workloads by validating them against their production counterparts. Furthermore, we’re describing several benchmark use cases at Meta and reporting results for five popular distributed database systems to demonstrate the benefits of using TAOBench to evaluate system trade-offs and to identify and address performance issues. Our benchmark fills a gap in the available tools and data that researchers and developers have to inform system design decisions.</span></p>\n<h2><span style=\"font-weight: 400;\">How it works: </span></h2>\n<p><span style=\"font-weight: 400;\">Since benchmarks are only as useful as the workloads they are derived from, we have identified five properties that should be captured by their request patterns. A comprehensive social network benchmark should:</span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Accurately emulate social network requests</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Capture any transactional requirements</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Express data colocation preferences and constraints</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Model request distributions without prescriptive query types</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Exhibit multitenant behavior on shared data</span></li>\n</ol>\n<p><span style=\"font-weight: 400;\">To satisfy these properties, we profile requests served by </span><a href=\"https://engineering.fb.com/2013/06/25/core-data/tao-the-power-of-the-graph/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">TAO</span></a><span style=\"font-weight: 400;\">, an online graph data store at Meta.</span></p>\n<p><span style=\"font-weight: 400;\">TAO is a read-optimized, geographically distributed data store that provides access to the social graph for diverse products and back-end systems. In aggregate, TAO serves over 10 billion requests per second on a changing dataset of many petabytes. Its workload contains a variety of notable attributes. For example, read and write skew often manifests on different keys: Over 99 percent of data items that are frequently written to are, on average, read less than once per day. </span></p>\n<p><span style=\"font-weight: 400;\">To accurately generate TAO’s workloads at a flexible scale, we characterize these request patterns and identify a small set of parameters, including transaction size, key to shard mapping, and frequency of operation types, that are sufficient to replicate production workloads. We then leverage these features in TAOBench to both accurately downscale Meta’s social network workload and model emergent application behavior. Our parametrized framework is open source and extensible, allowing it to simulate a range of different request patterns.</span></p>\n<p><span style=\"font-weight: 400;\">To illustrate TAOBench’s applicability, we report on how Meta uses this tool to test new features, optimizations, and reliability (e.g., hotspots, worst-case scenarios) as well as experiment with speculative workloads that would otherwise be difficult or infeasible to assess in production.</span></p>\n<p><span style=\"font-weight: 400;\">We provide four examples:</span></p>\n<ol>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Analyzing new transaction use cases</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Assessing contention under longer lock hold times</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Evaluating new APIs</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Quantifying the performance of high fan-out transactions</span></li>\n</ol>\n<p><span style=\"font-weight: 400;\">Furthermore, we provide the results for TAOBench on five widely used distributed databases (Cloud Spanner, CockroachDB, PlanetScale, TiDB, YugabyteDB) to demonstrate how our benchmark can be used to study performance trade-offs and identify optimization opportunities. </span></p>\n<h2><span style=\"font-weight: 400;\">Why it matters: </span></h2>\n<p><span style=\"font-weight: 400;\">Despite the ubiquity of social networks, there is a lack of publicly available, realistic workloads to guide research on their underlying database infrastructure. In academia, this scarcity makes it difficult to probe the limits of existing systems and develop novel mechanisms to overcome them. In industry, it is challenging for practitioners to evaluate new features and resolve issues without a way to reproduce these request patterns. To address the gap in representative workloads, we present TAOBench, the first open source benchmark that generates end-to-end, transactional request patterns derived from a large-scale social network. With our benchmark, we make Meta’s social graph workload accessible to the database community and provide visibility into the real-world challenges of supporting such workloads.</span></p>\n<h2><span style=\"font-weight: 400;\">Read the full paper:</span></h2>\n<p><a href=\"https://www.vldb.org/pvldb/vol15/p1965-cheng.pdf\" target=\"_blank\" rel=\"noopener\">TAOBench: An end-to-end benchmark for social network workloads</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2022/09/07/open-source/taobench/\">Open-sourcing TAOBench: An end-to-end social network benchmark</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
  "post-id": 19313
}