{
  "title": "Twitter is reportedly working on paid DMs to celebrities",
  "link": "https://www.digitaltrends.com/social-media/twitter-is-reportedly-working-on-paid-dms-to-celebrities-feature/",
  "pubDate": "Fri, 04 Nov 2022 19:50:57 +0000",
  "dc:creator": "Anita George",
  "category": [
    "Computing",
    "News",
    "Social Media",
    "direct messaging",
    "Elon Musk",
    "social media apps",
    "social media section",
    "Twitter"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220308",
  "description": "Twitter is reportedly working on another feature to help generate revenue. This time it involves paid DMs to celebrities.",
  "content:encoded": "<p>In what appears to be another effort to help Twitter generate revenue <a href=\"https://www.digitaltrends.com/social-media/elon-musk-finally-in-charge-of-twitter-reports-say/\">at the start of its Elon Musk era</a>, the social media platform is reportedly working on paid Direct Messaging (DM), with a particular emphasis on those paid messages being sent to celebrities.</p>\n<p>On Thursday, <a href=\"https://www.nytimes.com/2022/11/03/technology/elon-musk-twitter-money-finances.html\" target=\"_blank\" rel=\"noopener\">The New York Times published a report</a> in which it mentioned that &#8212; according to internal documents it saw and &#8220;two people with knowledge of the work&#8221; &#8212; that Twitter was working on a paid DM feature that would allow users to send messages to celebrities for a fee. The fee structure for this feature apparently hasn&#8217;t been officially finalized yet, but The Times did note that it could be &#8220;as little as a few dollars per direct message.&#8221;</p>\n<p>A few more details regarding the in-progress feature were also shared in the report:</p>\n<ul>\n<li>Twitter would likely receive a portion of the fees.</li>\n<li>It&#8217;s possible that these paid messages would &#8220;appear in a special area of the direct message inbox.&#8221; Celebrities would have to elect to receive such messages.</li>\n</ul>\n<p>And as with other in-progress features, the report also noted that &#8220;there is no guarantee that the product will launch.&#8221; Whether it launches or not, the attempt to create a paid DMs feature is a clear bid to quickly generate revenue after Musk&#8217;s costly deal to buy the platform.</p>\n<p>And it&#8217;s not the only feature geared toward creating new revenue streams: The Musk era of Twitter, which began just last week, has already seen a number of proposed/in-progress changes to the popular microblogging platform, including <a href=\"https://www.digitaltrends.com/social-media/twitter-blue-is-losing-ad-free-articles-and-musks-latest-tweets-indicate-further-changes/\">a revamped Twitter Blue with a new (higher) subscription price</a>, paid verification badges, and even paywalled videos. None of these changes are live yet, but Twitter is working on them.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2020/11/sony-xperia-5-ii-twitter-app.jpg?p=1",
  "enclosure": "",
  "post-id": 3220308
}