{
  "title": "72: Three Identical Strangers",
  "link": "https://audioboom.com/posts/7157095",
  "itunes:episode": 72,
  "itunes:title": "Three Identical Strangers",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3324,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Three strangers are reunited by astonishing coincidence after being born identical triplets, separated at birth, and adopted by three different families. Their jaw-dropping, feel-good story instantly becomes a global sensation complete with fame and celebrity, however, the fairy-tale reunion sets in motion a series of events that unearth the unimaginable secret behind their separation. </p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Binge our 40+ bonus episodes via Patreon!</a> When you join our Patreon fam, you not only support us, you also <strong>INSTANTLY get our entire catalog of bonus episodes</strong>, including our episode-by-episode coverage of <strong>\"SERIAL,\" \"THE JINX,\" \"THE STAIRCASE,\" and \"MAKING A MURDERER.\"</strong> You also get our <strong>interviews with Asia McClain</strong> (Adnan Syed's alibi witness), <strong>Rabia Chaudry,</strong> \"Tower\" director Keith Maitland, all of our mini-episodes, extended outtakes, <strong>AND full bonus episodes</strong> covering \"Madonna: Truth or Dare\" and \"The Queen of Versailles.\" <strong>AND IT'S ALL COMMERCIAL FREE!</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join here!</a></p>\n\n\n<p><strong>WANT TO SEE US LIVE?</strong> <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Go Here</a> for information and tickets to our upcoming live events like our February live shows or our Pride show in June!</p>\n\n\n<p><strong>LOOKING FOR OUR ADVERTISERS / PROMO CODES?</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Go Here!</a> We now have a whole page of our site for you to check out and <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">GET. THOSE. DISCOUNTS!</a></p>\n\n\n<p><strong>THIS WEEK'S PALATE CLEANSER</strong> is called \"I Will Never Leave You\" and is from the Original Broadway Cast Recording of \"Side Show\" starring Alice Ripley and Emily Skinner. It was recommended by my SHH.</p>\n",
  "pubDate": "Tue, 29 Jan 2019 05:01:00 +0000",
  "guid": "tag:audioboom.com,2019-01-29:/posts/7157095",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}