{
  "id": "tag:blogger.com,1999:blog-5825758052688213474.post-8391093797732166139",
  "published": "2018-01-16T18:04:00.002-08:00",
  "updated": "2022-04-06T09:07:52.749-07:00",
  "title": "Designing A/B tests in a collaboration network",
  "content": "by SANGHO YOON<br /><br /><br /><i>In this article, we discuss an approach to the design of experiments in a network. In particular, we describe a method to prevent potential contamination (or inconsistent treatment exposure) of samples due to network effects. We present data from Google Cloud Platform (GCP) as an example of how we use A/B testing when users are connected. Our methodology can be extended to other areas where the network is observed and when avoiding contamination is of primary concern in experiment design. We first describe the unique challenges in designing experiments on developers working on GCP. We then use simulation to show how proper selection of the randomization unit can avoid estimation bias. This simulation is based on the actual user network of GCP.</i><br /><span id=\"docs-internal-guid-188b50a0-e687-23fe-abf4-60d956055494\"><br /></span><br /><h2>Experimentation on networks</h2>A/B testing is a standard method of measuring the effect of changes by randomizing samples into different treatment groups. Randomization is essential to A/B testing because it removes selection bias as well as the potential for confounding factors in assessing treatment effects.<br /><br />At Google, A/B testing plays a key role in better understanding our users and products. With A/B testing, we can validate various hypotheses and measure the impact of our product changes, allowing us to make better decisions. Of course, A/B testing is not something new in our field, as it has been adopted by many tech companies. But due to the large scale and complexity of data, each company tends to develop its own A/B test solution to solve its unique challenges. One particular area involves experiments in marketplaces or social networks where users (or randomized samples) are connected and treatment assignment of one user may influence another user's behavior.<br /><br />Typical A/B experiments assume that the response or behavior of an individual sample depends only on its own assignment to a treatment group. This is known as the Stable Unit Treatment Value Assumption (SUTVA). However, this assumption no longer holds when samples interact with each other, such as in a network. An example of this is when the effects of exposed users can spill over to their peers. This is the case for experiments on the Google Cloud Platform.<br /><br /><a href=\"https://cloud.google.com/\">Google Cloud Platform</a> (GCP) offers a suite of products that enable developers to work on their projects in the cloud. GCP also provides great flexibility to developers in sharing their resources and projects, with tools to protect and control their security and privacy. We find that users in GCP naturally form collaboration networks to work on shared projects and this in turn improves efficiency in managing their resources. Our goal is to leverage this network structure in designing and analyzing experiments to improve the GCP product.<br /><br />One salient requirement we impose on experiment design is that the experience of all users who collaborate with each other be consistent. This is critical to our highly collaborative product. For example, imagine a situation where two users collaborate on a shared project. One user sees a new feature to enable a firewall, but the other user doesn’t see the same option available. This could create confusion. Such an undesired effect is not only bad for user experience, it also hinders us measuring the <b>true&nbsp;</b>average treatment effect&nbsp;of the new firewall feature. Thus, the requirement is to provide a consistent user experience for the following two types of treatment exposure:<br /><div><ul><li><b>Direct exposure</b>: Every user must have a consistent experience across all GCP projects that he or she owns, manages, or collaborates in.&nbsp;</li><li><b>Indirect exposure</b>: Any two users who collaborate on a project must have the same experience.</li></ul>The graph of user collaboration can be separated into distinct connected components (hereafter referred to as \"components\"). In order to satisfy these consistency requirements, we choose to use the component as our randomization unit in experiment design.<br /><br />While the collaboration networks in Google Cloud Platform bear similarities to components of social networks (e.g. Facebook, Twitter, LinkedIn, Google+), there are significant differences. Two fundamental differences are described below:<br /><ul><li><b>A few large connected networks versus many connected components</b>: Users in social networks are linked to each other through their common friends. Methodologies for experimenting on users in social networks focus on ways to partition the overall graph into subgraphs, and then to run randomized experiments on these subgraphs. Severing edges is necessary because the largest connected components of the graph are typically very large. In GCP, however, we observe many small connected components because our customers want to manage their own privacy and security in their projects, and do not want to share access with third parties.</li><li><b>Spillover effects versus contamination</b>: Experiments in social networks must care about \"spillover\" or influence effects from peers. These spillover effects are a fundamental aspect of user behavior in a social network. Thus, the effect comes from both direct exposure of each treated individual, and indirect exposure from his or her peers. Such spillover effects also exist in the GCP user collaboration network but they are of secondary importance. In our case, avoiding confusion is more important than estimating indirect treatment effects. For example, imagine the confusion resulting from two users who work on a shared project but see two different versions. We need to avoid these effects rather than estimate them.</li></ul></div><br /><h2>Structure of the user collaboration network</h2>As mentioned earlier, users in GCP collaborate with other developers via shared projects. Projects are linked to a Google Cloud billing account for proper resource management and billing. Since a project can be linked to at most one billing account, the project-to-billing account relationship is nested. However, a user can work on multiple projects.The user-to-project relationship is not necessarily nested. Rather, users can have membership in multiple projects. Therefore the relationship among billing account, project and user is complex. Figure 1 illustrates these three entities.<br /><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://3.bp.blogspot.com/-QfwFNR7tU5k/Wl6z1SAwnGI/AAAAAAAAcrU/fFOqv08cOv8eWSoNYlkGUSgOS724pVm5ACLcBGAs/s1600/sangho2.png\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"275\" data-original-width=\"624\" height=\"282\" src=\"https://3.bp.blogspot.com/-QfwFNR7tU5k/Wl6z1SAwnGI/AAAAAAAAcrU/fFOqv08cOv8eWSoNYlkGUSgOS724pVm5ACLcBGAs/s640/sangho2.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\">Figure 1. Connected components: an advanced account with multiple billing accounts managing separate sets of projects (left), a developing account with multiple projects (middle), and a new account (right)</td></tr></tbody></table><br />Since users can be connected via shared projects, we also need to track another entity, the component of the graph to which any user belongs. A user can be associated with exactly one component. Figure 2 shows that the user collaboration graph has three distinct components.<br /><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://3.bp.blogspot.com/-gMnrEuuLJeE/Wl625X8TJ6I/AAAAAAAAcrg/JvEffkVnzpI9gVb1t0dU_0totrxY2lGVwCLcBGAs/s1600/Sangho3.png\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"322\" data-original-width=\"564\" height=\"364\" src=\"https://3.bp.blogspot.com/-gMnrEuuLJeE/Wl625X8TJ6I/AAAAAAAAcrg/JvEffkVnzpI9gVb1t0dU_0totrxY2lGVwCLcBGAs/s640/Sangho3.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\">Figure 2. Hierarchy: component → account → project → user</td></tr></tbody></table><h2><br />Designing experiments on the collaboration network</h2>The hierarchical structure of the collaboration network makes it clear that we must use component as the unit of randomization in our experiments. This is necessary to provide guarantees on treatment consistency. However, the downside of using a larger unit of randomization is that we lose experimental power. This comes from two factors: fewer experimental units, and greater inherent difference across experimental units.<br /><br />Figure 3 shows distribution of project size, as measured in # users per project, and the distribution of # of project per user (axes have been removed for confidentiality). These contribute to the structure and size of components. We see here indications of large differences in size and structure of components. These differences tend to increase the variance of our estimates and hence lose us statistical power.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-9fjoPq07hOQ/Wl643XJRD7I/AAAAAAAAcr0/wA_NXaTF9ikodROngLigGNKlaXQKR6M3QCLcBGAs/s1600/Sangho3.1.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1600\" height=\"320\" src=\"https://3.bp.blogspot.com/-9fjoPq07hOQ/Wl643XJRD7I/AAAAAAAAcr0/wA_NXaTF9ikodROngLigGNKlaXQKR6M3QCLcBGAs/s320/Sangho3.1.png\" width=\"320\" /></a></div><br /><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-jCA2qmXd_Ag/Wl643GkY9kI/AAAAAAAAcrw/Inoij1AX0oYQOEua7bEJUSi_IGfXT6DlwCEwYBhgL/s1600/sangho3.2.png\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1600\" height=\"320\" src=\"https://1.bp.blogspot.com/-jCA2qmXd_Ag/Wl643GkY9kI/AAAAAAAAcrw/Inoij1AX0oYQOEua7bEJUSi_IGfXT6DlwCEwYBhgL/s320/sangho3.2.png\" width=\"320\" /></a></td></tr><tr><td class=\"tr-caption\"><br />Figure 3: # of users (per project) and # of projects (per user)<br /><br /></td></tr></tbody></table>One way to mitigate this loss of power is to cluster samples into more homogeneous strata and sample proportionately from each stratum. We define strata based on two features: number of users and \"usage\", a measure of the aggregate user activity in the network. These two properties were selected because they correlate strongly with experiment metrics of greatest interest.<br /><div><div><br />By drawing a fixed fraction of units from each stratum, we achieve better balance across treatment groups, and hence reduce variance in our estimates. In addition, stratified sampling helps us obtain representative samples when the sampling rate is low.<br /><br />The overall procedure of our methodology for stratified random sampling is described as follows:<br /><ol><li><b>Build user graphs</b>: Find all the components in the current collaboration network.</li><li><b>Stratify graphs by size and usage</b>: Measure the size of each component by number of users and revenue and stratify graphs in number of users and revenue.</li><li><b>Select samples and random assignment</b>: Randomly sample a fraction of components in each stratum from Step 2 depending on the size of a study. Then randomly assign them to a treatment arm. For example, if we wish to run an experiment with a 5% arm for treatment and 5% for control, we first select a random 10% of components from each stratum, and subsequently assign them 50-50 to treatment and control groups. Each user, project and account inherits the experiment group from the component to which they belong.</li><li><b>Run experiment</b>: Steps 2 and 3 are repeated daily after the graph has been updated, and new components properly also randomized.</li></ol>The description above assumes that while new components may emerge over the course of the experiment, the topology of existing components will remain unchanged during this time. As discussed later, this is not entirely the case.&nbsp; Figure 4 is a visual representation of these steps.</div><div><br /></div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgXSjtfHH6RIQ0Eayu443zQnc3ZI3OKPTvXy7_JvptBrJXGNjC4RTTnUMoEngpy3WIGp8mArARyw99MyDhRqViFn_dtbv-EE3VChfFKJGFxjxVqDd2DVJIjYCRd8O-WDfqXQ_bQcZZPWrToVrJ8hbXkNjr6CoFg0i_BjmPkHPnXjC0jufTKsHwTWmfA-g/s967/Fig%204.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"407\" data-original-width=\"967\" height=\"270\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgXSjtfHH6RIQ0Eayu443zQnc3ZI3OKPTvXy7_JvptBrJXGNjC4RTTnUMoEngpy3WIGp8mArARyw99MyDhRqViFn_dtbv-EE3VChfFKJGFxjxVqDd2DVJIjYCRd8O-WDfqXQ_bQcZZPWrToVrJ8hbXkNjr6CoFg0i_BjmPkHPnXjC0jufTKsHwTWmfA-g/w640-h270/Fig%204.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><span id=\"docs-internal-guid-991fe212-7fff-75fc-1f42-0487cb1d83c4\"><p dir=\"ltr\" style=\"line-height: 1.38; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"color: #4e4e4e; font-family: Roboto, sans-serif; font-size: 11.5pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\">Figure 4. components and random sampling with stratification</span></p></span></td></tr></tbody></table><div><h2><br />Modeling network effects</h2>In order to quantify the tradeoffs involved in experiment design, we need a model of network effects to be used in subsequent simulation studies. We now describe a generative model for how effects might propagate through the network. The network topology itself is the actual collaboration network we observe for GCP.<div dir=\"ltr\" style=\"line-height: 1.38; margin-bottom: 0pt; margin-top: 0pt;\"><span style=\"font-variant-east-asian: normal; font-variant-numeric: normal; text-align: justify; vertical-align: baseline;\"><br />Consider the case where experiment metrics are evaluated at the per-user level. Assume we have $K$ users. Let $Z_k$ denote the assignment of the $k^{th}$ user to an arm of the experiment.  Here $Z_k = 0$ means the user is assigned to control and $Z_k = 1$ for treatment. Under Stable Unit&nbsp;</span>Treatment Value Assumption (SUTVA), one can estimate treatment effect as follows:<br />$$<br />\\delta = \\frac{1}{N_0}\\sum_k Y_k[Z_k = 1] - \\frac{1}{N_1}\\sum_k Y_k [Z_k=0]&nbsp; &nbsp; \\tag{1}<br />$$ where $N_0$ and $N_1$ are the number of samples assigned to treatment group and control group, respectively. This is equivalent to estimating in the following linear model:</div><div dir=\"ltr\" style=\"line-height: 1.38; margin-bottom: 0pt; margin-top: 0pt;\">$$<br />y_k \\sim \\mu +&nbsp;\\tau z_k\\tag{2}<br />$$ where $\\mu$ is an overall intercept term and $\\tau$ is the effect of treatment.</div><br />When users are connected in a network, their treatment assignments can generate network effects through their interactions. Our model considers two aspects of network effects:<br /><ul><li><b>Homophily</b> or similarity within network: users collaborating in network tend to behave similarly. For example, developers working on a specific mobile app show similar behavior in usage. We use hierarchical models for this effect.</li><li><b>Spillover</b> or contamination effects: direct treatment effects can spill over through network connections. We conservatively limit the degree of spillover effects to immediate neighbors.</li></ul>We model network similarity using the fully nested hierarchical structure: component → account → project. Then we use random effects to model response from this hierarchy as follows: <br />$$<br />y_{i,j,k} \\sim c_i + a_{i,j} + p_{i,j,k}&nbsp; &nbsp; \\tag{3}<br />$$ where $c_i$ refers to the response from Component $i$, $a_{i,j}$ from Account $j$ in Component $i$, and $p_{i,j,k}$ from Project $k$ in Account $j$ in Component $i$. The random effects</div><div>\\begin{align*}<br />c_i &amp;\\sim N(0, \\sigma_c^2)\\\\<br />a_{i,j} &amp;\\sim N(0, \\sigma_a^2)\\\\<br />p_{i,j,k} &amp;\\sim N(0, \\sigma_p^2)<br />\\end{align*} can model potential correlation among accounts and projects within a component.</div><div><br /></div></div><div><div>Spillover effects are modeled as an additional component added to to the linear model in (2):<br />$$<br />y_k \\sim \\mu + \\tau z_k + \\gamma \\tau a_k^T \\cdot Z     \\tag{4}<br />$$ where $Z$ is a vector representing treatment group assignment of every user, and $a_k$ is the $k^{th}$ column of adjacency matrix $A$, i.e., $m^{th}$ element of $a_k$ is $1$ if the $k^{th}$ user and $m^{th}$ user are connected. Note that we only model first order spillover effects in (4). In other words, we do not consider potential effects from neighbors’ neighbors. Thus, our model is conservative with respect to spillover effects (i.e. it limits their impact). Combining spillover effects and similarity within network, we have <br />$$<br />y_{i,j,k} \\sim \\mu + \\tau z_k + \\gamma \\tau a_k^T \\cdot Z + (c_i + a_{i,j} + p_{i,j,k})   \\tag{5}<br />$$<br /><br /><h2>Experimental power and unit of randomization</h2>We can use the model just defined to simulate the effect of randomization unit. We consider two randomization units: project and connected component. To further illustrate the effects of stratification on experimental power, we sample components either uniformly, or by strata. In other words, for the three methods of randomization<br /><ul><li>uniform random component</li><li>uniform random project</li><li>stratified random component</li></ul>we simulate confidence intervals for A/A tests, i.e. when there is no real effect.<br /><br />Figure 5 shows empirical 95% confidence intervals for each of these sampling methods. Since the true effect is zero in each case, we expect our confidence intervals to include zero 95% of the time. The plot sorts 1000 empirical confidence intervals by their mid point (grey dot). The vertical line segment corresponding to each interval is green if it covers zero, red otherwise. Thus, the patch of red on either side consists of about 25 cases (i.e. 2.5%).<br /><br />The figure shows that random sampling by component has the widest confidence interval while random sampling by project has the least. Stratified sampling by component is in between. Thus stratification recovers some of the experimental power lost when going from sampling by project to sampling by connected component.</div><div><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiKOXpeoUzRJJ_yFv_p9odcncB3OsHcmuguRSga3nxvJ_4Jk1IZyrRJZRJpIlTEDJhd22VjI0OjcG8UEz8x84H2ljmc-QX-cDJK-qRKquEfurxGiWzc4ec_Ps7cNUzqeqJjjXGSSlg-uohxqqntjPIsHHbxY7K-moeZ13_FW4h0pFxvu67H_XMidrWdvA/s1200/Fig%205.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"1200\" height=\"426\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiKOXpeoUzRJJ_yFv_p9odcncB3OsHcmuguRSga3nxvJ_4Jk1IZyrRJZRJpIlTEDJhd22VjI0OjcG8UEz8x84H2ljmc-QX-cDJK-qRKquEfurxGiWzc4ec_Ps7cNUzqeqJjjXGSSlg-uohxqqntjPIsHHbxY7K-moeZ13_FW4h0pFxvu67H_XMidrWdvA/w640-h426/Fig%205.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><span id=\"docs-internal-guid-f625688c-7fff-b885-779e-dd76ab9b2acc\"><div align=\"left\" dir=\"ltr\" style=\"margin-left: 0pt;\"><table style=\"border-collapse: collapse; border: none;\"><colgroup><col width=\"594\"></col></colgroup><tbody><tr style=\"height: 27pt;\"><td style=\"overflow-wrap: break-word; overflow: hidden; vertical-align: top;\"><p dir=\"ltr\" style=\"line-height: 1.38; margin-bottom: 0pt; margin-top: 0pt; text-align: center;\"><span style=\"color: #4e4e4e; font-family: Roboto, sans-serif; font-size: 11.5pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\">Figure 5. A/A test results: Confidence intervals of three methods: random sampling by projects, random sampling by component, and stratified sampling by component.</span></p></td></tr></tbody></table></div></span></td></tr></tbody></table><br /><h2>Estimation bias due to unit of randomization</h2>Of course, running null experiments is hardly the purpose of experiment design. The reason we chose component as the unit of experimentation was that it better captures spillover effects when they are not null. Because randomized projects does not take network effects into account, we would expect to incur bias to the extent there are spillover effects.<br /><br />We generate simulation data using (5) on the actual GCP user network, with the following parameter values for similarity and spillover effects:<br /><ul><li>Similarity effect parameters: $\\sigma_c=2$, $\\sigma_a=1$ and $\\sigma_p=0.5$</li><li>Direct treatment effect size: $\\tau= \\frac{1}{8}$</li><li>Spillover effect parameter: $\\gamma=2^{-m}$, where $m = 1, 2, 3, 4, 5, 6, 7$ or $8$</li></ul>We varied $m$ to better understand the contribution of network effects under different levels of spillover effect.<br /><br />For each setting of the parameters, we ran three randomized experiments, once for each of the three sampling methods. Each experiment ran with 50% in treatment and 50% in control. We repeated this whole process 1,000 times to estimate a distribution of effect size estimates.<br /><br />Figure 6 shows the distributions of estimated effect size for the three experiment designs based on 1,000 simulation data sets for fixed values of $\\tau=1/8$ and $\\gamma= 2^{-4}$. While the variance of the random project design is least, it incurs significant bias. In contrast, random component and stratified component have higher variance but no observable bias.</div><div><br /></div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZSKuSiVXj-LQbwvSqikGr-OYyqoMSkaFZZ3j_PUdZzzIPsuBx8QH8MLmGNS7sSyuBwkFaDJHBjCCIr3umbp5ndNhe_kCNK42ZdZUxa2tKl9S4JVOZgcGT_qfAUoppzY4zvpHxUBZsqAYnnhUtKam2WLcHf-5WGB9dUalYrRKOMcRzAZriCRbe3b5g1g/s1200/Fig%206.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"1200\" height=\"426\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZSKuSiVXj-LQbwvSqikGr-OYyqoMSkaFZZ3j_PUdZzzIPsuBx8QH8MLmGNS7sSyuBwkFaDJHBjCCIr3umbp5ndNhe_kCNK42ZdZUxa2tKl9S4JVOZgcGT_qfAUoppzY4zvpHxUBZsqAYnnhUtKam2WLcHf-5WGB9dUalYrRKOMcRzAZriCRbe3b5g1g/w640-h426/Fig%206.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td class=\"tr-caption\">Figure 6. Effect size estimates for each of the three experiment designs. Dotted line shows the true effect size. Distributions estimated from 1,000 simulations, $\\tau=1/8$ and $\\gamma = 2^{-4}$.<br /></td></tr></tbody></table></td></tr></tbody></table><br /><div><br /><span style=\"text-align: center;\">The amount bias in a random project design depends on the level of spillover effect. This is shown for different values of $m$ in Figure 7. The bias of the random project design is such that its 95% confidence intervals, estimated under independence, exclude the true effect even for small spillover effects ($m \\leq 6$).</span></div><div><br /></div><div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhx-K7ak-o3iJmHJA_4rX6nToJiMNOofOy4K6bYP-cUIJJ9Ko8fmL2ZbnZAUYp83D0tGtanilw1Y_qD4c7x4WxVPLPINwei0KGius-wDQw4B-yPN44qgpVTAJEHtpCM5-iiJaM9lfnb5_7Zd8nfXsrxYspAb99y1l5B83q8oi0VeDOfkMISyWSH0gRUow/s1200/Fig%207.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"1200\" height=\"426\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhx-K7ak-o3iJmHJA_4rX6nToJiMNOofOy4K6bYP-cUIJJ9Ko8fmL2ZbnZAUYp83D0tGtanilw1Y_qD4c7x4WxVPLPINwei0KGius-wDQw4B-yPN44qgpVTAJEHtpCM5-iiJaM9lfnb5_7Zd8nfXsrxYspAb99y1l5B83q8oi0VeDOfkMISyWSH0gRUow/w640-h426/Fig%207.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td class=\"tr-caption\">Figure 7. Degree of network effects and effect size estimation. The dotted line with “A” refers to the true average effect.<br /><br /></td></tr></tbody></table></td></tr></tbody></table></div><div><br /><h2>Dynamic evolution of user collaboration network</h2>An actual user collaboration network is not static and evolves over time as users start new projects, finish existing ones, or change their project memberships. As a result, the following four changes can happen to components:<br /><ul><li><b>Create</b>: a new component is created.</li><li><b>Split</b>: an existing component breaks into sub-components.</li><li><b>Remove</b>: a component no longer exists.</li><li><b>Merge</b>: existing components become connected.&nbsp;</li></ul>The first three cases are easy: a newly created component is just randomly assigned to an arm, while no action needs to be taken for splits and removal. Difficulty only arises when connected components merge as shown in Figure 8.</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-xCgp_24E_H4/WlwFHbY-fhI/AAAAAAAAcqg/sneWUIX1Tok-FQaWPdASgoFq_FNdHnIaACLcBGAs/s1600/sangho1.png\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"435\" data-original-width=\"737\" height=\"376\" src=\"https://1.bp.blogspot.com/-xCgp_24E_H4/WlwFHbY-fhI/AAAAAAAAcqg/sneWUIX1Tok-FQaWPdASgoFq_FNdHnIaACLcBGAs/s640/sangho1.png\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\">Figure 8. Addition and Merge: new entities (projects and users) added are in RED, and components merged are in BLUE. </td></tr></tbody></table><div><br />At this point, it is no longer possible to guarantee consistent user treatment as defined earlier. We may discuss nuances of graph evolution in a future post, but for the most part, we are fortunate that this is a relatively rare event in our collaboration network today. Another aspect of concern is that treatment can in theory affect not just experiment metrics but also the graph topology itself. Thus graph evolution events also need to be tracked over the course of the experiment.</div><div><br /><h2>Conclusion</h2>Designing randomized experiments on a network of users is more challenging because of network effects. It is often inappropriate to ignore these network effects, either because it results in poor (inconsistent) user experience or because doing so incurs bias in estimating the effect of treatment. Our simulation results based on the actual GCP user network demonstrate the potential for bias if the structure of the network is not considered when designing experiments.<br /><br /><div><span style=\"font-family: &quot;arial&quot;; font-size: 11pt; vertical-align: baseline; white-space: pre-wrap;\"><br /></span></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Amir Najmi",
    "uri": "http://www.blogger.com/profile/18174523203317227640",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}