{
  "title": "#446: Going Rogue (OOTP 11, The Sorting Hat's New Song)",
  "link": "https://audioboom.com/posts/7452659",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4484,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Our first ‘new’ Chapter-by-Chapter for Order of the Phoenix since October 2011! Remember when we started this book then stopped for some reason? Good times. <br>\n<br>\n\n</li>\n<li>Micah shares his convo with an inspiring 8-year-old Harry Potter fan!</li>\n<li>Potter booze cruise... Yes, please!</li>\n<li>Eric's Book Corner: <a href=\"https://www.amazon.com/dp/1461157234/ref=cm_sw_r_cp_api_i_wRb6Db9XT3VS8\">Law Made Fun Through Harry Potter</a> & <a href=\"https://www.amazon.com/dp/1522043594/ref=cm_sw_r_cp_api_i_XOb6DbNKX8Z60\">Pod Life: Podcaster Stories</a>\n</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix - Chapter 11: The Sorting Hat's New Song</li>\n<li>7-Word Summary: Umbridge takes Dumbledore’s spotlight down during dinner </li>\n<li>Loyalty vs. judgment: We debate whether or not Hagrid is a \"joke\" of a teacher</li>\n<li>Welcome to Hogwarts, Professor Umbridge (not really)!</li>\n<li>What other times in history has the Sorting Hat given advice?</li>\n<li>We compare Slytherin and Gryffindor's falling out to that of Grindelwald and Dumbledore</li>\n<li>How the importance of unity at Hogwarts is a microcosm for that of the larger Wizarding World</li>\n<li>House unifiers: Narcissa Malfoy and Horace Slughorn</li>\n<li>Does Umbridge interrupt Dumbledore as payback for the Ministry hearing?</li>\n<li>Happy little faces = #FakeNews</li>\n<li>Is the Ministry infiltrating Hogwarts or just filling a high turnover position?</li>\n<li>Is Hogwarts self-sustaining or does it receive government funding?</li>\n<li>Discord amongst Gryffindors! What's up with Seamus?</li>\n<li>Would Harry telling Seamus what happened in the Graveyard have changed anything?</li>\n<li>True friendship: Ron and Neville's defense of Harry</li>\n<li>Harry finally realizes Dumbledore and him are in this together!</li>\n<li>The Umbridge Sucks Count climbs all the way to 11!</li>\n<li>On next week's episode we look back on the past decade in Potter!</li>\n<li>We Connect The Threads, give our MVPs of the Week and Rename The Chapter!</li>\n<li>Join our community at <a href=\"http://www.Patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 16 Dec 2019 15:53:51 +0000",
  "guid": "tag:audioboom.com,2019-12-16:/posts/7452659",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}