{
  "title": "Fast Bayesian estimation of brain activation with cortical surface fMRI data using EM. (arXiv:2211.01429v1 [stat.ME])",
  "link": "http://arxiv.org/abs/2211.01429",
  "description": "<p>Task functional magnetic resonance imaging (fMRI) is a type of neuroimaging\ndata used to identify areas of the brain that activate during specific tasks or\nstimuli. These data are conventionally modeled using a massive univariate\napproach across all data locations, which ignores spatial dependence at the\ncost of model power. We previously developed and validated a spatial Bayesian\nmodel leveraging dependencies along the cortical surface of the brain in order\nto improve accuracy and power. This model utilizes stochastic partial\ndifferential equation spatial priors with sparse precision matrices to allow\nfor appropriate modeling of spatially-dependent activations seen in the\nneuroimaging literature, resulting in substantial increases in model power. Our\noriginal implementation relies on the computational efficiencies of the\nintegrated nested Laplace approximation (INLA) to overcome the computational\nchallenges of analyzing high-dimensional fMRI data while avoiding issues\nassociated with variational Bayes implementations. However, this requires\nsignificant memory resources, extra software, and software licenses to run. In\nthis article, we develop an exact Bayesian analysis method for the general\nlinear model, employing an efficient expectation-maximization algorithm to find\nmaximum a posteriori estimates of task-based regressors on cortical surface\nfMRI data. Through an extensive simulation study of cortical surface-based fMRI\ndata, we compare our proposed method to the existing INLA implementation, as\nwell as a conventional massive univariate approach employing ad-hoc spatial\nsmoothing. We also apply the method to task fMRI data from the Human Connectome\nProject and show that our proposed implementation produces similar results to\nthe validated INLA implementation. Both the INLA and EM-based implementations\nare available through our open-source BayesfMRI R package.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Spencer_D/0/1/0/all/0/1\">Daniel A. Spencer</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Bolin_D/0/1/0/all/0/1\">David Bolin</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Mejia_A/0/1/0/all/0/1\">Amanda F. Mejia</a>"
}