{
  "guid": "urn:uuid:01bce2c7-3472-4487-bac4-c81099065e7e",
  "link": "https://www.who.int/news/item/19-10-2022-shortage-of-cholera-vaccines-leads-to-temporary-suspension-of-two-dose-strategy--as-cases-rise-worldwide",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Shortage of cholera vaccines leads to temporary suspension of two-dose strategy, as cases rise worldwide",
  "description": "A strained global supply of cholera vaccines has obliged the International Coordinating Group (ICG) — the body which manages emergency supplies of vaccines — to temporarily suspend the standard two-dose vaccination regimen in cholera outbreak response campaigns, using instead a single-dose approach.",
  "pubDate": "Wed, 19 Oct 2022 11:44:56 Z",
  "a10:content": "<p>A strained global supply of cholera vaccines has obliged the International Coordinating Group (ICG) &mdash; the body which manages emergency supplies of vaccines &mdash; to temporarily suspend the standard two-dose vaccination regimen in cholera outbreak response campaigns, using instead a single-dose approach. &nbsp;</p><p>The pivot in strategy will allow for the doses to be used in more countries, at a time of unprecedented rise in cholera outbreaks worldwide.</p><p>Since January this year, 29 countries have reported cholera cases, including Haiti, Malawi and Syria which are facing large outbreaks. In comparison, in the previous 5 years, fewer than 20 countries on average reported outbreaks. The global trend is moving towards more numerous, more widespread and more severe outbreaks, due to floods, droughts, conflict, population movements and other factors that limit access to clean water and raise the risk of cholera outbreaks.</p><p>The one-dose strategy has proven to be effective to respond to outbreaks, even though evidence on the exact duration of protection is limited, and protection appears to be much lower in children. &nbsp;With a two-dose regimen, when the second dose is administrated within 6 months of the first, immunity against infection lasts for 3 years.</p><p>The benefit of supplying one dose still outweighs no doses: although the temporary interruption of the two-dose strategy will lead to a reduction and shortening of immunity, this decision will allow more people to be vaccinated and provide them protection in the near term, should the global cholera situation continue deteriorating.</p><p>The current supply of cholera vaccines is extremely limited. Its use for emergency response is &nbsp;coordinated by the ICG which manages the global stockpile of oral cholera vaccines. Of the total 36 million doses forecast to be produced in 2022, 24 million have already been shipped for preventive (17%) and reactive (83%) campaigns and an additional 8 million doses were approved by the ICG for the second round for emergency vaccination in 4 countries, illustrating the dire shortage of the vaccine. As vaccine manufactures are producing at their maximum current capacity, there is no short-term solution to increase production. The temporary suspension of the two-dose strategy will allow the remaining doses to be redirected for any needs for the rest of the year.</p><p>This is a short-term solution but to ease the problem in the longer term, urgent action is needed to increase global vaccine production.</p><p>The ICG will continue to monitor the global epidemiological trends as well as the status of the cholera vaccine stockpile, and will review this decision regularly.</p><h3>About the ICG</h3><p>The <a href=\"https://www.who.int/groups/icg/about\">ICG</a> is an international group that manages and coordinates the provision of emergency vaccine supplies and antibiotics to countries during major disease outbreaks. &nbsp;It manages the global stockpile of the oral cholera vaccine. The group is composed of members of WHO, M&eacute;decins Sans Fronti&egrave;res, UNICEF and the International Federation of Red Cross and Red Crescent Societies.</p><p>The ICG was established in 1997, following major outbreaks of meningitis in Africa, as a mechanism to manage and coordinate the provision of emergency vaccine supplies and antibiotics to countries during major outbreaks.</p><p>Since the establishment of the cholera vaccine stockpile in 2013, 120 million doses of oral cholera vaccine doses have been shipped to 23 countries, of which 73 million (60%) has been approved for emergency response.</p><p><a href=\"https://www.twitch.tv/who\">&nbsp;</a></p><p>&nbsp;</p>"
}