{
  "id": "https://bibleinoneyear.org/en/youth/22",
  "title": "Day 22: How Long, O Lord?",
  "description": "Psalm 13:1,5–6, Genesis 43:13–14, Matthew 15:22–37.  We seem to be losing the battle and the enemy seems to be *triumphing over us* (v 2c)",
  "pubDate": "Fri, 22 Jan 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/22/?ignore",
  "itunes:duration": "13:16",
  "guid": "enyouth22012021-22",
  "length": 796.55,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 22: How Long, O Lord?",
  "itunes:subtitle": "Psalm 13:1,5–6, Genesis 43:13–14, Matthew 15:22–37.  We seem to be losing the battle and the enemy seems to be *triumphing over us* (v 2c)",
  "itunes:summary": "Have there ever been times in your life when you have found yourself wondering, ‘How long, O Lord?’ How long will this pandemic last? How long will these struggles and disappointments last? How long will we have these financial difficulties? How long will these health issues persist? How long will the difficulties in this relationship last? How long will I struggle with this addiction? How long will these intense temptations last? How long will it take me to get over this loss?\nPippa and I sometimes visit St Peter’s Brighton, one of our church plants. At the end of one service, a woman came up to us and told us that for thirty-seven years she had been praying for her husband to find faith in Christ. For all those thirty-seven long years, she had cried out, ‘How long, O Lord, how long?’ (Psalm 13:1).\nWhen St Peter’s reopened in 2009, her husband decided he would like to start coming to church with her. The moment he walked into St Peter’s, he felt he had come home and had been ‘reborn’. Now he loves the church and comes every week. Throughout our conversation she kept repeating, with a huge expression of joy on her face: ‘How long, O Lord, how long?’ God had heard. At last, her prayers were answered.\nFour times in quick succession David cries out, ‘How long…?’ (vv.1–2).\nThere are periods when it appears that God has forgotten us (v.1a). It seems that he has hidden his face (v.1b). For some inexplicable reason, we don’t sense his presence with us. Every day seems to be a struggle – wrestling with our thoughts (v.2a). Every day brings sorrow (v.2b). We seem to be losing the battle and the enemy seems to be triumphing over us (v.2c).\nHow should you respond in times like these?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 22
}