{
  "title": "Sam Kean on THE ICEPICK SURGEON",
  "pubDate": "Tue, 13 Jul 2021 04:00:00 +0000",
  "guid": "6c1e79fb-7524-4d82-9ae4-00fb441e1e82",
  "link": "http://pouredover.libsyn.com/sam-kean-on-icepick-surgeon",
  "itunes:image": "",
  "description": "<div>Sam Kean is an eclectic writer with an affinity for scientific subjects and their weird and darker paths, and he has an inimitable knack for transforming this passionate interest into astonishing story, punctuated with humor and rife with the absurd in his books The Disappearing Spoon, The Violinist’s Thumb, Caesar’s Last Breath, The Tale of the Dueling <div>Neurosurgeons <span style= \"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;\"> and The Bastard Brigade. His latest book,</span> <em style= \"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;\"> The Icepick Surgeon,</em> <span style= \"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;\"> is a tale of scientists and doctors gone amok, crossing the line from experiment to crime, often wrong for all well-intentioned reasons, and what these stories reveal about historic times in which they took place. Sam Kean joins us on the show to talk about pirates, mad paleontologists, scientist-spies, and more. Featured books: The Icepick Surgeon by Sam Kean and Evolution Gone Wrong by Alex Bezzerides.</span></div> </div> <div> </div> <div> <div>Follow Us here for new episodes every Tuesday and Thursday.</div> </div>",
  "content:encoded": "Sam Kean is an eclectic writer with an affinity for scientific subjects and their weird and darker paths, and he has an inimitable knack for transforming this passionate interest into astonishing story, punctuated with humor and rife with the absurd in his books The Disappearing Spoon, The Violinist’s Thumb, Caesar’s Last Breath, The Tale of the Dueling Neurosurgeons  and The Bastard Brigade. His latest book, <em style= \"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;\"> The Icepick Surgeon,</em>  is a tale of scientists and doctors gone amok, crossing the line from experiment to crime, often wrong for all well-intentioned reasons, and what these stories reveal about historic times in which they took place. Sam Kean joins us on the show to talk about pirates, mad paleontologists, scientist-spies, and more. Featured books: The Icepick Surgeon by Sam Kean and Evolution Gone Wrong by Alex Bezzerides.     Follow Us here for new episodes every Tuesday and Thursday. ",
  "enclosure": "",
  "itunes:duration": "34:41",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Sam Kean is an eclectic writer with an affinity for scientific subjects and their weird and darker paths, and he has an inimitable knack for transforming this passionate interest into astonishing story, punctuated with humor and rife with the absurd...",
  "itunes:episodeType": "full"
}