{
  "title": "Switzerland rejects German demand on ammunition for Ukraine",
  "link": "https://www.rt.com/news/565895-switzerland-germany-ukraine-ammo/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565895-switzerland-germany-ukraine-ammo/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363fd2485f5402cd913ff4d.jpg\" /> Switzerland has rejected a new German request to allow delivery of Swiss-made ammunition to Ukraine <br/><a href=\"https://www.rt.com/news/565895-switzerland-germany-ukraine-ammo/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Bern is concerned about violating its traditional neutrality</strong></p>\n            \n                        \n            <p>A new German request to allow it to send Swiss-made ammunition to Ukraine has been rejected.</p>\n<p>Switzerland's goverment&nbsp; revealed on Thursday that Economy Minister Guy Parmelin turned down the appeal, which had been made in an official letter sent by German Defense Minister Christine Lambrecht to Bern last month.</p>\n<p>In her correspondence, Lambrecht had asked for permission to supply some 12,400 rounds of ammunition for Gepard anti-aircraft vehicles, which Berlin sent earlier this year to prop-up Kiev in the ongoing conflict with Moscow.</p>\n<p><em>&ldquo;Under the principle of equal treatment in neutrality law, Switzerland cannot agree to a request for the transfer of war materiel of Swiss origin to Ukraine as long as the latter is involved in an international armed conflict,&rdquo;</em> the Swiss government explained in a statement, adding that since the <em>&ldquo;legal situation&rdquo;</em> remains the same,&nbsp;<em>&ldquo;approval of a transfer of Swiss war materiel by Germany to Ukraine is still not possible.&rdquo;&nbsp; </em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6356aa352030272fb11866b6.jpg\" alt=\"German Chancellor Olaf Scholz speaks at the German-Ukrainian Economic Forum in Berlin, Germany, October 24, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565258-germany-air-defense-ukraine-deliver/\">Berlin vows to deliver more air defense systems to Ukraine</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>While Switzerland has partially abandoned its long-standing neutrality policy amid the conflict in Ukraine and joined Western sanctions against Russia, it has repeatedly shot down attempts to supply weapons of Swiss origin to Kiev.&nbsp;In addition to barring Germany from sending ammunition for the Gepards, Bern has also prohibited Denmark from supplying Swiss-made armored vehicles to Ukraine.&nbsp;</p>\n<p>Russia sent troops into Ukraine on February 24, citing Kiev&rsquo;s failure to implement the Minsk agreements, designed to give the regions of Donetsk and Lugansk special status within the Ukrainian state. The protocols, brokered by Germany and France, were first signed in 2014. Former Ukrainian President Pyotr Poroshenko has since admitted that Kiev&rsquo;s main goal was to use the ceasefire to buy time and<em> &ldquo;create powerful armed forces.&rdquo;</em></p>\n<p>In February 2022, the Kremlin recognized the Donbass republics as independent states and demanded that Ukraine officially declare itself a neutral country that will never join any Western military bloc. Kiev insists the Russian offensive was completely unprovoked.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 17:42:58 +0000",
  "dc:creator": "RT"
}