{
  "title": "DIXIE D'AMELIO WEIGHS IN ON JOSH AND NESSA BACK TOGETHER? — BFFs EP. 82 WITH CINDY KIMBERLY",
  "description": "<p>We start the show joined by friend of the pod Dixie D'Amelio and for once it is not the guest on the hot seat, but our boy Josh. We break down what is happening between him and Nessa after he was spotted with her over the weekend, how long Bri has known something has been going on, where Dixie stands on all of this, and where Josh and Nessa are now going forward. We then call Nessa live on the pod so that Dave can talk to her one on one, and then talk about Landon Barker's song in which it seems he is talking about Jaden and Josie cheating.\n\nWe then get into headlines with Dixie including Thomas Petrou fighting 40 year olds in order to protect the Hype House, Corinna Kopf being banned from Twitch, Tayler Holder having another interview that seemingly says nothing, Kendall Jenner not being able to cut cucumbers, Madonna releasing some (interesting) NFTs, Cara Delevingne's antics at the Billboard Music Awards, and Emma Chamberlain getting cancelled for her Met Gala necklace. (Tune in next week for part 2 of our Dixie interview where we talk about her and her life).\n\nWe then are joined by Cindy Kimberly where we talk about her becoming an Sports Illustrated Rookie, her rise to fame overnight by a Justin Bieber Instagram, her experience filming with David Dobrik, and who actually is in the Coachella video making out with Timothee Chalamet. \n\nSupport our sponsors! \n\nSpark: Download Spark today at https://barstool.link/SparkBFF\nBetterHelp: Go to BetterHelp.com/BFF for 10% off your first month</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "a7d4e1a8-ea04-48c4-939c-2038dd0c2f90",
  "pubDate": "Fri, 20 May 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:07:56",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}