{
  "title": "Blake Anderson, Jay Pharoah, and Sad Boy Season Has Arrived",
  "description": "<p>Subscribe, Rate, and Leave a Review!  \n\nDownload the ATI App today: https://apps.apple.com/us/app/answer-the-internet/id1514656026\n  \n-KFC returns from his first vacation in 6 years and is warmly welcomed by the internet\n-Did we miss our chance to move to the Bahamas?\n-Bill Belichick and Cam Newton love each other\n-What job never gets old?\n-Top 5 Things about Fall (aka Sad Boy Season)\n-Voicemails include porn addiction:is it real, killer haircut, and date prep\n\n(01:26:30) Blake Anderson returns to the show! We discuss the new show he's on Woke, the hilarious people involved, the on set chemistry, and it's cultural relevance. We also discuss Disney Gangs, favorite alcohol, starting a podcast with the Workaholics crew, and much more.\n\n(2:00:00) Jay Pharoah joins the show! We discuss slidin into the dm's of childhood celebrity crushes, developing the talent to do impressions, his favorite impressions he has, Jay's real name(which might shock you), and talking to himself in character. Jay also tells us about the scary experience of being unjustly held at gunpoint and put under arrest by the police while he was out for a jog.\n\nLet us know what you think on Twitter:\n@kfcradio @kfcbarstool @feitsbarstool @UncleBlazer @JayPharoah\n\nSubscribe to our Youtube Channel for Daily Clips:\nhttps://www.youtube.com/user/KFCradio\n\nFollow us on Instagram:\ninstagram.com/kfcradio\n\nFollow us on Tik Tok:\nhttps://www.tiktok.com/@kfcradio\n\nFollow us on Facebook:\nhttps://www.facebook.com/kfcradio</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "b6afbe85-953c-4478-88a8-4b3170a7d144",
  "pubDate": "Tue, 8 Sep 2020 20:18:33 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:36:15",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}