{
  "title": "NSF Engineering Alliance Supports IEEE’s Plan on Climate Change",
  "link": "https://spectrum.ieee.org/erva-supports-ieee-climate-change-plan",
  "description": "\n<p>We read with considerable interest the story in the September 2022 issue of<em> The Institute</em> titled “<a href=\"https://spectrum.ieee.org/ieee-plan-combat-climate-change\" target=\"_self\">IEEE’s Plan to Help Combat Climate Change</a>.” As IEEE members and as co-principal investigators of the U.S. <a href=\"https://www.nsf.gov/eng/about.jsp\" rel=\"noopener noreferrer\" target=\"_blank\">National Science Foundation</a> initiative, the <a href=\"https://spectrum.ieee.org/nsf-engineering-alliance-climate-change\" target=\"_self\">Engineering Research Visioning Alliance</a>, we agree that engineers, scientists, and technical professionals have a critical role to play in mitigating the effects of climate change and that the role of engineering has not been as prominent as we believe it should be. We hope you agree that it’s time to take action and pursue solutions.</p><p>In both approach and key priorities, there is significant alignment between the technology areas identified by the IEEE ad hoc committee on climate change and the engineering research priorities identified at ERVA’s inaugural visioning event and the resulting report, <a href=\"https://www.ervacommunity.org/visioning-report/visioning-event-report/\" rel=\"noopener noreferrer\" target=\"_blank\">The Role of Engineering to Address Climate Change</a>, published in August. The ERVA report highlights specific research directions through which engineering can take the lead and have impact in energy storage and transmission; greenhouse gas capture and elimination; resilient, energy efficient infrastructure; and water, ecosystem, and geoengineering assessment. It’s important to note that ERVA convened academic researchers and engineers in industry to develop the priorities identified in the report. We believe it’s critical to bring all stakeholders to the table to collaboratively envision engineering solutions to address societal challenges such as climate change.</p><p>ERVA is pleased to count IEEE as an <a href=\"https://www.ervacommunity.org/affiliates/\" rel=\"noopener noreferrer\" target=\"_blank\">affiliate partner</a> in this important work. We strive to unite the voices of engineering to identify and develop bold and transformative new engineering research directions and to catalyze the engineering community's pursuit of innovative, high-impact research that benefits society. We welcome further conversation with IEEE’s ad hoc committee on climate change and urge <em>The Institute </em>readers to download the report and act on its findings.</p>",
  "pubDate": "Fri, 14 Oct 2022 20:38:22 +0000",
  "guid": "https://spectrum.ieee.org/erva-supports-ieee-climate-change-plan",
  "category": [
    "Opinion",
    "Climate change",
    "National science foundation",
    "Engineering research visioning alliance",
    "Ieee member news",
    "Type:ti"
  ],
  "dc:creator": "Charles Johnson-Bey"
}