{
  "title": "Episode 142: &#8220;God Only Knows&#8221; by the Beach Boys",
  "link": "https://500songs.com/podcast/episode-142-god-only-knows-by-the-beach-boys/",
  "pubDate": "Mon, 31 Jan 2022 02:33:19 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1018",
  "description": "Episode one hundred and forty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at “God Only Knows\" by the Beach Boys, and the creation of the <em>Pet Sounds</em> album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/61874850\">on \"Sunny\" by Bobby Hebb</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I’ve checked for specific things.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe’s <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins’ <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert’s <em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nI have also referred to Brian Wilson's autobiography, <em><a href=\"https://amzn.to/3AMbmys\">I Am Brian Wilson</a></em>, and to Mike Love's, <em><a href=\"https://amzn.to/3AMbmys\">Good Vibrations: My Life as a Beach Boy</a>.</em>\n\nFor material specific to <em>Pet Sounds</em> I have used Kingsley Abbot's <a href=\"https://amzn.to/3ANWH5Z\"><em>The Beach Boys' Pet Sounds: The Greatest Album of the Twentieth Century</em></a> and Charles L Granata's <em><a href=\"https://amzn.to/3gc5fdq\">I Just Wasn't Made For These Times: Brian Wilson and the Making of Pet Sounds</a>. </em>\n\nI also used the 126-page book <em>The Making of Pet Sounds</em> by David Leaf, which came as part of the <a href=\"https://amzn.to/3GeEM9F\"><em>The Pet Sounds Sessions </em></a>box set, which also included the many alternate versions of songs from the album used here. Sadly both that box set and the 2016 updated reissue of it appear currently to be out of print, but either is <em>well</em> worth obtaining for anyone who is interested in how great records are made.\n\nOf the versions of <em>Pet Sounds</em> that are still in print, <a href=\"https://amzn.to/3Ge4Z8k\">this double-CD version</a> is the one I'd recommend. It has the original mono mix of the album, the more recent stereo remix, the instrumental backing tracks, and live versions of several songs.\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it.\n\nThe YouTube drum tutorial I excerpted a few seconds of to show a shuffle beat is <a href=\"https://www.youtube.com/watch?v=2CwlSaQZLkY\">here</a>.\n\n<strong>Transcript</strong>\n\nWe're still in the run of episodes that deal with the LA pop music scene -- though next week we're going to move away from LA, while still dealing with a lot of the people who would play a part in that scene. But today we're hitting something that requires a bit of explanation.\n\nMost artists covered in this podcast get one or at the most two episodes. Some get slightly more -- the major artists who are present for many revolutions in music, or who have particularly important careers, like Fats Domino or the Supremes. And then there are a few very major artists who get a lot more. The Beatles, for example, are going to get eight in total, plus there will be episodes on some of their solo careers. Elvis has had six, and will get one more wrap-up episode.\n\nThis is the third Beach Boys episode, and there are going to be three more after this, because the Beach Boys were one of the most important acts of the decade.\n\nBut normally, I limit major acts to one episode per calendar year of their career. This means that they will average at most one episode every ten episodes, so while for example the episodes on \"Mystery Train\" and \"Heartbreak Hotel\" came close together, there was then a reasonable gap before another Elvis episode.\n\nThis is not possible for the Beach Boys, because this episode and the next two Beach Boys ones all take place over an incredibly compressed timeline. In May 1966, they released an album that has consistently been voted the best album ever in polls of critics, and which is certainly one of the most influential even if one does not believe there is such a thing as a \"best album ever\". In October 1966 they released one of the most important singles ever -- a record that is again often considered the single best pop single of all time, and which again was massively influential. And then in July 1967 they released the single that was intended to be the lead-off single from their album <em>Smile,</em> an album that didn't get released until decades later, and which became a legend of rock music that was arguably more influential by *not* being released than most records that are released manage to be.\n\nAnd these are all very different stories, stories that need to be told separately.\n\nThis means that episode one hundred and forty-two, episode one hundred and forty-six, and episode one hundred and fifty-three are all going to be about the Beach Boys. There will be one final later episode about them, too, but the next few months are going to be very dominated by them, so I apologise in advance for that if that's not something you're interested in. Though it also means that with luck some of these episodes will be closer to the shorter length of podcast I prefer rather than the ninety-minute mammoths we've had recently. Though I'm afraid this is another long one.\n\nWhen we left the Beach Boys, we'd just heard that Glen Campbell had temporarily replaced Brian Wilson on the road, after Wilson's mental health had finally been unable to take the strain of touring while also being the group's record producer, principal songwriter, and leader. To thank Campbell, who at this point was not at all well known in his own right, though he was a respected session guitarist and had released a few singles, Brian had co-written and produced \"Guess I'm Dumb\" for him, a track which prefigured the musical style that Wilson was going to use for the next year or so:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb\"]\n\nIt's worth looking at \"Guess I'm Dumb\" in a little detail, as it points the way forward to a lot of Wilson's songwriting over the next year. Firstly, of course, there are the lyrical themes of insecurity and of what might even be descriptions of mental illness in the first verse -- \"the way I act don't seem like me, I'm not on top like I used to be\". The lyrics are by Russ Titelman, but it's reasonable to assume that as with many of his collaborations, Brian brought in the initial idea.\n\nThere's also a noticeable change in the melodic style compared to Wilson's earlier melodies. Up to this point, Wilson has mostly been writing what get called \"horizontal\" melody lines -- ones with very little movement, and small movements, often centred on a single note or two. There are exceptions of course, and plenty of them, but a typical Brian Wilson melody up to this point is the kind of thing where even I can hit the notes more or less OK -- [sings] \"Well, she got her daddy's car and she cruised through the hamburger stand now\". It's not quite a monotone, but it's within a tight range, and you don't have to move far from one note to another.\n\nBut \"Guess I'm Dumb\" is incorporating the influence of Roy Orbison, and more obviously of Burt Bacharach, and it's *ludicrously* vertical, with gigantic leaps all over the place, in places that are not obvious. It requires the kind of precision that only a singer like Campbell can attain, to make it sound at all natural:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb\"]\n\nBacharach's influence is also noticeable in the way that the chord changes are very different from those that Wilson was using before. Up to this point, when Wilson wrote unusual chord changes, it was mostly patterns like \"The Warmth of the Sun\", which is wildly inventive, but mostly uses very simple triads and sevenths. Now he was starting to do things like the line \"I guess I'm dumb but I don't care\", which is sort of a tumbling set of inversions of the same chord that goes from a triad with the fifth in the bass, to a major sixth, to a minor eleventh, to a minor seventh.\n\nPart of the reason that Brian could start using these more complex voicings was that he was also moving away from using just the standard guitar/bass/drums lineup, sometimes with keyboards and saxophone, which had been used on almost every Beach Boys track to this point. Instead, as well as the influence of Bacharach, Wilson was also being influenced by Jack Nitzsche's arrangements for Phil Spector's records, and in particular by the way Nitzsche would double instruments, and have, say, a harpsichord and a piano play the same line, to create a timbre that was different from either individual instrument. But where Nitzsche and Spector used the technique along with a lot of reverb and overdubbing to create a wall of sound which was oppressive and overwhelming, and which obliterated the sounds of the individual instruments, Wilson used the same instrumentalists, the Wrecking Crew, to create something far more delicate:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb (instrumental and backing vocals)\"]\n\nCampbell does such a good job on \"Guess I'm Dumb\" that one has to wonder what would  have happened if he'd remained with the Beach Boys. But Campbell had of course not been able to join the group permanently -- he had his own career to attend to, and that would soon take off in a big way, though he would keep playing on the Beach Boys' records for a while yet as a member of the Wrecking Crew.\n\nBut Brian Wilson was still not well enough to tour. In fact, as he explained to the rest of the group, he never intended to tour again -- and he wouldn't be a regular live performer for another twelve years. At first the group were terrified -- they thought he was talking about quitting the group, or the group splitting up altogether. But Brian had a different plan.\n\nFrom that point on, there were two subtly different lineups of the group. In the studio, Brian would sing his parts as always, but the group would get a permanent replacement for him on tour -- someone who could replace him on stage. While the group was on tour, Brian would use the time to write songs and to record backing tracks. He'd already started using the Wrecking Crew to add a bit of additional musical colour to some of the group's records, but from this point on, he'd use them to record the whole track, maybe getting Carl to add a bit of guitar as well if he happened to be around, but otherwise just using the group to provide vocals.\n\nIt's important to note that this *was* a big change. A lot of general music history sources will say things like \"the Beach Boys never played on their own records\", and this is taken as fact by people who haven't investigated further. In fact, the basic tracks for all their early hits were performed by the group themselves -- \"Surfin'\", \"Surfin' Safari\", \"409\", \"Surfer Girl\", \"Little Deuce Coupe\", \"Don't Worry Baby\" and many more were entirely performed by the Beach Boys, while others like \"I Get Around\" featured the group with a couple of additional musicians augmenting them. The idea that the group never played on their records comes entirely from their recordings from 1965 and 66, and even there often Carl would overdub a guitar part.\n\nAnd at this point, the Beach Boys were still playing on the majority of their recordings, even on sophisticated-sounding records like \"She Knows Me Too Well\", which is entirely a group performance other than Brian's friend, Russ Titelman, the co-writer of \"Guess I'm Dumb\", adding some percussion by hitting a microphone stand with a screwdriver:\n\n[Excerpt: The Beach Boys, \"She Knows Me Too Well\"]\n\nSo the plan to replace the group's instrumental performances in the studio was actually a bigger change than it might seem. But an even bigger change was the live performances, which of course required the group bringing in a permanent live replacement for Brian. They'd already tried this once before, when he'd quit the road for a while and they'd brought Al Jardine back in, but David Marks quitting had forced him back on stage. Now they needed someone to take his place for good.\n\nThey phoned up their friend Bruce Johnston to see if he knew anyone, and after suggesting a couple of names that didn't work out, he volunteered his own services, and as of this recording he's spent more than fifty years in the band (he quit for a few years in the mid-seventies, but came back).\n\nWe've seen Johnston turn up several times already, most notably in the episode on \"LSD-25\", where he was one of the musicians on the track we looked at, but for those of you who don't remember those episodes, he was pretty much *everywhere* in California music in the late fifties and early sixties. He had been in a band at school with Phil Spector and Sandy Nelson, and another band with Jan and Dean, and he'd played on Nelson's \"Teen Beat\", produced by Art Laboe:\n\n[Excerpt: Sandy Nelson, \"Teen Beat\"]\n\nHe'd been in the house band at those shows Laboe put on at El Monte stadium we talked about a couple of episodes back, he'd been a witness to John Dolphin's murder, he'd been a record producer for Bob Keane, where he'd written and produced songs for Ron Holden, the man who had introduced \"Louie Louie\" to Seattle:\n\n[Excerpt: Ron Holden, \"Gee But I'm Lonesome\"]\n\nHe'd written \"The Tender Touch\" for Richard Berry's backing group The Pharaos, with Berry singing backing vocals on this one:\n\n[Excerpt: The Pharaos, \"The Tender Touch\"]\n\nHe'd helped Bob Keane compile Ritchie Valens' first posthumous album, he'd played on \"LSD-25\" and \"Moon Dawg\" by the Gamblers:\n\n[Excerpt: The Gamblers, \"Moon Dawg\"]\n\nHe'd arranged and produced the top ten hit “Those Oldies but Goodies (Remind Me of You)” for Little Caesar and the Romans:\n\n[Excerpt Little Caesar and the Romans, \"Those Oldies but Goodies (Remind Me of You)\"]\n\nBasically, wherever you looked in the LA music scene in the early sixties, there was Bruce Johnston somewhere in the background. But in particular, he was suitable for the Beach Boys because he had a lot of experience in making music that sounded more than a little like theirs. He'd made cheap surf records as the Bruce Johnston Surfing Band:\n\n[Excerpt: Bruce Johnston, \"The Hamptons\"]\n\nAnd with his long-time friend and creative partner Terry Melcher he had, as well as working on several Paul Revere and the Raiders records, also recorded hit Beach Boys soundalikes both as their own duo, Bruce and Terry:\n\n[Excerpt: Bruce and Terry, \"Summer Means Fun\"]\n\nand under the name of a real group that Melcher had signed, but who don't seem to have sung much on their own big hit, the Rip Chords:\n\n[Excerpt: The Rip Chords, \"Hey Little Cobra\"]\n\nJohnston fit in well with the band, though he wasn't a bass player before joining, and had to be taught the parts by Carl and Al. But he's probably the technically strongest musician in the band, and while he would later switch to playing keyboards on stage, he was quickly able to get up to speed on the bass well enough to play the parts that were needed. He also wasn't quite as strong a falsetto singer as Brian Wilson, as can be heard by listening to this live recording of the group singing \"I Get Around\" in 1966:\n\n[Excerpt: The Beach Boys, \"I Get Around (live 1966)\"]\n\nJohnston is actually an excellent singer -- and can still hit the high notes today. He sings the extremely high falsetto part on \"Fun Fun Fun\" at the end of every Beach Boys show. But his falsetto was thinner than Wilson's, and he also has a distinctive voice which can be picked out from the blend in a way that none of the other Beach Boys' voices could -- the Wilson brothers and Mike Love all have a strong family resemblance, and Al Jardine always sounded spookily close to them.\n\nThis meant that increasingly, the band would rearrange the vocal parts on stage, with Carl or Al taking the part that Brian had taken in the studio. Which meant that if, say, Al sang Brian's high part, Carl would have to move up to sing the part that Al had been singing, and then Bruce would slot in singing the part Carl had sung in the studio. This is a bigger difference than it sounds, and it meant that there was now a need for someone to work out live arrangements that were different from the arrangements on the records -- someone had to reassign the vocal parts, and also work out how to play songs that had been performed by maybe eighteen session musicians playing French horns and accordions and vibraphones with a standard rock-band lineup without it sounding too different from the record.\n\nCarl Wilson, still only eighteen when Brian retired from the road, stepped into that role, and would become the de facto musical director of the Beach Boys on stage for most of the next thirty years, to the point that many of the group's contracts for live performances at this point specified that the promoter was getting \"Carl Wilson and four other musicians\".\n\nThis was a major change to the group's dynamics. Up to this point, they had been a group with a leader -- Brian -- and a frontman -- Mike, and three other members. Now they were a more democratic group on stage, and more of a dictatorship in the studio. This was, as you can imagine, not a stable situation, and was one that would not last long.\n\nBut at first, this plan seemed to go very, very well. The first album to come out of this new hybrid way of working, The Beach Boys Today!, was started before Brian retired from touring, and some of the songs on it were still mostly or solely performed by the group, but as we heard with \"She Knows Me Too Well\" earlier, the music was still more sophisticated than on previous records, and this can be heard on songs like \"When I Grow Up to Be a Man\", where the only session musician is the harmonica player, with everything else played by the group:\n\n[Excerpt: The Beach Boys, \"When I Grow Up to Be a Man\"]\n\nBut the newer sophistication really shows up on songs like \"Kiss Me Baby\", where most of the instrumentation is provided by the Wrecking Crew -- though Carl and Brian both play on the track -- and so there are saxophones, vibraphones, French horn, cor anglais, and multiple layers of twelve-string guitar:\n\n[Excerpt: The Beach Boys, \"Kiss Me Baby\"]\n\nToday had several hit singles on it -- \"Dance, Dance, Dance\", \"When I Grow Up to be a Man\", and their cover version of Bobby Freeman's \"Do You Wanna Dance?\" all charted -- but the big hit song on the album actually didn't become a hit in that version. \"Help Me Ronda\" was a piece of album filler with a harmonica part played by Billy Lee Riley, and was one of Al Jardine's first lead vocals on a Beach Boys record -- he'd only previously sung lead on the song \"Christmas Day\" on their Christmas album:\n\n[Excerpt: The Beach Boys, \"Help Me Ronda\"]\n\nWhile the song was only intended as album filler, other people saw the commercial potential in the song. Bruce Johnston was at this time still signed to Columbia records as an artist, and wasn't yet singing on Beach Boys records, and he recorded a version of the song with Terry Melcher as a potential single:\n\n[Excerpt: Bruce and Terry, \"Help Me Rhonda\"]\n\nBut on seeing the reaction to the song, Brian decided to rerecord it as a single. Unfortunately, Murry Wilson turned up to the session. Murry had been fired as the group's manager by his sons the previous year, though he still owned the publishing company that published their songs. In the meantime, he'd decided to show his family who the real talent behind the group was by taking on another group of teenagers and managing and producing them. The Sunrays had a couple of minor hits, like \"I Live for the Sun\":\n\n[Excerpt: The Sunrays, \"I Live for the Sun\"]\n\nBut nothing made the US top forty, and by this point it was clear, though not in the way that Murry hoped, who the real talent behind the group *actually* was.\n\nBut he turned up to the recording session, with his wife in tow, and started trying to produce it:\n\n[Excerpt: Beach Boys and Murry Wilson \"Help Me Rhonda\" sessions]\n\nIt ended up with Brian physically trying to move his drunk father away from the control panel in the studio, and having a heartbreaking conversation with him, where the twenty-two-year-old who is recovering from a nervous breakdown only a few months earlier sounds calmer, healthier, and more mature than his forty-seven-year-old father:\n\n[Excerpt: Beach Boys and Murry Wilson, \"Help Me Rhonda\" sessions]\n\nKnowing that this was the family dynamic helps make the comedy filler track on the next album, \"I'm Bugged at My Old Man\", seem rather less of a joke than it otherwise would:\n\n[Excerpt: The Beach Boys, \"I'm Bugged at My Old Man\"]\n\nBut with Murry out of the way, the group did eventually complete recording \"Help Me Rhonda\" (and for those of you reading this as a blog post rather than listening to the podcast, yes they did spell it two different ways for the two different versions), and it became the group's second number one hit:\n\n[Excerpt: The Beach Boys, \"Help Me, Rhonda\"]\n\nAs well as Murry Wilson, though, another figure was in the control room then -- Loren Daro (who at the time went by his birth surname, but I'm going to refer to him throughout by the name he chose).  You can hear, on the recording, Brian Wilson asking Daro if he could \"turn him on\" -- slang that was at that point not widespread enough for Wilson's parents to understand the meaning.\n\nDaro was an agent working for the William Morris Agency, and he was part of a circle of young, hip, people who were taking drugs, investigating mysticism, and exploring new spiritual ideas. His circle included the Byrds -- Daro, like Roger McGuinn, later became a follower of Subud and changed his name as a result -- as well as people like the songwriter and keyboard player Van Dyke Parks, who will become a big part of this story in subsequent episodes, and Stephen Stills, who will also be turning up again.\n\nDaro had introduced Brian to cannabis, in 1964, and in early 1965 he gave Brian acid for the first time -- one hundred and twenty-five micrograms of pure Owsley LSD-25.\n\nNow, we're going to be looking at acid culture quite a lot in the next few months, as we get through 1966 and 1967, and I'll have a lot more to say about it, but what I will say is that even the biggest proponents of psychedelic drug use tend not to suggest that it is a good idea to give large doses of LSD in an uncontrolled setting to young men recovering from a nervous breakdown. Daro later described Wilson's experience as \"ego death\" -- a topic we will come to in a future episode, and not considered entirely negative -- and \"a beautiful thing\". But he has also talked about how Wilson was so terrified by his hallucinations that he ran into the bedroom, locked the door, and hid his head under a pillow for two hours, which doesn't sound so beautiful to me.\n\nApparently after those two hours, he came out of the bedroom, said \"Well, that's enough of that\", and was back to normal. After that first trip, Wilson wrote a piece of music inspired by his psychedelic experience. A piece which starts like this, with an orchestral introduction very different from anything else the group had released as a single:\n\n[Excerpt: The Beach Boys, \"California Girls\"]\n\nOf course, when Mike Love added the lyrics to the song, it became about far more earthly and sensual concerns:\n\n[Excerpt: The Beach Boys, \"California Girls\"]\n\nBut leaving the lyrics aside for a second, it's interesting to look at \"California Girls\" musically to see what Wilson's idea of psychedelic music -- by which I mean specifically music inspired by the use of psychedelic drugs, since at this point there was no codified genre known as psychedelic music or psychedelia -- actually was.\n\nSo, first, Wilson has said repeatedly that the song was specifically inspired by \"Jesu, Joy of Man's Desiring\" by Bach:\n\n[Excerpt: Bach, \"Jesu, Joy of Man's Desiring\"]\n\nAnd it's odd, because I see no real structural or musical resemblance between the two pieces that I can put my finger on, but at the same time I can totally see what he means. Normally at this point I'd say \"this change here in this song relates to this change there in that song\", but there's not much of that kind of thing here -- but I still. as soon as I read Wilson saying that for the first time, more than twenty years ago, thought \"OK, that makes sense\".\n\nThere are a few similarities, though. Bach's piece is based around triplets, and they made Wilson think of a shuffle beat. If you remember *way* back in the second episode of the podcast, I talked about how one of the standard shuffle beats is to play triplets in four-four time. I'm going to excerpt a bit of recording from a YouTube drum tutorial (which I'll link in the liner notes) showing that kind of shuffle:\n\n[Excerpt: \"3 Sweet Triplet Fills For Halftime Shuffles & Swung Grooves- Drum Lesson\" , from https://www.youtube.com/watch?v=2CwlSaQZLkY ]\n\nNow, while Bach's piece is in waltz time, I hope you can hear how the DA-da-da DA-da-da in Bach's piece may have made Wilson think of that kind of shuffle rhythm.\n\nBach's piece also has a lot of emphasis of the first, fifth, and sixth notes of the scale -- which is fairly common, and not something particularly distinctive about the piece -- and those are the notes that make up the bass riff that Wilson introduces early in the song:\n\n[Excerpt: The Beach Boys, \"California Girls (track)\"]\n\nThat bass riff, of course, is a famous one. Those of you who were listening to the very earliest episodes of the podcast might remember it from the intros to many, many, Ink Spots records:\n\n[Excerpt: The Ink Spots, \"We Three (My Echo, My Shadow, and Me)\"]\n\nBut the association of that bassline to most people's ears would be Western music, particularly the kind of music that was in Western films in the thirties and forties. You hear something similar in \"The Trail of the Lonesome Pine\", as performed by Laurel and Hardy in their 1937 film Way Out West:\n\n[Excerpt: Laurel and Hardy, \"The Trail of the Lonesome Pine\"]\n\nBut it's most associated with the song \"Tumbling Tumbleweeds\", first recorded in 1934 by the Western group Sons of the Pioneers, but more famous in their 1946 rerecording, made after the Ink Spots' success, where the part becomes more prominent:\n\n[Excerpt: The Sons of the Pioneers, \"Tumbling Tumbleweeds\"]\n\nThat song was a standard of the Western genre, and by 1965 had been covered by everyone from Gene Autry to the Supremes, Bob Wills to Johnnie Ray, and it would also end up covered by several musicians in the LA pop music scene over the next few years, including Michael Nesmith and Curt Boettcher, both people part of the same general scene as the Beach Boys.\n\nThe other notable thing about \"California Girls\" is that it's one of the first times that Wilson was able to use multi-tracking to its full effect. The vocal parts were recorded on an eight-track machine, meaning that Wilson could triple-track both Mike Love's lead vocal and the group's backing vocals. With Johnston now in the group -- \"California Girls\" was his first recording session with them -- that meant that on the record there were eighteen voices singing, leading to some truly staggering harmonies:\n\n[Excerpt: The Beach Boys, \"California Girls (Stack-O-Vocals)\"]\n\nSo, that's what the psychedelic experience meant to Brian Wilson, at least -- Bach, orchestral influences, using the recording studio to create thicker vocal harmony parts, and the old West. Keep that in the back of your mind for the present, but it'll be something to remember in eleven episodes' time.\n\n\"California Girls\" was, of course, another massive hit, reaching number three on the charts. And while some Beach Boys fans see the album it was included on, Summer Days... And Summer Nights!, as something of a step backward from the sophistication of Today!, this is a relative thing. It's very much of a part with the music on the earlier album, and has many wonderful moments, with songs like \"Let Him Run Wild\" among the group's very best.\n\nBut it was their next studio album that would cement the group's artistic reputation, and which would regularly be acclaimed by polls of critics as the greatest album of all time -- a somewhat meaningless claim; even more than there is no \"first\" anything in music, there's no \"best\" anything.\n\nThe impulse to make what became Pet Sounds came, as Wilson has always told the story, from hearing the Beatles album Rubber Soul. Now, we've not yet covered Rubber Soul -- we're going to look at that, and at the album that came after it, in three episodes' time -- but it is often regarded as a major artistic leap forward for the Beatles.\n\nThe record Wilson heard, though, wasn't the same record that most people nowadays think of when they think of Rubber Soul. Since the mid-eighties, the CD versions of the Beatles albums have (with one exception, Magical Mystery Tour) followed the tracklistings of the original British albums, as the Beatles and George Martin intended. But in the sixties, Capitol Records were eager to make as much money out of the Beatles as they could. The Beatles' albums generally had fourteen songs on, and often didn't include their singles. Capitol thought that ten or twelve songs per album was plenty, and didn't have any aversion to putting singles on albums. They took the three British albums Help!, Rubber Soul, and Revolver, plus the non-album \"Day Tripper\"/\"We Can Work It Out\" single and Ken Thorne's orchestral score for the Help! film, and turned that into four American albums -- Help!, Rubber Soul, Yesterday and Today, and Revolver.\n\nIn the case of Rubber Soul, that meant that they removed four tracks from the British album -- \"Drive My Car\", \"Nowhere Man\", \"What Goes On\" and \"If I Needed Someone\" -- and added two songs from the British version of Help!, \"I've Just Seen a Face\" and \"It's Only Love\".\n\nNow, I've seen some people claim that this made the American Rubber Soul more of a folk-rock album -- I may even have said that myself in the past -- but that's not really true. Indeed, \"Nowhere Man\" and \"If I Needed Someone\" are two of the Beatles' most overtly folk-rock tracks, and both clearly show the influence of the Byrds. But what it did do was remove several of the more electric songs from the album, and replace them with acoustic ones:\n\n[Excerpt: The Beatles, \"I've Just Seen a Face\"]\n\nThis, completely inadvertently, gave the American Rubber Soul lineup a greater sense of cohesion than the British one. Wilson later said \"I listened to Rubber Soul, and I said, 'How could they possibly make an album where the songs all sound like they come from the same place?'\" At other times he's described his shock at hearing \"a whole album of only good songs\" and similar phrases. Because up to this point, Wilson had always included filler tracks on albums, as pretty much everyone did in the early sixties.\n\nIn the American pop music market, up to the mid sixties, albums were compilations of singles plus whatever random tracks happened to be lying around. And so for example in late 1963 the Beach Boys had released two albums less than a month apart -- Surfer Girl and Little Deuce Coupe. Given that Brian Wilson wrote or co-wrote all the group's original material, it wasn't all that surprising that Little Deuce Coupe had to include four songs that had been released on previous albums, including two that were on Surfer Girl from the previous month. It was the only way the group could keep up with the demand for new product from a company that had no concept of popular music as art.\n\nOther Beach Boys albums had included padding such as generic surf instrumentals, comedy sketches like \"Cassius\" Love vs. \"Sonny\" Wilson, and in the case of The Beach Boys Today!, a track titled \"Bull Session With the Big Daddy\", consisting of two minutes of random chatter with the photographer Earl Leaf while they all ate burgers:\n\n[Excerpt: The Beach Boys and Earl Leaf, \"Bull Session With the Big Daddy\"]\n\nThis is not to attack the Beach Boys. This was a simple response to the commercial pressures of the marketplace. Between October 1962 and November 1965, they released eleven albums. That's about an album every three months, as well as a few non-album singles. And on top of that Brian had also been writing songs during that time for Jan & Dean, the Honeys, the Survivors and others, and had collaborated with Gary Usher and Roger Christian on songs for Muscle Beach Party, one of American International Pictures' series of Beach Party films. It's unsurprising that not everything produced on this industrial scale was a masterpiece.\n\nIndeed, the album the Beach Boys released directly before Pet Sounds could be argued to be an entire filler album. Many biographies say that Beach Boys Party! was recorded to buy Brian time to make Pet Sounds, but the timelines don't really match up on closer investigation. Beach Boys Party! was released in November 1965, before Brian ever heard Rubber Soul, which came out later, and before he started writing the material that became Pet Sounds.\n\nBeach Boys Party! was a solution to a simple problem -- the group were meant to deliver three albums that year, and they didn't have three albums worth of material. Some shows had been recorded for a possible live album, but they'd released a live album in 1964 and hadn't really changed their setlist very much in the interim.\n\nSo instead, they made a live-in-the-studio album, with the conceit that it was recorded at a party the group were holding. Rather than the lush Wrecking Crew instrumentation they'd been using in recent months, everything was played on acoustic guitars, plus some bongos provided by Wrecking Crew drummer Hal Blaine and some harmonica from Billy Hinsche of the boy band Dino, Desi, and Billy, whose sister Carl Wilson was shortly to marry. The album included jokes and false starts, and was overlaid with crowd noise, to give the impression that you were listening to an actual party where a few people were sitting round with guitars and having fun.\n\nThe album consisted of songs that the group liked and could play without rehearsal -- novelty hits from a few years earlier like \"Alley Oop\" and \"Hully Gully\", a few Beatles songs, and old favourites like the Everly Brothers hit \"Devoted to You\" -- in a rather lovely version with two-part harmony by Mike and Brian, which sounds much better in a remixed version released later without the party-noise overdubs:\n\n[Excerpt: The Beach Boys, \"Devoted to You (remix)\"]\n\nBut the song that defined the album, which became a massive hit, and which became an albatross around the band's neck about which some of them would complain for a long time to come, didn't even have one of the Beach Boys singing lead. As we discussed back in the episode on \"Surf City\", by this point Jan and Dean were recording their album \"Folk 'n' Roll\", their attempt at jumping on the folk-rock bandwagon, which included the truly awful \"The Universal Coward\", a right-wing answer song  to \"The Universal Soldier\" released as a Jan Berry solo single:\n\n[Excerpt: Jan Berry, \"The Universal Coward\"]\n\nDean Torrence was by this point getting sick of working with Berry, and was also deeply unimpressed with the album they were making, so he popped out of the studio for a while to go and visit his friends in the Beach Boys, who were recording nearby. He came in during the Party sessions, and everyone was suggesting songs to perform, and asked Dean to suggest something. He remembered an old doo-wop song that Jan and Dean had recorded a cover version of, and suggested that. The group had Dean sing lead, and ran through a sloppy version of it, where none of them could remember the words properly:\n\n[Excerpt: The Beach Boys, \"Barbara Ann\"]\n\nAnd rather incredibly, that became one of the biggest hits the group ever had, making number two on the Billboard chart (and number one on other industry charts like Cashbox), number three in the UK, and becoming a song that the group had to perform at almost every live show they ever did, together or separately, for at least the next fifty-seven years.\n\nBut meanwhile, Brian had been working on other material. He had not yet had his idea for an album made up entirely of good songs, but he had been experimenting in the studio. He'd worked on a handful of tracks which had pointed in new directions. One was a single, \"The Little Girl I Once Knew\":\n\n[Excerpt: The Beach Boys, \"The Little Girl I Once Knew\"]\n\nJohn Lennon gave that record a very favourable review, saying \"This is the greatest! Turn it up, turn it right up. It's GOT to be a hit. It's the greatest record I've heard for weeks. It's fantastic.\"\n\nBut the record only made number twenty -- a perfectly respectable chart placing, but nowhere near as good as the group's recent run of hits -- in part because its stop-start nature meant that the record had \"dead air\" -- moments of silence -- which made DJs avoid playing it, because they believed that dead air, even only a second of it here and there, would make people tune to another station.\n\nAnother track that Brian had been working on was an old folk song suggested by Alan Jardine. Jardine had always been something of a folkie, of the Kingston Trio variety, and he had suggested that the group might record the old song \"The Wreck of the John B\", which the Kingston Trio had recorded. The Trio's version in turn had been inspired by the Weavers' version of the song from 1950:\n\n[Excerpt: The Weavers, \"The Wreck of the John B\"]\n\nBrian had at first not been impressed, but Jardine had fiddled with the chord sequence slightly, adding in a minor chord to make the song slightly more interesting, and Brian had agreed to record the track, though he left the instrumental without vocals for several months:\n\n[Excerpt: The Beach Boys, \"Sloop John B (instrumental)\"]\n\nThe track was eventually finished and released as a single, and unlike \"The Little Girl I Once Knew\" it was a big enough hit that it was included on the next album, though several people have said it doesn't fit. Lyrically, it definitely doesn't, but musically, it's very much of a piece with the other songs on what became Pet Sounds:\n\n[Excerpt: The Beach Boys, \"Sloop John B\"]\n\nBut while Wilson was able to create music by himself, he wasn't confident about his ability as a lyricist. Now, he's not a bad lyricist by any means -- he's written several extremely good lyrics by himself -- but Brian Wilson is not a particularly articulate or verbal person, and he wanted someone who could write lyrics as crafted as his music, but which would express the ideas he was trying to convey. He didn't think he could do it himself, and for whatever reason he didn't want to work with Mike Love, who had co-written the majority of his recent songs, or with any of his other collaborators.\n\nHe did write one song with Terry Sachen, the Beach Boys' road manager at the time, which dealt obliquely with those acid-induced concepts of \"ego death\":\n\n[Excerpt: The Beach Boys, \"Hang on to Your Ego\"]\n\nBut while the group recorded that song, Mike Love objected vociferously to the lyrics. While Love did try cannabis a few times in the late sixties and early seventies, he's always been generally opposed to the use of illegal drugs, and certainly didn't want the group to be making records that promoted their use -- though I would personally argue that \"Hang on to Your Ego\" is at best deeply ambiguous about the prospect of ego death.  Love rewrote some of the lyrics, changing the title to \"I Know There's an Answer\", though as with all such bowdlerisation efforts he inadvertently left in some of the drug references:\n\n[Excerpt: The Beach Boys, \"I Know There's an Answer\"]\n\nBut Wilson wasn't going to rely on Sachen for all the lyrics. Instead he turned to Tony Asher.\n\nAsher was an advertising executive, who Wilson probably met through Loren Daro -- there is some confusion over the timeline of their meeting, with some sources saying they'd first met in 1963 and that Asher had introduced Wilson to Daro, but others saying that the introductions went the other way, and that Daro introduced Asher to Wilson in 1965. But Asher and Daro had been friends for a long time, and so Wilson and Asher were definitely orbiting in the same circles.\n\nThe most common version of the story seems to be that Asher was working in Western Studios, where he was recording a jingle - the advertising agency had him writing jingles because he was an amateur songwriter, and as he later put it nobody else at the agency knew the difference between E flat and A flat. Wilson was also working in the studio complex, and Wilson dragged Asher in to listen to some of the demos he was recording -- at that time Wilson was in the habit of inviting anyone who was around to listen to his works in progress. Asher chatted with him for a while, and thought nothing of it, until he got a phone call at work a few weeks later from Brian Wilson, suggesting the two write together.\n\nWilson was impressed with Asher, who he thought of as very verbal and very intelligent, but Asher was less impressed with Wilson. He has softened his statements in recent decades, but in the early seventies he would describe Wilson as \"a genius musician but an amateur human being\", and sharply criticise his taste in films and literature, and his relationship with his wife.\n\nThis attitude seems at least in part to have been shared by a lot of the people that Wilson was meeting and becoming influenced by. One of the things that is very noticeable about Wilson is that he has no filters at all, and that makes his music some of the most honest music ever recorded. But that same honesty also meant that he could never be cool or hip. He was -- and remains -- enthusiastic about the things he likes, and he likes things that speak to the person he is, not things that fit some idea of what the in crowd like. And the person Brian Wilson is is a man born in 1942, brought up in a middle-class suburban white family in California, and his tastes are the tastes one would expect from that background.\n\nAnd those tastes were not the tastes of the hipsters and scenesters who were starting to become part of his circle at the time. And so there's a thinly-veiled contempt in the way a lot of those people talked about Wilson, particularly in the late sixties and early seventies. Wilson, meanwhile, was desperate for their approval, and trying hard to fit in, but not quite managing it.\n\nAgain, Asher has softened his statements more recently, and I don't want to sound too harsh about Asher -- both men were in their twenties, and still  trying to find their place in the world, and I wouldn't want to hold anyone's opinions from their twenties against them decades later. But that was the dynamic that existed between them. Asher saw himself as something of a sophisticate, and Wilson as something of a hick in contrast, but a hick who unlike him had created a string of massive hit records. And Asher did, always, respect Wilson's musical abilities. And Wilson in turn looked up to Asher, even while remaining the dominant partner, because he respected Asher's verbal facility.\n\nAsher took a two-week sabbatical from his job at the advertising agency, and during those two weeks, he and Wilson collaborated on eight songs that would make up the backbone of the album that would become Pet Sounds.\n\nThe first song the two worked on was a track that had originally been titled \"In My Childhood\". Wilson had already recorded the backing track for this, including the sounds of bicycle horns and bells to evoke the feel of being a child:\n\n[Excerpt: The Beach Boys, \"You Still Believe in Me (instrumental track)\"]\n\nThe two men wrote a new lyric for the song, based around a theme that appears in many of Wilson's songs -- the inadequate man who is loved by a woman who is infinitely superior to him, who doesn't understand why he's loved, but is astonished by it. The song became \"You Still Believe in Me\":\n\n[Excerpt: The Beach Boys, \"You Still Believe in Me\"]\n\nThat song also featured an instrumental contribution of sorts by Asher. Even though the main backing track had been recorded before the two started working together, Wilson came up with an idea for an intro for the song, which would require a particular piano sound. To get that sound, Wilson held down the keys on a piano, while Asher leaned into the piano and plucked the strings manually. The result, with Wilson singing over the top, sounds utterly lovely:\n\n[Excerpt: The Beach Boys, \"You Still Believe in Me\"]\n\nNote that I said that Wilson and Asher came up with new lyrics together. There has been some slight dispute about the way songwriting credits were apportioned to the songs. Generally the credits said that Wilson wrote all the music, while Asher and Wilson wrote the lyrics together, so Asher got twenty-five percent of the songwriting royalties and Wilson seventy-five percent. Asher, though, has said that there are some songs for which he wrote the whole lyric by himself, and that he also made some contributions to the music on some songs -- though he has always said that the majority of the musical contribution was Wilson's, and that most of the time the general theme of the lyric, at least, was suggested by Wilson.\n\nFor the most part, Asher hasn't had a problem with that credit split, but he has often seemed aggrieved -- and to my mind justifiably -- about the song \"Wouldn't it Be Nice\". Asher wrote the whole lyric for the song, though inspired by conversations with Wilson, but accepted his customary fifty percent of the lyrical credit. The result became one of the big hits from the album:\n\n[Excerpt: The Beach Boys, \"Wouldn't It Be Nice?\"]\n\nBut -- at least according to Mike Love, in the studio he added a single line to the song:\n\n[Excerpt: The Beach Boys, \"Wouldn't it Be Nice?\"]\n\nWhen Love sued Brian Wilson in 1994, over the credits to thirty-five songs, he included \"Wouldn't it Be Nice\" in the list because of that contribution. Love now gets a third of the songwriting royalties, taken proportionally from the other two writers. Which means that he gets a third of Wilson's share and a third of Asher's share. So Brian Wilson gets half the money, for writing all the music, Mike Love gets a third of the money, for writing \"Good night baby, sleep tight baby\", and Tony Asher gets a sixth of the money -- half as much as Love -- for writing all the rest of the lyric.\n\nAgain, this is not any one individual doing anything wrong – most of the songs in the lawsuit were ones where Love wrote the entire lyric, or a substantial chunk of it, and because the lawsuit covered a lot of songs the same formula was applied to borderline cases like “Wouldn't it Be Nice” as it was to clearcut ones like “California Girls”, where nobody disputes Love's authorship of the whole lyric. It's just the result of a series of reasonable decisions, each one of which makes sense in isolation, but which has left Asher earning significantly less from one of the most successful songs he ever wrote in his career than he should have earned.\n\nThe songs that Asher co-wrote with Wilson were all very much of a piece, both musically and lyrically. Pet Sounds really works as a whole album better than it does individual tracks, and while some of the claims made about it -- that it's a concept album, for example -- are clearly false, it does have a unity to it, with ideas coming back in different forms. For example, musically, almost every new song on the album contains a key change down a minor third at some point -- not the kind of thing where the listener consciously notices that an idea has been repeated, but definitely the kind of thing that makes a whole album hold together.\n\nIt also differs from earlier Beach Boys albums in that the majority of the lead vocals are by Brian Wilson. Previously, Mike Love had been the dominant voice on Beach Boys records, with Brian as second lead and the other members taking few or none. Now Love only took two main lead vocals, and was the secondary lead on three more. Brian, on the other hand, took six primary lead vocals and two partial leads. The later claims by some people that this was a Brian Wilson solo album in all but name are exaggerations -- the group members did perform on almost all of the tracks -- but it is definitely much more of a personal, individual statement than the earlier albums had been. The epitome of this was \"I Just Wasn't Made For These Times\", which Asher wrote the lyrics for but which was definitely Brian's idea, rather than Asher's.\n\n[Excerpt: The Beach Boys, \"I Just Wasn't Made For These Times\"]\n\nThat track also featured the first use on a Beach Boys record of the electro-theremin, an electronic instrument invented by session musician Paul Tanner, a former trombone player with the Glenn Miller band, who had created it to approximate the sound of a Theremin while being easier to play:\n\n[Excerpt: The Beach Boys, \"I Just Wasn't Made For These Times\"]\n\nThat sound would turn up on future Beach Boys records...\n\nBut the song that became the most lasting result of the Wilson/Asher collaboration was actually one that is nowhere near as personal as many of the other songs on the record, that didn't contain a lot of the musical hallmarks that unify the album, and that didn't have Brian Wilson singing lead. Of all the songs on the album, \"God Only Knows\" is the one that has the most of Tony Asher's fingerprints on it. Asher has spoken in the past about how when he and Wilson were writing, Asher's touchstones were old standards like \"Stella By Starlight\" and \"How Deep is the Ocean?\", and \"God Only Knows\" easily fits into that category. It's a crafted song rather than a deep personal expression, but the kind of craft that one would find in writers like the Gershwins, every note and syllable perfectly chosen:\n\n[Excerpt: The Beach Boys, \"God Only Knows\"]\n\nOne of the things that is often wrongly said about the song is that it's the first pop song to have the word \"God\" in the title. It isn't, and indeed it isn't even the first pop song to be called \"God Only Knows\", as there was a song of that name recorded by the doo-wop group the Capris in 1954:\n\n[Excerpt: The Capris, \"God Only Knows\"]\n\nBut what's definitely true is that Wilson, even though he was interested in creating spiritual music, and was holding prayer sessions with his brother Carl before vocal takes, was reluctant to include the word in the song at first, fearing it would harm radio play. He was probably justified in his fears -- a couple of years earlier he'd produced a record called \"Pray for Surf\" by the Honeys, a girl-group featuring his wife:\n\n[Excerpt: The Honeys, \"Pray For Surf\"]\n\nThat record hadn't been played on the radio, in part because it was considered to be trivialising religion.\n\nBut Asher eventually persuaded Wilson that it would be OK, saying \"What do you think we should do instead? Say 'heck only knows'?\"\n\nAsher's lyric was far more ambiguous than it may seem -- while it's on one level a straightforward love song, Asher has always pointed out that the protagonist never says that he loves the object of the song, just that he'll make her *believe* that he loves her. Coupled with the second verse, which could easily be read as a threat of suicide if the object leaves the singer, it would be very, very, easy to make the song into something that sounds like it was from the point of view of a narcissistic, manipulative, abuser.\n\nThat ambiguity is also there in the music, which never settles in a strong sense of key. The song starts out with an A chord, which you'd expect to lead to the song being in A, but when the horn comes in, you get a D# note, which isn't in that key, and then when the verse starts, it starts on an inversion of a D chord, before giving you enough clues that by the end of the verse you're fairly sure you're in the key of E, but it never really confirms that:\n\n[Excerpt: The Beach Boys, \"God Only Knows (instrumental)\"]\n\nSo this is an unsettling, ambiguous, song in many ways. But that's not how it sounds, nor how Brian at least intended it to sound. So why doesn't it sound that way? In large part it's down to the choice of lead vocalist. If Mike Love had sung this song, it might have sounded almost aggressive. Brian *did* sing it in early attempts at the track, and he doesn't sound quite right either -- his vocal attitude is just... not right:\n\n[Excerpt: The Beach Boys, \"God Only Knows (Brian Wilson vocal)\"]\n\nBut eventually Brian hit on getting his younger brother Carl to sing lead. At this point Carl had sung very few leads on record -- there has been some dispute about who sang what, exactly,  because of the family resemblance which meant all the core band members could sound a little like each other, but it's generally considered that he had sung full leads on two album tracks -- \"Pom Pom Play Girl\" and \"Girl Don't Tell Me\" -- and partial leads on two other tracks, covers of \"Louie Louie\" and \"Summertime Blues\". At this point he wasn't really thought of as anything other than a backing vocalist, but his soft, gentle, performance on \"God Only Knows\" is one of the great performances:\n\n[Excerpt: The Beach Boys, \"God Only Knows (vocals)\"]\n\nThe track was actually one of those that required a great deal of work in the studio to create the form which now seems inevitable. Early attempts at the recording included a quite awful saxophone solo:\n\n[Excerpt: The Beach Boys \"God Only Knows (early version)\"]\n\nAnd there were a lot of problems with the middle until session keyboard player Don Randi suggested the staccato break that would eventually be used:\n\n[Excerpt: The Beach Boys, \"God Only Knows\"]\n\nAnd similarly, the tag of the record was originally intended as a mass of harmony including all the Beach Boys, the Honeys, and Terry Melcher:\n\n[Excerpt: The Beach Boys, \"God Only Knows (alternate version with a capella tag)\"]\n\nBefore Brian decided to strip it right back, and to have only three voices on the tag -- himself on the top and the bottom, and Bruce Johnston singing in the middle:\n\n[Excerpt: The Beach Boys, \"God Only Knows\"]\n\nWhen Pet Sounds came out, it was less successful in the US than hoped -- it became the first of the group's albums not to go gold on its release, and it only made number ten on the album charts. By any objective standards, this is still a success, but it was less successful than the record label had hoped, and was taken as a worrying sign.\n\nIn the UK, though, it was a different matter. Up to this point, the Beach Boys had not had much commercial success in the UK, but recently Andrew Loog Oldham had become a fan, and had become the UK publisher of their original songs, and was interested in giving them the same kind of promotion that he'd given Phil Spector's records. Keith Moon of the Who was also a massive fan, and the Beach Boys had recently taken on Derek Taylor, with his strong British connections, as their publicist. Not only that, but Bruce Johnston's old friend Kim Fowley was now based in London and making waves there.\n\nSo in May, in advance of a planned UK tour set for November that year, Bruce Johnston and Derek Taylor flew over to the UK to press the flesh and schmooze. Of all the group members, Johnston was the perfect choice to do this -- he's by far the most polished of them in terms of social interaction, and he was also the one who, other than Brian, had the least ambiguous feelings about the group's new direction, being wholeheartedly in favour of it.\n\nJohnston and Taylor met up with Keith Moon, Lennon and McCartney, and other pop luminaries, and played them the record. McCartney in particular was so impressed by Pet Sounds and especially \"God Only Knows\", that he wrote this, inspired by the song, and recorded it even before Pet Sounds' UK release at the end of June:\n\n[Excerpt: The Beatles, \"Here, There, and Everywhere\"]\n\nAs a result of Johnston and Taylor's efforts, and the promotional work by Oldham and others, Pet Sounds reached number two on the UK album charts, and \"God Only Knows\" made number two on the singles charts. (In the US, it was the B-side to \"Wouldn't it Be Nice\", although it made the top forty on its own merits too). The Beach Boys displaced the Beatles in the readers' choice polls for best band in the NME in 1966, largely as a result of the album, and Melody Maker voted it joint best album of the year along with the Beatles' Revolver.\n\nThe Beach Boys' commercial fortunes were slightly on the wane in the US, but they were becoming bigger than ever in the UK. But a big part of this was creating expectations around Brian Wilson in particular. Derek Taylor had picked up on a phrase that had been bandied around -- enough that Murry Wilson had used it to mock Brian in the awful \"Help Me, Rhonda\" sessions -- and was promoting it widely as a truism. Everyone was now agreed that Brian Wilson was a genius. And we'll see how that expectation plays out over the next few weeks..\n\n[Excerpt: The Beach Boys, \"Caroline, No\"]",
  "itunes:subtitle": "Episode one hundred and forty-two of A History of Rock Music in Five Hundred Songs looks at “God Only Knows by the Beach Boys, and the creation of the Pet Sounds album. Click the full post to read liner notes, links to more information, and a transcript ",
  "itunes:keywords": "Al Jardine,Art Laboe,Bob Keane,Brian Wilson,Bruce Johnston,Carl Wilson,Derek Taylor,Glen Campbell,Jan and Dean,Mike Love,Murry Wilson,Russ Titelman,Terry Melcher,The Beach Boys,The Beatles,The Wrecking Crew,Tony Asher",
  "itunes:episodeType": "full",
  "itunes:episode": 142,
  "content:encoded": "Episode one hundred and forty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at “God Only Knows\" by the Beach Boys, and the creation of the <em>Pet Sounds</em> album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/61874850\">on \"Sunny\" by Bobby Hebb</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I’ve checked for specific things.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe’s <a href=\"http://www.bellagio10452.com/\">Bellagio 10452 </a>site is an invaluable resource.\n\nJon Stebbins’ <a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ </a>is a good balance between accuracy and readability.\n\nAnd <a href=\"https://amzn.to/3i22CcH\">Philip Lambert’s <em>Inside the Music of Brian Wilson</em></a> is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nI have also referred to Brian Wilson's autobiography, <em><a href=\"https://amzn.to/3AMbmys\">I Am Brian Wilson</a></em>, and to Mike Love's, <em><a href=\"https://amzn.to/3AMbmys\">Good Vibrations: My Life as a Beach Boy</a>.</em>\n\nFor material specific to <em>Pet Sounds</em> I have used Kingsley Abbot's <a href=\"https://amzn.to/3ANWH5Z\"><em>The Beach Boys' Pet Sounds: The Greatest Album of the Twentieth Century</em></a> and Charles L Granata's <em><a href=\"https://amzn.to/3gc5fdq\">I Just Wasn't Made For These Times: Brian Wilson and the Making of Pet Sounds</a>. </em>\n\nI also used the 126-page book <em>The Making of Pet Sounds</em> by David Leaf, which came as part of the <a href=\"https://amzn.to/3GeEM9F\"><em>The Pet Sounds Sessions </em></a>box set, which also included the many alternate versions of songs from the album used here. Sadly both that box set and the 2016 updated reissue of it appear currently to be out of print, but either is <em>well</em> worth obtaining for anyone who is interested in how great records are made.\n\nOf the versions of <em>Pet Sounds</em> that are still in print, <a href=\"https://amzn.to/3Ge4Z8k\">this double-CD version</a> is the one I'd recommend. It has the original mono mix of the album, the more recent stereo remix, the instrumental backing tracks, and live versions of several songs.\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it.\n\nThe YouTube drum tutorial I excerpted a few seconds of to show a shuffle beat is <a href=\"https://www.youtube.com/watch?v=2CwlSaQZLkY\">here</a>.\n\n<strong>Transcript</strong>\n\nWe're still in the run of episodes that deal with the LA pop music scene -- though next week we're going to move away from LA, while still dealing with a lot of the people who would play a part in that scene. But today we're hitting something that requires a bit of explanation.\n\nMost artists covered in this podcast get one or at the most two episodes. Some get slightly more -- the major artists who are present for many revolutions in music, or who have particularly important careers, like Fats Domino or the Supremes. And then there are a few very major artists who get a lot more. The Beatles, for example, are going to get eight in total, plus there will be episodes on some of their solo careers. Elvis has had six, and will get one more wrap-up episode.\n\nThis is the third Beach Boys episode, and there are going to be three more after this, because the Beach Boys were one of the most important acts of the decade.\n\nBut normally, I limit major acts to one episode per calendar year of their career. This means that they will average at most one episode every ten episodes, so while for example the episodes on \"Mystery Train\" and \"Heartbreak Hotel\" came close together, there was then a reasonable gap before another Elvis episode.\n\nThis is not possible for the Beach Boys, because this episode and the next two Beach Boys ones all take place over an incredibly compressed timeline. In May 1966, they released an album that has consistently been voted the best album ever in polls of critics, and which is certainly one of the most influential even if one does not believe there is such a thing as a \"best album ever\". In October 1966 they released one of the most important singles ever -- a record that is again often considered the single best pop single of all time, and which again was massively influential. And then in July 1967 they released the single that was intended to be the lead-off single from their album <em>Smile,</em> an album that didn't get released until decades later, and which became a legend of rock music that was arguably more influential by *not* being released than most records that are released manage to be.\n\nAnd these are all very different stories, stories that need to be told separately.\n\nThis means that episode one hundred and forty-two, episode one hundred and forty-six, and episode one hundred and fifty-three are all going to be about the Beach Boys. There will be one final later episode about them, too, but the next few months are going to be very dominated by them, so I apologise in advance for that if that's not something you're interested in. Though it also means that with luck some of these episodes will be closer to the shorter length of podcast I prefer rather than the ninety-minute mammoths we've had recently. Though I'm afraid this is another long one.\n\nWhen we left the Beach Boys, we'd just heard that Glen Campbell had temporarily replaced Brian Wilson on the road, after Wilson's mental health had finally been unable to take the strain of touring while also being the group's record producer, principal songwriter, and leader. To thank Campbell, who at this point was not at all well known in his own right, though he was a respected session guitarist and had released a few singles, Brian had co-written and produced \"Guess I'm Dumb\" for him, a track which prefigured the musical style that Wilson was going to use for the next year or so:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb\"]\n\nIt's worth looking at \"Guess I'm Dumb\" in a little detail, as it points the way forward to a lot of Wilson's songwriting over the next year. Firstly, of course, there are the lyrical themes of insecurity and of what might even be descriptions of mental illness in the first verse -- \"the way I act don't seem like me, I'm not on top like I used to be\". The lyrics are by Russ Titelman, but it's reasonable to assume that as with many of his collaborations, Brian brought in the initial idea.\n\nThere's also a noticeable change in the melodic style compared to Wilson's earlier melodies. Up to this point, Wilson has mostly been writing what get called \"horizontal\" melody lines -- ones with very little movement, and small movements, often centred on a single note or two. There are exceptions of course, and plenty of them, but a typical Brian Wilson melody up to this point is the kind of thing where even I can hit the notes more or less OK -- [sings] \"Well, she got her daddy's car and she cruised through the hamburger stand now\". It's not quite a monotone, but it's within a tight range, and you don't have to move far from one note to another.\n\nBut \"Guess I'm Dumb\" is incorporating the influence of Roy Orbison, and more obviously of Burt Bacharach, and it's *ludicrously* vertical, with gigantic leaps all over the place, in places that are not obvious. It requires the kind of precision that only a singer like Campbell can attain, to make it sound at all natural:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb\"]\n\nBacharach's influence is also noticeable in the way that the chord changes are very different from those that Wilson was using before. Up to this point, when Wilson wrote unusual chord changes, it was mostly patterns like \"The Warmth of the Sun\", which is wildly inventive, but mostly uses very simple triads and sevenths. Now he was starting to do things like the line \"I guess I'm dumb but I don't care\", which is sort of a tumbling set of inversions of the same chord that goes from a triad with the fifth in the bass, to a major sixth, to a minor eleventh, to a minor seventh.\n\nPart of the reason that Brian could start using these more complex voicings was that he was also moving away from using just the standard guitar/bass/drums lineup, sometimes with keyboards and saxophone, which had been used on almost every Beach Boys track to this point. Instead, as well as the influence of Bacharach, Wilson was also being influenced by Jack Nitzsche's arrangements for Phil Spector's records, and in particular by the way Nitzsche would double instruments, and have, say, a harpsichord and a piano play the same line, to create a timbre that was different from either individual instrument. But where Nitzsche and Spector used the technique along with a lot of reverb and overdubbing to create a wall of sound which was oppressive and overwhelming, and which obliterated the sounds of the individual instruments, Wilson used the same instrumentalists, the Wrecking Crew, to create something far more delicate:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb (instrumental and backing vocals)\"]\n\nCampbell does such a good job on \"Guess I'm Dumb\" that one has to wonder what would  have happened if he'd remained with the Beach Boys. But Campbell had of course not been able to join the group permanently -- he had his own career to attend to, and that would soon take off in a big way, though he would keep playing on the Beach Boys' records for a while yet as a member of the Wrecking Crew.\n\nBut Brian Wilson was still not well enough to tour. In fact, as he explained to the rest of the group, he never intended to tour again -- and he wouldn't be a regular live performer for another twelve years. At first the group were terrified -- they thought he was talking about quitting the group, or the group splitting up altogether. But Brian had a different plan.\n\nFrom that point on, there were two subtly different lineups of the group. In the studio, Brian would sing his parts as always, but the group would get a permanent replacement for him on tour -- someone who could replace him on stage. While the group was on tour, Brian would use the time to write songs and to record backing tracks. He'd already started using the Wrecking Crew to add a bit of additional musical colour to some of the group's records, but from this point on, he'd use them to record the whole track, maybe getting Carl to add a bit of guitar as well if he happened to be around, but otherwise just using the group to provide vocals.\n\nIt's important to note that this *was* a big change. A lot of general music history sources will say things like \"the Beach Boys never played on their own records\", and this is taken as fact by people who haven't investigated further. In fact, the basic tracks for all their early hits were performed by the group themselves -- \"Surfin'\", \"Surfin' Safari\", \"409\", \"Surfer Girl\", \"Little Deuce Coupe\", \"Don't Worry Baby\" and many more were entirely performed by the Beach Boys, while others like \"I Get Around\" featured the group with a couple of additional musicians augmenting them. The idea that the group never played on their records comes entirely from their recordings from 1965 and 66, and even there often Carl would overdub a guitar part.\n\nAnd at this point, the Beach Boys were still playing on the majority of their recordings, even on sophisticated-sounding records like \"She Knows Me Too Well\", which is entirely a group performance other than Brian's friend, Russ Titelman, the co-writer of \"Guess I'm Dumb\", adding some percussion by hitting a microphone stand with a screwdriver:\n\n[Excerpt: The Beach Boys, \"She Knows Me Too Well\"]\n\nSo the plan to replace the group's instrumental performances in the studio was actually a bigger change than it might seem. But an even bigger change was the live performances, which of course required the group bringing in a permanent live replacement for Brian. They'd already tried this once before, when he'd quit the road for a while and they'd brought Al Jardine back in, but David Marks quitting had forced him back on stage. Now they needed someone to take his place for good.\n\nThey phoned up their friend Bruce Johnston to see if he knew anyone, and after suggesting a couple of names that didn't work out, he volunteered his own services, and as of this recording he's spent more than fifty years in the band (he quit for a few years in the mid-seventies, but came back).\n\nWe've seen Johnston turn up several times already, most notably in the episode on \"LSD-25\", where he was one of the musicians on the track we looked at, but for those of you who don't remember those episodes, he was pretty much *everywhere* in California music in the late fifties and early sixties. He had been in a band at school with Phil Spector and Sandy Nelson, and another band with Jan and Dean, and he'd played on Nelson's \"Teen Beat\", produced by Art Laboe:\n\n[Excerpt: Sandy Nelson, \"Teen Beat\"]\n\nHe'd been in the house band at those shows Laboe put on at El Monte stadium we talked about a couple of episodes back, he'd been a witness to John Dolphin's murder, he'd been a record producer for Bob Keane, where he'd written and produced songs for Ron Holden, the man who had introduced \"Louie Louie\" to Seattle:\n\n[Excerpt: Ron Holden, \"Gee But I'm Lonesome\"]\n\nHe'd written \"The Tender Touch\" for Richard Berry's backing group The Pharaos, with Berry singing backing vocals on this one:\n\n[Excerpt: The Pharaos, \"The Tender Touch\"]\n\nHe'd helped Bob Keane compile Ritchie Valens' first posthumous album, he'd played on \"LSD-25\" and \"Moon Dawg\" by the Gamblers:\n\n[Excerpt: The Gamblers, \"Moon Dawg\"]\n\nHe'd arranged and produced the top ten hit “Those Oldies but Goodies (Remind Me of You)” for Little Caesar and the Romans:\n\n[Excerpt Little Caesar and the Romans, \"Those Oldies but Goodies (Remind Me of You)\"]\n\nBasically, wherever you looked in the LA music scene in the early sixties, there was Bruce Johnston somewhere in the background. But in particular, he was suitable for the Beach Boys because he had a lot of experience in making music that sounded more than a little like theirs. He'd made cheap surf records as the Bruce Johnston Surfing Band:\n\n[Excerpt: Bruce Johnston, \"The Hamptons\"]\n\nAnd with his long-time friend and creative partner Terry Melcher he had, as well as working on several Paul Revere and the Raiders records, also recorded hit Beach Boys soundalikes both as their own duo, Bruce and Terry:\n\n[Excerpt: Bruce and Terry, \"Summer Means Fun\"]\n\nand under the name of a real group that Melcher had signed, but who don't seem to have sung much on their own big hit, the Rip Chords:\n\n[Excerpt: The Rip Chords, \"Hey Little Cobra\"]\n\nJohnston fit in well with the band, though he wasn't a bass player before joining, and had to be taught the parts by Carl and Al. But he's probably the technically strongest musician in the band, and while he would later switch to playing keyboards on stage, he was quickly able to get up to speed on the bass well enough to play the parts that were needed. He also wasn't quite as strong a falsetto singer as Brian Wilson, as can be heard by listening to this live recording of the group singing \"I Get Around\" in 1966:\n\n[Excerpt: The Beach Boys, \"I Get Around (live 1966)\"]\n\nJohnston is actually an excellent singer -- and can still hit the high notes today. He sings the extremely high falsetto part on \"Fun Fun Fun\" at the end of every Beach Boys show. But his falsetto was thinner than Wilson's, and he also has a distinctive voice which can be picked out from the blend in a way that none of the other Beach Boys' voices could -- the Wilson brothers and Mike Love all have a strong family resemblance, and Al Jardine always sounded spookily close to them.\n\nThis meant that increasingly, the band would rearrange the vocal parts on stage, with Carl or Al taking the part that Brian had taken in the studio. Which meant that if, say, Al sang Brian's high part, Carl would have to move up to sing the part that Al had been singing, and then Bruce would slot in singing the part Carl had sung in the studio. This is a bigger difference than it sounds, and it meant that there was now a need for someone to work out live arrangements that were different from the arrangements on the records -- someone had to reassign the vocal parts, and also work out how to play songs that had been performed by maybe eighteen session musicians playing French horns and accordions and vibraphones with a standard rock-band lineup without it sounding too different from the record.\n\nCarl Wilson, still only eighteen when Brian retired from the road, stepped into that role, and would become the de facto musical director of the Beach Boys on stage for most of the next thirty years, to the point that many of the group's contracts for live performances at this point specified that the promoter was getting \"Carl Wilson and four other musicians\".\n\nThis was a major change to the group's dynamics. Up to this point, they had been a group with a leader -- Brian -- and a frontman -- Mike, and three other members. Now they were a more democratic group on stage, and more of a dictatorship in the studio. This was, as you can imagine, not a stable situation, and was one that would not last long.\n\nBut at first, this plan seemed to go very, very well. The first album to come out of this new hybrid way of working, The Beach Boys Today!, was started before Brian retired from touring, and some of the songs on it were still mostly or solely performed by the group, but as we heard with \"She Knows Me Too Well\" earlier, the music was still more sophisticated than on previous records, and this can be heard on songs like \"When I Grow Up to Be a Man\", where the only session musician is the harmonica player, with everything else played by the group:\n\n[Excerpt: The Beach Boys, \"When I Grow Up to Be a Man\"]\n\nBut the newer sophistication really shows up on songs like \"Kiss Me Baby\", where most of the instrumentation is provided by the Wrecking Crew -- though Carl and Brian both play on the track -- and so there are saxophones, vibraphones, French horn, cor anglais, and multiple layers of twelve-string guitar:\n\n[Excerpt: The Beach Boys, \"Kiss Me Baby\"]\n\nToday had several hit singles on it -- \"Dance, Dance, Dance\", \"When I Grow Up to be a Man\", and their cover version of Bobby Freeman's \"Do You Wanna Dance?\" all charted -- but the big hit song on the album actually didn't become a hit in that version. \"Help Me Ronda\" was a piece of album filler with a harmonica part played by Billy Lee Riley, and was one of Al Jardine's first lead vocals on a Beach Boys record -- he'd only previously sung lead on the song \"Christmas Day\" on their Christmas album:\n\n[Excerpt: The Beach Boys, \"Help Me Ronda\"]\n\nWhile the song was only intended as album filler, other people saw the commercial potential in the song. Bruce Johnston was at this time still signed to Columbia records as an artist, and wasn't yet singing on Beach Boys records, and he recorded a version of the song with Terry Melcher as a potential single:\n\n[Excerpt: Bruce and Terry, \"Help Me Rhonda\"]\n\nBut on seeing the reaction to the song, Brian decided to rerecord it as a single. Unfortunately, Murry Wilson turned up to the session. Murry had been fired as the group's manager by his sons the previous year, though he still owned the publishing company that published their songs. In the meantime, he'd decided to show his family who the real talent behind the group was by taking on another group of teenagers and managing and producing them. The Sunrays had a couple of minor hits, like \"I Live for the Sun\":\n\n[Excerpt: The Sunrays, \"I Live for the Sun\"]\n\nBut nothing made the US top forty, and by this point it was clear, though not in the way that Murry hoped, who the real talent behind the group *actually* was.\n\nBut he turned up to the recording session, with his wife in tow, and started trying to produce it:\n\n[Excerpt: Beach Boys and Murry Wilson \"Help Me Rhonda\" sessions]\n\nIt ended up with Brian physically trying to move his drunk father away from the control panel in the studio, and having a heartbreaking conversation with him, where the twenty-two-year-old who is recovering from a nervous breakdown only a few months earlier sounds calmer, healthier, and more mature than his forty-seven-year-old father:\n\n[Excerpt: Beach Boys and Murry Wilson, \"Help Me Rhonda\" sessions]\n\nKnowing that this was the family dynamic helps make the comedy filler track on the next album, \"I'm Bugged at My Old Man\", seem rather less of a joke than it otherwise would:\n\n[Excerpt: The Beach Boys, \"I'm Bugged at My Old Man\"]\n\nBut with Murry out of the way, the group did eventually complete recording \"Help Me Rhonda\" (and for those of you reading this as a blog post rather than listening to the podcast, yes they did spell it two different ways for the two different versions), and it became the group's second number one hit:\n\n[Excerpt: The Beach Boys, \"Help Me, Rhonda\"]\n\nAs well as Murry Wilson, though, another figure was in the control room then -- Loren Daro (who at the time went by his birth surname, but I'm going to refer to him throughout by the name he chose).  You can hear, on the recording, Brian Wilson asking Daro if he could \"turn him on\" -- slang that was at that point not widespread enough for Wilson's parents to understand the meaning.\n\nDaro was an agent working for the William Morris Agency, and he was part of a circle of young, hip, people who were taking drugs, investigating mysticism, and exploring new spiritual ideas. His circle included the Byrds -- Daro, like Roger McGuinn, later became a follower of Subud and changed his name as a result -- as well as people like the songwriter and keyboard player Van Dyke Parks, who will become a big part of this story in subsequent episodes, and Stephen Stills, who will also be turning up again.\n\nDaro had introduced Brian to cannabis, in 1964, and in early 1965 he gave Brian acid for the first time -- one hundred and twenty-five micrograms of pure Owsley LSD-25.\n\nNow, we're going to be looking at acid culture quite a lot in the next few months, as we get through 1966 and 1967, and I'll have a lot more to say about it, but what I will say is that even the biggest proponents of psychedelic drug use tend not to suggest that it is a good idea to give large doses of LSD in an uncontrolled setting to young men recovering from a nervous breakdown. Daro later described Wilson's experience as \"ego death\" -- a topic we will come to in a future episode, and not considered entirely negative -- and \"a beautiful thing\". But he has also talked about how Wilson was so terrified by his hallucinations that he ran into the bedroom, locked the door, and hid his head under a pillow for two hours, which doesn't sound so beautiful to me.\n\nApparently after those two hours, he came out of the bedroom, said \"Well, that's enough of that\", and was back to normal. After that first trip, Wilson wrote a piece of music inspired by his psychedelic experience. A piece which starts like this, with an orchestral introduction very different from anything else the group had released as a single:\n\n[Excerpt: The Beach Boys, \"California Girls\"]\n\nOf course, when Mike Love added the lyrics to the song, it became about far more earthly and sensual concerns:\n\n[Excerpt: The Beach Boys, \"California Girls\"]\n\nBut leaving the lyrics aside for a second, it's interesting to look at \"California Girls\" musically to see what Wilson's idea of psychedelic music -- by which I mean specifically music inspired by the use of psychedelic drugs, since at this point there was no codified genre known as psychedelic music or psychedelia -- actually was.\n\nSo, first, Wilson has said repeatedly that the song was specifically inspired by \"Jesu, Joy of Man's Desiring\" by Bach:\n\n[Excerpt: Bach, \"Jesu, Joy of Man's Desiring\"]\n\nAnd it's odd, because I see no real structural or musical resemblance between the two pieces that I can put my finger on, but at the same time I can totally see what he means. Normally at this point I'd say \"this change here in this song relates to this change there in that song\", but there's not much of that kind of thing here -- but I still. as soon as I read Wilson saying that for the first time, more than twenty years ago, thought \"OK, that makes sense\".\n\nThere are a few similarities, though. Bach's piece is based around triplets, and they made Wilson think of a shuffle beat. If you remember *way* back in the second episode of the podcast, I talked about how one of the standard shuffle beats is to play triplets in four-four time. I'm going to excerpt a bit of recording from a YouTube drum tutorial (which I'll link in the liner notes) showing that kind of shuffle:\n\n[Excerpt: \"3 Sweet Triplet Fills For Halftime Shuffles & Swung Grooves- Drum Lesson\" , from https://www.youtube.com/watch?v=2CwlSaQZLkY ]\n\nNow, while Bach's piece is in waltz time, I hope you can hear how the DA-da-da DA-da-da in Bach's piece may have made Wilson think of that kind of shuffle rhythm.\n\nBach's piece also has a lot of emphasis of the first, fifth, and sixth notes of the scale -- which is fairly common, and not something particularly distinctive about the piece -- and those are the notes that make up the bass riff that Wilson introduces early in the song:\n\n[Excerpt: The Beach Boys, \"California Girls (track)\"]\n\nThat bass riff, of course, is a famous one. Those of you who were listening to the very earliest episodes of the podcast might remember it from the intros to many, many, Ink Spots records:\n\n[Excerpt: The Ink Spots, \"We Three (My Echo, My Shadow, and Me)\"]\n\nBut the association of that bassline to most people's ears would be Western music, particularly the kind of music that was in Western films in the thirties and forties. You hear something similar in \"The Trail of the Lonesome Pine\", as performed by Laurel and Hardy in their 1937 film Way Out West:\n\n[Excerpt: Laurel and Hardy, \"The Trail of the Lonesome Pine\"]\n\nBut it's most associated with the song \"Tumbling Tumbleweeds\", first recorded in 1934 by the Western group Sons of the Pioneers, but more famous in their 1946 rerecording, made after the Ink Spots' success, where the part becomes more prominent:\n\n[Excerpt: The Sons of the Pioneers, \"Tumbling Tumbleweeds\"]\n\nThat song was a standard of the Western genre, and by 1965 had been covered by everyone from Gene Autry to the Supremes, Bob Wills to Johnnie Ray, and it would also end up covered by several musicians in the LA pop music scene over the next few years, including Michael Nesmith and Curt Boettcher, both people part of the same general scene as the Beach Boys.\n\nThe other notable thing about \"California Girls\" is that it's one of the first times that Wilson was able to use multi-tracking to its full effect. The vocal parts were recorded on an eight-track machine, meaning that Wilson could triple-track both Mike Love's lead vocal and the group's backing vocals. With Johnston now in the group -- \"California Girls\" was his first recording session with them -- that meant that on the record there were eighteen voices singing, leading to some truly staggering harmonies:\n\n[Excerpt: The Beach Boys, \"California Girls (Stack-O-Vocals)\"]\n\nSo, that's what the psychedelic experience meant to Brian Wilson, at least -- Bach, orchestral influences, using the recording studio to create thicker vocal harmony parts, and the old West. Keep that in the back of your mind for the present, but it'll be something to remember in eleven episodes' time.\n\n\"California Girls\" was, of course, another massive hit, reaching number three on the charts. And while some Beach Boys fans see the album it was included on, Summer Days... And Summer Nights!, as something of a step backward from the sophistication of Today!, this is a relative thing. It's very much of a part with the music on the earlier album, and has many wonderful moments, with songs like \"Let Him Run Wild\" among the group's very best.\n\nBut it was their next studio album that would cement the group's artistic reputation, and which would regularly be acclaimed by polls of critics as the greatest album of all time -- a somewhat meaningless claim; even more than there is no \"first\" anything in music, there's no \"best\" anything.\n\nThe impulse to make what became Pet Sounds came, as Wilson has always told the story, from hearing the Beatles album Rubber Soul. Now, we've not yet covered Rubber Soul -- we're going to look at that, and at the album that came after it, in three episodes' time -- but it is often regarded as a major artistic leap forward for the Beatles.\n\nThe record Wilson heard, though, wasn't the same record that most people nowadays think of when they think of Rubber Soul. Since the mid-eighties, the CD versions of the Beatles albums have (with one exception, Magical Mystery Tour) followed the tracklistings of the original British albums, as the Beatles and George Martin intended. But in the sixties, Capitol Records were eager to make as much money out of the Beatles as they could. The Beatles' albums generally had fourteen songs on, and often didn't include their singles. Capitol thought that ten or twelve songs per album was plenty, and didn't have any aversion to putting singles on albums. They took the three British albums Help!, Rubber Soul, and Revolver, plus the non-album \"Day Tripper\"/\"We Can Work It Out\" single and Ken Thorne's orchestral score for the Help! film, and turned that into four American albums -- Help!, Rubber Soul, Yesterday and Today, and Revolver.\n\nIn the case of Rubber Soul, that meant that they removed four tracks from the British album -- \"Drive My Car\", \"Nowhere Man\", \"What Goes On\" and \"If I Needed Someone\" -- and added two songs from the British version of Help!, \"I've Just Seen a Face\" and \"It's Only Love\".\n\nNow, I've seen some people claim that this made the American Rubber Soul more of a folk-rock album -- I may even have said that myself in the past -- but that's not really true. Indeed, \"Nowhere Man\" and \"If I Needed Someone\" are two of the Beatles' most overtly folk-rock tracks, and both clearly show the influence of the Byrds. But what it did do was remove several of the more electric songs from the album, and replace them with acoustic ones:\n\n[Excerpt: The Beatles, \"I've Just Seen a Face\"]\n\nThis, completely inadvertently, gave the American Rubber Soul lineup a greater sense of cohesion than the British one. Wilson later said \"I listened to Rubber Soul, and I said, 'How could they possibly make an album where the songs all sound like they come from the same place?'\" At other times he's described his shock at hearing \"a whole album of only good songs\" and similar phrases. Because up to this point, Wilson had always included filler tracks on albums, as pretty much everyone did in the early sixties.\n\nIn the American pop music market, up to the mid sixties, albums were compilations of singles plus whatever random tracks happened to be lying around. And so for example in late 1963 the Beach Boys had released two albums less than a month apart -- Surfer Girl and Little Deuce Coupe. Given that Brian Wilson wrote or co-wrote all the group's original material, it wasn't all that surprising that Little Deuce Coupe had to include four songs that had been released on previous albums, including two that were on Surfer Girl from the previous month. It was the only way the group could keep up with the demand for new product from a company that had no concept of popular music as art.\n\nOther Beach Boys albums had included padding such as generic surf instrumentals, comedy sketches like \"Cassius\" Love vs. \"Sonny\" Wilson, and in the case of The Beach Boys Today!, a track titled \"Bull Session With the Big Daddy\", consisting of two minutes of random chatter with the photographer Earl Leaf while they all ate burgers:\n\n[Excerpt: The Beach Boys and Earl Leaf, \"Bull Session With the Big Daddy\"]\n\nThis is not to attack the Beach Boys. This was a simple response to the commercial pressures of the marketplace. Between October 1962 and November 1965, they released eleven albums. That's about an album every three months, as well as a few non-album singles. And on top of that Brian had also been writing songs during that time for Jan & Dean, the Honeys, the Survivors and others, and had collaborated with Gary Usher and Roger Christian on songs for Muscle Beach Party, one of American International Pictures' series of Beach Party films. It's unsurprising that not everything produced on this industrial scale was a masterpiece.\n\nIndeed, the album the Beach Boys released directly before Pet Sounds could be argued to be an entire filler album. Many biographies say that Beach Boys Party! was recorded to buy Brian time to make Pet Sounds, but the timelines don't really match up on closer investigation. Beach Boys Party! was released in November 1965, before Brian ever heard Rubber Soul, which came out later, and before he started writing the material that became Pet Sounds.\n\nBeach Boys Party! was a solution to a simple problem -- the group were meant to deliver three albums that year, and they didn't have three albums worth of material. Some shows had been recorded for a possible live album, but they'd released a live album in 1964 and hadn't really changed their setlist very much in the interim.\n\nSo instead, they made a live-in-the-studio album, with the conceit that it was recorded at a party the group were holding. Rather than the lush Wrecking Crew instrumentation they'd been using in recent months, everything was played on acoustic guitars, plus some bongos provided by Wrecking Crew drummer Hal Blaine and some harmonica from Billy Hinsche of the boy band Dino, Desi, and Billy, whose sister Carl Wilson was shortly to marry. The album included jokes and false starts, and was overlaid with crowd noise, to give the impression that you were listening to an actual party where a few people were sitting round with guitars and having fun.\n\nThe album consisted of songs that the group liked and could play without rehearsal -- novelty hits from a few years earlier like \"Alley Oop\" and \"Hully Gully\", a few Beatles songs, and old favourites like the Everly Brothers hit \"Devoted to You\" -- in a rather lovely version with two-part harmony by Mike and Brian, which sounds much better in a remixed version released later without the party-noise overdubs:\n\n[Excerpt: The Beach Boys, \"Devoted to You (remix)\"]\n\nBut the song that defined the album, which became a massive hit, and which became an albatross around the band's neck about which some of them would complain for a long time to come, didn't even have one of the Beach Boys singing lead. As we discussed back in the episode on \"Surf City\", by this point Jan and Dean were recording their album \"Folk 'n' Roll\", their attempt at jumping on the folk-rock bandwagon, which included the truly awful \"The Universal Coward\", a right-wing answer song  to \"The Universal Soldier\" released as a Jan Berry solo single:\n\n[Excerpt: Jan Berry, \"The Universal Coward\"]\n\nDean Torrence was by this point getting sick of working with Berry, and was also deeply unimpressed with the album they were making, so he popped out of the studio for a while to go and visit his friends in the Beach Boys, who were recording nearby. He came in during the Party sessions, and everyone was suggesting songs to perform, and asked Dean to suggest something. He remembered an old doo-wop song that Jan and Dean had recorded a cover version of, and suggested that. The group had Dean sing lead, and ran through a sloppy version of it, where none of them could remember the words properly:\n\n[Excerpt: The Beach Boys, \"Barbara Ann\"]\n\nAnd rather incredibly, that became one of the biggest hits the group ever had, making number two on the Billboard chart (and number one on other industry charts like Cashbox), number three in the UK, and becoming a song that the group had to perform at almost every live show they ever did, together or separately, for at least the next fifty-seven years.\n\nBut meanwhile, Brian had been working on other material. He had not yet had his idea for an album made up entirely of good songs, but he had been experimenting in the studio. He'd worked on a handful of tracks which had pointed in new directions. One was a single, \"The Little Girl I Once Knew\":\n\n[Excerpt: The Beach Boys, \"The Little Girl I Once Knew\"]\n\nJohn Lennon gave that record a very favourable review, saying \"This is the greatest! Turn it up, turn it right up. It's GOT to be a hit. It's the greatest record I've heard for weeks. It's fantastic.\"\n\nBut the record only made number twenty -- a perfectly respectable chart placing, but nowhere near as good as the group's recent run of hits -- in part because its stop-start nature meant that the record had \"dead air\" -- moments of silence -- which made DJs avoid playing it, because they believed that dead air, even only a second of it here and there, would make people tune to another station.\n\nAnother track that Brian had been working on was an old folk song suggested by Alan Jardine. Jardine had always been something of a folkie, of the Kingston Trio variety, and he had suggested that the group might record the old song \"The Wreck of the John B\", which the Kingston Trio had recorded. The Trio's version in turn had been inspired by the Weavers' version of the song from 1950:\n\n[Excerpt: The Weavers, \"The Wreck of the John B\"]\n\nBrian had at first not been impressed, but Jardine had fiddled with the chord sequence slightly, adding in a minor chord to make the song slightly more interesting, and Brian had agreed to record the track, though he left the instrumental without vocals for several months:\n\n[Excerpt: The Beach Boys, \"Sloop John B (instrumental)\"]\n\nThe track was eventually finished and released as a single, and unlike \"The Little Girl I Once Knew\" it was a big enough hit that it was included on the next album, though several people have said it doesn't fit. Lyrically, it definitely doesn't, but musically, it's very much of a piece with the other songs on what became Pet Sounds:\n\n[Excerpt: The Beach Boys, \"Sloop John B\"]\n\nBut while Wilson was able to create music by himself, he wasn't confident about his ability as a lyricist. Now, he's not a bad lyricist by any means -- he's written several extremely good lyrics by himself -- but Brian Wilson is not a particularly articulate or verbal person, and he wanted someone who could write lyrics as crafted as his music, but which would express the ideas he was trying to convey. He didn't think he could do it himself, and for whatever reason he didn't want to work with Mike Love, who had co-written the majority of his recent songs, or with any of his other collaborators.\n\nHe did write one song with Terry Sachen, the Beach Boys' road manager at the time, which dealt obliquely with those acid-induced concepts of \"ego death\":\n\n[Excerpt: The Beach Boys, \"Hang on to Your Ego\"]\n\nBut while the group recorded that song, Mike Love objected vociferously to the lyrics. While Love did try cannabis a few times in the late sixties and early seventies, he's always been generally opposed to the use of illegal drugs, and certainly didn't want the group to be making records that promoted their use -- though I would personally argue that \"Hang on to Your Ego\" is at best deeply ambiguous about the prospect of ego death.  Love rewrote some of the lyrics, changing the title to \"I Know There's an Answer\", though as with all such bowdlerisation efforts he inadvertently left in some of the drug references:\n\n[Excerpt: The Beach Boys, \"I Know There's an Answer\"]\n\nBut Wilson wasn't going to rely on Sachen for all the lyrics. Instead he turned to Tony Asher.\n\nAsher was an advertising executive, who Wilson probably met through Loren Daro -- there is some confusion over the timeline of their meeting, with some sources saying they'd first met in 1963 and that Asher had introduced Wilson to Daro, but others saying that the introductions went the other way, and that Daro introduced Asher to Wilson in 1965. But Asher and Daro had been friends for a long time, and so Wilson and Asher were definitely orbiting in the same circles.\n\nThe most common version of the story seems to be that Asher was working in Western Studios, where he was recording a jingle - the advertising agency had him writing jingles because he was an amateur songwriter, and as he later put it nobody else at the agency knew the difference between E flat and A flat. Wilson was also working in the studio complex, and Wilson dragged Asher in to listen to some of the demos he was recording -- at that time Wilson was in the habit of inviting anyone who was around to listen to his works in progress. Asher chatted with him for a while, and thought nothing of it, until he got a phone call at work a few weeks later from Brian Wilson, suggesting the two write together.\n\nWilson was impressed with Asher, who he thought of as very verbal and very intelligent, but Asher was less impressed with Wilson. He has softened his statements in recent decades, but in the early seventies he would describe Wilson as \"a genius musician but an amateur human being\", and sharply criticise his taste in films and literature, and his relationship with his wife.\n\nThis attitude seems at least in part to have been shared by a lot of the people that Wilson was meeting and becoming influenced by. One of the things that is very noticeable about Wilson is that he has no filters at all, and that makes his music some of the most honest music ever recorded. But that same honesty also meant that he could never be cool or hip. He was -- and remains -- enthusiastic about the things he likes, and he likes things that speak to the person he is, not things that fit some idea of what the in crowd like. And the person Brian Wilson is is a man born in 1942, brought up in a middle-class suburban white family in California, and his tastes are the tastes one would expect from that background.\n\nAnd those tastes were not the tastes of the hipsters and scenesters who were starting to become part of his circle at the time. And so there's a thinly-veiled contempt in the way a lot of those people talked about Wilson, particularly in the late sixties and early seventies. Wilson, meanwhile, was desperate for their approval, and trying hard to fit in, but not quite managing it.\n\nAgain, Asher has softened his statements more recently, and I don't want to sound too harsh about Asher -- both men were in their twenties, and still  trying to find their place in the world, and I wouldn't want to hold anyone's opinions from their twenties against them decades later. But that was the dynamic that existed between them. Asher saw himself as something of a sophisticate, and Wilson as something of a hick in contrast, but a hick who unlike him had created a string of massive hit records. And Asher did, always, respect Wilson's musical abilities. And Wilson in turn looked up to Asher, even while remaining the dominant partner, because he respected Asher's verbal facility.\n\nAsher took a two-week sabbatical from his job at the advertising agency, and during those two weeks, he and Wilson collaborated on eight songs that would make up the backbone of the album that would become Pet Sounds.\n\nThe first song the two worked on was a track that had originally been titled \"In My Childhood\". Wilson had already recorded the backing track for this, including the sounds of bicycle horns and bells to evoke the feel of being a child:\n\n[Excerpt: The Beach Boys, \"You Still Believe in Me (instrumental track)\"]\n\nThe two men wrote a new lyric for the song, based around a theme that appears in many of Wilson's songs -- the inadequate man who is loved by a woman who is infinitely superior to him, who doesn't understand why he's loved, but is astonished by it. The song became \"You Still Believe in Me\":\n\n[Excerpt: The Beach Boys, \"You Still Believe in Me\"]\n\nThat song also featured an instrumental contribution of sorts by Asher. Even though the main backing track had been recorded before the two started working together, Wilson came up with an idea for an intro for the song, which would require a particular piano sound. To get that sound, Wilson held down the keys on a piano, while Asher leaned into the piano and plucked the strings manually. The result, with Wilson singing over the top, sounds utterly lovely:\n\n[Excerpt: The Beach Boys, \"You Still Believe in Me\"]\n\nNote that I said that Wilson and Asher came up with new lyrics together. There has been some slight dispute about the way songwriting credits were apportioned to the songs. Generally the credits said that Wilson wrote all the music, while Asher and Wilson wrote the lyrics together, so Asher got twenty-five percent of the songwriting royalties and Wilson seventy-five percent. Asher, though, has said that there are some songs for which he wrote the whole lyric by himself, and that he also made some contributions to the music on some songs -- though he has always said that the majority of the musical contribution was Wilson's, and that most of the time the general theme of the lyric, at least, was suggested by Wilson.\n\nFor the most part, Asher hasn't had a problem with that credit split, but he has often seemed aggrieved -- and to my mind justifiably -- about the song \"Wouldn't it Be Nice\". Asher wrote the whole lyric for the song, though inspired by conversations with Wilson, but accepted his customary fifty percent of the lyrical credit. The result became one of the big hits from the album:\n\n[Excerpt: The Beach Boys, \"Wouldn't It Be Nice?\"]\n\nBut -- at least according to Mike Love, in the studio he added a single line to the song:\n\n[Excerpt: The Beach Boys, \"Wouldn't it Be Nice?\"]\n\nWhen Love sued Brian Wilson in 1994, over the credits to thirty-five songs, he included \"Wouldn't it Be Nice\" in the list because of that contribution. Love now gets a third of the songwriting royalties, taken proportionally from the other two writers. Which means that he gets a third of Wilson's share and a third of Asher's share. So Brian Wilson gets half the money, for writing all the music, Mike Love gets a third of the money, for writing \"Good night baby, sleep tight baby\", and Tony Asher gets a sixth of the money -- half as much as Love -- for writing all the rest of the lyric.\n\nAgain, this is not any one individual doing anything wrong – most of the songs in the lawsuit were ones where Love wrote the entire lyric, or a substantial chunk of it, and because the lawsuit covered a lot of songs the same formula was applied to borderline cases like “Wouldn't it Be Nice” as it was to clearcut ones like “California Girls”, where nobody disputes Love's authorship of the whole lyric. It's just the result of a series of reasonable decisions, each one of which makes sense in isolation, but which has left Asher earning significantly less from one of the most successful songs he ever wrote in his career than he should have earned.\n\nThe songs that Asher co-wrote with Wilson were all very much of a piece, both musically and lyrically. Pet Sounds really works as a whole album better than it does individual tracks, and while some of the claims made about it -- that it's a concept album, for example -- are clearly false, it does have a unity to it, with ideas coming back in different forms. For example, musically, almost every new song on the album contains a key change down a minor third at some point -- not the kind of thing where the listener consciously notices that an idea has been repeated, but definitely the kind of thing that makes a whole album hold together.\n\nIt also differs from earlier Beach Boys albums in that the majority of the lead vocals are by Brian Wilson. Previously, Mike Love had been the dominant voice on Beach Boys records, with Brian as second lead and the other members taking few or none. Now Love only took two main lead vocals, and was the secondary lead on three more. Brian, on the other hand, took six primary lead vocals and two partial leads. The later claims by some people that this was a Brian Wilson solo album in all but name are exaggerations -- the group members did perform on almost all of the tracks -- but it is definitely much more of a personal, individual statement than the earlier albums had been. The epitome of this was \"I Just Wasn't Made For These Times\", which Asher wrote the lyrics for but which was definitely Brian's idea, rather than Asher's.\n\n[Excerpt: The Beach Boys, \"I Just Wasn't Made For These Times\"]\n\nThat track also featured the first use on a Beach Boys record of the electro-theremin, an electronic instrument invented by session musician Paul Tanner, a former trombone player with the Glenn Miller band, who had created it to approximate the sound of a Theremin while being easier to play:\n\n[Excerpt: The Beach Boys, \"I Just Wasn't Made For These Times\"]\n\nThat sound would turn up on future Beach Boys records...\n\nBut the song that became the most lasting result of the Wilson/Asher collaboration was actually one that is nowhere near as personal as many of the other songs on the record, that didn't contain a lot of the musical hallmarks that unify the album, and that didn't have Brian Wilson singing lead. Of all the songs on the album, \"God Only Knows\" is the one that has the most of Tony Asher's fingerprints on it. Asher has spoken in the past about how when he and Wilson were writing, Asher's touchstones were old standards like \"Stella By Starlight\" and \"How Deep is the Ocean?\", and \"God Only Knows\" easily fits into that category. It's a crafted song rather than a deep personal expression, but the kind of craft that one would find in writers like the Gershwins, every note and syllable perfectly chosen:\n\n[Excerpt: The Beach Boys, \"God Only Knows\"]\n\nOne of the things that is often wrongly said about the song is that it's the first pop song to have the word \"God\" in the title. It isn't, and indeed it isn't even the first pop song to be called \"God Only Knows\", as there was a song of that name recorded by the doo-wop group the Capris in 1954:\n\n[Excerpt: The Capris, \"God Only Knows\"]\n\nBut what's definitely true is that Wilson, even though he was interested in creating spiritual music, and was holding prayer sessions with his brother Carl before vocal takes, was reluctant to include the word in the song at first, fearing it would harm radio play. He was probably justified in his fears -- a couple of years earlier he'd produced a record called \"Pray for Surf\" by the Honeys, a girl-group featuring his wife:\n\n[Excerpt: The Honeys, \"Pray For Surf\"]\n\nThat record hadn't been played on the radio, in part because it was considered to be trivialising religion.\n\nBut Asher eventually persuaded Wilson that it would be OK, saying \"What do you think we should do instead? Say 'heck only knows'?\"\n\nAsher's lyric was far more ambiguous than it may seem -- while it's on one level a straightforward love song, Asher has always pointed out that the protagonist never says that he loves the object of the song, just that he'll make her *believe* that he loves her. Coupled with the second verse, which could easily be read as a threat of suicide if the object leaves the singer, it would be very, very, easy to make the song into something that sounds like it was from the point of view of a narcissistic, manipulative, abuser.\n\nThat ambiguity is also there in the music, which never settles in a strong sense of key. The song starts out with an A chord, which you'd expect to lead to the song being in A, but when the horn comes in, you get a D# note, which isn't in that key, and then when the verse starts, it starts on an inversion of a D chord, before giving you enough clues that by the end of the verse you're fairly sure you're in the key of E, but it never really confirms that:\n\n[Excerpt: The Beach Boys, \"God Only Knows (instrumental)\"]\n\nSo this is an unsettling, ambiguous, song in many ways. But that's not how it sounds, nor how Brian at least intended it to sound. So why doesn't it sound that way? In large part it's down to the choice of lead vocalist. If Mike Love had sung this song, it might have sounded almost aggressive. Brian *did* sing it in early attempts at the track, and he doesn't sound quite right either -- his vocal attitude is just... not right:\n\n[Excerpt: The Beach Boys, \"God Only Knows (Brian Wilson vocal)\"]\n\nBut eventually Brian hit on getting his younger brother Carl to sing lead. At this point Carl had sung very few leads on record -- there has been some dispute about who sang what, exactly,  because of the family resemblance which meant all the core band members could sound a little like each other, but it's generally considered that he had sung full leads on two album tracks -- \"Pom Pom Play Girl\" and \"Girl Don't Tell Me\" -- and partial leads on two other tracks, covers of \"Louie Louie\" and \"Summertime Blues\". At this point he wasn't really thought of as anything other than a backing vocalist, but his soft, gentle, performance on \"God Only Knows\" is one of the great performances:\n\n[Excerpt: The Beach Boys, \"God Only Knows (vocals)\"]\n\nThe track was actually one of those that required a great deal of work in the studio to create the form which now seems inevitable. Early attempts at the recording included a quite awful saxophone solo:\n\n[Excerpt: The Beach Boys \"God Only Knows (early version)\"]\n\nAnd there were a lot of problems with the middle until session keyboard player Don Randi suggested the staccato break that would eventually be used:\n\n[Excerpt: The Beach Boys, \"God Only Knows\"]\n\nAnd similarly, the tag of the record was originally intended as a mass of harmony including all the Beach Boys, the Honeys, and Terry Melcher:\n\n[Excerpt: The Beach Boys, \"God Only Knows (alternate version with a capella tag)\"]\n\nBefore Brian decided to strip it right back, and to have only three voices on the tag -- himself on the top and the bottom, and Bruce Johnston singing in the middle:\n\n[Excerpt: The Beach Boys, \"God Only Knows\"]\n\nWhen Pet Sounds came out, it was less successful in the US than hoped -- it became the first of the group's albums not to go gold on its release, and it only made number ten on the album charts. By any objective standards, this is still a success, but it was less successful than the record label had hoped, and was taken as a worrying sign.\n\nIn the UK, though, it was a different matter. Up to this point, the Beach Boys had not had much commercial success in the UK, but recently Andrew Loog Oldham had become a fan, and had become the UK publisher of their original songs, and was interested in giving them the same kind of promotion that he'd given Phil Spector's records. Keith Moon of the Who was also a massive fan, and the Beach Boys had recently taken on Derek Taylor, with his strong British connections, as their publicist. Not only that, but Bruce Johnston's old friend Kim Fowley was now based in London and making waves there.\n\nSo in May, in advance of a planned UK tour set for November that year, Bruce Johnston and Derek Taylor flew over to the UK to press the flesh and schmooze. Of all the group members, Johnston was the perfect choice to do this -- he's by far the most polished of them in terms of social interaction, and he was also the one who, other than Brian, had the least ambiguous feelings about the group's new direction, being wholeheartedly in favour of it.\n\nJohnston and Taylor met up with Keith Moon, Lennon and McCartney, and other pop luminaries, and played them the record. McCartney in particular was so impressed by Pet Sounds and especially \"God Only Knows\", that he wrote this, inspired by the song, and recorded it even before Pet Sounds' UK release at the end of June:\n\n[Excerpt: The Beatles, \"Here, There, and Everywhere\"]\n\nAs a result of Johnston and Taylor's efforts, and the promotional work by Oldham and others, Pet Sounds reached number two on the UK album charts, and \"God Only Knows\" made number two on the singles charts. (In the US, it was the B-side to \"Wouldn't it Be Nice\", although it made the top forty on its own merits too). The Beach Boys displaced the Beatles in the readers' choice polls for best band in the NME in 1966, largely as a result of the album, and Melody Maker voted it joint best album of the year along with the Beatles' Revolver.\n\nThe Beach Boys' commercial fortunes were slightly on the wane in the US, but they were becoming bigger than ever in the UK. But a big part of this was creating expectations around Brian Wilson in particular. Derek Taylor had picked up on a phrase that had been bandied around -- enough that Murry Wilson had used it to mock Brian in the awful \"Help Me, Rhonda\" sessions -- and was promoting it widely as a truism. Everyone was now agreed that Brian Wilson was a genius. And we'll see how that expectation plays out over the next few weeks..\n\n[Excerpt: The Beach Boys, \"Caroline, No\"]",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and forty-two of A History of Rock Music in Five Hundred Songs looks at “God Only Knows\" by the Beach Boys, and the creation of the Pet Sounds album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sunny\" by Bobby Hebb.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I’ve checked for specific things.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher.  His books can be found at https://payhip.com/CMusicBooks\n\nAndrew Doe’s Bellagio 10452 site is an invaluable resource.\n\nJon Stebbins’ The Beach Boys FAQ is a good balance between accuracy and readability.\n\nAnd Philip Lambert’s Inside the Music of Brian Wilson is an excellent, though sadly out of print, musicological analysis of Wilson’s music from 1962 through 67.\n\nI have also referred to Brian Wilson's autobiography, I Am Brian Wilson, and to Mike Love's, Good Vibrations: My Life as a Beach Boy.\n\nFor material specific to Pet Sounds I have used Kingsley Abbot's The Beach Boys' Pet Sounds: The Greatest Album of the Twentieth Century and Charles L Granata's I Just Wasn't Made For These Times: Brian Wilson and the Making of Pet Sounds. \n\nI also used the 126-page book The Making of Pet Sounds by David Leaf, which came as part of the The Pet Sounds Sessions box set, which also included the many alternate versions of songs from the album used here. Sadly both that box set and the 2016 updated reissue of it appear currently to be out of print, but either is well worth obtaining for anyone who is interested in how great records are made.\n\nOf the versions of Pet Sounds that are still in print, this double-CD version is the one I'd recommend. It has the original mono mix of the album, the more recent stereo remix, the instrumental backing tracks, and live versions of several songs.\n\nAs a good starting point for the Beach Boys’ music in general, I would recommend this budget-priced three-CD set, which has a surprisingly good selection of their material on it.\n\nThe YouTube drum tutorial I excerpted a few seconds of to show a shuffle beat is here.\n\nTranscript\n\nWe're still in the run of episodes that deal with the LA pop music scene -- though next week we're going to move away from LA, while still dealing with a lot of the people who would play a part in that scene. But today we're hitting something that requires a bit of explanation.\n\nMost artists covered in this podcast get one or at the most two episodes. Some get slightly more -- the major artists who are present for many revolutions in music, or who have particularly important careers, like Fats Domino or the Supremes. And then there are a few very major artists who get a lot more. The Beatles, for example, are going to get eight in total, plus there will be episodes on some of their solo careers. Elvis has had six, and will get one more wrap-up episode.\n\nThis is the third Beach Boys episode, and there are going to be three more after this, because the Beach Boys were one of the most important acts of the decade.\n\nBut normally, I limit major acts to one episode per calendar year of their career. This means that they will average at most one episode every ten episodes, so while for examp",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and forty-two of A History of Rock Music in Five Hundred Songs looks at “God Only Knows\" by the Beach Boys, and the creation of the Pet Sounds album. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Sunny\" by Bobby Hebb.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It’s difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But th",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}