{
  "id": "yt:video:LsqCA50d7BM",
  "yt:videoId": "LsqCA50d7BM",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "Why is it so hard to cure the common cold?",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-10-20T15:01:34+00:00",
  "updated": "2022-11-04T19:55:08+00:00",
  "media:group": {
    "media:title": "Why is it so hard to cure the common cold?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Dig into the two main ways we fight the viruses that cause the common cold, and find out if it’s possible to create a cure. \n\n--\n\nOn average, adults catch more than 150 colds throughout their lives. Even with similar symptoms, the cause could be different each time. Common colds are caused by at least 8 different families of virus, each of which can have its own subtypes. How can so many different viruses cause the same illness? And is a cure even possible? Explore the two main strategies we employ to fight viruses.\n\nDirected by Anton Bogaty.\n\nThis video made possible in collaboration with Gates Ventures\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/why-is-it-so-hard-to-cure-the-common-cold\nDig deeper with additional resources: https://ed.ted.com/lessons/why-is-it-so-hard-to-cure-the-common-cold#digdeeper\n\nAnimator's website: https://antonbogaty.com\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Jose Arcadio Valdes Franco, Sebastiaan Vleugels, Karl Laius, JY Kang, Abhishek Goel, Heidi Stolt, Nicole Sund, Karlee Finch, Mario Mejia, Denise A Pitts, Doug Henry, Keven Webb, Mihai Sandu, Deepak Iyer, Javid Gozalov, Kyanta Yap, Rebecca Reineke, William Biersdorf, Patricia Alves Panagides, Yvette Mocete, Cyrus Garay, Samuel Barbas, LadyGeek, Marin Kovachev, Penelope Misquitta, Hans Peng, Gaurav Mathur, Erik Biemans, Tony, Michelle, Katie and Josh Pedretti, Hoai Nam Tran, Kack-Kyun Kim, Michael Braun-Boghos, zjweele13, Anna-Pitschna Kunz, Edla Paniguel, Thomas Mungavan, Jaron Blackburn, Venkat Venkatakrishnan, ReuniteKorea, Aaron Henson, Rohan Gupta, Begum Tutuncu, Brian Richards, Jørgen Østerpart, Tyron Jung, Carsten Tobehn, Katie Dean, Ezgi Yersu, Gerald Onyango and alessandra tasso.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}