{
  "title": "Special Episode: Engineering the Apocalypse",
  "pubDate": "Sat, 24 Apr 2021 00:35:07 +0000",
  "guid": "51808346-f523-4008-b7bd-85267f1f164f",
  "link": "https://wakingup.libsyn.com/special-episode-engineering-the-apocalypse",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">In this nearly</span> <strong>4-hour SPECIAL EPISODE</strong><span style= \"font-weight: 400;\">, Rob Reid delivers a 100-minute monologue (broken up into 4 segments, and interleaved with discussions with Sam) about the looming</span> <strong>danger of a man-made pandemic</strong><span style=\"font-weight: 400;\">, caused by an artificially-modified pathogen. The risk of this occurring is far higher and nearer-term than almost anyone realizes. </span></p> <p><span style=\"font-weight: 400;\">Rob explains the science and motivations that could produce such a catastrophe and explores the steps that society</span> <strong>must start taking today to prevent it</strong><span style=\"font-weight: 400;\">. These measures are concrete, affordable, and scientifically fascinating—and almost all of them are applicable to future,</span> <strong>natural pandemics as well</strong><span style=\"font-weight: 400;\">. So if we take most of them, the odds of a future Covid-like outbreak would plummet—a priceless collateral benefit. </span></p> <p>SUBSCRIBE to gain access to all full-length episodes at <a href= \"http://samharris.org/subscribe\">samharris.org/subscribe</a>.</p>",
  "content:encoded": "<p>In this nearly 4-hour SPECIAL EPISODE, Rob Reid delivers a 100-minute monologue (broken up into 4 segments, and interleaved with discussions with Sam) about the looming danger of a man-made pandemic, caused by an artificially-modified pathogen. The risk of this occurring is far higher and nearer-term than almost anyone realizes. </p> <p>Rob explains the science and motivations that could produce such a catastrophe and explores the steps that society must start taking today to prevent it. These measures are concrete, affordable, and scientifically fascinating—and almost all of them are applicable to future, natural pandemics as well. So if we take most of them, the odds of a future Covid-like outbreak would plummet—a priceless collateral benefit. </p> <p>SUBSCRIBE to gain access to all full-length episodes at <a href= \"http://samharris.org/subscribe\">samharris.org/subscribe</a>.</p>",
  "enclosure": "",
  "itunes:duration": "03:41:22",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "By Rob Reid and Sam Harris",
  "itunes:episodeType": "full"
}