{
  "title": "How We Celebrate Engineers",
  "link": "https://spectrum.ieee.org/how-we-celebrate-engineers",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-collage-of-5-people-on-a-blue-background.png?id=31356180&width=2068&height=1798&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p><em>The Institute</em> has appeared, off and on, in the pages of <em>IEEE</em> <em>Spectrum </em>since debuting as a four-page insert in the December 1976 issue. At various times during the ensuing decades, <em>The Institute</em>—or, as we call it in <em>Spectrum</em>’s offices, “<em>TI</em>”—has been published as a stand-alone monthly and then quarterly broadsheet. It even had its own website for a few years, before being integrated into <em>Spectrum</em>’s site in 2019 and appearing in the print magazine as a section on a quarterly basis. </p><p>While <em>Spectrum</em> dives deep into emerging technologies and delivers expert voices from the bleeding edge, <em>The Institute</em> has focused on IEEE members, featuring their stories, celebrating their accomplishments, and telling them about IEEE products, services, elections, and volunteer opportunities. <em>The Institute</em> also brings members all the news relevant to the functioning of the association, such as the reconfiguration of its geographic regions to ensure there is equitable representation across its global membership. </p><hr/><p><em>The Institute</em> staff—Editor in Chief Kathy Pretz and Assistant Editor Joanna Goodrich—say they are most excited about showcasing the diversity of IEEE’s membership and highlighting those who have made IEEE their professional home. Pretz says there’s a misconception that most of IEEE’s members work in academia. That’s why <em>The Institute</em> has put more emphasis on profiling the careers of those working in industry, such as <a href=\"https://spectrum.ieee.org/tsmc-exec-on-chip-shortage\" target=\"_self\">Taiwan Semiconductor Manufacturing Co.’s senior vice president of R&D, Yuh-Jier Mii</a>. </p><p>“I’m always amazed how accessible top leaders at high-tech companies are when I tell them I would like to interview them for an article in IEEE’s member publication,” Pretz remarked recently. “And all of them are so humble about their accomplishments. TSMC’s Yuh-Jier Mii was no different.”</p><p>Pretz and Goodrich also write about the careers of young professionals who are the future of the organization. In this month’s issue, they <a href=\"https://spectrum.ieee.org/legacy-of-eddie-custovic\" target=\"_self\">spotlight Eddie Custovic</a>, the recipient of the IEEE Theodore W. Hissey Outstanding Young Professionals Award. </p><p class=\"pull-quote\">“It’s very rewarding to be able to interview members who have developed technology that I use every day.”</p><p><strong></strong>In addition to putting a spotlight on the accomplishments of individual engineers,<em> The Institute </em>also covers the history of technology. “It’s very rewarding to be able to interview members who have developed technology that I use every day, as well as members who are developing the next breakthrough tech that will impact society,” Goodrich says. “For example, Steven Sasson invented the <a href=\"https://spectrum.ieee.org/first-digital-camera-history\" target=\"_self\">first digital camera</a>, which we use every day in some shape or form. Eddie Custovic, on the other hand, is working to develop an AI platform that will help solve food shortages that have been predicted for 2050.”</p><p>Indeed, IEEE members have for decades been turning their ideas into successful businesses. That’s why <em>TI</em> features entrepreneurial members who have launched their own ventures, like IEEE Fellow <a href=\"https://spectrum.ieee.org/ai-to-increase-ivf-success\" target=\"_self\">Alex Bronstein of Embryonics</a>. And, of course, <em>TI</em> celebrates major anniversaries and milestones, like the 25th anniversary of <a href=\"https://spectrum.ieee.org/ieee-wie-25-year-anniversary\" target=\"_self\">IEEE Women in Engineering</a>.</p><p>In future issues, readers can look forward to a profile of computer pioneer IEEE Fellow <a href=\"https://spectrum.ieee.org/erol-gelenbe-profile\" target=\"_blank\">Erol Gelenbe</a>, whose invention of the packet-voice telephone switch made Zoom possible. In December, look for a piece on IEEE executive director Stephen Welby, who is leaving the organization at the end of the year. Kathy, Joanna, and I invite you to celebrate these engineers and their extraordinary accomplishments with us in the coming months. </p>",
  "pubDate": "Thu, 01 Sep 2022 16:17:34 +0000",
  "guid": "https://spectrum.ieee.org/how-we-celebrate-engineers",
  "category": [
    "The institute",
    "Engineers",
    "Engineering careers",
    "Tech history",
    "Type:ti"
  ],
  "dc:creator": "Harry Goldstein",
  "media:content": ""
}