{
  "title": "The Edition: Christmas Special",
  "link": "https://audioboom.com/posts/7998471",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5360,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Welcome to the special Christmas episode of The Edition! </div>\n<div><br>\n</div>\n<div>In this episode, we look at five major topics that dominated the news this year and the pages of <em>The Spectator</em>. </div>\n<div><br>\n</div>\n<div>First up a review of the year in politics with our resident Coffee House Shot's team James Forsyth, Katy Balls and Isabel Hardman. We discuss how Boris seemed to make such a strong start to the year through the vaccine rollout, but squandered this goodwill with several own goals. We also touch on some of the big political moments of the year: Partygate, the Owen Paterson affair and of course Matt Hancock. (00:39)</div>\n<div><br>\n</div>\n<div>Next, we go global and look at three of the major powerhouses that took headlines this year. The EU, who ends the year in a panic over Russia, extreme Covid measures, and upcoming elections. The US started with an insurrection and ended with President Biden's plummeting poll numbers. Finally, China, who if you ask them say they are doing just fine. Lara Prendergast is joined by Jonathan Miller, Douglas Murray, and Cindy Yu to discuss the state of the world. (22:34)</div>\n<div><br>\n</div>\n<div>Then, a subject we all hoped to be leaving in the rearview mirror. Covid. With so much misinformation out there, the one important thing to have is good data, which is why we built <em>The Spectator</em>’s Covid data hub, and William Moore is joined on the podcast by three people who spend an ungodly amount of time going through those figures. <em>The Spectator</em> editor Fraser Nelson, Michael Simmons (who puts the data hub together and is making his podcast debut), and our economics editor Kate Andrews. (40:52)</div>\n<div><br>\n</div>\n<div>We chose our penultimate segment by looking back at all the most read articles of the year and chose the subject that appeared the most. The Royal Family won by a landslide, and it has been a big year for them. To break down the year’s big Royal moments and try and figure out why we are so obsessed with this family, Lara Prendergast and William Moore sat down with Freddy Gray and Patrick Jephson. (59:37)</div>\n<div><br>\n</div>\n<div>And finally, The Edition's producer has given William Moore an early Christmas present. The Church of England is one of his favourite things to talk about, because of how important he thinks it is for our society, but also because of the many issues he has with how it is run. Will gets stuck into it with four amazing priests – Marcus Walker, Daniel French, Nicholas Cranfield, and Steve Morris – who see out the year by telling us their favourite Christmas carols. (01:13:04)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast & Will Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator</em> magazine this Christmas and get the next 12 issues – in print and online – for just £12. Not only that but you’ll also receive a bottle of Taittinger champagne, worth £42, to see you through to the new year. Join the party today at <a href=\"http://www.spectator.co.uk/celebrate\">www.spectator.co.uk/celebrate</a>\n</div>\n",
  "pubDate": "Thu, 16 Dec 2021 18:59:30 +0000",
  "guid": "tag:audioboom.com,2021-12-16:/posts/7998471",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}