{
  "title": "S15 Ep53: The Black Monk of Pontefract with Richard Estep",
  "link": "https://audioboom.com/posts/8098470",
  "itunes:episode": 53,
  "itunes:title": "The Black Monk of Pontefract with Richard Estep",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4743,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio have a terrifying brush with The Black Monk of Pontefract with guest Richard Estep<br>\n<br>\nThis is an incredible case of a dark manifestation, items vanishing and mysterious items appearing, plus chilling encounters with an otherworldly force that seems to defy all explanation and continues today!<br>\n<br>\nGet the book here--> <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio have a terrifying brush with The Black Monk of Pontefract with guest Richard Estep\n\nThis is an incredible case of a dark manifestation, items vanishing and mysterious items appearing, plus chilling encounters with an otherworldly...",
  "pubDate": "Sun, 28 Jun 2020 08:00:00 +0000",
  "guid": "dc248f81-4391-4dcf-925f-fb943d3985ca",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}