{
  "title": "Did This Mans Dead Father Come Back From The Dead? 🧟‍♀️🧟‍♂️🧟",
  "link": "https://audioboom.com/posts/8162073",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2087,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Today on another chilling episode of Real Ghost Stories Online that many believe could be the cure for dry and itchy skin. But be forewarned, listening to this episode could cause Nausea, dizziness, drowsiness, dry mouth, loss of appetite, increased appetite, increased sweating, sweating blood, sweating a goo-like substance that resembles semen, diarrhea, burning of the nipples when watching re-runs of golden girls, upset stomach, an undeniable and uncontrollable sexual lust for domesticated cats, bleeding from the eyes, ear lobe and rectal cavity, or trouble sleeping may occur. If any of these effects last or get worse, tell your doctor immediately. <br>\n<br>\nWhen a son returns to his home after a late night at work, did he encounter the spirit of his later father, seemingly going about his daily routine? <br>\n<br>\nWas the spirit of this father truly present, or was it some sort of echo from the past, playing over and over again?<br>\n<br>\nWe ask that question today, On Real Ghost Stories Online.<br>\n<br>\n<strong>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!</strong><br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nFollow Tony:<br>\nInstagram: <a href=\"http://http//www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a>\n</div>\n",
  "pubDate": "Tue, 18 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-22:/posts/8162073",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}