{
  "author": {
    "name": "Richard Crump, Charles Smith, and Peter Van Tassel"
  },
  "title": "Short-Dated Term Premia and the Level of Inflation",
  "link": "",
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=18216",
  "updated": "2022-09-27T14:33:19Z",
  "published": "2022-09-28T11:00:00Z",
  "category": [
    "",
    "",
    ""
  ],
  "summary": "Since the advent of derivatives trading on short-term interest rates in the 1980s, financial commentators have often interpreted market prices as directly reflecting the expected path of future interest rates. However, market prices generally embed risk premia (or “term premia” in reference to measures of risk premia over different horizons) reflecting the compensation required to bear the risk of the asset. When term premia are large in magnitude, derivatives prices may differ substantially from investor expectations of future rates. In this post, we assess whether term premia have increased with the recent rise in inflation, given the historically positive relationship between the two series, and what this means for the interpretation of derivatives prices.  ",
  "content": "<p class=\"ts-blog-article-author\">Richard Crump, Charles Smith, and Peter Van Tassel</p>\n\n\n\n<figure class=\"lse-featured-image\">\n\t<img width=\"460\" height=\"288\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_460.jpg?w=460\" class=\"cover-image asset-image img-responsive wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_460.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_460.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_460.jpg?resize=768,481 768w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></figure>\n\n\n\n<p>Since the advent of derivatives trading on short-term interest rates in the 1980s, financial commentators have often interpreted market prices as directly reflecting the expected path of future interest rates. However, market prices generally embed risk premia (or “term premia” in reference to measures of risk premia over different horizons) reflecting the compensation required to bear the risk of the asset. When term premia are large in magnitude, derivatives prices may differ substantially from investor expectations of future rates. In this post, we assess whether term premia have increased with the recent rise in inflation, given the historically positive relationship between the two series, and what this means for the interpretation of derivatives prices.  </p>\n\n\n\n<h4 class=\"is-style-default\">Estimating Term Premia</h4>\n\n\n\n<p>A common way to measure term premia is to use a dynamic term-structure model (DTSM) that prices bonds and matches the time-series dynamics of yields. Using a term-structure model, the term premium may be estimated as the difference between the fitted yield of a zero-coupon bond and the model’s forecast for the average short-term risk-free rate over a horizon equal to the bond’s maturity. Defined in this way, the term premium has the interpretation of an expected return measure for an investor who purchases a longer-dated bond that is financed at the short-term risk-free rate.</p>\n\n\n\n<p>The chart below plots the yield and term premium for a two-year zero-coupon bond in the <a href=\"https://www.newyorkfed.org/research/staff_reports/sr340.html\">Adrian-Crump-Moench</a> (ACM) term-structure model from January 1962 to June 2022. The chart shows that the historical term premium estimates were at their peak during the high inflation period of the late 1970s and early 1980s; estimates of the term premium were as high as 1 to 2 percent at this time but have, in general, experienced a downward secular trend over the subsequent forty years.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Term Premiums Were High when Interest Rates and Inflation Were High</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch1.png?w=460\" alt=\"Line chart plotting the three-month moving average of the two-year fitted yield against the two-year term premium from the Adrian-Crump-Moench (ACM) five-factor model using monthly data from January 1962 to June 2022. The chart shows that the historical term premium estimates were at their peak during the high inflation period of the late 1970s and early 1980s; estimates of the term premium were as high as 1 to 2 percent at this time but have, in general, experienced a downward secular trend over the subsequent 40 years. \" class=\"wp-image-18296\" width=\"462\" height=\"233\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch1.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch1.png?resize=460,233 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch1.png?resize=768,388 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch1.png?resize=1536,776 1536w\" sizes=\"(max-width: 462px) 100vw, 462px\" /><figcaption>Sources: Federal Reserve Bank of New York; Federal Reserve Board of Governors; authors’ calculations.<br>Note: This chart plots a three-month moving average of the two-year fitted yield against the two-year term premium from the Adrian-Crump-Moench (ACM) five-factor model using monthly data from January 1962 to June 2022.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>The term premia estimates based on the ACM term-structure model have several attractive features including being available over a long sample period that dates to the 1960s. At the same time, term premia estimates from any DTSM are ultimately model specific. To complement the DTSM approach, we also estimate short-dated term premia using survey-based measures of expected interest rates and the market-implied path of short-term interest rates from derivatives. This approach does not rely on a specific forecasting model or bond pricing model. Instead, the term premia estimate is obtained as the market-implied path less the survey-expected path.</p>\n\n\n\n<p>To illustrate how the survey-based estimates work, we consider an example from June 2022. The market-implied path of the federal (fed) funds rate is derived from fed funds futures contracts and overnight index swaps (OIS) on June 23, 2022. Survey expectations for the corresponding horizons are obtained from the Blue Chip Financial Forecasts (BCFF) survey at the end of June 2022 by computing the average forecast across participants over the forecast horizon. The market data are lagged by one week to approximate the information that forecasters may have had when submitting their forecasts prior to month-end. The survey-based term premia measure is the difference between the market-implied yield and the survey expectation.</p>\n\n\n\n<p>As shown in the chart and table below, the survey expectations are above the market-implied yields on June 23, 2022, indicating that the survey-based term premia estimates are negative and equal to -17 basis points (bps) for a six-month horizon and -12 bps for a twelve-month horizon based on the OIS-implied rates. The term premia estimate using fed funds futures data over a six-month horizon is similarly negative at -14 bps.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Short-Dated, Survey-Based Term Premia in June 2022 Were Small</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch2-1.png?w=369\" alt=\"Scatter chart showing the market-implied path of the fed funds rate from futures contracts and overnight index swaps versus survey forecasts from the Blue Chip Financial Forecasts on June 23, 2022. The chart reports the zero-coupon rates at the observed maturities and the interpolated rates which closely align. The survey forecast is the average forecast across participants, which is then averaged across horizons to match the three-, six-, twelve-, and eighteen-month interpolated rates.\" class=\"wp-image-18299\" width=\"463\" height=\"360\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch2-1.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch2-1.png?resize=460,359 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch2-1.png?resize=768,599 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch2-1.png?resize=369,288 369w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch2-1.png?resize=1536,1198 1536w\" sizes=\"(max-width: 463px) 100vw, 463px\" /><figcaption>Source: Authors’ calculations.<br>Notes: This chart plots the market-implied path of the fed funds rate from futures contracts (FF) and overnight index swaps (OIS) versus survey forecasts from the Blue Chip Financial Forecasts (BCFF) Survey. To derive the market-implied path, we bootstrap zero-coupon rates from raw OIS quotes and futures settlement prices from Bloomberg L.P. and then linearly interpolate to a fixed maturity grid. The chart reports the zero-coupon rates at the observed maturities and the interpolated rates which closely align. The survey forecast is the average forecast across participants which is then averaged across horizons to match the three-, six-, twelve-, and eighteen-month interpolated rates.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h4 class=\"is-style-subtitle\">Survey-Based Term Premium Estimates for June 2022</h4>\n\n\n\n<figure class=\"wp-block-table is-style-regular has-frozen-first-column\"><table><thead><tr><th>Horizon (months)</th><th>3</th><th>6</th><th>12</th><th>18</th></tr></thead><tbody><tr><td>Implied rate from Overnight Index Swaps (OIS)</td><td>2.07</td><td>2.58</td><td>3.01</td><td>3.02</td></tr><tr><td>Implied rate from federal funds futures (FF)</td><td>2.09</td><td>2.61</td><td></td><td></td></tr><tr><td>Survey forecast average</td><td>2.40</td><td>2.75</td><td>3.13</td><td>3.23</td></tr><tr><td>OIS term premium</td><td>-0.33</td><td>-0.17</td><td>-0.12</td><td>-0.21</td></tr><tr><td>FF term premium</td><td>-0.31</td><td>-0.14</td><td></td><td></td></tr></tbody></table><figcaption>Source: Authors’ calculations.<br>Notes: The table reports implied rates and survey forecasts matching the chart above at the interpolated maturities. The implied zero-coupon rates are from June 23, 2022. The survey forecasts are from the June Blue Chip Financial Forecasts. The survey-based term premium is the difference between the implied rate and the survey forecast.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h4><strong>Short-Dated Term Premia Estimates and the Level of Inflation</strong></h4>\n\n\n\n<p>We can apply the same approach as above to generate a long time series of survey-based term premia using the BCFF survey. The BCFF survey has forecasts available going back to 1982 for the fed funds rate and from 1987 to 2021 for the three-month Libor (London interbank offered rate). Combining these measures with the market-implied paths of interest rates for the three-month Libor from eurodollar futures and for the fed funds rate from fed funds futures and OIS, we expand on the ACM term-structure estimates to report survey-based term premia measures dating back to the 1980s.</p>\n\n\n\n<p>The chart below illustrates the results. Each term premia measure is reported going as far back as possible subject to data availability. The eurodollar measure for the three-month Libor term premium stops in 2021 after which the BCFF switches to forecasting the secured overnight funding rate (SOFR) rather than Libor. Despite the differences in methodologies and data sources, the short-dated term premia measures follow a broad trend. During the 1980s and 1990s when inflation was generally higher, short-dated term premia were also higher. Since the early 2000s, the level of inflation and short-dated term premia have generally been low and relatively stable.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Term Premia Were Higher in the 1980s and Early 1990s</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch3.png?w=397\" alt=\"This chart reports the one-year term premium estimate from the Adrian-Crump-Moench (ACM) model alongside survey-based estimates using eurodollar futures, fed funds futures, and overnight index swaps (OIS). \" class=\"wp-image-18300\" width=\"460\" height=\"335\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch3.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch3.png?resize=460,334 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch3.png?resize=768,558 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch3.png?resize=397,288 397w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch3.png?resize=1536,1115 1536w\" sizes=\"(max-width: 460px) 100vw, 460px\" /><figcaption>Source: Authors’ calculations.<br>Notes: This chart reports the one-year term premium estimate from the Adrian-Crump-Moench (ACM) model alongside survey-based estimates using eurodollar futures, fed funds futures, and overnight index swaps (OIS). The ACM estimates are from the Federal Reserve Bank of New York. The survey-based estimates use market data that are lagged by one week to approximate the information that forecasters may have had when submitting their forecasts prior to month-end. The sample periods for the survey term premia measures are based on data availability. We use Blue Chip Financial Forecasts (BCFF) survey forecasts which are available from October 1982 for the fed funds rate and from December 1987 to December 2021 for the three-month Libor. Bloomberg L.P. data are employed for fed funds futures and OIS. For eurodollar futures, we use historical CME Group data from the start of the sample to March 2017 and then use Bloomberg data. When three-month Libor forecasts are unavailable in the early part of the sample, we backfill using the fed funds forecasts based on a projection that is estimated during the latter period when both series are available. The chart reports a three-month moving average of the monthly term premia estimates.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Zooming in on the more recent period, the chart below reports term premia estimates over different horizons using the ACM term-structure model and survey forecasts of fed funds futures and OIS data. The survey-based measures have remained close to zero since the onset of the Covid-19 crisis but have begun to decline in recent months, similar to the decrease going into the last rate hiking cycle that started at the end of 2015. Although the one-year and two-year ACM term premia have turned positive, they remain at low levels.&nbsp;</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Various Measures of Short-Dated Term Premia Have Remained Low</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch4.png?w=460\" alt=\"\" class=\"wp-image-18301\" width=\"464\" height=\"284\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch4.png 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch4.png?resize=460,282 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch4.png?resize=768,471 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_term-premia_crump_ch4.png?resize=1536,942 1536w\" sizes=\"(max-width: 464px) 100vw, 464px\" /><figcaption>Source:  Authors’ calculations.<br>Notes: This chart reports a three-month moving average of the monthly term premia estimates since 2010 using the Adrian-Crump-Moench (ACM) term-structure model and using survey forecasts with fed funds futures (FF) and overnight index swaps (OIS) data over different horizons. The data are from the Federal Reserve Bank of New York, Bloomberg L.P., and the Blue Chip Financial Forecasts Survey.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-default\">To conclude, we have shown that historical estimates of term premia have tended to be high when inflation was also high. Given the recent rise in inflation, one might expect a commensurate rise in term premia. We find, however, that various measures of short-dated term premia have remained relatively small in magnitude, implying that current market prices do approximately reflect investors’ expectations for monetary policy over the near term.</p>\n\n\n\n<p>&nbsp;</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/crump_richard.jpg\" alt=\"Photo: Portrait of Richard K. Crump\" class=\"wp-image-16628 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/crump_richard.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/crump_richard.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a href=\"https://www.newyorkfed.org/research/economists/crump\">Richard K. Crump</a> is a financial research advisor in Macrofinance Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-bio-contact\">Charles Smith is a former senior research analyst in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/vantassel_peter.jpg?w=90\" alt=\"Photo: portrait of Peter Van Tassel\" class=\"wp-image-16712 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/vantassel_peter.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/vantassel_peter.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a href=\"https://www.newyorkfed.org/research/economists/vantassel\" target=\"_blank\" rel=\"noreferrer noopener\">Peter Van Tassel</a> is a financial research economist in Capital Markets Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.&nbsp;</p>\n</div></div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://www.newyorkfed.org/research/staff_reports/sr340.html\">Pricing the Term Structure with Linear Regressions</a><br><a href=\"https://www.newyorkfed.org/research/data_indicators/term-premia-tabs#/interactive\">Treasury Term Premia</a></p>\n\n\n\n<div style=\"height:18px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n"
}