{
  "title": "S1E37 - Learning to Run Free with World Champion Chanelle Price",
  "guid": "https://pinecast.com/guid/a99cac6a-5b51-4a30-b435-6328b52f1d5f",
  "pubDate": "Tue, 16 Mar 2021 06:30:00 -0000",
  "itunes:duration": "00:47:47",
  "description": "<p>World Champion runner, Chanelle Price, joins Laura today to share her remarkable story and the lessons she has learned through it all. A supremely talented elite athlete, Chanelle’s many achievements include competing at the 2007 USA Outdoor Championships at the age of 16, running the second fastest 800m of all time by a high school female which qualified her for the Olympic Trials when she was 17, and becoming the 2014 World IAAF Indoor Champion – the first American woman to ever win 800m gold at an indoor or outdoor world championship. Along with these great successes, Chanelle has experienced some devastating low points in her career, and she courageously discusses them all here today.\n \nShe begins by sharing how she came to find her way into track, her early successes, her struggles with insecurity, and the dark days of her time at college. Chanelle then provides a highly personal account of the factors that led her to contemplate suicide, and how beginning her journey with Christianity pulled her through that tragic time. She also discusses the many challenges she still had to face throughout this journey, the difference between her Olympic Trials experiences, and training for Tokyo during COVID. She draws the conversation to a close by highlighting the importance of maintaining a healthy relationship with sport, surrounding yourself with the right supportive people, her current definition of success, and the crucial role her ‘why’ plays in keeping her motivated and moving forward. Chanelle holds nothing back as she recounts the shining mountain peaks and dark, dark valleys she has encountered in her fascinating journey, and how these have helped her to become the woman she is today - an individual overflowing with faith, strength, character, and commitment, who undoubtedly ‘brings a smile to God’s face’.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>How Chanelle found her way into track</li>\n<li>Her early success</li>\n<li>Chanelle’s struggles with insecurity</li>\n<li>Her college experience</li>\n<li>Seeking a sponsorship deal</li>\n<li>Chanelle’s contemplation of suicide</li>\n<li>Her journey with Christianity</li>\n<li>Drifting away from and returning to God</li>\n<li>The many challenges Chanelle has worked through</li>\n<li>Moving to train in Eugene, Oregon</li>\n<li>Training for Tokyo during COVID</li>\n<li>Chanelle’s Olympic Trials experiences</li>\n<li>The importance of maintaining a healthy relationship with sport and surrounding yourself with supportive people</li>\n<li>Her current definition of success</li>\n<li>Chanelle’s ‘why’</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“I just didn’t really find track fun. It felt more like punishment.”</li>\n<li>“Once I started that singular focus on track once I got to high school, you know, it really paid off.”</li>\n<li>“It was definitely the success that got me to like it.”</li>\n<li>“That is where my sense of identity came from was my achievement on the track.”</li>\n<li>“I don’t know who I am if I’m not Chanelle Price the track star.”</li>\n<li>“It was like a 100 pound weight on my shoulders every time I went to race.”</li>\n<li>“Behind closed doors, I was really, really, really struggling.”</li>\n<li>“Chase after Me like you chase after track.”</li>\n<li>“Your worth is not based off of how you perform out there on the track.”</li>\n<li>“To whom much is given, much is required.”</li>\n<li>“I was just a completely different person on the track.”</li>\n<li>“You know, God, I’m going to come back to You.”</li>\n<li>“The past 4 years have been the hardest years of my life…He answered, but it just wasn’t really what I expected.”</li>\n<li>“I miss being that desperate for Him.”</li>\n<li>“It was a very humbling experience.”</li>\n<li>“God, I don’t know what You’re doing, but I’m about to break here…I don’t know if I can take this.”</li>\n<li>“Every other month I said I was going to quit.”</li>\n<li>“Maybe He’s telling me it’s time to move on.”</li>\n<li>“I knew that this extra year was definitely a blessing in disguise for me.”</li>\n<li>“Honestly, I considered retirement after that.”</li>\n<li>“The woman that you have become through this journey is worth it.”</li>\n<li>“I’m not thinking about anything else besides using my gift, and for me that’s when things seem to fall into place.”</li>\n<li>“Some pressure is good, don’t get me wrong, but it shouldn’t get you to the point of suicide like it has for me in the past…that is not a healthy relationship with sport.”</li>\n<li>“This is what you do. It’s not who you are.”</li>\n<li>“The person that we become along the way - I think that’s what brings a smile to God’s face.”</li>\n<li>“The sole thing that kept me going was my ‘why’.”</li>\n<li>“Don’t sacrifice the gift.”</li>\n<li>“There is always hope beyond what is happening in front us right now.”</li>\n</ul>\n<p>Links:</p>\n<p><a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\nLaura’s Social Media:\nInstagram:   <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\nFacebook:   <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \nConnect with Chanelle:\n \n<a href=\"https://www.instagram.com/cpricerun/?hl=en\" rel=\"nofollow\">Chanelle's Instagram</a>\n<a href=\"https://twitter.com/cpricerun7?lang=en\" rel=\"nofollow\">Chanelle's Twitter</a>\n<a href=\"https://www.facebook.com/chanelle.price.3\" rel=\"nofollow\">Chanelle's Facebook</a></p>",
  "itunes:title": "Learning to Run Free with World Champion Chanelle Price",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 37
}