{
  "title": "25 years in Singapore: This industry veteran discusses innovation",
  "link": "https://e27.co/25-years-in-singapore-this-industry-veteran-discusses-innovation-20221027/",
  "dc:creator": "Alfie",
  "pubDate": "Thu, 27 Oct 2022 06:00:17 +0000",
  "category": [
    "Events",
    "Singapore",
    "Sponsored",
    "Bill Padfield",
    "innovation",
    "IPI",
    "SWITCH",
    "SWITCH 2022"
  ],
  "guid": "https://e27.co/?p=475180",
  "description": "<p>Bill Padfield is an Innovation Advisor with IPI Singapore’s Innovation Advisors Programme, which is tailored to help enterprises quicken their learning curve in tech and innovation to drive business growth. Bill has been involved in the tech and business development space for the past 30 years, with expertise in tech innovation, M&A, venture investments and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/25-years-in-singapore-this-industry-veteran-discusses-innovation-20221027/\">25 years in Singapore: This industry veteran discusses innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"size-full wp-image-475181 aligncenter\" src=\"https://e27.co/wp-content/uploads/2022/10/pexels-thisisengineering-3861938.jpg\" alt=\"Innovation\" width=\"690\" height=\"390\" />\n<p><i><span style=\"font-weight: 400;\">Bill Padfield is an Innovation Advisor with IPI Singapore’s Innovation Advisors Programme, which is tailored to help enterprises quicken their learning curve in tech and innovation to drive business growth. Bill has been involved in the tech and business development space for the past 30 years, with expertise in tech innovation, M&A, venture investments and digital transformation. He was formerly the global Senior Executive Vice President of Transformation and Platform Services at NTT Ltd, and global Chief Operating Officer of Dimension Data, among others.</span></i></p>\n<p><i><span style=\"font-weight: 400;\">This is what Bill Padfield has to say about the innovation landscape in Singapore.</span></i></p>\n<h1><b>Twenty-five years of steady progress</b></h1>\n<p><span style=\"font-weight: 400;\">In the past 25 years in Singapore, I have seen a steady progress in technology companies from those that simply resell Silicon Valley products, to those that incrementally innovate those products through software or services, and now to pure innovation. Companies in Southeast Asia and, in particular, Singapore are truly creating new technologies that rival those of the Valley.</span></p>\n<p><span style=\"font-weight: 400;\">Companies such as Flexxon with their X-PHY products for cyber security and, in particular, the prevention of ransomware attacks, Transcelestial with their next-generation laser communications offers, and KoolLogix heat removal solutions for data centres. All of these offers will rival those from the West and yet are innovated right here in Singapore.</span></p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/investments-in-startups-grew-by-more-than-45-per-annum-in-2021-20221027/\">Investments in startups grew by more than 45% per annum in 2021</a></b></p>\n<p><span style=\"font-weight: 400;\">The tools of innovation have also evolved fast. The majority of innovation is focused on cloud-based software, particularly open software, microservices, and APIs. The speed at which developers can now bring together a cloud resident application calling on microservices (application sub-components) that have been developed by others anywhere in the world that can access various data sources through open RESTful APIs is staggering.</span></p>\n<p><span style=\"font-weight: 400;\">This development has enabled DevOps and DevSecOps to emerge, enabling the same team developing the apps to operate the services virtually simultaneously. It further enables the team to launch new services in the morning and, via such techniques as A/B testing, bring down or enhance the feature hours later based on real-time user feedback.</span></p>\n<h2><b>The global disparity between Southeast Asia and North America</b></h2>\n<p><span style=\"font-weight: 400;\">Innovation in North America and Europe appears to focus more on X as a service (XaaS where X can be SaaS, PaaS, or other offers as a service) rather than point product development. The key difference is the seismic shift in the tech industry from capex deals to opex deals. Many of the most influential companies in the Valley provide subscription-based offers consumed at a price per user per month. It is a transition that companies here in Singapore are beginning to understand and adopt and why they are innovating.</span></p>\n<p><span style=\"font-weight: 400;\">A cloud-based offering can go to market fast with a low cost of acquisition by the client as it can be consumed directly from the cloud without a long and expensive sales cycle. This is also magic to the ears of VC funds as this can provide hyper-fast growth in portfolio companies and higher valuation to the founders due to the annuity income model. Subscription-based offers are also a stepping stone to consumption-based models that meter the user and only charge when the service is used, in the same way as your mobile phone.</span></p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/journey-to-the-top-from-developer-to-ceo-20221025/\">Journey to the top: From developer to CEO</a></b></p>\n<p><span style=\"font-weight: 400;\">Part of the work I have been doing for the past twelve months has been helping local tech companies understand this seismic shift in how tech is consumed and delivered. Through IPI’s Innovation Advisors Programme, my work with KoolLogix has been focused on bringing their exciting data centre heat removal technology to the market in a way that can impact greenfield and brownfield data centres using not only the traditional CAPEX models but new XaaS opportunities. There was a similar focus in the discussions with Flexxon for their cyber security offerings to bring them to market not simply as a product but also as a service.</span></p>\n<p><span style=\"font-weight: 400;\">Similar work is also underway with several other Singapore-based tech companies to enable them to adjust to the new innovative ways IT is purchased and consumed.</span></p>\n<p><span style=\"font-weight: 400;\">Universities are pumping out graduates who use these tools and see them as normal, whereas to some of us industry veterans, it is still seen as some form of magic! The role of education here is to ensure that their graduates no longer think outside the box but have a view that there is no longer any box at all. This level and speed of innovation will continue to accelerate, limited only by the imagination.</span></p>\n<h2><b>Exciting time for venture capitalists</b></h2>\n<p><span style=\"font-weight: 400;\">Of course, innovation teams have to keep both eyes on the ability to monetise their innovation. Otherwise, as exciting as their ideas and developments may be, they may also be short-lived.</span></p>\n<p><span style=\"font-weight: 400;\">Linking to money, the Venture Capital world in Singapore is also exciting. I currently act as an advisor to a couple of VC funds and, as a result, see numerous pitch decks daily. This is critical to developing and monetising your ideas but forces the founders to talk commercially or risk failing to impress a fund. This is where advisors with expertise in financials can help too. I am currently working on a number of companies&#8217; pitch decks helping them to tell their story in the way that analysts and GPs will want to see and at what stage, seed, Series A, Series B etc. It’s also important to have experts look over the tech company&#8217;s existing financials, as adjustments may be needed before any level of VC fund due diligence can be done.</span></p>\n<p><span style=\"font-weight: 400;\">So, the magic of innovation happens when people, ideas, and money converge. If you have only one or two of the requirements, you will most likely fall short. This is where governments can help, and the government of Singapore does help.</span></p>\n<p><b>Also read: <a rel=\"follow\" href=\"https://e27.co/how-can-we-create-new-urgency-for-a-green-recovery-20221025/\">How can we create new urgency for a green recovery?</a></b></p>\n<p><span style=\"font-weight: 400;\">Good universities that are producing talent in the right areas, an open environment that allows young companies to hire the talent they need from anywhere on the planet, and grants that encourage these new teams to push harder and faster in areas that align with the government’s strategy. The speed at which a NewCo can be set up in Singapore is also impressive. I would, however, advocate more help in training these new tech companies in the world of fundraising, as currently, there are significant gaps of knowledge in several startup teams on how to go about this effectively. Again, an area where advisors can and do help.</span></p>\n<p><span style=\"font-weight: 400;\">Due to COVID-19, travel restrictions over the past few years have forced me to dig deeper into the tech companies in Singapore, which has been incredibly rewarding. It is exciting to see so many companies collaborating worldwide and creating genuinely new offers to the market.</span></p>\n<p><span style=\"font-weight: 400;\">I was very privileged to lead a company in Singapore that we grew to a US$ billion business (and beyond!), and I’m convinced there will be more provided we keep the people, ideas and money flowing.</span></p>\n<h2><b>SWITCH 2022</b></h2>\n<p>Participated by more than 9,000 startups, entrepreneurs, investors, MNCs, and public sector leaders, the recently concluded Singapore Week of Innovation and TeCHnology (SWITCH) 2022 featured four days of thought leadership and market access sessions that brought together leading members of the global business and tech innovation community. The seventh edition of its flagship event enabled ecosystem players to discuss emerging trends and opportunities in Health and Biomedical Sciences, Trade & Connectivity, Frontier Technologies and many other areas, as well as ways in which the community can innovate and collaborate to generate positive global impact. The event also featured more than 350 speakers and over 300 exhibitors from the global research, investor and startup communities.</p>\n<p>SWITCH 2022 also featured seven regional tech partner events that spanned themes like innovation in sustainability and urban development, retail technology and digital trust, among others.</p>\n<p>&#8220;The SWITCH 2022 flagship event was a catalyst to drive deeper collaboration among the innovation and startup ecosystems in Singapore and across the world. I am heartened to see all our partners come together to build up our community – including through increasing access to talent, innovation infrastructure and financing opportunities,&#8221; shared Ms Cindy Ngiam, Director for SWITCH, EnterpriseSG.</p>\n<p>The SWITCH flagship event will return with exciting innovation and technology content and activities centred on emergent tech trends from 31 October to 3 November 2023 in Singapore.</p>\n<p>—</p>\n<p><em>Contributed blog by Bill Padfield, IPI Innovation Advisor</em></p>\n<p>&#8211; &#8211;</p>\n<p>Photo by <a rel=\"follow\" href=\"https://www.pexels.com/photo/female-engineer-designing-equipment-3861938/\">ThisIsEngineering</a> via <a rel=\"follow\" href=\"https://www.pexels.com/\">Pexels</a></p>\n<p>&#8211; &#8211;</p>\n<p>This article is produced by the <b>e27</b> team, sponsored by SWITCH</p>\n<p>We can share your story at <b>e27</b>, too. Engage the Southeast Asian tech ecosystem by bringing your story to the world. Visit us at <a rel=\"follow\" href=\"https://e27.co/advertise?utm_source=e27&utm_medium=boilerplate&utm_campaign=lead_gen\">e27.co/advertise</a> to get started.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/25-years-in-singapore-this-industry-veteran-discusses-innovation-20221027/\">25 years in Singapore: This industry veteran discusses innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}