{
  "title": "Only Survivor | RGSO Classic",
  "link": "https://audioboom.com/posts/8120721",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1912,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Did a sole survivor of a tragic accident receive a message from those who perished?<br>\nHere is a preview of the story.<br>\n“I have not listened in a while but use to faithfully and just recently picked back up on episodes, to catch up on what all I have missed. So back in December 2020 I had a friend that I have not talked to in a while pass away. She was in a bad car wreck. There was four women in the car and a baby. ALL the women died. The 2-year-old was the only survivor. (Miracle) fast forward 19 days from the accident. One evening my boyfriend was at work. It was like 630pm, and I was cleaning around the house. I had already taken my afternoon nap, so I was not tired by any means. I had my stereo basting and was in a groove. I also have dinner going. Suddenly, I feel so tired like something zapped every bit of energy I had and felt as if I needed to lay down. So, I go into my bedroom turn my music down and sit on the edge of my bed. I am grabbed my phone and next thing I know I'm asleep. I am asleep now. I open my eyes in my sleep and I am in a field of grass that’s tall like to my knees tall.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 07 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-14:/posts/8120721",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}