{
  "title": "Data Science Bootcamps - What They Can and Can't Do",
  "link": "",
  "published": "2020-10-30T00:00:00-04:00",
  "updated": "2020-10-30T00:00:00-04:00",
  "author": {
    "name": "Tommy Blanchard"
  },
  "id": "tag:tommyblanchard.com,2020-10-30:/data-science-bootcamps-what-they-can-and-cant-do",
  "summary": "<p>It's pretty common that I get asked if a data science bootcamp (or a part-time Master's program, which for the most part I put in the same category) is worth it. Just to get my credentials out of the way as I weigh in: I have taught for a couple …</p>",
  "content": "<p>It's pretty common that I get asked if a data science bootcamp (or a part-time Master's program, which for the most part I put in the same category) is worth it. Just to get my credentials out of the way as I weigh in: I have taught for a couple of Master's programs and an online bootcamp, as well as having gone through a bootcamp myself when I was making the transition into data science.</p>\n<p>I've <a href=\"http://tommyblanchard.com/should-i-do-a-data-science-bootcamp\">written some thoughts on bootcamps in the past</a>. The trouble is, it's a hard question to give a single general answer for. Everyone has different skills and different goals. However, I think one thing is pretty constant: bootcamps tend to overpromise to those without a highly technical background. If you're not already most of the way there, a bootcamp won't make you a data scientist.</p>\n<h2>Different starting points</h2>\n<p>Let me give a few thoughts on bootcamps for people at different stages in their data science learning:</p>\n<p><strong>Starting from scratch</strong>: Let me be blunt. If you have little to no experience with programming, data, or statistics, a 6 month part-time program isn't going to make you a data scientist. You might learn some cool skills, and if you put in the work you might land an entry-level data analyst position. Data science positions are generally considered pretty senior, or at least highly skilled. A short program simply isn't enough time to gain the levels of competency expected in the foundational skills.</p>\n<p><strong>Academic backgrounds</strong>: I think those coming from a quantitative academic background are some of the best candidates for bootcamps (full disclosure, this was my background). Most quantitative academics have passable coding skills, know statistics, and have experience working with and telling stories about data. Bootcamps give a taste of the breadth of tools out there, some practice using some of the popular tools in data science, and some coding practice. Generally, people with this kind of background are the ones I see most reliably go on to actually get data science positions following a bootcamp. As an added bonus, there are programs like Data Incubator and Insight that are free for promising candidates coming from academic backgrounds. That said, many make the transition without needing a bootcamp, so while I think they can be useful, it might be worth getting a sense for your prospects on the job market without one first.</p>\n<p><strong>Software engineering background</strong>: Honestly, I don't see many software engineers taking bootcamps. I think that makes sense - for the most part, if you're already working in tech, you know the space and the transition isn't as big as those coming from academia. You probably have the skills to learn from all of the great free online resources. There is a huge need for data scientists who have serious coding skills, and often people going this route end up with the title \"machine learning engineer\". That said, for a software engineer looking to get some background in data science and want more of a structured curriculum, I think a bootcamp could be a good way of doing it, since they will provide the statistics and machine learning background that they probably lack, but it's definitely not a necessity.</p>\n<p><strong>Data analysts</strong>: Bootcamps can certainly \"level up\" your data skills. Depending on where your skills are now, that could be a great way of trying to either work your way into a more senior data analyst position, or try to make the jump to data scientist. But it depends a lot on what your current role entails - if you haven't used Python at all, and mostly just use Tableau, a bootcamp is going to introduce you to things and are unlikely to be enough to get you to make the leap to data scientist. It also might not be useful for your current role if there's no opportunities for using machine learning. If you see places for using data science skills in your current role and the only thing holding you back is lack of your own skills, a part-time bootcamp can be super useful.</p>\n<p>Boot camps and other part time programs are great for introducing you to the wide range of data science tools out there. They are not enough on their own to make you an expert, and they are not transformative. If you're just curious about data science, there are a ton of online resources for learning. If you want to do something more directed and don't have serious financial constraints, a bootcamp can be a reasonable option. Just don't go in expecting that a bootcamp will take you from 0 to 6-figure data scientist in a few months.</p>",
  "category": [
    "",
    "",
    "",
    ""
  ]
}