{
  "guid": "urn:uuid:1a509fc1-5346-4296-a733-00b3a8d07f54",
  "link": "https://www.who.int/news/item/07-03-2022-joint-statement-on-the-prioritization-of-monitoring-sars-cov-2-infection-in-wildlife-and-preventing-the-formation-of-animal-reservoirs",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Joint statement on the prioritization of monitoring SARS-CoV-2 infection in wildlife and preventing the formation of animal reservoirs",
  "description": "<p><span style=\"background-color:transparent;font-size:16px;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">As we enter the third year of the pandemic, SARS-CoV-2, the virus that causes COVID-19, is spreading between people at an intense&nbsp;</span>\n <a href=\"https://covid19.who.int/\" style=\"font-size:16px;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;\">level</a><span style=\"background-color:transparent;font-size:16px;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">&nbsp;globally.&nbsp; There are many factors that are driving transmission. One of these is the emergence of highly transmissible variants of concern, the latest being Omicron.&nbsp; The virus continues to evolve and the risk of future emergence of variants is high.</span><br /></p><p>Although the COVID-19 pandemic is driven by human-to-human transmission, the SARS-CoV-2 virus is also known to infect animal species. Current knowledge indicates that wildlife does not play a significant role in the spread of SARS-CoV-2 in humans,\n        but spread in animal populations can affect the health of these populations and may facilitate the emergence of new virus variants. </p><p>In addition to domestic animals, free-ranging, captive or farmed wild animals such as big cats, minks, ferrets, North American white-tailed deer and great apes have thus far been observed to be infected with SARS-CoV-2. To date, <a href=\"https://eur01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.oie.int%2Fapp%2Fuploads%2F2021%2F03%2Fglews-risk-assessment-fur-animals-sars-cov-2.pdf&amp;data=04%7C01%7Cm.marrana%40oie.int%7C483076c0e28d4398939f08d9fc543c88%7Cf1faf563b06d4c35873934ccc280dcaf%7C0%7C0%7C637818261017375566%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000&amp;sdata=sgBKKExc%2BWGqYDnUOXPz7Jn5iL0HfneaEJFZTHkU0aA%3D&amp;reserved=0\">farmed mink</a> and pet hamsters have been shown to be capable of infecting humans with the SARS-CoV-2 virus and a potential case of transmission between white-tailed deer and a human is currently under review. </p><p>The introduction of SARS-CoV-2 to wildlife could result in the establishment of animal reservoirs. For example, it has been reported that, approximately one-third of wild white-tailed deer in the United States of America have been infected with SARS-CoV-2,\n        initially via several human-to-deer transmission events. The SARS-CoV-2 lineages detected in white-tailed deer have also been circulating in close-by human populations. White-tailed deer have been shown to shed virus and transmit it between each\n        other.</p><p>FAO, OIE and WHO call on all countries to take steps to reduce the risk of SARS-CoV-2 transmission between humans and wildlife with the aim of reducing the risk of variant emergence and for protecting both humans and wildlife. We urge authorities\n        to adopt relevant regulations and disseminate previously released recommendations by FAO, OIE and WHO to (1) people working in close contact with or handling wildlife, including hunters and butchers; and (2) the public.</p>Personnel working closely\n    with wildlife should be trained to implement measures that reduce the risk of transmission between people and between people and animals, using&nbsp;<a style=\"text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;\" href=\"https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public\">WHO advice</a>&nbsp;<span style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">on how to protect oneself and prevent the spread of COVID-19, and </span>\n <a href=\"https://www.oie.int/app/uploads/2021/03/a-whsg-and-oie-covid-19-guidelines.pdf\" style=\"text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;\">OIE</a><span style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\"> and </span><a href=\"https://www.fao.org/3/cb2549en/CB2549EN.pdf\" style=\"text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;\">FAO</a>\n <span style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\"> guidelines on the use of personal protective equipment (PPE) and good hygiene practices around animals, including </span><a href=\"https://www.fao.org/fao-who-codexalimentarius/sh-proxy/ru/?lnk=1&amp;url=https%253A%252F%252Fworkspace.fao.org%252Fsites%252Fcodex%252FStandards%252FCXC%2B58-2005%252FCXP_058e.pdf\" style=\"text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;\">good hygiene practices for hunters and butchers</a><span style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">.</span>\n <p>Current evidence suggests that humans are not infected with the SARS-CoV-2 virus by eating meat. However, hunters should not track animals that appear sick or harvest those that are found dead. Appropriate butchering and food preparing techniques,\n                including proper hygiene practices, can limit transmission of coronaviruses, including SARS-CoV-2, and other zoonotic pathogens. </p><p>FAO, OIE and WHO stress that the public should be educated about contact with wildlife. Some wild animals may come close to human settlements and residential areas. As a general precaution, people should not approach or feed wild animals or\n                touch or eat those that are orphaned, sick or found dead (including road kills). Instead, they should contact local wildlife authorities or a wildlife health professional.</p><p>It is also crucial to safely dispose of uneaten food, masks, tissues, and any other human waste to avoid attracting wildlife, especially to urban areas and, if possible, keep domestic animals away from wildlife and their droppings. </p><p>We furthermore encourage countries&rsquo; national animal and human health services to adopt the following measures:</p><ul><li>Encourage collaboration between national veterinary services and national wildlife authorities, whose partnership is key to promoting animal health and safeguarding human and environmental health.</li><li>Promote monitoring of wildlife and encourage sampling of wild animals known to be potentially susceptible to SARS-CoV-2.</li><li>Share all genetic sequence data from animal surveillance studies through publicly available databases. </li><li>Report confirmed animal cases of SARS-CoV-2 to the OIE through the World Animal Health Information System (OIE-WAHIS).</li><li>Craft messages about SARS-CoV-2 in animals with care so that inaccurate public perceptions do not negatively impact conservation efforts. No animal found to be infected with SARS-CoV-2 should be abandoned, rejected, or killed without providing\n                    justification from a country- or event-specific risk assessment.</li></ul><p>OIE and WHO also recommend countries to suspend the sale of captured live wild mammals in food markets as an <a href=\"https://cdn.who.int/media/docs/default-source/food-safety/ig--121-1-food-safety-and-covid-19-guidance-for-traditional-food-markets-2021-04-12-en.pdf?sfvrsn=921ec66d_1&amp;download=true\">emergency measure</a>.&nbsp; </p><p>Our organizations emphasize the importance of <a href=\"https://www.oie.int/app/uploads/2022/02/en-sars-cov-2-surveillance.pdf\">monitoring mammalian wildlife populations for SARS-CoV-2 infection</a>, reporting results\n                to National Veterinary Services (who report these findings to the OIE) and sharing genomic sequencing data on publicly available databases. Countries should also adopt precautions to reduce the risk of establishment of animal reservoirs\n                and potential acceleration of virus evolution in novel hosts, which could lead to the emergence of new SARS-CoV-2 variants. Such measures will preserve the health of precious wildlife as well as humans.</p><p>We invite governments and other stakeholders to bring the contents of this joint statement to the attention of competent authorities and all parties concerned.</p><p><em>Note: This statement was originally published on 7 March 2022. An update was made on 21 March 2022. <br /></em></p><p>&nbsp;</p><p>&nbsp;</p>",
  "pubDate": "Mon, 07 Mar 2022 09:22:59 Z"
}