{
  "title": "Reasons for servers to support IPv6",
  "link": "",
  "updated": "2022-01-29T07:44:38+00:00",
  "id": "https://jvns.ca/blog/2022/01/29/reasons-for-servers-to-support-ipv6/",
  "content": "\n\n<p>I&rsquo;ve been having a hard time understanding IPv6. On one hand, the basics initially seem pretty\nstraightforward (there aren&rsquo;t enough IPv4 addresses for all the devices on the\ninternet, so people invented IPv6! There are enough IPv6 addresses for\neveryone!)</p>\n\n<p>But when I try to actually understand it, I run into a lot of questions. One\nquestion is: <code>twitter.com</code> does not support IPv6. Presumably it can&rsquo;t be causing\nthem THAT many issues to not support it. So why <em>do</em> websites support IPv6?</p>\n\n<p>I asked people on Twitter <a href=\"https://twitter.com/b0rk/status/1487156306884636672\">why their servers support IPv6</a>\nand I got a lot of great answers, which I&rsquo;ll summarize here. These all come\nwith the disclaimer that I have basically 0 experience with IPv6 so I can&rsquo;t evaluate these reasons very well.</p>\n\n<p>First though, I want to explain why it&rsquo;s possible for <code>twitter.com</code> to not\nsupport IPv6 because I didn&rsquo;t understand that initially.</p>\n\n<h3 id=\"how-can-you-tell-twitter-com-doesn-t-support-ipv6\">how can you tell <code>twitter.com</code> doesn&rsquo;t support IPv6?</h3>\n\n<p>You can tell they don&rsquo;t support IPv6 is because if you look up their AAAA\nrecord (which contains their IPv6 address), there isn&rsquo;t one. Some other big\nsites like <code>github.com</code> and <code>stripe.com</code> also don&rsquo;t support IPv6.</p>\n\n<pre><code>$ dig AAAA twitter.com\n(empty response)\n$ dig AAAA github.com\n(empty response)\n$ dig AAAA stripe.com\n(empty response)\n</code></pre>\n\n<h3 id=\"why-does-twitter-com-still-work-for-ipv6-users\">why does <code>twitter.com</code> still work for IPv6 users?</h3>\n\n<p>I found this really confusing, because I&rsquo;ve always heard that lots of internet\nusers are forced to use IPv6 because we&rsquo;ve run out of IPv4 addresses. But if\nthat&rsquo;s true, how could twitter.com continue to work for those people without\nIPv6 support? Here&rsquo;s what I learned from the Twitter thread yesterday.</p>\n\n<p>There are two kinds of internet service providers (ISPs):</p>\n\n<ol>\n<li>ISPs who own enough IPv4 address for all of their customers</li>\n<li>ISPs who don&rsquo;t</li>\n</ol>\n\n<p>My ISP is in category 1 &ndash; my computer gets its own IPv4 address, and actually\nmy ISP doesn&rsquo;t even support IPv6 at all.</p>\n\n<p>But lots of ISPs (especially outside of North America) are in category 2: they\ndon&rsquo;t have enough IPv4 addresses for all their customers. Those ISPs handle the problem by:</p>\n\n<ul>\n<li>giving all of their customers a unique IPv6 address, so they can access IPv6 sites directly</li>\n<li>making large groups of their customers <em>share</em> IPv4 addresses. This can either be with CGNAT (&rdquo;<a href=\"https://en.wikipedia.org/wiki/Carrier-grade_NAT\">carrier-grade NAT</a>&rdquo;) or &ldquo;464XLAT&rdquo; or maybe something else.</li>\n</ul>\n\n<p>All ISPs need <em>some</em> IPv4 addresses, otherwise it would be impossible for their\ncustomers to access IPv4-only sites like twitter.com.</p>\n\n<h3 id=\"what-are-the-reasons-to-support-ipv6\">what are the reasons to support IPv6?</h3>\n\n<p>Now we&rsquo;ve explained why it&rsquo;s possible to <em>not</em> support IPv6. So why support it?\nThere were a lot of reasons.</p>\n\n<h3 id=\"reason-cgnat-is-a-bottleneck\">reason: CGNAT is a bottleneck</h3>\n\n<p>The argument that was most compelling to me was: CGNAT (carrier-grade NAT) is a\nbottleneck and it causes performance issues, and it&rsquo;s going to continue to get\nworse over time as access to IPv4 addresses becomes more and more restricted.</p>\n\n<p>Someone also mentioned that because CGNAT is a bottleneck, it&rsquo;s an attractive\nDDoS target because you can ruin lots of people&rsquo;s internet experience just by\nattacking 1 server.</p>\n\n<p>Servers supporting IPv6 reduces the need for CGNAT (IPv6 users can just connect\ndirectly!) which makes the internet work better for everyone.</p>\n\n<p>I thought this argument was interesting because it&rsquo;s a &ldquo;public commons&rdquo; /\ncommunity argument &ndash; it&rsquo;s less that supporting IPv6 will make your site\nspecifically work better, and more that if <em>almost everyone</em> supports IPv6 then\nit&rsquo;ll make the experience of the internet better for everyone, especially in\ncountries where people don&rsquo;t have easy access to IPv4 addresses.</p>\n\n<p>I don&rsquo;t actually know how much of an issue this is in practice.</p>\n\n<p>There were lots of more selfish arguments to use IPv6 too though, so let&rsquo;s get\ninto those.</p>\n\n<h3 id=\"reason-so-ipv6-only-servers-can-access-your-site\">reason: so IPv6-only servers can access your site</h3>\n\n<p>I said before that most IPv6 users still have access to IPv4 through some kind\nof NAT. But apparently that&rsquo;s not true for everyone &ndash; some people mentioned\nthat they run some servers which only have IPv6 addresses and which aren&rsquo;t\nbehind any kind of NAT. So those servers are actually totally unable to access\nIPv4-only sites.</p>\n\n<p>I imagine that those servers aren&rsquo;t connecting to arbitrary machines that much\n&ndash; maybe they only need to connect to a few hosts with IPv6 support.</p>\n\n<p>But it makes sense to me that a machine should be able to access my site even\nif it doesn&rsquo;t have an IPv4 address.</p>\n\n<h3 id=\"reason-better-performance\">reason: better performance</h3>\n\n<p>For users who are using both IPv4 and IPv6 (with a dedicated IPv6 address and a\nshared IPv4 address), apparently IPv6 is often faster because it doesn&rsquo;t need\nto go through an extra translation layer.</p>\n\n<p>So supporting IPv6 can make the site faster for users sometimes.</p>\n\n<p>In practice clients use an algorithm called &ldquo;Happy Eyeballs&rdquo; which tries to\nfigure out whether IPv4 or IPv6 will be faster and then uses whichever seems\nfaster.</p>\n\n<p>Some other performance benefits people mentioned:</p>\n\n<ul>\n<li>maybe sometimes using IPv6 can get you a SEO boost because of the better performance.</li>\n<li>maybe using IPv6 causes you to go through better (faster) network hardware because it&rsquo;s a newer protocol</li>\n</ul>\n\n<h3 id=\"reason-resilience-against-ipv4-internet-outages\">reason: resilience against IPv4 internet outages</h3>\n\n<p>One person said that they&rsquo;ve run into issues where there was an internet outage\nthat only affected IPv4 traffic, because of accidental BGP poisoining.</p>\n\n<p>So supporting IPv6 means that their site can still stay partially online during\nthose outages.</p>\n\n<h3 id=\"reason-to-avoid-nat-issues-with-home-servers\">reason: to avoid NAT issues with home servers</h3>\n\n<p>A few people mentioned that it&rsquo;s much easier to use IPv6 with home servers &ndash;\ninstead of having to do port forwarding through your router, you can just give\nevery server a unique IPv6 address and then access it directly.</p>\n\n<p>Of course, for this to work the client needs to have IPv6 support, but more and\nmore clients these days have IPv6 support too.</p>\n\n<h3 id=\"reason-to-learn-about-ipv6\">reason: to learn about IPv6</h3>\n\n<p>One person said they work in security and in security it&rsquo;s very important to\nunderstand how internet protocols work (attackers are using internet\nprotocols!). So running an IPv6 server helps them learn how it works.</p>\n\n<h3 id=\"reason-to-push-ipv6-forward-ipv4-is-legacy\">reason: to push IPv6 forward / IPv4 is &ldquo;legacy&rdquo;</h3>\n\n<p>A couple of people said that they support IPv6 because it&rsquo;s the current\nstandard, and so they want to contribute to the success of IPv6 by supporting\nit.</p>\n\n<p>A lot of people also said that they support IPv6 because they think sites that only\nsupport IPv4 are &ldquo;behind&rdquo; or &ldquo;legacy&rdquo;.</p>\n\n<h3 id=\"reason-it-s-easy\">reason: it&rsquo;s easy</h3>\n\n<p>I got a bunch of answers along the lines of &ldquo;it&rsquo;s easy, why not&rdquo;. Obviously\nadding IPv6 support is not easy in all situations, but a couple of reasons it\nmight be easy in some cases:</p>\n\n<ul>\n<li>you automatically got an IPv6 address from your hosting company, so all you need to do is add an <code>AAAA</code> record pointing to that address</li>\n<li>your site is behind a CDN that supports IPv6, so you don&rsquo;t need to do anything extra</li>\n</ul>\n\n<h3 id=\"reason-safer-networking-experimentation\">reason: safer networking experimentation</h3>\n\n<p>Because the address space is so big, if you want to try something out you can\njust grab an IPv6 subnet, try out some things in it, and then literally never\nuse that subnet again.</p>\n\n<h3 id=\"reason-to-run-your-own-autonomous-system-as\">reason: to run your own autonomous system (AS)</h3>\n\n<p>A few people said they were running their own autonomous system (I talked about what an AS is a bit in this <a href=\"https://jvns.ca/blog/2021/10/05/tools-to-look-at-bgp-routes/\">BGP post</a>). IPv4 addresses are too expensive so they bought IPv6 addresses for their AS instead.</p>\n\n<h3 id=\"reason-security-by-obscurity\">reason: security by obscurity</h3>\n\n<p>If your server <em>only</em> has a public IPv6 address, attackers can&rsquo;t easily find it\nby scanning the whole internet. The IPv6 address space is too big to scan!</p>\n\n<p>Obviously this shouldn&rsquo;t be your only security measure, but it seems like a\nnice bonus &ndash; any time I run an IPv4 public server I&rsquo;m always a tiny bit\nsurprised by how it&rsquo;s constantly being scanned for vulnerabilities (like old versions of WordPress, etc).</p>\n\n<h3 id=\"very-silly-reason-you-can-put-easter-eggs-in-your-ipv6-address\">very silly reason: you can put easter eggs in your IPv6 address</h3>\n\n<p>IPv6 addresses have a lot of extra bits in them that you can do frivolous\nthings with. For example one of Facebook&rsquo;s IPv6 addresses is\n&ldquo;2a03:2880:f10e:83:face:b00c:0:25de&rdquo; (it has <code>face:b00c</code> in it).</p>\n\n<h3 id=\"there-are-more-reasons-than-i-thought\">there are more reasons than I thought</h3>\n\n<p>That&rsquo;s all I&rsquo;ve learned about the &ldquo;why support IPv6?&rdquo; question so far.</p>\n\n<p>I came away from this conversation more motivated to support IPv6 on my\n(very small) servers than I had been before. But that&rsquo;s because I think\nsupporting IPv6 will require very little effort for me. (right now I&rsquo;m using a\nCDN that supports IPv6 so it comes basically for free)</p>\n\n<p>I know very little about IPv6 still but my impression is that IPv6 support\noften isn&rsquo;t zero-effort and actually can be a lot of work. For example, I have\nno idea how much work it would actually be for Twitter to add IPv6 support on\ntheir edge servers.</p>\n\n<h3 id=\"supporting-ipv6-can-also-cause-problems\">supporting IPv6 can also cause problems</h3>\n\n<p>A friend who runs a large service told me that their service has tried to add\nIPv6 support multiple times over the last 7 years, but each time it&rsquo;s caused\nthem problems. What happened to them was:</p>\n\n<ul>\n<li>they advertised an AAAA record</li>\n<li>users would get the AAAA record and try to connect to them over IPv6</li>\n<li>some network equipment in the user&rsquo;s ISP/internal network somewhere was broken, so the IPv6 connection failed</li>\n<li>as a result those users were unable to use their service</li>\n</ul>\n\n<p>I thought it was interesting and surprising that supporting IPv6 can actually\nin some cases make things <em>worse</em> for people on dual stack (IPv4 + IPv6)\nnetworks.</p>\n\n<h3 id=\"some-more-ipv6-questions\">some more IPv6 questions</h3>\n\n<p>Here are some more IPv6 questions I have that maybe I&rsquo;ll explore later:</p>\n\n<ul>\n<li>what are the <em>disadvantages</em> to supporting IPv6? what goes somehow wrong? (here&rsquo;s one <a href=\"https://support.fastly.com/hc/en-us/community/posts/360040169531-I-often-can-t-access-Fastly-servers-using-HTTPS-IPv6-RST-packets-received\">example of an IPv6 problem</a> someone linked me to, for example)</li>\n<li>what are the incentives for ISPs that own enough IPv4 addresses for their customers to support IPv6? (another way of asking: is it likely that my ISP will move to supporting IPv6 in the next few years? or are they just not incentivized to do it so it&rsquo;s unlikely?)</li>\n<li><a href=\"https://docs.digitalocean.com/products/networking/floating-ips/\">digital ocean</a> seems to only support IPv4 floating IPs, not IPv6 floating IPs. Why not? Shouldn&rsquo;t it be\n<em>easier</em> to give out IPv6 floating IPs since there are more of them?</li>\n<li>when I try to ping an IPv6 address (like example.com&rsquo;s IP <code>2606:2800:220:1:248:1893:25c8:1946</code> for example) I get the error <code>ping: connect: Network is unreachable</code>. Why? (answer: it&rsquo;s because my ISP doesn&rsquo;t support IPv6 so my computer doesn&rsquo;t have a public IPv6 address)</li>\n</ul>\n\n<p>This <a href=\"https://tailscale.com/kb/1134/ipv6-faq/\">IPv4 vs IPv6 article from Tailscale</a> looks interesting and answers some of these questions.</p>\n"
}