{
  "title": "Welcome, Prashanth!",
  "link": "https://www.joelonsoftware.com/2019/09/24/announcing-stack-overflows-new-ceo/",
  "dc:creator": "Joel Spolsky",
  "pubDate": "Tue, 24 Sep 2019 14:00:17 +0000",
  "category": "News",
  "guid": "https://www.joelonsoftware.com/?p=3612",
  "description": "Last March, I shared that we were starting to look for a new CEO for Stack Overflow. We were looking for that rare combination of someone who&#8230; <span class=\"read-more\"><a class=\"more-link\" href=\"https://www.joelonsoftware.com/2019/09/24/announcing-stack-overflows-new-ceo/\" rel=\"bookmark\">Read more <span class=\"screen-reader-text\">\"Welcome, Prashanth!\"</span></a></span>",
  "content:encoded": "\n<p>Last March, I <a href=\"https://www.joelonsoftware.com/2019/03/28/the-next-ceo-of-stack-overflow/\">shared</a> that we were starting to look for a new CEO for Stack Overflow. We were looking for that rare combination of someone who could foster the community while accelerating the growth of our businesses, especially Teams, where we are starting to close many huge deals and becoming a hyper-growth enterprise software company very quickly. This is not something I’m particularly good at, and I thought it was time to bring on more experienced leadership.</p>\n\n\n\n<p>The Board of Directors nominated a search committee and we went through almost 200 candidates. It speaks to how well respected&nbsp; a company Stack Overflow is that we found ourselves in the rare position of having plenty of highly qualified executives who were excited about the opportunity. Nevertheless, one of them really stood out, and we are pleased to let you know that we have selected Prashanth Chandrasekar as our next CEO. His first day will be October 1st.</p>\n\n\n\n<p>Prashanth was born in Bangalore, India, the city with the highest number of Stack Overflow users in the world, one of the global capitals for software developers writing the script for the future. He started out as a software engineer before moving over to management. He has a BS in Computer Engineering from the University of Maine, a Masters in Engineering Management from Cornell, and an MBA from Harvard. He worked at Capgemini as a management consultant and Barclays as an investment banker in their technology group before joining Rackspace in San Antonio, Texas.</p>\n\n\n\n<p>At Rackspace, Prashanth really proved his mettle, creating from scratch a completely new business unit inside the company, the <a href=\"https://www.rackspace.com/cloud/public\">Global Managed Public Clouds Business</a>. This group serves companies around the world who need help running on AWS, Azure, Google, and so on. Under his leadership, Rackspace successfully pivoted from a leading managed hosting company to a cloud services company. And he did this while working with developers both inside Rackspace and outside, so he understands our vision of “writing the script for the future” better than anyone I’ve met.</p>\n\n\n\n<p>This is an exciting time for Stack Overflow, and we have some big goals for the year ahead. We want to make Stack Overflow more diverse, inclusive, and welcoming. And we want to make it possible for knowledge workers everywhere to use Stack Overflow to get answers to the proprietary questions that are specific to their organizations and teams. We’re doing great work and making great progress in these areas, and I’m confident that Prashanth has some great ideas about how to move forward faster on all our goals.</p>\n\n\n\n<p>As you know, I’m keeping my job as Chairman of the Board, so I’ll continue to be closely involved. Being Stack Overflow’s CEO has been an honor, and I can’t wait to see the things the team accomplishes in the year ahead. This will be a great new chapter for Stack Overflow.<br></p>\n",
  "post-id": 3612
}