{
  "title": "TU73: Building Grit Through Self-Compassion With Dr Kristin Neff (replay)",
  "link": "https://therapistuncensored.com/episodes/tu73-building-grit-through-self-compassion-with-dr-kristin-neff-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu73-building-grit-through-self-compassion-with-dr-kristin-neff-replay",
  "pubDate": "Wed, 15 Aug 2018 03:34:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6341",
  "description": "Self Compassion is an antidote to shame, the underpinning of narcissism. \n\nIt is fierce accountability that is core to psychological health… who knew?  Most of us think of it as being soft on yourself, but our guest will reveal the surprising power and science of self-compassion in this episode.\n\nCo-host Dr. Ann Kelley interviews Dr. Kristen Neff, an Associate Professor at the University of Texas at Austin and a foremost author and expert on Self Compassion.\n\nSelf Esteem vs Self Compassion\n\nThis is not feel-good, la-la, therapy-talk, it’s real science. Learn the important distinction between these two concepts and how one can lead to psychological instability, self-criticism, stress, competition and difficulty within ourselves, our relationships and our culture. You really want to get this right and may be surprised! Treating yourself as your own best friend.\n\nMisperceptions of Self Compassion\n\n \tIt’s NOT a free pass, or being easy on yourself.\n \tIt can be “fierce” and “protective” and “motivating.”\n\nScience shows that the warmth and support of self-compassion promotes health and increases the chances of success in accomplishing goals, whereas negative self talk and kicking one’s own butt doesn’t work because it creates a system of threat and self-sabotage.\n\nSteps to Self Compassion\n\n Dr. Neff outlines the three elements of self-compassion:\n\n \tMindfulness vs. Over identification:The first step is to be mindfully aware of ourselves and our emotions, but from a place of non-judgement.\n \tCommon Humanity vs Isolation: The second step is to recognize the common humanity in our feelings and behaviors rather than seeing ourselves as the “best” or the “worst.” Recognizing that pain is a normal part of human existence, as is suffering and personal inadequacy.\n \tSelf-kindness vs. Self-Judgment: Being kind to oneself rather than self-condemning, is at the core\n\nSelf Compassion as an antidote to shame, the underpinning of narcissism\n\nDr. Neff discusses research which highlights the increase in narcissism in our current culture. She highlights our culture’s tendency to be competitive and to place individual value as contingent on how we compare to those around us. This leaves us extremely vulnerability to the development of narcissism and other psychological difficulties. We discuss the importance of teaching self-compassion to our children and to maintaining an active, loving presence with oneself in order to build self-value without a need to downgrade or succeed over others.\n\nSelf Compassion in our political climate\n\nDr. Neff speaks frankly about her perceptions of the current political climate. She sees self and other compassion as essential to help our country deal with the discord and disharmony around us.\n\n \n\nRESOURCES:\n\nAdditional resources for this episode:\n\n \tKristen Neff:  (visit this it has tons of great resources including free mp3’s)\n \tKristen Neff: Self Compassion Step by Step, The Proven Power of Being Kind to Yourself (Audio CD)\n \tBrene Brown: The Gifts of Imperfection\n \tKaren Bluth, forward by Kristin Neff: The Self-Compassion Workbook for Teens\n \tJean M Twenge and W. Keith Campbell: The Narcissism Epidemic Living in the Age of Entitlement\n \tSelf Compassion Test \n \tBrene Brown “courageously present” rather than “mindfulness”\n \tHorse BoyFoundation in Elgin, TX\n \tThe House Boy movie\n \t These and other resources have been collected for you on our Resources page!\n\n \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "Self Compassion is an antidote to shame, the underpinning of narcissism.  - It is fierce accountability that is core to psychological health… who knew?  Most of us think of it as being soft on yourself, but our guest will reveal the surprising power a...",
  "itunes:summary": "Self Compassion is an antidote to shame, the underpinning of narcissism. <br />\n<br />\nIt is fierce accountability that is core to psychological health… who knew?   Most of us think of it as being soft on yourself, but our guest will reveal the surprising power and science of self-compassion in this episode.<br />\n<br />\nCo-host Dr. Ann Kelley interviews Dr. Kristen Neff, an Associate Professor at the University of Texas at Austin and a foremost author and expert on Self Compassion.<br />\n<br />\nSelf Esteem vs Self Compassion<br />\n<br />\nThis is not feel-good, la-la, therapy-talk, it’s real science. Learn the important distinction between self esteem and self compassion, and how one can lead to psychological instability, self-criticism, stress, competition and difficulty within ourselves, our relationships and our culture. You really want to get this right and may be surprised! Treating yourself as your own best friend.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:00:18"
}