{
  "id": "https://bibleinoneyear.org/en/youth/159",
  "title": "Day 159: No Shades of Grey",
  "description": "Psalm 71:13–14,18, 2 Samuel 13:12, Acts 4:27–31, 5:1–3.  We must be open to the prophetic voice of Scripture, which often traces stark contrasts, urgent ethical choices and diverging paths in the midst of complex problems and situations The reality of right and wrong are very clear in today’s passages and there are stark contrasts between the two",
  "pubDate": "Tue, 08 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/159/?ignore",
  "itunes:duration": "13:52",
  "guid": "enyouth08062021-159",
  "length": 832.47,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 159: No Shades of Grey",
  "itunes:subtitle": "Psalm 71:13–14,18, 2 Samuel 13:12, Acts 4:27–31, 5:1–3.  We must be open to the prophetic voice of Scripture, which often traces stark contrasts, urgent ethical choices and diverging paths in the midst of complex problems and situations The reality of right and wrong are very clear in today’s passages and there are stark contrasts between the two",
  "itunes:summary": "Back in the 1960s, the band The Monkees sang about how no one seemed to believe in absolute morals anymore. In Shades of Gray they sang:\n&nbsp;&nbsp;When the world and I were young,\n&nbsp;&nbsp;Just yesterday.\n&nbsp;&nbsp;Life was such a simple game…\n&nbsp;&nbsp;It was easy then to tell right from wrong…\n&nbsp;&nbsp;Today there is no black or white,\n&nbsp;&nbsp;Only shades of gray.\nNow the expression ‘shades of grey’ has come to be associated with the notorious and controversial books and films with that name.\nMany today no longer believe there is such a thing as absolute right or absolute wrong. Stark contrasts and black-and-white distinctions are not always easy to swallow in a society in which relativism is the order of the day. Everything is relative – a matter of degrees.\nAs followers of Jesus we cannot give in to these relativistic ideas. We must be open to the prophetic voice of Scripture, which often traces stark contrasts, urgent ethical choices and diverging paths in the midst of complex problems and situations.\nThe reality of right and wrong are very clear in today’s passages and there are stark contrasts between the two.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 159
}