{
  "title": "S15 Ep29: Ethel Allen's Date with the Devil and Supernatural News",
  "link": "https://audioboom.com/posts/8098494",
  "itunes:episode": 29,
  "itunes:title": "Ethel Allen's Date with the Devil and Supernatural News",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5168,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio is an eyewitness to Ethel Allen's Date with the Devil with guest Gail Sheldon PLUS Supernatural News<br>\n<br>\nDave Schrader speaks with his guest Gail Sheldon about the brutal murder of Ethel Allen, whose mutilated and burned body was found on the bank of the Indian River on November 21, 1934. This murder has continued to fascinate in part due to the violence involved in the crime and partly because no one was ever arrested for it. That such a sensational crime occurred at all in sleepy Brevard County at that early of a date also adds to the shock factor. However, some 78 years later local authors Gail Sheldon and Gloria Falco set out to try and solve this very cold case and have put together their findings using unconventional paranormal research and investigative methods to shed some light on this long dead case. PLUS TIM HAS A FEW SUPERNATURAL NEWS STORIES!<br>\n<br>\nSee the Skinwalker video here: <a href=\"https://bit.ly/2XhHngo\">https://bit.ly/2XhHngo</a><br>\nThere is a weird moment at 3 hour 7 min and 20 second mark<br>\n<br>\nSee the Alien/Venom video: <a href=\"https://bit.ly/2JPegsE\">https://bit.ly/2JPegsE</a><br>\n<br>\nGet the book here:  <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nGet more awesome books on True Crime and the Supernatural here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nWhite Castle Sliders have a unique, one-of-kind taste that’s totally crave worthy! They are the perfect home solution for lunches, snacks and dinners , eat them by yourself or eat them with family!  Pick up White Castle Sliders in freezer aisles nationwide!",
  "itunes:summary": "Darkness Radio is an eyewitness to Ethel Allen's Date with the Devil with guest Gail Sheldon PLUS Supernatural News\n\nDave Schrader speaks with his guest Gail Sheldon about the brutal murder of Ethel Allen, whose mutilated and burned...",
  "pubDate": "Sat, 11 Apr 2020 08:00:00 +0000",
  "guid": "c8ed4ba0-18eb-4b80-b058-5e82e6c0e7d8",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}