{
  "id": "yt:video:vxvhGj9fA3g",
  "yt:videoId": "vxvhGj9fA3g",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "Which Healthcare System is Best? Crash Course Public Health #7",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-09-15T17:00:29+00:00",
  "updated": "2022-10-27T02:12:10+00:00",
  "media:group": {
    "media:title": "Which Healthcare System is Best? Crash Course Public Health #7",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Are you ready for the understatement of the century? Health care is complicated. Across the 200 or so countries on Earth, there are a lot of different ways people receive health care. In this episode of Crash Course Public Health, we’re going to break down the building blocks that are used to create a health care system and take a look at four of the most common models.\n\nCheck out our shared playlist with APHA: https://www.youtube.com/playlist?list=PLDjqc55aK3kywF2dd97_Jh5iP0d2ARhdo \n\nVanessa’s channel: https://www.youtube.com/braincraft \n\nTranscript: https://docs.google.com/document/d/1H5J4HgGDbFyXLr9BVy5dcp6l0ro1HNzDz9nQHXpXpCM/edit\n\nSources: https://docs.google.com/document/d/1OHJiQ1njj5jWJC1YLDBzQgKC1QfnVgqJbbpK6qs7ekA/edit?usp=sharing\n\nChapters: \nIntroduction to Health Care Systems 00:00\nSix Building Blocks 2:03\nBeveridge Model 5:18\nBismarck Model 6:37\nNational Health Insurance Model 7:09\nOut-of-Pocket Model 7:35\nGoals of Healthcare 10:45\nReview & Credits 11:44\n\n***\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nDylan Mandelblatt, Katie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, Hasan Jamal, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Kyle & Katherine Callahan, Laurel Stevens, Michael Wang, Stacey J, Burt Humburg, Allyson Martin, Aziz Y, Shanta, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Tim Kwist, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, kelsey warren, Katie Dean, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}