{
  "title": "13: Episode 13",
  "link": "https://audioboom.com/posts/7316380",
  "itunes:episode": 13,
  "itunes:title": "Episode 13",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4078,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our October 30th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>With the <em>Goblet of Fire</em> movie premiere now only two weeks away, the discussion heats up over some recently released clips. What was wrong about Harry and Ron’s argument? Do Dumbledore and Snape need anger management? Is Michael Gambon the right man for the part? Plus, just why is this spooky holiday so important to the <em>Harry Potter</em> series?<br>\n<br>\n\n</div>\n<div>All that and more ahead with Andrew, Eric, Laura, and Micah on this Halloween edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>OoOoOooOo it’s our Halloween special!</li>\n<li>Micah reveals he stole the Ford Anglia</li>\n<li>Eric has grown three inches since he started MuggleCast</li>\n<li>We announce our partnership with <a href=\"http://www.melodeo.com/mobilcast\">Mobilcast</a>\n</li>\n<li>For the next month, the show will be affiliated with <a href=\"http://www.powwows.com/mugglenet\">PowWows.com</a> to promote Native American month</li>\n<li>Eric suggests wizards should create Muggle Appreciation Month</li>\n<li>Halloween events occurring in the Potter books</li>\n<li>The cast discusses all of the new Goblet TV spots</li>\n<li>Andrew and Eric heavily discuss the reasons why each respectively like and dislike Michael Gambon and Richard Harris</li>\n<li>We’ll be looking forward to Miranda Richardson in her role as Rita Skeeter</li>\n<li>Discussion on how Imelda Staunton (possible Umbridge actress) has to play her role in HP5</li>\n<li>Movies to Book comparisons</li>\n<li>Lots of <em>Prisoner of Azkaban</em> movie discussion</li>\n<li>Next week’s main topic: Ginny Weasley in-depth</li>\n<li>Spy on Spartz</li>\n<li>Andrew’s Weekly Challenge</li>\n<li>Thanks to Ralph for this week’s remix!</li>\n</ul>\n",
  "pubDate": "Sun, 30 Oct 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316380",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}