{
  "title": "Is Death That Different? | A Conversation With Lynda Brookes",
  "link": "https://audioboom.com/posts/8154265",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 924,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Lynda Brookes, as a young girl, often wondered who the mysterious man was that hung out outside her house. Because he appeared so lifelike, she was initially confused about what to make of him. But she would soon discover that the mysterious figure she had encountered was dead. This particular individual, however, had no malicious intentions. He was just trying to locate his late daughter, whom Lynda resembles very much. For most people, this encounter with death would be the first of many. It would also be the first step toward learning more about what awaits us on the other side. A life that might not be so different from the one we live here on Earth. All of this and more is on today's gave talks with Lynda Brookes.<br>\n<br>\n<a href=\"http://www.patreon.com/thegravetalks\"><strong>PART 2 - AVAILABLE TO GRAVE KEEPERS ONLY - LISTEN HERE</strong></a> <strong>In part two of our interview, </strong><a href=\"http://www.patreon.com/thegravetalks\"><strong>available only to Grave Keepers</strong></a><strong>, we discuss:<br>\n</strong><br>\nIs it always the case that the messages the dead bring to the living are crucial?<br>\n<br>\nIs it true that \"the other side\" has \"messages waiting\" for everyone?<br>\n<br>\nIn the afterlife, do animals have the same ability to communicate with us as humans have?<br>\n<br>\n<br>\nAs a Grave Keeper, for $5 per month you will get:<br>\n<strong>Access to every </strong><a href=\"http://www.thegravetalks.com/category/podcast-episodes/\"><strong>episode</strong></a><strong> of our show, AD-FREE – MONTHS BEFORE THEY GO PUBLIC.</strong><br>\n<strong>Access to every EXCLUSIVE PART 2 episode of our show for Grave Keeper Only!</strong><br>\n<strong>Access to submit questions to upcoming guests of our show.</strong><br>\n<strong>The “good feeling” knowing that you are keeping this show alive (It really does feel good!)</strong><br>\nListen to part two of this interview and get exclusive access to HUNDREDS of bonus episodes at <a href=\"http://www.patreon.com/thegravetalks\"><strong><a href=\"http://www.patreon.com/thegravetalks\">http://www.patreon.com/thegravetalks</a></strong></a>\n</div>\n",
  "pubDate": "Thu, 15 Sep 2022 14:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-08:/posts/8154265",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}