{
  "title": "Modelling Hate Speech on Reddit — A Three-Act Play (Slide Deck)",
  "link": "",
  "id": "https://www.georgeho.org/reddit-slides/",
  "updated": "2017-11-08T00:00:00Z",
  "published": "2017-11-08T00:00:00Z",
  "content": "<p>This is a follow-up post to my first post on a recent project to <a href=\"https://www.georgeho.org/reddit-clusters/\">model hate\nspeech on Reddit</a>. If you haven&rsquo;t\ntaken a look at my first post, please do!</p>\n<p>I recently gave a talk on the technical, data science side of the project,\ndescribing not just the final result, but also the trajectory of the whole\nproject: stumbling blocks, dead ends and all. Below is the slide deck: enjoy!</p>\n<h2 id=\"abstract\">Abstract</h2>\n<p>Reddit is the one of the most popular discussion websites today, and is\nfamously broad-minded in what it allows to be said on its forums: however,\nwhere there is free speech, there are invariably pockets of hate speech.</p>\n<p>In this talk, I present a recent project to model hate speech on Reddit. In\nthree acts, I chronicle the thought processes and stumbling blocks of the\nproject, with each act applying a different form of machine learning:\nsupervised learning, topic modelling and text clustering. I conclude with the\ncurrent state of the project: a system that allows the modelling and\nsummarization of entire subreddits, and possible future directions. Rest\nassured that both the talk and the slides have been scrubbed to be safe for\nwork!</p>\n<h2 id=\"slides\">Slides</h2>\n<blockquote class=\"embedly-card\"><h4><a href=\"https://speakerdeck.com/_eigenfoo/modelling-hate-speech-on-reddit-a-three-act-play\">Modelling Hate Speech on Reddit - A Three-Act Play</a></h4><p>Reddit is the one of the most popular discussion websites today, and is famously broad-minded in what it allows to be said on its forums: however, where there is free speech, there are invariably pockets of hate speech. In this talk, I present a recent project to model hate speech on Reddit.</p></blockquote>\n<script async src=\"//cdn.embedly.com/widgets/platform.js\" charset=\"UTF-8\"></script>"
}