{
  "title": "Machine Learning Shaking Up Hard Sciences, Too",
  "link": "https://spectrum.ieee.org/machine-learning-in-physics",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-view-of-the-underground-alice-detector-used-to-study-heavy-ion-physics-at-the-large-hadron-collider-lhc.jpg?id=31878708&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>Particle physicists have long been early adopters—if not <a href=\"https://www.symmetrymagazine.org/article/the-coevolution-of-particle-physics-and-computing\" target=\"_blank\">inventors</a>—of tech from email to the Internet. It’s not surprising, then, that <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S037026939701112X\" target=\"_blank\">as early as 1997</a>, researchers were training computer models to tag particles in the messy jets created during collisions. Since then, these models have chugged along, growing steadily more competent—though not to everyone’s delight.<br/></p><p>“I felt very threatened by machine learning,” says <a href=\"https://physics.mit.edu/faculty/jesse-thaler/\" target=\"_blank\">Jesse Thaler</a>, a theoretical particle physicist at the Massachusetts Institute of Technology. Initially, he says he felt like it jeopardized his human expertise classifying particle jets. But Thaler has since come to embrace it, applying machine learning to a variety of problems across particle physics. “Machine learning is a collaborator,” he says. </p><p>Over the past decade, in tandem with the broader<a target=\"_blank\"> </a><a href=\"https://spectrum.ieee.org/what-is-deep-learning\" target=\"_self\">deep-learning revolution</a>, particle physicists have trained algorithms to solve previously intractable problems and tackle completely new challenges. </p><p class=\"pull-quote\">Even with an efficient trigger, the LHC must store 600 petabytes over the next few years of data collection. So researchers are investigating strategies to compress the data.<br/></p><p>For starters, particle-physics data is very different from the typical data used in machine learning. Though <a href=\"https://towardsdatascience.com/a-comprehensive-guide-to-convolutional-neural-networks-the-eli5-way-3bd2b1164a53\" target=\"_blank\">convolutional neural networks</a> (CNNs) have proven extremely effective at classifying images of everyday objects from trees to cats to food, they’re less suited for particle collisions. The problem, according to <a href=\"https://jduarte.physics.ucsd.edu/\" target=\"_blank\">Javier Duarte</a>, a particle physicist at the University of California, San Diego, is that collision data such as that from the <a href=\"https://spectrum.ieee.org/tag/large-hadron-collider\" target=\"_blank\">Large Hadron Collider</a>, isn’t naturally an image.</p><p>Flashy depictions of collisions at the LHC can misleadingly fill up the entire detector. In reality, only a few out of millions of inputs are registering a signal, like a white screen with a few black pixels. This sparsely populated data makes for a poor image, but it can work well in a different, newer framework—graph neural networks (GNNs).</p><p>Other challenges from particle physics require innovation. “We’re not just importing hammers to hit our nails,” says <a href=\"https://www.physics.uci.edu/people/daniel-o-whiteson\" target=\"_blank\">Daniel Whiteson</a>, a particle physicist at the University of California, Irvine. “We have new weird kinds of nails that require the invention of new hammers.” One weird nail is the sheer amount of data produced at the LHC—about one petabyte per second. Of this enormous amount, only a small bit of high-quality data is saved. To create a better trigger system, which saves as much good data as possible while getting rid of low-quality data, researchers want to train a sharp-eyed algorithm to sort better than one that’s hard coded.</p><p>But to be effective, such an algorithm would need to be incredibly speedy, executing in microseconds, Duarte says. To address these problems, particle physicists are pushing the limits of machine <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8299073/\" rel=\"noopener noreferrer\" target=\"_blank\">techniques</a> like pruning and quantization, to make their algorithms even faster. Even with an efficient trigger, the LHC must store 600 petabytes over the next few years of data collection (<a href=\"https://info.cobaltiron.com/blog/petabyte-how-much-information-could-it-actually-hold\" target=\"_blank\">equivalent to</a> about 660,000 movies at 4K resolution or the data equivalent of 30 Libraries of Congresses), so researchers are investigating <a href=\"https://lup.lub.lu.se/student-papers/search/publication/9004751\" rel=\"noopener noreferrer\" target=\"_blank\">strategies to compress</a> the data.</p><p class=\"pull-quote\">“We’d like to have a machine learn to think more like a physicist, [but] we also just need to learn how to think a little bit more like a machine.”<br/>—Jesse Thaler, MIT</p><p>Machine learning is also allowing particle physicists to think differently about the data they use. Instead of focusing on a single event—say, a Higgs boson decaying to two photons—they are learning to consider the dozens of other events that happen during a collision. Although there’s no causal relationship between any two events, researchers like Thaler are now embracing a more holistic view of the data, not just the piecemeal point of view that comes from analyzing events interaction by interaction. </p><p>More dramatically, machine learning has also forced physicists to reassess basic concepts. “I was imprecise in my own thinking about what a symmetry was,” Thaler says. “Forcing myself to teach a computer what a symmetry was, helped me understand what a symmetry actually is.” Symmetries require a reference frame—in other words, is the image of a distorted sphere in a mirror actually symmetrical? There’s no way of knowing without knowing if the mirror itself is distorted.</p><p>These are still early days for machine learning in particle physics, and researchers are effectively treating the technique like a proverbial kitchen sink. “It may not be the right fit for every single problem in particle physics,” admits Duarte.</p><p>As some particle physicists delve deeper into machine learning, an uncomfortable question rears its head: Are they doing physics, or computer science? <a href=\"https://www.wired.com/2015/08/coding-physics-course/\" target=\"_blank\">Stigma against coding</a>—sometimes not considered to be “real physics”—already exists; similar concerns swirl around machine learning. One worry is that machine learning will obscure the physics, turning analysis into a black box of automated processes opaque to human understanding.</p><p>“Our goal is not to plug in the machine, the experiment to the network and have it publish our papers so we’re out of the loop,” Whiteson says. He and colleagues are working to have the <a href=\"https://journals.aps.org/prd/abstract/10.1103/PhysRevD.103.036020\" rel=\"noopener noreferrer\" target=\"_blank\">algorithms provide feedback</a> in language humans can understand—but algorithms may not be the only ones with responsibilities to communicate.</p><p>“On the one hand, we’d like to have a machine learn to think more like a physicist, [but] we also just need to learn how to think a little bit more like a machine,” Thaler says. “We need to learn to speak each other’s language.”</p>",
  "pubDate": "Fri, 07 Oct 2022 18:42:45 +0000",
  "guid": "https://spectrum.ieee.org/machine-learning-in-physics",
  "category": [
    "Machine learning",
    "Graph neural networks",
    "Particle physics",
    "Artificial intelligence"
  ],
  "dc:creator": "Dan Garisto",
  "media:content": ""
}