{
  "title": "China&#8217;s new space station, Tiangong, gets its third module",
  "link": "https://www.digitaltrends.com/space/tiangong-mengtian-module/",
  "pubDate": "Sat, 05 Nov 2022 20:38:23 +0000",
  "dc:creator": "Georgina Torbet",
  "category": [
    "News",
    "Space",
    "China",
    "space",
    "tiangong"
  ],
  "guid": "https://www.digitaltrends.com/?p=3221321",
  "description": "The third module of China's new station arrived in orbit and was added to the station, and astronauts entered it for the first time.",
  "content:encoded": "<p>China continues to progress in building its own space station, named Tiangong. This week the third module of the new station arrived in orbit and was added to the station, and Chinese astronauts entered it for the first time.</p>\n<figure id=\"attachment_3221339\" aria-describedby=\"caption-attachment-3221339\" class=\"wp-caption alignnone is-caption-text\"><img  class=\"wp-image-3221339 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/china-space-station-tiangong-mengtian-first-entry-hg1.jpg?fit=720%2C720&p=1\" alt=\"Shenzhou-14 astronauts Chen Dong (C), Liu Yang (L) and Cai Xuzhe waving inside the Mengtian lab module. \"   /><figcaption id=\"caption-attachment-3221339\" class=\"wp-caption-text\"><span class=\"text\">This screen image captured at Beijing Aerospace Control Center on November 3, 2022, shows the Shenzhou-14 astronauts Chen Dong (C), Liu Yang (L), and Cai Xuzhe waving inside the Mengtian lab module. The Shenzhou-14 astronauts successfully entered the Mengtian lab module of China&#8217;s space station Tiangong at 3:12 p.m. (Beijing Time) on Thursday, according to the China Manned Space Agency.</span> <span class=\"credit\">Sun Fengxiao/Xinhua</span></figcaption></figure>\n<p>As reported by China&#8217;s state news agency <a href=\"https://english.news.cn/20221103/07f4159dad914838a549e4278e015204/c.html\" target=\"_blank\" rel=\"nofollow noopener\">Xinhua</a>, the astronauts entered the new lab module for the first time on Thursday, November 3. Astronauts Chen Dong, Liu Yang, and Cai Xuzhe have been at the new space station since June as part of the <a href=\"https://www.digitaltrends.com/space/shenzhou-14-mission-docking/\">Shenzhou-14 mission</a>, which docked to the station&#8217;s core module Tianhe. The new lab module, named Mengtian, was launched on October 31. It arrived at the core module&#8217;s forward port, before being relocated to a different port on November 3.</p>\n<p>The Tiangong space station now has its three modules in place: the Tianhe core module which contains the living quarters and service section plus a docking hub, the Wentian module which houses avionics and propulsion systems plus backup functions, and now the Mengtian module which includes both a pressurized section in which the crew can work and an unpressurized cargo section.</p>\n<p>The Shenzhou-14 crew currently on the station will soon be joined by the Shenzhou-15 crew in a mission expected to launch this month. Three more crew members will arrive at the station and have a 10-day handover between the two crews. A handover period wasn&#8217;t previously possible when the station only had its core module, but with the <a href=\"https://www.digitaltrends.com/space/china-tiangong-second-module/\">addition of the Wentian module</a> which can be used as spare crew quarters, it is now possible for two crews to be on the station at the same time.</p>\n<p>The crew is also expecting the arrival of the Tianzhou-5 cargo craft which is expected to launch soon and will carry fuel and supplies to the station.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/china-space-station-tiangong-mengtian-first-entry-hg1.jpg?p=1",
  "enclosure": "",
  "post-id": 3221321
}