{
  "title": "Stock Trading Volume Prediction with Dual-Process Meta-Learning. (arXiv:2211.01762v1 [q-fin.TR])",
  "link": "http://arxiv.org/abs/2211.01762",
  "description": "<p>Volume prediction is one of the fundamental objectives in the Fintech area,\nwhich is helpful for many downstream tasks, e.g., algorithmic trading. Previous\nmethods mostly learn a universal model for different stocks. However, this kind\nof practice omits the specific characteristics of individual stocks by applying\nthe same set of parameters for different stocks. On the other hand, learning\ndifferent models for each stock would face data sparsity or cold start problems\nfor many stocks with small capitalization. To take advantage of the data scale\nand the various characteristics of individual stocks, we propose a dual-process\nmeta-learning method that treats the prediction of each stock as one task under\nthe meta-learning framework. Our method can model the common pattern behind\ndifferent stocks with a meta-learner, while modeling the specific pattern for\neach stock across time spans with stock-dependent parameters. Furthermore, we\npropose to mine the pattern of each stock in the form of a latent variable\nwhich is then used for learning the parameters for the prediction module. This\nmakes the prediction procedure aware of the data pattern. Extensive experiments\non volume predictions show that our method can improve the performance of\nvarious baseline models. Further analyses testify the effectiveness of our\nproposed meta-learning framework.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/q-fin/1/au:+Chen_R/0/1/0/all/0/1\">Ruibo Chen</a>, <a href=\"http://arxiv.org/find/q-fin/1/au:+Li_W/0/1/0/all/0/1\">Wei Li</a>, <a href=\"http://arxiv.org/find/q-fin/1/au:+Zhang_Z/0/1/0/all/0/1\">Zhiyuan Zhang</a>, <a href=\"http://arxiv.org/find/q-fin/1/au:+Bao_R/0/1/0/all/0/1\">Ruihan Bao</a>, <a href=\"http://arxiv.org/find/q-fin/1/au:+Harimoto_K/0/1/0/all/0/1\">Keiko Harimoto</a>, <a href=\"http://arxiv.org/find/q-fin/1/au:+Sun_X/0/1/0/all/0/1\">Xu Sun</a>"
}