{
  "id": "https://bibleinoneyear.org/en/youth/88",
  "title": "Day 88: How to Become Wise",
  "description": "Proverbs 8:12,17–19, Numbers 26:52–54, Luke 7:37–39,44–48.  It is the sort of legacy good parents want to hand on to their children  Ultimately, wisdom is found in Jesus Christ, who is the ‘wisdom of God’ (1 Corinthians 1:24)",
  "pubDate": "Mon, 29 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/88/?ignore",
  "itunes:duration": "13:15",
  "guid": "enyouth29032021-88",
  "length": 795.85,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 88: How to Become Wise",
  "itunes:subtitle": "Proverbs 8:12,17–19, Numbers 26:52–54, Luke 7:37–39,44–48.  It is the sort of legacy good parents want to hand on to their children  Ultimately, wisdom is found in Jesus Christ, who is the ‘wisdom of God’ (1 Corinthians 1:24)",
  "itunes:summary": "Oprah Winfrey says, ‘Follow your instincts. That’s where true wisdom manifests itself.’ In other words, wisdom comes from within and is a kind of intuition. Since you are created in the image of God, there is truth in this. However, as we see in today’s passages, true wisdom comes from God and it is supremely acquired through your relationship with him. As we have seen, knowledge is horizontal. But wisdom is vertical. It comes down from above. You will grow in wisdom as you learn, reflect and live in relationship with God.\nWe all desperately need wisdom. In the Old Testament there are several books of ‘Wisdom’: Proverbs, Job, Ecclesiastes and Song of Songs. In addition, sprinkled throughout the Bible are various writings which might loosely be described as ‘Wisdom Literature’, dealing with such diverse areas as the power of the tongue, the blessings of faithfulness, the dangers of adultery, the hazards of strong drink, the inequalities of life, the sufferings of the righteous, the skill of leadership and the art of parenting.\nThis wisdom is a kind of sanctified common sense. It leads to greater self-understanding. It gives you the ability to cope in life and to steer through and master its challenges. It is the sort of legacy good parents want to hand on to their children. Ultimately, wisdom is found in Jesus Christ, who is the ‘wisdom of God’ (1 Corinthians 1:24).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 88
}