{
  "title": "Art museums roll out protective measures after protests – media",
  "link": "https://www.rt.com/news/565919-art-museums-security-climate-protesters/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565919-art-museums-security-climate-protesters/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636415a885f54046a47d4845.jpg\" /> European art museums have reportedly beefed up security in the wake of climate protesters’ assaults on art <br/><a href=\"https://www.rt.com/news/565919-art-museums-security-climate-protesters/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Institutions in Germany and Sweden have reportedly taken steps to increase security, such as banning bags and jackets</strong></p>\n            \n                        \n            <p>Following a rash of widely publicized attacks by climate change protesters on iconic artworks such as Van Gogh&rsquo;s &lsquo;Sunflowers&rsquo; and Monet&rsquo;s &lsquo;Les Meules&rsquo;, museums have begun tightening security, Swedish broadcaster SVT reported on Wednesday. &nbsp;&nbsp;</p>\n<p>Some museums in Germany have adopted bans on bags and jackets inside, according to the Swedish outlet TT, while France&rsquo;s famous Centre Pompidou and Spain&rsquo;s Prado Museum have also reportedly increased security in response to attacks by green campaigners affiliated with the group Just Stop Oil and its offshoots.&nbsp;</p>\n<p>Patrik Steorn, director of the Gothenburg Museum of Art, revealed to SVT that the Swedish gallery had also upped its security, though he declined to explain exactly how. Steorn acknowledged it was &ldquo;<em>a little difficult to understand why our common cultural heritage should be exposed to</em>&rdquo; protests such as Just Stop Oil&rsquo;s stunts, which often leave protesters, artworks, or both, covered in glue or food.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635adcde85f5400aa9436def.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565479-climate-deface-pearl-earring-museum/\">Climate protesters attack iconic painting</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>&ldquo;<em>We would much rather see social movements and museums try to join hands to raise awareness of climate issues together</em>,&rdquo; he said. Four other Swedish museums declined to respond to the outlet&rsquo;s questions regarding securing their exhibits against unruly demonstrators.&nbsp;</p>\n<p>Just Stop Oil campaigners have thus far had little difficulty getting close to priceless paintings to douse them in canned food, often concealing their tell-tale t-shirts beneath sweatshirts and jackets. Security guards at the Netherlands&rsquo; Maritshuis museum did not intervene to stop a well-known climate activist with the group from gluing his head to Vermeer&rsquo;s &lsquo;Girl with a Pearl Earring&rsquo; last week even as he set off the alarm on the painting, and waited patiently for him to finish his prepared statement before attempting to remove him from the artwork.&nbsp; &nbsp;</p>\n<p>That museum allows visitors to carry only &ldquo;<em>a small handbag</em>&rdquo; inside but has been reluctant to search anyone, with a spokesperson telling The Guardian that one &ldquo;<em>can never 100% prevent protest actions</em>.&rdquo; &nbsp;&nbsp;</p>\n<p>Members of the group descended on the British PM&rsquo;s residence at 10 Downing earlier this week for one last protest before announcing a temporary moratorium on actions in order to give governments time to consider its proposal to ban all new oil and gas projects. Just Stop Oil is funded by oil heiress turned climate crusader Aileen Getty, whose Climate Emergency Fund also backs climate campaigners Extinction Rebellion.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 20:22:01 +0000",
  "dc:creator": "RT"
}