{
  "title": "Episode 19: &#8220;That&#8217;s All Right, Mama&#8221; by Elvis Presley",
  "link": "https://500songs.com/podcast/thats-all-right-mama-by-elvis-presley/",
  "pubDate": "Mon, 11 Feb 2019 02:11:48 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/thats-all-right-mama-by-elvis-presley/",
  "description": "<p>Welcome to episode nineteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"That's All Right Mama\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-19-thats-all-right-mama/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p>Elvis' 1950s catalogue is, at least in the UK, now in the public domain, and can thus be found in many forms. <a href=\"https://amzn.to/2DtTafM\">This three-CD box set</a> contains literally every recording he made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.</p>\n<p><a href=\"https://amzn.to/2I6Tx5A\">This ten-disc set,</a> meanwhile, charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles, including all Elvis' five Sun releases in their historical context, as well as \"Bear Cat\" and a <em>lot</em> of great blues and rockabilly.</p>\n<p>And<a href=\"https://amzn.to/2DrYeBu\"> this four-CD box set of Arthur Crudup</a> contains everything you could want by that great bluesman.</p>\n<p>I've relied on three books here more than any others. The first is <a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum.</a> which I've recommended many times before. The other two are by Peter Guralnick -- <a href=\"https://amzn.to/2I0fSSm\">Sam Phillips: The Man Who Invented Rock 'n' Roll</a>, and <a href=\"https://amzn.to/2I6pg78\">Last Train to Memphis</a>. The latter is the first volume of Guralnick's two-volume biography of Elvis. The second volume of that book is merely good, not great (though still better than much of the nonsense written about Elvis), but <em>Last Train to Memphis</em> is, hands down, the best book on Elvis there is. (A content warning for both Guralnick books -- they use racial slurs in reported speech, though never in anything other than a direct quote).</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>Before I start, I just want to emphasise that in this episode I talk about some of Sam Phillips' ideas around race and how to end racism. I hope I make it clear that I disagree with his ideas, but in trying to be fair and present his thinking accurately I may have given a different impression. I'm sure people listening to this in the context of the series as a whole understand where I'm coming from, but I'm aware that this will be some people's first episode. There's a reason this comes after the episode on “Sh'Boom”. If you come out of this episode thinking I think the way to end racism is to have white people perform black people's music, go back and listen to that one. Anyway, on with the show...</p>\n<p>The Starlite Wranglers were not a band you would expect to end up revolutionising music -- and indeed only some of them ever did. But you wouldn't have expected even that from them.</p>\n<p>They were based in Memphis, but they were very far from being the sophisticated, urban music that was otherwise coming from big cities like that. Their bass player, Bill Black, would wear a straw hat and go barefoot, looking something like Huckleberry Finn, even as the rest of the band wore their smart Western suits. He'd hop on the bass and ride it, and tell cornpone jokes.</p>\n<p>They had pedal steel, and violin, and a singer named Doug Poindexter. Their one record on Sun was a pure Hank Williams soundalike:</p>\n<p>[excerpt of \"My Kind of Carrying On\" by Doug Poindexter and the Starlite Wranglers]</p>\n<p>Again, this doesn't sound like anything that might revolutionise music. The single came out and did no better or worse than thousands of other singles by obscure country bands. In most circumstances it would be no more remembered now than, say \"Cause You're Always On My Mind\" by Wiley Barkdull, or \"Twice the Loving\" by Floyd Huffman.</p>\n<p>But then something unprecedented in modern music history happened.</p>\n<p>Sun Records was the second record label Sam Phillips had set up -- the first one had been a very short-lived label called Phillips, which he'd started up with his friend, the DJ Dewey Phillips (who was not related to Sam). After his experiences selling masters to other labels, like Modern and Duke and Chess, had caused him more problems than he'd initially realised, he'd decided that if he wanted to really see the music he loved become as big as he knew it could be, he'd have to run his own label.</p>\n<p>Because Sam Phillips had a mission. He was determined to end racism in the US, and he was convinced he could do so by making white audiences love the music of black people as much as he did. So the success of his new label was a moral imperative, and he wanted to find something that would be as big as \"Rocket 88\", the record he'd leased to Chess. Or maybe even a performer as important as Howlin' Wolf, the man who decades later he would still claim was the greatest artist he'd ever recorded.</p>\n<p>Howlin' Wolf had recorded several singles at Sam's studio before he'd started Sun records, and these singles had been leased to other labels. But like so many of the people he'd recorded, the record labels had decided they could make more money if they cut out the middle-Sam and recorded Wolf themselves. Sam Phillips often claimed later that none of the records Wolf made for Chess without Sam were anything like as good as the music he'd been making at 706 Union Ave; and he may well have been right about that. But still, the fact remained that the Wolf was elsewhere now, and Sam needed someone else as good as that.</p>\n<p>But he had a plan to get attention – make an answer record. This was something that happened a lot in blues and R&B in the fifties -- if someone had a hit with a record, another record would come along, usually by another artist, that made reference to it. We've already seen this with \"Good Rockin' Tonight\", where the original version of that referenced half a dozen other records like \"Caldonia\".</p>\n<p>And Sam Phillips had an idea for an answer song to \"Hound Dog\". There had been several of these, including one from Roy Brown, who wrote “Good Rockin' Tonight” -- \"Mr Hound Dog's in Town\"</p>\n<p>[excerpt: Roy Brown “Mr Hound Dog's In Town”]</p>\n<p>Phillips, though,thought he had a particularly good take. The phrase \"hound dog\", you see, was always used by women, and in Phillips' view it was always used for a gigolo. And the female equivalent of that, in Phillips' telling, was a bear cat. And so Sam Phillips sat down and \"wrote\" \"Bear Cat\".</p>\n<p>Well, he was credited as the writer, anyway. In truth, the melody is identical to that of \"Hound Dog\", and there's not much difference in the lyrics either, but that was the way these answer records always went, in Phillips' experience, and nobody ever kicked up a fuss about it.</p>\n<p>He called up a local Memphis DJ, Rufus Thomas, and asked him to sing on the track, and Thomas said yes, and the song was put out as one of the very first records on Phillips' new record label, Sun.</p>\n<p>[excerpt of \"Bear Cat\" by Rufus Thomas]</p>\n<p>What was surprising was how big a hit it became -- \"Bear Cat\" eventually climbed all the way to number three on the R&B charts, which was a phenomenal success for a totally new label with no track record.</p>\n<p>What was less phenomenal was when Duke Records and their publishing arm came to sue Sam Phillips over the record. It turned out that if you were going to just take credit for someone else's song and not give them any of the money, it was best not to have a massive hit, and be based in the same city as the people whose copyright you were ripping off. Phillips remained bitter to the end of his life about the amount of money he lost on the record.</p>\n<p>But while he'd had a solid hit with \"Bear Cat\", and Joe Hill Louis was making some pretty great blues records, Sam was still not getting to where he wanted to be.</p>\n<p>The problem was the audiences. Sam Phillips knew there was an audience for the kind of music these black men were making, but the white people just wouldn't buy it from a black person. But it was the white audiences that made for proper mainstream success for any musician. White people had more money, and there were more of them.</p>\n<p>Maybe, he started to think, he could find a white person with the same kind of feeling in their music that the black people he was working with had? If he could do that -- if he could get white people to *just listen* to black people's music, *at all*, even if it was sung by a white person, then eventually they'd start listening to it from black people, too, and he could break down the colour barrier.</p>\n<p>(Sam Phillips, it has to be noted, always had big ideas and thought he could persuade the world of the righteousness of his cause if everyone else would *just listen*. A few years later, during the Cuban missile crisis, Phillips decided that since in his mind Castro was one of the good guys -- Phillips was on the left and he knew how bad Batista had been -- he would probably be able to negotiate some sort of settlement if he could just talk to him. So he got on the phone and tried to call Castro -- and he actually did get through to Raul Castro, Fidel's brother, and talk to him for a while. History does not relate if Phillips' intervention is what prevented nuclear war.)</p>\n<p>So Sam Phillips was in the right frame of mind to take advantage when history walked into his studio.</p>\n<p>Elvis Aaron Presley was an unlikely name for a teen idol and star, and Elvis had an unlikely background for one as well. The son of a poor sharecropper from Mississippi who had moved to Memphis as a young man, he was working as a truck driver when he first went into Memphis Recording Service to record himself singing a song for his mother.</p>\n<p>And when Phillips' assistant, Marion Keisker, heard the young man who'd come in to the studio, she thought she'd found just the man Phillips had been looking for – the white man who could sing like a black man.</p>\n<p>Or at least, that's how Keisker told it. Like with so many things in rock music's history, it depends on who you listen to. Sam Phillips always said it had been him, not Keisker, who \"discovered\" Elvis Presley, but the evidence seems to be on Keisker's side. However, even there, it's hard to see from Elvis' original recording -- versions of \"My Happiness\" and \"That's When Your Heartaches Begin\" -- what she saw in him that sounded so black. While the Ink Spots, who recorded the original version of \"That's When Your Heartaches Begin\", were black, they always performed in a very smooth, crooner-esque, style, and that's what Presley did too in his recording. He certainly didn't have any particular blues or R&B feel in his vocal on those recordings.</p>\n<p>[excerpt: \"That's When Your Heartaches Begin\" -- Elvis Presley]</p>\n<p>But Keisker or Phillips heard something in those recordings. More importantly, though, what Sam Phillips saw in him was an attitude. And not the attitude you might expect.</p>\n<p>You see, Elvis Presley was a quiet country boy. He had been bullied at school. He wore strange clothes and kept to himself, only ever really getting close to his mother. He was horribly introverted, and the few friends he did have mostly didn't know about his interests, other than whichever one he shared with them. He mostly liked to listen to music, read comic books, and fantasise about being in a gospel quartet like the Jordanaires, singing harmony with a group like that.</p>\n<p>He'd hang around with some of the other teenagers living in the same housing block -- Johnny and Dorsey Burnette, and a guy called Johnny Black, whose big brother Bill was the bass player with the Starlite Wranglers. They bullied him too, but they sort of allowed him to hang around with them, and they'd all get together and sing, Elvis standing a little off from the rest of them, like he wasn't really part of the group. He'd thought for a while he might become an electrician, but he kept giving himself electric shocks and short-circuiting things -- he said later that he was so clumsy it was a miracle that he didn't cause any fires when he worked on people's wiring.</p>\n<p>He didn't have many friends -- and no close friends at all -- and many of those he did have didn't even know he was interested in music. But he was absorbing music from every direction and every source -- the country groups his mother liked to listen to on the radio like the Louvin Brothers, the gospel quartets who were massive stars among the religious, poor, people in the area, the music he heard at the Pentecostal church he attended (a white Pentecostal church, but still as much of a Holly Roller church as the black ones that SIster Rosetta Tharpe had learned her music from). He'd go down Beale Street, too, and listen to people like B.B. King -- young Elvis bought his clothes from Lansky's on Beale, where the black people bought their clothes, rather than from the places the other white kids got their clothes.</p>\n<p>But he wasn't someone like Johnny Otis who fitted in with the black community, either -- rather, he was someone who didn't fit in anywhere. Someone who had nobody, other than his mother, who he felt really close to. He was weird, and unpopular, and shy, and odd-looking.</p>\n<p>But that feeling of not fitting in anywhere allowed him to pick up on music from everywhere. He didn't own many records, but he *absorbed* songs from the radio. He'd hear something by the Ink Spots or Arthur Crudup once, and sing it perfectly.</p>\n<p>But it was gospel music he wanted to sing -- and specifically what is known euphemistically as \"Southern Gospel\", but which really means \"white Gospel\". And this is an important distinction that needs to be made as we go forward, because gospel music has had a huge influence on rock and roll music, but that influence has almost all come from black gospel, the music invented by Thomas Dorsey and popularised by people like Sister Rosetta Tharpe or Mahalia Jackson. That's a black genre, and a genre which has many prominent women in it -- and it's also a genre which has room for solo stars. When we talk about a gospel influence on Ray Charles or Aretha Franklin or Sam Cooke, that's the gospel music we're talking about.</p>\n<p>That black form of gospel became the primary influence on fifties rhythm and blues vocals, and through that on rock and roll. But there's another gospel music as well -- \"Southern Gospel\" or \"quartet gospel\". That music is -- or at least was at the time we're talking about -- almost exclusively white, and male, and sung by groups. To ears that aren't attuned to it, it can sound a lot like barbershop music. It shares a lot of its repertoire with black gospel, but it's performed in a very, very different style.</p>\n<p>[excerpt: \"Take My Hand, Precious Lord\", the Blackwood Brothers]</p>\n<p>That's the Blackwood Brothers singing, and you can hear how even though that's a Thomas Dorsey song, it sounds totally different from, say, Mahalia Jackson's version.</p>\n<p>The Blackwood Brothers were young Elvis Presley's favourite group, and he was such a fan that when two of the group died in a plane crash in 1954, Elvis was one of the thousands who attended their funeral. He auditioned for several gospel quartets, but never found a role in any of them -- but all his life, that was the music he wanted to sing, the music he would return to. He'd take any excuse he could to make himself just one of a gospel group, not a solo singer.</p>\n<p>But since he didn't have a group, he was just a solo singer. Just a teenager with a spotty neck. And *that* is the feature that gets mentioned over and over again in the eyewitness descriptions of the young Elvis, when he was starting out. The fact that his neck was always filthy and covered in acne. He had greasy hair, and would never look anyone in the eye but would look down and mumble. What Sam Phillips saw in that teenage boy was a terrible feeling of insecurity.</p>\n<p>It was a feeling he recognised himself -- Phillips had already been hospitalised a couple of times with severe depression and had to have electric shock therapy a few years earlier. But it was also something he recognised from the black musicians he'd been working with. In their cases it was because they'd been crushed by a racist system. In Phillips' case it was because his brain was wired slightly differently from everyone else's. He didn't know quite what it was that made this teenage boy have that attitude, what it was that made him a scared, insecure, outsider. But whatever it was, Elvis Presley was the only white man Sam Phillips had met whose attitudes, bearing, and way of talking reminded him of the great black artists he knew and worked with, like Howlin' Wolf or B.B. King, and he became eager to try him out and see what could happen.</p>\n<p>Phillips decided to put Elvis together with Scotty Moore and Bill Black, the guitarist and bass player from the Starlite Wranglers. Neither was an impressive technical musician – in fact at the time they were considered barely competent – but that was a plus in Phillips' book. These were people who played with feeling, rather than with technique, and who wouldn't try to do anything too flashy and showboaty. And he trusted their instincts, especially Scotty's. He wanted to see what Scotty Moore thought, and so he got Elvis to go and rehearse with the two older musicians.</p>\n<p>Scotty Moore wasn't impressed... or at least, he *thought* he wasn't impressed. But at the same time... there was *something* there. It was worth giving the kid a shot, even though he didn't quite know *why* he thought that.</p>\n<p>So Sam Phillips arranged for a session, recording a ballad, since that was the kind of thing that Elvis had been singing in his auditions.</p>\n<p>The song they thought might be suitable for him turned out not to be, and nor were many other songs they tried, until eventually they hit on \"That's All Right Mama\", a song originally recorded by Arthur \"Big Boy\" Crudup in 1946.</p>\n<p>Arthur Crudup was a country-blues singer, and he was another of those people who did the same kind of record over and over -- he would sing blues songs with the same melody and often including many of the same lyrics, seemingly improvising songs based around floating lyrics. The song \"That's All Right Mama\" was inspired by Blind Lemon Jefferson's classic \"Black Snake Moan\":</p>\n<p>[excerpt: \"Black Snake Moan\", Blind Lemon Jefferson]</p>\n<p>Crudup had first used the line in \"If I Get Lucky\". He then came up with the melody for what became \"That's All Right\", but recorded it with different lyrics as \"Mean Ol' Frisco Blues\":</p>\n<p>[excerpt: \"Mean Old Frisco Blues\", Arthur Crudup]</p>\n<p>Then he wrote the words to \"That's All Right\", and sang them with the chorus of an old Charley Patton song:</p>\n<p>[excerpt: \"Dirt Road Blues\", Arthur Crudup]</p>\n<p>And then he recorded \"That's All Right Mama\" itself:</p>\n<p>[excerpt \"That's All Right Mama\", Arthur Crudup]</p>\n<p>Crudup's records, as you can hear, were all based on a template – and he recorded several more songs with bits of “That's All Right” in, both before and after writing that one. Elvis, Scotty, and Bill, however, didn't follow that template.</p>\n<p>Elvis' version of the song takes the country-blues feel of Crudup and reworks it into hillbilly music -- it's taken at a faster pace, and the sound is full of echo. You have Bill Black's slapback bass instead of the drums on Crudup's version. It still doesn't, frankly, sound at all like the black musicians Phillips was working with, and it sounds a hell of a lot like a lot of white ones. If Phillips was, as the oversimplification would have it, looking for \"a white man who could sing like a black one\", he hadn't found it. Listening now, it's definitely a \"rock and roll\" record, but at the time it would have been thought of as a \"hillbilly\" record.</p>\n<p>[excerpt “That's All Right Mama, Elvis Presley]</p>\n<p>There is, though, an attitude in Presley's singing which is different from most of the country music at the time -- there's a playfulness, an air of irreverence, which is very different from most of what was being recorded at the time. Presley seems to be treating the song as a bit of a joke, and to have an attitude which is closer to jazz-pop singers like Ella Fitzgerald than to blues or country music. He wears the song lightly, unafraid to sound a bit silly if it's what's needed for the record. He jumps around in his register and sings with an assurance that is quite astonishing for someone so young, someone who had basically never performed before, except in his own head.</p>\n<p>The B-side that they chose was a song from a very different genre -- Bill Monroe's bluegrass song \"Blue Moon of Kentucky\":</p>\n<p>[excerpt: Bill Monroe \"Blue Moon of Kentucky\"]</p>\n<p>Elvis, Scotty, and Bill chose to rework that song in much the same style in which they'd reworked \"That's All Right Mama\". There's nothing to these tracks but Elvis' strummed acoustic, Black's clicking slapback bass, and Scotty Moore's rudimentary electric guitar fills -- and the secret weapon, Sam Phillips' echo.</p>\n<p>Phillips had a simple system he'd rigged up himself, and no-one else could figure out how he'd done it. The room he was recording in didn't have a particularly special sound, but when he played back the recordings, there was a ton of echo on them, and it sounded great.</p>\n<p>The way he did this was simple. He didn't use just one tape recorder -- though tape recorders themselves were a newish invention, remember -- he used two. He didn't do multitracking like Les Paul -- rather, what he did was use one tape recorder to record what was happening in the studio, while the other tape recorder *played the sound back for the first recorder to record as well*. This is called slapback echo, and Phillips would use it on everything, but especially on vocals. Nobody knew his secret, and when his artists moved off to other record labels, they often tried to replicate it, with very mixed results.</p>\n<p>But on \"Blue Moon of Kentucky\" it gave the record a totally different sound from Bill Monroe's bluegrass music -- a sound which would become known, later, as rockabilly:</p>\n<p>[excerpt \"Blue Moon of Kentucky\", Elvis Presley]</p>\n<p>Phillips took the record to his friend, the DJ Dewey Phillips, who played it on his R&B show. When Elvis found out that Dewey Phillips was going to be playing his record on the radio, he was so nervous that rather than listen to it, he headed out to the cinema to watch a film so he wouldn't be tempted to turn the radio on. There was such a response to the record, though, that Phillips played the record fourteen times, and Elvis' mother had to go to the cinema and drag him out so he could go on the radio and be interviewed. On his first media interview he came across well, largely because Phillips didn't tell him the mic was on until the interview was over – and Phillips also asked which school Elvis went to, as a way of cluing his listeners into Elvis' race – most people had assumed, since Phillips' show normally only played records by black people, that Elvis was black.</p>\n<p>Elvis Presley had a hit on his hands -- at least as much of a hit as you could get from a country record on a blues label. Sadly, Crudup had sold the rights to the song years earlier, and never saw a penny in royalties – when he later sued over the rights, in the seventies, he was meant to get sixty thousand dollars in back payments, which he never received. I've seen claims, though I don't know how true they are, that Crudup's total pay for the song was fifty dollars and a bottle of whisky.</p>\n<p>But it was at the band's first live performance that something even more astonishing happened, and it happened because of Presley's stagefright, at least as Scotty Moore used to tell the story. Presley was, as we've mentioned, a deeply shy young man with unusual body language, and he was also unusually dressed -- he wore the large, baggy, trousers that black men favoured. And he was someone who moved *a lot* when he was nervous or energetic -- and even when he wasn't, people would talk about how he was always tapping on something or moving in his seat. He was someone who just couldn't keep still.</p>\n<p>And when he got on stage he was so scared he started shaking. And so did his pants. And because his pants were so baggy, they started shaking not in a way that looked like he was scared, but in a way that was, frankly, sexual. And the audiences reacted. A lot.</p>\n<p>Over the next year or two, Presley would rapidly grow utterly confident on stage, and when you look at footage of him from a few years later it's hard to imagine him ever having stage fright at all, with the utter assurance and cocky smile he has. But all his stage presence developed from him noticing the things that the audience reacted to and doing more of them, and the thing they reacted to first and most was his nervous leg-twitching.</p>\n<p>And just like that, the unpopular poor boy with the spotty neck became the biggest male sex symbol the world had ever seen, and we'll be seeing how that changed everything in future episodes.</p>",
  "itunes:subtitle": "Welcome to episode nineteen of A History of Rock Music in Five Hundred Songs. Today were looking at Thats All Right Mama by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nResources\nAs ",
  "itunes:keywords": "Arthur Crudup,Bill Black,Blind Lemon Jefferson,Chess Records,country and western,Dewey Phillips,Dorsey Burnette,Duke Records,Elvis Presley,gospel,Howlin&#039; Wolf,Johnny Burnette,lawsuits,Marion Keisker,Memphis Recording Services,plagiarism,racism,rockabilly,Rufus Thomas,Sam Phillips,Scotty Moore,Sun Records,The Jordanaires,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 19,
  "content:encoded": "<p>Welcome to episode nineteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"That's All Right Mama\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-19-thats-all-right-mama/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p>Elvis' 1950s catalogue is, at least in the UK, now in the public domain, and can thus be found in many forms. <a href=\"https://amzn.to/2DtTafM\">This three-CD box set</a> contains literally every recording he made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.</p>\n<p><a href=\"https://amzn.to/2I6Tx5A\">This ten-disc set,</a> meanwhile, charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles, including all Elvis' five Sun releases in their historical context, as well as \"Bear Cat\" and a <em>lot</em> of great blues and rockabilly.</p>\n<p>And<a href=\"https://amzn.to/2DrYeBu\"> this four-CD box set of Arthur Crudup</a> contains everything you could want by that great bluesman.</p>\n<p>I've relied on three books here more than any others. The first is <a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum.</a> which I've recommended many times before. The other two are by Peter Guralnick -- <a href=\"https://amzn.to/2I0fSSm\">Sam Phillips: The Man Who Invented Rock 'n' Roll</a>, and <a href=\"https://amzn.to/2I6pg78\">Last Train to Memphis</a>. The latter is the first volume of Guralnick's two-volume biography of Elvis. The second volume of that book is merely good, not great (though still better than much of the nonsense written about Elvis), but <em>Last Train to Memphis</em> is, hands down, the best book on Elvis there is. (A content warning for both Guralnick books -- they use racial slurs in reported speech, though never in anything other than a direct quote).</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>Before I start, I just want to emphasise that in this episode I talk about some of Sam Phillips' ideas around race and how to end racism. I hope I make it clear that I disagree with his ideas, but in trying to be fair and present his thinking accurately I may have given a different impression. I'm sure people listening to this in the context of the series as a whole understand where I'm coming from, but I'm aware that this will be some people's first episode. There's a reason this comes after the episode on “Sh'Boom”. If you come out of this episode thinking I think the way to end racism is to have white people perform black people's music, go back and listen to that one. Anyway, on with the show...</p>\n<p>The Starlite Wranglers were not a band you would expect to end up revolutionising music -- and indeed only some of them ever did. But you wouldn't have expected even that from them.</p>\n<p>They were based in Memphis, but they were very far from being the sophisticated, urban music that was otherwise coming from big cities like that. Their bass player, Bill Black, would wear a straw hat and go barefoot, looking something like Huckleberry Finn, even as the rest of the band wore their smart Western suits. He'd hop on the bass and ride it, and tell cornpone jokes.</p>\n<p>They had pedal steel, and violin, and a singer named Doug Poindexter. Their one record on Sun was a pure Hank Williams soundalike:</p>\n<p>[excerpt of \"My Kind of Carrying On\" by Doug Poindexter and the Starlite Wranglers]</p>\n<p>Again, this doesn't sound like anything that might revolutionise music. The single came out and did no better or worse than thousands of other singles by obscure country bands. In most circumstances it would be no more remembered now than, say \"Cause You're Always On My Mind\" by Wiley Barkdull, or \"Twice the Loving\" by Floyd Huffman.</p>\n<p>But then something unprecedented in modern music history happened.</p>\n<p>Sun Records was the second record label Sam Phillips had set up -- the first one had been a very short-lived label called Phillips, which he'd started up with his friend, the DJ Dewey Phillips (who was not related to Sam). After his experiences selling masters to other labels, like Modern and Duke and Chess, had caused him more problems than he'd initially realised, he'd decided that if he wanted to really see the music he loved become as big as he knew it could be, he'd have to run his own label.</p>\n<p>Because Sam Phillips had a mission. He was determined to end racism in the US, and he was convinced he could do so by making white audiences love the music of black people as much as he did. So the success of his new label was a moral imperative, and he wanted to find something that would be as big as \"Rocket 88\", the record he'd leased to Chess. Or maybe even a performer as important as Howlin' Wolf, the man who decades later he would still claim was the greatest artist he'd ever recorded.</p>\n<p>Howlin' Wolf had recorded several singles at Sam's studio before he'd started Sun records, and these singles had been leased to other labels. But like so many of the people he'd recorded, the record labels had decided they could make more money if they cut out the middle-Sam and recorded Wolf themselves. Sam Phillips often claimed later that none of the records Wolf made for Chess without Sam were anything like as good as the music he'd been making at 706 Union Ave; and he may well have been right about that. But still, the fact remained that the Wolf was elsewhere now, and Sam needed someone else as good as that.</p>\n<p>But he had a plan to get attention – make an answer record. This was something that happened a lot in blues and R&B in the fifties -- if someone had a hit with a record, another record would come along, usually by another artist, that made reference to it. We've already seen this with \"Good Rockin' Tonight\", where the original version of that referenced half a dozen other records like \"Caldonia\".</p>\n<p>And Sam Phillips had an idea for an answer song to \"Hound Dog\". There had been several of these, including one from Roy Brown, who wrote “Good Rockin' Tonight” -- \"Mr Hound Dog's in Town\"</p>\n<p>[excerpt: Roy Brown “Mr Hound Dog's In Town”]</p>\n<p>Phillips, though,thought he had a particularly good take. The phrase \"hound dog\", you see, was always used by women, and in Phillips' view it was always used for a gigolo. And the female equivalent of that, in Phillips' telling, was a bear cat. And so Sam Phillips sat down and \"wrote\" \"Bear Cat\".</p>\n<p>Well, he was credited as the writer, anyway. In truth, the melody is identical to that of \"Hound Dog\", and there's not much difference in the lyrics either, but that was the way these answer records always went, in Phillips' experience, and nobody ever kicked up a fuss about it.</p>\n<p>He called up a local Memphis DJ, Rufus Thomas, and asked him to sing on the track, and Thomas said yes, and the song was put out as one of the very first records on Phillips' new record label, Sun.</p>\n<p>[excerpt of \"Bear Cat\" by Rufus Thomas]</p>\n<p>What was surprising was how big a hit it became -- \"Bear Cat\" eventually climbed all the way to number three on the R&B charts, which was a phenomenal success for a totally new label with no track record.</p>\n<p>What was less phenomenal was when Duke Records and their publishing arm came to sue Sam Phillips over the record. It turned out that if you were going to just take credit for someone else's song and not give them any of the money, it was best not to have a massive hit, and be based in the same city as the people whose copyright you were ripping off. Phillips remained bitter to the end of his life about the amount of money he lost on the record.</p>\n<p>But while he'd had a solid hit with \"Bear Cat\", and Joe Hill Louis was making some pretty great blues records, Sam was still not getting to where he wanted to be.</p>\n<p>The problem was the audiences. Sam Phillips knew there was an audience for the kind of music these black men were making, but the white people just wouldn't buy it from a black person. But it was the white audiences that made for proper mainstream success for any musician. White people had more money, and there were more of them.</p>\n<p>Maybe, he started to think, he could find a white person with the same kind of feeling in their music that the black people he was working with had? If he could do that -- if he could get white people to *just listen* to black people's music, *at all*, even if it was sung by a white person, then eventually they'd start listening to it from black people, too, and he could break down the colour barrier.</p>\n<p>(Sam Phillips, it has to be noted, always had big ideas and thought he could persuade the world of the righteousness of his cause if everyone else would *just listen*. A few years later, during the Cuban missile crisis, Phillips decided that since in his mind Castro was one of the good guys -- Phillips was on the left and he knew how bad Batista had been -- he would probably be able to negotiate some sort of settlement if he could just talk to him. So he got on the phone and tried to call Castro -- and he actually did get through to Raul Castro, Fidel's brother, and talk to him for a while. History does not relate if Phillips' intervention is what prevented nuclear war.)</p>\n<p>So Sam Phillips was in the right frame of mind to take advantage when history walked into his studio.</p>\n<p>Elvis Aaron Presley was an unlikely name for a teen idol and star, and Elvis had an unlikely background for one as well. The son of a poor sharecropper from Mississippi who had moved to Memphis as a young man, he was working as a truck driver when he first went into Memphis Recording Service to record himself singing a song for his mother.</p>\n<p>And when Phillips' assistant, Marion Keisker, heard the young man who'd come in to the studio, she thought she'd found just the man Phillips had been looking for – the white man who could sing like a black man.</p>\n<p>Or at least, that's how Keisker told it. Like with so many things in rock music's history, it depends on who you listen to. Sam Phillips always said it had been him, not Keisker, who \"discovered\" Elvis Presley, but the evidence seems to be on Keisker's side. However, even there, it's hard to see from Elvis' original recording -- versions of \"My Happiness\" and \"That's When Your Heartaches Begin\" -- what she saw in him that sounded so black. While the Ink Spots, who recorded the original version of \"That's When Your Heartaches Begin\", were black, they always performed in a very smooth, crooner-esque, style, and that's what Presley did too in his recording. He certainly didn't have any particular blues or R&B feel in his vocal on those recordings.</p>\n<p>[excerpt: \"That's When Your Heartaches Begin\" -- Elvis Presley]</p>\n<p>But Keisker or Phillips heard something in those recordings. More importantly, though, what Sam Phillips saw in him was an attitude. And not the attitude you might expect.</p>\n<p>You see, Elvis Presley was a quiet country boy. He had been bullied at school. He wore strange clothes and kept to himself, only ever really getting close to his mother. He was horribly introverted, and the few friends he did have mostly didn't know about his interests, other than whichever one he shared with them. He mostly liked to listen to music, read comic books, and fantasise about being in a gospel quartet like the Jordanaires, singing harmony with a group like that.</p>\n<p>He'd hang around with some of the other teenagers living in the same housing block -- Johnny and Dorsey Burnette, and a guy called Johnny Black, whose big brother Bill was the bass player with the Starlite Wranglers. They bullied him too, but they sort of allowed him to hang around with them, and they'd all get together and sing, Elvis standing a little off from the rest of them, like he wasn't really part of the group. He'd thought for a while he might become an electrician, but he kept giving himself electric shocks and short-circuiting things -- he said later that he was so clumsy it was a miracle that he didn't cause any fires when he worked on people's wiring.</p>\n<p>He didn't have many friends -- and no close friends at all -- and many of those he did have didn't even know he was interested in music. But he was absorbing music from every direction and every source -- the country groups his mother liked to listen to on the radio like the Louvin Brothers, the gospel quartets who were massive stars among the religious, poor, people in the area, the music he heard at the Pentecostal church he attended (a white Pentecostal church, but still as much of a Holly Roller church as the black ones that SIster Rosetta Tharpe had learned her music from). He'd go down Beale Street, too, and listen to people like B.B. King -- young Elvis bought his clothes from Lansky's on Beale, where the black people bought their clothes, rather than from the places the other white kids got their clothes.</p>\n<p>But he wasn't someone like Johnny Otis who fitted in with the black community, either -- rather, he was someone who didn't fit in anywhere. Someone who had nobody, other than his mother, who he felt really close to. He was weird, and unpopular, and shy, and odd-looking.</p>\n<p>But that feeling of not fitting in anywhere allowed him to pick up on music from everywhere. He didn't own many records, but he *absorbed* songs from the radio. He'd hear something by the Ink Spots or Arthur Crudup once, and sing it perfectly.</p>\n<p>But it was gospel music he wanted to sing -- and specifically what is known euphemistically as \"Southern Gospel\", but which really means \"white Gospel\". And this is an important distinction that needs to be made as we go forward, because gospel music has had a huge influence on rock and roll music, but that influence has almost all come from black gospel, the music invented by Thomas Dorsey and popularised by people like Sister Rosetta Tharpe or Mahalia Jackson. That's a black genre, and a genre which has many prominent women in it -- and it's also a genre which has room for solo stars. When we talk about a gospel influence on Ray Charles or Aretha Franklin or Sam Cooke, that's the gospel music we're talking about.</p>\n<p>That black form of gospel became the primary influence on fifties rhythm and blues vocals, and through that on rock and roll. But there's another gospel music as well -- \"Southern Gospel\" or \"quartet gospel\". That music is -- or at least was at the time we're talking about -- almost exclusively white, and male, and sung by groups. To ears that aren't attuned to it, it can sound a lot like barbershop music. It shares a lot of its repertoire with black gospel, but it's performed in a very, very different style.</p>\n<p>[excerpt: \"Take My Hand, Precious Lord\", the Blackwood Brothers]</p>\n<p>That's the Blackwood Brothers singing, and you can hear how even though that's a Thomas Dorsey song, it sounds totally different from, say, Mahalia Jackson's version.</p>\n<p>The Blackwood Brothers were young Elvis Presley's favourite group, and he was such a fan that when two of the group died in a plane crash in 1954, Elvis was one of the thousands who attended their funeral. He auditioned for several gospel quartets, but never found a role in any of them -- but all his life, that was the music he wanted to sing, the music he would return to. He'd take any excuse he could to make himself just one of a gospel group, not a solo singer.</p>\n<p>But since he didn't have a group, he was just a solo singer. Just a teenager with a spotty neck. And *that* is the feature that gets mentioned over and over again in the eyewitness descriptions of the young Elvis, when he was starting out. The fact that his neck was always filthy and covered in acne. He had greasy hair, and would never look anyone in the eye but would look down and mumble. What Sam Phillips saw in that teenage boy was a terrible feeling of insecurity.</p>\n<p>It was a feeling he recognised himself -- Phillips had already been hospitalised a couple of times with severe depression and had to have electric shock therapy a few years earlier. But it was also something he recognised from the black musicians he'd been working with. In their cases it was because they'd been crushed by a racist system. In Phillips' case it was because his brain was wired slightly differently from everyone else's. He didn't know quite what it was that made this teenage boy have that attitude, what it was that made him a scared, insecure, outsider. But whatever it was, Elvis Presley was the only white man Sam Phillips had met whose attitudes, bearing, and way of talking reminded him of the great black artists he knew and worked with, like Howlin' Wolf or B.B. King, and he became eager to try him out and see what could happen.</p>\n<p>Phillips decided to put Elvis together with Scotty Moore and Bill Black, the guitarist and bass player from the Starlite Wranglers. Neither was an impressive technical musician – in fact at the time they were considered barely competent – but that was a plus in Phillips' book. These were people who played with feeling, rather than with technique, and who wouldn't try to do anything too flashy and showboaty. And he trusted their instincts, especially Scotty's. He wanted to see what Scotty Moore thought, and so he got Elvis to go and rehearse with the two older musicians.</p>\n<p>Scotty Moore wasn't impressed... or at least, he *thought* he wasn't impressed. But at the same time... there was *something* there. It was worth giving the kid a shot, even though he didn't quite know *why* he thought that.</p>\n<p>So Sam Phillips arranged for a session, recording a ballad, since that was the kind of thing that Elvis had been singing in his auditions.</p>\n<p>The song they thought might be suitable for him turned out not to be, and nor were many other songs they tried, until eventually they hit on \"That's All Right Mama\", a song originally recorded by Arthur \"Big Boy\" Crudup in 1946.</p>\n<p>Arthur Crudup was a country-blues singer, and he was another of those people who did the same kind of record over and over -- he would sing blues songs with the same melody and often including many of the same lyrics, seemingly improvising songs based around floating lyrics. The song \"That's All Right Mama\" was inspired by Blind Lemon Jefferson's classic \"Black Snake Moan\":</p>\n<p>[excerpt: \"Black Snake Moan\", Blind Lemon Jefferson]</p>\n<p>Crudup had first used the line in \"If I Get Lucky\". He then came up with the melody for what became \"That's All Right\", but recorded it with different lyrics as \"Mean Ol' Frisco Blues\":</p>\n<p>[excerpt: \"Mean Old Frisco Blues\", Arthur Crudup]</p>\n<p>Then he wrote the words to \"That's All Right\", and sang them with the chorus of an old Charley Patton song:</p>\n<p>[excerpt: \"Dirt Road Blues\", Arthur Crudup]</p>\n<p>And then he recorded \"That's All Right Mama\" itself:</p>\n<p>[excerpt \"That's All Right Mama\", Arthur Crudup]</p>\n<p>Crudup's records, as you can hear, were all based on a template – and he recorded several more songs with bits of “That's All Right” in, both before and after writing that one. Elvis, Scotty, and Bill, however, didn't follow that template.</p>\n<p>Elvis' version of the song takes the country-blues feel of Crudup and reworks it into hillbilly music -- it's taken at a faster pace, and the sound is full of echo. You have Bill Black's slapback bass instead of the drums on Crudup's version. It still doesn't, frankly, sound at all like the black musicians Phillips was working with, and it sounds a hell of a lot like a lot of white ones. If Phillips was, as the oversimplification would have it, looking for \"a white man who could sing like a black one\", he hadn't found it. Listening now, it's definitely a \"rock and roll\" record, but at the time it would have been thought of as a \"hillbilly\" record.</p>\n<p>[excerpt “That's All Right Mama, Elvis Presley]</p>\n<p>There is, though, an attitude in Presley's singing which is different from most of the country music at the time -- there's a playfulness, an air of irreverence, which is very different from most of what was being recorded at the time. Presley seems to be treating the song as a bit of a joke, and to have an attitude which is closer to jazz-pop singers like Ella Fitzgerald than to blues or country music. He wears the song lightly, unafraid to sound a bit silly if it's what's needed for the record. He jumps around in his register and sings with an assurance that is quite astonishing for someone so young, someone who had basically never performed before, except in his own head.</p>\n<p>The B-side that they chose was a song from a very different genre -- Bill Monroe's bluegrass song \"Blue Moon of Kentucky\":</p>\n<p>[excerpt: Bill Monroe \"Blue Moon of Kentucky\"]</p>\n<p>Elvis, Scotty, and Bill chose to rework that song in much the same style in which they'd reworked \"That's All Right Mama\". There's nothing to these tracks but Elvis' strummed acoustic, Black's clicking slapback bass, and Scotty Moore's rudimentary electric guitar fills -- and the secret weapon, Sam Phillips' echo.</p>\n<p>Phillips had a simple system he'd rigged up himself, and no-one else could figure out how he'd done it. The room he was recording in didn't have a particularly special sound, but when he played back the recordings, there was a ton of echo on them, and it sounded great.</p>\n<p>The way he did this was simple. He didn't use just one tape recorder -- though tape recorders themselves were a newish invention, remember -- he used two. He didn't do multitracking like Les Paul -- rather, what he did was use one tape recorder to record what was happening in the studio, while the other tape recorder *played the sound back for the first recorder to record as well*. This is called slapback echo, and Phillips would use it on everything, but especially on vocals. Nobody knew his secret, and when his artists moved off to other record labels, they often tried to replicate it, with very mixed results.</p>\n<p>But on \"Blue Moon of Kentucky\" it gave the record a totally different sound from Bill Monroe's bluegrass music -- a sound which would become known, later, as rockabilly:</p>\n<p>[excerpt \"Blue Moon of Kentucky\", Elvis Presley]</p>\n<p>Phillips took the record to his friend, the DJ Dewey Phillips, who played it on his R&B show. When Elvis found out that Dewey Phillips was going to be playing his record on the radio, he was so nervous that rather than listen to it, he headed out to the cinema to watch a film so he wouldn't be tempted to turn the radio on. There was such a response to the record, though, that Phillips played the record fourteen times, and Elvis' mother had to go to the cinema and drag him out so he could go on the radio and be interviewed. On his first media interview he came across well, largely because Phillips didn't tell him the mic was on until the interview was over – and Phillips also asked which school Elvis went to, as a way of cluing his listeners into Elvis' race – most people had assumed, since Phillips' show normally only played records by black people, that Elvis was black.</p>\n<p>Elvis Presley had a hit on his hands -- at least as much of a hit as you could get from a country record on a blues label. Sadly, Crudup had sold the rights to the song years earlier, and never saw a penny in royalties – when he later sued over the rights, in the seventies, he was meant to get sixty thousand dollars in back payments, which he never received. I've seen claims, though I don't know how true they are, that Crudup's total pay for the song was fifty dollars and a bottle of whisky.</p>\n<p>But it was at the band's first live performance that something even more astonishing happened, and it happened because of Presley's stagefright, at least as Scotty Moore used to tell the story. Presley was, as we've mentioned, a deeply shy young man with unusual body language, and he was also unusually dressed -- he wore the large, baggy, trousers that black men favoured. And he was someone who moved *a lot* when he was nervous or energetic -- and even when he wasn't, people would talk about how he was always tapping on something or moving in his seat. He was someone who just couldn't keep still.</p>\n<p>And when he got on stage he was so scared he started shaking. And so did his pants. And because his pants were so baggy, they started shaking not in a way that looked like he was scared, but in a way that was, frankly, sexual. And the audiences reacted. A lot.</p>\n<p>Over the next year or two, Presley would rapidly grow utterly confident on stage, and when you look at footage of him from a few years later it's hard to imagine him ever having stage fright at all, with the utter assurance and cocky smile he has. But all his stage presence developed from him noticing the things that the audience reacted to and doing more of them, and the thing they reacted to first and most was his nervous leg-twitching.</p>\n<p>And just like that, the unpopular poor boy with the spotty neck became the biggest male sex symbol the world had ever seen, and we'll be seeing how that changed everything in future episodes.</p>",
  "enclosure": "",
  "itunes:summary": "Welcome to episode nineteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"That's All Right Mama\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nElvis' 1950s catalogue is, at least in the UK, now in the public domain, and can thus be found in many forms. This three-CD box set contains literally every recording he made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.\nThis ten-disc set, meanwhile, charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles, including all Elvis' five Sun releases in their historical context, as well as \"Bear Cat\" and a lot of great blues and rockabilly.\nAnd this four-CD box set of Arthur Crudup contains everything you could want by that great bluesman.\nI've relied on three books here more than any others. The first is \"Before Elvis\" by Larry Birnbaum. which I've recommended many times before. The other two are by Peter Guralnick -- Sam Phillips: The Man Who Invented Rock 'n' Roll, and Last Train to Memphis. The latter is the first volume of Guralnick's two-volume biography of Elvis. The second volume of that book is merely good, not great (though still better than much of the nonsense written about Elvis), but Last Train to Memphis is, hands down, the best book on Elvis there is. (A content warning for both Guralnick books -- they use racial slurs in reported speech, though never in anything other than a direct quote).\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nBefore I start, I just want to emphasise that in this episode I talk about some of Sam Phillips' ideas around race and how to end racism. I hope I make it clear that I disagree with his ideas, but in trying to be fair and present his thinking accurately I may have given a different impression. I'm sure people listening to this in the context of the series as a whole understand where I'm coming from, but I'm aware that this will be some people's first episode. There's a reason this comes after the episode on “Sh'Boom”. If you come out of this episode thinking I think the way to end racism is to have white people perform black people's music, go back and listen to that one. Anyway, on with the show...\nThe Starlite Wranglers were not a band you would expect to end up revolutionising music -- and indeed only some of them ever did. But you wouldn't have expected even that from them.\nThey were based in Memphis, but they were very far from being the sophisticated, urban music that was otherwise coming from big cities like that. Their bass player, Bill Black, would wear a straw hat and go barefoot, looking something like Huckleberry Finn, even as the rest of the band wore their smart Western suits. He'd hop on the bass and ride it, and tell cornpone jokes.\nThey had pedal steel, and violin, and a singer named Doug Poindexter. Their one record on Sun was a pure Hank Williams soundalike:\n[excerpt of \"My Kind of Carrying On\" by Doug Poindexter and the Starlite Wranglers]\nAgain, this doesn't sound like anything that might revolutionise music. The single came out and did no better or worse than thousands of other singles by obscure country bands. In most circumstances it would be no more remembered now than, say \"Cause You're Always On My Mind\" by Wiley Barkdull, or \"Twice the Loving\" by Floyd Huffman.\nBut then something unprecedented in modern music history happened.\nSun Records was the second record label Sam Phillips had set up -- the first one had been a very short-lived label called Phillips, which he'd started up with his friend, the DJ Dewey Phillips (who was not related to Sam). After his experiences selling masters to other labels, like Modern and Duke and Chess, had caused him m",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode nineteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"That's All Right Mama\" by Elvis Presley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nElvis' 1950s catalogue is, at least in the UK, now in the public domain, and can thus be found in many forms. This three-CD box set contains literally every recording he made from 1953 through 1955, including live recordings and session outtakes, along with a handsome book.\nThis ten-disc set, meanwhile, charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles, including all Elvis' five Sun releases in their historical context, as well as \"Bear Cat\" and a lot of great blues and rockabilly.\nAnd this four-CD box set of Arthur Crudup contains everything you could want by that great bluesman.\nI've r",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}