{
  "title": "Interview Questions for Data Scientist Positions (Part II)",
  "link": "https://medium.com/rants-on-machine-learning/interview-questions-for-data-scientist-positions-part-ii-ac294c2c7241?source=rss-55388a733bf9------2",
  "guid": "https://medium.com/p/ac294c2c7241",
  "category": [
    "data-science",
    "machine-learning",
    "statistics"
  ],
  "dc:creator": "Ahmed El Deeb",
  "pubDate": "Tue, 30 Jun 2015 19:50:39 GMT",
  "atom:updated": "2015-06-30T19:50:39.662Z",
  "content:encoded": "<p>In a previous <a href=\"https://medium.com/p/interview-questions-for-data-scientist-positions-5ad3c5d5b8bd\">post</a>, I argued for the need of a different kind of interview questions for data science and machine learning engineers. I then listed some questions I thought good for gauging data science knowledge and cleverness. I extend the list here with some more question:</p><p><strong>On some online stores, you notice reviews for multiple-installment novels follow a peculiar trend that goes slightly up for each installment, even though the number of reviews goes down. What do you think is happening here?</strong></p><p>Selection bias. Plain and simple. Mostly those who liked the first installment (or who are hard-core fans of the author) go on to read subsequent installments, and hence are more likely to have a favorable opinion of the book and the writer in general.</p><p><strong>OK, that makes sense. Now what can we do to de-bias these ratings and get a score on which we can compare novels on an equal footing.</strong></p><p>This could be solved by stratified re-sampling, or by creating a new scoring system that combines average rating with number of reviews into a single score.</p><p><strong>You are chief scientist for the air forces in WW II and you are tasked with making air strikes safer for fighter pilots (i.e. you want more of them to come back). You personally inspect damaged planes after coming back from battle (say 70% of the planes make it back on average, and 20% are damaged). You find that bullet damage is distributed in a highly non-uniform way (e.g. way more bullets in the wings region than is merited by their area). What could be the reason for this? What would you do to make planes less prone.</strong></p><p>This actually happened during WW II and the protagonist was Abraham Wald:</p><p><a href=\"https://en.wikipedia.org/wiki/Abraham_Wald\">Abraham Wald - Wikipedia, the free encyclopedia</a></p><p><strong>The </strong><a href=\"https://en.wikipedia.org/wiki/United_States_Chess_Federation\"><strong>United States Chess Federation</strong></a><strong> (USCF) invites you to devise their new ranking system that will replace </strong><a href=\"https://en.wikipedia.org/wiki/Elo_rating_system\"><strong>Elo</strong></a><strong>. You are free to devise enhancements to the current system or propose a completely new ranking algorithm.</strong></p><p>Many possible ways to do this. makes for a good discussion question. Also whether the candidate decides to extend Elo or to start from scratch tells something about her/his character.</p><p><a href=\"https://en.wikipedia.org/wiki/Elo_rating_system\">Elo rating system - Wikipedia</a></p><p><strong>How would you go about building an ensemble of hundreds of highly diverse models? (resulting from different algorithms and different parameters)</strong></p><p>This opens the room for the candidate to show off knowledge about bagging and boosting and the benefits of each, but for that scale of diverse models to be beneficial, stacking is a natural choice. Essential here is the awareness that stacking requires an extra hold-out set, and to show resourcefulness in adapting the stacking scheme if that holdout set is fairly small.</p><p><strong>How would you sample uniformly from a continuous stream of data?</strong></p><p><a href=\"https://en.wikipedia.org/wiki/Reservoir_sampling\">Reservoir Sampling</a>.</p><p><strong>Assume you already have a classification model with great ROC curve, but the model produces arbitrary scores that do not map to probability estimates, how would you go about calibrating the scores into probabilities?</strong></p><p>There are a few <a href=\"https://en.wikipedia.org/wiki/Calibration_(statistics)#In_classification\">methods</a> for doing that. Interesting to see if the candidate understand that the calibration process biases some metrics on the calibration data set.</p><p><a href=\"https://en.wikipedia.org/wiki/Isotonic_regression\">Isotonic regression - Wikipedia, the free encyclopedia</a></p><p><strong>Explain the bootstrap sampling method and when it can be useful.</strong></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=ac294c2c7241\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/rants-on-machine-learning/interview-questions-for-data-scientist-positions-part-ii-ac294c2c7241\">Interview Questions for Data Scientist Positions (Part II)</a> was originally published in <a href=\"https://medium.com/rants-on-machine-learning\">Rants on Machine Learning</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}