{
  "id": "yt:video:pe6WQK12-MA",
  "yt:videoId": "pe6WQK12-MA",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Fallout 76 makes me wish for a nuclear winter",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-20T16:11:06+00:00",
  "updated": "2022-10-23T20:37:14+00:00",
  "media:group": {
    "media:title": "Fallout 76 makes me wish for a nuclear winter",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Tap my link to try the Crucial Scanner AND get 15% off all Crucial products with my code, JAYVEE15! https://www.inflcr.co/SHEPb Thanks Crucial for sponsoring!\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nFallout 76 is a 2018 online action role-playing video game developed by Bethesda Game Studios and published by Bethesda Softworks. It is an installment in the Fallout series and a prequel to previous entries.[b] Fallout 76 is Bethesda Game Studios's first multiplayer game; players explore the open world, which has been torn apart by nuclear war, with others. Bethesda developed the game using a modified version of its Creation Engine, which allowed the accommodation of multiplayer gameplay and a more detailed game world than in previous games.\n\nFallout 76 was released to generally mixed reviews, with criticism for the game's numerous technical issues, overall design, lack of gameplay purpose, and initial absence of human non-playable characters. The game was the subject of several controversies, chiefly with regard to the quality of physical content. A number of Bethesda's responses and attempts to provide ongoing support for Fallout 76 in the months following its launch were met with criticism. The game sold 1.4 million copies by the end of 2018. Wastelanders, an update that reintroduces non-playable characters in the series, launched in April 2020.\n\nFallout 76 is Bethesda Game Studios' first online multiplayer game.[3][4][c] Players may play individually or with a party of up to three others.[6][7] The servers for the game are public dedicated servers, with the player automatically allocated to one of them.[4] While the game was expected to launch with public servers only, executive producer Todd Howard revealed plans for private servers to be introduced some time after the game's launch. These private servers allow players to invite friends and to prevent undesirable aspects of player versus player gameplay such as griefing from affecting an individual player's experience of the game. Howard described the delay as being necessary to allow Bethesda time to assure the stability of public servers.[8] Elements of previous Fallout games are present and are modified to work with the real-time game. The V.A.T.S. system—a mechanic in the series that allows players to target specific locations on an enemy's body to attack, which previously paused the game temporarily—is used in Fallout 76 as a real-time system.[9]\n\nThe game features an open world four times the size of that of Fallout 4.[10] The game world is called \"Appalachia\" and is a representation of West Virginia. It features recreations of real locations in the region, including the West Virginia State Capitol, The Greenbrier, Woodburn Circle, New River Gorge Bridge, and Camden Park.[11][12][13][14] The game features numerous new mutated monsters, several of which—such as the Mothman and the Flatwoods monster—were inspired by West Virginian folklore.[14][15][16]\n\nThe game includes revisions to the SPECIAL progression system. Character attributes fall into one of seven categories: strength, perception, endurance, charisma, intelligence, agility and luck. As the player levels up, they are able to spend skill points to boost their attributes on a scale of one to fifteen. Players are able to choose perks, or passive abilities that offer gameplay bonuses. These perks fall into each of the SPECIAL categories and take the form of trading cards. Each card has a value and the player can adopt perks equal to their respective value; for example, if the player has a strength rating of five, then they may equip strength perks worth five points. The player can merge similar cards together to create more powerful—albeit more expensive—perks. The system is designed to encourage the player to recognise the situation they are in and choose perks that aid them rather than passively selecting them and having them for the duration of the game.[17]\n\n#gaming #jayvee #fallout",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}