{
  "title": "As Ukraine Crisis Simmers, Russian Cossack Movement Tightens Integration With Military Reserves",
  "link": "https://jamestown.org/with-ukraine-crisis-simmering-russian-cossack-movement-tightens-integration-with-military-reserves/",
  "dc:creator": "web1983",
  "pubDate": "Thu, 10 Feb 2022 17:55:58 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=91792",
  "description": "<p>The ataman (head) of the “All-Russian Cossack Society,” Nikolai Doluda, addressed a meeting of the Atamans’ Council, in Krasnodar Krai, on February 4, and instructed those gathered that “the time has come when the Cossacks are once again becoming a stronghold and reliable shield of Russia, a guarantor of unity and protection of its national interests” (Vsko.ru, February 4). The &#8230; <a href=\"https://jamestown.org/with-ukraine-crisis-simmering-russian-cossack-movement-tightens-integration-with-military-reserves/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/with-ukraine-crisis-simmering-russian-cossack-movement-tightens-integration-with-military-reserves/\">As Ukraine Crisis Simmers, Russian Cossack Movement Tightens Integration With Military Reserves</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>The ataman (head) of the “All-Russian Cossack Society,” Nikolai Doluda, addressed a meeting of the Atamans’ Council, in Krasnodar Krai, on February 4, and instructed those gathered that “the time has come when the Cossacks are once again becoming a stronghold and reliable shield of Russia, a guarantor of unity and protection of its national interests” (<a href=\"https://vsko.ru/nikolaj-doluda-prishlo-vremya-vnov-stat-oplotom-i-nadezhnym-shhitom-rossii/\">Vsko.ru</a>, February 4). The words take on a more ominous tone when considered against the background of the current security crisis around Ukraine. Namely, Russia has been massing increasingly large numbers of troops and heavy weaponry along the border with Ukraine for months (see EDM, <a href=\"https://jamestown.org/program/russias-military-exercise-in-belarus-prepares-for-war/\">January 26</a>, <a href=\"https://jamestown.org/program/russia-and-nato-locked-in-high-risk-standoff-in-mediterranean-and-black-seas/\">27</a>, <a href=\"https://jamestown.org/program/kremlin-must-make-final-decision-on-war-soon-as-diplomatic-runway-grows-short/\">February 3</a>, <a href=\"https://jamestown.org/program/moscow-security-experts-say-any-russian-invasion-of-ukraine-will-not-be-a-cake-walk/\">8</a>). Moreover, Doluda’s remarks were pointedly uttered in Krasnodar, a region close to Ukraine (whose Cossack population was, in fact, originally relocated from Ukraine). And finally, Cossacks from Krasnodar were employed by the Kremlin to help seize Crimea back in 2014, and their role in the annexation operation is openly celebrated by Russian Cossack authorities (<a href=\"https://vsko.ru/istoriya-sozdaniya-vsko/\">Vsko.ru</a>, accessed February 10). Considering Russia’s heavy reliance on “hybrid war” tactics, it is thus likely that the “official” (state-supported) Cossack movement will again be used in whatever plans Moscow has in store for its southwestern neighbor (see <a href=\"https://jamestown.org/program/dikoe-pole-cossacks-in-occupied-luhansk-russian-aides-de-guerre/\">EDM</a>, January 31).</p>\n<p>Doluda’s speech last week in Krasnodar continued with the boast that “Russian Cossacks have shown themselves as a strong military community, capable of defending the borders of Russia, strengthening the state from within, and coming to the aid of people during disasters. Cossacks today participate in the protection of state borders and public order, emergency response and environmental protection measures. In Cossack classes and schools, in Cossack cadet corps and universities, a new generation of young citizens is being prepared, for whom patriotism and love for the Fatherland are in their blood. I will do everything to ensure that the Cossacks become powerful, strong, and necessary for our country” (<a href=\"https://vsko.ru/nikolaj-doluda-prishlo-vremya-vnov-stat-oplotom-i-nadezhnym-shhitom-rossii/\">Vsko.ru</a>, February 4).</p>\n<p>A government-organized non-governmental organization (GONGO), Russia’s contemporary state-backed Cossack movement plays the role of a vanguard of popular nationalism. Some of its members’ activities include patrolling the streets of Russian cities and creating “Cossack cadets corps” or youth camps similar to the Young Pioneers of the Communist era.  However, up until the annexation of Crimea, the formal role of Cossacks in Russian defense policy was not overt. But now, the formalization of their role in the military seems to have reached a new phase: in particular, Doluda’s speech references plans to create a reserve army amongst the Krasnodar Cossacks—a continuation of the long process of integrating Cossack volunteers into the Russian Armed Forces (<a href=\"https://jamestown.org/program/putin-expresses-support-for-cossack-battalion-in-russian-national-guard/\">EDM</a>, July 16 2021).</p>\n<p>Three days after Doluda’s remarks, The All-Russian Cossack Society head arrived at the Russian General Staff, and the two sides signed a document describing the specific procedures for the interaction of registered Cossacks with the leadership of military districts and the commissariats of Russian Federal subjects. Doluda himself also signed a contract to become the first Cossack initiate to the Armed Forces reserve under this new system (<a href=\"https://vsko.ru/vserossijskij-ataman-nikolaj-doluda-podpisal-kontrakt-o-prebyvanii-v-mobrezerve/\">Vsko.ru</a>, February 7). The binding of the 69-year-old Doluda to the mobilization reserve is symbolic, but it also means that he will undertake two key tasks.</p>\n<p>First, he will organize the interaction of military Cossack societies (<em>voiska</em>) with the commanders of the troops of military districts and with the Northern Fleet “to attract members of societies as candidates in the mobilized human reserve of the Armed Forces of the Russian Federation.” Second, his office will keep records of Cossacks in the reserve and “carry out activities related to the preparation and commission of conscription and sending members of Cossack <em>voiska</em> to military service.” Such agreements between the registered Cossacks and the Russian state will take their service “to a new level” (<a href=\"https://vsko.ru/vserossijskij-ataman-nikolaj-doluda-podpisal-kontrakt-o-prebyvanii-v-mobrezerve/\">Vsko.ru</a>, February 7).</p>\n<p>Granted, there is sufficient overlap between the work of the Cossack <em>voiska</em> and the Russian state, and so such developments leave some room for ambiguity as to the purpose of those agreements. However, given the simmering situation in eastern Ukraine (see <a href=\"https://jamestown.org/program/dikoe-pole-cossacks-in-occupied-luhansk-russian-aides-de-guerre/\">EDM</a>, January 31) as well as the positioning of Russian combat forces around the theater, Doluda’s speech and subsequent agreement with the General Staff hint at more extensive military planning involving the Cossacks going on under the surface.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/with-ukraine-crisis-simmering-russian-cossack-movement-tightens-integration-with-military-reserves/\">As Ukraine Crisis Simmers, Russian Cossack Movement Tightens Integration With Military Reserves</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}