{
  "title": "Model-Based Imitation Learning for Urban Driving. (arXiv:2210.07729v2 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2210.07729",
  "description": "<p>An accurate model of the environment and the dynamic agents acting in it\noffers great potential for improving motion planning. We present MILE: a\nModel-based Imitation LEarning approach to jointly learn a model of the world\nand a policy for autonomous driving. Our method leverages 3D geometry as an\ninductive bias and learns a highly compact latent space directly from\nhigh-resolution videos of expert demonstrations. Our model is trained on an\noffline corpus of urban driving data, without any online interaction with the\nenvironment. MILE improves upon prior state-of-the-art by 31% in driving score\non the CARLA simulator when deployed in a completely new town and new weather\nconditions. Our model can predict diverse and plausible states and actions,\nthat can be interpretably decoded to bird's-eye view semantic segmentation.\nFurther, we demonstrate that it can execute complex driving manoeuvres from\nplans entirely predicted in imagination. Our approach is the first camera-only\nmethod that models static scene, dynamic scene, and ego-behaviour in an urban\ndriving environment. The code and model weights are available at\nhttps://github.com/wayveai/mile.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Hu_A/0/1/0/all/0/1\">Anthony Hu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Corrado_G/0/1/0/all/0/1\">Gianluca Corrado</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Griffiths_N/0/1/0/all/0/1\">Nicolas Griffiths</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Murez_Z/0/1/0/all/0/1\">Zak Murez</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gurau_C/0/1/0/all/0/1\">Corina Gurau</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yeo_H/0/1/0/all/0/1\">Hudson Yeo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kendall_A/0/1/0/all/0/1\">Alex Kendall</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cipolla_R/0/1/0/all/0/1\">Roberto Cipolla</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shotton_J/0/1/0/all/0/1\">Jamie Shotton</a>"
}