{
  "id": "yt:video:JUJOe2MCJp8",
  "yt:videoId": "JUJOe2MCJp8",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "How One Comment Can Take You Down A Rabbit Hole - The Truth Behind Logan | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-09-09T23:00:01+00:00",
  "updated": "2022-03-06T12:28:30+00:00",
  "media:group": {
    "media:title": "How One Comment Can Take You Down A Rabbit Hole - The Truth Behind Logan | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Right Opinion: How One Comment Can Take You Down A Rabbit Hole - The Truth Behind Logan | TRO\n\n0:00 - Intro\n6:04 - Red Herring\n12:56 - Hackerman\n21:30 - Unprotected\n38:51 - A Crooked System\n47:38 - The Solution\n\nSecurity online, it’s something that a lot of us value as a personal liberty, for our privacy, and our safety. In the last decade, security online has taken multiple steps forward, but as large platforms are taking steps to protect their users, hackers are never too far behind, always looking for methods to stir up trouble, whether that’s attempting to obtain user data, or merely hijack someone’s account for comedic purposes. Plenty of sites have encountered data breaches, it’s an unfortunate hazard that some are clearly ill-prepared for. However, as much as hackers obtaining user data justifiably causes concern on a macro basis, I think people are much more protective over the possession of their personal accounts.\n\nOur personal accounts, regardless of size, or influence, often pertain great personal value to us, as a platform that represents our thoughts, feelings, and even our creative ventures, it’s a piece of us. That sort of thing can definitely be exemplified with one’s YouTube account, now of course many people create YouTube accounts for the mere purposes of commenting, subscribing, and following content, however for many people, a YouTube account allows us to express ourselves, and even if we’re projecting our content towards a large audience, it’s still a product which feels deeply intimate to us, which is why people care about others when they have their channels unnecessarily terminated or restricted. We like to think that all in all, YouTube, in spite of their flaws have a grip on keeping our accounts secure, however, when you look at their track record, this could be called into contention.\n\nOver the last few years, many creators have reported their channels stolen, and subsequently used for less than dignified purposes, in fact, it seems to be an overwhelmingly common occurrence for many users. Now when you have so many channels on a website like YouTube, it seems inevitable that some accounts will be hacked, or stolen, but today we’re looking at an issue that transcends a few occurrences, and outlines a trend which appears pervasive on the platform, and encompassed by one account, which went by the name of Logan.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}