{
  "id": "yt:video:uxPpmE0SX9I",
  "yt:videoId": "uxPpmE0SX9I",
  "yt:channelId": "UCmh7afBz-uWwOSSNTqUBAhg",
  "title": "Inside The $1 Billion Christie's Auction That Could Set A Historic Record | Forbes",
  "link": "",
  "author": {
    "name": "Forbes",
    "uri": "https://www.youtube.com/channel/UCmh7afBz-uWwOSSNTqUBAhg"
  },
  "published": "2022-11-04T15:00:40+00:00",
  "updated": "2022-11-04T20:36:16+00:00",
  "media:group": {
    "media:title": "Inside The $1 Billion Christie's Auction That Could Set A Historic Record | Forbes",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "More than 150 masterpieces owned by the late Microsoft cofounder—including works by Botticelli, Cezanne, Seurat, Monet and Hockney—paint a portrait of the billionaire as a passionate collector. Next week they go on the block at Christie’s and will break a record for the most expensive sale of all time.\n\nIn a crowded Christie’s auction room in May 2018, Mexican artist Diego Rivera’s 1931 painting The Rivals came to the stage. Commissioned by Abby Aldrich Rockefeller and given as a wedding gift to her son, David, and his new wife, Peggy, in 1941, the work was a small part of the largest auction to date, one that eventually set a record with its $835 million total.\n\nWithin a few minutes, The Rivals sold for nearly $9.8 million, a record for a Latin American artist at auction (one eventually shattered by Rivera’s wife, Frida Kahlo, in a $35 million sale in 2021). The new owner, however, a phone bidder, remained a mystery.\n\nFour years later, The Rivals is once again up for sale at Christie’s, alongside more than 150 rare works of art in another groundbreaking auction that sheds light on one of the world’s greatest private collectors: the late Microsoft cofounder—and The Rivals’ mysterious phone bidder—Paul Allen.\n\nRead the full story on Forbes: https://www.forbes.com/sites/isabellord/2022/11/04/inside-paul-allens-billion-dollar-art-auction/?sh=481101c14f99\n\nSubscribe to FORBES: https://www.youtube.com/user/Forbes?sub_confirmation=1\n\nStay Connected\nForbes newsletters: https://newsletters.editorial.forbes.com\nForbes on Facebook: http://fb.com/forbes\nForbes Video on Twitter: http://www.twitter.com/forbes\nForbes Video on Instagram: http://instagram.com/forbes\nMore From Forbes:  http://forbes.com\n\nForbes covers the intersection of entrepreneurship, wealth, technology, business and lifestyle with a focus on people and success.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}