{
  "title": "EPISODE 22 The Conquest of Mexico (Part 3): Tenochtitlan Syndrome",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 21 Jul 2017 15:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2017/7/21/episode-22-the-conquest-of-mexico-part-3-tenochtitlan-syndrome",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5971e9f1d2b857a4f978d28b",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1500638133039-EQHISVSLSPOUMNE0VL7Z/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5971ebae414fb5d02bd418f1\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1500638133039-EQHISVSLSPOUMNE0VL7Z/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“And when we saw all those cities and villages built in the water, and other great towns on dry land, and that straight and level causeway leading to Mexico, we were astounded. These great towns and cues and buildings rising from the water, all made of stone, seemed like an enchanted vision from the tale of Amadis. Indeed, some of our soldiers asked whether it was not all a dream. It is not surprising therefore that I should write in this vein. It was all so wonderful that I do not know how to describe the first glimpse of things never heard of, seen or dreamed of before… But today all that I then saw is overthrown and destroyed; nothing is left standing.” —&nbsp;</em>Bernal Diaz</p><p class=\"\"><em>“Have confidence, Montezuma. Fear nothing. We love you greatly.” —</em> Hernan Cortes</p><p class=\"\"><em>“What is the use of all these words? Either we take him or we knife him.”</em>&nbsp;— Juan Velazquez de Leon</p><p class=\"\"><em>“They ran in among the dancers, forcing their way to the place where the drums were played. They attacked the man who was drumming and cut off his arms… Some attempted to run away, but their intestines dragged as they ran; they seemed to tangle their feet in their own entrails… So great was the bloodshed that blood ran through the courtyard like water in a heavy rain.”</em></p><p class=\"\">In the 1500s, two highly militaristic peoples fueled by religious ideologies requiring bloodshed clashed with one another. This is the tale of what happened when a band of Spaniards run into the Mexica (Aztec) empire. By the time the dust will settle, out of the 25 million indigenous inhabitants of Mexico, little over a million will be left standing. &nbsp;</p><p class=\"\">In this third episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">The massacre at Cholula</p></li><li><p class=\"\">The drunken man’s vision</p></li><li><p class=\"\">The splendor of Tenochtitlan</p></li><li><p class=\"\">Kidnapping an emperor</p></li><li><p class=\"\">Burning people at the stake in front of the Great Pyramid</p></li><li><p class=\"\">Why the Stockholm Syndrome should be renamed Tenochtitlan Syndrome</p></li><li><p class=\"\">A battle between Spaniards and Spaniards</p></li><li><p class=\"\">Alvarado’s bloody choices</p></li><li><p class=\"\">La Noche Triste: the end of the Spaniards?</p></li></ul><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get your first three meals free—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">This episode is also brought to you by Skillshare, an online learning community with over fifteen thousand classes in design, business, and more. Skillshare is giving my listeners a month of unlimited access -- absolutely FREE! Go to <a href=\"http://www.skillshare.com/history\" target=\"_blank\">www.skillshare.com/history</a> to redeem your free month.&nbsp;</p><p class=\"\">Thank you to Geek Nation Tours, a vacation company which creates tours focusing on geek culture including conventions, movie locations and historical battlefields.<br>This October, they will be time-traveling to Feudal Japan and the battlefields of Sekigahara…. Join them as they watch Kendo, Kyudo, Iaido, and sword making demonstrations at the Seki Cutlery Festival, visit the most famous Japanese medieval castles, hike through spectacular natural landscapes and of course visit the Sekigahara re-enactment festival where you will see samurai walking the streets in full armor and battling in a commemoration of that singular battle of 1600.</p><p class=\"\"><a href=\"http://geeknationtours.com/tours_post/signature-battlefield-series-feudal-japan-and-the-battlefields-of-sekigahara-2017/\">http://geeknationtours.com/tours_post/signature-battlefield-series-feudal-japan-and-the-battlefields-of-sekigahara-2017/</a></p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a> and use the code “daniele” at checkout for a discount.&nbsp;</p><p class=\"\">Please check out <a href=\"http://www.alphadynamicshealth.com\">www.alphadynamicshealth.com</a> for their line of medicinal mushrooms</p><p class=\"\">Master podcaster Darryl Cooper has created a companion series to go with this particular History on Fire series. Check out his episodes exploring themes of human sacrifice, religion, psychology and much more at <a href=\"http://www.martyrmade.com/\">http://www.martyrmade.com/</a>&nbsp;</p><p class=\"\"><br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:30:16",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 22,
  "itunes:title": "EPISODE 22 The Conquest of Mexico (Part 3): Tenochtitlan Syndrome",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 22 The Conquest of Mexico (Part 3): Tenochtitlan Syndrome"
  }
}