{
  "title": "551: The Importance of Black Representation in Harry Potter (feat. Adriana Redding)",
  "link": "https://audioboom.com/posts/8035435",
  "itunes:episode": 551,
  "itunes:title": "The Importance of Black Representation in Harry Potter (feat. Adriana Redding)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4264,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week we're talking about black characters as well as people of color in the core <em>Harry Potter</em> books, the movie adaptations of those books, and the media that has come out since! Joining us as our honored guest is the amazing <a href=\"https://instagram.com/bibbidibobbidi_broke/?hl=en\">Adriana Redding</a>, who led Hufflepuff Team to victory on <em>Harry Potter: Tournament of Houses</em>! Together she, Andrew, Eric and Laura discuss the reasons why black characters are so few and far between, and what their diversity hopes are for future releases set in the Wizarding World.<br>\n<br>\n\n</div>\n<ul>\n<li>Our guest <a href=\"https://instagram.com/bibbidibobbidi_broke/?hl=en\">Adriana Redding</a> talks about her time on <a href=\"https://www.hbomax.com/series/urn:hbo:series:GYZ9MrgqYWBq0wwEAAAAF\"><em>Harry Potter: Tournament of Houses</em></a> as well as black representation in the Harry Potter series!</li>\n<li>Adriana recounts how she got into <em>Harry Potter</em> a bit later than others, and how this affected her take on diversity in the series.</li>\n<li>The hosts discuss the importance of seeing somebody like yourself in the stories you consume.</li>\n<li>Was the statistical diversity of England and Wales in the 1990's a factor in the lack of black and POC characters in <em>Harry Potter</em>? We explain why this excuse doesn't hold water.</li>\n<li>Dean Thomas' backstory was omitted by the author in favor of Neville's, but old writing exists describing what it would have been. We analyze it.</li>\n<li>Did you know two black actresses played Lavender Brown in COS and POA? The third actress to play her was white... and she's the one who had lines and got to date Ron in Movie 6.</li>\n<li>We discuss the gradual increase in diversity since the films wrapped up, including a black MACUSA President, Hermione in <em>The Cursed Child</em>, and more.</li>\n<li>Adriana details a recent trip to the Wizarding World theme park, and asks the hosts what their ideal hope is for future installments of <em>Potter</em>.</li>\n<li>Eric can't resist the urge to quiz Adriana on last week's Quizzitch Question, on the spot, and she does pretty well!</li>\n<li>Quizzitch: How many Quidditch matches does Lee Jordan commentate that Harry participates in, in the books?  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is sponsored by AMC Shudder (Go to <a href=\"http://www.Shudder.com\">Shudder.com</a> and use code 'mugglecast' for 30 days free!) and Indeed (Go to <a href=\"http://www.Indeed.com/mugglecast\">Indeed.com/mugglecast</a> to claim your $75 credit before March 31st).</li>\n</ul>\n",
  "pubDate": "Tue, 22 Feb 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-02-21:/posts/8035435",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}