{
  "title": "Using Granger Causality to Determine Whether Twitter Sentiment Predicts Bitcoin Price Movement",
  "link": "https://lazyprogrammer.me/using-granger-causality-to-determine-whether-twitter-sentiment-predicts-bitcoin-price-movement/",
  "comments": "https://lazyprogrammer.me/using-granger-causality-to-determine-whether-twitter-sentiment-predicts-bitcoin-price-movement/#respond",
  "dc:creator": "admin",
  "pubDate": "Tue, 22 Feb 2022 06:45:41 +0000",
  "category": [
    "financial engineering",
    "natural language processing (NLP)",
    "time series"
  ],
  "guid": "https://lazyprogrammer.me/?p=2579",
  "description": "<p>In this article, we are again going to combine my current favorite subjects: natural language processing, time series analysis, and financial analysis. Recently, I created a couple lectures covering Granger causality, so this topic is fresh on my mind. In short, Granger causality is used to determine whether one time series can be used to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://lazyprogrammer.me/using-granger-causality-to-determine-whether-twitter-sentiment-predicts-bitcoin-price-movement/\">Using Granger Causality to Determine Whether Twitter Sentiment Predicts Bitcoin Price Movement</a> appeared first on <a rel=\"nofollow\" href=\"https://lazyprogrammer.me\">Lazy Programmer</a>.</p>\n",
  "content:encoded": "<p>In this article, we are again going to combine my current favorite subjects: natural language processing, time series analysis, and financial analysis.</p>\n<p>Recently, I created a couple lectures covering Granger causality, so this topic is fresh on my mind.</p>\n<p>In short, Granger causality is used to determine whether one time series can be used to forecast another (i.e. predict the future).</p>\n<p>In these lectures, I demonstrated that some economics variables are Granger causal (in particular, GDP and term spread).</p>\n<p>Of course, another easy application is to determine whether or not Twitter sentiment can predict cryptocurrency movements.</p>\n<p>This post is based on this short publication: &#8220;Does Twitter Predict Bitcoin?&#8221; by Shen, D., Urquhart, A. and Wang, P. (2019) and can be found at https://centaur.reading.ac.uk/80420/1/Twitter.Bitcoin.pdf</p>\n<p><img loading=\"lazy\" class=\"aligncenter \" src=\"https://i.imgur.com/ZO4aKyD.png\" width=\"517\" height=\"265\" /></p>\n<p>The premise is quite simple and you really have to just understand these 3 components in order to implement this yourself:</p>\n<p>1) How to get a Twitter sentiment time series</p>\n<p>2) How to get Bitcoin price time series</p>\n<p>3) How to implement the Granger causality test</p>\n<p>If you can do 1-3, you can predict Bitcoin! (at least, partially)</p>\n<p>So let&#8217;s go over each of these 3 topics in order.</p>\n<p>&nbsp;</p>\n<h3>How to get a Twitter sentiment time series</h3>\n<p>This is going to probably be the most difficult part for most students. Most students are used to downloading a CSV dataset that I typically make very nice and simple for my courses.</p>\n<p>Unfortunately, real life is not like this.</p>\n<p>This becomes a data engineering problem.</p>\n<p>Which tweets by which authors do you choose?</p>\n<p>How do you use Twitter&#8217;s API to download the tweets?</p>\n<p>Where do you store the tweets?</p>\n<p>Once you&#8217;ve figured that out, you need to convert the tweets into a number (sentiment) such that the numbers collectively form a time series.</p>\n<p>That part is not so hard.</p>\n<p>I&#8217;ve demonstrated several methods of doing this, such as:</p>\n<p>a) training your own model on sentiment data (you could even create your own dataset)</p>\n<p>b) using a pretrained Transformer model</p>\n<p>&nbsp;</p>\n<h3>How to get Bitcoin price time series</h3>\n<p>In contrast to the first task, this is probably the easiest.</p>\n<p>In the past, I&#8217;ve demonstrated how you can easily get minute, daily, monthly, etc. data for essentially any ticker using the yfinance Python package.</p>\n<p><script src=\"https://gist.github.com/lazyprogrammer/efd8efecd9e65bf2af567b4f0f1f6c9a.js\"></script></p>\n<p>&nbsp;</p>\n<h3>How to implement the Granger causality test</h3>\n<p>For those of you who haven&#8217;t learned Time Series Analysis with me in the past, you perhaps have never heard of Granger causality.</p>\n<p>In short, we build a multivariate autoregressive time series model called a VAR model.</p>\n<p>It takes the form of:</p>\n<p>$$y(t) = \\sum_{\\tau=1}^L A_\\tau y(t-\\tau) + \\varepsilon(t)$$</p>\n<p>Essentially, if you find any component \\( A_\\tau(j,i) \\) is &#8220;big enough&#8221; (in magnitude), then you can conclude that \\( y_i(t) \\) Granger causes \\( y_j(t) \\).</p>\n<p>As in regression analysis, one decides whether these model coefficients are statistically significant by using hypothesis testing.</p>\n<p>It&#8217;s important to note that Granger causality is not &#8220;true&#8221; causality as one usually thinks of it (e.g. eating food <em>causes</em> me to be satiated). Granger causal simply means that one time series is useful in forecasting another (hence the cross-coefficients being non-zero).</p>\n<p>Luckily, the Granger causality test is very easy to use in Python with the statsmodels package.</p>\n<p>Suppose you have your 2 time series (BTC returns and Twitter sentiment) in a 2-column dataframe (sidenote: your time series should be <strong>stationary</strong> so you should use returns and not prices).</p>\n<p>Then you simply call the statsmodels function:</p>\n<p><script src=\"https://gist.github.com/lazyprogrammer/5f5106679ed3271cfc76d398aa2679cb.js\"></script></p>\n<p>This will output p-values for every lag so you can see whether or not the sentiment at that particular lag affects the BTC return.</p>\n<p>Final note: unfortunately, the paper only shows that Twitter sentiment Granger causes some function of the squared return. This means we lose information about whether the return is actually going up or down!</p>\n\n<div class=\"twitter-share\"><a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Flazyprogrammer.me%2Fusing-granger-causality-to-determine-whether-twitter-sentiment-predicts-bitcoin-price-movement%2F&#038;via=lazy_scientist\" class=\"twitter-share-button\" data-size=\"large\">Tweet</a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://lazyprogrammer.me/using-granger-causality-to-determine-whether-twitter-sentiment-predicts-bitcoin-price-movement/\">Using Granger Causality to Determine Whether Twitter Sentiment Predicts Bitcoin Price Movement</a> appeared first on <a rel=\"nofollow\" href=\"https://lazyprogrammer.me\">Lazy Programmer</a>.</p>\n",
  "wfw:commentRss": "https://lazyprogrammer.me/using-granger-causality-to-determine-whether-twitter-sentiment-predicts-bitcoin-price-movement/feed/",
  "slash:comments": 0
}