{
  "id": "yt:video:zmMbfUM1qbo",
  "yt:videoId": "zmMbfUM1qbo",
  "yt:channelId": "UCweDKPSF65wRw5VHFUJYiow",
  "title": "The Ruined World of 'Barren'",
  "link": "",
  "author": {
    "name": "Curious Archive",
    "uri": "https://www.youtube.com/channel/UCweDKPSF65wRw5VHFUJYiow"
  },
  "published": "2022-08-19T19:25:35+00:00",
  "updated": "2022-09-08T14:03:05+00:00",
  "media:group": {
    "media:title": "The Ruined World of 'Barren'",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Imagine a future where humanity must survive alongside mutated horrors. An exploration of Keegan Francis’s dark post-apocalyptic worldbuilding project ‘Barren.’ \n---\nSupport Barren on Patreon: https://www.patreon.com/kfrancisart\nArtist Social Media: https://linktr.ee/kfrancis.art\n\n‘Barren,’ a post-apocalyptic worldbuilding project by Keegan Francis, imagines an alternate history where civilization ended in nuclear conflict, and mutated animal life rapidly evolves to rule over the irradiated wastes left behind.\n\nA retro-future that calls to mind the worldbuilding of the Fallout series, the project reveals a world where human survivors must contend with biological horrors created by their own folly. So, for this entry into the archive, we’ll travel across the wastes, creating a ‘survival guide’ of sorts to the creatures that roam this desolate world. \n\nNow, let’s cross into an alternate timeline, and witness the broken world of Barren…\n\n0:00 World of Barren\n1:47 Mutant Biology\n3:32 The Bulwark\n4:43 The Bonehen\n5:55 The Zadger\n7:12 The Nukula\n8:58 The Dillo-Pig\n10:09 The Goldwing\n11:13 The Rotfowl\n12:28 Biophage\n13:31 “Ankle Biters”\n14:22 The Vespore\n15:28 Not All is Lost…\n\nCopyright Disclaimer: Under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. All video/image content is edited under fair use rights for reasons of commentary.\n\nI do not own the images, music, or footage used in this video. All rights and credit goes to the original owners.\n\n♫ Music by Kevin MacLeod (incompetech.com): \nBeauty Flow, Unseen Horrors, Majestic Hills, Bittersweet, Floating Cities\nLicensed under Creative Commons: By Attribution 3.0\nhttp://creativecommons.org/licenses/by/3.0/  \n\n#CuriousArchive #Worldbuilding #Barren",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}