{
  "title": "The Basic Income Guarantee, Freedom, and the Welfare State with Otto Lehto",
  "pubDate": "Fri, 09 Dec 2016 21:55:01 +0000",
  "guid": "b886b60970214e9e05138b470433e1e1",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP38Lehto_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with Otto Lehto.</p> <hr /> <p><strong>Petersen:</strong> You're listening to Economics Detective Radio. My guest today is Otto Lehto of King's College London. He is formerly the chair of Finland's Basic Income Network. Otto, welcome to Economics Detective Radio.</p> <p><strong>Lehto:</strong> Oh it's my pleasure to be here.</p> <p><strong>Petersen:</strong> So our topic for today is the basic income guarantee. Otto, you approach this idea from the perspective of political philosophy, so let's start by discussing that. How about we start by talking about two of the major figures in political philosophy: John Rawls and Robert Nozick. What do each of them have to say about the welfare state and where do your views diverge from theirs?</p> <p><strong>Lehto:</strong> That is a good point to start indeed, although it is I think a bit lamentable that we have to start from those two figures because they have dominated the discussion so much during the last 50 years. In fact, it's very hard to have a conversation outside the boundaries set by those two figures, but they're both geniuses. They set the stage for the discussion, certainly in philosophy but also in public policy in many respects.</p> <div style=\"float: right; margin-left: 10px;\"><a href= \"https://www.amazon.com/Theory-Justice-Original-Oxford-Paperbacks/dp/0674017722/ref=as_li_ss_il?ie=UTF8&qid=1481319288&sr=8-1&keywords=rawls&linkCode=li2&tag=economicsde0f-20&linkId=1c45e258f8b09dc5cb229cf0826dc31b\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0674017722&Format=_SL160_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li2&o=1&a=0674017722\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>So, let's start with John Rawls. John Rawls really was a towering figure in Harvard, really starting from the 60's and throughout the 70's. He wrote this book, <a href= \"http://amzn.to/2hfTCms\" target=\"_blank\">A Theory of Justice</a>, which is considered one of the really truly great books in political philosophy that revolutionized the way we think about these subjects. But the short version of his theory, which is very influential even up to this day, is that people in societies should look at the framework of living with each other as a cooperative game where we all try to sort of not only maximize our own position but also to make the whole game fair for everybody. And so he called his theory <a href=\"http://amzn.to/2gKdNIj\" target= \"_blank\">Justice as Fairness,</a> where people are entitled to a certain respect and autonomy, certain liberties as members of the democratic community where they can pursue their own ends. But they're also entitled to a redistributive scheme if they happen to be among the worst-off people in the society. They are entitled to redistributive transfers.</p> <p>This framework sounds very familiar and indeed it should because it reflects the social democratic reality in which most Western societies operate. And even in later years he said that actually his philosophy, even though it starts from first principles and proceeds from there, is actually meant to be a philosophical justification of the intuitions that people in Western democracies---liberal democracies---have.</p> <p>So, you combine liberal ideas of individual freedom with these notions of the welfare state and so on. So that was the foundation of Rawls' system.</p> <div style=\"float: right; margin-left: 10px;\"><a href= \"https://www.amazon.com/Anarchy-State-Utopia-Robert-Nozick/dp/0465051006/ref=as_li_ss_il?ie=UTF8&qid=1481319605&sr=8-1&keywords=anarchy+state+and+utopia&linkCode=li3&tag=economicsde0f-20&linkId=9faafdff539361213544482b4df544d7\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0465051006&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li3&o=1&a=0465051006\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>So that's Rawls' system but Nozick came along and he found a place for himself in the same institution, that is Harvard, and he wrote a critique---a respectful critique---but a very thorough and deep critique of Rawls' theory. And he ended up justifying a minimal state that libertarians are very fond of. And he effectively said that no, people should just be seen as individuals who have some fundamental rights---he calls them side constrains---that people have a certain respect that they are owed by other people and it is very wrong for people to violate their personal boundaries and this includes the State.</p> <p>The state has actually no right to violate the sort of inviolable right to property rights that individuals have. So every form of taxation, that features very prominently even in Rawls' system, is theft. So, that is of course a very prominent theme in libertarianism. So his book---which by the way is really brilliant philosophically, it's not only just a standard justification of libertarianism but it's actually one of the great books in philosophy because it's so rich and powerful and full of interesting ideas and strange examples and brilliant footnotes and all that---but that lay down the other side. And so the debate in intellectual philosophy and history in the last 50 years or so has been largely dominated by these two figures: Rawls' <a href= \"http://amzn.to/2gjUK6w\" target=\"_blank\">Theory of Justice</a> on the one hand, a justification of social democracy with a liberal bent, and then on the other hand Nozick's <a href= \"http://amzn.to/2gm2Q3m\" target=\"_blank\">Anarchy, State and Utopia</a>, which is a justification of libertarian taxation-is-theft ideology. So that is the framework in which we find ourselves.</p> <p><strong>Petersen:</strong> So there are these two competing extremes. You quote John Tomasi's critique of both of them. Would you like to summarize that for me?</p> <div style=\"float: right; margin-left: 10px;\"><a href= \"https://www.amazon.com/Free-Market-Fairness-John-Tomasi/dp/0691158142/ref=as_li_ss_il?ie=UTF8&qid=1481319668&sr=8-2&keywords=tomasi&linkCode=li3&tag=economicsde0f-20&linkId=7e12737281b3c4f33f4d68c0d20303a9\" target=\"_blank\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0691158142&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20\" alt=\"\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&l=li3&o=1&a=0691158142\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p><strong>Lehto:</strong> Yes. John Tomasi wrote a wonderful book in 2012 called <a href=\"http://amzn.to/2gtObBw\" target= \"_blank\">Free Market Fairness</a> where he actually tries to combine these two perspectives. And he says that actually there's a whole tradition that we're forgetting here when we focus only on these two---as you put it, they are both at extremes---although at least for Rawls himself, he's often considered a centrist. But in many ways, he represents this kind of---from a perspective that Tomasi points out---the perspective of classical liberalism even though the Rawlsian center-left position, he's actually seen going fundamentally wrong in many ways, even though that is the unquestionable framework in which people today operate.</p> <p>And I should say, when I say that Rawls and Nozick laid a framework, it's not as if there is 50% on one side and 50% on the other side. Perhaps in politics, like the left-wing and right-wing ideologies have maybe about 50% on each side depending on the circumstances. But in philosophy certainly, Rawls has been the one that dominated the discussion and there are actually very few Nozickians around.</p> <p>But Tomasi points out that even with this seemingly very credible and too wonderful system that Rawls lays out, there is very little attention paid to issues like individual freedom especially in the domain of economy. And the lack of respect for people's freedom of choices in economic matters is actually a major shortcoming in Rawls' system. And this is exactly what Tomasi points out and from the perspective of classical liberalism which he raises to the standard of something that we should actually take more seriously than we have today. He points out that actually economic liberty is something we should insert back into the conversation in a serious way without however on the other side falling down the assumption that Nozick makes---and a lot of libertarians make---that the only justification for all economic liberty necessarily leads to a justification for the night watchman state or the minimal state of libertarianism where there is no role for government to provide public services and all that.</p> <p>And so this false dichotomy that Rawls and Nozick have put out has sort of made it difficult for people like myself and Tomasi and <a href=\"http://sites.sandiego.edu/mzwolinski/\" target= \"_blank\">Matt Zwolinsky</a> and people who consider themselves followers of the legacy of classical liberalism to lay out the more complicated, but I think more interesting, case for a system where robust economic liberties are combined with certain welfare state elements. Certain elements of taking seriously the power of the state to actually increase the real opportunities of people rather than just being a system of theft as Nozick calls it.</p> <p><strong>Petersen:</strong> So that's where something like the basic income guarantee comes in. Can you summarize what that is and how is that different from the welfare states most countries currently have?</p> <p><strong>Lehto:</strong> Right. Basic income guarantee, first of all, is defined as a regular payment to all citizens or residents of a political community that is given uniformly to all citizens. All people get the same amount and people get it without bureaucratic discretion. So it is given automatically or almost automatically to all people either in the form of a direct cash transfer to their bank account or in the form of a tax break system as in the form of negative income tax which is actually a form of basic income.</p> <p>So this system is supposed to, and it is a way, to replace the bureaucratic complexity and the nightmarish disrespect for human autonomy and human freedom that lies in the center of the current welfare state system in my opinion and certainly in the opinion of Tomasi and other people who I'm referring to. So the basic income guarantee is superior to the current system and it differs from the current system in the sense that it actually operates under the principle that we shouldn't use the state to guarantee specific favors to specific people, we shouldn't use the state as a one-upmanship mechanism whereby one group of recipients carries for the favor of bureaucracies, tries to---and in a way infiltrate---the mechanisms of the state to redistribute money and resources to themselves or to groups that they favor against the interests and desires of other groups because this leads to a spiral of negative-sum game in the political economy. And I think welfare states today in this sense have become victim to this overzealous one-upmanship of special interest group politics and basic income is a way to overcome this problem.</p> <p><strong>Petersen:</strong> So the basic income guarantee, is it really a break from business as usual? It seems like it's a marginal improvement on the system we have now, but I guess you're suggesting that the system we have now encourages a lot of rent seeking, it has a lot of payments to different groups, it's needlessly complex. I could list some other problems with it. There are the so-called welfare cliffs where poor people face implicit marginal tax rates sometimes of a thousand percent, or some absurdly high amount because their benefits are clawed back when they earn a little more income. So there seems like there's a good economic justification for basic income. Is your work focused on the classical liberal philosophical justification for having a hands-off welfare state?</p> <p><strong>Lehto:</strong> Yes, in a way. The fundamental debate is truly between these two perspectives of whether it's a pragmatic justification for reform towards a slightly saner and slightly more useful and purposeful and beneficial system, or on the other hand, is it a requirement of justice that we have something like a basic income guarantee. And I think that really the truth is somewhere in between.</p> <p>First of all, I think it certainly is a pragmatic improvement over the current system but I should point out already at this point that when I'm advocating for basic income I'm not advocating for basic income without demanding widespread reforms in other areas of life in the welfare state. I am indeed calling for massive restructuring of many of the mechanisms of the welfare state partially just to accommodate for the fact that we are taking basic income as the policy paradigm that we're trying to implement. Because if we take that as the policy paradigm, then we necessarily must reform the existing bureaucracies, tax system just to accommodate for the fact that we are taking this new system into effect.</p> <p>In addition to this, I think that the whole framework of regulations, the whole framework of massive interventions into the economy, into the private life of citizens have to be addressed as serious violations of the capacity of the welfare state to truly increase the welfare of its people. Because my opinion is that the welfare state has failed because it has failed to address the proper means to achieve its own ends that it claims to have. Use of improper means to achieve its ends is the reason why the welfare state is failing so miserably everywhere in the world today. That it's claiming to be for the welfare of its citizens, but if you look at it in terms of its overall effect in many ways it fails.</p> <p><strong>Petersen:</strong> So, when I think of the policies that I'd like to see replaced by a basic income guarantee they're not just strictly welfare transfers. There's a theorem in economics called the Atkinson-Stiglitz theorem. It says that when you have an optimally designed progressive income tax scheme, basic income with a progressive income tax would be something like that, then it doesn't make sense to have additional programs designed to redistribute. And some of the programs that I think are basically focused on redistribution are things like protecting taxi drivers from competition from companies like Uber and Lyft, or a lot of the interventions into medicine are designed to make sure that people who get sick don't also become poor. And of course, if you had something like a basic income, every taxi driver could lose his job, he wouldn't fall below that minimum level. And so could at least in principle---if we were going to make sort of an ideal political bargain---a basic income guarantee would come with a lot of free market reforms ideally. Is that basically a big part of the reason why so many libertarians---such as Milton Friedman and Friedrich Hayek---have supported versions of a basic income?</p> <p><strong>Lehto:</strong> Well yes indeed, it has the feature of being compatible with a total abolition of the rest of the welfare state, or major portions of the welfare state. And in fact people like <a href=\"http://amzn.to/2gjRfwI\" target=\"_blank\">Charles Murray</a> have recently proposed exactly that, a replacement of the welfare state by the means of a basic income given to all citizens as the second-best option to a complete free-market society. And people like Hayek and Friedman were also of the opinion that the majority of those transfers could be replaced.</p> <p>So the thing with money is that money is a universal means of exchange and the uses of money and the need for money are as varied as people and situations. And when we think of basic income we don't think of it in terms of being for a particular purpose or for particular people or for particular circumstances unlike the current measures. And so it has the virtue---and perhaps the vice depending on your point of view---of being this universal situation, a neutral ground. And so indeed we can come up with hundreds of scenarios where a basic income could be useful for people. Obviously, some of those are covered by the current redistributive schemes within which by the way I would include things like farm subsidies, many forms of corporate welfare and so on.</p> <p>So basic income has the virtue and vice of being neutral as regards purposes and situations. The only thing really is that if you don't have any other sources of income then you will get a basic income without having to beg for it from anybody either in the government or in the world of charity for example. So, yes indeed, people who are forced out of work to circumstances---whatever those circumstances happen to be---are able to survive, the people who are forced out of the labor market entirely for a reason---one reason or another---people who have temporary or permanent conditions that affect their capacity to find work will be covered up to this level, and people who perhaps want to take some time off to take care of their family, people who want to take some time off to study, to plan ahead, to perhaps think about starting a new company, they have some ideas but they don't have the means of funding yet, that allows people to focus on doing what they think is best for them at the moment. So it has almost an infinity of purposes precisely because there is an infinity of human beings and human desires that in a pure realistic society will have to be taken into account. And a welfare state that tries to measure what people truly need, or what circumstances need to be taken care of, fails precisely because it can never count the infinity of the variety of ways in which people end up in need of money in society.</p> <p><strong>Petersen:</strong> So before this welfare state that we currently have---the welfare state as it currently exists largely is a creation of the 20th century. But in the 19th century and early 20th century a lot of what you had was mutual aid societies and things like that. And I think a hard core maybe a Rothbardian libertarian who maybe still cares a lot about the poorest among us might say, why have a basic income? If we just had nothing there would still be the civil society and we could create something like a mutual aid society. Are there advantages of---is there reason to do this through the state, I guess is my question.</p> <p><strong>Lehto:</strong> As a very wide-going and deep-reaching utilitarian, for me it's all about checking what robustness criteria institutions might have, and what institutional arrangements we could come up with and seeing how they perform in the real world rather than in the realm of ideal theory. And we have some evidence of places where mutual aid societies worked and we have some evidence of places where forms of welfare state that are highly bureaucratic and oppressive and paternalistic have operated and both of those have several features that I think we can wish to want to get rid of.</p> <p>So I think that if we look at societies where mutual aid societies were the sole means for people to survive I think they actually did a relatively good job in many cases but I think they failed to provide the sort of guarantee of security that I think a good society would wish to provide for people. That is, if we rely on the means of mutual aid societies you will get perhaps even a superior alternative to many forms of welfare state in the long run and I'm completely open to the idea that free markets can provide a very robust system of welfare. And actually that to me is one of the reasons why I consider myself a libertarian defender of a welfare state because I think that the libertarian part comes from actually understanding that markets are a good way of producing welfare and the opportunities available for markets and other forms of voluntary transfer, including mutual aid societies, are a way of providing a wide framework of security and services and other forms of protection.</p> <p>But I think that they provide a patchwork which leaves a lot of people outside in a number of circumstances. And I think this fact that they have a lot of holes in the way into the system, they have a lot of uncertainty about guaranteed income and lot of uncertainty about who gets covered, who is seen as being worthy of being helped, who is seen as being worthy of being protected by a benevolent charity and so on, means that we need to have a system of making sure that people don't---perhaps out of no fault of their own---fall through the cracks of the free market system and the same goes for the welfare state. I think they actually are surprisingly similar the welfare state and the free market utopia, they both provide this patchwork framework where some people are protected, some people are not, there's a lot of uncertainty about who gets what, who gets protected, and who doesn't. And so actually in both systems, people fall through the cracks and this is exactly the reason why I think basic income guarantee can be a superior alternative to either of those.</p> <p>But again we have to see what happens when we actually implement basic income, there could be a lot of unintended consequences. So we need to take those into account as well but at least on the side of theory, I think the idea of guaranteeing basic income, I think it's both desirable and practicable because we know how to do it technocratically and theoretically. I mean there's nothing so difficult with guaranteeing basic income via bank transfer to all citizens for example.</p> <p><strong>Petersen:</strong> So one virtue of the basic income guarantee is that it seems to be actually politically feasible within our current system and it has got some interest in recent years. We mentioned at the start of the episode that you were part of the effort to bring a basic income to Finland so could you tell me about the political situation there? I've heard that they're looking at bringing in a basic income guarantee.</p> <p><strong>Lehto:</strong> Yes, indeed. And here I'm being brutally pragmatic. Finland is not going to turn into any sort of libertarian utopia that I would wish for and certainly there are elements of paternalism there that are not going to go away. We still regulate the sale of alcohol in a very, I think, outrageous fashion for example and there are a lot of elements in the system that probably will keep us on the level of adult children for a long time. But as far as the welfare system is concerned, there is considerable consensus now that something like basic income would be a desirable reform. And this is seen by the majority of the population and by more than 50% of the M.P.'s in the parliament, basically from all parties with of course different proportions in different parties.</p> <p>But yes indeed the center-right government is actually going with the basic income pilot experiment starting next year. It's I think a well-planned pilot. They have a lot of experts because we believe in experts in this country and in Finland the sort of reliance on experts is both good and bad in many ways. It always seems to suggest that there is a group of people who can define the perfect system but in this case I think they've done a pretty good job with planning this two-year pilot. We shall see what happens. It's certainly not ideal and the government is already bungling with some of its promises and how it is going to be organized.</p> <p>But the basic premise for people who may not have an understanding or an idea in their mind of what this actually means, it means that basic income in the Finnish context would be the guarantee of something on the order of 500 to 600 to perhaps 800 Euros per month per person. And this would replace the various forms of unemployment benefits, sick leave benefits, student benefits and various other forms of benefits and Finland obviously has a lot of those already in place. And the complexity of the bureaucracy is such that even the experts who run it are surprisingly candid about their ignorance, about the complexities and mutual dependencies of the various benefit structures so that it's a maze that not even the experts can navigate, let alone regular ordinary people who are supposed to be the beneficiaries of the system. So a lot of people don't know how to apply for help, a lot of people don't know what benefits they're entitled to, and there's a long delay in getting the results of one's application for particular benefits---months, sometimes even the years. And a lot of people fall through the cracks in that fashion that I mentioned earlier.</p> <p>And so I think we've come to the point almost by necessity, where this system is seen almost universally by all as in need of reform and basic income happens to be the form of this reform that is most universally seen as the one we should pursue even though of course there are still people who are very skeptical of it in many ways. But yes, indeed they're planning this experiment where they're giving something like 500 Euros to a few thousand people across Finland. It's a very small experiment, but there are people who will call for its expansion I'm sure in the years to come. That will be definitely a very interesting experiment to see how that goes.</p> <p><strong>Petersen:</strong> It seems like with the current system being so complex, it's almost like a part-time job just to collect benefits. You need to build expertise and you need to fill out the right forms and it takes a lot of your time and in many ways that makes it something that competes with the labor market for your time and your efforts and your human capital development. Seems like a basic income would be a good way to get people back into the labor market simply by virtue of freeing up their time to pursue something else. Do you see the political movement towards basic income making progress in other countries as well?</p> <p><strong>Lehto:</strong> So yes experiments are undergoing in a number of countries. In addition to these, Netherlands, Canada and U.S. experiments and the Finnish case of obviously which I'm most familiar with, there is a very interesting experiment going to start in a few years in East Africa organized by the charity Give Directly who are already advocates of this idea of giving cash transfers to people. They have been doing that for a number of years now with quite good results according to many independent researchers. They've been giving cash transfers directly to people and they've shown great results. So they are actually expanding this idea and organizing again a privately funded experiment that they planned around for ten years, I think, or at least a number of years in East Africa.</p> <p>And this should be quite interesting to see how the basic income experiments in rich countries and poor countries compare and perhaps they can help both in different ways, because obviously countries where welfare states exist are quite different from places where they don't. So any help or any form of monetary transfer will help people in African countries proportionally more than they do in rich countries, but I think both situations and both contexts can certainly benefit from direct cash transfers and basic income.</p> <p><strong>Petersen:</strong> Give Directly is a charity that I support and I really like what they're doing. I especially like how they take such a quantitative approach. There are so many charities that just start with \"wouldn't it be nice if people in this village had this thing?\" And then they bring it to them and they don't really stop to say can we measure, were we cost effective in improving their lives? Did we do a good job? Could something else of equivalent cost have made them better off? Give Directly is doing a great thing by bringing a lot of this sort of quantitative approach to charitable giving and I'll have <a href= \"https://www.givedirectly.org/\" target=\"_blank\">a link at the show notes page to Give Directly</a> if you want to contribute, if any of the listeners want to contribute, I highly recommend it.</p> <p><strong>Lehto:</strong> Absolutely. For a little bit, just to say about the reasons why cash transfers are so great. By the way, I should say that there are perhaps a few charities that are even more helpful in certain contexts. For example, direct malaria helping efforts, efforts to eradicate diseases perhaps, have an even higher rate of efficiency but those are pretty much the only ones that are more effective than giving people cash. And the reason why giving people cash is very good is that first of all, they stimulate markets where they don't exist and where markets do exist they operate in a way that maximizes the preferences and satisfaction of the people concerned. They operate as a way of giving people welfare in the most efficient way possible.</p> <p>And the theoretical foundations of these can be found for example in neoclassical economics, of course, where the superiority of cash transfers have been posited for example in the Chicago School since George Stigler and Milton Friedman and others. There's <a href=\"https://www.jstor.org/stable/1805783\" target=\"_blank\">a wonderful paper by Brennan and Walsh</a> on the desirability of cash transfers over in-kind transfers from a game theoretical Pareto perspective. So that's also quite interesting how the theory also matches the empirical research here.</p> <p>And just again to go back to the very foundation of the welfare state. I think that's been the biggest mistake of the welfare states today that they fail to take into account how welfare truly fundamentally is the satisfaction of the desired ends and needs of the people themselves as they themselves see them. It shouldn't be the satisfaction of some criteria of goodness that the state bureaucrats measure and determine. It really should be ultimately up to the people themselves what they value, what they pursue, and what needs they see themselves as having and thus giving money to them is the best way to make sure that they actually get to satisfy those preferences which they have rather than those preferences which some bureaucrats think that they should have.</p> <p><strong>Petersen:</strong> If I may ask one final question. Some supporters of the basic income guarantee have suggested that we could do it as a swap. We get rid of our current costly welfare system and bring in the basic income guarantee and often you'll hear the suggestion that this could be revenue neutral. Is that a realistic possibility?</p> <p><strong>Lehto:</strong> It is a realistic possibility in cases where quite extensive welfare states already exist. And obviously it depends on the level of basic income and I'm actually in favor of starting low where that is the most politically feasible option. But I'm also quite a quite supportive of the idea of starting high where that is politically feasible. So in countries like the welfare state in Canada and many other places. Starting from the level of where the current welfare state benefits are it is compatible with the goal of making it neutral as far as the effect on state budget is concerned. Although I think that it will be very hard to make it completely neutral in that regard. I think it will by necessity always cost something.</p> <p>But what it will cost is heavily overblown in many estimations because many people simply do not understand how to calculate the costs and they simply add up some figures of everybody gets this amount of money and multiply that by the number of people and voila you get the proposed cost of this program. But that's obviously nonsense that they don't understand what they're talking about. And they really should have a look at the actual models because in all models what happens is you reform the tax system at the same time which means that for most people, middle-class and upper-class people---or middle income and upper-income people, to be more politically correct---the income that they get from basic income actually is a zero sum addition because actually, they ended up paying their basic income back in the form of taxes that I've been raised to match accordingly the need for basic income funding. So, even if there is no criteria that you don't give basic income to people above a certain range of income, nonetheless those people in the upper brackets will end up paying back their basic income due to the taxes that have been raised. But the taxes that are raised do not have to impose unbearable burdens on those people either, because again for most people it is just a nominal transfer of funds and it's withdrawn from their bank accounts at the same time.</p> <p><strong>Petersen:</strong> So are there websites, books? What can you recommend to people interested in this topic? What should they read?</p> <p><strong>Lehto:</strong> Well I think for those who are philosophically minded, I certainly recommend reading the classics of the libertarian welfare state stuff. Things like Friedman's <a href=\"http://amzn.to/2gm4cLz\" target=\"_blank\">Capitalism and Freedom</a> where the negative income tax fee is featured. Friedrich Hayek's <a href=\"http://amzn.to/2he9SXP\" target= \"_blank\">Constitution of Liberty</a> is a great book and it also features a defense of guaranteed minimum income. And more recently John Tomasi's <a href=\"http://amzn.to/2gjU8xz\" target=\"_blank\">Free Market Fairness</a>, and I would recommend people to read the blog <a href=\"http://bleedingheartlibertarians.com/\" target= \"_blank\">Bleeding Heart Libertarians</a> they have been advocating for basic income but also debating it. And also proposing this similar thing that I'm doing which is trying to combine Rawls' and Nozick's intuitions into something like a new coherent whole.</p> <p>And just follow the news, read up on the models, follow up on what the governments and many of these countries---Finland, Netherlands, Canada---are doing. And go to <a href= \"http://basicincome.org/\" target=\"_blank\">basic income networks website</a>. Just Google basic income earth network. B.I.E.N it's called---Basic Income Earth Network---and you will find more about basic income.</p> <p><strong>Petersen:</strong> My guest today has been Otto Lehto. Otto thanks for being part of Economics Detective Radio.</p> <p><strong>Lehto:</strong> My pleasure. It's been fun.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with Otto Lehto.</p>  <p>Petersen: You're listening to Economics Detective Radio. My guest today is Otto Lehto of King's College London. He is formerly the chair of Finland's Basic Income Network. Otto, welcome to Economics Detective Radio.</p> <p>Lehto: Oh it's my pleasure to be here.</p> <p>Petersen: So our topic for today is the basic income guarantee. Otto, you approach this idea from the perspective of political philosophy, so let's start by discussing that. How about we start by talking about two of the major figures in political philosophy: John Rawls and Robert Nozick. What do each of them have to say about the welfare state and where do your views diverge from theirs?</p> <p>Lehto: That is a good point to start indeed, although it is I think a bit lamentable that we have to start from those two figures because they have dominated the discussion so much during the last 50 years. In fact, it's very hard to have a conversation outside the boundaries set by those two figures, but they're both geniuses. They set the stage for the discussion, certainly in philosophy but also in public policy in many respects.</p> <a href= \"https://www.amazon.com/Theory-Justice-Original-Oxford-Paperbacks/dp/0674017722/ref=as_li_ss_il?ie=UTF8&qid=1481319288&sr=8-1&keywords=rawls&linkCode=li2&tag=economicsde0f-20&linkId=1c45e258f8b09dc5cb229cf0826dc31b\" target=\"_blank\"></a> <p>So, let's start with John Rawls. John Rawls really was a towering figure in Harvard, really starting from the 60's and throughout the 70's. He wrote this book, <a href= \"http://amzn.to/2hfTCms\" target=\"_blank\">A Theory of Justice</a>, which is considered one of the really truly great books in political philosophy that revolutionized the way we think about these subjects. But the short version of his theory, which is very influential even up to this day, is that people in societies should look at the framework of living with each other as a cooperative game where we all try to sort of not only maximize our own position but also to make the whole game fair for everybody. And so he called his theory <a href=\"http://amzn.to/2gKdNIj\" target= \"_blank\">Justice as Fairness,</a> where people are entitled to a certain respect and autonomy, certain liberties as members of the democratic community where they can pursue their own ends. But they're also entitled to a redistributive scheme if they happen to be among the worst-off people in the society. They are entitled to redistributive transfers.</p> <p>This framework sounds very familiar and indeed it should because it reflects the social democratic reality in which most Western societies operate. And even in later years he said that actually his philosophy, even though it starts from first principles and proceeds from there, is actually meant to be a philosophical justification of the intuitions that people in Western democracies---liberal democracies---have.</p> <p>So, you combine liberal ideas of individual freedom with these notions of the welfare state and so on. So that was the foundation of Rawls' system.</p> <a href= \"https://www.amazon.com/Anarchy-State-Utopia-Robert-Nozick/dp/0465051006/ref=as_li_ss_il?ie=UTF8&qid=1481319605&sr=8-1&keywords=anarchy+state+and+utopia&linkCode=li3&tag=economicsde0f-20&linkId=9faafdff539361213544482b4df544d7\" target=\"_blank\"></a> <p>So that's Rawls' system but Nozick came along and he found a place for himself in the same institution, that is Harvard, and he wrote a critique---a respectful critique---but a very thorough and deep critique of Rawls' theory. And he ended up justifying a minimal state that libertarians are very fond of. And he effectively said that no, people should just be seen as individuals who have some fundamental rights---he calls them side constrains---that people have a certain respect that they are owed by other people and it is very wrong for people to violate their personal boundaries and this includes the State.</p> <p>The state has actually no right to violate the sort of inviolable right to property rights that individuals have. So every form of taxation, that features very prominently even in Rawls' system, is theft. So, that is of course a very prominent theme in libertarianism. So his book---which by the way is really brilliant philosophically, it's not only just a standard justification of libertarianism but it's actually one of the great books in philosophy because it's so rich and powerful and full of interesting ideas and strange examples and brilliant footnotes and all that---but that lay down the other side. And so the debate in intellectual philosophy and history in the last 50 years or so has been largely dominated by these two figures: Rawls' <a href= \"http://amzn.to/2gjUK6w\" target=\"_blank\">Theory of Justice</a> on the one hand, a justification of social democracy with a liberal bent, and then on the other hand Nozick's <a href= \"http://amzn.to/2gm2Q3m\" target=\"_blank\">Anarchy, State and Utopia</a>, which is a justification of libertarian taxation-is-theft ideology. So that is the framework in which we find ourselves.</p> <p>Petersen: So there are these two competing extremes. You quote John Tomasi's critique of both of them. Would you like to summarize that for me?</p> <a href= \"https://www.amazon.com/Free-Market-Fairness-John-Tomasi/dp/0691158142/ref=as_li_ss_il?ie=UTF8&qid=1481319668&sr=8-2&keywords=tomasi&linkCode=li3&tag=economicsde0f-20&linkId=7e12737281b3c4f33f4d68c0d20303a9\" target=\"_blank\"></a> <p>Lehto: Yes. John Tomasi wrote a wonderful book in 2012 called <a href=\"http://amzn.to/2gtObBw\" target= \"_blank\">Free Market Fairness</a> where he actually tries to combine these two perspectives. And he says that actually there's a whole tradition that we're forgetting here when we focus only on these two---as you put it, they are both at extremes---although at least for Rawls himself, he's often considered a centrist. But in many ways, he represents this kind of---from a perspective that Tomasi points out---the perspective of classical liberalism even though the Rawlsian center-left position, he's actually seen going fundamentally wrong in many ways, even though that is the unquestionable framework in which people today operate.</p> <p>And I should say, when I say that Rawls and Nozick laid a framework, it's not as if there is 50% on one side and 50% on the other side. Perhaps in politics, like the left-wing and right-wing ideologies have maybe about 50% on each side depending on the circumstances. But in philosophy certainly, Rawls has been the one that dominated the discussion and there are actually very few Nozickians around.</p> <p>But Tomasi points out that even with this seemingly very credible and too wonderful system that Rawls lays out, there is very little attention paid to issues like individual freedom especially in the domain of economy. And the lack of respect for people's freedom of choices in economic matters is actually a major shortcoming in Rawls' system. And this is exactly what Tomasi points out and from the perspective of classical liberalism which he raises to the standard of something that we should actually take more seriously than we have today. He points out that actually economic liberty is something we should insert back into the conversation in a serious way without however on the other side falling down the assumption that Nozick makes---and a lot of libertarians make---that the only justification for all economic liberty necessarily leads to a justification for the night watchman state or the minimal state of libertarianism where there is no role for government to provide public services and all that.</p> <p>And so this false dichotomy that Rawls and Nozick have put out has sort of made it difficult for people like myself and Tomasi and <a href=\"http://sites.sandiego.edu/mzwolinski/\" target= \"_blank\">Matt Zwolinsky</a> and people who consider themselves followers of the legacy of classical liberalism to lay out the more complicated, but I think more interesting, case for a system where robust economic liberties are combined with certain welfare state elements. Certain elements of taking seriously the power of the state to actually increase the real opportunities of people rather than just being a system of theft as Nozick calls it.</p> <p>Petersen: So that's where something like the basic income guarantee comes in. Can you summarize what that is and how is that different from the welfare states most countries currently have?</p> <p>Lehto: Right. Basic income guarantee, first of all, is defined as a regular payment to all citizens or residents of a political community that is given uniformly to all citizens. All people get the same amount and people get it without bureaucratic discretion. So it is given automatically or almost automatically to all people either in the form of a direct cash transfer to their bank account or in the form of a tax break system as in the form of negative income tax which is actually a form of basic income.</p> <p>So this system is supposed to, and it is a way, to replace the bureaucratic complexity and the nightmarish disrespect for human autonomy and human freedom that lies in the center of the current welfare state system in my opinion and certainly in the opinion of Tomasi and other people who I'm referring to. So the basic income guarantee is superior to the current system and it differs from the current system in the sense that it actually operates under the principle that we shouldn't use the state to guarantee specific favors to specific people, we shouldn't use the state as a one-upmanship mechanism whereby one group of recipients carries for the favor of bureaucracies, tries to---and in a way infiltrate---the mechanisms of the state to redistribute money and resources to themselves or to groups that they favor against the interests and desires of other groups because this leads to a spiral of negative-sum game in the political economy. And I think welfare states today in this sense have become victim to this overzealous one-upmanship of special interest group politics and basic income is a way to overcome this problem.</p> <p>Petersen: So the basic income guarantee, is it really a break from business as usual? It seems like it's a marginal improvement on the system we have now, but I guess you're suggesting that the system we have now encourages a lot of rent seeking, it has a lot of payments to different groups, it's needlessly complex. I could list some other problems with it. There are the so-called welfare cliffs where poor people face implicit marginal tax rates sometimes of a thousand percent, or some absurdly high amount because their benefits are clawed back when they earn a little more income. So there seems like there's a good economic justification for basic income. Is your work focused on the classical liberal philosophical justification for having a hands-off welfare state?</p> <p>Lehto: Yes, in a way. The fundamental debate is truly between these two perspectives of whether it's a pragmatic justification for reform towards a slightly saner and slightly more useful and purposeful and beneficial system, or on the other hand, is it a requirement of justice that we have something like a basic income guarantee. And I think that really the truth is somewhere in between.</p> <p>First of all, I think it certainly is a pragmatic improvement over the current system but I should point out already at this point that when I'm advocating for basic income I'm not advocating for basic income without demanding widespread reforms in other areas of life in the welfare state. I am indeed calling for massive restructuring of many of the mechanisms of the welfare state partially just to accommodate for the fact that we are taking basic income as the policy paradigm that we're trying to implement. Because if we take that as the policy paradigm, then we necessarily must reform the existing bureaucracies, tax system just to accommodate for the fact that we are taking this new system into effect.</p> <p>In addition to this, I think that the whole framework of regulations, the whole framework of massive interventions into the economy, into the private life of citizens have to be addressed as serious violations of the capacity of the welfare state to truly increase the welfare of its people. Because my opinion is that the welfare state has failed because it has failed to address the proper means to achieve its own ends that it claims to have. Use of improper means to achieve its ends is the reason why the welfare state is failing so miserably everywhere in the world today. That it's claiming to be for the welfare of its citizens, but if you look at it in terms of its overall effect in many ways it fails.</p> <p>Petersen: So, when I think of the policies that I'd like to see replaced by a basic income guarantee they're not just strictly welfare transfers. There's a theorem in economics called the Atkinson-Stiglitz theorem. It says that when you have an optimally designed progressive income tax scheme, basic income with a progressive income tax would be something like that, then it doesn't make sense to have additional programs designed to redistribute. And some of the programs that I think are basically focused on redistribution are things like protecting taxi drivers from competition from companies like Uber and Lyft, or a lot of the interventions into medicine are designed to make sure that people who get sick don't also become poor. And of course, if you had something like a basic income, every taxi driver could lose his job, he wouldn't fall below that minimum level. And so could at least in principle---if we were going to make sort of an ideal political bargain---a basic income guarantee would come with a lot of free market reforms ideally. Is that basically a big part of the reason why so many libertarians---such as Milton Friedman and Friedrich Hayek---have supported versions of a basic income?</p> <p>Lehto: Well yes indeed, it has the feature of being compatible with a total abolition of the rest of the welfare state, or major portions of the welfare state. And in fact people like <a href=\"http://amzn.to/2gjRfwI\" target=\"_blank\">Charles Murray</a> have recently proposed exactly that, a replacement of the welfare state by the means of a basic income given to all citizens as the second-best option to a complete free-market society. And people like Hayek and Friedman were also of the opinion that the majority of those transfers could be replaced.</p> <p>So the thing with money is that money is a universal means of exchange and the uses of money and the need for money are as varied as people and situations. And when we think of basic income we don't think of it in terms of being for a particular purpose or for particular people or for particular circumstances unlike the current measures. And so it has the virtue---and perhaps the vice depending on your point of view---of being this universal situation, a neutral ground. And so indeed we can come up with hundreds of scenarios where a basic income could be useful for people. Obviously, some of those are covered by the current redistributive schemes within which by the way I would include things like farm subsidies, many forms of corporate welfare and so on.</p> <p>So basic income has the virtue and vice of being neutral as regards purposes and situations. The only thing really is that if you don't have any other sources of income then you will get a basic income without having to beg for it from anybody either in the government or in the world of charity for example. So, yes indeed, people who are forced out of work to circumstances---whatever those circumstances happen to be---are able to survive, the people who are forced out of the labor market entirely for a reason---one reason or another---people who have temporary or permanent conditions that affect their capacity to find work will be covered up to this level, and people who perhaps want to take some time off to take care of their family, people who want to take some time off to study, to plan ahead, to perhaps think about starting a new company, they have some ideas but they don't have the means of funding yet, that allows people to focus on doing what they think is best for them at the moment. So it has almost an infinity of purposes precisely because there is an infinity of human beings and human desires that in a pure realistic society will have to be taken into account. And a welfare state that tries to measure what people truly need, or what circumstances need to be taken care of, fails precisely because it can never count the infinity of the variety of ways in which people end up in need of money in society.</p> <p>Petersen: So before this welfare state that we currently have---the welfare state as it currently exists largely is a creation of the 20th century. But in the 19th century and early 20th century a lot of what you had was mutual aid societies and things like that. And I think a hard core maybe a Rothbardian libertarian who maybe still cares a lot about the poorest among us might say, why have a basic income? If we just had nothing there would still be the civil society and we could create something like a mutual aid society. Are there advantages of---is there reason to do this through the state, I guess is my question.</p> <p>Lehto: As a very wide-going and deep-reaching utilitarian, for me it's all about checking what robustness criteria institutions might have, and what institutional arrangements we could come up with and seeing how they perform in the real world rather than in the realm of ideal theory. And we have some evidence of places where mutual aid societies worked and we have some evidence of places where forms of welfare state that are highly bureaucratic and oppressive and paternalistic have operated and both of those have several features that I think we can wish to want to get rid of.</p> <p>So I think that if we look at societies where mutual aid societies were the sole means for people to survive I think they actually did a relatively good job in many cases but I think they failed to provide the sort of guarantee of security that I think a good society would wish to provide for people. That is, if we rely on the means of mutual aid societies you will get perhaps even a superior alternative to many forms of welfare state in the long run and I'm completely open to the idea that free markets can provide a very robust system of welfare. And actually that to me is one of the reasons why I consider myself a libertarian defender of a welfare state because I think that the libertarian part comes from actually understanding that markets are a good way of producing welfare and the opportunities available for markets and other forms of voluntary transfer, including mutual aid societies, are a way of providing a wide framework of security and services and other forms of protection.</p> <p>But I think that they provide a patchwork which leaves a lot of people outside in a number of circumstances. And I think this fact that they have a lot of holes in the way into the system, they have a lot of uncertainty about guaranteed income and lot of uncertainty about who gets covered, who is seen as being worthy of being helped, who is seen as being worthy of being protected by a benevolent charity and so on, means that we need to have a system of making sure that people don't---perhaps out of no fault of their own---fall through the cracks of the free market system and the same goes for the welfare state. I think they actually are surprisingly similar the welfare state and the free market utopia, they both provide this patchwork framework where some people are protected, some people are not, there's a lot of uncertainty about who gets what, who gets protected, and who doesn't. And so actually in both systems, people fall through the cracks and this is exactly the reason why I think basic income guarantee can be a superior alternative to either of those.</p> <p>But again we have to see what happens when we actually implement basic income, there could be a lot of unintended consequences. So we need to take those into account as well but at least on the side of theory, I think the idea of guaranteeing basic income, I think it's both desirable and practicable because we know how to do it technocratically and theoretically. I mean there's nothing so difficult with guaranteeing basic income via bank transfer to all citizens for example.</p> <p>Petersen: So one virtue of the basic income guarantee is that it seems to be actually politically feasible within our current system and it has got some interest in recent years. We mentioned at the start of the episode that you were part of the effort to bring a basic income to Finland so could you tell me about the political situation there? I've heard that they're looking at bringing in a basic income guarantee.</p> <p>Lehto: Yes, indeed. And here I'm being brutally pragmatic. Finland is not going to turn into any sort of libertarian utopia that I would wish for and certainly there are elements of paternalism there that are not going to go away. We still regulate the sale of alcohol in a very, I think, outrageous fashion for example and there are a lot of elements in the system that probably will keep us on the level of adult children for a long time. But as far as the welfare system is concerned, there is considerable consensus now that something like basic income would be a desirable reform. And this is seen by the majority of the population and by more than 50% of the M.P.'s in the parliament, basically from all parties with of course different proportions in different parties.</p> <p>But yes indeed the center-right government is actually going with the basic income pilot experiment starting next year. It's I think a well-planned pilot. They have a lot of experts because we believe in experts in this country and in Finland the sort of reliance on experts is both good and bad in many ways. It always seems to suggest that there is a group of people who can define the perfect system but in this case I think they've done a pretty good job with planning this two-year pilot. We shall see what happens. It's certainly not ideal and the government is already bungling with some of its promises and how it is going to be organized.</p> <p>But the basic premise for people who may not have an understanding or an idea in their mind of what this actually means, it means that basic income in the Finnish context would be the guarantee of something on the order of 500 to 600 to perhaps 800 Euros per month per person. And this would replace the various forms of unemployment benefits, sick leave benefits, student benefits and various other forms of benefits and Finland obviously has a lot of those already in place. And the complexity of the bureaucracy is such that even the experts who run it are surprisingly candid about their ignorance, about the complexities and mutual dependencies of the various benefit structures so that it's a maze that not even the experts can navigate, let alone regular ordinary people who are supposed to be the beneficiaries of the system. So a lot of people don't know how to apply for help, a lot of people don't know what benefits they're entitled to, and there's a long delay in getting the results of one's application for particular benefits---months, sometimes even the years. And a lot of people fall through the cracks in that fashion that I mentioned earlier.</p> <p>And so I think we've come to the point almost by necessity, where this system is seen almost universally by all as in need of reform and basic income happens to be the form of this reform that is most universally seen as the one we should pursue even though of course there are still people who are very skeptical of it in many ways. But yes, indeed they're planning this experiment where they're giving something like 500 Euros to a few thousand people across Finland. It's a very small experiment, but there are people who will call for its expansion I'm sure in the years to come. That will be definitely a very interesting experiment to see how that goes.</p> <p>Petersen: It seems like with the current system being so complex, it's almost like a part-time job just to collect benefits. You need to build expertise and you need to fill out the right forms and it takes a lot of your time and in many ways that makes it something that competes with the labor market for your time and your efforts and your human capital development. Seems like a basic income would be a good way to get people back into the labor market simply by virtue of freeing up their time to pursue something else. Do you see the political movement towards basic income making progress in other countries as well?</p> <p>Lehto: So yes experiments are undergoing in a number of countries. In addition to these, Netherlands, Canada and U.S. experiments and the Finnish case of obviously which I'm most familiar with, there is a very interesting experiment going to start in a few years in East Africa organized by the charity Give Directly who are already advocates of this idea of giving cash transfers to people. They have been doing that for a number of years now with quite good results according to many independent researchers. They've been giving cash transfers directly to people and they've shown great results. So they are actually expanding this idea and organizing again a privately funded experiment that they planned around for ten years, I think, or at least a number of years in East Africa.</p> <p>And this should be quite interesting to see how the basic income experiments in rich countries and poor countries compare and perhaps they can help both in different ways, because obviously countries where welfare states exist are quite different from places where they don't. So any help or any form of monetary transfer will help people in African countries proportionally more than they do in rich countries, but I think both situations and both contexts can certainly benefit from direct cash transfers and basic income.</p> <p>Petersen: Give Directly is a charity that I support and I really like what they're doing. I especially like how they take such a quantitative approach. There are so many charities that just start with \"wouldn't it be nice if people in this village had this thing?\" And then they bring it to them and they don't really stop to say can we measure, were we cost effective in improving their lives? Did we do a good job? Could something else of equivalent cost have made them better off? Give Directly is doing a great thing by bringing a lot of this sort of quantitative approach to charitable giving and I'll have <a href= \"https://www.givedirectly.org/\" target=\"_blank\">a link at the show notes page to Give Directly</a> if you want to contribute, if any of the listeners want to contribute, I highly recommend it.</p> <p>Lehto: Absolutely. For a little bit, just to say about the reasons why cash transfers are so great. By the way, I should say that there are perhaps a few charities that are even more helpful in certain contexts. For example, direct malaria helping efforts, efforts to eradicate diseases perhaps, have an even higher rate of efficiency but those are pretty much the only ones that are more effective than giving people cash. And the reason why giving people cash is very good is that first of all, they stimulate markets where they don't exist and where markets do exist they operate in a way that maximizes the preferences and satisfaction of the people concerned. They operate as a way of giving people welfare in the most efficient way possible.</p> <p>And the theoretical foundations of these can be found for example in neoclassical economics, of course, where the superiority of cash transfers have been posited for example in the Chicago School since George Stigler and Milton Friedman and others. There's <a href=\"https://www.jstor.org/stable/1805783\" target=\"_blank\">a wonderful paper by Brennan and Walsh</a> on the desirability of cash transfers over in-kind transfers from a game theoretical Pareto perspective. So that's also quite interesting how the theory also matches the empirical research here.</p> <p>And just again to go back to the very foundation of the welfare state. I think that's been the biggest mistake of the welfare states today that they fail to take into account how welfare truly fundamentally is the satisfaction of the desired ends and needs of the people themselves as they themselves see them. It shouldn't be the satisfaction of some criteria of goodness that the state bureaucrats measure and determine. It really should be ultimately up to the people themselves what they value, what they pursue, and what needs they see themselves as having and thus giving money to them is the best way to make sure that they actually get to satisfy those preferences which they have rather than those preferences which some bureaucrats think that they should have.</p> <p>Petersen: If I may ask one final question. Some supporters of the basic income guarantee have suggested that we could do it as a swap. We get rid of our current costly welfare system and bring in the basic income guarantee and often you'll hear the suggestion that this could be revenue neutral. Is that a realistic possibility?</p> <p>Lehto: It is a realistic possibility in cases where quite extensive welfare states already exist. And obviously it depends on the level of basic income and I'm actually in favor of starting low where that is the most politically feasible option. But I'm also quite a quite supportive of the idea of starting high where that is politically feasible. So in countries like the welfare state in Canada and many other places. Starting from the level of where the current welfare state benefits are it is compatible with the goal of making it neutral as far as the effect on state budget is concerned. Although I think that it will be very hard to make it completely neutral in that regard. I think it will by necessity always cost something.</p> <p>But what it will cost is heavily overblown in many estimations because many people simply do not understand how to calculate the costs and they simply add up some figures of everybody gets this amount of money and multiply that by the number of people and voila you get the proposed cost of this program. But that's obviously nonsense that they don't understand what they're talking about. And they really should have a look at the actual models because in all models what happens is you reform the tax system at the same time which means that for most people, middle-class and upper-class people---or middle income and upper-income people, to be more politically correct---the income that they get from basic income actually is a zero sum addition because actually, they ended up paying their basic income back in the form of taxes that I've been raised to match accordingly the need for basic income funding. So, even if there is no criteria that you don't give basic income to people above a certain range of income, nonetheless those people in the upper brackets will end up paying back their basic income due to the taxes that have been raised. But the taxes that are raised do not have to impose unbearable burdens on those people either, because again for most people it is just a nominal transfer of funds and it's withdrawn from their bank accounts at the same time.</p> <p>Petersen: So are there websites, books? What can you recommend to people interested in this topic? What should they read?</p> <p>Lehto: Well I think for those who are philosophically minded, I certainly recommend reading the classics of the libertarian welfare state stuff. Things like Friedman's <a href=\"http://amzn.to/2gm4cLz\" target=\"_blank\">Capitalism and Freedom</a> where the negative income tax fee is featured. Friedrich Hayek's <a href=\"http://amzn.to/2he9SXP\" target= \"_blank\">Constitution of Liberty</a> is a great book and it also features a defense of guaranteed minimum income. And more recently John Tomasi's <a href=\"http://amzn.to/2gjU8xz\" target=\"_blank\">Free Market Fairness</a>, and I would recommend people to read the blog <a href=\"http://bleedingheartlibertarians.com/\" target= \"_blank\">Bleeding Heart Libertarians</a> they have been advocating for basic income but also debating it. And also proposing this similar thing that I'm doing which is trying to combine Rawls' and Nozick's intuitions into something like a new coherent whole.</p> <p>And just follow the news, read up on the models, follow up on what the governments and many of these countries---Finland, Netherlands, Canada---are doing. And go to <a href= \"http://basicincome.org/\" target=\"_blank\">basic income networks website</a>. Just Google basic income earth network. B.I.E.N it's called---Basic Income Earth Network---and you will find more about basic income.</p> <p>Petersen: My guest today has been Otto Lehto. Otto thanks for being part of Economics Detective Radio.</p> <p>Lehto: My pleasure. It's been fun.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "36:18",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with Otto Lehto.  Petersen: You're listening to Economics Detective Radio. My guest today is Otto Lehto of King's College London. He is formerly the chair of Finland's Basic Income Network. Otto,..."
}