{
  "title": "553: The New and Improved 'Cursed Child' Reviewed, Yet Another 'Secrets of Dumbledore' Trailer Reveals Exciting Footage",
  "link": "https://audioboom.com/posts/8043909",
  "itunes:episode": 553,
  "itunes:title": "The New and Improved 'Cursed Child' Reviewed, Yet Another 'Secrets of Dumbledore' Trailer Reveals Exciting Footage",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4806,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode of MuggleCast, we break down new scenes from the recently released Japanese Secrets of Dumbledore trailer, take listener feedback and talk about the 18 new character posters. Plus, we're joined by a very special guest to review Cursed Child in San Francisco!<br>\n<br>\n\n</div>\n<ul>\n<li>\n<a href=\"http://www.millennialshow.com\">#Millennial</a> co-host <a href=\"http://www.twitter.com/pamelagocobachi\">Pam</a> joins the show to review the new-and-improved one-part Cursed Child in San Francisco! Check out new episodes of Andrew, Laura, and Pam's #Millennial every Wednesday. Subscribe via <a href=\"https://podcasts.apple.com/us/podcast/millennial-pretend-adulting-real-talk/id960509065\">Apple</a>, <a href=\"https://open.spotify.com/show/7qlzUjVBjhgU5rN3bHzj6i\">Spotify</a>, <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9hdWRpb2Jvb20uY29tL2NoYW5uZWxzLzQ5MzYxNTMucnNz?sa=X&ved=0CCoQ27cFahcKEwj41ZnfhLf2AhUAAAAAHQAAAAAQdg\">Google Podcasts</a>, or wherever you listen!</li>\n<li>The hosts analyze the new <a href=\"https://www.youtube.com/watch?v=NhFSUKuHly0&ab_channel=portkeypuntoit\">Japanese Secrets of Dumbledore trailer</a>, which includes even more exciting footage!</li>\n<li>Oh brother! Did Theseus and Newt successfully defeat the Manticore?</li>\n<li>Professor McGonagall namedrop!</li>\n<li>Dumbledore comes face-to-face with the portrait of Ariana</li>\n<li>Newt: “To save our world, each of us has a role to play.\" What exactly are the roles that Theseus, Eulalie, Jacob, Yusuf and Bunty will play in the third Fantastic Beasts film?</li>\n<li>Tina is inside Newt's suitcase (kind of)!</li>\n<li>Dumbledore: “I drew my wand, which was even more foolish.” Will this be how we’re going to get Ariana's backstory? Not via flashback, but from Dumbledore himself?</li>\n<li>Listener feedback covers Tina as Bunty, Dumbledore and Grindelwald's duel, Tina possibly being pregnant and more!</li>\n<li>We analyze The Secrets of Dumbledore character posters (<a href=\"https://twitter.com/FantasticBeasts/status/1496137707541696527\">Dumbledore's First Army</a>, <a href=\"https://twitter.com/FantasticBeasts/status/1496145317682683916\">Grindelwald's Followers</a>, and <a href=\"https://twitter.com/FantasticBeasts/status/1496152833879588873\">Global Wizards</a>).</li>\n<li>The Secrets of Dumbledore screenplay will be published July 19. We debate whether or not this big gap between the film and the screenplay is to push fans to go to theaters?</li>\n<li>This week's episode is brought to you by HelloFresh (visit <a href=\"http://www.HelloFresh.com/Muggle16\">HelloFresh.com/Muggle16</a> and use code \"muggle16\" for up to 16 free meals AND 3 free gifts) and BetterHelp (MuggleCast listeners get 10% off their first month at <a href=\"http://www.BetterHelp.com/MuggleCast\">BetterHelp.com/MuggleCast</a>)!</li>\n<li>On next week's episode, we bring back our Fantastic Beasts character discussions featuring the one-and-only Newt Scamander!</li>\n</ul>\n",
  "pubDate": "Tue, 08 Mar 2022 17:29:31 +0000",
  "guid": "tag:audioboom.com,2022-03-08:/posts/8043909",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}