{
  "title": "Video on the record",
  "link": "https://news.mit.edu/2022/video-on-the-record-1104",
  "description": "MIT’s inaugural Bearing Witness, Seeking Justice conference explores video’s role in the struggle over truth and civil liberties.",
  "pubDate": "Fri, 04 Nov 2022 13:50:00 -0400",
  "guid": "https://news.mit.edu/2022/video-on-the-record-1104",
  "dc:creator": "Nicole Estvanik Taylor | School of Humanities, Arts, and Social Sciences",
  "content:encoded": "<p>Among the Pulitzer Prizes awarded in 2021 was a citation for a teenager who changed history with her cell phone. The Pulitzer committee acknowledged Darnella Frazier “for courageously recording the murder of George Floyd, a video that spurred protests against police brutality around the world, highlighting the crucial role of citizens in journalists’ quest for truth and justice.”</p>\n\n<p>Frazier’s act of witness received uncommon recognition, but it exists on a continuum with countless other visual documentations of injustice leveraged by activists, journalists, and bystanders to demand change. Bearing Witness, Seeking Justice: Videography in the Hands of the People, a conference held on MIT’s campus and via livestream Oct. 5–7, delved into the complex issues surrounding the creation and dissemination of these images. Hosted by MIT Comparative Media Studies/Writing (CMS/W) in the School of Humanities, Arts, and Social Sciences (SHASS), the conference examined video technology’s histories; its role in protecting our rights and civil liberties; its interaction with the press and social media platforms; and its abuses, especially related to surveillance and deepfakes.</p>\n\n<p>Sparked by Floyd’s death and Frazier’s video, the idea for the gathering originated with Ken Manning, the Thomas Meloy Professor of Rhetoric and the History of Science at MIT, and became the first proposal to secure support from MIT’s new $1.2 million <a href=\"https://iceo.mit.edu/racism-research-fund/\">Racism Research Fund</a>. Manning teamed up with Tracie Jones, SHASS’s assistant dean for diversity, equity, and inclusion, to put out an international call for presentations. They recruited educator and DEI technologist Samantha Fletcher as project manager and assembled a steering committee of MIT community members, including faculty within and outside CMS/W, an undergraduate student, and leaders of the MIT Police.</p>\n\n<p>Why hold such conversations at MIT? According to Jones: “So much of what our faculty and students do contributes to innovation that can combat racism, classism, and poverty. Highlighting to the world that MIT cares about these social issues is really important.”</p>\n\n<p>Fletcher saw the event as a momentum-building opportunity. “I was very excited during the summer of 2020 when it wasn’t just Black people who were marching for Black lives. All different races were coming out, white people were coming out — but a lot of that has died down,” she reflected the week before the conference. Convenings like this one, she said, “keep awareness going about those injustices.”</p>\n\n<p><strong>Video evidence, then and now</strong></p>\n\n<p>Over the course of the three-day gathering, nine plenary speakers and more than 20 other presenters in thematically grouped sessions cracked open dialogues at the intersection of video and social justice. Several speakers offered tip-of-the-iceberg introductions to research from their own recent or forthcoming books on these topics.</p>\n\n<p>In the opening session, CMS/W professor and film and media historian Heather Hendershot presented material from her book “When the News Broke: Chicago 1968 and the Polarizing of America” (to be published in December). When Chicago police met antiwar protestors and journalists with brutality on the streets outside the 1968 Democratic National Convention, a large segment of the American public was infuriated by what they saw on their screens — not the violence itself, Hendershot explained, so much as a perceived overemphasis on that violence by trusted network news outlets.</p>\n\n<p>“The reality, from my research findings, is that the media underreported police violence in Chicago,” Hendershot said. Even so, the tumult surrounding the DNC planted the seeds for pervasive accusations of liberal media bias and “fake news” in today’s political landscape.</p>\n\n<p>University of Southern California at Annenberg associate professor of journalism Allissa Richardson also drew connections between history and present-day events in a talk based on her 2020 book, “Bearing Witness While Black: African Americans, Smartphones and the New Protest #Journalism.” The journalist-activists who have documented the Black Lives Matter movement using only their smartphones and Twitter are building, according to Richardson, on a powerful “lineage of Black witnessing” that can be traced back through 19th-century Black newspapers and 18th-century slave narratives.</p>\n\n<p>Kelli Moore, an associate professor of media, culture, and communication at New York University, took the podium with a “provocation” from her own book,&nbsp;“Legal Spectatorship: Slavery and the Visual Culture of Domestic Violence:” “Is it possible the democratization and decentralization of the social media technology we use to proliferate our witnessing participates in the centralization of state control through courtroom power?” Moore studies the photographic and videographic documentation of damage to battered women’s bodies — which often stands in for women’s testimony during court cases — as well as how artificial versions of such images in art and media can shape public understanding of abuse.</p>\n\n<p>The use of video evidence in courtrooms was a recurring theme in several other sessions — including one moderated by Harvard University faculty member and former NAACP president Cornell William Brooks. Among the panelists were University of Cincinnati journalism professor Jeffrey Blevins, who detailed legal precedent for considering bystander filming of police encounters as a First Amendment right, and Sydney Triola, a PhD candidate in information studies at the University of Maryland who is researching the admissibility of “sousveillance” (citizen-made videos) in police misconduct trials. Of more than 10,000 instances of police brutality in Triola’s dataset, fewer than 200 led to criminal charges against officers, and only 98 involved video. But when video evidence did exist, her findings-in-progress indicate, it was generally admitted.</p>\n\n<p>Moore, Triola, and others also questioned what harm can result when images of violence, especially against people of color, go viral outside the courtroom. Social scientist R. Kelly Cameron, another participant in the panel moderated by Brooks, discussed the emotional impact he experienced as a Black man during the events surrounding Floyd’s death. He shared something his father once told him: “No man is ever safe from memories … Whatever the eye sees will forever be ingrained on the mind of the individual.”</p>\n\n<p><strong>Video and justice around the world</strong></p>\n\n<p>Bearing Witness, Seeking Justice took a distinctly global perspective. Presenters reported on the role of video and social media in movements worldwide: from calls in Haiti to denounce sexual violence (#PaFèSilans) and corruption (#KotKòbPetroCaribeA); to condemnation in India of caste-based assaults (#DalitLivesMatter); to legislation challenging police procedures in South Australia (#BanSpitHoods). Other speakers discussed on-the-spot coverage of protests in places including Brazil, Hong Kong, Turkey, and Egypt.</p>\n\n<p>A creative role for video in making social change emerged in another international panel, titled “The Place of Videography in Future Making: Building on Our Pasts.” Featuring several African scholars and artists and organized by MIT professor of science, technology, and society Chakanetsa Mavhunga, the session asked how Africa’s indigenous myths and technologies can be used in place of Western vocabularies and values as the basis to imagine new realities for the African continent. The panelists have produced digital art and film that extrapolates from traditional crafts such as grass-weaving and ritual practices such as “calabashing” (gazing into a water-filled gourd for scenes of the past and future). In artists’ hands, video becomes a tool for speculative design — as Mavhunga put it, a means of “making what did not happen happen, and making what happened not happen in the future.”</p>\n\n<p>Of course, the same digital tools artists employ to expand viewers’ imaginations can be used to deceive. Nonprofit organization WITNESS aims to stay ahead of that danger in the age of deepfakes. Faked videos don’t just spread misinformation — their existence undermines authentic footage as well, said Sam Gregory, WITNESS’s director of programs, strategy, and innovation. For 30 years the organization has endeavored to help people use video and technology to protect and defend human rights. Now one of its goals is “proactively fortifying the truth,” Gregory said, in part through new technologies that track the provenance, editing, and sharing of content. But Gregory also warned that the development of such tools “risks being weaponized against vulnerable witnesses.”</p>\n\n<p><strong>A productive forensic impulse</strong></p>\n\n<p>“All the tools we’re looking at cut both ways,” concluded William Uricchio in the final plenary. An MIT professor of comparative media studies and founder of the MIT Open Documentary Lab, Uricchio used his session to explore how the same “forensic itch” that prompts citizens to document, scrutinize, and call out hidden injustices can lead down a rabbit hole of conspiracy theories. “How can we take that impulse and drive it in a way that’s productive instead of going off the deep end?” he asked.</p>\n\n<p>That question is arguably most urgent for the conference’s youngest attendees — delegations of high school students from Boston; Hartford, Connecticut; and Washington — who are coming of age with video cameras in their pockets. The students convened for a special session, joined by PhD candidates Miles George ’22 and Malik George ’22, twin brothers whose entertaining STEM outreach videos have amassed more than 1.5 million likes on TikTok. Guided by conference manager Fletcher, the high school session challenged the students to examine their assumptions about identity and technology. Fletcher’s goal for the kids — indeed, for all conference attendees — was to send them home equipped to continue the conversation.</p>\n\n<p>“I hope they can be a part of unpacking all of this,” she said. “Hopefully that leads them to be more intentional and careful with videography, and to use it for justice and for good.”</p>\n\n<p>Archived livestreams of most plenary sessions will be posted for public viewing. For more information, visit <a href=\"https://bearing-witness.mit.edu/\">bearing-witness.mit.edu</a>.</p>",
  "media:content": {
    "media:description": "The Bearing Witness, Seeking Justice conference examined video technology’s histories; its role in protecting our rights and civil liberties; its interaction with the press and social media platforms; and its abuses, especially related to surveillance and deepfakes."
  },
  "category": [
    "Special events and guest speakers",
    "Video",
    "Media",
    "Technology and society",
    "Social justice",
    "Film and Television",
    "Diversity and inclusion",
    "Racism",
    "Police",
    "Ethics",
    "Artificial intelligence",
    "Comparative Media Studies/Writing",
    "Program in STS",
    "Journalism",
    "Science communications",
    "Social media",
    "Global",
    "School of Humanities Arts and Social Sciences"
  ]
}