{
  "id": "https://bibleinoneyear.org/en/youth/212",
  "title": "Day 212: How to Avoid Arguments, Deal with Disputes and Stop Fighting",
  "description": "Proverbs 18:17-21, 1 Chronicles 10:13–14a, Romans 14:1–3,5,10–13,15–18.  Sadly, the church is not immune  Right from the start there have been arguments, disputes and in-fighting",
  "pubDate": "Sat, 31 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/212/?ignore",
  "itunes:duration": "14:01",
  "guid": "enyouth31072021-212",
  "length": 841.33,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 212: How to Avoid Arguments, Deal with Disputes and Stop Fighting",
  "itunes:subtitle": "Proverbs 18:17-21, 1 Chronicles 10:13–14a, Romans 14:1–3,5,10–13,15–18.  Sadly, the church is not immune  Right from the start there have been arguments, disputes and in-fighting",
  "itunes:summary": "The referendum on Britain’s membership of the EU resulted in a 52:48 split in favour of leaving. The campaign was hostile, the nation was divided, and the main political parties soon descended into infighting and division. This is one example of what we see across the globe. Every news update seems to include stories of arguments, disputes and fighting.\nWhen sin entered the world, arguments, disputes and fighting began. Adam blamed Eve. Cain murdered his brother. The history of the world ever since has been one of conflict of all kinds.\nWhen people turn away from God, they start fighting one another. We see the breakdown of relationships wherever we look: broken marriages, broken homes, broken relationships at work, civil wars and wars between nations. Sadly, the church is not immune. Right from the start there have been arguments, disputes and in-fighting.\nHow should we handle conflict?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 212
}