{
  "title": "The Edition: Boris’s plans for a new Brexit clash",
  "link": "https://audioboom.com/posts/8078434",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2396,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is Boris Johnson planning to tear up Britain’s deal with the EU?</div>\n<div><br>\n</div>\n<div>James Forsyth says in his <em>Spectator</em> cover story this week that Boris Johnson plans to reignite the Brexit voter base by taking on the EU again over Northern Ireland. He joins the podcast along with Denis Staunton, the London editor of <em>the Irish Times</em>, who writes in this week’s magazine about how Sein Finn has benefited from the DUP’s collapsing support. (00:50)</div>\n<div><br>\n</div>\n<div>Also this week: Does overturning Roe V. Wade stand up to constitutional scrutiny? </div>\n<div><br>\n</div>\n<div>Douglas Murray has written in his column this week about America’s abortion debate, in the wake of the leaked draft of a Supreme Court opinion set to overturn the 1973 decision in Roe V Wade. He joins the podcast along with <em>The Spectator’s </em>economics editor Kate Andrews. (15:09)</div>\n<div><br>\n</div>\n<div>And finally: Is Eton College going through an ‘awokening’? </div>\n<div><br>\n</div>\n<div>In this week’s magazine, <em>The Spectator’s</em> diary editor James Heale turns his attention to Eton College, which he says is having an uncharacteristic identity crisis. James joins the podcast to talk about the direction of the school, along with <em>The Spectator’s</em> literary editor, and Old Etonian, Sam Leith. (28:29)</div>\n<div><br>\n</div>\n<div>Hosted by William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator</em> today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n",
  "pubDate": "Thu, 05 May 2022 14:13:42 +0000",
  "guid": "tag:audioboom.com,2022-05-05:/posts/8078434",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}