{
  "title": "Making remote work, work",
  "link": "https://audioboom.com/posts/8066211",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1985,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>For people who want to go back to the old way of work, the train has left the station. COVID-19 has given a huge impetus to working from home for those jobs that can, where more individuals are able to choose when and where they are most productive, and companies can choose what they want remote work to look like.</div>\n<br>\n<div>\n<a href=\"https://www.bruegel.org/author/giuseppe-porcaro\">Giuseppe Porcaro</a> is joined by <a href=\"https://www.bruegel.org/author/scott-marcus/\">J.Scott Marcus</a> and <a href=\"https://www.bruegel.org/author/lisette-sutherland/\">Lisette Sutherland</a> to explore remote work on both sides of the Atlantic. Together they discuss work-life balance, gender gaps, skill acquisition, modernisation of workflows, technology adoption, managerial culture and flexibility enhancement.</div>\n<div><br>\n</div>\n<br>\n<div><em>Relevant publication:</em></div>\n<div>\n<a href=\"https://www.bruegel.org/wp-content/uploads/2022/02/COVID-19-technology-and-WFH.pdf\"><em>COVID-19 and the accelerated shift to technology-enabled Work from Home (WFH)</em></a><em>, J. Scott Marcus, Georgios Petropoulos and Antonio Aloisi</em>\n</div>\n<br>\n<div>\n<em>This podcast was produced within the project “</em><a href=\"https://www.bruegel.org/eu-us-transatlantic-expert-group-on-the-future-of-work/\"><em>Transatlantic expert group on the future of work</em></a><em> “, with the financial support of the European Union. Its contents are the sole responsibility of Bruegel AISBL and The German Marshall Fund of the United States and do not necessarily reflect the views of the European Union.</em>\n</div>\n",
  "itunes:summary": "How do we address the challenges of remote work? Lessons from both sides of the Atlantic.",
  "pubDate": "Wed, 13 Apr 2022 09:46:19 +0000",
  "guid": "tag:audioboom.com,2022-04-13:/posts/8066211",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}