{
  "title": "Requests for Research",
  "description": "It can be hard to find compelling topics to work on and know what questions to ask when you are just starting as a researcher. This post aims to provide inspiration and ideas for research directions to junior researchers and those trying to get into research.",
  "link": "http://ruder.io/requests-for-research/",
  "guid": "5c76ff7c1b9b0d18555b9ea8",
  "category": [
    "transfer learning",
    "multi-task learning",
    "cross-lingual",
    "meta-learning",
    "domain adaptation"
  ],
  "dc:creator": "Sebastian Ruder",
  "pubDate": "Sun, 04 Mar 2018 15:00:00 GMT",
  "media:content": "",
  "content:encoded": "<!--kg-card-begin: markdown--><!--kg-card-begin: markdown--><img src=\"http://ruder.io/content/images/2018/10/domain_randomization.png\" alt=\"Requests for Research\"><p>This post aims to provide inspiration and ideas for research directions to junior researchers and those trying to get into research.</p>\n<p>Table of contents:</p>\n<ul>\n<li><a href=\"#taskindependentdataaugmentationfornlp\">Task-independent data augmentation for NLP</a></li>\n<li><a href=\"#fewshotlearningfornlp\">Few-shot learning for NLP</a></li>\n<li><a href=\"#transferlearningfornlp\">Transfer learning for NLP</a></li>\n<li><a href=\"#multitasklearning\">Multi-task learning</a></li>\n<li><a href=\"#crosslinguallearning\">Cross-lingual learning</a></li>\n<li><a href=\"#taskindependentarchitectureimprovements\">Task-independent architecture improvements</a></li>\n</ul>\n<p>It can be hard to find compelling topics to work on and know what questions are interesting to ask when you are just starting as a researcher in a new field. Machine learning research in particular moves so fast these days that it is difficult to find an opening.</p>\n<p>This post aims to provide inspiration and ideas for research directions to junior researchers and those trying to get into research. It gathers a collection of research topics that are interesting to me, with a focus on NLP and transfer learning. As such, they might obviously not be of interest to everyone. If you are interested in Reinforcement Learning, OpenAI provides a <a href=\"https://blog.openai.com/requests-for-research-2/\">selection of interesting RL-focused research topics</a>. In case you'd like to collaborate with others or are interested in a broader range of topics, have a look at the <a href=\"https://ai-on.org/\">Artificial Intelligence Open Network</a>.</p>\n<p>Most of these topics are not thoroughly thought out yet; in many cases, the general description is quite vague and subjective and many directions are possible. In addition, most of these are <em>not</em> low-hanging fruit, so serious effort is necessary to come up with a solution. I am happy to provide feedback with regard to any of these, but will not have time to provide more detailed guidance unless you have a working proof-of-concept. I will update this post periodically with new research directions and advances in already listed ones. Note that this collection does not attempt to review the extensive literature but only aims to give a glimpse of a topic; consequently, the references won't be comprehensive.</p>\n<p>I hope that this collection will pique your interest and serve as inspiration for your own research agenda.</p>\n<h2 id=\"taskindependentdataaugmentationfornlp\">Task-independent data augmentation for NLP</h2>\n<p>Data augmentation aims to create additional training data by producing variations of existing training examples through transformations, which can mirror those encountered in the real world. In Computer Vision (CV), common augmentation techniques are <a href=\"https://www.coursera.org/learn/convolutional-neural-networks/lecture/AYzbX/data-augmentation\">mirroring, random cropping, shearing, etc</a>. Data augmentation is super useful in CV. For instance, it has been used to great effect in AlexNet (Krizhevsky et al., 2012) <sup class=\"footnote-ref\"><a href=\"#fn1\" id=\"fnref1\">[1]</a></sup> to combat overfitting and in most state-of-the-art models since. In addition, data augmentation makes intuitive sense as it makes the training data more diverse and should thus increase a model's generalization ability.</p>\n<p>However, in NLP, data augmentation is not widely used. In my mind, this is for two reasons:</p>\n<ol>\n<li>Data in NLP is discrete. This prevents us from applying simple transformations directly to the input data. Most recently proposed augmentation methods in CV focus on such transformations, e.g. domain randomization (Tobin et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn2\" id=\"fnref2\">[2]</a></sup>.</li>\n<li>Small perturbations may change the meaning. Deleting a negation may change a sentence's sentiment, while modifying a word in a paragraph might inadvertently change the answer to a question about that paragraph. This is not the case in CV where perturbing individual pixels does not change whether an image is a cat or dog and even stark changes such as interpolation of different images can be useful (Zhang et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn3\" id=\"fnref3\">[3]</a></sup>.</li>\n</ol>\n<p>Existing approaches that I am aware of are either rule-based (Li et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn4\" id=\"fnref4\">[4]</a></sup> or task-specific, e.g. for parsing (Wang and Eisner, 2016) <sup class=\"footnote-ref\"><a href=\"#fn5\" id=\"fnref5\">[5]</a></sup> or zero-pronoun resolution (Liu et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn6\" id=\"fnref6\">[6]</a></sup>. Xie et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn7\" id=\"fnref7\">[7]</a></sup> replace words with samples from different distributions for language modelling and Machine Translation. Recent work focuses on creating adversarial examples either by replacing words or characters (Samanta and Mehta, 2017; Ebrahimi et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn8\" id=\"fnref8\">[8]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn9\" id=\"fnref9\">[9]</a></sup>, concatenation (Jia and Liang, 2017) <sup class=\"footnote-ref\"><a href=\"#fn10\" id=\"fnref10\">[10]</a></sup>, or adding adversarial perturbations (Yasunaga et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn11\" id=\"fnref11\">[11]</a></sup>. An adversarial setup is also used by Li et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn12\" id=\"fnref12\">[12]</a></sup> who train a system to produce sequences that are indistinguishable from human-generated dialogue utterances.</p>\n<p>Back-translation (Sennrich et al., 2015; Sennrich et al., 2016) <sup class=\"footnote-ref\"><a href=\"#fn13\" id=\"fnref13\">[13]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn14\" id=\"fnref14\">[14]</a></sup> is a common data augmentation method in Machine Translation (MT) that allows us to incorporate monolingual training data. For instance, when training a EN\\(\\rightarrow\\)FR system, monolingual French text is translated to English using an FR\\(\\rightarrow\\)EN system; the synthetic parallel data can then be used for training. Back-translation can also be used for paraphrasing (Mallinson et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn15\" id=\"fnref15\">[15]</a></sup>. Paraphrasing has been used for data augmentation for QA (Dong et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn16\" id=\"fnref16\">[16]</a></sup>, but I am not aware of its use for other tasks.</p>\n<p>Another method that is close to paraphrasing is generating sentences from a continuous space using a variational autoencoder (Bowman et al., 2016; Guu et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn17\" id=\"fnref17\">[17]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn18\" id=\"fnref18\">[18]</a></sup>. If the representations are disentangled as in (Hu et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn19\" id=\"fnref19\">[19]</a></sup>, then we are also not too far from style transfer (Shen et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn20\" id=\"fnref20\">[20]</a></sup>.</p>\n<p>There are a few research directions that would be interesting to pursue:</p>\n<ol>\n<li><strong>Evaluation study:</strong> Evaluate a range of existing data augmentation methods as well as techniques that have not been widely used for augmentation such as paraphrasing and style transfer on a diverse range of tasks including text classification and sequence labelling. Identify what types of data augmentation are robust across task and which are task-specific. This could be packaged as a software library to make future benchmarking easier (think <a href=\"https://github.com/tensorflow/cleverhans\">CleverHans</a> for NLP).</li>\n<li><strong>Data augmentation with style transfer:</strong> Investigate if style transfer can be used to modify various attributes of training examples for more robust learning.</li>\n<li><strong>Learn the augmentation:</strong> Similar to Dong et al. (2017) we could learn either to paraphrase or to generate transformations for a particular task.</li>\n<li><strong>Learn a word embedding space for data augmentation:</strong> A typical word embedding space clusters synonyms and antonyms together; using nearest neighbours in this space for replacement is thus infeasible. Inspired by recent work (Mrkšić et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn21\" id=\"fnref21\">[21]</a></sup>, we could specialize the word embedding space to make it more suitable for data augmentation.</li>\n<li><strong>Adversarial data augmentation:</strong> Related to recent work in interpretability (Ribeiro et al., 2016) <sup class=\"footnote-ref\"><a href=\"#fn22\" id=\"fnref22\">[22]</a></sup>, we could change the most salient words in an example, i.e. those that a model depends on for a prediction. This still requires a semantics-preserving replacement method, however.</li>\n</ol>\n<h2 id=\"fewshotlearningfornlp\">Few-shot learning for NLP</h2>\n<p>Zero-shot, one-shot and few-shot learning are one of the most interesting recent research directions IMO. Following the key insight from Vinyals et al. (2016) <sup class=\"footnote-ref\"><a href=\"#fn23\" id=\"fnref23\">[23]</a></sup> that a few-shot learning model should be explicitly trained to perform few-shot learning, we have seen several recent advances (Ravi and Larochelle, 2017; Snell et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn24\" id=\"fnref24\">[24]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn25\" id=\"fnref25\">[25]</a></sup>.</p>\n<p>Learning from few labeled samples is one of the hardest problems IMO and one of the core capabilities that separates the current generation of ML models from more generally applicable systems. Zero-shot learning has only been investigated in the context of <a href=\"http://ruder.io/word-embeddings-2017/index.html#oovhandling\">learning word embeddings for unknown words</a> AFAIK. Dataless classification (Song and Roth, 2014; Song et al., 2016) <sup class=\"footnote-ref\"><a href=\"#fn26\" id=\"fnref26\">[26]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn27\" id=\"fnref27\">[27]</a></sup> is an interesting related direction that embeds labels and documents in a joint space, but requires interpretable labels with good descriptions.</p>\n<p>Potential research directions are the following:</p>\n<ol>\n<li><strong>Standardized benchmarks:</strong> Create standardized benchmarks for few-shot learning for NLP. Vinyals et al. (2016) introduce a one-shot language modelling task for the Penn Treebank. The task, while useful, is dwarfed by the extensive evaluation on CV benchmarks and has not seen much use AFAIK. A few-shot learning benchmark for NLP should contain a large number of classes and provide a standardized split for reproducibility. Good candidate tasks would be topic classification or fine-grained entity recognition.</li>\n<li><strong>Evaluation study</strong>: After creating such a benchmark, the next step would be to evaluate how well existing few-shot learning models from CV perform for NLP.</li>\n<li><strong>Novel methods for NLP</strong>: Given a dataset for benchmarking and an empirical evaluation study, we could then start developing novel methods that can perform few-shot learning for NLP.</li>\n</ol>\n<h2 id=\"transferlearningfornlp\">Transfer learning for NLP</h2>\n<p>Transfer learning has had a large impact on computer vision (CV) and has greatly lowered the entry threshold for people wanting to apply CV algorithms to their own problems. CV practicioners are no longer required to perform extensive feature-engineering for every new task, but can simply fine-tune a model pretrained on a large dataset with a small number of examples.</p>\n<p>In NLP, however, we have so far only been pretraining the first layer of our models via pretrained embeddings. Recent approaches (Peters et al., 2017, 2018) <sup class=\"footnote-ref\"><a href=\"#fn28\" id=\"fnref28\">[28]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn29\" id=\"fnref29\">[29]</a></sup> add pretrained language model embedddings, but these still require custom architectures for every task. In my opinion, in order to unlock the true potential of transfer learning for NLP, we need to pretrain the entire model and fine-tune it on the target task, akin to fine-tuning ImageNet models. Language modelling, for instance, is a great task for pretraining and could be to NLP what ImageNet classification is to CV (Howard and Ruder, 2018) <sup class=\"footnote-ref\"><a href=\"#fn30\" id=\"fnref30\">[30]</a></sup>.</p>\n<p>Here are some potential research directions in this context:</p>\n<ol>\n<li><strong>Identify useful pretraining tasks:</strong> The choice of the pretraining task is very important as even fine-tuning a model on a related task might only provide limited success (Mou et al., 2016) <sup class=\"footnote-ref\"><a href=\"#fn31\" id=\"fnref31\">[31]</a></sup>. Other tasks such as those explored in recent work on learning general-purpose sentence embeddings (Conneau et al., 2017; Subramanian et al., 2018; Nie et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn32\" id=\"fnref32\">[32]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn33\" id=\"fnref33\">[33]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn34\" id=\"fnref34\">[34]</a></sup> might be complementary to language model pretraining or suitable for other target tasks.</li>\n<li><strong>Fine-tuning of complex architectures:</strong> Pretraining is most useful when a model can be applied to many target tasks. However, it is still unclear how to pretrain more complex architectures, such as those used for pairwise classification tasks (Augenstein et al., 2018) or reasoning tasks such as QA or reading comprehension.</li>\n</ol>\n<h2 id=\"multitasklearning\">Multi-task learning</h2>\n<p>Multi-task learning (MTL) has become more commonly used in NLP. See <a href=\"http://ruder.io/multi-task/\">here</a> for a general overview of multi-task learning and <a href=\"http://ruder.io/multi-task-learning-nlp/\">here</a> for MTL objectives for NLP. However, there is still much we don't understand about multi-task learning in general.</p>\n<p>The main questions regarding MTL give rise to many interesting research directions:</p>\n<ol>\n<li><strong>Identify effective auxiliary tasks:</strong> One of the main questions is which tasks are useful for multi-task learning. Label entropy has been shown to be a predictor of MTL success (Alonso and Plank, 2017) <sup class=\"footnote-ref\"><a href=\"#fn35\" id=\"fnref35\">[35]</a></sup>, but this does not tell the whole story. In recent work (Augenstein et al., 2018) <sup class=\"footnote-ref\"><a href=\"#fn36\" id=\"fnref36\">[36]</a></sup>, we have found that auxiliary tasks with more data and more fine-grained labels are more useful. It would be useful if future MTL papers would not only propose a new model or auxiliary task, but also try to understand why a certain auxiliary task might be better than another closely related one.</li>\n<li><strong>Alternatives to hard parameter sharing:</strong> Hard parameter sharing is still the default modus operandi for MTL, but places a strong constraint on the model to compress knowledge pertaining to different tasks with the same parameters, which often makes learning difficult. We need better ways of doing MTL that are easy to use and work reliably across many tasks. Recently proposed methods such as cross-stitch units (Misra et al., 2017; Ruder et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn37\" id=\"fnref37\">[37]</a></sup> <sup class=\"footnote-ref\"><a href=\"#fn38\" id=\"fnref38\">[38]</a></sup> and a label embedding layer (Augenstein et al., 2018) are promising steps in this direction.</li>\n<li><strong>Artificial auxiliary tasks:</strong> The best auxiliary tasks are those, which are tailored to the target task and do not require any additional data. I have outlined a list of potential <em>artificial</em> auxiliary tasks <a href=\"http://ruder.io/multi-task-learning-nlp/\">here</a>. However, it is not clear which of these work reliably across a number of diverse tasks or what variations or task-specific modifications are useful.</li>\n</ol>\n<h2 id=\"crosslinguallearning\">Cross-lingual learning</h2>\n<p>Creating models that perform well across languages and that can transfer knowledge from resource-rich to resource-poor languages is one of the most important research directions IMO. There has been much progress in learning cross-lingual representations that project different languages into a shared embedding space. Refer to Ruder et al. (2017) <sup class=\"footnote-ref\"><a href=\"#fn39\" id=\"fnref39\">[39]</a></sup> for a survey.</p>\n<p>Cross-lingual representations are commonly evaluated either intrinsically on similarity benchmarks or extrinsically on downstream tasks, such as text classification. While recent methods have advanced the state-of-the-art for many of these settings, we do not have a good understanding of the tasks or languages for which these methods fail and how to mitigate these failures in a task-independent manner, e.g. by injecting task-specific constraints (Mrkšić et al., 2017).</p>\n<h2 id=\"taskindependentarchitectureimprovements\">Task-independent architecture improvements</h2>\n<p>Novel architectures that outperform the current state-of-the-art and are tailored to specific tasks are regularly introduced, superseding the previous architecture. I have outlined <a href=\"http://ruder.io/deep-learning-nlp-best-practices/\">best practices for different NLP tasks</a> before, but without comparing such architectures on different tasks, it is often hard to gain insights from specialized architectures and tell which components would also be useful in other settings.</p>\n<p>A particularly promising recent model is the Transformer (Vaswani et al., 2017) <sup class=\"footnote-ref\"><a href=\"#fn40\" id=\"fnref40\">[40]</a></sup>. While the complete model might not be appropriate for every task, components such as multi-head attention or position-based encoding could be building blocks that are generally useful for many NLP tasks.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>I hope you've found this collection of research directions useful. If you have suggestions on how to tackle some of these problems or ideas for related research topics, feel free to comment below.</p>\n<p>Cover image is from Tobin et al. (2017).</p>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Krizhevsky, A., Sutskever, I., & Hinton, G. E. (2012). Imagenet classification with deep convolutional neural networks. In Advances in neural information processing systems (pp. 1097-1105). <a href=\"#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Tobin, J., Fong, R., Ray, A., Schneider, J., Zaremba, W., & Abbeel, P. (2017). Domain Randomization for Transferring Deep Neural Networks from Simulation to the Real World. arXiv Preprint arXiv:1703.06907. Retrieved from <a href=\"http://arxiv.org/abs/1703.06907\">http://arxiv.org/abs/1703.06907</a> <a href=\"#fnref2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn3\" class=\"footnote-item\"><p>Zhang, H., Cisse, M., Dauphin, Y. N., & Lopez-Paz, D. (2017). mixup: Beyond Empirical Risk Minimization, 1–11. Retrieved from <a href=\"http://arxiv.org/abs/1710.09412\">http://arxiv.org/abs/1710.09412</a> <a href=\"#fnref3\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn4\" class=\"footnote-item\"><p>Li, Y., Cohn, T., & Baldwin, T. (2017). Robust Training under Linguistic Adversity. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics (Vol. 2, pp. 21–27). <a href=\"#fnref4\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn5\" class=\"footnote-item\"><p>Wang, D., & Eisner, J. (2016). The Galactic Dependencies Treebanks: Getting More Data by Synthesizing New Languages. Tacl, 4, 491–505. Retrieved from <a href=\"https://www.transacl.org/ojs/index.php/tacl/article/viewFile/917/212%0Ahttps://transacl.org/ojs/index.php/tacl/article/view/917\">https://www.transacl.org/ojs/index.php/tacl/article/viewFile/917/212\nhttps://transacl.org/ojs/index.php/tacl/article/view/917</a> <a href=\"#fnref5\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn6\" class=\"footnote-item\"><p>Liu, T., Cui, Y., Yin, Q., Zhang, W., Wang, S., & Hu, G. (2017). Generating and Exploiting Large-scale Pseudo Training Data for Zero Pronoun Resolution. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (pp. 102–111). <a href=\"#fnref6\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn7\" class=\"footnote-item\"><p>Xie, Z., Wang, S. I., Li, J., Levy, D., Nie, A., Jurafsky, D., & Ng, A. Y. (2017). Data Noising as Smoothing in Neural Network Language Models. In Proceedings of ICLR 2017. <a href=\"#fnref7\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn8\" class=\"footnote-item\"><p>Samanta, S., & Mehta, S. (2017). Towards Crafting Text Adversarial Samples. arXiv preprint arXiv:1707.02812. <a href=\"#fnref8\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn9\" class=\"footnote-item\"><p>Ebrahimi, J., Rao, A., Lowd, D., & Dou, D. (2017). HotFlip: White-Box Adversarial Examples for NLP. Retrieved from <a href=\"http://arxiv.org/abs/1712.06751\">http://arxiv.org/abs/1712.06751</a> <a href=\"#fnref9\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn10\" class=\"footnote-item\"><p>Jia, R., & Liang, P. (2017). Adversarial Examples for Evaluating Reading Comprehension Systems. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. <a href=\"#fnref10\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn11\" class=\"footnote-item\"><p>Yasunaga, M., Kasai, J., & Radev, D. (2017). Robust Multilingual Part-of-Speech Tagging via Adversarial Training. In Proceedings of NAACL 2018. Retrieved from <a href=\"http://arxiv.org/abs/1711.04903\">http://arxiv.org/abs/1711.04903</a> <a href=\"#fnref11\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn12\" class=\"footnote-item\"><p>Li, J., Monroe, W., Shi, T., Ritter, A., & Jurafsky, D. (2017). Adversarial Learning for Neural Dialogue Generation. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. Retrieved from <a href=\"http://arxiv.org/abs/1701.06547\">http://arxiv.org/abs/1701.06547</a> <a href=\"#fnref12\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn13\" class=\"footnote-item\"><p>Sennrich, R., Haddow, B., & Birch, A. (2015). Improving neural machine translation models with monolingual data. arXiv preprint arXiv:1511.06709. <a href=\"#fnref13\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn14\" class=\"footnote-item\"><p>Sennrich, R., Haddow, B., & Birch, A. (2016). Edinburgh neural machine translation systems for wmt 16. arXiv preprint arXiv:1606.02891. <a href=\"#fnref14\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn15\" class=\"footnote-item\"><p>Mallinson, J., Sennrich, R., & Lapata, M. (2017). Paraphrasing revisited with neural machine translation. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 1, Long Papers (Vol. 1, pp. 881-893). <a href=\"#fnref15\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn16\" class=\"footnote-item\"><p>Dong, L., Mallinson, J., Reddy, S., & Lapata, M. (2017). Learning to Paraphrase for Question Answering. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. <a href=\"#fnref16\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn17\" class=\"footnote-item\"><p>Bowman, S. R., Vilnis, L., Vinyals, O., Dai, A. M., Jozefowicz, R., & Bengio, S. (2016). Generating Sentences from a Continuous Space. In Proceedings of the 20th SIGNLL Conference on Computational Natural Language Learning (CoNLL). Retrieved from <a href=\"http://arxiv.org/abs/1511.06349\">http://arxiv.org/abs/1511.06349</a> <a href=\"#fnref17\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn18\" class=\"footnote-item\"><p>Guu, K., Hashimoto, T. B., Oren, Y., & Liang, P. (2017). Generating Sentences by Editing Prototypes. <a href=\"#fnref18\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn19\" class=\"footnote-item\"><p>Hu, Z., Yang, Z., Liang, X., Salakhutdinov, R., & Xing, E. P. (2017). Toward Controlled Generation of Text. In Proceedings of the 34th International Conference on Machine Learning. <a href=\"#fnref19\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn20\" class=\"footnote-item\"><p>Shen, T., Lei, T., Barzilay, R., & Jaakkola, T. (2017). Style Transfer from Non-Parallel Text by Cross-Alignment. In Advances in Neural Information Processing Systems. Retrieved from <a href=\"http://arxiv.org/abs/1705.09655\">http://arxiv.org/abs/1705.09655</a> <a href=\"#fnref20\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn21\" class=\"footnote-item\"><p>Mrkšić, N., Vulić, I., Séaghdha, D. Ó., Leviant, I., Reichart, R., Gašić, M., … Young, S. (2017). Semantic Specialisation of Distributional Word Vector Spaces using Monolingual and Cross-Lingual Constraints. TACL. Retrieved from <a href=\"http://arxiv.org/abs/1706.00374\">http://arxiv.org/abs/1706.00374</a> <a href=\"#fnref21\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn22\" class=\"footnote-item\"><p>Ribeiro, M. T., Singh, S., & Guestrin, C. (2016, August). Why should i trust you?: Explaining the predictions of any classifier. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (pp. 1135-1144). ACM. <a href=\"#fnref22\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn23\" class=\"footnote-item\"><p>Vinyals, O., Blundell, C., Lillicrap, T., Kavukcuoglu, K., & Wierstra, D. (2016). Matching Networks for One Shot Learning. NIPS 2016. Retrieved from <a href=\"http://arxiv.org/abs/1606.04080\">http://arxiv.org/abs/1606.04080</a> <a href=\"#fnref23\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn24\" class=\"footnote-item\"><p>Ravi, S., & Larochelle, H. (2017). Optimization as a Model for Few-Shot Learning. In ICLR 2017. <a href=\"#fnref24\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn25\" class=\"footnote-item\"><p>Snell, J., Swersky, K., & Zemel, R. S. (2017). Prototypical Networks for Few-shot Learning. In Advances in Neural Information Processing Systems. <a href=\"#fnref25\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn26\" class=\"footnote-item\"><p>Song, Y., & Roth, D. (2014). On dataless hierarchical text classification. Proceedings of AAAI, 1579–1585. Retrieved from <a href=\"http://cogcomp.cs.illinois.edu/papers/SongSoRo14.pdf\">http://cogcomp.cs.illinois.edu/papers/SongSoRo14.pdf</a> <a href=\"#fnref26\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn27\" class=\"footnote-item\"><p>Song, Y., Upadhyay, S., Peng, H., & Roth, D. (2016). Cross-Lingual Dataless Classification for Many Languages. Ijcai, 2901–2907. <a href=\"#fnref27\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn28\" class=\"footnote-item\"><p>Peters, M. E., Ammar, W., Bhagavatula, C., & Power, R. (2017). Semi-supervised sequence tagging with bidirectional language models. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (ACL 2017). <a href=\"#fnref28\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn29\" class=\"footnote-item\"><p>Peters, M. E., Neumann, M., Iyyer, M., Gardner, M., Clark, C., Lee, K., & Zettlemoyer, L. (2018). Deep contextualized word representations. Proceedings of NAACL. <a href=\"#fnref29\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn30\" class=\"footnote-item\"><p>Howard, J., & Ruder, S. (2018). Fine-tuned Language Models for Text Classification. arXiv preprint arXiv:1801.06146. <a href=\"#fnref30\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn31\" class=\"footnote-item\"><p>Mou, L., Meng, Z., Yan, R., Li, G., Xu, Y., Zhang, L., & Jin, Z. (2016). How Transferable are Neural Networks in NLP Applications? Proceedings of 2016 Conference on Empirical Methods in Natural Language Processing. <a href=\"#fnref31\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn32\" class=\"footnote-item\"><p>Conneau, A., Kiela, D., Schwenk, H., Barrault, L., & Bordes, A. (2017). Supervised Learning of Universal Sentence Representations from Natural Language Inference Data. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. <a href=\"#fnref32\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn33\" class=\"footnote-item\"><p>Subramanian, S., Trischler, A., Bengio, Y., & Pal, C. J. (2018). Learning General Purpose Distributed Sentence Representations via Large Scale Multi-task Learning. In Proceedings of ICLR 2018. <a href=\"#fnref33\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn34\" class=\"footnote-item\"><p>Nie, A., Bennett, E. D., & Goodman, N. D. (2017). DisSent: Sentence Representation Learning from Explicit Discourse Relations. arXiv Preprint arXiv:1710.04334. Retrieved from <a href=\"http://arxiv.org/abs/1710.04334\">http://arxiv.org/abs/1710.04334</a> <a href=\"#fnref34\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn35\" class=\"footnote-item\"><p>Alonso, H. M., & Plank, B. (2017). When is multitask learning effective? Multitask learning for semantic sequence prediction under varying data conditions. In EACL. Retrieved from <a href=\"http://arxiv.org/abs/1612.02251\">http://arxiv.org/abs/1612.02251</a> <a href=\"#fnref35\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn36\" class=\"footnote-item\"><p>Augenstein, I., Ruder, S., & Søgaard, A. (2018). Multi-task Learning of Pairwise Sequence Classification Tasks Over Disparate Label Spaces. In Proceedings of NAACL 2018. <a href=\"#fnref36\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn37\" class=\"footnote-item\"><p>Misra, I., Shrivastava, A., Gupta, A., & Hebert, M. (2016). Cross-stitch Networks for Multi-task Learning. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. <a href=\"http://doi.org/10.1109/CVPR.2016.433\">http://doi.org/10.1109/CVPR.2016.433</a> <a href=\"#fnref37\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn38\" class=\"footnote-item\"><p>Ruder, S., Bingel, J., Augenstein, I., & Søgaard, A. (2017). Sluice networks: Learning what to share between loosely related tasks. arXiv preprint arXiv:1705.08142. <a href=\"#fnref38\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn39\" class=\"footnote-item\"><p>Ruder, S., Vulić, I., & Søgaard, A. (2017). A Survey of Cross-lingual Word Embedding Models. arXiv Preprint arXiv:1706.04902. Retrieved from <a href=\"http://arxiv.org/abs/1706.04902\">http://arxiv.org/abs/1706.04902</a> <a href=\"#fnref39\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn40\" class=\"footnote-item\"><p>Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., … Polosukhin, I. (2017). Attention Is All You Need. In Advances in Neural Information Processing Systems. <a href=\"#fnref40\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n<!--kg-card-end: markdown--><!--kg-card-end: markdown-->"
}