{
  "title": "NY Times Buying The Athletic, Big Beverage Partnership, and Potential IPOs",
  "pubDate": "Thu, 06 Jan 2022 21:00:00 +0000",
  "guid": "dfcf9cd3-f7ae-4480-9c68-713921b3dd27",
  "link": "https://fool.libsyn.com/ny-times-buying-the-athletic-big-beverage-partnership-and-potential-ipos",
  "itunes:image": "",
  "description": "<p>The New York Times is reportedly buying The Athletic for $550 million. Rivian Automotive shares fall in the wake of Amazon's new partnership with automaker Stellantis. Bill Mann analyzes those stories, shares what he considers to be the most interesting businesses to watch in the EV industry, and discusses the potential for Constellation Brands' new partnership with Coca-Cola for Fresca Mixed Cocktails.<br /> Later in the show Dylan Lewis and Motley Fool contributor Brian Feroldi take a closer look at three private companies expected to go public this year: Instacart, Reddit, and Stripe.<br /> <br /> Stocks: NYT, RIVN, AMZN, STLA, TM, VWAGY, STZ, KO</p> <p>Host: Chris Hill<br /> Guests: Bill Mann, Dylan Lewis, Brian Feroldi<br /> Engineer: Dan Boyd</p>",
  "content:encoded": "<p>The New York Times is reportedly buying The Athletic for $550 million. Rivian Automotive shares fall in the wake of Amazon's new partnership with automaker Stellantis. Bill Mann analyzes those stories, shares what he considers to be the most interesting businesses to watch in the EV industry, and discusses the potential for Constellation Brands' new partnership with Coca-Cola for Fresca Mixed Cocktails. Later in the show Dylan Lewis and Motley Fool contributor Brian Feroldi take a closer look at three private companies expected to go public this year: Instacart, Reddit, and Stripe.  Stocks: NYT, RIVN, AMZN, STLA, TM, VWAGY, STZ, KO</p> <p>Host: Chris Hill Guests: Bill Mann, Dylan Lewis, Brian Feroldi Engineer: Dan Boyd</p>",
  "enclosure": "",
  "itunes:duration": "28:47",
  "itunes:explicit": false,
  "itunes:keywords": "news,money,investing,business,market,stocks,motley,fool",
  "itunes:subtitle": "The New York Times is reportedly buying The Athletic for $550 million. Rivian Automotive shares fall in the wake of Amazon's new partnership with automaker Stellantis. Bill Mann analyzes those stories, shares what he considers to be the most...",
  "itunes:episodeType": "full"
}