{
  "id": "https://bibleinoneyear.org/en/youth/213",
  "title": "Day 213: Bring People Hope",
  "description": "Psalm 89:46a,47-48,52, 1 Chronicles 11:1a,2–3,9, Romans 14:19, 15:1–6,12–13.  It is hope that pulls faith and love  Without hope everything would stop",
  "pubDate": "Mon, 01 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/213/",
  "itunes:duration": "12:47",
  "guid": "enyouth01082022-213",
  "length": 767.82,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 213: Bring People Hope",
  "itunes:subtitle": "Psalm 89:46a,47-48,52, 1 Chronicles 11:1a,2–3,9, Romans 14:19, 15:1–6,12–13.  It is hope that pulls faith and love  Without hope everything would stop",
  "itunes:summary": "Twenty-one-year-old Matthew had been homeless for three years. Mark Russell (who was appointed head of the Church Army aged only thirty-one) met him on the streets of Charing Cross in London, bought him some food and led him to Christ.\nAs he was getting up to leave he said, ‘Matthew, over the next month I am going to be on platforms speaking to thousands of people. What piece of advice do you want me to give to the Church of England today?’\nMatthew replied, ‘The church’s job is to stop arguing and to bring people hope.’\nMark Russell commented, ‘I have never heard a better definition of what we should be about: Don’t we have a gospel of hope? A gospel that brings hope? A gospel of life, a gospel of transformation and above all a hope of eternal life, the hope of Jesus.’\nMany people see only a hopeless end; but with Jesus you can enjoy an endless hope.\nHope is one of the three great theological virtues – the others being love and faith. As Cardinal Raniero Cantalamessa writes, ‘They are like three sisters. Two of them are grown and the other is a small child. They go forward together hand in hand with the child hope in the middle. Looking at them it would seem that the bigger ones are pulling the child, but it is the other way around; it is the little girl who is pulling the two bigger ones. It is hope that pulls faith and love. Without hope everything would stop.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 578
}