{
  "title": "The tenured engineers of 2022",
  "link": "https://news.mit.edu/2022/tenured-engineers-1024",
  "description": "Fourteen faculty members have been granted tenure in five departments across the MIT School of Engineering.",
  "pubDate": "Mon, 24 Oct 2022 15:30:00 -0400",
  "guid": "https://news.mit.edu/2022/tenured-engineers-1024",
  "dc:creator": "School of Engineering",
  "content:encoded": "<p>The School of Engineering has announced that MIT has granted tenure to 14 members of its faculty in the departments of Biological Engineering, Civil and Environmental Engineering, Electrical Engineering and Computer Science (which reports jointly to the School of Engineering and MIT Schwarzman College of Computing), Materials Science and Engineering, and Mechanical Engineering.</p>\n\n<p>“I am truly amazed by our newest cohort of tenured faculty,” says Anantha Chandrakasan, dean of the School of Engineering and the Vannevar Bush Professor of Electrical Engineering and Computer Science. “They are a diverse group of educators and scholars whose research and commitment to teaching has had a tremendous impact on our community, in the classroom, as well as in the lab.”</p>\n\n<p>This year’s newly tenured associate professors are:</p>\n\n<p><a href=\"https://www.eecs.mit.edu/people/guy-bresler/\">Guy Bresler</a>, an associate professor of electrical engineering and computer science and core faculty member of the Institute for Data, Systems, and Society, conducts research at the interface of information theory, statistics, theoretical computer science, and probability. His work aims to understand the fundamental interplay between information properties, computational complexity, and combinatorial structure in modern statistical inference problems.</p>\n\n<p><a href=\"https://cee.mit.edu/people_individual/otto-cordero/\">Otto Cordero</a>, an associate professor of civil and environmental engineering, studies the ecology and evolution of natural microbial collectives. His lab is interested in understanding how social and ecological interactions at microscales impact the global productivity, stability, and evolutionary dynamics of microbial ecosystems.</p>\n\n<p><a href=\"https://www.eecs.mit.edu/people/michael-carbin/\">Michael Carbin</a>, an associate professor of electrical engineering and computer science, investigates the design, semantics, and implementation of language-driven systems. His focus is on systems that operate in the presence of uncertainty in their environment, implementation, or execution.</p>\n\n<p><a href=\"https://meche.mit.edu/people/faculty/guom@mit.edu\">Ming Guo</a>, an associate professor of mechanical engineering, works at the interface of mechanics, physics, and cell biology, seeking to understand how physical properties and biological function affect each other in cellular&nbsp;and multicellular&nbsp;systems, and how physical and material laws govern the behavior of living cells and their abilities to deform, move, remodel, and function.</p>\n\n<p><a href=\"https://www.eecs.mit.edu/people/stefanie-jegelka/\">Stefanie Jegelka</a>, an associate professor of electrical engineering and computer science, focuses her research on algorithmic machine learning, which spans modeling, optimization algorithms, theory, and applications. In particular, she has been working on exploiting mathematical structure for discrete and combinatorial machine-learning problems, robustness, and the scaling of machine-learning algorithms.</p>\n\n<p><a href=\"http://meche.mit.edu/people/faculty/jeehwan%40mit.edu\">Jeehwan Kim</a>, an associate professor of mechanical engineering and of materials science and engineering, researches topics ranging from basic material physics/mechanics to electronic/photonic devices and systems for next generation electronics. His group focuses on innovation in nanotechnology for next generation computing and electronics</p>\n\n<p><a href=\"https://be.mit.edu/directory/angela-koehler\">Angela Koehler</a>, an associate professor of biological engineering, focuses on building chemical tools and methods for studying temporal aspects of transcriptional regulation in development and disease with a focus on cancer. Her lab pursues these goals by discovering and developing direct small-molecule probes of proteins involved in transcriptional regulation such as&nbsp;transcription factors&nbsp;and&nbsp;chromatin modifying enzymes.</p>\n\n<p><a href=\"https://meche.mit.edu/people/faculty/MKOLLE@MIT.EDU\">Mathias Kolle</a>, an associate professor of mechanical engineering, leverages insights into biological light manipulation strategies to design and realize multifunctional bioinspired optical materials for 21st century technology applications, using cost-efficient, scalable microfabrication, self-assembly based techniques, and biomimetic morphogenesis processes.</p>\n\n<p><a href=\"http://people.csail.mit.edu/kraska/\">Tim Kraska</a>, an associate professor of electrical engineering and computer science, is co-director of the Data System and AI LAB in MIT’s Computer Science and Artificial Intelligence Laboratory (CSAIL), co-founder of Instancio (acquired), and co-founder of Einblick Analytics (<a href=\"http://einblick.ai\">einblick.ai</a>). Currently, his research focuses on building systems for machine learning, increasing the efficiency of data-intensive systems, and democratizing data science through machine learning.</p>\n\n<p><a href=\"https://dmse.mit.edu/people/james-m-lebeau\">James LeBeau</a>, an associate professor of materials science and engineering, focuses on applying and developing revolutionary (scanning) transmission electron microscopy techniques to connect the atomic structure and chemistry of defects/interfaces with material properties for quantum computing, energy storage,&nbsp;power electronics, dielectrics, and optical applications.</p>\n\n<p><a href=\"https://www.eecs.mit.edu/people/luqiao-liu/\">Luqiao Liu</a>, an associate professor of electrical engineering and computer science, focuses on&nbsp;fabricating nanoscale spintronic devices&nbsp;to achieve efficient control over magnetic dynamics. He&nbsp;also explores new material and physics mechanisms to improve the performance of spintronic devices for memory, logic, and neuromorphic applications.</p>\n\n<p><a href=\"https://dmse.mit.edu/people/robert-j-macfarlane\">Robert Macfarlane</a>, an associate professor of materials science and engineering, is focused on developing&nbsp;a set of design principles for synthesizing new inorganic/organic composite materials,&nbsp;where nanoscale structure can be manipulated to tune the emergent physical properties of a bulk material.</p>\n\n<p><a href=\"https://cee.mit.edu/people_individual/desiree-plata/\">Desirée Plata</a>, an associate professor of in civil and environmental engineering, focuses her research on novel material and industrial process design; carbon-based transformations; global carbon management and response strategies; resource management utilization and efficiency; and environmental sustainability.</p>\n\n<p><a href=\"https://dmse.mit.edu/people/c-cem-tasan\">C. Cem Tasan</a>, the Thomas B. King Professor of Metallurgy and associate professor of materials science and engineering, explores the boundaries of physical metallurgy, solid mechanics, and in-situ microscopy to design new alloys with exceptional damage-resistance.</p>",
  "media:content": {
    "media:description": "Top row, left to right: Guy Bresler, Otto Cordero, Michael Carbin, Ming Guo, and Stefanie Jegelka; Middle row, left to right: Jeehwan Kim, Angela Koehler, Mathias Kolle, Tim Kraska, and James LeBeau; Bottom row, left to right: Luqiao Lui, Robert Macfarlane, Desirée Plata, and C. Cem Tasan."
  },
  "category": [
    "Faculty",
    "Biological engineering",
    "Civil and environmental engineering",
    "Electrical Engineering & Computer Science (eecs)",
    "DMSE",
    "Mechanical engineering",
    "Computer Science and Artificial Intelligence Laboratory (CSAIL)",
    "School of Engineering",
    "MIT Schwarzman College of Computing",
    "Awards, honors and fellowships",
    "Materials science and engineering"
  ]
}