{
  "title": "Liang Fu and Patrick Lee receive Larkin Awards in Theoretical Physics",
  "link": "https://news.mit.edu/2022/liang-fu-patrick-lee-receive-larkin-awards-theoretical-physics-1031",
  "description": "Inaugural award goes to MIT condensed matter theory professors of physics.",
  "pubDate": "Mon, 31 Oct 2022 16:45:00 -0400",
  "guid": "https://news.mit.edu/2022/liang-fu-patrick-lee-receive-larkin-awards-theoretical-physics-1031",
  "dc:creator": "Sandi Miller | Department of Physics",
  "content:encoded": "<p>MIT condensed matter theory professors of physics <a href=\"https://physics.mit.edu/faculty/liang-fu/\" target=\"_blank\">Liang Fu</a> and <a href=\"https://physics.mit.edu/faculty/patrick-lee/\" target=\"_blank\">Patrick A. Lee</a> received the inaugural <a href=\"https://cse.umn.edu/ftpi/larkin-award\">Larkin Awards</a> in Theoretical&nbsp;Physics, awarded by the William I. Fine Theoretical Physics Institute at the University of Minnesota.</p>\n\n<p>Fu received the<strong> </strong>2022 Anatoly Larkin Award for a junior researcher for his work on 3D topological insulators and odd-parity topological superconductors, crystalline topological insulators, and Majorana zero modes,&nbsp;“and for being an intellectual leader of his generation.”</p>\n\n<p>Fu is interested in novel topological phases of matter in solid state physics to predict new phases of matter and topological materials.<strong> </strong>He works on the theory of topological insulators and topological superconductors, and the potential applications of topological materials, ranging from tunable electronics and spintronics to quantum computation.</p>\n\n<p>He received his BS in physics from the University of Science and Technology of China in 2004 and his PhD in physics from the University of Pennsylvania in 2009. He was a junior fellow at Harvard University before joining the MIT Department of Physics as an assistant professor in 2012.</p>\n\n<p>His previous awards include the 2018 Simons Investigator Award,<strong>&nbsp;</strong>the 2016&nbsp;New Horizons in Physics Prize, the 2014 Raymond and Beverly Sackler International Prize in Physics, the 2014<strong>&nbsp;</strong>Packard Fellowship for Science and Engineering, and the 2013&nbsp;Department of Energy Early Career Award.</p>\n\n<p>“I am truly honored and grateful to receive the Larkin junior award,” says Fu. “I also thank my mentors, collaborators, and students for their contribution and support over the years.”</p>\n\n<p>Lee, the<strong> </strong>William &amp; Emma Rogers Professor of Physics, received the 2022 Anatoly Larkin Senior Researcher Award in Theoretical Physics for his influential research in strongly correlated electronic systems, which are materials where the interactions between electrons play a crucial role and lead to novel phenomena not explainable by single electron band structure effects.</p>\n\n<p>The award mentioned his theories of the quantum transport phenomena in mesoscopic and superconducting systems, “and for his standing in the community.”</p>\n\n<p>As a senior researcher in the Condensed Matter Theory Group, Lee’s interests are focused on high-temperature superconductors as well as “mesoscopic physics,” the study of small devices at low temperatures. He has also made important contributions to the theory of disordered electronic systems, including introducing the concept of universal conductance fluctuations to describe such small devices.</p>\n\n<p>A native of Hong Kong, Lee studied physics at MIT, receiving his BS in 1966 and his PhD in 1970. He was a physics instructor at Yale University until 1972, and an assistant professor of physics at the University of Washington until 1974. He was at the Theoretical Physics Department at Bell Laboratories for 10 years until joining the MIT Department of Physics in 1982. Lee was awarded the 2005 Dirac Medal of the International Centre for Theoretical Physics and the 1991 Oliver Buckley Prize of the American Physical Society. &nbsp;</p>\n\n<p>The award is named after the late Russian-American&nbsp;theoretical physicist Anatoly Larkin. Lee says that he has been a long-time admirer of Larkin, with whom he collaborated on several publications.&nbsp;</p>\n\n<p>The awardees are invited to deliver a colloquium for the School of Physics and Astronomy at the University of Minnesota in March 2023.</p>",
  "media:content": {
    "media:description": "Condensed matter theory professors of physics Liang Fu (left) and Patrick Lee are the recipients of the inaugural Larkin Awards in Theoretical Physics.",
    "media:credit": "Photos: Justin Knight"
  },
  "category": [
    "Awards, honors and fellowships",
    "Faculty",
    "Physics",
    "Materials Research Laboratory",
    "Plasma Science and Fusion Center",
    "Alumni/ae",
    "Research",
    "Superconductors",
    "Quantum computing",
    "Quantum physics",
    "School of Science"
  ]
}