{
  "title": "Former Abkhazian Separatist Official Calls for Joining Russia-Belarus Union State",
  "link": "https://jamestown.org/former-abkhazian-separatist-official-calls-for-joining-russia-belarus-union-state/",
  "dc:creator": "web1983",
  "pubDate": "Thu, 05 Nov 2020 20:37:54 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=87732",
  "description": "<p>Recent comments by former vice president of the separatist Georgian region of Abkhazia Valery Arshba indicate a split between the older political elite and the current administration of President Aslan Bzhania (Gazeta-ra.info, October 19; Civil.ge, October 23). Arshba called for the breakaway republic to join the Union State of Russia and Belarus, “without losing [its] sovereignty.” Arshba himself has a &#8230; <a href=\"https://jamestown.org/former-abkhazian-separatist-official-calls-for-joining-russia-belarus-union-state/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/former-abkhazian-separatist-official-calls-for-joining-russia-belarus-union-state/\">Former Abkhazian Separatist Official Calls for Joining Russia-Belarus Union State</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>Recent comments by former vice president of the separatist Georgian region of Abkhazia Valery Arshba indicate a split between the older political elite and the current administration of President Aslan Bzhania (<a href=\"http://gazeta-ra.info/index-1.php?ELEMENT_ID=22418\">Gazeta-ra.info</a>, October 19; <a href=\"https://civil.ge/archives/377009\">Civil.ge</a>, October 23). Arshba called for the breakaway republic to join the Union State of Russia and Belarus, “without losing [its] sovereignty.”</p>\n<p>Arshba himself has a turbulent history in Abkhaz politics. He served two terms as vice president (1995–2005) before being fired by then-president Vladislav Ardzinba, who accused him of supporting a coup (<a href=\"https://www.ekhokavkaza.com/a/29449726.html\">Ekho Kavkaza</a>, August 23, 2018). During his time as vice president, Abkhazia sought an “associate status” with Russia, a vague term that acknowledged that the spheres of cooperation went beyond those defined by the Union State treaty (<a href=\"https://www.rferl.org/a/1341917.html\">RFE/RL</a>, October 29, 2001). Additionally, Arshba personally called for a treaty on peace and cessation of hostilities with Tbilisi several times following the Rose Revolution (<a href=\"https://www.rferl.org/a/1143073.html\">RFE/RL</a>, January 9, 2004). After a failed bid for the presidency in 2004, he stepped back from the spotlight but has maintained his connections to the top levels of government, currently serving as head of the Abkhaz Olympic Committee (<a href=\"http://presidentofabkhazia.org/about/info/news/?ELEMENT_ID=10313\">Presidentofabkhazia.org</a>, March 15, 2019).</p>\n<p>Arshba’s comments come a few months after some emerging Russian politicians called for the outright annexation of Abkhazia (<a href=\"https://jam-news.net/russia-annexation-abkhazia-south-ossetia/\">Jam-news.net</a>, July 8), a call that was condemned by the Abkhazian parliament, discounted on Russian social media and treated warily by Georgians seeking a Kremlin connection. The Abkhazians themselves have not supported full annexation by Russia after the August 2008 War, but public opinions on joining the Union State are not known—a 2014 poll simply asked about “integration with Russia,” not specifying the method of integration (<a href=\"https://www.rferl.org/a/Abkhaz_Leader_We_Are_An_Independent_Country_And_That_Will_Not_Change/1961980.html\">RFE/RL</a>, February 18, 2010; <a href=\"https://www.washingtonpost.com/news/monkey-cage/wp/2014/03/20/how-people-in-south-ossetia-abkhazia-and-transnistria-feel-about-annexation-by-russia/\">Washington Post</a>, March 20, 2014; <a href=\"https://agenda.ge/en/news/2016/1422\">Agenda.ge</a>, June 10, 2016). It is worth noting that former president Sergei Bagapsh, whom Arshba backed after dropping out of the 2004 election, previously called for Abkhazia to join the Union State, and the Belarus-Kazakhstan-Russia Customs Union, during his first official visit to Moscow in 2010 (<a href=\"https://www.kavkaz-uzel.eu/articles/165528/\">Kavkazsky Uzel</a>, February 17, 2010), although there is no indication this proposal was publicly supported. The suggestions from hardliners in both Abkhazia and Russia contrast greatly with those of Bzhania, who took over from embattled president Raul Khajimba after winning the March elections.</p>\n<p>The current Abkhazian <em>de facto</em> president has spoken openly about his desire for an open dialogue with Georgia, both before and after the election, while maintaining that any talks must occur with Abkhazia as an independent state (see <a href=\"https://jamestown.org/program/changes-in-the-separatist-abkhazian-government-and-implications-for-relations-with-tbilisi/\">EDM</a>, June 15). Based on an interview with Georgian <em>First Channel</em>, the 2018 peace plan—which was proposed by Georgia and swiftly rejected by both Abkhazia and South Ossetia in a decision attributed to their reliance on Moscow—is not off the table for Bzhania (see <a href=\"https://jamestown.org/program/abkhazia-and-south-ossetia-reject-georgias-peace-plan/\">EDM</a>, April 18, 2018; <a href=\"https://1tv.ge/en/news/aslan-bzhania-we-do-not-ask-georgia-to-recognise-the-state-of-abkhazia-but-non-use-of-force-agreement-will-allow-us-to-engage-in-a-dialogue/\">1tv.ge</a>, July 9). The main political opposition, led by former presidential candidate and Minister for Economy Adgur Ardzinba, does not actually disagree with his positions regarding Russian citizenship and real estate rights, but its members are much less open toward Georgia (<a href=\"https://jam-news.net/ru/%d0%b0%d0%b1%d1%85%d0%b0%d0%b7%d0%b8%d1%8f-%d0%be%d0%bf%d0%bf%d0%be%d0%b7%d0%b8%d1%86%d0%b8%d1%8f-%d0%bd%d0%b0%d1%80%d0%be%d0%b4%d0%bd%d0%be%d0%b5-%d0%b4%d0%b2%d0%b8%d0%b6%d0%b5%d0%bd%d0%b8%d0%b5/\">Jam-news.net</a>, October 10).</p>\n<p>Georgian politicians appear not to have officially responded to Bzhania’s calls for dialogue since January, prior to his victory (<a href=\"https://jam-news.net/abkhaz-opposition-leader-calls-for-dialogue-w-georgia-how-has-tbilisi-responded/\">Jam-news.net</a>, January 17; <a href=\"https://oc-media.org/features/as-abkhazia-calls-for-dialogue-will-tbilisi-answer/\">Oc-media.org</a>, September 22). However, Georgia has made other kinds of overtures during the pandemic, such as offering to provide assistance in addition to already available Georgian medical care (<a href=\"https://agenda.ge/en/news/2020/918\">Agenda.ge</a>, March 24; <a href=\"https://www.mei.edu/publications/abkhazia-georgia-and-covid-opportunity-crisis?s=09\">Mei.edu</a>, September 28). More recently, on a cultural note, Georgian President Salome Zurabishvili tweeted a video recording to commemorate Abkhaz Language Day (<a href=\"https://twitter.com/Zourabichvili_S/status/1321166900592857088\">Twitter.com/Zourabichvili_S</a>, October 27). In the recording, she said both sides could work toward the preservation of the Abkhaz language, “regardless of the line of occupation.” The self-proclaimed Ministry of Foreign Affairs for the Republic of Abkhazia did not receive these comments favorably, disagreeing with Abkhaz’s status on the UNESCO list of endangered languages and accusing the Georgians of “committing a genocide of the Abkhaz people in 1992–1993” (<a href=\"https://www.apsnypress.info/ru/item/1282-mid-abkhazii-sokhranenie-abkhazskogo-yazyka-luchshe-vsego-mozhet-obespechit-nalichie-abkhazskoj-gosudarstvennosti-i-abkhazskogo-etnosa\">Apsnypress.info</a>, October 27).</p>\n<p>It is difficult to evaluate the actual level of popular support for Arshba’s comments, since no public opinion polls exist concerning Abkhazia’s hypothetical accession to the Union State. With the current political leadership displaying openness toward Georgia, Sukhumi is unlikely to pursue closer ties with Moscow. However, Abkhazian politics is anything but stable, involving contested elections, poisonings, Russian involvement and revolutions; so current policy stances are not reliable indicators of future developments. Considering this, there are two reasons, long-term and extending beyond internal Abkhazian politics, why the so-called Abkhaz Republic will likely not join the Union State nor gain some other formal closer merger with Russia.</p>\n<p>First, the Abkhazia-Russia relationship is already closer than contours of integration defined by the (only partially implemented) Union State treaty. Over the past decade, Russia has invested in Abkhazia’s infrastructure, electrical grid and military modernization (see EDM, <a href=\"https://jamestown.org/program/is-moscows-proposal-to-link-abkhazia-to-the-circassian-parts-of-north-caucasus-a-step-toward-annexation/\">October 24, 2014</a>, <a href=\"https://jamestown.org/program/russia-declares-new-initiatives-to-modernize-army-of-breakaway-abkhazia/\">September 25, 2019</a>; <a href=\"https://www.agenda.ge/en/news/2019/547\">Agenda.ge</a>, February 27, 2019). However, the crucial, economically sustaining funds from the Kremlin have been drying up in recent years, a phenomenon only accentuated by the current COVID-19 crisis (<a href=\"https://www.mei.edu/publications/abkhazia-georgia-and-covid-opportunity-crisis?s=09\">Mei.edu</a>, September 28). Despite this close relationship, there are still two major Russian policy goals Bzhania has stymied: he has prevented Abkhazians from being able to gain Russian citizenship and refused to grant the right to buy and own real estate to Russian nationals (see <a href=\"https://jamestown.org/program/changes-in-the-separatist-abkhazian-government-and-implications-for-relations-with-tbilisi/\">EDM</a>, June 15). The latter point in particular has frustrated Moscow, with Foreign Minister Sergei Lavrov commenting that they “are a little surprised that this problem remains unresolved” (<a href=\"https://civil.ge/archives/375350\">Civil.ge</a>, October 14). Abkhazia’s accession to the Union State would likely bring about a policy shift in these matters; however, conceding on the real estate issue would cause an uproar in Abkhazia, as it would negate decades of public cries against Georgianization and the dilution of Abkhaz power over their homeland.</p>\n<p>Second, any further formalizing of the close Abkhazian-Russian ties would complicate the Circassian question. Russia is currently considering merging the Republic of Adygea with Krasnodar Krai in an attempt to reduce the number of North Caucasus republics, causing a great amount of backlash among local Circassians (see <a href=\"https://jamestown.org/program/circassians-unite-to-fight-amalgamation-of-adygea-and-krasnodar-krai/\">EDM</a>, June 16, 2020; <a href=\"https://regnum.ru/news/polit/2487657.html\">Regnum</a>, September 24, 2018). The Abkhaz would likely support the Circassian cause, as they have before: In 2017, Ruslan Gvashev, a Shapsugh activist and Abkhaz war hero, faced prosecution by the Russian government for the “organization of an unauthorized action,” during which he and several other Shapsughs prayed around a tree on the Circassian memorial day of mourning (<a href=\"https://chegem.su/images/PDF/2017/CHP_10_591.pdf\">Chegem.su</a>, September 28, 2017). But Arshba, at the behest of then-President Khajimba, accompanied a presidential envoy to visit Gvashev at his home, where he was carrying on a hunger strike to protest the court’s decision against him, to indicate the Abkhazian government’s support for him. The question then becomes whether the Abkhaz will extend their support beyond territorial boundaries, to topics such as the repatriation of the Circassian diaspora back to their homeland in the Northwest Caucasus.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/former-abkhazian-separatist-official-calls-for-joining-russia-belarus-union-state/\">Former Abkhazian Separatist Official Calls for Joining Russia-Belarus Union State</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}