{
  "id": "yt:video:LNO5lWseIw8",
  "yt:videoId": "LNO5lWseIw8",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "Brainstorming Plot Ideas For A Movie - Sean Reid",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-22T00:00:22+00:00",
  "updated": "2022-10-22T00:00:24+00:00",
  "media:group": {
    "media:title": "Brainstorming Plot Ideas For A Movie - Sean Reid",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "BUY THE GAME- PITCHSTORM: Card Game of Pitching Horrible Movie Ideas to The Worst Executives\nhttps://amzn.to/3yxwbOP\n\nSean Reid is a veteran Producer/Director/Writer of feature films, television programming, news and music specials. His television experience includes management roles at E! NEWS LIVE (E!) andTHE ROB NELSON SHOW (Fox), as well as producer position and SQUARE OFF (TV Guide Channel) and CENTRAL AVE (Fox).\n\nIn addition to running his own production company New Cinema Tribe and a new streaming network WORLD ONE TV, he has produced, DEATHDAY, BAD EYES, BROWN VIBES: THE STORY OF REDEMPTION,  REDEMPTION, HORRORS OF WAR, RHYMECOLOGY: WRITE BETTER RHYMES, ALIENS VS BIGFOOT and upcoming feature CRAVING.\n\nCONNECT WITH SEAN REID\nhttps://www.imdb.com/name/nm0717424\nhttps://www.instagram.com/seanaldenreid\nhttps://www.youtube.com/ronisean\nhttps://www.youtube.com/JHorton\nhttps://twitter.com/seanareid\nhttps://www.tiktok.com/@seanreid857\n\nRELATED VIDEOS\nWhy Your Movie Idea Isn't Good Enough - https://youtu.be/RhR027n4AO4\n4 Tips To Help Writers Brainstorm Ideas - https://youtu.be/JBGk_OSeUHI\nHow To Think Up A Movie Idea Every Two Minutes  - https://youtu.be/Njeba5TcQu0\nSimple Ideas Make Great Movies - https://youtu.be/WA3mZHRUxLk\nNo Writer Is Smart Enough To Come Up With 20 Bad Ideas In A Row - https://youtu.be/ahJtjHoBkZE\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#movies #writing #story",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}