{
  "title": "Buddhism and peace-building in Samlot District’s Kampong Lapov",
  "link": "https://www.newmandala.org/buddhism-and-peace-building-in-samlot-districts-kampong-lapov/",
  "dc:creator": "Bunly Soeung",
  "pubDate": "Thu, 20 Oct 2022 04:02:38 +0000",
  "category": [
    "Cambodia",
    "Culture and Tradition",
    "Identity",
    "Religion"
  ],
  "guid": "https://www.newmandala.org/?p=60051",
  "description": "<p>Through Buddhist ceremonies, relations between perpetrators and victims from different places have been reconnected and restructured.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/buddhism-and-peace-building-in-samlot-districts-kampong-lapov/\">Buddhism and peace-building in Samlot District’s Kampong Lapov</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>Studies on Cambodian post-conflict peacemaking efforts by international communities and state-centric institutional support have been extensive. However, local peacebuilding efforts at a community level, which are increasingly active in this war-torn society, received scant attention.</p>\n<p>Using the lens of local community and local knowledge for sustainable and effective peacemaking conceptualised by <a href=\"https://networks.h-net.org/node/28443/reviews/2237612/lee-hellmu%CC%88ller-interaction-between-local-and-international\">Dr. SungYong Lee</a>, this article looks at culturally Buddhist peacebuilding efforts in Samlot after it was officially integrated to mainstream society in 1998.</p>\n<p>Samlot lies in Cambodia’s Northwestern critical and military strategic site, where a rural <a href=\"https://globeaware.org/showcase/showcase-cambodia/item/5622-history\">revolt</a> against the Sihanouk government erupted in 1967. During the 1980s and 1990s, it was a <a href=\"https://www.khmertimeskh.com/50863622/one-dies-another-injured-in-landmine-explosion-in-battambang/\">bloody battlefield</a> between the government forces and Khmer Rouge. It was also the most <a href=\"http://archives.the-monitor.org/index.php/publications/display?url=lm/1999/english/cambodia.html\">heavily mine infested area</a> in the country.</p>\n<p>The battle between Khmer Rouge and government forces did not end after the 1993 UN-organized elections. However, in 1996, <a href=\"https://www.phnompenhpost.com/national/dnum-gives-integration\">4,400 Khmer Rouge guerillas</a> defected and were integrated with government forces. In September 1997, when former Khmer Rouge fighters began fighting to take control of Samlot back from the government, <a href=\"https://www.phnompenhpost.com/national/samlot-erupts-refugees-flee\">approximately 20,000 people</a> fled for refugee camps in Thailand. In 1998, around 78 former Khmer Rouge soldiers and families in Samlot’s Kampong Lapov commune were finally integrated.</p>\n<p>Although the civil war came to an end, many people were reluctant to travel to Samlot due to security concerns, while people in Samlot felt it unsafe to leave. A few people entered Samlot to give basic foods in exchange for illegally logged timber, including bamboo.</p>\n<h4>Wat- pagoda reconstruction</h4>\n<p>Under the Khmer Rouge, Theravada Buddhism was almost <a href=\"https://silkwormbooks.com/products/buddhism-in-a-dark-age\">completely extinguished</a> and monastic communities were systematically obliterated. However, after the integration of Khmer Rouge soldiers and their families in the mid to late 1990s, re-constructing <em>wat</em> was one of the top priorities. In 2000, elderly men and <em>achar</em> (laymen) called upon community residents to offer contribution for <em>wat</em> construction in Samlot’s Kampong Lapov. As donations for <em>wat</em> construction are considered a meritorious deed, community residents wholeheartedly offered wood, time and labor to initially build a small temporary wooden alms hall<em> (sala chhotean</em>)- with a corrugated iron roof. Two <em>sanghas</em> (Buddhist monks) from Battambang town’s <em>wat </em>Por Veal were invited to reside at that newly constructed <em>sala chhotean</em>.</p>\n<p>As <em>Wat</em> Kampong Lapov was established, cultural and religious activities in the communities were gradually revived through everyday rituals including funeral and wedding ceremonies as well as annual ceremonies including <em>bon phka prak</em> (fundraising ceremony) and <em>bon pchum ben</em> (ceremonies commemorating the dead). Through these ceremonies, relations between Samlot community residents and <em>wat</em> goers from different places were reconnected and restructured while their collective, traumatic first-hand experiences of civil war were reconciled. <em>Wat</em> Kampong Lapov had transformed the post-war torn communities through cultural activities and ceremonies where all four groups of monastic and male and female lay monks assembled for religious rituals and ceremonies together.</p>\n<p>A Battambang town resident put it “Joining ceremonies together at <em>wat</em>, we deeply know and understand one another. We piously earned merit together. Meritoriously, the rich might donate much money while the poor graciously donate just a can of rice. There is neither animosity nor retaliation but a sense of solidarity to jointly earn merit and rebuild our Buddhism”.</p>\n<p>While an elderly resident in Samlot asserted “We definitely cannot live without Wat and Buddhist <em>sanghas</em> in our daily lives. It is our tradition that we need them to preside over and perform ritual activities on the occasion of funeral, wedding ceremony and other Buddhist ceremonies”</p>\n<p>The <em>wat</em> and <em>sanghas</em>’ role in the communities in performing ritual and religious activities gradually began to be revitalised. The pagoda committee (<em>Kanakkamkar achar wat)</em> continued calling for donations from Buddhist followers in Samlot and elsewhere through <em>bon phka prak</em>. It received cash donations from community residents in Battambang town, Siem Reap province, and Phnom Penh capital, especially Sangkat Chak Anrae. From 2006, the donation from generous Cambodians in the country and overseas, including the USA, increased as infrastructure like roads and bridges were improved. At the same time, <em>wat</em> Kampong Lapov offered small donations to other <em>wats </em>in different provinces. Through <em>bon phka prak</em>, relations between Samlot community residents and outsiders were further restored and developed. This built confidence, trustworthiness, solidarity, mindfulness, coexistence, reciprocal support and shared destiny.   <em class=\"help-text\"> \n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/human-dignity-as-a-tool-for-human-rights-education-in-cambodian-law-schools/\">\n\t\t\t\t\t<img width=\"278\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2022/07/1087px-30_Aug_2011_Visitors_2/2106759999.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/human-dignity-as-a-tool-for-human-rights-education-in-cambodian-law-schools/\">“Human dignity” as a tool for human rights education in Cambodian law schools</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>Promoting of foundational human rights values in Cambodia’s politically sensitive climate.</p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/rachelandgillian/\">Rachel Killean and Gillian Kane</a>\n\t\t\t\t\n\t\t\t\t\t12 July, 2022\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t </em></p>\n<p>As the Kampong Lapov commune chief noted, “Through<em> bon phak prak, </em>we commit wholesome deeds together at wat which is a peaceful place. We simply see each other as fellow Buddha’s followers rather than Samlot community residents or non-Samlot community residents while forgetting about our brutalised past. It is our fate to meet one another at wat where we engage in joint activities such as listening to<em> dhamma </em>talks, having meals, and having everyday life conversations.</p>\n<p>Meanwhile, a local resident in Battambang town said “<em>Bon phka prak </em>is like a thread that literally binds outsiders (Samlot community residents) and insiders (Battambang town residents) together. We begin to understand one another regardless of social and political background. We piously commit wholesome deed together to earn merit and basically revive our Buddhism together”</p>\n<p>The annual <a href=\"https://www.phnompenhpost.com/national/background-history-pchum-ben\">Buddhist-animist <em>bon pchum ben</em></a> ceremony is observed by Cambodians to express grief and remembrance for their ancestors. In Samlot, <em>bon pchum ben</em> was completely absent due to the Khmer Rouge’s policy of abolishing Buddhism, and the protracted civil war that followed. However, it became crucial after the civil war was completely over in 1998.</p>\n<p>In Kampong Lapov, after the <em>wat </em>was established, <em>bon pchum ben</em> was observed immediately. At the time, very few people from outside of Samlot took turns (<em>dak ven)</em> to prepare foods for <em>sanghas</em> and Samlot community residents. However, in 2006, the infrastructure was improved and community residents from elsewhere came to Samlot to join <em>bon pchum ben. </em>Ahead of <em>bon pchum ben</em>, the pagoda committee issued a roster of people or villages responsible for preparing foods. Through <em>dak ven</em>, greater solidarity between community residents was established.</p>\n<p><em>Bon pchum ben</em> not only connected the laity with their deceased ancestors through ritual activities including <em>Bangskol</em>, a funerary ritual performed to transfer merit to a deceased person, it also connected Samlot community residents, non-Samlot community residents and Buddhist monks from Samlot and Battambang town. It allowed them to meritoriously join ritual activities presided over by the <em>sanghas</em>, sharing meal, memories and life experience. Customarily, people have lunch together after the <em>sanghas</em> have finished lunch.</p>\n<p>An elderly resident in O Choam of Kampong Lapov said: “I felt insecure whenever I travelled out of Samlot. We did not deeply know and understand one another yet. However,<em> bon pchum ben</em> at <em>wat</em> allowed us to look into one another’s eyes in a strong spirit that we are Khmers and devoted Buddha followers alike. I simply began a simple conversation by asking where they are from”.</p>\n<h4>Dhammyietra – march with dhamma</h4>\n<p>Around 2538 years ago, Buddha went into the <a href=\"https://www.proquest.com/docview/2562195947\">bloody battlefield</a> to stop the terrible war between the <a href=\"https://www.vridhamma.org/Why-Was-the-Sakyan-Republic-Destroyed\">Sakyan and Koliyan clans</a> over the sharing of Rohini river water for their crop irrigation, and over 30 years ago a Buddhist monk Maha Ghosananda led a Dhammayietra into the hostile battlefield between the Khmer Rouge and government forces in Cambodia. According to Maha Ghosananda, <em>dhammayietra</em> is a way of life fostering all kind of means to have a peaceful life without violence.</p>\n<p>At least a <a href=\"https://www.centrepeaceconflictstudies.org/cpcs-receives-first-peace-museum-archives/\">thousand people</a> including Buddhist <em>sanghas</em>, nuns, laypeople, local villagers and foreigners joined this annual <a href=\"https://towardfreedom.org/story/archives/asia-archives/ven-maha-ghosananda-walking-for-peace-in-cambodia/\">Dhammayietra</a> whose route passed through many of the country’s active hostile battlefields and landmine ridden regions including <a href=\"https://www.voacambodia.com/a/a-40-2009-03-09-voa1-90171927/1357165.html\">Samlot</a>. Marchers usually took up to 45 days to reach their destination, travelling around 650 kilometers. It first started in 1992 and finished in 1997, and focused on repatriation, elections, civil war, landmines and illegal logging. During the final 1997 Dhammayietra  <a href=\"http://d.dccam.org/Archives/Chronology/Chronology.htm\">Ieng Sary</a>—former deputy prime minister of Democratic Kampuchea and infamously responsible for its genocide—asked for <a href=\"https://readthespirit.com/interfaith-peacemakers/maha-ghosananda/\">forgiveness</a>.</p>\n<p>The Dhammayietra <a href=\"https://cambodiapeacegallery.org/exhibitions/reconciliation-and-healing/\">involved</a> talks with villagers, deep listening to villagers’ real-life stories and fears, tree ordaining, water blessings, and education through example on loving kindness, non-violent conflict resolution and reconciliation. Utilising its local legitimacy, Dhammayietra played critical roles in reconnecting Khmer Rouge guerrillas, government forces, laypeople, Buddhist monks, and community residents divided by protracted civil wars, and in restoring Cambodians’ mental health and courage for compassion, forgiveness, mindfulness, nonviolence, peace and reconciliation.</p>\n<p>A <em>sangha</em> who once took part in Dhammayietra said: “Maha Ghosananda approached government armed forces and asked for ceasefire so that Dhammayietra could move further to Pailin and he went to meet with Khmer Rouge forces to ask for ceasefire. An hour later, he returned and gave a less-than-10-minute <em>dhamma</em> talk on peaceful mind to around a thousand participants including armed forces. It was amazing that all participants listened to it in complete silence”.</p>\n<p>According to Maha Ghosananda, “Every step is a meditation, nonviolence, prayers and mindfulness. Every step will build a bridge: national reconciliation and social trust. Every step is forgiveness and compassion. Each step is peace and it begins today and every day”.  Retaliate against violence by loving kindness”</p>\n<p>As religious leaders, <em>sanghas</em> enjoy their social and cultural legitimacy through three key elements of religious authority, extensive local knowledge and social networks. These were powerful sources for mobilising resources and participation across communities.</p>\n<p>Commenting on this religious authority, a resident in Battambang put it <em>“</em>For me, <em>sanghas</em> are highly respected intellectuals. They are religious leaders who set a pattern of good conduct and morality for Cambodians. In the communities, we cannot live without them actually. We always meritoriously offer support for either their personal development and wat development as well”.</p>\n<p>Buddhist monks’ in-depth knowledge of both religious and secular traditions allow them to decide the procedure of ritual ceremonies and interpret their significance. For instance, in the 14<sup>th</sup> century, most influential <em>chbab</em> (codes of conduct) were written by <em>sanghas</em>. They deliver dhamma talks on the centrality of Buddha’s teaching in order to educate communities about culture, history and morality, helping them to deal with misunderstanding and fear while gaining trust.</p>\n<p>The revival of Buddhism, particularly the <em>wat</em> re-establishment in Samlot would not have been possible without leadership of <em>kanakkamkar achar wat </em>and<em> sanghas </em>that has broader social networks. Buddhism has played a vibrant and constructive role in post-conflict peacebuilding in Cambodia, restoring and rebuilding relation amongst Cambodians. However, its entrenched cultural and social power can be further revitalised to reconcile the relations of the many traumatised perpetrators and victims of the Khmer Rouge genocide, especially as the Khmer Rouge tribunal is to close permanently by this year’s end.</p>\n<p>One practical way that Buddhism can be mainstreamed to address reconciliation is through perpetrator-victim dialogue. As a peaceful space where former perpetrators and victims meet to earn merit on precept day (<em>thngai sel</em>) especially, the <em>wat </em>can be a conducive venue for such dialogue. These dialogues should encourage perpetrators to openly share their experiences of life under the Khmer Rouge, accept responsibility, and express remorse and apology while victims who share their painful experiences can offer forgiveness and feel a sense of justice. The dialogue will help redress a haunting silence while building a collective memory from which Cambodians can move forward.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/buddhism-and-peace-building-in-samlot-districts-kampong-lapov/\">Buddhism and peace-building in Samlot District’s Kampong Lapov</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}