{
  "title": "SC EP:254 It had a look like \"I'm going to kill you\" Reloaded",
  "itunes:title": "SC EP:254 It had a look like \"I'm going to kill you\" Reloaded",
  "pubDate": "Sat, 17 Sep 2016 20:00:00 +0000",
  "guid": "http://www.blogtalkradio.com/bigfoothotspot/2016/09/17/sc-ep254-it-had-a-look-like-im-going-to-kill-you-reloaded",
  "link": "https://sasquatchchronicles.com/sc-ep254-it-had-a-look-like-im-going-to-kill-you-reloaded/",
  "itunes:image": "",
  "description": "<p>Steve returns from <strong><em>SC EP:249 It had a look like “I’m going to kill you”</em></strong> Steve took my advice and spoke to his friend who is in law enforcement, and both men returned to the site of the encounter. You might be surprised to hear what happen to these guys when they returned. Steve also shares what his friend told him about these creatures and how they handle encounter reports. After returning to the site and spending time with his law enforcement friend, Steve was paid a visit letting him know he saw a bear and not to discuss this in the future...</p> <p><u>Background</u>: Steve writes \"I was completely frozen with fear I was 20 feet from the shoreline and this thing was about 10 feet in the tree line… I could not do anything except sit there and stare…. I watched it for what seemed to be forever but it was prob a minute as this thing was going nuts…. And as quick as it started it stopped, I was in the coast guard and went through several training and all but nothing could prepare me for what happened next…. I was at the point of fight or flight but there was no way I was gonna fight…. As I tried to gather my thoughts and pick up my jaw and figure out if I pissed myself or not …this palm branch moved to the side and I saw this …… Monster… Just staring at me.\"</p>",
  "content:encoded": "<p>Steve returns from <em>SC EP:249 It had a look like “I’m going to kill you”</em> Steve took my advice and spoke to his friend who is in law enforcement, and both men returned to the site of the encounter. You might be surprised to hear what happen to these guys when they returned. Steve also shares what his friend told him about these creatures and how they handle encounter reports. After returning to the site and spending time with his law enforcement friend, Steve was paid a visit letting him know he saw a bear and not to discuss this in the future...</p> <p>Background: Steve writes \"I was completely frozen with fear I was 20 feet from the shoreline and this thing was about 10 feet in the tree line… I could not do anything except sit there and stare…. I watched it for what seemed to be forever but it was prob a minute as this thing was going nuts…. And as quick as it started it stopped, I was in the coast guard and went through several training and all but nothing could prepare me for what happened next…. I was at the point of fight or flight but there was no way I was gonna fight…. As I tried to gather my thoughts and pick up my jaw and figure out if I pissed myself or not …this palm branch moved to the side and I saw this …… Monster… Just staring at me.\"</p>",
  "enclosure": "",
  "itunes:duration": "01:00:17",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "Steve returns from SC EP:249 It had a look like “I’m going to kill you” Steve took my advice and spoke to his friend who is in law enforcement, and both men returned to the site of the encounter. You might be surprised to hear what happen to...",
  "itunes:episode": 254,
  "itunes:episodeType": "full"
}