{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-1680611628746490776",
  "published": "2022-10-18T14:33:00.002+05:00",
  "updated": "2022-10-18T14:33:05.286+05:00",
  "category": [
    "",
    ""
  ],
  "title": "Zeb Bangash performed to raise funds for flood effectees in Pakistan at TUFTS university",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEivFxm3bkJ0EVMFkjyVP07POc6ybnGIfC8T7dD3uLrQnfrTrztsP_xSpOsEWCVga7YNMSKXktgQ6j2YbYYRaUnqyLZPZ_opAzisMIevAD2VOAun3BEfIeZUhWeBhJr589K3e_Gp69hTED1X3zlvnJiZwnOacP11dvEilUVue-1NG7bocBzSrXofM-Gk9w/s2048/IMG-20221014-WA0228.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" data-original-height=\"2048\" data-original-width=\"1365\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEivFxm3bkJ0EVMFkjyVP07POc6ybnGIfC8T7dD3uLrQnfrTrztsP_xSpOsEWCVga7YNMSKXktgQ6j2YbYYRaUnqyLZPZ_opAzisMIevAD2VOAun3BEfIeZUhWeBhJr589K3e_Gp69hTED1X3zlvnJiZwnOacP11dvEilUVue-1NG7bocBzSrXofM-Gk9w/s320/IMG-20221014-WA0228.jpg\" width=\"213\" /></a></div><p>Pakistan:- Azaadi', a concert to raise funds to facilitate flood relief efforts in Pakistan. Zeb Bangash took to the stage the Alderman Arts Center at Tufts University held recently.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>On special invitation from Prof. Ayesha Jalal and as part of the Harvard - Tufts Conference to mark the 75th anniversary of independence and partition titled ‘Empire, Nation, Federation: South Asia’s Freedom in Global Perspective’,&nbsp;&nbsp;</p><p><br /></p><p>The performance received not only a standing ovation but also an encore from an august gathering. A wonderful conference with superb intellectual contributions and a fabulous musical performance by Zeb Bangash.”, remarked Dr. Sen</p><p><br /></p><p><br /></p><p><br /></p><p>\"As India and Pakistan turn 75, so does their unique equation. ‘Azaadi’ is my personal bid to celebrate the shared cultural richness of the subcontinent. Music has always helped me transcend boundaries&nbsp; and ‘belong’– it’s been a freeing experience, and a privilege, to access&nbsp; audiences across South Asia even in times of estrangement; which is why I am deeply honoured and humbled to be given the opportunity to take the stage at Tufts at this very special gathering.” says Zeb.</p><p><br /></p><p><br /></p><p><br /></p><p>Zeb who through her music has become one of the region’s most loved voices, curated for the performance a multilingual set-list that began with ‘Maula Maula’ and concluded with ‘Paimona’ with an interlude of ‘Roshe’ and ‘Chan Kithan’ among a host of other classics, showcased her versatility of style, genre and language. Zeb's performance included her well known signature tunes such as ‘Aaja Re Moray Saiyyan’, as well as rare inclusions such as her rendition of Majaz Lakhnawi’s famous poem ‘Awaara’ and ‘Wahan Kahn Hai Tera’ an ode to the iconic Sachin Dev Burman. The repertoire for the evening seemed to be a reflection on the concept of the theme and Zeb’s trained vocals easily flowed through the varied genres languages and styles.</p><p><br /></p><p><br /></p><p><br /></p><p>\"Zeb Bangash's enchanting voice mesmerized the audience of scholars and students in a packed Distler Performance Hall at the Harvard-Tufts Conference on the 75th anniversary of South Asia's freedom. Her soulful and uplifting music enables us to cross so many lines of difference in today's troubled times.\" says, Prof. Sugata Bose of Harvard University.</p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><p>Prof. Jalal summed up Zeb’s showcase very aptly: \"A wonderful and scintillating performance that was joyous, soulful and entertaining. Zeb is at the peak of her singing career. We are very fortunate to have had a chance to hear her sing live.\"</p><p><br /></p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Afsar Khan",
    "uri": "https://www.blogger.com/profile/07647311323995108452",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}