{
  "id": "yt:video:nFnGw7Dik9o",
  "yt:videoId": "nFnGw7Dik9o",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Fantastic Numbers and Where to Find Them: A Cosmic Quest from Zero to Infinity | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-09-30T16:00:36+00:00",
  "updated": "2022-10-04T03:41:30+00:00",
  "media:group": {
    "media:title": "Fantastic Numbers and Where to Find Them: A Cosmic Quest from Zero to Infinity | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Leading theoretical physicist Antonio Padilla discusses his new book, \"Fantastic Numbers and Where to Find Them: A Cosmic Quest from Zero to Infinity\" – a combination of popular and cutting-edge science, and a lively, entertaining, and even funny exploration of the most fundamental truths about the universe.\n\nGet the book here: https://goo.gle/3AWhS6u.\n\nFor particularly brilliant theoretical physicists like James Clerk Maxwell, Paul Dirac, or Albert Einstein, the search for mathematical truths led to strange new understandings of the ultimate nature of reality. But what are these truths? What are the mysterious numbers that explain the universe? In Fantastic Numbers and Where to Find Them, Antonio takes us on an irreverent cosmic tour of nine of the most extraordinary numbers in physics, offering a startling picture of how the universe works.\n\nThese strange numbers include Graham’s number, which is so large that if you thought about it in the wrong way, your head would collapse into a singularity; TREE(3), whose finite nature can never be definitively proved, because to do so would take so much time that the universe would experience a Poincaré Recurrence―resetting to precisely the state it currently holds, down to the arrangement of individual atoms; and 10^{-120}, measuring the desperately unlikely balance of energy needed to allow the universe to exist for more than just a moment, to extend beyond the size of a single atom―in other words, the mystery of our unexpected universe.\n\nLeading us down the rabbit hole to a deeper understanding of reality, Antonio explains how these unusual numbers are the key to understanding such mind-boggling phenomena as black holes, relativity, and the problem of the cosmological constant―that the two best and most rigorously tested ways of understanding the universe contradict one another. \n\nAntonio Padilla is a leading theoretical physicist and cosmologist at the University of Nottingham. In 2016, he and his team shared the Buchalter Cosmology Prize for their work on the cosmological constant. He is also a star of the YouTube channel Numberphile, where his most popular videos include a discussion of Ramanujan’s sum of all positive integers, which has been viewed more than eight million times.\n\nModerated by Gabe Gaster.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}