{
  "title": "From soup to Bayes:  Make inferences using strong assumptions not because you &#8220;believe&#8221; your model but because you don&#8217;t believe it.",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/21/from-soup-to-bayes-make-inferences-using-strong-assumptions-not-because-you-believe-your-model-but-because-you-dont-believe-it/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/21/from-soup-to-bayes-make-inferences-using-strong-assumptions-not-because-you-believe-your-model-but-because-you-dont-believe-it/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Fri, 21 Oct 2022 13:07:27 +0000",
  "category": [
    "Bayesian Statistics",
    "Miscellaneous Statistics"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48115",
  "description": "Seth Frey writes: There are mostly useless of bits of cognitive psychology that I’ve always loved. For example, a lot of categorization research about life on the edge of what objects are what. How flat can a bowl be before &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/21/from-soup-to-bayes-make-inferences-using-strong-assumptions-not-because-you-believe-your-model-but-because-you-dont-believe-it/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Seth Frey <a href=\"https://enfascination.com/weblog/post/2476\">writes</a>:</p>\n<blockquote><p>There are mostly useless of bits of cognitive psychology that I’ve always loved. For example, a lot of categorization research about life on the edge of what objects are what. How flat can a bowl be before it’s a plate? How narrow can a mug be before it’s a cup? How big can a cup be before it’s a bowl? Can it have a handle and not be a cup? When does too much handle make it a spoon? These are questions that can be used to create little microcosms for the study of things like culture, learning, expectations, and all kinds of complexities around the kinds of traits we’re surprisingly sensitive to.</p></blockquote>\n<p>This reminds me of the old question of whether cereal with milk is a soup.  The answer seems evidently no, but it&#8217;s not immediately clear why.  If you eat cereal with milk for lunch instead of breakfast, does it become a soup?  If not, I&#8217;d say the problem is not with the bits of cereal&#8212;some soups do have bits of bread or rice or something else floating in them&#8212;but with the milk.  Milk is just too simple to be a soup base.  For that matter, if you drank a bowl of tomato sauce, you&#8217;d be drinking tomato sauce, not tomato soup.  So I think that for something to be &#8220;soup,&#8221; it requires some preparation or alteration of its non-soup components.</p>\n<p>Surprisingly, often the dictionary can help with these sorts of challenges of understanding.  Looking up &#8220;soup,&#8221; we get the definition, &#8220;a liquid food made by boiling or simmering meat, fish, or vegetables with various added ingredients.&#8221;  That doesn&#8217;t sound completely right, either&#8212;for example, gazpacho is considered a soup and it doesn&#8217;t involve any boiling&#8212;but there is the &#8220;added ingredients&#8221; thing.  Yes, cereal is added to the bowl of milk (or vice-versa), but the cereal doesn&#8217;t quite feel like an &#8220;ingredient.&#8221;</p>\n<p>The dictionary gives this definition of &#8220;soup up&#8221;:  &#8220;to improve the capacity for speed or increase the efficiency of (a motor or engine) by increasing the richness of the fuel mixture or the efficiency of the fuel, or by adjusting the engine.&#8221;  This seems relevant, as it captures the idea of soup being rich in some way, being more than a sum of its parts.  Cereal with milk is just the sum of its parts; it&#8217;s not &#8220;souped up.&#8221;</p>\n<p>The point of this discussion is not to obsess over definitions of soup but rather to reflect that this sort of discussion can, paradoxically, be helpful in developing our understanding.</p>\n<p>I say &#8220;paradoxically&#8221; here because it would be natural to think that a discussion such as &#8220;Is cereal a soup?&#8221; is pointless because definitions are arbitrary, you can define &#8220;soup&#8221; to be whatever you want it to be, and in any case no definition is completely precise&#8212;it&#8217;s a coastline-of-Britain sort of thing&#8212;and so this would all seem to be as pointless as an argument over whether the nickname for Stephanie should be spelled Steph or Stef.</p>\n<p>But, no, I argue that the above example demonstrates that something <em>can</em> be learned from such a discussion, that it is not a sterile debate going in circles.  I&#8217;d argue the debate is more of a helix than a circle, in that it moves forward while turning.  To put it another way, the discussion (I wouldn&#8217;t call it a debate) on whether cereal is a soup is an entry point toward thinking harder about soup.  I wouldn&#8217;t say that thinking hard about soup is the most important goal in life, but, yeah, I do feel that my understanding is slightly deeper now.  I&#8217;ve filled in a couple of nodes in my general network of understanding.</p>\n<p>How does this relate to statistics?</p>\n<p>All our models are wrong but they can still be useful.  Often the value of a model is in its refutation.  Or, to say it more carefully:  by being specific with our modeling, we can learn from the ways in which it does not accurately predict the world.</p>\n<p>This sort of thing happens a lot in science, that the way to understand an idea is to make specific assumptions and push through their implications, looking at, in Frey&#8217;s words, &#8220;life on the edge of what objects are what.&#8221;  And this is one reason I like an assumption-rich approach to statistics.</p>\n<p>Set up a full joint distribution and use it to make (Bayesian) inferences, not because you &#8220;believe&#8221; your model but because you <em>don&#8217;t</em> believe it&#8212;because you don&#8217;t believe any model.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/21/from-soup-to-bayes-make-inferences-using-strong-assumptions-not-because-you-believe-your-model-but-because-you-dont-believe-it/feed/",
  "slash:comments": 59
}