{
  "title": "S1E16 - Mindset is Everything with Speed Skater Apolo Ohno",
  "guid": "https://pinecast.com/guid/a4d98559-019d-445e-83f0-324f75eab580",
  "pubDate": "Tue, 22 Sep 2020 06:30:00 -0000",
  "itunes:duration": "01:10:37",
  "description": "<p>The one and only Apolo Ohno is Laura’s very special guest on the podcast today.\nAfter claiming his first major speed skating title at the US Championships at the age of 14, Apolo went from kid prodigy to the most decorated US Winter Olympian in history—a title he still holds—earning eight Olympic medals in short-track speed skating across the 2002, 2006, and 2010 Winter Games. Many of you will remember that he was also involved in one of the craziest short track speed skating races in history where, after colliding with 3 other racers and hitting the wall, he managed to skate over the line and win a silver medal. He shares that story and much more in the episode today.</p>\n<p>Apolo begins the conversation by reflecting upon his first broadcasting experience, the effects of the Olympic postponement on athletes, and the first sports in which he participated as a child. He then compares and contrasts short track and long track speed skating, and relates his storied career in speed skating, including the game changing life lesson his father taught him, the importance and power of his shift in mindset, and especially the tremendous impact that sports psychology has had upon his performance. Apolo goes into great detail about the ‘assertive intentionality’ which revolutionized his training, and he provides all the details behind his infamous silver medal at the 2002 Olympics and his transformation as he reinvented himself for the 2010 Olympics. This fascinating conversation concludes with Apolo offering his sage advice for athletes. As an athlete who has experienced so very much throughout his remarkable career, Apolo Ohno possesses a unique perspective on setting goals and accessing each and every ‘reservoir of potential’ during their pursuit. Today you have a front row seat to hear him share his extensive knowledge, insight, and wisdom with Laura in this very special episode.</p>\n<p>Episode Highlights:</p>\n<p>·   Apolo’s first broadcasting experience\n·   The effects of the Olympic postponement on athletes\n·   His early sports experiences\n·   Short track and long track speed skating\n·       Apolo’s speed skating career\n·       The life lesson his father taught him which changed Apolo’s life\n·       The importance and power of his change in mindset\n·       The impact that sports psychology had upon his performance\n·       Apollo’s ‘assertive intentionality’ around training\n·       The story of his 2002 Olympics\n·       His transformation for his 2010 Olympics\n·       Apolo’s advice for athletes</p>\n<p>Quotes:</p>\n<p>“It looked so impossible to me that these guys were leaning over at these impossible angles, going like 30 miles an hour, inside of a hockey rink. It just was so cool looking.”</p>\n<p>“I don’t like racing against the clock – that seems very boring to me – I liked racing against other athletes and testing my might against them.”</p>\n<p>“I was racing against men who were 30, 35 years old, who had been skating and training longer than I had been alive on this planet, and I was beating them with ease which was very, very weird.”</p>\n<p>“At a flip of a switch, I was now being talked about as being a statistic, as being a kid who had it all but threw it away, who didn’t know what hard work and discipline was. And that was painful.”</p>\n<p>“Whatever it is, I want to see real dedication and commitment from you.”</p>\n<p>“It’s only a true failure if you stay down.”</p>\n<p>“I have a mindset…that you are not willing to go to. I will go to the places in my mind that you are afraid to go through.”</p>\n<p>“I have something upstairs and in my heart that other people around me do not have.”</p>\n<p>“I had this untapped reservoir of potential, and that was my mind.”</p>\n<p>“You’ve got to take pleasure in those small wins.”</p>\n<p>“I was able to make such assertive intentionality around each training, pre-, during, and post-, that the quality of my training went so high.”</p>\n<p>“Everything scarred me in some degree, and…it wasn’t healthy back then, but when it comes down to sheer performance, I think there was no one that was more driven.”</p>\n<p>“We, as a country, needed to see some athlete like that, to get knocked down when he was supposed to win, and to not complain about it, and to not gripe about it, but to say...‘Life happens’…it was a blessing.”</p>\n<p>“I’m so grateful that I didn’t win that race…anything else would have been different.”</p>\n<p>“It was really about me exhausting any and all of the options, leaving no stones unturned in that preparation.”</p>\n<p>“Every up, every down, every mediocre performance is an incredible learning experience and opportunity to light that fire within.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a></p>\n<p>Laura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Apolo: </p>\n<p>Website:  <a href=\"https://www.apoloohno.com/\" rel=\"nofollow\">https://www.apoloohno.com/</a>\nInstagram: <a href=\"https://www.instagram.com/apoloohno\" rel=\"nofollow\">https://www.instagram.com/apoloohno</a>\nTwitter: <a href=\"https://twitter.com/ApoloOhno\" rel=\"nofollow\">https://twitter.com/ApoloOhno</a></p>",
  "itunes:title": "Mindset is Everything with Speed Skater Apolo Ohno",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 16
}