{
  "title": "How a Dual Curing Adhesive Works",
  "link": "https://spectrum.ieee.org/master-bond-uv22dc80-1-dual-cure-epoxy",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-person-uses-a-brush-to-apply-epoxy-to-a-set-of-lenses.jpg?id=31844049&width=1500&height=2000&coordinates=1069%2C0%2C1069%2C0\"/><br/><br/><p>\n<em>This sponsored article is brought to you by <a href=\"https://www.masterbond.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Master Bond</a>.</em>\n</p><p>\n<a href=\"https://www.masterbond.com/video/product-spotlight-uv22dc80\" rel=\"noopener noreferrer\" target=\"_blank\">Master Bond UV22DC80-1</a> is a nanosilica filled, dual cure epoxy based system. Nanosilica filled epoxy formulations are designed to further improve performance and processing properties.\n</p><p>\n\tThe specific filler will play a crucial role in determining key parameters such as viscosity, flow, aging characteristics, strength, shrinkage, hardness, and exotherm. As a dual curing system, UV22DC80-1 cures readily upon exposure to UV light, and will cross link in shadowed out areas when heat is added.\n</p><hr/><h3>See Master Bond's UV22DC80-1 in Action</h3><br/><span class=\"rm-shortcode\" data-rm-shortcode-id=\"9674f9b6e22739e3e15edf2d3fc9d849\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/nSbU4uhbVrc?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span><p>Dual cure systems are effective for rapidly fixturing parts with the UV portion of the cure, and then concluding the process by adding heat. Watch this video to see a dual cured epoxy in action.</p><h3></h3><br/><p>This compound features exceptionally low shrinkage upon cure, outstanding dimensional stability, and resists abrasion. It is not oxygen inhibited. It withstands chemicals such as acids, bases, fuels and solvents. It is electrically insulative with a volume resistivity greater than 10<sup>14</sup> ohm-cm. It is optically clear, with a refractive index of 1.52. </p><p>The low viscosity ranges from 500 cps to 3500 cps. The temperature serviceability extends from -100°F to 300°F. UV22DC80-1 bonds well to metals, ceramics, glass, rubber, and many plastics. It passes NASA low outgassing certification and is used in high tech applications including aerospace, optical and opto-electronics.<span></span></p><p><a href=\"https://www.masterbond.com/tds/uv22dc80-1\" target=\"_blank\">Contact Master Bond to request a technical data sheet or discuss your application.</a></p>",
  "pubDate": "Tue, 04 Oct 2022 17:50:36 +0000",
  "guid": "https://spectrum.ieee.org/master-bond-uv22dc80-1-dual-cure-epoxy",
  "category": [
    "Epoxy",
    "Ultraviolet",
    "Adhesive",
    "Master bond",
    "Nasa"
  ],
  "dc:creator": "Master Bond",
  "media:content": ""
}