{
  "title": "How Card Skimming Disproportionally Affects Those Most In Need",
  "link": "https://krebsonsecurity.com/2022/10/how-card-skimming-disproportionally-affects-those-most-in-need/",
  "comments": "https://krebsonsecurity.com/2022/10/how-card-skimming-disproportionally-affects-those-most-in-need/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Wed, 19 Oct 2022 01:28:46 +0000",
  "category": "All About Skimmers",
  "guid": "https://krebsonsecurity.com/?p=61587",
  "description": "When people banking in the United States lose money because their payment card got skimmed at an ATM, gas pump or grocery store checkout terminal, they may face hassles or delays in recovering any lost funds, but they are almost always made whole by their financial institution. Yet, one class of Americans -- those receiving food assistance benefits via state-issued prepaid debit cards -- are particularly exposed to losses from skimming scams, and usually have little recourse to do anything about it.",
  "content:encoded": "<p>When people banking in the United States lose money because their payment card got <a href=\"https://krebsonsecurity.com/?s=atm+skimmer\" target=\"_blank\" rel=\"noopener\">skimmed at an ATM</a>, <a href=\"https://krebsonsecurity.com/?s=pump+skimmers\" target=\"_blank\" rel=\"noopener\">gas pump</a> or <a href=\"https://krebsonsecurity.com/?s=checkout+skimmer+overlay\" target=\"_blank\" rel=\"noopener\">grocery store checkout terminal</a>, they may face hassles or delays in recovering any lost funds, but they are almost always made whole by their financial institution. Yet, one class of Americans &#8212; those receiving food assistance benefits via state-issued prepaid debit cards &#8212; are particularly exposed to losses from skimming scams, and usually have little recourse to do anything about it.</p>\n<div id=\"attachment_61644\" style=\"width: 682px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61644\" loading=\"lazy\" class=\" wp-image-61644\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/califebt.png\" alt=\"\" width=\"672\" height=\"425\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/califebt.png 912w, https://krebsonsecurity.com/wp-content/uploads/2022/10/califebt-768x485.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/califebt-782x494.png 782w\" sizes=\"(max-width: 672px) 100vw, 672px\" /><p id=\"caption-attachment-61644\" class=\"wp-caption-text\">California&#8217;s EBT card does not currently include a chip. That silver square is a hologram.</p></div>\n<p>Over the past several months, authorities in multiple U.S. states have reported rapid increases in skimming losses tied to people who receive assistance via Electronic Benefits Transfer (EBT), which allows a <a href=\"https://www.fns.usda.gov/snap/supplemental-nutrition-assistance-program\" target=\"_blank\" rel=\"noopener\">Supplemental Nutrition Assistance Program</a> (SNAP) participant to pay for food using SNAP benefits.</p>\n<p>When a participant uses a SNAP payment card at an authorized retail store, their SNAP EBT account is debited to reimburse the store for food that was purchased. EBT is used in all 50 states, the District of Columbia, Puerto Rico, the Virgin Islands, and Guam.</p>\n<p>EBT cards work just like regular debit cards, in that they can be used along with a personal identification number (PIN) to pay for goods at participating stores, and to withdraw cash from an ATM.</p>\n<p>However, EBT cards differ from debit cards issued to most Americans in two important ways. First, <a href=\"https://krebsonsecurity.com/2022/10/glut-of-fake-linkedin-profiles-pits-hr-against-the-bots/\" target=\"_blank\" rel=\"noopener\">most states</a> do not equip EBT cards with smart chip technology, which can make payment cards much more difficult and expensive for skimming thieves to clone.</p>\n<p>Alas, it is no accident that all of the states reporting recent spikes in fraud tied to EBT accounts &#8212; including <a href=\"https://abc30.com/atm-skimmers-ebt-money-stolen-credit-card-theft-bank-of-america/11814857/\" target=\"_blank\" rel=\"noopener\">California</a>, <a href=\"https://www.nbcconnecticut.com/news/local/state-warns-residents-who-receive-snap-ebt-benefits-after-learning-about-skimming-phishing-incidents/2849775/\" target=\"_blank\" rel=\"noopener\">Connecticut</a>, <a href=\"https://www.thebaltimorebanner.com/community/criminal-justice/one-womans-quest-for-justice-after-almost-3000-of-benefits-were-stolen-LHIKMQZSNJBULC7LXCEIE264OA/\" target=\"_blank\" rel=\"noopener\">Maryland</a>, <a href=\"https://www.fox43.com/article/news/crime/york-county-ebt-card-cloning-thefts/521-64b60fbd-b4be-4fd9-8928-5c6ed8d45faa\" target=\"_blank\" rel=\"noopener\">Pennsylvania</a>, <a href=\"https://www.newschannel5.com/news/nashville-family-scammed-in-ebt-card-skimmer-scheme\" target=\"_blank\" rel=\"noopener\">Tennessee</a>, and <a href=\"http://wtkr.com/news/chesapeake-mom-warns-others-of-ebt-scam-after-losing-benefits\" target=\"_blank\" rel=\"noopener\">Virginia</a> appear to currently issue chip-less cards to their EBT recipients.</p>\n<div id=\"attachment_61661\" style=\"width: 622px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61661\" loading=\"lazy\" class=\" wp-image-61661\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/mass-dta.png\" alt=\"\" width=\"612\" height=\"377\" /><p id=\"caption-attachment-61661\" class=\"wp-caption-text\">The Massachusetts SNAP benefits card looks more like a library card than a payment card.  Oddly enough, both are reliant on the same fundamentally insecure technology: The magnetic stripe, which stores cardholder data in plain text that can be easily copied.</p></div>\n<p>In September, authorities in California arrested three men thought to be part of a skimming crew that specifically targeted EBT cards and balances. The men allegedly installed <a href=\"https://krebsonsecurity.com/2022/09/say-hello-to-crazy-thin-deep-insert-atm-skimmers/\" target=\"_blank\" rel=\"noopener\">deep insert skimmers</a>, and stole PINs using tiny hidden cameras.</p>\n<p>&#8220;The arrests were the result of a joint investigation by the Sheriff’s Office and Bank of America corporate security,&#8221; reads <a href=\"https://www.sacbee.com/news/local/crime/article265394781.html\" target=\"_blank\" rel=\"noopener\">a September 2022 story</a> from <em>The Sacramento Bee</em>. &#8220;The investigation focused on illegal skimming, particularly the high-volume cash-out sequence at ATMs near the start of each month when Electronic Benefits Transfer accounts are funded by California.&#8221;</p>\n<p>Armed with a victim&#8217;s PIN along with stolen card data, thieves can clone the card onto anything with a magnetic stripe and use it at ATMs to withdraw cash, or as a payment instrument at any establishment that accepts EBT cards.</p>\n<div id=\"attachment_61645\" style=\"width: 760px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61645\" loading=\"lazy\" class=\" wp-image-61645\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/sacskims.png\" alt=\"\" width=\"750\" height=\"473\" /><p id=\"caption-attachment-61645\" class=\"wp-caption-text\">Skimming gear seized from three suspects arrested by Sacramento authorities in September. Image: Sacramento County Sheriff&#8217;s Office.</p></div>\n<p>Although it may be shocking that California &#8212; one of America&#8217;s wealthiest states &#8212; still treats EBT recipients as second-class citizens by issuing them chip-less debit cards, California <a href=\"https://foodstampsebt.com/category/ebt-card/ebt-card-balance/\" target=\"_blank\" rel=\"noopener\">behaves like most other states in this regard</a>.</p>\n<p>More critical, however, is the second way SNAP cards differ from regular debit cards: Recipients of SNAP benefits have little to no hope of recovering their funds when their EBT cards are copied by card-skimming devices and used for fraud.</p>\n<p>That&#8217;s because in the SNAP program, federal law bars the states from replacing SNAP benefits using federal funds. And while some of these EBT cards have Visa or MasterCard logos on them, it is not up to those companies to replace funds in the event of fraud.</p>\n<p>Victims are encouraged to report the theft to both their state agency and the local police, but many victims say they rarely receive updates on their cases from police, and, if they hear from the state, it&#8217;s usually the agency telling them it found no evidence of fraud.<span id=\"more-61587\"></span></p>\n<div id=\"attachment_61647\" style=\"width: 616px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61647\" loading=\"lazy\" class=\" wp-image-61647\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/md-ebt.png\" alt=\"\" width=\"606\" height=\"373\" /><p id=\"caption-attachment-61647\" class=\"wp-caption-text\">Maryland&#8217;s EBT card.</p></div>\n<p>That&#8217;s according to <strong>Brenna Smith</strong>, a reporter at <em>The Baltimore Banner</em> who <a href=\"https://www.thebaltimorebanner.com/community/criminal-justice/one-womans-quest-for-justice-after-almost-3000-of-benefits-were-stolen-LHIKMQZSNJBULC7LXCEIE264OA/\" target=\"_blank\" rel=\"noopener\">recently wrote about</a> the case of a Maryland mother of three who lost nearly $3,000 in SNAP benefits thanks to a skimmer installed at a local 7-Eleven. Maryland [Department of Human Services] spokesperson Katherine Morris told the Banner there was evidence of &#8220;a nationwide EBT card cloning scheme.&#8221;</p>\n<p>The woman profiled in Smith&#8217;s story contacted all of the retailers where her EBT card was used to buy thousands of dollars worth of baby formula. Two of those retailers agreed to share video surveillance footage of the people making the purchases at the exact timestamps specified in her EBT account history: The videos clearly showed it was the same fraudster making both purchases with a cloned copy of her EBT card.</p>\n<p>Even after the police officer assigned to the victim&#8217;s case confirmed they found a skimmer installed at the 7-Eleven store she frequented, her claim &#8212; which was denied &#8212; is still languishing in appeals months later.</p>\n<div id=\"attachment_61640\" style=\"width: 759px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-61640\" loading=\"lazy\" class=\" wp-image-61640\" src=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/ebt-skimscammer.png\" alt=\"\" width=\"749\" height=\"496\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2022/10/ebt-skimscammer.png 907w, https://krebsonsecurity.com/wp-content/uploads/2022/10/ebt-skimscammer-768x509.png 768w, https://krebsonsecurity.com/wp-content/uploads/2022/10/ebt-skimscammer-782x518.png 782w\" sizes=\"(max-width: 749px) 100vw, 749px\" /><p id=\"caption-attachment-61640\" class=\"wp-caption-text\">(Left) A video still showing a couple purchasing almost $1,200 in baby formula using SNAP benefits. (Right) A video still of a woman leaving from the CVS in Seat Pleasant. Image: The Baltimore Banner.</p></div>\n<p><strong>The Center for Law and Social Policy</strong> (CLASP) recently published <a href=\"https://www.clasp.org/blog/five-ways-state-agencies-can-support-ebt-users-at-risk-of-skimming/\" target=\"_blank\" rel=\"noopener\">Five Ways State Agencies Can Support EBT Users at Risk of Skimming</a>. CLASP says while it is true states can&#8217;t use federal funds to replace benefits unless the loss was due to a &#8220;system error,&#8221; states could use their own funds.</p>\n<p>&#8220;Doing so will ensure families don’t have to go without food, gas money, or their rent for the month,&#8221; CLASP wrote.</p>\n<p>That would help address the symptoms of card skimming, but not a root cause. Hardly anyone is suggesting the obvious, which is to equip EBT cards with the same security technology afforded to practically everyone else participating in the U.S. banking system.</p>\n<p>There are several reasons most state-issued EBT cards do not include chips. For starters, nobody says they have to. Also, it&#8217;s a fair bit more expensive to produce chip cards versus plain old magnetic stripe cards, and many state assistance programs are chronically under-funded. Finally, there is no vocal (or at least well-heeled) constituency advocating for change.</p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/10/how-card-skimming-disproportionally-affects-those-most-in-need/feed/",
  "slash:comments": 35
}