{
  "id": "yt:video:ZuY2_RBl0fw",
  "yt:videoId": "ZuY2_RBl0fw",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "1950S ”PAY DIRT”  J.I. CASE CO. TRACTOR & AGRICULTURAL MACHINERY PROMO FILM  XD60594",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-05T16:29:48+00:00",
  "updated": "2022-11-05T16:29:48+00:00",
  "media:group": {
    "media:title": "1950S ”PAY DIRT”  J.I. CASE CO. TRACTOR & AGRICULTURAL MACHINERY PROMO FILM  XD60594",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis longform advertising film (which includes an intermission) from the 1950s is an educational film presented by the J. I. Case Co. about agriculture and machinery. The Case Company was founded in 1842 and manufactured agricultural and construction equipment. It eventually merged with International Harvester and is now part of the entity known as CNH Global. The film is parted into two sections, first covering the seeding and cultivation of crops, followed by the harvesting all whilst using the farming equipment and machinery from J. I. Case Co. The tractor shown appears to be a Case 430 or 530, but it's not identified by model #. \n\nAn animation of space to introduce the film (00:24). J. I. Case Co. presents “Pay Dirt” part one (00:38). A farmer walks with two donkeys (01:02). A man sieving water and dirt for gold, silver, and other precious metals (01:21). He holds a small piece of gold between his fingers (01:30). He digs through soil using his hands (01:41). Grass fields and farm crops (01:58). Informational text about farming (02:14). Fertilizer is spread across fields using a tractor with a dispersion attachment (02:39). A farmer drives a moldboard plow (05:11). Informational text about tractor machines (09:16). Soil is harrowed using a wide disc harrow (09:32). Informational text about farming in difficult weather conditions (10:13). A farmer looks up at the cloudy sky (10:38). A Case 430 tractor drives across the fields to disperse seeds and fertilizer (10:50). An illustration of the infrastructure inside the seed and fertilizer dispenser (11:14). A farmer is seeding his fields (11:34). A sectional duplicate of the seeding-function (11:48). A 60-foot-wide seed spreader (12:54). A row crop planter for narrow seeding (13:14). Seeds are manually filled into hills (13:39) Sectional duplicate of a platter for precise seed spreading (13:54). Fertilizer is added to a different hill (15:10). An illustration of the mechanic functionality of the platter (15:25). Informational text about seed and fertilizer dispensing (15:42). A rotary hoe used for cultivating growing crops (15:55). Rich and healthy crops on a field (19:13). J. I. Case Co. presents “Pay Harvest” part two (19:32). Large fields of corn crops (21:18), and informational text about corn fields (21:37). A side-mounted tractor mower is cutting crops (21:47). A tractor with chopping-attachment shreds the cut crops evenly, and a baler tractor makes different sized bales after the harvest (24:02). The harvest of beans, nuts, rice, and other grains is powered by a tractor with a harvest-attachment (27:50). Bean crops are filled into sacks (32:30). Informational text about corn harvest (32:52): A machine is chopping corn crops into shreds (33:16). A corn-picker is mounted on a tractor (35:49), and they separate the whole corns from the crops during harvest (36:36). A farmer wins a corn-picking contest using J. I. Case Co. corn-picking equipment (38:10). \n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}