{
  "itunes:episode": 82,
  "title": "Into The Bellwoods With Lucy Bellwood",
  "pubDate": "Thu, 10 Jul 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/7/10/into-the-bellwoods-with-lucy-bellwood-episode-82",
  "guid": "tag:soundcloud,2010:tracks/158066708",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:13:56",
  "description": "<p><a href=\"https://nauticry.wordpress.com/\">Lucy Bellwood</a> is a Portland cartoonist who started her working life with a crowdfunding campaign. She's a member of <a href=\"http://periscopestudio.com/\">Periscope Studio</a>, a loosely affiliated working space and collective of which I've interviewed other members. <em><a href=\"http://lucybellwood.storenvy.com/products/464424-true-believer\">True Believer</a></em> was the outcome of <a href=\"https://www.kickstarter.com/projects/lucybellwood/true-believer/\">her Kickstarter project</a>, and she's built a career from there.</p>\n\n<h2>Sponsors and patrons</h2>\n\n<p>This podcast is made possible through the support of sponsors and patrons.</p>\n\n<p><a href=\"http://swiftly.com/new\">Swiftly.com</a>, a new service of <a href=\"http://99designs.com\">99designs.com</a>, gets small design jobs done fast. For just $19, they match your small design job with a professional graphic designer and complete it in less than one hour. All designers handpicked from the talented community at 99designs.</p>\n\n<p>Thanks to <a href=\"http://cardsagainsthumanity.com\">Cards Against Humanity</a>, which is helping underwrite our indie ads. CAH just launched a site where you can buy directly from them, including their Bigger Blacker Box and their 2012 and 2013 holiday packs, the profits from which are donated to charity.</p>\n\n<p>Our indie advertisers this week are:</p>\n\n<ul>\n<li><p><a href=\"http://www.neat.io/bee/\">Bee</a>, an issue tracker and timesheet app for the Mac.</p></li>\n<li><p><a href=\"http://ahistoryofthefuture.org/\">A History of the Future in 100 Objects</a> by  Adrian Hon, a look at objects that will define the 21st century.</p></li>\n</ul>\n\n<p>Thanks also to patrons Ben Werdmuller, Alex Bond, and Garry Pugh for <a href=\"http://www.patreon.com/newdisruptors\">supporting us directly through Patreon</a>! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts!</p>\n\n<h2>Show notes</h2>\n\n<p>Jony Ive <a href=\"http://bits.blogs.nytimes.com/2014/06/16/jonathan-ive-on-apples-design-process-and-product-philosophy/?_php=true&_type=blogs&_r=0\">in an interview</a> with the <em>New York Times</em>: \"We all see the same physical object. Something happens between what we objectively see and what we perceive it to be. That’s the definition of a designer – trying to somehow articulate what contributes to the way we see the object.\"</p>\n\n<p>In <em>Tom the Dancing Bug</em>, Pablo Picasso is told to <a href=\"http://boingboing.net/2014/06/18/tom-the-dancing-bug-pablo-pic.html\">stick to his popular clown paintings</a>. Lucy's mentor during her formative pre-college years was <a href=\"http://www.ebenmatthews.com/\">Eben Matthews</a>. <a href=\"http://www.erikamoen.com/\">Erika Moen</a>'s mentor was <a href=\"http://www.etherealin.com/\">Lin Lucas</a>. Erika appeared on <em><a href=\"http://www.penny-arcade.com/strip-search/artist/emoen\">Strip Search</a></em>, a reality web TV show created by the folks behind Penny Arcade.</p>\n\n<p>The monthly comics newspaper <em><a href=\"http://funnytimes.com/\">Funny Times</a></em> was an awesome window for decades for me into all the cartoons published independently, in alt weeklies, and beyond. It's where I first read Alison Bechdel's <em><a href=\"http://dykestowatchoutfor.com/\">Dykes To Watch Out For</a></em>, long before her <a href=\"http://bechdeltest.com/\">Bechdel Test</a> had become a popular trope.</p>\n\n<p>Savannah College of Art and Design offers a <a href=\"http://www.scad.edu/academics/programs/sequential-art\">sequential art program</a> that Lucy considered attending. She went to <a href=\"http://www.reed.edu/\">Reed College</a> instead. We also talk about the Independent Publishing Resource Center’s <a href=\"http://www.iprc.org/certificates\">Certificate Program in Comics and Independent Publishing</a> and her attendance at the <a href=\"http://www.cartoonstudies.org/\">Center for Cartoon Studies</a> <a href=\"http://www.cartoonstudies.org/index.php/programs/summer-workshops/\">summer session</a>.</p>\n\n<p>Here is my obligatory link to Kevin Kelly's \"<a href=\"http://kk.org/thetechnium/2008/03/1000-true-fans/\">1,000 True Fans</a>\" essay. He and I <a href=\"http://newdisrupt.org/blog/2014/2/13/whole-earth-pun-with-kevin-kelly-episode-62\">had a great talk for this podcast</a> in February 2014, of which there is <a href=\"https://medium.com/the-magazine/kevin-kelly-retooling-cool-2f18c20498e4\">a complete transcript</a>.</p>\n\n<p>You can find Lucy's <a href=\"https://soundcloud.com/lucy-bellwood\">talks on cartooning in audio form</a> on SoundCloud.</p>\n",
  "itunes:subtitle": "Lucy Bellwood is a Portland cartoonist who started her working life with a crowdfunding campaign.",
  "itunes:summary": "Lucy Bellwood is a Portland cartoonist who started her working life with a crowdfunding campaign. She's a member of Periscope Studio, a loosely affiliated working space and collective of which I've interviewed other members. True Believer was the outcome of her Kickstarter project, and she's built a career from there. https://nauticry.wordpress.com\n\nSponsors and patrons\n\nThis podcast is made possible through the support of sponsors and patrons.\n\nSwiftly.com, a new service of 99designs.com, gets small design jobs done fast. For just $19, they match your small design job with a professional graphic designer and complete it in less than one hour. All designers handpicked from the talented community at 99designs. http://swiftly.com/new\n\nThanks to Cards Against Humanity, which is helping underwrite our indie ads. CAH just launched a site where you can buy directly from them, including their Bigger Blacker Box and their 2012 and 2013 holiday packs, the profits from which are donated to charity. http://cardsagainsthumanity.com\n\nOur indie advertisers this week are:\n\nBee, an issue tracker and timesheet app for the Mac. http://www.neat.io/bee/\n\nA History of the Future in 100 Objects by Adrian Hon, a look at objects that will define the 21st century. http://ahistoryofthefuture.org\n\nThanks also to patrons Ben Werdmuller, Alex Bond, and Garry Pugh for supporting us directly through Patreon! You can back this podcast for as little as $1 per month. At higher levels, we'll thank you on the air and send you mugs and T-shirts! http://www.patreon.com/newdisruptors\n\nShow notes\n\nJony Ive in an interview with the New York Times: \"We all see the same physical object. Something happens between what we objectively see and what we perceive it to be. That’s the definition of a designer – trying to somehow articulate what contributes to the way we see the object.\"\n\nIn Tom the Dancing Bug, Pablo Picasso is told to stick to his popular clown paintings. Lucy's mentor during her formative pre-college years was Eben Matthews. Erika Moen's mentor was Lin Lucas. Erika appeared on Strip Search, a reality web TV show created by the folks behind Penny Arcade.\n\nThe monthly comics newspaper Funny Times was an awesome window for decades for me into all the cartoons published independently, in alt weeklies, and beyond. It's where I first read Alison Bechdel's Dykes To Watch Out For, long before her Bechdel Test had become a popular trope.\n\nSavannah College of Art and Design offers a sequential art program that Lucy considered attending. She went to Reed College instead. We also talk about the Independent Publishing Resource Center’s Certificate Program in Comics and Independent Publishing and her attendance at the Center for Cartoon Studies summer session.\n\nHere is my obligatory link to Kevin Kelly's \"1,000 True Fans\" essay. He and I had a great talk for this podcast in February 2014, of which there is a complete transcript.\n\nYou can find Lucy's talks on cartooning in audio form on SoundCloud."
}