{
  "title": "Episode 10: &#8220;Double Crossin&#8217; Blues&#8221;, by Johnny Otis, Little Esther, and the Robins",
  "link": "https://500songs.com/podcast/double-crossin-blues-by-johnny-otis-little-esther-and-the-robins/",
  "pubDate": "Sun, 09 Dec 2018 23:21:10 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/double-crossin-blues-by-johnny-otis-little-esther-and-the-robins/",
  "description": "Welcome to episode ten of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Double Crossin' Blues\" by Johnny Otis, Little Esther, and the Robins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nLike last week, this episode talks about a musician losing the use of some fingers. If you want to help others like Johnny Otis, you might want to check out a charity called the <a href=\"https://www.ohmi.org.uk/\">One-Handed Musical Instrument Trust</a>, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-10-double-crossing-blues/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are a lot of cheap compilations of Johnny Otis' material -- <a href=\"https://amzn.to/2UtjU7U\">this one</a> seems to be the best value for money, and contains two other songs I already have podcasts written about, and two more that I'm almost certainly going to cover.\n\n<a href=\"https://amzn.to/2B4k7pg\">This CD</a> covers Little Esther's first couple of years, including all her recordings for Savoy along with some of those from Federal.\n\n<a href=\"https://amzn.to/2zQ3GND\">And this double-CD set</a> contains almost everything the Robins recorded, though for some unknown reason it doesn't contain their three most well-known songs.\n\nMuch of the biographical information about Johnny Otis comes from <a href=\"https://amzn.to/2Pqryw5\"><em>Midnight at the Barrelhouse: The Johnny Otis Story</em> by George Lipsitz.</a>\n\nBoth Otis and Ralph Bass are interviewed in <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, one of the most important books on early 50s rhythm and blues.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWe talked last week about playing an instrument with missing or damaged fingers. Today, we're going to talk about how a great musician losing the use of a couple of fingers led directly to several of the biggest careers in rhythm and blues.\n\nWhen we think of the blues now, we mostly think of guitar-based music – people like Robert Johnson and Muddy Waters – rather than piano-based musicians and the more vaudeville style of what's called “classic blues”, people like Ma Rainey or Bessie Smith. And that tends to give a rather ahistorical perspective on the development of rock and roll.\n\nRock and roll when it started -- the music of the mid fifties -- is not really a guitar-based music. It's dominated by the piano and the saxophone, and that domination it takes from jump band rhythm and blues. We've already heard how blues shouters in jump bands were massively influential for the style, but of course the blues, along with the jump bands, fed into what was just becoming known as \"rhythm and blues\", and that in turn fed into rock and roll.\n\nThere were two real links in the chain between the blues and rock and roll. And we'll definitely talk about the Chess label soon. But to the extent that there was any influence at all from what we now think of as the blues, it was mostly down to one man, Johnny Otis. It's probably safe to say that if Johnny Otis had never lived, the whole of 1950s music would be totally different.\n\nWe're going to be talking about Johnny Otis *a hell of a lot* in this podcast, because to put it as simply as possible, Johnny Otis was responsible for basically every good record that came from the West Coast of the US between about 1947 and 1956. I have three more Johnny Otis-related records lined up between now and the middle of February, and no doubt there'll be several more after that.\n\nJohnny Otis had his first hit in 1945, with \"Harlem Nocturne\", which featured his friend Bill Doggett on piano:\n\n[excerpt of \"Harlem Nocturne\"]\n\nAfter “Harlem Nocturne” became a hit, and partly through the connection with Doggett, he got the opportunity to tour backing the Ink Spots, which exposed him to a wider audience. He was on his way to being a big star.\n\nAt that time, he was a drummer and vibraphone player. And he was one of the great drummers of the period -- he played, for example, on Ilinois Jacquet's version of \"Flying Home\", and on \"Jamming With Lester\" by Lester Young.\n\nHe was leading a big band, and had been trying to sound like Count Basie, as you can hear if you listen to the records he made at that time, but that soon changed when the jump bands came in. Instead, Otis slimmed down his band to a much smaller one and started playing this new R&B music, but he still wanted to give the people a show. And so he started the Johnny Otis Show, and rather than devote the show to his own performances, he would tour with a variety of singers and groups, who'd all play with his band as well as perform in different combinations. These singers and groups would be backed by the Johnny Otis band, but would be able to put out their own records and put on their own shows. He was going to use his fame to boost others -- while also giving himself more stars for his show, which meant more people coming to the shows.\n\nOne thing that's very important to note here is that Otis was a white man who chose to live and work only with black people. We'll be talking more about his relationship with race as we go forward, but Johnny Otis was *not* the typical white man in the music industry -- in that he actually respected his black colleagues as friends and equals, rather than just exploiting them financially.\n\nHe also lived in the Watts area of LA, the black area, and did all sorts of things in the community, from having his own radio show (which was listened to by a lot of the white kids in the LA area as well as its intended black audience -- both Frank Zappa and Brian Wilson talked about listening to Johnny Otis' show as children) to running a pigeon-breeding club for the local children. One of the kids who went along to learn how to breed pigeons with Johnny Otis was Arthur Lee, who later went on to be the leader of the band Love.\n\nHe was always a bit of an entrepreneur, and someone who was doing twenty different things at the same time. For example, he kept chickens in coops outside his house in Watts, running The Progressive Poultry company with a friend of his, Mario Delagarde, who was a bass player who worked with Johnny “Guitar” Watson and who died fighting in Cuba with Castro against Batista. Apparently, the chickens they sold were too popular, as Otis lost the use of a couple of fingers on his right hand in a chainsaw accident while trying to build more chicken coops -- though as he said later, he was still able to play piano and vibraphone with only eight fingers. After a doctor botched an operation on his hand, though, he couldn't play drums easily.\n\nBut it was because of his damaged hand that he eventually discovered Little Esther. Otis prided himself on his ability at discovering artists, and in this case it was more or less by accident. One night he couldn't sleep from the pain in his hand, and he was scared of taking painkillers and becoming addicted, so he went for a walk.\n\nHe walked past a club, and saw that Big Jay McNeely was playing. McNeely – who died in September this year – was one of the great saxophone honkers and skronkers of rhythm and blues, and was a friend of Otis who'd played on several records with him. Otis went inside, and before the show started there was a talent show. These talent shows were often major parts of the show in black entertainment at this time, and were sometimes *hugely* impressive – Otis would later talk about one show he saw in Detroit, where he discovered Hank Ballard, Little Willie John, and Jackie Wilson all in the same night, and none of them were even the winner.\n\nOn this night, one girl was impressive, but didn't win, and went and cried in the back of the theatre. Johnny Otis went over to comfort her, and offered her a job with his band.\n\nThat girl was only fourteen when she became a professional blues singer after Otis discovered her (he had a knack for discovering teenage girls with exceptional vocal abilities -- we'll be looking at another one in a few weeks). She was born Esther Mae Washington, but later took the surname of her stepfather and became Esther Mae Jones. A few years from the time we're talking about, she took the name of a petrol station company and became Esther Phillips.\n\nAt first, Otis had trouble getting her a record deal, because of the similarity of her sound to that of Dinah Washington, who was Esther's biggest inspiration, and was the biggest female R&B star of the period. Anyone listening to her was instantly struck by the similarity, and so she was dismissed as a soundalike.\n\nBut Otis had a little more success with a vocal group he knew called the Robins.\n\nWe haven't talked much about doo-wop yet, but we're at the point where it starts to be a major factor. Doo-wop is a genre that mostly came from the East Coast of the US. Like many of the genres we've discussed so far, it was a primarily black genre, but it would soon also be taken up by Italian-American singers living in the same areas as black people -- this was a time when Italian-Americans weren't considered fully \"white\" according to the racial standards then prevalent in the US. (As an example, in the early 1960s, the great jazz bass player Charles Mingus was asked why, if he was so angry at white people, he played with Charlie Mariano. Mingus looked surprised and said \"Charlie's not white, he's Italian!\")\n\nBut at this point doo-wop was very much on the fringes of the music business. It was music that was made by people who were too poor to even afford instruments, standing around on street corners and singing with each other. Usually the lead singer would try to sound like Bill Kenny of the Ink Spots, though increasingly as the genre matured the lead vocalists would take on more and more aspects of gospel singing as well. The backing vocalists -- usually three or four of them -- would do the same kind of thing as the Mills Brothers had, and imitate instrumental parts.\n\nAnd in the tradition of the Ink Spots' \"top and bottom\", these bands would also feature a very prominent bass vocal -- though the bass singer wouldn't speak the words like Hoppy Jones, but would instead sing wordless nonsense syllables. This is where the name \"doo wop\", which was only applied later, comes from -- from the singer singing things like this:\n\n[excerpt \"Count Every Star\", by the Ravens]\n\nThat's the Ravens, one of the first and most successful of the new vocal groups that came along. We're not doing a whole episode on them, but they caused a huge explosion of black vocal groups in the late forties and early fifties -- and you can tell how influential they were just by looking at the names of many of these bands, which included the Orioles, the Penguins, the Flamingos and more.\n\nAnd The Robins were another of these \"bird groups\". They started out as a vocal group called the A-Sharp Trio, who entered a talent contest at a nightclub owned by Johnny Otis and came second (the performer who came first, the guitarist Pete Lewis, Otis got into his band straight away). Otis gave the A-Sharp Trio a regular gig at his club, and soon decided to pair them with another singer who sang there solo, turning them into a quartet. They were originally called the Four Bluebirds, and under that name they recorded a single with Otis -- \"My Baby Done Told Me\":\n\n[Excerpt: the Four Bluebirds \"My Baby Done Told Me\"]\n\nHowever, they didn't like the name, and soon settled on the Robins.\n\nThe Robins recorded with Otis on various labels. Their first single, \"Around About Midnight\", was a remake of Roy Brown's earlier \"Long About Midnight\", and it's really rather good. Take a listen:\n\n[\"Around About Midnight\"]\n\nA quick note there -- that's noted as their first single on some discographies I've seen. Others, however, say that these original tracks weren't released until a few months after they were recorded. It's definitely from their first session under the name The Robins though.\n\nThat was recorded on the Aladdin label, a record label that also had recordings by Ilinois Jacquet, Louis Jordan, Wynonie Harris, and many, many more early R&B people who we've touched upon in this podcast and will touch upon again I'm sure. But soon after this Otis and the Robins -- and Esther Mae Washington -- would all go on to another label, Savoy.\n\nRalph Bass, the A&R man who signed Johnny Otis to Savoy, is another of those white back-room people who devoted their life to black music who keep showing up at this stage of the story, and he's another one we'll be seeing a lot of for the next few episodes. Born Ralph Basso, he'd been an amateur musician and had also worked for Shell. When he was working for Shell, one of his jobs had been to organise corporate events, and because of the war there was a lack of musicians to play them, and he'd taken to playing records through an amplifier, becoming one of the very first live DJs.\n\nHe'd always had a love of music -- he used to sneak into the Savoy Ballroom to watch Chick Webb as a teenager -- and when he was playing these records, he realised that many of them sounded awful. He was convinced he could make records that sounded better than the ones he was playing, and so he decided to write to every record company he could find, offering his services. Only one record company answered -- Black and White Records in Los Angeles. They weren't certain that they could use him, but they'd give him an interview in a few weeks if he flew to LA.\n\nBass flew to LA two weeks before his interview, and started preparing. He asked the musicians unions for a list of who they thought their most talented local musicians were, and went to see them all live, and chat to some of them. Then, when he went into the actual interview and was asked who he would record, he had an answer -- he was going to record Sammy Franklin and his Atomics doing \"The Honeydripper\".\n\nBut he still didn't actually know anything at all about how to make a record. He had a solution to that too. He booked the band and the studio, then got to the studio early and told the engineers that he didn't have a clue about how to record sound, but that his boss would be expecting him to, and to just go along with everything he said when the boss got there, and that the engineers would really be in charge.\n\nThe boss of Black and White Records did get there, shortly afterward, and Bass spent the next half hour tweaking settings on the board, changing mic placements, and a thousand other tiny technical differences. The boss decided he knew what he was doing and left him to it. The engineers then put everything back the way it was originally. The record came out, and it didn't do wonderfully (for reasons we'll discuss next week) but it was enough to get Bass firmly in place in Black and White Records.\n\nOver the next few years, he produced dozens of classics of jazz and blues, including \"Stormy Monday\" by T-Bone Walker and \"Open the Door, Richard\" by Jack McVea:\n\n[excerpt: \"Open the Door, Richard\"]\n\nThat record was based on an old routine by the black comedian Dusty Fletcher, and it was Bass who suggested that the old routine be set to music by McVea, who had previously been a saxophone player with Lionel Hampton's band. It became a massive hit, and was covered by Count Basie and Louis Jordan, among others -- six different versions of the song made the R&B top ten more or less simultaneously in the first few months of 1947.\n\nBut the problem with \"Open the Door, Richard\" was that it was actually too successful -- the record label just assumed that any of its records would sell that well. And when they didn't, Bass had to find another label to work with.\n\nBass had proved his ability enough that he ended up working for Savoy. For most of its time, Savoy was a jazz label, but while Ralph Bass was in charge of A&R it was, instead, an R&B label, and one that put out some of the greatest R&B of its time. He had an eye for talent and a real love for good rhythm and blues music.\n\nAnd so when Ralph Bass saw the Johnny Otis revue performing live, he decided that Savoy needed to sign *all of them* -- Otis and his band, Esther, the Robins, everyone. He got in touch with Herman Lubinsky, who was the owner of Savoy Records, and got Lubinsky to come down to see Otis' band. During intermission, Lubinsky met up with Otis, and got him to sign a record contact -- the contract only specified a one percent royalty, but Lubinsky promised he'd triple the royalty rate after Otis' first hit with Savoy. Like many of Lubinsky's promises, this proved to be false.\n\nWhen the Otis band, Esther, and the Robins went into the studio together, Esther was so intimidated by the studio that she started giggling, and while they did manage to cut a few songs, they didn't get as much done as they wanted to in the session. But at almost literally the last minute -- twenty minutes before the end of the session, Otis came up with a song that was, like \"Open the Door Richard\", based around a comedy routine from a well-known black comedy act. In this case, a double act called Apus and Estrellita -- Esther and Bobby Nunn of the Robins engaged in some good-spirited comedy back and forth, copied from their routines.\n\n[excerpt \"Double Crossin' Blues\"]\n\nThose lines \"How come you ain't in the forest?\" \"I'm a lady\", \"they got lady bears out there!\" take on a bit of a different colour when you realise that \"lady bear\" was, at the time, slang for an ugly, sexually aggressive woman.\n\nHerman Lubinsky, the head of Savoy Records, was not impressed with the record or with Esther Phillips, and according to Bass \"I sent the record to Lubinsky and asked for five dollars to pay for the kid's expenses -- lunch and all that, coming to Hollywood from Watts. He shouted 'Whaddaya mean five bucks? For what?' He wouldn't give me the five bucks\".\n\nLubinsky put the recording aside until a DJ in Newark asked him if he could look through the new recordings he had to see if there was anything that might be a hit. The DJ loved the record, and even ran a competition on his radio station to pick the song's name, which is where the title \"Double Crossing Blues\" comes from. Although as Bass said \"Everybody who was involved with the record got double-crossed. The songwriter, Johnny and I, the Robins, everybody connected with it.\"\n\nLubinsky was suddenly so sure that the record was going to be a success that he phoned Bass at five in the morning, Bass' time, waking him up, and getting Bass to go and wake Johnny Otis up so they could both go and track down Esther and her mother, and get them to sign a contract immediately. It was around this point that Esther's stage name was decided upon -- Lubinsky said to Otis \"you need a stage name for that girl,\" to which Otis replied \"which girl? Little Esther?\" and Lubinsky said \"that's perfect!\"\n\nAnd so for the next few years, Esther Washington, who would later be Esther Phillips, was Little Esther, and that was the name under which she became a phenomenon.\n\nThe record went to number one on the R&B charts, and was the biggest thing in the genre in years. In July 1950, Billboard published its annual listing of best-selling R&B acts. Johnny Otis came first, Little Esther second, and the Robins came fourth\n\nBut the record's success caused friction between Otis and the Robins, who he later described as the people \"who hummed behind Little Esther\". They decided that they were the big stars, not Little Esther, and that they were going to go on tour on their own. Otis had to find another male singer to sing the parts that Bobby Nunn had sung, and so he found his new singer Mel Walker, who would be the main lead vocalist on Otis' future records, and would duet with Little Esther on more than a few of them. The Robins offered Otis a job as musical director for twenty dollars a night, but Otis refused.\n\nThe Robins would go on to have many, many successes themselves, some of which we'll talk about later, but Otis, Mel Walker, and Little Esther went on to have a string of hits in various combinations as well -- \"Mistrustin' Blues\", \"Deceivin' Blues\", \"Dreamin' Blues\", \"Wedding Boogie\", \"Rockin' Blues\"... Otis also had a 1951 hit with \"All Nite Long\", which would later be referenced in records by both Frank Zappa and Talking Heads:\n\n[excerpt \"All Nite Long\": Johnny Otis]\n\nWe'll be seeing much more of Johnny Otis, and of the Robins, as the story goes on, but this is the only time we'll be talking about Little Esther. In her first year, she had an amazing seven records make the R&B top ten, three of them (including \"Double Crossin' Blues\") going to number one. She was regarded as one of the finest R&B vocalists of her generation, and had a promising future.\n\nShe decided, after a year on Savoy with Johnny Otis, to go solo and to move with Ralph Bass to Federal Records, a new label Bass had joined after falling out with Herman Lubinsky. According to Bass, Lubinsky often blackmailed his employees, in order to get leverage over them. But he was unable to find any dirty secrets about Bass -- not that Bass didn't have them (and not necessarily that he did, either -- I don't know) -- but that he didn't mix his business and personal lives. He didn't hang out with the musicians he worked with or with his colleagues, and so there was no vector for Lubinsky to get any kind of leverage over him.\n\nSo Lubinsky sent Bass to a party for a distributor at the last minute, which ran until three or four AM, and then when Bass' wife phoned up to ask where he was, Lubinsky claimed not to know, causing Bass and his wife to have a row.\n\nBass instantly realised that Lubinsky was trying to mess with his marriage in order to get some leverage over him, and decided he was simply not going to go back to work the next day. Instead, he went to King Records, who set up a subsidiary, Federal, for Bass to run. Bass took Little Esther with him, but Johnny Otis and the Robins were both still on Savoy.\n\nOver the next few years, Bass would produce a lot of records which would change the course of rhythm and blues and rock and roll music, but sadly his further collaborations with Little Esther simply weren't as successful as the work they'd done together with Johnny Otis. She stopped having hits, and started doing heroin.\n\nShe moved back in with her family in Houston, and played odd gigs around the area, including one with Otis, Big Mama Thornton, and Johnny Ace, which we'll talk about in a future episode but which must have traumatised her further. Eventually her career got a second wind, and she had a few minor hits in the 1960s and 70s under her new name Esther Phillips.\n\nMost impressive of these was \"Home is Where the Hatred is\", a song by Gil Scott-Heron that she recorded in 1972:\n\n[excerpt \"Home is Where the Hatred is\": Esther Phillips]\n\nThat song clearly meant a lot to her, given her own history with drugs, and the album it came from, From A Whisper to a Scream, was nominated for a Grammy for Best R&B Vocal Performance (Female). Aretha Franklin won the award, as she did every year from 1968 through 1975 inclusive -- and to be fair, that's one of the few examples of the Grammies actually recognising talent when they saw it, because if it's possible to give Aretha Franklin an award between 1968 and 1975, you give Aretha Franklin that award. But this time, Aretha said publicly that she didn't deserve the award, and gave it to Phillips. Sadly, Esther Phillips never won the award in her own right -- she was nominated four times, but all during that period of Aretha dominance.\n\nShe continued having minor hits into the 1980s, but she never recaptured that brief period when she was the biggest female star in R&B, back in 1950. She died in 1984, aged only 48. Johnny Otis, who by that time was ordained as a minister, performed her funeral.",
  "itunes:subtitle": "Welcome to episode ten of A History of Rock Music in Five Hundred Songs. Today were looking at Double Crossin Blues by Johnny Otis, Little Esther, and the Robins. Click the full post to read liner notes, links to more information, and a transcript of the",
  "itunes:keywords": "Aladdin Records,Bill Doggett,bird groups,Bobby Nunn,Dinah Washington,disability,doo wop,Esther Phillips,Herman Lubinsky,Illinois Jacquet,Ink Spots,Johnny Otis,jump bands,Mel Walker,racism,Ralph Bass,Sammy Franklin,Savoy Records,talent shows,the blues,The Robins,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 10,
  "content:encoded": "Welcome to episode ten of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Double Crossin' Blues\" by Johnny Otis, Little Esther, and the Robins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nLike last week, this episode talks about a musician losing the use of some fingers. If you want to help others like Johnny Otis, you might want to check out a charity called the <a href=\"https://www.ohmi.org.uk/\">One-Handed Musical Instrument Trust</a>, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-10-double-crossing-blues/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are a lot of cheap compilations of Johnny Otis' material -- <a href=\"https://amzn.to/2UtjU7U\">this one</a> seems to be the best value for money, and contains two other songs I already have podcasts written about, and two more that I'm almost certainly going to cover.\n\n<a href=\"https://amzn.to/2B4k7pg\">This CD</a> covers Little Esther's first couple of years, including all her recordings for Savoy along with some of those from Federal.\n\n<a href=\"https://amzn.to/2zQ3GND\">And this double-CD set</a> contains almost everything the Robins recorded, though for some unknown reason it doesn't contain their three most well-known songs.\n\nMuch of the biographical information about Johnny Otis comes from <a href=\"https://amzn.to/2Pqryw5\"><em>Midnight at the Barrelhouse: The Johnny Otis Story</em> by George Lipsitz.</a>\n\nBoth Otis and Ralph Bass are interviewed in <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, one of the most important books on early 50s rhythm and blues.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nWe talked last week about playing an instrument with missing or damaged fingers. Today, we're going to talk about how a great musician losing the use of a couple of fingers led directly to several of the biggest careers in rhythm and blues.\n\nWhen we think of the blues now, we mostly think of guitar-based music – people like Robert Johnson and Muddy Waters – rather than piano-based musicians and the more vaudeville style of what's called “classic blues”, people like Ma Rainey or Bessie Smith. And that tends to give a rather ahistorical perspective on the development of rock and roll.\n\nRock and roll when it started -- the music of the mid fifties -- is not really a guitar-based music. It's dominated by the piano and the saxophone, and that domination it takes from jump band rhythm and blues. We've already heard how blues shouters in jump bands were massively influential for the style, but of course the blues, along with the jump bands, fed into what was just becoming known as \"rhythm and blues\", and that in turn fed into rock and roll.\n\nThere were two real links in the chain between the blues and rock and roll. And we'll definitely talk about the Chess label soon. But to the extent that there was any influence at all from what we now think of as the blues, it was mostly down to one man, Johnny Otis. It's probably safe to say that if Johnny Otis had never lived, the whole of 1950s music would be totally different.\n\nWe're going to be talking about Johnny Otis *a hell of a lot* in this podcast, because to put it as simply as possible, Johnny Otis was responsible for basically every good record that came from the West Coast of the US between about 1947 and 1956. I have three more Johnny Otis-related records lined up between now and the middle of February, and no doubt there'll be several more after that.\n\nJohnny Otis had his first hit in 1945, with \"Harlem Nocturne\", which featured his friend Bill Doggett on piano:\n\n[excerpt of \"Harlem Nocturne\"]\n\nAfter “Harlem Nocturne” became a hit, and partly through the connection with Doggett, he got the opportunity to tour backing the Ink Spots, which exposed him to a wider audience. He was on his way to being a big star.\n\nAt that time, he was a drummer and vibraphone player. And he was one of the great drummers of the period -- he played, for example, on Ilinois Jacquet's version of \"Flying Home\", and on \"Jamming With Lester\" by Lester Young.\n\nHe was leading a big band, and had been trying to sound like Count Basie, as you can hear if you listen to the records he made at that time, but that soon changed when the jump bands came in. Instead, Otis slimmed down his band to a much smaller one and started playing this new R&B music, but he still wanted to give the people a show. And so he started the Johnny Otis Show, and rather than devote the show to his own performances, he would tour with a variety of singers and groups, who'd all play with his band as well as perform in different combinations. These singers and groups would be backed by the Johnny Otis band, but would be able to put out their own records and put on their own shows. He was going to use his fame to boost others -- while also giving himself more stars for his show, which meant more people coming to the shows.\n\nOne thing that's very important to note here is that Otis was a white man who chose to live and work only with black people. We'll be talking more about his relationship with race as we go forward, but Johnny Otis was *not* the typical white man in the music industry -- in that he actually respected his black colleagues as friends and equals, rather than just exploiting them financially.\n\nHe also lived in the Watts area of LA, the black area, and did all sorts of things in the community, from having his own radio show (which was listened to by a lot of the white kids in the LA area as well as its intended black audience -- both Frank Zappa and Brian Wilson talked about listening to Johnny Otis' show as children) to running a pigeon-breeding club for the local children. One of the kids who went along to learn how to breed pigeons with Johnny Otis was Arthur Lee, who later went on to be the leader of the band Love.\n\nHe was always a bit of an entrepreneur, and someone who was doing twenty different things at the same time. For example, he kept chickens in coops outside his house in Watts, running The Progressive Poultry company with a friend of his, Mario Delagarde, who was a bass player who worked with Johnny “Guitar” Watson and who died fighting in Cuba with Castro against Batista. Apparently, the chickens they sold were too popular, as Otis lost the use of a couple of fingers on his right hand in a chainsaw accident while trying to build more chicken coops -- though as he said later, he was still able to play piano and vibraphone with only eight fingers. After a doctor botched an operation on his hand, though, he couldn't play drums easily.\n\nBut it was because of his damaged hand that he eventually discovered Little Esther. Otis prided himself on his ability at discovering artists, and in this case it was more or less by accident. One night he couldn't sleep from the pain in his hand, and he was scared of taking painkillers and becoming addicted, so he went for a walk.\n\nHe walked past a club, and saw that Big Jay McNeely was playing. McNeely – who died in September this year – was one of the great saxophone honkers and skronkers of rhythm and blues, and was a friend of Otis who'd played on several records with him. Otis went inside, and before the show started there was a talent show. These talent shows were often major parts of the show in black entertainment at this time, and were sometimes *hugely* impressive – Otis would later talk about one show he saw in Detroit, where he discovered Hank Ballard, Little Willie John, and Jackie Wilson all in the same night, and none of them were even the winner.\n\nOn this night, one girl was impressive, but didn't win, and went and cried in the back of the theatre. Johnny Otis went over to comfort her, and offered her a job with his band.\n\nThat girl was only fourteen when she became a professional blues singer after Otis discovered her (he had a knack for discovering teenage girls with exceptional vocal abilities -- we'll be looking at another one in a few weeks). She was born Esther Mae Washington, but later took the surname of her stepfather and became Esther Mae Jones. A few years from the time we're talking about, she took the name of a petrol station company and became Esther Phillips.\n\nAt first, Otis had trouble getting her a record deal, because of the similarity of her sound to that of Dinah Washington, who was Esther's biggest inspiration, and was the biggest female R&B star of the period. Anyone listening to her was instantly struck by the similarity, and so she was dismissed as a soundalike.\n\nBut Otis had a little more success with a vocal group he knew called the Robins.\n\nWe haven't talked much about doo-wop yet, but we're at the point where it starts to be a major factor. Doo-wop is a genre that mostly came from the East Coast of the US. Like many of the genres we've discussed so far, it was a primarily black genre, but it would soon also be taken up by Italian-American singers living in the same areas as black people -- this was a time when Italian-Americans weren't considered fully \"white\" according to the racial standards then prevalent in the US. (As an example, in the early 1960s, the great jazz bass player Charles Mingus was asked why, if he was so angry at white people, he played with Charlie Mariano. Mingus looked surprised and said \"Charlie's not white, he's Italian!\")\n\nBut at this point doo-wop was very much on the fringes of the music business. It was music that was made by people who were too poor to even afford instruments, standing around on street corners and singing with each other. Usually the lead singer would try to sound like Bill Kenny of the Ink Spots, though increasingly as the genre matured the lead vocalists would take on more and more aspects of gospel singing as well. The backing vocalists -- usually three or four of them -- would do the same kind of thing as the Mills Brothers had, and imitate instrumental parts.\n\nAnd in the tradition of the Ink Spots' \"top and bottom\", these bands would also feature a very prominent bass vocal -- though the bass singer wouldn't speak the words like Hoppy Jones, but would instead sing wordless nonsense syllables. This is where the name \"doo wop\", which was only applied later, comes from -- from the singer singing things like this:\n\n[excerpt \"Count Every Star\", by the Ravens]\n\nThat's the Ravens, one of the first and most successful of the new vocal groups that came along. We're not doing a whole episode on them, but they caused a huge explosion of black vocal groups in the late forties and early fifties -- and you can tell how influential they were just by looking at the names of many of these bands, which included the Orioles, the Penguins, the Flamingos and more.\n\nAnd The Robins were another of these \"bird groups\". They started out as a vocal group called the A-Sharp Trio, who entered a talent contest at a nightclub owned by Johnny Otis and came second (the performer who came first, the guitarist Pete Lewis, Otis got into his band straight away). Otis gave the A-Sharp Trio a regular gig at his club, and soon decided to pair them with another singer who sang there solo, turning them into a quartet. They were originally called the Four Bluebirds, and under that name they recorded a single with Otis -- \"My Baby Done Told Me\":\n\n[Excerpt: the Four Bluebirds \"My Baby Done Told Me\"]\n\nHowever, they didn't like the name, and soon settled on the Robins.\n\nThe Robins recorded with Otis on various labels. Their first single, \"Around About Midnight\", was a remake of Roy Brown's earlier \"Long About Midnight\", and it's really rather good. Take a listen:\n\n[\"Around About Midnight\"]\n\nA quick note there -- that's noted as their first single on some discographies I've seen. Others, however, say that these original tracks weren't released until a few months after they were recorded. It's definitely from their first session under the name The Robins though.\n\nThat was recorded on the Aladdin label, a record label that also had recordings by Ilinois Jacquet, Louis Jordan, Wynonie Harris, and many, many more early R&B people who we've touched upon in this podcast and will touch upon again I'm sure. But soon after this Otis and the Robins -- and Esther Mae Washington -- would all go on to another label, Savoy.\n\nRalph Bass, the A&R man who signed Johnny Otis to Savoy, is another of those white back-room people who devoted their life to black music who keep showing up at this stage of the story, and he's another one we'll be seeing a lot of for the next few episodes. Born Ralph Basso, he'd been an amateur musician and had also worked for Shell. When he was working for Shell, one of his jobs had been to organise corporate events, and because of the war there was a lack of musicians to play them, and he'd taken to playing records through an amplifier, becoming one of the very first live DJs.\n\nHe'd always had a love of music -- he used to sneak into the Savoy Ballroom to watch Chick Webb as a teenager -- and when he was playing these records, he realised that many of them sounded awful. He was convinced he could make records that sounded better than the ones he was playing, and so he decided to write to every record company he could find, offering his services. Only one record company answered -- Black and White Records in Los Angeles. They weren't certain that they could use him, but they'd give him an interview in a few weeks if he flew to LA.\n\nBass flew to LA two weeks before his interview, and started preparing. He asked the musicians unions for a list of who they thought their most talented local musicians were, and went to see them all live, and chat to some of them. Then, when he went into the actual interview and was asked who he would record, he had an answer -- he was going to record Sammy Franklin and his Atomics doing \"The Honeydripper\".\n\nBut he still didn't actually know anything at all about how to make a record. He had a solution to that too. He booked the band and the studio, then got to the studio early and told the engineers that he didn't have a clue about how to record sound, but that his boss would be expecting him to, and to just go along with everything he said when the boss got there, and that the engineers would really be in charge.\n\nThe boss of Black and White Records did get there, shortly afterward, and Bass spent the next half hour tweaking settings on the board, changing mic placements, and a thousand other tiny technical differences. The boss decided he knew what he was doing and left him to it. The engineers then put everything back the way it was originally. The record came out, and it didn't do wonderfully (for reasons we'll discuss next week) but it was enough to get Bass firmly in place in Black and White Records.\n\nOver the next few years, he produced dozens of classics of jazz and blues, including \"Stormy Monday\" by T-Bone Walker and \"Open the Door, Richard\" by Jack McVea:\n\n[excerpt: \"Open the Door, Richard\"]\n\nThat record was based on an old routine by the black comedian Dusty Fletcher, and it was Bass who suggested that the old routine be set to music by McVea, who had previously been a saxophone player with Lionel Hampton's band. It became a massive hit, and was covered by Count Basie and Louis Jordan, among others -- six different versions of the song made the R&B top ten more or less simultaneously in the first few months of 1947.\n\nBut the problem with \"Open the Door, Richard\" was that it was actually too successful -- the record label just assumed that any of its records would sell that well. And when they didn't, Bass had to find another label to work with.\n\nBass had proved his ability enough that he ended up working for Savoy. For most of its time, Savoy was a jazz label, but while Ralph Bass was in charge of A&R it was, instead, an R&B label, and one that put out some of the greatest R&B of its time. He had an eye for talent and a real love for good rhythm and blues music.\n\nAnd so when Ralph Bass saw the Johnny Otis revue performing live, he decided that Savoy needed to sign *all of them* -- Otis and his band, Esther, the Robins, everyone. He got in touch with Herman Lubinsky, who was the owner of Savoy Records, and got Lubinsky to come down to see Otis' band. During intermission, Lubinsky met up with Otis, and got him to sign a record contact -- the contract only specified a one percent royalty, but Lubinsky promised he'd triple the royalty rate after Otis' first hit with Savoy. Like many of Lubinsky's promises, this proved to be false.\n\nWhen the Otis band, Esther, and the Robins went into the studio together, Esther was so intimidated by the studio that she started giggling, and while they did manage to cut a few songs, they didn't get as much done as they wanted to in the session. But at almost literally the last minute -- twenty minutes before the end of the session, Otis came up with a song that was, like \"Open the Door Richard\", based around a comedy routine from a well-known black comedy act. In this case, a double act called Apus and Estrellita -- Esther and Bobby Nunn of the Robins engaged in some good-spirited comedy back and forth, copied from their routines.\n\n[excerpt \"Double Crossin' Blues\"]\n\nThose lines \"How come you ain't in the forest?\" \"I'm a lady\", \"they got lady bears out there!\" take on a bit of a different colour when you realise that \"lady bear\" was, at the time, slang for an ugly, sexually aggressive woman.\n\nHerman Lubinsky, the head of Savoy Records, was not impressed with the record or with Esther Phillips, and according to Bass \"I sent the record to Lubinsky and asked for five dollars to pay for the kid's expenses -- lunch and all that, coming to Hollywood from Watts. He shouted 'Whaddaya mean five bucks? For what?' He wouldn't give me the five bucks\".\n\nLubinsky put the recording aside until a DJ in Newark asked him if he could look through the new recordings he had to see if there was anything that might be a hit. The DJ loved the record, and even ran a competition on his radio station to pick the song's name, which is where the title \"Double Crossing Blues\" comes from. Although as Bass said \"Everybody who was involved with the record got double-crossed. The songwriter, Johnny and I, the Robins, everybody connected with it.\"\n\nLubinsky was suddenly so sure that the record was going to be a success that he phoned Bass at five in the morning, Bass' time, waking him up, and getting Bass to go and wake Johnny Otis up so they could both go and track down Esther and her mother, and get them to sign a contract immediately. It was around this point that Esther's stage name was decided upon -- Lubinsky said to Otis \"you need a stage name for that girl,\" to which Otis replied \"which girl? Little Esther?\" and Lubinsky said \"that's perfect!\"\n\nAnd so for the next few years, Esther Washington, who would later be Esther Phillips, was Little Esther, and that was the name under which she became a phenomenon.\n\nThe record went to number one on the R&B charts, and was the biggest thing in the genre in years. In July 1950, Billboard published its annual listing of best-selling R&B acts. Johnny Otis came first, Little Esther second, and the Robins came fourth\n\nBut the record's success caused friction between Otis and the Robins, who he later described as the people \"who hummed behind Little Esther\". They decided that they were the big stars, not Little Esther, and that they were going to go on tour on their own. Otis had to find another male singer to sing the parts that Bobby Nunn had sung, and so he found his new singer Mel Walker, who would be the main lead vocalist on Otis' future records, and would duet with Little Esther on more than a few of them. The Robins offered Otis a job as musical director for twenty dollars a night, but Otis refused.\n\nThe Robins would go on to have many, many successes themselves, some of which we'll talk about later, but Otis, Mel Walker, and Little Esther went on to have a string of hits in various combinations as well -- \"Mistrustin' Blues\", \"Deceivin' Blues\", \"Dreamin' Blues\", \"Wedding Boogie\", \"Rockin' Blues\"... Otis also had a 1951 hit with \"All Nite Long\", which would later be referenced in records by both Frank Zappa and Talking Heads:\n\n[excerpt \"All Nite Long\": Johnny Otis]\n\nWe'll be seeing much more of Johnny Otis, and of the Robins, as the story goes on, but this is the only time we'll be talking about Little Esther. In her first year, she had an amazing seven records make the R&B top ten, three of them (including \"Double Crossin' Blues\") going to number one. She was regarded as one of the finest R&B vocalists of her generation, and had a promising future.\n\nShe decided, after a year on Savoy with Johnny Otis, to go solo and to move with Ralph Bass to Federal Records, a new label Bass had joined after falling out with Herman Lubinsky. According to Bass, Lubinsky often blackmailed his employees, in order to get leverage over them. But he was unable to find any dirty secrets about Bass -- not that Bass didn't have them (and not necessarily that he did, either -- I don't know) -- but that he didn't mix his business and personal lives. He didn't hang out with the musicians he worked with or with his colleagues, and so there was no vector for Lubinsky to get any kind of leverage over him.\n\nSo Lubinsky sent Bass to a party for a distributor at the last minute, which ran until three or four AM, and then when Bass' wife phoned up to ask where he was, Lubinsky claimed not to know, causing Bass and his wife to have a row.\n\nBass instantly realised that Lubinsky was trying to mess with his marriage in order to get some leverage over him, and decided he was simply not going to go back to work the next day. Instead, he went to King Records, who set up a subsidiary, Federal, for Bass to run. Bass took Little Esther with him, but Johnny Otis and the Robins were both still on Savoy.\n\nOver the next few years, Bass would produce a lot of records which would change the course of rhythm and blues and rock and roll music, but sadly his further collaborations with Little Esther simply weren't as successful as the work they'd done together with Johnny Otis. She stopped having hits, and started doing heroin.\n\nShe moved back in with her family in Houston, and played odd gigs around the area, including one with Otis, Big Mama Thornton, and Johnny Ace, which we'll talk about in a future episode but which must have traumatised her further. Eventually her career got a second wind, and she had a few minor hits in the 1960s and 70s under her new name Esther Phillips.\n\nMost impressive of these was \"Home is Where the Hatred is\", a song by Gil Scott-Heron that she recorded in 1972:\n\n[excerpt \"Home is Where the Hatred is\": Esther Phillips]\n\nThat song clearly meant a lot to her, given her own history with drugs, and the album it came from, From A Whisper to a Scream, was nominated for a Grammy for Best R&B Vocal Performance (Female). Aretha Franklin won the award, as she did every year from 1968 through 1975 inclusive -- and to be fair, that's one of the few examples of the Grammies actually recognising talent when they saw it, because if it's possible to give Aretha Franklin an award between 1968 and 1975, you give Aretha Franklin that award. But this time, Aretha said publicly that she didn't deserve the award, and gave it to Phillips. Sadly, Esther Phillips never won the award in her own right -- she was nominated four times, but all during that period of Aretha dominance.\n\nShe continued having minor hits into the 1980s, but she never recaptured that brief period when she was the biggest female star in R&B, back in 1950. She died in 1984, aged only 48. Johnny Otis, who by that time was ordained as a minister, performed her funeral.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode ten of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Double Crossin' Blues\" by Johnny Otis, Little Esther, and the Robins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nLike last week, this episode talks about a musician losing the use of some fingers. If you want to help others like Johnny Otis, you might want to check out a charity called the One-Handed Musical Instrument Trust, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are a lot of cheap compilations of Johnny Otis' material -- this one seems to be the best value for money, and contains two other songs I already have podcasts written about, and two more that I'm almost certainly going to cover.\n\nThis CD covers Little Esther's first couple of years, including all her recordings for Savoy along with some of those from Federal.\n\nAnd this double-CD set contains almost everything the Robins recorded, though for some unknown reason it doesn't contain their three most well-known songs.\n\nMuch of the biographical information about Johnny Otis comes from Midnight at the Barrelhouse: The Johnny Otis Story by George Lipsitz.\n\nBoth Otis and Ralph Bass are interviewed in Honkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, one of the most important books on early 50s rhythm and blues.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe talked last week about playing an instrument with missing or damaged fingers. Today, we're going to talk about how a great musician losing the use of a couple of fingers led directly to several of the biggest careers in rhythm and blues.\n\nWhen we think of the blues now, we mostly think of guitar-based music – people like Robert Johnson and Muddy Waters – rather than piano-based musicians and the more vaudeville style of what's called “classic blues”, people like Ma Rainey or Bessie Smith. And that tends to give a rather ahistorical perspective on the development of rock and roll.\n\nRock and roll when it started -- the music of the mid fifties -- is not really a guitar-based music. It's dominated by the piano and the saxophone, and that domination it takes from jump band rhythm and blues. We've already heard how blues shouters in jump bands were massively influential for the style, but of course the blues, along with the jump bands, fed into what was just becoming known as \"rhythm and blues\", and that in turn fed into rock and roll.\n\nThere were two real links in the chain between the blues and rock and roll. And we'll definitely talk about the Chess label soon. But to the extent that there was any influence at all from what we now think of as the blues, it was mostly down to one man, Johnny Otis. It's probably safe to say that if Johnny Otis had never lived, the whole of 1950s music would be totally different.\n\nWe're going to be talking about Johnny Otis *a hell of a lot* in this podcast, because to put it as simply as possible, Johnny Otis was responsible for basically every good record that came from the West Coast of the US between about 1947 and 1956. I have three more Johnny Otis-related records lined up between now and the middle of February, and no doubt there'll be several more after that.\n\nJohnny Otis had his first hit in 1945, with \"Harlem Nocturne\", which featured his friend Bill Doggett on piano:\n\n[excerpt of \"Harlem Nocturne\"]\n\nAfter “Harlem Nocturne” became a hit, and partly through the connection with Doggett, he got the opportunity to tour backing the Ink Spots, which exposed him to a wider audience. He was on his way to being a big star.\n\nAt that time, he was a drummer and vibraphone player. And he was one of the great drummers of the period -- he played, for example, on Ilinois Jacquet's version of \"Flyi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode ten of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Double Crossin' Blues\" by Johnny Otis, Little Esther, and the Robins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nLike last week, this episode talks about a musician losing the use of some fingers. If you want to help others like Johnny Otis, you might want to check out a charity called the One-Handed Musical Instrument Trust, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are a lot of cheap compilations of Johnny Otis' material -- this one seems to be the best value for money, and contains two other songs I already have podcasts written about, and two more that I'm almost certainly going to cover.\n\nThis CD covers Little Esther's first couple of years, including all her recordings for Savoy",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}