{
  "title": "Episode 23: &#8220;Pledging My Love&#8221; by Johnny Ace",
  "link": "https://500songs.com/podcast/episode-23-pledging-my-love-by-johnny-ace/",
  "pubDate": "Mon, 11 Mar 2019 10:59:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=689",
  "description": "Welcome to episode twenty-three of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Pledging My Love\" by Johnny Ace Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm three-quarters of the way through the<a href=\"https://www.kickstarter.com/projects/andrewhickey/a-history-of-rock-music-in-500-songs-vol-1\"> Kickstarter for the first book based on this series.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-23-pledging-my-love/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI've used two main books for the information in this episode -- <a href=\"https://amzn.to/2XQqQh3\">The Late Great Johnny Ace and Transition from R&B to Rock 'n' Roll by James Salem</a> is an exemplary biography, which gets far more detail about its subject than I would have though possible given his short, underdocumented, life, and which also provided some of the background material about Memphis.\n\n<a href=\"https://amzn.to/2RoiMVg\"><em>Big Mama Thornton: Her Life and Music</em> by Michael Spörke </a> is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language. I got some additional details about the overlap between Ace and Thornton, and some of the information about Don Robey, from that.\n\nThe Patreon-only Christmas episode I mention is <a href=\"https://www.patreon.com/posts/23406506\">here,</a> for Patreon backers.\n\nNormally when I'm recommending a way to buy the music I discuss, I link to things available as a CD. This time, I'm going to link to a digital-only release, but it's worth it. <a href=\"https://amzn.to/2F19Duc\">Ace's Wild! The Complete Solo Sides and Sessions</a> contains every track ever recorded and released by Ace, including the posthumous overdubbed tracks; every released track he played on for other Beale Streeters including classics from B.B. King and Bobby \"Blue\" Bland; and a selection of the tribute records I talk about. I know of no physical release that's anywhere near as comprehensive.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA content warning: this episode contains a description of a death by gunshot. I am not using any of the more explicit descriptions of this death, though I do describe some aspects of it, but talking about that subject at all can be upsetting, so if you're likely to be disturbed by that, please turn off now.\n\nIf you're unsure whether you'll be upset, remember that there are blog posts at 500songs.com containing the full text of every episode, and you can read the text there before listening if you wish.\n\nJohnny Ace was born John Alexander Jr -- he used a stage name because his mother didn't approve of secular music -- and he was part of a group of musicians called the Beale Streeters.\n\nTo understand the importance of this group of people, you have to understand Memphis and why it was important.\n\nAmerican regional musical culture could be incredibly specific, and different cities had different specialities. That's changed somewhat now, as transport and communications have got so much better, but certainly in the first half of the twentieth century you'd find that cities a hundred or so miles apart had taken a lot of the same musical influences but put them together in radically different ways.\n\nAnd Memphis, in particular, was an unusual city for the southern US. It was still an intensely racist city by any normal standards, and it was segregated, and thus still home to countless horrors and crimes against humanity. But <em>for the Southern US</em> black people led comparatively comfortable lives, simply because Memphis was very close to fifty percent black in the early decades of the twentieth century -- and was actually majority-black in the late nineteenth. In 1878, there was a plague -- yellow fever swept the city -- and it took an immense toll. Before the 1878 plague, there were fifty-five thousand people living in Memphis. Afterward there were fourteen thousand, and twelve thousand of those were black. The plague killed seventy-five percent of the white people living in Memphis, but only seven percent of the black people. Even though white people moved back into the city and eventually became the majority again, and even though they had all the institutional power of a racist state on their side, there was less of a power imbalance in Memphis, and the white ruling classes simply couldn't keep black people down as thoroughly as in other Southern cities.\n\nMemphis' regional speciality is the blues, and its first great musical hero was W.C. Handy. Even though Handy only lived in Memphis for a few years, having been born in Alabama and later moving to New York, he is indelibly associated with Memphis, and with Beale Street in particular.\n\nHandy claimed to have invented the blues, though his blues wasn't much like what we'd call \"the blues\" these days, and often had an element of the tango about it. And he was certainly the first person to have any kind of hit with blues songwriting, back in a time when hits in music were measured by sheet music sales, before recorded music had become more than an interesting novelty.\n\n[excerpt: \"Beale Street Blues\" by W.C. Handy]\n\nSo Memphis was, as far as the wider world was concerned, and certainly as far as anyone in Memphis itself was concerned, the birthplace of the blues. And Beale Street, more than any other part of Memphis, was <em>the</em> blues area. Everyone knew it.\n\nBeale Street was the centre of black culture, not just for Memphis, but for the whole of Tennessee, in the late forties and early fifties. It wasn't actually called Beale Street on the maps until 1955, but everyone referred to it as \"Beale Street\" anyway. By 1950 people were already complaining about the fact that the \"old\" Beale Street had gone.\n\nBeale Street was where Lansky's was -- the place where the coolest people bought their clothes. There was Schwab's Dry Good Store, where you could buy everything you wanted.\n\nAnd there was the Beale Street Blues Boys, or the Beale Streeters -- accounts vary as to what they actually called themselves. They weren't a band in a traditional sense, but there were a few of them who got together a lot, and when they would make records, they would often play on each others tracks. There was the harmonica player Junior Parker, who would go on to record for every Memphis-based label, often recording in the Sun Studios, and who would write songs like \"Mystery Train\". There was the piano player Roscoe Gordon, who had a unique off-beat way of playing that would later go on to be a massive influence on ska and reggae music. There was the singer Bobby \"Blue\" Bland, one of the most important blues singers of all time, and there was guitarist Riley King, who would later be known as \"the blues boy\", before shortening that and becoming just \"B.B.\" King. And there was Johnny Ace, another piano player and singer.\n\nBut the Beale Street Blues Boys slowly drifted apart. Riley King went off and started cutting his own records for RPM, one of the myriad tiny labels that had sprung up to promote R&B music. And Bobby Bland got drafted, but before he had to go off to be in the armed forces, he went into Sam Phillips' studio and cut a few sides, which were released on Duke Records, backed by the Beale Streeters:\n\n[excerpt \"Lovin' Blues\" by Bobby \"Blue\" Bland and the Beale Streeters]\n\nThat has BB King on guitar and Johnny Ace on the piano, along with George Joyner on bass, Earl Forest on drums, and Adolph Billy Duncan on the saxophone.\n\nShortly after this, Ace's first single came out almost by accident. He was playing piano at a session for Bobby Bland, and Bland couldn't get the lyrics to his song right. In the session downtime, Ace started singing Ruth Brown's hit \"So Long\":\n\n[excerpt: Ruth Brown, \"So Long\"]\n\nDave Mattis, Duke Records' owner, thought that what Ace was doing sounded rather better than the song they were meant to be recording, and so they changed it up just enough for it to count as \"an original\", with Ace coming up with a new melody and Mattis writing new lyrics, and \"My Song\" by Johnny Ace was created:\n\n[Excerpt Johnny Ace: \"My Song\"]\n\nThis would be how all Ace's records would be created from that point on. They would take a pop standard or another song that Ace knew, someone would write new lyrics, and then Ace would come up with a new melody while keeping the chord progression and general feel the same. It was a formula that would lead to a string of hits for Ace.\n\n\"My Song\" might not sound very rock and roll, but the B-side was a jump boogie straight out of the Big Joe Turner style -- \"Follow The Rules\"\n\n[Excerpt Johnny Ace: \"Follow the Rules\"]\n\nThe A-side went to number one on the R&B charts, and was the first of eight hits in a row. Ace's singles would typically have a ballad on the A-side and a boogie number on the B-side.\n\nThis was a typical formula for the time -- you might remember that Cecil Gant had a similar pattern of putting a ballad on one side and a boogie on the other. The idea was to maximise the number of buyers for each single by appealing to two different audiences. And it seemed to work. Ace became very, very popular.\n\nIn fact, he became too popular. Duke Records couldn't keep up with the demand for his records, and Don Robey, the owner of Peacock Records, stepped in, buying them out.\n\nDon Robey had a reputation for violence. He was also, though, one of the few black businessmen in a white-dominated industry, and it might be argued that you can only get to that kind of status with a certain amount of unethical practices.\n\nRobey's business manager and unacknowledged partner, Evelyn Johnson, was by all accounts a far nicer person than Robey. She did the day-to-day running of the businesses, drew up the business plans, and basically did everything that an owner would normally be expected to, while Robey took the money.\n\nJohnson did everything for Robey. When he'd decided to put out records, mostly to promote the blues singer Clarence \"Gatemouth\" Brown, who he managed, Johnson asked him how they were going to go about this, and Robey said \"Hell, I don't know! That's for you to find out!\"\n\nSo Johnson figured out what to do -- you call the Library of Congress. They had all the forms necessary for copyright registration, and whenever they didn't have something, they would give her the details of the organisation that did. She got every copyright and record-related form from the Library of Congress, BMI, and other organisations, and looked over them all. Everything that looked relevant, she filled out. Everything that didn't, she kept in case it was useful later, in a file labelled \"It could be in here\".\n\nJohnson ran the record label, she ran the publishing company, and she ran *and owned* the booking agency. The booking agency started the model that companies like Motown would later use -- cleaning the acts up, giving them lessons in performance, buying them clothes and cars, giving them spending money. She lost money on all the artists that were recording for Robey's labels, where the performances turned into a loss-leader for the record labels, but she made the money back on artists like B.B. King or Ike and Tina Turner, who just turned up and did their job and didn't have to be groomed by the Johnson/Robey operation.\n\nShe never got the credit, because she was a black woman, while Don Robey was a man, but Evelyn Johnson pretty much single-handedly built up the careers of every black artist in Texas, Tennessee, Mississippi or California during the early part of the 1950s.\n\nFrom this point on, Duke became part of the Don Robey empire, run by Evelyn Johnson. For a while, Dave Mattis was a silent partner, but when he noticed he was getting neither money nor a say, he went to see Robey to complain. Robey pulled a gun on Mattis, and bought out Mattis for a tiny fraction of what his share of the record company was actually worth.\n\nOnce Robey had bought Duke, Ace started working with Johnny Otis as many of the other Duke and Peacock artists did, and his records from then on were recorded in Houston, usually with the Johnny Otis band, and with Otis producing, though sometimes Ace's own touring band would play on the records instead.\n\nAce's formula owed a lot to Charles Brown's sophisticated West Coast blues. For those who haven't heard the Patreon-only bonus Christmas episode of this podcast, Brown was the missing link between the styles of Nat King Cole and Ray Charles, and his smooth lounge blues was an important precursor to a lot of the more laid back kinds of soul music.\n\nHere's a clip of \"Merry Christmas Baby\" by Johnny Moore's Three Blazers, with Brown on lead vocals, so you can see what I mean about the resemblance:\n\n[Excerpt \"Merry Christmas Baby\" Johnny Moore's Three Blazers]\n\nNow, there is a very important point to be made here, and that is that Johnny Ace's music was <em>extremely</em> popular with a black audience. He didn't get a white audience until after his death, and that audience was largely only interested in one record -- \"Pledging My Love\". It's important to point this out because for much of the time after his death his music was dismissed by white music critics precisely because it didn't fit their ideas of what black music was, and they assumed he was trying to appeal to a white audience. In fact there's a derogatory term for the smooth-sounding blues singers, which I won't repeat here, but which implies that they were \"white on the inside\".\n\nNothing could be further from the truth. As Johnny Otis said, Ace was \"too smooth for the white critics and white writers for a long time.\" He pointed out that this was \"white arrogance\", suggesting that \"black people are not the best judge of what was the best art to come out of the community, but the white writers are.\" Otis' point, which I agree with, was that, in his words, \"you have to take your cue from the people of the community. They know better than you what they like and what is black artistry.\"\n\nAce's music -- yearning ballads about unrequited love, sung in a smooth, mellow, voice -- didn't fit with white preconceptions about the proper music that black men should be making, and so for decades his work was more or less airbrushed out of history. It was inconvenient for the white mythmakers to have a black man playing sophisticated music.\n\nBut that music was hugely popular among black audiences. \"The Clock\", for example, went to number one on the R&B charts, and stayed on the charts from June through October 1953.\n\n[excerpt: Johnny Ace: \"The Clock\"]\n\nHis follow-ups to “The Clock” weren't as big, and there was a sign he was entering diminishing returns, but his records stayed on the charts for longer than most, and as a result his releases were also less frequent. Don Robey stockpiled his recordings, putting out just one single every six months, waiting for the previous single to fall off the charts before releasing the next one. This stockpiling would prove very lucrative for him.\n\nBecause while Ace was a sophisticated performer, he lived a less sophisticated life. One of his hobbies was to drive at top speed, while drunk, and shoot the zeroes out of road signs. With a lifestyle like that, it is probably not all that surprising that Ace didn't live to a ripe old age, but the story of his death is still one that might be shocking or upsetting, and one that is still sad even though it was probably inevitable.\n\nThe last song Johnny Ace played live was \"Yes, Baby\" -- a duet with Big Mama Thornton, who had been his regular touring partner for quite a while. The two would tour together and Thornton would be backed by Ace's band, with another pianist. Ace would take over from the pianist for his own set, and then the two of them would duet together:\n\n[excerpt \"Yes Baby\" -- Johnny Ace and Big Mama Thornton]\n\nAs you can hear, that <em>wasn't</em> one of his mellow ballads.\n\nAce's live shows were a big draw. Evelyn Johnson said on several occasions that Ace was so popular that she used his popularity to make deals on less popular acts -- if you wanted to book Johnny Ace you had to book B.B. King or Bobby \"Blue\" Bland as well, and those acts built their own followings through playing those gigs, often on the same bill as Ace and Big Mama Thornton.\n\nBy all accounts the show in Houston on Christmas Day was a massively enjoyable one -- right up until the point that it very suddenly wasn't.\n\nThe rumour that went round in the days after his death was that he was killed playing Russian roulette. That's still what most people who talk about him think happened. This would have been a tragic way to go, but at least he would have known the possible consequences, and you have to think that no-one is going to play Russian roulette unless they have some sort of death wish.\n\nAnd there were other rumours that went around -- one that persists to this day, and that I inadvertently repeated in episode ten, is that Little Esther was present. She wasn't, as far as I can tell.\n\nAnd the darkest rumours, repeated by people who like to sensationalise things, claim that it was a hit from Don Robey, that Ace was planning on changing record labels.\n\nBut that's not what actually happened. What happened is much more upsetting, and even more pointlessly tragic.\n\nJohnny Ace was backstage in Houston with a bunch of people -- Big Mama Thornton and the band's bass player Curtis Tilman were there, as were Ace's girlfriend and some other people. It was Christmas day, they were killing time between sets, and they'd been drinking. Ace was waving a gun around and making people nervous. He was in a bad mood because he had a toothache, and he was feeling tired and annoyed.\n\nAccounts vary slightly as to what happened next, but Big Mama Thornton's was given as a legal deposition only a couple of hours after his death, before exaggeration set in.\n\n\"Johnny was pointing this pistol at Mary Carter and Joe Hamilton. He was kind of waving it around. I asked Johnny to let me see the gun. He gave it to me and when I turned the chamber a .22 cal. Bullet fell out in my hand. Johnny told me to put it back in where it wouldn’t fall out. I put it back and gave it to him. I told him not to snap it to nobody. After he got the pistol back, Johnny pointed the pistol at Mary Carter and pulled the trigger. It snapped. Olivia was still sitting on his lap. I told Johnny again not to snap the pistol at anybody. Johnny then put the pistol to Olivia’s head and pulled the trigger. It snapped. Johnny said, ‘I’ll show you that it won’t shoot.’ He held the pistol up and looked at it first and then put it to his head. I started towards the door and heard the pistol go off. I turned around and saw Johnny falling to the floor. I saw that he was shot and I run on stage and told the people in the band about it.\"\n\nAccording to Evelyn Johnson, Ace's hair stood on end from the shock, and he died with \"a smirky little grin on his face, and his expression was 'What'd I say?'\"\n\nHe was only twenty-five, and he'd been the most successful rhythm and blues singer of the previous year. When Cash Box, the trade paper, polled disc jockeys in December 1954 to find out who the most played artist of 1954 had been, Ace was the clear favourite. Shortly after his death, Duke Records announced that he had had three records top one and three quarter million sales the previous year. That is, to put it bluntly, a ludicrous amount -- almost nothing sold that much, and one is tempted to believe that Duke were slightly manipulating the figures -- but that it's at all plausible says a lot about how popular Johnny Ace was at the time.\n\nAfter Ace's death, \"Pledging My Love\" instantly became his biggest hit:\n\n[excerpt: \"Pledging My Love\", Johnny Ace]\n\n\"Pledging My Love\" is credited to Fats Washington, the lyricist behind many of B.B. King's songs from this period, and Don Robey as songwriters, but it's safe to say that Ace himself wrote the music, with Robey taking the credit.\n\nRobey apparently never wrote a song in his life, but you wouldn't believe it from the songwriting credits of any record that was put out by Duke or Peacock records. There, Don Robey, or his pseudonym Deadric Malone, would appear to be one of the most prolific songwriters of all time, writing in a whole variety of different styles -- everything from \"Love of Jesus\" to \"Baby, What's Your Pants Doing Wet?\" In total, he's credited as writer for 1200 different songs.\n\n“Pledging My Love” was released only days before Ace's death, and the initial expectation was that it would follow the diminishing returns that had set in since \"The Clock\", becoming a modest but not overwhelming hit. Instead, it became a massive smash hit, and his biggest record ever, and it gained him a whole new fanbase -- white teenagers, who had previously not been buying his records in any large numbers.\n\nBlack people in the fifties mostly still bought 78s, because they tended to be poorer and so not buying new hi-fi equipment when they could still use their old ones. 45s, in the R&B market, were mostly for jukeboxes. But for the first time ever, the pressing plant that dealt with Duke's records couldn't keep up with the demand for 45s -- so much so that the record was held back on the jukebox charts, because the label couldn't service the demand. The records were being bought by young white teenagers, instead of his previous older black audiences -- although that other audience still bought the record.\n\nAce's death came at a crucial transition point for the acceptance of rhythm and blues among white record buyers, and \"Pledging My Love\" acted as a catalyst. Until a couple of years earlier, songs owned by ASCAP, the performing rights society that dealt only with \"respectable\" composers for the Tin Pan Alley publishing houses, made up about eight times as many hits as songs owned by BMI, who dealt with the blues and hillbilly musicians. But in early 1955, eight of the ten biggest hits were BMI songs. \"Pledging My Love\" came at precisely the right moment to pick up on that new wave. There were white cover versions of the record, but people wanted the original, and Johnny Ace's version made the *pop* top twenty.\n\nWhat none of this did was give Ace's family any money. Don Robey told them, after Ace's death, that Ace owed <em>him</em> money rather than the other way round.\n\nAnd Ace and his family didn't receive even the songwriting royalties Ace was owed for the few songs he was credited with. While Robey was registered with BMI, and registered the songs with them, he had a policy of keeping his artists as ignorant as possible of the business side of things, and so he didn't let Ace know that Ace would also have to register with BMI to receive any money. Because of this, his widow didn't even know that BMI existed until James Salem, Ace's biographer, told her in the mid-nineties, and it was only then that she started to get some of the songwriting royalties she and her children had been entitled to for forty-plus years worth of sales and radio play.\n\nRobey wasn't the only one making money from Ace. Cash-in tribute records were released, including two separate ones by Johnny Moore's Blazers, and records by Johnny Fuller, Vanetta Dillard, the Five Wings and the Rovers.\n\nAll of these records were incredibly tasteless -- usually combining a bunch of quotes from Ace's lyrics to provide his \"last letter\" or a letter from heaven or similar, and backing them with backing tracks that were as close as possible to the ones Ace used. This is a typical example, \"Why Johnny Why\" by Linda Hayes with Johnny Moore's Blazers\n\n[excerpt: \"Why Johnny Why\" by Linda Hayes]\n\nAnd after Don Robey had completely scraped the barrel of unreleased Ace recordings, he tried to sign Johnny Ace's brother, St. Clair Alexander, to a record deal, but eventually decided that Alexander wasn't quite good enough (though Alexander would spend the next few decades performing a tribute show to his brother, which many people thought was quite decent). Instead, Robey persuaded a blues singer named Jimmie Lee Land to perform as \"Buddy Ace\" in the hope of milking it some more, and put out press releases claiming that \"Buddy\" was Johnny Ace's brother. Buddy Ace's first record was released simultaneously with the last tracks from Johnny that were in the vault, putting out adverts talking about \"the last record on the immortal Johnny Ace to complete your collection\" and \"the first record on the versatile Buddy Ace to start your collection\".\n\nBuddy Ace actually made some very strong records, but he didn't really sound much like Johnny:\n\n[excerpt: Buddy Ace: \"What Can I Do\"]\n\nBuddy Ace did not duplicate Johnny's success, though he continued as a moderately successful performer until the day he died – which was, rather eerily, while performing in Texas, forty years to the day after Johnny Ace died.\n\nBut Robey wanted to milk the catalogue, and tried in 1957 to resuscitate the career of his dead star by getting the Jordanaires, famous for backing Elvis Presley, to overdub new backing vocals on Ace's hits:\n\n[excerpt: Johnny Ace with the Jordanaires: \"Pledging My Love\"]\n\nThis musical graverobbing was not successful, and all it did was sour Johnny Otis on Robey, as Robey had agreed that Otis' productions would remain untouched. Even forty years afterwards -- and twenty years after Robey's death -- it would still infuriate Otis.\n\nBut probably the most well-known of all the posthumous releases to do with Johnny Ace came in 1983, when Paul Simon wrote and recorded \"The Late Great Johnny Ace\", a song which linked Ace with two other Johns who died of gunshot wounds -- Lennon and Kennedy:\n\n[excerpt: Paul Simon \"The Late Great Johnny Ace\"]\n\nThat's from Simon's \"Hearts and Bones\", an album that was steeped in nostalgia for the music of the period when rhythm and blues was just starting to turn into rock and roll. The period defined by the late, great, Johnny Ace.",
  "itunes:subtitle": "Welcome to episode twenty-three of A History of Rock Music in Five Hundred Songs. Today were looking at Pledging My Love by Johnny Ace Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember Im",
  "itunes:keywords": "B.B. King,Big Mama Thornton,Bobby Blue Bland,Charles Brown,death discs,Don Robey,Duke Records,Johnny Ace,Johnny Otis,Junior Parker,Linda Hayes,Paul Simon,Peacock Records,racism,Sam Phillips,The Beale Streeters,The Jordanaires,W.C. Handy",
  "itunes:episodeType": "full",
  "itunes:episode": 23,
  "content:encoded": "Welcome to episode twenty-three of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Pledging My Love\" by Johnny Ace Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm three-quarters of the way through the<a href=\"https://www.kickstarter.com/projects/andrewhickey/a-history-of-rock-music-in-500-songs-vol-1\"> Kickstarter for the first book based on this series.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-23-pledging-my-love/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI've used two main books for the information in this episode -- <a href=\"https://amzn.to/2XQqQh3\">The Late Great Johnny Ace and Transition from R&B to Rock 'n' Roll by James Salem</a> is an exemplary biography, which gets far more detail about its subject than I would have though possible given his short, underdocumented, life, and which also provided some of the background material about Memphis.\n\n<a href=\"https://amzn.to/2RoiMVg\"><em>Big Mama Thornton: Her Life and Music</em> by Michael Spörke </a> is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language. I got some additional details about the overlap between Ace and Thornton, and some of the information about Don Robey, from that.\n\nThe Patreon-only Christmas episode I mention is <a href=\"https://www.patreon.com/posts/23406506\">here,</a> for Patreon backers.\n\nNormally when I'm recommending a way to buy the music I discuss, I link to things available as a CD. This time, I'm going to link to a digital-only release, but it's worth it. <a href=\"https://amzn.to/2F19Duc\">Ace's Wild! The Complete Solo Sides and Sessions</a> contains every track ever recorded and released by Ace, including the posthumous overdubbed tracks; every released track he played on for other Beale Streeters including classics from B.B. King and Bobby \"Blue\" Bland; and a selection of the tribute records I talk about. I know of no physical release that's anywhere near as comprehensive.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nA content warning: this episode contains a description of a death by gunshot. I am not using any of the more explicit descriptions of this death, though I do describe some aspects of it, but talking about that subject at all can be upsetting, so if you're likely to be disturbed by that, please turn off now.\n\nIf you're unsure whether you'll be upset, remember that there are blog posts at 500songs.com containing the full text of every episode, and you can read the text there before listening if you wish.\n\nJohnny Ace was born John Alexander Jr -- he used a stage name because his mother didn't approve of secular music -- and he was part of a group of musicians called the Beale Streeters.\n\nTo understand the importance of this group of people, you have to understand Memphis and why it was important.\n\nAmerican regional musical culture could be incredibly specific, and different cities had different specialities. That's changed somewhat now, as transport and communications have got so much better, but certainly in the first half of the twentieth century you'd find that cities a hundred or so miles apart had taken a lot of the same musical influences but put them together in radically different ways.\n\nAnd Memphis, in particular, was an unusual city for the southern US. It was still an intensely racist city by any normal standards, and it was segregated, and thus still home to countless horrors and crimes against humanity. But <em>for the Southern US</em> black people led comparatively comfortable lives, simply because Memphis was very close to fifty percent black in the early decades of the twentieth century -- and was actually majority-black in the late nineteenth. In 1878, there was a plague -- yellow fever swept the city -- and it took an immense toll. Before the 1878 plague, there were fifty-five thousand people living in Memphis. Afterward there were fourteen thousand, and twelve thousand of those were black. The plague killed seventy-five percent of the white people living in Memphis, but only seven percent of the black people. Even though white people moved back into the city and eventually became the majority again, and even though they had all the institutional power of a racist state on their side, there was less of a power imbalance in Memphis, and the white ruling classes simply couldn't keep black people down as thoroughly as in other Southern cities.\n\nMemphis' regional speciality is the blues, and its first great musical hero was W.C. Handy. Even though Handy only lived in Memphis for a few years, having been born in Alabama and later moving to New York, he is indelibly associated with Memphis, and with Beale Street in particular.\n\nHandy claimed to have invented the blues, though his blues wasn't much like what we'd call \"the blues\" these days, and often had an element of the tango about it. And he was certainly the first person to have any kind of hit with blues songwriting, back in a time when hits in music were measured by sheet music sales, before recorded music had become more than an interesting novelty.\n\n[excerpt: \"Beale Street Blues\" by W.C. Handy]\n\nSo Memphis was, as far as the wider world was concerned, and certainly as far as anyone in Memphis itself was concerned, the birthplace of the blues. And Beale Street, more than any other part of Memphis, was <em>the</em> blues area. Everyone knew it.\n\nBeale Street was the centre of black culture, not just for Memphis, but for the whole of Tennessee, in the late forties and early fifties. It wasn't actually called Beale Street on the maps until 1955, but everyone referred to it as \"Beale Street\" anyway. By 1950 people were already complaining about the fact that the \"old\" Beale Street had gone.\n\nBeale Street was where Lansky's was -- the place where the coolest people bought their clothes. There was Schwab's Dry Good Store, where you could buy everything you wanted.\n\nAnd there was the Beale Street Blues Boys, or the Beale Streeters -- accounts vary as to what they actually called themselves. They weren't a band in a traditional sense, but there were a few of them who got together a lot, and when they would make records, they would often play on each others tracks. There was the harmonica player Junior Parker, who would go on to record for every Memphis-based label, often recording in the Sun Studios, and who would write songs like \"Mystery Train\". There was the piano player Roscoe Gordon, who had a unique off-beat way of playing that would later go on to be a massive influence on ska and reggae music. There was the singer Bobby \"Blue\" Bland, one of the most important blues singers of all time, and there was guitarist Riley King, who would later be known as \"the blues boy\", before shortening that and becoming just \"B.B.\" King. And there was Johnny Ace, another piano player and singer.\n\nBut the Beale Street Blues Boys slowly drifted apart. Riley King went off and started cutting his own records for RPM, one of the myriad tiny labels that had sprung up to promote R&B music. And Bobby Bland got drafted, but before he had to go off to be in the armed forces, he went into Sam Phillips' studio and cut a few sides, which were released on Duke Records, backed by the Beale Streeters:\n\n[excerpt \"Lovin' Blues\" by Bobby \"Blue\" Bland and the Beale Streeters]\n\nThat has BB King on guitar and Johnny Ace on the piano, along with George Joyner on bass, Earl Forest on drums, and Adolph Billy Duncan on the saxophone.\n\nShortly after this, Ace's first single came out almost by accident. He was playing piano at a session for Bobby Bland, and Bland couldn't get the lyrics to his song right. In the session downtime, Ace started singing Ruth Brown's hit \"So Long\":\n\n[excerpt: Ruth Brown, \"So Long\"]\n\nDave Mattis, Duke Records' owner, thought that what Ace was doing sounded rather better than the song they were meant to be recording, and so they changed it up just enough for it to count as \"an original\", with Ace coming up with a new melody and Mattis writing new lyrics, and \"My Song\" by Johnny Ace was created:\n\n[Excerpt Johnny Ace: \"My Song\"]\n\nThis would be how all Ace's records would be created from that point on. They would take a pop standard or another song that Ace knew, someone would write new lyrics, and then Ace would come up with a new melody while keeping the chord progression and general feel the same. It was a formula that would lead to a string of hits for Ace.\n\n\"My Song\" might not sound very rock and roll, but the B-side was a jump boogie straight out of the Big Joe Turner style -- \"Follow The Rules\"\n\n[Excerpt Johnny Ace: \"Follow the Rules\"]\n\nThe A-side went to number one on the R&B charts, and was the first of eight hits in a row. Ace's singles would typically have a ballad on the A-side and a boogie number on the B-side.\n\nThis was a typical formula for the time -- you might remember that Cecil Gant had a similar pattern of putting a ballad on one side and a boogie on the other. The idea was to maximise the number of buyers for each single by appealing to two different audiences. And it seemed to work. Ace became very, very popular.\n\nIn fact, he became too popular. Duke Records couldn't keep up with the demand for his records, and Don Robey, the owner of Peacock Records, stepped in, buying them out.\n\nDon Robey had a reputation for violence. He was also, though, one of the few black businessmen in a white-dominated industry, and it might be argued that you can only get to that kind of status with a certain amount of unethical practices.\n\nRobey's business manager and unacknowledged partner, Evelyn Johnson, was by all accounts a far nicer person than Robey. She did the day-to-day running of the businesses, drew up the business plans, and basically did everything that an owner would normally be expected to, while Robey took the money.\n\nJohnson did everything for Robey. When he'd decided to put out records, mostly to promote the blues singer Clarence \"Gatemouth\" Brown, who he managed, Johnson asked him how they were going to go about this, and Robey said \"Hell, I don't know! That's for you to find out!\"\n\nSo Johnson figured out what to do -- you call the Library of Congress. They had all the forms necessary for copyright registration, and whenever they didn't have something, they would give her the details of the organisation that did. She got every copyright and record-related form from the Library of Congress, BMI, and other organisations, and looked over them all. Everything that looked relevant, she filled out. Everything that didn't, she kept in case it was useful later, in a file labelled \"It could be in here\".\n\nJohnson ran the record label, she ran the publishing company, and she ran *and owned* the booking agency. The booking agency started the model that companies like Motown would later use -- cleaning the acts up, giving them lessons in performance, buying them clothes and cars, giving them spending money. She lost money on all the artists that were recording for Robey's labels, where the performances turned into a loss-leader for the record labels, but she made the money back on artists like B.B. King or Ike and Tina Turner, who just turned up and did their job and didn't have to be groomed by the Johnson/Robey operation.\n\nShe never got the credit, because she was a black woman, while Don Robey was a man, but Evelyn Johnson pretty much single-handedly built up the careers of every black artist in Texas, Tennessee, Mississippi or California during the early part of the 1950s.\n\nFrom this point on, Duke became part of the Don Robey empire, run by Evelyn Johnson. For a while, Dave Mattis was a silent partner, but when he noticed he was getting neither money nor a say, he went to see Robey to complain. Robey pulled a gun on Mattis, and bought out Mattis for a tiny fraction of what his share of the record company was actually worth.\n\nOnce Robey had bought Duke, Ace started working with Johnny Otis as many of the other Duke and Peacock artists did, and his records from then on were recorded in Houston, usually with the Johnny Otis band, and with Otis producing, though sometimes Ace's own touring band would play on the records instead.\n\nAce's formula owed a lot to Charles Brown's sophisticated West Coast blues. For those who haven't heard the Patreon-only bonus Christmas episode of this podcast, Brown was the missing link between the styles of Nat King Cole and Ray Charles, and his smooth lounge blues was an important precursor to a lot of the more laid back kinds of soul music.\n\nHere's a clip of \"Merry Christmas Baby\" by Johnny Moore's Three Blazers, with Brown on lead vocals, so you can see what I mean about the resemblance:\n\n[Excerpt \"Merry Christmas Baby\" Johnny Moore's Three Blazers]\n\nNow, there is a very important point to be made here, and that is that Johnny Ace's music was <em>extremely</em> popular with a black audience. He didn't get a white audience until after his death, and that audience was largely only interested in one record -- \"Pledging My Love\". It's important to point this out because for much of the time after his death his music was dismissed by white music critics precisely because it didn't fit their ideas of what black music was, and they assumed he was trying to appeal to a white audience. In fact there's a derogatory term for the smooth-sounding blues singers, which I won't repeat here, but which implies that they were \"white on the inside\".\n\nNothing could be further from the truth. As Johnny Otis said, Ace was \"too smooth for the white critics and white writers for a long time.\" He pointed out that this was \"white arrogance\", suggesting that \"black people are not the best judge of what was the best art to come out of the community, but the white writers are.\" Otis' point, which I agree with, was that, in his words, \"you have to take your cue from the people of the community. They know better than you what they like and what is black artistry.\"\n\nAce's music -- yearning ballads about unrequited love, sung in a smooth, mellow, voice -- didn't fit with white preconceptions about the proper music that black men should be making, and so for decades his work was more or less airbrushed out of history. It was inconvenient for the white mythmakers to have a black man playing sophisticated music.\n\nBut that music was hugely popular among black audiences. \"The Clock\", for example, went to number one on the R&B charts, and stayed on the charts from June through October 1953.\n\n[excerpt: Johnny Ace: \"The Clock\"]\n\nHis follow-ups to “The Clock” weren't as big, and there was a sign he was entering diminishing returns, but his records stayed on the charts for longer than most, and as a result his releases were also less frequent. Don Robey stockpiled his recordings, putting out just one single every six months, waiting for the previous single to fall off the charts before releasing the next one. This stockpiling would prove very lucrative for him.\n\nBecause while Ace was a sophisticated performer, he lived a less sophisticated life. One of his hobbies was to drive at top speed, while drunk, and shoot the zeroes out of road signs. With a lifestyle like that, it is probably not all that surprising that Ace didn't live to a ripe old age, but the story of his death is still one that might be shocking or upsetting, and one that is still sad even though it was probably inevitable.\n\nThe last song Johnny Ace played live was \"Yes, Baby\" -- a duet with Big Mama Thornton, who had been his regular touring partner for quite a while. The two would tour together and Thornton would be backed by Ace's band, with another pianist. Ace would take over from the pianist for his own set, and then the two of them would duet together:\n\n[excerpt \"Yes Baby\" -- Johnny Ace and Big Mama Thornton]\n\nAs you can hear, that <em>wasn't</em> one of his mellow ballads.\n\nAce's live shows were a big draw. Evelyn Johnson said on several occasions that Ace was so popular that she used his popularity to make deals on less popular acts -- if you wanted to book Johnny Ace you had to book B.B. King or Bobby \"Blue\" Bland as well, and those acts built their own followings through playing those gigs, often on the same bill as Ace and Big Mama Thornton.\n\nBy all accounts the show in Houston on Christmas Day was a massively enjoyable one -- right up until the point that it very suddenly wasn't.\n\nThe rumour that went round in the days after his death was that he was killed playing Russian roulette. That's still what most people who talk about him think happened. This would have been a tragic way to go, but at least he would have known the possible consequences, and you have to think that no-one is going to play Russian roulette unless they have some sort of death wish.\n\nAnd there were other rumours that went around -- one that persists to this day, and that I inadvertently repeated in episode ten, is that Little Esther was present. She wasn't, as far as I can tell.\n\nAnd the darkest rumours, repeated by people who like to sensationalise things, claim that it was a hit from Don Robey, that Ace was planning on changing record labels.\n\nBut that's not what actually happened. What happened is much more upsetting, and even more pointlessly tragic.\n\nJohnny Ace was backstage in Houston with a bunch of people -- Big Mama Thornton and the band's bass player Curtis Tilman were there, as were Ace's girlfriend and some other people. It was Christmas day, they were killing time between sets, and they'd been drinking. Ace was waving a gun around and making people nervous. He was in a bad mood because he had a toothache, and he was feeling tired and annoyed.\n\nAccounts vary slightly as to what happened next, but Big Mama Thornton's was given as a legal deposition only a couple of hours after his death, before exaggeration set in.\n\n\"Johnny was pointing this pistol at Mary Carter and Joe Hamilton. He was kind of waving it around. I asked Johnny to let me see the gun. He gave it to me and when I turned the chamber a .22 cal. Bullet fell out in my hand. Johnny told me to put it back in where it wouldn’t fall out. I put it back and gave it to him. I told him not to snap it to nobody. After he got the pistol back, Johnny pointed the pistol at Mary Carter and pulled the trigger. It snapped. Olivia was still sitting on his lap. I told Johnny again not to snap the pistol at anybody. Johnny then put the pistol to Olivia’s head and pulled the trigger. It snapped. Johnny said, ‘I’ll show you that it won’t shoot.’ He held the pistol up and looked at it first and then put it to his head. I started towards the door and heard the pistol go off. I turned around and saw Johnny falling to the floor. I saw that he was shot and I run on stage and told the people in the band about it.\"\n\nAccording to Evelyn Johnson, Ace's hair stood on end from the shock, and he died with \"a smirky little grin on his face, and his expression was 'What'd I say?'\"\n\nHe was only twenty-five, and he'd been the most successful rhythm and blues singer of the previous year. When Cash Box, the trade paper, polled disc jockeys in December 1954 to find out who the most played artist of 1954 had been, Ace was the clear favourite. Shortly after his death, Duke Records announced that he had had three records top one and three quarter million sales the previous year. That is, to put it bluntly, a ludicrous amount -- almost nothing sold that much, and one is tempted to believe that Duke were slightly manipulating the figures -- but that it's at all plausible says a lot about how popular Johnny Ace was at the time.\n\nAfter Ace's death, \"Pledging My Love\" instantly became his biggest hit:\n\n[excerpt: \"Pledging My Love\", Johnny Ace]\n\n\"Pledging My Love\" is credited to Fats Washington, the lyricist behind many of B.B. King's songs from this period, and Don Robey as songwriters, but it's safe to say that Ace himself wrote the music, with Robey taking the credit.\n\nRobey apparently never wrote a song in his life, but you wouldn't believe it from the songwriting credits of any record that was put out by Duke or Peacock records. There, Don Robey, or his pseudonym Deadric Malone, would appear to be one of the most prolific songwriters of all time, writing in a whole variety of different styles -- everything from \"Love of Jesus\" to \"Baby, What's Your Pants Doing Wet?\" In total, he's credited as writer for 1200 different songs.\n\n“Pledging My Love” was released only days before Ace's death, and the initial expectation was that it would follow the diminishing returns that had set in since \"The Clock\", becoming a modest but not overwhelming hit. Instead, it became a massive smash hit, and his biggest record ever, and it gained him a whole new fanbase -- white teenagers, who had previously not been buying his records in any large numbers.\n\nBlack people in the fifties mostly still bought 78s, because they tended to be poorer and so not buying new hi-fi equipment when they could still use their old ones. 45s, in the R&B market, were mostly for jukeboxes. But for the first time ever, the pressing plant that dealt with Duke's records couldn't keep up with the demand for 45s -- so much so that the record was held back on the jukebox charts, because the label couldn't service the demand. The records were being bought by young white teenagers, instead of his previous older black audiences -- although that other audience still bought the record.\n\nAce's death came at a crucial transition point for the acceptance of rhythm and blues among white record buyers, and \"Pledging My Love\" acted as a catalyst. Until a couple of years earlier, songs owned by ASCAP, the performing rights society that dealt only with \"respectable\" composers for the Tin Pan Alley publishing houses, made up about eight times as many hits as songs owned by BMI, who dealt with the blues and hillbilly musicians. But in early 1955, eight of the ten biggest hits were BMI songs. \"Pledging My Love\" came at precisely the right moment to pick up on that new wave. There were white cover versions of the record, but people wanted the original, and Johnny Ace's version made the *pop* top twenty.\n\nWhat none of this did was give Ace's family any money. Don Robey told them, after Ace's death, that Ace owed <em>him</em> money rather than the other way round.\n\nAnd Ace and his family didn't receive even the songwriting royalties Ace was owed for the few songs he was credited with. While Robey was registered with BMI, and registered the songs with them, he had a policy of keeping his artists as ignorant as possible of the business side of things, and so he didn't let Ace know that Ace would also have to register with BMI to receive any money. Because of this, his widow didn't even know that BMI existed until James Salem, Ace's biographer, told her in the mid-nineties, and it was only then that she started to get some of the songwriting royalties she and her children had been entitled to for forty-plus years worth of sales and radio play.\n\nRobey wasn't the only one making money from Ace. Cash-in tribute records were released, including two separate ones by Johnny Moore's Blazers, and records by Johnny Fuller, Vanetta Dillard, the Five Wings and the Rovers.\n\nAll of these records were incredibly tasteless -- usually combining a bunch of quotes from Ace's lyrics to provide his \"last letter\" or a letter from heaven or similar, and backing them with backing tracks that were as close as possible to the ones Ace used. This is a typical example, \"Why Johnny Why\" by Linda Hayes with Johnny Moore's Blazers\n\n[excerpt: \"Why Johnny Why\" by Linda Hayes]\n\nAnd after Don Robey had completely scraped the barrel of unreleased Ace recordings, he tried to sign Johnny Ace's brother, St. Clair Alexander, to a record deal, but eventually decided that Alexander wasn't quite good enough (though Alexander would spend the next few decades performing a tribute show to his brother, which many people thought was quite decent). Instead, Robey persuaded a blues singer named Jimmie Lee Land to perform as \"Buddy Ace\" in the hope of milking it some more, and put out press releases claiming that \"Buddy\" was Johnny Ace's brother. Buddy Ace's first record was released simultaneously with the last tracks from Johnny that were in the vault, putting out adverts talking about \"the last record on the immortal Johnny Ace to complete your collection\" and \"the first record on the versatile Buddy Ace to start your collection\".\n\nBuddy Ace actually made some very strong records, but he didn't really sound much like Johnny:\n\n[excerpt: Buddy Ace: \"What Can I Do\"]\n\nBuddy Ace did not duplicate Johnny's success, though he continued as a moderately successful performer until the day he died – which was, rather eerily, while performing in Texas, forty years to the day after Johnny Ace died.\n\nBut Robey wanted to milk the catalogue, and tried in 1957 to resuscitate the career of his dead star by getting the Jordanaires, famous for backing Elvis Presley, to overdub new backing vocals on Ace's hits:\n\n[excerpt: Johnny Ace with the Jordanaires: \"Pledging My Love\"]\n\nThis musical graverobbing was not successful, and all it did was sour Johnny Otis on Robey, as Robey had agreed that Otis' productions would remain untouched. Even forty years afterwards -- and twenty years after Robey's death -- it would still infuriate Otis.\n\nBut probably the most well-known of all the posthumous releases to do with Johnny Ace came in 1983, when Paul Simon wrote and recorded \"The Late Great Johnny Ace\", a song which linked Ace with two other Johns who died of gunshot wounds -- Lennon and Kennedy:\n\n[excerpt: Paul Simon \"The Late Great Johnny Ace\"]\n\nThat's from Simon's \"Hearts and Bones\", an album that was steeped in nostalgia for the music of the period when rhythm and blues was just starting to turn into rock and roll. The period defined by the late, great, Johnny Ace.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-three of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Pledging My Love\" by Johnny Ace Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm three-quarters of the way through the Kickstarter for the first book based on this series.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used two main books for the information in this episode -- The Late Great Johnny Ace and Transition from R&B to Rock 'n' Roll by James Salem is an exemplary biography, which gets far more detail about its subject than I would have though possible given his short, underdocumented, life, and which also provided some of the background material about Memphis.\n\nBig Mama Thornton: Her Life and Music by Michael Spörke  is the only biography of Thornton. It's very well researched, but suffers somewhat from English not being its author's first language. I got some additional details about the overlap between Ace and Thornton, and some of the information about Don Robey, from that.\n\nThe Patreon-only Christmas episode I mention is here, for Patreon backers.\n\nNormally when I'm recommending a way to buy the music I discuss, I link to things available as a CD. This time, I'm going to link to a digital-only release, but it's worth it. Ace's Wild! The Complete Solo Sides and Sessions contains every track ever recorded and released by Ace, including the posthumous overdubbed tracks; every released track he played on for other Beale Streeters including classics from B.B. King and Bobby \"Blue\" Bland; and a selection of the tribute records I talk about. I know of no physical release that's anywhere near as comprehensive.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nA content warning: this episode contains a description of a death by gunshot. I am not using any of the more explicit descriptions of this death, though I do describe some aspects of it, but talking about that subject at all can be upsetting, so if you're likely to be disturbed by that, please turn off now.\n\nIf you're unsure whether you'll be upset, remember that there are blog posts at 500songs.com containing the full text of every episode, and you can read the text there before listening if you wish.\n\nJohnny Ace was born John Alexander Jr -- he used a stage name because his mother didn't approve of secular music -- and he was part of a group of musicians called the Beale Streeters.\n\nTo understand the importance of this group of people, you have to understand Memphis and why it was important.\n\nAmerican regional musical culture could be incredibly specific, and different cities had different specialities. That's changed somewhat now, as transport and communications have got so much better, but certainly in the first half of the twentieth century you'd find that cities a hundred or so miles apart had taken a lot of the same musical influences but put them together in radically different ways.\n\nAnd Memphis, in particular, was an unusual city for the southern US. It was still an intensely racist city by any normal standards, and it was segregated, and thus still home to countless horrors and crimes against humanity. But for the Southern US black people led comparatively comfortable lives, simply because Memphis was very close to fifty percent black in the early decades of the twentieth century -- and was actually majority-black in the late nineteenth. In 1878, there was a plague -- yellow fever swept the city -- and it took an immense toll. Before the 1878 plague, there were fifty-five thousand people living in Memphis. Afterward there were fourteen thousand, and twelve thousand of those were black. The plague killed seventy-five percent of the white people living in Memphis, but only seven percent of the black people. Even though white people mo",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-three of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Pledging My Love\" by Johnny Ace Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nAlso, remember I'm three-quarters of the way through the Kickstarter for the first book based on this series.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used two main books for the information in this episode -- The Late Great Johnny Ace and Transition from R&B to Rock 'n' Roll by James Salem is an exemplary biography, which gets far more detail about its subject than I would have though possible given his short, underdocumented, life, and which also provided some of the background material about Memphis.\n\nBig Mama Thornton: Her Life and Music by Michael Spörke  is the only biography of Thornton. It's very well researched, but suffers somewhat from English not bei",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}