{
  "id": "yt:video:4M6lrhuiPv0",
  "yt:videoId": "4M6lrhuiPv0",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "These companies with no CEO are thriving",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-09-20T15:00:43+00:00",
  "updated": "2022-09-22T06:13:26+00:00",
  "media:group": {
    "media:title": "These companies with no CEO are thriving",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get to know the different kinds of co-ops, how they work, and how they differ from traditional companies. \n\n--\n\nCo-ops are a big part of the global economy: they employ 10% of the world’s workforce and over two trillion dollars flow through their doors every year. At a co-op, there’s no single person with overarching, top-down power over everyone else, like a CEO at a traditional company. So what exactly is a co-op and how does it work? Explore the different types of cooperatives and how they operate.\n\nDirected by Elizabeth Galian, AIM Creative Studios.\n\nThis video made possible in collaboration with World Economic Forum\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/these-companies-with-no-ceo-are-thriving\nDig deeper with additional resources: https://ed.ted.com/lessons/these-companies-with-no-ceo-are-thriving#digdeeper\n\nAnimator's website: http://aimcreativestudios.com\nMusic: https://soundcloud.com/aim-music\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Niccolò Frassetto, Mana, I'm here because of Knowledge Fight Facebook group., Linda Freedman, Edgardo Cuellar, Jaspar Carmichael-Jack, Michael Burton, VIVIANA A GARCIA BESNE, The Vernon's, Olha Bahatiuk, Jesús Bíquez Talayero, Chels Raknrl, Sai Pranavi Jonnalagadda, Stuart Rice, Jing Chen, Vector-Dopamine math, Jasper Song, Giorgio Bugnatelli, Chardon, Eddy Trochez, OnlineBookClub.org, Eric Shear, Leith Salem, Omar Hicham, Adrian Rotaru, Brad Sullivan, Karen Ho, Niklas Frimberger, Hunter Manhart, Nathan Nguyen, Igor Stavchanskiy, James R DeVries, Grace Huo, Diana Huang, Chau Hong Diem, Orlellys Torre, Corheu, Thomas Mee, Maryann H McCrory, Blas Borde, John Hellmann, Poompak Meephian, Chuck Wofford, Adam Pagan, Wes Winn, Conder Shou, ntiger, Noname, Hansan Hu and David D.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}