{
  "title": "22: Michelle Fondin on The Wheel of Healing with Ayurveda and Mind-Body Medicine",
  "pubDate": "Thu, 21 May 2015 18:11:03 +0000",
  "guid": "755fc025a029352e94d7d03b2ae1e1e0",
  "link": "https://traffic.libsyn.com/secure/lifeonpurpose/LifeOnPurposeMichelle.mp3",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #22</strong>, my guest is Ayurvedic Lifestyle Counselor, yoga and meditation teacher, and author <strong>Michelle Fondin</strong>. Michelle joins me to discuss all things Ayurveda — from how it helped drastically change her life after she was diagnosed with cancer at age 28 to how it can help you find the health answers you're seeking by tapping into your body's inherent wisdom, as well as some of the tools she uses to live a purposeful life.</p>\n<p>About: <strong>Michelle Fondin</strong> is an Ayurvedic Lifestyle Counselor, yoga and meditation teacher, author, and since 2008, the Owner of The Ayurvedic Path. She holds a Vedic Master certificate from the Chopra Center and has worked with Drs. Deepak Chopra and David Simon at Chopra Center events teaching yoga and meditation. She regularly sees clients and teaches them how to live an Ayurvedic Lifestyle and achieve optimal wellness. She’s a member of the National Ayurvedic Medical Association, The Association of Ayurvedic Professionals of North America and Yoga Alliance and writes for Chopra.com. She lives in Virginia with her three kids and two cats.</p>\n<p>Her most recent book, <strong>The Wheel of Healing with Ayurveda: An Easy Guide to a Healthy Lifestyle</strong> <em>(published by New World Library)</em> offers an in-depth exploration of Ayurveda, which originated in India at least five thousand years ago and has stood the test of time. Ayurveda, the “science of life,” is a complete wellness system that includes all that we associate with medical care — prevention of disease, observation, diagnosis, and treatment — as well as self-care practices that are generally absent from Western medicine.</p>\n<p>The book is built around eight “spokes” of the Ayurvedic wheel of healing — physical, spiritual, emotional, relationship, occupational, financial, and environmental health, as well as healing the past. Using the system of three principle doshas (Vata, Pitta, and Kapha), <strong>Michelle</strong> offers readers a self-assessment for discovering their mind-body type, as well as practical ways they can enhance their health based on their type.</p>\n<p>To learn more about <strong>Michelle</strong> and her work, visit: <a href=\"http://www.michellefondin.com\">http://www.michellefondin.com</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #22, my guest is Ayurvedic Lifestyle Counselor, yoga and meditation teacher, and author Michelle Fondin. Michelle joins me to discuss all things Ayurveda — from how it helped drastically change her life after she was diagnosed with cancer at age 28 to how it can help you find the health answers you're seeking by tapping into your body's inherent wisdom, as well as some of the tools she uses to live a purposeful life.</p>\n<p>About: Michelle Fondin is an Ayurvedic Lifestyle Counselor, yoga and meditation teacher, author, and since 2008, the Owner of The Ayurvedic Path. She holds a Vedic Master certificate from the Chopra Center and has worked with Drs. Deepak Chopra and David Simon at Chopra Center events teaching yoga and meditation. She regularly sees clients and teaches them how to live an Ayurvedic Lifestyle and achieve optimal wellness. She’s a member of the National Ayurvedic Medical Association, The Association of Ayurvedic Professionals of North America and Yoga Alliance and writes for Chopra.com. She lives in Virginia with her three kids and two cats.</p>\n<p>Her most recent book, The Wheel of Healing with Ayurveda: An Easy Guide to a Healthy Lifestyle <em>(published by New World Library)</em> offers an in-depth exploration of Ayurveda, which originated in India at least five thousand years ago and has stood the test of time. Ayurveda, the “science of life,” is a complete wellness system that includes all that we associate with medical care — prevention of disease, observation, diagnosis, and treatment — as well as self-care practices that are generally absent from Western medicine.</p>\n<p>The book is built around eight “spokes” of the Ayurvedic wheel of healing — physical, spiritual, emotional, relationship, occupational, financial, and environmental health, as well as healing the past. Using the system of three principle doshas (Vata, Pitta, and Kapha), Michelle offers readers a self-assessment for discovering their mind-body type, as well as practical ways they can enhance their health based on their type.</p>\n<p>To learn more about Michelle and her work, visit: <a href=\"http://www.michellefondin.com\">http://www.michellefondin.com</a>.</p>",
  "enclosure": "",
  "itunes:duration": "49:42",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #22, my guest is Ayurvedic Lifestyle Counselor, yoga and meditation teacher, and author Michelle Fondin. Michelle joins me to discuss all things Ayurveda — from how it helped drastically change her life after she was..."
}