{
  "title": "After a lifetime of blindness, newly sighted can immediately identify human locomotion",
  "link": "https://news.mit.edu/2022/newly-sighted-can-immediately-identify-human-locomotion-1018",
  "description": "Study on blind patients who recovered their sight suggests rethinking the belief that babies learn to recognize human movement through visual exposure.",
  "pubDate": "Tue, 18 Oct 2022 15:25:00 -0400",
  "guid": "https://news.mit.edu/2022/newly-sighted-can-immediately-identify-human-locomotion-1018",
  "dc:creator": "Department of Brain and Cognitive Sciences",
  "content:encoded": "<p>Humans are highly sensitive to the bodily movement of other people. Our ability to comprehend body language is crucial to our social thriving, providing information on emotion and behavioral predictions through subtle cues.</p>\n\n<p>When and how do we develop the ability to recognize human movement and distinguish it from other forms of movement? Newborns only 2 days old can tell apart random movement patterns and coordinated animal-like motion. But the ability to differentiate between the bodily movement of humans and other animals is reported to appear only approximately five months after birth. Many researchers therefore believe that babies learn to recognize human locomotion during these first months through repeated visual exposure.</p>\n\n<p>A new study by MIT researchers suggests that a rethinking may be in order. The study is part of Project Prakash, a program dedicated to treating early-onset blindness in children and young adults that was founded by Pawan Sinha, a professor in MIT's Department of Brain and Cognitive Sciences (BCS). Surgeries conducted at Dr. Shroff’s Charity Eye Hospital in New Delhi, India, allow patients to start seeing late in life. Alongside the project's humanitarian goal, patients suffering from significantly obstructing cataracts since birth also participate in studies on the development of sight. Such research among patients who gain sight late in life unlocks new methods for studying the development of visual processing.</p>\n\n<p>In a <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S002839322200166X\" target=\"_blank\">paper published in&nbsp;<em>Neuropsychologia</em></a>, researchers from MIT, Project Prakash, and York University sought to establish whether the ability to identify human movement relies on extensive visual exposure. The study included two participants, 7 and 20 years old, both almost entirely blind since birth, who were able to perceive only light strong enough to pass through their dense cataracts. As part of the study, the participants watched videos displaying patterns of light representing the coordinated movements of walking humans, pigeons, and cats, as well as similar patterns of movement lacking the shape of these animals’ body structure. They were then asked to describe what they saw.&nbsp;</p>\n\n<p>The patients watched the videos in several instances before and after the cataract removal. Before the removal, the blind subjects could see the lights only when looking up close, centimeters away from the monitor. Yet they could not ascribe any meaning to these patterns, which seemed to them merely random movements of lights with no coherent pattern or overall structure.</p>\n\n<p>Immediately after surgery, as the patients’ clarity of sight improved, they could better make out visual details. In their very first minutes of exposure to unobstructed sight, the two patients&nbsp;identified the light patterns representing human locomotion. They both did so six out of eight times. They also successfully identified human movement patterns even when these were flipped upside down. At this early stage, however, they recognized only human locomotion with the configuration of a human body structure. Moreover, they did not recognize patterns of animal locomotion at all.</p>\n\n<p>\"Patients who had very limited exposure to human bodily movement before the cataract removal, could recognize it for the first time immediately after the removal, once their vision was good enough to see details. This result suggests that extensive visual exposure is not critical for the ability to identify human motion,\" says Shlomit Ben-Ami, a Project Prakash researcher and a former MIT postdoc now at Tel Aviv University, who spearheaded the study. \"The fact that the participants could recognize human movement upside down strengthens the idea that visual experience may not be central to acquiring this visual capacity.\"</p>\n\n<p>The researchers are exploring possible accounts for why the participants were able to identify human locomotion but not the movement of other animals. One hypothesis they are considering is that learning to interpret the bodily movement of other humans may be based partly on familiarity with one’s own body movements and structure. This hypothesis may explain why after the surgery, the participants did not recognize animal locomotion but only human movement — and only as long as it had the configuration of a human body.</p>\n\n<p>\"We should be wary of jumping to conclusions about the underlying mechanism here,\" Ben-Ami says. \"While the results are suggestive, they need to be verified with a larger participant pool. This study wasn't designed for answering which mechanism explains the process by which we learn to identify human movement. It is also important to remember that the patients, who were blind most of their lives, didn't go through the normal development of vision. So they may be able to utilize the knowledge of their bodily movements as a resource more efficiently than other people.\"</p>\n\n<p>\"This study addresses a very interesting question in vision: what are the starting dispensations in our developmental progressions, and how are they instantiated?” says Sinha, the study’s senior author. “It is gratifying that Project Prakash has provided us an opportunity to grapple with this and many other questions about how the brain learns to do vision. I look forward to further work that can help test the intriguing findings thus far.”</p>",
  "media:content": {
    "media:description": "A study participant watches locomotion patterns.",
    "media:credit": "Photo courtesy of the researchers."
  },
  "category": [
    "Vision",
    "Brain and cognitive sciences",
    "Blindness",
    "Development",
    "Research",
    "School of Science"
  ]
}