{
  "title": "Hierarchical Automatic Power Plane Generation with Genetic Optimization and Multilayer Perceptron. (arXiv:2210.16314v2 [cs.NE] UPDATED)",
  "link": "http://arxiv.org/abs/2210.16314",
  "description": "<p>We present an automatic multilayer power plane generation method to\naccelerate the design of printed circuit boards (PCB). In PCB design, while\nautomatic solvers have been developed to predict important indicators such as\nthe IR-drop, power integrity, and signal integrity, the generation of the power\nplane itself still largely relies on laborious manual methods. Our automatic\npower plane generation approach is based on genetic optimization combined with\na multilayer perceptron and is able to automatically generate power planes\nacross a diverse set of problems with varying levels of difficulty. Our method\nGOMLP consists of an outer loop genetic optimizer (GO) and an inner loop\nmulti-layer perceptron (MLP) that generate power planes automatically. The\ncritical elements of our approach include contour detection, feature expansion,\nand a distance measure to enable island-minimizing complex power plane\ngeneration. We compare our approach to a baseline solution based on A*. The A*\nmethod consisting of a sequential island generation and merging process which\ncan produce less than ideal solutions. Our experimental results show that on\nsingle layer power plane problems, our method outperforms A* in 71% of the\nproblems with varying levels of board layout difficulty. We further describe\nH-GOMLP, which extends GOMLP to multilayer power plane problems using\nhierarchical clustering and net similarities based on the Hausdorff distance.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Liao_H/0/1/0/all/0/1\">Haiguang Liao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Patil_V/0/1/0/all/0/1\">Vinay Patil</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dong_X/0/1/0/all/0/1\">Xuliang Dong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shanbhag_D/0/1/0/all/0/1\">Devika Shanbhag</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Fallon_E/0/1/0/all/0/1\">Elias Fallon</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hogan_T/0/1/0/all/0/1\">Taylor Hogan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Spasojevic_M/0/1/0/all/0/1\">Mirko Spasojevic</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kara_L/0/1/0/all/0/1\">Levent Burak Kara</a>"
}