{
  "title": "524: 'Cursed Child' Downsizing, A Wild Snape Observation, Sorting Hat Biases and other MuggleMail",
  "link": "https://audioboom.com/posts/7916686",
  "itunes:episode": 524,
  "itunes:title": "'Cursed Child' Downsizing, A Wild Snape Observation, Sorting Hat Biases and other MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5051,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>It's another MuggleMail episode, folks!</li>\n<li>But first: The Cursed Child's North American productions <a href=\"https://www.hypable.com/harry-potter-and-the-cursed-child-should-not-be-one-part/\">are being condensed</a> into one part! What does this mean for the show's future?</li>\n<li>It's time to announce this year's <a href=\"https://www.mugglecast.com/introducing-our-2021-mugglecast-gifts/\">MuggleCast Patreon physical gifts</a>: Throwback socks and a \"Sweet 16\" customizable wooden model car!</li>\n<li>Listeners must <a href=\"http://www.patreon.com/mugglecast\">sign up to our Patreon</a> and choose their gift by September 1st to be eligible to receive them.</li>\n<li>Voicemails from listeners concern Petunia's motivations for spying on her neighbors, character maturities, a big fandom moment, and fond memories from the Deathly Hallows, Part 2 red carpet.</li>\n<li>It's DumbledoreMail galore as listeners write in about the hiding of Ariana, the blood pact and 12 uses of dragon's blood being related, and when phoenixes appear.</li>\n<li>Could Travers already be working for the Dark side in the time of <em>Crimes of Grindelwald</em>? He's got family history.</li>\n<li>Bellatrix's comment about Snape's neighborhood leaves one listener asking if his home town puts Snape in hot water with the Death Eaters.</li>\n<li>That same listener asks why NOBODY told Harry that Snape and Lily were childhood friends! Lupin, Sirius, and Dumbledore all hide that fact for their entire lives.</li>\n<li>Did the Hogwarts Sorting Hat always reflect Salazar Slytherin's bias?</li>\n<li>The hosts reflect on which scenes from the Potter films most improved on the books.</li>\n<li>In this month's Throwback Email, an Australian listener details WW2 references present in Grindelwald's backstory.</li>\n<li>A new game, \"Who Said It?\" has us identifying which of us said the excerpt read by Andrew. The participants do not do particularly well!</li>\n<li>Quizzitch: What is the name for the double agent, working for the British MOM as a bounty hunter, who is secretly taking orders from Grindelwald? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by MeUndies! Get 15% off your first order, free shipping, and a 100% satisfaction guarantee at <a href=\"http://www.MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>\n</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, including our new physical gifts! Also access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 03 Aug 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-08-02:/posts/7916686",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}