{
  "id": "tag:blogger.com,1999:blog-37798047.post-5423611307430503564",
  "published": "2021-02-28T19:06:00.006-05:00",
  "updated": "2021-02-28T20:05:19.523-05:00",
  "title": "We are living in 1984 (ETERNALBLUE)",
  "content": "<p>In the book <i>1984</i>, the protagonist questions his sanity, because his memory differs from what appears to be everybody else's memory.</p><p></p><blockquote><p>The Party said that Oceania had never been in alliance with Eurasia. He, Winston Smith, knew that Oceania had been in alliance with Eurasia as short a time as four years ago. But where did that knowledge exist? Only in his own consciousness, which in any case must soon be annihilated. And if all others accepted the lie which the Party imposed—<b>if all records told the same tale—then the lie passed into history and became truth</b>. ‘Who controls the past,’ ran the Party slogan, ‘controls the future: who controls the present controls the past.’ And yet the past, though of its nature alterable, never had been altered. Whatever was true now was true from everlasting to everlasting. It was quite simple. All that was needed was an unending series of victories over your own memory. ‘Reality control’, they called it: in Newspeak, ‘doublethink’.</p><p></p></blockquote><p>I know that EternalBlue didn't cause the <a href=\"https://en.wikipedia.org/wiki/2019_Baltimore_ransomware_attack\">Baltimore ransomware attack</a>. When the attack happened, the entire cybersecurity community agreed that EternalBlue wasn't responsible.</p><p>But <a href=\"https://www.nytimes.com/2019/05/25/us/nsa-hacking-tool-baltimore.html\">this New York Times article</a> said otherwise, blaming the Baltimore attack on EternalBlue. And there are hundreds of other news articles [<a href=\"https://www.theverge.com/2019/5/25/18639859/baltimore-city-computer-systems-cyberattack-nsa-eternalblue-wannacry-notpetya-cybersecurity\">eg</a>] that agree, citing the New York Times. There are no news articles that dispute this.</p><p>In a&nbsp;<a href=\"https://blog.erratasec.com/2021/02/review-perlroths-book-on-cyberarms.html\">recent book</a>, the author of that article admits it's not true, that EternalBlue didn't cause the ransomware to spread. But they defend themselves as it being essentially true, that EternalBlue is responsible for a lot of bad things, even if technically, not in this case. Such errors are justified, on the grounds they are generalizations and simplifications needed for the mass audience.</p><p>So we are left with the situation Orwell describes: all records tell the same tale -- when the lie passes into history, it becomes the truth.</p><p>Orwell continues:</p><p></p><blockquote><p>He wondered, as he had many times wondered before, whether he himself was a lunatic. Perhaps a lunatic was simply a minority of one. At one time it had been a sign of madness to believe that the earth goes round the sun; today, to believe that the past is inalterable. He might be ALONE in holding that belief, and if alone, then a lunatic. But the thought of being a lunatic did not greatly trouble him: the horror was that he might also be wrong.</p><p></p></blockquote><p>I'm definitely a lunatic, alone in my beliefs. I sure hope I'm not wrong.</p><p><br /></p><p><br /></p> <hr/><b>Update:</b> Other lunatics document their struggles with Minitrue: <blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">When I was investigating the TJX breach, there were NYT articles citing unnamed sources that were made up &amp; then outlets would publish citing the NYT. The TJX lawyers would require us to disprove the articles. Each time we would. It was maddening fighting lies for 8 months.</p>&mdash; Nicholas J. Percoco (@c7five) <a href=\"https://twitter.com/c7five/status/1366189900454895625?ref_src=twsrc%5Etfw\">March 1, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 2
}