{
  "title": "71: Rachel Harris- Listening to Ayahuasca: New Hope for Depression, Addiction, PTSD and Anxiety",
  "pubDate": "Thu, 27 Apr 2017 23:43:29 +0000",
  "guid": "c52eb157de7f5723e0132ec247e72c70",
  "link": "https://lifeonpurpose.libsyn.com/rachel-harris",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #71</strong>, my guest is psychologist <strong>Rachel Harris, PhD</strong>, who joined me for an enlightening and hope-filled conversation about her new book <strong>Listening to Ayahuasca: New Hope for Depression, Addiction, PTSD and Anxiety</strong> <em>(New World Library)</em>.<br /> <br /> Ayahuasca, a psychedelic brew from the Amazon rainforest, is entering the Western lexicon through the popular media, the internet, and first-person reports. Considered a medicine by practitioners, the tea has great therapeutic potential that is just beginning to be studied. As a result of her own personal experience with ayahuasca, Dr. Harris was inspired to research how this medicine was being used in North America in the largest study of this kind to date. <strong>Listening to Ayahuasca</strong> describes her findings, including miracle cures of depression and addiction, therapeutic breakthroughs, spiritual revelations, and challenging or bad trips.<br /> <br /> <em>“This book is intended for people considering ayahuasca and for people drinking the medicine. I hope it will help them integrate their insights and visions into their daily lives. There is much work people can do on their own to maximize the healing that ayahuasca offers,” writes Dr. Harris. “I also hope this book will inform psychotherapists about the process of integration after ayahuasca ceremonies, so they can provide a supportive and respectful container for the unfolding of healing.”</em><br /> <br /> About: Psychologist <strong>Rachel Harris, PhD</strong> is the author of <strong>Listening to Ayahuasca: New Hope for Depression, Addiction, PTSD and Anxiety</strong>. She was in private practice for thirty-five years working with people interested in psychospiritual development. During a decade working in research, Rachel received a National Institutes of Health New Investigator’s Award and published more than forty scientific studies in peer-reviewed journals. She has also consulted to Fortune 500 companies and the United Nations.<br /> <br /> Rachel was in the 1968 Esalen Residential Program, Big Sur, CA. This intensive six-month program focused on meditation and body work. In the early seventies, Rachel studied with Dorothy Nolte in the movement system, Structural Awareness, based on Dr. Ida Rolf’s Structural Integration (Rolfing). Rachel also co-edited the Journal of the American Dance Therapy Association for three years. Awareness of how people live and move in their bodies has always been an aspect of Rachel’s approach to psychotherapy.<br /> <br /> During the mid-eighties into the early aughts, Rachel led workshops at Omega Institute, NY and Esalen Institute, CA. She wrote Twenty Minute Retreats: Revive Your Spirit in Just Minutes a Day with Simple, Self-Led Practices (NY: Holt, 2000). This book describes many of the psychological, meditative and body awareness exercises she taught in her workshops.<br /> <br /> In 2005 Rachel traveled to a retreat center in Costa Rica and serendipitously found herself with the opportunity to drink ayahuasca with Ecuadorian shamans. The morning after her first ceremony, Rachel began asking questions about the therapeutic potential of this medicine. She conducted a three-year research project with Lee Gurel, PhD that resulted in “A Study of Ayahuasca Use in North America,” published in the Journal of Psychoactive Drugs (Summer, 2012).<br /> <br /> Rachel has a married daughter, Ashley Mason, who sings in the chorus at the Metropolitan Opera in NYC. Rachel is the co-author with Dorothy Nolte of Children Learn What They Live and Teenagers Learn What They Live (NY: Workman, 1998 and 2002) and the author of 20 Minute Retreats (Holt, 2000). Rachel spends eight months of the year on a remote island in Penobscot Bay, ME and winters in Napa, CA.<br /> <br /> To learn more about Dr. Harris' work, visit: https://www.listeningtoayahuasca.com/.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #71, my guest is psychologist Rachel Harris, PhD, who joined me for an enlightening and hope-filled conversation about her new book Listening to Ayahuasca: New Hope for Depression, Addiction, PTSD and Anxiety <em>(New World Library)</em>.  Ayahuasca, a psychedelic brew from the Amazon rainforest, is entering the Western lexicon through the popular media, the internet, and first-person reports. Considered a medicine by practitioners, the tea has great therapeutic potential that is just beginning to be studied. As a result of her own personal experience with ayahuasca, Dr. Harris was inspired to research how this medicine was being used in North America in the largest study of this kind to date. Listening to Ayahuasca describes her findings, including miracle cures of depression and addiction, therapeutic breakthroughs, spiritual revelations, and challenging or bad trips.  <em>“This book is intended for people considering ayahuasca and for people drinking the medicine. I hope it will help them integrate their insights and visions into their daily lives. There is much work people can do on their own to maximize the healing that ayahuasca offers,” writes Dr. Harris. “I also hope this book will inform psychotherapists about the process of integration after ayahuasca ceremonies, so they can provide a supportive and respectful container for the unfolding of healing.”</em>  About: Psychologist Rachel Harris, PhD is the author of Listening to Ayahuasca: New Hope for Depression, Addiction, PTSD and Anxiety. She was in private practice for thirty-five years working with people interested in psychospiritual development. During a decade working in research, Rachel received a National Institutes of Health New Investigator’s Award and published more than forty scientific studies in peer-reviewed journals. She has also consulted to Fortune 500 companies and the United Nations.  Rachel was in the 1968 Esalen Residential Program, Big Sur, CA. This intensive six-month program focused on meditation and body work. In the early seventies, Rachel studied with Dorothy Nolte in the movement system, Structural Awareness, based on Dr. Ida Rolf’s Structural Integration (Rolfing). Rachel also co-edited the Journal of the American Dance Therapy Association for three years. Awareness of how people live and move in their bodies has always been an aspect of Rachel’s approach to psychotherapy.  During the mid-eighties into the early aughts, Rachel led workshops at Omega Institute, NY and Esalen Institute, CA. She wrote Twenty Minute Retreats: Revive Your Spirit in Just Minutes a Day with Simple, Self-Led Practices (NY: Holt, 2000). This book describes many of the psychological, meditative and body awareness exercises she taught in her workshops.  In 2005 Rachel traveled to a retreat center in Costa Rica and serendipitously found herself with the opportunity to drink ayahuasca with Ecuadorian shamans. The morning after her first ceremony, Rachel began asking questions about the therapeutic potential of this medicine. She conducted a three-year research project with Lee Gurel, PhD that resulted in “A Study of Ayahuasca Use in North America,” published in the Journal of Psychoactive Drugs (Summer, 2012).  Rachel has a married daughter, Ashley Mason, who sings in the chorus at the Metropolitan Opera in NYC. Rachel is the co-author with Dorothy Nolte of Children Learn What They Live and Teenagers Learn What They Live (NY: Workman, 1998 and 2002) and the author of 20 Minute Retreats (Holt, 2000). Rachel spends eight months of the year on a remote island in Penobscot Bay, ME and winters in Napa, CA.  To learn more about Dr. Harris' work, visit: https://www.listeningtoayahuasca.com/.</p>",
  "enclosure": "",
  "itunes:duration": "58:14",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #71, my guest is psychologist Rachel Harris, PhD, who joined me for an enlightening and hope-filled conversation about her new book Listening to Ayahuasca: New Hope for Depression, Addiction, PTSD and Anxiety (New World..."
}