{
  "id": "tag:blogger.com,1999:blog-3211409948956809184.post-283190192428518088",
  "published": "2021-10-13T22:37:00.004-07:00",
  "updated": "2021-10-13T22:48:51.377-07:00",
  "title": "Amazing Demo from SparkBeyond",
  "content": "<p>&nbsp;My friend <a href=\"https://www.linkedin.com/in/sagied/?originalSubdomain=il\" target=\"_blank\">Sagie Davidovich, CEO SparkBeyond,</a>&nbsp; has shown me the following amazing demo:&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"369\" src=\"https://www.youtube.com/embed/ZvBNJ-BXEKw\" width=\"444\" youtube-src-id=\"ZvBNJ-BXEKw\"></iframe></div><br /><p><br /></p><p>SparkBeyond crawled hundreds of billions of Internet pages, papers, patents and social media site to build one of the largest available knowledge graphs. Based on this data it is possible to ask natural language questions about the knowledge and get aggregated knowledge summary. Unlike Google search where you have to manually go over of zillion resources here the data is summarized and aggregated visually. It is possible to understand reasons, trends, ask for follow up questions and see supporting evidence and statistics.&nbsp;</p><p>Unlike the typical language model which gives you a summary without knowing where the data was obtained from, In SparkBeyond;s model it is possible to get detailed references show where is the answer coming from.&nbsp;</p><p>An interesting related work is <a href=\"https://arxiv.org/abs/2004.12832\" target=\"_blank\">Colbert</a> from <a href=\"https://cs.stanford.edu/people/matei/\" target=\"_blank\">Prof. Matei Zeharia</a>. Intead of memorizing the full language model using hundreds of billions parameters a significantly smaller index is maintained that retrieves the relevant information on the fly,&nbsp;</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Danny Bickson",
    "uri": "http://www.blogger.com/profile/01517237836051035400",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}