{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-7633190180684724257",
  "published": "2020-02-03T03:00:00.000-08:00",
  "updated": "2020-02-03T03:00:02.492-08:00",
  "title": "How YouTube supports elections",
  "content": "As the 2020 election season kicks into high gear in the United States, people will visit YouTube to learn about the candidates and watch the election season unfold. Over the last few years, we’ve increased our efforts to make YouTube a more reliable source for news and information, as well as an open platform for healthy political discourse. Here is an overview of how this work helps us to better support elections. <br /><br /><h3>Remove election-related content that violates our policies </h3><br />Our <a href=\"https://www.youtube.com/about/policies/#community-guidelines\" target=\"_blank\">Community Guidelines</a> provide clear guidance on content that is not allowed on YouTube. One common question we get is how these policies apply to election-related content. Here are some examples of where our established <a href=\"https://support.google.com/youtube/answer/2801973?hl=en\" target=\"_blank\">deceptive practices policies</a> apply: <br /><br /><br /><ul><li>Content that has been technically manipulated or doctored in a way that misleads users (beyond clips taken out of context) and may pose a serious risk of egregious harm; for example, a video that has been technically manipulated to make it appear that a government official is dead.</li><li>Content that aims to mislead people about voting or the <a href=\"https://www.blog.google/technology/safety-security/how-google-and-youtube-are-working-protect-2020-us-census/\" target=\"_blank\">census processes</a>, like telling viewers an incorrect voting date.</li><li>Content that advances false claims related to the technical eligibility requirements for current political candidates and sitting elected government officials to serve in office, such as claims that a candidate is not eligible to hold office based on false information about citizenship status requirements to hold office in that country. </li></ul><br /><br />Additionally, we terminate channels that: <br /><br /><br /><ul><li><a href=\"https://support.google.com/youtube/answer/2801947?hl=en\" target=\"_blank\">Attempt to impersonate</a> another person or channel, misrepresent their country of origin, or conceal their association with a government actor.</li><li><a href=\"https://support.google.com/youtube/answer/3399767?hl=en\" target=\"_blank\">Artificially increase</a> the number of views, likes, comments, or other metric either through the use of automatic systems or by serving up videos to unsuspecting viewers. </li></ul><br /><br />As always, we enforce our policies consistently, without regard to a video’s political viewpoint. <br /><br />The best way to quickly remove content is to stay ahead of new technologies and tactics that could be used by malicious actors, including technically-manipulated content. We also heavily invest in research and development. In 2018, we formed an Intelligence Desk to detect new trends surrounding inappropriate content and problematic behaviors, and to make sure our teams are prepared to address them before they become a larger issue. For example, in 2018, as a result of the Intelligence Desk’s work to detect the evolving online tactics and impending statements of terrorist organizations, we shared 100,000 digital fingerprints (also known as hashes) of terror content to the Global Internet Forum to Counter Terrorism’s hash-sharing database. <br /><br />To combat foreign and domestic coordinated influence operations looking to interfere in electoral processes, we coordinate closely with <a href=\"https://blog.google/technology/safety-security/threat-analysis-group/protecting-users-government-backed-hacking-and-disinformation/\" target=\"_blank\">Google’s Threat Analysis Group</a> (TAG) to identify bad actors and terminate their channels and accounts. Through TAG, we work with other technology companies to share intelligence and best practices, and share threat information with law enforcement. <br /><br /><h3>Raise up authoritative election news </h3><br />Political news and events can be subject to misinformation, so the availability of quality information sources is crucial. That’s why we <a href=\"https://youtube.googleblog.com/2019/12/the-four-rs-of-responsibility-raise-and-reduce.html\" target=\"_blank\">raise up authoritative voices</a>, including news sources, for news and information in search results and “watch next” panels. Millions of search queries and recommendations are getting this authoritative ranking treatment today, and we're continuing to improve and expand our systems. <br /><br />Additionally, we <a href=\"https://youtube.googleblog.com/2018/07/building-better-news-experience-on.html\" target=\"_blank\">introduced</a> Top News and Breaking News shelves to highlight quality journalism, as well as <a href=\"https://support.google.com/youtube/answer/7630512?hl=en\" target=\"_blank\">information panels</a> that indicate funding sources below videos from publishers that receive public or government funding. During breaking news events, we provide short previews of text-based news articles in search results, along with a reminder that developing news can rapidly change. Because of all these efforts, last year we saw consumption of content from authoritative news partners’ channels grow by 60%. <br /><br />For the 2018 U.S. midterm and the 2019 EU Parliamentary elections, when users searched for a candidate on YouTube, we surfaced an <a href=\"https://support.google.com/youtube/answer/9004474?hl=en\" target=\"_blank\">information panel</a> with additional information about that candidate—for example, party affiliation and district—above search results. We also highlighted the official YouTube channels of candidates when available. We will have a similar feature for candidates in the 2020 U.S. elections in the coming months. <br /><br /><h3>Reduce the spread of election misinformation </h3><br />Content that comes close to violating our Community Guidelines is a fraction of 1% of what’s watched on YouTube in the U.S. To reduce this even further, in January 2019, we launched <a href=\"https://youtube.googleblog.com/2019/01/continuing-our-work-to-improve.html\" target=\"_blank\">changes</a> to our recommendations systems to limit the spread of harmful misinformation and borderline content. The result is a 70% average drop in watch time of this content coming from non-subscribed recommendations in the U.S. These changes are now implemented in the U.S. and other English-language markets, and we’ve begun expanding this effort to non-English-language markets, helping us reduce recommendations of borderline content, including election-related misinformation, around the world. <br /><br /><h3>Recognize and reward campaigns, candidates, and political creators </h3><br />Politicians, commentators and news publishers can access a suite of YouTube features and resources, including support from our partnerships team. These specialists work with news organizations, political creators and candidates on both sides of the aisle to optimize their presence on YouTube, helping them  more effectively reach viewers, engage their community and <a href=\"https://www.blog.google/technology/safety-security/new-advanced-protection-program-account-security-instant/\" target=\"_blank\">keep their accounts secure</a>. <br /><br />In addition to our work at YouTube to support elections, other teams at Google are also <a href=\"https://blog.google/technology/safety-security/supporting-2020-us-election\" target=\"_blank\">working hard</a> ahead of Election Day—including by expanding our political advertising policies to provide users with even more <a href=\"https://www.blog.google/technology/ads/update-our-political-ads-policy/\" target=\"_blank\">visibility</a> into who is buying election ads on YouTube, Google, and partner properties. YouTube remains committed to maintaining the balance of openness and responsibility, before, during and after the 2020 U.S. election. We’ll have even more to share on this work in the coming months. <br /><br /><i>Leslie Miller, VP of Government Affairs &amp; Public Policy, YouTube </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}