{
  "title": "offline manifesto - offline in an online first world",
  "link": "",
  "updated": "2018-04-20T00:00:00-07:00",
  "id": "http://jtoy.net/blog/offline-manifesto",
  "content": "<h1 id=\"offline-manifesto---offline-in-an-online-first-world\">offline manifesto - offline in an online first world</h1>\n\n<p>I manage projects with lots of people involved, write software, constantly communicating , contemplate, and generally need to be online quiet frequently. Over the years, I’ve noticed I’ve had productivity swings based on several factors, one of the main ones being whether I was online or not. With the constant email notifications, slack messages,  and other incoming messages, I found that often times I got very little completed. In fact, I  have found that being online constantly has been detrimental to my well being.  Not just from notifications, but  I would find my self  going to visit  news website subconsciously in the middle of my work.   The more often I would be online, the more I would see the quality of sleep  go down and I would find myself waking up in the middle of the night.   I think many of you have these same feelings. The book Deepwork explains in detail why things like the internet take away from your ability to do deep work and how to battle this,  so please read that book if you want to understand more. One interesting quote from the book:</p>\n\n<p>Spend enough time in a state of frenetic shallowness and you permanently reduce your capacity to perform deep work. “What the Net seems to be doing is chipping away my capacity for concentration and contemplation,” admitted journalist Nicholas Carr.</p>\n\n<p>So for the past year, I have been experimenting with ways to be able to get into deeper states of concentration, given this internet connected world we live in. After experimenting with many different configurations, I think I have found a middle ground that works for me and allows me to get into a state of concentration to produce deep work. <br />\nBasically I  spend half of my day offline (includes cell phone and computer), with “breaks” where I batch all the work I need to do online. During my “breaks”, I do all those online tasks like research, emails, download software, sync data, etc.</p>\n\n<p>I’ve had to change most of the software I use to enable this process and it is working out fairly well now.</p>\n\n<h1 id=\"computer-and-software\">Computer and Software</h1>\n\n<p>My main computer is my laptop and is has everything I need to be productive.   I try to leave my computer disconnected from the internet as often as possible.  When I am working in an office with other coworkers, I will leave my computer online, but I will use an app called Focus, which blocks all non wok related software. \nIn today’s world, there is so much information and information is key to a lot of people who do knowledge work.   I keep a copy of wikipedia on my laptop. If there are any concepts I need to understand, I can search through wikipedia.  Any notes or todo items I have, I will put them on simplenote which is a simple note taking app that syncs across all my devices. \nFor anything I need to do when I get back online, I write it in my offline todo list and then when I am back online I will do those items.</p>\n\n<p>For my mail, when I am online I process all of my email through gmail, but when in offline mode, I use mac’s mail.app and I keep a copy of it synced on my computer through IMAP. That way I can still read and write emails.</p>\n\n<p>I keep my books synced through amazon kindle on my laptop and my kindle device so if there is information I read and want to keep, I can get it through my device.<br />\nOften times I need to look up documentation for the different programming languages and frameworks I use. I have a program called Dash which stores the documentation for various programming languages locally. I can easily look up and search the standard documentation.</p>\n\n<p>I have to read a lot of scientific research for my <a href=\"https://github.com/jtoy/sensenet\">artificial intelligence research project</a>, so I keep dozens of papers on my computer and I store them in an app called Mendeley. Its basically just a a GUI for searching, collecting, and marking up PDFs.</p>\n\n<p>I keep hundreds of different software repos on my laptop that pertain to any type of project I am working on.  I use this as reference code.</p>\n\n<h1 id=\"mobile-device\">mobile device</h1>\n\n<p>My phone is setup to be even more extreme. I keep it in offline mode most of the day.   Even when it is online, I have all notifications turned off.  I don’t have email on my phone. My phone acts as my notes app via Simplenote, camera, music player, maps, and uber. I know its extreme, before, I would check my phone constantly and now I rarely have the urge to check my phone and I’m more present in whatever I’m doing, so I think its worth the tradeoff.</p>\n\n<h1 id=\"offline-manifesto\">Offline Manifesto</h1>\n\n<p>So I have this process working mostly ok, but what I have found is that a lot of software I was using  is designed to work only online. Some of this software is created purposely to only work online so as to keep you on their website as long as possible.\nThis creates a reinforcing cycle of  anxiety because you are required to always be online. I think software should instead be setup so that everything works in offline mode by default. That means you can use the software whether you are on a plane, in a rural area with no internet, or offline and the software will still function. Then when you get back online, it all syncs up to wherever it needs to go.</p>\n\n<p>Even with all the ubiquitous internet, we need to be able  to work offline. As we go deeper into the oceans and further out in space, an always on internet connection seems unlikely. I bet that if we make it onto other planets hundreds of years into the future , software will all work in an “offline mode first” system allowing us to be fully productive when offline.</p>"
}