{
  "title": "Physics-inspired machine learning for power grid frequency modelling. (arXiv:2211.01481v1 [eess.SY])",
  "link": "http://arxiv.org/abs/2211.01481",
  "description": "<p>The operation of power systems is affected by diverse technical, economic and\nsocial factors. Social behaviour determines load patterns, electricity markets\nregulate the generation and weather-dependent renewables introduce power\nfluctuations. Thus, power system dynamics must be regarded as a non-autonomous\nsystem whose parameters vary strongly with time. However, the external driving\nfactors are usually only available on coarse scales and the actual dependencies\nof the dynamic system parameters are generally unknown. Here, we propose a\nphysics-inspired machine learning model that bridges the gap between\nlarge-scale drivers and short-term dynamics of the power system. Integrating\nstochastic differential equations and artificial neural networks, we construct\na probabilistic model of the power grid frequency dynamics in Continental\nEurope. Its probabilistic prediction outperforms the daily average profile,\nwhich is an important benchmark. Using the integrated model, we identify and\nexplain the parameters of the dynamical system from the data, which reveals\ntheir strong time-dependence and their relation to external drivers such as\nwind power feed-in and fast generation ramps. Finally, we generate synthetic\ntime series from the model, which successfully reproduce central\ncharacteristics of the grid frequency such as their heavy-tailed distribution.\nAll in all, our work emphasises the importance of modelling power system\ndynamics as a stochastic non-autonomous system with both intrinsic dynamics and\nexternal drivers.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Kruse_J/0/1/0/all/0/1\">Johannes Kruse</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Cramer_E/0/1/0/all/0/1\">Eike Cramer</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Schafer_B/0/1/0/all/0/1\">Benjamin Sch&#xe4;fer</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Witthaut_D/0/1/0/all/0/1\">Dirk Witthaut</a>"
}