{
  "id": "yt:video:DiQ4nrR-iUU",
  "yt:videoId": "DiQ4nrR-iUU",
  "yt:channelId": "UC9K5PLkj0N_b9JTPdSRwPkg",
  "title": "How Paulo Freire Made Marxism Stupid",
  "link": "",
  "author": {
    "name": "New Discourses",
    "uri": "https://www.youtube.com/channel/UC9K5PLkj0N_b9JTPdSRwPkg"
  },
  "published": "2022-09-26T18:00:10+00:00",
  "updated": "2022-09-28T09:10:43+00:00",
  "media:group": {
    "media:title": "How Paulo Freire Made Marxism Stupid",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The New Discourses Podcast with James Lindsay, Episode 94 \n\nPaulo Freire is a Brazilian Marxist who is responsible for \"Marxifying\" education (https://newdiscourses.com/2022/05/paulo-freires-marxification-of-education/), thereby ruining it. In effect, what he did was created a Marxist Theory of being educated (https://newdiscourses.com/2022/05/paulo-freires-schools-new-discourses-bullets-ep-7/), and what this did, in turn, was create a Marxist Theory of knowledge and knowing. Who gets to be considered a knower? On what grounds? To whose benefit? Who decides? All of these questions are to be answered on (Critical) Marxist grounds. One result of this transition, in addition to his approach to education (https://newdiscourses.com/2022/08/paulo-freire-and-the-critical-theft-of-education/), is that he opened the door to a true Marxism of stupidity. You see, as a result of Freire's arguments, \"excluded knowledges\" have to be included, which includes the stupid. Speaking of how anti-intellectual and stupid this allowed Marxism to be, it allows for any idiot with a \"Critical\" disposition to create a Marxist Theory of anything by asking and answering the sorts of questions listed above about the knowledge base of anything they want. Thus, we end up with Marxist analyses of every academic subject, every facet of society, every hobby, every everything, in an interminable cascade of irritating stupidity we refer to as \"being Woke.\" In this episode of the New Discourses Podcast, host James Lindsay explains the phenomenon through a number of examples that make it absolutely clear how cheap and stupid \"Marxist\" analysis has become as a result of going \"Woke.\"\n\nSupport New Discourses: https://newdiscourses.com/support\n\nSubscribe to New Discourses on other platforms: https://newdiscourses.com/subscribe\n\nFollow James Lindsay: https://linktr.ee/conceptualjames\n\n© 2022 New Discourses. All rights reserved.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}