{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-463063015620034092",
  "published": "2022-01-27T08:00:00.002-05:00",
  "updated": "2022-01-27T09:04:20.922-05:00",
  "title": "Supporting communities across Canada in 2021",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhBqR6-zsMCxcnrOW0ZfOFev6BdSVAEbZmQCoXkwo5o0X4h1Jcgi9GqE7cVGwz__CoJHDz8FOANRNy95dIF0LHPufLB3doYHWL2z5K4Ge_kmsWPLCUvv8jQ29TQaeyNNDA_EzUkJZwB8vFlhGRDii3PPSI49kG8V1avWfHjSqMFvBtvLrKxKW261p8K=s1200\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"500\" data-original-width=\"1200\" height=\"266\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhBqR6-zsMCxcnrOW0ZfOFev6BdSVAEbZmQCoXkwo5o0X4h1Jcgi9GqE7cVGwz__CoJHDz8FOANRNy95dIF0LHPufLB3doYHWL2z5K4Ge_kmsWPLCUvv8jQ29TQaeyNNDA_EzUkJZwB8vFlhGRDii3PPSI49kG8V1avWfHjSqMFvBtvLrKxKW261p8K=w640-h266\" width=\"640\" /></a></div><br /><div><br /></div><div><br /></div>For the last 20 years, Google Canada has been investing in the communities where we live and work, through the Google.org Community Grants program. The program supports nonprofits across Canada that are helping their communities expand economic opportunity, learn new skills, and address areas of critical need like mental health, education and food insecurity.&nbsp;<div><br /><div><br /></div><div>In 2021, our Canadian sites donated <b>over $750,000 in Community Grants to 30 organizations across the country</b> that are helping make their community a better place.&nbsp;</div><div><br /></div><div><br /></div><div>Learn more about the organizations we supported last year:&nbsp;</div><div><br /></div><div><br /></div><div><a href=\"https://afghanwomen.org/\" target=\"_blank\">Afghan Women's Organization Refugee and Immigrant Services&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>Afghan Women’s Organization Refugee and Immigrant services (AWO) offers settlement services to newcomers and refugees in the Greater Toronto Area, with a special focus on women, their families, refugees and people who have experienced war and persecution.&nbsp;</div><div><br /></div><div><a href=\"https://www.bgccan.com/en/\" target=\"_blank\">BGC Ottawa&nbsp;</a></div><div>Ottawa, ON&nbsp;</div><div>The Boys &amp; Girls Club of Canada provides safe, supportive places where children and youth can experience new opportunities, overcome barriers, build positive relationships, and develop confidence and skills for life.&nbsp;</div><div><br /></div><div><a href=\"https://blackboyscode.ca/\" target=\"_blank\">Black Boys Code Canada&nbsp;</a></div><div>National&nbsp;</div><div>Black Boys Code supports underserved black communities by providing basic digital literacy training and an educational pathway to a career in technology.&nbsp;</div><div><br /></div><div><a href=\"https://www.classroomchampions.org/\" target=\"_blank\">Classroom Champions&nbsp;</a></div><div>National&nbsp;</div><div>Classroom Champions brings together athletes and teachers to facilitate curriculum and mentorship programs for kids that are social emotional learning (SEL) focused, founded by Olympic Gold Medalist, Steve Mesler, and Ph.D. educator, Dr. Leigh Parise.&nbsp;</div><div><br /></div><div><a href=\"https://www.dailybread.ca/\" target=\"_blank\">Daily Bread&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>Daily Bread is a food bank that works with different agencies to offer a range of food programs, in their mission to fight poverty and end hunger in Toronto.&nbsp;</div><div><br /></div><div><a href=\"https://www.etsmtl.ca/\" target=\"_blank\">École de technologie supérieure (ÉTS)&nbsp;</a></div><div>Montreal, QC The École de technologie supérieure (ETS) - part of the Université du Québec network - specializes in training future engineers and researchers to meet the needs of the industrial environment.</div><div><br /></div><div><a href=\"https://www.food4kidswr.ca/\" target=\"_blank\">Food4Kids&nbsp;</a></div><div>Waterloo, ON Food4Kids works to provide packaged healthy bags of food for kids aged 1-14 that experience chronic hunger.&nbsp;</div><div><br /></div><div><a href=\"https://www.foranetwork.org/\" target=\"_blank\">Fora&nbsp;</a></div><div>Toronto, ON Fora (previously G(irls)20) works to place young women at the centre of the decision-making process through education and training, building networks and access to unparalleled opportunities. They offer three signature programs - Global Summit, Girls on Boards and Next Level - that focus on leadership development.&nbsp;</div><div><br /></div><div><a href=\"https://hackergal.org/\" target=\"_blank\">Hackergal&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>Hackergal offers programs that teach girls how to code and learn to apply their coding skills on different levels. Canadian girls in grades 6-9 are invited to test their skills and participate in Hackergal’s Hackathon competitions.&nbsp;</div><div><br /></div><div><a href=\"https://www.hervolution.org/\" target=\"_blank\">hErVolution&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>hErVolution creates opportunities for the next generation of women in STEM by connecting them with leaders in the industry for career support.&nbsp;</div><div><br /></div><div><a href=\"https://www.facebook.com/indigespheres/\" target=\"_blank\">Indige-Spheres&nbsp;</a></div><div>Thunder Bay, ON&nbsp;</div><div>Indige-Spheres supports the health and well-being of Indigenous Peoples by empowering Indigenous youth via initiatives including arts and crafts, awareness campaigns and other activities designed to foster community relations.&nbsp;</div><div><br /></div><div><a href=\"https://indspire.ca/\" target=\"_blank\">Indspire</a>&nbsp;</div><div>Six Nations of the Grand River, ON&nbsp;</div><div>Indspire invests in the education and long-term development of First Nations, Inuit and Métis people in Canada with a vision to enrich Canada through Indigenous education and inspiring achievement.&nbsp;</div><div><br /></div><div><a href=\"https://kidscodejeunesse.org/\" target=\"_blank\">Kids Code Jeunesse&nbsp;</a></div><div>Montreal, QC&nbsp;</div><div>Kids Code Jeunesse encourages the next generation to code, create and communicate, with a goal to help educate Canadian children on digital skills, like block-based coding and computational thinking.&nbsp;</div><div><br /></div><div><a href=\"https://www.imdoingit.ca/\" target=\"_blank\">Kind Republic (IMDOINGIT)&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>Kind Republic (IMDOINGIT) supports underserved black communities to achieve growth by creating safe spaces and opportunities for black youth.&nbsp;</div><div><br /></div><div><a href=\"https://www.kwcounselling.com/\" target=\"_blank\">KW Counseling Services</a>&nbsp;</div><div>Kitchener, ON&nbsp;</div><div>KW Counselling Services is a multi-service agency offering several types of support for community members, including individual, couples and family counselling.&nbsp;</div><div><br /></div><div><a href=\"https://llileaders.com/\" target=\"_blank\">Lifelong Leadership Institute&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>The Lifelong Leadership Institute supports Canadian youth of Jamaican, Caribbean and Black heritage in developing leadership competence and achieving personal success.&nbsp;</div><div><br /></div><div><a href=\"https://ociso.org/\" target=\"_blank\">Ottawa Community Immigrant Services Organization&nbsp;</a></div><div>Ottawa, ON&nbsp;</div><div>The Ottawa Community Immigrant Services Organization (OCISO) helps new immigrants settle into Canada by providing multi-faceted programs and services through various partnerships, aimed at creating a healthy and inclusive space for newcomers.&nbsp;</div><div><br /></div><div><a href=\"https://notman.org/en/osmo/\" target=\"_blank\">OSMO Foundation&nbsp;</a></div><div>Montreal, QC&nbsp;</div><div>The OSMO Foundation supports the development and international growth of Montreal’s startup ecosystem by encouraging collaboration as well as knowledge transfer and know-how between different community actors.&nbsp;</div><div><br /></div><div><a href=\"https://www.parentsengagedineducation.ca/\" target=\"_blank\">Parents Engaged in Education&nbsp;</a></div><div>Scarborough, ON&nbsp;</div><div>Parents Engaged in Education offers training and events to encourage parental involvement in their children’s educational journey while giving parent council members the resources to better partner with school administrators.&nbsp;</div><div><br /></div><div><a href=\"https://www.carizon.ca/\" target=\"_blank\">Pathways/Carizon</a>&nbsp;</div><div>Kitchener, ON&nbsp;</div><div>Carizon focuses on supporting families by strengthening their mental health and wellbeing by offering services in more than 70 locations that specialize in areas like children’s mental health, youth development and family counselling among others.&nbsp;</div><div><br /></div><div><a href=\"https://www.shad.ca/\" target=\"_blank\">SHAD</a>&nbsp;</div><div>Waterloo, ON&nbsp;</div><div>SHAD is a month-long STEAM and entrepreneurship focused program empowering grades 10 and 11 students across Canada. It is held in the summer across 19 Canadian university campuses.&nbsp;</div><div><br /></div><div><a href=\"https://techspark.ca/\" target=\"_blank\">TechSpark</a>&nbsp;</div><div>Toronto, ON&nbsp;</div><div>TechSpark is Canada’s first tech and design school that offers culturally relevant and responsive education to children of colour, girls, women and teachers. Their services include specially designed curriculums and workshops for both teachers and students.&nbsp;</div><div><br /></div><div><a href=\"https://www.technovationmontreal.com/\" target=\"_blank\">Technovation&nbsp;</a></div><div>Montreal, QC&nbsp;</div><div>Technovation offers programs that empower young women, aged 8–18 , to become tech entrepreneurs and leaders. The company was created in Silicon Valley in 2009 and established a presence in Montreal in 2014.&nbsp;</div><div><br /></div><div><a href=\"https://healingofthesevengenerations.ca/\" target=\"_blank\">The Healing of the Seven Generations&nbsp;</a></div><div>Kitchener, ON&nbsp;</div><div>The Healing of the Seven Generations provides support for Indigenous people by helping them address the intergenerational effects of Canada’s residential school system by developing self-help approaches, therapeutic healing programs and community training sessions.&nbsp;</div><div><br /></div><div><a href=\"https://tno-toronto.org/career-volunteer-opportunities\" target=\"_blank\">The Neighbourhood Organization&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>The Neighborhood Organization (TNO) is a multicultural social services organization that offers a range of community-based services to residents of Thorncliffe Park and surrounding communities.&nbsp;</div><div><br /></div><div><a href=\"https://www.youngleadersgroup.org/\" target=\"_blank\">Tree of Young Leaders/Hestia Academy&nbsp;</a></div><div>Montreal, QC&nbsp;</div><div>Hestia Academy is an online academy that enables young people to take control of their education in an online environment that fosters community engagement.&nbsp;</div><div><br /></div><div><a href=\"https://www.unitedwaygt.org/\" target=\"_blank\">United Way of Greater Toronto&nbsp;</a></div><div>Toronto, ON&nbsp;</div><div>United Way of Greater Toronto provides support and safety for underserved communities facing significant barriers to bettering their circumstances in the GTA by prioritizing collaborations with local residents and partners to support BIPOC, 2SLGBTQ+ communities and people living with disabilities.&nbsp;</div><div><br /></div><div><a href=\"https://www.upstarted.org/\" target=\"_blank\">UpstartED&nbsp;</a></div><div>Montreal, QC&nbsp;</div><div>UpStartED provides youth aged 12-18 with equitable access to educational experiences by supporting them in making positive impacts on their communities via social innovation through programs that enable them to tackle complex, real-world challenges.&nbsp;</div><div><br /></div><div><a href=\"https://wemattercampaign.org/\" target=\"_blank\">WeMatter&nbsp;</a></div><div>National&nbsp;</div><div>We Matter provides safe spaces for Indigenous youth to connect, learn and implement youth led initiatives that help amplify Indigenous voices.&nbsp;</div><div><br /></div><div>Alongside businesses, local organizations and nonprofits, we look forward to continuing to help our communities into 2022 and beyond.&nbsp;</div><div><span class=\"post-author\"><br /></span></div><div><span class=\"post-author\">Posted by Canada's Leadership Team</span></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}