{
  "title": "EPISODE 95: Tom Le Forge: The Real Dances with Wolves",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 24 Oct 2022 11:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/10/24/episode-95-tom-le-forge-the-real-dances-with-wolves",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:635421142d247a5b53007619",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/2b8f29ed-8d01-400d-93bf-82db4d35fac8/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"6354214255d42b66d0d63457\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/2b8f29ed-8d01-400d-93bf-82db4d35fac8/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“The adopted father gave away many presents to the people, and these in turn gave presents to me. Thus I became a Crow Indian, a brother of Three Irons and a son of Yellow Leggings, who was a leading counselor of Blackbird, chief of the Mountain Crow tribe.” —</em> Tom Le Forge&nbsp;</p><p class=\"\"><em>“Cherry was utterly cool… under fire. She was as brave as the bravest. She liked to sing and pray, she was jolly and amiable, but on proper occasion she would stand her ground and fight bravely if that were necessary.”</em> — Tom Le Forge about his wife Cherry</p><p class=\"\"><em>“The white-man system of continual struggle for money began to pall upon me. My thoughts dwelt more and more upon the simplicity of Crow Indian life, where I had acquired moderate wealth without special effort, or by efforts entirely to my liking. In fact, among them, great accumulation of material wealth was not of importance. Nobody having an amiable disposition ever came to dire want among them.”</em> — Tom Le Forge&nbsp;</p><p class=\"\"><em>“I worship the Sun and the Bighorn Mountains. The towering range just south of my present home is to me both father and mother. My stomach craves meat cooked in the Indian way… I was born an Ohio American. I shall die a Crow Indian American. My last white wife, in Seattle, got a divorce from me, because of my desertion of her. She was a good woman, but I could not live any longer the life of a white man. When comes the time for me to leave this earth I want to dwell wherever are the spirits of my wives—my Indian wives—both of them.”</em> — Tom Le Forge</p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">I am fascinated by tales of people who lived across cultures—particularly back in the day when knowledge of different ways of living was severely limited. The tale of Tom Le Forge reads like a real-life <em>Dances with Wolves</em> story. Born as an Anglo-American in 1850, when he was still a teenager he was adopted by a family from the Crow nation, and for all intents and purposes <em>became</em> a Crow, marrying into the tribe, living as one of them, and going to war with them against their traditional enemies. Le Forge also joined the ranks of Crow scouts that helped the U.S. army during the last phase of the Plains Indian wars. His story is a love letter to a way of life that disappeared once the buffalo were gone and the frontier was no more.&nbsp;</p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">If you feel generous and enjoy History on Fire, please consider joining my Patreon at <a href=\"https://www.patreon.com/historyonfire\">https://www.patreon.com/historyonfire</a> to access plenty of bonus content.&nbsp;</p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">If you’d like to go to Japan for a historical tour with yours truly as a guide, please check out <a href=\"https://geeknationtours.com/tours/signature-battlefield-series-classic-samurai-from-the-gempei-war-to-the-mongol-invasions-2023/\">https://geeknationtours.com/tours/signature-battlefield-series-classic-samurai-from-the-gempei-war-to-the-mongol-invasions-2023/</a></p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">Big thank you to BetterHelp for sponsoring this episode. Visit <a href=\"https://www.BetterHelp.com/HOF\">https://www.BetterHelp.com/HOF</a> to get 10% off your first month.&nbsp;</p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">Also a big thank you to Trade Coffee. Trade is offering our listeners a total of $30 off your subscription plus free shipping at <a href=\"https://www.drinktrade.com/historyonfire\">https://www.drinktrade.com/historyonfire</a>&nbsp;</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "01:43:14",
  "itunes:image": "",
  "itunes:title": "EPISODE 95: Tom Le Forge: The Real Dances with Wolves",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 95: Tom Le Forge: The Real Dances with Wolves"
  }
}