{
  "title": "The Cybersecurity Skills Gap is Another Instance of Late-stage Capitalism",
  "link": "https://danielmiessler.com/blog/the-cybersecurity-skills-gap-is-another-instance-of-late-stage-capitalism/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Tue, 28 Jun 2022 16:59:54 +0000",
  "category": "Information Security",
  "guid": "https://danielmiessler.com/?p=137948",
  "description": "It&#8217;s common to hear that it&#8217;s hard to get into cybersecurity, and that this is a problem. That seems to be true, but it&#8217;s informative to ask a simple follow-up: The current cybersecurity jobs gap sits at around 2.7 million people. A problem for who? I think what we&#8217;re facing is an instance of the Two-Worlds Problem that&#8217;s&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/cybersecurity-ravine-650x643.png\" alt=\"cybersecurity-ravine\" width=\"650\" height=\"643\" class=\"aligncenter size-medium wp-image-137949\" /></p>\n\n<p>It&#8217;s common to hear that it&#8217;s hard to get into cybersecurity, and that this is a problem. That seems to be true, but it&#8217;s informative to ask a simple follow-up:</p>\n\n<p class=\"note\">The current cybersecurity jobs gap sits at around <a href=\"https://www.helpnetsecurity.com/2022/06/21/hiring-cybersecurity-practitioners/\">2.7 million people</a>.</p>\n\n<blockquote>\n  <p>A problem for who?</p>\n</blockquote>\n\n<p>I think what we&#8217;re facing is an instance of the Two-Worlds Problem that&#8217;s now everywhere in US society. It&#8217;s where the vast majority of people are feeling pain from an issue, but there&#8217;s an elite that lives in a reality where the problem doesn&#8217;t exist.</p>\n\n<p>We&#8217;re living in two different worlds.</p>\n\n<ul>\n<li>Is parenting getting more difficult? <em>Ask your nannies to spend more time with them</em>.</li>\n<li>Are groceries more expensive? <em>Have your assistant shop at both Whole Foods and Trader Joe&#8217;s</em>.</li>\n<li>Is gas expensive? <em>That&#8217;s why we&#8217;re a Tesla family</em>.</li>\n</ul>\n\n<p>It&#8217;s the same for security hiring. For MANGA and Unicorn companies&#8212;henceforth known as Mangacorns&#8212;hiring cybersecurity talent is a nanny browsing Whole Foods with a Platinum Amex.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p>They get the best of the best. The best candidates, from the best schools, as well as named talent from throughout the industry. And when these fresh college graduates ask for over 200K in base salary, and the named talent asks for over a million in total comp, they plop down the Mangacorn Amex.</p>\n\n<p class=\"callout\">At Mangacorn recruiting, most of their days involve the logistics of &#8216;giant garbage trucks of cash&#8217;.</p>\n\n<p>So, for them, everything is fine. Cybersecurity skills shortage? Never heard of it. Everyone wants to work here and they love what we pay!</p>\n\n<p>Indeed.</p>\n\n<p>That&#8217;s one world, and just like the parents with nannies and the families with Teslas and shopping assistants, they have a real hard time understanding complaints about gas and grocery prices. The problem is everywhere and everyone else. So in other words, the other 95%.</p><div data-inline-related-post data-inline-related-post-index=1></div>\n\n<p>For everyone else there are problems on both the hiring side and on the getting-hired side. It&#8217;s both hard for companies to find <a href=\"https://danielmiessler.com/blog/day-1-skills-required-to-land-an-entry-level-cybersecurity-job/\">qualified people</a>, and <a href=\"https://danielmiessler.com/blog/the-problem-with-cybersecurity-hiring/\">it&#8217;s hard for early-career applicants to get taken seriously</a> enough to get their first shot.</p>\n\n<p><center>\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Long thread but serious talk.<br><br>Seeing a massive problem in the security industry today. We have brand new candidates lacking \"hands on\" experience coming into the workforce and finding it extremely difficult to find a job. 1/10</p>&mdash; Dave Kennedy (@HackingDave) <a href=\"https://twitter.com/HackingDave/status/1537594916586520576?ref_src=twsrc%5Etfw\">June 17, 2022</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</center></p>\n\n<p>One can absolutely argue that it isn&#8217;t Mangacorn&#8217;s responsibility to fix this, but that’s the problem isn’t it? That’s the difference between a healthy society and an unhealthy society. In the unhealthy one, you hear people say a lot that it’s not their responsibility, and in the healthy one people find things that are not their responsibility and they make it so.</p>\n\n<p>From the title you might be thinking I&#8217;m down on Capitalism and I&#8217;m about to go all Marx you. Nope. I think Capitalism is still&#8212;by far&#8212;the best of our bad options for managing such things. The problem is the above: responsibility. Or more specifically, in a world where there&#8217;s a thriving 5% at the top of any system, who&#8217;s going to take responsibility for the other 95%?</p>\n\n<p class=\"callout\">If you ask any French cybersecurity recruiter in 1799 they&#8217;ll tell you it&#8217;s the 5%&#8217;s problem as well.</p><div class=\"inline-auto-newsletter\"><div class=\"inline-subscribe px-2 pb-8 pt-8 mb-8 border-t border-b\">\n<div class=\"text-lg font-bold\">The UL Newsletter: Finding the Patterns in the Noise…</div>\n<div class=\"text-sm text-gray-700 max-w-lg\">Get a weekly analysis of what's happening in security and tech—<em>and why it matters</em>.</div>\n<div class=\"mt-2\"><form action=\"https://danielmiessler.us8.list-manage.com/subscribe/post?u=6a9e465ab1570df8aaecb2292&id=49fdb7d723\" method=\"post\" name=\"mc-embedded-subscribe-form\" class=\"mc-embedded-subscribe-form validate inline\" novalidate > \n            <div>\n            <div class=\"mc-field-group\">\n            <input  placeholder=\"your best email\" type=\"email\" value=\"\" name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n            <input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button text-system\">\n            </div>\n            <div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_6a9e465ab1570df8aaecb2292_49fdb7d723\" tabindex=\"-1\" value=\"\"></div>\n            </div>\n            </form></div>\n</div>\n</div>\n\n<p>The natural move there is to say the government, but that only seems to work when everyone agrees on the matter&#8212;including the 5%. That&#8217;s why the Viking countries thrive with a blend of capitalism and government: <em>their 5% have taken responsibility for their 95%</em>.</p>\n\n<p class=\"callout\">We need to frame this as responsibility instead of blame.</p>\n\n<p>So, yeah, back to security. In the US we have a lack of someone taking responsibility for building a cybersecurity pipeline. We have a happy 5% in the Mangacorns, and we have a struggling 95% in most SME businesses and startups.</p>\n\n<p>Fairness is not the default state of nature; it&#8217;s something you have to struggle to maintain. The default state is a system of have, have-less’s, and have-nots. And the Mangacorns didn&#8217;t create this broken system we have now; they&#8217;re just benefitting from what came naturally.</p>\n\n<p>But it is time to start blaming them for benefiting from it without doing something about it.</p><div data-inline-related-post data-inline-related-post-index=3></div>\n\n<p>If you want to be the Finland of cybersecurity jobs, the Mangacorns have to take responsibility for the other 95%.</p>\n\n<p>What that means tactically is up for debate, but it starts with the 5% taking responsibility and investing in the pipelines. Maybe that involves some government. Maybe it involves the universities and junior colleges. Maybe it involves big training companies like SANS. And it&#8217;s probably all of the above. My friend <a href=\"https://twitter.com/jhaddix/\">Jason Haddix</a> and I talk a lot about what this might look like, and he&#8217;s doing a series of talks about it as well.</p>\n\n<p>We&#8217;re both happy to take any ideas you may have on that front, and to work actively on practical solutions.</p>\n\n<p><strong>TL;DR:</strong> If you ever find something that’s broken for most of society, and you wonder why it is broken, ask yourself if it’s still working for the top 5% and whether that 5% has taken responsibility for the success for the other 95%. If not, there’s your answer.</p>\n</p>"
}