{
  "title": "Galactic contribution to the high-energy neutrino flux found in track-like IceCube events. (arXiv:2208.08423v2 [astro-ph.HE] UPDATED)",
  "link": "http://arxiv.org/abs/2208.08423",
  "description": "<p>Astrophysical sources of neutrinos detected by large-scale neutrino\ntelescopes remain uncertain. While there exist statistically significant\nobservational indications that a part of the neutrino flux is produced by\nblazars, numerous theoretical studies suggest also the presence of potential\nGalactic point sources. Some of them have been observed in gamma rays above 100\nTeV. Moreover, cosmic-ray interactions in the Galactic disk guarantee a diffuse\nneutrino flux. However, these Galactic neutrinos have not been unambiguously\ndetected so far. Here we examine whether such a Galactic component is present\namong the observed neutrinos of the highest energies. We analyze public\ntrack-like IceCube events with estimated neutrino energies above 200 TeV. We\nexamine the distribution of arrival directions of these neutrinos in the\nGalactic latitude b with the help of a simple unbinned, non-parametric test\nstatistics, the median |b| over the sample. This distribution deviates from\nthat implied by the null hypothesis of the neutrino flux isotropy, and is\nshifted towards lower b with the p-value of 4*10^{-5}, corresponding to the\nstatistical significance of 4.1 sigma. There exists a significant component of\nthe high-energy neutrino flux of Galactic origin, matching well the\nmulti-messenger expectations from Tibet-ASgamma observations of diffuse\nGalactic gamma rays at hundreds of TeV. Together with the previously\nestablished extragalactic associations, the Galactic component we report here\nimplies that the neutrino sky is rich and is composed of contributions from\nvarious classes of sources.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Kovalev_Y/0/1/0/all/0/1\">Y. Y. Kovalev</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Plavin_A/0/1/0/all/0/1\">A. V. Plavin</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Troitsky_S/0/1/0/all/0/1\">S. V. Troitsky</a>"
}