{
  "id": "yt:video:jCFKCfdXHJA",
  "yt:videoId": "jCFKCfdXHJA",
  "yt:channelId": "UCHbMevniQEQnGZ4npjYSfaw",
  "title": "Paris vs NYC: What It's Like to Bike",
  "link": "",
  "author": {
    "name": "Streetfilms",
    "uri": "https://www.youtube.com/channel/UCHbMevniQEQnGZ4npjYSfaw"
  },
  "published": "2022-09-24T01:00:11+00:00",
  "updated": "2022-10-24T17:39:22+00:00",
  "media:group": {
    "media:title": "Paris vs NYC: What It's Like to Bike",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "People have been visiting Paris for centuries for the food, the wine, the museums, the cheese and even the snails, but when New Yorkers head to the City of Light these days, all they see are the bike lanes.\n\nThat’s what a half-dozen envious Gothamites told Streetfilms upon their return from the French capital for his new movie, “Paris vs NYC: What It’s Like to Bike”\n\nDouble-wide bike lanes! Contra-flow bike lanes! Bikes lanes on car-free streets! Bike lanes bike lanes bike lanes.\n\nBut when you see great bike lanes in Paris, you’re not just looking at good transport policy. You’re seeing the future.\n\n“They are building the city they want to see, not the city as it is now,” Kate Fillin-Yeh, a Harlem resident, told Clarence Eckerson in the viral video below. (Fillin-Yeh knows something about cities: She’s director of strategy at NACTO, the National Association of City Transportation Officials.)\n\nBut Fillin-Yeh is hardly alone in wishing New York would stop designing the city to accommodate existing road users — 75 percent of all space for car drivers, for example, rather than the majority of space for bus riders, pedestrians and cyclists — rather than the mode share the city claims it is trying to achieve for its non-car-using majority.\n\nAlso appearing in the film is like a Streetsblog Hall of Fame of talking heads: Mike Lydon of Street Plans, New Third Avenue advocate Paul Krikler, Queens bike advocate (and Queen of Twitter) CJ Wojtkowski, and, Streetsblog Editor Gersh Kuntzman.\n\nCheck it out below, and share it with Mayor Adams.\n\n(This text reprinted from StreetsblogNYC)",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}