{
  "title": "Episode 85: &#8220;Three Steps to Heaven&#8221; by Eddie Cochran",
  "link": "https://500songs.com/podcast/episode-85-three-steps-to-heaven-by-eddie-cochran/",
  "pubDate": "Fri, 05 Jun 2020 20:38:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=458",
  "description": "Episode eighty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Three Steps to Heaven\" by Eddie Cochran, and at the British tour which changed music and ended his life. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode, <a href=\"https://www.patreon.com/posts/37907424\">on \"Quarter to Three\"</a> by Gary US Bonds.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-85-three-steps-to-heaven/\">a Mixcloud mix</a> with every song excerpted in this podcast.\n\nMuch of the information here comes from Spencer Leigh's book <a href=\"https://amzn.to/30bMyzQ\"><em>Things Do Go Wrong</em></a>, which looks specifically at the 1960 tour.\n\nI also used <a href=\"https://amzn.to/2losisr\"><em>Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries</em> by John Collis.</a>\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). <a href=\"https://amzn.to/2oDr1zy\">This one</a> is probably the best you can get for Cochran novices.\n\n<a href=\"https://amzn.to/30bMVKK\">This CD</a> contains the Saturday Club recordings by Vincent and Cochran, which are well worth listening to.\n\n<a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\n\nAnd a fair chunk of the background information here also comes from <a href=\"https://amzn.to/2XylQOW\">the extended edition of Mark Lewisohn's Tune In,</a> which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThere's been a sad running theme in the episodes in recent months of rock stars dying in accidents. Sadly, in the 1950s and sixties, travelling long distances was even more dangerous than it is today, and rock musicians, who had to travel a lot more than most people, and did much of that travelling at night, were more likely to be in accidents than most. Today, we're going to look at yet another of these tragic deaths, of someone who is thought of in the US as being something of a one-hit wonder, but who had a much bigger effect on British music. We're going to look at what would be Eddie Cochran's final tour, and at his UK number one single \"Three Steps to Heaven\":\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nWhen we left Eddie Cochran, he had just appeared in the film \"The Girl Can't Help It\", singing \"Twenty Flight Rock\", and he had also had a hit with \"Sittin' in the Balcony\". But he hadn't yet managed to establish himself as the star he knew he could be -- he was the whole package, singer, songwriter, and especially guitarist, and he hadn't yet made a record that showed him to his best advantage as an artist. \"Twenty Flight Rock\" had come close, but it wasn't a song he'd written himself, and the record hadn't yet been released in the US.\n\nMeanwhile, Liberty Records seemed to not understand what they had in him -- they were trying to push him to be another Pat Boone, and become a bland pop singer with no rock and roll in his sound. His first album, Singin' to My Baby, had little to do with the music that he was interested in playing.\n\nSo Cochran needed to find something that would really put him on the map -- a song that would mean he wasn't just one of dozens of Fabians and Frankie Avalons and interchangeable Bobbies who were starting to take over shows like American Bandstand. \"Twenty Flight Rock\" hadn't ended up being a hit at all, despite its placement in a popular film -- they'd left it too long between the film coming out and releasing the record, and he'd lost that momentum.\n\nAt the end of 1957 he'd gone on the Australian tour with Little Richard and Gene Vincent which had led to Richard retiring from rock and roll, and he'd become much closer with Vincent, with whom he'd already struck up a friendship when making The Girl Can't Help It. The two men bonded, particularly, over their love of guns, although they expressed that love in very different ways. Cochran had grown up in rural Minnesota, and had the same love of hunting and fishing that most men of his background did at that time (and that many still do). He was, by all accounts, an affable person, and basically well adjusted.\n\nVincent, on the other hand, was a polite and friendly person when not drinking. Unfortunately, he was in constant pain from his leg wounds, and that meant he was drinking a lot, and when he was drunk he was an incredibly unpleasant, aggressive, person. His love of guns was mostly for threatening people with, and he seems to have latched on to Cochran as someone who could look after him when he got himself into awkward situations -- Cochran was so personally charming that he could defuse the situation when Vincent had behaved appallingly towards someone.\n\nAt the time, Vincent seemed like a has-been and Cochran a never-would-be. This was late 1957, and it seemed like rock and roll records with guitars on were a fad that had already passed their sell-by date. The only white guitarist/vocalist other than Elvis who'd been having hits on a regular basis was Buddy Holly, and his records were doing worse and worse with each release. Vincent hadn't had a real hit since his first single, \"Be Bop A Lula\", while Cochran had made the top twenty with \"Sittin' in the Balcony\", but the highest he'd got after that was number eighty-two. He'd recently recorded a song co-written by George Mottola, who'd written \"Goodnight My Love\", but \"Jeannie, Jeannie, Jeannie\" stalled at number ninety-four when it was released in early 1958:\n\n[Excerpt: Eddie Cochran, \"Jeannie, Jeannie, Jeannie\"]\n\nSo neither man was in a good place at the start of 1958, but they had very different attitudes -- Vincent was depressed and angry, but Cochran knew that something would come along. He was only nineteen, he was astonishingly good looking, he was a great guitarist -- if rock and roll didn't work out, something would.\n\nIn early 1958, Cochran was still hunting for that elusive big hit, as he joined the Blue Caps in the studio, to provide bass, arrangements, and backing vocals on several tracks for Vincent's latest album. It's Cochran singing the bass vocals at the start of \"Git It\", one of Vincent's greatest tracks:\n\n[Excerpt: Gene Vincent and the Blue Caps, \"Git It\"]\n\nBut shortly after that recording, a major turn in Cochran's fortunes came from an unexpected place. Liberty Records had been in financial difficulties, and part of the reason that Cochran's records were unsuccessful was that they just didn't have the money to promote them as much as they'd like. But then at the beginning of April a man called Ross Bagdasarian, under the name David Seville, released a novelty song called \"The Witch Doctor\", featuring some mildly racist comedy and a sped-up voice. That record became a massive hit, selling over a million copies, going to number one, and becoming the fourth most successful record of 1958. Suddenly, Liberty Records was saved from bankruptcy.\n\nThat made all the difference to the success of a track that Cochran had recorded on March the 28th, the same week he recorded those Gene Vincent sessions, and which came out at the tail-end of summer. Cochran had come up with a guitar riff that he liked, but he didn't have any lyrics for it, and his friend and co-writer Jerry Capehart said \"there's never been a blues about the summer\". The two of them came up with some comedy lyrics in the style of the Coasters, who had just started to have big hits, and the result became Cochran's only top ten hit in the US, reaching number eight, and becoming one of the best-remembered tracks of the fifties:\n\n[Excerpt: Eddie Cochran, \"Summertime Blues\"]\n\nThat track was recorded with a minimal number of musicians -- Cochran played all the guitars and sang both vocal parts, his bass player Guybo Smith played the bass part, and the great session drummer Earl Palmer played drums. There was also a fourth person on the record -- Sharon Sheeley, who added handclaps, and who had written the B-side.\n\nSheeley was a talented songwriter who also had a propensity for dating musicians. She'd dated one of the Everly Brothers for a while -- different reports name different brothers, but the consensus seems to be that it was Don -- and then when they'd split up, she'd written a song called \"Poor Little Fool\". She'd then faked having her car break down outside Ricky Nelson's house, and collared him when he came out to help. That sort of thing seemed to happen to Nelson a lot with songwriters -- Johnny and Dorsey Burnette had sold Nelson songs by sitting on his doorstep and refusing to move until he listened to them -- but it seemed to work out very well for him. The Burnettes wrote several hits for him, while Sheeley's \"Poor Little Fool\" became Nelson's first number one, as well as being the first number one ever on Billboard's newly-renamed Hot One Hundred, and the first number one single on any chart to be written by a woman without a male cowriter:\n\n[Excerpt: Ricky Nelson, \"Poor Little Fool\"]\n\nSheeley gets unfairly pigeonholed as a groupie (not that there's anything wrong with being a groupie) because she had relationships with musicians, and at this point she was starting a relationship with Cochran. But it's important to remember that when they got together, even though he was eighteen months older than her, she was the one who had written a number one single, and he was the one whose last record had gone to number ninety-four -- and that after her relationship with Cochran, she went on to form a writing partnership with Jackie DeShannon that produced a long string of hits for people like Brenda Lee and the Fleetwoods, as well as songs that weren't hits but probably deserved to be, like Ral Donner's \"Don't Put Your Heart in His Hands\":\n\n[Excerpt: Ral Donner, \"Don't Put Your Heart in His Hands\"]\n\nSheeley was more invested in her relationship with Cochran than he was, but this has led rock writers to completely dismiss her as \"just Eddie Cochran's girlfriend\", when in terms of their relative statuses in the music industry, it would be more fair to define Cochran as \"just Sharon Sheeley's boyfriend\". I have to emphasise this point, because in the limited number of books about Cochran, you will see a lot of descriptions of her as \"a groupie\", \"a fantasist\", and worse, and very few mentions of the fact that she had a life outside her partner.\n\n\"Summertime Blues\" looked like it was going to be the start of Eddie Cochran's career as a rock and roll star, but in fact it was the peak of it, at least in the US. While the song was a big hit, the follow-up, \"C'mon Everybody\", which was written by Cochran and Capehart to much the same formula, but without the humour that characterised \"Summertime Blues\", didn't do so well:\n\n[Excerpt: Eddie Cochran, \"C'mon Everybody\"]\n\nThat made only number thirty-five on the US charts, and would be Cochran's last top forty record there -- but in the UK, it was a bigger hit than \"Summertime Blues\", reaching number six.\n\n\"C'mon Everybody\" was, though, big enough for Cochran to make some TV appearances. He'd agreed to go on tour with his friends Buddy Holly and Ritchie Valens on a tour called the Winter Dance Party tour, but had bowed out when he got some offers of TV work. He definitely appeared on a show called Town Hall Party broadcast from California on February the second 1959, and according to Sheeley he was booked to appear in New York on the Ed Sullivan Show, which was the reason he'd decided not to do the tour, a few days later.\n\nAs it turned out, Cochran never made that Ed Sullivan Show appearance, as in the early hours of February the third, his friends died in a plane crash. He refused to get on the plane to New York for the show, and instead drove out to the desert in his station wagon to grieve, and from that point on he developed a fear of flying.\n\nThe follow-up to \"C'mon Everybody\", \"Teenage Heaven\", only went to number ninety-nine on the charts, and his next two singles didn't do much better. \"Somethin' Else\", a song that Sheeley had written for him, made number fifty-eight, while his cover version of Ray Charles' \"Hallelujah I Love Her So\" didn't chart at all. 1959 was a depressing year for Cochran personally and professionally.\n\nBut while \"Somethin' Else\" and \"Hallelujah I Love Her So\" were flops in the US, they both made the top thirty in the UK. In the US, guitar-based white rock and roll was now firmly out of fashion, with the audience split between black vocal groups singing R&B and white male solo singers called Bobby singing mid-tempo pop. But in the UK, the image of rock and roll in people's minds was still that of the rockabillies from a couple of years earlier -- while British musical trends would start to move faster than the US by the sixties, in the fifties they lagged a long way behind.\n\nAnd in particular, Cochran's friend Gene Vincent was doing much better in Britain than in the US.\n\nVery few US performers had toured the UK, and with the exception of Buddy Holly, most of those who had were not particularly impressive. Because of an agreement between the two countries' musicians' unions, it was difficult for musicians to perform in one country if they were from the other.\n\nIt wasn't quite so difficult for solo performers, who could be backed by local musicians and were covered under a different agreement, but Lew and Leslie Grade, who had a virtual monopoly on the UK entertainment business, had had a very bad experience with Jerry Lee Lewis when his marriage to his teenage cousin had caused his UK tour to be cancelled, and anyway, Britain was an unimportant market a long way away from America, so why would Americans come all that way? For most of 1959, the closest thing to American rock and roll stars touring the UK were Connie Francis and Paul Anka, neither of whom screamed rock and roll rebellion. American rockers just didn't come to the UK.\n\nUnless they had nowhere else to go, that is -- and Gene Vincent had nowhere else to go. In the US, he was a washed-up has been who'd burned every single bridge, but in the UK he was an American Rock Star. In late 1959 he released a not-great single, \"Wildcat\":\n\n[Excerpt: Gene Vincent, \"Wildcat\"]\n\nThat single wasn't doing particularly well, but then Larry Parnes and Jack Good hatched a plan. Good had a new TV show, \"Boy Meets Girls\", based around one of Parnes' artists, Marty Wilde, and also had a column in Disc magazine. They'd get an American rock star over to the UK, Parnes would stick him on a bill with a bunch of Parnes' acts, Good would put him on the TV show and promote him in Disc magazine, and the tour and TV show would split the costs.\n\nWilde was, at the time, about to go into a career slump. He'd just got married, and he and his wife were trying for their first kid -- they'd decided that if it was a girl, they were going to call her Kim. It seemed likely they were going to lose his audience of teenage girls, as he was no longer available, and so Larry Parnes was trying to move him from rock and roll into musical styles that would be more suitable for adults, so his latest single was a ballad, \"Bad Boy\":\n\n[Excerpt: Marty Wilde, \"Bad Boy\"]\n\nThat meant that Wilde's band, the Wildcats, made up at this point of Tony Belcher, Big Jim Sullivan, Licorice Locking and Brian Bennett, were no longer going to be suitable to back Wilde, as they were all rock and rollers, so they'd be fine for whichever rock star they could persuade over to the UK.\n\nVincent was the only rock star available, and his latest single was even called \"Wildcat\". That made him perfect for Parnes' purposes, though Vincent was slightly nervous about using British musicians -- he simply didn't think that British musicians would be any good.\n\nAs it turned out, Vincent had nothing to worry about on that score at least. When he got to the studios in Didsbury, in Manchester, where Boy Meets Girls was filmed, he met some of the best session musicians Britain had to offer. The house band for the show, the Flying Squad, was a smaller version of the bands that had appeared on Good's earlier shows, a nine-piece group that included organist Cherry Wainer and session drummer Andy White, and was led by Joe Brown.\n\nBrown was a Larry Parnes artist, who at this point had released one rather uninspired single, the country-flavoured \"People Gotta Talk\":\n\n[Excerpt: Joe Brown, \"People Gotta Talk\"]\n\nBut Brown had an independent streak, which could be seen just from his name -- Larry Parnes had tried to change it, as he did with all his acts, but Brown had flat-out refused to be called Elmer Twitch, the name Parnes had chosen for him. He insisted on keeping his own name, and it was under that name that he became one of Britain's most respected guitarists.\n\nVincent, amazingly, found these British musicians to be every bit as good as any musicians he'd worked with in the USA. But that was about all that he liked about the UK -- you couldn't get a hamburger or a pizza anywhere in the whole country, and the TV was only in black and white, and it finished at 11PM. For someone like Vincent, who liked to stay up all night watching old monster movies on TV, that was completely unacceptable. Luckily for him, at least he had his gun and knife to keep him occupied -- he'd strapped them both to the leg iron he used for his damaged leg, so they wouldn't set off the metal detectors coming into the country.\n\nBut whatever his thoughts about the country as a whole, he couldn't help loving the audience reaction. Jack Good knew how to present a rock and roll star to an audience, and he'd moved Vincent out of the slacks and sweater vests and blue caps into the kind of leather that he'd already had Vince Taylor wear. He got Vincent to emphasise his limp, and to look pained at all times. He was imagining Vincent as something along the lines of Richard III, and wanted him to appear as dangerous as possible.\n\nHe used all the tricks of stagecraft that he'd used on Taylor, but with the added advantage that Vincent had a remarkable voice, unlike Taylor. Sadly, as is the case with almost all of the British TV of the period, the videotapes of the performances have long since been wiped, but we have poor-quality audio that demonstrates both how good Vincent was sounding and how well the British musicians were able to adapt to backing him:\n\n[Excerpt: Gene Vincent, \"Summertime\", live on Boy Meets Girls]\n\nAfter making three appearances on Boy Meets Girls, Vincent was put on tour backed by the Wildcats, on a bill with acts like Wee Willie Harris and the Bachelors (the ones who recorded for Parlophone, not the later act of the same name), and \"Wildcat\" started going up the charts.\n\nEven though Gene Vincent hadn't had a hit in three years, he was a massive success with the British audiences, and as a result Parnes and Good decided that it might be an idea if they got another American star over here, and the obvious choice was Eddie Cochran. Cochran had the same agent as Vincent, and so there was a working relationship there; they both knew each other and so Vincent could help persuade Cochran over; and Cochran had had a string of top thirty hits in the UK, but was commercially dead in the US.\n\nIt was tempting for Cochran, too -- as well as the obvious advantage of playing to people who were actually buying his record, the geography of Britain appealed. He'd been terrified of flying since Buddy Holly and Ritchie Valens had died, but the British tour would only involve the transatlantic flight -- all the travel once he was in the UK would be by road or rail. Before he came over, he had to record his next single, to be released while he was over in the UK.\n\nSo on January the 8th, 1960, Eddie Cochran went into Gold Star Studios with his normal bass player, Guybo, and with his friends Sonny Curtis and Jerry Allison, the guitarist and drummer of the Crickets, and they cut what turned out to be his last single, \"Three Steps to Heaven\":\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nTwo days later, he was in Britain, for the start of what was the biggest rock and roll tour in British history to that point -- a hundred and eight live appearances, plus several TV and radio appearances, in a little over three months, playing two shows a night most nights. Parnes felt he had to work them hard to justify their fees -- Vincent was getting $2500 a week, and Cochran $1000, while for example Billy Fury, at that point the biggest of Parnes' acts, was on a salary of twenty pounds a week.\n\nWhile Vincent had made a great impression largely despite himself, Cochran was a different matter. Everyone seemed to love him. Unlike Vincent, he was a musician's musician, and he formed close friendships with the players on the tour. Joe Brown, for example, remembers Cochran explaining to him that if you swap the G string on your guitar for a second B string, tuned down to G, you could bend a note a full tone -- Brown used that trick to make himself one of the most sought-after session players in the UK before his own pop career started to take off.\n\nIt was also apparent that while Jack Good had had to create a stage act for Gene Vincent, he didn't have to do anything to make Cochran look good in front of the cameras. Marty Wilde said of him \"The first thing I noticed about Eddie was his complexion. We British lads had acne and all the usual problems, and Eddie walked in with the most beautiful hair and the most beautiful skin - his skin was a light brown, beautiful colour, all that California sunshine, and I thought 'you lucky devil'. We had Manchester white all over us. And he had the most beautiful face -- the photographs never did the guy justice\".\n\nFrom the moment Cochran started his set in Ipswich, by saying \"It's great to be here in Hipswich\" and wiggling his hips, he was utterly in command of the British audiences.\n\nThankfully, because they did so many TV and radio sessions while they were over here, we have some idea of what these shows sounded like -- and from the recordings, even when they were in the antiseptic environment of a BBC recording studio, without an audience, they still sounded fantastic. On some shows, Cochran would start with his back to the audience, the band would start playing \"Somethin' Else\", the song that Sharon Sheeley had written for him that had been a minor hit, and he'd whirl round and face the audience on the opening line, \"Well look-a there!\"\n\n[Excerpt: Eddie Cochran and Gene Vincent, \"Somethin' Else [Eddie Cochran vocals]\", Saturday Club version]\n\nThe shows all had a number of acts on, all of them other than the stars Larry Parnes acts, and because there were so many shows, acts would get rotated in and out as the tour went on. But some of those who played on many dates were Vince Eager, who had named himself after Gene Vincent but quickly grew more attached to Eddie Cochran, who he started to regard as his best friend as the tour went on, Tony Sheridan, who was building a solo career after leaving the Oh Boy! band, Georgie Fame, who was already more interested in being a jazz and R&B pianist in the mould of Mose Allison than he was in being a pop star, Johnny Gentle, a Liverpudlian performer who never rose to massive success, and Billy Fury, by far the most talented of Parnes' acts. Fury was another Liverpudlian, who looked enough like Cochran that they could be brothers, and who had a top ten hit at the time with \"Collette\", one of many hits he wrote for himself:\n\n[Excerpt: Billy Fury, \"Collette\"]\n\nFury was something of a sex symbol, aided by the fact that he would stuff his pants with the cardboard tube from a toilet roll before going on stage. This would lead the girls to scream at him -- but would also lead their violent boyfriends to try to bottle him off stage, which meant he had more reason than most to have stagefright. Cochran would joke with Fury, and try to put him at ease -- one story has him telling a nervous Fury, about to go on stage, to just say to himself \"I am the greatest performer in the world\". Fury repeated back \"I am the greatest performer in the world\", and Cochran replied, \"No you're not -- I am!\"\n\nThis kind of joking led to Cochran becoming immensely popular among all the musicians on the tour, and to him once again falling into his old role of protecting Gene Vincent from the consequences of his own actions, when Vincent would do things like cut up a suit belonging to one of the road managers, while the road manager was inside it.\n\nWhile Vincent was the headliner, Cochran was clearly the one who impressed the British audiences the most. We have some stories from people who saw the tour, and they all focus on Eddie. Particularly notable is the tour's residency in Liverpool, during which time Cochran was opening his set with his version of \"What'd I Say\":\n\n[Excerpt: Gene Vincent and Eddie Cochran, \"What'd I Say [Eddie Cochran vocals]\", Saturday Club version]\n\nWe have this report of Cochran's performance in Liverpool:\n\n\"Eddie blew me away. He had his unwound 3rd string, looked good and sang good and he was really getting to be a good guitarist… One moment will always represent Eddie to me. He finished a tune, the crowd stopped screaming and clapping, and he stepped up to the mike and before he said something he put both his hands back, pushed his hair back, and some girl, a single voice in the audience, she went ‘Eddie!’ and he said ‘Hi honey!’… I thought, ‘Yes! That’s it – rock ’n’ roll!’\"\n\nThat's a quote from George Harrison in the early 1990s. He'd gone to see the show with a friend, John Lennon -- it was Lennon's first ever rock and roll gig as an audience member, and one of a very small number he ever attended. Lennon never particularly enjoyed seeing live shows -- he preferred records -- but even he couldn't resist seeing Eddie Cochran and Gene Vincent on the same bill.\n\nThe Liverpool shows were massive successes, despite both American rockers being increasingly bored and turning more and more to drink as a result. Apparently the two would drink a bottle of bourbon between them before going on stage, and at one Liverpool show Cochran had to hold on to a mic stand to keep himself upright for the first two songs, before he sobered up enough to let go.\n\nThe shows were successful enough that a local promoter, Allan Williams, asked if he could book Cochran and Vincent for another show, and Larry Parnes said yes -- after Liverpool, they had to play Newcastle, Manchester, London, and Bristol, taking up another month, and then Eddie Cochran was going to be going back to the US for a couple of weeks, but he could pencil them in for six weeks' time, when Cochran was going to come back.\n\nIt's quite surprising that Cochran agreed to come back, because he was getting thoroughly sick of the UK. He'd asked Sharon Sheeley to fly over and join him, but other than her and Vincent he had nothing of home with him, and he liked sunshine, fast food, cold beer, and all-night TV, and hated everything about the British winter, which was far darker and wetter than anything he'd experienced.\n\nBut on the other hand, he was enjoying making music with these British people. There's a great recording of Cochran, Vincent, Billy Fury, and Joe Brown jamming on the Willie Dixon blues song \"My Babe\" on \"Boy Meets Girls\":\n\n[Excerpt: Eddie Cochran, Gene Vincent, Billy Fury, Joe Brown, “My Babe”]\n\nBut by the time the tour ended in Bristol, Eddie was very keen to get back. He was going to be bringing Vince Eager over to America to record, and arranged to meet him in London in the early hours of Easter Sunday. They were going to be taking the lunchtime plane from what was then London Airport but is now Heathrow.\n\nBut there was a problem with getting there on time. There were very few trains between Bristol and London, and they'd have to get a car from the train station to the airport. But that Easter Sunday was the day of the annual Aldermaston March against nuclear weapons. These were massive marches which were big enough that they spawned compilation albums of songs to sing on the march, like Ewan MacColl and Peggy Seeger's \"Brother Won't You Join the Line\":\n\n[Excerpt: Ewan MacColl and Peggy Seeger, \"Brother Won't You Join the Line?\"]\n\nBut the main effect the march was having on Cochran and Vincent was that it meant that to be sure of catching their plane, they would have to travel overnight by car. At first, they asked one of the other artists on the tour, Johnny Gentle, if they could go in his car, but he already had a carful, so they ended up getting a local driver, named George Martin (not the one at Parlophone Records) to drive them overnight. They got into the back seat of the car -- Cochran sitting between Vincent and Sheeley, as Sheeley couldn't stand Vincent.\n\nVincent took a sleeping pill and went to sleep almost immediately, but Sheeley and Cochran were in a good mood, singing \"California Here We Come\" together, when Martin took a turn too fast and hit a lamppost. Vincent and Sheeley suffered major injuries and had to spend time in hospital. Cochran died.\n\nA short while later, Johnny Gentle's car made its way onward towards London, and ran out of fuel. As all-night garages weren't a thing in Britain then, they flagged down a policeman who told them there'd been a crash, and they could see if the breakdown vehicle would let them siphon petrol from the wrecked car. They did, and it was only the next day they realised which car it was they'd taken the fuel from. One of the police at the scene – maybe even that one – was a cadet who would later change his name to Dave Dee, and become the lead singer in Dave Dee, Dozy, Beaky, Mick and Titch.\n\nAs soon as the news got out about Cochran's death, \"Three Steps to Heaven\", which had come out in the US, but not yet in the UK, was rush-released:\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nIt went to number one, and became Cochran's biggest hit.\n\nLarry Parnes didn't see why Cochran's death should put a crimp in his plans, and so he immediately started promoting the shows for which Vincent and Cochran had been booked, calling them Eddie Cochran Tribute Shows, and talking to the press about how ironic it was that Cochran's last song was \"Three Steps to Heaven\". Vince Eager was so disgusted with Parnes that he never worked with him again.\n\nBut those shows turned out to have a much bigger impact than anyone could have imagined. Allan Williams was worried that without Cochran, the show he'd got booked in Liverpool wouldn't get enough of a crowd, so he booked in a number of local bands -- Rory Storm and the Hurricanes, Cass and the Cassanovas, Nero and the Gladiators, and Gerry and the Pacemakers -- to fill out the bill. This led to all the bands and musicians in Liverpool realising, for the first time, how much talent there was in the city and how many bands there were. That one show changed Liverpool from a town where there were a few bands to a town with a music scene, and May the third 1960 can be pointed to as the day that Merseybeat started.\n\nParnes was impressed enough by the local groups that he decided that Liverpool might be a good place to look for musicians to back his singers on the road. And we'll pick up on what happened then in a few months.\n\nSharon Sheeley, once she'd recovered from her injuries, went on to write hits for Brenda Lee, Jackie DeShannon, the Fleetwoods, and Irma Thomas, and when Jack Good moved back to the US, she renewed her acquaintance with him, and together with Sheeley's husband they created Shindig, the most important American music show of the sixties. But by the time she died in 2002, all her obituaries talked about was that she'd been Eddie Cochran's girlfriend.\n\nAnd as for Gene Vincent, he was already in chronic pain, suffering mood swings, and drinking too much before the accident hospitalised him. After that, all those things intensified. He became increasingly unreliable, and the hits dried up even in Britain by mid-1961. He made some good music in the sixties, but almost nobody was listening any more, and an attempted comeback was cut short when he died, aged thirty-six, in 1971, from illnesses caused by his alcoholism.\n\nDespite their tragic deaths, Vincent and Cochran, on that 1960 UK tour, almost accidentally catalysed a revolution in British music, and the changes from that will reverberate throughout the rest of this story.",
  "itunes:subtitle": "Episode eighty-five of A History of Rock Music in Five Hundred Songs looks at Three Steps to Heaven by Eddie Cochran, and at the British tour which changed music and ended his life. Click the full post to read liner notes, links to more information, and ",
  "itunes:keywords": "Allan Williams,Andy White,Big Jim Sullivan,Billy Fury,Brian Bennett,British rock,Buddy Holly,Cherry Wainer,Earl Palmer,Ed Sullivan,Eddie Cochran,Gene Vincent,George Harrison,George Mottola,Jack Good,Jackie DeShannon,Jerry Allison,Jerry Capehart,Joe Brown,John Lennon,Johnny Gentle,Larry Parnes,Liberty Records,Licorice Locking,Liverpool,Marty Wilde,Merseybeat,Ricky Nelson,Sharon Sheeley,Sonny Curtis,the Crickets,The Everly Brothers,Tony Sheridan,Vince Eager",
  "itunes:episodeType": "full",
  "itunes:episode": 85,
  "content:encoded": "Episode eighty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Three Steps to Heaven\" by Eddie Cochran, and at the British tour which changed music and ended his life. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode, <a href=\"https://www.patreon.com/posts/37907424\">on \"Quarter to Three\"</a> by Gary US Bonds.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I have put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-85-three-steps-to-heaven/\">a Mixcloud mix</a> with every song excerpted in this podcast.\n\nMuch of the information here comes from Spencer Leigh's book <a href=\"https://amzn.to/30bMyzQ\"><em>Things Do Go Wrong</em></a>, which looks specifically at the 1960 tour.\n\nI also used <a href=\"https://amzn.to/2losisr\"><em>Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries</em> by John Collis.</a>\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). <a href=\"https://amzn.to/2oDr1zy\">This one</a> is probably the best you can get for Cochran novices.\n\n<a href=\"https://amzn.to/30bMVKK\">This CD</a> contains the Saturday Club recordings by Vincent and Cochran, which are well worth listening to.\n\n<a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\n\nAnd a fair chunk of the background information here also comes from <a href=\"https://amzn.to/2XylQOW\">the extended edition of Mark Lewisohn's Tune In,</a> which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThere's been a sad running theme in the episodes in recent months of rock stars dying in accidents. Sadly, in the 1950s and sixties, travelling long distances was even more dangerous than it is today, and rock musicians, who had to travel a lot more than most people, and did much of that travelling at night, were more likely to be in accidents than most. Today, we're going to look at yet another of these tragic deaths, of someone who is thought of in the US as being something of a one-hit wonder, but who had a much bigger effect on British music. We're going to look at what would be Eddie Cochran's final tour, and at his UK number one single \"Three Steps to Heaven\":\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nWhen we left Eddie Cochran, he had just appeared in the film \"The Girl Can't Help It\", singing \"Twenty Flight Rock\", and he had also had a hit with \"Sittin' in the Balcony\". But he hadn't yet managed to establish himself as the star he knew he could be -- he was the whole package, singer, songwriter, and especially guitarist, and he hadn't yet made a record that showed him to his best advantage as an artist. \"Twenty Flight Rock\" had come close, but it wasn't a song he'd written himself, and the record hadn't yet been released in the US.\n\nMeanwhile, Liberty Records seemed to not understand what they had in him -- they were trying to push him to be another Pat Boone, and become a bland pop singer with no rock and roll in his sound. His first album, Singin' to My Baby, had little to do with the music that he was interested in playing.\n\nSo Cochran needed to find something that would really put him on the map -- a song that would mean he wasn't just one of dozens of Fabians and Frankie Avalons and interchangeable Bobbies who were starting to take over shows like American Bandstand. \"Twenty Flight Rock\" hadn't ended up being a hit at all, despite its placement in a popular film -- they'd left it too long between the film coming out and releasing the record, and he'd lost that momentum.\n\nAt the end of 1957 he'd gone on the Australian tour with Little Richard and Gene Vincent which had led to Richard retiring from rock and roll, and he'd become much closer with Vincent, with whom he'd already struck up a friendship when making The Girl Can't Help It. The two men bonded, particularly, over their love of guns, although they expressed that love in very different ways. Cochran had grown up in rural Minnesota, and had the same love of hunting and fishing that most men of his background did at that time (and that many still do). He was, by all accounts, an affable person, and basically well adjusted.\n\nVincent, on the other hand, was a polite and friendly person when not drinking. Unfortunately, he was in constant pain from his leg wounds, and that meant he was drinking a lot, and when he was drunk he was an incredibly unpleasant, aggressive, person. His love of guns was mostly for threatening people with, and he seems to have latched on to Cochran as someone who could look after him when he got himself into awkward situations -- Cochran was so personally charming that he could defuse the situation when Vincent had behaved appallingly towards someone.\n\nAt the time, Vincent seemed like a has-been and Cochran a never-would-be. This was late 1957, and it seemed like rock and roll records with guitars on were a fad that had already passed their sell-by date. The only white guitarist/vocalist other than Elvis who'd been having hits on a regular basis was Buddy Holly, and his records were doing worse and worse with each release. Vincent hadn't had a real hit since his first single, \"Be Bop A Lula\", while Cochran had made the top twenty with \"Sittin' in the Balcony\", but the highest he'd got after that was number eighty-two. He'd recently recorded a song co-written by George Mottola, who'd written \"Goodnight My Love\", but \"Jeannie, Jeannie, Jeannie\" stalled at number ninety-four when it was released in early 1958:\n\n[Excerpt: Eddie Cochran, \"Jeannie, Jeannie, Jeannie\"]\n\nSo neither man was in a good place at the start of 1958, but they had very different attitudes -- Vincent was depressed and angry, but Cochran knew that something would come along. He was only nineteen, he was astonishingly good looking, he was a great guitarist -- if rock and roll didn't work out, something would.\n\nIn early 1958, Cochran was still hunting for that elusive big hit, as he joined the Blue Caps in the studio, to provide bass, arrangements, and backing vocals on several tracks for Vincent's latest album. It's Cochran singing the bass vocals at the start of \"Git It\", one of Vincent's greatest tracks:\n\n[Excerpt: Gene Vincent and the Blue Caps, \"Git It\"]\n\nBut shortly after that recording, a major turn in Cochran's fortunes came from an unexpected place. Liberty Records had been in financial difficulties, and part of the reason that Cochran's records were unsuccessful was that they just didn't have the money to promote them as much as they'd like. But then at the beginning of April a man called Ross Bagdasarian, under the name David Seville, released a novelty song called \"The Witch Doctor\", featuring some mildly racist comedy and a sped-up voice. That record became a massive hit, selling over a million copies, going to number one, and becoming the fourth most successful record of 1958. Suddenly, Liberty Records was saved from bankruptcy.\n\nThat made all the difference to the success of a track that Cochran had recorded on March the 28th, the same week he recorded those Gene Vincent sessions, and which came out at the tail-end of summer. Cochran had come up with a guitar riff that he liked, but he didn't have any lyrics for it, and his friend and co-writer Jerry Capehart said \"there's never been a blues about the summer\". The two of them came up with some comedy lyrics in the style of the Coasters, who had just started to have big hits, and the result became Cochran's only top ten hit in the US, reaching number eight, and becoming one of the best-remembered tracks of the fifties:\n\n[Excerpt: Eddie Cochran, \"Summertime Blues\"]\n\nThat track was recorded with a minimal number of musicians -- Cochran played all the guitars and sang both vocal parts, his bass player Guybo Smith played the bass part, and the great session drummer Earl Palmer played drums. There was also a fourth person on the record -- Sharon Sheeley, who added handclaps, and who had written the B-side.\n\nSheeley was a talented songwriter who also had a propensity for dating musicians. She'd dated one of the Everly Brothers for a while -- different reports name different brothers, but the consensus seems to be that it was Don -- and then when they'd split up, she'd written a song called \"Poor Little Fool\". She'd then faked having her car break down outside Ricky Nelson's house, and collared him when he came out to help. That sort of thing seemed to happen to Nelson a lot with songwriters -- Johnny and Dorsey Burnette had sold Nelson songs by sitting on his doorstep and refusing to move until he listened to them -- but it seemed to work out very well for him. The Burnettes wrote several hits for him, while Sheeley's \"Poor Little Fool\" became Nelson's first number one, as well as being the first number one ever on Billboard's newly-renamed Hot One Hundred, and the first number one single on any chart to be written by a woman without a male cowriter:\n\n[Excerpt: Ricky Nelson, \"Poor Little Fool\"]\n\nSheeley gets unfairly pigeonholed as a groupie (not that there's anything wrong with being a groupie) because she had relationships with musicians, and at this point she was starting a relationship with Cochran. But it's important to remember that when they got together, even though he was eighteen months older than her, she was the one who had written a number one single, and he was the one whose last record had gone to number ninety-four -- and that after her relationship with Cochran, she went on to form a writing partnership with Jackie DeShannon that produced a long string of hits for people like Brenda Lee and the Fleetwoods, as well as songs that weren't hits but probably deserved to be, like Ral Donner's \"Don't Put Your Heart in His Hands\":\n\n[Excerpt: Ral Donner, \"Don't Put Your Heart in His Hands\"]\n\nSheeley was more invested in her relationship with Cochran than he was, but this has led rock writers to completely dismiss her as \"just Eddie Cochran's girlfriend\", when in terms of their relative statuses in the music industry, it would be more fair to define Cochran as \"just Sharon Sheeley's boyfriend\". I have to emphasise this point, because in the limited number of books about Cochran, you will see a lot of descriptions of her as \"a groupie\", \"a fantasist\", and worse, and very few mentions of the fact that she had a life outside her partner.\n\n\"Summertime Blues\" looked like it was going to be the start of Eddie Cochran's career as a rock and roll star, but in fact it was the peak of it, at least in the US. While the song was a big hit, the follow-up, \"C'mon Everybody\", which was written by Cochran and Capehart to much the same formula, but without the humour that characterised \"Summertime Blues\", didn't do so well:\n\n[Excerpt: Eddie Cochran, \"C'mon Everybody\"]\n\nThat made only number thirty-five on the US charts, and would be Cochran's last top forty record there -- but in the UK, it was a bigger hit than \"Summertime Blues\", reaching number six.\n\n\"C'mon Everybody\" was, though, big enough for Cochran to make some TV appearances. He'd agreed to go on tour with his friends Buddy Holly and Ritchie Valens on a tour called the Winter Dance Party tour, but had bowed out when he got some offers of TV work. He definitely appeared on a show called Town Hall Party broadcast from California on February the second 1959, and according to Sheeley he was booked to appear in New York on the Ed Sullivan Show, which was the reason he'd decided not to do the tour, a few days later.\n\nAs it turned out, Cochran never made that Ed Sullivan Show appearance, as in the early hours of February the third, his friends died in a plane crash. He refused to get on the plane to New York for the show, and instead drove out to the desert in his station wagon to grieve, and from that point on he developed a fear of flying.\n\nThe follow-up to \"C'mon Everybody\", \"Teenage Heaven\", only went to number ninety-nine on the charts, and his next two singles didn't do much better. \"Somethin' Else\", a song that Sheeley had written for him, made number fifty-eight, while his cover version of Ray Charles' \"Hallelujah I Love Her So\" didn't chart at all. 1959 was a depressing year for Cochran personally and professionally.\n\nBut while \"Somethin' Else\" and \"Hallelujah I Love Her So\" were flops in the US, they both made the top thirty in the UK. In the US, guitar-based white rock and roll was now firmly out of fashion, with the audience split between black vocal groups singing R&B and white male solo singers called Bobby singing mid-tempo pop. But in the UK, the image of rock and roll in people's minds was still that of the rockabillies from a couple of years earlier -- while British musical trends would start to move faster than the US by the sixties, in the fifties they lagged a long way behind.\n\nAnd in particular, Cochran's friend Gene Vincent was doing much better in Britain than in the US.\n\nVery few US performers had toured the UK, and with the exception of Buddy Holly, most of those who had were not particularly impressive. Because of an agreement between the two countries' musicians' unions, it was difficult for musicians to perform in one country if they were from the other.\n\nIt wasn't quite so difficult for solo performers, who could be backed by local musicians and were covered under a different agreement, but Lew and Leslie Grade, who had a virtual monopoly on the UK entertainment business, had had a very bad experience with Jerry Lee Lewis when his marriage to his teenage cousin had caused his UK tour to be cancelled, and anyway, Britain was an unimportant market a long way away from America, so why would Americans come all that way? For most of 1959, the closest thing to American rock and roll stars touring the UK were Connie Francis and Paul Anka, neither of whom screamed rock and roll rebellion. American rockers just didn't come to the UK.\n\nUnless they had nowhere else to go, that is -- and Gene Vincent had nowhere else to go. In the US, he was a washed-up has been who'd burned every single bridge, but in the UK he was an American Rock Star. In late 1959 he released a not-great single, \"Wildcat\":\n\n[Excerpt: Gene Vincent, \"Wildcat\"]\n\nThat single wasn't doing particularly well, but then Larry Parnes and Jack Good hatched a plan. Good had a new TV show, \"Boy Meets Girls\", based around one of Parnes' artists, Marty Wilde, and also had a column in Disc magazine. They'd get an American rock star over to the UK, Parnes would stick him on a bill with a bunch of Parnes' acts, Good would put him on the TV show and promote him in Disc magazine, and the tour and TV show would split the costs.\n\nWilde was, at the time, about to go into a career slump. He'd just got married, and he and his wife were trying for their first kid -- they'd decided that if it was a girl, they were going to call her Kim. It seemed likely they were going to lose his audience of teenage girls, as he was no longer available, and so Larry Parnes was trying to move him from rock and roll into musical styles that would be more suitable for adults, so his latest single was a ballad, \"Bad Boy\":\n\n[Excerpt: Marty Wilde, \"Bad Boy\"]\n\nThat meant that Wilde's band, the Wildcats, made up at this point of Tony Belcher, Big Jim Sullivan, Licorice Locking and Brian Bennett, were no longer going to be suitable to back Wilde, as they were all rock and rollers, so they'd be fine for whichever rock star they could persuade over to the UK.\n\nVincent was the only rock star available, and his latest single was even called \"Wildcat\". That made him perfect for Parnes' purposes, though Vincent was slightly nervous about using British musicians -- he simply didn't think that British musicians would be any good.\n\nAs it turned out, Vincent had nothing to worry about on that score at least. When he got to the studios in Didsbury, in Manchester, where Boy Meets Girls was filmed, he met some of the best session musicians Britain had to offer. The house band for the show, the Flying Squad, was a smaller version of the bands that had appeared on Good's earlier shows, a nine-piece group that included organist Cherry Wainer and session drummer Andy White, and was led by Joe Brown.\n\nBrown was a Larry Parnes artist, who at this point had released one rather uninspired single, the country-flavoured \"People Gotta Talk\":\n\n[Excerpt: Joe Brown, \"People Gotta Talk\"]\n\nBut Brown had an independent streak, which could be seen just from his name -- Larry Parnes had tried to change it, as he did with all his acts, but Brown had flat-out refused to be called Elmer Twitch, the name Parnes had chosen for him. He insisted on keeping his own name, and it was under that name that he became one of Britain's most respected guitarists.\n\nVincent, amazingly, found these British musicians to be every bit as good as any musicians he'd worked with in the USA. But that was about all that he liked about the UK -- you couldn't get a hamburger or a pizza anywhere in the whole country, and the TV was only in black and white, and it finished at 11PM. For someone like Vincent, who liked to stay up all night watching old monster movies on TV, that was completely unacceptable. Luckily for him, at least he had his gun and knife to keep him occupied -- he'd strapped them both to the leg iron he used for his damaged leg, so they wouldn't set off the metal detectors coming into the country.\n\nBut whatever his thoughts about the country as a whole, he couldn't help loving the audience reaction. Jack Good knew how to present a rock and roll star to an audience, and he'd moved Vincent out of the slacks and sweater vests and blue caps into the kind of leather that he'd already had Vince Taylor wear. He got Vincent to emphasise his limp, and to look pained at all times. He was imagining Vincent as something along the lines of Richard III, and wanted him to appear as dangerous as possible.\n\nHe used all the tricks of stagecraft that he'd used on Taylor, but with the added advantage that Vincent had a remarkable voice, unlike Taylor. Sadly, as is the case with almost all of the British TV of the period, the videotapes of the performances have long since been wiped, but we have poor-quality audio that demonstrates both how good Vincent was sounding and how well the British musicians were able to adapt to backing him:\n\n[Excerpt: Gene Vincent, \"Summertime\", live on Boy Meets Girls]\n\nAfter making three appearances on Boy Meets Girls, Vincent was put on tour backed by the Wildcats, on a bill with acts like Wee Willie Harris and the Bachelors (the ones who recorded for Parlophone, not the later act of the same name), and \"Wildcat\" started going up the charts.\n\nEven though Gene Vincent hadn't had a hit in three years, he was a massive success with the British audiences, and as a result Parnes and Good decided that it might be an idea if they got another American star over here, and the obvious choice was Eddie Cochran. Cochran had the same agent as Vincent, and so there was a working relationship there; they both knew each other and so Vincent could help persuade Cochran over; and Cochran had had a string of top thirty hits in the UK, but was commercially dead in the US.\n\nIt was tempting for Cochran, too -- as well as the obvious advantage of playing to people who were actually buying his record, the geography of Britain appealed. He'd been terrified of flying since Buddy Holly and Ritchie Valens had died, but the British tour would only involve the transatlantic flight -- all the travel once he was in the UK would be by road or rail. Before he came over, he had to record his next single, to be released while he was over in the UK.\n\nSo on January the 8th, 1960, Eddie Cochran went into Gold Star Studios with his normal bass player, Guybo, and with his friends Sonny Curtis and Jerry Allison, the guitarist and drummer of the Crickets, and they cut what turned out to be his last single, \"Three Steps to Heaven\":\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nTwo days later, he was in Britain, for the start of what was the biggest rock and roll tour in British history to that point -- a hundred and eight live appearances, plus several TV and radio appearances, in a little over three months, playing two shows a night most nights. Parnes felt he had to work them hard to justify their fees -- Vincent was getting $2500 a week, and Cochran $1000, while for example Billy Fury, at that point the biggest of Parnes' acts, was on a salary of twenty pounds a week.\n\nWhile Vincent had made a great impression largely despite himself, Cochran was a different matter. Everyone seemed to love him. Unlike Vincent, he was a musician's musician, and he formed close friendships with the players on the tour. Joe Brown, for example, remembers Cochran explaining to him that if you swap the G string on your guitar for a second B string, tuned down to G, you could bend a note a full tone -- Brown used that trick to make himself one of the most sought-after session players in the UK before his own pop career started to take off.\n\nIt was also apparent that while Jack Good had had to create a stage act for Gene Vincent, he didn't have to do anything to make Cochran look good in front of the cameras. Marty Wilde said of him \"The first thing I noticed about Eddie was his complexion. We British lads had acne and all the usual problems, and Eddie walked in with the most beautiful hair and the most beautiful skin - his skin was a light brown, beautiful colour, all that California sunshine, and I thought 'you lucky devil'. We had Manchester white all over us. And he had the most beautiful face -- the photographs never did the guy justice\".\n\nFrom the moment Cochran started his set in Ipswich, by saying \"It's great to be here in Hipswich\" and wiggling his hips, he was utterly in command of the British audiences.\n\nThankfully, because they did so many TV and radio sessions while they were over here, we have some idea of what these shows sounded like -- and from the recordings, even when they were in the antiseptic environment of a BBC recording studio, without an audience, they still sounded fantastic. On some shows, Cochran would start with his back to the audience, the band would start playing \"Somethin' Else\", the song that Sharon Sheeley had written for him that had been a minor hit, and he'd whirl round and face the audience on the opening line, \"Well look-a there!\"\n\n[Excerpt: Eddie Cochran and Gene Vincent, \"Somethin' Else [Eddie Cochran vocals]\", Saturday Club version]\n\nThe shows all had a number of acts on, all of them other than the stars Larry Parnes acts, and because there were so many shows, acts would get rotated in and out as the tour went on. But some of those who played on many dates were Vince Eager, who had named himself after Gene Vincent but quickly grew more attached to Eddie Cochran, who he started to regard as his best friend as the tour went on, Tony Sheridan, who was building a solo career after leaving the Oh Boy! band, Georgie Fame, who was already more interested in being a jazz and R&B pianist in the mould of Mose Allison than he was in being a pop star, Johnny Gentle, a Liverpudlian performer who never rose to massive success, and Billy Fury, by far the most talented of Parnes' acts. Fury was another Liverpudlian, who looked enough like Cochran that they could be brothers, and who had a top ten hit at the time with \"Collette\", one of many hits he wrote for himself:\n\n[Excerpt: Billy Fury, \"Collette\"]\n\nFury was something of a sex symbol, aided by the fact that he would stuff his pants with the cardboard tube from a toilet roll before going on stage. This would lead the girls to scream at him -- but would also lead their violent boyfriends to try to bottle him off stage, which meant he had more reason than most to have stagefright. Cochran would joke with Fury, and try to put him at ease -- one story has him telling a nervous Fury, about to go on stage, to just say to himself \"I am the greatest performer in the world\". Fury repeated back \"I am the greatest performer in the world\", and Cochran replied, \"No you're not -- I am!\"\n\nThis kind of joking led to Cochran becoming immensely popular among all the musicians on the tour, and to him once again falling into his old role of protecting Gene Vincent from the consequences of his own actions, when Vincent would do things like cut up a suit belonging to one of the road managers, while the road manager was inside it.\n\nWhile Vincent was the headliner, Cochran was clearly the one who impressed the British audiences the most. We have some stories from people who saw the tour, and they all focus on Eddie. Particularly notable is the tour's residency in Liverpool, during which time Cochran was opening his set with his version of \"What'd I Say\":\n\n[Excerpt: Gene Vincent and Eddie Cochran, \"What'd I Say [Eddie Cochran vocals]\", Saturday Club version]\n\nWe have this report of Cochran's performance in Liverpool:\n\n\"Eddie blew me away. He had his unwound 3rd string, looked good and sang good and he was really getting to be a good guitarist… One moment will always represent Eddie to me. He finished a tune, the crowd stopped screaming and clapping, and he stepped up to the mike and before he said something he put both his hands back, pushed his hair back, and some girl, a single voice in the audience, she went ‘Eddie!’ and he said ‘Hi honey!’… I thought, ‘Yes! That’s it – rock ’n’ roll!’\"\n\nThat's a quote from George Harrison in the early 1990s. He'd gone to see the show with a friend, John Lennon -- it was Lennon's first ever rock and roll gig as an audience member, and one of a very small number he ever attended. Lennon never particularly enjoyed seeing live shows -- he preferred records -- but even he couldn't resist seeing Eddie Cochran and Gene Vincent on the same bill.\n\nThe Liverpool shows were massive successes, despite both American rockers being increasingly bored and turning more and more to drink as a result. Apparently the two would drink a bottle of bourbon between them before going on stage, and at one Liverpool show Cochran had to hold on to a mic stand to keep himself upright for the first two songs, before he sobered up enough to let go.\n\nThe shows were successful enough that a local promoter, Allan Williams, asked if he could book Cochran and Vincent for another show, and Larry Parnes said yes -- after Liverpool, they had to play Newcastle, Manchester, London, and Bristol, taking up another month, and then Eddie Cochran was going to be going back to the US for a couple of weeks, but he could pencil them in for six weeks' time, when Cochran was going to come back.\n\nIt's quite surprising that Cochran agreed to come back, because he was getting thoroughly sick of the UK. He'd asked Sharon Sheeley to fly over and join him, but other than her and Vincent he had nothing of home with him, and he liked sunshine, fast food, cold beer, and all-night TV, and hated everything about the British winter, which was far darker and wetter than anything he'd experienced.\n\nBut on the other hand, he was enjoying making music with these British people. There's a great recording of Cochran, Vincent, Billy Fury, and Joe Brown jamming on the Willie Dixon blues song \"My Babe\" on \"Boy Meets Girls\":\n\n[Excerpt: Eddie Cochran, Gene Vincent, Billy Fury, Joe Brown, “My Babe”]\n\nBut by the time the tour ended in Bristol, Eddie was very keen to get back. He was going to be bringing Vince Eager over to America to record, and arranged to meet him in London in the early hours of Easter Sunday. They were going to be taking the lunchtime plane from what was then London Airport but is now Heathrow.\n\nBut there was a problem with getting there on time. There were very few trains between Bristol and London, and they'd have to get a car from the train station to the airport. But that Easter Sunday was the day of the annual Aldermaston March against nuclear weapons. These were massive marches which were big enough that they spawned compilation albums of songs to sing on the march, like Ewan MacColl and Peggy Seeger's \"Brother Won't You Join the Line\":\n\n[Excerpt: Ewan MacColl and Peggy Seeger, \"Brother Won't You Join the Line?\"]\n\nBut the main effect the march was having on Cochran and Vincent was that it meant that to be sure of catching their plane, they would have to travel overnight by car. At first, they asked one of the other artists on the tour, Johnny Gentle, if they could go in his car, but he already had a carful, so they ended up getting a local driver, named George Martin (not the one at Parlophone Records) to drive them overnight. They got into the back seat of the car -- Cochran sitting between Vincent and Sheeley, as Sheeley couldn't stand Vincent.\n\nVincent took a sleeping pill and went to sleep almost immediately, but Sheeley and Cochran were in a good mood, singing \"California Here We Come\" together, when Martin took a turn too fast and hit a lamppost. Vincent and Sheeley suffered major injuries and had to spend time in hospital. Cochran died.\n\nA short while later, Johnny Gentle's car made its way onward towards London, and ran out of fuel. As all-night garages weren't a thing in Britain then, they flagged down a policeman who told them there'd been a crash, and they could see if the breakdown vehicle would let them siphon petrol from the wrecked car. They did, and it was only the next day they realised which car it was they'd taken the fuel from. One of the police at the scene – maybe even that one – was a cadet who would later change his name to Dave Dee, and become the lead singer in Dave Dee, Dozy, Beaky, Mick and Titch.\n\nAs soon as the news got out about Cochran's death, \"Three Steps to Heaven\", which had come out in the US, but not yet in the UK, was rush-released:\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nIt went to number one, and became Cochran's biggest hit.\n\nLarry Parnes didn't see why Cochran's death should put a crimp in his plans, and so he immediately started promoting the shows for which Vincent and Cochran had been booked, calling them Eddie Cochran Tribute Shows, and talking to the press about how ironic it was that Cochran's last song was \"Three Steps to Heaven\". Vince Eager was so disgusted with Parnes that he never worked with him again.\n\nBut those shows turned out to have a much bigger impact than anyone could have imagined. Allan Williams was worried that without Cochran, the show he'd got booked in Liverpool wouldn't get enough of a crowd, so he booked in a number of local bands -- Rory Storm and the Hurricanes, Cass and the Cassanovas, Nero and the Gladiators, and Gerry and the Pacemakers -- to fill out the bill. This led to all the bands and musicians in Liverpool realising, for the first time, how much talent there was in the city and how many bands there were. That one show changed Liverpool from a town where there were a few bands to a town with a music scene, and May the third 1960 can be pointed to as the day that Merseybeat started.\n\nParnes was impressed enough by the local groups that he decided that Liverpool might be a good place to look for musicians to back his singers on the road. And we'll pick up on what happened then in a few months.\n\nSharon Sheeley, once she'd recovered from her injuries, went on to write hits for Brenda Lee, Jackie DeShannon, the Fleetwoods, and Irma Thomas, and when Jack Good moved back to the US, she renewed her acquaintance with him, and together with Sheeley's husband they created Shindig, the most important American music show of the sixties. But by the time she died in 2002, all her obituaries talked about was that she'd been Eddie Cochran's girlfriend.\n\nAnd as for Gene Vincent, he was already in chronic pain, suffering mood swings, and drinking too much before the accident hospitalised him. After that, all those things intensified. He became increasingly unreliable, and the hits dried up even in Britain by mid-1961. He made some good music in the sixties, but almost nobody was listening any more, and an attempted comeback was cut short when he died, aged thirty-six, in 1971, from illnesses caused by his alcoholism.\n\nDespite their tragic deaths, Vincent and Cochran, on that 1960 UK tour, almost accidentally catalysed a revolution in British music, and the changes from that will reverberate throughout the rest of this story.",
  "enclosure": "",
  "itunes:summary": "Episode eighty-five of A History of Rock Music in Five Hundred Songs looks at \"Three Steps to Heaven\" by Eddie Cochran, and at the British tour which changed music and ended his life. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode, on \"Quarter to Three\" by Gary US Bonds.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\n\nMuch of the information here comes from Spencer Leigh's book Things Do Go Wrong, which looks specifically at the 1960 tour.\n\nI also used Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries by John Collis.\n\nWhile there are dozens of compilations of Cochran's music available, many of them are flawed in one way or another (including the Real Gone Music four-CD set, which is what I would normally recommend). This one is probably the best you can get for Cochran novices.\n\nThis CD contains the Saturday Club recordings by Vincent and Cochran, which are well worth listening to.\n\nPete Frame's The Restless Generation is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\n\nAnd a fair chunk of the background information here also comes from the extended edition of Mark Lewisohn's Tune In, which is essential reading for anyone who is interested in the Beatles, British post-war culture, and British post-war music.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThere's been a sad running theme in the episodes in recent months of rock stars dying in accidents. Sadly, in the 1950s and sixties, travelling long distances was even more dangerous than it is today, and rock musicians, who had to travel a lot more than most people, and did much of that travelling at night, were more likely to be in accidents than most. Today, we're going to look at yet another of these tragic deaths, of someone who is thought of in the US as being something of a one-hit wonder, but who had a much bigger effect on British music. We're going to look at what would be Eddie Cochran's final tour, and at his UK number one single \"Three Steps to Heaven\":\n\n[Excerpt: Eddie Cochran, \"Three Steps to Heaven\"]\n\nWhen we left Eddie Cochran, he had just appeared in the film \"The Girl Can't Help It\", singing \"Twenty Flight Rock\", and he had also had a hit with \"Sittin' in the Balcony\". But he hadn't yet managed to establish himself as the star he knew he could be -- he was the whole package, singer, songwriter, and especially guitarist, and he hadn't yet made a record that showed him to his best advantage as an artist. \"Twenty Flight Rock\" had come close, but it wasn't a song he'd written himself, and the record hadn't yet been released in the US.\n\nMeanwhile, Liberty Records seemed to not understand what they had in him -- they were trying to push him to be another Pat Boone, and become a bland pop singer with no rock and roll in his sound. His first album, Singin' to My Baby, had little to do with the music that he was interested in playing.\n\nSo Cochran needed to find something that would really put him on the map -- a song that would mean he wasn't just one of dozens of Fabians and Frankie Avalons and interchangeable Bobbies who were starting to take over shows like American Bandstand. \"Twenty Flight Rock\" hadn't ended up being a hit at all, despite its placement in a popular film -- they'd left it too long between the film coming out and relea",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-five of A History of Rock Music in Five Hundred Songs looks at \"Three Steps to Heaven\" by Eddie Cochran, and at the British tour which changed music and ended his life. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode, on \"Quarter to Three\" by Gary US Bonds.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I have put together a Mixcloud mix with every song excerpted in this podcast.\n\nMuch of the information here comes from Spencer Leigh's book Things Do Go Wrong, which looks specifically at the 1960 tour.\n\nI also used Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries by John Collis.\n\nWhile there are dozens of compilations of Cochran's music available, many o",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}