{
  "id": "yt:video:Dh284bcMP9U",
  "yt:videoId": "Dh284bcMP9U",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Karen MacNeil | The Wine Bible: 3rd Edition | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-11-01T16:00:08+00:00",
  "updated": "2022-11-02T19:02:28+00:00",
  "media:group": {
    "media:title": "Karen MacNeil | The Wine Bible: 3rd Edition | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Award-winning wine expert Karen MacNeil discusses her upcoming book \"The Wine Bible: 3rd Edition\", which offers the ultimate education in wine and expanded content including: new chapters on Great Britain, Croatia, and Israel; updated chapters on France, Italy, Australia, South America, and the United States; a new chapter on wine in the Ancient World; food sections for all the major wine regions, with explanations of historic food and wine pairings for those regions; and more.\n\n\"The Wine Bible\" has long been the most enlightening, comprehensive, and entertaining wine guide on the market. Karen is considered one of only a handful of experts with a global command of wine. The book brims with Karen’s knowledge and passion for the subject while artful, evocative descriptions bring each wine to life. Transporting you from the cool, emerald green hills of Oregon’s Willamette Valley to the warm shores of the Mediterranean, she delves into the history, food, wineries, and flavors of each region.\n\nKaren MacNeil is the only American to have won every major wine award given in the English language. In a full-page profile on her, Time magazine called Karen, “America’s Missionary of the Vine.” She is the author of the award-winning book The Wine Bible, the single bestselling wine book in the United States and is the creator and editor of WineSpeed, the top digital newsletter in wine in the United States. The former wine correspondent for The Today Show on NBC, Karen was also the host of the PBS series Wine, Food & Friends with Karen MacNeil, for which she won an Emmy. Karen is also the creator and Chairman Emeritus of the Rudd Center for Professional Wine Studies at the Culinary Institute of America, which has been called the “Harvard of wine education.” \n\nModerated by Nick Setterberg.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}