{
  "title": "French National Rally party names new leader",
  "link": "https://www.rt.com/news/566004-national-rally-bardella-replace-lepen/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566004-national-rally-bardella-replace-lepen/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636679d4203027644450cf9e.jpeg\" /> France’s National Rally party has elected Jordan Bardella as president, replacing its standard-bearer Marine Le Pen <br/><a href=\"https://www.rt.com/news/566004-national-rally-bardella-replace-lepen/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Jordan Bardella becomes the first head of the right-wing movement who is not from the Le Pen family</strong></p>\n            \n                        \n            <p>The French right-wing National Rally party has elected Jordan Bardella as president on a permanent basis, replacing Marine Le Pen, its long-time leader. The 27-year-old MEP won 85% of the vote, the party announced on Saturday at its congress in Paris.&nbsp;</p>\n<p>Bardella is the first National Rally president not to hail from the Le Pen family. He had served as acting president since July 2021, having taken over so that Le Pen could concentrate on her ultimately unsuccessful presidential campaign.</p>\n<p>Bardella handily beat out rival Louis Aliot, mayor of Perpignan, who at 53 is almost twice his age, and who will remain Vice President of the party.</p>\n<p>Involved with right-wing politics since he was a teenager, Bardella has presented himself as a &ldquo;<em>continuity candidate</em>,&rdquo; telling AFP that he looked forward to &ldquo;<em>building on the incredible legacy that Marine is handing over.</em>&rdquo;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.09/thumbnail/632784be2030274413657870.jpg\" alt=\"Marine Le Pen speaks in Adge, France, on September 18, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/563060-energy-crisis-idiot-greens/\">‘Idiot’ Greens made EU dependent on Russian energy – Le Pen</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>In April&rsquo;s national election, Le Pen&nbsp;brought a National Rally candidate&nbsp;closer to the presidency than ever before, netting 41.5% of the vote against incumbent Emmanuel Macron&rsquo;s 58.6% in a run-off.</p>\n<p>The party won a record 89 seats in the lower House of Parliament two months later, ten times its previous showing and toppling Macron&rsquo;s Renaissance party's majority.</p>\n<p>Le Pen reassured the party congress she was &ldquo;<em>not leaving [the party] to take a holiday</em>,&rdquo; pledging to be &ldquo;<em>where the country needs me</em>,&rdquo; after Bardella&rsquo;s victory was announced. She is expected to make a fourth attempt at the Elysee Palace in 2027.</p>\n<p>Since taking over from her father Jean-Marie Le Pen, who co-founded the party as Front National 50 years ago, Le Pen has presided over a comprehensive party makeover, changing the group&rsquo;s name to dispel some of the more controversial associations with the elder Le Pen&rsquo;s politics and to attract younger members.</p>\n<p>National Rally&rsquo;s detractors nevertheless accuse its members of harboring racist and antisemitic sentiments, and even its vice president Aliot has argued the party should further soften its message to appeal to the mainstream right.&nbsp;</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 14:59:00 +0000",
  "dc:creator": "RT"
}