{
  "guid": "3daa77d4e8f6037bc200caa7e8596467",
  "title": "The Orbiting Human Circus (of the Air): Season One, Episode 3",
  "pubDate": "Wed, 09 Nov 2016 05:00:00 -0000",
  "link": "https://beta.prx.org/stories/229619",
  "description": "<p>Will the famed storytelling cricket (Tim Robbins) return? Plus, Charlie Day and Mary Elizabeth Ellis perform Shakespeare as you’ve never heard it and the janitor pushes host John Cameron to the very brink.</p>\n\n<p>Thanks to Rocket Mortgage by Quicken Loans and HelloFresh for supporting our podcast! Go to <a href=\"http://www.HelloFresh.com\" rel=\"nofollow\" target=\"_blank\">HelloFresh.com</a> and use the code OHC to get $35 off your first week of deliveries, and check out Rocket Mortgage at <a href=\"http://www.QuickenLoans.com/OHC\" rel=\"nofollow\" target=\"_blank\">QuickenLoans.com/OHC</a>.</p>\n\n<p>In November 2016, the janitor will be cleaning a venue near you! Upcoming tour dates: <a href=\"http://www.orbitinghumancircus.com\" rel=\"nofollow\" target=\"_blank\">www.orbitinghumancircus.com</a></p>\n\n<p>Featuring John Cameron Mitchell as Mr. Cameron, Julian Koster as the Janitor, and Drew Callander as the Narrator, with Tim Robbins as the Cricket, Charlie Day as Macbeth, and Mary Elizabeth Ellis and Lady Macbeth, and the Alicia Svigals Klezmer Ensemble featuring the late Evan Harlan (Julian's uncle) on accordion and North the Singing Saw.</p>\n\n<p>Written and created by Julian Koster. Co-directed by and developed with Ellie Heyman. Produced by Christy Gressman. Featuring musical composition and arrangement by Thomas Hughes and music by The Music Tapes.</p>\n\n<p>Full credits: <a href=\"http://www.orbitinghumancircus.com\" rel=\"nofollow\" target=\"_blank\">www.orbitinghumancircus.com</a></p>\n\n<p>Part of the Night Vale Presents network: <a href=\"http://www.nightvalepresents.com\" rel=\"nofollow\" target=\"_blank\">www.nightvalepresents.com</a></p>\n\n<p> </p>\n\n<p> </p>\n\n<p> </p>",
  "enclosure": "",
  "itunes:subtitle": "Will the famed storytelling cricket (Tim Robbins) return? Plus, Charlie Day and Mary Elizabeth Ellis perform Shakespeare as you’ve never heard it and the janitor pushes host John Cameron to the very brink. Thanks to Rocket Mortgage by Quicken Loans...",
  "itunes:episodeType": "full",
  "itunes:duration": "27:39"
}