{
  "id": "https://bibleinoneyear.org/en/youth/191",
  "title": "Day 191: Invisible but Invaluable",
  "description": "Psalm 83:18, 2 Kings 19:14–19, Acts 28:1–9.  Intercession was also made by kings, for example, David, Solomon, and Hezekiah  You, too, are called to this invisible but invaluable ministry",
  "pubDate": "Sun, 10 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/191/",
  "itunes:duration": "13:56",
  "guid": "enyouth10072022-191",
  "length": 836.6,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 191: Invisible but Invaluable",
  "itunes:subtitle": "Psalm 83:18, 2 Kings 19:14–19, Acts 28:1–9.  Intercession was also made by kings, for example, David, Solomon, and Hezekiah  You, too, are called to this invisible but invaluable ministry",
  "itunes:summary": "Every Monday morning, he phones our offices. He asks about the events and services taking place during the week, and the people involved in them. For decades, Charles and his prayer group have faithfully supported the church in prayer. They are examples of many in our church who intercede for us. Their prayers may be invisible but they are also invaluable.\nThe word ‘intercession’ generally means praying for someone else (although, it can also be used of praying for oneself). We are all called to intercession. The apostle Paul writes to Timothy, ‘I urge, then, first of all, that requests, prayers, intercession and thanksgiving be made for everyone – for kings and all those in authority’ (1 Timothy 2:1–2).\nJesus is the great intercessor. He ‘made intercession for the transgressors’ (Isaiah 53:12). He ‘is at the right hand of God and is also interceding for us’ (Romans 8:34; see also Hebrews 7:25). The Holy Spirit also intercedes for us and through us: ‘The Spirit himself intercedes for us with groans that words cannot express… the Spirit intercedes for the saints in accordance with God’s will’ (Romans 8:26–27).\nIn the Old Testament passage for today, we see Isaiah’s role as an intercessor. Interceding for others is part of the role of a prophet. Intercession was also made by kings, for example, David, Solomon, and Hezekiah. You, too, are called to this invisible but invaluable ministry.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 556
}