{
  "title": "84: The Disappearance of Maura Murray Part 1",
  "link": "https://audioboom.com/posts/7253355",
  "itunes:episode": 84,
  "itunes:title": "The Disappearance of Maura Murray Part 1",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3180,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>This episode covers episodes 1 - 3 of the Oxygen series.</p>\n\n\n<p><strong>It's the most famous--and most obsessed over--missing person's case of our time: </strong></p>\n\n\n<p>On February 9, 2004, Maura Murray, a promising young nursing student, left her college dorm, emptied her bank account, and drove to a remote New Hampshire town where she didn't know a soul. Just after 7pm, her car crashed into a tree. A witness spoke to her, offering help, which she refused. And then she vanished into thin air. Nobody has seen or heard from her since.  Everybody has a theory: The family knows more than they're saying, the police botched the case and are covering it up, Maura fled her life and started over in Canada. This documentary series attempts to solve the mystery. </p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> <strong>WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon fam</a> and instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW!</strong> Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase\"</strong> and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a></p>\n\n\n<p><a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong></a> Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <strong>All ticket holders are welcome to join Patrick on a tour of the West Village on the morning of the show!</strong> He'll show you all the spots from the gay liberation movement, old New York movies, and even Sex and the City--all within a few blocks! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets to the Pride Show here!   </a></p>\n\n\n<p><strong>To learn about our sponsors AND GET THOSE PROMO CODES, <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click here!</a></strong>  </p>\n",
  "pubDate": "Tue, 07 May 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-05-07:/posts/7253355",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}