{
  "title": "Ghost In The Machine",
  "link": "https://malicious.life/episode-1/",
  "pubDate": "Wed, 28 Jun 2017 07:01:06 +0000",
  "guid": "http://mlife.podbean.com/e/ml-ep-1/",
  "comments": "https://malicious.life/episode-1/#respond",
  "wfw:commentRss": "https://malicious.life/episode-1/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "Cybercrime is one of the most notable threats we face as computer users, nowadays. But it wasn’t always so. Those of us who’ve been in the field long enough may remember a time when computer viruses were much more innocent, and virus authors were usually just bored computer geeks- not members of a sophisticated, well-organized […]",
  "content:encoded": "<p><span style=\"font-weight: 400;\">Cybercrime is one of the most notable threats we face as computer users, nowadays. But it wasn’t always so. Those of us who’ve been in the field long enough may remember a time when computer viruses were much more innocent, and virus authors were usually just bored computer geeks- not members of a sophisticated, well-organized crime syndicate. Join us in exploring the world of early viruses, the precursors to the types of malware we know all too well today. With special guest: Graham Cluley.</span></p>\n",
  "enclosure": "",
  "itunes:subtitle": "Cybercrime is one of the most notable threats we face as computer users, nowadays. But it wasn’t always so. Those of us who’ve been in the field long enough may remember a time when computer viruses were much more innocent,",
  "itunes:summary": "Cybercrime is one of the most notable threats we face as computer users, nowadays. But it wasn’t always so. Those of us who’ve been in the field long enough may remember a time when computer viruses were much more innocent, and virus authors were usually just bored computer geeks- not members of a sophisticated, well-organized […]",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:explicit": "clean",
  "itunes:duration": "26:09"
}