{
  "title": "Episode 78: The Psychology of Tipping",
  "pubDate": "Tue, 11 Nov 2008 03:43:51 +0000",
  "guid": "episode-78-the-psychology-of-tipping",
  "link": "http://www.thepsychfiles.com/2008/11/10/episode-78-the-psychology-of-tipping/",
  "itunes:image": "",
  "description": "How can a waiter increase his tips?  Would you believe that psychologists have devoted a great deal of research to this question?  We've looked at the effect of smiley faces, touching, telling jokes, giving customers a fun task to do, drawing suns (yes, suns) on checks and many others.  Join me as we take a look at what waiters and waitresses can do to increase the amount of the tip their customers give them.",
  "content:encoded": "How can a waiter increase his tips?  Would you believe that psychologists have devoted a great deal of research to this question?  We've looked at the effect of smiley faces, touching, telling jokes, giving customers a fun task to do, drawing suns (yes, suns) on checks and many others.  Join me as we take a look at what waiters and waitresses can do to increase the amount of the tip their customers give them.",
  "enclosure": "",
  "itunes:duration": "34:58",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,psych,lecture",
  "itunes:subtitle": "How can a waiter increase his tips? Would you believe that psychologists have devoted a great deal of research to this question? Join me as we take a look at what waiters and waitresses can do to increase the amount of the tip their customers give them.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "How can a waiter increase his tips? Would you believe that psychologists have devoted a great deal of research to this question? We've looked at the effect of smiley faces, touching, telling jokes, giving customers a fun task to do, drawing suns (yes, suns) on checks and many others. Join me as we take a look at what waiters and waitresses can do to increase the amount of the tip their customers give them."
}