{
  "title": "Fernando Ramos Arenas (coordinador), \"Una cultura cinematográfica en transición, España 1970-1986\" (Tirant lo Blanch, 2021)",
  "description": "En esta entrevista conversamos con Fernando Ramos Arenas, Laura Caballero Ruiz de Martín-Esteban, John D. Sanderson y Pablo la Parra Pérez sobre el volumen en que han colaborado junto con otras/os investigadoras/es. ﻿Una cultura cinematográfica en Transición es un acercamiento al cine del tardofranquismo y de los primeros años de la democracia que se enfoca en los cambios de la cultura cinematográfica, es decir, en las instituciones, prácticas y discursos que acompañaron a las películas y sin los cuales estas no fueron posibles. En torno a una doble transición del país (de la dictadura a la democracia) y del cine (cambios tecnológicos y de formas de consumo, el agotamiento del proyecto de las nuevas olas acompañado de la vuelta del Hollywood más popular, la pérdida de relevancia de los referentes de una cinefilia clásica, etc.) el libro plantea un relato polifónico convencido de que la historia del cine es más que la historia de sus películas. Es también la historia de su recepción, de los discursos y cambios institucionales que acompañaron su consumo, lo mantuvieron vivo y ayudaron a repensarlo en las conversaciones o en las prácticas sociales generadas en torno a las salas, festivales o en las actividades de los cineastas amateurs. Este tratamiento de una de las épocas más interesantes de nuestra historia reciente hace de esta publicación una obra de consulta obligada para estudiantes e investigadores interesados en la Historia del Cine y del Arte, los Estudios Culturales y la Historia Cultural de España.\nEntrevista por Mercedes Ontoria Peña, profesora en el programa internacional de Endicott College en Madrid y en la Universidad de Nebrija, España.",
  "pubDate": "Mon, 04 Apr 2022 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 7,
  "itunes:author": "New Books Network",
  "itunes:subtitle": "Una entrevista con Fernando Ramos Arenas, Laura Caballero Ruiz de Martín-Esteban, John D. Sanderson y Pablo la Parra Pérez",
  "itunes:summary": "En esta entrevista conversamos con Fernando Ramos Arenas, Laura Caballero Ruiz de Martín-Esteban, John D. Sanderson y Pablo la Parra Pérez sobre el volumen en que han colaborado junto con otras/os investigadoras/es. ﻿Una cultura cinematográfica en Transición es un acercamiento al cine del tardofranquismo y de los primeros años de la democracia que se enfoca en los cambios de la cultura cinematográfica, es decir, en las instituciones, prácticas y discursos que acompañaron a las películas y sin los cuales estas no fueron posibles. En torno a una doble transición del país (de la dictadura a la democracia) y del cine (cambios tecnológicos y de formas de consumo, el agotamiento del proyecto de las nuevas olas acompañado de la vuelta del Hollywood más popular, la pérdida de relevancia de los referentes de una cinefilia clásica, etc.) el libro plantea un relato polifónico convencido de que la historia del cine es más que la historia de sus películas. Es también la historia de su recepción, de los discursos y cambios institucionales que acompañaron su consumo, lo mantuvieron vivo y ayudaron a repensarlo en las conversaciones o en las prácticas sociales generadas en torno a las salas, festivales o en las actividades de los cineastas amateurs. Este tratamiento de una de las épocas más interesantes de nuestra historia reciente hace de esta publicación una obra de consulta obligada para estudiantes e investigadores interesados en la Historia del Cine y del Arte, los Estudios Culturales y la Historia Cultural de España.\nEntrevista por Mercedes Ontoria Peña, profesora en el programa internacional de Endicott College en Madrid y en la Universidad de Nebrija, España.",
  "content:encoded": "<p>En esta entrevista conversamos con Fernando Ramos Arenas, Laura Caballero Ruiz de Martín-Esteban, John D. Sanderson y Pablo la Parra Pérez sobre el volumen en que han colaborado junto con otras/os investigadoras/es. <a href=\"https://editorial.tirant.com/mex/libro/una-cultura-cinematografica-en-transicion-espana-1970-1986-fernando-ramos-arenas-9788418614941\">﻿<em>Una cultura cinematográfica en Transición</em></a> es un acercamiento al cine del tardofranquismo y de los primeros años de la democracia que se enfoca en los cambios de la cultura cinematográfica, es decir, en las instituciones, prácticas y discursos que acompañaron a las películas y sin los cuales estas no fueron posibles. En torno a una doble transición del país (de la dictadura a la democracia) y del cine (cambios tecnológicos y de formas de consumo, el agotamiento del proyecto de las nuevas olas acompañado de la vuelta del Hollywood más popular, la pérdida de relevancia de los referentes de una cinefilia clásica, etc.) el libro plantea un relato polifónico convencido de que la historia del cine es más que la historia de sus películas. Es también la historia de su recepción, de los discursos y cambios institucionales que acompañaron su consumo, lo mantuvieron vivo y ayudaron a repensarlo en las conversaciones o en las prácticas sociales generadas en torno a las salas, festivales o en las actividades de los cineastas amateurs. Este tratamiento de una de las épocas más interesantes de nuestra historia reciente hace de esta publicación una obra de consulta obligada para estudiantes e investigadores interesados en la Historia del Cine y del Arte, los Estudios Culturales y la Historia Cultural de España.</p><p>Entrevista por Mercedes Ontoria Peña, profesora en el programa internacional de Endicott College en Madrid y en la Universidad de Nebrija, España.</p>",
  "itunes:duration": 4662,
  "itunes:explicit": "no",
  "guid": "13d2190a-b0f8-11ec-9ec0-cf7978884bd1",
  "enclosure": ""
}