{
  "title": "498: Harry Potter's 'Midnight Sun': The Companion Stories We Want Written",
  "link": "https://audioboom.com/posts/7781594",
  "itunes:episode": 498,
  "itunes:title": "Harry Potter's 'Midnight Sun': The Companion Stories We Want Written",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3437,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News: With a new appointment at Warner Brothers, could a Harry Potter television show be in our future? (Note: This episode was recorded before The Hollywood Reporter reported on January 25 that a live-action Harry Potter series is officially in development, but our news discussion still relates to the news)</li>\n<li>It's Not Just For Kids! Listeners weigh in on Ollivander's wand choosing ceremony at the Wizarding World theme park.</li>\n<li>Main Discussion: Harry Potter Companion Novels. As we continue the 20th anniversary celebration of the Sorcerer's Stone movie, whose eyes would we want to see the first story through?</li>\n<li>Twilight and Fifty Shades have taken this approach: have other book series? (MuggleCast interviewed Twilight author Stephenie Meyer back on <a href=\"https://www.mugglecast.com/episode-156-an-interview-with-stephenie-meyer/\">Episode 156</a>).</li>\n<li>What would Sorcerer's Stone look like from Professor Quirrell's perspective?</li>\n<li>Would Draco Malfoy and Boy Who Snubbed Me be a bestseller?</li>\n<li>Would readers enjoy Severus Snape's story and his constant struggle to protect the son of his worst enemy?</li>\n<li>Andrew takes us further into the series looking at Prisoner of Azkaban through Hermione's eyes.</li>\n<li>Other characters discussed include: Firenze, Professor McGonagall, Remus Lupin and Hagrid.</li>\n<li>Why did none of the hosts choose Ron? Dumbledore?</li>\n<li>Chicken Soup For The MuggleCast Soul (from Greece)</li>\n<li>Quizzitch: What is Albus Dumbledore’s favorite flavor of jam?</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 26 Jan 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-01-25:/posts/7781594",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}