{
  "id": "yt:video:Oyps21ItfOk",
  "yt:videoId": "Oyps21ItfOk",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "\" GRAND PRIX DE FRANCE\" 1959 GRAND PRIX MOTORCYCLE RACE  CASTROL OIL PROMO FILM  XD60664",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-03T16:29:46+00:00",
  "updated": "2022-11-03T16:29:47+00:00",
  "media:group": {
    "media:title": "\" GRAND PRIX DE FRANCE\" 1959 GRAND PRIX MOTORCYCLE RACE  CASTROL OIL PROMO FILM  XD60664",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nCreated in 1959 as a promo for Castrol Oil, this film \"Grand Prix De France\" was produced by Kinocrat Films Limited, made in cooperation with Le Moto Club D’ Auvergne. It covers the French Grand Prix Race on May 17th, 1959, on the Charade Circuit in France. With commentary by Harry Louis, spoken by Raymond Baxter, this film reports on the first race day of the season 1959 with three classes of bikes: 350cc, 500cc, and sidecars 500cc. The 1959 Grand Prix motorcycle racing season was the 11th F.I.M. Road Racing World Championship Grand Prix season, with the Grand Prix De France the opening event in the nine race season. The bikes seen in the film were made by MV Agusta, Norton, BMW, and Matchless. \n\nThe film begins with a motorcycle riding down a mountain road (00:06). At the Claremore Fair south of Paris (00:51). An officer directs traffic with hand gestures and a whistle (01:03). Narrow streets and tall cathedral spikes depict a typical French scene (01:08). Café Universe is the headquarters for Moto club D’ Auvergne (01:21). The sign of the five-mile circuit “Circuit De Montagne D’ Auvergne” (01:39). Footage of the racetrack from the point of view of a motorcycle rider (01:47). The highest point of the circuit near the village of Shahad (02:11) with voiceover comments from drivers Cyril Smith, Dickie Dale (riding an AJS), Gary Hocking (on a Norton), and Florian Camathias. A police helicopter flies over the track (03:27) and communicates with police officers on the ground via radio (03:33), followed by the Marshal’s office (03:38), the loudspeakers at the grandstands and vantage points (03:42), and the on-site ambulance (03:48). The motorcycle riders’ accommodation at a campsite (03:55). Cyril Smith and John Surtees talk at the campsite (04:22). Florian Camathias performs an oil-check (04:31). Mechanics are inspecting the bikes in the pit (04:38). People seated inside the race control office (05:05). Mechanics filling the motorcycle tanks before the 350cc race (05:19). The racers wheel their bikes into the circuit enclosure (05:25). John Hempleman, Bob Brown, and Dickie Dale are preparing at the starting line (05:59). John Surtees moves onto his MV Agusta (06:32). A checkered flag is waved, and the race begins (06:41). Watchers are seated on the sides of the racetrack (07:24). John Surtees wins the class 350cc race (12:34). Racers are preparing for the sidecars 500cc race (12:59). All motorcycles with sidecars are lined up along the starting line (13:34). The race begins (13:36). The victors are stood on a podium (19:04). The riders are drinking and eating after the race (19:05). The motorcycles are wheeled in for the final class 500cc race (19:15). The line up at the starting line (19:19). The checkered flag is waved, and the final race begins (19:52). John Surtees triumphs again (24:57). He steps onto the hood of a car, while a crowd applaud him, and he accepts flowers (25:05). The French and English flag is waving in the wind (25:34). The loudspeakers are silent (25:35). The camp-site area has been cleared out (25:43). A couple is sitting on a patch of grass kissing (25:50). A small village with a fountain where two cows pull a loaded carriage (25:53). \n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}