{
  "title": "A Framework for Studying Population Dynamics",
  "link": "",
  "published": "2020-03-08T00:00:00-08:00",
  "updated": "2020-03-08T00:00:00-08:00",
  "author": {
    "name": "Dustin McIntosh"
  },
  "id": "tag:efavdb.com,2020-03-08:/world-wandering-dudes",
  "summary": "<p>In this post, I want to briefly introduce a new side project for the blog with applications to understanding population dynamics, natural selection, game theory, and probably&nbsp;more.</p>\n<p><a href=\"https://github.com/dustinmcintosh/world_wandering_dudes\">World Wandering Dudes</a> is a simulation framework in which you initiate a “world” which consists of a “field” and a set of …</p>",
  "content": "<p>In this post, I want to briefly introduce a new side project for the blog with applications to understanding population dynamics, natural selection, game theory, and probably&nbsp;more.</p>\n<p><a href=\"https://github.com/dustinmcintosh/world_wandering_dudes\">World Wandering Dudes</a> is a simulation framework in which you initiate a “world” which consists of a “field” and a set of “creatures” (dudes). The field has food on it. Each day, the creatures run around gathering the food which they need to survive and&nbsp;reproduce.</p>\n<h3>Example</h3>\n<p>Here’s an example of a few days passing in a world where food randomly sprouts each day, never spoiling, initiated with a single creature (particular note: after day 1 passes and there are two creatures, one of them doesn&#8217;t store enough food to reproduce at the end of the day):\n<img alt=\"\" src=\"https://efavdb.com/images/the_first_days.gif\"></p>\n<p>Taking a snapshot of the world at the end of each day for the first 20 or so days you can see the creatures take over the full field before coming to some general equilibrium state.\n<img alt=\"\" src=\"https://efavdb.com/images/each_day.gif\"></p>\n<h3>How the world&nbsp;works</h3>\n<p>A. Each day consists of a number of discrete time steps.  During each time step, the creatures move around the field randomly, if they find food they grab it from the field and store&nbsp;it.</p>\n<p>B. At the end of the day, a few things&nbsp;happen:</p>\n<ol>\n<li>\n<p>Each creature must eat some food.  If they don’t have enough stored, they&nbsp;die.</p>\n</li>\n<li>\n<p>If they have enough food after eating, they may also reproduce.  Offspring may have mutated properties (e.g., they may move a little faster each time step - speedy creatures - or they may eat less food - efficient&nbsp;creatures)</p>\n</li>\n<li>\n<p>The food may spoil throughout the world (or not) and new food may sprout on the&nbsp;field.</p>\n</li>\n</ol>\n<h3>Examining the historical&nbsp;record</h3>\n<p>You can also look at this historical recordfor the field and examine some metrics including total creature count, birth/death rate, the mutation composition of the creatures, amount of stored food, amount of ungathered food, and more:\n<img alt=\"\" src=\"https://efavdb.com/images/example_history.png\">\nSome phenomenological notes on this particular case (more details on the math behind some of this in future&nbsp;posts):</p>\n<ul>\n<li>The dynamics of the world are stochastic. For example, sometimes the first creature doesn’t find any food and dies&nbsp;immediately.</li>\n<li>The population initially grows roughly exponentially as food becomes plentiful across the&nbsp;map.</li>\n<li>With the accumulated food on the field from the initial low-population days, the creatures grow in numbers beyond a sustainable population and a period of starvation and population culling follows.&nbsp;:(</li>\n<li>The population reaches an equilibrium at which the number of creatures is nearly the same as the amount of food sprouted each day (it’s not exactly&nbsp;equal!).</li>\n<li>At equilibrium, the rate at which creatures are being born is equal to the rate at which they die (on average) and both appear to be about a third of the total population (it’s not a&nbsp;third!).</li>\n<li>As mentioned above, upon reproduction the creatures will mutate and the fitter creatures may take over the world. In this particular case, efficient creatures come about first and quickly take over the population. The world can actually sustain a higher population of efficient vs normal/speedy creatures, so the total population increases accordingly. Shortly thereafter, a few speedy creatures start to show up and they, slowly, take over the world, out-competing the efficient creatures and slowly suppressing the overall&nbsp;population.</li>\n</ul>\n<p>More to come on extensions of this project and understanding the math behind it in the&nbsp;future.</p>\n<h3>Check it out&nbsp;yourself</h3>\n<p>The github repository is <a href=\"https://github.com/dustinmcintosh/world_wandering_dudes\">here</a>.</p>\n<p>You’ll need a bunch of the usual python packages for data&nbsp;science.</p>\n<div class=\"highlight\"><pre><span></span>git clone https://github.com/dustinmcintosh/world_wandering_dudes\n\n<span class=\"nb\">cd</span> world_wandering_dudes\n</pre></div>\n\n\n<p>Update the directory for saving figures in <code>SET_ME.py</code> if you&#8217;d like to store them somewhere&nbsp;special.</p>\n<p>Run the sample&nbsp;code:</p>\n<div class=\"highlight\"><pre><span></span>python scripts/basic_simulation.py\n</pre></div>\n\n\n<p>You can recycle the same world again&nbsp;using:</p>\n<div class=\"highlight\"><pre><span></span>python scripts/basic_simulation.py -wp my_world.pkl\n</pre></div>",
  "category": [
    "",
    "",
    "",
    ""
  ]
}