{
  "title": "Divisive Rhetoric in UK Emboldens Extremists, Endangers Asylum Seekers",
  "link": "https://www.hrw.org/news/2022/11/02/divisive-rhetoric-uk-emboldens-extremists-endangers-asylum-seekers",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        The gate near the migrant processing center in Dover, England, October 31, 2022.\n                    © 2022 Kin Cheung/AP Photo \n          \n\n  \n<p>An arson attack against a migrant processing center in Dover, South-East England, on Sunday is being investigated by counterterrorism police, who have described the motive as “probably driven by some form of hate-filled grievance.”</p>\n\n<p>Given the gravity of the situation, Home Secretary Suella Braverman’s remarks in the aftermath have caused widespread alarm and condemnation. Speaking in the House of Commons, Braverman described asylum seekers as “an invasion on our southern coast” and referred to some as “members of criminal gangs.” </p>\n\n<p>Painting asylum seekers and refugees as invaders is a well-worn device of the populist right, repeatedly used to dehumanize asylum seekers and refugees and to fuel resentment and fear. It is dangerous, divisive, and should have no place in British society.</p>\n\n<p>How we talk about asylum seekers and refugees is important.</p>\n\n<p>Nobody, including those arriving by boat or by any irregular route to the UK, is “illegal,” and all asylum seekers deserve a fair hearing. Seeking asylum is a human right, and the 1951 Refugee Convention prohibits penalizing asylum seekers and refugees for entering a country irregularly. As a state party to the convention, the UK is obliged to respect this.</p>\n\n<p>Yes, arrivals by boat have increased – in part because tighter checks on lorries have been introduced – but the UK receives very few asylum seekers when compared to countries like France, Germany, Italy or Spain. The idea that the UK is “being invaded” is a gross mischaracterisation that overlooks how the government has all but shut down safe routes into the country, and that the majority of those who cross the English Channel are officially found in need of protection.</p>\n\n<p>We shouldn’t allow the inhumane and likely unlawful conditions we are witnessing at processing centres like Manston, where 4,000 people are being held in a space designed for 1,600, to be dismissed as the product of sudden demand. The numbers are broadly in line with the government’s own predictions from March. Rather, these abuses should be viewed as indicative of the systematic failures in the asylum system. The number of people waiting more than six months for an asylum decision has tripled since 2019.</p>\n\n<p>Politicians should take responsibility for their failures instead of dehumanizing and scapegoating asylum seekers. Regardless of how people arrive, the UK should live up to the protections it agreed to in the aftermath of the second world war and ensure everyone is treated with dignity and humanity.</p>",
  "pubDate": "Wed, 02 Nov 2022 16:52:48 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/divisive-rhetoric-uk-emboldens-extremists-endangers-asylum-seekers"
}