{
  "title": "Computed tomography coronary angiogram images, annotations and associated data of normal and diseased arteries. (arXiv:2211.01859v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01859",
  "description": "<p>Computed Tomography Coronary Angiography (CTCA) is a non-invasive method to\nevaluate coronary artery anatomy and disease. CTCA is ideal for geometry\nreconstruction to create virtual models of coronary arteries. To our knowledge\nthere is no public dataset that includes centrelines and segmentation of the\nfull coronary tree.\n</p>\n<p>We provide anonymized CTCA images, voxel-wise annotations and associated data\nin the form of centrelines, calcification scores and meshes of the coronary\nlumen in 20 normal and 20 diseased cases. Images were obtained along with\npatient information with informed, written consent as part of Coronary Atlas\n(https://www.coronaryatlas.org/). Cases were classified as normal (zero calcium\nscore with no signs of stenosis) or diseased (confirmed coronary artery\ndisease). Manual voxel-wise segmentations by three experts were combined using\nmajority voting to generate the final annotations.\n</p>\n<p>Provided data can be used for a variety of research purposes, such as 3D\nprinting patient-specific models, development and validation of segmentation\nalgorithms, education and training of medical personnel and in-silico analyses\nsuch as testing of medical devices.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Gharleghi_R/0/1/0/all/0/1\">Ramtin Gharleghi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Adikari_D/0/1/0/all/0/1\">Dona Adikari</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ellenberger_K/0/1/0/all/0/1\">Katy Ellenberger</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Webster_M/0/1/0/all/0/1\">Mark Webster</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ellis_C/0/1/0/all/0/1\">Chris Ellis</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sowmya_A/0/1/0/all/0/1\">Arcot Sowmya</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ooi_S/0/1/0/all/0/1\">Sze-Yuan Ooi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Beier_S/0/1/0/all/0/1\">Susann Beier</a>"
}