{
  "title": "Ep. 132 - The Occidental Hotel",
  "itunes:title": "Ep. 132 - The Occidental Hotel",
  "pubDate": "Thu, 23 Jun 2016 09:51:11 +0000",
  "guid": "5a47d7610764463a8765badc61a3364f",
  "link": "https://sites.libsyn.com/58064/ep-132-the-occidental-hotel",
  "itunes:image": "",
  "description": "<p>The Occidental Hotel is a historic hotel in the town of Buffalo, Wyoming. The area is a place that has seen gold diggers come through during the Gold Rush and people making their way West on the Oregon Trail. Outlaws have been through as well as heroes of the American West. And a well known battle of class warfare took place here during the days of cattlemen. The town is also the setting for A & E's drama \"Longmire.\" The Occidental Hotel was in the middle of much history, but after a steady decline for the town, it almost was lost to the wrecking ball. Today, it has been restored to a grand hotel once again, giving guests a chance to go back in time to the old west. And just like so many tales of the West, this one has a ghosts story or two. Join us as we explore the history and hauntings of the Occidental Hotel! The Moment in Oddity is by Bob Sherfield and features The Williamson Tunnels and This Day in History is by April Rogers-Krick and features the Winnie Mae's Round World Trip. Our location was suggested by listener Sarah Gunther and our Research Assistant was Steven Pappas.<br /> <br /> Check out the website: <a href= \"http://historygoesbump.com\">http://historygoesbump.com</a></p> <p>Show notes can be found here: <a href= \"http://historygoesbump.blogspot.com/2016/06/hgb-ep-132-occidental-hotel.html\"> http://historygoesbump.blogspot.com/2016/06/hgb-ep-132-occidental-hotel.html</a></p> <p><br /> Become an Executive Producer: <a href= \"http://patreon.com/historygoesbump\">http://patreon.com/historygoesbump</a></p> <p> </p>",
  "content:encoded": "<p>The Occidental Hotel is a historic hotel in the town of Buffalo, Wyoming. The area is a place that has seen gold diggers come through during the Gold Rush and people making their way West on the Oregon Trail. Outlaws have been through as well as heroes of the American West. And a well known battle of class warfare took place here during the days of cattlemen. The town is also the setting for A & E's drama \"Longmire.\" The Occidental Hotel was in the middle of much history, but after a steady decline for the town, it almost was lost to the wrecking ball. Today, it has been restored to a grand hotel once again, giving guests a chance to go back in time to the old west. And just like so many tales of the West, this one has a ghosts story or two. Join us as we explore the history and hauntings of the Occidental Hotel! The Moment in Oddity is by Bob Sherfield and features The Williamson Tunnels and This Day in History is by April Rogers-Krick and features the Winnie Mae's Round World Trip. Our location was suggested by listener Sarah Gunther and our Research Assistant was Steven Pappas.  Check out the website: <a href= \"http://historygoesbump.com\">http://historygoesbump.com</a></p> <p>Show notes can be found here: <a href= \"http://historygoesbump.blogspot.com/2016/06/hgb-ep-132-occidental-hotel.html\"> http://historygoesbump.blogspot.com/2016/06/hgb-ep-132-occidental-hotel.html</a></p> <p> Become an Executive Producer: <a href= \"http://patreon.com/historygoesbump\">http://patreon.com/historygoesbump</a></p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "32:31",
  "itunes:explicit": false,
  "itunes:keywords": "history,ghosts,paranormal",
  "itunes:subtitle": "The Occidental Hotel is a historic hotel in the town of Buffalo, Wyoming. The area is a place that has seen gold diggers come through during the Gold Rush and people making their way West on the Oregon Trail. Outlaws have been through as well as...",
  "itunes:episode": 132,
  "itunes:episodeType": "full"
}