{
  "title": "523 - Methadone Prevents Overdose, So Why Is It So Hard to Access?",
  "itunes:title": "523 - Methadone Prevents Overdose, So Why Is It So Hard to Access?",
  "pubDate": "Wed, 28 Sep 2022 10:00:00 +0000",
  "guid": "ab2e851c-43da-4653-adcf-9dbb452d38c4",
  "link": "https://johnshopkinssph.libsyn.com/-523-methadone-prevents-overdose-so-why-is-it-so-hard-to-access",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">A 2019 report from the National Academies of Sciences, Engineering, and Medicine lays out irrefutable evidence that medications like methadone can save lives when used for opioid use disorder, but decades of policy rooted in racism and stigma keeps methadone largely out of reach for those who need it.</span> <strong>Alan Leshner</strong><span style= \"font-weight: 400;\">, CEO emeritus of the American Association for the Advancement of Science and chair of the planning committee for the report talks with</span> <strong>Lindsay Smith Rogers</strong> <span style=\"font-weight: 400;\">about these policies and why this is a moment of opportunity to enact major reform in the methadone system and address the opioid epidemic. Read the full report</span> <a href= \"https://nap.nationalacademies.org/catalog/25310/medications-for-opioid-use-disorder-save-lives\"> <span style=\"font-weight: 400;\">here</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>A 2019 report from the National Academies of Sciences, Engineering, and Medicine lays out irrefutable evidence that medications like methadone can save lives when used for opioid use disorder, but decades of policy rooted in racism and stigma keeps methadone largely out of reach for those who need it. Alan Leshner, CEO emeritus of the American Association for the Advancement of Science and chair of the planning committee for the report talks with Lindsay Smith Rogers about these policies and why this is a moment of opportunity to enact major reform in the methadone system and address the opioid epidemic. Read the full report <a href= \"https://nap.nationalacademies.org/catalog/25310/medications-for-opioid-use-disorder-save-lives\"> here</a>.</p>",
  "enclosure": "",
  "itunes:duration": "16:31",
  "itunes:explicit": false,
  "itunes:keywords": "doctor,drugs,policy,epidemic,racism,Pharmacy,methadone,opioid",
  "itunes:subtitle": "A 2019 report from the National Academies of Sciences, Engineering, and Medicine lays out irrefutable evidence that medications like methadone can save lives when used for opioid use disorder, but decades of policy rooted in racism and stigma keeps...",
  "itunes:season": 6,
  "itunes:episode": 523,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}