{
  "title": "Episode 12: &#8220;Lawdy Miss Clawdy&#8221; by Lloyd Price",
  "link": "https://500songs.com/podcast/lawdy-miss-clawdy-by-lloyd-price/",
  "pubDate": "Sun, 23 Dec 2018 23:03:31 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/lawdy-miss-clawdy-by-lloyd-price/",
  "description": "Welcome to episode twelve of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Lawdy Miss Clawdy\" by Lloyd Price. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-12-lawdy-miss-clawdy/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nLloyd Price has written a few books. <a href=\"https://amzn.to/2ShLwvs\">His autobiography</a> is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written <a href=\"https://amzn.to/2GCj2LB\">a book of essays</a> with his thoughts on race, some of which shed light on his work.\n\nThe information on Dave Bartholomew and Fats Domino here largely comes from <a href=\"https://amzn.to/2Sg3e2d\"><em>Blue Monday </em>by Rick Coleman.</a>\n\nThe Lloyd Price songs here can be found on <a href=\"https://amzn.to/2Shr7qd\">The Complete Singles As & Bs 1952-62</a> while the Fats Domino tracks are on <a href=\"https://amzn.to/2GCtwKU\"><em>They Call Me the Fat Man</em></a>\n\n<strong>Erratum</strong>\n\nI used the wrong version of \"Lawdy Miss Clawdy\" when editing this podcast. The version used here is a soundalike remake from 1958, rather than the 1952 original. Apologies for the error.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThis is a rather special episode in some ways. The topic of this episode is \"Lawdy Miss Clawdy\" by Lloyd Price, and I'll be frank -- I was not originally going to give \"Lawdy Miss Clawdy\" its own episode. Not because it's not a great record -- it is -- but because I was going to deal with it in passing when I cover one of the other records made by its vocalist, Lloyd Price.\n\nBut that was before I noticed an odd coincidence of timing. I needed to prerecord this episode, because it's Christmas and I'm visiting my in-laws, and so I was looking at what records came next in the history on my timeline, and I noticed two things:\n\nThe first was that \"Lawdy Miss Clawdy\" was the next important record to be released in the timeline I'd put together. And the second was that Dave Bartholomew, that record's producer, was born one hundred years ago exactly, on December 24th, 1918.\n\nI simply couldn't pass up an opportunity to do an episode celebrating the hundredth birthday of one of the great pioneers of rock and roll music, and one who is happily still alive.\n\nWe talked about Bartholomew a bit a couple of weeks ago, in the episode about \"The Fat Man\" by Fats Domino, but he needs to be discussed in more detail, as he was one of the most important musicians of the fifties. As we heard, he brought the \"Spanish tinge\" to rhythm and blues records and collaborated with Fats Domino on all of Domino's big hits -- and we'll be hearing more about him in that context in a few weeks -- but he did a lot more. Not only did he produce classic records by Frankie Ford and T-Bone Walker, not only did he write \"One Night\", which became a big hit for Smiley Lewis and a bigger one for Elvis, but he also wrote Chuck Berry's only number one hit:\n\n[excerpt \"My Ding-A-Ling\" by Chuck Berry]\n\nOK, that may not be Berry's finest moment as a performer, but it shows just how wide Bartholomew's influence was.\n\nDespite that, rather astonishingly, there's never been a biography written of Bartholomew, and even \"Honkers and Shouters\", the classic book on the history of rhythm and blues which contains almost the only in-depth interviews with many of the musicians and record producers who made this music, only devotes a handful of paragraphs to Bartholomew's work. I've barely been able to even find any in-depth interviews with Bartholomew, and so my knowledge of him is built up from lots of offhand mentions and casual connections in books on other people.\n\nBut he worked with so *many* other people that that still amounts to quite a lot. So let's talk about \"Lawdy Miss Clawdy\", and let's do it by picking up the story of Dave Bartholomew and Fats Domino after \"The Fat Man\".\n\n\"The Fat Man\" was a massive hit, but it caused some strain between its producer and its performer. Domino had gone on tour to support the record, as part of a larger package with Bartholomew's band as the headliners. Domino would only perform a few songs at a time, and most of the show was Bartholomew's band.\n\nDomino resented Bartholomew for getting most of the money, while Bartholomew resented Domino for his popularity -- Domino was starting to overshadow the nominal star of the show. But more than that, Domino just didn't seem to be getting on well with the rest of the band.\n\nThis wasn't because he was unfriendly -- although Domino was always someone who seemed a little socially awkward -- just that Domino was a homebody who absolutely resented ever having to go away from home, and especially as he had a newborn baby son he wanted to be home for. Indeed, when the tour had started, Domino had missed the first few days by the simple expedient of hiding for several days, and it was only when a union official had come knocking at his door explaining what happened to people who broke their contracts that he relented and went on the tour. And even then, he packed a suitcase full of foods like pickled pig's feet, in case he couldn't get his favourite foods anywhere else.\n\nDomino was a sheltered, nervous, shy, person -- someone who had been so unworldly that when his first record came out he didn't have a record player to play it on and had to listen to it on jukeboxes -- and this exasperated Bartholomew, who was a far more well-travelled and socially aware person. But the two of them still continued to collaborate, and to make records together, including some great ones like this version of the traditional New Orleans song \"Eh La Bas!\", which Bartholomew rewrote with the great boogie pianist Professor Longhair and titled \"Hey! La Bas Boogie\"\n\n[excerpt \"Hey! La Bas Boogie\" by Fats Domino]\n\nThe collaborations caused other problems, too -- both Bartholomew and Domino thought, with good reason, of themselves as the true talent in their collaborations. Domino believed that his piano playing and singing were the important things on the records, and that since he was bringing in most of the ideas fully-formed Bartholomew wasn't doing much to make the records successful. Bartholomew, on the other hand, thought that the song ideas Domino was bringing in were basically nursery rhymes, while his own songs were more sophisticated -- Domino had little formal musical knowledge and usually used only a couple of chords, while Bartholomew was far more musically knowledgeable; and Domino wasn't a native English speaker, and tended to use very simple lyrics while when Bartholomew brought in ideas he would come up with strong narratives and punning lyrics. Bartholomew thought that when the songs Domino brought in became successful, it was because of Bartholomew's patching up of them and his arrangements.\n\nBartholomew resented that Domino was becoming a big star, and Domino resented that Bartholomew patronised him in the studio, treating him as an employee, not an equal partner.\n\nOf course, both were right -- Bartholomew was by far the better songwriter, but Domino had great instincts for a hook. Bartholomew was a great arranger, and Domino was a great performer. As so often in musical collaborations, the sum was much greater than its parts, and it was the tension between the two of them that drove the collaboration.\n\nBut while Bartholomew had problems with Fats, his real problems were with Al Young, a white New Orleans record store owner who was an associate of Lew Chudd, Imperial Records' owner. He didn't like Young's habit of trying to make it look like it was him, rather than Bartholomew, who was producing the records, and he especially didn't like when Young cut himself in on the songwriting royalties for songs Bartholomew wrote.\n\nThis problem came to a head when Bartholomew got back home from a particularly stressful tour with Domino over Thanksgiving. It had been far too cold for the Louisiana musicians in the Midwest, and they'd been ripped off by the tour promoters -- they'd received only something like two hundred dollars between them, rather than the two thousand they'd been promised. Domino actually had to call home and ask his family to wire him his bus fare back from Missouri to New Orleans.\n\nAnd when Bartholomew got back, he popped into Al Young's record shop -- and Young showed him the fifteen hundred dollar Christmas bonus cheque he'd just received from Imperial Records for all his hard work that year. Bartholomew had received no bonus, despite having done far more for the company than Young had, and he assumed that the reason was because Bartholomew was black and Young was white. He decided right then to quit Imperial, and to become a freelancer working for whoever had work.\n\nDomino continued making records in the same style, and even continued to have hits with songs that followed the formula he'd established with Bartholomew, some of them even bigger than the ones they'd made together, like \"Goin' Home\". But Al Young was the producer on that record, and while Domino did his usual great performance and it had that tresillo rhythm, Young knew nothing about music, and so the arrangement was haphazard and the sax solo was off-key at points:\n\n[excerpt: solo from \"Goin' Home\", Fats Domino]\n\nBut it was still a big hit, and Al Young got his name stuck on the credits as a co-writer, which is what mattered to him at least, even if everyone was unhappy with the recordings. That song went to number one on the R&B charts, and made its way into the top thirty on the pop charts, and you can hear its influence all over the place, for example in this other classic track:\n\n[excerpt \"Shake a Hand\", Faye Adams]\n\nIt also influenced a young piano player and arranger named Ray Charles, and we'll talk more about him later. But the fact remains, it's not as good as the stuff Domino was doing with Bartholomew. It has the power and the catchiness, but it doesn't have the depth and the sophistication.\n\nLew Chudd, around this time, tried to get Art Young to get Dave Bartholomew back working with Domino again, but Bartholomew just slammed the phone down on Young. He didn't need Imperial Records, he didn't need Fats Domino, and he *certainly* didn't need Art Young. He was working with other people now. In particular, he was working with Specialty Records.\n\nSpecialty Records was an LA-based record label, like most of the labels that worked with New Orleans musicians were -- for whatever reason, even though LA and New Orleans are thousands of miles away from each other, it was the Los Angeles companies rather than anywhere closer that seemed to pick up on the sound coming from New Orleans.\n\nSpecialty was run by Art Rupe. Art Rupe is, amazingly, still alive and even older than Dave Bartholomew -- he turned 101 a few months back -- and he's one of the most important figures in the development of rhythm and blues in the 1950s. Indeed, he was the producer of yet another record occasionally labelled \"the first rock and roll record\", \"R.M.'s Blues\" by Roy Milton, which was one of the early records to combine a boogie piano and a backbeat.\n\n[excerpt: \"R.M.'s Blues\" by Roy Milton]\n\nAnd in his case, it's no coincidence that he ended up working with New Orleans musicians -- he was impressed by Fats Domino's Imperial Records releases, Imperial being another Los Angeles based label, and so he came to New Orleans to see if there were other people like Domino about. Rupe put out an ad for people to come to Cosimo Mattassa's studio to audition, but it wasn't until he was packing up to leave and fly back to Los Angeles without any success, that a singer called Lloyd Price walked into the studio and sang his song \"Lawdy Miss Clawdy\". Rupe cancelled his flight -- this was someone worth recording.\n\nPrice was, at the time, a jingle creator for a local radio station, providing music for the DJs to use while they were advertising various products. At the time, radio advertising in the US was much like podcast advertising is now, and in the same way that a podcast host might interrupt what they're doing and try to tell you about the benefits of a new mattress, so, then, might DJs -- and in the same way that some podcast hosts will vary their set texts, so would the DJs, and one of the DJs for whom Lloyd Price created jingles had a catchphrase -- \"Lawdy Miss Clawdy\".\n\nPrice had come up with a melody to go along with those words -- or, rather, he'd adapted a pre-existing melody to it -- and the result had been popular enough that he had decided to turn it into a full song.\n\nAnd Price had sat in with Dave Bartholomew and his band in Kenner, his hometown, singing a few songs with them. Bartholomew had told him \"I'm not working with Lew Chudd any more, I'm just hanging around Cosimo Matassa's studio catching the odd bit of arrangement work there -- why don't you come down and see if we can get you recorded?\" But Price was so unfamiliar with New Orleans that he didn't even know how to get to Rampart Street, which is why he'd arrived so late. Luckily for everyone concerned, he managed to find the most famous street in New Orleans eventually.\n\nWhen they started recording the song, Bartholomew started to get annoyed with the guitarist on the session, Ernest McLean . \"I wanted to get some sort of a rhythm going and he de dum de dum, de dum de dum [Laurel and Hardy rhythm]. I say, man, that's, that's, that ain't nothing. What the hell you get that thing from?\"\n\nThat's from one of the few interviews I've seen with Bartholomew -- other sources say it was his piano player, Salvador Doucette, who was the problem. Whichever musician it was was apparently a jazz musician who had no real love or feel for rhythm and blues, and Bartholomew was getting exasperated, but at the same time he had no option but to go with what he had. But then fate intervened.\n\nFats Domino happened to be passing the studio, and he decided to just call in and say hello, since it was the studio he recorded in regularly -- and he found Dave Bartholomew there. Domino and Bartholomew hadn't worked together in over a year at this point -- March 1952 -- and things were tense at first, but Bartholomew decided he'd be the one to ease the tension, and asked Domino to sit in.\n\nAt first Domino refused, saying \"Man, you know I can't sit in! I'm under contract!\", but he sat around in the session, having a few drinks and watching the band work. Eventually, he said \"Well, I'm gonna have me some fun, I'm gonna sit in anyway!\" The resulting record was the one that knocked \"Goin' Home\" off the top of the R&B charts, and it would become one of the defining records of the rock and roll era.\n\n\"Lawdy Miss Clawdy\" is, in many ways, an attempt to recapture the success of \"The Fat Man\". It has many of the same musicians, the same arranger, and the same basic melody that the earlier record did. But being recorded three years later on meant it was also recorded after three years more advancement in the rock and roll style, and \"Lawdy Miss Clawdy\" is notably more rhythmically complex than the earlier record -- and that's largely down to Dave Bartholemew's arrangement.\n\nLet's have a look at the individual elements of the track -- starting with Fats Domino's piano playing. Domino is mostly playing triplets, which is the way that he played most of the time:\n\n[excerpt: piano part from \"Lawdy Miss Clawdy\"]\n\nYou've got the drums, by the great Earl Palmer, where he's making the transition between his early shuffle style and his later backbeat emphasis -- you can hear he's trying to do two things at once on the drums, he's trying to swing it *and* produce a backbeat, so you've essentially got him doing polyrhythms. You've got the bass, a different rhythm again, and then you've got those horns, just doing long, sustained, \"blaaaat\" parts. And then over that you've got Lloyd Price, singing in a Roy Brown imitation, but with a teenager's style -- Price had just turned nineteen -- it's a song about unrequited love or lust, a teenager's song of yearning. And then to top it off there's the sax solo by Herb Hardesty -- the prototype for the solos he would provide for all Domino's hits from this point on. It's an amazing combination; this is the record that crystallised the New Orleans sound and became the template all the others would follow. \"The Fat Man\" had been the prototype, with some rough edges still there. This was a slicker, more assured, version of the same thing.\n\nArt Rupe was certainly pleased, but they were lucky to have been working with Rupe himself -- soon after this recording, Rupe decided to expand his operations in New Orleans, and put Johnny Vincent in charge. While Rupe has a reputation as a decent businessman by 1950s record company standards, Johnny Vincent does *not*. When Vincent later owned his own record company, Ace, he was so bad at paying the musicians that Huey \"Piano\" Smith and Mac Rebbennack had to go and hold Vincent at gunpoint while they searched his office -- and his person -- for the money he owed them. And then, a few months later, they had to do the same thing again, because being held up at gunpoint just the once wasn't enough for him to think better of ripping them off.\n\nVincent was also not a particularly skilled record producer, at least according to Rebennack. I can't repeat his comments about Vincent's approach in full, because if I use some of the words he used iTunes will restrict this podcast to adults only, but the gist is that Vincent was a con-man who knew nothing about record production.\n\nIt's probably not a massive coincidence that Dave Bartholomew stopped working for Specialty very shortly after the recording of \"Lawdy Miss Clawdy\". I've not seen a precise enough timeline to know for sure that it was Johnny Vincent's arrival at the label that persuaded Bartholomew he didn't want to work for them any more, but it seems likely to me. What I *do* know, though is that Lew Chudd heard \"Lawdy Miss Clawdy\", compared it to the records Art Young was producing for Fats Domino, and realised that he could be doing a hell of a lot better than he was. He eventually, through an intermediary, managed to persuade Bartholomew to talk to him again, and Bartholomew was hired back to work at Imperial. The same month, April 1952, that \"Lawdy Miss Clawdy\" came out, Domino and Bartholomew were back in Matassa's studio, working together again, and recording a collaboration which sounds like a true combination of both men's styles:\n\n[excerpt: \"Poor Me\" -- Fats Domino]\n\nDomino and Bartholomew would work together regularly in the studio until at least 1967, and live off and on for decades after that. And we'll hear more of their collaborations later.\n\nBut Lloyd Price wasn't hampered by the fact that his producer had gone off to another label either. His follow-up single, cut at the same session as \"Lawdy Miss Clawdy\" with the same musicians, was a double-sided hit, both sides making the top ten on the R&B charts. And the same happened with the single after that, cut with different musicians -- a song called \"Ain't it a Shame\", which may just have given Domino and Bartholomew an idea.\n\nAfter that he hit a bit of a dry spell in his career, and by 1956 he was reduced to recording a sequel to \"Lawdy Miss Clawdy\" -- \"Forgive me Clawdy\":\n\n[excerpt \"Forgive Me Clawdy\": Lloyd Price]\n\nBut then \"Lawdy Miss Clawdy\" itself got a second wind, and was covered in 1956 by both Elvis and Little Richard. This seems to have jump-started Price's career, and we'll pick up his story with his later big hits.\n\n\"Lawdy Miss Clawdy\" had a long life -- it's been recorded over the years by everyone from Paul McCartney to the Replacements -- and happily most of the major figures involved in the record did too, which makes a very pleasant change from the bit of the episode where I usually tell you that the singer died in poverty and obscurity of alcoholism. Lloyd Price is still going strong, still performing aged 85, and he released his most recent album in 2016. Art Rupe is still alive aged 101, and while I'm sad to say Fats Domino is now dead, he died only last year, aged 89, an extremely wealthy man who had received every award his peers could bestow and had been given medals by multiple Presidents.\n\nAnd, as I said at the start, this episode will go up at one minute past midnight on the twenty-fourth of December 2018, which means it's Dave Bartholomew's hundredth birthday, It's unlikely he'll ever hear it but I'd like to wish him a happy birthday anyway, and many more of them.\n\nSo to finish off... here's a record Bartholomew played on seven years ago, when he was ninety-three:\n\n[Excerpt: Alia Fleury \"Christmas in the Quarters\"]\n\nAnd for those of you who celebrate it, a merry Christmas to all of you at home.",
  "itunes:subtitle": "Welcome to episode twelve of A History of Rock Music in Five Hundred Songs. Today were looking at Lawdy Miss Clawdy by Lloyd Price. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs alwa",
  "itunes:keywords": "Al Young,Art Rupe,Chuck Berry,Cosimo Matassa,Dave Bartholomew,Earl Palmer,Fats Domino,Imperial Records,Johnny Vincent,Lew Chudd,Lloyd Price,New Orleans,Specialty Records,tresillo",
  "itunes:episodeType": "full",
  "itunes:episode": 12,
  "content:encoded": "Welcome to episode twelve of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Lawdy Miss Clawdy\" by Lloyd Price. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-12-lawdy-miss-clawdy/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nLloyd Price has written a few books. <a href=\"https://amzn.to/2ShLwvs\">His autobiography</a> is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written <a href=\"https://amzn.to/2GCj2LB\">a book of essays</a> with his thoughts on race, some of which shed light on his work.\n\nThe information on Dave Bartholomew and Fats Domino here largely comes from <a href=\"https://amzn.to/2Sg3e2d\"><em>Blue Monday </em>by Rick Coleman.</a>\n\nThe Lloyd Price songs here can be found on <a href=\"https://amzn.to/2Shr7qd\">The Complete Singles As & Bs 1952-62</a> while the Fats Domino tracks are on <a href=\"https://amzn.to/2GCtwKU\"><em>They Call Me the Fat Man</em></a>\n\n<strong>Erratum</strong>\n\nI used the wrong version of \"Lawdy Miss Clawdy\" when editing this podcast. The version used here is a soundalike remake from 1958, rather than the 1952 original. Apologies for the error.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThis is a rather special episode in some ways. The topic of this episode is \"Lawdy Miss Clawdy\" by Lloyd Price, and I'll be frank -- I was not originally going to give \"Lawdy Miss Clawdy\" its own episode. Not because it's not a great record -- it is -- but because I was going to deal with it in passing when I cover one of the other records made by its vocalist, Lloyd Price.\n\nBut that was before I noticed an odd coincidence of timing. I needed to prerecord this episode, because it's Christmas and I'm visiting my in-laws, and so I was looking at what records came next in the history on my timeline, and I noticed two things:\n\nThe first was that \"Lawdy Miss Clawdy\" was the next important record to be released in the timeline I'd put together. And the second was that Dave Bartholomew, that record's producer, was born one hundred years ago exactly, on December 24th, 1918.\n\nI simply couldn't pass up an opportunity to do an episode celebrating the hundredth birthday of one of the great pioneers of rock and roll music, and one who is happily still alive.\n\nWe talked about Bartholomew a bit a couple of weeks ago, in the episode about \"The Fat Man\" by Fats Domino, but he needs to be discussed in more detail, as he was one of the most important musicians of the fifties. As we heard, he brought the \"Spanish tinge\" to rhythm and blues records and collaborated with Fats Domino on all of Domino's big hits -- and we'll be hearing more about him in that context in a few weeks -- but he did a lot more. Not only did he produce classic records by Frankie Ford and T-Bone Walker, not only did he write \"One Night\", which became a big hit for Smiley Lewis and a bigger one for Elvis, but he also wrote Chuck Berry's only number one hit:\n\n[excerpt \"My Ding-A-Ling\" by Chuck Berry]\n\nOK, that may not be Berry's finest moment as a performer, but it shows just how wide Bartholomew's influence was.\n\nDespite that, rather astonishingly, there's never been a biography written of Bartholomew, and even \"Honkers and Shouters\", the classic book on the history of rhythm and blues which contains almost the only in-depth interviews with many of the musicians and record producers who made this music, only devotes a handful of paragraphs to Bartholomew's work. I've barely been able to even find any in-depth interviews with Bartholomew, and so my knowledge of him is built up from lots of offhand mentions and casual connections in books on other people.\n\nBut he worked with so *many* other people that that still amounts to quite a lot. So let's talk about \"Lawdy Miss Clawdy\", and let's do it by picking up the story of Dave Bartholomew and Fats Domino after \"The Fat Man\".\n\n\"The Fat Man\" was a massive hit, but it caused some strain between its producer and its performer. Domino had gone on tour to support the record, as part of a larger package with Bartholomew's band as the headliners. Domino would only perform a few songs at a time, and most of the show was Bartholomew's band.\n\nDomino resented Bartholomew for getting most of the money, while Bartholomew resented Domino for his popularity -- Domino was starting to overshadow the nominal star of the show. But more than that, Domino just didn't seem to be getting on well with the rest of the band.\n\nThis wasn't because he was unfriendly -- although Domino was always someone who seemed a little socially awkward -- just that Domino was a homebody who absolutely resented ever having to go away from home, and especially as he had a newborn baby son he wanted to be home for. Indeed, when the tour had started, Domino had missed the first few days by the simple expedient of hiding for several days, and it was only when a union official had come knocking at his door explaining what happened to people who broke their contracts that he relented and went on the tour. And even then, he packed a suitcase full of foods like pickled pig's feet, in case he couldn't get his favourite foods anywhere else.\n\nDomino was a sheltered, nervous, shy, person -- someone who had been so unworldly that when his first record came out he didn't have a record player to play it on and had to listen to it on jukeboxes -- and this exasperated Bartholomew, who was a far more well-travelled and socially aware person. But the two of them still continued to collaborate, and to make records together, including some great ones like this version of the traditional New Orleans song \"Eh La Bas!\", which Bartholomew rewrote with the great boogie pianist Professor Longhair and titled \"Hey! La Bas Boogie\"\n\n[excerpt \"Hey! La Bas Boogie\" by Fats Domino]\n\nThe collaborations caused other problems, too -- both Bartholomew and Domino thought, with good reason, of themselves as the true talent in their collaborations. Domino believed that his piano playing and singing were the important things on the records, and that since he was bringing in most of the ideas fully-formed Bartholomew wasn't doing much to make the records successful. Bartholomew, on the other hand, thought that the song ideas Domino was bringing in were basically nursery rhymes, while his own songs were more sophisticated -- Domino had little formal musical knowledge and usually used only a couple of chords, while Bartholomew was far more musically knowledgeable; and Domino wasn't a native English speaker, and tended to use very simple lyrics while when Bartholomew brought in ideas he would come up with strong narratives and punning lyrics. Bartholomew thought that when the songs Domino brought in became successful, it was because of Bartholomew's patching up of them and his arrangements.\n\nBartholomew resented that Domino was becoming a big star, and Domino resented that Bartholomew patronised him in the studio, treating him as an employee, not an equal partner.\n\nOf course, both were right -- Bartholomew was by far the better songwriter, but Domino had great instincts for a hook. Bartholomew was a great arranger, and Domino was a great performer. As so often in musical collaborations, the sum was much greater than its parts, and it was the tension between the two of them that drove the collaboration.\n\nBut while Bartholomew had problems with Fats, his real problems were with Al Young, a white New Orleans record store owner who was an associate of Lew Chudd, Imperial Records' owner. He didn't like Young's habit of trying to make it look like it was him, rather than Bartholomew, who was producing the records, and he especially didn't like when Young cut himself in on the songwriting royalties for songs Bartholomew wrote.\n\nThis problem came to a head when Bartholomew got back home from a particularly stressful tour with Domino over Thanksgiving. It had been far too cold for the Louisiana musicians in the Midwest, and they'd been ripped off by the tour promoters -- they'd received only something like two hundred dollars between them, rather than the two thousand they'd been promised. Domino actually had to call home and ask his family to wire him his bus fare back from Missouri to New Orleans.\n\nAnd when Bartholomew got back, he popped into Al Young's record shop -- and Young showed him the fifteen hundred dollar Christmas bonus cheque he'd just received from Imperial Records for all his hard work that year. Bartholomew had received no bonus, despite having done far more for the company than Young had, and he assumed that the reason was because Bartholomew was black and Young was white. He decided right then to quit Imperial, and to become a freelancer working for whoever had work.\n\nDomino continued making records in the same style, and even continued to have hits with songs that followed the formula he'd established with Bartholomew, some of them even bigger than the ones they'd made together, like \"Goin' Home\". But Al Young was the producer on that record, and while Domino did his usual great performance and it had that tresillo rhythm, Young knew nothing about music, and so the arrangement was haphazard and the sax solo was off-key at points:\n\n[excerpt: solo from \"Goin' Home\", Fats Domino]\n\nBut it was still a big hit, and Al Young got his name stuck on the credits as a co-writer, which is what mattered to him at least, even if everyone was unhappy with the recordings. That song went to number one on the R&B charts, and made its way into the top thirty on the pop charts, and you can hear its influence all over the place, for example in this other classic track:\n\n[excerpt \"Shake a Hand\", Faye Adams]\n\nIt also influenced a young piano player and arranger named Ray Charles, and we'll talk more about him later. But the fact remains, it's not as good as the stuff Domino was doing with Bartholomew. It has the power and the catchiness, but it doesn't have the depth and the sophistication.\n\nLew Chudd, around this time, tried to get Art Young to get Dave Bartholomew back working with Domino again, but Bartholomew just slammed the phone down on Young. He didn't need Imperial Records, he didn't need Fats Domino, and he *certainly* didn't need Art Young. He was working with other people now. In particular, he was working with Specialty Records.\n\nSpecialty Records was an LA-based record label, like most of the labels that worked with New Orleans musicians were -- for whatever reason, even though LA and New Orleans are thousands of miles away from each other, it was the Los Angeles companies rather than anywhere closer that seemed to pick up on the sound coming from New Orleans.\n\nSpecialty was run by Art Rupe. Art Rupe is, amazingly, still alive and even older than Dave Bartholomew -- he turned 101 a few months back -- and he's one of the most important figures in the development of rhythm and blues in the 1950s. Indeed, he was the producer of yet another record occasionally labelled \"the first rock and roll record\", \"R.M.'s Blues\" by Roy Milton, which was one of the early records to combine a boogie piano and a backbeat.\n\n[excerpt: \"R.M.'s Blues\" by Roy Milton]\n\nAnd in his case, it's no coincidence that he ended up working with New Orleans musicians -- he was impressed by Fats Domino's Imperial Records releases, Imperial being another Los Angeles based label, and so he came to New Orleans to see if there were other people like Domino about. Rupe put out an ad for people to come to Cosimo Mattassa's studio to audition, but it wasn't until he was packing up to leave and fly back to Los Angeles without any success, that a singer called Lloyd Price walked into the studio and sang his song \"Lawdy Miss Clawdy\". Rupe cancelled his flight -- this was someone worth recording.\n\nPrice was, at the time, a jingle creator for a local radio station, providing music for the DJs to use while they were advertising various products. At the time, radio advertising in the US was much like podcast advertising is now, and in the same way that a podcast host might interrupt what they're doing and try to tell you about the benefits of a new mattress, so, then, might DJs -- and in the same way that some podcast hosts will vary their set texts, so would the DJs, and one of the DJs for whom Lloyd Price created jingles had a catchphrase -- \"Lawdy Miss Clawdy\".\n\nPrice had come up with a melody to go along with those words -- or, rather, he'd adapted a pre-existing melody to it -- and the result had been popular enough that he had decided to turn it into a full song.\n\nAnd Price had sat in with Dave Bartholomew and his band in Kenner, his hometown, singing a few songs with them. Bartholomew had told him \"I'm not working with Lew Chudd any more, I'm just hanging around Cosimo Matassa's studio catching the odd bit of arrangement work there -- why don't you come down and see if we can get you recorded?\" But Price was so unfamiliar with New Orleans that he didn't even know how to get to Rampart Street, which is why he'd arrived so late. Luckily for everyone concerned, he managed to find the most famous street in New Orleans eventually.\n\nWhen they started recording the song, Bartholomew started to get annoyed with the guitarist on the session, Ernest McLean . \"I wanted to get some sort of a rhythm going and he de dum de dum, de dum de dum [Laurel and Hardy rhythm]. I say, man, that's, that's, that ain't nothing. What the hell you get that thing from?\"\n\nThat's from one of the few interviews I've seen with Bartholomew -- other sources say it was his piano player, Salvador Doucette, who was the problem. Whichever musician it was was apparently a jazz musician who had no real love or feel for rhythm and blues, and Bartholomew was getting exasperated, but at the same time he had no option but to go with what he had. But then fate intervened.\n\nFats Domino happened to be passing the studio, and he decided to just call in and say hello, since it was the studio he recorded in regularly -- and he found Dave Bartholomew there. Domino and Bartholomew hadn't worked together in over a year at this point -- March 1952 -- and things were tense at first, but Bartholomew decided he'd be the one to ease the tension, and asked Domino to sit in.\n\nAt first Domino refused, saying \"Man, you know I can't sit in! I'm under contract!\", but he sat around in the session, having a few drinks and watching the band work. Eventually, he said \"Well, I'm gonna have me some fun, I'm gonna sit in anyway!\" The resulting record was the one that knocked \"Goin' Home\" off the top of the R&B charts, and it would become one of the defining records of the rock and roll era.\n\n\"Lawdy Miss Clawdy\" is, in many ways, an attempt to recapture the success of \"The Fat Man\". It has many of the same musicians, the same arranger, and the same basic melody that the earlier record did. But being recorded three years later on meant it was also recorded after three years more advancement in the rock and roll style, and \"Lawdy Miss Clawdy\" is notably more rhythmically complex than the earlier record -- and that's largely down to Dave Bartholemew's arrangement.\n\nLet's have a look at the individual elements of the track -- starting with Fats Domino's piano playing. Domino is mostly playing triplets, which is the way that he played most of the time:\n\n[excerpt: piano part from \"Lawdy Miss Clawdy\"]\n\nYou've got the drums, by the great Earl Palmer, where he's making the transition between his early shuffle style and his later backbeat emphasis -- you can hear he's trying to do two things at once on the drums, he's trying to swing it *and* produce a backbeat, so you've essentially got him doing polyrhythms. You've got the bass, a different rhythm again, and then you've got those horns, just doing long, sustained, \"blaaaat\" parts. And then over that you've got Lloyd Price, singing in a Roy Brown imitation, but with a teenager's style -- Price had just turned nineteen -- it's a song about unrequited love or lust, a teenager's song of yearning. And then to top it off there's the sax solo by Herb Hardesty -- the prototype for the solos he would provide for all Domino's hits from this point on. It's an amazing combination; this is the record that crystallised the New Orleans sound and became the template all the others would follow. \"The Fat Man\" had been the prototype, with some rough edges still there. This was a slicker, more assured, version of the same thing.\n\nArt Rupe was certainly pleased, but they were lucky to have been working with Rupe himself -- soon after this recording, Rupe decided to expand his operations in New Orleans, and put Johnny Vincent in charge. While Rupe has a reputation as a decent businessman by 1950s record company standards, Johnny Vincent does *not*. When Vincent later owned his own record company, Ace, he was so bad at paying the musicians that Huey \"Piano\" Smith and Mac Rebbennack had to go and hold Vincent at gunpoint while they searched his office -- and his person -- for the money he owed them. And then, a few months later, they had to do the same thing again, because being held up at gunpoint just the once wasn't enough for him to think better of ripping them off.\n\nVincent was also not a particularly skilled record producer, at least according to Rebennack. I can't repeat his comments about Vincent's approach in full, because if I use some of the words he used iTunes will restrict this podcast to adults only, but the gist is that Vincent was a con-man who knew nothing about record production.\n\nIt's probably not a massive coincidence that Dave Bartholomew stopped working for Specialty very shortly after the recording of \"Lawdy Miss Clawdy\". I've not seen a precise enough timeline to know for sure that it was Johnny Vincent's arrival at the label that persuaded Bartholomew he didn't want to work for them any more, but it seems likely to me. What I *do* know, though is that Lew Chudd heard \"Lawdy Miss Clawdy\", compared it to the records Art Young was producing for Fats Domino, and realised that he could be doing a hell of a lot better than he was. He eventually, through an intermediary, managed to persuade Bartholomew to talk to him again, and Bartholomew was hired back to work at Imperial. The same month, April 1952, that \"Lawdy Miss Clawdy\" came out, Domino and Bartholomew were back in Matassa's studio, working together again, and recording a collaboration which sounds like a true combination of both men's styles:\n\n[excerpt: \"Poor Me\" -- Fats Domino]\n\nDomino and Bartholomew would work together regularly in the studio until at least 1967, and live off and on for decades after that. And we'll hear more of their collaborations later.\n\nBut Lloyd Price wasn't hampered by the fact that his producer had gone off to another label either. His follow-up single, cut at the same session as \"Lawdy Miss Clawdy\" with the same musicians, was a double-sided hit, both sides making the top ten on the R&B charts. And the same happened with the single after that, cut with different musicians -- a song called \"Ain't it a Shame\", which may just have given Domino and Bartholomew an idea.\n\nAfter that he hit a bit of a dry spell in his career, and by 1956 he was reduced to recording a sequel to \"Lawdy Miss Clawdy\" -- \"Forgive me Clawdy\":\n\n[excerpt \"Forgive Me Clawdy\": Lloyd Price]\n\nBut then \"Lawdy Miss Clawdy\" itself got a second wind, and was covered in 1956 by both Elvis and Little Richard. This seems to have jump-started Price's career, and we'll pick up his story with his later big hits.\n\n\"Lawdy Miss Clawdy\" had a long life -- it's been recorded over the years by everyone from Paul McCartney to the Replacements -- and happily most of the major figures involved in the record did too, which makes a very pleasant change from the bit of the episode where I usually tell you that the singer died in poverty and obscurity of alcoholism. Lloyd Price is still going strong, still performing aged 85, and he released his most recent album in 2016. Art Rupe is still alive aged 101, and while I'm sad to say Fats Domino is now dead, he died only last year, aged 89, an extremely wealthy man who had received every award his peers could bestow and had been given medals by multiple Presidents.\n\nAnd, as I said at the start, this episode will go up at one minute past midnight on the twenty-fourth of December 2018, which means it's Dave Bartholomew's hundredth birthday, It's unlikely he'll ever hear it but I'd like to wish him a happy birthday anyway, and many more of them.\n\nSo to finish off... here's a record Bartholomew played on seven years ago, when he was ninety-three:\n\n[Excerpt: Alia Fleury \"Christmas in the Quarters\"]\n\nAnd for those of you who celebrate it, a merry Christmas to all of you at home.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twelve of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Lawdy Miss Clawdy\" by Lloyd Price. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nLloyd Price has written a few books. His autobiography is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written a book of essays with his thoughts on race, some of which shed light on his work.\n\nThe information on Dave Bartholomew and Fats Domino here largely comes from Blue Monday by Rick Coleman.\n\nThe Lloyd Price songs here can be found on The Complete Singles As & Bs 1952-62 while the Fats Domino tracks are on They Call Me the Fat Man\n\nErratum\n\nI used the wrong version of \"Lawdy Miss Clawdy\" when editing this podcast. The version used here is a soundalike remake from 1958, rather than the 1952 original. Apologies for the error.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThis is a rather special episode in some ways. The topic of this episode is \"Lawdy Miss Clawdy\" by Lloyd Price, and I'll be frank -- I was not originally going to give \"Lawdy Miss Clawdy\" its own episode. Not because it's not a great record -- it is -- but because I was going to deal with it in passing when I cover one of the other records made by its vocalist, Lloyd Price.\n\nBut that was before I noticed an odd coincidence of timing. I needed to prerecord this episode, because it's Christmas and I'm visiting my in-laws, and so I was looking at what records came next in the history on my timeline, and I noticed two things:\n\nThe first was that \"Lawdy Miss Clawdy\" was the next important record to be released in the timeline I'd put together. And the second was that Dave Bartholomew, that record's producer, was born one hundred years ago exactly, on December 24th, 1918.\n\nI simply couldn't pass up an opportunity to do an episode celebrating the hundredth birthday of one of the great pioneers of rock and roll music, and one who is happily still alive.\n\nWe talked about Bartholomew a bit a couple of weeks ago, in the episode about \"The Fat Man\" by Fats Domino, but he needs to be discussed in more detail, as he was one of the most important musicians of the fifties. As we heard, he brought the \"Spanish tinge\" to rhythm and blues records and collaborated with Fats Domino on all of Domino's big hits -- and we'll be hearing more about him in that context in a few weeks -- but he did a lot more. Not only did he produce classic records by Frankie Ford and T-Bone Walker, not only did he write \"One Night\", which became a big hit for Smiley Lewis and a bigger one for Elvis, but he also wrote Chuck Berry's only number one hit:\n\n[excerpt \"My Ding-A-Ling\" by Chuck Berry]\n\nOK, that may not be Berry's finest moment as a performer, but it shows just how wide Bartholomew's influence was.\n\nDespite that, rather astonishingly, there's never been a biography written of Bartholomew, and even \"Honkers and Shouters\", the classic book on the history of rhythm and blues which contains almost the only in-depth interviews with many of the musicians and record producers who made this music, only devotes a handful of paragraphs to Bartholomew's work. I've barely been able to even find any in-depth interviews with Bartholomew, and so my knowledge of him is built up from lots of offhand mentions and casual connections in books on other people.\n\nBut he worked with so *many* other people that that still amounts to quite a lot. So let's talk about \"Lawdy Miss Clawdy\", and let's do it by picking up the story of Dave Bartholomew and Fats Domino after \"The Fat Man\".\n\n\"The Fat Man\" was a massive hit, but it caused some strain between its produc",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twelve of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Lawdy Miss Clawdy\" by Lloyd Price. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nLloyd Price has written a few books. His autobiography is out of print and goes for silly money (and don't buy the \"Kindle edition\" at that link, because it's just the sheet music to the song, which Amazon have mislabelled) but he's also written a book of essays with his thoughts on race, some of which shed light on his work.\n\nThe information on Dave Bartholomew and Fats Domino here largely comes from Blue Monday by Rick Coleman.\n\nThe Lloyd Price songs here can be found on The Complete Singles As & Bs 1952-62 while the Fats Domino tracks are on They Call Me the Fat Man\n\nErratum\n\nI used the wrong version of \"Lawdy Miss Clawdy\" when",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}