{
  "title": "Fabulous Diamonds (Ritual Community Music)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Ritual Community Music",
  "itunes:summary": "Jarrod and Nisa of Fabulous Diamonds talk through how their sound has changed over their two decade collaboration with instrumentation and genre; the influence on line music and techno-feudalism; and their delayed production flow that keeps them moving into new musical territories.\n\nFabulous Diamonds are the long-running duo of Nisa Venerosa and Jarrod Zlatic producing uneasy and understated chamber songs for the neo-feudal age. While in the past their music has drawn from a wellspring of dubby post-punk and bubblegum-minimalism their current approach takes its cues from twentieth century art song and contemporary sound design; tenor vocals and choralesque keyboards play atop sparse, muffled rhythms and ambiguous soundscapes.\n\nhttps://liquidarchitecture.org.au/events/lyra-pramuk-fabulous-diamonds\n\nRitual Community Music\n17 July 2022\nThe Oratory, Abbotsford Convent\nPresented by Abbotsford Convent and Liquid Architecture\n\nhttps://www.patreon.com/liquidarchitecture\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month. \n\nProduced by Mara Schwerdtfeger. \n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/fabulous-diamonds-ritual-community-music",
  "pubDate": "Tue, 12 Jul 2022 08:00:00 +1000",
  "itunes:duration": "13:38",
  "itunes:explicit": "no"
}