{
  "title": "200: OUR 200TH EPISODE! Our Most Hilarious Clips and Favorite Moments",
  "link": "https://audioboom.com/posts/7954639",
  "itunes:episode": 200,
  "itunes:title": "OUR 200TH EPISODE! Our Most Hilarious Clips and Favorite Moments",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4325,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>FAM!! To celebrate this HUGE milestone, we're doing something we've never done before! Patrick and Gillian are surprising each other with their favorite clips TCO's funniest moments! From Patti Peterson to bears pooping in the woods and all the New Jersey-iest theme parks and serial killers in between, get ready to pull your automobile over, bash your garbage bell, and pull out your chloroform, because today's show is going to be like nothing you've ever heard. AND DON'T WORRY, WE'RE BACK TO THE MURDER DOCS NEXT WEEK!<br>\n<br>\nALSO! <a href=\"https://shop.truecrimeobsessed.com/\">OUR MERCH STORE IS NOW OPEN!!! </a>Check out our brand new designs <a href=\"https://shop.truecrimeobsessed.com/\">by going here!</a> We've got Let The Women Do The Work t-shirts and hoodies, Bears Gonna Bear, Camping shade for days, mugs, phone cases, notebooks, and so much more!! <a href=\"https://shop.truecrimeobsessed.com/\">Grab your stuff now, the store is only open for a limited time!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a> </div>\n",
  "pubDate": "Tue, 05 Oct 2021 10:15:00 +0000",
  "guid": "tag:audioboom.com,2021-10-05:/posts/7954639",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}