{
  "id": "https://bibleinoneyear.org/en/youth/348",
  "title": "Day 348: Doing Hard Things the Right Way",
  "description": "Proverbs 30:11–14, Esther 9:1b,2b,20a,21–22, Revelation 5:1–9,11–14.  Lewis shows how Jesus can be both ‘the *Lion* of the tribe of Judah’ (Revelation 5:5) and ‘a *Lamb \\[that\\] had been slain*’ (v 6)",
  "pubDate": "Tue, 14 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/348/?ignore",
  "itunes:duration": "14:22",
  "guid": "enyouth14122021-348",
  "length": 862.96,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 348: Doing Hard Things the Right Way",
  "itunes:subtitle": "Proverbs 30:11–14, Esther 9:1b,2b,20a,21–22, Revelation 5:1–9,11–14.  Lewis shows how Jesus can be both ‘the *Lion* of the tribe of Judah’ (Revelation 5:5) and ‘a *Lamb \\[that\\] had been slain*’ (v 6)",
  "itunes:summary": "Doing hard things requires us to be lion-like – bold, steely and courageous. Doing things the right way means being like a lamb – gentle, meek and submissive. We are supposed to be a godly mixture of the qualities of both the lion and the lamb.\nBut how can one person be both ‘the Lion’ and ‘the Lamb’?\nIn C.S. Lewis’s Narnia books, the lion, Aslan, represents Jesus. In the most famous of these books, The Lion, the Witch and the Wardrobe, Aslan is slain:\n‘“Bind him, I say!” repeated the White Witch... “Let him first be shaved” … the shorn face of Aslan looked… braver, and more beautiful, and more patient than ever. “Muzzle him!” said the Witch… the whole crowd of creatures kicking him, hitting him, spitting on him, jeering at him… They began to drag the bound and muzzled Lion to the Stone Table.’\nLater, ‘they heard from behind them a loud noise – a great cracking, deafening noise… The Stone Table was broken into two pieces by a great crack that ran down it from end to end… There, shining in the sunrise, larger than they had seen him before, shaking his mane (for it had apparently grown again) stood Aslan himself.’ Aslan tells them that ‘when a willing victim who had committed no treachery was killed in a traitor’s stead, the Table would crack and Death itself would start working backwards.’\nIn the book of Revelation, we see Jesus is standing at the centre of the throne of heaven. He is the Lion and the Lamb. He is both triumphant (‘has triumphed’, 5:5) and slain (‘you were slain’, v.9). In an imaginative and powerful way, C.S. Lewis shows how Jesus can be both ‘the Lion of the tribe of Judah’ (Revelation 5:5) and ‘a Lamb [that] had been slain’ (v.6).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 348
}