{
  "title": "Curtailing Environmental Harms in Armed Conflict",
  "link": "https://www.hrw.org/news/2022/11/04/curtailing-environmental-harms-armed-conflict",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        A slime-pit from a local phenol manufacturing plant on the outskirts of New York, formerly Novgorodske, on the front line in the Donetsk region of eastern Ukraine, July 2021.\n                    © 2021 Andriy Andriyenko/SOPA Images via AP Images\n          \n\n  \n<p>November 6 is the International Day for Preventing the Exploitation of the Environment in War and Armed Conflict. The environment is often a silent casualty of war, so the day is an important opportunity to reflect on the ways armed conflicts often damage the environment and the need to safeguard the long-term health, security, and livelihood of the people affected.</p>\n\n<p>Like much of the fallout from war, environmental harm lasts well beyond the armed conflict itself. For example, toxic remnants of explosives can lead to contamination of water and soil, which can last for decades.</p>\n\n<p>This year is special. Last week, the United Nations General Assembly concluded the debate on the 27 principles for the Protection of the Environment in Relation to Armed Conflict (PERAC), and will soon vote on their adoption. This outcome is the result of nearly a decade of work by the UN International Law Commission to articulate the legal framework for better protection of the environment, “before, during or after an armed conflict, including in situations of occupation.”</p>\n\n<p>The PERAC principles reflect a number of important points. For example, they call upon governments and international organizations to cooperate on conducting post-conflict assessments and remediation of environmental damage, including where remnants of war put public health in danger and have a profound long-term impact on people’s security and livelihood.</p>\n\n<p>The war in Ukraine, a heavily industrialized country, is having a devastating impact on the country’s environment. Since Russia’s full-scale invasion in February, the conflict has brought incalculable human suffering, including through environmental damage. For example, Russian forces’ bombardment of industrial infrastructure and chemical plants has led to toxic gas leaks (ammonia and hydrogen sulfide). Their attacks on the Azovstal iron and steel works in Mariupol have damaged water treatment facilities and increased environmental health hazards.</p>\n\n<p>People’s security and livelihood depend on a clean and healthy environment. It is therefore crucial to protect ecosystems during armed conflict as well as in peacetime.</p>",
  "pubDate": "Fri, 04 Nov 2022 16:17:23 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/04/curtailing-environmental-harms-armed-conflict"
}