{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-8425078597468727884",
  "published": "2018-09-18T09:36:00.000-07:00",
  "updated": "2018-09-18T09:36:00.824-07:00",
  "title": "Gaming gets a new home on YouTube",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><i>Cross-posted from the&nbsp;<a href=\"https://youtube.googleblog.com/2018/09/gaming-gets-new-home-on-youtube.html\" target=\"_blank\">Official YouTube Blog</a></i><br /><div><br /></div>YouTube is where the world watches gaming. More than 200 million of you come to YouTube every single day to watch gaming videos and streams. That’s like the entire country of Brazil heading to YouTube daily. And that’s because of you, the community of gamers and creators who have turned YouTube into the gaming video platform it is today. From mobile gaming to strategy guides, Let’s Plays to Esports and charity live streams, you’ve created a place for everyone, from hard core to casual gamers. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-19EpHD6HTM4/W5__l36CukI/AAAAAAAACHU/f6MsqFqaVjQpF2TpSYd8A0umprf8TVZhwCLcBGAs/s1600/YT_Gaming_Infographic_17Sept_EN-US.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"546\" src=\"https://3.bp.blogspot.com/-19EpHD6HTM4/W5__l36CukI/AAAAAAAACHU/f6MsqFqaVjQpF2TpSYd8A0umprf8TVZhwCLcBGAs/s1600/YT_Gaming_Infographic_17Sept_EN-US.png\" /></a></div><br /><br />We’re always working to make the gaming experience on YouTube better. Over the past few years we’ve focused on building tools and experiences that the gaming community has been asking for. That’s why in 2015, we launched <a href=\"https://youtube.googleblog.com/2015/06/a-youtube-built-for-gamers.html\" target=\"_blank\">YouTube Gaming</a>, a standalone app for gamers where we tested new features like Game Pages for better discoverability, Super Chat and Channel Memberships to help fans show support for their favorite creators, Dark Theme and even a new live streaming platform based on the gaming community’s feedback. The response to these features has been so positive that we brought them over from the YouTube Gaming app to the main YouTube experience. <br /><br />Today, we’re launching a new Gaming destination to give gamers a home on YouTube! You can find the new YouTube Gaming destination at <a href=\"https://youtube.com/gaming\">youtube.com/gaming</a>. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-n3HohRcaH_I/W6B2loynMPI/AAAAAAAACIA/S-7aAso6hOY8K1IlU5ELcUFJ-9nDLgnZQCLcBGAs/s1600/Screen%2BShot%2B2018-09-17%2Bat%2B8.51.14%2BPM.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1152\" data-original-width=\"1308\" src=\"https://3.bp.blogspot.com/-n3HohRcaH_I/W6B2loynMPI/AAAAAAAACIA/S-7aAso6hOY8K1IlU5ELcUFJ-9nDLgnZQCLcBGAs/s1600/Screen%2BShot%2B2018-09-17%2Bat%2B8.51.14%2BPM.png\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br />At the very top of the page you’ll see personalized gaming content based on what you like to watch. You’ll also see top live games and the latest gaming videos from your subscriptions, bringing the best of uploaded videos and live gaming to one destination. We’ve also built dedicated shelves for live streams and trending videos. <br /><br />Everyone has a favorite game. You can now find gaming videos from all over YouTube, related to that specific game on new game pages. These include popular videos, live streams, and other games from the same publisher or developer. With tens of thousands of different game pages, you’ll be able to find content no matter how big or small the game is.<br /><br />We want to do more to help our smaller creators grow on YouTube too, so we’ll be highlighting gaming creators who are “On The Rise” on the Gaming destination and in Trending. Each week we’ll showcase a new up and coming gaming creator to help more fans discover their content. This is launching in the U.S., and we’ll continue to roll this out to more countries in the future.  <br /><br />We have a strong and vibrant audience on the YouTube Gaming app, but the amount of gamers we are able to reach is far bigger on YouTube. After all, YouTube is where more than 200 million gamers come to engage with your favorite games and creators every day, watching over 50 billion hours of gaming content in the last 12 months alone. That’s why, in March 2019, we’ll retire the YouTube Gaming app and focus all of our gaming efforts on YouTube where we can reach our entire gaming community.<br /><br />From creators like elrubiusOMG who has <a href=\"https://twitter.com/Fwiz/status/978360614249615360\" target=\"_blank\">hit live gaming records</a>, to Ninja, the fastest growing creator in YouTube’s history who helped usher in the era of Fortnite, or itsFunneh who became one of our biggest gaming creators by making us all laugh with Minecraft and Roblox videos, we thank you for building a strong gaming community on YouTube. We’re committed to helping gaming creators succeed and look forward to seeing how you all continue to shape the future of gaming. <br /><br /><a href=\"https://gaming.youtube.com/\">Visit the new YouTube Gaming</a><br /><br /><i>Posted by Christina Chen, Director of Product Management, who recently watched <a href=\"https://www.youtube.com/watch?v=hndyTy3uiZM\" target=\"_blank\">Warbringers: Azshara</a></i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}