{
  "title": "73: Dr. Judith Orloff- The Empath’s Survival Guide: Life Strategies for Sensitive People",
  "pubDate": "Thu, 25 May 2017 15:20:58 +0000",
  "guid": "360fc1a8732868fcdc099a22736e5a86",
  "link": "https://lifeonpurpose.libsyn.com/73-dr-judith-orloff-the-empaths-survival-guide-life-strategies-for-sensitive-people",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #73</strong>, my guest is the pioneering therapist <strong>Dr. Judith Orloff</strong>, a New York Times best-selling author and Assistant Clinical Professor of Psychiatry at UCLA who has helped patients find emotional freedom for more than 20 years. Dr. Orloff synthesizes the pearls of traditional medicine with cutting edge knowledge of intuition, energy, and spirituality to achieve physical and emotional healing.<br /> <br /> In this enlightening conversation, we discussed her brand new book, <strong>The Empath’s Survival Guide: Life Strategies for Sensitive People</strong> <em>(Sounds True)</em>, in which she offers an invaluable resource to help EMPATHIC people survive in an often insensitive world, plus her life and career as \"the positive energy guru.\"<br /> <br /> <em>“Empaths feel things first, then think, which is the opposite of how most people function in our over- intellectualized society,” says Dr. Orloff. \"The key to self-care is to recognize when you’re experiencing the first signs of sensory overload or when you start absorbing negativity or stress from others. The sooner you can act to reduce stimulation and to center yourself, the more balanced and protected you will be.\"</em><br /> <br /> About: Transforming the face of psychiatry, <strong>Judith Orloff MD</strong> asserts that we are keepers of an innate intuitive intelligence so perceptive that it can tell us how to heal -- and prevent -- illness. Yet intuition and spirituality are the very aspects of our wisdom usually disenfranchised from traditional health care.<br /> <br /> Dr. Orloff is accomplishing for psychiatry what physicians like Dean Ornish and Mehmet Oz have done for mainstream medicine -- she is proving that the links between physical, emotional, and spiritual health can't be ignored. Dr. Orloff is a New York Times bestselling author and is on the UCLA psychiatric clinical faculty. She specializes in treating empaths and sensitive people in her Los Angeles based private practice.<br /> <br /> She has spoken at medical schools, hospitals, the American Psychiatric Association, Fortune Magazine's Most Powerful Women Summit, and alternative and traditional health forums -- venues where she presents practical intuitive tools to doctors, patients, and everyday people. In response to her work, The Los Angeles Times calls Dr. Orloff \"a prominent energy-based healer.\"<br /> <br /> Dr. Orloff's latest book “The Empath’s Survival Guide: Life Strategies for Sensitive People” (Sounds True, 2017) is an invaluable resource to help sensitive people of all kinds develop healthy coping mechanisms in our high-stimulus world without experiencing compassion fatigue or burnout. Then empaths can fully embody their gifts of intuition, creativity, and compassion.<br /> <br /> In Dr. Orloff’s first book, \"Second Sight\" she chronicles her struggles acknowledging and then finally embracing her gift of intuition. Her second book, \"Dr. Orloff's: Guide to Intuitive Healing\" shows how breakthroughs in healing our body, emotions, and sexuality can be accomplished by listening to intuition.  <br /> <br /> \"Positive Energy,\" which has been translated into 25 languages, takes a probing look at the American epidemic of exhaustion and how we can reverse it using specific strategies to build energy and combat draining people. Her New York Times Bestseller, \"Emotional Freedom\" describes how to transform negative emotions into positive ones with specific techniques.<br /> <br /> Finally, \"The Power of Surrender\" describes the power of letting go in everyday life, health, and wellness--an enlivening and sane alternative to pushing, forcing, and over controlling people and situations.<br /> <br /> Dr. Orloff's work has been featured in O Magazine, Forbes, Newsweek, USA Today, the Wall Street Journal, Self, Cosmo, The Washington Times, Teen Vogue, Scientific American, and the New York Post. She has appeared on The Today Show, The Dr. Oz Show, CBS Early Show, CNN, PBS, BBC5, and NPR. Dr. Orloff is also an  Elephant Journal, Huffington Post, and Psychology Today, blogger.<br /> <br /> To learn more about <strong>Dr. Orloff</strong>'s work, visit: <a href=\"http://www.drjudithorloff.com/\" target= \"_blank\">http://www.drjudithorloff.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #73, my guest is the pioneering therapist Dr. Judith Orloff, a New York Times best-selling author and Assistant Clinical Professor of Psychiatry at UCLA who has helped patients find emotional freedom for more than 20 years. Dr. Orloff synthesizes the pearls of traditional medicine with cutting edge knowledge of intuition, energy, and spirituality to achieve physical and emotional healing.  In this enlightening conversation, we discussed her brand new book, The Empath’s Survival Guide: Life Strategies for Sensitive People <em>(Sounds True)</em>, in which she offers an invaluable resource to help EMPATHIC people survive in an often insensitive world, plus her life and career as \"the positive energy guru.\"  <em>“Empaths feel things first, then think, which is the opposite of how most people function in our over- intellectualized society,” says Dr. Orloff. \"The key to self-care is to recognize when you’re experiencing the first signs of sensory overload or when you start absorbing negativity or stress from others. The sooner you can act to reduce stimulation and to center yourself, the more balanced and protected you will be.\"</em>  About: Transforming the face of psychiatry, Judith Orloff MD asserts that we are keepers of an innate intuitive intelligence so perceptive that it can tell us how to heal -- and prevent -- illness. Yet intuition and spirituality are the very aspects of our wisdom usually disenfranchised from traditional health care.  Dr. Orloff is accomplishing for psychiatry what physicians like Dean Ornish and Mehmet Oz have done for mainstream medicine -- she is proving that the links between physical, emotional, and spiritual health can't be ignored. Dr. Orloff is a New York Times bestselling author and is on the UCLA psychiatric clinical faculty. She specializes in treating empaths and sensitive people in her Los Angeles based private practice.  She has spoken at medical schools, hospitals, the American Psychiatric Association, Fortune Magazine's Most Powerful Women Summit, and alternative and traditional health forums -- venues where she presents practical intuitive tools to doctors, patients, and everyday people. In response to her work, The Los Angeles Times calls Dr. Orloff \"a prominent energy-based healer.\"  Dr. Orloff's latest book “The Empath’s Survival Guide: Life Strategies for Sensitive People” (Sounds True, 2017) is an invaluable resource to help sensitive people of all kinds develop healthy coping mechanisms in our high-stimulus world without experiencing compassion fatigue or burnout. Then empaths can fully embody their gifts of intuition, creativity, and compassion.  In Dr. Orloff’s first book, \"Second Sight\" she chronicles her struggles acknowledging and then finally embracing her gift of intuition. Her second book, \"Dr. Orloff's: Guide to Intuitive Healing\" shows how breakthroughs in healing our body, emotions, and sexuality can be accomplished by listening to intuition.    \"Positive Energy,\" which has been translated into 25 languages, takes a probing look at the American epidemic of exhaustion and how we can reverse it using specific strategies to build energy and combat draining people. Her New York Times Bestseller, \"Emotional Freedom\" describes how to transform negative emotions into positive ones with specific techniques.  Finally, \"The Power of Surrender\" describes the power of letting go in everyday life, health, and wellness--an enlivening and sane alternative to pushing, forcing, and over controlling people and situations.  Dr. Orloff's work has been featured in O Magazine, Forbes, Newsweek, USA Today, the Wall Street Journal, Self, Cosmo, The Washington Times, Teen Vogue, Scientific American, and the New York Post. She has appeared on The Today Show, The Dr. Oz Show, CBS Early Show, CNN, PBS, BBC5, and NPR. Dr. Orloff is also an  Elephant Journal, Huffington Post, and Psychology Today, blogger.  To learn more about Dr. Orloff's work, visit: <a href=\"http://www.drjudithorloff.com/\" target= \"_blank\">http://www.drjudithorloff.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "31:49",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #73, my guest is the pioneering therapist Dr. Judith Orloff, a New York Times best-selling author and Assistant Clinical Professor of Psychiatry at UCLA who has helped patients find emotional freedom for more than 20 years...."
}