{
  "title": "The Photospheric Imprints of Coronal Electric Currents. (arXiv:2211.01911v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01911",
  "description": "<p>Flares and coronal mass ejections are powered by magnetic energy stored in\ncoronal electric currents. Here, we explore the nature of coronal currents in\nobserved and model active region (ARs) by studying manifestations of these\ncurrents in photospheric vector magnetograms. We employ Gauss's separation\nmethod, recently introduced to the solar physics literature, to partition the\nphotospheric field into three distinct components, each arising from a separate\nsource: (i) currents passing through the photosphere, (ii) currents flowing\nbelow it, and (iii) currents flowing above it. We refer to component (iii) as\nthe photospheric imprint of coronal currents. In both AR 10930 and AR 11158,\nphotospheric imprints exhibit large-scale, spatially coherent structures along\nthese regions' central, sheared polarity inversion lines (PILs) that are\nconsistent with coronal currents flowing horizontally above these PILs, similar\nto recent findings in AR 12673 by Schuck et al. (2022). We find similar\nphotospheric imprints in a simple model of a non-potential AR with known\ncurrents. We find that flare-associated changes in photospheric imprints in AR\n11158 accord with earlier reports that near-PIL fields become more horizontal,\nconsistent with the \"implosion\" scenario. We hypothesize that this evolution\neffectively shortens, in an overall sense, current-carrying coronal fields,\nleading to decreased inductive energy (DIE) in the coronal field. We further\nhypothesize that, in the hours prior to flares, parts of the coronal field\nslowly expand, in a process we deem coronal inflation (CI) -- essentially, the\ninverse of the implosion process. Both of these hypotheses are testable with\nnon-potential coronal field extrapolations.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Welsch_B/0/1/0/all/0/1\">Brian T. Welsch</a>"
}