{
  "id": "https://bibleinoneyear.org/en/youth/166",
  "title": "Day 166: When You Don’t Understand God",
  "description": "Psalm 74:1,9, 2 Samuel 24:10,14,25, Acts 9:34–37,40–42, 10:9–16.  Sometimes that understanding may come in our lifetime  Some things we will only understand when we meet the Lord",
  "pubDate": "Tue, 15 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/166/?ignore",
  "itunes:duration": "15:10",
  "guid": "enyouth15062021-166",
  "length": 910.84,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 166: When You Don’t Understand God",
  "itunes:subtitle": "Psalm 74:1,9, 2 Samuel 24:10,14,25, Acts 9:34–37,40–42, 10:9–16.  Sometimes that understanding may come in our lifetime  Some things we will only understand when we meet the Lord",
  "itunes:summary": "John Newton, whose life we looked at yesterday, mentored a man called William Cowper (1731–1800). Cowper had experienced tragedy. His mother died when he was six. His father died while he was still young. He qualified as a barrister. Outwardly he was successful. However, he suffered from serious depression. When applying for an administrative post in the House of Lords that entailed a formal examination, he was so disturbed by the prospect of the exam that he attempted to take his own life. For the rest of his life he suffered from mental illness.\nWhen he was in his thirties, John Newton encouraged Cowper to begin composing hymns. He wrote powerfully of the joys and sorrows of everyday life. In 1774, he suffered such a severe episode of mental illness that he was prevented from entering into his intended marriage to Mary Unwin. He was crestfallen. Shortly afterwards, in perhaps his most famous hymn, he wrote:\nGod moves in a mysterious way\nHis wonders to perform\nGod is good. God is love. God loves you. God has revealed himself supremely in Jesus. All this we know. Then you read passages in the Bible that don’t seem to fit with your understanding of God. You may also have experiences in life that don’t seem to fit either.\nYou cannot put God in a box. He is far greater than you could ever conceive. Some passages in the Bible are mysterious. Jesus said on one occasion, ‘You do not realise now what I am doing, but later you will understand’ (John 13:7). Sometimes that understanding may come in our lifetime. Some things we will only understand when we meet the Lord.\nHow should you respond when you don’t understand God?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 166
}