{
  "title": "Watch someone use MagSafe to save their iPhone from a floorboard disaster",
  "link": "https://www.digitaltrends.com/mobile/watch-someone-use-magsafe-to-save-their-iphone-floorboard-disaster/",
  "pubDate": "Fri, 04 Nov 2022 19:02:02 +0000",
  "dc:creator": "Cristina Alexander",
  "category": [
    "Mobile",
    "News",
    "Apple",
    "Apple MagSafe Duo Charger",
    "iPhone 14 Plus",
    "magsafe"
  ],
  "guid": "https://www.digitaltrends.com/?p=3220330",
  "description": "An iPhone slipping through the cracks of a floorboard can be anyone's worst nightmare. But if you have a MagSafe charger, all hope may not be lost.",
  "content:encoded": "<p>Dropping an iPhone through the cracks of the floor sounds like a nightmare for anybody who owns one. David Cogen, founder of <a href=\"https://theunlockr.com/author/dcogen/\" target=\"_blank\" rel=\"noopener\">TheUnlockr.com</a>, lived this particular nightmare when he dropped his <a href=\"https://www.digitaltrends.com/mobile/apple-iphone-14-plus-review/\">iPhone 14 Plus</a> and it slipped beneath the floorboards during a night out at a bar. Luckily, <a href=\"https://www.digitaltrends.com/mobile/my-favorite-apple-iphone-14-feature-magsafe-why/\">MagSafe</a> came to the rescue.</p>\n<p>Cogen shared a video on Twitter on Thursday showing the exact moment he dropped his iPhone 14 Plus through the floorboard at a local bar the night before — and everyone who attempted to help him fish it out from underneath, including the bar manager, using various tools to no avail. The next day, he returned to the bar, slipped a MagSafe Duo charger through the crack of the floorboard, and successfully fished his phone back to the surface and his hand.</p>\n<blockquote class=\"h-lazy-embed\" data-width=\"500\" data-dnt=\"true\" data-initial-classes=\"twitter-tweet\" data-embed-name=\"twitter\" data-sdk-src=\"//platform.twitter.com/widgets.js\">\n<p lang=\"en\" dir=\"ltr\">My brand new <a href=\"https://twitter.com/Apple?ref_src=twsrc%5Etfw\">@apple</a> iPhone 14 Plus fell through the floorboards of a bar &#129318;&zwj;&#9794;&#65039;&#8288;<br />&#8288;<br />Huge thanks to <a href=\"https://twitter.com/dunnadidit?ref_src=twsrc%5Etfw\">@dunnadidit</a> for filming the endeavor and <a href=\"https://twitter.com/ryan_kao?ref_src=twsrc%5Etfw\">@ryan_kao</a> for trying so hard to help me &#128591; <a href=\"https://t.co/5QlkOov3gD\">pic.twitter.com/5QlkOov3gD</a></p>\n<p>&mdash; David Cogen (@theunlockr) <a href=\"https://twitter.com/theunlockr/status/1588195186315780097?ref_src=twsrc%5Etfw\">November 3, 2022</a></p></blockquote>\n<p>For the uninitiated, MagSafe was initially created as a magnetic charger for MacBooks that would slip out of the charging port instead of dragging the device down to the ground if someone accidentally trips over it. Today, Apple uses MagSafe as a ring of magnets embedded into the iPhone to hold MagSafe accessories — like the aforementioned MagSafe Duo charger, phone cases, and even card holders. Apple introduced MagSafe with the iPhone 12 series, continued it with the iPhone 13, and brought it back once more with the iPhone 14 family.</p>\n<p>MagSafe chargers are designed to allow iPhone users to charge their phones wirelessly without the need to plug a Lightning cable into the charging port. Now, after Cogen&#8217;s dilemma, we know that they also serve as magnetic fishing hooks to help retrieve iPhones that have fallen between a rock and a hard place. Or, in his case, under the floorboard of a bar.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2020/11/iphone-12-pro-max-with-magsafe-scaled.jpg?p=1",
  "enclosure": "",
  "post-id": 3220330
}