{
  "title": "Virgin pulls its name from Hyperloop One (update)",
  "description": "<p>Virgin Hyperloop, the startup attempting to bring Elon Musk’s vision of high-speed trains to life, has changed its name. At some point in the last few weeks, the company quietly changed its name back to <a href=\"https://www.engadget.com/2017-10-12-richard-branson-and-virgin-join-forces-with-hyperloop-one.html\">Hyperloop One</a>, the brand it used between 2016 and 2017.</p><p>In a statement, Virgin Group said that it had “decided to work with Virgin Hyperloop’s management team to remove the Virgin brand from the business.” This was prompted by “Virgin Hyperloop’s change in short-term priorities,” namely its switch from building <a href=\"https://www.engadget.com/virgin-hyperloop-kills-passenger-transport-go-cargo-only-111823967.html\">passenger transport to a cargo-only service</a>.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>Engadget spotted the change, noticing that the company had scrubbed its website clean with an old stock image of its <a href=\"https://www.engadget.com/2017-08-02-hyperloop-one-first-pod-xp1-test.html\">XP-1 test pod</a> and the claim that “It’s a new day at Hyperloop One.” The company’s <a href=\"https://twitter.com/hyperloop__one\">Twitter</a>, <a href=\"https://shopping.yahoo.com/rdlw?merchantId=6deefbf2-941b-4156-9f41-a61ebb50d13d&siteId=us-engadget&pageId=1p-autolink&featureId=text-link&merchantName=LinkedIn&custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsInN0b3JlSWQiOiI2ZGVlZmJmMi05NDFiLTQxNTYtOWY0MS1hNjFlYmI1MGQxM2QiLCJsYW5kaW5nVXJsIjoiaHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2NvbXBhbnkvaHlwZXJsb29wb25lL2Fib3V0LyIsImNvbnRlbnRVdWlkIjoiZTA0NmEwMmItOTBlZC00OTMxLTlmMzktMjRjZjVhMTQ3MDc5In0&signature=AQAAAZXP2rEorx4j0XWzT1Z_Ro_OsiZzJJmH1IbfG-8ohPvM&gcReferrer=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fhyperloopone%2Fabout%2F\">LinkedIn</a> and <a href=\"https://www.instagram.com/virginhyperloop/?hl=en\">Instagram</a> accounts were also reverted to the new old name.&nbsp;</p><p>The company has certainly had a tumultuous year, laying off 111 staffers back in February as it abandoned plans to build passenger transport. After that, majority owner DP World said that it would pivot toward using the technology for logistics, enabling the construction of \"inland ports\" to ferry cargo containers to their eventual destination faster than the present system.</p><p><strong>Update Nov 5th, 3:11am ET:</strong> This story has been updated after Virgin Group confirmed the split with a statement, added below in full.</p><blockquote><p>Virgin Group has supported the team at Virgin Hyperloop’s vision of reinventing global mass transportation since it was founded in 2014. During this time, Virgin Group has been proud to support the innovation driving Virgin Hyperloop, which has achieved historic milestones such as the world’s first passenger journey using hyperloop technology.&nbsp;&nbsp;</p></blockquote><blockquote><p>Virgin Hyperloop recently took the decision in response to market demand to focus its immediate efforts on cargo-based solutions. Due to Virgin Hyperloop’s change in short-term priorities and having discussed it with the board of Virgin Hyperloop and its shareholders, Virgin Group has decided to work with Virgin Hyperloop’s management team to remove the Virgin brand from the business. We would like to thank the team at Virgin Hyperloop for their hard work and commitment over the years and wish them every success in the future.&nbsp;</p></blockquote>",
  "link": "https://www.engadget.com/virgin-hyperloop-one-name-change-221202324.html?src=rss",
  "source_id": "engadget_479",
  "guid": "e046a02b-90ed-4931-9f39-24cf5a147079",
  "dc:creator": "Daniel Cooper",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 22:12:02 +0000",
  "ingested": 1667632796,
  "modified": "2022-11-05T07:19:59+00:00",
  "category": [
    "Travel Organizations",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Daniel Cooper"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Hyperloop One",
      "media:description": "Image taken from Hyperloop One's website on November 4th, 2022",
      "media:title": "Hyperloop One Splash"
    }
  ]
}