{
  "title": "Episode 26: &#8220;Ain&#8217;t That A Shame&#8221; by Fats Domino",
  "link": "https://500songs.com/podcast/episode-26-aint-that-a-shame-by-fats-domino/",
  "pubDate": "Mon, 01 Apr 2019 01:12:49 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-26-aint-that-a-shame-by-fats-domino/",
  "description": "Welcome to episode twenty-six of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Fats Domino and \"Ain't That A Shame\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-26-aint-that-a-shame/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called <a href=\"https://amzn.to/2PT704t\"><em>They Call Me The Fat Man: The Legendary Imperial Recordings</em></a>.\n\nPretty much all the information in this episode comes from Rick Coleman's <a href=\"https://amzn.to/2QhFZqP\"><em>Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll</em></a>. I've leaned on that rather more than I normally lean on a single source for this episode, because it's the only biography of Domino I know of, and we're looking at Domino in more depth than most other artists we've looked at so far.\n\nI reference two previous episodes here. Those are<a href=\"https://www.500songs.com/e/episode-8-the-fat-man\"> episode eight on The Fat Man</a>, and <a href=\"https://www.500songs.com/e/episode-12-lawdy-miss-clawdy-by-lloyd-price/\">episode twelve, on Lawdy Miss Clawdy</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, for the third time, we're going to look at the collaborations between Fats Domino, Dave Bartholomew, and Cosimo Matassa, and the way they brought New Orleans music into the R&B and rock and roll genres. It's been a few months since we talked about them, so you might want to refresh your memory by listening to episode eight, on \"The Fat Man\", and episode twelve, on \"Lawdy Miss Clawdy\".\n\nAfter his brief split from Imperial Records, and thus from working with Fats Domino, Dave Bartholomew had returned to Imperial after Domino helped him on \"Lawdy Miss Clawdy\", and the two of them resumed their collaboration.\n\nThe first new track they recorded together was an instrumental called \"Dreaming\", featuring members of both Domino's touring band and of Bartholomew's studio band. It's credited on the label to Bartholomew as a writer, but other sources have the instrumental being written by Domino:\n\n[excerpt: Fats Domino, \"Dreaming\"]\n\nWhoever wrote it, the most popular hypothesis seems to be that the song was written as a tribute to Domino's manager, Melvin Cade, who had died only five days before the session. Domino had been sleeping in the back of Cade's car, as Cade had been speeding to get them to a show that they were late for. Cade had lost control of the car, which had been thrown ten feet into the air in a collision. Domino and the other passengers were uninjured, but Cade died of his injuries.\n\nWhile this was obviously tragic, it turned out to be to Domino's benefit -- Domino's contract with Cade had given Domino only a hundred and fifty dollars a day from his shows, with Cade keeping the rest -- which might often be several times as much money. With Cade's death, Domino was free from that contract, and so the beginning of September 1952, with the death of Cade and the renewal of Domino and Bartholomew's partnership, marks the start of the second phase of Fats Domino's career.\n\nOne of the things we've touched on in the previous podcasts about Dave Bartholomew and Fats Domino is the strained nature of their songwriting partnership -- although this is using \"strained\" in a fairly loose sense, given that they continued working with each other for decades. But like with so many musical partnerships where the whole is greater than the sum of the parts, both men did consider their own contribution to be the more important. Bartholomew considered himself to be the more important writer because he came up with literate stories with narrative arcs and punchlines, coupled with sophisticated musical ideas, while Domino considered himself more important because he came up with relatable, simple, ideas and catchy hooks.\n\nAnd, of course, Domino's piano style and distinctive voice were crucial in the popularity of the records, just as Dave Bartholomew's arrangement and production ideas were.\n\nAnd the difference in their attitudes shows up in, for example, \"Going to the River\", one of the first fruits of their renewed collaboration:\n\n[Excerpt: Fats Domino, \"Going to the River\"]\n\nDave Bartholomew called that \"a nothing song\" -- and it's easy to see what he means. Other than the tresilo bassline (and a reminder for those of you who don't remember what that is, it's that \"bom, BOM bom\" rhythmic figure that you get in almost every record Dave Bartholomew had a hand in) there's not much of musical interest there -- you've got Domino playing his usual triplets in the right hand on the piano, but rather than the drums emphasising the backbeat, they're mostly playing the same triplets as the piano. The chord sequence is nothing special. and the lyrics were simplistic.\n\nBut at the same time, the track did go to number two on the R&B charts, and probably would have gone to number one if it hadn't been for the cover version by Chuck Willis:\n\n[Excerpt: Chuck Willis, \"Going to the River\"]\n\nThat went to number four on the R&B charts. For once it wasn't a white man having a hit with a black man's song, but another black man, who'd heard Domino perform it live before the record was released and got in quickly with his own version.\n\nOn the other hand, it wasn't like Domino was the perfect judge of what made a hit, either. Bartholomew wrote the song \"I Hear You Knocking\" for Domino, but when Domino decided not to record it, Bartholomew recorded it for another artist on Imperial Records, Smiley Lewis, getting the great New Orleans piano player Huey \"Piano\" Smith to play in an imitation of Domino's style:\n\n[Excerpt: Smiley Lewis, \"I Hear You Knocking\"]\n\nThat went to number two on the R&B charts, and a cover version by the white singer Gale Storm went to number two on the pop charts.\n\nSo both Domino and Bartholomew were capable of coming up with big hits in the style they perfected together, and both were capable of dismissing a potential hit when it wasn't their own idea. But their partnership was so successful that Dave Bartholomew actually regarded Smiley Lewis as a \"bad luck singer\", because when Bartholomew wrote and produced for him, the records would *only* sell a hundred thousand copies or so, compared to the much larger numbers of records that Domino sold.\n\nDomino was becoming huge in the R&B world -- in early 1954 Billboard listed him as the biggest selling R&B star in the country -- and he was managing to cope with it better than most. While he would miss the occasional gig from drinking a little too much, and he'd sleep around on the road more than a married man should, he was essentially a well-adjusted, private, man, who had five kids, phoned home to his wife every night, and never touched anything stronger than alcohol.\n\nThat wasn't true of the rest of his band, however. In the 1950s, heroin was the chic drug to be taking if you were a touring musician, and many of Domino's touring band members were users. He would often have to pay to get his guitarist's instrument out of the pawn shop, so they could go on tour, and once even had to pay off the guitarist's back child support, to get him out of jail, as he would keep spending all his money on heroin.\n\nThe one who came out worst, sadly, was Jimmy Gilchrist, who would sing with Domino's backing band as the support act. Gilchrist died of an overdose during one of Domino's tours in early 1954. Domino replaced him with a new support act, Jalacey Hawkins, but he only lasted a couple of weeks. According to Domino, he fired Jalacey for being too vulgar on stage, and screaming, but Screamin' Jay Hawkins, as he would soon become known, claimed instead that it was because Domino was jealous of Hawkins' cool leopard-skin suit.\n\nBut through this turmoil, Domino and Bartholomew, with Cosimo Matassa in the control room, continued recording a whole string of hits -- \"Please Don't Leave Me\", \"Rose Mary\", \"Something's Wrong\", \"You Done Me Wrong\", and \"Don't You Know\" all went top ten on the R&B charts. For two and a half years, from September 1952 through March 1955, they would dominate the rhythm and blues charts, even though most white audiences had little idea who Fats Domino was.\n\nBut slowly Domino was noticing that more and more white teenagers were starting to come to his shows -- and he also started incorporating a few country songs and old standards into his otherwise R&B-dominated act, catering slightly more to a pop audience.\n\nTheir first crossover hit definitely has more of Domino's fingerprints on it than Bartholomew's. Bartholomew was unimpressed at the session, saying that the song didn't tell a complete story. Once it became a hit, though, Bartholomew would soften on the song, saying “‘Ain’t That a Shame’ will never die, it will be here when the world comes to an end.”\n\nHe may not have been a particular fan of the song, but you'd never know it from his arrangement. Listen to the way that horn section in the intro punctuates the words, the way it doesn't just go \"You made me cry\", but \"You made -- BAM BAM -- me cry -- BAM BAM\"\n\n[excerpt: Fats Domino, \"Ain't That A Shame\"]\n\nThat's the kind of arrangement decision that can only be made by someone with a real feel for the material. And this is where Dave Bartholomew's real importance to the records he was making with Fats Domino comes in. It's all well and good Bartholomew doing great arrangements and productions for his own songs, or songs mostly written by him, but he put the same thought and attention into the arrangements even where the song was not to his taste and wasn't his idea.\n\nDomino's biographer Rick Coleman -- to whose biography of Domino I'm extremely indebted for this episode -- suggests that Dave Bartholomew's arrangement owes a little to the old Dixieland jazz standard \"Tin Roof Blues\". I can *sort of* hear it, but I'm not entirely convinced. Listen for yourself:\n\n[Excerpt: Louis Armstrong, \"Tin Roof Blues\"]\n\nAnother possible influence on \"Ain't That A Shame\" is a record by Lloyd Price, who of course had worked with both Domino and Bartholomew earlier. His \"Ain't It A Shame\" doesn't sound much like \"Ain't That A Shame\", but it does have a very Fats Domino feel, and it would be very surprising if neither Bartholomew nor Domino had heard it given their previous collaborations:\n\n[excerpt: Lloyd Price, \"Ain't It A Shame\"]\n\nIndeed, early pressings of \"Ain't That A Shame\" mistakenly called it \"Ain't It A Shame\", presumably because of confusion with the Lloyd Price song.\n\nBartholomew and Matassa also put more thought into the production than was normal at this time. When mastering Domino's records, now that Matassa's studio had finally switched to tape from cutting directly on to wax, they would speed up the tape slightly -- a trick which made Domino's voice sound younger, and which emphasised the beat more. This sort of thing is absolutely basic now, but at the time it was extraordinarily unusual for any rhythm and blues records to have any kind of production trickery at all. It also had another advantage, because as Cosimo Matassa would point out, it would change the key slightly so it wouldn't be in a normal key at all. So when other people tried to cover Domino's records \"they couldn't find the damn notes on the piano!\"\n\nOf course, with success came problems of its own. When Domino was sent on a promotional tour of local radio stations, DJs would complain to Lew Chudd of Imperial Records that Domino didn't speak English. He did speak English -- though it was his second language, after Creole French -- but he spoke English with such a thick accent that many people from outside Louisiana didn't recognise it as English at all.\n\nDomino's relative lack of fluency in English is possibly also why he wrote such simple lyrics -- a fact that was mocked on national TV when Steve Allen, the talk show host, read out the lyrics to \"Ain't That A Shame\" in a mock \"poetry recital\", to laughter from the studio audience, causing Bartholomew and Domino to feel extremely upset.\n\nOf course, this is an easy trick to play, as almost all song lyrics sound puerile when recited pompously enough. For example, I can recite:\n\nLets go to church, next Sunday morning\n\nWe'll see our friends on the way\n\nWe'll stand and sing, on Sunday morning\n\nAnd I'll hold your hand as we pray\n\nThat, of course, is a lyric written by Steve Allen, who despite having written 8500 songs by his own count, never wrote one as good as \"Ain't That A Shame\".\n\nAs with all black hits at this time, there was a terrible white cover, in this case by Pat Boone. Boone's cover version came out almost before Domino's did, thanks to Bill Randle. Bill Randle was a DJ in Cleveland, a colleague of Alan Freed, who is now a much better-known DJ, but in the early fifties Randle was possibly the best-known DJ in America. While Freed only played black rhythm and blues records, Randle, whose first radio show was called \"the Inter-Racial Goodtime Hour\", played records by both black and white people. As the country's biggest DJ, he was sent an advance copy of \"Ain't That A Shame\", and he liked it immensely. According to Lew Chudd, \"He liked it because it was ignorant, because he was an English professor\". That's sort of true -- Randle wasn't a professor at the time, but in the 1960s he ended up getting degrees in law, journalism, sociology, and education, and a doctorate in American Studies, all while continuing to work as a DJ.\n\nRandle would regularly send copies of new R&B records to white record executives he knew, and it was because of Randle that the Crew Cuts and the Diamonds, among others, first heard the black recordings whose style they stole. In this case, he sent his acetate copy of \"Ain't That A Shame\" to Randy Wood, the owner of Dot Records, a label set up specifically to record white cover versions of black records.\n\nRandle was an odd case, in this respect, because he *was* someone who truly loved rhythm and blues, and black music, and would play it regularly on his show -- early on, he had actually been fired from one of his first radio jobs for playing a Sister Rosetta Tharpe record, though he was soon rehired. But he seems to have truly bought into the idea that the white cover versions of black records did help the black performers.\n\nThere are very few examples of how little that was the case more blatant than that of Boone, a man whose attitude is best summed up by the fact that when he recorded his version, he tried to change the lyrics to \"Isn't That A Shame\" because he thought \"Ain't\" ungrammatical.\n\n[excerpt: Pat Boone, “Ain't That A Shame”]\n\nBoone would later go on to commit similar atrocities against \"Tutti Frutti\", among other records.\n\nIn a 1977 interview, Domino said of Boone's cover \"When I first heard it I didn't like it. It took two months to write and he put it out almost the same time I did. It kind of hurt. The publishing companies don't care if a thousand people make it.\" Talking to Domino's biographer Rick Coleman, Dave Bartholomew was characteristically more forthright. \"Pat Boone was a lucky white boy. He wasn't singing\" -- and here he used an expletive that I'm not going to repeat because I'm not sure what makes something qualify as adult content in iTunes -- \"Randy Wood was doing un-Constitutional type stuff. He was successful with it, but that don't make it right!\"\n\nBill Randle would play both versions of the record on his show, and both went to number one in Cleveland as a result. But in the rest of the country, the clean-cut white man was miles ahead of the fat black man with a flat top from New Orleans.\n\nBoone's misunderstanding typifies the cultural ignorance that characterised white cover versions of R&B hits in this period. A few months later, a similar thing would happen again with Domino's hit \"Bo Weevil\", and here the racial dynamics were more apparent:\n\n[Excerpt: Fats Domino, \"Bo Weevil\"]\n\nThat was covered by Teresa Brewer, and obviously her version did better on the charts:\n\n[Excerpt: Teresa Brewer, \"Bo Weevil\"]\n\nBut the thing is, that song celebrates boll weevils -- pests which destroy cotton, and which have become regarded in African-American folklore as humorous trickster figures, because they bankrupted plantation owners -- and while boll weevils didn't reach the USA until after slavery had ended, you can understand how a pest that destroys the livelihood of cotton plantation owners might have a rather different reputation among black people than white.\n\nBut despite these white covers, Domino continued to make inroads into the white market himself. And for all that Domino's music seems easygoing, it was enough that even before his proper crossover into the pop market, Domino had shows cancelled because the promoters or local government couldn't handle the potential of riots breaking out at his shows. That only increased when “Ain't That A Shame” hit, and white teenagers wanted to come to the shows. Police would try to shut them down, because white and black kids dancing together was illegal, and often shows would be cancelled because of the police's heavy-handed tactics – for example, at one show in Houston, the police tried in vain to stop the dancing, and eventually said that only whites would be allowed to dance, so Domino stopped the show, and the kids in the audience defiantly sang “Let the Good Times Roll” at the police. At another show in San Jose, someone threw a lit string of firecrackers into the audience, leading to a dozen people requiring medical treatment and another dozen being arrested.\n\n\"Ain't That A Shame\" was one of two hit songs recorded on the same day. The other, \"All By Myself\", would also become a number one hit on the R&B charts.\n\nWhile \"All By Myself\" was credited to Domino and Bartholomew, it was based very closely on an old Big Bill Broonzy record. Here's Broonzy's song:\n\n[excerpt, Big Bill Broonzy: \"All By Myself\"]\n\nAnd here's Domino's:\n\n[Excerpt, Fats Domino: \"All By Myself\"]\n\nAs you can hear, while the verses are quite different, the choruses are identical. Domino here for the first time plays in his two-beat piano style, yet another of the New Orleans rhythms that Domino and Bartholomew would incorporate into Domino's hits.\n\nA standard two-beat rhythm is the rhythm one finds in polkas, or in, say, Johnny Cash records -- that boom-chick, boom-chick, walking or marching rhythm. But the New Orleans variant of it, which as far as I can tell was first recorded when Domino recorded \"All By Myself\", isn't boom-chick boom-chick, but is rather boom-boom-chick, boom-boom-chick, with quavers on the first beat, and slightly swinging the quavers. Indeed by doing it two-handed (with the bass booms in the left hand and the treble chicks in the right), Domino also sneaks in a bass quaver at the end of the \"chick\", syncopating it, so it's sort of \"a-boom-boom-chick, a-boom-boom-chick\".\n\nThe two-beat rhythm would become as important a factor in Domino's future records as his rolling piano triplets and Dave Bartholomew's tresillo rhythms already had been. Domino's music was about rhythm and groove, and whereas most of his contemporaries were content to stick with one or two simple rhythms, Domino and Bartholomew would stack all of these different rhythmic patterns on top of each other.\n\nA lot of this is the basic musical vocabulary of anyone working in any of the musics influenced by New Orleans R&B these days, which includes all of reggae and ska as well as most African-American musical idioms, but that vocabulary was being built in these sessions. Domino and Bartholomew weren't the only ones doing it -- Professor Longhair and Huey \"Piano\" Smith and Mac Rebennack were all contributing, and all of these performers would take each other's material and put their own unique spin on it -- but they were vital parts of creating these building blocks that would be used by musicians to this day.\n\n\"Ain't That A Shame\" was just the start of Domino's rock and roll stardom. He would go on to have another seven R&B number ones after this, and his records would consistently chart on the R&B charts for the next seven years -- he would have, in total, *forty* top ten hits on the R&B chart in his career. But what was more remarkable was the number of *pop* chart hits he would have. He had fourteen pop top twenty hits between 1955 and 1961, eleven of them going top ten, including classics like \"I'm in Love Again\", \"I'm Walkin'\", \"Blue Monday\", \"Valley of Tears\", \"I Want to Walk You Home\" and \"Walking to New Orleans\". Almost all of his hit singles were written by the Bartholomew and Domino songwriting team, and almost all of them were extraordinarily good records -- there were almost no fifties rockers who had anything like Domino's consistent quality. So we'll be seeing Fats Domino at least once more in this series, when he finds his thrill on Blueberry Hill...",
  "itunes:subtitle": "Welcome to episode twenty-six of A History of Rock Music in Five Hundred Songs. Today were looking at Fats Domino and Aint That A Shame. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs",
  "itunes:keywords": "Big Bill Broonzy,Cosimo Matassa,Dave Bartholomew,Fats Domino,Imperial Records,Lloyd Price,Pat Boone,Screamin&#039; Jay Hawkins,Smiley Lewis,Steve Allen,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 26,
  "content:encoded": "Welcome to episode twenty-six of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Fats Domino and \"Ain't That A Shame\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-26-aint-that-a-shame/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called <a href=\"https://amzn.to/2PT704t\"><em>They Call Me The Fat Man: The Legendary Imperial Recordings</em></a>.\n\nPretty much all the information in this episode comes from Rick Coleman's <a href=\"https://amzn.to/2QhFZqP\"><em>Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll</em></a>. I've leaned on that rather more than I normally lean on a single source for this episode, because it's the only biography of Domino I know of, and we're looking at Domino in more depth than most other artists we've looked at so far.\n\nI reference two previous episodes here. Those are<a href=\"https://www.500songs.com/e/episode-8-the-fat-man\"> episode eight on The Fat Man</a>, and <a href=\"https://www.500songs.com/e/episode-12-lawdy-miss-clawdy-by-lloyd-price/\">episode twelve, on Lawdy Miss Clawdy</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday, for the third time, we're going to look at the collaborations between Fats Domino, Dave Bartholomew, and Cosimo Matassa, and the way they brought New Orleans music into the R&B and rock and roll genres. It's been a few months since we talked about them, so you might want to refresh your memory by listening to episode eight, on \"The Fat Man\", and episode twelve, on \"Lawdy Miss Clawdy\".\n\nAfter his brief split from Imperial Records, and thus from working with Fats Domino, Dave Bartholomew had returned to Imperial after Domino helped him on \"Lawdy Miss Clawdy\", and the two of them resumed their collaboration.\n\nThe first new track they recorded together was an instrumental called \"Dreaming\", featuring members of both Domino's touring band and of Bartholomew's studio band. It's credited on the label to Bartholomew as a writer, but other sources have the instrumental being written by Domino:\n\n[excerpt: Fats Domino, \"Dreaming\"]\n\nWhoever wrote it, the most popular hypothesis seems to be that the song was written as a tribute to Domino's manager, Melvin Cade, who had died only five days before the session. Domino had been sleeping in the back of Cade's car, as Cade had been speeding to get them to a show that they were late for. Cade had lost control of the car, which had been thrown ten feet into the air in a collision. Domino and the other passengers were uninjured, but Cade died of his injuries.\n\nWhile this was obviously tragic, it turned out to be to Domino's benefit -- Domino's contract with Cade had given Domino only a hundred and fifty dollars a day from his shows, with Cade keeping the rest -- which might often be several times as much money. With Cade's death, Domino was free from that contract, and so the beginning of September 1952, with the death of Cade and the renewal of Domino and Bartholomew's partnership, marks the start of the second phase of Fats Domino's career.\n\nOne of the things we've touched on in the previous podcasts about Dave Bartholomew and Fats Domino is the strained nature of their songwriting partnership -- although this is using \"strained\" in a fairly loose sense, given that they continued working with each other for decades. But like with so many musical partnerships where the whole is greater than the sum of the parts, both men did consider their own contribution to be the more important. Bartholomew considered himself to be the more important writer because he came up with literate stories with narrative arcs and punchlines, coupled with sophisticated musical ideas, while Domino considered himself more important because he came up with relatable, simple, ideas and catchy hooks.\n\nAnd, of course, Domino's piano style and distinctive voice were crucial in the popularity of the records, just as Dave Bartholomew's arrangement and production ideas were.\n\nAnd the difference in their attitudes shows up in, for example, \"Going to the River\", one of the first fruits of their renewed collaboration:\n\n[Excerpt: Fats Domino, \"Going to the River\"]\n\nDave Bartholomew called that \"a nothing song\" -- and it's easy to see what he means. Other than the tresilo bassline (and a reminder for those of you who don't remember what that is, it's that \"bom, BOM bom\" rhythmic figure that you get in almost every record Dave Bartholomew had a hand in) there's not much of musical interest there -- you've got Domino playing his usual triplets in the right hand on the piano, but rather than the drums emphasising the backbeat, they're mostly playing the same triplets as the piano. The chord sequence is nothing special. and the lyrics were simplistic.\n\nBut at the same time, the track did go to number two on the R&B charts, and probably would have gone to number one if it hadn't been for the cover version by Chuck Willis:\n\n[Excerpt: Chuck Willis, \"Going to the River\"]\n\nThat went to number four on the R&B charts. For once it wasn't a white man having a hit with a black man's song, but another black man, who'd heard Domino perform it live before the record was released and got in quickly with his own version.\n\nOn the other hand, it wasn't like Domino was the perfect judge of what made a hit, either. Bartholomew wrote the song \"I Hear You Knocking\" for Domino, but when Domino decided not to record it, Bartholomew recorded it for another artist on Imperial Records, Smiley Lewis, getting the great New Orleans piano player Huey \"Piano\" Smith to play in an imitation of Domino's style:\n\n[Excerpt: Smiley Lewis, \"I Hear You Knocking\"]\n\nThat went to number two on the R&B charts, and a cover version by the white singer Gale Storm went to number two on the pop charts.\n\nSo both Domino and Bartholomew were capable of coming up with big hits in the style they perfected together, and both were capable of dismissing a potential hit when it wasn't their own idea. But their partnership was so successful that Dave Bartholomew actually regarded Smiley Lewis as a \"bad luck singer\", because when Bartholomew wrote and produced for him, the records would *only* sell a hundred thousand copies or so, compared to the much larger numbers of records that Domino sold.\n\nDomino was becoming huge in the R&B world -- in early 1954 Billboard listed him as the biggest selling R&B star in the country -- and he was managing to cope with it better than most. While he would miss the occasional gig from drinking a little too much, and he'd sleep around on the road more than a married man should, he was essentially a well-adjusted, private, man, who had five kids, phoned home to his wife every night, and never touched anything stronger than alcohol.\n\nThat wasn't true of the rest of his band, however. In the 1950s, heroin was the chic drug to be taking if you were a touring musician, and many of Domino's touring band members were users. He would often have to pay to get his guitarist's instrument out of the pawn shop, so they could go on tour, and once even had to pay off the guitarist's back child support, to get him out of jail, as he would keep spending all his money on heroin.\n\nThe one who came out worst, sadly, was Jimmy Gilchrist, who would sing with Domino's backing band as the support act. Gilchrist died of an overdose during one of Domino's tours in early 1954. Domino replaced him with a new support act, Jalacey Hawkins, but he only lasted a couple of weeks. According to Domino, he fired Jalacey for being too vulgar on stage, and screaming, but Screamin' Jay Hawkins, as he would soon become known, claimed instead that it was because Domino was jealous of Hawkins' cool leopard-skin suit.\n\nBut through this turmoil, Domino and Bartholomew, with Cosimo Matassa in the control room, continued recording a whole string of hits -- \"Please Don't Leave Me\", \"Rose Mary\", \"Something's Wrong\", \"You Done Me Wrong\", and \"Don't You Know\" all went top ten on the R&B charts. For two and a half years, from September 1952 through March 1955, they would dominate the rhythm and blues charts, even though most white audiences had little idea who Fats Domino was.\n\nBut slowly Domino was noticing that more and more white teenagers were starting to come to his shows -- and he also started incorporating a few country songs and old standards into his otherwise R&B-dominated act, catering slightly more to a pop audience.\n\nTheir first crossover hit definitely has more of Domino's fingerprints on it than Bartholomew's. Bartholomew was unimpressed at the session, saying that the song didn't tell a complete story. Once it became a hit, though, Bartholomew would soften on the song, saying “‘Ain’t That a Shame’ will never die, it will be here when the world comes to an end.”\n\nHe may not have been a particular fan of the song, but you'd never know it from his arrangement. Listen to the way that horn section in the intro punctuates the words, the way it doesn't just go \"You made me cry\", but \"You made -- BAM BAM -- me cry -- BAM BAM\"\n\n[excerpt: Fats Domino, \"Ain't That A Shame\"]\n\nThat's the kind of arrangement decision that can only be made by someone with a real feel for the material. And this is where Dave Bartholomew's real importance to the records he was making with Fats Domino comes in. It's all well and good Bartholomew doing great arrangements and productions for his own songs, or songs mostly written by him, but he put the same thought and attention into the arrangements even where the song was not to his taste and wasn't his idea.\n\nDomino's biographer Rick Coleman -- to whose biography of Domino I'm extremely indebted for this episode -- suggests that Dave Bartholomew's arrangement owes a little to the old Dixieland jazz standard \"Tin Roof Blues\". I can *sort of* hear it, but I'm not entirely convinced. Listen for yourself:\n\n[Excerpt: Louis Armstrong, \"Tin Roof Blues\"]\n\nAnother possible influence on \"Ain't That A Shame\" is a record by Lloyd Price, who of course had worked with both Domino and Bartholomew earlier. His \"Ain't It A Shame\" doesn't sound much like \"Ain't That A Shame\", but it does have a very Fats Domino feel, and it would be very surprising if neither Bartholomew nor Domino had heard it given their previous collaborations:\n\n[excerpt: Lloyd Price, \"Ain't It A Shame\"]\n\nIndeed, early pressings of \"Ain't That A Shame\" mistakenly called it \"Ain't It A Shame\", presumably because of confusion with the Lloyd Price song.\n\nBartholomew and Matassa also put more thought into the production than was normal at this time. When mastering Domino's records, now that Matassa's studio had finally switched to tape from cutting directly on to wax, they would speed up the tape slightly -- a trick which made Domino's voice sound younger, and which emphasised the beat more. This sort of thing is absolutely basic now, but at the time it was extraordinarily unusual for any rhythm and blues records to have any kind of production trickery at all. It also had another advantage, because as Cosimo Matassa would point out, it would change the key slightly so it wouldn't be in a normal key at all. So when other people tried to cover Domino's records \"they couldn't find the damn notes on the piano!\"\n\nOf course, with success came problems of its own. When Domino was sent on a promotional tour of local radio stations, DJs would complain to Lew Chudd of Imperial Records that Domino didn't speak English. He did speak English -- though it was his second language, after Creole French -- but he spoke English with such a thick accent that many people from outside Louisiana didn't recognise it as English at all.\n\nDomino's relative lack of fluency in English is possibly also why he wrote such simple lyrics -- a fact that was mocked on national TV when Steve Allen, the talk show host, read out the lyrics to \"Ain't That A Shame\" in a mock \"poetry recital\", to laughter from the studio audience, causing Bartholomew and Domino to feel extremely upset.\n\nOf course, this is an easy trick to play, as almost all song lyrics sound puerile when recited pompously enough. For example, I can recite:\n\nLets go to church, next Sunday morning\n\nWe'll see our friends on the way\n\nWe'll stand and sing, on Sunday morning\n\nAnd I'll hold your hand as we pray\n\nThat, of course, is a lyric written by Steve Allen, who despite having written 8500 songs by his own count, never wrote one as good as \"Ain't That A Shame\".\n\nAs with all black hits at this time, there was a terrible white cover, in this case by Pat Boone. Boone's cover version came out almost before Domino's did, thanks to Bill Randle. Bill Randle was a DJ in Cleveland, a colleague of Alan Freed, who is now a much better-known DJ, but in the early fifties Randle was possibly the best-known DJ in America. While Freed only played black rhythm and blues records, Randle, whose first radio show was called \"the Inter-Racial Goodtime Hour\", played records by both black and white people. As the country's biggest DJ, he was sent an advance copy of \"Ain't That A Shame\", and he liked it immensely. According to Lew Chudd, \"He liked it because it was ignorant, because he was an English professor\". That's sort of true -- Randle wasn't a professor at the time, but in the 1960s he ended up getting degrees in law, journalism, sociology, and education, and a doctorate in American Studies, all while continuing to work as a DJ.\n\nRandle would regularly send copies of new R&B records to white record executives he knew, and it was because of Randle that the Crew Cuts and the Diamonds, among others, first heard the black recordings whose style they stole. In this case, he sent his acetate copy of \"Ain't That A Shame\" to Randy Wood, the owner of Dot Records, a label set up specifically to record white cover versions of black records.\n\nRandle was an odd case, in this respect, because he *was* someone who truly loved rhythm and blues, and black music, and would play it regularly on his show -- early on, he had actually been fired from one of his first radio jobs for playing a Sister Rosetta Tharpe record, though he was soon rehired. But he seems to have truly bought into the idea that the white cover versions of black records did help the black performers.\n\nThere are very few examples of how little that was the case more blatant than that of Boone, a man whose attitude is best summed up by the fact that when he recorded his version, he tried to change the lyrics to \"Isn't That A Shame\" because he thought \"Ain't\" ungrammatical.\n\n[excerpt: Pat Boone, “Ain't That A Shame”]\n\nBoone would later go on to commit similar atrocities against \"Tutti Frutti\", among other records.\n\nIn a 1977 interview, Domino said of Boone's cover \"When I first heard it I didn't like it. It took two months to write and he put it out almost the same time I did. It kind of hurt. The publishing companies don't care if a thousand people make it.\" Talking to Domino's biographer Rick Coleman, Dave Bartholomew was characteristically more forthright. \"Pat Boone was a lucky white boy. He wasn't singing\" -- and here he used an expletive that I'm not going to repeat because I'm not sure what makes something qualify as adult content in iTunes -- \"Randy Wood was doing un-Constitutional type stuff. He was successful with it, but that don't make it right!\"\n\nBill Randle would play both versions of the record on his show, and both went to number one in Cleveland as a result. But in the rest of the country, the clean-cut white man was miles ahead of the fat black man with a flat top from New Orleans.\n\nBoone's misunderstanding typifies the cultural ignorance that characterised white cover versions of R&B hits in this period. A few months later, a similar thing would happen again with Domino's hit \"Bo Weevil\", and here the racial dynamics were more apparent:\n\n[Excerpt: Fats Domino, \"Bo Weevil\"]\n\nThat was covered by Teresa Brewer, and obviously her version did better on the charts:\n\n[Excerpt: Teresa Brewer, \"Bo Weevil\"]\n\nBut the thing is, that song celebrates boll weevils -- pests which destroy cotton, and which have become regarded in African-American folklore as humorous trickster figures, because they bankrupted plantation owners -- and while boll weevils didn't reach the USA until after slavery had ended, you can understand how a pest that destroys the livelihood of cotton plantation owners might have a rather different reputation among black people than white.\n\nBut despite these white covers, Domino continued to make inroads into the white market himself. And for all that Domino's music seems easygoing, it was enough that even before his proper crossover into the pop market, Domino had shows cancelled because the promoters or local government couldn't handle the potential of riots breaking out at his shows. That only increased when “Ain't That A Shame” hit, and white teenagers wanted to come to the shows. Police would try to shut them down, because white and black kids dancing together was illegal, and often shows would be cancelled because of the police's heavy-handed tactics – for example, at one show in Houston, the police tried in vain to stop the dancing, and eventually said that only whites would be allowed to dance, so Domino stopped the show, and the kids in the audience defiantly sang “Let the Good Times Roll” at the police. At another show in San Jose, someone threw a lit string of firecrackers into the audience, leading to a dozen people requiring medical treatment and another dozen being arrested.\n\n\"Ain't That A Shame\" was one of two hit songs recorded on the same day. The other, \"All By Myself\", would also become a number one hit on the R&B charts.\n\nWhile \"All By Myself\" was credited to Domino and Bartholomew, it was based very closely on an old Big Bill Broonzy record. Here's Broonzy's song:\n\n[excerpt, Big Bill Broonzy: \"All By Myself\"]\n\nAnd here's Domino's:\n\n[Excerpt, Fats Domino: \"All By Myself\"]\n\nAs you can hear, while the verses are quite different, the choruses are identical. Domino here for the first time plays in his two-beat piano style, yet another of the New Orleans rhythms that Domino and Bartholomew would incorporate into Domino's hits.\n\nA standard two-beat rhythm is the rhythm one finds in polkas, or in, say, Johnny Cash records -- that boom-chick, boom-chick, walking or marching rhythm. But the New Orleans variant of it, which as far as I can tell was first recorded when Domino recorded \"All By Myself\", isn't boom-chick boom-chick, but is rather boom-boom-chick, boom-boom-chick, with quavers on the first beat, and slightly swinging the quavers. Indeed by doing it two-handed (with the bass booms in the left hand and the treble chicks in the right), Domino also sneaks in a bass quaver at the end of the \"chick\", syncopating it, so it's sort of \"a-boom-boom-chick, a-boom-boom-chick\".\n\nThe two-beat rhythm would become as important a factor in Domino's future records as his rolling piano triplets and Dave Bartholomew's tresillo rhythms already had been. Domino's music was about rhythm and groove, and whereas most of his contemporaries were content to stick with one or two simple rhythms, Domino and Bartholomew would stack all of these different rhythmic patterns on top of each other.\n\nA lot of this is the basic musical vocabulary of anyone working in any of the musics influenced by New Orleans R&B these days, which includes all of reggae and ska as well as most African-American musical idioms, but that vocabulary was being built in these sessions. Domino and Bartholomew weren't the only ones doing it -- Professor Longhair and Huey \"Piano\" Smith and Mac Rebennack were all contributing, and all of these performers would take each other's material and put their own unique spin on it -- but they were vital parts of creating these building blocks that would be used by musicians to this day.\n\n\"Ain't That A Shame\" was just the start of Domino's rock and roll stardom. He would go on to have another seven R&B number ones after this, and his records would consistently chart on the R&B charts for the next seven years -- he would have, in total, *forty* top ten hits on the R&B chart in his career. But what was more remarkable was the number of *pop* chart hits he would have. He had fourteen pop top twenty hits between 1955 and 1961, eleven of them going top ten, including classics like \"I'm in Love Again\", \"I'm Walkin'\", \"Blue Monday\", \"Valley of Tears\", \"I Want to Walk You Home\" and \"Walking to New Orleans\". Almost all of his hit singles were written by the Bartholomew and Domino songwriting team, and almost all of them were extraordinarily good records -- there were almost no fifties rockers who had anything like Domino's consistent quality. So we'll be seeing Fats Domino at least once more in this series, when he finds his thrill on Blueberry Hill...",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-six of A History of Rock Music in Five Hundred Songs. Today we're looking at Fats Domino and \"Ain't That A Shame\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called They Call Me The Fat Man: The Legendary Imperial Recordings.\n\nPretty much all the information in this episode comes from Rick Coleman's Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll. I've leaned on that rather more than I normally lean on a single source for this episode, because it's the only biography of Domino I know of, and we're looking at Domino in more depth than most other artists we've looked at so far.\n\nI reference two previous episodes here. Those are episode eight on The Fat Man, and episode twelve, on Lawdy Miss Clawdy.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, for the third time, we're going to look at the collaborations between Fats Domino, Dave Bartholomew, and Cosimo Matassa, and the way they brought New Orleans music into the R&B and rock and roll genres. It's been a few months since we talked about them, so you might want to refresh your memory by listening to episode eight, on \"The Fat Man\", and episode twelve, on \"Lawdy Miss Clawdy\".\n\nAfter his brief split from Imperial Records, and thus from working with Fats Domino, Dave Bartholomew had returned to Imperial after Domino helped him on \"Lawdy Miss Clawdy\", and the two of them resumed their collaboration.\n\nThe first new track they recorded together was an instrumental called \"Dreaming\", featuring members of both Domino's touring band and of Bartholomew's studio band. It's credited on the label to Bartholomew as a writer, but other sources have the instrumental being written by Domino:\n\n[excerpt: Fats Domino, \"Dreaming\"]\n\nWhoever wrote it, the most popular hypothesis seems to be that the song was written as a tribute to Domino's manager, Melvin Cade, who had died only five days before the session. Domino had been sleeping in the back of Cade's car, as Cade had been speeding to get them to a show that they were late for. Cade had lost control of the car, which had been thrown ten feet into the air in a collision. Domino and the other passengers were uninjured, but Cade died of his injuries.\n\nWhile this was obviously tragic, it turned out to be to Domino's benefit -- Domino's contract with Cade had given Domino only a hundred and fifty dollars a day from his shows, with Cade keeping the rest -- which might often be several times as much money. With Cade's death, Domino was free from that contract, and so the beginning of September 1952, with the death of Cade and the renewal of Domino and Bartholomew's partnership, marks the start of the second phase of Fats Domino's career.\n\nOne of the things we've touched on in the previous podcasts about Dave Bartholomew and Fats Domino is the strained nature of their songwriting partnership -- although this is using \"strained\" in a fairly loose sense, given that they continued working with each other for decades. But like with so many musical partnerships where the whole is greater than the sum of the parts, both men did consider their own contribution to be the more important. Bartholomew considered himself to be the more important writer because he came up with literate stories with narrative arcs and punchlines, coupled with sophisticated musical ideas, while Domino considered himself more important because he came up with relatable, simple, ideas and catchy hooks.\n\nAnd, of course, Domino's piano style and distinctive voice were crucial in the popularity of the records, just as Dave Bartholomew's arrangement and production ideas were.\n\nAnd the difference in their attitudes shows up in, for exam",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-six of A History of Rock Music in Five Hundred Songs. Today we're looking at Fats Domino and \"Ain't That A Shame\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called They Call Me The Fat Man: The Legendary Imperial Recordings.\n\nPretty much all the information in this episode comes from Rick Coleman's Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll. I've leaned on that rather more than I normally lean on a single source for this episode, because it's the only biography of Domino I know of, and we're looking at Domino in more depth than most other artists we've looked at so far.\n\nI reference two previous episodes here. Those are episode eight on The Fat Man, and episode twelve, on Lawdy Miss Clawdy.\n\nPatreon\n\nT",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}