{
  "id": "https://bibleinoneyear.org/en/youth/52",
  "title": "Day 52: Better Together",
  "description": "Proverbs 5:15–21, Exodus 29:38,42,46, Mark 6:6–19.  (I did try to use this illustration once but, for reasons I cannot remember, it went horribly wrong!)The point that he makes so well, and that comes out of the passage in Ecclesiastes, is that while friendships and marriages are wonderful gifts, having God at the centre of a friendship or marriage provides an invisible thread of enormous strength In today’s passages, we see how two are stronger than one in marriage, mission and ministry",
  "pubDate": "Mon, 21 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/52/",
  "itunes:duration": "13:08",
  "guid": "enyouth21022022-52",
  "length": 788.24,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 52: Better Together",
  "itunes:subtitle": "Proverbs 5:15–21, Exodus 29:38,42,46, Mark 6:6–19.  (I did try to use this illustration once but, for reasons I cannot remember, it went horribly wrong!)The point that he makes so well, and that comes out of the passage in Ecclesiastes, is that while friendships and marriages are wonderful gifts, having God at the centre of a friendship or marriage provides an invisible thread of enormous strength In today’s passages, we see how two are stronger than one in marriage, mission and ministry",
  "itunes:summary": "I have never been very good at using visual aids. I am not a very practical person. On the other hand, my great friend, Nicky Lee (who, together with his wife Sila, has pioneered The Marriage Course and other courses for couples and parents), is extremely practical and often uses visual aids.\nWhen he is speaking at weddings he sometimes uses a visual aid to illustrate the passage in Ecclesiastes 4, where the writer says, ‘Two are better than one… A cord of three strands is not quickly broken’ (vv.9,12).\nAs a picture of marriage, Nicky takes two strands of different coloured wool and weaves them together. Together they are stronger and yet they can quite easily be broken. Then he takes a third strand of nearly invisible fishing line. With this third strand, it is almost impossible to break the two pieces of wool. (I did try to use this illustration once but, for reasons I cannot remember, it went horribly wrong!)\nThe point that he makes so well, and that comes out of the passage in Ecclesiastes, is that while friendships and marriages are wonderful gifts, having God at the centre of a friendship or marriage provides an invisible thread of enormous strength.\nIn today’s passages, we see how two are stronger than one in marriage, mission and ministry.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 417
}