{
  "title": "The Escape Artist &#8211; FIRE in the UK",
  "link": "https://www.madfientist.com/escape-artist-interview/",
  "comments": "https://www.madfientist.com/escape-artist-interview/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Wed, 15 Dec 2021 12:37:13 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "https://www.madfientist.com/?p=7319",
  "description": "<p class=\"lead\">The Escape Artist joins me on the Financial Independence Podcast to talk about pursuing FIRE in the United Kingdom!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/escape-artist-interview/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/escape-artist-interview/\">The Escape Artist &#8211; FIRE in the UK</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>I have some big news&#8230;</p>\n\n\n\n<p>I am now a British citizen!</p>\n\n\n\n<p>In honor of finally getting my UK passport, and therefore completing this long journey to citizenship, I am releasing my UK FIRE episode.</p>\n\n\n\n<p>Barney, from <a href=\"https://theescapeartist.me\" target=\"_blank\" rel=\"noopener\">The Escape Artist</a>, joined me in my Edinburgh apartment (before the pandemic) to discuss all things related to financial independence and early retirement in the UK.</p>\n\n\n\n<p>Hope you enjoy it!</p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-7319-3\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://traffic.libsyn.com/secure/madfientist/escape-artist-interview.mp3?_=3\" /><a href=\"https://traffic.libsyn.com/secure/madfientist/escape-artist-interview.mp3\">https://traffic.libsyn.com/secure/madfientist/escape-artist-interview.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='https://traffic.libsyn.com/secure/madfientist/escape-artist-interview.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n<!-- /wp:paragraph -->\n\n<!-- wp:heading -->\n<h2>Highlights</h2>\n<!-- /wp:heading -->\n\n<!-- wp:list -->\n<ul>\n<li>The cultural differences between US/UK that affect pursuing FI</li>\n<li>How to escape from the prison we create for ourselves</li>\n<li>Translating US investing terminology to the UK (e.g. 401k→pension, IRA→ISA, etc.)</li>\n<li>Is it easier to reach FI in the US or UK</li>\n<li>Class structure in UK and how pursuing FI forces you to traverse all classes</li>\n<li>Why FIRE isn&#8217;t bigger in the UK</li>\n<li>Difference between the different types of ISAs</li>\n<li>Is tax hacking possible in the UK</li>\n<li>Real-estate investing in the United Kingdom and the fantastic Rent-a-Room scheme</li>\n<li>How to use geographic arbitrage to reach FI sooner</li>\n</ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Show Links</h2>\n<!-- /wp:heading -->\n\n<!-- wp:list -->\n<ul>\n<li><a href=\"https://theescapeartist.me\" target=\"_blank\" rel=\"noopener\">The Escape Artist</a></li>\n</ul>\n<!-- /wp:list -->\n\n<!-- wp:heading -->\n<h2>Full Transcript<!-- /wp:heading --></h2>\n<div class=\"transcript\">\n<strong>Mad Fientist:</strong> Hey, what&#8217;s up, everybody. Welcome to the Financial Independence Podcast, the podcast where I get inside the brains of some of the best and brightest in personal finance to find out how they achieved financial independence. Today&#8217;s episode is a long time coming. I actually interviewed my guest two years ago, which because of the coronavirus pandemic seems like a lifetime ago.<br/><br/>But the reason I haven&#8217;t published the episode yet is because I&#8217;ve been waiting for something really special to happen&#8230;and that just happened last month. I&#8217;m excited to tell you that I am now British, which is something I never expected to be in my life, but I&#8217;m so happy that I am at this stage because over the last six plus years, I&#8217;ve been sending in lots of money and applications and spending lots of time trying to get my British citizenship so that I can just come and go as I please.<br/><br/>And thankfully that finally was successful and now I&#8217;m a dual US/UK citizen, and I couldn&#8217;t be happier. So to celebrate, I&#8217;m finally releasing the UK episode and I&#8217;m excited to introduce my guest, who is Barney from The Escape Artist. And those of you in the UK will know Barney cause he&#8217;s probably one of the biggest FIRE blogs in the country.<br/><br/>So when Barney was up in Edinburgh for the Edinburgh festival in 2019, he stopped by my flat and we sat down for an hour and just chatted about FIRE in the UK. And we dove into a lot of, you know, UK-specific stuff, but we also compared it to how people in the US pursue FI and the differences between the two countries that make some things easier and some things more difficult.<br/><br/>So without further delay&#8230; Barney, thank you so much for being here. I really appreciate it. <br/><br/><strong>Escape Artist:</strong> Hey man, it&#8217;s great to be here at last. <br/><br/><strong>Mad Fientist:</strong> So this is actually a real weird one for me. You are actually sitting in my living room, which I don&#8217;t think I&#8217;ve ever done one at home before. But you came up from London.<br/><br/>We were going to do it in a pub or somewhere cool, since this is the UK episode, but I realized I don&#8217;t have my traveling mic. So you had to come to my apartment and use the one that&#8217;s attached to my desk. So welcome to my flat.<br/><br/><strong>Escape Artist:</strong> Edinburgh is just beautiful. It&#8217;s just such a cool city. And it&#8217;s great to be here while the Fringe is on. <br/><br/><strong>Mad Fientist:</strong> Yeah, the Fringe is the world&#8217;s largest arts festival. Well, it&#8217;s part of the world&#8217;s largest arts festival and it&#8217;s the whole month and it&#8217;s just one big party in the city. So you&#8217;ve definitely come on the right day. So, so yeah, this is the long awaited UK episode. I&#8217;ve gotten so many emails from UK readers asking, you know, what&#8217;s the differences between the US and the UK and you know, how do you pursue FI in the UK and all these things, and you&#8217;re going to be the man to help with that.<br/><br/>But before we get into all that, can you maybe just give my audience a little bit of details about yourself and give a little background story about how you achieve financial independence? <br/><br/><strong>Escape Artist:</strong> Sure. I think that for a lot of people that are financially successful, if you kind of scratch the surface, there&#8217;s often a trauma kind of in their earlier life that got them started on that path.<br/><br/>And for me when my parents, when my parents moved house when I was 11 years old back in 1981, they did the classic British thing. They bought the biggest house they could, they took out as much debt as they possibly could. And their timing was awful because this was 1981. And interest rates went to 17% and my parents kind of had this realization that they&#8217;d overstretched themselves.<br/><br/>And so they had then to do a kind of period of belt tightening and the newspaper got canceled. My dad stopped buying beers, started brewing his own beer. The holiday got canceled that that year. And I think I took away from that was that debt was a kind of very scary thing. And ultimately the bank could kind of take the house away from you.<br/><br/>And so kind of from that point on, you know, I made choices in my, in my education and in my career that would put me on that path to kind of having money. And so, you know, when I went to college, I studied economics. When I graduated, I chose like a, really a profession where I could earn safe money. So I trained as a chartered accountant and qualified, and then worked in corporate finance for 20 years.<br/><br/>And really for the last 10 of those years, I was very focused on just putting away as much money as I could, because I&#8217;d had an experience at one of my jobs where I realized that kind of I was trapped. I had I had a mortgage at that point. We had children on the way. My wife had given up her job and so the whole kind of burden of providing for the family was on my shoulders. And I, I took a job that I hated. And from that point onwards, I saved at least half of my income every month. Fast forward to 2013 and I realized that I had enough. <br/><br/><strong>Mad Fientist:</strong> Yeah, you said you were trapped, which maybe leads into the whole theme behind your blog so maybe you do want to tell the story about the escaping from the prison camp. <br/><br/><strong>Escape Artist:</strong> Yeah, so the prison camp is my kind of analogy or my metaphor for the situation that a lot of us kind of put ourselves into where we kind of create our own prison. We trap ourselves through our spending choices by taking on debt, by kind of societal expectations.<br/><br/>And that can lead you to a point where you&#8217;re no longer happy doing that, you know, doing a job, but you feel you have no choice, but to carry on doing that. And, and I, I certainly felt trapped at that time in my life. And I just couldn&#8217;t see a way out of the prison camp other than to kind of slowly dig my way out stone by stone, rock by rock, but by saving money.<br/><br/>And that the prison camp analogy is based on a kind of World War Two story of, you know, The Great Escape, the film, The Great Escape, where the prisoners literally kind of dug their way out to the prison camp in this amazingly kind of painstaking, slow, laborious process. And that, that kind of amused me that analogy.<br/><br/><strong>Mad Fientist:</strong> That&#8217;s great. And I want to go back to something you said, you mentioned, what was it? 17% interest. <br/><br/><strong>Escape Artist:</strong> Yeah, yeah, absolutely. One day there&#8217;ll be 17% again. And you kind of wonder what the world will look like at that point. <br/><br/><strong>Mad Fientist:</strong> It will look very different. No doubt. Yeah. That&#8217;s I just released a post not too long ago about whether you should pay off your mortgage early or something.<br/><br/>And I&#8217;m definitely in the camp where I&#8217;m just looking to buy a house just so I can lock in some of these low, low interest rates. Cause they may potentially be, you know, once in a lifetime interest rates and yeah, it would feel pretty good to have a 30 year mortgage at 3% or something. If, if interest rates do go up to what they were before.<br/><br/><strong>Escape Artist:</strong> Well, everything in finances is cyclical.<br/><br/>The problem is, you know, history never quite repeats itself in the same way. So you kind of know things are going to change, but you don&#8217;t know exactly how and you don&#8217;t know exactly where. <br/><br/><strong>Mad Fientist:</strong> So obviously based on your history and your background in economics and your accent obviously proves that you are a Brit, you&#8217;re going to know a lot more about the UK side of things than I am, even though I live here.<br/><br/>A lot of my focus is still on the U S because that&#8217;s where most of my money is. So before we dive into some of the nitty gritty details about, you know, pursuing FI in the UK versus the US maybe, could we talk about, are there any like broad cultural differences that sort of change the change of the game in any way?<br/><br/><strong>Escape Artist:</strong> Yeah. The first thing to say is that when I was, I mean, I got serious that, that career crisis that I mentioned that really put me on the path to aggressively saving 50 plus percent that happened in 2002, 2003. And so you have to remember at that time in the UK, there was no financial independence movement.<br/><br/>There was no awareness of the U S financial independence movement. So, I mean, the book, Your Money or Your Life, I think came out in 1990, but when I was going through my journey, I had, no, I hadn&#8217;t read that book. I had no awareness of all of it. And you just didn&#8217;t have the, the tools, the resources, the blogs, the podcasts that we have today. And that, that is just a massive help. And, and the fact now is that, you know, we in the UK benefit from that accumulated body of knowledge that&#8217;s been built up, you know, mostly in the US not, not completely, but mostly in the US we benefit from that massively. And it&#8217;s pretty easy to convert most of that content over to a, to a UK actionable plan.<br/><br/>You know, the differences in terminology are relatively simple to, to translate, you know, it&#8217;s not hard to convert our IRA to workplace pension. It&#8217;s not, it&#8217;s not that hard to convert VTSAX to VWRL et cetera. So, so, you know, we have this kind of huge advantage of the internet now, and the body of knowledge, you know, in 2013, the thing that kind of triggered the realization that I had enough was stumbling across Mr. Money Mustache&#8217;s site. And it, it just kind of blew my mind. And so I guess, you know, since then I&#8217;ve been kind of observing the differences between the US blogs and the, the kind of the UK content on financial independence and trying to create some, some UK content on financial independence, on The Escape Artist.<br/><br/>And. What I, you know, what you realize is that you&#8217;re doing that in a slightly different historical context and a slightly different cultural context. And I think one of the reasons that the the American movement kind of took off quicker earlier, faster&#8230;partly there&#8217;s a historical tradition to draw on there that goes all the way back to kind of Henry David Thoreau and Walden, all the way to kind of blogs like Early Retirement Extreme and then Mr. Money Mustache. So there&#8217;s that historical strand of frugality and self-reliance and rugged individualism in, in, in American culture and a focus on freedom. And in some ways there&#8217;s more of a burning platform in the US because I think the pressure of marketing, advertising, and consumerism is even greater in the US than it is in the UK.<br/><br/>I mean, certainly as a Brit, when I went to America and you kind of, you went from four TV channels of which one or two had adverts to cable to seeing cable TV, and just flicking through 70 channels that were running 24/7, just with this, these infomercials and these adverts kind of beamed at you, you kind of realize that the pressure of commercialism is greater in the U S and so I think one of the things that&#8217;s meant we&#8217;ve been slower in the UK to stumble across some of the secrets of financial independence is in some ways there was less of a burning platform for us, there was perhaps a greater focus on tradition, culture, community than in some parts of America, which, you know, some parts of America can seem pretty kind of brutally commercial.<br/><br/><strong>Mad Fientist:</strong> Yeah. I absolutely agree. Having lived in both places and, you know, having lived in the UK for probably 10 years in total by now, I can definitely see that. And I agree that there&#8217;s&#8230;obviously, yes, there&#8217;s a focus on freedom in the States that may be more pronounced. And also, yeah, you&#8217;re just being bombarded with things all the time.<br/><br/>And like, I couldn&#8217;t believe it. I went back to my parents&#8217; house for Christmas just last year, I think. And the commercials on TV out lasted the program. So I was going crazy after a while, so I literally timed it and it was six minutes and 20 seconds of advertisements to six minutes in like six seconds of actual program.<br/><br/>People are paying like a hundred dollars a month for this privilege of getting just bombarded with all the stuff that they don&#8217;t have. <br/><br/><strong>Escape Artist:</strong> Yeah. So just the existence of the BBC, I think is a kind of moderating factor. You know, the, you just don&#8217;t have that constant constant stream of adverts. There is this kind of tradition of public sector broadcasting, which, which kind of includes the concept of entertaining, but also educating as well. So we have all these kind of great, we benefit from, you know, from these great nature documentaries on the BBC produced it know great cost, great expense. And so that&#8217;s kind of part of the, the upside, I think of the British culture. But it may be one of the reasons why FIRE was kind of slower to take off over here.<br/><br/>The other, the other thing I do think we have to touch on actually is, is the kind of legacy of the class structure in the UK. It&#8217;s definitely a relevant part of our history. So if you kind of think back in you know, a couple of hundred years ago, you had this kind of post feudal society where you&#8217;ve got the aristocracy at the top of the pile and they&#8217;re living off passive income. So, you know, they own the stocks in the stock market. They own that most of the land that they own rental properties. And then you&#8217;ve got a you&#8217;ve got a middle class that, that the kind of the doctors and the lawyers, et cetera, who have good incomes and are kind of saving steadily.<br/><br/>And then you traditionally had a kind of a working class who live paycheck to paycheck and that class structure, it leaves a legacy because kind of one of the ways I think about getting to financial independence in the UK today is you have to change your mindset. Kind of starting off from a working class mindset where you&#8217;re living paycheck to paycheck, and you kind of have to learn those middle-class habits of kind of thrift you know, caution, prudence learning to put aside some money, but even then, that&#8217;s not enough. You can&#8217;t just have a middle-class mindset if that prevents you from kind of exposing your money to risk and exposing your money to the volatility of you know, owning real assets like the stock market or like rental property. And so in some ways, you know, an individual&#8217;s journey from kind of starting out to quitting their job means going from a kind of working class mindset to a middle-class mindset and ultimately throwing that off and becoming your own boss and your own kind of if you like the CEO of your own of your own life which, which means kind of you know, being, being your own Lord of the Manor as it were.<br/><br/><strong>Mad Fientist:</strong> And that appears to be a very difficult to do because as you&#8217;ve seen, you know, this whole thing has not grown as quickly or or as broadly as it has in the States. And I think that&#8217;s probably because it&#8217;s such a big identity shift for people in the UK who,ou know, have always considered themselves working class. And just always imagine they would be working class because that&#8217;s what their parents were and that&#8217;s where their grandparents were. And, you know, obviously in America, like the American dream, everybody is born and think they they&#8217;re going to be the richest person in the country. And obviously that doesn&#8217;t happen to everyone but I see that difference there too. It&#8217;s like people do feel like they can move up and they all think that they will. Now, that&#8217;s great because that drives people and gives them, you know, motivation to work hard and do things like that. But also, I worry that that&#8217;s sorta some of the discontent and unhappiness in the States, especially these days with social media, where you can see the people that have made it and you haven&#8217;t quite made it there yet because you, and you may not because not everybody will. And so in Scotland, at least, like I find that it looks like more people are broadly happier just on day-to-day life and they&#8217;re happier with their position and make the best life that they can at that level.<br/><br/>Do you agree with that? And if so, do you think it&#8217;s more of a benefit or more of a hinderance?<br/><br/><strong>Escape Artist:</strong> That&#8217;s a great kind of insight. I mean, I am a great believer in meritocracy. I&#8217;m a great believer in social mobility. I&#8217;m a great believer in that idea that anyone should be able to kind of rise to be the CEO.<br/><br/>The downside of that is that if you create a truly meritocratic society and then individuals fail, they&#8217;ve kind of got no one to blame other than themselves. And it&#8217;s, it&#8217;s like, It&#8217;s like you&#8217;ve unleashed a set of expectations there that if people are unable to meet through whatever reason, you know, maybe, maybe it&#8217;s there it&#8217;s, it&#8217;s something that they did wrong, maybe it&#8217;s just bad luck. You know, luck plays a huge part in life, in money, and investing, as we all know. And so if you live in a culture that is meritocratic and socially mobile, such as the US that&#8217;s great for a mindset of, I can do anything, but that the kind of the flip side of that is failure hurts more.<br/><br/>And you know, you could, you can make a very good argument for, you know, that there&#8217;s, there&#8217;s, there&#8217;s almost this comfort in kind of staying in your, in your world and what you know, and so. You know, meritocracy has a cost. It&#8217;s if you look at kind of suicide rates, for example, suicide rates, suicide is not a problem in feudal societies because everyone knows their place and even people at the bottom of the pile, they don&#8217;t beat themselves up about that. Cause it&#8217;s just, that&#8217;s just the hand that they were dealt. So one of the kind of downsides of meritocracy is it just feels harder when you fail. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s a good time to bring up what we were talking about just before we started the interview and how you were saying how you&#8217;re focusing more on, you know, talking about enjoying that journey to financial independence, rather than that end goal.<br/><br/>Can you maybe talk about that focus and what made you shift to that. <br/><br/><strong>Escape Artist:</strong> Yeah this is a theme that I&#8217;ve been exploring more and more in recent blog posts, because I think that the, the carrot of early retirement is so kind of powerful as a, as an image as a kind of an attention grabber as, as a hook for a lot of people and particularly a lot of media coverage of financial independence just focuses on that.<br/><br/>Here are the people that retired in their thirties or here are the people that retired in their forties, but that crowds out the kind of more subtle benefits of this way of life, of this way of thinking about the world. And so, I&#8217;ve been kind of exploring that in recent blog posts. <br/><br/>I wrote a blog post recently called \"Here&#8217;s what&#8217;s in it for you right now\".<br/><br/>Just looking at the benefits from pursuing financial independence you know, the benefits, things like, you know, having a mission, having a goal, having a clear idea of where you want to get to, kind of forcing yourself to take action, forcing yourself to exercise your frugality muscle, forcing yourself to exercise your actual muscles and start kind of walking rather than just getting ferried around in cabs.<br/><br/>These are the kind of immediate benefits of pursuing financial independence because ultimately, I think that if the way that you&#8217;re thinking about this is I will accept 15 or 20 years of misery and deprivation in order to get to the promised land, that&#8217;s a bad trade. <br/><br/><strong>Mad Fientist:</strong> Yeah. Couldn&#8217;t agree more. And, what you said, highlights that, even if you are uncomfortable with the idea of maybe moving up to another level that you hadn&#8217;t even thought about, or if you are very comfortable and happy in the current level that you&#8217;re at, which is great, like, this is all at the end of the day about happiness and living a fulfilling life.<br/><br/>So if you&#8217;re already there. Yes, that carrot of early retirement is probably not going to be too motivating. But as you said, there are so many other benefits and I will link to that post in the show notes, so anybody can check that out if they want to dive in more. But yeah, I couldn&#8217;t agree more.<br/><br/>So we&#8217;ve, we&#8217;ve covered sort of this cultural, societal differences, but also, you know, the government here is very different. The social nets in place are different. And so surely that plays into it. One on a tax perspective, you&#8217;re going to be paying more taxes, but then you also have, you know, less distance to fall if things do go wrong. Could you maybe talk about those differences? <br/><br/><strong>Escape Artist:</strong> Yeah, so I think it&#8217;s absolutely right that it&#8217;s harder to get to financial independence in the UK in the sense that post-tax incomes are typically lower than in the US for two reasons. One is, the tax burden is higher in the UK, and secondly, it&#8217;s just not quite as rich an economy.<br/><br/>And so you&#8217;re trying to save 50 plus percent of your income out of post-tax income, which is lower in the UK than the US, so that let&#8217;s make no bones about it&#8230;that makes it harder. No doubt. The counter balance to that is that you hopefully do not have to pay for health insurance from your post tax income.<br/><br/>But again, that&#8217;s an interesting one because when I was in my corporate job, I had private health insurance through my job. And so for me to walk away from that, I kind of had to get over the mental hurdle of what if the NHS isn&#8217;t there to fix me in a reasonable period of time, because, as we all know, there are waiting lists for a number of operations in the UK.<br/><br/>And so part of the equation is what if I needed one of those operations and I wasn&#8217;t prepared to wait one or two years for it. So again, that&#8217;s kind of thinking about, am I mentally prepared to self insure? Because the truth is, the NHS is excellent for very urgent conditions.<br/><br/>You know, life-threatening, urgent, acute conditions, but you always have the option to buy in private medical treatment at short notice, if that&#8217;s what you want to do. And actually, when I&#8217;ve looked at the kind of cost benefit analysis of that, some of the kind of general health insurance premiums are so high, I just think, look, I&#8217;ll keep myself healthy and hopefully I won&#8217;t need it, but if I just need to buy in an operation at some point, I can afford to do that. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s really interesting. That&#8217;s a good way to think about it. Because I had heard that lots of people had private health insurance, but I didn&#8217;t think you could self-insure in that way.<br/><br/>So you&#8217;ve been just relying on the NHS since then? <br/><br/><strong>Escape Artist:</strong> Yeah. I mean, touch wood. I haven&#8217;t had great call to kind of visit the NHS for myself too much since then. But, I take comfort from the fact that having looked at some of the kind of costs of operations, it&#8217;s actually not much more to buy it in than it is to pay the annual insurance premium.<br/><br/>So it&#8217;s relatively affordable if you have kind of FI levels of net worth. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s fantastic. As someone who is an American living in the UK the NHS just is, I love it. And we&#8217;re a bit spoiled in Scotland because the population is lower and I think there&#8217;s more coverage with doctors per person in the population so we don&#8217;t have to deal with a lot of the things that you may have to deal with down in England. But I just absolutely love the feeling of going into a doctor&#8217;s office and them just asking all these questions, trying to get to the bottom of why you don&#8217;t feel well, and then them referring you to anyone that they think could help better without thinking about costs or how much is it going to be to see a specialist or how much is this prescription going to be?<br/><br/>It just boils down to, how do you feel? How can we make you feel better? And we&#8217;re going to do all these things because we think those are the things that are gonna make you feel better. And it just, it&#8217;s very refreshing for peace of mind and for someone who&#8217;s a relatively healthy person, I have really enjoyed just the security of it and just knowing that it&#8217;s there. And, as you said, you always have the option to go private to, which is no doubt, a lower cost than going private in the States would be. <br/><br/>And in Scotland, there&#8217;s also free education. So free higher education, which is something that people in England may not have the same sort of privilege of having. Is that correct? <br/><br/><strong>Escape Artist:</strong> That is absolutely correct. And that&#8217;s something that&#8217;s changed since I went to university. Back then it was kind of a no brainer in the sense that only perhaps 10% of the population went to university and you got free tuition fees. And that has changed. And this is very fresh in my mind right now because my daughter&#8217;s just about to go off to university in the next few weeks. And so I&#8217;m very well aware of the cost. The cost has gone up and it&#8217;s cost is now born by the by the student. And. In some ways the returns to a college education have decreased because if 50% of the population are going to college education, then ultimately you&#8217;ve just got a much broader pool of people competing for the same jobs that you used to have, the 10% of the population competing for.<br/><br/>So, back in the day, university was an absolute no brainer in the UK. Now, I think it&#8217;s a more kind of balanced cost benefit decision to be made. <br/><br/><strong>Mad Fientist:</strong> So eliminating potentially big student loan debt, if you&#8217;re in Scotland or I believe even in England, the costs of higher education are lower and then taking away the burden of paying for your own health insurance or finding a job that provides you health insurance so that you can cover healthcare costs. Those two things seem like a huge leg up on someone&#8217;s journey to financial independence. Do you think that those benefits outweigh the lower wages or do you think in general it is still more difficult?<br/><br/><strong>Escape Artist:</strong> I think it&#8217;s a whole range of factors. And I think the fact that college tuition is free in Scotland or was free in England for me. That&#8217;s a huge advantage in the column for the UK. I still think that when you kind of add everything up, it&#8217;s somewhat easier to get to financial independence in the US than the UK, but that includes a very broad range of factors.<br/><br/>You know, part of which is behavioral, as well as the kind of pure economics of it. <br/><br/><strong>Mad Fientist:</strong> Yeah, based on what I&#8217;ve seen, I would agree with you. I think the higher incomes that you can potentially achieve in the States are obviously a big benefit to someone pursuing FI. <br/><br/>To move on to some of the more nitty gritty details.<br/><br/>The first thing I wanted to talk to you about is pensions because I have a pension from my very first job in my career. And it is the most annoying thing because if you have foreign accounts over 10,000 dollars, you have to tell the government that you have them every single year. So I have this pension from, I think it was 2004 was probably when I started the job and I worked there for three or four years so I have exceeded that amount, but not by much. So I have this annoying account that I can&#8217;t transfer the money to the States, because all my other money I&#8217;ve just transferred to the States, and this thing is locked down and I was even considering like giving it to my wife, Jill, just so it wasn&#8217;t mine anymore and I wouldn&#8217;t get into trouble with the government if I forgot to tell them about it one year. And I&#8217;ve thought about giving it to charity. All these things and I have not found a way to get rid of it.<br/><br/>So maybe just talk about the prevalence of pensions here. If they are similar to a 401k, in some ways, if they&#8217;re different. And, is there any way I can get that money out of my name? <br/><br/><strong>Escape Artist:</strong> Is that a UK pension?<br/><br/><strong>Mad Fientist:</strong> It is, yes. <br/><br/><strong>Escape Artist:</strong> Okay, so I divide UK pensions into two, broadly. So there&#8217;s the pension scheme that your probably in with your workplace pension, but that relates to your current employment.<br/><br/>And then there&#8217;s SIPS, self invested personal pensions and normally the way that your workplace pension works in the UK is that there is some form of matching going on. So maybe you&#8217;re asked to put in 5% and if you put in up to 5%, then your employer may put in up to 10%.<br/><br/>So maybe they kind of double what you put in it. If that&#8217;s the case, if there&#8217;s any sort of matching, then you never leave free money on the table. You always put in the most that you can to get your employer match at a hundred percent. So that&#8217;s kind of step one. Step two is people&#8217;s current workplace pension.<br/><br/>Most people have no idea what&#8217;s going on with it. And so. I say to people just dig out the paperwork. What happens time and time again is people join a job, they get sent a stack of papers to look at, they never kind of get around to reading it all. It&#8217;s all very lengthy, boring, confusing. And so people kind of bury their head in the sand. The problem with that is that you will get defaulted into an automatic kind of default fund choice where someone else has made the decision for you and it&#8217;s probably a suboptimal asset allocation. So if you don&#8217;t make a conscious choice with your workplace pension, you&#8217;re probably being put into something like a 60/40, 60% equities, 40% fixed income.<br/><br/>And if you&#8217;re 25 that&#8217;s a disaster, or if you&#8217;re 30, that&#8217;s a disaster because 40% of your pot is earning not enough to keep up with inflation and only 60% of it is doing the heavy lifting that equities do over the long term. So the first thing most people need to do is just understand what fund their contributions are going into.<br/><br/>You know, normally you can just make a choice to go 100% equities in a global equity tracker tracker fund. Now often Vanguard is not on the option for a workplace pension, but there&#8217;s almost always a kind of Vanguard lookalike. In other words, a low-cost global equity index tracker fund, where that&#8217;s a hundred percent equities.<br/><br/>So that&#8217;s, that&#8217;s the next thing to look at. And then, if you want to get more kind of hands-on and more clever, you have the option of what&#8217;s called partial transfers, where you can take money out of your workplace pension and move it across to a self-invested personal pension to benefit potentially from lower fees and the ability to access Vanguard&#8217;s product range.<br/><br/>And so you often have to stay in your workplace pension to carry on getting the contributions, but that doesn&#8217;t mean you can&#8217;t shift money out of it and get control over that money by, by what&#8217;s called a partial transfer. <br/><br/><strong>Mad Fientist:</strong> That is great to hear because I did not realize that and I think that&#8217;s what I&#8217;m going to do.<br/><br/>So yeah, exactly as you said, I did all the right things. I was 22 and that was starting my career. And I was like, oh, I know I need to get this match so I&#8217;m going to do this. And then I actually looked into the investment, so I&#8217;m invested in better things than whatever the default was, that&#8217;s for sure.<br/><br/>But now if I can transfer that into my own thing, and have lower fees and then maybe put all my riskiest investments in there. And then that way, if it does get to zero, then at least I don&#8217;t have to deal with the account anymore. And if it grows to something even more impressive, then at least then it&#8217;s worth the hassle of dealing with it with the IRS every year.<br/><br/>So that could be a potentially really good choice to make. <br/><br/><strong>Escape Artist:</strong> You raise a great point about risk there. In your pension, you&#8217;ve got time on your side. You&#8217;re not going to be able to access that until you&#8217;re 55 or 57 or whatever the age may change to be in the future.<br/><br/>So for anyone that&#8217;s five or 10 years plus away from that point, you should be taking as much risk as possible in that workplace pension. Why would you not be 100% in a global equities index tracker fund? <br/><br/><strong>Mad Fientist:</strong> You said tracker fund. So this is a good time to maybe match up some terminology.<br/><br/>So in the UK, a tracker is an index fund and that&#8217;s the common word for it. Could you maybe go through the list of common US terms that I use a lot on my blog and some of the other bloggers use as well, like 401k, IRA, and maybe try to match it up with the UK equivalent? <br/><br/><strong>Escape Artist:</strong> So a lot of UK readers read the US blogs and they see people talking about VTSAX and they see people talking about VTI, which are two of the popular Vanguard total market funds in the US.<br/><br/>And I just say to people in the UK, we have great equivalence for that in the Vanguard UK product lineup. So if you convert VTSAX or VTI into VWRL which is the Vanguard all-world equities ETF, or there&#8217;s a mutual fund called the Vanguard global all-cap index fund.<br/><br/>Those are great kind of replacements for those popular US funds and VWRL and the Vanguard global all-cap index on are truly global funds. So they include the US at its full weighting. They include the UK, Japan and the whole of the rest of the world. So it&#8217;s a kind of easy win just to convert VTSAX to VWRL or and so.<br/><br/>So that&#8217;s an easy one. In terms of IRAs, individual retirement accounts, are analogous to self-invested pension plans. 401ks are analogous to our workplace pension schemes. <br/><br/>Other things that people read about on US blogs are, travel hacking and credit card credit card rewards, which there&#8217;s less of an opportunity for that in the UK. And so I just say to people, you know, that&#8217;s nice if you can get yourself an Amex Platinum card and you might get 1% cash back and like 1 percent is worth having, right. But you&#8217;re probably not going to be able to fly around the world on your credit card rewards in the same way that our American friends seem to be able to do.<br/><br/><strong>Mad Fientist:</strong> Yeah, my brother-in-law who is Scottish, he just can&#8217;t stand the amount of things that I get through credit card points. And he is just always desperate to try to get into the same sort of things. The signup bonusesare usually a quarter or less of what you could get in the States and then the ongoing earning is like you said, max, maybe 1% cash back.<br/><br/>So yeah, the people in the States do have it really good. <br/><br/><strong>Escape Artist:</strong> Yeah. And there&#8217;s a couple of other kind of aspects in terms of the tax sheltering that are different. So in the UK, money that&#8217;s locked up in a pension is locked up in a pension. There is no concept of you can access it, but you pay a discount, which I understand is possible in the US so when you&#8217;re thinking in the UK about how much is enough, you can take the great kind of guidance that&#8217;s on many of the US blogs and the concept of the safe withdrawal rate and the 25 times rule of thumb.<br/><br/>That is, I would argue as applicable in the UK as it is in the US. Because, you know, we can from the UK, invest globally. So I just don&#8217;t buy the argument that says, the safe withdrawal rate, maybe 4% in the US but the UK stock market is less dynamic and has delivered less growth.<br/><br/>You know, we have the ability to invest into the US stock market. We have the ability to invest globally, as I said before, from the UK. So that&#8217;s no reason for the safe withdrawal rate to be lower in the UK. But it&#8217;s a kind of two-fold calculation. So calculation number one is, do I have 25 times my annual spending in my invested net worth.<br/><br/>And then the second question to ask yourself is, do I have enough to bridge the gap? In other words, do I have enough outside of my pensions to take me from age, let&#8217;s say 45 to age 55. You need 10 years outside of your SIPP or outside of your workplace pension to bridge that gap. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s something I actually calculated when I was on the path to FI, even though I didn&#8217;t know that there were ways to get the money out.<br/><br/>And so if you&#8217;re interested, you can go to madfientist.com/spreadsheet. And that spreadsheet actually does divide it out and it has an after retirement age, before retirement age calculation, just so you can see, how much of your money is free to use now and how much of it in the States is going to be a little bit harder to use potentially and then in the UK, it&#8217;s going to be impossible to use. <br/><br/>You mentioned ISAs which I think is the equivalent to the IRA. I just recently discovered the lifetime ISA, which seems like a pretty sweet account. And I just convinced my wife to set one up for herself because I believe you have to set it up before you&#8217;re 40, but then you could keep contributing to it until you&#8217;re 50 and it&#8217;s an account where every year you can put 4,000 pounds into it and then the government will give you a thousand pounds on top of that for that same contribution. So you&#8217;re effectively getting a 25% return instantly. Are there any other sweet accounts like that, that I may not be familiar with? Or what are the types of accounts that you sort of recommend to your readers to take advantage of? <br/><br/><strong>Escape Artist:</strong> Okay. So in, in terms of pure tax efficiency, the most tax efficient way to save in the UK is via a pension at your workplace pension or a self invested personal pension. So the way that that works is if, for example, you&#8217;re 40% taxpayer, if you put in 60 pounds into your pension, the government groceries that up to 100 within the space of a year. And so you&#8217;re getting a 40 pounds return on a 60 pound investment, free of risk, essentially, and guaranteed by HM government. And so there&#8217;s not many deals that are better than that available, plus the fact that when you get to access your pension, you can take 25% of it as a tax-free lump sum.<br/><br/>So that&#8217;s a great deal. The problem with that though is the loss of liquidity, the loss of access, the lockup until you&#8217;re 55 or 57 or whatever that may change to in the future. The beauty though of ISAs, individual savings accounts, is that there&#8217;s no lockup. So let&#8217;s say you&#8217;re kind of in your twenties and you&#8217;re going full bore for financial independence.<br/><br/>It would be a mistake for someone like that to use their pension as their sole savings vehicle. They need to they need to use their ISA. You have a 20,000 pounds limit every year, if you&#8217;re married, that means you effectively as a couple, you have 40,000 of tax-free savings ability and that is use it or lose it.<br/><br/>So it absolutely makes sense to use it. And so that kind of conventional ISA, I would suggest you use first because that shelters the money effectively from income tax and capital gains tax and there&#8217;s no liquidity lock up to it at all. Then in addition to that, you have the lifetime ISA that you mentioned. The problem with the lifetime ISA is that if you don&#8217;t use it to buy a house and you want it back before retirement age, you pay a penalty, which essentially means that you&#8217;re slightly worse off for having done that.<br/><br/>So lifetime ISAs work for people under 40 who know that they&#8217;re going to use the pot to buy a house, or they know that they can wait until retirement age. But if you&#8217;re not sure that you&#8217;re gonna buy a house and you might want to get your hands on it, then it&#8217;s not as advantageous as just a conventional ISA.<br/><br/><strong>Mad Fientist:</strong> Yeah. Luckily for my wife, this will be after retirement age. So she&#8217;s comfortable with it being locked up. Or she&#8217;s not very comfortable with it, but she was able to be convinced that she should do that. <br/><br/>And so the lifetime, I say, you mentioned that you could get that money out early for home purchase. That&#8217;s a first time home buyer purchase, is that correct? <br/><br/><strong>Escape Artist:</strong> Yes, I think so. Yeah. <br/><br/><strong>Mad Fientist:</strong> Okay. So this brings us nicely into real estate. So there&#8217;s something I had just learned from a Mad Fientist reader. Actually, it was meeting up with somebody for a beer a couple of weeks ago, and he told me about the fact that you could potentially Airbnb out one of your rooms in your residence and earn up to 7,500 pounds without paying taxes on it.<br/><br/>Is that something that you&#8217;ve come across? <br/><br/><strong>Escape Artist:</strong> Yeah, the government has a rent-a-room scheme where you can, as you say first 7,500 pounds is free of tax. And I just don&#8217;t know why more people don&#8217;t do this. To me, if you read the newspapers, which I don&#8217;t recommend actually in most cases, you&#8217;ll read about the pensions crisis, whereby many people don&#8217;t have enough in their pension to sustain them. And you&#8217;ll also read about something about the housing crisis. Housing is expensive in the UK, there is a shortage of decent quality rooms to rent that give you kind of a lower cost option than buying your own home or renting a whole house out.<br/><br/>And the rent-a-room scheme is the answer to both. So people with spare rooms and not enough in their pension get income and younger people that want cheap accommodation, they get cheap accommodation. So to me, we have this crazy situation where there&#8217;s a housing crisis at a time where I think there&#8217;s something like 19 million spare rooms in England not being occupied. <br/><br/><strong>Mad Fientist:</strong> Speaking of real estate, how do you feel that plays into somebody&#8217;s FIRE journey? Is it as lucrative, potentially, as it is in the States are the differences? What is your take on real estate investing? <br/><br/><strong>Escape Artist:</strong> So my take on real estate investing. There&#8217;s two traditional classes of assets that have worked for wealth building, wealth accumulation, and getting to financial independence. You know, one is equities/stock market and the other is real estate. And in some ways, if you really want to get there quickly, one way to speed up the journey is to kind of go extreme on the property side. So if I&#8217;d wanted to have got to financial independence ,quicker one of the options that we could have done is rather than buying a house and kind of settling down in it, we could have like buy a house, do it up, flip it, and just keep flipping, keep moving up the property ladder because there&#8217;s no capital gains tax on your primary principal residence. And so with the stock market outside of a tax sheltered account, there&#8217;s income tax and capital gains tax, and the equivalent in property is that for buy-to-let properties, you are subject to capital gains tax, but for your own home you can escape those capital gains. And so it&#8217;s a tax efficient way to accumulate wealth and kind of roll up value in your house. <br/><br/>What say to people though, is if you own a house in the UK, you probably have a big chunk of your net worth in UK real estate. Just because housing is so expensive here and therefore I don&#8217;t personally think it makes a lot of sense to then add to that exposure to UK real estate in terms of then building up a buy-to-let portfolio, because you&#8217;ve kind of got all your eggs in one basket and essentially, Brexit has been a reminder to people who have a lot of money in the property basket that things can happen and the situation can change and that assets that they thought were kind of uncorrelated are in fact correlated.<br/><br/>So the way that I&#8217;ve done it is to buy a house, to own that house, to pay the mortgage off, but then to use stock market as my kind of primary source of wealth building for that kind of risk reason. <br/><br/>Also if you look at the data in the UK, if you look at last a hundred years or so, it wa it would seem to indicate that an unleveraged real estate and the stock market perform pretty similarly in terms of total returns, but the beauty of the stock market versus buy-to-let landlording is it&#8217;s a truly passive investment. So there&#8217;s no boilers breaking. There&#8217;s no phone calls late at night from your agent or from the tenants. So the beauty of stock market investing is it can be made essentially free of hassle.<br/><br/><strong>Mad Fientist:</strong> So we&#8217;re getting to the end of the interview here and there&#8217;s possibly questions that I didn&#8217;t even know to ask. And there may be things that I don&#8217;t even know about in the UK that you would recommend to somebody on the path to FI. Is there anything we haven&#8217;t touched on yet that&#8217;s worth speaking about or is there anything so different that I just don&#8217;t even know?<br/><br/><strong>Escape Artist:</strong> So I think it&#8217;s worth talking about in the UK context, kind of geographic arbitrage, just in the sense that a lot of people who are on this path to financial independence are based in a high cost of living area, you know, London or the Southeast and they&#8217;re living there now and they&#8217;re on the property ladder and they have a lot of money tied up in expensive London housing, or expensive Southeast housing and one option to kind of massively accelerate your journey is to sell up in London at some point and just move somewhere much cheaper.<br/><br/>So that the kind of example that I give it&#8217;s somewhat of an extreme example, but it does kind of make the point. If you&#8217;re slaving away as a professional in London, in a small terrace house, life can feel like a bit of a grind and yet, a short plane ride away in the south of France, the real estate is amazing in the sense that you had modern two bedroom apartments that you could buy on the beach front for 50-60,000 euros. And just imagine how many people there are in London sitting in their half a million or 1 million pound semi-detached house or terraced house who at a stroke could just sell up, go and live on the beach in the south of France. <br/><br/>And look, I&#8217;m not suggesting that everyone do that because it&#8217;s a really important part of financial independence is working out what you do when you get there and what that looks like and how do you build a kind of meaningful life with a community and you don&#8217;t just kind of take yourself off to the beach and live isolated. But it does show you the power of being prepared to be flexible. It does show you that the power kind of thinking outside the box and it does show you how much money we in the UK kind of sink into our houses and that they can end up kind of being an anchor in the sense that they tie you to one place and they kind of trap you in one place.<br/><br/>So I do say to people in the UK, if you don&#8217;t know that you&#8217;re going to be living somewhere for ideally 10 years, then you&#8217;ve really got no business buying there because the costs are so high, not just the kind of purchase price, but the stamp duty, et cetera, you&#8217;re better to stay flexible at this point in the cycle.<br/><br/>And you know, at some point, conditions will change and maybe there&#8217;ll be a housing bust and some great bargains will be available. I mean, imagine the bargains that would be available if we went back to those 17% interest rates. So the wheel will turn and at some point there will be bargains to be had.<br/><br/>But, but right now, to me, it makes no sense to tie yourself to one place if you don&#8217;t know that you&#8217;re going to be there long term, when, when housing costs are so high in the UK. <br/><br/><strong>Mad Fientist:</strong> And just like with all geographic arbitrage, it doesn&#8217;t necessarily have to even be international. You could, move an hour and a half outside of London, still be close to your family and friends and maybe cut that house price in half. Or even move up to Edinburgh&#8230; Don&#8217;t inflate our house prices, but yeah, somewhere like Edinburgh, that&#8217;s beautiful and still a city with all the amenities that you enjoy in London, but maybe a quarter of the cost, which is maybe what property prices are up here.<br/><br/><strong>Escape Artist:</strong> Well, I don&#8217;t want to give away your personal location, brandon, but we are sat here in a beautiful kind of crescent of Georgian and housing, which in London would just be insanely expensive.<br/><br/>So the quality of life here is amazing. <br/><br/><strong>Mad Fientist:</strong> I completely agree. Yeah, this is like a very reasonably priced, flat, fully furnished that we rent and it&#8217;s in the center of the city and it&#8217;s a capital city in Europe, and yet we pay not much compared to what they pay down in London, which is really good. <br/><br/>We&#8217;re we&#8217;re getting to the end of the interview and this has been incredible so I really appreciate you taking the time to talk with me. Obviously people can find you at theescapeartist.me. Is there anywhere else I should point them to?<br/><br/><strong>Escape Artist:</strong> No, the blog is the place to find me. I am on social media, but you can kind of find that through the blog. <br/><br/><strong>Mad Fientist:</strong> Great. Well, I can&#8217;t let you go without asking the question that I&#8217;ve asked all my guests so what&#8217;s one piece of advice you&#8217;d give to somebody on the path to financial independence? <br/><br/><strong>Escape Artist:</strong> My piece of advice would be to start and to start as early as you can. And just get on with it, right. There are no downsides to getting on this path. It is not binary in the sense that it&#8217;s not like you&#8217;re having to commit to a path that you can&#8217;t change as you go along.<br/><br/>So I often see people kind of procrastinating, kind of agonizing over you know, what&#8217;s the best fund or what&#8217;s the best strategy. The best thing that you can just do is think 80/20, get started, take some action, and get on the path and you will figure out the rest as you go along, you don&#8217;t have to figure it all out upfront. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s great advice. And this has been an absolute pleasure. So thank you so much for joining me. This is a long time coming. I think sometime last year we were trying to meet up in a pub somewhere because I thought the UK episode should take place in a London pub. But that didn&#8217;t happen so this has been a long time coming. So I really appreciate you joining me. <br/><br/><strong>Escape Artist:</strong> I just wanted to say thank you, Brandon, because your podcast was one of the things that gave me the confidence to quit my corporate job. In 2013, I&#8217;d stumbled across the Mr. Money, Mustache website, and that was just amazing, but it&#8217;s one thing to read information kind of cold on the internet that doesn&#8217;t necessarily give you enough comfort to kind of change your life.<br/><br/>It&#8217;s kind of terrifying to quit a job that is going well, that you&#8217;re successful in, and that forms part of your identity. And to make that transition, I just needed to hear other people that had been there, done that, and walked that path and your podcast just brought that to life for me. So I honestly don&#8217;t think I would have got up the courage to quit my corporate job if it hadn&#8217;t been for your podcast. <br/><br/><strong>Mad Fientist:</strong> That&#8217;s absolutely incredible to hear and I did not realize that. So congrats for being able to take the leap and it&#8217;s amazing that I played a little bit of a part in that.<br/><br/>So thanks for saying those kind words and thanks for joining me. And it&#8217;s 2:45 PM now. So I think that&#8217;s a late enough to warrant a celebratory pint for all our hard work today. So let&#8217;s let&#8217;s close this up. Thanks again, Barney. And I&#8217;ll hopefully speak to you again soon. <br/><br/><strong>Escape Artist:</strong> Thank you. No, we&#8217;re late to the pub now. <br/><br/><strong>Mad Fientist:</strong> Onward to the pub.<br/><br/>All right. Thanks again.\n</div>\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/money-talks/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Money Talks - Live from the UK Chautauqua with Vicki Robin</h3><p class='post_card_excerpt'>Listen as we play the first-ever game of \"Money Talks\", the new game created by the author of Your Money or Your Life, Vicki Robin!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2018/03/money-talks.jpg' style='border-radius:7px;'/></div></div></a></div><p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/escape-artist-interview/\">The Escape Artist &#8211; FIRE in the UK</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/escape-artist-interview/feed/",
  "slash:comments": 19,
  "enclosure": ""
}