{
  "title": "144: Big Dan's: The Nation's First Televised Rape Case",
  "link": "https://audioboom.com/posts/7654851",
  "itunes:episode": 144,
  "itunes:title": "Big Dan's: The Nation's First Televised Rape Case",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3090,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In 1983, a 21 year-old woman walked into a bar in New Bedford, Massachusetts. When she tried to leave a little later, the door was locked and 4 men raped her over the course of 2 hours on the bar's pool table while a group of other men cheered them on. Nobody helped her. When the case went to court, it would be the nation's first televised rape case. And the woman, who wished to remain anonymous, would be unmasked on live TV.<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a>\n</div>\n",
  "pubDate": "Tue, 11 Aug 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-08-11:/posts/7654851",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}