{
  "title": "Variable Attention Masking for Configurable Transformer Transducer Speech Recognition. (arXiv:2211.01438v1 [eess.AS])",
  "link": "http://arxiv.org/abs/2211.01438",
  "description": "<p>This work studies the use of attention masking in transformer transducer\nbased speech recognition for building a single configurable model for different\ndeployment scenarios. We present a comprehensive set of experiments comparing\nfixed masking, where the same attention mask is applied at every frame, with\nchunked masking, where the attention mask for each frame is determined by chunk\nboundaries, in terms of recognition accuracy and latency. We then explore the\nuse of variable masking, where the attention masks are sampled from a target\ndistribution at training time, to build models that can work in different\nconfigurations. Finally, we investigate how a single configurable model can be\nused to perform both first pass streaming recognition and second pass acoustic\nrescoring. Experiments show that chunked masking achieves a better accuracy vs\nlatency trade-off compared to fixed masking, both with and without FastEmit. We\nalso show that variable masking improves the accuracy by up to 8% relative in\nthe acoustic re-scoring scenario.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Swietojanski_P/0/1/0/all/0/1\">Pawel Swietojanski</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Braun_S/0/1/0/all/0/1\">Stefan Braun</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Can_D/0/1/0/all/0/1\">Dogan Can</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Silva_T/0/1/0/all/0/1\">Thiago Fraga da Silva</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ghoshal_A/0/1/0/all/0/1\">Arnab Ghoshal</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Hori_T/0/1/0/all/0/1\">Takaaki Hori</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Hsiao_R/0/1/0/all/0/1\">Roger Hsiao</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Mason_H/0/1/0/all/0/1\">Henry Mason</a>, <a href=\"http://arxiv.org/find/eess/1/au:+McDermott_E/0/1/0/all/0/1\">Erik McDermott</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Silovsky_H/0/1/0/all/0/1\">Honza Silovsky</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Travadi_R/0/1/0/all/0/1\">Ruchir Travadi</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Zhuang_X/0/1/0/all/0/1\">Xiaodan Zhuang</a>"
}