{
  "title": "Many More Student Loan Borrowers to Get Discharges Through a Determination of Disability",
  "link": "https://www.aei.org/health-care/many-more-student-loan-borrowers-to-get-discharges-through-a-determination-of-disability/",
  "dc:creator": "Josiah Johnson",
  "pubDate": "Wed, 02 Nov 2022 18:49:41 +0000",
  "category": [
    "Health Care",
    "Health Economics",
    "Department of Education (ED)",
    "Office of Management and Budget (OMB)",
    "Social Security",
    "Social Security Disability Insurance",
    "Student debt",
    "Student loans"
  ],
  "guid": "https://www.aei.org/?p=1008664629",
  "description": "<p>The Department of Education has issued a final regulation that significantly expands various classes of individuals eligible to get their federal student loans forgiven. Among the classes affected are individuals with disabilities.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/health-care/many-more-student-loan-borrowers-to-get-discharges-through-a-determination-of-disability/\">Many More Student Loan Borrowers to Get Discharges Through a Determination of Disability</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>On October 31, the Department of Education (DoED) issued a <a href=\"https://www.govinfo.gov/content/pkg/FR-2022-11-01/pdf/2022-23447.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">final regulation</a> that significantly expands various classes of individuals eligible to get their federal student loans forgiven. Among the classes affected are individuals with disabilities.</p>\n\n\n\n<p>First, the regulation increases substantially the group of student loan borrowers, including parents, who can get a loan discharge based on disability as determined by the Social Security Administration (SSA) for Disability Insurance (DI) or Supplemental Security Income (SSI). Specifically, it expands from those designated by SSA as Medical Improvement Not Expected (a minority of disability beneficiaries) to those designated as Medical Improvement Possible (a larger group), those who transitioned from DI to retirement benefits (another large group), those with a severe medical impairment, and those whose disability onset date was five years before or whose receipt of disability benefits has lasted five years before the loan discharge application (again, a large group). That is, in total, a substantial majority of DI and SSI disability and some retirement beneficiaries are now eligible for student loan discharges.</p>\n\n\n\n<p>Second, the regulations eliminate the current requirement that borrowers must supply to the DoED their income information annually through a three-year post-discharge monitoring period to ensure that they continue to meet the earnings criteria for the program. Finally, the regulation expands the list of eligible health care professionals able to certify an individual’s total and permanent disability (in addition to physicians and outside of the SSA and Veterans Affairs’ official determinations) to include nurse practitioners, physicians assistants, and psychologists.</p>\n\n\n\n<p>DoED estimates that these changes will cost taxpayers $1.5 billion on an annualized basis. Although the final regulation gives some data to support this estimate, in particular that the number eligible for loan discharge on the basis of SSA-determined disability will double, my hunch is that this is an underestimate, given the substantial expansion of the groups. (The DoED has a <a href=\"https://www.gao.gov/products/gao-22-105365\" target=\"_blank\" rel=\"noreferrer noopener\">poor track record</a> at scoring the cost of student loans, resulting in severe underestimates.) The regulation also considerably downplays a potential explosion of discharges from the separate and combined effects of greatly expanding the list of eligible health care professionals certifying disability, and the elimination of the earnings monitoring period. It is certainly possible, even probable given DoED is unlikely to closely supervise the process, that the new inclusion of hundreds of thousands of relatively lower-paid health care professionals who are not experts in disability determination will lead to many student loan borrowers asking for and getting from their health providers a declaration of disability, outside of the fairly rigorous process now in place at SSA for disability determination and earnings follow-up. This is so particularly given the current known and reasonable reluctance of physicians to participate in this process.</p>\n\n\n\n<p>The lack of a follow-up on earnings by DoED, which might have caught the mistakes (and fraud) of this new group of health providers, will expand the loss to taxpayers. The regulation’s score estimators—and their Office of Management and Budget (OMB) overseers—also seem to be unaware of an important trend in DI beneficiaries: Whereas in the past most did not have college educations, now the majority of new beneficiaries do and many of them will have student loans.</p>\n\n\n\n<p>Extending the review of this rule change further, the disability class expansion is not well targeted as required by the Higher Education Act and good policy. It includes those whose disabilities will improve and can return to work, those who have considerable individual and household incomes and assets, and those whose disabilities will be determined by non-experts and are therefore doubtful or minimal. DoED is not being creative in the use of data exchanges on income and earnings with other government agencies. The entire final regulation containing numerous major changes was pushed through in an extremely rushed fashion (three months!) and through a DoED-selected commission of interested and conflicted parties with no representation from researchers on higher education finance or the general public, i.e. taxpayers. Although I am unable to be specific in this quick review, I am suspicious that not all of the extensive and several OMB data, research, legal and other requirements and layers of review on the regulatory process were satisfied, given the rush and <a href=\"https://www.regulations.gov/docket/ED-2021-OPE-0077/comments\">more than 5,000 comments</a>, certainly compared to my own experience of several arduous years spent at SSA working on disability regulations with OMB civil servants.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/op-eds/if-you-think-the-deficit-is-bad-now-it-will-soon-get-worse/\">If You Think the Deficit Is Bad Now, It Will Soon Get Worse</a> | <a href=\"https://www.aei.org/op-eds/reforming-supplemental-security-income-the-sensible-way/\">Reforming Supplemental Security Income the Sensible Way</a> | <a href=\"https://www.aei.org/op-eds/the-rich-are-using-long-term-care-funds-meant-for-the-poor/\">The Rich Are Using Long-Term Care Funds Meant for the Poor</a> | <a href=\"https://www.aei.org/op-eds/the-social-security-fairness-act-is-unfair/\">The “Social Security Fairness Act” Is Unfair</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/health-care/many-more-student-loan-borrowers-to-get-discharges-through-a-determination-of-disability/\">Many More Student Loan Borrowers to Get Discharges Through a Determination of Disability</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}