{
  "title": "A Better Alternative to Resolutions and Goals",
  "link": "https://www.madfientist.com/mastery-over-goals/",
  "comments": "https://www.madfientist.com/mastery-over-goals/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Tue, 12 Jan 2021 11:50:00 +0000",
  "category": "FIRE (Financial Independence / Retire Early)",
  "guid": "http://www.madfientist.com/?p=6931",
  "description": "<p class=\"lead\">There's a better alternative to resolutions and goals...especially if you're pursuing financial independence and early retirement.</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/mastery-over-goals/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/mastery-over-goals/\">A Better Alternative to Resolutions and Goals</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>There are probably a lot of reasons your New Year&#8217;s resolutions aren&#8217;t going to plan this year.</p>\n\n\n\n<p>But do they ever?</p>\n\n\n\n<p>It&#8217;s funny how we make them even though they rarely stick.</p>\n\n\n\n<p>Setting normal &#8220;goals&#8221; throughout the year isn&#8217;t much more effective&#8230;</p>\n\n\n\n<h2>Problems with Goals</h2>\n\n\n\n<p>Previous podcast guest, <a href=\"https://www.madfientist.com/james-clear-interview/\" target=\"_blank\" rel=\"noopener\">James Clear</a>, wrote a great post highlighting the <a href=\"https://jamesclear.com/goals-systems\" target=\"_blank\" rel=\"noopener\">problems with goals</a> but here are a few that I&#8217;ve experienced myself:</p>\n\n\n\n<h3>Reduce Current Happiness</h3>\n\n\n\n<p>&#8220;Oh, I&#8217;ll be happy when I hit FI!  I&#8217;ll do all the things I&#8217;ve been planning to do after I reach FI!&#8221;</p>\n\n\n\n<p>As <a href=\"https://www.madfientist.com/best-and-worst-about-fi/\" target=\"_blank\" rel=\"noopener\">I found out</a>, happiness doesn&#8217;t just appear when you cross some arbitrary number on a screen.</p>\n\n\n\n<p>When you reach the finish line but don&#8217;t experience the happiness you were expecting, you tend to just move the goalposts or create a new goal, thus further delaying your happiness even more.</p>\n\n\n\n<h3>Reduce Motivation</h3>\n\n\n\n<p>When you only focus on the big, intimidating finish line, it can be hard to stay motivated to get there.</p>\n\n\n\n<p>&#8220;How am I going to run 26.2 miles when I can&#8217;t even run one mile without feeling awful?! Might as well quit now, I guess.&#8221;</p>\n\n\n\n<h3>Bad for Long-Term Progress</h3>\n\n\n\n<p>What happens after you acheive your goal?</p>\n\n\n\n<p>Here&#8217;s my friend throwing away her running shoes in NYC after completing the New York City marathon:</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.madfientist.com/wp-content/uploads/2021/01/no-more-running.jpg\"><img src=\"https://www.madfientist.com/wp-content/uploads/2021/01/no-more-running.jpg\" alt=\"\" class=\"wp-image-6932\" width=\"600\" srcset=\"//www.madfientist.com/wp-content/uploads/2021/01/no-more-running.jpg 800w, //www.madfientist.com/wp-content/uploads/2021/01/no-more-running-300x246.jpg 300w, //www.madfientist.com/wp-content/uploads/2021/01/no-more-running-768x631.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a></figure></div>\n\t\t\n\n\n<p>Meeting the big goal of running a marathon felt like the miserable end of a long journey and she said she was never running again (I&#8217;m not sure she has).</p>\n\n\n\n<h2>A Personal Tale of Two Approaches</h2>\n\n\n\n<p>Back in 2017, I wanted to make progress on two different things…songwriting and fitness.</p>\n\n\n\n<p>I approached each of those things differently though.</p>\n\n\n\n<p>For songwriting, I declared at the 2017 Chautauqua that I was going to finish a song by March 31, 2017.</p>\n\n\n\n<p>For fitness, I decided I just wanted to go to the gym 2-4 days a week for the rest of my life. I didn&#8217;t really care about benching a certain weight or putting on a certain amount of muscle mass…I just wanted to get healthy and stay healthy.</p>\n\n\n\n<p>So here&#8217;s what happened with those two things…</p>\n\n\n\n<h3>Songwriting</h3>\n\n\n\n<p>I suffered through a few months of trying to write a song.  I eventually wrote something that could be considered a song and then I finished that sort-of-song on March 31st, 2017…meeting my target and achieving my goal.</p>\n\n\n\n<p>Immediately after though, I stopped writing music. I lost all motivation, since I no longer had the goal driving me, and I wasn&#8217;t enthusiastic about doing it again because the song I wrote wasn&#8217;t any good.</p>\n\n\n\n<p>Since I was so focused on the finished product, I didn&#8217;t develop any good habits in the process so I had nothing to fall back on when the goal was finished.</p>\n\n\n\n<p>It wasn&#8217;t until late 2019 that I&#8217;d start <a href=\"https://www.madfientist.com/ultralearning-experiment/\" target=\"_blank\" rel=\"noopener\">trying to write music again</a> (with <a href=\"https://www.madfientist.com/ultralearning-experiment-results/\" target=\"_blank\" rel=\"noopener\">much more success this time</a>, thankfully).</p>\n\n\n\n<h3>Fitness</h3>\n\n\n\n<p>Contrast that with my fitness journey and it&#8217;s the complete opposite.</p>\n\n\n\n<p>I continued going to the gym through 2017, 2018, 2019, and 2020 (until COVID shut them down) and I likely exceeded any goals or weight targets I would have set at the beginning, thanks to my consistency.</p>\n\n\n\n<h2>So What to Focus on Instead?</h2>\n\n\n\n<p>The best way I&#8217;ve found to make progress on the things that are important to me is to focus on mastery instead.</p>\n\n\n\n<p>Mastery is simply making sure you can answer yes to the question, “Are you better today than you were yesterday?”</p>\n\n\n\n<p>You&#8217;re not concerned with outcomes…you only care about putting the time in and making sure that time is spent effectively.</p>\n\n\n\n<p>That&#8217;s why the <a href=\"https://www.madfientist.com/ultralearning-experiment-results/\" target=\"_blank\" rel=\"noopener\">Ultralearning Experiment was so beneficial</a> &#8211; it made me determine the most important things to focus on and it forced me to spend time doing those things.</p>\n\n\n\n<h3>Doesn&#8217;t Delay Happiness</h3>\n\n\n\n<p>Unlike goals, mastery encourages you to enjoy the process.</p>\n\n\n\n<p>You&#8217;re not delaying happiness until you accomplish something. You&#8217;re not putting all your hopes on some unpredictable future.</p>\n\n\n\n<p>You&#8217;re just building a life around something important to you and you enjoy the benefits of making progress on that thing.</p>\n\n\n\n<h3>Especially Important for Early Retirees</h3>\n\n\n\n<p>Mastery is particularly important for people who achieve financial independence early in life.</p>\n\n\n\n<p>If you leave your job in your 30s or 40s, you potentially have 60+ years of freedom in front of you so it makes sense to do things that you enjoy for a long time, rather than constantly achieving and replacing short-term goals.</p>\n\n\n\n<h3>Can Replace the Best Aspects of Your Job</h3>\n\n\n\n<p>In Daniel Pink&#8217;s book, <a href=\"https://amzn.to/3niaaed\" target=\"_blank\" rel=\"nofollow noopener\">Drive</a>, he states that autonomy, mastery, and purpose are the three components of an enjoyable and fulfilling career/life.</p>\n\n\n\n<p>Although early retirees gain a huge amount of autonomy after leaving work, sometimes they find that mastery and purpose are lacking from their post-employment life.  And lacking in these two areas can often leads to unhappiness.</p>\n\n\n\n<p>Focusing on mastery after early retirement can help you find those missing components and allow you to enjoy your autonomy even more.</p>\n\n\n\n<p>As psychologist Mihaly Csikszentmihalyi states in his book, <a href=\"https://amzn.to/3n7A1VN\" target=\"_blank\" rel=\"nofollow noopener\">Flow</a>:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Contrary to what we usually believe…the best moments in our lives, are not the passive, receptive, relaxing times—although such experiences can also be enjoyable, if we have worked hard to attain them. The best moments usually occur when a person’s body or mind is stretched to its limits in a voluntary effort to accomplish something difficult and worthwhile.</p></blockquote>\n\n\n\n<p>And here he is describing why early retirees could find themselves less happy after leaving their job:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>On the job people feel skillful and challenged, and therefore feel more happy, strong, creative, and satisfied. In their free time people feel that there is generally not much to do and their skills are not being used, and therefore they tend to feel more sad, weak, dull, and dissatisfied.</p></blockquote>\n\n\n\n<p>So if you&#8217;re rushing to retire early because you think all your problems will be solved and happiness will instantly materialize, you may be disappointed.</p>\n\n\n\n<h3>Hugely Beneficial Shift in Mindset</h3>\n\n\n\n<p>I can attest to the positive impact the change of mindset from goals to mastery has had.</p>\n\n\n\n<p>As I was finishing <a href=\"https://www.madfientist.com/album\" target=\"_blank\" rel=\"noopener\">my album</a>, I decided I wanted to write one more song for the album.</p>\n\n\n\n<p>A goal like that would have crippled me in the past, especially considering I only had a month to get the song finished. But thanks to my experience over the previous months of just focusing on putting in the hours and letting the songs come as they may, I simply continued with my normal routine.</p>\n\n\n\n<p>I put in as many hours as I could during that month and thankfully, a new song did emerge (for those who <a href=\"https://www.madfientist.com/album\" target=\"_blank\" rel=\"noopener\">ordered the album</a>, the last song on the album is the one I wrote during that final month).</p>\n\n\n\n<p>I knew that the only thing I could control was the amount of time I worked and I also knew that a song would eventually come out of that work so I just trusted the process.</p>\n\n\n\n<p>Although the goal of finishing a song helped focus my effort, keeping my attention on the habits of mastery (and allowing the song to be a by-product of the process) was maybe the biggest mental breakthrough I had during the whole project.</p>\n\n\n\n<h2>Five-Year Blocks</h2>\n\n\n\n<p>A few years ago, I filled in a <a href=\"https://waitbutwhy.com/2014/05/life-weeks.html\" target=\"_blank\" rel=\"noopener\">Life Weeks</a> spreadsheet from Wait But Why.</p>\n\n\n\n<p>I found it again recently and I noticed something&#8230;</p>\n\n\n\n<p>It&#8217;s amazing what you can accomplish in 5 years with slow but persistent progress.</p>\n\n\n\n<p>Looking at my life, here&#8217;s what I focused on during those 5-year blocks and what I was able accomplish during that time&#8230;</p>\n\n\n\n<figure class=\"wp-block-table is-style-stripes\"><table><thead><tr><td>Age</td><td>Focus</td><td>Result</td></tr></thead><tbody><tr><td>15-20</td><td>Education (or more honestly, Beer/Girls)</td><td>Got into great school and got a degree in Computer Science</td></tr><tr><td>20-25</td><td>Career</td><td>Built a successful career in software that allowed me to eventually achieve FI</td></tr><tr><td>25-30</td><td>Grad School</td><td><a href=\"https://www.madfientist.com/free-ivy-league-degree\" target=\"_blank\" rel=\"noopener\">Free Ivy League Degree</a></td></tr><tr><td>30-35</td><td>Mad Fientist</td><td>Built a successful and profitable blog/podcast/business</td></tr><tr><td>35-40</td><td>Music</td><td>Wrote <a href=\"https://www.madfientist.com/album\" target=\"_blank\" rel=\"noopener\">an album</a>! And I still have a few years left so can&#8217;t wait to see what else happens :)</td></tr><tr><td></td><td></td><td></td></tr></tbody></table></figure>\n\n\n\n<h3>Playing Long Game Gives Better Chance of Success</h3>\n\n\n\n<p>Just like investing, it seems like you have a higher chance of success if you play the long game because you outlast the people looking for a quick win.</p>\n\n\n\n<p>Here is the income/traffic graph for the Mad Fientist over the years:</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.madfientist.com/wp-content/uploads/2021/01/mad-fientist-income-traffic.png\"><img src=\"https://www.madfientist.com/wp-content/uploads/2021/01/mad-fientist-income-traffic.png\" alt=\"\" class=\"wp-image-6942\" width=\"500\" srcset=\"//www.madfientist.com/wp-content/uploads/2021/01/mad-fientist-income-traffic.png 682w, //www.madfientist.com/wp-content/uploads/2021/01/mad-fientist-income-traffic-300x227.png 300w\" sizes=\"(max-width: 682px) 100vw, 682px\" /></a></figure></div>\n\t\t\n\n\n<p>People playing the short game would have quit in 2012, 2013, 2014, or 2015 and wouldn&#8217;t have been around to reap the benefits in years 2017-2019.</p>\n\n\n\n<p>You can see that my focus shifted in 2019 to my new 5-year topic to master (i.e. music) but&#8230;</p>\n\n\n\n<p></p>\n\n\n\n<h3>You Don&#8217;t Have to Stop After Five Years</h3>\n\n\n\n<p>That&#8217;s not to say you should stop and move on completely after five years.</p>\n\n\n\n<p>After doing something for that long, you&#8217;ve no doubt developed habits that will allow you to easily continue, even while you start something new and more difficult.</p>\n\n\n\n<p>The skills I picked up in college allowed me to continue learning throughout my life.  </p>\n\n\n\n<p>The computer-programming skills I learned during my career allowed me to build useful tools like the <a href=\"https://cards.madfientist.com/\" target=\"_blank\" rel=\"noopener\">Travel Card Tool</a> and the <a href=\"https://www.madfientist.com/fi-laboratory\" target=\"_blank\" rel=\"noopener\">FI Laboratory</a> for the Mad Fientist.  </p>\n\n\n\n<p>The writing skills I developed during grad school helped me present information more effectively here and elsewhere.  </p>\n\n\n\n<p>And everything I learned about online business/marketing with the Mad Fientist will now hopefully help me promote my new album more successfully.</p>\n\n\n\n<h2>Forget about FI</h2>\n\n\n\n<p>After saying that, what do I now think about the goal of FIRE?</p>\n\n\n\n<p>I say you forget about it completely.</p>\n\n\n\n<p>Instead, focus on mastering the relationship between Time, Money, and Happiness.</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large\"><a href=\"https://www.madfientist.com/wp-content/uploads/2021/01/money-time-happiness.png\"><img loading=\"lazy\" width=\"500\" height=\"500\" src=\"https://www.madfientist.com/wp-content/uploads/2021/01/money-time-happiness.png\" alt=\"\" class=\"wp-image-6949\" srcset=\"//www.madfientist.com/wp-content/uploads/2021/01/money-time-happiness.png 500w, //www.madfientist.com/wp-content/uploads/2021/01/money-time-happiness-300x300.png 300w, //www.madfientist.com/wp-content/uploads/2021/01/money-time-happiness-150x150.png 150w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></figure></div>\n\t\t\n\n\n<p>I put off my happiness until I hit FI and that was the wrong way to do it.  Here&#8217;s how I was skewed in those pre-FI years:</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large\"><a href=\"https://www.madfientist.com/wp-content/uploads/2021/01/skewed-fi-priorities.png\"><img loading=\"lazy\" width=\"500\" height=\"500\" src=\"https://www.madfientist.com/wp-content/uploads/2021/01/skewed-fi-priorities.png\" alt=\"\" class=\"wp-image-6950\" srcset=\"//www.madfientist.com/wp-content/uploads/2021/01/skewed-fi-priorities.png 500w, //www.madfientist.com/wp-content/uploads/2021/01/skewed-fi-priorities-300x300.png 300w, //www.madfientist.com/wp-content/uploads/2021/01/skewed-fi-priorities-150x150.png 150w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></a></figure></div>\n\t\t\n\n\n<p>I devoted most of my time to earning more money and I sacrificed my happiness so that I could save more money to hit FI quicker.</p>\n\n\n\n<p>As I chatted to <a href=\"https://www.madfientist.com/ramit-sethi-interview\" target=\"_blank\" rel=\"noopener\">Ramit Sethi</a> about recently, I think I&#8217;m still slightly skewed in the same way so I&#8217;m trying to find ways to use the money I accumulated to buy more time and increase our happiness.</p>\n\n\n\n<p>Just like mastering other things, I feel like mastering this equation is going to be a lifelong pursuit so I plan to continue experimenting/tweaking/assessing indefinitely.</p>\n\n\n\n<h2>Not Going to Be Easy</h2>\n\n\n\n<p>Although focusing on mastery will likely yield better longterm results than focusing on goals, that&#8217;s not to say it&#8217;s easy.</p>\n\n\n\n<h3>Self Doubt</h3>\n\n\n\n<p>You&#8217;ll still have to push through crippling self doubt, as I&#8217;ve experienced many times over the past year.  </p>\n\n\n\n<p>Here are ways I found to make that easier&#8230;</p>\n\n\n\n<h3>Find Your Most-Productive Time of Day</h3>\n\n\n\n<p>I&#8217;ve found that evenings are awful for me so I don&#8217;t try to do anything creative or difficult in the evenings.</p>\n\n\n\n<p>It seems like my confidence slowly drains away during the day so by the time the evening rolls around, I hate everything I produce.</p>\n\n\n\n<p>Rather than fight that, I make sure to do my creative stuff early in the day and then I just relax in the evenings (or do easier tasks that don&#8217;t take willpower/confidence).</p>\n\n\n\n<h3>Understand Your Biases</h3>\n\n\n\n<p>I realize that I&#8217;m too harsh on myself so I now try to assume everything I make is 25-50% better than I think it is.</p>\n\n\n\n<p>This became apparent when I heard one of my articles on the <a href=\"https://oldpodcast.com/optimal-finance-daily-podcast/\" target=\"_blank\" rel=\"noopener\">Optimal Finance Daily podcast</a>.</p>\n\n\n\n<p>The Optimal Finance Daily podcast takes popular blog posts and reads them out as a podcast episode.</p>\n\n\n\n<p>When I first heard one of my blog posts being read by someone else, I enjoyed that post so much more (since it wasn&#8217;t my internal voice reading it).</p>\n\n\n\n<p>It was a post I wasn&#8217;t that happy with when I posted it but when a guy with a British accent read it, I thought it was great!</p>\n\n\n\n<p>That showed me I&#8217;m overly critical of my internal voice (which I&#8217;m sure is true for 98% of the population).</p>\n\n\n\n<p>That realization now helps me publish things when I&#8217;m not feeling as confident.</p>\n\n\n\n<h3>Recognize Your Creative Cycle</h3>\n\n\n\n<p>I&#8217;ve realized that any time I create something, I go through the same cycle:</p>\n\n\n\n<ul><li>Initially really excited about an idea</li><li>Quickly become overwhelmed by what needs to be done to make the idea a reality</li><li>Make some progress and get really excited about idea again</li><li>Work feverishly&nbsp;and get close to being able to publish</li><li>Start obsessing about a million small details and eventually hate what I made (probably because I&#8217;m spending so much time obsessing about the minutia)</li><li>Get fed up and just publish it to be done with it</li><li>Feel initial relief at finally getting it out into the world</li><li>Get into a funk the next day, no matter what kind of feedback I receive (maybe because I&#8217;ve been working so hard and have been so focused, so the rubber band pings back in the opposite direction)</li><li>Weeks or months later, I look at what I produced and I&#8217;m surprised how good it is and how much I like it (despite hating it when I released it)</li></ul>\n\n\n\n<p>Knowing this about myself has made it a lot easier to publish things and it&#8217;s also made it easier getting through the post-publishing funk because I know it&#8217;ll pass and it&#8217;s just part of the process.</p>\n\n\n\n<h3>Realize You&#8217;ll Never Be Satified</h3>\n\n\n\n<p>Former US Secretary of Labor, Robert Reich, said this about mastery&#8230;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Figure out for yourself what you want to be really good at, know that you&#8217;ll never really satisfy yourself that you&#8217;ve made it, and accept that that&#8217;s okay</p></blockquote>\n\n\n\n<p>I&#8217;d take it a step further though&#8230; </p>\n\n\n\n<p>You shouldn&#8217;t just accept that it&#8217;s okay&#8230;you should be thankful it&#8217;s that way because that means it will provide you a lifetime of challenge and enjoyment!</p>\n\n\n\n<p>At first, I was overwhelmed by everything I had to learn to make the kind of music I wanted to make. </p>\n\n\n\n<p>After I starting looking at that as a blessing rather than an obstacle, I wasn&#8217;t as overwhelmed and intimidated and that allowed me to get to work and make progress.</p>\n\n\n\n<p>If you reach financial independence in your 30s or 40s, you have a lot of years to fill up so embrace the challenges and be thankful you have something interesting and challenging to keep you occupied for the rest of your life. </p>\n\n\n\n<h3>Only Your Emotions Stand In Your Way</h3>\n\n\n\n<p>In the book, <a href=\"https://amzn.to/38yMbmM\" target=\"_blank\" rel=\"nofollow noopener\">Mastery</a>, by Robert Greene, he states:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The only real impediment to this is yourself and your emotions &#8211; boredom, panic, frustration, insecurity.”</p></blockquote>\n\n\n\n<p>He continues&#8230;</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>You cannot suppress such emotions &#8211; they are normal to the process and are experienced by everyone, including Masters. What you can do is have faith in the process. The boredom will go away once you enter the cycle. The panic disappears after repeated exposure. The frustration is a sign of progress &#8211; a signal that your mind is processing complexity and requires more practice. The insecurities will transform into their opposites when you gain mastery. Trusting this will all happen, you will allow the natural learning process to move forward, and everything else will fall into place.</p></blockquote>\n\n\n\n<p>As I&#8217;ve experienced, you just have to get to work, try to work on the most-impactful thing you can, and do it for as long as you can.</p>\n\n\n\n<p>It really is effective.</p>\n\n\n\n<h2>The Alternative is Much Harder</h2>\n\n\n\n<p>And although pursuing mastery isn&#8217;t easy, the alternative is much more difficult.</p>\n\n\n\n<p>As <a href=\"https://www.madfientist.com/best-and-worst-about-fi/\" target=\"_blank\" rel=\"noopener\">I experienced</a>, not pursuing my music project during my career was the biggest source of my unhappiness during that time.</p>\n\n\n\n<p>In his book, <a href=\"https://amzn.to/3oB1X6g\" target=\"_blank\" rel=\"nofollow noopener\">Finish</a>, Jon Acuff says this about not pursuing the things that are important to you: </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Goals you refuse to chase don&#8217;t disappear, they become ghosts that haunt you. Do you know why strangers rage at each other online and are so quick to be angry and offended these days? Because their passion has no other outlet&#8230;Many a troll was born from the heartache of a goal he dared not finish. Maybe a troll is just someone who lost to perfectionism so many times he gave up on his own goals and decided to tear down someone else&#8217;s.</p></blockquote>\n\n\n\n<p>Don&#8217;t let that happen to you.</p>\n\n\n\n<p>As hard as it was writing my album last year, the year before <em>not writing</em> my album was much worse. </p>\n\n\n\n<h2>Two Worlds</h2>\n\n\n\n<p>Finally, I&#8217;ll leave you with the thing that&#8217;s been most helpful to me with pushing through these issues&#8230;</p>\n\n\n\n<p>I first said this to myself a few years ago but I&#8217;ve used it many more times since then.  </p>\n\n\n\n<p>The first time was when my brother was staying with us in Edinburgh and I thought to myself, what&#8217;s the point of this music project?</p>\n\n\n\n<p>I realized the reason I wanted to make music was so that I could have fun playing live music (preferably with my little brother).</p>\n\n\n\n<p>Since he was staying with us, I figured there was no reason to wait!</p>\n\n\n\n<p>So I programmed a music set into Ableton (complete with backing instruments, real-time vocal effects/manipulations, etc.) and we decided to head out to the park and become the first synth-pop buskers ever.</p>\n\n\n\n<p>We painted our faces with black-light paint, loaded up a battery-powered synthesizer, midi controller, microphone, boombox, and a bookshelf to put it all on and we went out into the park on a Monday evening and played weird synth-pop songs to people walking home from work.</p>\n\n\n\n\t\t\t<div class=\"wp-block-image\">\n\t\t\t<figure class=\"aligncenter size-large\"><a href=\"https://www.madfientist.com/wp-content/uploads/2021/01/park-show.jpg\"><img loading=\"lazy\" width=\"700\" height=\"567\" src=\"https://www.madfientist.com/wp-content/uploads/2021/01/park-show.jpg\" alt=\"\" class=\"wp-image-6955\" srcset=\"//www.madfientist.com/wp-content/uploads/2021/01/park-show.jpg 700w, //www.madfientist.com/wp-content/uploads/2021/01/park-show-300x243.jpg 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></a></figure></div>\n\t\t\n\n\n<p>It was ridiculous and as we were getting ready to do it, I thought to myself, &#8220;What the hell are we doing?  This is crazy.  We can&#8217;t do this.&#8221;</p>\n\n\n\n<p>But then I thought, <em>there are two possible worlds&#8230;one where we do this and one where we don&#8217;t.  Which world would I rather live in?</em></p>\n\n\n\n<p>Well, I knew what the world was like where we didn&#8217;t do it because that was the world I&#8217;ve always lived in.</p>\n\n\n\n<p>I didn&#8217;t know what the world is like where we did it but I really want to find out.</p>\n\n\n\n<p>So we did it, it was a lot of fun, and we actually got an offer to play a Scottish music festival because of it!</p>\n\n\n\n<p>During the show, someone slipped me a piece of paper with his email address on it and when I emailed him, he asked if we wanted to play the 2018 <a href=\"https://www.kelburngardenparty.com\" target=\"_blank\" rel=\"nofollow noopener\">Kelburn Garden Party</a>.</p>\n\n\n\n<p>Sadly my brother had to go back to the States before the festival, so we couldn&#8217;t do it, but hopefully we&#8217;ll be able to once COVID gets taken care of.</p>\n\n\n\n<p>Just shows what can happen when you put yourself out there!</p>\n\n\n\n<p>So now, whenever I&#8217;m apprehensive about publishing or doing something new, I always think about those two worlds and I always choose the world where I do it.  And so far, I&#8217;ve never regretted it.</p>\n\n\n\n<h2>How About You?</h2>\n\n\n\n<p>Theodore Roosevelt once said, &#8220;Far and away the best prize that life has to offer is the chance to work hard at work worth doing.&#8221;</p>\n\n\n\n<p>I agree.</p>\n\n\n\n<p>So what are you going to work on? What are you going to try to master?  What do you plan to focus on over the next 5+ years?</p>\n\n\n\n<p>Let me know in the comments below!</p>\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/ultralearning-experiment-results/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>8 Key Lessons from the Ultralearning Experiment (and a Huge Announcement)</h3><p class='post_card_excerpt'>The Ultralearning Experiment was a bigger success than I'd even hoped and here's what I learned from it (plus a massive announcement)!</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2020/10/ultralearning-experiment-results.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/mastery-over-goals/\">A Better Alternative to Resolutions and Goals</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/mastery-over-goals/feed/",
  "slash:comments": 77
}