{
  "title": "How to Create Parameters in Tableau (A Simple Guide)",
  "link": "https://www.dataquest.io/blog/creating-parameters-in-tableau/",
  "comments": "https://www.dataquest.io/blog/creating-parameters-in-tableau/#respond",
  "dc:creator": "Ray Harris",
  "pubDate": "Mon, 10 Oct 2022 08:00:00 +0000",
  "category": [
    "Data Science Tutorials",
    "tableau"
  ],
  "guid": "https://www.dataquest.io/?p=41281",
  "description": "What Is a Parameter in Tableau? Parameters are among the most versatile and useful features in Tableau — especially following the 2020 addition of parameter dashboard actions. As with just about anything in Tableau, we can start small and work our way to greater complexity — Tableau parameters are no different. Why Use Parameters in Tableau? [&#8230;]",
  "content:encoded": "<h2 id=\"h-what-is-a-parameter-in-tableau\"><strong>What Is a Parameter in Tableau?</strong></h2>\n<p>Parameters are among the most versatile and useful features in Tableau — especially following the 2020 addition of parameter dashboard actions. As with just about anything in Tableau, we can start small and work our way to greater complexity — Tableau parameters are no different.</p>\n<h2><strong>Why Use Parameters in Tableau?</strong></h2>\n<p>But before we start, you may be wondering <em>What is a parameter in tableau, and why would we use one?</em> Fantastic questions. A tableau parameter is similar to a calculated field in that it&#8217;s not a part of the dataset — instead, the tableau developer creates it. It&#8217;s also similar to a filter, in that an analytics consumer will usually see a Tableau parameter on a dashboard they can click to customize the view. It differs from a calculated field and a filter in that it gives us far more flexibility in its creation and its behavior once we deploy it. </p>\n<p>Before we begin creating a parameter in Tableau, here are some of the most common uses of Tableau parameters: </p>\n<ol>\n<li>Creating a top x filter</li>\n<li>Changing the dimension or measure displayed in a chart</li>\n<li>Selecting a single value to highlight </li>\n</ol>\n<h2><strong>How to Create a Parameter in Tableau</strong></h2>\n<p>Creating parameters in Tableau begins the same way as creating a calculated field. Click on the drop-down arrow to the right of the search bar. Select <strong>Create Parameter</strong>. We’ll then presented see this widget. Let’s go through it. </p>\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/JLOmdNAUvXRrazZqHNlNm9Af5TuryXS2NQWzlHeTJWEoFH3EtF6PpqmeJZOoc2aNmyWnaRZ9BPSZg0yw9R_DngZsdaW4O_hODPcEYsCfB_hOYbqlezmHqN5o1IB8JU2bTnJIItqa62_XNv0LmME-c6Q9EXxgetmewGZo_ABUvXcce3jq1Dnqxkld5zqxP-1Ttf11Bg\" alt=\"Create parameter\" /></figure>\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/s3MACSGuR6z3hQ3nay1tcoZRrOBr_BjQ0CU7F2NwrVNjeWK_DVdT2v9if0T1R59AO3wlRZ11a1Z2moKp3aoQdYqjgGviMSawsqn0sKY8PtU_coD32ovJzOXRG_F3fQW96Wyy18t02v63eIY-aryB5_BYOqrjl_VzbuaD3yMUs9Fi8P1nV4D8stPv2_1gCcCis-PkDw\" alt=\"Parameter 1\" /></figure>\n<p><strong>Name:</strong> This will be the name of the parameter. </p>\n<p><em>(Pro-tip — I like to start all my parameters with a prefix like “Para” or “@” so they are easier to identify.)</em></p>\n<p><strong>Data type:</strong> Where we select if this will be a float, integer, string (text) or date type. </p>\n<p><strong>Display format:</strong> Allows us to format the value (e.g., change it to a currency). </p>\n<p><strong>Current value:</strong> This is the default starting value.</p>\n<p><strong>Value when workbook opens:</strong> Here, the default is current value, and we won&#8217;t interact with this in the beginner tutorial, but as we gain more experience with parameters, there are some useful features in here. </p>\n<p><strong>Allowable values: </strong>The default is all, which means any value that is a float (so all decimal numbers) are valid input. A <em>List</em> means that we, as the developer, give the user a predefined list of allowable values to pick from. <em>Range </em>(not available for text parameters) allows us to set a start and end point, and all values between the start and end points will be valid. </p>\n<h2><strong>Creating a Parameter in Tableau</strong></h2>\n<p>Let’s look at two examples of when and how to create a parameter in Tableau. I’ll be using superstore sales dataset, which is built into Tableau. The first example is to make a dynamic target that a user can control to quickly see which dimensions fall above or below the target. </p>\n<p>Before creating the parameter, let’s build a quick chart by adding <strong>Subcategory</strong> onto <strong>Columns and Sales </strong>onto <strong>Rows</strong>. Now for the parameter, let&#8217;s follow these steps.</p>\n<ol>\n<li>Click the arrow next to the field search bar, and select <strong>Create Parameter</strong>.</li>\n<li>Name the parameter “Para Subcategory Target.”</li>\n<li>Change the data type to <strong>Integer</strong>.</li>\n<li>Change the current value to 5,000.</li>\n<li>Click <strong>OK</strong>.</li>\n</ol>\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/T1EKcWpOorVb9ztAOdNvaacEZXCO5QiM0ml2NCOY3KeuLciGJE3mhD11W0zalkL3EhQXkJMwxPggpXdMZL5_AQ-0GUDX1BDZ56WA4D5LVYnbXsX9XBGy87BE77scr_zs4iS6DDfGImlTUYpV7O-8SboWcD37KJP7ae_WBguUUdwV2o3aG3l6rsULkbYx02MJJ71rdg\" alt=\"Create parameter\" /></figure>\n<p>When we click <strong>OK</strong>, a new section in the calculated field pane appears, named “Parameters.” In that list, we should see the <em>Para Subcategory Target</em>. </p>\n<p>If we right-click on the parameter and select <strong>Show Parameter</strong>, the parameter control section appears on the left. It will produce a box that looks similar to the filter, with the title “Para Subcategory Target” and the value 5000. </p>\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/RR3mnxDJwRSgbgqu_nxYGjgIO6I73xyUMRL_O2u9f_T6uEt87Z08_uEdthpXSqDFrs02f923FBLyu2bDoOMuOHqG8wNcIK2-m7m7flqjTf68mUqMiYvngichbpvNWg75vT6gMTqu8px5nLjLfue5BIwFxOn4DtwMlNw4IFqdL-1EGSBIIWUX_IJ2U_E2ljxPnkFUBQ\" alt=\"Show parameter\" /></figure>\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/ZMS3196-CSac_s2ConXF06awZOW6Q76XlOKJ2dVU_2RRJv-38d7Gp0kn9fzbqKkI9J30gg-Fv1KfJI1aztLm5E1DuDwGghATtdEvPtmJ0Sl7F9ab5SBiU3hpsoEvEpHiR3xn1ZvugoM9-ruDbap1KZRrxI3_sB9ogxEki9RnCHGavFDwZ70o9UVp5Akdt3GIWgLtmQ\" alt=\"Sub-category\" /></figure>\n<p>Parameters on their own aren&#8217;t helpful, so we must always take the second step of adding them either to our visualization or to a calculated field. For example, if you type 6000 into the parameter control, nothing will change in our bar chart. Let’s add this parameter to the chart. </p>\n<ol>\n<li>At the top of the field list there’s an option to change the pane to “Analytics.”</li>\n<li>In the Analytics pane, drag a reference line onto the chart.</li>\n<li>For Value select <strong>from parameter</strong> and pick the <strong>Para Subcategory Target</strong>.</li>\n<li>Click <strong>fill below</strong>, and select <strong>red</strong>.</li>\n</ol>\n<p>With this, we have a dynamic target, and we can easily see which subcategories are underperforming. </p>\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/B1JoNIR8QTsWcw_d9TClGRAVuDzdCSFBCc6x3HLADF9GN7NEjYpIcvBtNw-7mMvMb9rTQZ4KHnbbEn8YAb3Ef9JOhlGf_zwd_hn3Z_hkCKXb5MH5-7qzWRLu_uYHesC3kwG3s_R1PXKY3XmX1EVPdOFhJkeQ_bYzBi6Q2_szQqrIf4FPI5P72CgHc2n9AIgkAzdq7g\" alt=\"Reference line\" /></figure>\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/bU5pe_m_ZzVDCSvuaYTMp0eWfvVz6tiioW6knztU84zT1MqCpu7FZZ1GhCuoAMJssf4pW__JlNmzKqUpbTapehU2qVlhBRmDNisKbU_Tbdm7MyL6RAyD8dhNOC2_b-XmEmpVqdHi9E-fxAtJl1Sej_Kl1pj8zvjaPZ46Vcwnh3FMyVI9XZNmXlvHZ8rwlxIPA1lBOg\" alt=\"Para Subcategory Target\" /></figure>\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/QKvdsHEp92NTbFicjrFuuonB5zOVsS7grEeac2MKKDH19Vn67yivssOmu8HCO6hzttWRZxHUQFPpgGjGMeKN1bwNRwqhBJ9Jw2ceZ9XppLFYHGkvFkGsGfx2wh3N6DOMFGDyQriGbjBr5ykazhK7XMeACX13Nrkbhbcu-J81qgm0buszIUuIPNA6MxPFZcplbmV-IA\" alt=\"Para Subcategory Target\" /></figure>\n<p>Another common use case for a parameter is as a dynamic dimension swapper — a parameter that will change the dimension in the chart based on the user input. Let’s create a second parameter. This one will be called “Para Dimension Swap.”</p>\n<ol>\n<li>For this second parameter, set the type to <strong>String</strong>.</li>\n<li>Make it a <strong>List</strong>.</li>\n<li>In the list, enter the following, each on its own line: <strong>Subcategory, Region, State</strong>.</li>\n<li>Click <strong>OK</strong>.</li>\n<li>Create a Calculated Field like the following:</li>\n</ol>\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/WGMXeN10ainmfaKybTsAjtzLfAHnHQCWPoxgZxwCtFY1leKynGWLluU6afe7iKCrYu8PO0rGQzd03OynIHEHD_xnYsux9K8kCuYMBuKkX5IpsPFrozYm6coBPfSdTMWm3IjtWDoVGKgriBQfXfid3AQ2Yemy4pNZyg90PBoX42k_PflkMGnXFgm1Znyp\" alt=\"Calculated field\" /></figure>\n<p>We can now take our new calculated field and drag it on top of the <strong>Subcatergory</strong> dimension in our chart. If we right-click our <strong>Para Dimension Swap</strong> parameter and click <strong>Show Parameter</strong>, we can let the data consumer choose how they view this chart. And, of course, with the original parameter still there, we can also adjust the target reference line as we conduct our analysis. </p>\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/SQjSiuhwCgDvX_oNmZqW1XC-8W3eUaWc9s-EheBQMyisqtAiw_Dvz7xWRrsGrhye2kcpspsf-kSXqqEjZGtAC85Gj_m_VXid-7tmrVVXU91WOQWQwT7ZCK-fqqsyj_RvHzOpWJa_NI2m41J38fsbNP2tS9WzLGZaW-6fhpD1NKMC6scFtXtXtsUi5yMR\" alt=\"Calculated field\" /></figure>\n<h2><strong>Using Tableau Parameters</strong></h2>\n<p>We&#8217;ve just explored two introductory examples for implementing Tableau parameters, but the use cases are endless. Mastering Tableau parameters can revolutionize the Tableau development experience and open up a world of possibilities as we create a tailored data consumption experience for our user.</p>\n<p>As we gain experience with parameters, we can try concepts such as measure swapping, dimension highlighting, and sheet swapping. And once we’re feeling very confident, we can include parameter actions on a dashboard, which are incredibly powerful in their own regard. </p>\n<p>Now, pull up your favorite workbook, and try out some parameters of your own! </p>\n<p>If you’d like to learn more about this topic, check out Dataquest&#8217;s interactive <a href=\"https://www.dataquest.io/path/data-visualization-in-tableau/\">Data Visualization in Tableau</a> Path that will help you master these skills in around 2 months.</p>\n",
  "wfw:commentRss": "https://www.dataquest.io/blog/creating-parameters-in-tableau/feed/",
  "slash:comments": 0
}