{
  "id": "https://bibleinoneyear.org/en/youth/349",
  "title": "Day 349: What is Going on Behind the Scenes of History?",
  "description": "Psalm 143:5–8, Malachi 1:2, 2:15a,16b, Revelation 6:1a,2–3a,4–5,7a,8–13a,15,16b–17.  God involves you in his plans  God works out his purposes in co-operation with his people",
  "pubDate": "Wed, 15 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/349/?ignore",
  "itunes:duration": "14:12",
  "guid": "enyouth15122021-349",
  "length": 852.27,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 349: What is Going on Behind the Scenes of History?",
  "itunes:subtitle": "Psalm 143:5–8, Malachi 1:2, 2:15a,16b, Revelation 6:1a,2–3a,4–5,7a,8–13a,15,16b–17.  God involves you in his plans  God works out his purposes in co-operation with his people",
  "itunes:summary": "In the West, many people assume history is aimless: ‘Full of sound and fury, signifying nothing’ (as Shakespeare put it in Macbeth). Many Eastern religions tend to regard history as either circular or illusory, while Marxists understand history in terms of class struggle.\nIn contrast to all these views, the New Testament sees history as moving towards a climax. The ultimate struggle is between good and evil – ending with the triumph of good and God.\nThe kingdom of God will not fail. God is working his purposes out in history. Jesus is the centrepiece. All lines in history converge on him. As someone has said: ‘The hinge of history is on the door of a Bethlehem stable.’\nHistory is ‘His story’. As you hear the news and read history books you get some of the details. As you read the Bible you get the big picture. In particular, the book of Revelation unveils what is going on behind the scenes of history.\nGod is the Sovereign Lord of history. But we are not mere robots. You are not being moved around like a piece on a chessboard. Rather, you have a part to play. God involves you in his plans. God works out his purposes in co-operation with his people.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 349
}