{
  "id": "https://bibleinoneyear.org/en/youth/151",
  "title": "Day 151: You Have the Energy of God",
  "description": "Psalm 68:35, 1 Samuel 30:6, John 19:30–37,20:1–10.  You stand before a choice: do you look for the energy you need in yourself and the resources of your intelligence and your entrepreneurial spirit, or do you look for it ‘*from above’*, from the risen Christ, the Sun of Righteousness?In the passages for today we see something about the extent of God’s energy, power and strength  Whereas on a physical level we struggle to harness even a fraction of the power of the sun, God has given you full access to his *endless* *energy* through Jesus’ resurrection and the gift of the Holy Spirit",
  "pubDate": "Mon, 31 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/151/?ignore",
  "itunes:duration": "14:07",
  "guid": "enyouth31052021-151",
  "length": 847.65,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 151: You Have the Energy of God",
  "itunes:subtitle": "Psalm 68:35, 1 Samuel 30:6, John 19:30–37,20:1–10.  You stand before a choice: do you look for the energy you need in yourself and the resources of your intelligence and your entrepreneurial spirit, or do you look for it ‘*from above’*, from the risen Christ, the Sun of Righteousness?In the passages for today we see something about the extent of God’s energy, power and strength  Whereas on a physical level we struggle to harness even a fraction of the power of the sun, God has given you full access to his *endless* *energy* through Jesus’ resurrection and the gift of the Holy Spirit",
  "itunes:summary": "The world is running out of energy – oil, coal, gas and so on. How do we ensure sufficient energy supplies to sustain life? Where will we find this energy? Now, we are searching anxiously for power ‘from above’ – trying to harness the almost limitless power of the sun.\nAll of us face the same problem as the physical environment, but on a spiritual level. You stand before a choice: do you look for the energy you need in yourself and the resources of your intelligence and your entrepreneurial spirit, or do you look for it ‘from above’, from the risen Christ, the Sun of Righteousness?\nIn the passages for today we see something about the extent of God’s energy, power and strength. Whereas on a physical level we struggle to harness even a fraction of the power of the sun, God has given you full access to his endless energy through Jesus’ resurrection and the gift of the Holy Spirit.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 151
}