{
  "title": "570: 'Deathly Hallows' Turns 15! Revisiting Our Dramatic First Impressions",
  "link": "https://audioboom.com/posts/8122816",
  "itunes:episode": 570,
  "itunes:title": "'Deathly Hallows' Turns 15! Revisiting Our Dramatic First Impressions",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4393,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week, the hosts grab their Time Turners and summon all the nostalgia that will fit in their beaded bag as they revisit the day after receiving <em>Harry Potter and the Deathly Hallows</em>. Andrew, Eric and Laura were in London for a live podcasting event at Waterstones, and Micah was stateside. We reflect on our initial impression of the book, what things we feel differently about 15 years later, and how magical it felt to witness the \"end\" of an era together. Also on this episode: dramatic line readings of some Book 7 reactions and e-mails from the day after that we finally respond to!<br>\n<br>\n\n</div>\n<ul>\n<li>\n<a href=\"https://www.patreon.com/posts/introducing-2022-68800529\"><span>We've just announced our 2022 Patreon Gifts</span></a> - The MuggleCast Collectors Club and the MuggleCast Wand! Pledge to our Patreon by August 7, 2022 and fill out the form(s) to receive your gifts! We are so proud of this year's items and hope you check them out!</li>\n<li>Main Discussion: Revisiting <a href=\"https://mugglecast.com/episode-101/\">MuggleCast #101</a>, our first <em>Deathly Hallows</em> reactions episode</li>\n<li>Why did we start off Episode 101 talking about <em>Lord of the Rings</em>? Eric reminds us of how things have changed since 2007.</li>\n<li>Laura and the hosts lament the lack of return to the Department of Mysteries, across two time periods!</li>\n<li>Podcasting had made all the hosts cold, hard people. Did the deaths in Book 7 really even affect them?</li>\n<li>Did any of the deaths feel 'unnecessary' to us then, and do they now?</li>\n<li>15 years later... does the epilogue feel satisfying? And what about those names for the kids?</li>\n<li>The hosts listen to themselves predicting what the <em>Deathly Hallows</em> movie will entail.</li>\n<li>We read some of the most dramatic reactions to the book, found in the MuggleNet Comments Section on July 21, 2007.</li>\n<li>Listener e-mails include: Who was the late-blooming Hogwarts student? What was it about Lily's eyes? And, what happened to Kreacher?</li>\n<li>Quizzitch: Who witnessed Dumbledore using the Sword of Gryffindor to destroy the Gaunt Ring?</li>\n<li>This week's episode is brought to you by BetterHelp (Get 10% off your first month of therapy at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and HelloFresh (Get up to 16 free meals and three free gifts by going to <a href=\"https://www.hellofresh.com/muggle16\">HelloFresh.com/muggle16</a> and using code muggle16 at checkout!)</li>\n</ul>\n",
  "pubDate": "Tue, 19 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-18:/posts/8122816",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}