{
  "id": "yt:video:pM6lK4OQ4pM",
  "yt:videoId": "pM6lK4OQ4pM",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "“ONE WAY TICKET TO HELL” 1955 DRUG ADDICTION SCARE FILM   PART TWO   XD49864",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-10-31T19:30:03+00:00",
  "updated": "2022-10-31T19:30:03+00:00",
  "media:group": {
    "media:title": "“ONE WAY TICKET TO HELL” 1955 DRUG ADDICTION SCARE FILM   PART TWO   XD49864",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Want to support this channel and help us preserve old films? Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nPart One: https://youtu.be/Sx9YhjiXdQg\n\nThis black and white, mono-sound fictional film is the second half of “One Way Ticket to Hell”, a drug addiction scare film that was apparently first released in late 1955 under the title \"Teenage Devil Dolls\".  It was made on a shoestring budget of $4000. The storyline spans from 1949-1952 and portrays a young girl named Cassandra Lee, who makes friends with the wrong crowd and becomes addicted to drugs. And as the story proceeds, she is caught in a downward spiral of addiction and crime. The film is directed, written, edited, and presented by B. Lawrence Price, Jr. (aka Bamlet Lawrence Price Jr. ) with photography by William R. Lieb and S. David Saxon, and is narrated by Kurt Martell. One critic described the film as \"an obscure, anti-drug, anti-juvenile delinquent anti-rebellion morality story, all told in not-so-glorious Dragnet style narration\".\n\nPart two begins with Cassandra walking through town during her probation period (00:08). She notices a woman, named Margo Rossi, in an alley suffering from narcotic withdrawal, and she tends to her (00:53). Margo and Cassandra are selling marijuana to a man on a street corner (02:02). Cassandra sells marijuana to another man (02:46) Drug dealer, Sven Bergman arrives in a car, and he attacks Cassandra (03:07). Margo rushes to help Cassandra, and they are both forced into Sven’s car (03:33). Now inside a bedroom, Sven is injecting Margo and Cassandra with heroin to make them his subjects (03:43). Cassandra gets escorted by a nurse and a police officer into a hospital ward for mental illness (06:15). She cries out in pain laying in her hospital bed (06:46). Policemen are chasing and arresting multiple drug dealers in town (07:29), resulting in numerous addicts suffering from withdrawal around the town (09:14). The police discover the dead body of an addict (09:45). Sven Bergman is chased by the police but manages to escape through a storm-drain tunnel (09:52). Cassandra sneaks past a nurse and meets with Margo Rossi by the fence of the hospital, where Margo bring her heroin (10:15). Margo is caught by Sven, and she is pushed out of a moving car into a ditch, where she dies (11:37). Footage of the city buildings (11:52). Officer Jason and other narcotic policemen are surveilling a parking lot (12:15). Cassandra enters the parking lot with her accomplice Martinez and another young man (12:49). Martinez and the young man steal a car from the parking lot, while Cassandra distracts the parking lot attendee by asking for directions (13:52). They drive on a highway through the desert toward Mexico (14:36). Patrol officers guarding checkpoints along the highway (15:16). Martinez makes a stop at a gas station to refuel the stolen car (15:56). The police arrives and Cassandra and Martinez escape in the car, leaving the other young man to be arrested (16:12). Martinez drives the car off-road, to avoid the checkpoints along the highway (17:36). All patrol officers enter their cars to search for Martinez and Cassandra (18:05). They stop the cars to continue their search on foot (19:02). They locate the stolen car abandoned by a cliff (20:50). Cassandra and Martinez are running through the desert (21:15). They enter a cave in search of shade and rest, both crying from withdrawal sickness (22:25). Police and patrol officers continue their search (22:36), and they discover Cassandra nearly dead on the ground (27:10). Cassandra is walking with officer Jason, her mother, and her father at the Southern Pacific train station, where Martinez is hiding (27:44). Police officers arrive and arrest Martinez (28:12). Cassandra and her mother aboard the train (28:44). Informational text on screen concerning the extent of the addiction problem today (29:59). “The End” on screen (30:53). \n\nThe film footage is shot in California. The music is composed and conducted by Robert Jackson Drasnin. Edith Gross is the script and screenplay supervisor, and Anthony Gorsline, Raymond Pearson, and Perry Grey were production assistants. \nThe cast consists of Barbara Marks as Cassandra Lee, Robert A. Sherry as Officer Jason, Elaine Lindenbaum as Margo Rossi, B. Lawrence Price, Jr. as “Cholo” Martinez further including Robert Norman, William Kendell, Joel Climenhaga, Lucille Price, B. L. Price, Sr., Victor Schwartz, Anthony Gorsline, and Joe Popavich. \n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}