{
  "title": "Special Episode: The Next Phase of ESG",
  "description": "<p>Interest in ESG investing has risen exponentially in recent years, leading to increased scrutiny around, and appreciation for, the hard data. Head of U.S. Public Policy Research and Municipal Strategy Michael Zezas and Head of the ESG Fixed Income Research Team Carolyn Campbell discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Michael Zezas:</strong> Welcome to Thoughts on the Market. I'm Michael Zezas, head of U.S. Public Policy Research and Municipal Strategy.&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> And I'm Carolyn Campbell, head of the ESG fixed income research team at Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And on this special edition of the podcast, we'll be assessing the next phase of the environmental, social, governance, ESG, market. It's Wednesday, July 20th, at 10 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> As some listeners may have read, in late May of this year, the Securities and Exchange Commission proposed new rules that would require ESG funds to disclose their goals, criteria and strategies, along with data measuring ESG progress. And this tells us that although the market for ESG investing has grown, so has investor desire to see real data and empirical analysis on impact. And this could be seen as really the next phase of the ESG market, that companies and funds won't just claim to be focused on ESG but will provide real proof. So, Carolyn, just to set the stage, I notice that people sometimes use the term sustainable investing and ESG interchangeably. So, I think it might be good to start with what exactly ESG is.&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> At its core ESG is about adding a new lens to risk management in our investment practices by looking at environmental, social and governance factors in addition to our traditional financial metrics and whatnot. ESG has been around in some way, shape or form for decades, beginning with what we call negative exclusions. Initially, that looked like excluding companies that conflicted with religious views such as gambling, alcohol or pornography. But it's probably best known more recently for what we would think of as the fossil fuel divestment movement; selling out of coal and oil and gas companies, for example. On the other end of the spectrum, we've got impact investing where money is put towards projects that are both worthy financial investments but are also meant to generate some type of positive impact, whether it be environmental or social. In between, ESG can look like a lot of things, whether that's selecting companies that are best in class or building a portfolio geared towards a certain theme like biodiversity, net zero or gender diversity.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Now, you're a fixed income strategist and ESG investing through the bond market is a bit newer and still evolving. What are some of the challenges of investing in ESG through bonds as opposed to stocks?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Well, so one big difference in fixed income is that there are products that are actually dedicated sustainability assets. Companies, governments and super nationals can issue bonds that are specifically ESG instruments, which isn't something that you can quite do in the stock market. The most common is the green bond. The net proceeds of the issuance go towards green projects, which can be things like retrofitting your buildings to be more energy efficient, building out a solar paneled roof, reducing water waste and so on. There are also social bonds with projects related to decreasing inequality or access to health care and sustainability bonds, which fund both types of projects. We spend a lot of time trying to understand how these instruments trade compared to normal vanilla bonds from the same issuer. A big driver of the difference in price and performance is that there are just a lot fewer of these label bonds and quite a large appetite to invest in them. So those supply and demand dynamics have historically helped these labor bonds trade well, particularly in the primary market. We recently completed some analysis, though, that found that when you strip away a lot of the structural differences, the premium afforded to these green bonds is pretty small over time, just around half a basis point. The big difference comes from green bonds that go the extra mile. These bonds have voluntary external verification, science-based targets, so on and so forth. Investors can see the green criteria of the bond and feel confident that the governance structures are in place to ensure the materiality of the green bond going forward. And these bonds on average trade with higher premiums to their vanilla counterparts than just your regular green bond.&nbsp;</p><p><br></p><p><strong>Michael Zezas: </strong>So I want to get into some of the challenges I mentioned at the start around the debate over ESG's impact and validity. What's been the catalyst for the increased scrutiny over what's often called 'greenwashing?'&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Yeah, great question. So if we take it back a step, ESG really took off during 2020 with the onset of the pandemic. And there was a surge of focus on, and enthusiasm around, ESG and climate change more broadly. The market's grown exponentially since then, and it was natural that some of these new products and developments would be met with a raised eyebrow. Protests and social unrest in 2020, for instance, marked a turning point for companies with society asking companies to state their values upfront and to start walking the walk. Much of the scrutiny around ESG is ensuring that companies are not taking advantage of ESG as a marketing exercise to generate goodwill and are, in a sense, putting their money where their mouth is. That's really accelerated this year with the war in Ukraine, which is highlighted that within ESG there are some potentially competing priorities, namely the social cost of high energy prices versus the far reaching implications of climate change, or the rising food insecurity versus a more sustainable value chain. Investors have begun to adopt more nuanced views of what ESG is and how it might evolve in a world with higher volatility and decades-high inflation prints. And not everybody has the same definition of what ESG means to them. At the end of the day, the debate centers around, is it affecting change, and if so, by how much?&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So I certainly understand the clamor for demonstrable proof of impact. But would you say that, even with incidents of greenwashing, has ESG moved the needle on achieving its goals?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Another great question, and unfortunately, it's probably still too early to tell. ESG is really about playing the long game and moving the market's focus away from its bias towards short-termism. So the effects of these new cleaner investments might not necessarily be realized overnight. I think what is clear, though, is that the global greenhouse gas emissions haven't declined in recent years, despite this push towards more sustainable investing. In fact, 2021 marked the highest amount of global CO2 emissions ever recorded. That being said, while policy development at the federal level on climate might be facing some serious headwinds here in the US, there has been a positive push from the private sector to decarbonize, regardless of a legislative incentive. Just because we haven't seen a decline in emissions yet, doesn't mean it won't happen. It just means that there's a lot more work to do and a lot more money that needs to flow towards these sustainable solutions.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So one of your key skills as a strategist is how you apply data and empirical analysis to ESG investments. Can you walk us through your work and your process?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> We start every report with a research question—how do you see factors, impacts, spread performance, for instance, or how much of a premium do these green bonds trade with? Sometimes these questions are commonly discussed and dissected in the news, in academic research and so on. But we try to begin each project with no presupposition of what we might find so that we don't bias our results. We want to let the data and results speak for itself. And we're not trying to push an agenda. We're trying to get to the bottom of complex problems that investors demonstrably care about. ESG data is incredibly tricky because it tends to have a shorter history than most financial metrics and is released slowly and often with lags. That doesn't give us a ton of wiggle room, but once we know the question we're trying to answer, we always start by collecting data, and we'll look for data from myriad sources: public and private, startups, the US government—you name it, we've looked into it. And then sadly, a lot of the work is data cleaning, as any data scientist listening knows all too well. Once we build the dataset, we start tackling that research question. Sometimes we're doing something a bit more simplistic, like standardizing metrics in order to facilitate a comparison of different instruments or companies. This is a big hurdle for ESG in particular, because we don't have anything like GAAP accounting metrics that every company has to report on. Just getting to a point where you can do an apples to apples comparison is not always straightforward. Often though, we look to use different types of regression models or other types of machine learning techniques to understand relationships in the market and to build the confidence in our results. Once we have those results, it's all about visualizing it in a compelling and clear way.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> If an investor is interested in the ESG space, what should they keep front of mind as they consider their investments?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> ESG is full of tradeoffs and it's rarely straightforward. We mentioned some of these dilemmas before, such as the social cost of the high gas prices and the implications of climate change by continuing to rely on fossil fuels. It's never clear cut. ESG isn't a one size fits all solution, and different investors are going to have different priorities. Understanding your priorities at the outset and keeping those as a guiding light will help keep the investment process on track and drown out some of the noise. That being said, it's also important in this fast evolving space to be flexible to new information and to be adaptable. The world looks very different now than it did a year ago or five years ago, and ESG in particular is rapidly changing with new regulations, new issues and new conflicts every day. Relying on the data and facts and understanding how trends change within the industry will be of utmost importance.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Carolyn, thanks so much for talking.&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Great talking with you, Michael.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And thanks for listening. If you enjoy the show, please share Thoughts on the Market with a friend or colleague, or leave us a review on Apple Podcasts. It helps more people find the show.</p>",
  "itunes:title": "Special Episode: The Next Phase of ESG",
  "itunes:episodeType": "full",
  "itunes:episode": 661,
  "itunes:summary": "Interest in ESG investing has risen exponentially in recent years, leading to increased scrutiny around, and appreciation for, the hard data. Head of U.S. Public Policy Research and Municipal Strategy Michael Zezas and Head of the ESG Fixed Income Research Team Carolyn Campbell discuss.",
  "content:encoded": "<p>Interest in ESG investing has risen exponentially in recent years, leading to increased scrutiny around, and appreciation for, the hard data. Head of U.S. Public Policy Research and Municipal Strategy Michael Zezas and Head of the ESG Fixed Income Research Team Carolyn Campbell discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Michael Zezas:</strong> Welcome to Thoughts on the Market. I'm Michael Zezas, head of U.S. Public Policy Research and Municipal Strategy.&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> And I'm Carolyn Campbell, head of the ESG fixed income research team at Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And on this special edition of the podcast, we'll be assessing the next phase of the environmental, social, governance, ESG, market. It's Wednesday, July 20th, at 10 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> As some listeners may have read, in late May of this year, the Securities and Exchange Commission proposed new rules that would require ESG funds to disclose their goals, criteria and strategies, along with data measuring ESG progress. And this tells us that although the market for ESG investing has grown, so has investor desire to see real data and empirical analysis on impact. And this could be seen as really the next phase of the ESG market, that companies and funds won't just claim to be focused on ESG but will provide real proof. So, Carolyn, just to set the stage, I notice that people sometimes use the term sustainable investing and ESG interchangeably. So, I think it might be good to start with what exactly ESG is.&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> At its core ESG is about adding a new lens to risk management in our investment practices by looking at environmental, social and governance factors in addition to our traditional financial metrics and whatnot. ESG has been around in some way, shape or form for decades, beginning with what we call negative exclusions. Initially, that looked like excluding companies that conflicted with religious views such as gambling, alcohol or pornography. But it's probably best known more recently for what we would think of as the fossil fuel divestment movement; selling out of coal and oil and gas companies, for example. On the other end of the spectrum, we've got impact investing where money is put towards projects that are both worthy financial investments but are also meant to generate some type of positive impact, whether it be environmental or social. In between, ESG can look like a lot of things, whether that's selecting companies that are best in class or building a portfolio geared towards a certain theme like biodiversity, net zero or gender diversity.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Now, you're a fixed income strategist and ESG investing through the bond market is a bit newer and still evolving. What are some of the challenges of investing in ESG through bonds as opposed to stocks?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Well, so one big difference in fixed income is that there are products that are actually dedicated sustainability assets. Companies, governments and super nationals can issue bonds that are specifically ESG instruments, which isn't something that you can quite do in the stock market. The most common is the green bond. The net proceeds of the issuance go towards green projects, which can be things like retrofitting your buildings to be more energy efficient, building out a solar paneled roof, reducing water waste and so on. There are also social bonds with projects related to decreasing inequality or access to health care and sustainability bonds, which fund both types of projects. We spend a lot of time trying to understand how these instruments trade compared to normal vanilla bonds from the same issuer. A big driver of the difference in price and performance is that there are just a lot fewer of these label bonds and quite a large appetite to invest in them. So those supply and demand dynamics have historically helped these labor bonds trade well, particularly in the primary market. We recently completed some analysis, though, that found that when you strip away a lot of the structural differences, the premium afforded to these green bonds is pretty small over time, just around half a basis point. The big difference comes from green bonds that go the extra mile. These bonds have voluntary external verification, science-based targets, so on and so forth. Investors can see the green criteria of the bond and feel confident that the governance structures are in place to ensure the materiality of the green bond going forward. And these bonds on average trade with higher premiums to their vanilla counterparts than just your regular green bond.&nbsp;</p><p><br></p><p><strong>Michael Zezas: </strong>So I want to get into some of the challenges I mentioned at the start around the debate over ESG's impact and validity. What's been the catalyst for the increased scrutiny over what's often called 'greenwashing?'&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Yeah, great question. So if we take it back a step, ESG really took off during 2020 with the onset of the pandemic. And there was a surge of focus on, and enthusiasm around, ESG and climate change more broadly. The market's grown exponentially since then, and it was natural that some of these new products and developments would be met with a raised eyebrow. Protests and social unrest in 2020, for instance, marked a turning point for companies with society asking companies to state their values upfront and to start walking the walk. Much of the scrutiny around ESG is ensuring that companies are not taking advantage of ESG as a marketing exercise to generate goodwill and are, in a sense, putting their money where their mouth is. That's really accelerated this year with the war in Ukraine, which is highlighted that within ESG there are some potentially competing priorities, namely the social cost of high energy prices versus the far reaching implications of climate change, or the rising food insecurity versus a more sustainable value chain. Investors have begun to adopt more nuanced views of what ESG is and how it might evolve in a world with higher volatility and decades-high inflation prints. And not everybody has the same definition of what ESG means to them. At the end of the day, the debate centers around, is it affecting change, and if so, by how much?&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So I certainly understand the clamor for demonstrable proof of impact. But would you say that, even with incidents of greenwashing, has ESG moved the needle on achieving its goals?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Another great question, and unfortunately, it's probably still too early to tell. ESG is really about playing the long game and moving the market's focus away from its bias towards short-termism. So the effects of these new cleaner investments might not necessarily be realized overnight. I think what is clear, though, is that the global greenhouse gas emissions haven't declined in recent years, despite this push towards more sustainable investing. In fact, 2021 marked the highest amount of global CO2 emissions ever recorded. That being said, while policy development at the federal level on climate might be facing some serious headwinds here in the US, there has been a positive push from the private sector to decarbonize, regardless of a legislative incentive. Just because we haven't seen a decline in emissions yet, doesn't mean it won't happen. It just means that there's a lot more work to do and a lot more money that needs to flow towards these sustainable solutions.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So one of your key skills as a strategist is how you apply data and empirical analysis to ESG investments. Can you walk us through your work and your process?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> We start every report with a research question—how do you see factors, impacts, spread performance, for instance, or how much of a premium do these green bonds trade with? Sometimes these questions are commonly discussed and dissected in the news, in academic research and so on. But we try to begin each project with no presupposition of what we might find so that we don't bias our results. We want to let the data and results speak for itself. And we're not trying to push an agenda. We're trying to get to the bottom of complex problems that investors demonstrably care about. ESG data is incredibly tricky because it tends to have a shorter history than most financial metrics and is released slowly and often with lags. That doesn't give us a ton of wiggle room, but once we know the question we're trying to answer, we always start by collecting data, and we'll look for data from myriad sources: public and private, startups, the US government—you name it, we've looked into it. And then sadly, a lot of the work is data cleaning, as any data scientist listening knows all too well. Once we build the dataset, we start tackling that research question. Sometimes we're doing something a bit more simplistic, like standardizing metrics in order to facilitate a comparison of different instruments or companies. This is a big hurdle for ESG in particular, because we don't have anything like GAAP accounting metrics that every company has to report on. Just getting to a point where you can do an apples to apples comparison is not always straightforward. Often though, we look to use different types of regression models or other types of machine learning techniques to understand relationships in the market and to build the confidence in our results. Once we have those results, it's all about visualizing it in a compelling and clear way.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> If an investor is interested in the ESG space, what should they keep front of mind as they consider their investments?&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> ESG is full of tradeoffs and it's rarely straightforward. We mentioned some of these dilemmas before, such as the social cost of the high gas prices and the implications of climate change by continuing to rely on fossil fuels. It's never clear cut. ESG isn't a one size fits all solution, and different investors are going to have different priorities. Understanding your priorities at the outset and keeping those as a guiding light will help keep the investment process on track and drown out some of the noise. That being said, it's also important in this fast evolving space to be flexible to new information and to be adaptable. The world looks very different now than it did a year ago or five years ago, and ESG in particular is rapidly changing with new regulations, new issues and new conflicts every day. Relying on the data and facts and understanding how trends change within the industry will be of utmost importance.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Carolyn, thanks so much for talking.&nbsp;</p><p><br></p><p><strong>Carolyn Campbell:</strong> Great talking with you, Michael.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And thanks for listening. If you enjoy the show, please share Thoughts on the Market with a friend or colleague, or leave us a review on Apple Podcasts. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/SGMaCyEG7VIpxUJ3Cpt0UseT-lzmkLetlWJNy7O8bu0",
  "pubDate": "Wed, 20 Jul 2022 22:36:14 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends",
  "itunes:duration": "00:08:48",
  "enclosure": ""
}