{
  "title": "Rogan DISMANTLES Rolling Stone Founder On Censorship",
  "itunes:title": "Rogan DISMANTLES Rolling Stone Founder On Censorship",
  "pubDate": "Fri, 14 Oct 2022 17:30:00 +0000",
  "guid": "3845e96b-7e43-4794-be31-f223bc447332",
  "link": "https://thejimmydoreshow.libsyn.com/rogan-dismantles-rolling-stone-founder-on-censorship",
  "itunes:image": "",
  "description": "<p>During a recent episode of the Joe Rogan Experience podcast, the titular host welcomed Rolling Stone Magazine founder Jann Wenner, and the conversation quickly turned to online censorship. Wenner expressed support for the tech industry and government regulating speech since government does so well regulating the food supply and the pharmaceutical industry. At which point Rogan stepped in and set Wenner straight in a gentle but nevertheless devastating way.</p> <p>Jimmy and America’s Comedian Kurt Metzger wonder at the founder of an iconically countercultural publication like Rolling Stone turning into such a neoliberal shill for the establishment.<br /> <br /> Plus segments on the escalating war in Ukraine, a former Chairman of the Joint Chiefs of Staff calling for NATO to negotiate a settlement to the Ukraine War, Joe Biden lying about codifying Roe v Wade into law and a Wired Magazine article with the dumbest work-related advice ever.<br /> <br /> Also featuring Stef Zamorano!</p>",
  "content:encoded": "<p>During a recent episode of the Joe Rogan Experience podcast, the titular host welcomed Rolling Stone Magazine founder Jann Wenner, and the conversation quickly turned to online censorship. Wenner expressed support for the tech industry and government regulating speech since government does so well regulating the food supply and the pharmaceutical industry. At which point Rogan stepped in and set Wenner straight in a gentle but nevertheless devastating way.</p> <p>Jimmy and America’s Comedian Kurt Metzger wonder at the founder of an iconically countercultural publication like Rolling Stone turning into such a neoliberal shill for the establishment.  Plus segments on the escalating war in Ukraine, a former Chairman of the Joint Chiefs of Staff calling for NATO to negotiate a settlement to the Ukraine War, Joe Biden lying about codifying Roe v Wade into law and a Wired Magazine article with the dumbest work-related advice ever.  Also featuring Stef Zamorano!</p>",
  "enclosure": "",
  "itunes:duration": "01:05:43",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "During a recent episode of the Joe Rogan Experience podcast, the titular host welcomed Rolling Stone Magazine founder Jann Wenner, and the conversation quickly turned to online censorship. Wenner expressed support for the tech industry and government...",
  "itunes:episodeType": "full",
  "itunes:summary": "During a recent episode of the Joe Rogan Experience podcast, the titular host welcomed Rolling Stone Magazine founder Jann Wenner, and the conversation quickly turned to online censorship. Wenner expressed support for the tech industry and government regulating speech since government does so well regulating the food supply and the pharmaceutical industry. At which point Rogan stepped in and set Wenner straight in a gentle but nevertheless devastating way. Jimmy and America’s Comedian Kurt Metzger wonder at the founder of an iconically countercultural publication like Rolling Stone turning into such a neoliberal shill for the establishment. Plus segments on the escalating war in Ukraine, a former Chairman of the Joint Chiefs of Staff calling for NATO to negotiate a settlement to the Ukraine War, Joe Biden lying about codifying Roe v Wade into law and a Wired Magazine article with the dumbest work-related advice ever. Also featuring Stef Zamorano!"
}