{
  "title": "All Russian Cossacks Increasingly Resemble Krasnodar Movement",
  "link": "https://jamestown.org/all-russian-cossacks-increasingly-resemble-krasnodar-movement/",
  "dc:creator": "web1983",
  "pubDate": "Fri, 21 May 2021 17:38:40 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=89522",
  "description": "<p>The Russian Cossack movement is emerging as one of the key social pillars supporting the regime, and increasingly it is taking on the mold of Kuban Cossackdom, found in the southern part of the country. An outline of plans for the further institutionalization of the movement at the administrative levels makes this clear. Officially, the Kremlin has been working on &#8230; <a href=\"https://jamestown.org/all-russian-cossacks-increasingly-resemble-krasnodar-movement/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/all-russian-cossacks-increasingly-resemble-krasnodar-movement/\">All Russian Cossacks Increasingly Resemble Krasnodar Movement</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>The Russian Cossack movement is emerging as one of the key social pillars supporting the regime, and increasingly it is taking on the mold of Kuban Cossackdom, found in the southern part of the country. An outline of plans for the further institutionalization of the movement at the administrative levels makes this clear. Officially, the Kremlin has been working on developing relations among Cossacks across the territorial subjects of the Russian Federation (see <a href=\"https://jamestown.org/program/growing-presence-of-cossacks-in-2021/\">EDM</a>, January 22), and so the shift to a model resembling that used in the Kuban region is plausible. Namely, in the Kuban’s Krasnodar Krai, in the 1990s and early 2000s, the regional administration co-opted a grassroots movement and made them emblems of the federal subject through such gestures as creating public memorials, facilitating Cossack education, holding weekly parades in the summer, using Cossack troops to punish liberal activists, and letting them patrol the streets of cities in the region. The Krasnodar Cossacks also played an important role in the annexation of Crimea (see <a href=\"https://jamestown.org/program/belarusian-cossacks-an-option-for-putin/\">EDM</a>, September 30, 2020), providing a kind of <em>gendarme</em> for Russian forces to relieve them of the need to provide public order.</p>\n<p>The importance of the Krasnodar movement for the national Cossack archetype is epitomized in the fact that Nikolai Doluda—who had been <em>ataman</em> (head) of the Kuban Cossack force since 2008—was appointed <em>ataman</em> of the all-Russian Cossack host in 2019 (<a href=\"https://fedpress.ru/person/1651781\">Fedpress.ru</a>, May 1, 2021). Doluda took part in the annexation of Crimea and attended a victory parade in Moscow in 2015. He has since been named vice governor of the Krasnodar region and a member of the Russian public chamber. He also sits on the “Presidential Council for the Rebirth of Cossacks,” <em>inter alia</em> committed to the creation of a central historical Cossack museum, including memorials to those who fell in defense of the fatherland (<a href=\"http://kremlin.ru/events/councils/65349\">Kremlin.ru</a>, April 9). The Council also mentions the return of Cossack regalia from outside the country, similar to what was done in Krasnodar.</p>\n<p>Doluda has been busy furthering this model of Cossack development, telling journalists that he had traveled to 11 Cossack hosts throughout Russia and found uneven levels of development for the nurturing of patriotism. To counter this, the Russian government has created 35 indicators that <em>atamans</em> of Cossack societies and representatives of government bodies should consult in this endeavor—thus, <em>de facto</em> bestowing on government plenipotentiaries an administrative role over the Cossacks. Indeed, Doluda said, “for the even development of 12 registered Cossack troops, it is necessary to develop a single standard for organizing work in all areas of activity. To this end, Kuban Cossacks held an educational and methodological seminar on May 18–20, during which the host’s representatives shared their experiences with representatives of all military Cossack societies of Russia” (<a href=\"http://казакисибири.рф/?sid=4582&newsid=18081\">Kazakisibiri.rf</a>, April 26). In education policy, then, the Kuban Cossacks are clearly the model to which every other host should aspire.</p>\n<p>The traditional Cossack regions of Russia are located in the south—in the Kuban, Rostov, Volgograd and Stavropol. While Cossacks played an important role in expanding the Russian Empire and were dislocated by Soviet modernization, Siberia never had the same resonance as a locus of Cossack identity. Nevertheless, Doluda chose the base of the Yaik (Ural) Cossacks to make his speech about the importance of Cossack education, saying,</p>\n<blockquote><p>Our meeting is taking place today in new historical realities. Responding to the challenges of the times, the Russian Cossacks are becoming a notable force. The tasks before them are of state importance, connected, first of all, with national security, protection of public order, guarding state borders, environmental protection, and elimination of the consequences of emergencies. For their successful solution, the collective efforts of the branch departments should be involved in the first place on the preparation of the personnel reserve of the Cossack societies… The results of today’s work should be the definition of ways to form a single education standard, a single understanding, what the responsibilities of the future <em>ataman</em> of Cossack society should be, the real leader of the Cossack movement must correspond (<a href=\"http://казакисибири.рф/?sid=4582&newsid=18086\">Kazakisibiri.rf</a>, April 26).</p></blockquote>\n<p>He continued that today, “the Cossack cadet corps and universities help to solve the most acute problems to date—the deficit of highly educated personnel,” gesturing toward efforts to include Cossack educational components at universities (<a href=\"http://казакисибири.рф/?sid=4582&newsid=18086\">Kazakisibiri.rf</a>, April 26). This largely replicates patterns seen in the Kuban.</p>\n<p>The same appears to hold true for empowering Russian Cossack hosts to punish domestic liberal activists and liberalism in general: the promoted activities increasingly resemble those already employed in Krasnodar. For example, in Tula (120 miles south of Moscow), on January 23, Cossack patrols were “very active”—and used <em>nagaika</em> (traditional Cossack leather horse whips)—in helping the police arrest supporters of opposition leader Alexei Navalny (<a href=\"https://www.sova-center.ru/racism-xenophobia/news/racism-nationalism/2021/02/d43580/\">Sova-center.ru</a>, February 1). In Yekaterinburg, Cossacks were outraged by the sight of a new bar in the city with the provocative name “Gastrobar of Temptations.” Ataman Oleg Senenko rebuked the Ministry of Justice for permitting a business to register such a “demonic” moniker and implied that Molotov cocktails could be thrown at the establishment (<a href=\"https://anews.com/novosti/134814908-kazaki-prigrozili-baru-v-ekaterinburge-koktejljami-molotova.html\">Anews.com</a>, September 21, 2020).</p>\n<p>When searching for the future shape of Russia’s Cossack movement, then, one would do well to examine Krasnodar.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/all-russian-cossacks-increasingly-resemble-krasnodar-movement/\">All Russian Cossacks Increasingly Resemble Krasnodar Movement</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}