{
  "id": "https://bibleinoneyear.org/en/youth/153",
  "title": "Day 153: ‘Crazy Love’",
  "description": "Psalm 69:9, 1 Samuel 2:26a, John 21:4-7, 12–15.  Elsewhere he says, ‘Never be lacking in zeal’ (Romans 12:11)  Perhaps a good modern translation of the word ‘zeal’ is ‘crazy love’",
  "pubDate": "Wed, 02 Jun 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/153/?ignore",
  "itunes:duration": "14:03",
  "guid": "enyouth02062021-153",
  "length": 843.81,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 153: ‘Crazy Love’",
  "itunes:subtitle": "Psalm 69:9, 1 Samuel 2:26a, John 21:4-7, 12–15.  Elsewhere he says, ‘Never be lacking in zeal’ (Romans 12:11)  Perhaps a good modern translation of the word ‘zeal’ is ‘crazy love’",
  "itunes:summary": "Francis Chan’s mother died giving birth to him. The only affection he can remember receiving from his father lasted about thirty seconds when he was on the way to his stepmother’s funeral aged nine. When he was twelve, his father also died. Francis cried, but also felt relieved.\nFrancis is now a pastor. He and his wife, Lisa, have seven children. When his children were born, his own love for his children and his desire for their love was so strong that it opened his eyes to how much God desires and loves us. He said, ‘Through this experience, I came to understand that my desire for my children is only a faint echo of God’s great love for me and for every person he made… I love my kids so much it hurts.’\nCalling his first book Crazy Love, he wrote, ‘The idea of Crazy Love has to do with our relationship with God. All my life I’ve heard people say, “God loves you.” It’s probably the most insane statement you could make to say that the eternal Creator of this universe is in love with me. There is a response that ought to take place in believers, a crazy reaction to that love. Do you really understand what God has done for you? If so, why is your response so lukewarm?’\nThe word ‘zeal’ implies an intense or passionate desire. It can be misdirected, but as Paul writes, it is right to be zealous provided that the purpose is good (Galatians 4:18). Elsewhere he says, ‘Never be lacking in zeal’ (Romans 12:11). Perhaps a good modern translation of the word ‘zeal’ is ‘crazy love’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 153
}