{
  "title": "Common Information, Noise Stability, and Their Extensions. (arXiv:2211.01788v1 [cs.IT])",
  "link": "http://arxiv.org/abs/2211.01788",
  "description": "<p>Common information (CI) is ubiquitous in information theory and related areas\nsuch as theoretical computer science and discrete probability. However, because\nthere are multiple notions of CI, a unified understanding of the deep\ninterconnections between them is lacking. This monograph seeks to fill this gap\nby leveraging a small set of mathematical techniques that are applicable across\nseemingly disparate problems.\n</p>\n<p>In Part I, we review the operational tasks and properties associated with\nWyner's and G\\'acs-K\\\"orner-Witsenhausen's (GKW's) CI. In PartII, we discuss\nextensions of the former from the perspective of distributed source simulation.\nThis includes the R\\'enyi CI which forms a bridge between Wyner's CI and the\nexact CI. Via a surprising equivalence between the R\\'enyi CI of order~$\\infty$\nand the exact CI, we demonstrate the existence of a joint source in which the\nexact CI strictly exceeds Wyner's CI. Other closely related topics discussed in\nPart II include the channel synthesis problem and the connection of Wyner's and\nexact CI to the nonnegative rank of matrices.\n</p>\n<p>In Part III, we examine GKW's CI with a more refined lens via the noise\nstability or NICD problem in which we quantify the agreement probability of\nextracted bits from a bivariate source. We then extend this to the $k$-user\nNICD and $q$-stability problems, and discuss various conjectures in information\ntheory and discrete probability, such as the Courtade-Kumar, Li-M\\'edard and\nMossell-O'Donnell conjectures. Finally, we consider hypercontractivity and\nBrascamp-Lieb inequalities, which further generalize noise stability via\nreplacing the Boolean functions therein by nonnnegative functions. The key\nideas behind the proofs in Part III can be presented in a pedagogically\ncoherent manner and unified via information-theoretic and Fourier-analytic\nmethods.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Yu_L/0/1/0/all/0/1\">Lei Yu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tan_V/0/1/0/all/0/1\">Vincent Y. F. Tan</a>"
}