{
  "id": "https://bibleinoneyear.org/en/youth/115",
  "title": "Day 115: Your Loving Substitute",
  "description": "Psalm 51:1–2,7, Joshua 8:1,7, Luke 23:20–25.  Jesus died to remove all the bad stuff  He died instead of you and me (Mark 10:45)",
  "pubDate": "Mon, 25 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/115/",
  "itunes:duration": "13:06",
  "guid": "enyouth25042022-115",
  "length": 786.02,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 115: Your Loving Substitute",
  "itunes:subtitle": "Psalm 51:1–2,7, Joshua 8:1,7, Luke 23:20–25.  Jesus died to remove all the bad stuff  He died instead of you and me (Mark 10:45)",
  "itunes:summary": "A little girl named Liz, was suffering from a rare and serious disease. Her only chance of recovery appeared to be a blood transfusion from her five-year-old brother, who had miraculously survived the same disease and had developed the antibodies needed. The doctor explained the situation and asked the little boy if he would be willing to give his blood to his sister. He hesitated for only a moment before taking a deep breath and saying, ‘Yes, I’ll do it if it will save her.’\nAs the transfusion progressed, he lay in bed next to his sister, and smiled, as they all did, seeing the colour returning to her cheeks. Then his face grew pale and his smile faded. He looked up at the doctor and asked with a trembling voice, ‘Will I start to die right away?’\nThe little boy had misunderstood the doctor. He thought he was going to have to give his sister all of his blood in order to save her. This boy loved his sister so much that he was willing to die instead of her – as her substitute. This story (possibly fictional) is simply an illustration of what loving substitution means.\nGod loves you. The amazing and wonderful message of the Bible is that God came to this earth in the person of his Son, Jesus Christ, and died in your place. Words, images, metaphors, pictures and illustrations (such as that of the five-year-old boy) can help our understanding, but they can never perfectly describe the indescribable love of God. Jesus died to remove all the bad stuff. He died instead of you and me (Mark 10:45).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 480
}