{
  "title": "The Edition: the great pretender",
  "link": "https://audioboom.com/posts/7864915",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1860,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s podcast, we talk to <em>The Spectator</em>'s editor Fraser Nelson and associate editor Douglas Murray about the challenges facing a freshly re-elected SNP. What next for Nicola Sturgeon - full steam ahead for IndyRef2? Or have neither Scotland or Number 10 the bottle for an all-out battle for independence? [01:02]<br>\n<br>\n\n</div>\n<div>\n<em>‘When you look at the practicalities, the case for independence really does fall. Nicola Sturgeon is selling it in the abstract: “Do you feel Scottish”?’</em> - Fraser Nelson<br>\n<br>\n\n</div>\n<div>Meanwhile in matters of social etiquette, the new post-pandemic era looms, complete with new modes of social interactions and conversational topics. In this week’s magazine, Rachel Johnson lays down the new laws of conversational topics - sex, art and travel is fine; kids, vaccines and masks are most definitely not. She joins us now, along with Lucy Hume, from that venerable arbiter of taste and decorum, Debrett’s, for some ideas for the upcoming social summer. [12:25]<br>\n<br>\n\n</div>\n<div>'I sometimes got emails from people, during lockdown, saying, I’m on my way to my second house, can you confirm this is legal or not, as if I was the ultimate arbiter of the crazy compliance and Covid restrictions!' - Rachel Johnson<br>\n<br>\n\n</div>\n<div>Finally, as the government announces its plans to introduce new asset thresholds for households seeking healthcare in old age, Leo McKinstry writes in <em>The Spectator</em> this week of his irritation with middle-class homeowners scandalised at the prospect of selling their homes to finance healthcare in their old age. Should this be a cost collectively borne by the taxpayer or should those with ample assets simply bear the brunt of the cost? Will Heaven, Director of Policy and Communications at the Policy Exchange think tank, joins us to argue the point. [23:00]<br>\n<br>\n\n</div>\n<div>'I think if you were to tell most 40-year olds that you’re going to pay one penny extra on income tax over the course of your career but you’re never going to have to worry about high social care costs and parents and grandparents, they’d probably go for it' - Will Heaven.<br>\n<br>\n\n</div>\n<div>Presented by Lara Prendergast<br>\n<br>\n\n</div>\n<div>Produced by Arsalan Mohammad and Sam Russell</div>\n",
  "pubDate": "Thu, 13 May 2021 18:25:19 +0000",
  "guid": "tag:audioboom.com,2021-05-13:/posts/7864915",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}