{
  "title": "Ben Vinson III, \"Before Mestizaje: The Frontiers of Race and Caste in Colonial Mexico\" (Cambridge UP, 2017)",
  "description": "Since its 2017 publication, Ben Vinson III's book Before Mestizaje: The Frontiers of Race and Caste in Colonial Mexico (Cambridge University Press) has opened new dimensions on race in Latin America by examining the extreme caste groups of colonial Mexico. In tracing their experiences, a broader understanding of the connection between mestizaje (Latin America's modern ideology of racial mixture) and the colonial caste system is rendered. However, before this term, mestizaje, emerged as a primary concept in Latin America, an earlier precursor existed. This colonial form of racial hybridity, encased in an elastic caste system, allowed some people to live through multiple racial lives. Hence, the great fusion of races that swept Latin America and defined its modernity, carries an important corollary. Mestizaje, when viewed at its roots, is not just about mixture, but also about dissecting and reconnecting lives. Such experiences may have carved a special ability for some Latin American populations to reach across racial groups to relate with and understand multiple racial perspectives. This overlooked, deep history of mestizaje is a legacy that can be built upon in modern times.\nBen Vinson III is Provost and Executive Vice President at Case Western Reserve University. He was awarded Howard F. Cline Book Prize in Mexican History for Before Mestizaje.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/latin-american-studies",
  "pubDate": "Wed, 14 Oct 2020 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 818,
  "itunes:author": "Marshall Poe",
  "itunes:subtitle": "Vinson opens new dimensions on race in Latin America by examining the extreme caste groups of colonial Mexico...",
  "itunes:summary": "Since its 2017 publication, Ben Vinson III's book Before Mestizaje: The Frontiers of Race and Caste in Colonial Mexico (Cambridge University Press) has opened new dimensions on race in Latin America by examining the extreme caste groups of colonial Mexico. In tracing their experiences, a broader understanding of the connection between mestizaje (Latin America's modern ideology of racial mixture) and the colonial caste system is rendered. However, before this term, mestizaje, emerged as a primary concept in Latin America, an earlier precursor existed. This colonial form of racial hybridity, encased in an elastic caste system, allowed some people to live through multiple racial lives. Hence, the great fusion of races that swept Latin America and defined its modernity, carries an important corollary. Mestizaje, when viewed at its roots, is not just about mixture, but also about dissecting and reconnecting lives. Such experiences may have carved a special ability for some Latin American populations to reach across racial groups to relate with and understand multiple racial perspectives. This overlooked, deep history of mestizaje is a legacy that can be built upon in modern times.\nBen Vinson III is Provost and Executive Vice President at Case Western Reserve University. He was awarded Howard F. Cline Book Prize in Mexican History for Before Mestizaje.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/latin-american-studies",
  "content:encoded": "<p>Since its 2017 publication, Ben Vinson III's book <a href=\"https://bookshop.org/a/12343/9781107670815\"><em>Before Mestizaje: The Frontiers of Race and Caste in Colonial Mexico</em></a> (Cambridge University Press) has opened new dimensions on race in Latin America by examining the extreme caste groups of colonial Mexico. In tracing their experiences, a broader understanding of the connection between mestizaje (Latin America's modern ideology of racial mixture) and the colonial caste system is rendered. However, before this term, mestizaje, emerged as a primary concept in Latin America, an earlier precursor existed. This colonial form of racial hybridity, encased in an elastic caste system, allowed some people to live through multiple racial lives. Hence, the great fusion of races that swept Latin America and defined its modernity, carries an important corollary. Mestizaje, when viewed at its roots, is not just about mixture, but also about dissecting and reconnecting lives. Such experiences may have carved a special ability for some Latin American populations to reach across racial groups to relate with and understand multiple racial perspectives. This overlooked, deep history of mestizaje is a legacy that can be built upon in modern times.</p><p>Ben Vinson III is Provost and Executive Vice President at Case Western Reserve University. He was awarded Howard F. Cline Book Prize in Mexican History for <em>Before Mestizaje</em>.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/latin-american-studies\">https://newbooksnetwork.supportingcast.fm/latin-american-studies</a></p>",
  "itunes:duration": 2156,
  "itunes:explicit": "no",
  "guid": "f4c7f798-04e4-11eb-997a-33cbb5e828fa",
  "enclosure": ""
}