{
  "id": "yt:video:HxKNNvBMrVo",
  "yt:videoId": "HxKNNvBMrVo",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Far Cry 2 makes me afraid to go outside",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-04T21:08:46+00:00",
  "updated": "2022-10-07T19:28:15+00:00",
  "media:group": {
    "media:title": "Far Cry 2 makes me afraid to go outside",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "step 1: get malaria\nstep 2: probably die\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nFar Cry 2 is a 2008 first-person shooter developed by Ubisoft Montreal and published by Ubisoft for Microsoft Windows, PlayStation 3 and Xbox 360. A top-down shooter version for mobile phones was developed and published by Gameloft. It is the second mainline entry in the Far Cry series. Set in a fictional East African country engulfed in civil war, the storyline follows a mercenary who is assigned to kill the Jackal, a weapons dealer inflaming the conflict. The player navigates the open world, completing missions for factions and allies called Buddies while managing their health and equipment. A competitive multiplayer mode allows players to fight in teams or as individuals.\n\nProduction took three and a half years, with concept work beginning during the production of Far Cry Instincts (2005). Director Clint Hocking conceived the setting and design, which he wanted to be more realistic than the original Far Cry (2004). The narrative and tone, inspired by Joseph Conrad's novella Heart of Darkness and Dashiell Hammett's novel Red Harvest, focused on the lengths to which people would go to survive through terrible circumstances. The game was built using Dunia, a game engine created by Ubisoft based on the original game's CryEngine. In pursuit of realism, the developers added real-time and reactive elements for enemies and the environment. The music, composed by Marc Canham, includes vocals by Senegalese singer Baaba Maal.\n\nFar Cry 2 received positive reviews from critics, with praise for its setting, open-ended gameplay, Buddies, world design and visuals; however its writing, artificial intelligence and technical issues received negative attention. It received multiple game award nominations. By January 2009, the game had sold nearly three million copies worldwide. Far Cry 2 has continued to receive attention for its ambition and survival mechanics. The team used feedback from the game to develop Far Cry 3 (2012).\n\n#gaming #jayvee #farcry",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}