{
  "title": "Beer Isn&#8217;t Vodka: SKYY Vodka People Going After Dark Sky Brewery Over TM",
  "link": "https://www.techdirt.com/2022/11/04/beer-isnt-vodka-skyy-vodka-people-going-after-dark-sky-brewery-over-tm/",
  "comments": "https://www.techdirt.com/2022/11/04/beer-isnt-vodka-skyy-vodka-people-going-after-dark-sky-brewery-over-tm/#comments",
  "dc:creator": "Dark Helmet",
  "pubDate": "Sat, 05 Nov 2022 02:39:00 +0000",
  "category": [
    1,
    "campari",
    "dark sky brewery",
    "beer",
    "likelihood of confusion",
    "skyy",
    "trademark",
    "vodka"
  ],
  "guid": "https://www.techdirt.com/?p=381383&#038;preview=true&#038;preview_id=381383",
  "description": "It just occurred to me as I was preparing to start writing this post that the volume of trademark conflicts I&#8217;ve seen in the craft beer industry seems to have finally calmed the hell down. There are still disputes, obviously, but it used to be that I could count on writing several posts a month [&#8230;]",
  "content:encoded": "<p>It just occurred to me as I was preparing to start writing this post that the volume of trademark conflicts I&#8217;ve seen in the <a href=\"https://www.techdirt.com/tag/beer/\">craft beer</a> industry seems to have finally calmed the hell down.  There are still disputes, obviously, but it used to be that I could count on writing several posts a month on the topic.  That&#8217;s a good thing and I almost certainly will go hunting around for information on why this is.</p>\n<p>But this post is, I guess, a reminder that dumb trademark disputes in the alcohol industries haven&#8217;t entirely gone away. Meet Steve White of England.  White is the owner of a tiny micro-brewery, Dark Sky Brewery. He had been a local police commissioner with a beer-brewing hobby, but he decided to make a business of it all and started selling a handful of craft IPAs under his business label.  When he tried to trademark the business&#8217; name, however, enormous macro-distiller Campari <a href=\"https://www.teesdalemercury.co.uk/news/storm-brewing-over-dark-sky-beer-trademark\">lodged a last-minute opposition</a> to the application.  Why?  Well&#8230;</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>New York-based lawyers for the firm said the name Dark Sky Brewery was too similar to Campari’s SKYY Vodka and would cause confusion.</em></p>\n<p><em>Mr White said: “Campari are trying to stop me. It’s utter rubbish. The way the process works companies have two months after they have registered the trademark to put in an objection. Solicitors in New York, acting for Campari, waited until the last day and lodged a formal objection. They are concerned that customers are going to confuse my beer for their SKYY Vodka. It’s a classic David and Goliath battle. I’m just a little one-man-band trying to brew beer for local people.”</em></p>\n</blockquote>\n<p>Where to begin. Well, let&#8217;s start with the most obvious thing: beer is not vodka. Trust me, dear reader, I&#8217;ve consumed more than my share of both.  Let&#8217;s add to that the fact that a cursory review of <a href=\"https://untappd.com/w/dark-sky-brewery/524241\">Dark Sky&#8217;s branding and labels</a> calls to mind absolutely nothing that would cause an association with Campari or Skyy Vodka.  And, oh by the way, White&#8217;s brewery isn&#8217;t even the only Dark Sky that exists in the beer industry. In fact, those New York lawyers could have looked far closer to home, towards <a href=\"https://www.darkskybrewing.com/\">Dark Sky Brewing Company in Arizona</a>.</p>\n<p>All of which is mostly besides the point. The names and branding between the two companies is different, as are the markets in which they play.  Beer isn&#8217;t vodka, again, and they aren&#8217;t sold on the same shelves in most instances.  That extra &#8220;Y&#8221; in Skyy Vodka also does a fair amount of work in terms of differentiation.  It&#8217;s hard to see this as anything other than pure bullying.</p>\n<p>Fortunately, it seems that in this case the victim of the bullying isn&#8217;t simply going to roll over.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>“I’m a start-up business and the Government want to encourage new business to grow. And here’s little old me in Middleton-in-Teesdale. It will cost me more money than I have but I am going to fight it. I could be looking at tens of thousands of pounds but I’m going to fight it. I have no doubt that customers who drink their vodka would be absolutely flabbergasted.”</em></p>\n</blockquote>\n<p>If they somehow thought beer was vodka, I would be, too.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/04/beer-isnt-vodka-skyy-vodka-people-going-after-dark-sky-brewery-over-tm/comments/feed/",
  "slash:comments": 6
}