{
  "title": "14: Overwhelming Feeling | RGSO Classic",
  "link": "https://audioboom.com/posts/8179016",
  "itunes:episode": 14,
  "itunes:title": "Overwhelming Feeling | RGSO Classic",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2015,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What was the overwhelming feeling that overtook a person shortly after the death of a loved one?<br>\nHere is a preview of the story. <br>\n“A couple of days go by, and I am leaving school, I am hit with this overwhelming sense of urgency. It was 8:30 at night and this thought just completely hit me when I was walking up the stairs to leave my school building. I had to stop for a second and catch my thoughts. I kept seeing the picture of my brother holding the baby in his arms over and repeatedly, and a voice inside my head was telling me: “He knows, he’s proud!” over and repeatedly. After a few minutes, it calmed down, but I was left confused and honestly weirded out. I realized then that I was the only one left in the building, so I got out and thought I was just tired and brushed it off.”<br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a>\n</div>\n",
  "pubDate": "Sun, 23 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-21:/posts/8179016",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}