{
  "title": "Great Companies Needed",
  "link": "https://freakonomics.com/2015/02/great-companies-needed/",
  "dc:creator": "Steven D. Levitt",
  "pubDate": "Wed, 11 Feb 2015 18:06:03 +0000",
  "category": [
    "Freakonomics Blog",
    "john list",
    "Summer Institute",
    "University of Chicago"
  ],
  "guid": "http://freakonomics.com/?p=109631",
  "description": "<p>My good friend and colleague <strong>John List</strong> has very ambitious summer plans.</p>\n<p>We’ve both believed for a long time that the combination of creative economic thinking and randomized experiments has the potential to revolutionize business and the non-profit sector. John and I have worked to foment that revolution through both  academic partnerships with firms as well as a project of John's called the <a href=\"http://spihub.org/\" target=\"_blank\" rel=\"noopener\">Science of Philanthropy Initiative (SPI)</a>, whose mission is \"evidence-based research on charitable giving.\"</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/02/great-companies-needed/\">Great Companies Needed</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>My good friend and colleague <strong>John List</strong> has very ambitious summer plans.</p>\n<p>We’ve both believed for a long time that the combination of creative economic thinking and randomized experiments has the potential to revolutionize business and the non-profit sector. John and I have worked to foment that revolution through both  academic partnerships with firms as well as a project of John&#8217;s called the <a href=\"http://spihub.org/\" target=\"_blank\" rel=\"noopener\">Science of Philanthropy Initiative (SPI)</a>, whose mission is &#8220;evidence-based research on charitable giving.&#8221;</p>\n<p>This summer, John is committed to taking that mission to a whole new level with the first annual <a href=\"http://sife.spihub.org/\" target=\"_blank\" rel=\"noopener\">University of Chicago Summer Institute on Field Experiments</a>.  The idea is to bring together for one week top economists, business leaders, and NGOs with the goal of developing powerful, creative solutions to the toughest problems faced by firms, whether for-profit or not-for-profit.</p>\n<p>In addition to lots of brainstorming and work focused on firms&#8217; problems, there will be presentations by John, me, and other leading scholars. Knowing John, I&#8217;m sure there will also be plenty of after-hours activities.</p>\n<p>Here’s how the website describes the sort of people we are looking for:</p>\n<blockquote><p><em>The Summer Institute is looking for practitioner partners who are open to new and bold ideas that will revolutionize the way they develop policy, do business, or provide charitable programming. Practitioner partners should be willing to work closely with researchers to field-test solutions, and must be willing to allow research publications to come from the partnership. We expect the Institute to serve as a catalyst for field-experiment research and strong researcher-practitioner partnerships.</em></p></blockquote>\n<p>So if you or someone you know might be a good candidate, please apply!  You can find the details on the <a href=\"http://sife.spihub.org/\" target=\"_blank\" rel=\"noopener\">Institute website</a>.</p>\n<p>We can’t wait to meet you and get started!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/02/great-companies-needed/\">Great Companies Needed</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}