{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-5231495697597721439",
  "published": "2022-11-02T21:13:00.002-05:00",
  "updated": "2022-11-02T21:13:17.303-05:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Ip on FTPL",
  "content": "<p>Greg Ip gives nice coverage of fiscal theory of the price level in the <a href=\"https://www.wsj.com/articles/to-solve-inflation-first-solve-deficits-this-theory-advises-11667391310\" target=\"_blank\">Wall Street Journal</a>..&nbsp;</p><p>I'm sad he left out <a href=\"https://www.sciencedirect.com/science/article/pii/030439329190007B\" target=\"_blank\">Eric Leeper's defining work</a>, which really even more than Sargent and Wallace started modern FTPL. Eric described monetary policy with interest rates, not money supplies, and integrated FTPL with the now dominant new-Keyensian tradition.&nbsp;</p><p>Naturally I'm a bit rankled by&nbsp;</p><blockquote><p>But FTPL is frustratingly difficult to apply to real life.&nbsp;</p></blockquote><p>and&nbsp;</p><blockquote><p>A theory that doesn’t predict inflation but explains it only after the fact by invoking hard-to-measure attitudes isn’t that satisfying, and certainly no better than mainstream macroeconomic models.</p></blockquote><p>Well, that also means no worse than mainstream models. And<a href=\"https://www.johnhcochrane.com/news-op-eds-all/inflation-nro\" target=\"_blank\"> I was publicly warning of inflation </a>in April 2021, though I'm too much of an academic to make much of one data point. The FTPL analysis of the ZLB is, I think more convincing.&nbsp;</p><p>Yes it would be nice if FTPL could tell you just when too much debt is too much. It would also be nice if the theory of finance could tell you just what a stock should be worth. And it would be nice if any theory, or the Fed itself, did a good job of predicting inflation.&nbsp;</p><p>A nice nugget,&nbsp;</p><blockquote><p>&nbsp;fiscal stimulus had some role in pushing inflation up, and as the Fed raises interest rates to combat that inflation, it will worsen deficits. Britain had to abandon deficit-financed tax cuts over fears they would drive inflation and interest rates higher. French Finance Minister Bruno Le Maire recently warned: “Central banks’ restrictive policies are ineffective if public finances continue to expand.”</p></blockquote><p>It seems we're all FTPLers now.&nbsp;</p><p>But I'm whining. For the length it's excellent. This is a hard topic and most journalists get things wrong. &nbsp;And I am grateful for the publicity.</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 5
}