{
  "title": "Episode 125: &#8220;Here Comes the Night&#8221; by Them",
  "link": "https://500songs.com/podcast/episode-125-here-comes-the-night-by-them/",
  "pubDate": "Fri, 18 Jun 2021 01:19:43 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=800",
  "description": "<p>Episode 125 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Here Comes the Night\", Them, the early career of Van Morrison, and the continuing success of Bert Berns.  Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a twenty-minute bonus episode available, <a href=\"https://www.patreon.com/posts/52643004\">on \"Dirty Water\" by the Standells</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I’ve created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-125-here-comes-the-night-by-them/\">a Mixcloud playlist</a>, with full versions of all the songs excerpted in this episode.</p>\n<p>The information about Bert Berns comes from <a href=\"https://amzn.to/3kyg4qH\"><em>Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues</em></a> by Joel Selvin.</p>\n<p>I've used two biographies of Van Morrison. <a href=\"https://amzn.to/3vzt9Vx\"><em>Van Morrison: Into the Music</em> by Ritchie Yorke</a> is so sycophantic towards Morrison that the word \"hagiography\" would be, if anything, an understatement. <a href=\"https://amzn.to/3zCIzLO\"><em>Van Morrison: No Surrender</em> by Johnny Rogan</a>, on the other hand, is the kind of book that talks in the introduction about how the author has had to avoid discussing certain topics because of legal threats from the subject.</p>\n<p>I also used information from the liner notes to <a href=\"https://amzn.to/3gyHeOD\"><em>The Complete Them 1964-1967</em></a>, which as the title suggests is a collection of all the recordings the group made while Van Morrison was in the band.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\nToday we're going to take a look at a band whose lead singer, sadly, is more controversial now than he was at the period we're looking at. I would normally not want to explicitly talk about current events upfront at the start of an episode, but Van Morrison has been in the headlines in the last few weeks for promoting dangerous conspiracy theories about covid, and has also been accused of perpetuating antisemitic stereotypes with a recent single.  So I would like to take this opportunity just to say that no positive comments I make about the Van Morrison of 1965 in this episode should be taken as any kind of approval of the Van Morrison of 2021 -- and this should also be taken as read for one of the similarly-controversial subjects of next week's episode...\n \nAnyway, that aside, today we're going to take a look at the first classic rock and roll records made by a band from Northern Ireland, and at the links between the British R&B scene and the American Brill Building. We're going to look at Van Morrison, Bert Berns, and \"Here Comes the Night\" by Them:\n \n[Excerpt: Them, \"Here Comes the Night\"]\n \nWhen we last looked at Bert Berns, he was just starting to gain some prominence in the East Coast recording scene with his productions for artists like Solomon Burke and the Isley Brothers. We've also, though it wasn't always made explicit, come across several of his productions when talking about other artists -- when Leiber and Stoller stopped working for Atlantic, Berns took over production of their artists, as well as all the other recordings he was making, and so many of the mid-sixties Drifters records we looked at in the episode on \"Stand By Me\" were Berns productions.\nBut while he was producing soul classics in New York, Berns was also becoming aware of the new music coming from the United Kingdom -- in early 1963 he started receiving large royalty cheques for a cover version of his song \"Twist and Shout\" by some English band he'd never heard of. He decided that there was a market here for his songs, and made a trip to the UK, where he linked up with Dick Rowe at Decca. \n \nWhile most of the money Berns had been making from \"Twist and Shout\" had been from the Beatles' version, a big chunk of it had also come from Brian Poole and the Tremeloes, the band that Rowe had signed to Decca instead of the Beatles. After the Beatles became big, the Tremeloes used the Beatles' arrangement of \"Twist and Shout\", which had been released on an album and an EP but not a single, and had a top ten hit with their own version of it:\n \n[Excerpt: Brian Poole and the Tremeloes, \"Twist and Shout\"]\n \nRowe was someone who kept an eye on the American market, and saw that Berns was a great source of potential hits. He brought Berns over to the UK, and linked him up with Larry Page, the manager who gave Rowe an endless supply of teen idols, and with Phil Solomon, an Irish manager who had been the publicist for the crooner Ruby Murray, and had recently brought Rowe the group The Bachelors, who had had a string of hits like \"Charmaine\":\n \n[Excerpt: The Bachelors, \"Charmaine\"]\n \nPage, Solomon, and Rowe were currently trying to promote something called \"Brum Beat\", as a Birmingham rival to Mersey beat, and so all the acts Berns worked with were from Birmingham. The most notable of these acts was one called Gerry Levene and the Avengers. Berns wrote and produced the B-side of that group's only single, with Levene backed by session musicians, but I've been unable to find a copy of that B-side anywhere in the digital domain. However, the A-side, which does exist and wasn't produced by Berns, is of some interest:\n \n[Excerpt: Gerry Levene and the Avengers, \"Dr. Feelgood\"]\n \nThe lineup of the band playing on that included guitarist Roy Wood, who would go on to be one of the most important and interesting British musicians of the later sixties and early seventies, and drummer Graeme Edge, who went on to join the Moody Blues. Apparently at another point, their drummer was John Bonham.\n \nNone of the tracks Berns recorded for Decca in 1963 had any real success, but Berns had made some useful contacts with Rowe and Solomon, and most importantly had met a British arranger, Mike Leander, who came over to the US to continue working with Berns, including providing the string arrangements for Berns' production of \"Under the Boardwalk\" for the Drifters:\n \n[Excerpt: The Drifters, \"Under the Boardwalk\"]\n \nIn May 1964, the month when that track was recorded, Berns was about the only person keeping Atlantic Records afloat -- we've already seen that they were having little success in the mid sixties, but in mid-May, even given the British Invasion taking over the charts, Berns had five records in the Hot One Hundred as either writer or producer -- the Beatles' version of \"Twist and Shout\" was the highest charting, but he also had hits with \"One Way Love\" by the Drifters:\n \n[Excerpt: The Drifters, \"One Way Love\"]\n \n\"That's When it Hurts\" by Ben E. King:\n \n[Excerpt: Ben E. King, \"That's When it Hurts\"]\n \n\"Goodbye Baby (Baby Goodbye)\" by Solomon Burke:\n \n[Excerpt: Solomon Burke, \"Goodbye Baby (Baby Goodbye)\"]\n \nAnd \"My Girl Sloopy\" by the Vibrations:\n \n[Excerpt: The Vibrations, \"My Girl Sloopy\"]\n \nAnd a week after the production of \"Under the Boardwalk\", Berns was back in the studio with Solomon Burke, producing Burke's classic \"Everybody Needs Somebody to Love\", though that track would lead to a major falling-out with Burke, as Berns and Atlantic executive Jerry Wexler took co-writing credit they hadn't earned on Burke's song -- Berns was finally at the point in his career where he was big enough that he could start stealing Black men's credits rather than having to earn them for himself:\n \n[Excerpt: Solomon Burke, \"Everybody Needs Somebody to Love\"]\n \nNot everything was a hit, of course -- he wrote a dance track with Mike Leander, \"Show Me Your Monkey\", which was definitely not a big hit -- but he had a strike rate that most other producers and writers would have killed for. And he was also having hits in the UK with the new British Invasion bands -- the Animals had made a big hit from \"Baby Let Me Take You Home\", the old folk tune that Berns had rewritten for Hoagy Lands. And he was still in touch with Phil Solomon and Dick Rowe, both of whom came over to New York for Berns' wedding in July.\n \nIt might have been while they were at the wedding that they first suggested to Berns that he might be interested in producing a new band that Solomon was managing, named Them, and in particular their lead singer, Van Morrison.\n \nVan Morrison was always a misfit, from his earliest days. He grew up in Belfast, a city that is notoriously divided along sectarian lines between a Catholic minority who (for the most part) want a united Ireland, and a Presbyterian majority who want Northern Ireland to remain part of the UK. But in a city where the joke goes that a Jewish person would be asked \"but are you a Catholic Jew or a Protestant Jew?\", Morrison was raised as a Jehovah's Witness, and for the rest of his life he would be resistant to fitting into any of the categories anyone tried to put him in, both for good and ill.\n \nWhile most of the musicians from the UK we've looked at so far have been from middle-class backgrounds, and generally attended art school, Morrison had gone to a secondary modern school, and left at fourteen to become a window cleaner. But he had an advantage that many of his contemporaries didn't -- he had relatives living in America and Canada, and his father had once spent a big chunk of time working in Detroit, where at one point the Morrison family planned to move. This exposed Morrison senior to all sorts of music that would not normally be heard in the UK, and he returned with a fascination for country and blues music, and built up a huge record collection. Young Van Morrison was brought up listening to Hank Williams, Sister Rosetta Tharpe,  Jimmie Rodgers, Louis Jordan, Jelly Roll Morton, and his particular favourite, Lead Belly. The first record he bought with his own money was \"Hootin' Blues\" by the Sonny Terry Trio:\n \n[Excerpt: The Sonny Terry Trio, \"Hootin' Blues\"]\n \nLike everyone, Van Morrison joined a skiffle group, but he became vastly more ambitious in 1959 when he visited a relative in Canada. His aunt smuggled him into a nightclub where an actual American rock and roll group were playing -- Ronnie Hawkins and the Hawks:\n \n[Excerpt: Ronnie Hawkins, \"Mary Lou\"]\n \nHawkins had been inspired to get into the music business by his uncle Delmar, a fiddle player whose son, Dale Hawkins, we looked at back in episode sixty-three. His band, the Hawks, had a reputation as the hottest band in Canada -- at this point they were still all Americans, but other than their drummer Levon Helm they would soon be replaced one by one with Canadian musicians, starting with bass player Robbie Robertson.\n \nMorrison was enthused and decided he was going to become a professional musician. He already played a bit of guitar, but started playing the saxophone too, as that was an instrument that would be more likely to get him work at this point.\n \nHe joined a showband called the Monarchs, as saxophone player and occasional vocalist. Showbands were a uniquely Irish phenomenon -- they were eight- or nine-piece groups, rhythm sections with a small horn section and usually a couple of different singers, who would play every kind of music for dancing, ranging from traditional pop to country and western to rock and roll, and would also perform choreographed dance routines and comedy sketches. \n \nThe Monarchs were never a successful band, but they managed to scrape a living playing the Irish showband circuit, and in the early sixties they travelled to Germany, where audiences of Black American servicemen wanted them to play more soulful music like songs by Ray Charles, an opportunity Morrison eagerly grabbed. It was also a Black American soldier who introduced Morrison to the music of Bobby Bland, whose \"Turn on Your Love Light\" was soon introduced to the band's set:\n \n[Excerpt Bobby \"Blue\" Bland, \"Turn on Your Love Light\"]\n \nBut they were still mostly having to play chart hits by Billy J Kramer or Gerry and the Pacemakers, and Morrison was getting frustrated. The Monarchs did get a chance to record a single in Germany, as Georgie and the Monarchs, with another member, George Jones (not the famous country singer) singing lead, but the results were not impressive:\n \n[Excerpt: Georgie and the Monarchs, \"O Twingy Baby\"]\n \nMorrison moved between several different showbands, but became increasingly dissatisfied with what he was doing. Then another showband he was in, the Manhattan Showband, briefly visited London, and Morrison and several of his bandmates went to a club called Studio 51, run by Ken Colyer. There they saw a band called The Downliners Sect, who had hair so long that the Manhattan members at first thought they were a girl group, until their lead singer came on stage wearing a deerstalker hat. The Downliners Sect played exactly the kind of aggressive R&B that Morrison thought he should be playing:\n \n[Excerpt: The Downliners Sect, \"Be a Sect Maniac\"]\n \nMorrison asked if he could sit in with the group on harmonica, but was refused -- and this was rather a pattern with the Downliners Sect, who had a habit of attracting harmonica players who wanted to be frontmen. Both Rod Stewart and Steve Marriott did play harmonica with the group for a while, and wanted to join full-time, but were refused as they clearly wanted to be lead singers and the group didn't need another one of them.\n \nOn returning to Belfast, Morrison decided that he needed to start his own R&B band, and his own R&B club night. At first he tried to put together a sort of supergroup of showband regulars, but most of the musicians he approached weren't interested in leaving their steady gigs. Eventually, he joined a band called the Gamblers, led by guitarist and vocalist Billy Harrison. The Gamblers had started out as an instrumental group, playing rock and roll in the style of Johnny and the Hurricanes, but they'd slowly been moving in a more R&B direction, and playing Chuck Berry and Bo Diddley material. Morrison joined the group on saxophone and vocals -- trading off leads with Harrison -- and the group renamed themselves after a monster movie from a few years before:\n \n[Excerpt: THEM! trailer]\n \nThe newly renamed Them took up a regular gig at the Maritime Hotel, a venue which had previously attracted a trad jazz crowd, and quickly grew a substantial local following. Van Morrison later often said that their residency at the Maritime was the only time Them were any good, but that period was remarkably short -- three months after their first gig, the group had been signed to a management, publishing, and production deal with Philip Solomon, who called in Dick Rowe to see them in Belfast. Rowe agreed to the same kind of licensing deal with Solomon that Andrew Oldham had already got from him for the Stones -- Them would record for Solomon's company, and Decca would license the recordings.\n \nThis also led to the first of the many, many, lineup changes that would bedevil the group for its short existence -- between 1964 and 1966 there were eighteen different members of the group. Eric Wrixon, the keyboard player, was still at school, and his parents didn't think he should become a musician, so while he came along to the first recording session, he didn't sign the contract because he wasn't allowed to stay with the group once his next term at school started. However, he wasn't needed -- while Them's guitarist and bass player were allowed to play on the records, Dick Rowe brought in session keyboard player Arthur Greenslade and drummer Bobby Graham -- the same musicians who had augmented the Kinks on their early singles -- to play with them.\n \nThe first single, a cover version of Slim Harpo's \"Don't Start Crying Now\", did precisely nothing commercially:\n \n[Excerpt: Them, \"Don't Start Crying Now\"]\n \nThe group started touring the UK, now as Decca recording artistes, but they almost immediately started to have clashes with their management. Phil Solomon was not used to aggressive teenage R&B musicians, and didn't appreciate things like them just not turning up for one gig they were booked for, saying to them \"The Bachelors never missed a date in their lives. One of them even had an accident on their way to do a pantomime in Bristol and went on with his leg in plaster and twenty-one stitches in his head.\"\n \nThem were not particularly interested in performing in pantomimes in Bristol, or anywhere else, but the British music scene was still intimately tied in with the older showbiz tradition, and Solomon had connections throughout that industry -- as well as owning a publishing and production company he was also a major shareholder in Radio Caroline, one of the pirate radio stations that broadcast from ships anchored just outside British territorial waters to avoid broadcasting regulations, and his father was a major shareholder in Decca itself. \n \nGiven Solomon's connections, it wasn't surprising that Them were chosen to be one of the Decca acts produced by Bert Berns on his next UK trip in August 1964. The track earmarked for their next single was their rearrangement of \"Baby Please Don't Go\", a Delta blues song that had originally been recorded in 1935 by Big Joe Williams and included on the Harry Smith Anthology:\n \n[Excerpt: Big Joe Williams' Washboard Blues Singers , \"Baby Please Don't Go\"]\n \nthough it's likely that Them had learned it from Muddy Waters' version, which is much closer to theirs:\n \n[Excerpt: Muddy Waters, \"Baby Please Don't Go\"]\n \nBert Berns helped the group tighten up their arrangement, which featured a new riff thought up by Billy Harrison, and he also brought in a session guitarist, Jimmy Page, to play rhythm guitar. Again he used a session drummer, this time Andy White who had played on \"Love Me Do\". Everyone agreed that the result was a surefire hit:\n \n[Excerpt: Them, \"Baby Please Don't Go\"]\n \nAt the session with Berns, Them cut several other songs, including some written by Berns, but it was eventually decided that the B-side should be a song of Morrison's, written in tribute to his dead cousin Gloria, which they'd recorded at their first session with Dick Rowe:\n \n[Excerpt: Them, \"Gloria\"]\n \n\"Baby Please Don't Go\" backed with \"Gloria\" was one of the great double-sided singles of the sixties, but it initially did nothing on the charts, and the group were getting depressed at their lack of success, Morrison and Harrison were constantly arguing as each thought of himself as the leader of the group, and the group's drummer quit in frustration. Pat McAuley, the group's new keyboard player, switched to drums, and brought in his brother Jackie to replace him on keyboards. \n \nTo make matters worse, while \"Baby Please Don't Go\" had flopped, the group had hoped that their next single would be one of the songs they'd recorded with Berns, a Berns song called \"Here Comes the Night\". Unfortunately for them, Berns had also recorded another version of it for Decca, this one with Lulu, a Scottish singer who had recently had a hit with a cover of the Isley Brothers' \"Shout!\", and her version was released as a single:\n \n[Excerpt: Lulu, \"Here Comes the Night\"]\n \nLuckily for Them, though unluckily for Lulu, her record didn't make the top forty, so there was still the potential for Them to release their version of it.\n \nPhil Solomon hadn't given up on \"Baby Please Don't Go\", though, and he began a media campaign for the record. He moved the group into the same London hotel where Jimmy Savile was staying -- Savile is now best known for his monstrous crimes, which I won't go into here except to say that you shouldn't google him if you don't know about them, but at the time he was Britain's most popular DJ, the presenter of Top of the Pops, the BBC's major TV pop show, and a columnist in a major newspaper. Savile started promoting Them, and they would later credit him with a big part of their success.\n \nBut Solomon was doing a lot of other things to promote the group as well. He part-owned Radio Caroline, and so \"Baby Please Don't Go\" went into regular rotation on the station. He called in a favour with the makers of Ready Steady Go! and got \"Baby Please Don't Go\" made into the show's new theme tune for two months, and soon the record, which had been a flop on its first release, crawled its way up into the top ten.\n \nFor the group's next single, Decca put out their version of \"Here Comes the Night\", and that was even more successful, making it all the way to number two on the charts, and making the American top thirty:\n \n[Excerpt: Them, \"Here Comes the Night\"]\n \nAs that was at its chart peak, the group also performed at the NME Poll-Winners' Party at Wembley Stadium, a show hosted by Savile and featuring The Moody Blues, Freddie and the Dreamers, Georgie Fame and the Blue Flames, Herman’s Hermits, Cilla Black, Donovan, The Searchers, Dusty Springfield, The Animals,The Kinks, the Rolling Stones, and the Beatles, among others. Even on that bill, reviewers singled out Them's seven-minute performance of Bobby Bland's \"Turn on Your Love Light\" for special praise, though watching the video of it it seems a relatively sloppy performance.\n \nBut the group were already starting to fall apart. Jackie McAuley was sacked from the group shortly after that Wembley show -- according to some of the group, because of his use of amphetamines, but it's telling that when the Protestant bass player Alan Henderson told the Catholic McAuley he was out of the group, he felt the need to emphasise that \"I've got nothing against\" -- and then use a term that's often regarded as an anti-Catholic slur...\n \nOn top of this, the group were also starting to get a bad reputation among the press -- they would simply refuse to answer questions, or answer them in monosyllables, or just swear at journalists. Where groups like the Rolling Stones carefully cultivated a \"bad boy\" image, but were doing so knowingly and within carefully delineated limits, Them were just unpleasant and rude because that's who they were.\n \nBert Berns came back to the UK to produce a couple of tracks for the group's first album, but he soon had to go back to America, as he had work to do there -- he'd just started up his own label, a rival to Red Bird, called BANG, which stood for Bert, Ahmet, Neshui, Gerald -- Berns had co-founded it with the Ertegun brothers and Jerry Wexler, though he soon took total control over it. BANG had just scored a big hit with \"I Want Candy\" by the Strangeloves, a song Berns had co-written:\n \n[Excerpt: The Strangeloves, \"I Want Candy\"]\n \nAnd the Strangeloves in turn had discovered a singer called Rick Derringer, and Bang put out a single by him under the name \"The McCoys\", using a backing track Berns had produced as a Strangeloves album track, their version of his earlier hit \"My Girl Sloopy\". The retitled \"Hang on Sloopy\" went to number one:\n \n[Excerpt: The McCoys, \"Hang on Sloopy\"]\n \nBerns was also getting interested in signing a young Brill Building songwriter named Neil Diamond...\nThe upshot was that rather than continuing to work with Berns, Them were instead handed over to Tommy Scott, an associate of Solomon's who'd sung backing vocals on \"Here Comes the Night\", but who was best known for having produced \"Terry\" by Twinkle:\n \n[Excerpt: Twinkle, \"Terry\"]\n \nThe group were not impressed with Scott's productions, and their next two singles flopped badly, not making the charts at all. Billy Harrison and Morrison were becoming less and less able to tolerate each other, and eventually Morrison and Henderson forced Harrison out. Pat McAuley quit two weeks later, \n \nThe McAuley brothers formed their own rival lineup of Them, which initially also featured Billy Harrison, though he soon left, and they got signed to a management contract with Reg Calvert, a rival of Solomon's who as well as managing several pop groups also owned Radio City, a pirate station that was in competition with Radio Caroline. Calvert registered the trademark in the name Them, something that Solomon had never done for the group, and suddenly there was a legal dispute over the name.\n \nSolomon retaliated by registering trademarks for the names \"The Fortunes\" and \"Pinkerton's Assorted Colours\" -- two groups Calvert managed -- and putting together rival versions of those groups. However the problem soon resolved itself, albeit tragically -- Calvert got into a huge row with Major Oliver Smedley, a failed right-libertarian politician who, when not co-founding the Institute for Economic Affairs and quitting the Liberal Party for their pro-European stance and left-wing economics, was one of Solomon's co-directors of Radio Caroline. Smedley shot Calvert, killing him, and successfully pled self-defence at his subsequent trial. The jury let Smedley off after only a minute of deliberation, and awarded Smedley two hundred and fifty guineas to pay for his costs.\n \nThe McAuley brothers' group renamed themselves to Them Belfast -- and the word beginning with g that some Romany people regard as a slur for their ethnic group -- and made some records, mostly only released in Sweden, produced by Kim Fowley, who would always look for any way to cash in on a hit record, and wrote \"Gloria's Dream\" for them:\n \n[Excerpt: Them Belfast G***ies, \"Gloria's Dream\"]\n \nMorrison and Henderson continued their group, and had a surprise hit in the US when Decca issued \"Mystic Eyes\", an album track they'd recorded for their first album, as a single in the US, and it made the top forty:\n \n[Excerpt: Them, \"Mystic Eyes\"]\n \nOn the back of that, Them toured the US, and got a long residency at the Whisky a Go-Go in LA, where they were supported by a whole string of the Sunset Strip's most exciting new bands -- Captain Beefheart and the Magic Band, The Association, Buffalo Springfield, and the Doors. The group became particularly friendly with the Doors, with the group's new guitarist getting thrown out of clubs with Jim Morrison for shouting \"Johnny Rivers is a wanker!\" at Rivers while Rivers was on stage, and Jim Morrison joining them on stage for duets, though the Doors were staggered at how much the Belfast group could drink -- their drink bill for their first week at the Whisky A Go-Go was $5400.\n \nAnd those expenses caused problems, because Van Morrison agreed before the tour started that he would be on a fixed salary, paid by Phil Solomon, and Solomon would get all the money from the promoters. But then Morrison found out how much Solomon was making, and decided that it wasn't fair that Solomon would get all that money when Morrison was only getting the comparatively small amount he'd agreed to. When Tommy Scott, who Solomon had sent over to look after the group on tour, tried to collect the takings from the promoters, he was told \"Van Morrison's already taken the money\". \n \nSolomon naturally dropped the group, who continued touring the US without any management, and sued them. Various Mafia types offered to take up the group's management contract, and even to have Solomon murdered, but the group ended up just falling apart. \n \nVan Morrison quit the group, and Alan Henderson struggled on for another five years with various different lineups of session men, recording albums as Them which nobody bought. He finally stopped performing as Them in 1972. He reunited with Billy Harrison and Eric Wrixon, the group's original keyboardist, in 1979, and they recorded another album and toured briefly. Wrixon later formed another lineup of Them, which for a while included Billy Harrison, and toured with that group, billed as Them The Belfast Blues Band, until Wrixon's death in 2015.\n \nMorrison, meanwhile, had other plans. Now that Them's two-year contract with Solomon was over, he wanted to have the solo career people had been telling him he deserved. And he knew how he was going to do it. All along, he'd thought that Bert Berns had been the only person in the music industry who understood him as an artist, and now of course Berns had his own record label. Van Morrison was going to sign to BANG Records, and he was going to work again with Bert Berns, the man who was making hits for everyone he worked with.\n \nBut the story of \"Brown-Eyed Girl\", and Van Morrison going solo, and the death of Bert Berns, is a story for another time...",
  "itunes:subtitle": "Episode 125 of A History of Rock Music in Five Hundred Songs looks at “Here Comes the Night, Them, the early career of Van Morrison, and the continuing success of Bert Berns.  Click the full post to read liner notes, links to more information, and a tran",
  "itunes:keywords": "Andy White,Atlantic Records,Bang Records,Ben E. King,Bert Berns,Dick Rowe,Jerry Wexler,Jim Morrison,Jimmy Page,Jimmy Savile,Ken Colyer,Kim Fowley,Larry Page,Levon Helm,Lulu,Mike Leander,Phil Solomon,pirate radio,Radio Caroline,Rod Stewart,Ronnie Hawkins,Roy Wood,Solomon Burke,Steve Marriott,The Doors,The Downliners Sect,The Drifters,The Hawks,Them,Van Morrison",
  "itunes:episode": 125,
  "content:encoded": "<p>Episode 125 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Here Comes the Night\", Them, the early career of Van Morrison, and the continuing success of Bert Berns.  Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a twenty-minute bonus episode available, <a href=\"https://www.patreon.com/posts/52643004\">on \"Dirty Water\" by the Standells</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>As usual, I’ve created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-125-here-comes-the-night-by-them/\">a Mixcloud playlist</a>, with full versions of all the songs excerpted in this episode.</p>\n<p>The information about Bert Berns comes from <a href=\"https://amzn.to/3kyg4qH\"><em>Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues</em></a> by Joel Selvin.</p>\n<p>I've used two biographies of Van Morrison. <a href=\"https://amzn.to/3vzt9Vx\"><em>Van Morrison: Into the Music</em> by Ritchie Yorke</a> is so sycophantic towards Morrison that the word \"hagiography\" would be, if anything, an understatement. <a href=\"https://amzn.to/3zCIzLO\"><em>Van Morrison: No Surrender</em> by Johnny Rogan</a>, on the other hand, is the kind of book that talks in the introduction about how the author has had to avoid discussing certain topics because of legal threats from the subject.</p>\n<p>I also used information from the liner notes to <a href=\"https://amzn.to/3gyHeOD\"><em>The Complete Them 1964-1967</em></a>, which as the title suggests is a collection of all the recordings the group made while Van Morrison was in the band.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\nToday we're going to take a look at a band whose lead singer, sadly, is more controversial now than he was at the period we're looking at. I would normally not want to explicitly talk about current events upfront at the start of an episode, but Van Morrison has been in the headlines in the last few weeks for promoting dangerous conspiracy theories about covid, and has also been accused of perpetuating antisemitic stereotypes with a recent single.  So I would like to take this opportunity just to say that no positive comments I make about the Van Morrison of 1965 in this episode should be taken as any kind of approval of the Van Morrison of 2021 -- and this should also be taken as read for one of the similarly-controversial subjects of next week's episode...\n \nAnyway, that aside, today we're going to take a look at the first classic rock and roll records made by a band from Northern Ireland, and at the links between the British R&B scene and the American Brill Building. We're going to look at Van Morrison, Bert Berns, and \"Here Comes the Night\" by Them:\n \n[Excerpt: Them, \"Here Comes the Night\"]\n \nWhen we last looked at Bert Berns, he was just starting to gain some prominence in the East Coast recording scene with his productions for artists like Solomon Burke and the Isley Brothers. We've also, though it wasn't always made explicit, come across several of his productions when talking about other artists -- when Leiber and Stoller stopped working for Atlantic, Berns took over production of their artists, as well as all the other recordings he was making, and so many of the mid-sixties Drifters records we looked at in the episode on \"Stand By Me\" were Berns productions.\nBut while he was producing soul classics in New York, Berns was also becoming aware of the new music coming from the United Kingdom -- in early 1963 he started receiving large royalty cheques for a cover version of his song \"Twist and Shout\" by some English band he'd never heard of. He decided that there was a market here for his songs, and made a trip to the UK, where he linked up with Dick Rowe at Decca. \n \nWhile most of the money Berns had been making from \"Twist and Shout\" had been from the Beatles' version, a big chunk of it had also come from Brian Poole and the Tremeloes, the band that Rowe had signed to Decca instead of the Beatles. After the Beatles became big, the Tremeloes used the Beatles' arrangement of \"Twist and Shout\", which had been released on an album and an EP but not a single, and had a top ten hit with their own version of it:\n \n[Excerpt: Brian Poole and the Tremeloes, \"Twist and Shout\"]\n \nRowe was someone who kept an eye on the American market, and saw that Berns was a great source of potential hits. He brought Berns over to the UK, and linked him up with Larry Page, the manager who gave Rowe an endless supply of teen idols, and with Phil Solomon, an Irish manager who had been the publicist for the crooner Ruby Murray, and had recently brought Rowe the group The Bachelors, who had had a string of hits like \"Charmaine\":\n \n[Excerpt: The Bachelors, \"Charmaine\"]\n \nPage, Solomon, and Rowe were currently trying to promote something called \"Brum Beat\", as a Birmingham rival to Mersey beat, and so all the acts Berns worked with were from Birmingham. The most notable of these acts was one called Gerry Levene and the Avengers. Berns wrote and produced the B-side of that group's only single, with Levene backed by session musicians, but I've been unable to find a copy of that B-side anywhere in the digital domain. However, the A-side, which does exist and wasn't produced by Berns, is of some interest:\n \n[Excerpt: Gerry Levene and the Avengers, \"Dr. Feelgood\"]\n \nThe lineup of the band playing on that included guitarist Roy Wood, who would go on to be one of the most important and interesting British musicians of the later sixties and early seventies, and drummer Graeme Edge, who went on to join the Moody Blues. Apparently at another point, their drummer was John Bonham.\n \nNone of the tracks Berns recorded for Decca in 1963 had any real success, but Berns had made some useful contacts with Rowe and Solomon, and most importantly had met a British arranger, Mike Leander, who came over to the US to continue working with Berns, including providing the string arrangements for Berns' production of \"Under the Boardwalk\" for the Drifters:\n \n[Excerpt: The Drifters, \"Under the Boardwalk\"]\n \nIn May 1964, the month when that track was recorded, Berns was about the only person keeping Atlantic Records afloat -- we've already seen that they were having little success in the mid sixties, but in mid-May, even given the British Invasion taking over the charts, Berns had five records in the Hot One Hundred as either writer or producer -- the Beatles' version of \"Twist and Shout\" was the highest charting, but he also had hits with \"One Way Love\" by the Drifters:\n \n[Excerpt: The Drifters, \"One Way Love\"]\n \n\"That's When it Hurts\" by Ben E. King:\n \n[Excerpt: Ben E. King, \"That's When it Hurts\"]\n \n\"Goodbye Baby (Baby Goodbye)\" by Solomon Burke:\n \n[Excerpt: Solomon Burke, \"Goodbye Baby (Baby Goodbye)\"]\n \nAnd \"My Girl Sloopy\" by the Vibrations:\n \n[Excerpt: The Vibrations, \"My Girl Sloopy\"]\n \nAnd a week after the production of \"Under the Boardwalk\", Berns was back in the studio with Solomon Burke, producing Burke's classic \"Everybody Needs Somebody to Love\", though that track would lead to a major falling-out with Burke, as Berns and Atlantic executive Jerry Wexler took co-writing credit they hadn't earned on Burke's song -- Berns was finally at the point in his career where he was big enough that he could start stealing Black men's credits rather than having to earn them for himself:\n \n[Excerpt: Solomon Burke, \"Everybody Needs Somebody to Love\"]\n \nNot everything was a hit, of course -- he wrote a dance track with Mike Leander, \"Show Me Your Monkey\", which was definitely not a big hit -- but he had a strike rate that most other producers and writers would have killed for. And he was also having hits in the UK with the new British Invasion bands -- the Animals had made a big hit from \"Baby Let Me Take You Home\", the old folk tune that Berns had rewritten for Hoagy Lands. And he was still in touch with Phil Solomon and Dick Rowe, both of whom came over to New York for Berns' wedding in July.\n \nIt might have been while they were at the wedding that they first suggested to Berns that he might be interested in producing a new band that Solomon was managing, named Them, and in particular their lead singer, Van Morrison.\n \nVan Morrison was always a misfit, from his earliest days. He grew up in Belfast, a city that is notoriously divided along sectarian lines between a Catholic minority who (for the most part) want a united Ireland, and a Presbyterian majority who want Northern Ireland to remain part of the UK. But in a city where the joke goes that a Jewish person would be asked \"but are you a Catholic Jew or a Protestant Jew?\", Morrison was raised as a Jehovah's Witness, and for the rest of his life he would be resistant to fitting into any of the categories anyone tried to put him in, both for good and ill.\n \nWhile most of the musicians from the UK we've looked at so far have been from middle-class backgrounds, and generally attended art school, Morrison had gone to a secondary modern school, and left at fourteen to become a window cleaner. But he had an advantage that many of his contemporaries didn't -- he had relatives living in America and Canada, and his father had once spent a big chunk of time working in Detroit, where at one point the Morrison family planned to move. This exposed Morrison senior to all sorts of music that would not normally be heard in the UK, and he returned with a fascination for country and blues music, and built up a huge record collection. Young Van Morrison was brought up listening to Hank Williams, Sister Rosetta Tharpe,  Jimmie Rodgers, Louis Jordan, Jelly Roll Morton, and his particular favourite, Lead Belly. The first record he bought with his own money was \"Hootin' Blues\" by the Sonny Terry Trio:\n \n[Excerpt: The Sonny Terry Trio, \"Hootin' Blues\"]\n \nLike everyone, Van Morrison joined a skiffle group, but he became vastly more ambitious in 1959 when he visited a relative in Canada. His aunt smuggled him into a nightclub where an actual American rock and roll group were playing -- Ronnie Hawkins and the Hawks:\n \n[Excerpt: Ronnie Hawkins, \"Mary Lou\"]\n \nHawkins had been inspired to get into the music business by his uncle Delmar, a fiddle player whose son, Dale Hawkins, we looked at back in episode sixty-three. His band, the Hawks, had a reputation as the hottest band in Canada -- at this point they were still all Americans, but other than their drummer Levon Helm they would soon be replaced one by one with Canadian musicians, starting with bass player Robbie Robertson.\n \nMorrison was enthused and decided he was going to become a professional musician. He already played a bit of guitar, but started playing the saxophone too, as that was an instrument that would be more likely to get him work at this point.\n \nHe joined a showband called the Monarchs, as saxophone player and occasional vocalist. Showbands were a uniquely Irish phenomenon -- they were eight- or nine-piece groups, rhythm sections with a small horn section and usually a couple of different singers, who would play every kind of music for dancing, ranging from traditional pop to country and western to rock and roll, and would also perform choreographed dance routines and comedy sketches. \n \nThe Monarchs were never a successful band, but they managed to scrape a living playing the Irish showband circuit, and in the early sixties they travelled to Germany, where audiences of Black American servicemen wanted them to play more soulful music like songs by Ray Charles, an opportunity Morrison eagerly grabbed. It was also a Black American soldier who introduced Morrison to the music of Bobby Bland, whose \"Turn on Your Love Light\" was soon introduced to the band's set:\n \n[Excerpt Bobby \"Blue\" Bland, \"Turn on Your Love Light\"]\n \nBut they were still mostly having to play chart hits by Billy J Kramer or Gerry and the Pacemakers, and Morrison was getting frustrated. The Monarchs did get a chance to record a single in Germany, as Georgie and the Monarchs, with another member, George Jones (not the famous country singer) singing lead, but the results were not impressive:\n \n[Excerpt: Georgie and the Monarchs, \"O Twingy Baby\"]\n \nMorrison moved between several different showbands, but became increasingly dissatisfied with what he was doing. Then another showband he was in, the Manhattan Showband, briefly visited London, and Morrison and several of his bandmates went to a club called Studio 51, run by Ken Colyer. There they saw a band called The Downliners Sect, who had hair so long that the Manhattan members at first thought they were a girl group, until their lead singer came on stage wearing a deerstalker hat. The Downliners Sect played exactly the kind of aggressive R&B that Morrison thought he should be playing:\n \n[Excerpt: The Downliners Sect, \"Be a Sect Maniac\"]\n \nMorrison asked if he could sit in with the group on harmonica, but was refused -- and this was rather a pattern with the Downliners Sect, who had a habit of attracting harmonica players who wanted to be frontmen. Both Rod Stewart and Steve Marriott did play harmonica with the group for a while, and wanted to join full-time, but were refused as they clearly wanted to be lead singers and the group didn't need another one of them.\n \nOn returning to Belfast, Morrison decided that he needed to start his own R&B band, and his own R&B club night. At first he tried to put together a sort of supergroup of showband regulars, but most of the musicians he approached weren't interested in leaving their steady gigs. Eventually, he joined a band called the Gamblers, led by guitarist and vocalist Billy Harrison. The Gamblers had started out as an instrumental group, playing rock and roll in the style of Johnny and the Hurricanes, but they'd slowly been moving in a more R&B direction, and playing Chuck Berry and Bo Diddley material. Morrison joined the group on saxophone and vocals -- trading off leads with Harrison -- and the group renamed themselves after a monster movie from a few years before:\n \n[Excerpt: THEM! trailer]\n \nThe newly renamed Them took up a regular gig at the Maritime Hotel, a venue which had previously attracted a trad jazz crowd, and quickly grew a substantial local following. Van Morrison later often said that their residency at the Maritime was the only time Them were any good, but that period was remarkably short -- three months after their first gig, the group had been signed to a management, publishing, and production deal with Philip Solomon, who called in Dick Rowe to see them in Belfast. Rowe agreed to the same kind of licensing deal with Solomon that Andrew Oldham had already got from him for the Stones -- Them would record for Solomon's company, and Decca would license the recordings.\n \nThis also led to the first of the many, many, lineup changes that would bedevil the group for its short existence -- between 1964 and 1966 there were eighteen different members of the group. Eric Wrixon, the keyboard player, was still at school, and his parents didn't think he should become a musician, so while he came along to the first recording session, he didn't sign the contract because he wasn't allowed to stay with the group once his next term at school started. However, he wasn't needed -- while Them's guitarist and bass player were allowed to play on the records, Dick Rowe brought in session keyboard player Arthur Greenslade and drummer Bobby Graham -- the same musicians who had augmented the Kinks on their early singles -- to play with them.\n \nThe first single, a cover version of Slim Harpo's \"Don't Start Crying Now\", did precisely nothing commercially:\n \n[Excerpt: Them, \"Don't Start Crying Now\"]\n \nThe group started touring the UK, now as Decca recording artistes, but they almost immediately started to have clashes with their management. Phil Solomon was not used to aggressive teenage R&B musicians, and didn't appreciate things like them just not turning up for one gig they were booked for, saying to them \"The Bachelors never missed a date in their lives. One of them even had an accident on their way to do a pantomime in Bristol and went on with his leg in plaster and twenty-one stitches in his head.\"\n \nThem were not particularly interested in performing in pantomimes in Bristol, or anywhere else, but the British music scene was still intimately tied in with the older showbiz tradition, and Solomon had connections throughout that industry -- as well as owning a publishing and production company he was also a major shareholder in Radio Caroline, one of the pirate radio stations that broadcast from ships anchored just outside British territorial waters to avoid broadcasting regulations, and his father was a major shareholder in Decca itself. \n \nGiven Solomon's connections, it wasn't surprising that Them were chosen to be one of the Decca acts produced by Bert Berns on his next UK trip in August 1964. The track earmarked for their next single was their rearrangement of \"Baby Please Don't Go\", a Delta blues song that had originally been recorded in 1935 by Big Joe Williams and included on the Harry Smith Anthology:\n \n[Excerpt: Big Joe Williams' Washboard Blues Singers , \"Baby Please Don't Go\"]\n \nthough it's likely that Them had learned it from Muddy Waters' version, which is much closer to theirs:\n \n[Excerpt: Muddy Waters, \"Baby Please Don't Go\"]\n \nBert Berns helped the group tighten up their arrangement, which featured a new riff thought up by Billy Harrison, and he also brought in a session guitarist, Jimmy Page, to play rhythm guitar. Again he used a session drummer, this time Andy White who had played on \"Love Me Do\". Everyone agreed that the result was a surefire hit:\n \n[Excerpt: Them, \"Baby Please Don't Go\"]\n \nAt the session with Berns, Them cut several other songs, including some written by Berns, but it was eventually decided that the B-side should be a song of Morrison's, written in tribute to his dead cousin Gloria, which they'd recorded at their first session with Dick Rowe:\n \n[Excerpt: Them, \"Gloria\"]\n \n\"Baby Please Don't Go\" backed with \"Gloria\" was one of the great double-sided singles of the sixties, but it initially did nothing on the charts, and the group were getting depressed at their lack of success, Morrison and Harrison were constantly arguing as each thought of himself as the leader of the group, and the group's drummer quit in frustration. Pat McAuley, the group's new keyboard player, switched to drums, and brought in his brother Jackie to replace him on keyboards. \n \nTo make matters worse, while \"Baby Please Don't Go\" had flopped, the group had hoped that their next single would be one of the songs they'd recorded with Berns, a Berns song called \"Here Comes the Night\". Unfortunately for them, Berns had also recorded another version of it for Decca, this one with Lulu, a Scottish singer who had recently had a hit with a cover of the Isley Brothers' \"Shout!\", and her version was released as a single:\n \n[Excerpt: Lulu, \"Here Comes the Night\"]\n \nLuckily for Them, though unluckily for Lulu, her record didn't make the top forty, so there was still the potential for Them to release their version of it.\n \nPhil Solomon hadn't given up on \"Baby Please Don't Go\", though, and he began a media campaign for the record. He moved the group into the same London hotel where Jimmy Savile was staying -- Savile is now best known for his monstrous crimes, which I won't go into here except to say that you shouldn't google him if you don't know about them, but at the time he was Britain's most popular DJ, the presenter of Top of the Pops, the BBC's major TV pop show, and a columnist in a major newspaper. Savile started promoting Them, and they would later credit him with a big part of their success.\n \nBut Solomon was doing a lot of other things to promote the group as well. He part-owned Radio Caroline, and so \"Baby Please Don't Go\" went into regular rotation on the station. He called in a favour with the makers of Ready Steady Go! and got \"Baby Please Don't Go\" made into the show's new theme tune for two months, and soon the record, which had been a flop on its first release, crawled its way up into the top ten.\n \nFor the group's next single, Decca put out their version of \"Here Comes the Night\", and that was even more successful, making it all the way to number two on the charts, and making the American top thirty:\n \n[Excerpt: Them, \"Here Comes the Night\"]\n \nAs that was at its chart peak, the group also performed at the NME Poll-Winners' Party at Wembley Stadium, a show hosted by Savile and featuring The Moody Blues, Freddie and the Dreamers, Georgie Fame and the Blue Flames, Herman’s Hermits, Cilla Black, Donovan, The Searchers, Dusty Springfield, The Animals,The Kinks, the Rolling Stones, and the Beatles, among others. Even on that bill, reviewers singled out Them's seven-minute performance of Bobby Bland's \"Turn on Your Love Light\" for special praise, though watching the video of it it seems a relatively sloppy performance.\n \nBut the group were already starting to fall apart. Jackie McAuley was sacked from the group shortly after that Wembley show -- according to some of the group, because of his use of amphetamines, but it's telling that when the Protestant bass player Alan Henderson told the Catholic McAuley he was out of the group, he felt the need to emphasise that \"I've got nothing against\" -- and then use a term that's often regarded as an anti-Catholic slur...\n \nOn top of this, the group were also starting to get a bad reputation among the press -- they would simply refuse to answer questions, or answer them in monosyllables, or just swear at journalists. Where groups like the Rolling Stones carefully cultivated a \"bad boy\" image, but were doing so knowingly and within carefully delineated limits, Them were just unpleasant and rude because that's who they were.\n \nBert Berns came back to the UK to produce a couple of tracks for the group's first album, but he soon had to go back to America, as he had work to do there -- he'd just started up his own label, a rival to Red Bird, called BANG, which stood for Bert, Ahmet, Neshui, Gerald -- Berns had co-founded it with the Ertegun brothers and Jerry Wexler, though he soon took total control over it. BANG had just scored a big hit with \"I Want Candy\" by the Strangeloves, a song Berns had co-written:\n \n[Excerpt: The Strangeloves, \"I Want Candy\"]\n \nAnd the Strangeloves in turn had discovered a singer called Rick Derringer, and Bang put out a single by him under the name \"The McCoys\", using a backing track Berns had produced as a Strangeloves album track, their version of his earlier hit \"My Girl Sloopy\". The retitled \"Hang on Sloopy\" went to number one:\n \n[Excerpt: The McCoys, \"Hang on Sloopy\"]\n \nBerns was also getting interested in signing a young Brill Building songwriter named Neil Diamond...\nThe upshot was that rather than continuing to work with Berns, Them were instead handed over to Tommy Scott, an associate of Solomon's who'd sung backing vocals on \"Here Comes the Night\", but who was best known for having produced \"Terry\" by Twinkle:\n \n[Excerpt: Twinkle, \"Terry\"]\n \nThe group were not impressed with Scott's productions, and their next two singles flopped badly, not making the charts at all. Billy Harrison and Morrison were becoming less and less able to tolerate each other, and eventually Morrison and Henderson forced Harrison out. Pat McAuley quit two weeks later, \n \nThe McAuley brothers formed their own rival lineup of Them, which initially also featured Billy Harrison, though he soon left, and they got signed to a management contract with Reg Calvert, a rival of Solomon's who as well as managing several pop groups also owned Radio City, a pirate station that was in competition with Radio Caroline. Calvert registered the trademark in the name Them, something that Solomon had never done for the group, and suddenly there was a legal dispute over the name.\n \nSolomon retaliated by registering trademarks for the names \"The Fortunes\" and \"Pinkerton's Assorted Colours\" -- two groups Calvert managed -- and putting together rival versions of those groups. However the problem soon resolved itself, albeit tragically -- Calvert got into a huge row with Major Oliver Smedley, a failed right-libertarian politician who, when not co-founding the Institute for Economic Affairs and quitting the Liberal Party for their pro-European stance and left-wing economics, was one of Solomon's co-directors of Radio Caroline. Smedley shot Calvert, killing him, and successfully pled self-defence at his subsequent trial. The jury let Smedley off after only a minute of deliberation, and awarded Smedley two hundred and fifty guineas to pay for his costs.\n \nThe McAuley brothers' group renamed themselves to Them Belfast -- and the word beginning with g that some Romany people regard as a slur for their ethnic group -- and made some records, mostly only released in Sweden, produced by Kim Fowley, who would always look for any way to cash in on a hit record, and wrote \"Gloria's Dream\" for them:\n \n[Excerpt: Them Belfast G***ies, \"Gloria's Dream\"]\n \nMorrison and Henderson continued their group, and had a surprise hit in the US when Decca issued \"Mystic Eyes\", an album track they'd recorded for their first album, as a single in the US, and it made the top forty:\n \n[Excerpt: Them, \"Mystic Eyes\"]\n \nOn the back of that, Them toured the US, and got a long residency at the Whisky a Go-Go in LA, where they were supported by a whole string of the Sunset Strip's most exciting new bands -- Captain Beefheart and the Magic Band, The Association, Buffalo Springfield, and the Doors. The group became particularly friendly with the Doors, with the group's new guitarist getting thrown out of clubs with Jim Morrison for shouting \"Johnny Rivers is a wanker!\" at Rivers while Rivers was on stage, and Jim Morrison joining them on stage for duets, though the Doors were staggered at how much the Belfast group could drink -- their drink bill for their first week at the Whisky A Go-Go was $5400.\n \nAnd those expenses caused problems, because Van Morrison agreed before the tour started that he would be on a fixed salary, paid by Phil Solomon, and Solomon would get all the money from the promoters. But then Morrison found out how much Solomon was making, and decided that it wasn't fair that Solomon would get all that money when Morrison was only getting the comparatively small amount he'd agreed to. When Tommy Scott, who Solomon had sent over to look after the group on tour, tried to collect the takings from the promoters, he was told \"Van Morrison's already taken the money\". \n \nSolomon naturally dropped the group, who continued touring the US without any management, and sued them. Various Mafia types offered to take up the group's management contract, and even to have Solomon murdered, but the group ended up just falling apart. \n \nVan Morrison quit the group, and Alan Henderson struggled on for another five years with various different lineups of session men, recording albums as Them which nobody bought. He finally stopped performing as Them in 1972. He reunited with Billy Harrison and Eric Wrixon, the group's original keyboardist, in 1979, and they recorded another album and toured briefly. Wrixon later formed another lineup of Them, which for a while included Billy Harrison, and toured with that group, billed as Them The Belfast Blues Band, until Wrixon's death in 2015.\n \nMorrison, meanwhile, had other plans. Now that Them's two-year contract with Solomon was over, he wanted to have the solo career people had been telling him he deserved. And he knew how he was going to do it. All along, he'd thought that Bert Berns had been the only person in the music industry who understood him as an artist, and now of course Berns had his own record label. Van Morrison was going to sign to BANG Records, and he was going to work again with Bert Berns, the man who was making hits for everyone he worked with.\n \nBut the story of \"Brown-Eyed Girl\", and Van Morrison going solo, and the death of Bert Berns, is a story for another time...",
  "enclosure": "",
  "itunes:summary": "Episode 125 of A History of Rock Music in Five Hundred Songs looks at “Here Comes the Night\", Them, the early career of Van Morrison, and the continuing success of Bert Berns.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a twenty-minute bonus episode available, on \"Dirty Water\" by the Standells.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual, I’ve created a Mixcloud playlist, with full versions of all the songs excerpted in this episode.\nThe information about Bert Berns comes from Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues by Joel Selvin.\nI've used two biographies of Van Morrison. Van Morrison: Into the Music by Ritchie Yorke is so sycophantic towards Morrison that the word \"hagiography\" would be, if anything, an understatement. Van Morrison: No Surrender by Johnny Rogan, on the other hand, is the kind of book that talks in the introduction about how the author has had to avoid discussing certain topics because of legal threats from the subject.\nI also used information from the liner notes to The Complete Them 1964-1967, which as the title suggests is a collection of all the recordings the group made while Van Morrison was in the band.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nToday we're going to take a look at a band whose lead singer, sadly, is more controversial now than he was at the period we're looking at. I would normally not want to explicitly talk about current events upfront at the start of an episode, but Van Morrison has been in the headlines in the last few weeks for promoting dangerous conspiracy theories about covid, and has also been accused of perpetuating antisemitic stereotypes with a recent single.  So I would like to take this opportunity just to say that no positive comments I make about the Van Morrison of 1965 in this episode should be taken as any kind of approval of the Van Morrison of 2021 -- and this should also be taken as read for one of the similarly-controversial subjects of next week's episode...\n \nAnyway, that aside, today we're going to take a look at the first classic rock and roll records made by a band from Northern Ireland, and at the links between the British R&B scene and the American Brill Building. We're going to look at Van Morrison, Bert Berns, and \"Here Comes the Night\" by Them:\n \n[Excerpt: Them, \"Here Comes the Night\"]\n \nWhen we last looked at Bert Berns, he was just starting to gain some prominence in the East Coast recording scene with his productions for artists like Solomon Burke and the Isley Brothers. We've also, though it wasn't always made explicit, come across several of his productions when talking about other artists -- when Leiber and Stoller stopped working for Atlantic, Berns took over production of their artists, as well as all the other recordings he was making, and so many of the mid-sixties Drifters records we looked at in the episode on \"Stand By Me\" were Berns productions.\nBut while he was producing soul classics in New York, Berns was also becoming aware of the new music coming from the United Kingdom -- in early 1963 he started receiving large royalty cheques for a cover version of his song \"Twist and Shout\" by some English band he'd never heard of. He decided that there was a market here for his songs, and made a trip to the UK, where he linked up with Dick Rowe at Decca. \n \nWhile most of the money Berns had been making from \"Twist and Shout\" had been from the Beatles' version, a big chunk of it had also come from Brian Poole and the Tremeloes, the band that Rowe had signed to Decca instead of the Beatles. After the Beatles became big, the Tremeloes used the Beat",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 125 of A History of Rock Music in Five Hundred Songs looks at “Here Comes the Night\", Them, the early career of Van Morrison, and the continuing success of Bert Berns.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a twenty-minute bonus episode available, on \"Dirty Water\" by the Standells.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nAs usual, I’ve created a Mixcloud playlist, with full versions of all the songs excerpted in this episode.\nThe information about Bert Berns comes from Here Comes the Night: The Dark Soul of Bert Berns and the Dirty Business of Rhythm and Blues by Joel Selvin.\nI've used two biographies of Van Morrison. Van Morrison: Into the Music by Ritchie Yorke is so sycophantic towards Morrison that",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}