{
  "id": "https://bibleinoneyear.org/en/youth/285",
  "title": "Day 285: Dare to Be Different",
  "description": "Psalm 119:18-24, Jeremiah 26:13-15, 1 Thessalonians 5:5–24.  Dare to be different, by being like him  Don’t follow what the world tells you is desirable, but follow God by becoming more Christ-like",
  "pubDate": "Tue, 12 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/285/?ignore",
  "itunes:duration": "13:04",
  "guid": "enyouth12102021-285",
  "length": 784.27,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 285: Dare to Be Different",
  "itunes:subtitle": "Psalm 119:18-24, Jeremiah 26:13-15, 1 Thessalonians 5:5–24.  Dare to be different, by being like him  Don’t follow what the world tells you is desirable, but follow God by becoming more Christ-like",
  "itunes:summary": "I once had the privilege of meeting and interviewing Pastor Nadarkhani. Youcef Nadarkhani encountered Jesus Christ at the age of nineteen. He went on to become an ordained pastor and lead a church in Iran.\nIn 2010, aged thirty-two, married with two young children, he was arrested and sentenced to death for ‘apostasy’ (converting to Christianity from Islam). Thankfully, two years later, after sustained international pressure, the decision was reversed.\nDuring his trial, Pastor Nadarkhani refused to recant his belief despite facing a death sentence. He told the judge, ‘I am resolute in my faith and Christianity and have no wish to recant.’ The then UK Foreign Secretary, William Hague, paid tribute to his courage. The Guardian newspaper described him as ‘an inspiringly brave Christian’. Pastor Nadarkhani, like many Christians around the world today, still faces persecution for his faith.*\nJesus gives us a picture of true humanity. Dare to be different, by being like him. Don’t follow what the world tells you is desirable, but follow God by becoming more Christ-like.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 285
}