{
  "title": "Episode #348:  Charges Of Hypocrisy And Betrayal In The Carolinas",
  "link": "https://www.krpoliticaljunkie.com/episode-348-charges-of-hypocrisy-and-betrayal-in-the-carolinas/",
  "pubDate": "Thu, 15 Oct 2020 19:53:05 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=18144",
  "description": "<p>Two Senate races in the Carolinas are the focus this week, as incumbent Republican Lindsey Graham of South Carolina is trying to hold off a stiff challenge from Democrat Jamie Harrison, while in North Carolina, marital infidelity charges leveled at Democrat Cal Cunningham could jeopardize his chances against GOP Sen. Thom Tillis.   </p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-348-charges-of-hypocrisy-and-betrayal-in-the-carolinas/\">Episode #348:  Charges Of Hypocrisy And Betrayal In The Carolinas</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Two Senate races in the Carolinas are the focus this week, as incumbent Republican Lindsey Graham of South Carolina is trying to hold off a stiff challenge from Democrat Jamie Harrison, while in North Carolina,",
  "itunes:summary": "Of the 23 Republican Senate seats up this year, the one held by North Carolina&#8217;s Thom Tillis was always going to be hotly contested.  But few thought that Lindsey Graham&#8217;s seat in South Carolina would become a barn-burner, which it has.  Jamie Lovegrove of the Post and Courier of Charleston reports on how Democrat Jamie Harrison, armed with record-breaking money totals, has a chance of becoming the first to oust a GOP senator in South Carolina history.  And Jeff Tiberii of radio station WUNC wonders whether late adultery charges leveled against Democrat Cal Cunningham will jeopardize what had looked like a good shot at knocking off Tillis.<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 348,
  "itunes:title": "Charges Of Hypocrisy And Betrayal In The Carolinas",
  "itunes:duration": "37:54"
}