{
  "title": "HASH: a free, online platform for modeling the world",
  "link": "https://www.joelonsoftware.com/2020/06/18/hash-a-free-online-platform-for-modeling-the-world/",
  "dc:creator": "Joel Spolsky",
  "pubDate": "Thu, 18 Jun 2020 14:12:25 +0000",
  "category": "News",
  "guid": "https://www.joelonsoftware.com/?p=3701",
  "description": "Sometimes simulating complex systems is the best way to understand them. <span class=\"read-more\"><a class=\"more-link\" href=\"https://www.joelonsoftware.com/2020/06/18/hash-a-free-online-platform-for-modeling-the-world/\" rel=\"bookmark\">Read more <span class=\"screen-reader-text\">\"HASH: a free, online platform for modeling the world\"</span></a></span>",
  "content:encoded": "\n<p>Sometimes when you&#8217;re trying to figure out the way the world works, basic math is enough to get you going. If we increase the hot water flow by <em>x</em>, the temperature of the mixture goes up by <em>y</em>. </p>\n\n\n\n<p>Sometimes you&#8217;re working on something that&#8217;s just too complicated for that, and you can&#8217;t even begin to guess how the inputs affect the outputs. At the warehouse, everything seems to go fine when you have less than four employees, but when you hit five employees, they get in each others&#8217; way so much that the fifth employee effectively does no additional work.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"730\" height=\"512\" src=\"https://i0.wp.com/www.joelonsoftware.com/wp-content/uploads/2020/06/5ec6e31a68c106c99a6c6836.gif?resize=730%2C512&#038;ssl=1\" alt=\"\" class=\"wp-image-3702\" data-recalc-dims=\"1\"/></figure>\n\n\n\n<p>You may not understand the relationship between the number of employees and the throughput of the warehouse, but you definitely know what everybody is doing. If you can imagine writing a little bit of JavaScript code to simulate the behavior of each of your workers, you can run a simulation and see what actually happens. You can tweak the parameters and the rules the employees follow to see how it would help, and you can really gain some traction understanding, and then solving, very complex problems.</p>\n\n\n\n<p>That&#8217;s what <a href=\"https://hash.ai/\">hash.ai</a> is all about. Read David&#8217;s <a href=\"https://hash.ai/about/mission\">launch blog post</a>, then try building your own simulations!</p>\n",
  "post-id": 3701
}