{
  "title": "519: The Most Shocking Moments in Fandom History, Part 1: JKR v The Lexicon, The Deathly Hallows Split, Pottermore",
  "link": "https://audioboom.com/posts/7895049",
  "itunes:episode": 519,
  "itunes:title": "The Most Shocking Moments in Fandom History, Part 1: JKR v The Lexicon, The Deathly Hallows Split, Pottermore",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4178,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome back Andy, of <a href=\"http://www.harrypotterfanzone.com\">Harry Potter Fan Zone</a> (and <a href=\"http://www.PotterNoMore.com\">PotterNoMore.com</a>)!</li>\n<li>This is Part 1 of a two-part episode, wherein the hosts discuss the most Shocking Moments in Harry Potter Fandom History.</li>\n<li>First up: In 2005, JK Rowling invites fan site heads Emerson and Melissa <a href=\"https://www.mugglenet.com/j-k-rowling/jkr-interview-mugglenet-leaky-cauldron/\">to her house</a>!</li>\n<li>In 2007, before <em>Deathly Hallows</em> and high-speed internet, a live stream revealed a new Harry Potter theme park! What was the significance of a Potter-themed park at the time?</li>\n<li>...but Andy had already been to a Harry Potter theme park, down in Australia, called Warner Bros. \"Movie World\"!</li>\n<li>Also in 2007, JKR Fan Site Award winner The HP Lexicon was taken to court by JKR/WB over their plans for a book. How did this feel to us as fellow fan site workers?</li>\n<li>The split that changed it all: How WB's decision to break up <em>The Deathly Hallows</em> changed history and set the bar for future film franchises to come.</li>\n<li>Half-Blood Prince's unexpected release date postponement disappointed fans like few things had at the time. Andrew had made a <a href=\"https://www.youtube.com/watch?v=3tXUH5FUIl4\">reaction video</a> and a <a href=\"https://www.youtube.com/watch?v=jkSK1l47ANI\">new version of the HBP trailer</a>.</li>\n<li>Pottermore announced: We discuss the early days of the website, why it was so special, and what ultimately happened to it.</li>\n<li>Stay tuned next week for more shocking news moments, like the time JKR confirmed she was finally writing an Encyclopedia, Fantastic Beasts coming into existence, the earliest Cursed Child information, and so much more.</li>\n<li>This week’s episode is sponsored by MeUndies. Get the most comfortable undies with the coolest prints by visiting <a href=\"http://www.MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>. You'll get 15% off your first order and free shipping!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! On this month's Bonus MuggleCast, we share our thoughts on a Harry Potter cast reunion!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 29 Jun 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-06-28:/posts/7895049",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}