{
  "title": "Circle of Circuits",
  "link": "https://spectrum.ieee.org/robocup-2022",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.jpg?id=31727864&width=980\"/><br/><br/><p>\n\tThe Big Picture features technology through the lens of photographers.\n</p><p>\n\tEvery month, <em>IEEE Spectrum</em> selects the most stunning technology images recently captured by photographers around the world. We choose images that reflect an important advance, or a trend, or that are just mesmerizing to look at. We feature all images on our site, and one also appears on our monthly print edition.\n</p><p>\n\tEnjoy the latest images, and if you have suggestions, leave a comment below.</p><h3>RoboCup Class Picture</h3><br/><img alt=\"Humanoid robots and their human handlers gather in a circle for a group photo.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"6f7604b9c6782dc39e3688b9015516d7\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ffa46\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/humanoid-robots-and-their-human-handlers-gather-in-a-circle-for-a-group-photo.jpg?id=31704707&width=980\"/><p>\n\tHave you ever been awed by the pageantry of the parade of nations in the opening ceremony of the Olympic Games? Then this photo, featuring more than 100 Nao programmable educational robots, two Pepper humanoid assistive robots, and their human handlers, should leave you similarly amazed. It was taken at the end of this year’s RoboCup 2022 in Bangkok. After two years during which the RoboCup was scuttled by the global pandemic, the organizers were able to bring together 13 robot teams from around the world (with three teams joining in remotely) to participate in the automaton games. The spirit of the gathering was captured in this image, which, according to RoboCup organizers, shows robots with a combined market value of roughly US $1 million.\n</p><p class=\"caption\">\n\tPatrick Göttsch and Thomas Reinhardt\n</p><h3></h3><br/><img alt=\"A satellite containing a cellular base station is shown in orbit.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"98d7ff2a24d51c2e93a43c6b89e86837\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"57f47\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-satellite-containing-a-cellular-base-station-is-shown-in-orbit.jpg?id=31717983&width=980\"/><h3>\n<a href=\"https://spectrum.ieee.org/5g-satellite\" target=\"_blank\">Longest-Distance Calls</a>\n</h3><p>\n\tWhen you’re traveling to faraway destinations, it’s comforting to know that you can remain in contact with the folks back home, no matter how far you roam. Still, it’s surprisingly easy to end up somewhere that has poor cellular reception or none to speak of. That’s because only about 10 percent of the world’s surface is in cellular coverage zones. But in April 2022, a company called Lynk launched Lynk Tower 1, poised to be the world’s first commercial satellite cell tower, into space. The cell tower, pictured here, is said to be the first of four that Lynk plans to launch into orbit this year. Once they’re in place and contracts with terrestrial cellular service providers are set up, the 4 billion people who hardly ever have adequate cellular reception will finally be able to respond in the plural when asked “How many bars you got?”\n</p><p class=\"caption\">\n\tLynk Global\n</p><h3></h3><br/><img alt=\"Steam rises from a set of specially arranged tubes that yield a cooling effect.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"be134545cfa9e54c363d316c1ec9d6b3\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3bac5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/steam-rises-from-a-set-of-specially-arranged-tubes-that-yield-a-cooling-effect.jpg?id=31717988&width=980\"/><h3>\n<a href=\"https://spectrum.ieee.org/ai-3d-printing-better-ac\" target=\"_blank\">Self-Made Manufacturing</a>\n</h3><p>\n\tWhat’s more \n\t<em>meta</em> than using a 3D printer to make parts for a 3D printer? This device looks like a bunch of separate tubes packaged together. But it is actually a single unit that was built that way inside a 3D printer. It is a precision-engineered heat exchanger—optimized to improve the cooling of shielding gas that keeps impurities from fouling the additive manufacturing process that occurs inside an industrial 3D printer. No paper jams here.\n</p><p class=\"caption\">\n\tHyperganic\n</p><h3></h3><br/><img alt=\"White plastic rectangular patch with four buttons is stuck on the back of a person\\u2019s hand. Beads of water on the hand run off the waterproof patch.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"59748baebc1a755c56034a987d9b8a7f\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9ffe8\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/white-plastic-rectangular-patch-with-four-buttons-is-stuck-on-the-back-of-a-person-u2019s-hand-beads-of-water-on-the-hand-run-o.jpg?id=31717990&width=980\"/><h3>\n<a href=\"https://spectrum.ieee.org/a-self-powered-waterproof-hmi \" target=\"_blank\">None the Worse for Wearable</a>\n</h3><p>\n\tHow are we to benefit from the physical and cognitive enhancements that electronic wearables could someday provide if everyday aspects of human life such as breaking a sweat are hazardous to these devices? Not to worry. In a recent paper, a research team at the University of California, Los Angeles, reported that it has the problem licked. They developed a human-machine interface that is impervious to moisture. And, as if being waterproof weren’t enough, the four-button device has been engineered to generate enough electric current to power its own operation when any of the buttons is pressed. So, it can go just about anywhere we go, with no concerns about spills, splashes, sweat, or spent batteries.\n</p><p class=\"caption\">\n\tJUN CHEN RESEARCH GROUP/UCLA\n</p>",
  "pubDate": "Wed, 21 Sep 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/robocup-2022",
  "category": [
    "3d printer",
    "Cellular telephony",
    "Heat exchanger",
    "Lynk",
    "Robocup",
    "Robots",
    "Satellite",
    "The big picture"
  ],
  "dc:creator": "Willie Jones",
  "media:content": ""
}