{
  "title": "S16 Ep23: Holzer's Ghosts - The Ghost That Got Away: The Haunting of Westover Manor",
  "link": "https://audioboom.com/posts/8098388",
  "itunes:episode": 23,
  "itunes:title": "Holzer's Ghosts - The Ghost That Got Away: The Haunting of Westover Manor",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4205,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts - The Ghost That Got Away: The Haunting of Westover Manor</p>\n\n<p>Tonight Dave Schrader is joined by a few #HolzerFiles Super Fans, Sindy Brown & Keelie Gustin to discuss the recent episode of the program and shed light on behind the scenes stories, take questions from the audience!</p>\n\n<p>The Ghost That Got Away - Legendary Ghost Hunter Hans Holzer ventured to Charles County, Virginia, several times researching of one of the Old South's most infamous hauntings, Westover Manor. Delving into the property's storied history, Holzer heard countless stories of the heartbroken spirit of Evelyn Byrd, seen roaming the grounds and heard weeping in the night. However, when Holzer travelled to the Georgian mansion for a full investigation, he was refused entry. Despite never being allowed an investigation, he obsessed over the haunting, while the legends surrounding Westover only grew over the next half century.</p>\n\n<p>Now, decades after Holzer's visit, his hidden case file is finally reopened as paranormal investigator Dave Schrader, psychic medium Cindy Kaza, equipment expert Shane Pittman along with new insights from researcher Gabe Roth and Holzer's own daughter, Alexandra delve into the haunting that got away. However, as the locked gates of Westover are opened for a paranormal investigation for the first time, the team soon finds that the longing spirit of Evelyn Byrd has an unsettling story of her own to tell, and that she may not be the only presence lurking in these hallowed halls.</p>\n\n<p>Watch new episodes oh Holzer Files every Saturday on Discovery+ </p>\n",
  "pubDate": "Fri, 26 Feb 2021 09:00:00 +0000",
  "guid": "b118f8a6-22fa-4ce8-b0b6-acdb005c2b0c",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}