{
  "id": "https://bibleinoneyear.org/en/youth/184",
  "title": "Day 184: God’s Purposes for You",
  "description": "Proverbs 16:9, 2 Kings 6:25a,26–27,33b, 7:1–3,4b–8,16,18a, Acts 22:22,24–30, 23:1,6–8,11.  Nothing happens without God’s permission  God is in control and *in everything* he is working for good (8:28)",
  "pubDate": "Sun, 03 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/184/",
  "itunes:duration": "15:44",
  "guid": "enyouth03072022-184",
  "length": 944.09,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 184: God’s Purposes for You",
  "itunes:subtitle": "Proverbs 16:9, 2 Kings 6:25a,26–27,33b, 7:1–3,4b–8,16,18a, Acts 22:22,24–30, 23:1,6–8,11.  Nothing happens without God’s permission  God is in control and *in everything* he is working for good (8:28)",
  "itunes:summary": "I trained as a lawyer and worked as a barrister. Then, back in 1981, Pippa and I felt that God was calling us to full-time ministry in the Church of England and for me to become an ordained minister. We also felt that we should do our training in Durham, starting in September 1982. I was at the top of the waiting list for the theological college at Durham University. I was told it was almost certain someone would drop out and I was virtually guaranteed a place. Based on this I announced our plans widely, including telling all my colleagues at work that I was leaving.\nJust before I was due to start we received news that, exceptionally, no one had dropped out that year and it would not be possible for us to go. We tried everything to persuade them to change their minds. We desperately tried to find another theological college that would accept us. We prayed and pushed as hard as we could but to no avail. The door was firmly shut.\nThe following year was extremely difficult. I was given very little work by my workplace as people knew I was leaving and so had no incentive to build my career. It was a huge disappointment and mystifying at the time.\nIn the end, Pippa and I went to Oxford to study the following year and I eventually started as an assistant pastor at HTB in 1986. With hindsight, had we got the place at Durham, the timing would have meant that a job at HTB would have been out of the question and we would not be doing what we are doing today. I am so thankful to God that he blocked our plans and strategically ordered our steps.\nIf you are going through a setback or disappointment, remember that his purposes for you are ‘good, pleasing and perfect’ (Romans 12:2). Nothing happens without God’s permission. God is in control and in everything he is working for good (8:28).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 549
}