{
  "title": "Generating the right evidence at the right time: Principles of a new class of flexible augmented clinical trial designs. (arXiv:2210.15264v3 [stat.ME] UPDATED)",
  "link": "http://arxiv.org/abs/2210.15264",
  "description": "<p>The past few years have seen an increasing number of initiatives aimed at\nintegrating information generated outside of confirmatory randomised clinical\ntrials (RCTs) into drug development. However, data generated non-concurrently\nand through observational studies can provide results that are difficult to\ncompare with randomised trial data. Moreover, the scientific questions these\ndata can serve to answer often remain vague. Our starting point is to use\nclearly defined objectives for evidence generation, which are formulated\ntowards early discussion with health technology assessment (HTA) bodies and are\nadditional to regulatory requirements for authorisation of a new treatment. We\npropose FACTIVE (Flexible Augmented Clinical Trial for Improved eVidencE\ngeneration), a new class of study designs enabling flexible augmentation of\nconfirmatory randomised controlled trials with concurrent and\nclose-to-real-world elements. These enabling designs facilitate estimation of\ncertain treatment effects in the confirmatory part and other, complementary\ntreatment effects in a concurrent real-world part. Each stakeholder should use\nthe evidence that is relevant within their own decision-making framework. High\nquality data are generated under one single protocol and the use of\nrandomisation ensures rigorous statistical inference and interpretation within\nand between the different parts of the experiment. Evidence for the\ndecision-making of HTA bodies could be available earlier than is currently the\ncase.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Dunger_Baldauf_C/0/1/0/all/0/1\">Cornelia Dunger-Baldauf</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Hemmings_R/0/1/0/all/0/1\">Rob Hemmings</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Bretz_F/0/1/0/all/0/1\">Frank Bretz</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Jones_B/0/1/0/all/0/1\">Byron Jones</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Schiel_A/0/1/0/all/0/1\">Anja Schiel</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Holmes_C/0/1/0/all/0/1\">Chris Holmes</a>"
}