{
  "title": "Episode 36: &#8220;Blue Suede Shoes&#8221; by Carl Perkins",
  "link": "https://500songs.com/podcast/episode-36-blue-suede-shoes-by-carl-perkins/",
  "pubDate": "Sun, 09 Jun 2019 22:09:32 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-36-blue-suede-shoes-by-carl-perkins/",
  "description": "Episode thirty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Blue Suede Shoes\" by Carl Perkins, and is part one of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/27513170\">on \"Black Denim Trousers and Motorcycle Boots\" by the Cheers</a>.\n\n\n\n<strong>Clarification</strong>\n\nWhile editing tonight's podcast I noticed something I didn't make clear. I talk about \"Movie Magg\" by Carl Perkins being about riding a mule to the cinema, but in the song he uses the word \"horse\" rather than mule. Perkins' family, in real life, had a mule when he wrote the song, and that was what he was writing about, even though the song lyric is \"horse\".\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-36-blue-suede-shoes/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. For copyright reasons, that might not be available in North America, so here's <a href=\"https://open.spotify.com/playlist/5OF3OMEXZzo20KFbTm5sqD?si=Nv5VAAPXRVa1fLpy3HztbA\">a Spotify playlist</a> of the same recordings.\n\nMuch of the information here comes from <a href=\"https://amzn.to/2Wqgi6n\"><em>Go Cat Go! The Life and Times of Carl Perkins</em>, by Carl Perkins and David McGee.</a>\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nThere are many compilations available of Perkins' Sun recordings. <a href=\"https://amzn.to/31kw5HH\">This double-CD one</a> seems as good as any.\n\nAll Perkins' early Sun singles are also on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Perkins' work, in a way hearing it in isolation wouldn't.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong> Transcript</strong>\n\nToday's episode is, in effect, part one of a three-part story, looking at the repercussions of Elvis Presley's move from Sun Records, and the birth of rockabilly. As when I did my recent Chess Records trilogy, all of these episodes should stand alone, but you might find it interesting to listen back to this one after the next two.\n\nWhile Elvis Presley had moved from Sun to RCA, that didn't mean that Sam Phillips had given up on recording rock and roll music. Far from it. With the amount of money that RCA had paid for Elvis' contract, Sun Records was for the first time on a completely secure footing, and now Phillips could really begin work on making the music that would come to define his legacy.\n\nBecause now, Sun Records shifted almost entirely from being a blues label to being a rockabilly label. We've not talked much about rockabilly as a genre, and that's because until now we've only heard one person performing it. But while Elvis was arguably the first rockabilly artist, it wasn't until Elvis had left Sun that the floodgates opened, and Sam Phillips started producing the records that defined the genre as a genre, rather than as the work of a single individual.\n\nThe rockabilly sound was, in essence, created in Sun studios. And rockabilly is one of those sounds that purists, at least, insist had a very, very specific meaning. It had to have slapback echo on the vocals, it had to have an electric lead guitar and slapback bass. It basically had to have all the elements of Elvis' very earliest records. You could add a few other elements, like piano or drums -- mostly because anything else would exclude Jerry Lee Lewis -- but no horns or strings, no backing vocals, nothing that would take away from the very primitive sound. And no steel guitar or fiddle, either -- that would tip it over into country.\n\nThere were, of course, other people who produced rockabilly records, and we'll look at some of them as the next couple of years go on. But when they did, they were all copying the sound that Sam Phillips created.\n\nBecause after Elvis stopped recording for Sun, Sam Phillips and his small staff discovered enough young, exciting, musicians that Sun Records was assured a place in music history, even though its biggest artist was gone.\n\nThe first of the new artists Phillips discovered was someone who came to Sun when Elvis was still on the label -- a young man named Carl Perkins.\n\nPerkins, like many of the pioneers of rock and roll music, had grown up dirt-poor. His parents were sharecroppers, who were illiterate enough that they misspelled their own surname on his birth certificate (they spelled it Perkings, but he always used Perkins in later life. His family had been so poor that when young Carl, inspired by listening to the Grand Ole Opry on the radio, asked if he could have a guitar, his parents couldn't afford one, and so his father made him one from a cigar box and a broom handle. However, young Carl got good enough that soon his dad bought him a real guitar. He was so poor that when he broke strings, he had to tie them together because he couldn't afford new ones, and he ended up developing a unique guitar style -- bending strings to get different notes rather than fretting them normally -- to avoid the knots in the strings, which hurt his fingers.\n\nWhen he was fourteen, Perkins wrote his first song, and it again shows just how poor he was. Listen to the lyrics to \"Movie Magg\":\n\n[Excerpt: Carl Perkins, \"Movie Magg\"]\n\nThat's about going to the cinema *riding on a mule*. Because in the time and place where Perkins grew up, it was actually considered slightly classier to ride a mule to the cinema than to take a car, because if anyone *did* have a car, it was one that was so broken down and rusted that it was actually less impressive than a mule.\n\nAll of Perkins' early work is like that, rooted in a poverty far deeper than almost anyone listening to this podcast will be able to understand. It's music based in the country music he heard growing up, and it's music that could only be made by someone who spent his childhood picking cotton for pennies an hour in order to help his family survive.\n\nWhen Perkins had learned to play the guitar well enough to play lead, he taught his brother Jay to play rudimentary rhythm parts. Jay loved music as much as Carl did, but the two brothers had slightly different tastes in country music. Carl was a massive fan of the inventor of bluegrass, Bill Monroe, who sang high, driving, harmony-filled songs of longing:\n\n[Excerpt: Bill Monroe, \"Blue Moon of Kentucky\"]\n\nJay, on the other hand, preferred Ernest Tubb's low, honky tonk, music:\n\n[Excerpt: Ernest Tubb, \"Tomorrow Never Comes\"]\n\nThey taught their younger brother Clayton to play a little bass, even though he wasn't a music lover especially -- Clayton loved drinking and fighting and not much else. But he had a reasonable sense of rhythm, so they could teach him the three places to put his fingers on most country songs, and let him figure out the rest with practice. Their friend Fluke Holland joined on drums, and the Perkins Brothers Band was born.\n\nThe Perkins brothers spent the next several years honing their craft playing some of the roughest bars in Tennessee. They had to develop an ability to play dance music for venues where it was customary to buy two bottles of beer at a time -- one to drink, and one to smash over someone else's head -- you didn't want to use an empty bottle for your smashing, as there was no weight to them, but a full bottle of beer would put someone out of commission very quickly.\n\nSo they very quickly developed a style that was rooted in honky-tonk music, but which was totally oriented around getting people dancing. It had elements of bluegrass, Western Swing, the blues, and anything else that could possibly be used to get a crowd of drunks dancing, if you only had two guitars, a double bass, and a drum kit. Both Carl and Jay would take turns singing lead, and when they ran out of songs to perform, Carl would improvise new ones around standard chord changes. He had the ability to improvise words and music off the top of his head -- and he'd remember a good chorus or a good line and reuse it, so these improvised songs slowly became standard, structured, parts of their set.\n\nThey were soon able to make a full-time living playing music for bars full of angry drunk men, and for several years they did just that, starting from before it was even legal for them to enter the bars they were playing. They had no ambition to do anything else -- they were just glad to be earning a living doing something that was fun.\n\nSlowly but surely, Carl Perkins started to carve out a unique sound for the band, at least on the songs that he wrote and sang. He didn't know what it was that he was doing, but he knew it was different, and that no-one else was doing anything like it. Until one day he heard someone who was:\n\n[Excerpt: Elvis Presley, \"Blue Moon of Kentucky\"]\n\nWhen Carl Perkins heard Elvis singing \"Blue Moon of Kentucky\" on the radio, he knew that there was someone else who was out there doing the same kind of thing as him. He was even singing a song by Carl's favourite, Bill Monroe.\n\nIf this Elvis Presley kid could become a star making that kind of music, maybe so could Carl himself. He and his brothers went to see Elvis live and while Jay and Clayton took a dislike to Elvis -- deciding that because he paid any attention to his appearance he must be gay, and therefore in their opinion worthy of nothing but contempt -- Carl saw something else.\n\nHe determined right then that he was going to go to Sun Records and demand an audition. If they would put that Elvis boy's records out, then surely they would put his out too?\n\nThe Perkins Brothers Band all piled into a single car, and drove down to Memphis, to 706 Union Ave. They went in to see the people at Sun Records -- and were turned away. Marion Keisker told them that they weren't auditioning right then, and that they didn't need any new singers. When Carl Perkins told her that they sounded a bit like Elvis, she was even more dismissive -- they didn't need another Elvis. They'd already got one.\n\nThey trudged back despondently to the car, deciding that their dream of stardom was at an end. But as they were doing so, a Cadillac pulled up and a man got out of it. They decided that the only person who would be driving a Cadillac to that studio must be the owner of the record label, so they went over to him and told him what had happened.\n\nAnd Sam Phillips agreed with Keisker. He wasn't after anyone else right now. He had enough acts. And Carl was devastated. According to Perkins, Phillips later told him “I couldn’t say no. Never have I [seen] a pitifuller-looking fellow as you looked when I said, ‘I’m too busy to listen to you.’ You overpowered me.” He relented, and told them that he'd give them a quick listen, but it had to be quick as he was busy that day.\n\nThey went into the studio and started running through their set. They got through a verse of the first song, and Phillips stopped them. He wasn't interested in anything like that. They started another song. Again, Phillips stopped them and said he wasn't interested. They were about to go home, but then Carl asked if he could try just one more song. He started up that song he had written when he was fourteen, \"Movie Magg\":\n\n[Excerpt: Carl Perkins, \"Movie Magg\"]\n\nThe band joined in, and as they played through the song, Carl noticed something. Sam Phillips hadn't stopped them from playing. He sat through the whole thing, listening intently.\n\nWhen they got to the end, he said that if they came back with a few more songs that sounded like that, they might just be worth recording. The band were pleased, but Phillips also said something else, to Carl alone, that was more worrying. He told Carl that there was no place for any lead vocals by his brother Jay. \"There's already one Ernest Tubb in the world. No-one needs another one.\"\n\nWithout them having fully realised it at the time, the Perkins Brothers Band had now become Carl Perkins and his band.\n\nWhen they came back a few weeks later, they had worked out a few more songs. Phillips put out \"Movie Magg\", backed with a ballad Carl had written, \"Turn Around\", but he didn't put these out on Sun. Rather, he put them out on a new label, Flip, that didn't pay union scale. Flip only put out records around Tennessee, and the idea was that these would be audition records -- Phillips would see how the records would do locally, without paying full royalties and without paying expensive shipping costs or for a large print run. Phillips was in financial trouble at the time, and he was trying to find ways to cut costs.\n\n\"Movie Magg\" did well enough on Flip that for the next Carl Perkins single, Phillips moved him on to Sun Records proper. This followed the same formula as the first single, pairing an uptempo A-side with a B-side ballad in the Hank Williams vein. The A-side, \"Gone Gone Gone\", was one of Carl's improvised songs -- every take of it was different, although they were all based around the same basic idea, which was riffing on the old phrase, \"It must be jelly, 'cause jam don't shake like that\".\n\n[Excerpt, Carl Perkins, \"Gone Gone Gone\"]\n\n\"Gone Gone Gone\" wasn't a hit, but it sold well enough, and Phillips arranged for Perkins to go out on tour, on a bill with Elvis and another new Sun signing, Johnny Cash. It was on this tour that Cash made a suggestion to Perkins that would change Perkins' life.\n\nCash remembered a fellow serviceman, a black man named C.V. Wright, had referred to his service issue shoes as \"blue suede shoes\", and he told Perkins that he should write a song about that. Perkins dismissed the idea. What the hell did he know about shoes, anyway? And what kind of song could you write about them? The idea was ridiculous.\n\nThe tour went well, apart from one incident -- Perkins and Presley had been talking about their mutual love for the song \"Only You\", and that inspired Perkins to add the song to his own setlist.\n\n[Excerpt: Carl Perkins, \"Only You\"]\n\nThat irritated Presley, who had been planning to perform the song himself the same night, and Presley felt that Perkins' performance had upstaged him. The two remained friends, but would never perform on the same bill again. Elvis did, however, take Carl out clothes shopping, and show him how to dress in a more sophisticated manner on stage.\n\nShortly after that tour, Perkins was performing another show, when he noticed someone in the audience berating his date, \"Don't step on my suedes!\" He started thinking about what kind of person would find his shoes so important, and started thinking about pride, and about people who don't have anything. The idea merged with Cash's mention of blue suede shoes, and Perkins found himself one night getting out of bed, playing his electric guitar unplugged, so as not to disturb his wife, and writing a song he called \"Blue Swade Shoes\" -- he spelled \"suede\" s w a d e, because he didn't know how the word was spelled. Two days later, on December 19, 1955, he was in the studio recording it:\n\n[Excerpt: Carl Perkins, \"Blue Suede Shoes\"]\n\nPerkins was certain that this was going to be it. This was his breakthrough record. But at the same time he was getting depressed about his prospects. He had a wife and kids to support, and he was earning so little money from his music that he was having to do farm work as a side job in order to make enough money to buy his kids Christmas presents. The people at this side job were often astonished that \"that singer fella\" was there. Everyone around knew him from his stage shows, and they all knew he'd put out records. Surely he was rich now, and didn't need to be doing such menial work?\n\nHe was at a low, and that didn't get better when he finally got his complimentary copies of his new single. They arrived through the post and, as often happened with records at that time, they'd got smashed into bits. He wanted to have his own copies of the record, of course, so he went into town to the shop that sold records, and asked for a copy. He was horrified at what he saw. Instead of a proper record -- a big ten inch thing with a tiny little hole in the middle, made out of shellac -- he was confronted with something only seven inches across, made of some kind of plastic, and with a big hole in the middle.\n\nHe explained that no, he wanted his record, and the store owner replied that this was his record. He came home with this little floppy thing and cried, explaining to his wife that they'd messed up his record in some way, and that he was ruined. Eventually they figured out that this was OK, and that what the store owner had told Carl had been correct -- these new vinyl records were apparently what all the kids wanted instead of what Carl thought of as real records.\n\n\"Blue Suede Shoes\" was an obvious hit, but the B-side, \"Honey Don't\", got more than a little airplay as well:\n\n[Excerpt: Carl Perkins, \"Honey Don't\"]\n\n\"Blue Suede Shoes\" was such a smash hit that Steve Sholes of RCA called Sam Phillips, worried. When he'd signed Elvis, had he backed the wrong horse? Phillips assured Sholes that he hadn't.\n\nAs it turned out, \"Blue Suede Shoes\" and Elvis' first single for RCA, \"Heartbreak Hotel\", were racing up the charts at the same time as each other. \"Heartbreak Hotel\" ended up at number one, and \"Blue Suede Shoes\" at number two, and both were crossover hits, making the top two in both pop and country and the top five in R&B.\n\n\"Blue Suede Shoes\" was so popular, in fact, that at one point it was being performed simultaneously on two different TV shows -- at the same time as Carl Perkins was appearing on the Ozark Jubilee, his very first TV appearance, Presley was on Stage Show on another network, performing his cover version of it:\n\n[Excerpt: Elvis Presley, \"Blue Suede Shoes\"]\n\nPresley's version wasn't released as a single until a few months later -- they'd come to a gentleman's agreement that he wouldn't affect Perkins' sales -- but it was put out as the opening track on Presley's first album, and as a track on an EP. When Presley's version finally came out as a single, towards the end of the year, it made the top twenty and brought in further royalties for Perkins.\n\nPerkins' version of \"Blue Suede Shoes\" and Elvis' had a few crucial differences other than just their performer. Perkins' version is more interesting rhythmically at the start -- it has a stop-time introduction which essentially puts it into six-four time before settling into four-four. Elvis, on the other hand, stayed with a four-four beat all the way through. Elvis' performance is all about keeping up a sense of urgency, while Perkins is about building up tension and release. Listen first of all to Elvis' introduction:\n\n[Excerpt: Elvis Presley, \"Blue Suede Shoes\"]\n\n\"Well, it's one for the money,\" BAM, \"two for the show\", BAM... that's a record that's all about that initial urgency. Now listen to Perkins':\n\n[Excerpt: Carl Perkins, \"Blue Suede Shoes\"]\n\nIt seems to stall after every line, as if it's hesitant, as if he doesn't really want to get started. But at the same time that gives it a rhythmic interest that isn't there in Presley's version. Perkins' original is the more sophisticated, musicianly, record. Most cover versions since have followed Presley's version, with the notable exception of John Lennon's live cover version from 1969, which follows the pattern of Perkins'.\n\nUnfortunately, Perkins' career was then derailed in a tragic accident. On his way to perform on the Perry Como Show on TV, Perkins' car hit a truck. The truck driver was killed, and Perkins and his brother Jay were both hospitalised. They got better, but their career had lost momentum -- and by the time they were completely well, Sam Phillips was rather more interested in his next big thing.\n\nPhillips did, however, get Perkins a Cadillac of his own, like the one Perkins had been impressed by when he first met Phillips. He told Perkins that he'd planned to do this for the first Sun Records artist to have a million-seller, which \"Blue Suede Shoes\" was. Perkins was less impressed when he found out that the Cadillac wasn't a gift, but had been paid for out of Perkins' royalties, and that eventually started a lifelong series of royalty disputes between the two men, with Perkins never believing he had received all the money that was rightfully his.\n\nPerkins would never have another hit as a performer, and his career would be defined by that one song, but he continued making great records, and in a few weeks' time we'll be taking a look at another of them, and at what happened in the studio when a couple of people came to visit while he was recording. Those future records would include some that would inspire some of the most important musicians in the world, and would rightfully become classics.\n\nBut it's \"Blue Suede Shoes\" which ensured his place in music history, and which sixty-three years later, more than any other record, sums up that point in 1956 when two country boys from Tennessee were chasing each other up the charts and defining the future of rock and roll.",
  "itunes:subtitle": "Episode thirty-six of A History of Rock Music in Five Hundred Songs looks at Blue Suede Shoes by Carl Perkins, and is part one of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links",
  "itunes:keywords": "Carl Perkins,country and western,Elvis Presley,Johnny Cash,Marion Keisker,rockabilly,Sam Phillips,Sun Records",
  "itunes:episodeType": "full",
  "itunes:episode": 36,
  "content:encoded": "Episode thirty-six of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Blue Suede Shoes\" by Carl Perkins, and is part one of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/27513170\">on \"Black Denim Trousers and Motorcycle Boots\" by the Cheers</a>.\n\n\n\n<strong>Clarification</strong>\n\nWhile editing tonight's podcast I noticed something I didn't make clear. I talk about \"Movie Magg\" by Carl Perkins being about riding a mule to the cinema, but in the song he uses the word \"horse\" rather than mule. Perkins' family, in real life, had a mule when he wrote the song, and that was what he was writing about, even though the song lyric is \"horse\".\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-36-blue-suede-shoes/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode. For copyright reasons, that might not be available in North America, so here's <a href=\"https://open.spotify.com/playlist/5OF3OMEXZzo20KFbTm5sqD?si=Nv5VAAPXRVa1fLpy3HztbA\">a Spotify playlist</a> of the same recordings.\n\nMuch of the information here comes from <a href=\"https://amzn.to/2Wqgi6n\"><em>Go Cat Go! The Life and Times of Carl Perkins</em>, by Carl Perkins and David McGee.</a>\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nThere are many compilations available of Perkins' Sun recordings. <a href=\"https://amzn.to/31kw5HH\">This double-CD one</a> seems as good as any.\n\nAll Perkins' early Sun singles are also on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Perkins' work, in a way hearing it in isolation wouldn't.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong> Transcript</strong>\n\nToday's episode is, in effect, part one of a three-part story, looking at the repercussions of Elvis Presley's move from Sun Records, and the birth of rockabilly. As when I did my recent Chess Records trilogy, all of these episodes should stand alone, but you might find it interesting to listen back to this one after the next two.\n\nWhile Elvis Presley had moved from Sun to RCA, that didn't mean that Sam Phillips had given up on recording rock and roll music. Far from it. With the amount of money that RCA had paid for Elvis' contract, Sun Records was for the first time on a completely secure footing, and now Phillips could really begin work on making the music that would come to define his legacy.\n\nBecause now, Sun Records shifted almost entirely from being a blues label to being a rockabilly label. We've not talked much about rockabilly as a genre, and that's because until now we've only heard one person performing it. But while Elvis was arguably the first rockabilly artist, it wasn't until Elvis had left Sun that the floodgates opened, and Sam Phillips started producing the records that defined the genre as a genre, rather than as the work of a single individual.\n\nThe rockabilly sound was, in essence, created in Sun studios. And rockabilly is one of those sounds that purists, at least, insist had a very, very specific meaning. It had to have slapback echo on the vocals, it had to have an electric lead guitar and slapback bass. It basically had to have all the elements of Elvis' very earliest records. You could add a few other elements, like piano or drums -- mostly because anything else would exclude Jerry Lee Lewis -- but no horns or strings, no backing vocals, nothing that would take away from the very primitive sound. And no steel guitar or fiddle, either -- that would tip it over into country.\n\nThere were, of course, other people who produced rockabilly records, and we'll look at some of them as the next couple of years go on. But when they did, they were all copying the sound that Sam Phillips created.\n\nBecause after Elvis stopped recording for Sun, Sam Phillips and his small staff discovered enough young, exciting, musicians that Sun Records was assured a place in music history, even though its biggest artist was gone.\n\nThe first of the new artists Phillips discovered was someone who came to Sun when Elvis was still on the label -- a young man named Carl Perkins.\n\nPerkins, like many of the pioneers of rock and roll music, had grown up dirt-poor. His parents were sharecroppers, who were illiterate enough that they misspelled their own surname on his birth certificate (they spelled it Perkings, but he always used Perkins in later life. His family had been so poor that when young Carl, inspired by listening to the Grand Ole Opry on the radio, asked if he could have a guitar, his parents couldn't afford one, and so his father made him one from a cigar box and a broom handle. However, young Carl got good enough that soon his dad bought him a real guitar. He was so poor that when he broke strings, he had to tie them together because he couldn't afford new ones, and he ended up developing a unique guitar style -- bending strings to get different notes rather than fretting them normally -- to avoid the knots in the strings, which hurt his fingers.\n\nWhen he was fourteen, Perkins wrote his first song, and it again shows just how poor he was. Listen to the lyrics to \"Movie Magg\":\n\n[Excerpt: Carl Perkins, \"Movie Magg\"]\n\nThat's about going to the cinema *riding on a mule*. Because in the time and place where Perkins grew up, it was actually considered slightly classier to ride a mule to the cinema than to take a car, because if anyone *did* have a car, it was one that was so broken down and rusted that it was actually less impressive than a mule.\n\nAll of Perkins' early work is like that, rooted in a poverty far deeper than almost anyone listening to this podcast will be able to understand. It's music based in the country music he heard growing up, and it's music that could only be made by someone who spent his childhood picking cotton for pennies an hour in order to help his family survive.\n\nWhen Perkins had learned to play the guitar well enough to play lead, he taught his brother Jay to play rudimentary rhythm parts. Jay loved music as much as Carl did, but the two brothers had slightly different tastes in country music. Carl was a massive fan of the inventor of bluegrass, Bill Monroe, who sang high, driving, harmony-filled songs of longing:\n\n[Excerpt: Bill Monroe, \"Blue Moon of Kentucky\"]\n\nJay, on the other hand, preferred Ernest Tubb's low, honky tonk, music:\n\n[Excerpt: Ernest Tubb, \"Tomorrow Never Comes\"]\n\nThey taught their younger brother Clayton to play a little bass, even though he wasn't a music lover especially -- Clayton loved drinking and fighting and not much else. But he had a reasonable sense of rhythm, so they could teach him the three places to put his fingers on most country songs, and let him figure out the rest with practice. Their friend Fluke Holland joined on drums, and the Perkins Brothers Band was born.\n\nThe Perkins brothers spent the next several years honing their craft playing some of the roughest bars in Tennessee. They had to develop an ability to play dance music for venues where it was customary to buy two bottles of beer at a time -- one to drink, and one to smash over someone else's head -- you didn't want to use an empty bottle for your smashing, as there was no weight to them, but a full bottle of beer would put someone out of commission very quickly.\n\nSo they very quickly developed a style that was rooted in honky-tonk music, but which was totally oriented around getting people dancing. It had elements of bluegrass, Western Swing, the blues, and anything else that could possibly be used to get a crowd of drunks dancing, if you only had two guitars, a double bass, and a drum kit. Both Carl and Jay would take turns singing lead, and when they ran out of songs to perform, Carl would improvise new ones around standard chord changes. He had the ability to improvise words and music off the top of his head -- and he'd remember a good chorus or a good line and reuse it, so these improvised songs slowly became standard, structured, parts of their set.\n\nThey were soon able to make a full-time living playing music for bars full of angry drunk men, and for several years they did just that, starting from before it was even legal for them to enter the bars they were playing. They had no ambition to do anything else -- they were just glad to be earning a living doing something that was fun.\n\nSlowly but surely, Carl Perkins started to carve out a unique sound for the band, at least on the songs that he wrote and sang. He didn't know what it was that he was doing, but he knew it was different, and that no-one else was doing anything like it. Until one day he heard someone who was:\n\n[Excerpt: Elvis Presley, \"Blue Moon of Kentucky\"]\n\nWhen Carl Perkins heard Elvis singing \"Blue Moon of Kentucky\" on the radio, he knew that there was someone else who was out there doing the same kind of thing as him. He was even singing a song by Carl's favourite, Bill Monroe.\n\nIf this Elvis Presley kid could become a star making that kind of music, maybe so could Carl himself. He and his brothers went to see Elvis live and while Jay and Clayton took a dislike to Elvis -- deciding that because he paid any attention to his appearance he must be gay, and therefore in their opinion worthy of nothing but contempt -- Carl saw something else.\n\nHe determined right then that he was going to go to Sun Records and demand an audition. If they would put that Elvis boy's records out, then surely they would put his out too?\n\nThe Perkins Brothers Band all piled into a single car, and drove down to Memphis, to 706 Union Ave. They went in to see the people at Sun Records -- and were turned away. Marion Keisker told them that they weren't auditioning right then, and that they didn't need any new singers. When Carl Perkins told her that they sounded a bit like Elvis, she was even more dismissive -- they didn't need another Elvis. They'd already got one.\n\nThey trudged back despondently to the car, deciding that their dream of stardom was at an end. But as they were doing so, a Cadillac pulled up and a man got out of it. They decided that the only person who would be driving a Cadillac to that studio must be the owner of the record label, so they went over to him and told him what had happened.\n\nAnd Sam Phillips agreed with Keisker. He wasn't after anyone else right now. He had enough acts. And Carl was devastated. According to Perkins, Phillips later told him “I couldn’t say no. Never have I [seen] a pitifuller-looking fellow as you looked when I said, ‘I’m too busy to listen to you.’ You overpowered me.” He relented, and told them that he'd give them a quick listen, but it had to be quick as he was busy that day.\n\nThey went into the studio and started running through their set. They got through a verse of the first song, and Phillips stopped them. He wasn't interested in anything like that. They started another song. Again, Phillips stopped them and said he wasn't interested. They were about to go home, but then Carl asked if he could try just one more song. He started up that song he had written when he was fourteen, \"Movie Magg\":\n\n[Excerpt: Carl Perkins, \"Movie Magg\"]\n\nThe band joined in, and as they played through the song, Carl noticed something. Sam Phillips hadn't stopped them from playing. He sat through the whole thing, listening intently.\n\nWhen they got to the end, he said that if they came back with a few more songs that sounded like that, they might just be worth recording. The band were pleased, but Phillips also said something else, to Carl alone, that was more worrying. He told Carl that there was no place for any lead vocals by his brother Jay. \"There's already one Ernest Tubb in the world. No-one needs another one.\"\n\nWithout them having fully realised it at the time, the Perkins Brothers Band had now become Carl Perkins and his band.\n\nWhen they came back a few weeks later, they had worked out a few more songs. Phillips put out \"Movie Magg\", backed with a ballad Carl had written, \"Turn Around\", but he didn't put these out on Sun. Rather, he put them out on a new label, Flip, that didn't pay union scale. Flip only put out records around Tennessee, and the idea was that these would be audition records -- Phillips would see how the records would do locally, without paying full royalties and without paying expensive shipping costs or for a large print run. Phillips was in financial trouble at the time, and he was trying to find ways to cut costs.\n\n\"Movie Magg\" did well enough on Flip that for the next Carl Perkins single, Phillips moved him on to Sun Records proper. This followed the same formula as the first single, pairing an uptempo A-side with a B-side ballad in the Hank Williams vein. The A-side, \"Gone Gone Gone\", was one of Carl's improvised songs -- every take of it was different, although they were all based around the same basic idea, which was riffing on the old phrase, \"It must be jelly, 'cause jam don't shake like that\".\n\n[Excerpt, Carl Perkins, \"Gone Gone Gone\"]\n\n\"Gone Gone Gone\" wasn't a hit, but it sold well enough, and Phillips arranged for Perkins to go out on tour, on a bill with Elvis and another new Sun signing, Johnny Cash. It was on this tour that Cash made a suggestion to Perkins that would change Perkins' life.\n\nCash remembered a fellow serviceman, a black man named C.V. Wright, had referred to his service issue shoes as \"blue suede shoes\", and he told Perkins that he should write a song about that. Perkins dismissed the idea. What the hell did he know about shoes, anyway? And what kind of song could you write about them? The idea was ridiculous.\n\nThe tour went well, apart from one incident -- Perkins and Presley had been talking about their mutual love for the song \"Only You\", and that inspired Perkins to add the song to his own setlist.\n\n[Excerpt: Carl Perkins, \"Only You\"]\n\nThat irritated Presley, who had been planning to perform the song himself the same night, and Presley felt that Perkins' performance had upstaged him. The two remained friends, but would never perform on the same bill again. Elvis did, however, take Carl out clothes shopping, and show him how to dress in a more sophisticated manner on stage.\n\nShortly after that tour, Perkins was performing another show, when he noticed someone in the audience berating his date, \"Don't step on my suedes!\" He started thinking about what kind of person would find his shoes so important, and started thinking about pride, and about people who don't have anything. The idea merged with Cash's mention of blue suede shoes, and Perkins found himself one night getting out of bed, playing his electric guitar unplugged, so as not to disturb his wife, and writing a song he called \"Blue Swade Shoes\" -- he spelled \"suede\" s w a d e, because he didn't know how the word was spelled. Two days later, on December 19, 1955, he was in the studio recording it:\n\n[Excerpt: Carl Perkins, \"Blue Suede Shoes\"]\n\nPerkins was certain that this was going to be it. This was his breakthrough record. But at the same time he was getting depressed about his prospects. He had a wife and kids to support, and he was earning so little money from his music that he was having to do farm work as a side job in order to make enough money to buy his kids Christmas presents. The people at this side job were often astonished that \"that singer fella\" was there. Everyone around knew him from his stage shows, and they all knew he'd put out records. Surely he was rich now, and didn't need to be doing such menial work?\n\nHe was at a low, and that didn't get better when he finally got his complimentary copies of his new single. They arrived through the post and, as often happened with records at that time, they'd got smashed into bits. He wanted to have his own copies of the record, of course, so he went into town to the shop that sold records, and asked for a copy. He was horrified at what he saw. Instead of a proper record -- a big ten inch thing with a tiny little hole in the middle, made out of shellac -- he was confronted with something only seven inches across, made of some kind of plastic, and with a big hole in the middle.\n\nHe explained that no, he wanted his record, and the store owner replied that this was his record. He came home with this little floppy thing and cried, explaining to his wife that they'd messed up his record in some way, and that he was ruined. Eventually they figured out that this was OK, and that what the store owner had told Carl had been correct -- these new vinyl records were apparently what all the kids wanted instead of what Carl thought of as real records.\n\n\"Blue Suede Shoes\" was an obvious hit, but the B-side, \"Honey Don't\", got more than a little airplay as well:\n\n[Excerpt: Carl Perkins, \"Honey Don't\"]\n\n\"Blue Suede Shoes\" was such a smash hit that Steve Sholes of RCA called Sam Phillips, worried. When he'd signed Elvis, had he backed the wrong horse? Phillips assured Sholes that he hadn't.\n\nAs it turned out, \"Blue Suede Shoes\" and Elvis' first single for RCA, \"Heartbreak Hotel\", were racing up the charts at the same time as each other. \"Heartbreak Hotel\" ended up at number one, and \"Blue Suede Shoes\" at number two, and both were crossover hits, making the top two in both pop and country and the top five in R&B.\n\n\"Blue Suede Shoes\" was so popular, in fact, that at one point it was being performed simultaneously on two different TV shows -- at the same time as Carl Perkins was appearing on the Ozark Jubilee, his very first TV appearance, Presley was on Stage Show on another network, performing his cover version of it:\n\n[Excerpt: Elvis Presley, \"Blue Suede Shoes\"]\n\nPresley's version wasn't released as a single until a few months later -- they'd come to a gentleman's agreement that he wouldn't affect Perkins' sales -- but it was put out as the opening track on Presley's first album, and as a track on an EP. When Presley's version finally came out as a single, towards the end of the year, it made the top twenty and brought in further royalties for Perkins.\n\nPerkins' version of \"Blue Suede Shoes\" and Elvis' had a few crucial differences other than just their performer. Perkins' version is more interesting rhythmically at the start -- it has a stop-time introduction which essentially puts it into six-four time before settling into four-four. Elvis, on the other hand, stayed with a four-four beat all the way through. Elvis' performance is all about keeping up a sense of urgency, while Perkins is about building up tension and release. Listen first of all to Elvis' introduction:\n\n[Excerpt: Elvis Presley, \"Blue Suede Shoes\"]\n\n\"Well, it's one for the money,\" BAM, \"two for the show\", BAM... that's a record that's all about that initial urgency. Now listen to Perkins':\n\n[Excerpt: Carl Perkins, \"Blue Suede Shoes\"]\n\nIt seems to stall after every line, as if it's hesitant, as if he doesn't really want to get started. But at the same time that gives it a rhythmic interest that isn't there in Presley's version. Perkins' original is the more sophisticated, musicianly, record. Most cover versions since have followed Presley's version, with the notable exception of John Lennon's live cover version from 1969, which follows the pattern of Perkins'.\n\nUnfortunately, Perkins' career was then derailed in a tragic accident. On his way to perform on the Perry Como Show on TV, Perkins' car hit a truck. The truck driver was killed, and Perkins and his brother Jay were both hospitalised. They got better, but their career had lost momentum -- and by the time they were completely well, Sam Phillips was rather more interested in his next big thing.\n\nPhillips did, however, get Perkins a Cadillac of his own, like the one Perkins had been impressed by when he first met Phillips. He told Perkins that he'd planned to do this for the first Sun Records artist to have a million-seller, which \"Blue Suede Shoes\" was. Perkins was less impressed when he found out that the Cadillac wasn't a gift, but had been paid for out of Perkins' royalties, and that eventually started a lifelong series of royalty disputes between the two men, with Perkins never believing he had received all the money that was rightfully his.\n\nPerkins would never have another hit as a performer, and his career would be defined by that one song, but he continued making great records, and in a few weeks' time we'll be taking a look at another of them, and at what happened in the studio when a couple of people came to visit while he was recording. Those future records would include some that would inspire some of the most important musicians in the world, and would rightfully become classics.\n\nBut it's \"Blue Suede Shoes\" which ensured his place in music history, and which sixty-three years later, more than any other record, sums up that point in 1956 when two country boys from Tennessee were chasing each other up the charts and defining the future of rock and roll.",
  "enclosure": "",
  "itunes:summary": "Episode thirty-six of A History of Rock Music in Five Hundred Songs looks at \"Blue Suede Shoes\" by Carl Perkins, and is part one of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Black Denim Trousers and Motorcycle Boots\" by the Cheers.\n\n\n\nClarification\n\nWhile editing tonight's podcast I noticed something I didn't make clear. I talk about \"Movie Magg\" by Carl Perkins being about riding a mule to the cinema, but in the song he uses the word \"horse\" rather than mule. Perkins' family, in real life, had a mule when he wrote the song, and that was what he was writing about, even though the song lyric is \"horse\".\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. For copyright reasons, that might not be available in North America, so here's a Spotify playlist of the same recordings.\n\nMuch of the information here comes from Go Cat Go! The Life and Times of Carl Perkins, by Carl Perkins and David McGee.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nThere are many compilations available of Perkins' Sun recordings. This double-CD one seems as good as any.\n\nAll Perkins' early Sun singles are also on this ten-disc set, which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Perkins' work, in a way hearing it in isolation wouldn't.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n Transcript\n\nToday's episode is, in effect, part one of a three-part story, looking at the repercussions of Elvis Presley's move from Sun Records, and the birth of rockabilly. As when I did my recent Chess Records trilogy, all of these episodes should stand alone, but you might find it interesting to listen back to this one after the next two.\n\nWhile Elvis Presley had moved from Sun to RCA, that didn't mean that Sam Phillips had given up on recording rock and roll music. Far from it. With the amount of money that RCA had paid for Elvis' contract, Sun Records was for the first time on a completely secure footing, and now Phillips could really begin work on making the music that would come to define his legacy.\n\nBecause now, Sun Records shifted almost entirely from being a blues label to being a rockabilly label. We've not talked much about rockabilly as a genre, and that's because until now we've only heard one person performing it. But while Elvis was arguably the first rockabilly artist, it wasn't until Elvis had left Sun that the floodgates opened, and Sam Phillips started producing the records that defined the genre as a genre, rather than as the work of a single individual.\n\nThe rockabilly sound was, in essence, created in Sun studios. And rockabilly is one of those sounds that purists, at least, insist had a very, very specific meaning. It had to have slapback echo on the vocals, it had to have an electric lead guitar and slapback bass. It basically had to have all the elements of Elvis' very earliest records. You could add a few other elements, like piano or drums -- mostly because anything else would exclude Jerry Lee Lewis -- but no horns or strings, no backing vocals, nothing that would take away from the very primitive sound. And no steel guitar or fiddle, either -- that would tip it over into country.\n\nThere were, of course, other people who produced rockabilly records, and we'll look at some of them as the next couple of years go on. But when they did, they were all copying the sound that Sam Phillips created.\n\nBecause after Elvis stopped recording for Sun, Sam Phillips and his small staff di",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode thirty-six of A History of Rock Music in Five Hundred Songs looks at \"Blue Suede Shoes\" by Carl Perkins, and is part one of a trilogy on the aftermath of Elvis leaving Sun, and the birth of rockabilly. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Black Denim Trousers and Motorcycle Boots\" by the Cheers.\n\n\n\nClarification\n\nWhile editing tonight's podcast I noticed something I didn't make clear. I talk about \"Movie Magg\" by Carl Perkins being about riding a mule to the cinema, but in the song he uses the word \"horse\" rather than mule. Perkins' family, in real life, had a mule when he wrote the song, and that was what he was writing about, even though the song lyric is \"horse\".\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. For copyright reasons, that might not be available in North Ameri",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}