{
  "title": "Multinational Agrichemical Corporations and the Great Food Transformation",
  "link": "https://mises.org/node/60747",
  "description": "<p>In July 2022, the Canadian government announced its intention to reduce “<a href=\"https://agriculture.canada.ca/en/about-our-department/transparency-and-corporate-reporting/public-opinion-research-and-consultations/share-ideas-fertilizer-emissions-reduction-target\">emissions from the application of fertilizers by 30 percent from 2020 levels by 2030</a>.” In the previous month, the government of the Netherlands publicly stated that it would implement measures designed to lower “<a href=\"https://www.reuters.com/world/europe/dutch-govt-sets-targets-cut-nitrogen-pollution-farmers-protest-2022-06-10/\">nitrogen pollution some areas by up to 70 percent by 2030</a>,” in order to meet the stipulations of the European “<a href=\"https://ec.europa.eu/clima/eu-action/european-green-deal_en\">Green Deal</a>,” which aims to “<a href=\"https://ec.europa.eu/info/strategy/priorities-2019-2024/european-green-deal_en\">make the EU’s climate, energy, transport and taxation policies fit for reducing net greenhouse gas emissions by at least 55 percent by 2030, compared to 1990 levels</a>.”</p>\n<p>In response, Dutch “<a href=\"https://www.reuters.com/world/europe/dutch-govt-sets-targets-cut-nitrogen-pollution-farmers-protest-2022-06-10/\">farm and agriculture organizations said the targets were not realistic and called for a protest</a>,” which led farmers and their supporters to rise up across the country. The artificially designed <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Green Deal</a> is one of the goals of <a href=\"https://www.canada.ca/en/employment-social-development/programs/agenda-2030.html\">Agenda 2030</a>, which was adopted by 193 member states of the United Nations (UN) in 2015.</p>\n<p>In addition to the UN, Agenda 2030 is also supported by a number of other international organizations and institutions, including the European Union, the World Economic Forum (WEF), and the Bretton Woods Institutions, which consist of the World Bank, the International Monetary Fund (IMF) and the World Trade Organization (WTO). It is also endorsed by some of the most powerful agrichemical multinational corporations in the world, such as BASF, Bayer, Dow Chemical, DuPont, and Syngenta, which, together, control more than 75 percent of the global market for farm inputs. <a href=\"https://european-seed.com/2019/02/from-big-six-to-big-four-new-oecd-study-sheds-light-on-concentration-and-competition-in-seed-markets/\">In recent years</a>, “the acquisition of Syngenta by ChemChina, and the merger of Bayer and Monsanto” have “reshaped the global seed industry.” Additionally, “<a href=\"https://www.weforum.org/organizations/dupont\">DuPont de Nemours was formed by the merger of Dow Chemical and DuPont in 2017</a>.” However, “within 18 months of the merger the company was split into three publicly traded companies with focuses on the following: agriculture with <a href=\"https://www.weforum.org/organizations/dupont\">Corteva, materials science with Dow and specialty products with DuPont</a>.”</p>\n<p>In recent years, all of these corporations have issued statements suggesting that the agriculture sector will undergo major changes over the upcoming three decades, and that they are committed to doing their parts to accelerate the transition to so called green policies. Accordingly, they advocate for governments to redirect public finance away from conventional farming and toward regenerative agriculture and alternative protein sources, including insect farming and lab-grown meats.</p>\n<p>Moreover, BASF, Syngenta and Bayer are members of “<a href=\"https://www.weforum.org/forum_networks/100-million-farmers/projects/eu-carbon-farming-coalition\">the European Carbon+ Farming Coalition</a>,” which includes a number of “organizations and stakeholders along the food value chain,” such as “<a href=\"https://www.weforum.org/projects/100m-farmers-transitioning-towards-net-zero-nature-positive-food-systems\">COPA-COGECA, Crop In, European Conservation Agriculture Federation (ECAF), European Institute of Innovation & Technology (EIT) Food, HERO, Planet Labs,” “Swiss Re, University of Glasgow, Yara, Zurich and the World Economic Forum</a>.” Originally, this “coalition emerged as a partnership between the World Economic Forum’s <a href=\"https://www.weforum.org/communities/100-million-farmers\">100 Million Farmers platform</a> and its <a href=\"https://www.weforum.org/communities/ceo-action-group-for-a-european-green-deal\">CEO Action Group for the European Green Deal</a>.”</p>\n<p>Its objective is to “decarbonise the European food system” by accelerating the transformation of farming and agricultural practices. More specifically, the European Carbon+ Farming Coalition seeks to attain “<a href=\"https://www.foodandlandusecoalition.org/wp-content/uploads/2019/09/Critical-Transitions-1-Promoting-Healthy-Diets.pdf\">zero gross expansion in the area of land under cultivation for food production by 2025, reduction in total territories used for livestock of about one-third by 2030, and a consequent freeing up of nearly 500 million hectares of land for natural ecosystem restoration by the same date</a>.” According to the WEF, in addition to benefitting the environment, such changes will also be economically advantageous, as “<a href=\"https://www.weforum.org/projects/100m-farmers-transitioning-towards-net-zero-nature-positive-food-systems\">changing the way we produce and consume food</a> could create <a href=\"https://www.foodandlandusecoalition.org/global-report/\">USD 4.5 trillion a year</a> in new business opportunities.”</p>\n<p>In order to accelerate the transformation of farming over the coming decades, BASF calls for requiring “<a href=\"https://agriculture.basf.com/global/en/sustainable-agriculture/climate-smart-farming.html\">farmers to decrease their environmental impact</a>” by reducing “<a href=\"https://www.basf.com/global/en/media/news-releases/2020/11/p-20-365.html\">CO2 emissions per ton of crop by 30 percent</a>,” and applying “<a href=\"https://www.basf.com/global/en/media/news-releases/2020/11/p-20-365.html\">digital technologies to more than 400 million hectares of farmland</a>.” BASF also supports the wide use of a number of new products, including “nitrogen management products,” herbicides, “new crop varieties,” “biological inoculants and innovative digital solutions,” so as to make farmers “<a href=\"https://www.basf.com/global/en/media/news-releases/2020/11/p-20-365.html\">more carbon efficient and resilient to volatile weather conditions</a>.” It is estimated that such changes would “<a href=\"https://www.basf.com/global/en/media/news-releases/2020/11/p-20-365.html\">contribute significantly to the BASF Group target of €22 billion in sales by 2025</a>.”</p>\n<p>Meanwhile, <a href=\"https://www.syngenta.com/sites/syngenta/files/presentation-and-publication/updated/public%20policy%20positions/Syngenta-policy-position-soil.pdf\">Syngenta</a>, the world’s second-largest agrochemical enterprise (after Bayer), which is owned by a Chinese state-owned company called ChemChina, focuses on “carbon neutral agriculture” under the pretense of “combatting climate change.” More precisely, it supports “<a href=\"https://www.syngenta.com/en/sustainability/good-growth-plan\">providing technologies, services, and training to farmers</a>,” as well as the further development of new gene-edited seeds that would lower the emission of CO2. According to Syngenta, “gene-edited crops” will be widely used and cultivated across the globe “<a href=\"https://www.syngenta-us.com/thrive/research/future-of-farming.html\">by 2050</a>.”</p>\n<p>This company also promotes “<a href=\"https://www.syngentagroup.com/en/our-stories/tackling-food-and-climate-crises-regenerative-agriculture\">a transformation toward regenerative agriculture</a>,” which is claimed to “<a href=\"https://www.syngentagroup.com/en/our-stories/tackling-food-and-climate-crises-regenerative-agriculture\">lead to more food grown on less land; reduced agricultural greenhouse gas emissions; increased biodiversity; and enhanced soil health</a>,” though there is scant scientific evidence or long-term data to back up these assertions. Nonetheless, Syngenta argues that the world needs “<a href=\"https://www.syngentagroup.com/en/our-stories/tackling-food-and-climate-crises-regenerative-agriculture\">governments and media … to encourage widespread adoption</a>” of regenerative practices by as many farmers as possible.</p>\n<p>Bayer also advocates for regenerative agriculture to help “<a href=\"https://www.bayer.com/en/agriculture/climate-change\">farmers significantly reduce the amount of greenhouse gas their operations emit, while also removing carbon from the atmosphere</a>.” It further claims that it is necessary “<a href=\"https://www.bayer.com/en/innovation/breakthrough-innovation-forum\">to shift to a regenerative approach and make crops more resilient to climate impacts</a>.” Additionally, much like Syngenta, Bayer supports the development of “<a href=\"https://www.bayer.com/en/investors/agriculture-megatrends\">new gene editing technologies</a>” in order to reduce “the environmental footprint of global agriculture.” Looking ahead, Bayer foresees that, “<a href=\"https://www.bayer.com/en/innovation/breakthrough-innovation-forum\">in agriculture, biotechnology will be a critical enabler</a>” that will be used to “<a href=\"https://www.bayer.com/en/innovation/breakthrough-innovation-forum\">feed the 10 billion people that will be on the planet by 2050 while at the same time fighting the impact of climate change</a>.”</p>\n<p>Similar to Bayer, BASF, and Syngenta, DuPont also seeks to contribute to decreasing “<a href=\"https://www.weforum.org/organizations/dupont\">dependence on fossil fuels, and protecting life and the environment</a>.” Its response primarily focuses on facilitating the production and consumption of alternative protein sources that can reproduce “<a href=\"https://www.dupontnutritionandbiosciences.com/product-range/protein/soy-protein-applications/meat-applications.html\">the texture and appearance of meat fibers, and can be used to extend or replace meat or fish</a>.” <a href=\"https://www.dupont.com/about/sustainability/acting-on-climate/low-carbon-food-alternatives.html\">DuPont pointed out that</a> “in 2016, Americans consumed about 26 kg of beef per capita, at least half of which was eaten in the form of a hamburger. Replacing just half of America’s burger meat with SUPRO® MAX protein,” which has <a href=\"https://www.dupontnutritionandbiosciences.com/product-range/protein/soy-protein-applications/meat-alternatives.html\">a carbon footprint that is up to eighty times lower than dairy and meat proteins</a>, is equivalent removing “<a href=\"https://www.dupontnutritionandbiosciences.com/product-range/protein/soy-protein-applications/meat-alternatives.html\">more than 15 million mid-sized cars from the road</a>.”</p>\n<p>Some of the world’s most powerful multinational agrichemical corporations have benefitted immensely from international trade agreements that put their interests ahead of those of small- and medium-size farms, as well as the masses, when it comes to transforming the food and agriculture sectors. In particular, the World Trade Organization’s agreement on trade-related aspects of intellectual property rights (TRIPS), which was adopted in 1994, played a major role in destroying the livelihoods of many farmers, while proving lucrative to agrichemical giants like BASF, Bayer, Dow Chemical, DuPont, and Syngenta. This is mainly because TRIPS has allowed for the patenting of seeds and plants.</p>\n<p>As a result, native herbs and plants in a number of different countries, many of which had previously been farmed for generations, became the sole properties of powerful agrichemical multinational corporations. After plants and herbs have been patented, local farmers are forbidden from engaging in the traditional and longstanding practices of saving and replanting their own seeds. Instead, they are required to pay the patent holding corporations for the same seeds that they had previously produced, saved, replanted, and exchanged at no cost.</p>\n<p>Powerful agrichemical multinational corporations have also furthered their own interests and agendas by exerting unprecedented influence over research and development in the food industry, while ignoring any findings demonstrating that their business practices were harmful to the natural environment. In particular, some of these major agrichemical corporations have <a href=\"https://books.google.com/books?id=TlQMEAAAQBAJ&printsec=frontcover&dq=The+Rise+of+Neo-liberalism+and+the+Decline+of+Freedom&hl=en&newbks=1&newbks_redir=1&sa=X&ved=2ahUKEwjx7riD5Y37AhUGKlkFHRayDC0QuwV6BAgNEAc\">focused</a> their efforts and resources on studying “genetically modified organisms (GMOs), the creation of stronger pesticides and synthetic fertilizers, and defending the performance of these products.”</p>\n<p>They have also <a href=\"https://books.google.com/books?id=TlQMEAAAQBAJ&printsec=frontcover&dq=The+Rise+of+Neo-liberalism+and+the+Decline+of+Freedom&hl=en&newbks=1&newbks_redir=1&sa=X&ved=2ahUKEwjx7riD5Y37AhUGKlkFHRayDC0QuwV6BAgNEAc\">supported</a> the expansion of GMO crops with the knowledge that their cultivation involves “the application of larger quantities” of “synthetic fertilizers and pesticides,” which has led to large amounts of toxic chemicals contaminating soil and water sources. Basically, these agrichemical corporations have been largely responsible for creating many of same environmental problems that they now claim need to be urgently solved through Agenda 2030.</p>\n<p>There is a real possibility that the radical and large-scale transformations of the entire food industry and human eating habits being pushed by the social engineers of Agenda 2030 are leading the masses toward a dramatic decrease in living standards. Lessons from the totalitarian regimes of the twentieth century revealed that it is very difficult to fix big mistakes attributed to the large-scale central planning of social engineers, because doing so often requires “major social transformation” or the “remodelling the whole of society,” which can result in widespread unforeseen consequences or events, major destructive outcomes, and “inconvenience to many people,” in the <a href=\"https://books.google.com/books?id=Fc03vC5k7BgC&printsec=frontcover&dq=The+Poverty+of+Historicism&hl=en&newbks=1&newbks_redir=1&sa=X&ved=2ahUKEwi21d705Y37AhUmEFkFHaciAe4QuwV6BAgQEAc\">words</a> of Karl R. Popper.</p>\n<p>The intense and coordinated international effort to facilitate an artificially designed transformation of the global food industry, based on Agenda 2030, is a testimony to the fact that we are witnessing the pendulum of civilization swinging back in many advanced societies, where striving to achieve a comfortable life could rapidly be replaced by a struggle for bare necessities in a lower level of existence, which is not supposed to occur in advanced societies.</p>\n<p>The masses need to be made to realize that the social engineers of Agenda 2030 are “false prophets,” who are misguiding them to the point where they will be “haunted by the specter of death from starvation.” This may well lead to the emergence of “irreconcilable dissensions within society,” whereby food riots, conflicts, and violence could inevitably “result in a complete disintegration of all societal bonds,” as Ludwig von Mises <a href=\"https://cdn.mises.org/Human%20Action_3.pdf\">put it</a>.</p>\n\n",
  "author": "Birsen Filip",
  "enclosure": "",
  "guid": 60747,
  "pubDate": "Sat, 05 Nov 2022 06:00:00 -0500",
  "source": "Mises Wire"
}