{
  "title": "Editorial Review of “Building Industrial Digital Twins”",
  "link": "http://rocketdatascience.org/?p=1714",
  "comments": "http://rocketdatascience.org/?p=1714#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Sat, 24 Sep 2022 21:18:12 +0000",
  "category": [
    "Uncategorized",
    "Analytics",
    "Data Science"
  ],
  "guid": "http://rocketdatascience.org/?p=1714",
  "description": "I was asked by the publisher to provide an editorial review of the book “Building Industrial Digital Twins: Design, develop, and deploy digital twin solutions for real-world industries using Azure Digital Twins“, by Shyam Varan Nath and Pieter van Schalkwyk. For this, I received a complimentary copy of the book and no other compensation. Let [&#8230;]",
  "content:encoded": "<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><a href=\"https://amzn.to/3fl195P\" target=\"_blank\" rel=\"noreferrer noopener\"><img width=\"833\" height=\"1024\" src=\"http://rocketdatascience.org/wp-content/uploads/2022/09/387B0CD6-491A-4065-963B-CF79109FD2E2-833x1024.jpeg\" alt=\"\" class=\"wp-image-1715\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2022/09/387B0CD6-491A-4065-963B-CF79109FD2E2-833x1024.jpeg 833w, http://rocketdatascience.org/wp-content/uploads/2022/09/387B0CD6-491A-4065-963B-CF79109FD2E2-244x300.jpeg 244w, http://rocketdatascience.org/wp-content/uploads/2022/09/387B0CD6-491A-4065-963B-CF79109FD2E2-768x945.jpeg 768w, http://rocketdatascience.org/wp-content/uploads/2022/09/387B0CD6-491A-4065-963B-CF79109FD2E2-624x767.jpeg 624w, http://rocketdatascience.org/wp-content/uploads/2022/09/387B0CD6-491A-4065-963B-CF79109FD2E2.jpeg 1170w\" sizes=\"(max-width: 833px) 100vw, 833px\" /></a><figcaption><a rel=\"noreferrer noopener\" href=\"https://amzn.to/3fl195P\" target=\"_blank\">https://amzn.to/3fl195P</a></figcaption></figure></div>\n\n\n<p>I was asked by the publisher to provide an editorial review of the book “Building Industrial Digital Twins: Design, develop, and deploy digital twin solutions for real-world industries using Azure Digital Twins“, by Shyam Varan Nath and Pieter van Schalkwyk. For this, I received a complimentary copy of the book and no other compensation.</p>\n\n\n\n<p>Let us begin…</p>\n\n\n\n<p>This book is a very timely contribution to the world of industrial digital transformation. The digital twin is more than a data collector. It is an insight engine, providing not only data for descriptive and diagnostic analytics applications, but also providing essential data for predictive and prescriptive analytics applications. This is all fueled and facilitated by data flows across processes, products, and people&#8217;s activities, used in synergy with computational models and simulations of the system being digitally twinned. In order to help an organization get started with a DT (digital twin), this book outlines the process of building the MVT (Minimum Viable Twin). All phases of the MVT process are discussed: strategy, designs, pilot, implementation, test, validation, operations, and monitoring.&nbsp;</p>\n\n\n\n<p>This book knows and forcefully proves what is the enabler and value producer of digital anything (especially and most emphatically the DT)&nbsp;—&nbsp;it is all about the data and the simulation&nbsp;—&nbsp;that’s business modeling at its finest, incorporating the best of technology (physical assets, sensors, and cloud), techniques (analytics, algorithms, and modeling), and talent (culture, people, and strategic plans).</p>\n\n\n\n<p>There were many themes and topics (both broad and specific) that fascinated me and kept me engaged in discovering serendipitous knowledge nuggets throughout this book. Here are a few:&nbsp;</p>\n\n\n\n<p>1) Azure DT, whose cloud-based PaaS (Platform-as-a-Service) provides a viable, scalable, and accessible launchpad for DTaaS in any organization.</p>\n\n\n\n<p>2) Streaming sensor data from the IoT (Internet of Things) and IIoT (Industrial IoT) become the source for an IoC (Internet of Context), ultimately delivering Insights-aaS, Context-aaS, and Forecasting-aaS.</p>\n\n\n\n<p>3) The consistent emphasis on and elaboration of key DT value propositions, requirements, and KPI tracking.</p>\n\n\n\n<p>4) The DT Canvas (chapter 4)!</p>\n\n\n\n<p>5) Helpful discussions of phased DT deployments, prototypes, pilots, feedback, and validation.</p>\n\n\n\n<p>6) Specific Industry 4.0 examples, with constant reminders that’s it all about the data plus analytics!</p>\n\n\n\n<p>7) Forward-looking DTs in the industrial enterprise.</p>\n\n\n\n<p>Beyond being a technical how-to manual (though it is definitely that), this book delivers so much more! It is truly a business digital transformation manual.</p>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1714",
  "slash:comments": 0
}