{
  "title": "Lead Like Mitch: Lessons on Leadership in Higher Education from Mitch Daniels",
  "link": "https://www.aei.org/education/lead-like-mitch-lessons-on-leadership-in-higher-education-from-mitch-daniels/",
  "dc:creator": "George Pierson",
  "pubDate": "Thu, 03 Nov 2022 18:07:22 +0000",
  "category": [
    "Education",
    "Higher Education",
    "college",
    "Higher education",
    "Higher Education Reform"
  ],
  "guid": "https://www.aei.org/?p=1008664731",
  "description": "<p>We should aim to honor Mitch Daniels' contributions to higher education by employing the leadership practices he exemplified to help our broader system of higher education work to better serve students of this nation.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/education/lead-like-mitch-lessons-on-leadership-in-higher-education-from-mitch-daniels/\">Lead Like Mitch: Lessons on Leadership in Higher Education from Mitch Daniels</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Last week I had the honor and pleasure of speaking with Mitch Daniels, former governor of Indiana and outgoing president of Purdue University. We <a href=\"https://www.c-span.org/video/?523833-1/purdue-university-president-mitch-daniels-higher-education\" target=\"_blank\" rel=\"noreferrer noopener\">invited President Daniels to AEI</a> to celebrate his <a href=\"https://www.aei.org/education/the-end-of-an-era-mitch-daniels-to-step-down-from-purdue-presidency/\" target=\"_blank\" rel=\"noreferrer noopener\">impressive tenure</a> at the helm of Purdue, but also to learn from his successes—ranging from the 10-year freeze on tuition to becoming a leading institution in the movement to protect free speech on college campuses. In speaking with President Daniels, I observed three characteristics of his leadership that I believe contributed to his success and could serve other leaders well in efforts to better higher education across the United States.</p>\n\n\n\n<p><strong>Measure outcomes and hold your institution accountable</strong>. Accountability is central to Daniels’ leadership style. When first Governor of Indiana, one of his top priorities was fixing the Department of Motor Vehicles—a piece of state government that touched almost every citizen.</p>\n\n\n\n<p>In doing so, he timed the duration of every transaction and printed it on the customer’s receipt. The point was to make it impossible for employees and managers to hide from the truth, good or bad, about the quality of the service they were providing. He applied the same principles in his leadership at Purdue, demanding maintenance of quality while he simultaneously grew Purdue’s student body, faculty, and presence in the community. In one of the initiatives he led, the <a href=\"https://www.purdue.edu/backaboiler/\" target=\"_blank\" rel=\"noreferrer noopener\">Back-a-Boiler</a> program, Daniels created a similar or even harsher mechanism of accountability for the institution. The program was complex, but in essence its creation meant that Purdue only got paid when the students succeeded.&nbsp;</p>\n\n\n\n<p><strong>Embrace innovation and change</strong>. Throughout his political career, Daniels embraced the role of change maker and he brought that mindset with him to Purdue. In a sector often characterized by stagnation, he brought innovation to campus and challenged well-worn beliefs about how the institution should operate.</p>\n\n\n\n<p>The changes he brought to campus weren’t changes for the sake of change. They were often simple ideas that made a profound difference in the lives of students they touched. For example, President Daniels managed to keep Purdue’s tuition flat for a full 10 years, when prior price hikes had been levied every academic year for over three decades before his arrival on campus. Challenging the status quo and embracing necessary change made Daniels’ tenure at Purdue exceptional and would likely go a long way in improving outcomes at institutions across the nation.</p>\n\n\n\n<p><strong>“Boots on the ground” leadership</strong>. Throughout his career, Daniels connected with the “product”: He has never been the type of leader who hides in his office or behind staff. And in the case of higher education, that meant getting to know and understand students. Daniels met and interacted with thousands of students during his time at Purdue and many of the initiatives he implemented during his presidency were inspired by what he learned in doing so.</p>\n\n\n\n<p>Daniels made a mark on Purdue, but also on the broader realm of higher education. When he leaves office at the end of this year, the industry will lose an incredible leader. We should aim to honor his contributions to higher education by employing the leadership practices he exemplified to help our broader system of higher education work to better serve students of this nation.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/education/student-loan-cancellation-update/\">Student Loan Cancellation Update</a> | <a href=\"https://www.aei.org/education/the-hidden-landmine-in-bidens-student-loan-announcement/\">The Hidden Landmine in Biden’s Student Loan Announcement</a> | <a href=\"https://www.aei.org/education/3-things-to-know-about-the-september-jobs-report/\">3 Things to Know About the September Jobs Report</a> | <a href=\"https://www.aei.org/education/white-house-rescinds-student-loan-forgiveness-for-as-many-as-four-million-borrowers/\">White House Rescinds Student Loan Forgiveness for as Many as Four Million Borrowers</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/education/lead-like-mitch-lessons-on-leadership-in-higher-education-from-mitch-daniels/\">Lead Like Mitch: Lessons on Leadership in Higher Education from Mitch Daniels</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}