{
  "title": "66: LoP Round-Table on Pretending w/Marsha Shandur, Charles Gupton, and Rick Charlie",
  "pubDate": "Thu, 26 Jan 2017 03:05:54 +0000",
  "guid": "427981f921c7a24b0624eaf0ef205dec",
  "link": "https://lifeonpurpose.libsyn.com/66-lop-round-table-on-pretending-wmarsha-shandur-charles-gupton-and-rick-charlie",
  "itunes:image": "",
  "description": "<p><strong>Life on Purpose Episode #66</strong> is the long-promised return of the <strong>LoP Round-Table</strong>! For my third RT, I was joined by <strong>Marsha Shandur</strong>, <strong>Charles Gupton</strong>, and <strong>Rick Charlie</strong>. They are each storytellers and creatives who work in a variety of different mediums <em>(podcasts, storytelling, blogs, photos, video)</em> and each use prompts on social media to examine the human condition and show that <em>\"I Don't Have It All Together\"</em>, as Marsha's weekly Tuesday post proves!<br /> <br /> They joined me for an in-depth conversation on the topic of \"<strong>pretending</strong>\" — both online and in-person — including examining why we do it, what's actually behind the <em>\"look how cool I am\"</em> postings many of us make, and what purpose is pretending serving? We also discussed practical tips for being more authentic, intentional, and vulnerable in both your online and IRL interactions.<br /> <br /> This discussion was prompted by the following Facebook post from <strong>Rick Charlie</strong>, based on a question originally asked by author and motivational speaker <strong>Simon Sinek:</strong><br /> <br /> <em>Something to think about: How much of your time and energy is put into pretending?</em><br /> <em>Pretending things are okay, when they are not.</em><br /> <em>Pretending there is not pain, when inside you hurt so much. Pretending that you know what you are doing, yet are actually terrified of the next step.</em><br /> <em>Pretending you have a really good life, but you are totally unsatisfied in it.</em><br /> <em>Pretending that all those past things don't affect you, yet they really continue to plague you like an addiction you can't shake.</em><br /> <em>Pretending that you have it all together when you don't even have a clue what it all is in the first place.</em><br /> <em>How.Much.Energy?</em><br /> <br /> <strong>About LoP Round-Table #3 Guests:</strong><br /> <br /> <strong>Marsha Shandur</strong> is a Storytelling Coach, Memory Scavenger, and Networking Mentor at Yes Yes Marsha as well as the Benevolent Dictator at True Stories Told Live Toronto.<br /> <br /> To learn more about Marsha and her work, visit: <a href= \"http://www.yesyesmarsha.com/\" target= \"_blank\">http://www.yesyesmarsha.com/</a>.<br /> <br /> <strong>Charles Gupton</strong> is a photographer, videographer, and visual storyteller at Charles Gupton Productions. He also produces the The Creator's Journey podcast, on which I'm honored to have been a guest.<br /> <br /> To learn more about Charles and his work, visit: <a href= \"http://www.charlesgupton.com/\" target= \"_blank\">http://www.charlesgupton.com/</a>.<br /> <br /> <strong>Rick Charlie</strong> is a computer forensics expert who knows how to ask probing questions about life, including the prompt that was the inspiration for this discussion.<br /> <br /> To learn more about Rick and his work, visit: <a href= \"http://rickcharlie.com/\" target= \"_blank\">http://rickcharlie.com/</a>.</p>",
  "content:encoded": "<p>Life on Purpose Episode #66 is the long-promised return of the LoP Round-Table! For my third RT, I was joined by Marsha Shandur, Charles Gupton, and Rick Charlie. They are each storytellers and creatives who work in a variety of different mediums <em>(podcasts, storytelling, blogs, photos, video)</em> and each use prompts on social media to examine the human condition and show that <em>\"I Don't Have It All Together\"</em>, as Marsha's weekly Tuesday post proves!  They joined me for an in-depth conversation on the topic of \"pretending\" — both online and in-person — including examining why we do it, what's actually behind the <em>\"look how cool I am\"</em> postings many of us make, and what purpose is pretending serving? We also discussed practical tips for being more authentic, intentional, and vulnerable in both your online and IRL interactions.  This discussion was prompted by the following Facebook post from Rick Charlie, based on a question originally asked by author and motivational speaker Simon Sinek:  <em>Something to think about: How much of your time and energy is put into pretending?</em> <em>Pretending things are okay, when they are not.</em> <em>Pretending there is not pain, when inside you hurt so much. Pretending that you know what you are doing, yet are actually terrified of the next step.</em> <em>Pretending you have a really good life, but you are totally unsatisfied in it.</em> <em>Pretending that all those past things don't affect you, yet they really continue to plague you like an addiction you can't shake.</em> <em>Pretending that you have it all together when you don't even have a clue what it all is in the first place.</em> <em>How.Much.Energy?</em>  About LoP Round-Table #3 Guests:  Marsha Shandur is a Storytelling Coach, Memory Scavenger, and Networking Mentor at Yes Yes Marsha as well as the Benevolent Dictator at True Stories Told Live Toronto.  To learn more about Marsha and her work, visit: <a href= \"http://www.yesyesmarsha.com/\" target= \"_blank\">http://www.yesyesmarsha.com/</a>.  Charles Gupton is a photographer, videographer, and visual storyteller at Charles Gupton Productions. He also produces the The Creator's Journey podcast, on which I'm honored to have been a guest.  To learn more about Charles and his work, visit: <a href= \"http://www.charlesgupton.com/\" target= \"_blank\">http://www.charlesgupton.com/</a>.  Rick Charlie is a computer forensics expert who knows how to ask probing questions about life, including the prompt that was the inspiration for this discussion.  To learn more about Rick and his work, visit: <a href= \"http://rickcharlie.com/\" target= \"_blank\">http://rickcharlie.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "52:13",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Life on Purpose Episode #66 is the long-promised return of the LoP Round-Table! For my third RT, I was joined by Marsha Shandur, Charles Gupton, and Rick Charlie. They are each storytellers and creatives who work in a variety of different mediums..."
}