{
  "title": "Shell helium-burning hot subdwarf B stars as candidates for blue large-amplitude pulsators. (arXiv:2211.01564v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01564",
  "description": "<p>Blue large-amplitude pulsators (BLAPs) are a newly discovered type of\nvariable star. Their typical pulsation periods are on the order of a few tens\nof minutes, with relatively large amplitudes of 0.2-0.4 mag in optical bands,\nand their rates of period changes are on the order of $10^{-7} yr^{-1}$ (both\npositive and negative). They are extremely rare objects and attempts to explain\ntheir origins and internal structures have attracted a great deal of attention.\nPrevious studies have proposed that BLAPs may be pre-white dwarfs, with masses\naround $0.3M_\\odot$, or core-helium-burning stars in the range of $\\sim\n0.7-1.1M_\\odot$. In this work, we use a number of MESA models to compute and\nexplore whether BLAPs could be explained as shell helium-burning subdwarfs type\nB (SHeB sdBs). The models that best match existing observational constraints\nhave helium core masses in the range of $\\sim 0.45-0.5M_\\odot$. Our model\npredicts that the positive rate of period change may evolve to negative. The\nformation channels for SHeB sdBs involve binary evolution and although the vast\nmajority of BLAPs do not appear to be binaries (with the exception of HD\n133729), the observational constraints are still very poor. Motivated by these\nfindings, we explored the Roche lobe overflow channel. Of the 304 binary\nevolution models we computed, about half of them are able to produce SHeB sdBs\nin long-period binaries that evade detection from the limited observations that\nare currently available.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Xiong_H/0/1/0/all/0/1\">H.Xiong</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Casagrande_L/0/1/0/all/0/1\">L.Casagrande</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chen_X/0/1/0/all/0/1\">X.Chen</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Vos_J/0/1/0/all/0/1\">J.Vos</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Zhang_X/0/1/0/all/0/1\">X.Zhang</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Justham_S/0/1/0/all/0/1\">S.Justham</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Li_J/0/1/0/all/0/1\">J. Li</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Wu_T/0/1/0/all/0/1\">T.Wu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Li_Y/0/1/0/all/0/1\">Y.Li</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Han_Z/0/1/0/all/0/1\">Z.Han</a>"
}