{
  "title": "506:  Harry and Tom Riddle, More Security Nightmares, and Other MuggleMail",
  "link": "https://audioboom.com/posts/7828008",
  "itunes:episode": 506,
  "itunes:title": "Harry and Tom Riddle, More Security Nightmares, and Other MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3840,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We asked our listeners, following <a href=\"https://www.mugglecast.com/episode-505-best-harry-potter-fan-films/\">last week's discussion</a>, what fan films they would like to see made.</li>\n<li>From Arthur and Molly's courtship, to Regulus' thwarting of Voldemort, the hosts discuss what the best plots yet to be seen could look like.</li>\n<li>Since Ilvermorny has been more or less forgotten about by the author, should fans take it back / make it their own?</li>\n<li>This week's episode is all MuggleMail!</li>\n<li>Theories on how Ron inherited Charlie's wand, and similarities between Hogwarts and boarding school arrive in hushed tones in new voicemails from our listeners.</li>\n<li>We've received a litany of responses to our Security Nightmare series, agreeing that Hagrid, the Floo Network, the troll, and the Chamber of Secrets all prove Hogwarts is not safe.</li>\n<li>We hear from a listener who homeschools her kid and loves sharing Harry Potter as a proud parent.</li>\n<li>MuggleMail covers other topics such as: Could Harry and a Young Tom Riddle be romantically involved? Could Mrs. Norris be a secret Animagus? And how one listener feels about the women of Harry Potter.</li>\n<li>We answer a vintage email from August 2007! Where is 13-year-old Blake now?</li>\n<li>Quizzitch: What secret does the Grey Lady say Rowena Ravenclaw kept from the other founders? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by BetterHelp: Get 10% off your first month of therapy at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>\n</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 23 Mar 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-22:/posts/7828008",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}