{
  "title": "Episode 110: Narcissism Among Celebrities, on Facebook and in Shakespeare",
  "pubDate": "Sun, 22 Nov 2009 22:29:16 +0000",
  "guid": "episode-110-narcissism-among-celebrities-on-face",
  "link": "http://www.thepsychfiles.com/2009/11/episode-110-narcissism-among-celebrities-on-facebook-and-in-shakespeare/",
  "itunes:image": "",
  "description": "Are celebrities really more narcissistic than you are?  Is your Facebook page telling the world that you are a narcissist? And finally: who is Shakespeare's most narcissistic character?  I'll give you a hint: the character can be found in Twelfth Night.  In this episode of The Psych Files I look at the concept of narcissism and how you can see it in everyday life.",
  "content:encoded": "Are celebrities really more narcissistic than you are?  Is your Facebook page telling the world that you are a narcissist? And finally: who is Shakespeare's most narcissistic character?  I'll give you a hint: the character can be found in Twelfth Night.  In this episode of The Psych Files I look at the concept of narcissism and how you can see it in everyday life.",
  "enclosure": "",
  "itunes:duration": "28:07",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,facebook,psychology,shakespeare,lecture,narcissism",
  "itunes:subtitle": "Are celebrities more narcissistic than you are? Is your Facebook page telling the world that you are a narcissist? And finally: who is Shakespeare's most narcissistic character? I'll give you a hint: the character can be found in Twelfth Night.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Are celebrities really more narcissistic than you are? Is your Facebook page telling the world that you are a narcissist? And finally: who is Shakespeare's most narcissistic character? I'll give you a hint: the character can be found in Twelfth Night. In this episode of The Psych Files I look at the concept of narcissism and how you can see it in everyday life."
}