{
  "title": "527 - May BROMA (Part 1)",
  "description": "<p>In the first part of this month’s bonus ROMA (BROMA), available to everyone, I talk about a new feature to help listeners find each other. I also talk about my thoughts concerning whether we’re all in some kind of simulation, the difference between sound and music, and my personal feelings about and experience with abortion.</p><p>Part 2 (where I talked about navigating unconventional relationship structures, when to “go for it” vs. when to play it safe, and when having sex with friends is dangerous) is for paid subscribers only. <a target=\"_blank\" href=\"https://chrisryan.substack.com/p/maybroma2\">Click here</a> to access it.</p><p>Here’s <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=7gUh8j5ui0o\">the doc</a> I mentioned about the dude living in the jungle in Hawaii.</p><p>Intro music “Brightside of the Sun,” by <a target=\"_blank\" href=\"https://basinandrange.bandcamp.com/track/brightside-of-the-sun\">Basin and Range</a>. “V Nebi,” by <a target=\"_blank\" href=\"https://www.spinaviluzri.cz/en\">Dirty Losers</a>; Outro: “Smoke Alarm,” by <a target=\"_blank\" href=\"https://www.carsieblanton.com/\">Carsie Blanton</a>.</p><p>Here’s the map feature and instructions for use:</p><p><strong>People who want to add their location on the map should use this link:</strong></p><p><a target=\"_blank\" href=\"https://facilmap.org/tspeaking.edit\">https://facilmap.org/tspeaking.edit</a></p><p>This link is for viewing only:</p><p><a target=\"_blank\" href=\"https://facilmap.org/tspeaking\">https://facilmap.org/tspeaking</a></p><p>The map is very easy to use:</p><p><strong>To add your location,</strong> click \"add\" in the upper right corner</p><p>-> click \"marker\"</p><p>-> click your location on the map</p><p>-> click \"edit data\" in the info box in the upper left corner.</p><p>- Write your name and description of yourself, don't forget to add contact info and/or social media links.</p><p>-> Done!</p><p><p>Tangentially Speaking with Chris Ryan is a reader-supported publication. To get access to bonus content including bonus episodes, newsletters, and exclusive blog posts, please become a paid subscriber.</p></p><p></p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/527-may-broma-part-1",
  "guid": "substack:post:55812997",
  "dc:creator": "Chris Ryan",
  "pubDate": "Fri, 20 May 2022 15:47:26 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:explicit": "No",
  "itunes:duration": 2392,
  "itunes:image": ""
}