{
  "title": "Episode 86 (video): Educational Games",
  "pubDate": "Sat, 21 Feb 2009 01:32:15 +0000",
  "guid": "episode-86-video-educational-games",
  "link": "http://www.thepsychfiles.com/2009/02/20/episode-86-video-educational-games/",
  "itunes:image": "",
  "description": "Can games really be educational?  They certainly addictive and engaging.  Can we harness this aspect of games and use it to learn?  In this video I show you why I believe the answer is yes.  Let's talk about what really good teaching is and what really good games are like.  Then I take you on a brief tour of what I believe are some of the best examples of great educational games.  This time on The Psych Files.",
  "content:encoded": "Can games really be educational?  They certainly addictive and engaging.  Can we harness this aspect of games and use it to learn?  In this video I show you why I believe the answer is yes.  Let's talk about what really good teaching is and what really good games are like.  Then I take you on a brief tour of what I believe are some of the best examples of great educational games.  This time on The Psych Files.",
  "enclosure": "",
  "itunes:duration": "25:46",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,games,educational,psychology",
  "itunes:subtitle": "Can games really be educational? Can we harness this aspect of games and use it to learn? In this video I show you why I believe the answer is yes. I take you on a brief tour of what I believe are some of the best examples of great educational games.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Can games really be educational? They certainly addictive and engaging. Can we harness this aspect of games and use it to learn? In this video I show you why I believe the answer is yes. Let's talk about what really good teaching is and what really good games are like. Then I take you on a brief tour of what I believe are some of the best examples of great educational games. This time on The Psych Files."
}