{
  "title": "ANDREW TATE AND DAVE PORTNOY GO TOE TO TOE — BFFs EP. 88",
  "description": "<p>We kick off the show with headlines with Monty Lopez's (Addison Rae's dad) cheating scandal and the fallout since, Doja Cat going after Stranger Thing's Noah Schnapp over posting her DM's asking about co-star Joseph Quinn, Zach Wilson's throwing bombs and banging moms, Bryce Hall saying he will fight Tayler Holder and who his new Tik Tok crush is, Addison Rae responding to Josh saying Charli D'Amelio would beat her in a cage match, Corinna Kopf's OnlyFans earnings being leaked by David Dobrik, trying to figure out what is going on with Amanda Diaz and Kio Cyr, and finish with Charli and Landon Barker updates.\n\nWe then get into BFFs corner where Pete Davidson denied Olivia O'Briens claims on our last show, Mia posting a comment that may or may not have been about Josh, Josh's disaster of a performance on Wildin' Out, and end with why Josh followed Huddy on his spam page.\n\nWe finish with our interview with Andrew Tate, and it is... something. We talk everything from his early days as a kickboxer, how he made his money, what his net worth actually is, and he gets into it with the BFFs over why is seen as sexist (and chaos ensues).\n\nSupport our sponsors!\n\nGametime: Download the Gametime app at https://barstool.link/GametimeApp and redeem code BFF for $20 off your first purchase (terms apply).\n\nWould: Shop Would at https://barstool.link/wouldBSS or at your local CVS.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "6187dbee-0e29-4730-b93c-9014a3e241b8",
  "pubDate": "Thu, 14 Jul 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:17:51",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}