{
  "title": "578: Chapter by Chapter Begins! Harry Deserves a Zoo Day (Sorcerer's Stone, Chapters 1-3)",
  "link": "https://audioboom.com/posts/8156244",
  "itunes:episode": 578,
  "itunes:title": "Chapter by Chapter Begins! Harry Deserves a Zoo Day (Sorcerer's Stone, Chapters 1-3)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5244,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week on MuggleCast we bring back the most heavily listener-requested segment, Chapter by Chapter! Join Andrew, Eric, Laura and Micah as they begin Sorcerer's / Philosopher's Stone with Chapters 1, 2 and 3! Our read-through of the <em>Potter</em> series contains segments both old AND new (complete with sound effects) and the hosts are all much older now than when they first started more than 16 years ago!<br>\n<br>\nOn this week's episode:<br>\n<br>\n\n</div>\n<ul>\n<li>Chapter by Chapter is rebooted! We first started the segment March 19, 2006 <a href=\"https://mugglecast.com/episode-31/\">on Episode 31</a> (transcript <a href=\"https://mugglecast.com/transcript-031/\">here</a>).</li>\n<li>What to expect from CbyC includes: 7 Word Summaries, the same (but older) hosts, and brand new segments and games.</li>\n<li>Main Discussion Part 1: Sorcerer's Stone Chapter One, \"The Boy Who Lived.\"</li>\n<li>7 Word Summary: Vernon thinks that people are behaving oddly</li>\n<li>Eric asks, \"What are the wizards and witches thinking?! The Statute of Secrecy is at stake here!\"</li>\n<li>Laura makes an excellent point about what humans do after being cooped up and being afraid for long.</li>\n<li>Was it safe for Dumbledore to leave Harry unattended on a doorstep overnight?</li>\n<li>Despite the magical protection, we ask, WERE the Dursleys the best option for Dumbledore to choose? Why didn't Albus raise Harry himself?</li>\n<li>Main Discussion Part 2: Chapter Two, \"The Vanishing Glass.\"</li>\n<li>7 Word Summary: Dudley can’t understand why he sucks badly</li>\n<li>Having read the whole series, how do we account for the magic that Harry did when he was young?</li>\n<li>Where exactly did the \"Vanished\" glass go? In the book, it is not put back.</li>\n<li>Would the zoo be able to stay in business after such an incident?</li>\n<li>The hosts get depressed about the Dursleys' abuse of Harry, which hits differently now!</li>\n<li>Main Discussion Part 3: Chapter Three, \"The Letters From No One.\"</li>\n<li>7 Word Summary: Chaos awaits the Dursleys everywhere and above</li>\n<li>How is it exactly that the letters change addresses for Harry? Is Vernon right, and are the Dursleys being watched?</li>\n<li>Why don't Petunia and Vernon just tell Harry who/what he is? Why are they SO resistant?</li>\n<li>The hosts play <em>What If?</em> regarding Harry opening his Hogwarts letter while in the foyer.</li>\n<li>Most Valuable Chapter/Character of the Week returns</li>\n<li>Next week's Quizzitch question: Who are the four known members of Dudley’s Gang, from Chapter 3 of Book 1?</li>\n<li>On next week's episode: Chapters 4-6 of Harry Potter Book One</li>\n<li>This week's episode is brought to you by Indeed (Go to <a href=\"https://www.indeed.com/mugglecast\">Indeed.com/mugglecast</a> to start hiring now), BetterHelp (Go to <a href=\"https://betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> and get 10% off your first month), and MeUndies (Go to <a href=\"https://www.meundies.com/mugglecast\">MeUndies.com/mugglecast</a> for 20% off your first order)</li>\n</ul>\n",
  "pubDate": "Tue, 13 Sep 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-12:/posts/8156244",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}