{
  "title": "X-Rays Could Carry Quantum Signals Across the Stars",
  "link": "https://spectrum.ieee.org/search-for-extraterrestrial-intelligence",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/colorful-streams-of-light.jpg?id=30142338&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>\n\tQuantum signals may possess a number of advantages over regular forms of communication, leading scientists to wonder if humanity was not alone in discovering such benefits. Now a new study suggests that, for hypothetical extraterrestrial civilizations, quantum transmissions using X-rays may be possible across interstellar distances.\n</p><p>\n\tQuantum communication relies on a quantum phenomenon known as \n\t<u><a href=\"https://spectrum.ieee.org/what-is-quantum-entanglement\" target=\"_self\">entanglement</a></u>. Essentially, two or more particles such as photons that get “linked” via entanglement can, in theory, influence each other instantly no matter how far apart they are.\n</p><p>\n\tEntanglement is essential to \n\t<u><a href=\"https://spectrum.ieee.org/quantum-teleportation\" target=\"_self\">quantum teleportation</a></u>, in which data can essentially disappear one place and reappear someplace else. Since this information does not travel across the intervening space, there is no chance the information will be lost.\n</p><p>\n\tTo accomplish quantum teleportation, one would first entangle two photons. Then, one of the photons—the one to be teleported—is kept at one location while the other is beamed to whatever destination is desired.\n</p><p>\n\tNext, the photon at the destination's quantum state—which defines its key characteristics—is analyzed, an act that also destroys its quantum state. Entanglement will lead the destination photon to prove identical to its partner. For all intents and purposes, the photon at the origin point “teleported” to the destination point—no physical matter moved, but the two photons are physically indistinguishable.\n</p><p>\n\tAnd to be clear, quantum teleportation cannot send information faster than the speed of light, because the destination photon must still be transmitted via conventional means.\n</p><p>\n\tOne weakness of quantum communication is that entanglement is fragile. Still, researchers have successfully transmitted entangled photons that remained stable or “<u><a href=\"https://spectrum.ieee.org/longlasting-qubits\" rel=\"noopener noreferrer\" target=\"_blank\">coherent</a></u>” enough for quantum teleportation across distances as great as <u><a href=\"https://www.nature.com/articles/nature23675/\" rel=\"noopener noreferrer\" target=\"_blank\">1,400 kilometers</a></u>.\n</p><p>\n\tSuch findings led theoretical physicist \n\t<a href=\"https://www.ph.ed.ac.uk/people/arjun-berera\" target=\"_blank\">Arjun Berera</a> at the University of Edinburgh to wonder just how far quantum signals might stay coherent. First, he discovered <u><a href=\"https://arxiv.org/abs/2009.00356\" rel=\"noopener noreferrer\" target=\"_blank\">quantum coherence might survive interstellar distances within our galaxy</a></u>, and then he and his colleagues found <u><a href=\"https://arxiv.org/abs/2107.06914\" rel=\"noopener noreferrer\" target=\"_blank\">quantum coherence might survive intergalactic distances</a></u>.\n</p><p>\n\t“If photons in Earth’s atmosphere don’t decohere to 100 km, then in interstellar space where the medium is much less dense then our atmosphere, photons won’t decohere up to even the size of the galaxy,” Berera says.\n</p><p>\n\tIn the new study, the researchers investigated whether and how well quantum communication might survive interstellar distances. Quantum signals might face disruption from a number of factors, such as the gravitational pull of interstellar bodies, they note.\n</p><p>\n\tThe scientists discovered the best quantum communication channels for interstellar messages are X-rays. Such frequencies are easier to focus and detect across interstellar distances. (NASA has tested deep-space X-ray communication with its \n\t<a href=\"https://spectrum.ieee.org/nasa-wants-to-place-calls-to-deep-space-with-xrays\" target=\"_self\">XCOM</a> experiment.) The researchers also found that the optical and microwave bands could enable communication across large distances as well, albeit less effectively than X-rays.\n</p><p>\n\tAlthough coherence might survive interstellar distances, Berera does note quantum signals might lose fidelity. “This means the quantum state is sustained, but it can have a phase shift, so although the quantum information is preserved in these states, it has been altered by the effect of gravity.” Therefore, it may “take some work at the receiving end to account for these phase shifts and be able to assess the information contained in the original state.”\n</p><p>\n\tWhy might an interstellar civilization transmit quantum signals as opposed to regular ones? The researchers note that quantum communication may allow \n\t<a href=\"https://journals.aps.org/pra/abstract/10.1103/PhysRevA.51.2738\" rel=\"noopener noreferrer\" target=\"_blank\">greater data compression</a> and, in some cases, <a href=\"https://arxiv.org/abs/quant-ph/0607174\" rel=\"noopener noreferrer\" target=\"_blank\">exponentially</a> <a href=\"https://dl.acm.org/doi/10.1145/1007352.1007379\" rel=\"noopener noreferrer\" target=\"_blank\">faster</a> speeds than classical channels. Such a boost in efficiency might prove very useful for civilizations separated by interstellar distances.\n</p><p>\n\t“It could be that quantum communication is the main communication mode in an extraterrestrial's world, so they just apply what is at hand to send signals into the cosmos,” Berera says.\n</p><p>\n\tThe scientists detailed \n\t<u><a href=\"https://journals.aps.org/prd/abstract/10.1103/PhysRevD.105.123033\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online 28 June in the journal <em>Physical Review D</em>.\n</p>",
  "pubDate": "Mon, 18 Jul 2022 15:07:14 +0000",
  "guid": "https://spectrum.ieee.org/search-for-extraterrestrial-intelligence",
  "category": [
    "Extraterrestrial",
    "Entanglement",
    "Teleportation",
    "X-rays",
    "Coherence",
    "Decoherence",
    "Quantum communications"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}