{
  "title": "5: Episode 5",
  "link": "https://audioboom.com/posts/7316362",
  "itunes:episode": 5,
  "itunes:title": "Episode 5",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2236,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our September 03, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>While the debt Pettigrew owes to Harry is something to remember, will only one classroom scene in Goblet of Fire be an Unforgivable act? And, is your vote for the U.S. or U.K.? Which one deserves the world premiere? * Phone rings * The crew also tells the tale of how they got hooked on the boy wizard. Plus, is there a prized possession right under our noses — one of the Dark Lord’s Horcruxes hiding at Hogwarts? * Phone rings *<br>\n<br>\n\n</div>\n<div>From contest prize announcements to proper name pronouncements… all that and more ahead with Andrew, Ben, Eric, Jamie, and Kevin on this week’s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>We announce the prizes that can be won in our contest</li>\n<li>Andrew promotes the “Free iPod Book” found on our new downloading blog</li>\n<li>Thanks to “King of All Losers” for <a href=\"http://mugglenet.com/viewer/?image_location=nelsonsclass.jpeg\">this great illustration</a> of Andrew yelling at a child in Mr. Nelson’s class</li>\n<li>Eric raves about Ralph Fiennes’ role in The Constant Gardener</li>\n<li>The MuggleCasters look into scene priorities for GOF</li>\n<li>Jamie’s British Joke of the Day (“bee-side”!)</li>\n<li>Another exciting edition of Spy on Spartz</li>\n<li>Reasons for the world premiere in the UK?</li>\n<li>A special guest appearance by Jamie’s phone</li>\n<li>Does Voldemort know when one of his Horcruxes are destroyed?</li>\n<li>Is Tom Riddle’s trophy a possible Horcrux?</li>\n<li>Andrew apologizes for his terrible pronunciation of “Christine”</li>\n<li>Peter Pettigrew’s debt to Harry- playing a role in HP7?</li>\n<li>One listener asks how we got into reading the Potter series</li>\n<li>Trust the Brit, trust the Brit</li>\n</ul>\n",
  "pubDate": "Sat, 03 Sep 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316362",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}