{
  "id": "tag:blogger.com,1999:blog-8698702854482141883.post-917551632146901321",
  "published": "2022-09-13T08:00:00.002-07:00",
  "updated": "2022-10-21T07:27:38.954-07:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Google and NIST partner on nanotechnology development platform",
  "content": "<div class=\"separator\" style=\"clear: both;\">We’re proud to announce Google’s cooperative research and development agreement with the U.S. National Institute of Standards and Technology (NIST) to develop an open source testbed for nanotechnology research and development for American universities. NIST—a bureau of the U.S. Department of Commerce—will start by migrating their <a href=\"https://www.nist.gov/programs-projects/integrated-cmos-testbeds-nanoelectronics-and-machine-learning\">existing planarized wafer designs</a> to an open source framework, which can be manufactured in the U.S. on SkyWater Technologies’ open source 130nm process (<a href=\"https://github.com/google/skywater-pdk\">SKY130</a>). The physical wafers and source code will be available in the coming months. Together, NIST, Google, and the open source community will develop designs to facilitate research into both basic and applied science, including technology transfer into production with U.S. manufacturers. <br /><br /> Furthering Google’s goals to improve access to semiconductor technology, this agreement will provide<span style=\"text-align: left;\">&nbsp;academic researchers with unprecedented resources from a semiconductor foundry to enhance research into the physics of semiconductors and nanodevices. This includes their chemistry, defects, electrical properties, high frequency operation, and switching behavior, while reducing overall costs through economies of scale. Most importantly, this access enhances the technology transfer process by enabling researchers to develop new and emerging technologies using foundry resources, that can then be seamlessly transitioned into mass production since universities will already be using an industrially relevant platform. This will greatly improve scientist’s ability to move their technologies through the </span><a href=\"https://www.gao.gov/assets/gao-21-202.pdf\" style=\"text-align: left;\">tech-transfer “valley of death”</a><span style=\"text-align: left;\"> and into practical use.</span></div><p>Nanotechnology research has benefitted from silicon wafers that are normally used for chip manufacturing in a unique way. Instead of turning them into packaged microchips, their smooth, planarized surface makes a great substrate for building and testing nanoscale structures. This likewise helps test their transition into mass production. </p> <center><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFMpFLKrUNB2BPocnTyPomamfpqITTrWpAja76d6S-W8Ud52f_AUt58nRdzwPGMsWz0zHMgZKKwDvO4KXGxn-D3Q43MvdXLYAY__eI6_S8Zfx-8TWYdzBih2IFmvAt0pugEHNJvMAag156CmuyhbbfA8zH61s2svcqFQeJfg94stdsLxeuAWqKK8oI/s1600/image2.jpg\" style=\"display: block; margin-left: auto; margin-right: auto; padding: 1em 0px; text-align: center;\"><img alt=\"Picture of a full wafer using the SKY130 open source PDK.\" border=\"0\" data-original-height=\"1362\" data-original-width=\"1600\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFMpFLKrUNB2BPocnTyPomamfpqITTrWpAja76d6S-W8Ud52f_AUt58nRdzwPGMsWz0zHMgZKKwDvO4KXGxn-D3Q43MvdXLYAY__eI6_S8Zfx-8TWYdzBih2IFmvAt0pugEHNJvMAag156CmuyhbbfA8zH61s2svcqFQeJfg94stdsLxeuAWqKK8oI/s16000/image2.jpg\" style=\"width: 100%;\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><p><i>Picture of a full wafer using the SKY130 open source PDK.</i></p><p></p></td></tr></tbody></table><br /></center> The wafer for this platform has a number of different metrology structures, from parametric test structures based on simple transistor arrays—which can be probed in a <a href=\"https://ayscomdatatec.com/en/probe-stations/\">probe station</a>—to thousands of complex measurements that users can operate using synthesized digital circuits. Critically, the wafers will be available to universities in a 200 mm form factor, and mid-production planarized wafers with less than a single nanometer of surface roughness. Smooth, flat surfaces are critical for advanced manufacturing at small sizes. <p>NIST researchers are also ensuring that the wafers have photolithographic and electron beam alignment marks commonly found in university nanofabrication facilities, allowing the foundry silicon to be used directly by university researchers with ease. Metal pads on the surface will allow scientists to access the semiconductor transistors from the surface. </p><p>NIST scientists anticipate the nanotechnology accelerator platform will enhance scientific investigations into a diverse set of technologies, including memory devices (resistive switches, magnetic tunnel junctions, flash memories), artificial intelligence, plasmonics, semiconductor bioelectronics, thin film transistors and even quantum information science. </p> <center><div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiZMOkSMKcf-WHAqNtO54yCxn-gLNTm1I5zp1n8-JAIfggg-WzlqJ9uJIhPHJ9fePNqmb7TmrX-6Mhz0I0gM86CK7L0547Vjn4awmg1po-Z3alkjU-4LHGvQsG9kXbeH_GRd5LGkzkwpF31cPn3NkUf9CatzZIGLOlmWo5BMCA_Mt8buUXc_BTDlgUa/s1600/image1.png\" style=\"display: block; margin-left: 1em; margin-right: 1em; padding: 1em 0px; text-align: center;\"><img alt=\"Picture of a development die from Google 's OpenMPW program for the nanotechnology accelerator developed by NIST and the University of Michigan\" border=\"0\" data-original-height=\"1999\" data-original-width=\"1179\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiZMOkSMKcf-WHAqNtO54yCxn-gLNTm1I5zp1n8-JAIfggg-WzlqJ9uJIhPHJ9fePNqmb7TmrX-6Mhz0I0gM86CK7L0547Vjn4awmg1po-Z3alkjU-4LHGvQsG9kXbeH_GRd5LGkzkwpF31cPn3NkUf9CatzZIGLOlmWo5BMCA_Mt8buUXc_BTDlgUa/s1600/image1.png\" /></a></div></center><center><p id=\"imgCaption\">Picture of a development die from Google 's <a href=\"https://developers.google.com/silicon\">OpenMPW program</a> for the nanotechnology accelerator developed by NIST and the University of Michigan</p></center> <p>This program also benefits from Google’s previous contributions and support of the <a href=\"https://github.com/gdsfactory/gdsfactory\">GDSFactory</a> and <a href=\"https://github.com/idea-fasoc/OpenFASOC\">OpenFASOC</a> open source projects that help automate and shorten the construction of these important measuring devices from months to days. Ahead of the full wafer tapeout in 2023, NIST scientists, working with partners at the <a href=\"https://ece.engin.umich.edu/personnel/saligane-mehdi\">University of Michigan</a>, <a href=\"https://www.ece.cmu.edu/directory/bios/carley-rick.html\">Carnegie Mellon</a>, <a href=\"https://ireap.umd.edu/clark/staff/1448/Advait-Madhavan\">University of Maryland</a>, The <a href=\"https://www.seas.gwu.edu/gina-adam\">George Washington University</a>, and <a href=\"https://www.brown.edu/research/labs/zaslavsky/people/alex-zaslavsky\">Brown University</a> have been using Google's <a href=\"https://developers.google.com/silicon\">OpenMPW program</a> to develop and test preliminary circuits which they expect to include in the nanotechnology accelerator. Preliminary testing will help ensure the program’s goals are met with working circuits that best serve the scientific community.  </p><p>A key factor in cutting-edge research is reproducibility, or the ability for researchers from different institutions to repeat each other’s experiments and improve upon them. By migrating to an open source framework, researchers can more easily share reproducible results, contribute to the creation of open source datasets to enhance future simulation, and advance the scientific community’s state of the art of nanotechnology and semiconductor manufacturing. </p><p>NIST and Google will distribute the first production run of wafers to leading U.S. universities. Post-program, American scientists will be able to directly purchase the wafers from Skywater without license requirements, giving them the freedom to pursue their research without any restrictions. Since wafers are hundreds of times cheaper than full mask-sets or the cost of designing integrated circuits from scratch, scientists will have a much easier time getting and using this powerful industrial technology. Longer term, working with NIST to develop future platforms on the <a href=\"https://opensource.googleblog.com/2022/07/SkyWater-and-Google-expand-open-source-program-to-new-90nm-technology.html\">recently announced</a> SKY90FD open source PDK will further expand this R&amp;D ecosystem. </p><p>To kick off this research effort NIST is organizing the \"<a href=\"https://www.nist.gov/news-events/events/2022/09/nist-integrated-circuits-metrology-workshop\">NIST Integrated Circuits for Metrology Workshop</a>\" from September 20–21, 2022. This workshop will be held online with a series of presentations and panel discussions on the first day. During the second day, a working group of researchers, scientists and engineers will work to focus on the creation of parametric test structures for monolithic integration using open source silicon technology. Visit the <a href=\"https://www.nist.gov/news-events/events/2022/09/nist-integrated-circuits-metrology-workshop\">event website</a> to get more details about this program and register to attend or learn more about presenting. </p><i>By Ethan Mahintorabi, Software Engineer and Johan Euphrosine, Developer Programs Engineer – Hardware Toolchains Team, and Aaron Cunningham, Technical Program Manager – Google Open Source Programs Office</i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Open Source Programs Office",
    "uri": "http://www.blogger.com/profile/11192158996903493674",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}