{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-3706043811841521203",
  "published": "2022-10-18T22:23:00.001+05:00",
  "updated": "2022-10-18T22:23:22.704+05:00",
  "category": [
    "",
    ""
  ],
  "title": "Meezan Bank introduces Wisaaq - Pakistan's First Digital Supply Chain Financing Platform",
  "content": "<h1 style=\"text-align: left;\">Meezan Bank introduces Wisaaq - Pakistan's First Digital Supply Chain Financing Platform, in Collaboration with Coca-Cola Beverages Pakistan Limited (CCI Pakistan), Powered by Haball</h1><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgdVlm7CumM7FCuZWwIgDcQkCzqFE8ydqHt46wZmVlcNMIheF2ysmS_e7n9gfINZN28x8ueTBfI40pxxGVJCNBTiq4GdCQ3UKnzbOVxLqqxvgr5LvKx4BKFYfRQsgGzuW1Qlh8giJwU5EGYwsRILhbzXUeELYxnyPadE0W9n_FiSvU9aeWvikK34lkAnw/s1000/Meezan-Bank-1000x578.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"578\" data-original-width=\"1000\" height=\"370\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgdVlm7CumM7FCuZWwIgDcQkCzqFE8ydqHt46wZmVlcNMIheF2ysmS_e7n9gfINZN28x8ueTBfI40pxxGVJCNBTiq4GdCQ3UKnzbOVxLqqxvgr5LvKx4BKFYfRQsgGzuW1Qlh8giJwU5EGYwsRILhbzXUeELYxnyPadE0W9n_FiSvU9aeWvikK34lkAnw/w640-h370/Meezan-Bank-1000x578.jpg\" width=\"640\" /></a></div><br /><p><br /></p><p>&nbsp;</p><p><br /></p><p>KARACHI, Pakistan, Oct. 18, 2022: Meezan Bank, Pakistan’s Leading Islamic Bank and Coca-Cola Beverages Pakistan Limited (CCI Pakistan) have joined hands to launch a digital supply chain financing platform in partnership with Haball, an Islamic B2B Fintech that digitizes business payments to enable a cashless and digital supply chain. Coca-Cola Beverages Pakistan Limited is a subsidiary of Coca-Cola Içecek (CCI) which is currently operating in 11 countries across the globe. The event was attended by Dr. Inayat Hussain - Deputy Governor, State Bank of Pakistan, Mr. Irfan Siddiqui – Founding President &amp; CEO, Meezan Bank, Mr. Erdi Kursunoglu - Director Finance, CCI Pakistan and Mr. Omer Bin Ahsan - CEO, Haball along with their respective teams.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>As a first in the industry, CCI Pakistan will unveil Wisaaq’s Digital Financing Platform for their distributors across Pakistan who shall be able to avail Shariah-compliant financing through Meezan Bank. The facility will enable CCI Pakistan distributors to improve their working capital while expanding their operations. By entering into this venture, Meezan Bank aims to support SMEs in Pakistan, ensuring financial efficiency and stability of the supply chain, eventually fueling growth of the economy. The Bank’s collaboration with CCI Pakistan will also allow exchange of expertise and networks from two different industries, that will create sustainable business opportunities for retailers.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>On the occasion, Mr. Irfan Siddiqui - Founding President &amp; CEO, Meezan Bank commented, “Meezan Bank is fully committed to Shariah-compliant financing and is pleased to collaborate with Haball for developing a digital financing platform to reach CCI Pakistan’s small &amp; medium sized distributors, and their linked retailers. This partnership will act as a precursor to grow the country’s most important SME segment.”</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>Mr. Erdi Kursunoglu - Director Finance, CCI Pakistan added, “This cashless supply chain solution under Wisaaq is not just a digital transformation but also a business transformation. This partnership would create a win-win solution mainly for the SMEs in Pakistan. However, we believe, the biggest winner of this initiative will be the national exchequer”.</p><p><br /></p><p>&nbsp;</p><p><br /></p><p>Mr. Omer Bin Ahsan - CEO, Haball mentioned, “The launch of Wisaaq is a huge achievement not just for us, but for the entire financial services industry, corporates, as well as SMEs. It wouldn’t have been possible without our partners Meezan Bank, CCI Pakistan, and State Bank of Pakistan.”</p><p><br /></p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}