{
  "id": "yt:video:KpIaWiWvuRs",
  "yt:videoId": "KpIaWiWvuRs",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "The First Thing You'll Learn in a String Theory Class",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2021-11-22T19:32:11+00:00",
  "updated": "2022-09-27T18:46:06+00:00",
  "media:group": {
    "media:title": "The First Thing You'll Learn in a String Theory Class",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "As a string moves through spacetime, it sweeps out a surface called its worldsheet. The starting point for string theory sets the action equal to the area of this worldsheet. Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nGet all the links here: https://www.physicswithelliot.com/string-action-mini\n\nThis video is part 4 of the series I've been sharing with you about the principle of least action. The first video was about a particle in Newtonian mechanics, the second was about a particle in special relativity, and the third about a particle in general relativity. In this video, we'll learn about the principle of least action for string theory. It's called the Nambu-Goto action, and it's given by the area of the worldsheet that the string sweeps out as it moves through spacetime.\n\nPart 1 Introduction to the principle of least action: https://youtu.be/sUk9y23FPHk\n\nPart 2 The action in special relativity: https://youtu.be/KVk1QNTWBxQ\n\nPart 3 The action in general relativity: https://youtu.be/h2SEK6Jjv3Y\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}