{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-2548488580898604641",
  "published": "2020-06-08T15:30:00.000-07:00",
  "updated": "2020-06-08T16:18:34.180-07:00",
  "title": "10 memorable quotes from 'Dear Class of 2020'",
  "content": "<div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/rxpTjcouaeQ\" width=\"560\"></iframe> </div><br /><br />Yesterday afternoon, YouTube virtually gathered for a star-studded event called <a href=\"https://www.youtube.com/watch?v=rxpTjcouaeQ&amp;list=PLjq6DwYksrzxue8EuB6CxNEUtb2pHW-Rt\" target=\"_blank\">“Dear Class of 2020”</a> — an online graduation special. It’s a strange and hard time to be entering this new stage of life, but each speaker delivered a unique message of hope to the next generation of leaders. There were tributes, there were performances and moments of surprise-and-delight planted throughout. (Hint: You’ll hear an arrangement from Finneas O’Connell, plus an appearance from a classic, animated American sitcom.) From the <a href=\"https://www.youtube.com/watch?v=1j0pokKf2e0&amp;list=PLjq6DwYksrzxue8EuB6CxNEUtb2pHW-Rt&amp;index=12\" target=\"_blank\">Obamas</a> to <a href=\"https://www.youtube.com/watch?v=oEd1FBW3H70&amp;list=PLjq6DwYksrzxue8EuB6CxNEUtb2pHW-Rt&amp;index=10\" target=\"_blank\">Lady Gaga</a> and <a href=\"https://www.youtube.com/watch?v=iGtJE58bli0&amp;list=PLjq6DwYksrzxue8EuB6CxNEUtb2pHW-Rt&amp;index=4\" target=\"_blank\">Beyoncé</a>, the over four-hour event also peppered in celebrity powerhouses like J.Lo and Mariah Carey.  <br /><br />“Dear Class of 2020” definitely can’t replace the feeling of physically walking across a stage to receive your diploma, but it was memorable. The 10 following quotes left more than an impression on us. These words will be ringing in our heads in the days to come, as we ready ourselves for the second half of 2020. <br /><br /><br /><ol><li><b>President Barack Obama:</b> “America changed — has always changed — because young people dared to hope. As someone once said, 'Hope is not a lottery ticket. It’s a hammer for us to use in a national emergency to break the glass, sound the alarm and sprint into action. '”&nbsp;</li><br /><br /><li><b>Beyoncé:</b> “Look how far you’ve come and how much you’ve contributed. Keep pushing. Forget the fear. Forget the doubt. Keep investing and keep betting on yourself.”</li><br /><br /><li><b>&nbsp;Jimmy Kimmel:</b> “I know this is a lousy time to enter the real world, but years from this, you will have what few people do: a cool story. Know what year I graduated high school? 1985. You know the most interesting thing that happened in 1985 was? “Police Academy 2,” ‘kay? Look it up. But when you tell people the year you graduated, everyone will be super interested, they’ll wanna know what was it like? Did you live underground? Did you used to touch hands with each other? Who did you take to the prom: your mom or your dad? Did the president really tell people to drink bleach?”</li><br /><br /><li><b>Alicia Keys:</b> “You, my friends, you are graduates in the most powerful time to be coming of age. And there’s nothing and no one that can stop you from changing the world. I see you. You’re unstoppable. We honor you and celebrate you.”&nbsp;</li><br /><br /><li><b>Sundar Pichai:</b> “You will prevail.” (Read his transcripted speech <a href=\"https://blog.google/products/youtube/sundar-pichai-message-class-2020/\" target=\"_blank\">here</a>.)</li><br /><br /><li><b>Michelle Obama:</b> “In an uncertain world, time-tested values like honesty and integrity, empathy and compassion — that’s the only real currency in life.”&nbsp;</li><br /><br /><li><b>Liza Koshy:</b> “You should also know you’re not alone. You’ve got a lot of company. And being stuck at home meant you had to find creative new ways to celebrate, which made #DearClassof2020 really blow up.”</li><br /><br /><li><b>Stephen Colbert:</b> “I have no doubt you will be the heroes of so many who have not yet been born. And years from now, if you have the good fortune to hold your own child’s face in your hands and tell them how proud you are of them, you’ll understand how we feel about you right now. And they’ll wonder how you did what you are about to go do.”&nbsp;</li><br /><br /><li><b>Malala Yousafzai:</b> “Don’t be defined by what you’re losing during this crisis, but by how you respond to it.”&nbsp;</li><br /><br /><li><b>Sec. Condoleezza Rice:</b> “You are the next generation of Americans who will fight for what is right, and one day make impossible seem inevitable.”</li></ol><br /><br /><i>— The YouTube Team </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}