{
  "title": "Medicine, Entrepreneurship, and Health Policy with Ray March",
  "pubDate": "Sat, 14 Jan 2017 00:25:28 +0000",
  "guid": "177791d4cb5e2fc51eb9f97baad1aaa2",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP41March_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my discussion with Ray March about the economics of medicine and health insurance. We had a fascinating and far-reaching discussion about health care policy, both in the United States and Canada, as well as some cases of entrepreneurship in the medical sector.</p> <p>This includes a slightly awkward discussion of the development of sexual pharmacology, the early experiments with nitrates and Viagra, and the, uhhh, \"firmness\" those drugs produce. Enjoy!</p> <hr /> <p><strong>Petersen:</strong> My guest today is Ray March of Texas Tech University. Ray, welcome to Economics Detective Radio.</p> <p><strong>March:</strong> Thanks for having me.</p> <p><strong>Petersen:</strong> So our topic today is the economics of medicine. <a href=\"http://www.raymondmarch.com/research\" target= \"_blank\">Ray's research concerns entrepreneurship and regulation in medicine</a>. Let's start by talking about this idea of entrepreneurship in medicine.</p> <p>The medical field isn't like Silicon Valley. You can't just launch a pharmaceutical company out of your parents' garage. In fact, the whole field is tightly regulated and controlled by the government both in the United States and Canada, other countries. So how do people in the medical field still manage to be entrepreneurial?</p> <p><strong>March:</strong> Entrepreneurship is fundamentally a question about how do I find resources I have now and put them towards their best use and that will help me turn a profit and therefore we have market signals. You're right to point out medicine is a much more regulated area compared to other service industries but what makes medicine entrepreneurial is that there's always a void to discover, there's always a need to find better uses and better cures or better ways to treat patients.</p> <p>And because the government is usually behind the curve in terms of the advancement of science---and this is particularly true in health science and medicine---there's always opportunities for entrepreneurship. And a lot of my research explains or tries to explore what are these areas of medicine or of health just more broadly that the government is not involved in because they're not necessarily aware that this is an emerging field. And that leaves room for scientists and more broadly entrepreneurs to come and fill in gaps.</p> <p><strong>Petersen:</strong> Okay. So, when you say the government is behind the curve, a big part of that is the Food and Drug Administration, the FDA, in the United States. And of course it has its equivalent in other countries as well. So, tell me a little bit about the FDA. So, if I discovered a new drug, what kind of process would it take for me to bring it to market in the United States?</p> <p><strong>March:</strong> If you want to go through the FDA procedure usually takes between 12 and 20 years and somewhere around a billion dollars of investment. You bring it to the FDA, you go through initial screening which is \"Is the drug effective?\" \"Can it actually do what you purport it can do?\" That's phase one. Phase two is a little bit larger clinical trial so instead of 30 people you go through 1,000 people. And you have to report that it's also effective.</p> <p>Then you get into safety which is what the FDA was originally intended to do was to eliminate the worry that they were going to be unsafe drugs on the market. Then you have to go through a clinical trial about typically 3,000 people to show that it doesn't hurt them. Beyond that, you've got phase four which is approval, you get your drug approved and even the drug is approved, you are not quite off the hook.</p> <p>Yet you still have to have post surveillance. And post surveillance is, it's approved but if we find any problem outside on the market or we find that we didn't pick up with something in our very detailed clinical study, we find there is some kind of problem, then we can remove the drug and that typically lasts 14 to 16 years.</p> <p><strong>Petersen:</strong> Okay, so it's an extremely long process. Long and costly and we hear sort of horror stories about before there was an FDA---before there was regulation of medicine---you'd have people sell snake oil or tonics, miracle cures that really just made people sick. Doesn't it help to have a process in place to prevent the kind of things that might damage people's health?</p> <p><strong>March:</strong> Absolutely. I wouldn't deny that it's not helpful to have processes in place to weed out effective treatments from ineffective treatments. The question that I'd like to mention is who does the planning? Do we need to have the federal government with the FDA come in and say if you want to prescribe a drug legally or use a medical device legally you go through our process or does it make more sense to open it up broader and have competition? And that is where the entrepreneurs would find ways to treat elements and diseases and in effect, those are weeded out through the market process.</p> <p><strong>Petersen:</strong> Yeah so what I like in your research is that you've actually found cases of course of both kinds: of the FDA sort, of the public government regulation of drugs and also private regulation or private discovery of new uses of drugs. So, let's talk about your paper on entrepreneurship in off-label drug prescription. So, you look specifically at the off-label uses for three specific drugs: Aspirin, Viagra and---I might pronounce this wrong---Minoxidil?</p> <p><strong>March:</strong> No, perfect Minoxidil.</p> <p><strong>Petersen:</strong> Yeah, Minoxidil. Okay. So, first what is an off-label drug use? And why does it matter?</p> <p><strong>March:</strong> The off-label use of a drug is using a drug for a purpose that's not approved for by the FDA.</p> <p>So, in the case of Aspirin, Aspirin is approved for pain relief or in the paper I say it's not just used for pain relief doctors also prescribe it to prevent myocardial infarction and other heart-related conditions.</p> <p>So, in general, when you use a drug off-label, you are saying I'm prescribing it for use that hasn't gone through the rigors of the FDA's regulation. It hasn't gone through the four phases and the post surveillance, which in the United States is perfectly legal. But the reason that off-label becomes very important---and full disclosure, in the United States one out of four drugs is prescribed off-label, that is, one out of four pills you're taking is not for the approved FDA use---is that it allows doctors and pharmaceutical companies to be entrepreneurs, to find the best alternative use of medication, which the FDA in theory, could do, but because the process of approving drugs is so long and costly and often lags behind what medical professionals typically find 15-20 years ahead of the pace.</p> <p><strong>Petersen:</strong> Okay, but it seems contradictory that that would be legal because as you said the FDA is not just checking for safety, but for effectiveness. And if you're using Aspirin as a blood thinner, it hasn't been tested for that purpose. So isn't that a contradiction and shouldn't the FDA have some kind of interest in making sure these off-label drugs are effective?</p> <p><strong>March:</strong> So there's been put forth regulations on, or just people trying to get off-label drugs regulated so that you can't prescribe it for any use. And in some cases, there are instances where it is illegal to use a drug for off-label use. For example, if I'm a doctor, I can't prescribe you 40 Oxycontin in a bottle of liquor and then you can do physician-assisted suicide. I can't do that.</p> <p>But the FDA, it does have some sort of an interest, from a public choice perspective, that they want to regulate all use of pharmaceuticals which it hasn't deemed safe. But I think this is where my research sort of comes into play here. The FDA is so far behind the curve, I don't think it's really aware of how these drugs are being prescribed.</p> <p>And if we look at the case of Aspirin, Aspirin, the initial hypothesis put forth by Lawrence Craven---he was an entrepreneurial cardiologist---said that aspirin could be used to prevent heart attacks. This was in the 1940s. And a good period of 30 years went by before this really took off in the mainstream where this became a very common procedure to avoid heart attacks, or heart disease, other cardiovascular things. And the FDA only really got around to approving Aspirin in 1996---I believe this was the first year to approve it for preventative care. So, I think there is an interest on behalf of the FDA but I think it's also just the FDA is very slow. I don't think it's able to stay ahead of medicine or to regulate some of these uses.</p> <p><strong>Petersen:</strong> It's shocking to me that people would advocate to extend regulation to these off-label uses because if it's one in four pills in the United States, if you then banned those uses, wouldn't one in four patients then become sicker? Who's doing this advocating?</p> <p><strong>March:</strong> One of the key distinctions to keep in mind is keeping you safe is not helping necessarily, it's not curing you. And those are two distinct things a lot of people won't necessarily think through the implications of when they want to advocate the FDA should have more power.</p> <p><strong>Petersen:</strong> Okay, so that's one argument I've heard is that if the FDA approves a drug that then goes and poisons people and it turns out it wasn't safe after all then, it would be a huge political fiasco maybe the head of the FDA could get fired or definitely the people who were directly responsible for approving that drug. But if the FDA simply delays approving a drug and the same number of people die on account of not getting it---people whose lives would have been saved by it---then, the incentives are kind of asymmetrical. The error of omission is punished less harshly or not at all compared to the error of commission.</p> <p><strong>March:</strong> Absolutely. I mean that's the seen and the unseen. What's seen is that the FDA is keeping all these drugs going constrained or not, keeping them off the market because they want consumers to be safe and they want to run through these clinical tests again. But what you don't see is that people who are in dire situations that need this to feel better or to function or even save their lives. You don't necessarily account for that when you account for the cost of the FDA. So, it's one thing to say it's 20 years of approval and a billion dollars or 1.2 billion dollars to have the drug approved, but you also don't account for the lives that are waiting to get ahold of this drug.</p> <p><strong>Petersen:</strong> So, even though there's this huge process to sort of block, or to slow down drugs from reaching the market so that they can be tested and checked and made sure they're safe and effective. Still most drugs, when companies do develop drugs they earn most of their money in the U.S. market because of the strong patent system there. So, there's something to be said for having at least these incentives for the drug companies to develop these things and to keep technology marching along. Can you speak to some of the differences between the U.S. and other countries with respect to pharmaceutical development?</p> <p><strong>March:</strong> Well, in terms of IP---and you're absolutely right that IP is a critical component of a lot of pharmaceutical companies' balance sheets---because they're going to invest large sums of money and large sums of time. Then if they go and put their drug on the market and then a generic comes out four or five months later, then there goes the profit margin. So that's an important component of U.S. pharmaceutical companies, where certainly European and in some cases, the Canadian pharmaceutical come and try to get their stuff approved by the FDA so they can get stronger patent rights.</p> <p>But a lot of that is somewhat misleading. So, for instance there's no real reason medically that you should have one drug or that one drug is necessarily going to treat a huge variety of patients. When drugs go generic, you don't see just a drug go generic and it becomes the same drug, you see generics vary in their chemical structure. This way it's not just the drug becomes cheaper because there's no patent preventing other people from making this pharmaceutical or engaging in this chemical composition, but they vary the composition so they can better suit other consumers. So, it's not necessarily the case that when drugs go generic they all become the same and just immediately the price drops. There's a better service towards the consumer market.</p> <p><strong>Petersen:</strong> Yes. So, having these patents, on the one hand, they create the incentive to develop new things but on the other hand, they take away all the benefits of market competition which includes not only lower prices but also some of these sort of marginal improvements and developments in serving more niche markets and things like that.</p> <p>So, where do we see competition in the drug market? You have a paper called \"The Substance of Entrepreneurship and the Entrepreneurship of Substances\" which is a wonderful title by the way, do you want to talk a little bit about the entrepreneurship of substances?</p> <p><strong>March:</strong> Sure what I tried to develop, or what me and my co-authors tried to develop in that paper is you have entrepreneurial theory which takes various forms whether you look at the Kirznerian theory or Baumol's theory and we try to adapt that for what I do is the market for pharmaceuticals.</p> <p>In that paper I examine off-label drug prescription too, but I try to explain how does the entire process work. So, given we have severe, very stringent regulatory structure set forth by the FDA and we have these conflicting patent rights, how is it that we actually see entrepreneurship in treating people? And off-label, one, it creates alternative uses of resources which is what entrepreneurship is in a nutshell, is find the best use for scarce means and then when they find better uses for existing drugs---so Aspirin, Minoxidil, Viagra like I talked about in my other paper---these findings get distributed through medical journals which is the system of how do we figure out which drugs are safe to treat various illnesses that we previously weren't aware of.</p> <p>Pharmaceutical sales representatives are going to also play a role in doing that, but they're not supposed to disclose too much information about off-label drug prescriptions, that's another regulation. But fundamentally what you have there is a system of feedback. So, without the FDA's involvement physicians and pharmaceutical companies are able to find alternative uses for their drugs.</p> <p>So, instead of Viagra being used to reduce cholesterol essentially or to reduce congestion in the heart, it's better used for sexual performance in males. And a lot of this was found in clinical trials which then got introduced in the U.S. market through voluntary tests which then became part of medical journals, which then were introduced into specialized medical journals to make sure that this information was distributed to urologists, or doctors of various disciplines and then that's how the market emerged for sexual pharmacology, which was largely an entrepreneurial act by urologists saying \"We think sexual performance is not, for lack of a better word, all in your head. We actually think there's a physiological problem here and we think we can use pharmaceuticals to solve this.\"</p> <p><strong>Petersen:</strong> So, you're saying that the main purpose of Viagra, the one that we've all heard of, that was not its original use?</p> <p><strong>March:</strong> Oh no. Viagra was developed for heart congestion.</p> <p><strong>Petersen:</strong> Wow, I did not know that.</p> <p><strong>March:</strong> When you think of a little blue pill you think of erectile dysfunction for sexual performance, but no originally it was for---I'll tell the entire story, hope this goes to a family friendly audience---the story was this is developed in Britain, they started sending out these pills in an early clinical trial, they send them out to 30 or 100 middle-aged men, people you would think would be suspect for heart congestion and they send out the pills and they phone and they say \"Okay, how is it? You feel like you have less heart palpitations? We will run your blood and we'll see what your actual congestion is.\"</p> <p>And it didn't seem to be very effective in that, this is about halfway through a 30 day trial, and they say \"Okay, well send the pills back\" and then nobody sent them back.</p> <p>So they were questioning \"Why has nobody sent the pills back?\" and they started getting reports, \"Well it was actually helping with this other thing.\"</p> <p>And then they said \"Well we need to develop this drug for sexual performance. This is going to be a blockbuster.\"</p> <p><strong>Petersen:</strong> And before that there wasn't an interest in, or doctors were interested maybe more in saving lives. So it's almost like the market for sexual performance enhancing drugs sort of came from the consumers themselves. Before this nobody said \"Hey you know what would we be great? A pill that enhances things in the bedroom.\" So, it's interesting. So they learned from the customers what their customers wanted.</p> <p><strong>March:</strong> Yes, in this case directly. The field of what's called sexual pharmacology---so treating sexual problems with drugs---it largely emerges in the United States originally not Britain, and it's in the 1950s. And it's a group of, I believe, is about half a dozen to twenty urologists treating urological problems.</p> <p>They come to the conclusion that sexual problems are not all in your head, so it's not a psychological problem why sexual performance is not up to par, you're having these issues in the bedroom. It can actually be a physiological problem, so there's a problem with your sexual organs. And so they start experimenting with what were essentially nitrates, so things that affect blood flow and they start injecting them originally in themselves. So in the urologists' actual selves they would test that then test firmness, for lack of a better word, then they would say \"Okay, we think this can help our patients we're going to prescribe these off-label.\"</p> <p>Patients would go, they would increase their sexual performance, this starts getting out in medical journals. And then over across the ocean, you have Britain which sort of serendipitously comes across Viagra and finds out this little blue pill can actually do this too. They enter the U.S. market. So it's an international competition but it all originally starts with an entrepreneurial idea saying, \"No, we think we have a better way to treat sexual dysfunction.\"</p> <p><strong>Petersen:</strong> Right. And yet they had to get over the idea that it was all---I don't know, this with would have been before the days when people also maybe believed strongly in mental illness because---the idea of something being \"all in your head\" in the age where we're all very aware that mental illness is an illness and it is related to physical things in your brain; the fact that something's all in your head doesn't mean necessarily that it's not real but this was the 50's, when maybe people philosophically didn't see things that way.</p> <p><strong>March:</strong> Right the 1950s---there was some awareness of mental illness in the 1950s---the 1950s is when you start to have anti-psychotics, it's when they start to see we can help people that have previously been institutionalized by giving them these drugs which uptake into the brain, which can help you alleviate manias and depression, or anxiety.</p> <p>But the predominant theory for sexual dysfunction---it wasn't even called that back then, but what we can call for this podcast sexual dysfunction---was that this is a psychological problem so, the male couldn't perform---this is also true for females but what we were focusing on here is males---if the male couldn't perform it was some form of anxiety, so he needed to undergo psychotherapy or some kind of sexual therapy. And then he would go through that again and again until the point where he was comfortable enough performing sexually and that would somehow dissipate the problem.</p> <p>But entrepreneur urologists come in and say \"No.\" There's alternative explanations. It's not just that he has anxiety. It could be there's something actually physiologically wrong. And this is sort of a new idea because that, one, it's a whole new idea to say no the sexual performance is not always linked to your mental state or your perceived anxiety, but that we can actually treat this with injections, or with nitrates or with drugs and drugs that already exist on the market because we believe this is a blood flow problem.</p> <p>They had it tested on themselves so they were pretty confident in their theory. But then to go ahead and give it to patients and then give patients the ability to self-medicate. All of this progress was a period of 20 or 25 years for them to progress to that stage to where ED can be treated---be self-treated really---without the use of psychotherapy which was inconsistently effective. And then we get to the point where you can just inject an oral tablet, that's where Viagra comes in. All of this comes about because of an entrepreneurial awareness to say \"No, we don't think that the medical professional is treating this condition correctly.\"</p> <p><strong>Petersen:</strong> So, one thing you talk about in your paper is the idea of superfluous entrepreneurship. What is that and how has it occurred in drug markets?</p> <p><strong>March:</strong> Superfluous entrepreneurship as we go about it in this paper is the idea, given you're an entrepreneur in a regulatory state which prohibits you from discovering more effective ways to distribute goods, what happens to the goods you distribute? Are you distributing as effectively as you could without said regulation?</p> <p>And one of the ones we analyze in the paper is the development of insulin. I'm sure you and your viewers are aware of what insulin is, a diabetic who can't produce his insulin or doesn't produce enough, the Type-one and Type-two, needs to inject that when he eats carbs so he can manage his blood sugar and avoid diabetic complications. So, when insulin originally hits the market we've got to go back to, I want to say the 1920s, when they first started doing animal insulin. We have pig insulin and we have bovine insulin which saved thousands of diabetics' lives at the time, but they have side effects. As you can imagine, insulin is a hormone, if you inject animal hormones in you, there's going to be some side effects.</p> <p>And so by the time you get around to the 1940s we start finding ways, medical science advances enough to where we can synthetically produce human hormones, which is what modern insulin is, a human insulin. But the fear of the regulators is now that we can synthetically make hormones we don't necessarily know what are the side effects of synthetic hormones. And so in 1941 Congress passes what's literally called \"The Insulin Act\" which is if you're going to prescribe, or you're going to try to create a life-saving medication, which is what insulin is to diabetics, to Type-one diabetics especially, it has to go through additional rigorous testing.</p> <p>So what that means is the release of human insulin on the U.S. market is delayed, so diabetics who need to receive their insulin are still taking bovine and pig insulin, which is okay but when there was a clearly better alternative being human insulin available, you end up with superfluous discovery so instead of investing time---and this is what happens in the insulin market---you invest time and effort into finding ways to reduce complications from injecting bovine insulin, or find ways to change the what's called the duration event, so how long insulin last in your bloodstream trying to find ways to manipulate that or make that better. You have a better alternative which is to immediately bring in human insulin and treat diabetics using that and that doesn't become possible in the U.S. market because of these delayed regulations. Eventually insulin does get on the market but you have a prolonged period where people are noticeably getting worse treatment than what's available.</p> <p><strong>Petersen:</strong> Right, and that's a very long period. I read in your paper they didn't approve human insulin until 1983 and did you say 1940s was when they discovered it?</p> <p><strong>March:</strong> I believe 1941 was when it was first available for clinical testing and this was all done in Germany.</p> <p><strong>Petersen:</strong> So 42 years.</p> <p><strong>March:</strong> Right, of taking animal hormones.</p> <p><strong>Petersen:</strong> Yes. So, the superfluous element of entrepreneurship is we have some kind of problem, people are willing to pay to have that problem solved. We have a cheap way of providing this subjective benefit to people, but the cheapest, best way that people would do in a free market is somehow blocked or illegal and so people entrepreneurship around regulation. Is that correct?</p> <p><strong>March:</strong> You certainly see that in illicit drug markets, but yes that's also true in some pharmaceutical markets. I want to get this drug approved in the United States. I have human insulin which is better than cow and so I want to get approved in the United States. There's a big market for diabetics in the United States but the additional regulation makes it tough. So, I can find a way to circumvent that, either bring it on the black market, the illicit drug component, or I have to say no I can't compete in the United States because it is going to take too long, I'm just going to prescribe it over here in Germany or in Asia.</p> <p>And what that does, that just limits the entrepreneurial aspect of bringing better cures to market. So it's a superfluous effort you could say, marketing this drug in Asia or different countries in Europe instead of the United States. Those are all resources that could have been diverted towards something, or towards marketing the drug in the United States where you could argue it would be the highest value of use.</p> <p><strong>Petersen:</strong> Right. And in your paper you also talk about delta nine THC found in marijuana, which is a treatment for nausea. Can you talk about that? That's illegal of course because it's from marijuana.</p> <p><strong>March:</strong> That's an example where there's tons of medications out there for nausea, but the one you find in the medical marijuana derivative has been shown as particularly effective in difficult cases. So take cases where the typical forms of treatment which would normally help people---now we have more difficult cases---we're no longer allowed to prescribe these drugs we have to find synthetic uses of these drugs. So any time you take a synthetic use you're necessarily making the complications which you would face when the drug interacts with your body, they become a little bit more widespread. So you open yourself up to the treatment being less effective, but you also get more of a probability of these tail effects, where things you wouldn't necessarily see happen occur in your body.</p> <p>So, you make the drug. In some cases it's less effective, but you also can potentially make it more dangerous, which is the superfluous act. I am trying to use synthetic drugs to treat cases or treat illnesses when there's a better alternative in the background. So, I'm just trying to find a new and better way to make a potentially dangerous drug safer when there are already safer drugs available.</p> <p><strong>Petersen:</strong> So a previous guest of this show, <a href= \"http://economicsdetective.com/2016/04/drugs-prohibition-suburban-overdose-crisis-mark-thornton/\" target=\"_blank\">Mark Thornton</a>, who you cite in your paper has argued that in the case of illicit drug markets, what the entrepreneurs do is to make them easier to smuggle by making them more concentrated, have a stronger effect for a smaller mass so they can be hidden in places where they're smuggled across borders or from the place they're produced to the place where they're sold. One example would of course be moonshine, so during the depression they obviously weren't selling low-alcohol-content wine because it would be so costly to smuggle that to people. They instead got the super strong moonshine and it was actually very dangerous. So, I suppose that's kind of an example of superfluous entrepreneurship, getting around the burdens placed on you, when in legal markets, of course, you don't have to always make things more concentrated and easier to smuggle because you don't have to smuggle them.</p> <p><strong>March:</strong> Right exactly. Entrepreneurship is finding---I have my product, I eventually face competition because I'm making a profit, how do I make my product better? And so when you have to change the institutional setting to where now I have a product that I'm selling but it's technically illegal to sell this product, where can I put my efforts best for us to continue making a profit?</p> <p>In illicit markets it can just be the concentration, right? You mentioned the moonshine and the nine THC is another great example which is the main content of marijuana which people used to get high, you see the potency of these get much higher because that's primarily what you're trying to do is to sell the THC content to potential marijuana users. So instead of trying to find appropriate levels of THC or finding what you call niche, just accessories towards consuming marijuana which would differentiate the markets and serve consumers better, that is no longer profitable revenue and that's no longer a profitable or viable way to compete with people that are selling marijuana. Now it's how do I smuggle? How do I become a better or more active smuggler? And that's to raise the content of THC.</p> <p><strong>Petersen:</strong> Or to get people onto drugs like cocaine that are significantly more potent per weight. I guess the great point made by Thornton is that by criminalizing these things, by criminalizing milder drugs in particular, you create a market for stronger ones.</p> <p><strong>March:</strong> Right. Because that's how you compete on the margin for things like that. Yes.</p> <p><strong>Petersen:</strong> So what other kinds of entrepreneurship do you see in the United States in medicine? I've heard about people sort of getting around the medical system, joining collectives where they pay directly to their doctor, trying to get away from the sort of hybrid insurance system that you have down there.</p> <p><strong>March:</strong> That has become an alternative. And I don't know if I want to say an alternative market. But there has emerged a need for people to get outside of the larger insurance---that's the word I'm looking for---to get outside of the mainstream insurance market and to niche themselves into more specialized markets.</p> <p>So, with the passage of the Affordable Care Act right now, everybody has to have health insurance or you pay a massive penalty. You've standardized insurance, which in some cases maybe there's nothing wrong in having a standardized package of insurance. When you try to blanket that over the population of the United States you leave out specialized cases.</p> <p>So to give you a specific example what you see now in the market for diabetic treatment is now that insurance has become standardized to treat diabetics, you see less prescriptions written for specialized forms of insulin or insulin that acts faster or insulin that has a longer duration period. Now you see just generic insulin is being prescribed. Which is fine because the majority of diabetics are type-two diabetics and that's what they typically use, but then that leaves out cases of people with pancreatic cancer or type-one diabetics who need specialized insulin in order to better suit their individual illnesses, and you don't see that specialized treatment. So that leaves the market open for specialized insurance, or people that are going to co-ops, private alternatives where you pay into essentially a fund and 50 or so people will contribute 100 dollars a month. If one of them gets sick, they'll use the money in that fund to help this person overcome an illness they've come down with or any injury that's kept them outside of work.</p> <p>I think a lot of those entrepreneurial aspects are trying to get out of standardized medicine, standardized insurance but again because all of this is more or less dictated by the government you don't have the wiggle room to compete on the margins, what you have to do is go completely outside of a highly regulated market. That's what you're seeing marginally with insurance. You don't see as much of that in medicine.</p> <p>Medicine is a little more tightly controlled than insurance, even in the insurance market even today, but it's interesting. So, I think in the future there's going to emerge especially a larger market for these different forms of health insurance. It will help to treat people who have religious affiliations when they don't want to have insurance that helps to cover birth control or abortions for people that are in their group or they are pooled in the same insurance group. But also just people that aren't getting the kind of treatment they want. And this allows them to actually have health insurance for lack of a better word. I need a specialized form of treatment or I actually come down with a rare illness that the standard treatment is not going to help me with, I need to have insurance as a means to cover it and I think that's what you're seeing in the market with what you describe.</p> <p><strong>Petersen:</strong> Right. So, I live in Canada and we have single payer, which ultimately is like post-Obamacare having private insurance companies but then having everyone legally required to get the insurance and then having those insurance companies having the government dictate what they provide and require them to take on people with preexisting conditions. It's almost like just some sort of weird way of replicating single payer just while maintaining the veneer of a private system but in Canada we have single payer officially.</p> <p>And there are some myths about it. So, we don't have socialized medicine per se. Doctors are not public servants but they can only accept payment from the government on your behalf, so sort of like maybe a private prison in the United States where they're kind of private but the only customer they can legally take on is the government.</p> <p><strong>March:</strong> Which you wouldn't typically describe as a market. The market is to serve the consumers.</p> <p><strong>Petersen:</strong> When the consumer is like a private contractor, serving the government. But of course we also restrict---you're not allowed to buy healthcare or medical care outside of the single payer system. There have been some court cases recently with people trying to argue for a right to do this but the typical thing to do is to cross the border to the States or fly to Southeast Asia to get your unapproved---or in order to pay for your own medicine.</p> <p>And the sort of justification for this is they don't want people competing up the prices of medical services, medical goods. I guess they like their monopsony status as the only buyer of medical services. But whenever I find myself arguing against the system or saying something to the effect of \"Hey this is a pure private good, why don't we let the free market provide it the way we do with our food and shelter and other things that are very important for living?\" I get really smart people arguing against me and some of the things they say are \"Can you point to a country with free market healthcare that works?\" and I have to say \"Well there isn't a country with pure free market healthcare\" Singapore is 50/50 and maybe that's as close as you get.</p> <p>But I guess to get to my question, why does every country intervene so strongly in medicine? What is it about medicine that that makes people really want to control it and have it centrally planned or regulated?</p> <p><strong>March:</strong> Sure. I think that's the fundamental question of health economics. Analyzed from the perspective of an economist, how much is the market able to take care of the sick or those less able to take care of themselves and how much do you need state interference or government involvement to make a successful health company or healthcare system work? The way I'd like to think about health economics if we get outside of just focusing on insurance or treatment of rare illnesses or pre-existing conditions or asymmetric information and all these complex issues that people like to point and say, \"See that's where the market fails in healthcare, that's why you have to have a government.\"</p> <p>Fundamentally what we're looking at is how do you deal with uncertainty? We have more or less ways of assessing risk, where we know your risk increases of lung disease if you smoke a cigarette as a simplified example. But how do we purely deal with uncertainty? So, I'm an insurance company and I take you on as a client, I don't know your health status. Various regulations make it impossible for me to find that out. But I don't know your health status. I don't know if in five years you're going to develop cancer, if you're going to be healthy for the next 30 or 40 years. How is it ideal with that as an insurance provider or if I'm a doctor how do I know you're going to use this pharmaceutical responsibly or how do I know that these other clinical trials I've seen where this has helped the patient with your condition is going to help you because there's heterogeneity in how people respond to things.</p> <p>But fundamentally this uncertainty both in the provision of healthcare and in medical science itself, these permeate medicine. We're never fully going to be able to reduce the uncertainty. There's always going to be that element of the simple fact that we don't know. And I think that provokes the idea in a lot of people's heads that with no centralized plan we're not able to address this uncertainty. So we need to have the government come in and say health premiums need to be this or guarantee a system where even if you don't have health insurance you'll be taken care of if you need to go to the emergency room. Or if you come down with a very rare illness there will be pharmaceutical stock up in the hospital.</p> <p>I just think that in general, the uncertainty drives a lot of people to look toward centralization or to develop a centralized plan to try to mitigate that. But a lot of those efforts are somewhat short sighted because when you centralize things you don't take advantage of the uncertainty aspect of anything you just put all of the decision-making power within a federal bureau, the FDA or the federal government or even the USDA to some degree. At least in the United States, I know Canada has similar governmental bodies up there.</p> <p>But when you do that you divorce decision-making from the knowledge and you also divorce it from the incentive, like when we talked about what if the FDA doesn't have an incentive to release potentially dangerous drugs? Or as a pharmaceutical company if they see profits, they absolutely would, even if it is somewhat risky. So, I think the motivation primarily in why we don't see free healthcare or a free market in health insurance or competing systems of determining whether drugs are safe or effective is that there's a primary fear with people how do we address this uncertainty.</p> <p><strong>Petersen:</strong> So there are various elements of the uncertainty. If I'm an insurance company I might worry that the people who come buying insurance, there's an adverse selection problem so the people who come to me for insurance are going to be the people who are the least healthy or the people who expect, for some reason that maybe I can't observe, to get sick. And that means based on the fact that only people likely to get sick are coming to me, I need to charge very high premiums for my insurance. And so it's <a href=\"https://en.wikipedia.org/wiki/The_Market_for_Lemons\" target=\"_blank\">the classic market for lemons problem</a>: The very fact that someone's selling you their used car maybe tells you that the car is a lemon. And the fact that you think it's a lemon means you won't pay very much for it, meaning that anyone who doesn't have a lemon wouldn't be willing to sell.</p> <p>So, at least with that, it seems that pooling everyone into the same pool helps. But on the other hand you do lose competitiveness. So, one example I've heard is the cost of rhinoplasty---the plastic surgery to make your nose look better---since that's not paid, since governments perhaps rightly see that as it's not life-threatening, it's not important and we're not going to pay for it, you pay for it yourself. And we see that the cost of a rhinoplasty has fallen dramatically over the years. And whereas life-saving surgery, you look at healthcare and housing and I guess university tuition, those are the three big things that consistently go up in cost over the years.</p> <p>Do you know a lot about the market for plastic surgery?</p> <p><strong>March:</strong> Not a whole lot. I do know that because it's not regular you have means of competing and you have essentially competition to provide you with care to make your nose look better or for facial reconstructive surgery and similar things.</p> <p>I do know that a lot of cases like when you get breast augmentation you have to replace the inserts or whatever they're called. You have to replace those every set amount of years and you get routine inspections to make sure there's nothing going on with the surgical procedure, nothing wrong with the implant and all of that is done privately. So, it's interesting because getting plastic surgery is not necessarily a simple procedure. Just because the FDA is not involved in the procedure because there's not federal guidelines about when or when not you can do this procedure, how the procedure should be performed, it doesn't mean that the procedure is simple.</p> <p>As you pointed out, it's not life-saving but it's still surgery and there are still risks and complications. What we typically don't hear, with the exception of maybe a few TV shows, that sort of shock people, we don't hear about these horrible things going wrong on the surgical table when people get nose jobs. And I think a lot of that has to do with because they have to compete to make sure people are happy with the outcome but they also have to make sure, again if the procedure is safe and its efficacy. You look better when you're done and nothing happens to you or receive complications, you get infections from surgeries. So you do see that a lot in the United States.</p> <p>I want to go just briefly back into the adverse selection problem which I think is broadly the main argument for why you need to have government involvement in health insurance. Because you have that selection problem where only sick people want insurance and then insurance companies only want to provide really minimal standard care so you have that sort of mismatch and that would be a bad scenario for all. But to the extent that's true, it's based upon how is the insurance company is able to segment the market.</p> <p>So, if you're comparatively healthier than me and you just want to have catastrophic care, so something that if you were involved in a horrible accident and nobody could have planned for it, you need to have emergency care. You pay pretty low premiums and then the deductible is higher whereas someone like me I'm a type-one diabetic who needs to have consistent care throughout their life in order to maintain their health, their premiums should be a little bit higher but then the deductible should be a little bit lower since I have to keep taking insulin.</p> <p>But the problem is if they're not able to segment the market, and I think the reason they can't segment the market is because it's illegal to segment the market. What you don't have, they are two different forms of insurance. You don't have the insurance for sickly Ray me, or healthy you.</p> <p>You don't have means to compete on those margins, all you have is various plans. You buy into them, you have health insurance costs go up because there's less competition and the reasons we have explained before. So a lot of what you see with the adverse selection problem is a lack of marketing and the lack of marketing stems from the fact that it's illegal to do a lot of the research that health insurance companies want to do.</p> <p><strong>Petersen:</strong> So, because deep down it seems so unfair that you could have a huge cost throughout your life just because you got sick through no fault of your own, we want people to pay the same. But then in doing so we create the adverse selection problem and it's sort of the old lady who swallowed the fly. We have to swallow the spider to eat the fly and eventually we're swallowing a single-payer healthcare system to put everyone in the same risk pool to deal with the problems that our initial minor intervention to try to make insurance more fair caused.</p> <p><strong>March:</strong> Right. So what we would end up doing in that situation is that you would have to pay premiums, I would have to pay premiums we want to equal them out because it's unfair that you should have to be subsidized me for lack of a better word. Well, that means that you end up paying more in premiums than you actually wanted health insurance, I would end up paying less because we have to even out.</p> <p>More fundamentally if you want to address the fairness question---I think a lot of people do approach this from the aspect of fairness---is, one, why is it somewhat unfair for me as someone with a chronic illness to not have access to healthcare on a competitive market where I can decide which program I want, where I can assess my own risk, and where I can decide based upon my medical needs how at best to treat my illness; whereas someone like you who doesn't have a chronic illness places a completely different set of incentives? So when they pool us all they end up doing is limiting both of our choices. I think a fundamental question to ask there is which one of those is more or less fair?</p> <p><strong>Petersen:</strong> Right. So, what sort of institutional changes, big or small---obviously some things are more politically feasible than others---but what institutional changes would you like to see to improve on our system?</p> <p><strong>March:</strong> By \"our\" you mean the US system?</p> <p><strong>Petersen:</strong> Yes, or in the systems worldwide that have similarly been adopted for similar reasons by many different countries.</p> <p><strong>March:</strong> Sure. If we segment along the lines of there's health insurance and there's actual health products or health services.</p> <p>I would primarily start with the approval of pharmaceuticals. And I say that because a significant portion of the illnesses and conditions in the United States are treated with pharmaceuticals. So, if we're able to allow competing access to approval processes, that would drastically lower the cost of drugs. If you lower the cost of drugs, health insurance becomes less vital, certainly in my situation but in a lot of people's situations who need access to pharmaceuticals. The access to insurance becomes less important because there's less of a risk that you won't be able to afford the treatment if you need it.</p> <p>And I think that would push back insurance into---for lack of a better word---a more appropriate role. Insurance is supposed to be, there's a potential down the road that something bad will happen or I will develop an illness, I'll get sick, I'll break something, whatever you want to call it. I don't know if that's going to happen but if it does I want to make sure my livelihood or my standard of living continues as best it can. That's what actual insurance is. There's a chance that you could crash your car someday. And if your car is totaled you want to have repairs, you want a new car, that's why you buy car insurance. But now when we have health insurance we say \"oh no health insurance covers your routine doctor, it's going to cover some aspect of your drugs if you get a prescription, it's going to cover procedures from other people in this case because everything is pooled.\"</p> <p>But you don't see your progressive car insurance company pay for your oil change. That's a different thing. That's routine care. And I think if you reduce the cost of entry into medical devices and pharmaceuticals, so you reduce back the power of the FDA, you would naturally see health insurance go back into the proper insurance role. You could make an argument on the other way too as if you let insurance companies compete, premiums would go down. People would self-select into consuming health care products or not consuming health care products more effectively. That would drive down the cost.</p> <p>But I think the primary problem here is there's a restriction of access to medical devices and to pharmaceuticals and once you allow for a market and that health insurance no longer competes on those margins it would compete on margins of trying to ascertain risk of whether that would happen or not down the road.</p> <p><strong>Petersen:</strong> So when you talk about pooling or when you talk about making approval cheaper, is that the system where two or more countries agree that a drug only needs to be approved in one of the countries to be allowed in all of them?</p> <p><strong>March:</strong> That's one method. I was thinking more along the lines of within the United States could have private companies that would give you gold and silver standards of approval for pharmaceutical X and drug Y. And then people based on that would decide, okay I want to take this drug or I want to take that one, or physicians would have more access to information based on that than waiting for the FDA to approve. That's more what I was thinking about.</p> <p>On an international level that gets interesting because developing a drug in Europe and in Canada is completely different than developing that in the United States. The difference in the rigors of the approval process is what drives a lot of those conflicts but in terms of how you agree that everyone is going to come up with the same approval process method, I'm less optimistic about that because I think there's a public choice story behind it. Pharmaceutical companies want the approval process to be tough. So, like you said you can't develop pharmaceuticals in your basement despite your chemical knowledge.</p> <p>I do think there's more of a hope in the future though for less emphasis on FDA approval and more for private raters or private ratings to come in and say these drugs have been shown safe or for pharmaceutical companies to interact with private laboratories or clinical testing facilities to say, okay we passed these tests, and we communicate that our product is safe without the FDA</p> <p><strong>Petersen:</strong> Right. And at the very least you could remove the effectiveness criteria from the FDA. Just say that the president or Congress could just tell the FDA, your job is just to check safety. Now if people want to take an ineffective drug, as long as it's safe they can do that.</p> <p>There's the idea of right to try. Have you heard of that?</p> <p><strong>March:</strong> I have a segment of that in one of my pieces. I think that's very interesting because that's completely illegal action but you have certain states that will say okay if a drug is within phase three---that's when we start to do the safety testing with the FDA---and you say someone has an illness, they're in an insufferable pain, we know they're going to die, let's give them a shot to take this drug. And whether or not that helps or not is kind of secondary but it's a circumvention like we talked about earlier of the going around the FDA, which is a federal governing body, you are not supposed to be able circumvent that at the state level.</p> <p>But you go around and you give people access to potentially life-saving medication. But me being more of a market-oriented economist, I wonder what if you did that not just for life-saving drugs but for other drugs? And granted there are risks with every single drug, basically including water has certain risks to it. But given that there are risks associated with every drug, what would emerge in a freer market where you could better ascertain the safety of these drugs or the efficacy of these drugs?</p> <p><strong>Petersen:</strong> So do you have any closing thoughts, anything we didn't mention?</p> <p><strong>March:</strong> I guess one last concluding thought with regards to health economics I just want to reiterate that health economics is fundamentally a question about which set of institutions is best able to deal with uncertainty. And uncertainty in the sense where we just don't have clearly defined answers. Who would be better able to protect the population of a country from an epidemic or who would be better able to take care of the mentally ill, which is a set of illnesses we don't know very much about, or who is better able to find alternative uses of pharmaceuticals given their potential potency to be able to help people, and the potential side effects?</p> <p>And the debate is still very lively. It's to what level do we need centralization in order to answer these questions and to what level do the discovery processes of the market---for lack of a better word---how are we able to address these questions better? My research asks a question of if you don't have centralization what is the alternative? What are examples---not necessarily of entirely free health care systems---what are examples of private mechanisms working in the medical field and thus far I've found pretty convincing results that the private market is able to handle some pretty difficult situations, some pretty uncertain situations and when compared to the centralized alternative they fair fairly well.</p> <p><strong>Petersen:</strong> My guest today has been Ray March. Ray, thanks for being part of Economics Detective Radio.</p> <p><strong>March:</strong> Thanks for having me.</p> <hr /> <p></p>",
  "content:encoded": "<p>What follows is an edited transcript of my discussion with Ray March about the economics of medicine and health insurance. We had a fascinating and far-reaching discussion about health care policy, both in the United States and Canada, as well as some cases of entrepreneurship in the medical sector.</p> <p>This includes a slightly awkward discussion of the development of sexual pharmacology, the early experiments with nitrates and Viagra, and the, uhhh, \"firmness\" those drugs produce. Enjoy!</p>  <p>Petersen: My guest today is Ray March of Texas Tech University. Ray, welcome to Economics Detective Radio.</p> <p>March: Thanks for having me.</p> <p>Petersen: So our topic today is the economics of medicine. <a href=\"http://www.raymondmarch.com/research\" target= \"_blank\">Ray's research concerns entrepreneurship and regulation in medicine</a>. Let's start by talking about this idea of entrepreneurship in medicine.</p> <p>The medical field isn't like Silicon Valley. You can't just launch a pharmaceutical company out of your parents' garage. In fact, the whole field is tightly regulated and controlled by the government both in the United States and Canada, other countries. So how do people in the medical field still manage to be entrepreneurial?</p> <p>March: Entrepreneurship is fundamentally a question about how do I find resources I have now and put them towards their best use and that will help me turn a profit and therefore we have market signals. You're right to point out medicine is a much more regulated area compared to other service industries but what makes medicine entrepreneurial is that there's always a void to discover, there's always a need to find better uses and better cures or better ways to treat patients.</p> <p>And because the government is usually behind the curve in terms of the advancement of science---and this is particularly true in health science and medicine---there's always opportunities for entrepreneurship. And a lot of my research explains or tries to explore what are these areas of medicine or of health just more broadly that the government is not involved in because they're not necessarily aware that this is an emerging field. And that leaves room for scientists and more broadly entrepreneurs to come and fill in gaps.</p> <p>Petersen: Okay. So, when you say the government is behind the curve, a big part of that is the Food and Drug Administration, the FDA, in the United States. And of course it has its equivalent in other countries as well. So, tell me a little bit about the FDA. So, if I discovered a new drug, what kind of process would it take for me to bring it to market in the United States?</p> <p>March: If you want to go through the FDA procedure usually takes between 12 and 20 years and somewhere around a billion dollars of investment. You bring it to the FDA, you go through initial screening which is \"Is the drug effective?\" \"Can it actually do what you purport it can do?\" That's phase one. Phase two is a little bit larger clinical trial so instead of 30 people you go through 1,000 people. And you have to report that it's also effective.</p> <p>Then you get into safety which is what the FDA was originally intended to do was to eliminate the worry that they were going to be unsafe drugs on the market. Then you have to go through a clinical trial about typically 3,000 people to show that it doesn't hurt them. Beyond that, you've got phase four which is approval, you get your drug approved and even the drug is approved, you are not quite off the hook.</p> <p>Yet you still have to have post surveillance. And post surveillance is, it's approved but if we find any problem outside on the market or we find that we didn't pick up with something in our very detailed clinical study, we find there is some kind of problem, then we can remove the drug and that typically lasts 14 to 16 years.</p> <p>Petersen: Okay, so it's an extremely long process. Long and costly and we hear sort of horror stories about before there was an FDA---before there was regulation of medicine---you'd have people sell snake oil or tonics, miracle cures that really just made people sick. Doesn't it help to have a process in place to prevent the kind of things that might damage people's health?</p> <p>March: Absolutely. I wouldn't deny that it's not helpful to have processes in place to weed out effective treatments from ineffective treatments. The question that I'd like to mention is who does the planning? Do we need to have the federal government with the FDA come in and say if you want to prescribe a drug legally or use a medical device legally you go through our process or does it make more sense to open it up broader and have competition? And that is where the entrepreneurs would find ways to treat elements and diseases and in effect, those are weeded out through the market process.</p> <p>Petersen: Yeah so what I like in your research is that you've actually found cases of course of both kinds: of the FDA sort, of the public government regulation of drugs and also private regulation or private discovery of new uses of drugs. So, let's talk about your paper on entrepreneurship in off-label drug prescription. So, you look specifically at the off-label uses for three specific drugs: Aspirin, Viagra and---I might pronounce this wrong---Minoxidil?</p> <p>March: No, perfect Minoxidil.</p> <p>Petersen: Yeah, Minoxidil. Okay. So, first what is an off-label drug use? And why does it matter?</p> <p>March: The off-label use of a drug is using a drug for a purpose that's not approved for by the FDA.</p> <p>So, in the case of Aspirin, Aspirin is approved for pain relief or in the paper I say it's not just used for pain relief doctors also prescribe it to prevent myocardial infarction and other heart-related conditions.</p> <p>So, in general, when you use a drug off-label, you are saying I'm prescribing it for use that hasn't gone through the rigors of the FDA's regulation. It hasn't gone through the four phases and the post surveillance, which in the United States is perfectly legal. But the reason that off-label becomes very important---and full disclosure, in the United States one out of four drugs is prescribed off-label, that is, one out of four pills you're taking is not for the approved FDA use---is that it allows doctors and pharmaceutical companies to be entrepreneurs, to find the best alternative use of medication, which the FDA in theory, could do, but because the process of approving drugs is so long and costly and often lags behind what medical professionals typically find 15-20 years ahead of the pace.</p> <p>Petersen: Okay, but it seems contradictory that that would be legal because as you said the FDA is not just checking for safety, but for effectiveness. And if you're using Aspirin as a blood thinner, it hasn't been tested for that purpose. So isn't that a contradiction and shouldn't the FDA have some kind of interest in making sure these off-label drugs are effective?</p> <p>March: So there's been put forth regulations on, or just people trying to get off-label drugs regulated so that you can't prescribe it for any use. And in some cases, there are instances where it is illegal to use a drug for off-label use. For example, if I'm a doctor, I can't prescribe you 40 Oxycontin in a bottle of liquor and then you can do physician-assisted suicide. I can't do that.</p> <p>But the FDA, it does have some sort of an interest, from a public choice perspective, that they want to regulate all use of pharmaceuticals which it hasn't deemed safe. But I think this is where my research sort of comes into play here. The FDA is so far behind the curve, I don't think it's really aware of how these drugs are being prescribed.</p> <p>And if we look at the case of Aspirin, Aspirin, the initial hypothesis put forth by Lawrence Craven---he was an entrepreneurial cardiologist---said that aspirin could be used to prevent heart attacks. This was in the 1940s. And a good period of 30 years went by before this really took off in the mainstream where this became a very common procedure to avoid heart attacks, or heart disease, other cardiovascular things. And the FDA only really got around to approving Aspirin in 1996---I believe this was the first year to approve it for preventative care. So, I think there is an interest on behalf of the FDA but I think it's also just the FDA is very slow. I don't think it's able to stay ahead of medicine or to regulate some of these uses.</p> <p>Petersen: It's shocking to me that people would advocate to extend regulation to these off-label uses because if it's one in four pills in the United States, if you then banned those uses, wouldn't one in four patients then become sicker? Who's doing this advocating?</p> <p>March: One of the key distinctions to keep in mind is keeping you safe is not helping necessarily, it's not curing you. And those are two distinct things a lot of people won't necessarily think through the implications of when they want to advocate the FDA should have more power.</p> <p>Petersen: Okay, so that's one argument I've heard is that if the FDA approves a drug that then goes and poisons people and it turns out it wasn't safe after all then, it would be a huge political fiasco maybe the head of the FDA could get fired or definitely the people who were directly responsible for approving that drug. But if the FDA simply delays approving a drug and the same number of people die on account of not getting it---people whose lives would have been saved by it---then, the incentives are kind of asymmetrical. The error of omission is punished less harshly or not at all compared to the error of commission.</p> <p>March: Absolutely. I mean that's the seen and the unseen. What's seen is that the FDA is keeping all these drugs going constrained or not, keeping them off the market because they want consumers to be safe and they want to run through these clinical tests again. But what you don't see is that people who are in dire situations that need this to feel better or to function or even save their lives. You don't necessarily account for that when you account for the cost of the FDA. So, it's one thing to say it's 20 years of approval and a billion dollars or 1.2 billion dollars to have the drug approved, but you also don't account for the lives that are waiting to get ahold of this drug.</p> <p>Petersen: So, even though there's this huge process to sort of block, or to slow down drugs from reaching the market so that they can be tested and checked and made sure they're safe and effective. Still most drugs, when companies do develop drugs they earn most of their money in the U.S. market because of the strong patent system there. So, there's something to be said for having at least these incentives for the drug companies to develop these things and to keep technology marching along. Can you speak to some of the differences between the U.S. and other countries with respect to pharmaceutical development?</p> <p>March: Well, in terms of IP---and you're absolutely right that IP is a critical component of a lot of pharmaceutical companies' balance sheets---because they're going to invest large sums of money and large sums of time. Then if they go and put their drug on the market and then a generic comes out four or five months later, then there goes the profit margin. So that's an important component of U.S. pharmaceutical companies, where certainly European and in some cases, the Canadian pharmaceutical come and try to get their stuff approved by the FDA so they can get stronger patent rights.</p> <p>But a lot of that is somewhat misleading. So, for instance there's no real reason medically that you should have one drug or that one drug is necessarily going to treat a huge variety of patients. When drugs go generic, you don't see just a drug go generic and it becomes the same drug, you see generics vary in their chemical structure. This way it's not just the drug becomes cheaper because there's no patent preventing other people from making this pharmaceutical or engaging in this chemical composition, but they vary the composition so they can better suit other consumers. So, it's not necessarily the case that when drugs go generic they all become the same and just immediately the price drops. There's a better service towards the consumer market.</p> <p>Petersen: Yes. So, having these patents, on the one hand, they create the incentive to develop new things but on the other hand, they take away all the benefits of market competition which includes not only lower prices but also some of these sort of marginal improvements and developments in serving more niche markets and things like that.</p> <p>So, where do we see competition in the drug market? You have a paper called \"The Substance of Entrepreneurship and the Entrepreneurship of Substances\" which is a wonderful title by the way, do you want to talk a little bit about the entrepreneurship of substances?</p> <p>March: Sure what I tried to develop, or what me and my co-authors tried to develop in that paper is you have entrepreneurial theory which takes various forms whether you look at the Kirznerian theory or Baumol's theory and we try to adapt that for what I do is the market for pharmaceuticals.</p> <p>In that paper I examine off-label drug prescription too, but I try to explain how does the entire process work. So, given we have severe, very stringent regulatory structure set forth by the FDA and we have these conflicting patent rights, how is it that we actually see entrepreneurship in treating people? And off-label, one, it creates alternative uses of resources which is what entrepreneurship is in a nutshell, is find the best use for scarce means and then when they find better uses for existing drugs---so Aspirin, Minoxidil, Viagra like I talked about in my other paper---these findings get distributed through medical journals which is the system of how do we figure out which drugs are safe to treat various illnesses that we previously weren't aware of.</p> <p>Pharmaceutical sales representatives are going to also play a role in doing that, but they're not supposed to disclose too much information about off-label drug prescriptions, that's another regulation. But fundamentally what you have there is a system of feedback. So, without the FDA's involvement physicians and pharmaceutical companies are able to find alternative uses for their drugs.</p> <p>So, instead of Viagra being used to reduce cholesterol essentially or to reduce congestion in the heart, it's better used for sexual performance in males. And a lot of this was found in clinical trials which then got introduced in the U.S. market through voluntary tests which then became part of medical journals, which then were introduced into specialized medical journals to make sure that this information was distributed to urologists, or doctors of various disciplines and then that's how the market emerged for sexual pharmacology, which was largely an entrepreneurial act by urologists saying \"We think sexual performance is not, for lack of a better word, all in your head. We actually think there's a physiological problem here and we think we can use pharmaceuticals to solve this.\"</p> <p>Petersen: So, you're saying that the main purpose of Viagra, the one that we've all heard of, that was not its original use?</p> <p>March: Oh no. Viagra was developed for heart congestion.</p> <p>Petersen: Wow, I did not know that.</p> <p>March: When you think of a little blue pill you think of erectile dysfunction for sexual performance, but no originally it was for---I'll tell the entire story, hope this goes to a family friendly audience---the story was this is developed in Britain, they started sending out these pills in an early clinical trial, they send them out to 30 or 100 middle-aged men, people you would think would be suspect for heart congestion and they send out the pills and they phone and they say \"Okay, how is it? You feel like you have less heart palpitations? We will run your blood and we'll see what your actual congestion is.\"</p> <p>And it didn't seem to be very effective in that, this is about halfway through a 30 day trial, and they say \"Okay, well send the pills back\" and then nobody sent them back.</p> <p>So they were questioning \"Why has nobody sent the pills back?\" and they started getting reports, \"Well it was actually helping with this other thing.\"</p> <p>And then they said \"Well we need to develop this drug for sexual performance. This is going to be a blockbuster.\"</p> <p>Petersen: And before that there wasn't an interest in, or doctors were interested maybe more in saving lives. So it's almost like the market for sexual performance enhancing drugs sort of came from the consumers themselves. Before this nobody said \"Hey you know what would we be great? A pill that enhances things in the bedroom.\" So, it's interesting. So they learned from the customers what their customers wanted.</p> <p>March: Yes, in this case directly. The field of what's called sexual pharmacology---so treating sexual problems with drugs---it largely emerges in the United States originally not Britain, and it's in the 1950s. And it's a group of, I believe, is about half a dozen to twenty urologists treating urological problems.</p> <p>They come to the conclusion that sexual problems are not all in your head, so it's not a psychological problem why sexual performance is not up to par, you're having these issues in the bedroom. It can actually be a physiological problem, so there's a problem with your sexual organs. And so they start experimenting with what were essentially nitrates, so things that affect blood flow and they start injecting them originally in themselves. So in the urologists' actual selves they would test that then test firmness, for lack of a better word, then they would say \"Okay, we think this can help our patients we're going to prescribe these off-label.\"</p> <p>Patients would go, they would increase their sexual performance, this starts getting out in medical journals. And then over across the ocean, you have Britain which sort of serendipitously comes across Viagra and finds out this little blue pill can actually do this too. They enter the U.S. market. So it's an international competition but it all originally starts with an entrepreneurial idea saying, \"No, we think we have a better way to treat sexual dysfunction.\"</p> <p>Petersen: Right. And yet they had to get over the idea that it was all---I don't know, this with would have been before the days when people also maybe believed strongly in mental illness because---the idea of something being \"all in your head\" in the age where we're all very aware that mental illness is an illness and it is related to physical things in your brain; the fact that something's all in your head doesn't mean necessarily that it's not real but this was the 50's, when maybe people philosophically didn't see things that way.</p> <p>March: Right the 1950s---there was some awareness of mental illness in the 1950s---the 1950s is when you start to have anti-psychotics, it's when they start to see we can help people that have previously been institutionalized by giving them these drugs which uptake into the brain, which can help you alleviate manias and depression, or anxiety.</p> <p>But the predominant theory for sexual dysfunction---it wasn't even called that back then, but what we can call for this podcast sexual dysfunction---was that this is a psychological problem so, the male couldn't perform---this is also true for females but what we were focusing on here is males---if the male couldn't perform it was some form of anxiety, so he needed to undergo psychotherapy or some kind of sexual therapy. And then he would go through that again and again until the point where he was comfortable enough performing sexually and that would somehow dissipate the problem.</p> <p>But entrepreneur urologists come in and say \"No.\" There's alternative explanations. It's not just that he has anxiety. It could be there's something actually physiologically wrong. And this is sort of a new idea because that, one, it's a whole new idea to say no the sexual performance is not always linked to your mental state or your perceived anxiety, but that we can actually treat this with injections, or with nitrates or with drugs and drugs that already exist on the market because we believe this is a blood flow problem.</p> <p>They had it tested on themselves so they were pretty confident in their theory. But then to go ahead and give it to patients and then give patients the ability to self-medicate. All of this progress was a period of 20 or 25 years for them to progress to that stage to where ED can be treated---be self-treated really---without the use of psychotherapy which was inconsistently effective. And then we get to the point where you can just inject an oral tablet, that's where Viagra comes in. All of this comes about because of an entrepreneurial awareness to say \"No, we don't think that the medical professional is treating this condition correctly.\"</p> <p>Petersen: So, one thing you talk about in your paper is the idea of superfluous entrepreneurship. What is that and how has it occurred in drug markets?</p> <p>March: Superfluous entrepreneurship as we go about it in this paper is the idea, given you're an entrepreneur in a regulatory state which prohibits you from discovering more effective ways to distribute goods, what happens to the goods you distribute? Are you distributing as effectively as you could without said regulation?</p> <p>And one of the ones we analyze in the paper is the development of insulin. I'm sure you and your viewers are aware of what insulin is, a diabetic who can't produce his insulin or doesn't produce enough, the Type-one and Type-two, needs to inject that when he eats carbs so he can manage his blood sugar and avoid diabetic complications. So, when insulin originally hits the market we've got to go back to, I want to say the 1920s, when they first started doing animal insulin. We have pig insulin and we have bovine insulin which saved thousands of diabetics' lives at the time, but they have side effects. As you can imagine, insulin is a hormone, if you inject animal hormones in you, there's going to be some side effects.</p> <p>And so by the time you get around to the 1940s we start finding ways, medical science advances enough to where we can synthetically produce human hormones, which is what modern insulin is, a human insulin. But the fear of the regulators is now that we can synthetically make hormones we don't necessarily know what are the side effects of synthetic hormones. And so in 1941 Congress passes what's literally called \"The Insulin Act\" which is if you're going to prescribe, or you're going to try to create a life-saving medication, which is what insulin is to diabetics, to Type-one diabetics especially, it has to go through additional rigorous testing.</p> <p>So what that means is the release of human insulin on the U.S. market is delayed, so diabetics who need to receive their insulin are still taking bovine and pig insulin, which is okay but when there was a clearly better alternative being human insulin available, you end up with superfluous discovery so instead of investing time---and this is what happens in the insulin market---you invest time and effort into finding ways to reduce complications from injecting bovine insulin, or find ways to change the what's called the duration event, so how long insulin last in your bloodstream trying to find ways to manipulate that or make that better. You have a better alternative which is to immediately bring in human insulin and treat diabetics using that and that doesn't become possible in the U.S. market because of these delayed regulations. Eventually insulin does get on the market but you have a prolonged period where people are noticeably getting worse treatment than what's available.</p> <p>Petersen: Right, and that's a very long period. I read in your paper they didn't approve human insulin until 1983 and did you say 1940s was when they discovered it?</p> <p>March: I believe 1941 was when it was first available for clinical testing and this was all done in Germany.</p> <p>Petersen: So 42 years.</p> <p>March: Right, of taking animal hormones.</p> <p>Petersen: Yes. So, the superfluous element of entrepreneurship is we have some kind of problem, people are willing to pay to have that problem solved. We have a cheap way of providing this subjective benefit to people, but the cheapest, best way that people would do in a free market is somehow blocked or illegal and so people entrepreneurship around regulation. Is that correct?</p> <p>March: You certainly see that in illicit drug markets, but yes that's also true in some pharmaceutical markets. I want to get this drug approved in the United States. I have human insulin which is better than cow and so I want to get approved in the United States. There's a big market for diabetics in the United States but the additional regulation makes it tough. So, I can find a way to circumvent that, either bring it on the black market, the illicit drug component, or I have to say no I can't compete in the United States because it is going to take too long, I'm just going to prescribe it over here in Germany or in Asia.</p> <p>And what that does, that just limits the entrepreneurial aspect of bringing better cures to market. So it's a superfluous effort you could say, marketing this drug in Asia or different countries in Europe instead of the United States. Those are all resources that could have been diverted towards something, or towards marketing the drug in the United States where you could argue it would be the highest value of use.</p> <p>Petersen: Right. And in your paper you also talk about delta nine THC found in marijuana, which is a treatment for nausea. Can you talk about that? That's illegal of course because it's from marijuana.</p> <p>March: That's an example where there's tons of medications out there for nausea, but the one you find in the medical marijuana derivative has been shown as particularly effective in difficult cases. So take cases where the typical forms of treatment which would normally help people---now we have more difficult cases---we're no longer allowed to prescribe these drugs we have to find synthetic uses of these drugs. So any time you take a synthetic use you're necessarily making the complications which you would face when the drug interacts with your body, they become a little bit more widespread. So you open yourself up to the treatment being less effective, but you also get more of a probability of these tail effects, where things you wouldn't necessarily see happen occur in your body.</p> <p>So, you make the drug. In some cases it's less effective, but you also can potentially make it more dangerous, which is the superfluous act. I am trying to use synthetic drugs to treat cases or treat illnesses when there's a better alternative in the background. So, I'm just trying to find a new and better way to make a potentially dangerous drug safer when there are already safer drugs available.</p> <p>Petersen: So a previous guest of this show, <a href= \"http://economicsdetective.com/2016/04/drugs-prohibition-suburban-overdose-crisis-mark-thornton/\" target=\"_blank\">Mark Thornton</a>, who you cite in your paper has argued that in the case of illicit drug markets, what the entrepreneurs do is to make them easier to smuggle by making them more concentrated, have a stronger effect for a smaller mass so they can be hidden in places where they're smuggled across borders or from the place they're produced to the place where they're sold. One example would of course be moonshine, so during the depression they obviously weren't selling low-alcohol-content wine because it would be so costly to smuggle that to people. They instead got the super strong moonshine and it was actually very dangerous. So, I suppose that's kind of an example of superfluous entrepreneurship, getting around the burdens placed on you, when in legal markets, of course, you don't have to always make things more concentrated and easier to smuggle because you don't have to smuggle them.</p> <p>March: Right exactly. Entrepreneurship is finding---I have my product, I eventually face competition because I'm making a profit, how do I make my product better? And so when you have to change the institutional setting to where now I have a product that I'm selling but it's technically illegal to sell this product, where can I put my efforts best for us to continue making a profit?</p> <p>In illicit markets it can just be the concentration, right? You mentioned the moonshine and the nine THC is another great example which is the main content of marijuana which people used to get high, you see the potency of these get much higher because that's primarily what you're trying to do is to sell the THC content to potential marijuana users. So instead of trying to find appropriate levels of THC or finding what you call niche, just accessories towards consuming marijuana which would differentiate the markets and serve consumers better, that is no longer profitable revenue and that's no longer a profitable or viable way to compete with people that are selling marijuana. Now it's how do I smuggle? How do I become a better or more active smuggler? And that's to raise the content of THC.</p> <p>Petersen: Or to get people onto drugs like cocaine that are significantly more potent per weight. I guess the great point made by Thornton is that by criminalizing these things, by criminalizing milder drugs in particular, you create a market for stronger ones.</p> <p>March: Right. Because that's how you compete on the margin for things like that. Yes.</p> <p>Petersen: So what other kinds of entrepreneurship do you see in the United States in medicine? I've heard about people sort of getting around the medical system, joining collectives where they pay directly to their doctor, trying to get away from the sort of hybrid insurance system that you have down there.</p> <p>March: That has become an alternative. And I don't know if I want to say an alternative market. But there has emerged a need for people to get outside of the larger insurance---that's the word I'm looking for---to get outside of the mainstream insurance market and to niche themselves into more specialized markets.</p> <p>So, with the passage of the Affordable Care Act right now, everybody has to have health insurance or you pay a massive penalty. You've standardized insurance, which in some cases maybe there's nothing wrong in having a standardized package of insurance. When you try to blanket that over the population of the United States you leave out specialized cases.</p> <p>So to give you a specific example what you see now in the market for diabetic treatment is now that insurance has become standardized to treat diabetics, you see less prescriptions written for specialized forms of insulin or insulin that acts faster or insulin that has a longer duration period. Now you see just generic insulin is being prescribed. Which is fine because the majority of diabetics are type-two diabetics and that's what they typically use, but then that leaves out cases of people with pancreatic cancer or type-one diabetics who need specialized insulin in order to better suit their individual illnesses, and you don't see that specialized treatment. So that leaves the market open for specialized insurance, or people that are going to co-ops, private alternatives where you pay into essentially a fund and 50 or so people will contribute 100 dollars a month. If one of them gets sick, they'll use the money in that fund to help this person overcome an illness they've come down with or any injury that's kept them outside of work.</p> <p>I think a lot of those entrepreneurial aspects are trying to get out of standardized medicine, standardized insurance but again because all of this is more or less dictated by the government you don't have the wiggle room to compete on the margins, what you have to do is go completely outside of a highly regulated market. That's what you're seeing marginally with insurance. You don't see as much of that in medicine.</p> <p>Medicine is a little more tightly controlled than insurance, even in the insurance market even today, but it's interesting. So, I think in the future there's going to emerge especially a larger market for these different forms of health insurance. It will help to treat people who have religious affiliations when they don't want to have insurance that helps to cover birth control or abortions for people that are in their group or they are pooled in the same insurance group. But also just people that aren't getting the kind of treatment they want. And this allows them to actually have health insurance for lack of a better word. I need a specialized form of treatment or I actually come down with a rare illness that the standard treatment is not going to help me with, I need to have insurance as a means to cover it and I think that's what you're seeing in the market with what you describe.</p> <p>Petersen: Right. So, I live in Canada and we have single payer, which ultimately is like post-Obamacare having private insurance companies but then having everyone legally required to get the insurance and then having those insurance companies having the government dictate what they provide and require them to take on people with preexisting conditions. It's almost like just some sort of weird way of replicating single payer just while maintaining the veneer of a private system but in Canada we have single payer officially.</p> <p>And there are some myths about it. So, we don't have socialized medicine per se. Doctors are not public servants but they can only accept payment from the government on your behalf, so sort of like maybe a private prison in the United States where they're kind of private but the only customer they can legally take on is the government.</p> <p>March: Which you wouldn't typically describe as a market. The market is to serve the consumers.</p> <p>Petersen: When the consumer is like a private contractor, serving the government. But of course we also restrict---you're not allowed to buy healthcare or medical care outside of the single payer system. There have been some court cases recently with people trying to argue for a right to do this but the typical thing to do is to cross the border to the States or fly to Southeast Asia to get your unapproved---or in order to pay for your own medicine.</p> <p>And the sort of justification for this is they don't want people competing up the prices of medical services, medical goods. I guess they like their monopsony status as the only buyer of medical services. But whenever I find myself arguing against the system or saying something to the effect of \"Hey this is a pure private good, why don't we let the free market provide it the way we do with our food and shelter and other things that are very important for living?\" I get really smart people arguing against me and some of the things they say are \"Can you point to a country with free market healthcare that works?\" and I have to say \"Well there isn't a country with pure free market healthcare\" Singapore is 50/50 and maybe that's as close as you get.</p> <p>But I guess to get to my question, why does every country intervene so strongly in medicine? What is it about medicine that that makes people really want to control it and have it centrally planned or regulated?</p> <p>March: Sure. I think that's the fundamental question of health economics. Analyzed from the perspective of an economist, how much is the market able to take care of the sick or those less able to take care of themselves and how much do you need state interference or government involvement to make a successful health company or healthcare system work? The way I'd like to think about health economics if we get outside of just focusing on insurance or treatment of rare illnesses or pre-existing conditions or asymmetric information and all these complex issues that people like to point and say, \"See that's where the market fails in healthcare, that's why you have to have a government.\"</p> <p>Fundamentally what we're looking at is how do you deal with uncertainty? We have more or less ways of assessing risk, where we know your risk increases of lung disease if you smoke a cigarette as a simplified example. But how do we purely deal with uncertainty? So, I'm an insurance company and I take you on as a client, I don't know your health status. Various regulations make it impossible for me to find that out. But I don't know your health status. I don't know if in five years you're going to develop cancer, if you're going to be healthy for the next 30 or 40 years. How is it ideal with that as an insurance provider or if I'm a doctor how do I know you're going to use this pharmaceutical responsibly or how do I know that these other clinical trials I've seen where this has helped the patient with your condition is going to help you because there's heterogeneity in how people respond to things.</p> <p>But fundamentally this uncertainty both in the provision of healthcare and in medical science itself, these permeate medicine. We're never fully going to be able to reduce the uncertainty. There's always going to be that element of the simple fact that we don't know. And I think that provokes the idea in a lot of people's heads that with no centralized plan we're not able to address this uncertainty. So we need to have the government come in and say health premiums need to be this or guarantee a system where even if you don't have health insurance you'll be taken care of if you need to go to the emergency room. Or if you come down with a very rare illness there will be pharmaceutical stock up in the hospital.</p> <p>I just think that in general, the uncertainty drives a lot of people to look toward centralization or to develop a centralized plan to try to mitigate that. But a lot of those efforts are somewhat short sighted because when you centralize things you don't take advantage of the uncertainty aspect of anything you just put all of the decision-making power within a federal bureau, the FDA or the federal government or even the USDA to some degree. At least in the United States, I know Canada has similar governmental bodies up there.</p> <p>But when you do that you divorce decision-making from the knowledge and you also divorce it from the incentive, like when we talked about what if the FDA doesn't have an incentive to release potentially dangerous drugs? Or as a pharmaceutical company if they see profits, they absolutely would, even if it is somewhat risky. So, I think the motivation primarily in why we don't see free healthcare or a free market in health insurance or competing systems of determining whether drugs are safe or effective is that there's a primary fear with people how do we address this uncertainty.</p> <p>Petersen: So there are various elements of the uncertainty. If I'm an insurance company I might worry that the people who come buying insurance, there's an adverse selection problem so the people who come to me for insurance are going to be the people who are the least healthy or the people who expect, for some reason that maybe I can't observe, to get sick. And that means based on the fact that only people likely to get sick are coming to me, I need to charge very high premiums for my insurance. And so it's <a href=\"https://en.wikipedia.org/wiki/The_Market_for_Lemons\" target=\"_blank\">the classic market for lemons problem</a>: The very fact that someone's selling you their used car maybe tells you that the car is a lemon. And the fact that you think it's a lemon means you won't pay very much for it, meaning that anyone who doesn't have a lemon wouldn't be willing to sell.</p> <p>So, at least with that, it seems that pooling everyone into the same pool helps. But on the other hand you do lose competitiveness. So, one example I've heard is the cost of rhinoplasty---the plastic surgery to make your nose look better---since that's not paid, since governments perhaps rightly see that as it's not life-threatening, it's not important and we're not going to pay for it, you pay for it yourself. And we see that the cost of a rhinoplasty has fallen dramatically over the years. And whereas life-saving surgery, you look at healthcare and housing and I guess university tuition, those are the three big things that consistently go up in cost over the years.</p> <p>Do you know a lot about the market for plastic surgery?</p> <p>March: Not a whole lot. I do know that because it's not regular you have means of competing and you have essentially competition to provide you with care to make your nose look better or for facial reconstructive surgery and similar things.</p> <p>I do know that a lot of cases like when you get breast augmentation you have to replace the inserts or whatever they're called. You have to replace those every set amount of years and you get routine inspections to make sure there's nothing going on with the surgical procedure, nothing wrong with the implant and all of that is done privately. So, it's interesting because getting plastic surgery is not necessarily a simple procedure. Just because the FDA is not involved in the procedure because there's not federal guidelines about when or when not you can do this procedure, how the procedure should be performed, it doesn't mean that the procedure is simple.</p> <p>As you pointed out, it's not life-saving but it's still surgery and there are still risks and complications. What we typically don't hear, with the exception of maybe a few TV shows, that sort of shock people, we don't hear about these horrible things going wrong on the surgical table when people get nose jobs. And I think a lot of that has to do with because they have to compete to make sure people are happy with the outcome but they also have to make sure, again if the procedure is safe and its efficacy. You look better when you're done and nothing happens to you or receive complications, you get infections from surgeries. So you do see that a lot in the United States.</p> <p>I want to go just briefly back into the adverse selection problem which I think is broadly the main argument for why you need to have government involvement in health insurance. Because you have that selection problem where only sick people want insurance and then insurance companies only want to provide really minimal standard care so you have that sort of mismatch and that would be a bad scenario for all. But to the extent that's true, it's based upon how is the insurance company is able to segment the market.</p> <p>So, if you're comparatively healthier than me and you just want to have catastrophic care, so something that if you were involved in a horrible accident and nobody could have planned for it, you need to have emergency care. You pay pretty low premiums and then the deductible is higher whereas someone like me I'm a type-one diabetic who needs to have consistent care throughout their life in order to maintain their health, their premiums should be a little bit higher but then the deductible should be a little bit lower since I have to keep taking insulin.</p> <p>But the problem is if they're not able to segment the market, and I think the reason they can't segment the market is because it's illegal to segment the market. What you don't have, they are two different forms of insurance. You don't have the insurance for sickly Ray me, or healthy you.</p> <p>You don't have means to compete on those margins, all you have is various plans. You buy into them, you have health insurance costs go up because there's less competition and the reasons we have explained before. So a lot of what you see with the adverse selection problem is a lack of marketing and the lack of marketing stems from the fact that it's illegal to do a lot of the research that health insurance companies want to do.</p> <p>Petersen: So, because deep down it seems so unfair that you could have a huge cost throughout your life just because you got sick through no fault of your own, we want people to pay the same. But then in doing so we create the adverse selection problem and it's sort of the old lady who swallowed the fly. We have to swallow the spider to eat the fly and eventually we're swallowing a single-payer healthcare system to put everyone in the same risk pool to deal with the problems that our initial minor intervention to try to make insurance more fair caused.</p> <p>March: Right. So what we would end up doing in that situation is that you would have to pay premiums, I would have to pay premiums we want to equal them out because it's unfair that you should have to be subsidized me for lack of a better word. Well, that means that you end up paying more in premiums than you actually wanted health insurance, I would end up paying less because we have to even out.</p> <p>More fundamentally if you want to address the fairness question---I think a lot of people do approach this from the aspect of fairness---is, one, why is it somewhat unfair for me as someone with a chronic illness to not have access to healthcare on a competitive market where I can decide which program I want, where I can assess my own risk, and where I can decide based upon my medical needs how at best to treat my illness; whereas someone like you who doesn't have a chronic illness places a completely different set of incentives? So when they pool us all they end up doing is limiting both of our choices. I think a fundamental question to ask there is which one of those is more or less fair?</p> <p>Petersen: Right. So, what sort of institutional changes, big or small---obviously some things are more politically feasible than others---but what institutional changes would you like to see to improve on our system?</p> <p>March: By \"our\" you mean the US system?</p> <p>Petersen: Yes, or in the systems worldwide that have similarly been adopted for similar reasons by many different countries.</p> <p>March: Sure. If we segment along the lines of there's health insurance and there's actual health products or health services.</p> <p>I would primarily start with the approval of pharmaceuticals. And I say that because a significant portion of the illnesses and conditions in the United States are treated with pharmaceuticals. So, if we're able to allow competing access to approval processes, that would drastically lower the cost of drugs. If you lower the cost of drugs, health insurance becomes less vital, certainly in my situation but in a lot of people's situations who need access to pharmaceuticals. The access to insurance becomes less important because there's less of a risk that you won't be able to afford the treatment if you need it.</p> <p>And I think that would push back insurance into---for lack of a better word---a more appropriate role. Insurance is supposed to be, there's a potential down the road that something bad will happen or I will develop an illness, I'll get sick, I'll break something, whatever you want to call it. I don't know if that's going to happen but if it does I want to make sure my livelihood or my standard of living continues as best it can. That's what actual insurance is. There's a chance that you could crash your car someday. And if your car is totaled you want to have repairs, you want a new car, that's why you buy car insurance. But now when we have health insurance we say \"oh no health insurance covers your routine doctor, it's going to cover some aspect of your drugs if you get a prescription, it's going to cover procedures from other people in this case because everything is pooled.\"</p> <p>But you don't see your progressive car insurance company pay for your oil change. That's a different thing. That's routine care. And I think if you reduce the cost of entry into medical devices and pharmaceuticals, so you reduce back the power of the FDA, you would naturally see health insurance go back into the proper insurance role. You could make an argument on the other way too as if you let insurance companies compete, premiums would go down. People would self-select into consuming health care products or not consuming health care products more effectively. That would drive down the cost.</p> <p>But I think the primary problem here is there's a restriction of access to medical devices and to pharmaceuticals and once you allow for a market and that health insurance no longer competes on those margins it would compete on margins of trying to ascertain risk of whether that would happen or not down the road.</p> <p>Petersen: So when you talk about pooling or when you talk about making approval cheaper, is that the system where two or more countries agree that a drug only needs to be approved in one of the countries to be allowed in all of them?</p> <p>March: That's one method. I was thinking more along the lines of within the United States could have private companies that would give you gold and silver standards of approval for pharmaceutical X and drug Y. And then people based on that would decide, okay I want to take this drug or I want to take that one, or physicians would have more access to information based on that than waiting for the FDA to approve. That's more what I was thinking about.</p> <p>On an international level that gets interesting because developing a drug in Europe and in Canada is completely different than developing that in the United States. The difference in the rigors of the approval process is what drives a lot of those conflicts but in terms of how you agree that everyone is going to come up with the same approval process method, I'm less optimistic about that because I think there's a public choice story behind it. Pharmaceutical companies want the approval process to be tough. So, like you said you can't develop pharmaceuticals in your basement despite your chemical knowledge.</p> <p>I do think there's more of a hope in the future though for less emphasis on FDA approval and more for private raters or private ratings to come in and say these drugs have been shown safe or for pharmaceutical companies to interact with private laboratories or clinical testing facilities to say, okay we passed these tests, and we communicate that our product is safe without the FDA</p> <p>Petersen: Right. And at the very least you could remove the effectiveness criteria from the FDA. Just say that the president or Congress could just tell the FDA, your job is just to check safety. Now if people want to take an ineffective drug, as long as it's safe they can do that.</p> <p>There's the idea of right to try. Have you heard of that?</p> <p>March: I have a segment of that in one of my pieces. I think that's very interesting because that's completely illegal action but you have certain states that will say okay if a drug is within phase three---that's when we start to do the safety testing with the FDA---and you say someone has an illness, they're in an insufferable pain, we know they're going to die, let's give them a shot to take this drug. And whether or not that helps or not is kind of secondary but it's a circumvention like we talked about earlier of the going around the FDA, which is a federal governing body, you are not supposed to be able circumvent that at the state level.</p> <p>But you go around and you give people access to potentially life-saving medication. But me being more of a market-oriented economist, I wonder what if you did that not just for life-saving drugs but for other drugs? And granted there are risks with every single drug, basically including water has certain risks to it. But given that there are risks associated with every drug, what would emerge in a freer market where you could better ascertain the safety of these drugs or the efficacy of these drugs?</p> <p>Petersen: So do you have any closing thoughts, anything we didn't mention?</p> <p>March: I guess one last concluding thought with regards to health economics I just want to reiterate that health economics is fundamentally a question about which set of institutions is best able to deal with uncertainty. And uncertainty in the sense where we just don't have clearly defined answers. Who would be better able to protect the population of a country from an epidemic or who would be better able to take care of the mentally ill, which is a set of illnesses we don't know very much about, or who is better able to find alternative uses of pharmaceuticals given their potential potency to be able to help people, and the potential side effects?</p> <p>And the debate is still very lively. It's to what level do we need centralization in order to answer these questions and to what level do the discovery processes of the market---for lack of a better word---how are we able to address these questions better? My research asks a question of if you don't have centralization what is the alternative? What are examples---not necessarily of entirely free health care systems---what are examples of private mechanisms working in the medical field and thus far I've found pretty convincing results that the private market is able to handle some pretty difficult situations, some pretty uncertain situations and when compared to the centralized alternative they fair fairly well.</p> <p>Petersen: My guest today has been Ray March. Ray, thanks for being part of Economics Detective Radio.</p> <p>March: Thanks for having me.</p>  <p></p>",
  "enclosure": "",
  "itunes:duration": "47:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my discussion with Ray March about the economics of medicine and health insurance. We had a fascinating and far-reaching discussion about health care policy, both in the United States and Canada, as well as some..."
}