{
  "title": "North Korea hits out at ‘awful’ mistake by US",
  "link": "https://www.rt.com/news/565874-north-korea-us-drills/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565874-north-korea-us-drills/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363cc1f85f5404eeb7b622c.jpg\" /> North Korea has warned the US and South Korea of consequences over the decision to prolong the ‘Vigilant Storm’ aerial drills <br/><a href=\"https://www.rt.com/news/565874-north-korea-us-drills/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Washington and Seoul have angered Pyongyang by opting to prolong massive aerial drills</strong></p>\n            \n                        \n            <p>The US and South Korea have made an <em>&ldquo;awful mistake&rdquo;</em> by extending the ongoing &lsquo;Vigilant Storm&rsquo; war games and therefore pushing tensions in the region into an <em>&ldquo;uncontrollable phase,&rdquo;</em> a top North Korean official said on Thursday.</p>\n<p><em>&ldquo;It was reported that the US and South Korea decided to extend the combined air drill Vigilant Storm. It is a very dangerous and false choice,&rdquo;</em> Pak Jong-chon, secretary of the Central Committee of the Workers&rsquo; Party of Korea, said in a statement.&nbsp;</p>\n<p>The official said the <em>&ldquo;irresponsible decision&rdquo;</em> was <em>&ldquo;shoving the present situation caused by provocative military acts of the allied forces to an uncontrollable phase.&rdquo;</em></p>\n<blockquote>\n<p><em><strong>The US and South Korea will get to know what an irrevocable and awful mistake they made.</strong></em></p>\n</blockquote>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362788f203027657549ac55.jpg\" alt=\"A television inside a train near Seoul, South Korea shows a North Korean missile test, November 2, 2022. © Anthony Wallace / AFP\" />\n            <figcaption><a href=\"https://www.rt.com/news/565810-north-korea-more-missiles/\">Pyongyang continues shelling and missile tests – Seoul</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The statement came shortly after the South Korean Air Force revealed it was discussing with the Pentagon a new timeline for the ongoing drills, which were originally scheduled to conclude on Friday. Seoul said the decision to extend the exercise stemmed from North Korea&rsquo;s <em>&ldquo;recent provocations.&rdquo;</em> So far, however, a new timeline has not been officially announced.&nbsp;</p>\n<p>This year&rsquo;s &lsquo;Vigilant Storm&rsquo;, which began on Monday and involves some 240 military aircraft, is the largest rendition of the exercise ever, according to the US Air Force. The drills were first held in 2015 under the name &lsquo;Vigilant Ace&rsquo; but were put on hold in 2018 as Seoul tried to mend ties with Pyongyang.</p>\n<p>North Korea has repeatedly condemned the exercise, blasting it as a rehearsal for an invasion and proof that Washington and Seoul are taking a hostile stance. Over this week, Pyongyang conducted military drills of its own, launching multiple ballistic missiles and warning of <em>&ldquo;more powerful follow-up measures.&rdquo;</em></p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 14:18:45 +0000",
  "dc:creator": "RT"
}