{
  "title": "Episode 129: “The Enchanted April” by Elizabeth von Arnim, Ch. 12-22",
  "itunes:title": "“The Enchanted April” by Elizabeth von Arnim, Ch. 12-22",
  "pubDate": "Tue, 26 Apr 2022 05:00:31 +0000",
  "guid": "1f28996f-10a0-432a-8692-3e265501f8e9",
  "link": "https://theliterarylife.libsyn.com/episode-129-the-enchanted-april-by-elizabeth-von-arnim-ch-12-22",
  "itunes:image": "",
  "description": "<p>This week on The Literary Life podcatst, Angelina, Cindy and Thomas continue their discussion of <em><a href= \"https://amzn.to/3uiLFTs\">The Enchanted April</a></em> by Elizabeth von Arnim, on chapters 12-22. Angelina and Thomas begin the conversation sharing some thoughts on modern literature and why we don’t hear of modern authors like Elizabeth von Arnim among “the academy.” Cindy tells us what stood out to her most in the second half of the book and the surprising turns von Arnim takes in the storyline. Angelina and Thomas also talk about the types of books they enjoy, and Cindy brings up the longings and fears of the various characters. The metaphors and fairy tale concepts found in this book are, of course, major topics of the conversation.</p> <p>Return next week when we will discuss the film versions of <em>The Enchanted April</em>. Our next book will be <em><a href= \"https://amzn.to/3vaBl1x\">The Wind in the Willows</a></em> by Kenneth Graham, starting in May, so be sure to join us for that as well!</p> <p>Cindy’s 2022 Morning Time for Moms Summer Discipleship group is now open for registration. The theme this year is “Laughter and Lament.” Head over to <a href= \"https://morningtimeformoms.com/events/1758-2/\">morningtimeformoms.com</a> to find out more and sign up!</p> <p>Thomas will be teaching an introductory course on Russian Literature in July 2022. Learn more and register at <a href= \"https://houseofhumaneletters.com/russianliterature/\">houseofhumaneletters.com</a>.</p> <h3>Commonplace Quotes:</h3> <blockquote class=\"wp-block-quote\"> <p>Keeping up with the Joneses was a full time job with my mother and father. It was not until many years later when I lived alone that I realized how much cheaper it was to drag the Joneses down to my level.</p> <cite>Quentin Crisp</cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>Here is a matter which sometimes causes uneasiness to parents: they are appalled when they think of the casual circumstances and chance people that may have a lasting effect upon their children’s characters. But their part is, perhaps, to exercise ordinary prudence and not over-much direction. They have no means of knowing what will reach a child; whether the evil which blows his way may not incline him to good, or whether the too-insistent good may not predispose him to evil. Perhaps the forces of life as they come should be allowed to play upon the child, who is not, be it remembered, a product of educational care, but a <em>person</em> whose spiritual nurture is accomplished by that wind which bloweth whither it listeth.</p> <cite>Charlotte Mason, <em><a href= \"https://amzn.to/3vB0EJf\">Formation of Character</a></em></cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>Chaste and ardent eros for the Beautiful is the first task of human life, and falling in love with Beauty is the beginning of every adventure that matters.</p> <cite>Timothy Patitsas</cite></blockquote> <blockquote class=\"wp-block-quote\"> <p>To be sure, there are limits and patterns governing the transposition of beauty into truth, such that it can never be mapped fully in the reductive way some would insist. It was never my desire to write a truth-first book about the beauty-first approach to ethics. Beauty creates its own structure, a form that may not be perfectly linear and symmetrical, but which is still harmonious and beneficial, and in its odd way, perfectly accurate. Through the surprising order of the beautiful, reason participates in and discloses living mystery as mystery. That is, when it starts with an eros for the beautiful, reason is able to announce to the world what mystery is, that which interprets and changes us, just when we manage to engage with it and interpret it.</p> <cite>Timothy Patitsas</cite></blockquote> <h3>Summer Dawn</h3> <p><em>by William Morris</em></p> <pre class=\"wp-block-verse\"> Pray but one prayer for me 'twixt thy closed lips,  Think but one thought of me up in the stars.  The summer night waneth, the morning light slips,  Faint and grey 'twixt the leaves of the aspen, <br />betwixt the cloud-bars  That are patiently waiting there for the dawn:  Patient and colourless, though Heaven's gold  Waits to float through them along with the sun.  Far out in the meadows, above the young corn,  The heavy elms wait, and restless and cold  The uneasy wind rises; the roses are dun;  Through the long twilight they pray for the dawn,  Round the lone house in the midst of the corn,  Speak but one word to me over the corn,  Over the tender, bow'd locks of the corn.</pre> <h3>Book List:</h3> <p><em><a href=\"https://amzn.to/3uiLFTs\">The Enchanted April</a></em> by Elizabeth von Arnim</p> <p><em><a href=\"https://amzn.to/36FUEq9\">The Ethics of Beauty</a></em> by Timothy Patitsas</p> <p><a href=\"https://amzn.to/3EOb8sY\">Katherine Mansfield</a></p> <p><a href=\"https://amzn.to/3K9InrH\">Barbara Pym</a></p> <p><a href=\"https://amzn.to/3Kh2pRe\"><em>The Narnian</em></a> by Alan Jacobs</p> <p><a href=\"https://amzn.to/3k6wyYB\"><em>Vera</em></a> by Elizabeth von Arnim</p> <h3>Support The Literary Life:</h3> <p>Become a patron of The Literary Life podcast as part of the “Friends and Fellows Community” on <a href= \"https://www.patreon.com/theliterarylife/overview\">Patreon,</a> and get some amazing bonus content! Thanks for your support!</p> <h3>Connect with Us:</h3> <p>You can find Angelina and Thomas at <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a>, on Instagram <a href= \"https://www.instagram.com/angelinastanford/\">@angelinastanford</a>, and on Facebook at <a href= \"https://www.facebook.com/ANGStanford/\">https://www.facebook.com/ANGStanford/</a></p> <p>Find Cindy at <a href= \"https://cindyrollins.net\">morningtimeformoms.com</a>, on Instagram <a href= \"https://www.instagram.com/cindyordoamoris/\">@cindyordoamoris</a> and on Facebook at <a href= \"https://www.facebook.com/cindyrollins.net/\">https://www.facebook.com/cindyrollins.net/</a>. Check out <a href= \"https://www.patreon.com/cindyrollins?fbclid=IwAR3acx7P6FGt1Us_buk7cIzIaK31FxMaNlK53pKfV5vr8SYphKVywNIAqZ8\">Cindy’s own Patreon page</a> also!</p> <p>Follow <a href= \"https://www.instagram.com/literarylifepodcast/\">The Literary Life</a> on Instagram, and jump into our private Facebook group, The Literary Life Discussion Group, and let’s get the book talk going! <a href= \"http://bit.ly/literarylifeFB\">http://bit.ly/literarylifeFB</a></p>",
  "content:encoded": "<p>This week on The Literary Life podcatst, Angelina, Cindy and Thomas continue their discussion of <em><a href= \"https://amzn.to/3uiLFTs\">The Enchanted April</a></em> by Elizabeth von Arnim, on chapters 12-22. Angelina and Thomas begin the conversation sharing some thoughts on modern literature and why we don’t hear of modern authors like Elizabeth von Arnim among “the academy.” Cindy tells us what stood out to her most in the second half of the book and the surprising turns von Arnim takes in the storyline. Angelina and Thomas also talk about the types of books they enjoy, and Cindy brings up the longings and fears of the various characters. The metaphors and fairy tale concepts found in this book are, of course, major topics of the conversation.</p> <p>Return next week when we will discuss the film versions of <em>The Enchanted April</em>. Our next book will be <em><a href= \"https://amzn.to/3vaBl1x\">The Wind in the Willows</a></em> by Kenneth Graham, starting in May, so be sure to join us for that as well!</p> <p>Cindy’s 2022 Morning Time for Moms Summer Discipleship group is now open for registration. The theme this year is “Laughter and Lament.” Head over to <a href= \"https://morningtimeformoms.com/events/1758-2/\">morningtimeformoms.com</a> to find out more and sign up!</p> <p>Thomas will be teaching an introductory course on Russian Literature in July 2022. Learn more and register at <a href= \"https://houseofhumaneletters.com/russianliterature/\">houseofhumaneletters.com</a>.</p> Commonplace Quotes:  <p>Keeping up with the Joneses was a full time job with my mother and father. It was not until many years later when I lived alone that I realized how much cheaper it was to drag the Joneses down to my level.</p> Quentin Crisp  <p>Here is a matter which sometimes causes uneasiness to parents: they are appalled when they think of the casual circumstances and chance people that may have a lasting effect upon their children’s characters. But their part is, perhaps, to exercise ordinary prudence and not over-much direction. They have no means of knowing what will reach a child; whether the evil which blows his way may not incline him to good, or whether the too-insistent good may not predispose him to evil. Perhaps the forces of life as they come should be allowed to play upon the child, who is not, be it remembered, a product of educational care, but a <em>person</em> whose spiritual nurture is accomplished by that wind which bloweth whither it listeth.</p> Charlotte Mason, <em><a href= \"https://amzn.to/3vB0EJf\">Formation of Character</a></em>  <p>Chaste and ardent eros for the Beautiful is the first task of human life, and falling in love with Beauty is the beginning of every adventure that matters.</p> Timothy Patitsas  <p>To be sure, there are limits and patterns governing the transposition of beauty into truth, such that it can never be mapped fully in the reductive way some would insist. It was never my desire to write a truth-first book about the beauty-first approach to ethics. Beauty creates its own structure, a form that may not be perfectly linear and symmetrical, but which is still harmonious and beneficial, and in its odd way, perfectly accurate. Through the surprising order of the beautiful, reason participates in and discloses living mystery as mystery. That is, when it starts with an eros for the beautiful, reason is able to announce to the world what mystery is, that which interprets and changes us, just when we manage to engage with it and interpret it.</p> Timothy Patitsas Summer Dawn <p><em>by William Morris</em></p>  Pray but one prayer for me 'twixt thy closed lips,  Think but one thought of me up in the stars.  The summer night waneth, the morning light slips,  Faint and grey 'twixt the leaves of the aspen, betwixt the cloud-bars  That are patiently waiting there for the dawn:  Patient and colourless, though Heaven's gold  Waits to float through them along with the sun.  Far out in the meadows, above the young corn,  The heavy elms wait, and restless and cold  The uneasy wind rises; the roses are dun;  Through the long twilight they pray for the dawn,  Round the lone house in the midst of the corn,  Speak but one word to me over the corn,  Over the tender, bow'd locks of the corn. Book List: <p><em><a href=\"https://amzn.to/3uiLFTs\">The Enchanted April</a></em> by Elizabeth von Arnim</p> <p><em><a href=\"https://amzn.to/36FUEq9\">The Ethics of Beauty</a></em> by Timothy Patitsas</p> <p><a href=\"https://amzn.to/3EOb8sY\">Katherine Mansfield</a></p> <p><a href=\"https://amzn.to/3K9InrH\">Barbara Pym</a></p> <p><a href=\"https://amzn.to/3Kh2pRe\"><em>The Narnian</em></a> by Alan Jacobs</p> <p><a href=\"https://amzn.to/3k6wyYB\"><em>Vera</em></a> by Elizabeth von Arnim</p> Support The Literary Life: <p>Become a patron of The Literary Life podcast as part of the “Friends and Fellows Community” on <a href= \"https://www.patreon.com/theliterarylife/overview\">Patreon,</a> and get some amazing bonus content! Thanks for your support!</p> Connect with Us: <p>You can find Angelina and Thomas at <a href= \"https://houseofhumaneletters.com/\">HouseofHumaneLetters.com</a>, on Instagram <a href= \"https://www.instagram.com/angelinastanford/\">@angelinastanford</a>, and on Facebook at <a href= \"https://www.facebook.com/ANGStanford/\">https://www.facebook.com/ANGStanford/</a></p> <p>Find Cindy at <a href= \"https://cindyrollins.net\">morningtimeformoms.com</a>, on Instagram <a href= \"https://www.instagram.com/cindyordoamoris/\">@cindyordoamoris</a> and on Facebook at <a href= \"https://www.facebook.com/cindyrollins.net/\">https://www.facebook.com/cindyrollins.net/</a>. Check out <a href= \"https://www.patreon.com/cindyrollins?fbclid=IwAR3acx7P6FGt1Us_buk7cIzIaK31FxMaNlK53pKfV5vr8SYphKVywNIAqZ8\">Cindy’s own Patreon page</a> also!</p> <p>Follow <a href= \"https://www.instagram.com/literarylifepodcast/\">The Literary Life</a> on Instagram, and jump into our private Facebook group, The Literary Life Discussion Group, and let’s get the book talk going! <a href= \"http://bit.ly/literarylifeFB\">http://bit.ly/literarylifeFB</a></p>",
  "enclosure": "",
  "itunes:duration": "01:31:35",
  "itunes:explicit": false,
  "itunes:keywords": "books,arts,reading,literature,Education,classical,charlottemason,readalong",
  "itunes:subtitle": "This week on The Literary Life podcatst, Angelina, Cindy and Thomas continue their discussion of  by Elizabeth von Arnim, on chapters 12-22. Angelina and Thomas begin the conversation sharing some thoughts on modern literature and why we don’t hear...",
  "itunes:season": 4,
  "itunes:episode": 129,
  "itunes:episodeType": "full",
  "itunes:author": "Angelina Stanford Cindy Rollins Thomas Banks"
}