{
  "title": "TU48: Tensions Around #MeToo &#8211; Bridging Gender in This Conversation",
  "link": "https://therapistuncensored.com/episodes/tu48-tensions-around-metoo-bridging-gender-in-this-conversation/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu48-tensions-around-metoo-bridging-gender-in-this-conversation",
  "pubDate": "Tue, 21 Nov 2017 12:30:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5659",
  "description": "#MeToo flips power on it’s head, but in so doing has also caused strife within good relationships and high tension and some polarization across the gender divide.\n\nWomen are taking their abuse and assault stories out from hiding. They are using their collective voice to mobilize and they are Telling Their Stories. The power and safety of strength in numbers, #MeToo social media phenomenon, has unleashed a flood of sharing as-yet unheard stories of a wide variety of unwanted intrusions.\n\nIn this episode we explore the tensions felt by both men and women in their discussions around coming out about sexual harassment and assault, and explore strategies for increasing understanding and connection between people who identify as men and women.\n\nCo-hosts Ann Kelley, PhD and Sue Marriott LCSW, CGP join special guest, Mason Marriott-Voss in a discussion on sexual harassment, the power flip against men in power, and the uncertainty many men now face in acting appropriately around women. Mason shares his views as a cis straight white man and ventures to suggest how men might engage with the women in their lives affected by unwanted sexual pursuit and objectification.\n\nWe also discuss how men can work towards being more accurate listeners and assume a more vulnerable role in the dialogues surrounding sexual harassment today. We get into the biological implications of physical threat and how that varies between men and women and how this affects their ability to empathize. We also offer suggestions for how to avoid getting defensive and instead engage in these dialogues in a respectful, open and understanding way.\n\nMason Marriott-Voss is a University of Texas student, the state of Texas debate champion and award-winning advocate for GLBTQ families. Can you guess who’s offspring he is? We sincerely thank this brave, young leader for being on our show!\nLike this and want to hear more?  Join our email list here, subscribe to Tunes here or sign up for the waiting list for our free online course on Modern Adult Attachment here! We may read your review on air, please rate and review us on your favorite podcast player, it helps so much!!\nFinally – this is the easiest of all – “Like” our public Facebook page here to get updated popular articles on these subjects of interest.\n0:00-15:00\n\nIntroduction, joining the dialogue on sexual harassment, assault, and the media\n\nAvoiding conflict when engaging in this widespread discussion amongst people who identify in different group\n\nCountering the idea of #NotAllMen in a sense of being complicit within system. Complications of #NotAllMen when it comes to trans identifying men.\n\nComparing sexual assault to bullying in terms of power differentials\n\nTendency of men to have a desire to defend in a “not me” type way…if you’re not that and this is as widespread a problem as it is, who IS that?\n\nHow to have this conversation as a man and acknowledge the power differential, trying to avoid talking about this dialogue in an overly analytical way, not recognizing physical fear women feel. Speaking on an interpersonal level without having comparable experience.\n\nRecognizing as men that you don’t understand.\n\n \n\n15:00-30:00\n\nThe idea of heterosexual men experiencing discomfort at thought of being checked out by a homosexual man. Is it a comparable experience if the physical threat isn’t as prevalent?\n\nBiology of threats and heightened bodily states in women when discussing assault.\n\nDifficulty for (particularly white) men to not validate themselves in these discussions and instead listen.\n\nMost appropriate venue for men to have more active role in conversations is with circles of other men, though this rarely happens.\n\nPsychological trauma of not being believed or reassigning blame after the fact. Harvey Weinstein and accusers as a huge example of this.\n\nLouis C.K. accusations and response. Other celebrity accusations.\n\nAvoiding the “not me” attitude as a man",
  "enclosure": "",
  "itunes:subtitle": "#MeToo flips power on it’s head, but in so doing has also caused strife within good relationships and high tension and some polarization across the gender divide. - Women are taking their abuse and assault stories out from hiding.",
  "itunes:summary": "Can healthy dialogue around the #MeToo phenomena cross genders?  We explore the tensions felt by both men and women in understanding one another and  strategies to help listeners balance power and create safety together",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "59:10"
}