{
  "title": "How the Media’s “Save Democracy” Crusade Threatens Democracy",
  "link": "https://www.heritage.org/election-integrity/commentary/how-the-medias-save-democracy-crusade-threatens-democracy",
  "description": "<p>Americans are getting fed up with the mainstream media using leftist narratives that undermine trust in democracy and our election system.</p>\n\n<p>A recent New York Times/Sienna poll found <a href=\"https://www.foxnews.com/media/majority-registered-voters-media-threat-democracy-poll-finds\" target=\"_blank\">59 percent of Americans</a> consider the “mainstream media” a threat to democracy—outranking either President Joe Biden or former President Donald Trump.</p>\n\n<p>Ironically, it has been corporate media such as The New York Times, The Washington Post, CNN, and MSNBC that have driven the absurd narrative that American democracy is on death’s door. These media outlets have obligingly helped the left establish a template for explaining away a potential shift to the right in the 2022 midterms: blame Republican voter suppression. If the left can’t convince voters that Republicans are dangerous “election deniers” who will stamp out democracy, they’ll simply deny the legitimacy of the outcome.</p>\n\n<p>This tactic may seem familiar by now. Last year, corporate media happily hopped <a href=\"https://www.foxnews.com/media/flashback-cnn-msnbc-ran-jim-crow-voter-suppression-claims-georgia-record-turnout\" target=\"_blank\">on board</a> with Stacey Abrams labeling as “Jim Crow 2.0” the commonsense election integrity laws passed by Georgia and some two dozen other states. Echoing Abrams, they smeared these reforms—such as extending voter ID to absentee ballots, requiring accurate voter registration rolls, and restricting ballot harvesting—as “voter suppression” or “restrictive voting laws.”</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/election-integrity/commentary/dont-fall-democrats-voter-suppression-myths\">Don’t Fall for Democrats’ \"Voter Suppression\" Myths</a></strong></p>\n\n<p>These laws neither suppressed nor restricted voting. These states have since experienced massive turnouts for both primaries and early voting. But petty facts haven’t dampened the left’s narrative or the media’s willingness to keep parroting it.</p>\n\n<p><a href=\"https://www.msnbc.com/the-reidout/reidout-blog/midterm-elections-voter-restrictions-republicans-rcna51465\" target=\"_blank\">MSNBC pundits</a> still insist voter ID laws put the “thumb on the scale” for the Republicans. Vox seemed almost disappointed at the large number of people voting after the reforms took effect, doggedly insisting in a September headline that “<a href=\"https://www.vox.com/policy-and-politics/2022/9/19/23356904/voter-suppression-midterm-elections\" target=\"_blank\">High voter turnout doesn’t cancel out voter suppression</a>.”</p>\n\n<p>Early this year, Biden wrote in a <a href=\"https://twitter.com/potus/status/1483444483140329479\" target=\"_blank\">tweet</a>, “Jim Crow 2.0 is about two insidious things: voter suppression and election subversion.” And, at a press conference, <a href=\"https://www.cbsnews.com/news/biden-election-legitimacy-comments-white-house-clarification/\" target=\"_blank\">Biden said</a>, “I think it easily could be—be illegitimate,” and “I’m not going to say it’s going to be legit” unless Democrat voting legislation passed Congress. The legislation didn’t pass, and it seems likely that final tallies on Nov. 8 will make it difficult to sell the narrative that Republicans rigged the elections with voter suppression.</p>\n\n<p>Rather than scrutinize Democrat legislation pushed by Biden that would effectively nationalize elections and nullify clean election laws, The New York Times dutifully ran a headline, “<a href=\"https://www.nytimes.com/live/2022/01/19/us/biden-voting-rights-filibuster\" target=\"_blank\">Democrats Fail to Change Filibuster Rules as Republicans Block Action on Voting Rights</a>.” Other <a href=\"https://www.cnn.com/2022/01/11/politics/biden-atlanta-voting-rights-speech/index.html\" target=\"_blank\">media</a> <a href=\"https://www.washingtonpost.com/politics/biden-voting-rights-filibuster/2022/01/11/ada7ce66-72dd-11ec-b202-b9b92330d4fa_story.html\" target=\"_blank\">outlets</a> used the <a href=\"https://www.nbcnews.com/politics/white-house/biden-under-pressure-chart-voting-rights-path-atlanta-speech-n1287255\" target=\"_blank\">desired</a> <a href=\"https://time.com/6138696/joe-biden-voting-rights-filibuster/\" target=\"_blank\">Democrat</a> <a href=\"https://abcnews.go.com/Politics/biden-supports-changing-filibuster-rule-pass-voting-rights/story?id=82187118\" target=\"_blank\">characterization</a> of being for voting rights or against voting rights.</p>\n\n<p>More recently, <a href=\"https://www.msnbc.com/opinion/msnbc-opinion/desantis-voter-fraud-arrests-are-voter-suppression-tactic-n1300040\" target=\"_blank\">Democrats and the media</a> are accusing one of the left’s boogeymen, Florida Gov. Ron DeSantis, of voter suppression because the state’s Office of Election Crimes and Security oversaw dozens of arrests for alleged voter fraud in the state.</p>\n\n<p>Several of these defendants say local government employees misled them into registering to vote when they were ineligible. That might well be the case. Even if you accept the premise that the arrests went overboard, the arrests were of ineligible voters. To qualify as voter suppression, they would have had to prevent eligible voters from either registering or voting.</p>\n\n<p>While the media tamely follows the left’s narrative on election integrity, the general public doesn’t seem to buy it. A recent <a href=\"https://news.gallup.com/poll/403052/eight-americans-favor-early-voting-photo-laws.aspx\" target=\"_blank\">Gallup poll</a> found that 79 percent of Americans support voter ID laws, with majorities across racial and partisan demographics.</p>\n\n<p>In October, Rolling Stone tried a new wrinkle on the old narrative. Marrying two of the left’s obsessions, the magazine <a href=\"https://www.rollingstone.com/politics/political-commentary/transgender-rights-voter-id-republicans-voting-1234615400/\" target=\"_blank\">ran a piece</a> citing a UCLA study claiming that voter ID laws disproportionately harm the transgender community. Rolling Stone’s claim is that about 65,000 transgender people in battleground states won’t have the right ID to vote, and “That’s enough suppressed votes to swing an election.”</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/election-integrity/commentary/election-integrity-and-the-american-republic\">Election Integrity and the American Republic</a></strong></p>\n\n<p>Taxpayer-funded PBS took a more historic tack. Its story, “<a href=\"https://www.pbs.org/newshour/show/low-literacy-voters-struggle-to-cast-ballots-in-the-face-of-restrictive-voting-laws\" target=\"_blank\">Low literacy voters struggle to cast ballots in the face of restrictive voting laws</a>,” trotted out the <a href=\"https://www.congressionalresearch.org/SecretBallot.html\" target=\"_blank\">same argument</a> used in the late 1800s to oppose the secret ballot. Some of these arguments deal with ballot harvesting—the practice of political operatives collecting and distributing mass quantities of ballots. Ballot harvesting clearly opens the door to violating the principle of a private ballot, since political operatives can stare over people’s shoulders while they vote. It also raises chain-of-custody questions and poses a danger of ballot tampering.</p>\n\n<p>It’s highly unlikely that these fearmongering predictions of “voter suppression” will ever pan out. Just as voting increased in 2022 after the discredited “Jim Crow 2.0” rhetoric, <a href=\"https://www.nber.org/papers/w25522\" target=\"_blank\">various studies</a> show voter ID laws have never negatively affected voter turnout.</p>\n\n<p>It’s a stretch to say the media actually threatens the existence of democracy, as the New York Times poll suggests a majority believes. But a free and honest press is vital to our political system. And when the bulk of media outlets remain committed to a partisan narrative despite a plethora of facts and evidence to the contrary, it isn’t healthy for the press or democracy.</p>",
  "pubDate": "Fri, 04 Nov 2022 17:06:27 -0400",
  "dc:creator": "Fred Lucas",
  "guid": "https://www.heritage.org/election-integrity/commentary/how-the-medias-save-democracy-crusade-threatens-democracy"
}