{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-5683895549180280275",
  "published": "2022-10-17T10:54:00.003+05:00",
  "updated": "2022-10-17T10:54:49.499+05:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "PTCL Group, Evision Ink Deal To Launch Video Streaming Platform In Pakistan",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgwu9uVF0rdC7hwcJuVu9R5Rah4tcMQC4mEhwI_b_QKHIzR3Tfi2DebQO9KIj9bug90xVjDXKJyKKmD7sYTuK89R6AGhtUUPq8L7tphGdmmMsXyhFFYsIjhJLkF5zD6I0knSeGDZD78hLvhICWWPW9wCJ0rcifDb9X1ln0IP-SmYW6juVXRYAqe_5n7ew/s600/KT_724d7image_story.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"337\" data-original-width=\"600\" height=\"360\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgwu9uVF0rdC7hwcJuVu9R5Rah4tcMQC4mEhwI_b_QKHIzR3Tfi2DebQO9KIj9bug90xVjDXKJyKKmD7sYTuK89R6AGhtUUPq8L7tphGdmmMsXyhFFYsIjhJLkF5zD6I0knSeGDZD78hLvhICWWPW9wCJ0rcifDb9X1ln0IP-SmYW6juVXRYAqe_5n7ew/w640-h360/KT_724d7image_story.jpg\" width=\"640\" /></a></div><br /><p><br /></p><p><br /></p><p><br /></p><p>Pakistan Telecommunication Company Ltd. (PTCL) and Ufone 4G, subsidiaries of Etisalat e&amp;, have signed an agreement with evision to launch a video streaming platform in Pakistan.</p><p><br /></p><p>The new digital video over-the-top (OTT) platform will host a vast collection of Hollywood and Pakistani entertainment content besides a variety of national and international news and sports channels, thereby catering to the diverse news and entertainment needs of everyone in the family.</p><p><br /></p><p><br /></p><p>Evision, too, is the media and entertainment wing of the UAE's largest telecom services provider.</p><p><br /></p><p>Adnan Anjum, group chief commercial officer of PTCL and Ufone, and Olivier Bramly, CEO of evision, inked the agreement during Gitex Global 2022 in Dubai.</p><p><br /></p><p>President and Group CEO, PTCL &amp; Ufone, Hatem Bamatraf and Chief Executive Officer, e&amp; life, Khalifa AlShamsi were also present. evision is the media and entertainment wing of global telecom giant, e&amp; and the leading provider of media and entertainment content in the MENA region.</p><p><br /></p><p><br /></p><p>Hatem Bamatraf, president and group CEO of PTCL and Ufone, and Khalifa Al Shamsi, chief executive officer of e&amp; life, were also present at the signing ceremony.</p><p><br /></p><p>The evision-led consortium has majority shares in the leading video streaming platform in Mena, StarzPlay that will technically help the PTCL Group with deploying the new Digital Video OTT Platform to host movies and seasons from leading Hollywood studios in addition to Pakistani films and dramas to cater to a wide range of viewership in the country.</p><p><br /></p><p><br /></p><p>Bamatraf said:“I am grateful to evision for their support in this initiative that furthers our efforts to diversify our services and positively impact more aspects of our customer's lives. Technology is the most effective enabler of our age, and we continuously strive to harness its potential for our customers' benefit. We find news and entertainment a huge part of our people's lives and it offers us a good opportunity to reinvent television and online streaming experience to bring them more control and choice in their viewing.”</p><p><br /></p><p>AlShamsi, said:“Evision is the leading media and entertainment content aggregator in the MENA region. We are glad to work with the PTCL Group to extend our services to the people of Pakistan to help them enjoy high-quality content with greater ease and access. Pakistan is a huge market that needs a homegrown video streaming platform that can better understand the people's choices and preferences and caters to them accordingly.”</p><p><br /></p><p>The new video streaming platform will be accessible to all data subscribers in addition to PTCL and Ufone users at affordable prices.</p><p><br /></p><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}