{
  "title": "Craig Partridge Is Still Working to Improve Internet Traffic",
  "link": "https://spectrum.ieee.org/craig-partridge-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-smiling-bearded-man-in-a-blue-turtleneck-stands-in-front-of-a-building.png?id=31965104&width=1200&height=800&coordinates=0%2C0%2C0%2C162\"/><br/><br/><p><strong>For computer pioneer </strong><a href=\"https://www.linkedin.com/in/craig-partridge-3aa6602/\" rel=\"noopener noreferrer\" target=\"_blank\">Craig Partridge</a>, pushing the envelope on interesting challenges has been his modus operandi. It’s what led him to make key contributions to the early Internet. Today he’s working on getting a better understanding of traffic flows in <a href=\"https://en.wikipedia.org/wiki/Virtual_private_network\" rel=\"noopener noreferrer\" target=\"_blank\">VPNs</a>. In addition, he is trying to figure out what causes high rates of packet errors, which often result in bad file transfers, and how to fix them. </p><p>Although his bachelor’s degree from <a href=\"http://harvard.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Harvard</a> was in history, the computer electives he took convinced him he had both the aptitude and interest for a career in computing. And he was right. He focused on networking concepts and technologies while working at the ARPAnet and Internet pioneering firm Bolt Beranek & Newman (BBN), now <a href=\"https://www.raytheonintelligenceandspace.com/what-we-do/bbn\" rel=\"noopener noreferrer\" target=\"_blank\">Raytheon BBN Technologies</a>.</p><hr/><p>There, the IEEE Fellow collaborated with TCP/IP developer <a href=\"https://www.linkedin.com/in/philkarn\" rel=\"noopener noreferrer\" target=\"_blank\">Phil Karn</a> on TCP message round-trip time estimation. Partridge also led the team that designed and built the world’s first high-speed router.</p><p>“It was 1983, and BBN needed an additional person who could write TCP/IP code for the BSD [Berkeley Software Distribution] Unix operating system,” he says. “BBN had folks who wrote most of the original code, and they taught me what networking and TCP/IP was. That was something no grad school at the time could teach me.</p><p>“A lot of what I worked on 30 or more years ago is still used today,” Partridge notes proudly. “More generally, a lot of the Internet tech used today is entirely or almost entirely recognizable from what was created back then. That’s a very pleasant feeling.”</p><p>Partridge is an <a href=\"https://www.internethalloffame.org/inductees/craig-partridge\" rel=\"noopener noreferrer\" target=\"_blank\">Internet Hall of Fame</a> inductee for his work in designing how email is routed using domain names.</p><p>While working at BBN, he went on to earn a master’s and Ph.D. in computer science, both from Harvard. By 2018 Partridge was chief scientist for networking research at BBN, but he decided he didn’t want his tenure there to be the last chapter of his career. Later that year he joined <a href=\"https://www.colostate.edu\" rel=\"noopener noreferrer\" target=\"_blank\">Colorado State University</a> in Fort Collins, as chair of its department of computer science.</p><p>Partridge says it’s not uncommon for engineers to move from industry to academia later in their careers. They often want to “give back” by becoming professors, deans, or department chairs.</p><p>One of his assignments at CSU was to reexamine the school’s computer science curriculum. Among other improvements, the faculty now teaches courses in machine learning earlier. Virtual reality and virtual spaces courses were created, and the math requirements were revamped.</p><h2>Efforts to increase the number of women in computing</h2><p>Partridge says during the mid-1980s he became aware of some of the challenges that women face in computing careers. “At BBN, at one point, my project leader, my boss, and my boss’s vice president were all women,” he recalls. “A number of women in computing at the time commented to me how rare that was. It opened my eyes.</p><p>“So in 2017 when I was looking to shift from industry to academia, I made it clear in my interviews at various universities that one of my goals was to look for ways to leverage what I had seen and learned, to help bring more women into computing.”</p><p>“Our focus at Colorado State is on the students already on campus. We encourage them to apply to computer science. We are also improving our curriculum by following the <a href=\"https://anitab.org/braid\" rel=\"noopener noreferrer\" target=\"_blank\">BRAID</a> (Building, Recruiting, and Inclusion for Diversity) principles.”</p><p>He says this effort has included figuring out how to make the introductory courses speak to a wider variety of students by covering the same material but using different examples and different presentations that relate to how they could use computing to solve problems that interest them. </p><p>“We are trying to get them to understand that just because you can create something new doesn’t mean that society wants it,” he says. “You must create it in a way that is more likely to benefit society.”</p><p>In the four years since introducing these changes, Partridge says about half the students taking the introductory courses are women, and the number of women majoring in computing has nearly doubled, from 12 percent to more than 20 percent.</p><h2>Conducting research in an academic setting</h2><p>Partridge also has continued to conduct research, which he finds very different from how he did research at BBN.</p><p>“You are trying to do research while trying to teach the students,” he says. “You could often do the research faster yourself, but then the student wouldn’t learn. By comparison, in industry I knew I had a team I could give a broad description to and get the right thing the first time. With students, by the time they get good at it, they are graduating.”</p><p> In 2011, in response to a decade-old request from <em>IEEE Spectrum</em> columnist and IEEE Fellow <a href=\"https://spectrum.ieee.org/bob-lucky-obituary\" target=\"_self\">Robert Lucky </a>for a list of open research questions in networking, Partridge published “Forty Data Communications Research Questions” in <a href=\"https://www.acm.org/\" target=\"_blank\">ACM</a>’s <em><a href=\"https://www.sigcomm.org/publications/computer-communication-review\" target=\"_blank\">Computer Communication Review</a></em>.</p><p>Many of these questions remain as concerns. For example, one of his graduate students studied packet errors and discovered that checksums, which are used to detect corruption in the header of IPv4 packets, are bad at detecting certain kinds of errors that are likely to occur over asynchronous transfer mode. </p><p>“We are using that kind of experience again today to find the next generation of packet errors in data centers,” Partridge says.</p><p>He would like today’s engineers to pay more attention to edge computing, smart home infrastructure, vehicle safety systems, and walled-garden social networks, such as Instagram and Twitter. He says walled gardens are “social networks where people don't want to connect to people who don't want to connect with those who think differently.”</p><p>One challenge in preparing students for the world they will be working in, he says, “is getting them to understand that just because you can create something new doesn’t mean that society wants it.”</p><p><em>This article appears in the November 2022 print issue as “Craig Partridge.”</em></p><p><em>This article was updated from a previous version.</em></p>",
  "pubDate": "Fri, 21 Oct 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/craig-partridge-profile",
  "category": [
    "Careers",
    "Computer science",
    "Type:departments",
    "Vpn"
  ],
  "dc:creator": "Daniel P. Dern",
  "media:content": ""
}