{
  "title": "68: Chetan Parkyn & Carola Eastwood- Human Design and the Life You Were Born to Live",
  "pubDate": "Thu, 16 Feb 2017 01:54:28 +0000",
  "guid": "621495f476bd1bfe22204cca3be273ef",
  "link": "https://lifeonpurpose.libsyn.com/68-chetan-parkyn-carola-eastwood-human-design-and-the-life-you-were-born-to-live",
  "itunes:image": "",
  "description": "<p><em>Have you ever asked yourself what is your life purpose? Have you considered what you are doing here and whether you are on the right track to being fulfilled?</em><br /> <br /> For <strong>Life on Purpose Episode #68</strong>, my guests are world-renowned Human Design experts <strong>Chetan Parkyn</strong> & <strong>Carola Eastwood</strong>. They joined me for a fascinating and timely conversation about a tool that can help answer those questions: Human Design and their brand new book <strong><em>The Book of Destinies: Discover the Life You Were Born to Live</em></strong> <em>(New World Library)</em>. The book offers readers the opportunity to use the place, date, and time of their births to reveal their Life Theme, which offers a portrait of their true nature and allows them the peace of knowing who they really are.<br /> <br /> <em>“Just like the storyline of a book, or the theme music to a movie, there is a unique, consistent, and recognizable undercurrent to your whole lifetime. It is your Life Theme, which is your melody, your part in the symphony of life, and only you can play it,” say Chetan and Carola. “Knowing and accepting your particular Life Theme is truly transformative. Embodying this awareness gives you reassurance and clarification about your life purpose.”</em><br /> <br /> About <strong>Chetan Parkyn</strong>: Chetan Parkyn has been giving Readings to people of all walks of life and all nationalities for over 35 years. He has spent the past 23 years mastering Human Design. He is more than a leading practitioner of the system. As the author of the first major book on the subject, which has been translated into eleven different language versions, he has made it his mission to bring Human Design to the whole world.<br /> <br /> An entrepreneur’s son by upbringing and an engineer by training, Chetan has fully explored both the mystical and the technological worlds. He’s been a deep-sea dive engineer and a devoted student of meditation. Travels in India and time spent in the company of the enlightened mystic, Osho, finally opened Chetan to his own purpose — helping people develop self-knowledge.<br /> <br /> The details of how Chetan discovered his abilities came about through a reading he experienced from a Chayyashastri (Shadow Reader) in Bombay, now Mumbai, in 1979.  Finding himself no longer satisfied with everything he had understood about himself especially in the field of engineering, Chetan was guided to have a session to find some personal clarification.  Chetan was given a transfixing view of himself in all aspects of his life.  He was told things about himself that he had long forgotten, barely imagined, or never considered important.  At the end of the session, the Shadow Reader asked Chetan to come and work with him : \".......because you know how to do this kind of work.\"<br /> <br /> Completely startled by the depth of the information he had just received, Chetan declined the invitation.  The Shadow Reader laughed in response and told Chetan that it did not really matter .... \"because you are going to do this work anyway,\" he said. \"There is a system that is going to come into your life, and you are going to write books about it, and introduce it to many thousands of people all over the world, and you are going to transform their lives.....and my advice to you is to find a way of reading for people that you like and practice it so you are ready.\"<br /> <br /> A week later, Chetan met a Psychic Palm Reader who for 10 minutes showed Chetan about many of the lines and markings in a hand.  At the end of the 10 minutes, the Psychic Palmist closed up Chetan’s hands and said : \"That's enough!  Now go practice!\"  And for the next 14 years, Chetan gave Readings for everyone who held their hands out to him. He also studied numerous systems of divination and ways of revealing people to themselves.....all the time wondering what this \"system\" the Shadow Reader had been talking about could be.<br /> <br /> In 1993, Chetan met a man called Ra Uru Hu, who had been given Human Design and who first introduced it to the world. Chetan worked with Ra over the next 7 years, beginning his journey towards fully mastering the system. Chetan’s unique gifts include a balance of technical skill and pure intuition. In addition, Chetan is a compelling speaker — fun, inspiring, down-to-earth and personal. Simply through hearing him, many experience the beginnings of deep inner change.<br /> <br /> As Chetan studied Human Design over many years, gave thousands of personal and partnership Readings, he began to realize how few people had access to its extraordinary riches. In 2000, he felt called to make the system accessible to a far wider audience. Chetan began offering Trainings and Seminars along with his life-partner Carola Eastwood. The couple also started training Practitioners in the art of giving wholesome Human Design Readings. But this was not enough.<br /> <br /> In 2009 Chetan wrote the first major book on Human Design, published by Harper Collins UK, and in 2010 by New World Library in the US, and subsequently in many other languages. Combined with powerful free software, the book makes it easy for everyone to create and interpret his or her own Life Chart. Recently, he and his wife, Carola created the first On-Line Human Design Comprehensive Report. Thanks to Chetan Parkyn, Human Design today is becoming available to the whole planet. And as more and more individuals live in alignment with their unique design, the quality of life on Earth will change!<br /> <br /> About <strong>Carola Eastwood</strong>: Carola Eastwood has been a Human Design consultant, teacher and coach since 1999.<br /> <br /> Prior to that she had an established counseling practice and an Astrology clientele in Santa Fe, NM and in San Diego, CA. She has been author of the monthly column, “Planetary Cycles” published by the Life Connection since 1988, and is a highly acclaimed astrological consultant and intuitive counselor. Carola has appeared on national TV, hosted radio shows, and spoken at national conventions.<br /> <br /> As a young woman, Carola discovered her passion to help others awaken to a richer view of themselves and their world, by finding their inner essence, that core of being within each person that is the Spirit expressing in form.<br /> <br /> She undertook years of post graduate training in a variety of human development disciplines, including psychology, psychosynthesis, past life healing therapy, intuitive reading arts, and the science of spirituality. When she discovered Human Design, she realized that this was the missing piece of the puzzle in helping others to change their consciousness and create their own destiny.<br /> <br /> Today, she co-presents Human Design seminars and trainings alongside her husband and partner, Chetan Parkyn. Carola created the experiential seminars as a tool that quickly puts one in touch with one’s own Human Design, and with the Designs of others. She also assists Chetan in presenting Human Design Consultant Trainings.<br /> <br /> Her passion is to assist others to awaken to their own power to create the life they have always dreamed of.<br /> <br /> To learn more about <strong>Chetan</strong> and <strong>Carola's</strong> work, visit: <a href= \"http://humandesignforusall.com/\" target= \"_blank\">http://humandesignforusall.com/</a>.</p>",
  "content:encoded": "<p><em>Have you ever asked yourself what is your life purpose? Have you considered what you are doing here and whether you are on the right track to being fulfilled?</em>  For Life on Purpose Episode #68, my guests are world-renowned Human Design experts Chetan Parkyn & Carola Eastwood. They joined me for a fascinating and timely conversation about a tool that can help answer those questions: Human Design and their brand new book <em>The Book of Destinies: Discover the Life You Were Born to Live</em> <em>(New World Library)</em>. The book offers readers the opportunity to use the place, date, and time of their births to reveal their Life Theme, which offers a portrait of their true nature and allows them the peace of knowing who they really are.  <em>“Just like the storyline of a book, or the theme music to a movie, there is a unique, consistent, and recognizable undercurrent to your whole lifetime. It is your Life Theme, which is your melody, your part in the symphony of life, and only you can play it,” say Chetan and Carola. “Knowing and accepting your particular Life Theme is truly transformative. Embodying this awareness gives you reassurance and clarification about your life purpose.”</em>  About Chetan Parkyn: Chetan Parkyn has been giving Readings to people of all walks of life and all nationalities for over 35 years. He has spent the past 23 years mastering Human Design. He is more than a leading practitioner of the system. As the author of the first major book on the subject, which has been translated into eleven different language versions, he has made it his mission to bring Human Design to the whole world.  An entrepreneur’s son by upbringing and an engineer by training, Chetan has fully explored both the mystical and the technological worlds. He’s been a deep-sea dive engineer and a devoted student of meditation. Travels in India and time spent in the company of the enlightened mystic, Osho, finally opened Chetan to his own purpose — helping people develop self-knowledge.  The details of how Chetan discovered his abilities came about through a reading he experienced from a Chayyashastri (Shadow Reader) in Bombay, now Mumbai, in 1979.  Finding himself no longer satisfied with everything he had understood about himself especially in the field of engineering, Chetan was guided to have a session to find some personal clarification.  Chetan was given a transfixing view of himself in all aspects of his life.  He was told things about himself that he had long forgotten, barely imagined, or never considered important.  At the end of the session, the Shadow Reader asked Chetan to come and work with him : \".......because you know how to do this kind of work.\"  Completely startled by the depth of the information he had just received, Chetan declined the invitation.  The Shadow Reader laughed in response and told Chetan that it did not really matter .... \"because you are going to do this work anyway,\" he said. \"There is a system that is going to come into your life, and you are going to write books about it, and introduce it to many thousands of people all over the world, and you are going to transform their lives.....and my advice to you is to find a way of reading for people that you like and practice it so you are ready.\"  A week later, Chetan met a Psychic Palm Reader who for 10 minutes showed Chetan about many of the lines and markings in a hand.  At the end of the 10 minutes, the Psychic Palmist closed up Chetan’s hands and said : \"That's enough!  Now go practice!\"  And for the next 14 years, Chetan gave Readings for everyone who held their hands out to him. He also studied numerous systems of divination and ways of revealing people to themselves.....all the time wondering what this \"system\" the Shadow Reader had been talking about could be.  In 1993, Chetan met a man called Ra Uru Hu, who had been given Human Design and who first introduced it to the world. Chetan worked with Ra over the next 7 years, beginning his journey towards fully mastering the system. Chetan’s unique gifts include a balance of technical skill and pure intuition. In addition, Chetan is a compelling speaker — fun, inspiring, down-to-earth and personal. Simply through hearing him, many experience the beginnings of deep inner change.  As Chetan studied Human Design over many years, gave thousands of personal and partnership Readings, he began to realize how few people had access to its extraordinary riches. In 2000, he felt called to make the system accessible to a far wider audience. Chetan began offering Trainings and Seminars along with his life-partner Carola Eastwood. The couple also started training Practitioners in the art of giving wholesome Human Design Readings. But this was not enough.  In 2009 Chetan wrote the first major book on Human Design, published by Harper Collins UK, and in 2010 by New World Library in the US, and subsequently in many other languages. Combined with powerful free software, the book makes it easy for everyone to create and interpret his or her own Life Chart. Recently, he and his wife, Carola created the first On-Line Human Design Comprehensive Report. Thanks to Chetan Parkyn, Human Design today is becoming available to the whole planet. And as more and more individuals live in alignment with their unique design, the quality of life on Earth will change!  About Carola Eastwood: Carola Eastwood has been a Human Design consultant, teacher and coach since 1999.  Prior to that she had an established counseling practice and an Astrology clientele in Santa Fe, NM and in San Diego, CA. She has been author of the monthly column, “Planetary Cycles” published by the Life Connection since 1988, and is a highly acclaimed astrological consultant and intuitive counselor. Carola has appeared on national TV, hosted radio shows, and spoken at national conventions.  As a young woman, Carola discovered her passion to help others awaken to a richer view of themselves and their world, by finding their inner essence, that core of being within each person that is the Spirit expressing in form.  She undertook years of post graduate training in a variety of human development disciplines, including psychology, psychosynthesis, past life healing therapy, intuitive reading arts, and the science of spirituality. When she discovered Human Design, she realized that this was the missing piece of the puzzle in helping others to change their consciousness and create their own destiny.  Today, she co-presents Human Design seminars and trainings alongside her husband and partner, Chetan Parkyn. Carola created the experiential seminars as a tool that quickly puts one in touch with one’s own Human Design, and with the Designs of others. She also assists Chetan in presenting Human Design Consultant Trainings.  Her passion is to assist others to awaken to their own power to create the life they have always dreamed of.  To learn more about Chetan and Carola's work, visit: <a href= \"http://humandesignforusall.com/\" target= \"_blank\">http://humandesignforusall.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "57:33",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Have you ever asked yourself what is your life purpose? Have you considered what you are doing here and whether you are on the right track to being fulfilled?  For Life on Purpose Episode #68, my guests are world-renowned Human Design experts Chetan..."
}