{
  "title": "Former ICE Chief Taps Anti-Muslim Hate Group To Help Run Border-Focused Project",
  "link": "https://www.splcenter.org/hatewatch/2022/11/03/former-ice-chief-taps-anti-muslim-hate-group-help-run-border-focused-project",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Hatewatch</div>\n      </div>\n</div>\n<div class=\"field field-name-field-long-text field-type-text-long field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>Tom Homan, a former acting director of U.S. Immigration and Customs Enforcement (ICE) and prominent conservative media figure, is collaborating with an anti-Muslim hate group on a new project aimed at fearmongering about the U.S. Southern border. The project held a fundraising event at former President Donald Trump’s Mar-a-Lago resort in Florida on Nov. 1.</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Former ICE Chief Taps Anti-Muslim Hate Group To Help Run Border-Focused Project</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div data-embed-button=\"media\" data-entity-id=\"35315\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"a4f036d6-3474-46f0-88e0-136cbad0a799\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35315\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/tomhomanap-700pxjpg\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/tom_homan_ap-700px.jpg\" width=\"700\" height=\"467\" alt=\"Tom Homan\" title=\"Tom Homan\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">Former acting Immigration and Customs Enforcement Director Tom Homan speaks following a border tour with former Vice President Mike Pence, Monday, June 13, 2022, in Phoenix, Arizona. (Photo via AP Images/Matt York)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>The project, Defend the Border and Save Lives, is a media and promotional endeavor tied to Homan’s personal brand and a book of his with the same title. A Hatewatch review of the project’s website revealed it is closely tied to The United West, an SPLC-designated anti-Muslim hate group. This includes sharing an address and staff with the anti-Muslim group.</p>\n<p>Homan formerly served as acting director of ICE under Trump. He has leveraged those credentials to become an oft-booked media commentator on issues related to immigration and the border. He is known for his hard-liner stances on these issues, such as backing the border wall and showing unwavering support for the Department of Homeland Security’s deportation arm.</p>\n<p>Along with his book <em>Defend the Border and Save Lives</em>, Homan launched “a two-year educational program on the crisis at our southern border” and has tapped The United West for help. One of the main figures working with Homan on the project is Tom Trento, founder and director of The United West, a group that has been stoking anti-Muslim hate for over a decade.</p>\n<p>“We have entered into an agreement with Tom Homan to tell his story,” Trento says in a promotional video. Defend the Border and Save Lives did not return request for comment from Hatewatch.</p>\n<p>Trento and his group have claimed the U.S. and West are at war with Muslims and Islam.</p>\n<p>“There is no doubt that, for those with eyes to see, we are at war with devout Muslims who follow the jihad teachings of doctrinal Islam,” Trento wrote in a 2016 email to supporters. “Therefore, it is essential that all Americans adopt a ‘war-footing’ mentality and are constantly prepared for any threat, any situation, any problem.”</p>\n<p>In a 2015 email around the anniversary of 9/11, Trento wrote, “I knew all my years of academic work in Islam and related areas of law enforcement and activism would be required in what will be an extended, vicious, deadly, horrible war in a clash of two incompatible civilizations, the Judeo-Christian West and Islam.”</p>\n<p>In 2013, Trento’s web show spread an Islamophobic conspiracy theory claiming that John Brennan, former President Obama’s then-nominee to run the CIA, was a secret Muslim.</p>\n<p>The Muslim civil rights group Council on American-Islamic Relations (CAIR) has been tracking The United West’s Islamophobia over the years.</p>\n<p>“Homan’s choice to partner with documented anti-Muslim bigots reflects the poor decision-making he exemplified at U.S. Immigration and Customs Enforcement,” Corey Saylor, CAIR’s director of research and advocacy, told Hatewatch via email. “Partnership with United West, Tom Trento and Clare Lopez ensures wasted time, wasted money, and conclusions fit only for the next conspiracy theorists’ rally.”</p>\n<p>Defend the Border and Save Lives appears to be closely tied with The United West. On the group’s donation page, checks can be mailed to the same post office box in Lake Worth, Florida, that is associated with The United West. A link to the Defend the Border and Save Lives website is also on The United West’s website. The group is also hosting fundraising events for the project.</p>\n<p>The Defend the Border and Save Lives page is riddled with nativist content. The group’s donation page reads: “AMERICA INVADED. Help Us Stop This Threat!” Lawmakers and immigration advocates have <a href=\"https://www.dallasobserver.com/news/abbotts-order-to-arrest-migrants-at-the-border-and-invasion-rhetoric-could-lead-to-violence-some-say-14404675\"> criticized</a> bombastic claims of an invasion happening at the Southern border as dangerous rhetoric. The accused mass shooter responsible for killing over 20 people at a Wal-Mart in El Paso, Texas, in 2019 allegedly <a href=\"https://www.elpasotimes.com/story/news/2022/08/04/el-paso-walmart-shooting-patrick-crusius-gop-rhetoric-invasion/7585100001/\"> said</a> in a manifesto left behind that the “attack is a response to the Hispanic invasion of Texas.”</p>\n<p>Zachary Mueller, political director at the immigration advocacy organization America’s Voice, expressed his concerns about the project collaborating with Trento and pushing such ideas.</p>\n<p>\"It is unsurprising but still deeply concerning that the ‘intellectual father’ of family separation (Tom Homan) is working with the anti-immigrant zealot Trento to fundraise for their venture by peddling the absurd conspiracy theory that asylum seekers and migrants constitute an ‘invasion,’” Mueller told Hatewatch in an email. He added the idea is “inexorably linked to ‘replacement theory’ and has direct connections to multiple mass murders in Pittsburgh, El Paso, Buffalo and elsewhere.”</p>\n<p>The website features other right-wing, alarmist and inflammatory talking points about the border, like the Biden administration supposedly refusing to secure it and hyping the criminality of immigrants. An excerpt on the site reads: “For decades, the globalist media jihad has successfully blinded Americans to the truth. For the first time in US history, an incoming administration has intentionally weakened the security of the nation within hours of assuming power. … The reality of America’s open border is that it is killing Americans.”</p>\n<p>Other staffers associated with Defend the Border and Save Lives includes figures known for peddling Islamophobia. The director of research for the project is Clare Lopez, a former CIA analyst turned anti-Muslim conspiracy theorist. Lopez has said that in addition to houses of worship, mosques are “centers for indoctrination, the dispensing of Sharia justice, the stockpiling of weapons, and the launching of jihad.” She also said in 2013: “When people in other bona fide religions follow their doctrines they become better people – Buddhists, Hindus, Christians, Jews. When Muslims follow their doctrine, they become jihadists.”</p>\n<p>The project’s director of operations is Mary Wierbicki, who also serves as social media director for The United West and is co-founder of Sharia Crime Stoppers, another project tied to Trento’s group that produces anti-Islam content.</p>\n<p>During a 2018 webinar produced by Sharia Crime Stoppers, Wierbicki lamented there being around 3,200 mosques across America. “When on 9/11, there were only about 1,000,” she said on the show. “Which means there are an increased number of imams preaching the hate and death of Sharia that this culture promotes. These imams are not trained to preach assimilation or peace with non-Muslims.”</p>\n<p>The United West organized a private fundraising event on Nov. 1 at Trump’s Mar-a-Lago. The event’s advertisement says it premiered a television program associated with Defend the Border and Save Lives. Tickets for that event, which was said to be sold out, ranged from $1,000 to $25,000. The United West held another private fundraising event for Homan in April, according to an email from the group. Pictures of an event sponsored by The United West were at the bottom of the November event’s ticket page.</p>\n<p>The Trump Organization did not respond for comment about the event.</p>\n<p>This is not the first time Homan has aligned himself with hate groups. In 2019, Homan was a <a href=\"https://theintercept.com/2018/09/01/act-for-america-conference-thomas-homan/\"> keynote speaker</a> at an event in Washington, D.C., put on by the anti-Muslim hate group ACT for America. In late October, Homan appeared at Hold Their Feet to Fire, an annual radio and networking event in D.C. organized by the anti-immigrant hate group Federation for American Immigration Reform (FAIR). A link to FAIR’s event was <a href=\"https://archive.ph/tsQ89\">posted</a> on Defend the Border and Save Lives’ website. Homan also <a href=\"https://www.youtube.com/watch?v=HJkQMam_JTk\">appeared</a> in a 2021 fundraising video for FAIR’s legal arm, Immigration Reform Law Institute.</p>\n<p><em>Photo illustration by SPLC</em></p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-byline field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Caleb Kieffer</div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Former ICE Chief Taps Anti-Muslim Hate Group To Help Run Border-Focused Project - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/hatewatch/2022/11/03/former-ice-chief-taps-anti-muslim-hate-group-help-run-border-focused-project\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">November 03, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Thu, 03 Nov 2022 16:30:51 +0000",
  "dc:creator": "chris.heller_1541",
  "guid": "17210 at https://www.splcenter.org"
}