{
  "title": "This Chip Could Replace a Thousand Lasers",
  "link": "https://spectrum.ieee.org/frequency-comb",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-a-square-shape-with-a-yellow-ring-on-top-and-red-lines-in-a-pattern-rising-from-the-circle-in-small-then-large.jpg?id=32036445&width=1200&height=800&coordinates=0%2C35%2C0%2C36\"/><br/><br/><p>A record-breaking optical chip can transmit 1.8 petabits—1.8 million gigabits—per second, roughly twice as much traffic as transmitted per second over the entire world's Internet, a new study finds.</p><p>Previous research transmitted up to <a href=\"https://ieeexplore.ieee.org/document/9083661\" rel=\"noopener noreferrer\" target=\"_blank\">10.66 petabits per second</a> over <a href=\"https://spectrum.ieee.org/chip-scale-photonic-amplifier\" target=\"_self\">fiber optics</a>. However, these experiments relied on bulky electronics. A compact microchip-based strategy could enable mass production and result in smaller footprints, lower costs, and lower energy consumption. Until now, the fastest single optical microchip supported data rates of 661 terabits—661,000 gigabits—per second.</p><p>The new chip uses the light from a single infrared laser to create a rainbow spectrum of many colors. All the resulting frequencies of light are a fixed specific frequency distance from one another, a bit like the teeth of the comb, which is why the device is called a <a href=\"https://spectrum.ieee.org/micro-comb\" target=\"_self\">frequency comb</a>. Each frequency can be isolated and have such properties as its amplitude modulated to carry data. The frequencies can then be collected together and transmitted simultaneously over fiber optics.</p><p>“Several groups worldwide have shown that frequency combs can be used for data transmission instead of using individual lasers,” says study senior author Leif Katsuo Oxenløwe, an optical communications researcher at the Technical University of Denmark.</p><p>The new microchip emits light roughly 1,530 to 1,610 nanometers in wavelength. These fall into the C and L bands of telecommunications frequencies, two of <a href=\"https://www.fiberlabs.com/glossary/optical-communication-band/\" rel=\"noopener noreferrer\" target=\"_blank\">five wavelength bands</a> where optical fibers experience minimal signal loss.</p><p>In experiments, the scientists achieved 1.84 petabits per second over a 7.9-kilometer-long optical fiber using 223 wavelength channels. “This is the first time it is investigated just how much data a single frequency comb can carry,” Oxenløwe says.</p><p>Using conventional equipment, this data rate would require about 1,000 lasers, the researchers say. The new microchip could therefore help significantly reduce Internet power consumption. “You could save a thousand lasers out of your energy budget,” Oxenløwe says.</p><p>In addition, a computational model the scientists developed to examine the potential of frequency combs suggests that a single chip could achieve a data rate of up to 100 petabits per second if given a cable with thousands of fibers. “You can already today buy cables with thousands of fibers in them to transport large quantities of data around in data centers, so scaling to such numbers is actually realistic,” Oxenløwe says.</p><p>The researchers say they accomplish this staggering data rate by dividing one frequency comb into many copies and optically amplifying their signals. “The power and potential of frequency combs is thus far greater than I think most comb enthusiasts even dared to dream of,” Oxenløwe says.</p><p>Future research can integrate components such as the laser, data modulators, and amplifiers onto the optical chip, Oxenløwe says.</p><p>The scientists detailed <u><a href=\"https://www.nature.com/articles/s41566-022-01082-z\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> 20 October in the journal <em>Nature Photonics</em>.</p>",
  "pubDate": "Thu, 03 Nov 2022 18:09:13 +0000",
  "guid": "https://spectrum.ieee.org/frequency-comb",
  "category": [
    "Optoelectronics",
    "Internet",
    "Lasers",
    "Frequency comb"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}