{
  "title": "S1E19 - You Need to Always Be in a Season of Learning with Swimmer Michael Andrew",
  "guid": "https://pinecast.com/guid/b80682e0-a903-4f0a-ae51-7987f1468e9a",
  "pubDate": "Tue, 13 Oct 2020 06:30:00 -0000",
  "itunes:duration": "00:58:46",
  "description": "<p>Laura’s guest on the podcast this week is World Championship gold medalist swimmer, Michael Andrew. Turning pro at 14, Michael broke numerous National Age Group Records in his teens, and over the course of his career, he has broken Junior World Records. Along the way, however, he and his parents have also received a lot of backlash for the choices that they made throughout this stellar career. In today’s episode, Michael talks about all of this and so much more in a conversation that is both enlightening and inspiring.</p>\n<p>Michael begins by sharing what he is doing in Turkey these days, and about his exciting involvement with the New York Breakers and the International Swimming League. He then goes on to describe his unique career in swimming, the role his parents continue to play in it, the ‘haters’ they had to deal with, and his family’s willingness to share all that they have learned with anyone wishing to learn. Michael also shares his nutrition regimen, how he balances new training techniques with establishing routines, his vlogs and love of technology, and an exciting new venture that he and his dad are working on. Woven throughout is Michael’s deep commitment to his faith and the prominent role it plays in his life and career. As you will discover, Michael Andrew is most certainly a superstar in the world of competitive swimming, but he is so very much more than that, and he shares it all with you here today.</p>\n<p>Episode Highlights:</p>\n<p>·       What Michael is doing in Turkey these days\n·       The New York Breakers and the International Swimming League (ISL)\n·       ISL’s agreement with CBS Sports\n·       Michael’s unique career in swimming\n·       His parents’ involvement and influence in his career\n·       Other people’s attitudes towards his career\n·       Their willingness to share their methods with others\n·       How God has blessed his journey\n·       Dealing with ‘haters’\n·       What he has done since COVID started\n·       2019 as a season of learning about intentionality\n·       Michael’s nutrition regimen\n·       Balancing trying new training techniques with establishing routines\n·       His mindset preparing for Tokyo\n·       Michael’s faith and how it plays out in his daily life\n·       Laura’s experience with depending on God\n·       Michael’s vlogs and his love of technology\n·       The project he and his dad have been working on</p>\n<p>Quotes:</p>\n<p>“It’s kind of like we’re in our own little bubble anyway.”</p>\n<p>“My entire swim career, we’ve always been very family oriented.”</p>\n<p>“I am a Team Captain, owner, and athlete of New York Breakers.”</p>\n<p>“This league really just gives athletes an opportunity beyond the Olympics.”</p>\n<p>“It takes all of the…exciting events, condenses it into two hours of extreme action – the fastest athletes in the world going head-to-head, scoring points, and money’s on the line.”</p>\n<p>“Why would we do that if we don’t believe in the way they train, we don’t believe in all the negative things that come from those experiences? Like, why not just do it differently?”</p>\n<p>“It was really interesting to see over the years how people’s perception of us had changed because we were consistent in who we were and what we stood for.”</p>\n<p>“We have more supporters than we ever had haters, really, and it’s just cool to see how…faithful God has been through that, in us kind of sticking to who we are and not backing away from it.”</p>\n<p>“It feels like my career’s just beginning at 21.”</p>\n<p>“I’ve been super blessed with a family that has supported me from the beginning.”</p>\n<p>“They’re judging from a very warped picture.”</p>\n<p>“We don’t live to earn man’s approval, really. We’re here doing what we do to the greatest of our ability, but also to glorify God and what he has given us.”</p>\n<p>“I never want to be the athlete that kind of feels that I have to restrict myself from a lot of the fun things in order to perform.”</p>\n<p>“I think it’s so important for athletes to have clear goals and things that they’re working towards.”</p>\n<p>“Your body can use oxygen more efficiently when you are keto-adapted.”</p>\n<p>“How do we rewire the brain and change these habits?”</p>\n<p>“At the end of the day, it’s just swimming…I know God loves me for who I am.”</p>\n<p>“I just need to show up and race and let God handle the details.”</p>\n<p>“I don’t live a performance-based identity, but I live a purpose-based identity.”</p>\n<p>“The closest you get to God is usually in the hardest times.”</p>\n<p>“We’re creating a subscription platform where we can just give people everything.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> \nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn</a> \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a> \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Michael:</p>\n<p>YouTube:   <a href=\"https://www.youtube.com/michaelandrew4\" rel=\"nofollow\">https://www.youtube.com/michaelandrew4</a></p>\n<p>Instagram:   <a href=\"https://www.instagram.com/swimmermichael/\" rel=\"nofollow\">https://www.instagram.com/swimmermichael/</a></p>\n<p>International Swimming League:   https://isl.global/</p>",
  "itunes:title": "You Need to Always Be in a Season of Learning with Swimmer Michael Andrew",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 19
}