{
  "title": "Leaving CMU",
  "description": "<p>Dear Friends,</p><p>As some of you may have already heard, I&rsquo;m leaving CMU to join Amazon, effective July 1, 2016. There I will be in charge of Amazon&rsquo;s Cloud Machine Learning Platform with the task to make machine learning as easy to use and widespread as it could possibly be. This is a terrific task and it was an offer that I could not turn down. Our lab will be in the Bay Area and we will strive to turn the state of the art in machine learning research into the state of the art in industry. Both in terms of scale and in terms of model sophistication. This is a very exciting time and I&rsquo;m looking forward to it. If all goes well, this will raise the bar also in academia.</p><p>I wanted to say thanks to everyone who&rsquo;s helped us along on this journey. First off, an absolutely outstanding cast of PhD students I&rsquo;ve had the pleasure of working with. Mu, Manzil, Zichao, Fish, Yu-Xiang, Seth, Alex, Ziqi, Wei, Yining, Chao-Yuan, Sashank, you guys rock! And yes, most of you are smarter than me, and this has been utterly delightful. Second, I wanted to thank to thank the terrific CMU faculty. I learned a lot and the past 4 years have been a wonderful experience. Many thanks, in particular to Dave, Andy, Andrew, Tom, Geoff, Nina, Christos, Ryan, Barnabas, Larry, Jaime and Kayvon. Many thanks for your advice, help, insight, and collaboration. What we achieved in the past 4 years would not have been possible without a great team. And thanks to Mallory and Diane to keep the ship running no matter what, and thanks to Russ for keeping the accounting in good shape and for putting up with last minute updates. <br/>Apologies if I forgot someone on this list (I probably have). It has been wonderful to work with you and I dearly love CMU. So why the change?<br/>Here&rsquo;s the reasoning that went into deciding to go to Amazon: Our goal as machine learning researchers is to solve deep problems (not just in deep learning) and to ensure that this leads to algorithms that are actually used. At scale. At sophistication. In applications. The number of people I could possibly influence personally through papers and teaching might be 10,000. In Amazon we have 1 million developers using AWS. Likewise, the NSF thinks that a project of 3 engineers is a big grant (and it is very choosy in awarding these grants). At Amazon we will be investing an order of magnitude more resources towards this problem. With data and computers to match this. This is significant leverage. Hence the change. </p><p>We will try to give back to the academic community, to contribute back, e.g. through open source. And the goal is to engage it more deeply. I cannot give more specifics yet but good things will happen. Stay tuned. </p><p>Technically I will be on leave of absence until August 2017. This is mostly to ensure that the students are taken care of and that grants are in good shape. I&rsquo;ll be reaching out to many of you directly (the reason why I haven&rsquo;t done this to all of you yet is that I&rsquo;m in the middle of moving). </p><p>Let&rsquo;s stay in touch. And, obviously, if you&rsquo;re interested in joining me on this journey (or have students who would like to come along), please let me know. <br/></p><p>Best, Alex</p><p>PS: I’m posting this letter (which was intended for my team at CMU and my colleagues there) after screenshots of parts of it seem to have gone live on Weibo. </p>",
  "link": "https://blog.smola.org/post/145983963411",
  "guid": "https://blog.smola.org/post/145983963411",
  "pubDate": "Wed, 15 Jun 2016 16:41:45 -0700"
}