{
  "title": "In re: Seattle's New Theory of Crime",
  "description": "<h1 id=\"november-14-weekend-edition\">November 14 Weekend Edition</h1>\n\n<p>Recently I became a subscriber of the online edition of the WSJ. They were offering a sweet deal and I like to follow their business news. I tacked on a weekend delivery too.</p>\n\n<p>On the last page of the first section of November 14th’s paper, I came across an article that made my blood boil. I immediately responded via submission of a letter to the editor. Having not heard back, I will assume that my response will remain unpublished. Therefore, I am publishing my response here on my blog now.</p>\n\n<p>The thesis of their editorial is simple: Law and Order should rule the day and Seattle’s proposed legislation to make poverty a suitable defense for certain misdemeanors is descent into anarchy and proof of Seattle being an “anarchist jurisdiction” (so-called by former Atty. Gen. Bill Barr following unrest in 2020 and Seattle’s well-known Capital Hill Autonomous Zone). It was an article meant to fire up conservatives. It had the effect (in my mind) of firing up #45’s base, generating racism, exacerbating white Seattle’s deep fears of poverty and people of color, and moralizing against the poor. It should be a mirror we’re holding up to ourselves, questioning why there is poverty amidst plenty. The proposed legislation is a step towards the decriminalization of poverty – a noble goal.</p>\n\n<h1 id=\"quick-primer-of-the-wall-street-journal-editorial-board\">Quick primer of the Wall Street Journal editorial board</h1>\n\n<p><a href=\"https://www.wsj.com/articles/seattles-new-theory-of-crime-11605309361?st=njn5ejeyzgc1rtp&amp;reflink=desktopwebshare_permalink\">Seattle’s New Theory of Crime</a> is an article whose byline is <a href=\"https://www.wsj.com/news/author/editorial-board\">The Editorial Board</a> (and whose twitter handle is <a href=\"https://twitter.com/WSJopinion\">@WSJopinion</a>). Their biography linked to above reads like a mini manifesto courtesy of John Galt. But the board’s biography doesn’t even begin to touch on racism, crime, or poverty, which, this being the editorial board of the Wall Street Journal, has strong opinions indeed.</p>\n\n<h1 id=\"my-unpublished-response--unedited\">My unpublished response – unedited</h1>\n\n<p>Regarding “Seattle’s New Theory of Crime” (Review, Nov. 14): the characterization by the author of the realities of life in Seattle are baseless and polemical. The author, who parrots the Atty. Gen. Barr’s abhorrently political distinction of Seattle as an “anarchist jurisdiction”, paints a mythical canvas of Seattle that, while dramatic, is farther from fact than Renaissance painters depicting scenes from the Trojan Wars. Not only is it offensive to call on business owners to “keep their plywood up” when many small businesses have been struggling due to COVID-19 – thanks to Sen. Mitch McConnell’s obstructionism in the Senate to pass additional relief to business owners and wage-earners – but it is a thinly-veiled dog whistle to right wing groups and corporate America that reifies racist views of inner-cities as full of crime and lacking in so-called “Law and Order”.</p>\n\n<p>The riots in Seattle have been Police riots, where police waged chemical warfare against peaceful protesters for months in the wake of the disgusting murder of George Floyd in May. Neighbors near the East Precinct, including many with pre-existing conditions, elderly, and pregnant mothers, have been breathing pepper spray and tear gas all summer, as it wafted down streets and up into their windows. The violence perpetrated by the Seattle Police Department has led to open federal investigation for years.</p>\n\n<p>The theory behind recent proposed legislature in Seattle is to provide some legal relief to the most disadvantaged people in our city and our society. Their circumstances are in no uncertain terms caused by the machinations of the unbridled worship of raw capitalism that has devastated working people in neighborhoods and cities all across America. The WSJ excitedly reports on record highs in the S&amp;P 500 and in the back pages of the same section, calls those who have had it worst “lawbreakers” and rioters. Isn’t crime profitable for S&amp;P 500 companies? Is that not what we’re celebrating when the index breaks new highs when 20 million Americans have lost their jobs and 240,000 have died because we’ve put “the economy” first?</p>\n\n<p>Seattle is thriving. The city council is trying to make it slightly less illegal to be poor and underserved by public resources. When it’s safe to travel, I invite you to visit and see how well Seattle is doing compared to the rest of America.</p>\n\n<h1 id=\"commentary\">Commentary</h1>\n\n<p>What an emotionally charged response! Now, this would not pass PR muster, undedited, if I were a CEO or elected official. I think that some of the pro-Seattle bias towards the end is natural hometown pride after reading an article whose sole purpose was to denigrate my city, but I didn’t intend to do so at the expense of other cities/parts of America that are struggling quite a lot worse. Especially in places where it’s not the fault of locals but of gerrymandered representation and political gridlock that has led to stagnant progress for decades. Seattle has been incredibly lucky overall. However, that very success has bred a myriad of problems such as discplacement of locals, increased segregation, and unlivably expensive rents and stagnated wages for many. We can do better.</p>",
  "pubDate": "Sat, 26 Dec 2020 00:00:00 +0000",
  "link": "http://korbonits.github.io/2020/12/26/In-re-Seattle-New-Theory-of-Crime.html",
  "guid": "http://korbonits.github.io/2020/12/26/In-re-Seattle-New-Theory-of-Crime.html"
}