{
  "title": "Who Will Fix Hubble and Chandra?",
  "link": "https://spectrum.ieee.org/elon-musk-spacex-hubble",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/the-hubble-space-telescope-with-clouds-in-the-background-seen-during-a-space-shuttle-servicing-mission-in-2002.jpg?id=31972878&width=1200&height=600&coordinates=0%2C235%2C0%2C235\"/><br/><br/><p>\n<a href=\"https://spectrum.ieee.org/spacex-starlink-dish-network\" target=\"_self\">Elon Musk</a>, step aside. You may be the richest rich man in the space business, but you’re not first. Musk’s <a href=\"https://spectrum.ieee.org/search/?q=spacex\" target=\"_self\">SpaceX</a> corporation is a powerful force, with its weekly launches and visions of colonizing Mars. But if you want a broader view of how wealthy entrepreneurs have shaped space exploration, you might want to look at <a href=\"https://en.wikipedia.org/wiki/George_Ellery_Hale\" target=\"_blank\">George Ellery Hale</a>, <a href=\"https://en.wikipedia.org/wiki/James_Lick\" target=\"_blank\">James Lick</a>, <a href=\"https://en.wikipedia.org/wiki/William_Johnson_McDonald\" target=\"_blank\">William McDonald</a> or—remember this name—<a href=\"https://en.wikipedia.org/wiki/John_Daggett_Hooker\" target=\"_blank\">John D. Hooker</a>.\n</p><p>\n\tAll this comes up now because SpaceX, joining forces with the billionaire \n\t<a href=\"https://polarisprogram.com/team/\" rel=\"noopener noreferrer\" target=\"_blank\">Jared Isaacman</a>, has made what sounds at first like a novel <a href=\"https://www.nasa.gov/feature/goddard/2022/nasa-spacex-to-study-hubble-telescope-reboost-possibility\" target=\"_blank\">proposal</a> to NASA: It would like to see if one of the company’s Dragon spacecraft can be sent to service the fabled, invaluable (and aging) <a href=\"https://www.nasa.gov/mission_pages/hubble/main/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">Hubble Space Telescope</a>, last repaired in 2009.\n</p><p>\n\tPrivate companies going to the rescue of one of NASA’s crown jewels? NASA’s mantra in recent years has been to let \n\t<a href=\"https://spectrum.ieee.org/private-space-stations\" target=\"_self\">private enterprise</a> handle the day-to-day of space operations—communications satellites, getting astronauts to the space station, and so forth—while pure science, the stuff that makes history but not necessarily money, remains the province of government. Might that model change?\n</p><p>\n\t“We’re working on crazy ideas all the time,” said \n\t<a href=\"https://science.nasa.gov/about-us/leadership/Thomas-Zurbuchen\" rel=\"noopener noreferrer\" target=\"_blank\">Thomas Zurbuchen</a>, NASA’s space science chief. \"Frankly, that’s what we’re supposed to do.”\n</p><p>\n\tIt’s only a six-month feasibility study for now; no money will change hands between business and NASA. But Isaacman, who made his fortune in \n\t<a href=\"https://www.shift4.com/\" rel=\"noopener noreferrer\" target=\"_blank\">payment-management software</a> before turning to space, suggested that if a Hubble mission happens, it may lead to other things. “Alongside NASA, exploration is one of many objectives for the commercial space industry,” he said on a media teleconference. “And probably one of the greatest exploration assets of all time is the Hubble Space Telescope.”\n</p><p>\n\tSo it’s possible that at some point in the future, there may be a SpaceX Dragon, perhaps with Isaacman as a crew member, setting out to grapple the Hubble, boost it into a higher orbit, maybe even replace some worn-out components to lengthen its life.\n</p><p>\n\tAerospace companies say privately mounted repair sounds like a good idea. So good that they’ve proposed it already.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"The Chandra X-ray telescope, photographed by space shuttle astronauts after they deployed it in July 1999.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"9ae81d7d302196c0c852dc9d2f3f7385\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ecbfc\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-chandra-x-ray-telescope-photographed-by-space-shuttle-astronauts-after-they-deployed-it-in-july-1999.jpg?id=31972890&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">The Chandra X-ray telescope, as photographed by space-shuttle astronauts after they deployed it in July 1999. It is attached to a booster that moved it into an orbit 10,000 by 100,000 kilometers from Earth.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">NASA</small>\n</p><p>\n<a href=\"https://www.northropgrumman.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Northrop Grumman</a>, one of the United States’ largest aerospace contractors, has quietly suggested to NASA that it might service one of the Hubble’s sister telescopes, the <a href=\"https://www.nasa.gov/mission_pages/chandra/main/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">Chandra X-ray Observatory</a>. Chandra was launched into Earth orbit by the space shuttle Columbia in 1999 (Hubble was launched from the shuttle Discovery in 1990), and the two often complement each other, observing the same celestial phenomena at different wavelengths.\n</p><p>\n\tAs in the case of the SpaceX/Hubble proposal, Northrop Grumman’s Chandra study is at an early stage. But there are a few major differences. For one, Chandra was assembled by TRW, a company that has since been bought by Northrop Grumman. And another company subsidiary, \n\t<a href=\"https://www.northropgrumman.com/space/space-logistics-services/\" rel=\"noopener noreferrer\" target=\"_blank\">SpaceLogistics</a>, has been sending what it calls <a href=\"https://www.northropgrumman.com/space/space-logistics-services/\" rel=\"noopener noreferrer\" target=\"_blank\">Mission Extension Vehicles</a> (MEVs) to service aging Intelsat communications satellites since 2020. Two of these robotic craft have launched so far. The MEVs act like space tugs, docking with their target satellites to provide them with attitude control and propulsion if their own systems are failing or running out of fuel. SpaceLogistics says it is developing a next-generation rescue craft, which it calls a Mission Robotic Vehicle, equipped with an articulated arm to add, relocate, or possibly repair components on orbit.\n</p><p>\n\t“We want to see if we can apply this to space-science missions,” says \n\t<a href=\"https://materials.ucsb.edu/events/dr-jonathan-w-arenberg-northrop-grumman\" rel=\"noopener noreferrer\" target=\"_blank\">Jon Arenberg</a>, Northrop Grumman’s chief mission architect for science and robotic exploration, who worked on Chandra and, later, the <a href=\"https://spectrum.ieee.org/collections/james-webb-telescope/\" target=\"_self\">James Webb Space Telescope</a>. He says a major issue for servicing is the exacting specifications needed for NASA’s major observatories; Chandra, for example, records the extremely short wavelengths of X-ray radiation (0.01–10 nanometers).\n</p><p>\n\t“We need to preserve the scientific integrity of the spacecraft,” he says. “That’s an absolute.”\n</p><p>\n\tBut so far, the company says, a mission seems possible. NASA managers have listened receptively. And Northrop Grumman says a servicing mission could be flown for a fraction of the cost of a new telescope.\n</p><div class=\"rm-embed embed-media\"><iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/JUnA88PQY3k\" title=\"YouTube video player\" width=\"560\">\n</iframe></div><p>\n\tNew telescopes need not be government projects. In fact, NASA’s chief economist, \n\t<a href=\"https://www.nasa.gov/about/alex-macdonald-chief-economist-office-of-the-administrator/\" rel=\"noopener noreferrer\" target=\"_blank\">Alexander MacDonald</a>, argues that almost all of America’s greatest observatories were privately funded until Cold War politics made government the major player in space exploration. That’s why this story began with names from the 19th and 20th centuries—Hale, Lick, and McDonald—to which we should add <a href=\"https://en.wikipedia.org/wiki/Charles_Yerkes\" target=\"_blank\">Charles Yerkes</a> and, more recently, <a href=\"https://en.wikipedia.org/wiki/William_Myron_Keck\" target=\"_blank\">William Keck</a>. These were arguably the Elon Musks of their times—entrepreneurs who made millions in oil, iron, or real estate before funding the United States’ largest telescopes. (Hale’s father manufactured elevators—highly profitable in the rebuilding after the Great Chicago Fire of 1871.) The most ambitious observatories, MacDonald calculated for his book <em><a href=\"https://yalebooks.yale.edu/book/9780300219326/the-long-space-age/\" rel=\"noopener noreferrer\" target=\"_blank\">The Long Space Age</a></em>, were about as expensive back then as some of NASA’s modern planetary probes. None of them had very much to do with government.\n</p><p>\n\tTo be sure, government will remain a major player in space for a long time. “NASA pays the cost, predominantly, of the development of new commercial crew vehicles, SpaceX’s Dragon being one,” MacDonald says. “And now that those capabilities exist, private individuals can also pay to utilize those capabilities.” Isaacman doesn’t have to build a spacecraft; he can hire one that SpaceX originally built for NASA.\n</p><p>“I think that creates a much more diverse and potentially interesting space-exploration future than we have been considering for some time,” MacDonald says.</p><p>\n\tSo put these pieces together: Private enterprise has been a driver of space science since the 1800s. Private companies are already conducting on-orbit satellite rescues. NASA hasn’t said no to the idea of private missions to service its orbiting observatories.\n</p><p>\n\tAnd why does John D. Hooker’s name matter? In 1906, he agreed to put up US $45,000 (about $1.4 million today) to make the mirror for a \n\t<a href=\"https://www.mtwilson.edu/building-the-100-inch-telescope/\" rel=\"noopener noreferrer\" target=\"_blank\">100-inch reflecting telescope at Mount Wilson, Calif</a>. One astronomer made the Hooker Telescope famous by using it to determine that the universe, full of galaxies, was expanding.\n</p><p>\n\tThe astronomer’s name was \n\t<a href=\"https://en.wikipedia.org/wiki/Edwin_Hubble\" target=\"_blank\">Edwin Hubble</a>. We’ve come full circle.\n</p>",
  "pubDate": "Thu, 20 Oct 2022 18:06:36 +0000",
  "guid": "https://spectrum.ieee.org/elon-musk-spacex-hubble",
  "category": [
    "Elon musk",
    "Spacex",
    "Nasa",
    "Northrop grumman",
    "Hubble space telescope",
    "Chandra x-ray observatory",
    "Service robotics"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}