{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-912802107137013647",
  "published": "2021-12-09T15:00:00.001-05:00",
  "updated": "2021-12-09T15:00:00.176-05:00",
  "title": "You Can’t Stop The Beat - Apple Music now available on Nest Devices in Canada",
  "content": "We’ve got the music covered for your next holiday party! As of today, you can now ask Google Assistant on Google Nest and other Assistant-enabled smart speakers and displays to play your favorites on Apple Music in Canada.&nbsp;<div><br /></div><div>Apple Music subscribers can search and play songs, albums and playlists just by using their voice. Not sure what you want to listen to? You can also use your Google Assistant to play music by genre, mood or activity.&nbsp;</div><div><br /></div><div>To set up Apple Music on your device, first link your Apple Music account in the Google Home app. After it is set up, you can easily queue up your favorite playlist, artist, or any of the award-winning Apple Music Radio stations live streaming today’s hits, classics, and country to play over your connected device.&nbsp;</div><div><br /></div><div>Users also have the ability to set Apple Music as your default music streaming service in the <a href=\"https://support.google.com/googlenest/answer/7030379#zippy=%2Capple-music\" rel=\"nofollow\" target=\"_blank\">Google Home App</a> for a seamless integration and playback experience.&nbsp;</div><div><br /></div><div>With Apple Music now available on Nest devices such as <a href=\"https://store.google.com/us/product/nest_hub_2nd_gen?hl=en-US\" rel=\"nofollow\" target=\"_blank\">Nest Mini</a>, <a href=\"https://store.google.com/us/product/nest_audio?hl=en-US\" rel=\"nofollow\" target=\"_blank\">Nest Audio</a>, <a href=\"https://store.google.com/us/product/nest_hub_2nd_gen?hl=en-US\" rel=\"nofollow\" target=\"_blank\">Nest Hub</a> and <a href=\"https://store.google.com/us/product/google_nest_hub_max?hl=en-US\" rel=\"nofollow\" target=\"_blank\">Nest Hub Max</a>, Apple Music subscribers now have more choices when it comes to where they can utilize their Apple Music service.&nbsp;</div><div><br /></div><div>Australia, Canada, India, S. Korea and Mexico are the latest regions to offer Apple Music on compatible devices. <a href=\"https://www.blog.google/products/google-nest/never-miss-beat-apple-music-now-available-new-nest-audio/\" rel=\"nofollow\" target=\"_blank\">Last year</a>, Apple Music began rolling out on Nest and other Assistant-enabled smart speakers and displays in the US, UK, France, Germany and Japan.  </div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}