{
  "id": "yt:video:cc335wPXRlQ",
  "yt:videoId": "cc335wPXRlQ",
  "yt:channelId": "UC0uTPqBCFIpZxlz_Lv1tk_g",
  "title": "Philosophy: discipline and self-restraint",
  "link": "",
  "author": {
    "name": "Protesilaos Stavrou",
    "uri": "https://www.youtube.com/channel/UC0uTPqBCFIpZxlz_Lv1tk_g"
  },
  "published": "2022-10-27T11:47:03+00:00",
  "updated": "2022-10-29T18:11:09+00:00",
  "media:group": {
    "media:title": "Philosophy: discipline and self-restraint",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Find all my publications on my website: https://protesilaos.com\n\n* * *\n\nI climbed the mountain and sat at its top, all while talking philosophy.  This video is about an hour long.  These are the main themes:\n\n* Story about me when I was younger, which illustrates how I had the appearance of discipline without a solid grasp of the \"why\"\n* Continuation of that story, delving into my bad habit with alcohol consumption.  The gist is that I overestimated my ability by believing in my own narrative of how disciplined I was---a mistake.\n* How can we have self-restraint without a good understanding of our self and of our limits?\n* Discussion on the introspection---the search for the \"why\"---that made me understand the reason I was behaving in that bad way (where alcohol was the facilitator and enabler of certain experiences).\n* Tie it all together in an exposition about not talking big and not overestimating our abilities.\n* Comment on three more stories that further explain these and related ideas.\n* In short: be patient, take it slow, do not assume that you are special, do not talk big, have a sense of purpose that is consistent with your actuality, put yourself to the test in order to learn who you are (what you can and cannot do).\n\nRelated videos:\n\n* Forgiveness and hubris: https://protesilaos.com/books/2022-10-25-forgiveness-hubris/\n* On self-improvement: https://protesilaos.com/books/2022-10-21-self-improvement/\n* Loss, entitlement, and presence: https://protesilaos.com/books/2022-10-17-loss-entitlement-presence/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}