{
  "title": "4 Business AI Predictions for 2022-2023",
  "link": "https://kavita-ganesan.com/ai-predictions/",
  "comments": "https://kavita-ganesan.com/ai-predictions/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Tue, 28 Jun 2022 23:59:21 +0000",
  "category": [
    "AI Strategy",
    "Business AI"
  ],
  "guid": "https://kavita-ganesan.com/?p=7159",
  "description": "Having worked with numerous clients, big and small in the integration of AI, here are 4 Business AI predictions in 2022 and beyond.",
  "content:encoded": "\n<p>AI as a field, especially in the context of real-world applications, has been progressing at a rapid pace. This has been further accelerated by the onset of the COVID-19 pandemic. In fact, AI was found to be the<a href=\"https://www.tvtechnology.com/news/artificial-intelligence-was-the-most-discussed-technology-of-2021\"> most discussed technology</a> in 2021. Having worked with numerous clients, big and small, in the integration of AI, here are 4 Business AI predictions in 2022 and beyond.</p>\n\n\n\n<h2><strong>#1 Many more “deployed” models</strong></h2>\n\n\n\n<p>In the recent past, businesses have had trouble operationalizing models and have not seen the value in many of their AI initiatives. In fact, <a href=\"https://www.gartner.com/en/newsroom/press-releases/2020-10-19-gartner-identifies-the-top-strategic-technology-trends-for-2021\">Gartner’s research </a>shows that <em>only</em> 53% of AI initiatives make it from prototype to production.</p>\n\n\n\n<p>However, with the recent growth in the number of ML deployment platforms, low-code and no-code AI development services, and AI vendors providing out-of-the-box AI solutions, such as speech recognition, sentiment analysis, and ticket routing, we will start witnessing many more real-world applications of AI.</p>\n\n\n\n<h2><strong>#2 The rise of problem-focused practitioners</strong></h2>\n\n\n\n<p>While the focus of AI as a field has been strongly techniques-focused, business practitioners are slowly beginning to realize that the latest and greatest techniques <em>may not necessarily work</em> from a practical standpoint for many use cases. There is a fundamental difference between techniques that are still in “research mode” versus those that have been tried and tested.</p>\n\n\n\n<p>Even though in the past, data scientists have taken pride in using the most sophisticated techniques to demonstrate expertise, data scientists are becoming more <em>problem-focused.</em> They’re adopting simpler techniques that will have a higher chance of success for real-world use cases. This change in thinking will improve the outcomes of many AI initiatives.</p>\n\n\n\n<h2><strong>#3 </strong><strong><em>Accountable AI</em></strong><strong> will gain steam</strong></h2>\n\n\n\n<p>With all the Facebook drama and regulations around AI still being limited and “in the talks”, more and more businesses are becoming aware of the problems with algorithms. Unless algorithms are used responsibly with downstream and long-term impact in mind, it’s clear that they can do significant damage. To that end, I’m seeing many data scientists and leaders talk about the ethics and implications of algorithms.</p>\n\n\n\n<p>I believe that informal conversations around AI ethics are just the beginning. Some of these discussions will turn into action where businesses will start having their <em>own committees</em> to vet AI systems rigorously. Some will even study potential societal impact before the release of specific technologies—regardless of regulations. Regulations will only add another layer of oversight, especially for companies that have yet to take AI ethics and accountability seriously.</p>\n\n\n\n<h2><strong>#4 </strong><strong><em>Underserved </em></strong><strong>industries will start adopting AI</strong></h2>\n\n\n\n<p>AI has largely been a winning tool for large tech companies. But the stress caused by the COVID-19 pandemic, such as the shrinking labor force participation, workers not wanting to work on the front lines, social distancing requirements and others have forced many companies that used to rely heavily on the availability of workers to <em>rethink </em>their business models.</p>\n\n\n\n<p>From allowing employees to work remotely, to automating away jobs that no human worker wants to do, are all options on the table for serious consideration. As part of this, AI will be a critical player in changing businesses forever.&nbsp; Hospitals, manufacturers, and restaurant chains will all be at the crossroads of technology transformations.</p>\n\n\n\n<h1><strong>Summary</strong></h1>\n\n\n\n<p>While AI within business applications was a new concept several years ago, as you can see from these predictions that it’s becoming more mainstream and achievable. The growth of AI deployment and development platforms, mindset changes, and stress caused by the COVID-19 pandemic will all be true catalysts in making AI a reality for businesses.</p>\n\n\n\n<p>The post <a href=\"https://www.opinosis-analytics.com/blog/2022-2023-business-ai-predictions\" rel=\"nofollow\">4 Business AI Predictions for 2022-2023</a> appeared first on <a href=\"https://www.opinosis-analytics.com\" rel=\"nofollow\">Opinosis Analytics</a>.</p>\n\n\n\n<p><a href=\"https://www.opinosis-analytics.com/blog/2022-2023-business-ai-predictions\" target=\"_blank\" rel=\"noopener\">4 Business AI Predictions for 2022-2023</a></p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/ai-predictions/feed/",
  "slash:comments": 0,
  "post-id": 7159
}