{
  "title": "S1E7 - Extend Your Athletic Career with Susie Parker-Simmons",
  "guid": "https://pinecast.com/guid/4995087a-0d99-48e2-a0f7-857e631b4cac",
  "pubDate": "Tue, 21 Jul 2020 07:30:00 -0000",
  "itunes:duration": "00:50:11",
  "description": "<p>Laura’s guest this week is the Sports Dietitian and Physiologist for the United States Olympic Committee, Susie Parker-Simmons. With her experience in both Australia and the United States, and her involvement at 7 Olympic Summer, Winter, and Paralympic Games, Susie is a wealth of knowledge and experience in employing nutrition to extend athletic careers.</p>\n<p>Susie begins today’s discussion by reviewing her journey to her current role and her work during the pandemic, and offering an extensive analysis of how to use nutrition to extend athletic careers. She explores the impact of nutrition on the physical, cognitive and emotional development of athletes, offers some tips for young athletes, and shares her perspective on nutritional supplementation. Susie also looks at the evolution of the nutritional content of food over the years, dietary practices for recovering from injuries, breakthroughs in sports nutrition, and preparing athletes for easing into retirement. She finishes by providing her recommendations regarding the use of apps by athletes. As you listen today, you will be struck not only by Susie’s expertise in this field, but her sincere desire to make the life of athletes better both within and outside of their sport – she is truly as informative as she is inspirational.</p>\n<p>Episode Highlights:</p>\n<p>Susie’s journey to her current role\nHer work during the pandemic\nUsing nutrition to help extend your athletic career\nDetermining the time of peak growth \nNutrition and physical, cognitive and emotional development\nTop tips for young athletes\nReliable sources of nutritional information for athletes\nDifferent nutritional requirements for different sports\nNutritional supplementation\nThe evolution of the nutritional content of food\nDietary practice advice for athletes recovering from injuries\nBreakthroughs in sports nutrition\nPreparing athletes to ease into their retirement\nSusie’s recommendations regarding apps</p>\n<p>Quotes:</p>\n<p>“During the peak growth phase…you need to modify the load through the body because that’s the at-risk time for injury.”</p>\n<p>“If you listen to your body, your body will tell you…what it needs.”</p>\n<p>“It’s important not to neglect the emotional and the cognitive sort of development that happens with these kids as well because they may stop the sport.”</p>\n<p>“It’s important to look at who you are, what your dreams are…what you need to do to fulfill your dreams.”</p>\n<p>“I want to prevent the loss of athletes from sport, and also the loss of the love and the passion for their sport.”</p>\n<p>“We’ve just got to make sure we look after their life outside of the sport as well as their life in sport.”</p>\n<p>“Go back to the basics.”</p>\n<p>“I try to take the emotion out of food.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a></p>\n<p>Susie’s work with Olympic athletes: <a href=\"https://www.teamusa.org/News/2018/February/17/Nutritionists-Behind-The-Scenes-Give-Team-USA-Athletes-The-Right-Fuel-For-Success\" rel=\"nofollow\">https://www.teamusa.org/News/2018/February/17/Nutritionists-Behind-The-Scenes-Give-Team-USA-Athletes-The-Right-Fuel-For-Success</a></p>",
  "itunes:title": "Extend Your Athletic Career with Susie Parker-Simmons",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 7
}