{
  "title": "Millionaire Interview 337",
  "link": "https://esimoney.com/millionaire-interview-337/",
  "comments": "https://esimoney.com/millionaire-interview-337/#comments",
  "dc:creator": "ESI",
  "pubDate": "Fri, 21 Oct 2022 09:00:26 +0000",
  "category": [
    "Interviews",
    "Millionaires"
  ],
  "guid": "https://esimoney.com/?p=8755",
  "description": "<p>Here’s our latest interview with a millionaire as we seek to learn from those who have grown their wealth to high heights. If you’d like to be considered for an interview, drop me a note and we can chat about specifics. This interview took place in May. My questions are in bold italics and their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-337/\">Millionaire Interview 337</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/05/Animal-shelter-volunteers-new.jpg\"><img class=\"alignleft size-medium wp-image-8756\" src=\"https://esimoney.com/wp-content/uploads/2022/05/Animal-shelter-volunteers-new-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https://esimoney.com/wp-content/uploads/2022/05/Animal-shelter-volunteers-new-300x200.jpg 300w, https://esimoney.com/wp-content/uploads/2022/05/Animal-shelter-volunteers-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Here’s our latest <a href=\"https://esimoney.com/category/millionaires/\">interview with a millionaire</a> as we seek to learn from those who have grown their wealth to high heights.</p>\n<p>If you’d like to be considered for an interview, <a href=\"https://esimoney.com/contact/\">drop me a note</a> and we can chat about specifics.</p>\n<p>This interview took place in May.</p>\n<p>My questions are in bold italics and their responses follow in black.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>OVERVIEW</strong></span></h4>\n<p><em><strong>How old are you (and spouse if applicable, plus how long you&#8217;ve been married)?</strong></em></p>\n<p>I am 56 and my husband is 59.</p>\n<p>We’ve been married for nearly 30 years.</p>\n<p><em><strong>Do you have kids/family (if so, how old are they)?</strong></em></p>\n<p>Just the two of us – childless by choice.</p>\n<p><em><strong>What area of the country do you live in (and urban or rural)?</strong></em></p>\n<p>We live in the mid-Atlantic area of the US.</p>\n<p><em><strong>What is your current net worth?</strong></em></p>\n<p>Our current net worth is just north of $10 million.</p>\n<p><em><strong>What are the main assets that make up your net worth (stocks, real estate, business, home, retirement accounts, etc.) and any debt that offsets part of these?</strong></em></p>\n<ul>\n<li>Taxable Investment Accounts: 36%</li>\n<li>Tax Advantaged 401k/Traditional IRA Accounts/Tax Free: 37%</li>\n<li>Deferred Compensation: 10%</li>\n<li>Cash/I Bonds: 3%</li>\n<li>Variable Annuity: 3%</li>\n<li>Primary Residence: 10%</li>\n</ul>\n<p>The only debt we maintain is for an auto loan. We took advantage of a zero percent, 36 months loan.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>EARN</strong></span></h4>\n<p><em><strong>What is your job?</strong></em></p>\n<p>We retired in late 2021.</p>\n<p>We each worked for Fortune 100 companies over the course of our careers.</p>\n<p>I earned my <a href=\"https://esimoney.com/the-value-of-an-mba/\">MBA</a>/Marketing undergrad degree and worked in product management and marketing.</p>\n<p>My husband earned his MBA/Computer Science undergrad degree and worked in product management.</p>\n<p>By the time we retired, we had worked in our chosen careers 31 and 35 years respectively.</p>\n<p><em><strong>What is your annual income?</strong></em></p>\n<p>In the past several years our annual income ran between $700k &#8211; $900k, depending on bonuses and restricted stock unit vesting.</p>\n<p>While we both earned good salaries, I ended up being the primary earner for our family over the course of our careers.</p>\n<p><em><strong>Tell us about your income performance over time. What was the starting salary of your first job, how did it grow from there (and what you did to make it grow), and where are you now?</strong></em></p>\n<p>I graduated from college into the recession of the early 90s and jobs were difficult to find. I took a secretarial job (as they were referred to at that time). My salary was $20k annually. I worked hard, took on extra responsibilities and was able to get promoted within six months. That upped my salary to $30k.</p>\n<p>My husband was recruited from college to a telecom company. He worked in product development/management/marketing. His starting salary was $40k. When he was promoted in the early 90s, the company relocated us which proved to be a financial stepping-stone (more on that later). He was also fortunate to have a company-paid sabbatical to get his MBA.</p>\n<p>After a few years at my company, I was ready to take on more responsibility and move to a larger company. The economy was booming and there were a lot of job opportunities. I found my next role at a Fortune 100 company. My starting salary was $90k plus bonus.</p>\n<p>After a few years, I started a part time MBA program. The company paid for 50% of tuition with the stipulation that I stayed for two years post-graduation. I stayed with that company for nearly 15 years and gradually rose through the ranks.</p>\n<p>By the mid-2000s, our combined annual income had grown to around $400k per year which included bonuses, restricted stock awards and stock options.</p>\n<p>In 2010, I was ready to step into a more senior role and felt that I needed to make a significant career change. I found a senior leadership role at another Fortune 100 company. We had the choice of several locations and decided to move to the mid-Atlantic area. My new role bumped our income to up $700k &#8211; $900k per year.</p>\n<p><em><strong>What tips do you have for others who want to grow their career-related income?</strong></em></p>\n<p>Middle to senior level leadership positions can be very lucrative in corporate America. If you are suited to and like the work, compensation can add up very quickly. I paid my dues early in my career taking on additional responsibilities, working to make my skill set, experience, and ability to deliver results relevant to my managers.</p>\n<p>I think it’s important to learn how to network effectively and establish professional and personal relationships that can help you advance your career and help others advance their careers. <a href=\"https://esimoney.com/7-steps-to-millions-more-network/\">Networking</a> has been one of the most challenging aspects of my corporate life as I don’t come by it naturally. I realized how valuable creating and sustaining professional connections is to cultivate a career.</p>\n<p>Early on, I realized that corporate America can be a gravy train of monetary and non-monetary compensation. Our compensation typically included bonus, restricted stock, options as well as 401k matching and profit sharing. The cost of our graduate degrees was either eliminated or substantially reduced through company contributions.</p>\n<p>Over the course of our careers, we took advantage of two lucrative relocation packages. In each instance, we were able to financially gain from geo-arbitraged housing markets, fully paid moves, subsidized closing costs, and below market mortgage rates.</p>\n<p>It sounds obvious but worth stating to take advantage of every benefit your company can provide whether it be outright monetary compensation, training, or flexible work arrangements. It pays to ask for what matters to you.</p>\n<p><em><strong>What&#8217;s your work-life balance look like?</strong></em></p>\n<p>Since we retired, we don’t have to balance any longer and it’s been wonderful.</p>\n<p>When we were working, work was all consuming for me.</p>\n<p>My husband took a much more balance approach and was able to disconnect mentally and technology-wise when the day was over.</p>\n<p>In my role, I felt I had to been “on call” and stay many steps ahead of my colleagues and my boss. I really enjoyed what I did and the people I worked with, but the demands were constant and increasingly challenging. When I first started in senior management, I loved the challenge of it. Over time, I found the routine and pointless meetings, regulatory red-tape, and people management aspects to be draining.</p>\n<p><em><strong>Do you have any sources of income besides your career? If so, can you list them, give us a feel for how much you earn with each, and offer some insight into how you developed them?</strong></em></p>\n<p>Our careers were our primary sources of income and that’s where we put our focus on maximizing our earnings potential.</p>\n<p>Over time, we worked to structure our investments to provide income that would support our non-working years.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>SAVE</strong></span></h4>\n<p><em><strong>What is your annual spending?</strong></em></p>\n<p>For 2022, our spending will fall somewhere around $240k (including health insurance premiums and Fed/State taxes).</p>\n<p>Pre-retirement, our spending was similar minus health insurance premiums and plus mortgages (primary and vacation properties) and savings.</p>\n<p><em><strong>What are the main categories (expenses) this spending breaks into?</strong></em></p>\n<p>Post-retirement spending is as follows:</p>\n<ul>\n<li>Auto loan/Tax/Maintenance: $20k</li>\n<li>Charity: $10k</li>\n<li>Food: $20k</li>\n<li>Gas: $3k</li>\n<li>Med/Dental/Vision Ins Premiums: $19k</li>\n<li>Health/Wellness/Trainer: $15k</li>\n<li>Home Maintenance: $16k</li>\n<li>Insurance Home/Auto/Umbrella: $7k</li>\n<li>Shopping/Pet/Other: $25k</li>\n<li>Taxes: Fed/State: $65k</li>\n<li>Taxes: Real Estate: $11k</li>\n<li>Travel: $17k</li>\n<li>Utilities/Subs/Streaming/Other: $12k</li>\n</ul>\n<p><em><strong>Do you have a budget? If so, how do you implement it?</strong></em></p>\n<p>I manage the finances in our household. The situation works out well since my husband has little interest. We consult on all major decisions but the day to day is my responsibility and I enjoy it.</p>\n<p>We began tracking our day-to-day spending in 2021 when we were planning for retirement. Prior to that, it was a process of elimination: priority was savings/investment first, then taxes, mortgage/non-discretionary and discretionary.</p>\n<p>I conducted a detailed look back at our spending from the previous five years and that formed the basis of our retirement budget. Once we exclude mortgages and savings, our post-retirement spending is consistent to our pre-retirement spending.</p>\n<p>We don’t have extravagant tastes and have cushion in the budget that we can cut back when necessary.</p>\n<p><em><strong>What percentage of your gross income do you save and how has that changed over time?</strong></em></p>\n<p>We’ve both been diligent savers, even when we had very little to save.</p>\n<p>In the beginning of our marriage, we saved at least 10% of our income which was mostly comprised of 401k contributions.</p>\n<p>Our savings rate gradually increased to 15-20% and in the past 10 years, we saved 30-40% of our annual income.</p>\n<p><em><strong>What&#8217;s your best tip for saving (accumulating) money?</strong></em></p>\n<p>Automated savings worked best for us. That included our contributions to our 401ks, Traditional IRAs and HSAs. Out of sight, out of mind.</p>\n<p>I took advantage of my company’s deferred compensation plan to defer my annual bonus for several years. That enabled us to retire without having to dip into our portfolio for several years into our retirement.</p>\n<p><em><strong>What&#8217;s your best tip for spending less money?</strong></em></p>\n<p>Manage lifestyle inflation and be clear about what you value. It’s easy to say in concept but takes commitment and discipline to follow through.</p>\n<p>Every time our income increased, it was so tempting to buy a bigger house, buy a new car, go on an expensive vacation, etc. In some ways, we tried to ignore incremental income. It was less tempting if we automated monthly savings and investment transfers.</p>\n<p>Lifestyle inflation did happen over time, but we struck a good balance of enjoying the fruits of our labor within limits. It was very important to both of us that we avoided living a lifestyle that trapped us into a cycle of earning to spend.</p>\n<p><em><strong>What is your favorite thing to spend money on/your secret splurge?</strong></em></p>\n<p>As we got older, maintaining our health became increasingly important. We are very active and had a couple of health scares reminded us that we were not invincible. Fortunately, we are fine and made lifestyle changes to support our long-term health.</p>\n<p>We have had a personal trainer for years, get regular massages, eat a high-quality diet, etc.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>INVEST</strong></span></h4>\n<p><em><strong>What is your investment philosophy/plan?</strong></em></p>\n<p>Aspects of my investment philosophy have stayed the same and some have changed.</p>\n<p><span style=\"text-decoration: underline;\">What’s stayed the same:</span></p>\n<p>Invest for the long term, no matter how distracting the short term may be. As adults, we lived through the recession of the early 90s, the dot com bubble/early 2000s, the 2008/2009 financial crisis and now 2022. Throughout those times one thing remained consistent: keep investing. I remember how painful it was in the in the early 2000s, opening our quarterly brokerage and 401k statements. Every statement was red, every quarter. For years (at least it seemed at the time). Yet we had faith that persistent, long-term focused investing would pay off at some point.</p>\n<p>Understand our investments and avoid what we don’t understand. As our income grew this was harder to maintain. As we looked for investments that would protect/defer our income from taxes inevitably options like whole life insurance, annuities, etc. were considered. We stayed away from whole life insurance as it never made sense to us. We did end up investing in a variable annuity but only a small amount of our portfolio and after we did substantial amount of research on the company and terms. We haven’t taken the leap into crypto at this point.</p>\n<p><span style=\"text-decoration: underline;\">What’s changed:</span></p>\n<p>When we started out, low-cost investing was our mantra. Mainly because we had so little money to invest, and my father drilled the idea of low-cost <a href=\"https://esimoney.com/why-i-invest-with-index-funds/\">index investing</a> into my head. Beyond our company 401ks, we kept a brokerage account at Vanguard.</p>\n<p>Once our portfolio reached a certain size and knowing my husband had little interest in managing our money, we decided to hire a full-service advisor. That was a very difficult decision yet one that we are glad we made. We found a reputable advisor who understood our objectives and what mattered to us. We employed them for 10 years and have been very pleased with our portfolio performance and our relationship.</p>\n<p>With retirement, we made a change to a reputable lower-cost advisor. The reason: we don’t have complex financial needs that our previous advisor offered, are ready to simplify the portfolio and lower our investment costs.</p>\n<p><em><strong>What has been your best investment?</strong></em></p>\n<p>As many in this forum have stated before me, my best investment was and is my relationship with my husband (and I would dare say vice versa).</p>\n<p><em><strong>What has been your worst investment?</strong></em></p>\n<p>There was a time when we had a small amount portion of our portfolio invested with an independent investment advisor. In the first few years of the relationship, the investment value increased. Then came March 2020 and this advisor could not handle the situation. In the Spring of 2020, the advisor called me almost daily and in a panic. So not only were we trying to make sense of what was going on in a world turned upside down, we were dealing with an advisor who clearly could not handle the pressure.</p>\n<p>To this advisor’s credit, they admitted they did not know what advice to give us on our investments. It got to the point where we did the one thing that you never want to do when the market is tanking: we sold all of it. Fortunately, it was a small amount of our portfolio, but it hurt just the same. That was an expensive lesson in what panic really looks like.</p>\n<p>We made the best of it by using the proceeds to pay off our mortgage and offset subsequent capital gains in 2020 and 2021 with the capital losses.</p>\n<p><em><strong>What&#8217;s been your overall return?</strong></em></p>\n<p>Over the past 10 years, our investments averaged somewhere north of 15% return annually.</p>\n<p><em><strong>How often do you monitor/review your portfolio?</strong></em></p>\n<p>I’ve been guilty of checking daily when the market is on the upswing. It feels great to see the market in the green every day and balances grow.</p>\n<p>Of course, when the market trends down and swings violently like it has been lately, it gives me a stomachache.</p>\n<p>So, I’m trying to strike a balance by checking at the end of every month.</p>\n<p>Since we have an advisor, we meet quarterly to review where we are and what adjustments, if any, need to be made.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>NET WORTH</strong></span></h4>\n<p><em><strong>How did you accumulate your net worth?</strong></em></p>\n<p>We built our net worth from a combination of increasing our income through our careers, a consistently high savings rate and investing over a 30-year period.</p>\n<p>As our incomes grew, our savings grew. We began contributing to our 401ks early in our careers. At first, we contributed as much as we could afford and increased to the maximum contribution limit as soon as our incomes allowed.</p>\n<p>We saved a high percentage of our bonuses, stock options and restricted stock awards. I think what set us up for early retirement was the 2008/2009 downturn. Through some amount of dumb luck, we sold our house in the northeast at the market peak just before the 2007-2008 meltdown. We took the proceeds and DCA’d the majority into the market between 2008 – 2011.</p>\n<p><em><strong>What would you say is your greatest strength in the ESI wealth-building model (Earn, Save or Invest) and why would you say it&#8217;s tops?</strong></em></p>\n<p>I think it’s the combination of Save and Invest: our willingness and ability to save a significant portion of our income and our willingness to invest consistently over time.</p>\n<p>The combination of the two has helped propel our net worth.</p>\n<p><em><strong>What road bumps did you face along the way to becoming a millionaire and how did you handle them?</strong></em></p>\n<p>We had two close calls with declining real estate values. Fortunately, we worked our way out of those situations through corporate relocations.</p>\n<p>In each situation we broke even or lost a very small amount on the properties.</p>\n<p>At the time, the market declines in the early 2000s and the financial crisis in 2008 seemed to set us back. Staying in the market turned that situation around over time.</p>\n<p><em><strong>What are you currently doing to maintain/grow your net worth?</strong></em></p>\n<p>Our portfolio has declined by ~10% YTD 2022. In addition, we just switched advisors.</p>\n<p>We’re taking advantage of the market downturn to reposition our portfolio with the objective of reducing some fund costs and making the portfolio more tax efficient. It’s painful to sell at a loss yet we know it’s a long-term play.</p>\n<p>We continue to reinvest dividends through dollar cost averaging, and we may even put some of our cash buffer into play if the market moves substantially lower.</p>\n<p><em><strong>Do you have a target net worth you are trying to attain?</strong></em></p>\n<p>For some reason we originally anchored on $3 million net worth. I can’t recall why but that was our goal.</p>\n<p>Once we hit $1 million net worth, our portfolio started to grow quickly, and we soon passed the $3 million.</p>\n<p>When we started working with our advisors, they helped us create a formal plan and focused on <a href=\"https://esimoney.com/multiple-streams-of-income-helping-you-get-to-financial-independence-and-beyond/\">income streams</a> as well overall net worth.</p>\n<p><em><strong>How old were you when you made your first million and have you had any significant behavior shifts since then?</strong></em></p>\n<p>We reached the first million mark when I was 36 and my husband was 40.</p>\n<p>It wasn’t until we reached $2 million that we started loosening the purse strings a bit. Our main splurge was to renovate our kitchen and bathrooms. We made that money back on that investment a few times over when we sold the property in 2007.</p>\n<p>When our net worth hit $7 million, we decided to buy a small vacation condo a few hours from our home. We sold that condo when we decided to retire and didn’t want to carry any mortgage debt into retirement.</p>\n<p><em><strong>What money mistakes have you made along the way that others can learn from?</strong></em></p>\n<p>I tend to be on the conservative end of the investment spectrum. There were times early on in our investing journey when we should have taken on more risk than we did. This was mainly during the time I was self-managing our portfolio.</p>\n<p>I know advisors tend to get a bad rap and the expense is a drag on investment returns however our advisors have helped us improve returns by helping us get comfortable with a more appropriate risk profile.</p>\n<p>We could have better leveraged the vacation condo if we bought a property that could have been rented out short term. The condo association did not allow short term rentals. In retrospect, we were thinking too short term on that property.</p>\n<p>While not necessarily a mistake, paying off the mortgage on our primary residence was a debate. We had a very low interest rate and were mid-way through a 15-year mortgage. Financially, it would have been more lucrative to keep the mortgage and invest the capital. Psychologically, it has been a wonderful feeling to own our home outright. I’ve read the debates online as this is a question people many consider. Peace of mind won out for us.</p>\n<p><em><strong>What advice do you have for ESI Money readers on how to become wealthy?</strong></em></p>\n<p>Focus on what you can control. For us, that meant investing in our careers, saving as much as we could as early as could and invest for the long term.</p>\n<p>I really do believe that time in the market, particularly when the market declined, was the key to our ability to build wealth. The lesson I would extrapolate is to be willing to make investments now and over time for a long term pay off.</p>\n<p>I have less faith in get rich quick opportunities like some of the day trading mania that occurred in 2020. I don’t doubt that money was made quickly but I am suspect about the ability to sustain it over time.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>FUTURE</strong></span></h4>\n<p><em><strong>What are your retirement plans?</strong></em></p>\n<p>My husband and I retired in 2021. Had the pandemic had not come along, we likely would have worked for a few more years.</p>\n<p>So far, we are really enjoying our new life. I think we have both come to realize both how precious the next 10 years will be for us in that we’re both healthy and we can spend time on the activities we enjoy and with those we love.</p>\n<p>Once we get into our early 70s and beyond, health could make activities more limiting (although we’re focused on keeping ourselves as healthy as possible).</p>\n<p>In terms of finances, we will draw on my deferred compensation for the next five years. That will cover ~70%- 90% of our annual expenses. The remainder will come from a cash buffer.</p>\n<p><em><strong>Are there any issues in retirement that concern you? If so, how are you planning to address them?</strong></em></p>\n<p>There were several issues that we’ve been focused as we built our retirement plan.</p>\n<p>The first was healthcare. We will have 7 – 10 years before we qualify for Medicare. We won’t qualify for the ACA subsidy due to our deferred compensation income. Fortunately, my husband officially retired from his company, and we participate in their retiree healthcare plan. The monthly premiums are not subsidized however it’s a good healthcare plan (the same plan we were on while he was working) and we planned for the on-going (and escalating) expense.</p>\n<p>The second was a combination of sequence of return risk (SORR) and inflation. This has hit us right in the face this year. We have a little bit of insulation from SORR in the next five years since we will draw on deferred compensation and can continue to reinvest dividends as the market declines. Despite that, it&#8217;s still a major concern for us. There’s almost no protection against inflation although we don’t need to make any major purchases in the foreseeable future (no new cars, home, etc.). We have a good amount of flexibility built into our annual spending budget which I expect we will need to take advantage of at some point; and</p>\n<p>The third is the future tax implications of our tax deferred accounts. We are just starting to wrap our heads around the tax consequences of our tax deferred accounts and required minimum distributions. We’re scheduled meet with our CPA to start planning for the time between 2023 (when my husband turns 59 ½) and 2035 (when he turns 72). We will know more about what different scenarios and our options look like shortly.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>MISCELLANEOUS</strong></span></h4>\n<p><em><strong>How did you learn about finances and at what age did it &#8220;click&#8221;?</strong></em></p>\n<p>I learned some hard but valuable lessons in college. When I was in high school, my father worked for a university and, as a benefit, his children’s tuition expense was capped at a fraction of the in-state tuition rate. Of course, my parents heavily lobbied for me to stay close to home. I did but it just wasn’t a fit for me. I decided to transfer to an out of state university where, as expected, tuition was much higher. My parents agreed to the transfer with the stipulation that I pay my own tuition. They would pay for books and provide a stipend for rent/food.</p>\n<p>It was one of the best decisions I made. I worked full time for a year so I could save money and qualify for in-state tuition. I worked my way through undergraduate school, took out a small student loan and received small grants. I ended up graduating with honors within 3 years.</p>\n<p>That experience brought to the surface how much I value my independence. I realized that having financial resources would allow me to make decisions based on what I want to do vs. have to do. That need for independence has been a big influence on the decisions I’ve made throughout my life.</p>\n<p>My father handled the investments, and my mother handled the day-to-day budget in their household. I learned about investing from my father. He started investing in the 70s, threw in the towel at some point in the late 70s and got back in the market in the early 80s. He was a Vanguard/Boglehead type investor and made it a point to share his experience with me once I started my career and had money to invest.</p>\n<p><em><strong>Who inspired you to excel in life? Who are your heroes?</strong></em></p>\n<p>My parents are my heroes. They were children of the Great Depression, and each came from difficult childhood circumstances. My paternal grandfather died when my father was very young, leaving my grandmother to raise their children by herself, working as a maid. My maternal grandparents lost everything in the ’29 crash, divorced, and basically abandoned my mother when she was a toddler. She had to rely on the kindness of her relatives to raise her.</p>\n<p>Through luck my parents found each other and built a remarkable life together, had and raised their children, and lived a comfortable, middle-class life. My family was never rich, yet we always lived in a home which my parents owned, had good healthcare, good public educations, always had food on the table and had each other. My parents worked, scraped, and sacrificed to create the stability and security they never had as children.</p>\n<p>My parents had high expectations that their children excel with an emphasis on academics. They instilled discipline in each of us early on: school, homework, chores, church and only then could we partake in TV/sports, etc. We were all expected to get at least a college degree, which all six of achieved with half on scholarship.</p>\n<p>I am deeply grateful for my parents and the way they raised me.</p>\n<p><em><strong>Do you have any favorite money books you like/recommend? If so, can you share with us your top three and why you like them?</strong></em></p>\n<p>I attended a professional curriculum at Wharton. Jeremy Siegel, the Russell E Palmer Professor of Finance, was the featured speaker. I read his book Stocks for the Long Run which I found helpful.</p>\n<p>I read <a href=\"https://esimoney.com/the-best-personal-finance-books-of-all-time-the-millionaire-next-door/\">The Millionaire Next Door</a> years ago.</p>\n<p><em><strong>Do you give to charity? Why or why not? If you do, what percent of time/money do you give?</strong></em></p>\n<p>We began regular charitable giving about 15 years ago.</p>\n<p>Our primary focus is monetary giving to charities that benefit animals and the homeless.</p>\n<p>We also regularly volunteer for these same organizations giving our time to day-to-day administrative tasks and various fund-raising events.</p>\n<p><em><strong>Do you plan to leave an inheritance for your heirs (how do you plan to distribute your wealth at your death)? What are your reasons behind this plan?</strong></em></p>\n<p>We expect there will be some funds to pass on after we are gone. Depending on the size of our portfolio over the next 10 years, we will create a <a href=\"https://esimoney.com/the-advantages-of-using-a-donor-advised-fund/\">donor advised fund</a> and begin disbursing larger chunks of funds to our favorite charities.</p>\n<p>Along with that plan, we expect to leave an inheritance to our nieces and nephews, although we haven’t made that known to them or their parents just yet.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-337/\">Millionaire Interview 337</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-interview-337/feed/",
  "slash:comments": 11
}