{
  "title": "Introducing two new solutions powered by Ads Data Hub",
  "link": "https://blog.google/products/marketingplatform/360/ads-data-hub-powered-solutions/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"hzyns\">Ads Data Hub helps advertisers, agencies and measurement partners do customized analysis of campaigns while protecting user privacy. More than 3,000 brands, agencies, and measurement partners use cloud-based Ads Data Hub to perform analyses for their specific business objectives.</p><p data-block-key=\"2rk4r\">Customers of Ads Data Hub have different needs, so we’ve created more specialized entry points to get started. Marketers require tools to quantify a consumer’s path to purchase and the ability to activate new audiences. At the same time, measurement partners conduct third-party assessment of metrics such as video viewability and audience reach.</p><p data-block-key=\"eucc7\">To offer a more tailored experience, we are introducing an evolution to the Ads Data Hub core platform by introducing two dedicated solutions: Ads Data Hub for Marketers and Ads Data Hub for Measurement Partners.</p><h3 data-block-key=\"d742d\">New solutions for more catered needs</h3><p data-block-key=\"eh32e\"><b>Ads Data Hub for Marketers</b> offers a new way for advertisers and agencies to analyze their data. With this solution, they can seamlessly access insights to better inform the way they purchase media. This means a simplified experience for marketers running queries and activating their first-party data.</p><p data-block-key=\"7cpfi\"><a href=\"https://marketingplatform.google.com/about/resources/riot-games-uses-google-marketing-platform-to-level-up-their-player-base/\">Riot Games</a>, for example, used Ads Data Hub for richer marketing analyses. The company centralized their insights and combined them with Display &amp; Video 360 and Campaign Manager 360 data. This let Riot Games attribute credit to various ad touch points, accurately measure return on ad spend (ROAS), and establish a new benchmark showing that for every $1 Riot Games spent on Google media, it received $2 in revenue. Marketers, like Riot Games, perform these analyses regularly, with hundreds of thousands of queries run in 2022 alone.</p><p data-block-key=\"3sni5\">Over time, new query templates, automated workflows, and updates to reporting will reduce the need for additional technical resources and decrease time to generate insights - with plans to implement <a href=\"https://blog.google/products/marketingplatform/360/engage-your-first-party-audience-in-display-video-360/\">Publisher Advertiser Identity Reconciliation</a>, also known as PAIR. In addition to these improvements, marketers will soon be able to activate their audience segments on new inventory, including YouTube. As privacy expectations evolve, we will continue to build more solutions that enable advertisers and agencies to measure and activate their first-party data with Ads Data Hub for Marketers.</p><p data-block-key=\"fkerc\"><b>Ads Data Hub for Measurement Partners</b> gives partners a new access point to provide YouTube measurement services on behalf of marketers, advertisers, agencies, or publishers. With this launch, it’ll be easier for partners to offer accurate measurement and deliver near real-time insights. For marketers, this means they can work with independent third-party partners to calculate and report on YouTube ad performance across devices, formats, and metrics.</p><p data-block-key=\"avuji\">These third-party independent measurement services are available to marketers via our growing partner ecosystem. With Dynata, and other vendors, we have expanded measurement services on Ads Data Hub to enable cross-media solutions for YouTube. Customers will be able to analyze the performance of YouTube campaigns relative to other media channels (including linear TV, streaming TV, or online video sources). Another partner, DoubleVerify, has earned YouTube Video Viewability accreditation by the Media Rating Council (MRC), in addition to Ads Data Hub’s own <a href=\"https://blog.google/products/ads-commerce/privacy-centric-measurement-youtube/\">accreditation</a> announced last year.</p><p data-block-key=\"2prs4\">In 2023 we plan to integrate with new partners such as iSpot and VideoAmp, joining the list of measurement partners <a href=\"https://developers.google.com/ads-data-hub/vendors/adh-vendors\">already</a> available with Ads Data Hub.</p><h3 data-block-key=\"a8l1o\">Commitment to a privacy-centric future</h3><p data-block-key=\"ce2ji\">Marketers and measurement partners will benefit from rigorous privacy checks that protect the personal data of users online while still being able to perform comprehensive analytics. These analyses, in addition to insight generation and audience activation, can all be performed with Ads Data Hub users only having access to aggregated data. By investing in privacy-centric solutions that address the specific needs of marketers and measurement partners, we've simplified the path to accurate measurement across YouTube and Google campaigns.</p></div></div></body></html>",
  "pubDate": "Mon, 31 Oct 2022 13:00:00 +0000",
  "guid": "https://blog.google/products/marketingplatform/360/ads-data-hub-powered-solutions/",
  "category": [
    "Attribution",
    "Google Marketing Platform",
    "YouTube"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Introducing two new solutions powered by Ads Data Hub",
    "description": "Ads Data Hub’s new solutions deliver analytics for marketers to generate insights while enabling the third-party measurement ecosystem.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/E02789775_Google_GMP_ADH_Rebrand_Asset_Sep22.max-600x600_yCkO8tO.png",
    "site_name": "Google",
    "url": "https://blog.google/products/marketingplatform/360/ads-data-hub-powered-solutions/"
  },
  "author": {
    "name": "Prema Sampath",
    "title": "Director",
    "department": "Product Management, Google Ads",
    "company": ""
  }
}