{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-5716345963742339085",
  "published": "2022-04-05T09:00:00.006-04:00",
  "updated": "2022-04-05T10:48:50.720-04:00",
  "title": "Find and $eek! Increased rewards for Google Nest & Fitbit devices",
  "content": "<span class=\"byline-author\">Posted by Medha Jain, Program Manager, Devices &amp; Services Security&nbsp;</span><div><span class=\"byline-author\"><br /></span></div>At Google, we constantly invest in security research to raise the bar for our devices, keeping our users safe and building their trust in our products. In 2021, we published <a href=\"https://safety.google/nest/\">Google Nest security commitments</a>, in which we committed to engage with the research community to examine our products and services and report vulnerabilities.<br /><br />We are now looking to deepen this relationship and accelerate the path toward building more secure devices. Starting today, we will introduce a new vulnerability rewards structure for submissions impacting <a href=\"https://store.google.com/category/connected_home?e=SharedFeatureEnablePolarisNavTest%3A%3ALaunch&amp;hl=en-US\">smart home</a> (Google Nest) and <a href=\"https://store.google.com/category/fitbit?e=SharedFeatureEnablePolarisNavTest%3A%3ALaunch&amp;hl=en-US\">wearables</a> (Fitbit) devices through our <a href=\"https://bughunters.google.com/about\">Bug Hunters</a> platform. <br /><br /><b>Bonus!</b><div><b><br /></b>We are paying higher rewards retroactively for eligible Google Nest and Fitbit devices reports submitted in 2021. And, starting today, for the next six months, will double the reward amount for all new eligible reports applicable to Google Nest &amp; Fitbit devices in scope.<br /><br />We will continue to take reports on our web applications, services, and mobile apps at their existing reward levels. Please keep those coming! <br /><br /><b>An enhanced rewards program</b></div><div><b><br /></b>Building on our previous programs to improve devices' embedded security posture, we’re bringing all our first-party devices under a single program, starting with Google Nest, Fitbit, and Pixel.<br />This program extends the Android Security Reward Program, making it easier for researchers to submit a vulnerability in first-party devices and improving consistency across our severity assignments. Refer to the <a href=\"https://bughunters.google.com/about/rules/6171833274204160/android-security-rewards-program-rules\">Android and Google Devices Security Reward Program</a> for more details.<br /><b><br />What interests us?</b></div><div><b><br /></b>We encourage researchers to report firmware, system software, and hardware vulnerabilities. Our wide diversity of platforms provides researchers with a smorgasbord of environments to explore. <br /><br /><b>What's next?</b></div><div><b><br /></b>We will be at the <a href=\"http://Hardwear.io\">Hardwear.io</a> conference this year! The VRP team is looking forward to meeting our security peers in person. We’ll be talking about the architecture of a couple of our devices, hoping to give security researchers a head start in finding vulnerabilities. We’ll have plenty of swag, too!<br /><br />We will continue to enhance the researchers' experience and participation. We intend to add training documentations and target areas that interest us as we grow the program.<br /><br /><i>A huge thanks to Sarah Jacobus, Adam Bacchus,  Ankur Chakraborty, Eduardo' Vela\" &lt;Nava&gt;, Jay Cox, and Nic Watson.</i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Unknown",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}