{
  "title": "282: Jim Kwik's Morning Routine for Optimal Day",
  "itunes:title": "282: Jim Kwik's Morning Routine for Optimal Day",
  "pubDate": "Mon, 30 May 2022 13:00:45 +0000",
  "guid": "07951b72-70aa-4ea9-b53a-b7b2dd956d52",
  "link": "https://sites.libsyn.com/94610/282-jim-kwiks-morning-routine-for-optimal-day",
  "itunes:image": "",
  "description": "<div class= \"c-message_kit__blocks c-message_kit__blocks--rich_text\"> <div class= \"c-message__message_blocks c-message__message_blocks--rich_text\" data-qa=\"message-text\"> <div class=\"p-block_kit_renderer\" data-qa=\"block-kit-renderer\"> <div class= \"p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first\"> <div class=\"p-rich_text_block\" dir=\"auto\"> <div class=\"p-rich_text_section\">How do you begin your day to jumpstart your brain for greater productivity and peace of mind?</div> <div class=\"p-rich_text_section\"> </div> <div class=\"p-rich_text_section\">One of the most consistent questions I get from our community is how I start my day. I believe that if you can win the morning, you can win the day. And it all starts by establishing a set of routines and habits that create positive momentum to move you forward.</div> <div class=\"p-rich_text_section\"><br /> In today’s episode, I’m going to walk you through some of the habits I’ve created that make up my ideal morning. Notice how I said ideal. My goal is to do as many things as possible, but keep in mind that every morning is different. The important thing is to start the day with self-love and self-care, so remember to be kind to yourself as you work towards change.</div> <div class=\"p-rich_text_section\"><br /> Creating a morning routine takes advantage of the science of momentum, which helps you avoid decision fatigue. Instead of having to make constant choices, you let your routine generate energy to carry you through your day. If you want to learn how to begin each morning with clarity, vision, and direction, this episode is for you.</div> </div> </div> </div> </div> </div> <div class= \"c-message_kit__reaction_bar c-reaction_bar c-reaction_bar--dark c-reaction_bar--collapsed\" role=\"group\" data-qa=\"reaction_bar\" aria-label=\"Reactions\" data-stringify-ignore=\"true\"> <p>*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to <a class=\"c-link\" tabindex=\"-1\" href= \"http://www.kwikbrain.com/podcast\" target=\"_blank\" rel= \"noopener noreferrer\" data-stringify-link= \"http://www.KwikBrain.com/podcast\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">www.KwikBrain.com/podcast</a> to get instant access. ***</p> </div>",
  "content:encoded": "     How do you begin your day to jumpstart your brain for greater productivity and peace of mind?   One of the most consistent questions I get from our community is how I start my day. I believe that if you can win the morning, you can win the day. And it all starts by establishing a set of routines and habits that create positive momentum to move you forward.  In today’s episode, I’m going to walk you through some of the habits I’ve created that make up my ideal morning. Notice how I said ideal. My goal is to do as many things as possible, but keep in mind that every morning is different. The important thing is to start the day with self-love and self-care, so remember to be kind to yourself as you work towards change.  Creating a morning routine takes advantage of the science of momentum, which helps you avoid decision fatigue. Instead of having to make constant choices, you let your routine generate energy to carry you through your day. If you want to learn how to begin each morning with clarity, vision, and direction, this episode is for you.       <p>*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to <a class=\"c-link\" tabindex=\"-1\" href= \"http://www.kwikbrain.com/podcast\" target=\"_blank\" rel= \"noopener noreferrer\" data-stringify-link= \"http://www.KwikBrain.com/podcast\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">www.KwikBrain.com/podcast</a> to get instant access. ***</p> ",
  "enclosure": "",
  "itunes:duration": "15:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you begin your day to jumpstart your brain for greater productivity and peace of mind?   One of the most consistent questions I get from our community is how I start my day. I believe that if you can win the morning, you can win the day....",
  "itunes:episodeType": "full"
}