{
  "author": {
    "name": "Ozge Akinci, Scott Frame, and Anna Kovner"
  },
  "title": "Federal Reserve System Conference on the Financial Stability Considerations for Monetary Policy",
  "link": [
    "",
    "",
    ""
  ],
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=18848",
  "updated": "2022-10-21T13:12:23Z",
  "published": "2022-10-21T11:00:00Z",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "summary": "How does monetary policy affect financial vulnerabilities and, in turn, how does the state of the financial system interact with the maximum employment and price stability goals of monetary policy? These were the key questions covered in the September 30 <a href=\"https://www.newyorkfed.org/research/conference/2022/financial-stability-considerations-monetary-policy\">conference</a> organized by the Federal Reserve System. The conference was co-led by Federal Reserve Board Vice Chair Lael Brainard and Federal Reserve Bank of New York President and CEO John C. Williams, each of whom offered prepared remarks. The program also included a panel of current and former central bank policymakers to explore the themes of the conference, as well as paper presentations with discussants. In this post, we discuss highlights of the conference. The <a href=\"https://www.newyorkfed.org/research/conference/2022/financial-stability-considerations-monetary-policy\">agenda </a>includes links to all of the presentations as well as videos for each session. ",
  "content": "<p class=\"ts-blog-article-author\">Ozge Akinci, Scott Frame, and Anna Kovner</p>\n\n\n\n<figure class=\"lse-featured-image\">\n\t<img loading=\"lazy\" width=\"460\" height=\"288\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_monetary-policy_akinci_460-1.jpg?w=460\" class=\"cover-image asset-image img-responsive wp-post-image\" alt=\"\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_monetary-policy_akinci_460-1.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_monetary-policy_akinci_460-1.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/LSE_2022_monetary-policy_akinci_460-1.jpg?resize=768,481 768w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></figure>\n\n\n\n<p>How does monetary policy affect financial vulnerabilities and, in turn, how does the state of the financial system interact with the maximum employment and price stability goals of monetary policy? These were the key questions covered in the September 30 <a href=\"https://www.newyorkfed.org/research/conference/2022/financial-stability-considerations-monetary-policy\">conference</a> organized by the Federal Reserve System. The conference was co-led by Federal Reserve Board Vice Chair Lael Brainard and Federal Reserve Bank of New York President and CEO John C. Williams, each of whom offered prepared remarks. The program also included a panel of current and former central bank policymakers to explore the themes of the conference, as well as paper presentations with discussants. In this post, we discuss highlights of the conference. The <a href=\"https://www.newyorkfed.org/research/conference/2022/financial-stability-considerations-monetary-policy\">agenda </a>includes links to all of the presentations as well as videos for each session. </p>\n\n\n\n<h4><strong>The Nexus between Monetary Policy and Financial Stability</strong></h4>\n\n\n\n<p>Fed Vice Chair Lael Brainard opened with <a href=\"https://www.federalreserve.gov/newsevents/speech/brainard20220930a.htm\">remarks</a> that highlighted how the global environment of high inflation and rising interest rates made the conference topics increasingly relevant. She noted that it was important to consider how cross-border spillovers and spillbacks might interact with financial vulnerabilities.</p>\n\n\n\n<p>The first session of the conference was devoted to theoretical contributions of the interactions between monetary policy and the degree of financial vulnerability. Tobias Adrian presented work with his coauthor Fernando Duarte entitled “<a href=\"https://www.newyorkfed.org/medialibrary/media/research/conference/2022/financial-stability/duarte_adrian%20nk_vulnerabilities.pdf?la=en\">Financial Vulnerability and Monetary Policy.</a>” Ozge Akinci presented “<a href=\"https://www.newyorkfed.org/research/staff_reports/sr946\">The Financial (In)Stability Real Interest Rate, R**</a>,” joint work with Gianluca Benigno, Marco Del Negro, and Albert Queralto. Both theoretical frameworks presented feature strong <em>nonlinearities</em> in the relationship between the real economic activity and financial conditions, induced by occasionally binding leverage constraints of financial intermediaries. The nonlinear relationships generate predictions in the models consistent with prior empirical evidence formalized as <a href=\"https://libertystreeteconomics.newyorkfed.org/2018/04/vulnerable-growth/\">GDP-at-risk</a>.</p>\n\n\n\n<p>Adrian’s and Duarte’s work predicts quantitatively large trade-offs between maintaining financial stability and achieving the dual mandate. Such a trade-off arises in their model economy because, for example, the easing of monetary policy today stimulates the economy in the short term but creates the potential for much larger output contractions in the medium term. The key mechanism for the emergence of the latter effect is that an accommodative monetary policy increases risk-taking capacity of financial intermediaries, contributing to buildup of leverage (or financial vulnerabilities) over time. In this environment, the authors conclude, an optimal monetary policy rule should always take financial vulnerability into account in addition to the output gap and inflation.</p>\n\n\n\n<p>The work by Akinci, Benigno, Del Negro, and Queralto provides a financial stability counterpart to the natural rate of interest, r*, that is associated with the notion of macroeconomic stability. This counterpart, denoted r**, is defined as the threshold real interest rate above which financial conditions may become tight enough to trigger financial instability. Imbalances in the financial sector, as measured by, say, high leverage or a tilt in intermediaries’ portfolios toward risky assets, lead to declines in r** as the financial sector becomes more vulnerable to shocks. Persistent declines in the real rate of interest lead to a longer-run decline in r** as leverage gets closer to the constraint. This occurs because the fall in real rates triggers a reach-for-yield behavior by financial intermediaries, as they shift their portfolios from safe towards riskier assets. These low levels of r** lead to what has been called “financial dominance,” as the central bank may find it hard to raise rates without triggering a crisis. The authors also provide a measure of r** for the U.S. economy and discuss its evolution over the past fifty years, highlighting that during periods of financial stress associated with a decline in r**, the real interest rate tends to track r**, a phenomenon that has been dubbed the “Greenspan put.’’</p>\n\n\n\n<p>A distinguished and diverse panel of experts—<a href=\"https://www.norges-bank.no/en/topics/about/Organisation/The-Executive-Board/Bache/\">Ida Wolden Bache</a>, <a href=\"https://www.bundesbank.de/en/bundesbank/organisation/executive-board/claudia-buch/curriculum-vitae-636746\">Claudia M. Buch</a>, <a href=\"https://www.bis.org/about/bioac.htm\">Agustín Carstens</a>, and <a href=\"https://www.brookings.edu/experts/donald-kohn/\">Donald Kohn</a>—shared a variety of perspectives on the interaction between monetary policy and financial stability during a discussion moderated by <a href=\"https://mitsloan.mit.edu/faculty/directory/kristin-j-forbes\">Kristin Forbes</a>. Panelists spoke on the importance of collecting more market data and strengthening the regulation around nonbank financial intermediaries. Some panelists talked about their past experiences dealing with episodes of financial instability in both advanced and emerging market economies. Recent events exemplified by U.K. bond market volatility and central bank intervention highlighted the importance of taking financial stability risks into account for monetary policy.</p>\n\n\n\n<h4><strong>Monetary Policy and Household Balance Sheet Risk</strong></h4>\n\n\n\n<p>Low and stable interest rates in recent years have been accompanied by an increase in the share of aggregate household debt to income in many jurisdictions, which is often a precursor to economic and financial downturns. One possible policy response is to tighten monetary policy, which would reduce household demand for borrowing all else the same. But this policy may also be accompanied by lower household income growth and hence some increase in borrowing to meet cash flow needs.</p>\n\n\n\n<p>Magnus Gulbrandsen’s paper “<a href=\"https://www.newyorkfed.org/medialibrary/media/research/conference/2022/financial-stability/fagerenggulbrandsenholmnatvik_mpdebt_nyfed_september2022.pdf?la=en\">How Does Monetary Policy Affect Household Indebtedness?</a>” (joint with Andreas Fagereng, Martin Holm, and Gisle Natvik) leverages novel administrative microdata from Norway to decompose how household total debt to income is affected by monetary policy shocks. The authors find that a one percentage point (unexpected) increase in the policy rate is associated with a decline of 1–3&nbsp;percentage points in total debt to income. However, when sorting households by total debt to income, the relationship is muted for more financially vulnerable households with greater income risk and higher debt burdens.</p>\n\n\n\n<h4><strong>Monetary Transmission Differs across Banks, Nonbanks</strong></h4>\n\n\n\n<p>It has been observed that the nonbank share of lending in many segments rivals that of banks. An important policy question is whether institutional differences across lenders have implications for monetary transmission. David Elliott presented his paper “<a href=\"https://www.newyorkfed.org/medialibrary/media/research/conference/2022/financial-stability/nyfedpresentation_peydro.pdf?la=en\">Nonbanks, Banks, and Monetary Policy: U.S. Loan-Level Evidence since the 1990s</a>” (joint with Ralf Meisenzahl, José-Luis Peydró, and Bryce Turner) describing the nonbank channel of monetary policy in three market segments: syndicated corporate loans, automobile loans, and residential mortgages. The authors find that higher policy rates shift credit supply from banks to nonbanks, thereby largely neutralizing the effects on consumption and investment. Higher policy rates also increase risk-taking in all three settings as nonbanks expand credit supply to riskier borrowers.</p>\n\n\n\n<h4><strong>Considering Alternative Policy Tools</strong></h4>\n\n\n\n<p>Since the global financial crisis, many jurisdictions have adopted macroprudential policies, such as loan-to-value or debt-to-income limits on borrowing, to tighten financial conditions and enhance financial sector resilience. Gaston Gelos presented the final paper of the day, “<a href=\"https://www.newyorkfed.org/medialibrary/media/research/conference/2022/financial-stability/gelos%20cepr-dp15693_latw.pdf?la=en\">Leaning against the Wind: An Empirical Cost-Benefit Analysis</a>,” coauthored with Luis Brandão-Marques, Machiko Narita, and Erlend Nier. The paper explores the most effective policy tools to respond to financial stability using data on financial conditions, economic growth, and policy measures for thirty-seven countries. They find that macroprudential policies can be beneficial to the economy by reducing downside risk to growth. However, tightening monetary policy to counter loose financial conditions appears to increase such risk.</p>\n\n\n\n<p>New York Fed President John C. Williams closed the conference, describing the previous Federal Reserve work on this topic, which studied the <a href=\"https://www.newyorkfed.org/research/staff_reports/sr1002\">theoretical</a> and <a href=\"https://www.newyorkfed.org/research/staff_reports/sr1003\">empirical</a> literature addressing the connection between vulnerabilities in the financial system and the macroeconomy, and how monetary policy affects that connection.&nbsp;He also noted the ongoing importance of the questions addressed in the current economic environment.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/03/akinci_ozge.jpg?w=90\" alt=\"Photo: portrait of Ozge Akinci\" class=\"wp-image-15157 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/03/akinci_ozge.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/03/akinci_ozge.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/akinci\" target=\"_blank\">Ozge Akinci</a> is a research economist in International Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<p></p>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"500\" height=\"541\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/frame_scott.jpg?w=266\" alt=\"\" class=\"wp-image-18902 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/frame_scott.jpg 500w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/frame_scott.jpg?resize=460,498 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/10/frame_scott.jpg?resize=266,288 266w\" sizes=\"(max-width: 500px) 100vw, 500px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact\">Scott Frame is a vice president in the Research Department of the Federal Reserve Bank of Dallas.</p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/kovner_anna.jpg\" alt=\"Photo: portrait of Anna Kovner\" class=\"wp-image-16629 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/kovner_anna.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/kovner_anna.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a href=\"https://www.newyorkfed.org/research/economists/kovner\">Anna Kovner</a>&nbsp;is the director of Financial Stability Policy Research in the Bank’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-disclaimer\">\n    <strong>How to cite this post:</strong><br/>\n    Ozge Akinci, Scott Frame, and Anna Kovner, &#8220;Federal Reserve System Conference on the Financial Stability Considerations for Monetary Policy,&#8221; Federal Reserve Bank of New York <em>Liberty Street Economics</em>, October 21, 2022, https://libertystreeteconomics.newyorkfed.org/2022/10/federal-reserve-system-conference-on-the-financial-stability-considerations-for-monetary-policy/.</p>\n</p>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://www.newyorkfed.org/research/staff_reports/sr946\">The Financial (In)Stability Real Interest Rate, R**</a><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2018/04/vulnerable-growth/\">Vulnerable Growth</a><br><a href=\"https://www.newyorkfed.org/research/staff_reports/sr1002\">Financial Stability Considerations for Monetary Policy: Theoretical Mechanisms</a><br><a href=\"https://www.newyorkfed.org/research/staff_reports/sr1003\">Financial Stability Considerations for Monetary Policy: Empirical Evidence and Challenges</a></p>\n\n\n\n<div>\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n</div>\n",
  "thr:total": 1
}