{
  "id": "tag:theatlantic.com,2020:39-616925",
  "content": "<p class=\"dropcap\">W<span class=\"smallcaps\">e knew </span>the doors were about to open when “Ride of the Valkyries” began to boom over the public-address system. By 4 a.m. on Black Friday in Athens, Georgia, several hundred people had lined up outside Best Buy in the predawn chill, supervised by police straddling motorcycles and ambassadors from a local Chick-fil-A handing out free breakfast biscuits wrapped in foil. Our most dedicated patrons had been sitting outside in folding chairs since the day before.</p><p>At the front of the line, some people clutched sheets of paper handed out by managers guaranteeing a deeply discounted laptop or camera. (Best Buy devised this ticketing system during my tenure as a salesperson in the mid-2000s to avoid the sort of stampede that makes the news every year.) But many more people had come out in the middle of the night, not to buy a particular product, but to bear witness to the bacchanal of extreme shopping itself and maybe pick up a $5 DVD. I’m still not sure whether, <a href=\"https://www.youtube.com/watch?v=30QzJKCUekQ\">in the <i>Apocalypse Now</i> scene</a> that “Ride of the Valkyries” was intended to evoke, the store’s employees were supposed to be the soldiers in helicopters or the Vietnamese villagers below.</p><p>There were no near-death experiences during the three years that I helped open Best Buy on Black Friday, even if the occasional shopper was overcome with holiday spirit and tackled a palletful of discounted Blu-ray players. The mornings were busy, but they crackled with a mildly perverse consumerist conviviality. For most of the people who thronged the store, the wee-hours shopping trip was as much a part of their Thanksgiving tradition as turkey. Store employees feasted, too—it was the one day of the year when my Best Buy location acknowledged how backbreaking retail work is, stocking our break room with a free lunch of fried chicken and macaroni and cheese. My co-workers and I jockeyed for those opening shifts because the eight hours always flew by—a wild reprieve from the everyday monotony for employees and even shoppers. It was a frankenholiday, pieced together from leftover parts of Thanksgiving and Christmas, but with a life of its own.</p><p>Despite ages of hand-wringing from both ends of the political spectrum—either the annual carnival of consumerism is obscene and wasteful, or gifts shouldn’t supplant Jesus as the reason for the season—holiday shopping has metastasized. <i>Black Friday</i> is now more of <a href=\"https://www.nytimes.com/2019/11/27/style/black-friday-has-no-meaning.html\">a euphemism for weeks of pre-Thanksgiving sales</a> than a reference to a fixed moment in time. Every year, it seems to get bigger, as do the gestures of those pushing against it. Nordstrom, for one, has used its store windows in the weeks before Thanksgiving to <a href=\"https://abcnews.go.com/Lifestyle/nordstrom-praised-social-media-shunning-christmas-creep/story?id=35099108#:~:text=The%20company%20decorates%20for%20the%20holidays%20on%20Nov.&amp;text=The%20company%20has%20announced%20that,for%20Christmas%20until%20after%20Thanksgiving.&amp;text=%E2%80%94%20%2D%2D%20Nordstrom%20is%20bucking%20retail,(the%20Friday%20after%20Thanksgiving).\">promise shoppers it won’t jump the gun on Christmas decorations</a>, while the big-box stores have begun opening on Thanksgiving itself, cannibalizing the holiday that once formed Black Friday’s pretext. (Amid this year’s pandemic, Best Buy has joined other major retailers in announcing that it will be closed on Thanksgiving.)</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2020/11/fluffing-your-own-nest/616469/?utm_source=feed\">From the November 2020 issue: Why Americans have turned to nesting</a>]</i></p><p>This is where, in this year of all years, I should solemnly intone that things will be—will <i>have</i> <i>to</i> be—different. So much about holiday shopping seems impossible, or at least ill-advised: the crowds, the exorbitant expenditures, the elderly mall Santas greeting an endless stream of stuffy-nosed children. Retail and delivery workers have already been pushed past the breaking point in their “essential” jobs, and shipping delays and inventory shortages have dogged stores since March. If any of the hand-wringers really wanted to sever Christmas from consumerism, now would be the time. But the Ghost of Christmas Past has much to tell us about what we should expect this year, and shopping isn’t going anywhere.</p><p class=\"dropcap\"><span class=\"smallcaps\">People often identify </span>holiday profligacy as a modern problem, hastened by malls and chain stores and online shopping. But the history of indulgent celebrations and the scolds trying to end them is the history of civilization itself. Russell Belk, a researcher who studies consumer culture at York University, in Ontario, dates the fight over Christmas waste all the way back to the ancient Roman holiday of Saturnalia, a days-long December feast and the predecessor of Christmas. “There were complaints at the time that it was too materialistic, that people were hosting banquets for their friends and spending lavish amounts of money and they shouldn’t be doing that,” he told me.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>For American and British Christmas in particular, another set of scolds helped get us into this shopping mess in the first place. Before the Victorian era, the Christmas season was considered a time not so much to exchange gifts but to eat, drink, and be merry, “a little like Mardi Gras,” says Leigh Eric Schmidt, a historian of American religion and the author of <i>Consumer Rites: The Buying and Selling of American Holidays</i>. Those celebrations were beloved by working people, who got a break between Christmas and New Year’s from the informal subsistence labor that characterized their agrarian lifestyle.</p><p>But in the newly industrialized cities of the late 19th century, the drunken, leisurely December holidays began to change. “Once some of those traditions are in more urban settings, where there’s a more discernible working class, they’re increasingly seen by the middle class and elites as more dangerous and destructive,” Schmidt told me. The interests of business and religious leaders aligned, and they endeavored to recast the winter holiday as pious and family-centric, revolving around the home instead of the tavern. They also pushed to shorten the holiday break—more Americans now had bosses, and those bosses wanted them back at work.</p><p>The rebranding of Christmas was an unmitigated success. And in turn, the holiday that the capitalist and merchant classes once deemed a threat to productivity had become “an incredible opportunity to promote consumption” of newly available mass-market goods, Schmidt said. Department stores also stoked demand, decorating their windows to make them destinations unto themselves. Macy’s and Marshall Field’s and Saks became temples for a new kind of religious observance: buying, buying, buying to fulfill the promise of Christmas.</p><p class=\"dropcap\"><span class=\"smallcaps\">In America, </span>the<span class=\"smallcaps\"> </span>economic, the religious, and the patriotic can’t be easily separated. Dell deChant, a religion professor at the University of South Florida and the author of <i>The Sacred Santa: Religious Dimensions of Consumer Culture</i>, calls Christmas “a huge ritual celebration honoring the economy and feeding the economy.” God, country, and cash are particularly tightly entwined during a year when America’s leaders can’t stop telling us that keeping the economy humming is our sacred duty.</p><p>Even in normal times, Christmas is essential to that effort—the moniker “Black Friday” has murky origins, but it stuck around to mark the day when consumer spending is said to finally push American retailers to annual profitability, or “into the black.” (Whether this actually happens is highly debatable.) During the Great Depression, arguably a time similar to our own, President Franklin D. Roosevelt went so far as to move the date of Thanksgiving by a full week to lengthen the shopping season.</p><p>Granted, certain aspects of Christmas won’t be the same in 2020. Many of us won’t be able to travel great distances to visit our families, and older relatives might not be able to see much of anyone at all. Two hundred thousand people and counting are gone, and millions of others have lost the income that funds bounteous celebrations. Still, deChant believes that the drive to create as much of the old Christmas feeling as possible will likely be strong.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2020/09/how-america-can-survive-the-winter/616401/?utm_source=feed\">Read: How we survive the winter</a>]</i></p><p>“Christmas is a great normalizing experience—it’s powerful in terms of our personal and cultural identity,” he says. “If we’re not able to consume, then, to a certain extent, we’re marginalized—within the culture, as well as in our own minds.” For many Americans who don’t celebrate Christmas, sitting out the foofaraw while the whole country conducts Christmas consumption is an annual dose of alienation. For people who normally participate but suddenly find themselves unable to do so, the sense of detachment might even be more piercing for its novelty. Buying not just gifts, but decorations, sweets, and the trappings of a Christmas feast are deeply entrenched customs, and many Americans will want to hang on to those rituals in a world where so much else has been disrupted. For some, keeping Christmas, as a transformed Scrooge put it, will feel profoundly comforting. For others, the wish to do Christmas right will be tinged with defiance. Think we can’t buy gifts galore and decorate like busy little elves straight through a disaster? Think again.</p><hr><p><small><em>This article appears in the December 2020 print edition with the headline “There’s No Stopping Santa.”</em></small></p>",
  "author": {
    "name": "Amanda Mull",
    "uri": "http://www.theatlantic.com/author/amanda-mull/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Asia Pietrzyk"
  },
  "title": "Christmas Dies Hard",
  "published": "2020-11-23T07:00:00-05:00",
  "updated": "2020-11-23T10:18:44-05:00",
  "summary": "The middle of a global pandemic might seem like a good time to cut back on holiday excess. But we live in America.",
  "link": ""
}