{
  "id": "yt:video:3EMOgOhw4A0",
  "yt:videoId": "3EMOgOhw4A0",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "Why this football pass seems physically impossible",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-10-12T16:15:30+00:00",
  "updated": "2022-10-13T15:13:08+00:00",
  "media:group": {
    "media:title": "Why this football pass seems physically impossible",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The way a football moves through the air is almost paradoxical.\n\nSubscribe and turn on notifications 🔔 so you don't miss any videos: http://goo.gl/0bsAjO \n\nWhen a football player throws a tight spiral pass, the ball glides through the air in a smooth arc, its nose pointing up toward the sky at the beginning of the toss, and then dropping down toward the earth as it lands in the receiver's hands.\n\nThe spiral pass is so familiar it’s easily overlooked as just being common sense — but it took physicists nearly 20 years to understand this trajectory.\n\nConservation of angular momentum suggests that the ball should not act this way. It should either keep its nose angled toward the sky the whole time or the ball should be flipping over itself as it moves through the air; but the fact that it just tips over elegantly is — to use a scientific term — weird as hell. \n\nBut it turns out the solution is easy enough to understand — as long as you have a spinning top.\n\nMake sure you never miss behind-the-scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}