{
  "title": "S1E51 - Connecting Sport, Faith and Life with Dr. Chad Carlson and Dr. Brian Bolt",
  "guid": "https://pinecast.com/guid/22b2374b-a5f5-4739-91d1-cfcf9948c852",
  "pubDate": "Tue, 03 Aug 2021 06:30:00 -0000",
  "itunes:duration": "00:55:16",
  "description": "<p>Joining Laura on the podcast this week are Dr. Chad Carlson and Dr. Brian Bolt, two guys from rival schools who came together with a common purpose: to think deeply about sport and faith. They both grew up as competitive athletes and are now coaches and sports scholars, Brian as the Dean of Education at Calvin University, and Chad as a Professor and Director of General Education at Hope College. They have also teamed up to create the ‘Sport. Faith. Life.’ podcast which they describe as ‘a conversation that meets at the intersection of sport and faith’. After hosting the 2nd Global Congress on Sport and Christianity at Calvin University in October 2019, our two guests made a commitment to continue to explore the athletic world through the lens of Christianity, and that is precisely what they do hear today.</p>\n<p>In today’s episode, Chad and Brian discuss the connection between sports and faith., concepts like forgiveness, and how sports can become a part of one’s identity. Together, they also delve into viewing sports as a form of play, how not everybody is drawn to the idea of competition, and how sports must be enjoyed at the moment. They conclude by exploring athletes’ mental health and the sense of loss they feel after certain events such as the Olympics, and by discussing how to view sports as a separate space from other things in life. Filled with ideas regarding how to lead with grace, call for truth, and be a light on a very diverse team, today’s conversation is enlightening, informative, and, above all, one you do not want to miss.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Competition in sports: the good side and the bad side</li>\n<li>Comparisons that people make while playing sports</li>\n<li>Sports and their impact on one’s identity</li>\n<li>How human beings are meant to be playful</li>\n<li>Forgiveness and the concept of a community</li>\n<li>Selfishness in sports and attributions people make for their successes or failures</li>\n<li>Mental health and sports</li>\n<li>Redemption in sports</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>‘‘And we see this, especially those who are in Olympic sports, where, you know, it’s not like you play Major League Baseball, where if you don’t do well, one day, you get a chance to the next day, right?”</li>\n<li>“And what’s so interesting about athletes or successful people in some ways is that they attribute failure to things outside themselves.’’</li>\n<li>“And so, from a faith perspective, I think it’s a reminder to us that when we watch our heroes, we’re watching real people with skin and flesh and people who are dealing with real everyday issues. That’s important for us to remember in the midst of our heroism - the way in which we worship athletes at times, for sure.’’</li>\n<li>“And then we also need to take a step back with someone we trust - a coach, a teammate, somebody - and logically look at what happened without the emotion and learn from it instead of just blaming all the time. Because I’ve had teammates who blame judges, who blame this, that, and the other all the time.’’</li>\n<li>“If you use your energy to fix what you're doing wrong, instead of blaming other people, you might actually be a better athlete.”</li>\n<li>“There are experiences that we have on Earth, that may be glimpses of Heaven, and when we're at play, we're doing something because the joy of it is in the doing. We're experiencing that Kingdom at hand.”</li>\n<li>“I have parents that ask me all the time, like, ‘How can I make my kid more passionate?’ and, like, you’ve just got to let them fail. Like, if he fails and he wants to keep going, like, he’ll find the passion.’’</li>\n</ul>\n<p>Show Links\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>             \n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \nConnect with Brian and Chad:\n<a href=\"https://sportfaithlife.com/podcastblog/\" rel=\"nofollow\">Sport. Faith. Life. Homepage</a></p>",
  "itunes:title": "Connecting Sport, Faith and Life with Dr. Chad Carlson and Dr. Brian Bolt",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 51
}