{
  "title": "#460: Loony Lockhart (OOTP 23, Christmas on the Closed Ward)",
  "link": "https://audioboom.com/posts/7549552",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5447,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Quizzitch Live: The Fandom of Secrets returns this Thursday, April 9 at 7:15 p.m. ET! Keep an eye on our social media channels for the link to participate!</li>\n<li>J.K. Rowling offers up a <a href=\"https://openpsychometrics.org/tests/characters/\">Character Personality quiz</a> on Twitter! The hosts share which Harry Potter character they are most like... and the answers may surprise you!</li>\n<li>News covers <a href=\"https://www.wizardingworld.com/collections/harry-potter-at-home\">Harry Potter at Home</a>, The Tales of Beedle The Bard audiobook release and the LEGO Harry Potter video game for only $6!</li>\n<li>Muggle Mail covers Harry's relationship with Mad-Eye Moody, Nagini and Dumbledore's past, a maternity ward at St. Mungo's and <a href=\"https://archiveofourown.org/works/7809337\">Harriet Potter</a>\n</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 23: Christmas on The Closed Ward</li>\n<li>7-Word Summary: Harry heads to see Arthur in recovery </li>\n<li>We Connect the Threads to... Chamber of Secrets?!?!</li>\n<li>Possession by Voldemort, the importance of house elves and Professor Lockhart</li>\n<li>Horcrux Takeover on the London Underground!</li>\n<li>Harry's having a nervous breakdown! Can someone HELP HIM?</li>\n<li>Odd that Dumbledore has a direct line to Harry’s bedroom at Grimmauld Place?</li>\n<li>Why doesn't Harry think of consulting Ginny earlier about being possessed by Voldemort? Did they two bond over this shared experience in later years?</li>\n<li>Opening presents in your bedroom? What's up with Christmas at Grimmauld Place?</li>\n<li>Harry makes an important observation about Kreacher. Should Sirius be more concerned he's \"missing\"?</li>\n<li>Welcome back Gildeory Lockhart! Do we think the former DADA professor ever recovers from his condition?</li>\n<li>Goodnight Broderick! Is there no screening presents at St. Mungo's? How is a venomous tentacula safe to put next to a patient's bedside?</li>\n<li>Hey, Augusta!  We compare grandma Longbottom's evaluation of the trio to that of Lucius Malfoy's from Chamber of Secrets!</li>\n<li>Bubblegum wrapper theory galore!</li>\n<li>The big Bellatrix reveal! Somebody better really check on Kreacher now...</li>\n<li>The Umbridge Suck Count climbs to 50!</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Chicken Soup For The MuggleCast Soul returns!</li>\n<li>Quizzitch: Who teases Harry about taking remedial potions?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 07 Apr 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-04-06:/posts/7549552",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}