{
  "title": "Comparison of Matsubara dynamics with exact quantum dynamics for an oscillator coupled to a dissipative bath. (arXiv:2211.02042v1 [physics.chem-ph])",
  "link": "http://arxiv.org/abs/2211.02042",
  "description": "<p>Matsubara dynamics is the classical dynamics which results when\nimaginary-time path-integrals are smoothed; it conserves the quantum Boltzmann\ndistribution and appears in drastically approximated form in path-integral\ndynamics methods such as (thermostatted) ring-polymer molecular dynamics\n(T)RPMD and centroid molecular dynamics (CMD). However, it has never been\ncompared directly with exact quantum dynamics for non-linear operators, because\nthe difficulty of treating the phase has limited the number of Matsubara modes\nto fewer than ten. Here, we include up to 100 Matsubara modes in simulations of\na Morse oscillator coupled to a dissipative bath of harmonic oscillators. The\ntrick is to analytically continue the momentum and to make a small\napproximation to the bath part of the resulting ring-polymer distribution (by\nneglecting correlations between Matsubara modes of opposite sign). The\nnumerical stability of the resulting Matsubara dynamics simulations increases\nwith bath strength and decreases with system anharmonicity. The dynamics of the\nMatsubara `tail' (of highly oscillatory modes needed to converge the quantum\nBoltzmann statistics) is found to be harmonic, and can thus be computed\nefficiently. For a moderately anharmonic oscillator with a strong but\nsubcritical coupling to the bath, the Matsubara simulations yield non-linear\n$\\large\\langle{\\hat q^2\\hat q^2(t)}\\large\\rangle$ time-correlation functions in\nalmost perfect agreement with the exact quantum results (computed using\nhierarchical equations of motion). Reasonable agreement is also obtained for\nweaker coupling strengths, where errors arise because of numerical instability\nand real-time quantum coherence. These results give strong evidence that\nMatsubara dynamics correctly explains how classical dynamics arises in quantum\nsystems which are in thermal equilibrium.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Prada_A/0/1/0/all/0/1\">Adam Prada</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Pos_E/0/1/0/all/0/1\">Eszter S. P&#xf3;s</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Althorpe_S/0/1/0/all/0/1\">Stuart C. Althorpe</a>"
}