{
  "guid": "prx_326_6e17899c-dcf1-4e03-9ca6-3331330d4605",
  "title": "Why Are Cactuses Spiky?",
  "pubDate": "Fri, 29 Jan 2021 21:22:25 -0000",
  "link": "https://www.vpr.org/post/why-are-cactuses-spiky",
  "description": "<p>What makes a cactus a cactus? And what are you supposed to call a group of these plants--cacti, cactuses, or cactus?! We'll find out in today's episode, as we learn more about the cactus family with Kimberlie McCue of the <a href=\"https://dbg.org/\" rel=\"nofollow\" target=\"_blank\">Desert Botanical Garden</a> in Phoenix, Arizona. She'll answer kid questions about why cactuses are spiky and how they got those spikes, as well as why teddy bear cactuses aren't actually cuddly!</p>\n\n<p><em>Download our learning Guides: <a href=\"https://www.vpr.org/sites/vpr/files/202102/why_are_cactuses_spiky_.pdf\" rel=\"nofollow\" target=\"_blank\">PDF</a> | <a href=\"https://docs.google.com/presentation/d/1Y4OpkeUjeWThYsQtrIGib0RNWusGCg-xuFnX42VrGro/copy\" rel=\"nofollow\" target=\"_blank\">Google Slide</a> | <a href=\"https://www.vpr.org/sites/vpr/files/202102/but_why_145-cactus-transcript.pdf\" rel=\"nofollow\" target=\"_blank\">Transcript</a></em></p>\n\n<p>Those prickly spines that are so characteristic of the cactus family are actually modified leaves! Cactuses don't have the kind of leaves like a maple or oak tree. But they might have had leaves that were at least a little more like that way way back in the past. Over time, those leaves evolved into the spiky spines we see on cactuses today because they help the plants survive in hot, dry environments.</p>\n\n<blockquote>\n<p>Why are cactuses spiky? -Noah, Iowa</p>\n</blockquote>\n\n<p>\"They can be a defense mechanism to discourage herbivores - animals that eat plants - from eating the cactus. But, also, spines create shade!\" explains Kimberlie McCue.<br>\n<br>\n\"When you're covered in spines, as the sun moves across the sky, those spines are casting shadows on the body of the cactus. They're little shade umbrellas!\"<br>\n<br>\nAll cactuses are native to desert environments, and some live in places where it never rains at all. So how do they get water to survive? Well, Kimberlie tells us that these plants grow not too far from the ocean.</p>\n\n<p>\"Early in the morning, there will be fog that comes off the water. Those spines provide a place for the water to condense, form little droplets of water that run down the spine, to the body of the plant, down to the ground and to the roots.\"<br>\n<br>\nCactuses are also extremely important parts of their desert environments, as they hold soil in place and provide shelter for birds and other animals. Those insects and birds in turn help pollinate the cactus flowers. Cactuses are also an important local food source for humans.<br>\n<br>\nUnfortunately, cactuses are in danger from people who poach (illegally take) wild plants from their environment. Kimberlie McCue says one way to help make sure cacti stay healthy and plentiful is to be careful when you buy cactus plants. Check to see where the plant seller got the cactus and make sure they're taking care to be ethical stewards of these plants before you buy.</p>",
  "enclosure": "",
  "itunes:subtitle": "What makes a cactus a cactus? And what are you supposed to call a group of these plants--cacti, cactuses, or cactus?! We'll find out in today's episode, as we learn more about the cactus family with Kimberlie McCue of the Desert Botanical Garden in Phoenix, Arizona.",
  "itunes:episodeType": "full",
  "itunes:episode": 145,
  "itunes:duration": "30:35",
  "author": "questions@butwhykids.org (Vermont Public)",
  "itunes:author": "Vermont Public",
  "itunes:summary": "What makes a cactus a cactus? And what are you supposed to call a group of these plants--cacti, cactuses, or cactus?! We'll find out in today's episode, as we learn more about the cactus family with Kimberlie McCue of the <a href=\"https://dbg.org/\">Desert Botanical Garden</a> in Phoenix, Arizona. She'll answer kid questions about why cacti are spiky and how they got those spikes, as well as why teddy bear cacti aren't actually cuddly! Those prickly spines that are so characteristic of the cactus family are actually modified leaves! Cacti don't have the kind of leaves like a maple or oak tree. But they might have had leaves that were at least a little more like that way way back in the past. Over time, those leaves evolved into the spiky spines we see on cactuses today because they help the plants survive in hot, dry environments. Why are cactuses spiky? -Noah, Iowa \"They can be a defense mechanism to discourage herbivores - animals that eat plants - from eating the cactus. But, also, spines create shade!\" explains Kimberlie McCue. \"When you're covered in spines, as the sun moves across the sky, those spines are casting shadows on the body of the cactus. They're little shade umbrellas!\" All cacti are native to desert environments, and some live in places where it never rains at all. So how do they get water to survive? Well, Kimberlie tells us that these plants grow not too far from the ocean. \"Early in the morning, there will be fog that comes off the water. Those spines provide a place for the water to condense, form little droplets of water that run down the spine, to the body of the plant, down to the ground and to the roots.\" Cacti are also extremely important parts of their desert environments, as they hold soil in place and provide shelter for birds and other animals. Those insects and birds in turn help pollinate the cactus flowers. Cacti are also an important local food source for humans. Unfortunately, cacti are in danger from people who poach (illegally take) wild plants from their environment. Kimberlie McCue says one way to help make sure cacti stay healthy and plentiful is to be careful when you buy cactus plants. Check to see where the plant seller got the cactus and make sure they're taking care to be ethical stewards of these plants before you buy.",
  "itunes:image": "",
  "media:content": "",
  "content:encoded": "\n        <p>What makes a cactus a cactus? And what are you supposed to call a group of these plants--cacti, cactuses, or cactus?! We'll find out in today's episode, as we learn more about the cactus family with Kimberlie McCue of the <a href=\"https://dbg.org/\" rel=\"nofollow\" target=\"_blank\">Desert Botanical Garden</a> in Phoenix, Arizona. She'll answer kid questions about why cactuses are spiky and how they got those spikes, as well as why teddy bear cactuses aren't actually cuddly!</p>\n\n<p><em>Download our learning Guides: <a href=\"https://www.vpr.org/sites/vpr/files/202102/why_are_cactuses_spiky_.pdf\" rel=\"nofollow\" target=\"_blank\">PDF</a> | <a href=\"https://docs.google.com/presentation/d/1Y4OpkeUjeWThYsQtrIGib0RNWusGCg-xuFnX42VrGro/copy\" rel=\"nofollow\" target=\"_blank\">Google Slide</a> | <a href=\"https://www.vpr.org/sites/vpr/files/202102/but_why_145-cactus-transcript.pdf\" rel=\"nofollow\" target=\"_blank\">Transcript</a></em></p>\n\n<p>Those prickly spines that are so characteristic of the cactus family are actually modified leaves! Cactuses don't have the kind of leaves like a maple or oak tree. But they might have had leaves that were at least a little more like that way way back in the past. Over time, those leaves evolved into the spiky spines we see on cactuses today because they help the plants survive in hot, dry environments.</p>\n\n<blockquote>\n<p>Why are cactuses spiky? -Noah, Iowa</p>\n</blockquote>\n\n<p>\"They can be a defense mechanism to discourage herbivores - animals that eat plants - from eating the cactus. But, also, spines create shade!\" explains Kimberlie McCue.<br>\n<br>\n\"When you're covered in spines, as the sun moves across the sky, those spines are casting shadows on the body of the cactus. They're little shade umbrellas!\"<br>\n<br>\nAll cactuses are native to desert environments, and some live in places where it never rains at all. So how do they get water to survive? Well, Kimberlie tells us that these plants grow not too far from the ocean.</p>\n\n<p>\"Early in the morning, there will be fog that comes off the water. Those spines provide a place for the water to condense, form little droplets of water that run down the spine, to the body of the plant, down to the ground and to the roots.\"<br>\n<br>\nCactuses are also extremely important parts of their desert environments, as they hold soil in place and provide shelter for birds and other animals. Those insects and birds in turn help pollinate the cactus flowers. Cactuses are also an important local food source for humans.<br>\n<br>\nUnfortunately, cactuses are in danger from people who poach (illegally take) wild plants from their environment. Kimberlie McCue says one way to help make sure cacti stay healthy and plentiful is to be careful when you buy cactus plants. Check to see where the plant seller got the cactus and make sure they're taking care to be ethical stewards of these plants before you buy.</p>\n      ",
  "itunes:explicit": "no",
  "itunes:keywords": "Science, Nature, Language",
  "dc:creator": "Vermont Public Radio"
}