{
  "title": "Spatiotemporal Calibration of 3D mm-Wavelength Radar-Camera Pairs. (arXiv:2211.01871v1 [cs.RO])",
  "link": "http://arxiv.org/abs/2211.01871",
  "description": "<p>Autonomous vehicles (AVs) often depend on multiple sensors and sensing\nmodalities to mitigate data degradation and provide a measure of robustness\nwhen operating in adverse conditions. Radars and cameras are a popular sensor\ncombination - although radar measurements are sparse in comparison to camera\nimages, radar scans are able to penetrate fog, rain, and snow. Data from both\nsensors are typically fused in a common reference frame prior to use in\ndownstream perception tasks. However, accurate sensor fusion depends upon\nknowledge of the spatial transform between the sensors and any temporal\nmisalignment that exists in their measurement times. During the life cycle of\nan AV, these calibration parameters may change. The ability to perform in-situ\nspatiotemporal calibration is essential to ensure reliable long-term operation.\nState-of-the-art 3D radar-camera spatiotemporal calibration algorithms require\nbespoke calibration targets, which are not readily available in the field. In\nthis paper, we describe an algorithm for targetless spatiotemporal calibration\nthat is able to operate without specialized infrastructure. Our approach\nleverages the ability of the radar unit to measure its own ego-velocity\nrelative to a fixed external reference frame. We analyze the identifiability of\nthe spatiotemporal calibration problem and determine the motions necessary for\ncalibration. Through a series of simulation studies, we characterize the\nsensitivity of our algorithm to measurement noise. Finally, we demonstrate\naccurate calibration for three real-world systems, including a handheld sensor\nrig and a vehicle-mounted sensor array. Our results show that we are able to\nmatch the performance of an existing, target-based method, while calibrating in\narbitrary (infrastructure-free) environments.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Wise_E/0/1/0/all/0/1\">Emmett Wise</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cheng_Q/0/1/0/all/0/1\">Qilong Cheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kelly_J/0/1/0/all/0/1\">Jonathan Kelly</a>"
}