{
  "title": "Visiting The Grave | Best of RGSO",
  "link": "https://audioboom.com/posts/8153906",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2130,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What kind of messages does one listener get from beyond the grave after visiting a very specific gravesite?<br>\n<br>\nHere is a preview of the story.<br>\n<br>\n“The week after visiting his grave, back home, I got a lift somewhere from a friend. This friend never stops talking, so it was odd when he was suddenly interested in the radio, particularly the voice of the commentator, and turned up the volume. They introduced a song called \"Lay Some Flowers on my Grave\" by Blind Willie Motel.... a blues song from the '30s that I'm sure does not get much airplay on a major radio station. The lyrics gave me goosebumps and a feeling of acknowledgment. Then, on the way home, still thinking about the song, I walked past a parked car with the most unlikely items dangling from its mirror. A skeleton. And a daffodil. He appeared in my dream shortly after. We were back in the mountains but walking in opposite directions. He with a friend who is still alive, walking and talking together, and me, on my own. “<br>\n<br>\nTo hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com/\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a>\n</div>\n",
  "pubDate": "Thu, 08 Sep 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-08:/posts/8153906",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}