{
  "title": "Scholz’s trip to China doesn’t mean he’s grown a backbone against US pressure",
  "link": "https://www.rt.com/news/565950-scholz-china-us-pressure/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565950-scholz-china-us-pressure/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636511c820302721e25609fc.jpg\" /> German Chancellor Olaf Scholz’s trip to China is not an indication of him standing up to US domination <br/><a href=\"https://www.rt.com/news/565950-scholz-china-us-pressure/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The German chancellor says he doesn’t want to ‘decouple’ from Beijing, but still sees no problem with Washington calling the shots</strong></p>\n            \n                        \n            <p>Defending his trip to China this week, German Chancellor Olaf Scholz <a href=\"https://www.politico.eu/article/olaf-scholz-we-dont-want-to-decouple-from-china-but-cant-be-overreliant/\" target=\"_blank\" rel=\"noopener noreferrer\">said</a> that he doesn&rsquo;t want&nbsp;his country to <em>&ldquo;decouple&rdquo;</em> from Beijing.&nbsp;On the other hand, there&rsquo;s evidence that Berlin, like other Western allies, is facing mounting pressure from Washington to fall in line.</p>\n<p>While Scholz is in China proclaiming the importance of trade with Beijing as the German economy suffers from the EU sanctioning gas supplies from Russia, he&rsquo;s also warning against over-reliance on China. What about being dictated to by Washington, though? Anything about that being a problem?</p>\n<p>Right before Scholz set off on his trip, his foreign minister, Annalena Baerbock, qualified China as an inevitable partner in a globalized world, but also <a href=\"https://www.politico.eu/article/germanys-baerbock-warns-scholz-ahead-of-his-china-trip/\" target=\"_blank\" rel=\"noopener noreferrer\">told</a> Der Spiegel that Beijing was <em>&ldquo;a competitor and increasingly a systemic rival.&rdquo;</em>&nbsp;The same could be said of Washington, having encouraged the European Union to sanction itself into economic turmoil in the interests of sticking it to Russian President Vladimir Putin over Ukraine. Oddly, no word from Baerbock about the need to maintain adequate independence from the US, as it swoops in to replace the EU&rsquo;s Russian gas supply with American freedom molecules at two to four times the price of sale on the domestic US market, though.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63649a0c85f54038525f5c98.jpg\" alt=\"Taiwanese President Tsai Ing-wen (c) meets with lawmakers from several European countries, in Taipei, Taiwan, November 3, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565931-china-european-visit-taiwan/\">China blasts latest European visit to Taiwan</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>It&rsquo;s not like Scholz isn&rsquo;t aware of the headache that the US is giving Europe as US President Joe Biden&rsquo;s administration pulls out all the stops in light of a looming recession. Scholz even met recently with French President Emmanuel Macron&nbsp;in Paris to discuss the need for both leaders to <a href=\"https://www.politico.eu/article/france-and-germany-find-ground-on-a-common-concern-u-s-protectionism\" target=\"_blank\" rel=\"noopener noreferrer\">counter US protectionism</a> and the unfair tilting of the global playing field through corporate tax and energy incentives at a time when European industry is struggling with crushing energy costs.</p>\n<p>Scholz also faces <a href=\"https://www.ft.com/content/a14c4ae4-c513-46c1-b427-23a5e046703b\" target=\"_blank\" rel=\"noopener noreferrer\">internal pressure</a> from Macron to stop shoveling hundreds of billions of euros in government aid to German companies at the risk of distorting the EU market.</p>\n<p>But behind the photo-ops with Macron and light public posturing, the reality with respect to how much pushing and shoving Berlin is willing to tolerate from Washington seems much different.</p>\n<p>Last month, China secured a stake in Germany&rsquo;s port of Hamburg. But, now, an American state department official has bragged to the Western press that China&rsquo;s share was reduced from 35% to 25% due to pressure from the American embassy. <em>&ldquo;The embassy was very clear that we strongly suggested that there&rsquo;d be no controlling interest by China, and as you see when they adjusted the deal, there isn&rsquo;t,&rdquo;</em> the official <a href=\"https://www.reuters.com/markets/us-strongly-suggested-there-be-no-controlling-interest-by-china-hamburg-port-2022-11-02/\" target=\"_blank\" rel=\"noopener noreferrer\">told the press</a>.</p>\n<p>Washington is currently in the middle of a full-court press to convince its allies to isolate China, much like how it managed to talk Europe into cutting itself off from Russian energy &ldquo;for Ukraine&rdquo; &ndash; to America&rsquo;s ultimate economic and competitive gain. There&rsquo;s nothing quite like having the EU&rsquo;s economic engine increasingly dependent on the US for energy.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6360031b85f5407f307f3872.png\" alt=\"FILE PHOTO: German Chancellor Olaf Scholz\" />\n            <figcaption><a href=\"https://www.rt.com/news/565688-germany-scholz-approval-rating/\">Most Germans believe Scholz is not up to the job – poll</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>And Germany isn&rsquo;t the only ally being pressured to align with Washington&rsquo;s agenda. American officials are reportedly set to head to the Netherlands next week to talk about <a href=\"https://asia.nikkei.com/Politics/International-relations/U.S.-pushes-Japan-and-other-allies-to-join-China-chip-curbs\" target=\"_blank\" rel=\"noopener noreferrer\">blocking the sale</a> of microchip components to China.</p>\n<p>Japan is also being told to fall in line with new US export controls targeting China&rsquo;s chip-making industry.&nbsp;</p>\n<p>Canada is citing national security to <a href=\"https://www.reuters.com/markets/commodities/canada-orders-three-foreign-firms-divest-investments-critical-minerals-2022-11-02/\" target=\"_blank\" rel=\"noopener noreferrer\">dump Chinese stakes</a> in three lithium mines. Canadian Industry Minister Francois-Philippe Champagne said that the country welcomes foreign direct investment, but not when it threatens <em>&ldquo;critical minerals supply chains,&rdquo;</em> which is exactly the kind of &ldquo;friendshoring&rdquo; &ndash; reducing supply chain participation to allies only &ndash; that Washington conjured up and announced over the summer with the implication that countries are either on Team Washington or else with Russia and China.</p>\n<p>Once again, national security is being trotted out as a pretext to justify a policy of aggression &ndash; this time, in economic warfare rather than the military kind.</p>\n<p>Whether Scholz is up to the task of standing up to Washington in the interests of defending Germany&rsquo;s own sovereignty remains to be seen.</p>\n<p>There have already been hints of what could happen if he ever does. African countries, for example, were threatened by the US earlier this year with <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/7311/text\" target=\"_blank\" rel=\"noopener noreferrer\">sanctions</a> for trading with Russia&nbsp;and China. Just a few days ago, Japan struck a blow to the Washington-led push to get G7 countries onboard with controlling the global price of Russian gas with a price cap when Tokyo announced that it was sticking with its stake in Russia&rsquo;s Sakhalin-1 oil and gas project &ndash; if only because its economy needed Russian fuel imports.</p>\n<p>So the big question is: What&rsquo;s the US going to do about it? Punish Japan &ndash; or just let it slide?</p>\n<p>If Scholz had done the same in defense of his own country&rsquo;s energy supply &ndash; specifically, of the Nord Stream pipeline network running from Russia straight into Germany &ndash; if it had, say, threatened to kick the US out of military bases in Germany if it gave Berlin any grief, that would not only be a definite show of backbone, but would also have put him in a much better position to call the shots today.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 14:24:41 +0000",
  "dc:creator": "RT"
}