{
  "title": "The Blue City Murder Problem",
  "link": "https://www.heritage.org/crime-and-justice/report/the-blue-city-murder-problem",
  "description": "<p>Facts are powerful and stubborn things. Unfortunately, some on the Left have tried to advance their arguments by using facts about state murder rates that, while technically true, are at best meaningless when taken out of context and at worst misleading and downright dangerous when used as the basis for public policy decisions.</p>\n\n<p>Enter the “Red State Murder Problem.” It sounds ominous, but it’s not. It is also highly misleading.</p>\n\n<p>Those on the Left know that their soft-on-crime policies have wreaked havoc in the cities where they have implemented those policies. It is not hard to understand why “reforms” such as ending cash bail, defunding the police, refusing to prosecute entire categories of crimes, letting thousands of convicted felons out of prison early, significantly cutting the prison population, and other “progressive” ideas have led to massive spikes in crime—particularly violent crime, including murder—in the communities where those on the Left have implemented them.</p>\n\n<p>Left-wing politicians and their backers recognize that rising crime rates and the lack of a general sense of safety that follows are a problem for them and their chances for reelection. In fact, recent polls show that voters care a lot about rising crime—an issue that is second only to rising, rampant inflation and the lackluster economy. So the Left is engaging in political traditions as old as time: obfuscation, finger pointing, and blame shifting.</p>\n\n<p>One liberal organization—The Third Way—even went so far as to publish a “study” arguing that Republicans are actually to blame for the spike in murders across the country. The not-so-subtle suggestion the study pushes is that those on the Left are not responsible for rising crime rates because crime is rising everywhere—especially in Republican-led states. Fighting for their political survival, Left-wing politicians such as Gavin Newsom and Larry Krasner have recently started to parrot the “results” of this study.<span class=\"annotation__highlight\" data-annotation=\"<p>Gavin Newsom@GavinNewsom, Twitter, October 18, 2022, 10:16 AM, https://twitter.com/gavinnewsom/status/1582375031278927872 (accessed November 2, 2022); Snejana Farberov, “Lefty Philadelphia DA Larry Krasner Says Crime Is Worse in ‘Trump States’ in Fiery Interview,” New York Post, September 30, 2022, https://nypost.com/2022/09/30/philly-da-larry-krasner-says-crime-worse-in-trump-states/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>But crime tends to be a hyper-localized phenomenon. State-level data are generally meaningless—except as a tool with which to score political points. More to the point, when the crime statistics from the deep-blue big cities within these otherwise deep-red states are removed, what happens? The state-level crime rates fall—in some cases, dramatically.</p>\n\n<h3>Crime Trends</h3>\n\n<p>Until recently, crime, including violent crime, has been declining across the United States since the peak of the last crime wave in 1992.<span class=\"annotation__highlight\" data-annotation=\"<p>See William P. Barr, “Rising Crime Rates Are a Policy Choice,” The Wall Street Journal, October 26, 2022, https://www.wsj.com/articles/safe-streets​-are-a-policy-choice-incapacitation-incarceration-state-federal-prison-violent-crime-1990s-reagan-bush-barr-obama-sentencing-bail-11666785403 (accessed November 2, 222).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Not surprisingly, since incarceration trails crime waves, incarceration rates have also been falling dramatically since they last peaked in 2008.<span class=\"annotation__highlight\" data-annotation=\"<p>See Barry Latzer, The Myth of Overpunishment: A Defense of the American Justice System and a Proposal to Reduce Incarceration While Protecting the Public (New York: Republic Book Publishers, 2022), p. 88.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Unfortunately, however, the 25-plus year drop in crime since 1992 has ended for many cities across the United States. The rise in crime, especially violent crime, started taking place around 2015 after the confluence of a series of events that took place over the course of a few years.</p>\n\n<p>Those events include police-involved shootings of black community members,<span class=\"annotation__highlight\" data-annotation=\"<p>The Washington Post has a comprehensive database of every fatal shooting by an on-duty police officer in the United States since January 1, 2015. Since its inception, there have been more than 5,000 such shootings (as of October 18, 2022), including 1,695 blacks, 1,135 Hispanics, 3,204 whites, and 259 others. That represents 41 blacks per million, 29 Hispanics per million, 16 whites per million, and five per million for others. Over 95 percent of people shot and killed are males, more than 50 percent of whom were between 20 and 40 years old. See The Washington Post, “Fatal Force,” https://​www.washingtonpost.com/graphics/investigations/police-shootings-database/ (accessed November 2, 2022). Some of the names of those shot and killed by the police have been household names and rallying cries in the so-called social justice movement in the United States, which started in earnest in 2014 after the death of Eric Garner in July 2014. Subjected to a choke hold by NYPD Officer Daniel Pantaleo, Garner said “I can’t breathe” numerous times and later died. His death was classified as a homicide, but the officer was not indicted, and an uproar followed across the country. A month later, in Ferguson, Missouri, Officer Darren Wilson shot and killed Michael Brown after Brown had resisted arrest, fled, and then attacked Officer Wilson. Wilson was not charged. After 2014, other blacks shot by police that rose to national attention and fueled racial strife and unrest across the country included Freddie Gray in Baltimore in 2015; Breonna Taylor in Louisville, Kentucky, in 2020; and George Floyd in Minneapolis, Minnesota, also in 2020.﻿</p>\"><span class=\"annotation-link\">REF</span></span> the defund the police movement,<span class=\"annotation__highlight\" data-annotation=\"<p>Democratic mayors, city council members, state legislators, and Democratic Members of Congress have all called for defunding the police in recent years. The Republican Study Committee has compiled a list of Members of Congress who have called for defunding the police. See Republican Study Committee, “Looking Back: Democrats Push to Defund the Police,” https://rsc-banks.house.gov/democrats-push-defund-police (accessed November 2, 2022). Eventually, calls to defund the police backfired on the Democrats as it became clear that cutting the size of police departments, especially in high-crime areas, only harmed the residents of those cities and caused voters, including Democrats, to feel unsafe in their own cities. No doubt realizing that calling for defunding the police was an albatross around the Democratic Party’s neck, President Joe Biden, during his March 2022 State of the Union Address to the nation, said, “We should all agree: The answer is not to defund the police. The answer is to FUND the police with the resources and training they need to protect our communities.” See “Remarks of President Joe Biden—State of the Union Address as Prepared for Delivery,” The White House, March 1, 2022, https://www.whitehouse.gov/briefing-room/speeches-remarks/2022/03/01/remarks-of-president-joe​-biden-state-of-the-union-address-as-delivered/ (accessed November 2, 2022). Emphasis in original. Despite the President’s rhetoric and attempt at damage control, the fact is that defunding of police department budgets and repeated calls to defund the police have become a political liability going into the 2022 midterm elections.﻿</p>\"><span class=\"annotation-link\">REF</span></span> the election of rogue prosecutors funded or inspired by George Soros and other elitist billionaires,<span class=\"annotation__highlight\" data-annotation=\"<p>See Charles D. Stimson and Zack Smith, “‘Progressive’ Prosecutors Sabotage the Rule of law, Raise Crime Rates, and Ignore Victims,” Heritage Foundation Legal Memorandum No. 275, October 29, 2020, https://www.heritage.org/sites/default/files/2020-10/LM275.pdf.﻿</p>\"><span class=\"annotation-link\">REF</span></span> and the “Ferguson/Minneapolis Effect”<span class=\"annotation__highlight\" data-annotation=\"<p>See Cheng Cheng and Wei Long, “The Effect of Highly Publicized Police Killings on Policing: Evidence from Large U.S. Cities,” Journal of Public Economics, Vol. 206 (February 2022), https://www.sciencedirect.com/science/article/abs/pii/S0047272721001936 (accessed November 2, 2022). See also Deepak Premkumar, “Public Scrutiny, Police Behavior, and Crime Consequences: Evidence from High-Profile Police Killings,” April 26, 2022, https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3715223 (accessed November 2, 2022), which found that after police killings that generate significant public attention, officers reduce their efforts and crime increases; Heather Mac Donald, The War on Cops: How the New Attack on Law and Order Makes Everyone Less Safe (New York: Encounter Books, 2016), wherein Mac Donald coins the phrase “Ferguson Effect” to describe how and why police departments across the country withdrew from proactive policing in the aftermath of the death of Michael Brown in Ferguson, Missouri, in 2014; and Robert VerBruggen, “Yes, There’s a Ferguson Effect,” The American Conservative, May 23, 2016, https://www.theamericanconservative.com/yes​-theres-a-ferguson-effect/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> by which unwarranted public scrutiny of police resulted in police drastically reducing proactive policing. Crime was rising in select cities across the country before the global COVID-19 pandemic struck in March 2020, but it rose even more significantly after the death of George Floyd on May 25, 2020.</p>\n\n<p>The cumulative effect of these events contributed to and in large part set the conditions for increased crime across much of the country, especially in cities where the toxic trio of rogue prosecutors, defund the police zealotry, and demonization/demoralization of the police existed. In those cities and others with some mixture of this toxic trio crime has exploded across most categories, including but not limited to murder.</p>\n\n<p>As the old saying goes, the best defense is a good offense. So instead of defending their calls to defund the police, the elections of pro-criminal rogue prosecutors, or their pattern and practice of demonizing police, some on the Left have decided to flip the narrative and argue that it is the Republican states that have the real crime rate problem, especially when it comes to murder.</p>\n\n<h3>The Red State Murder Herring</h3>\n\n<p>On March 15, 2022, a left-wing advocacy organization called The Third Way published a 15-page study with the provocative title “The Red State Murder Problem.”<span class=\"annotation__highlight\" data-annotation=\"<p>See Kylie Murdock and Jim Kessler, “The Red State Murder Problem,” Third Way Report, March 15, 2022, http://thirdway.imgix.net/pdfs/the-red-state​-murder-problem.pdf (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Written by Jim Kessler, a long-time Democratic policy director to Representative/Senator Charles “Chuck” Schumer, and Kylie Murdock, a former intern for Congresswoman Barbara Lee and volunteer for Elizabeth Warren for President, the study states that “murder rates are far higher in Trump-voting red states than Biden-voting blue states.”<span class=\"annotation__highlight\" data-annotation=\"<p>Ibid., p. 2.﻿</p>\"><span class=\"annotation-link\">REF</span></span> So that the reader won’t miss the political drift, the authors add, “And sometimes, murder rates are highest in cities with Republican mayors.”<span class=\"annotation__highlight\" data-annotation=\"<p>Ibid.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The “crime rate” is the number of crimes reported to law enforcement agencies for every 100,000 persons within a given population. It is calculated by dividing the number of reported crimes by the total population. The result is then multiplied by 100,000.</p>\n\n<p>Not surprisingly, dozens of media outlets, including <i>The Washington Post</i>,<span class=\"annotation__highlight\" data-annotation=\"<p>See Dana Milbank, “It’s Just Murder Living in a Red State,” The Washington Post, October 11, 2022, https://www.washingtonpost.com/opinions/2022​/10/11/republican-states-crime-rates-tuberville/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> <i>The Hill</i>,<span class=\"annotation__highlight\" data-annotation=\"<p>See Jim Kessler, “We Have a Murder Problem in America—Especially in Red States,” The Hill, April 20, 2022 https://thehill.com/opinion/campaign​/3274797-we-have-a-murder-problem-in-america-especially-in-red-states/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> <i>Inside Edition</i>,<span class=\"annotation__highlight\" data-annotation=\"<p>See Inside Edition Staff, “Red States Have Higher Murder Rates Than Blue States, According to New Study,” Inside Edition, April 6, 2022, https://www​.insideedition.com/red-states-have-higher-murder-rates-than-blue-states-according-to-new-study-74227 (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Politifact,<span class=\"annotation__highlight\" data-annotation=\"<p>See Jill Terreri Ramos, “In Claim About Crime in Other States, Context Needed,” Poynter Institute, PolitiFact, April 16, 2022 https://www.politifact.com​/factchecks/2022/apr/16/crystal-peoples-stokes/claim-about-crime-other-states-context-needed/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> The Daily Beast,<span class=\"annotation__highlight\" data-annotation=\"<p>See Michael Daly, “McCarthy Blames Crime on Dems While It Rages in His GOP-Led Hometown,” The Daily Beast, updated June 11, 2022, https://www​.thedailybeast.com/kevin-mccarthy-blames-crime-on-dems-while-it-rages-in-his-gop-led-hometown (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> <i>Los Angeles Magazine</i>,<span class=\"annotation__highlight\" data-annotation=\"<p>See Jason McGahan, “Why You’re Far More Likely to Be Murdered in Fresno or Bakersfield than San Francisco or L.A., Los Angeles Magazine, March 31, 2022, https://www.lamag.com/citythinkblog/why-youre-far-more-likely-to-be-murdered-in-fresno-or-bakersfield-than-san-fran-and-l-a/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> the <i>San Francisco Examiner</i>,<span class=\"annotation__highlight\" data-annotation=\"<p>See Gil Duran, “Let’s Obliterate the Myth that Republicans Are Solving Crime and Overdoses,” San Francisco Examiner, updated June 2, 2022 https://​www.sfexaminer.com/our_sections/forum/opinion/let-s-obliterate-the-myth-that-republicans-are-solving-crime-and-overdoses/article_f34ecfac​-5f70-5682-8a27-49d650a14405.html (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> NBC News<span class=\"annotation__highlight\" data-annotation=\"<p>See Sahil Kapur and Jon Schuppe, “‘Overall Crime Decreased in 2020 in the U.S.,’ Report Finds,” NBC News, September 12, 2021, https://www​.nbcnews.com/politics/politics-news/overall-crime-decreased-2020-united-states-report-finds-n1278938 (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> and others, picked up the “study” and breathlessly reported on its “findings.”<span class=\"annotation__highlight\" data-annotation=\"<p>See Cory Allen Heidelberger, “Trump States Have Higher Murder Rates; South Dakota Leads Region in Chance of Death at Neighbors’ Hands,” Dakota Free Press, March 19, 2022, https://dakotafreepress.com/2022/03/19/trump-states-have-higher-murder-rates-south-dakota-leads-region-in​-chance-of-death-at-neighbors-hands/ (accessed November 2, 2022). See also Jonathan Capehart, “The Real Story About Crime Republicans Won’t Tell You,” The Washington Post, March 22, 2022, https://www.washingtonpost.com/opinions/2022/03/22/crime-murder-rates-republican-cities/ (accessed November 2, 2022); Joel Mathis, “Democrats Can’t Escape Reality. They Shouldn’t Try,” The Week, April 5, 2022, https://theweek.com/us​/1012196/white-house-officials-and-left-wing-media-critics-convinced-themselves-that-the-media (accessed November 2, 2022); Steven Greenhut, “Republicans Are Learning That Crime Data Isn’t So Simple,” Pasadena Star-News, September 18, 2022, https://www.pasadenastarnews.com/2022​/09/18/republicans-are-learning-that-crime-data-isnt-so-simple/ (accessed November 2, 2022); Jeff Rouner, “Red States Have More Murders Than Blue States,” Reform Austin, April 11, 2022, https://www.reformaustin.org/public-safety/red-states-have-more-murders-than-blue-states/ (accessed November 2, 2022); and Jacob Bliss, “Democrats Aim to Flip Crime Script, Issue Report Blaming Red States for Wave,” Breitbart, March 16, 2022, https://www.breitbart.com/politics/2022/03/16/democrats-aim-to-flip-crime-script-issue-report-blaming-red-states-for-wave/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Even Paul Krugman, <i>New York Times</i> opinion columnist and economist, has joined the echo chamber, albeit with an unconvincing and divorced-from-reality opinion piece wherein he opines that “nobody knows for sure what caused the surge.”<span class=\"annotation__highlight\" data-annotation=\"<p>See Paul Krugman, “Crime: Red Delusions About Purple Reality,” The New York Times, October 24, 2022, https://www.nytimes.com/2022/10/24​/opinion/rising-crime-democrats.html (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>We have a pretty good idea, and many voters apparently are starting to figure it out as well.</p>\n\n<p>The study’s authors and those reporting its results took advantage of the fact that the average reader does not know much about crime trends, how crime rates are calculated, and at what level (city/county/state, etc.) these statistics should be reviewed. Because of that, The Third Way’s study sounds important and shocking to most readers who visit these “news” websites.</p>\n\n<p>As noted earlier, however, most crime is hyperlocalized, so the fundamental flaw with the study and the reason it does not deserve any serious consideration is that the “murder rate” in each state is largely a function of the large number of murders in a state’s biggest city or cities.<span class=\"annotation__highlight\" data-annotation=\"<p>See Rafael A. Mangual, “Dems’ Shameless Ploy to Blame Crime Rise on ‘Red States,’” New York Post, October 11, 2022, https://nypost.com/2022​/10/11/dems-shameless-ploy-to-blame-crime-rise-on-red-states/ (accessed November 2, 2022), and “Crime in American Cities, and Myth of ‘Red State Murder Problem,’ with Rafael Mangual and Jennifer Castro,” The Megyn Kelly Show, Episode 410, October 12, 2022, https://player.fm/series/the​-megyn-kelly-show/crime-in-american-cities-and-myth-of-red-state-murder-problem-with-rafael-mangual-and-jennifer-castro-ep-410 (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> A super majority of those cities, even in otherwise red states, are deep blue and run by left-wing ideologues.</p>\n\n<p>When you remove the crime-infested, homicide-riddled cities from the state murder rate featured in the Third Way study, you dramatically lower the murder rate for that state, upending their conclusions and exposing the piece for what it really is: a straightforward attempt at political projection dressed up as a “study.”</p>\n\n<p>Said another way, Kessler and Murdock did their level best as political operatives to blame their political opponents for the very thing—rising crime—that leftist policies at the city and county levels have caused.</p>\n\n<p>While a state’s murder rate is perhaps politically interesting, a more accurate reflection of what is actually happening on the ground is gained by reviewing localized murder rates, such as murder rates in a city or county. What does this review show?</p>\n\n<p>Table 1 lists the 30 cities with the highest murder rates in the United States as of June 30, 2022.</p>\n\n<p> </p>\n\n<p><img alt=\"LM315 Table 1\" data-entity-type=\"file\" data-entity-uuid=\"6e030915-0fda-4265-907c-48be88229275\" src=\"https://www.heritage.org/sites/default/files/inline-images/LM-blue-city-murder-problem-tables-page1_0.gif\" /></p>\n\n<p> </p>\n\n<p>Not surprisingly, of those 30 cities, 27 have Democratic mayors, the exceptions being Lexington and Jacksonville, which have Republican mayors, and Las Vegas, whose mayor is an Independent. And within those 30 cities there are at least 14 Soros-backed or Soros-inspired rogue prosecutors. Those Soros bought-and-paid-for or inspired rogue prosecutors include:</p>\n\n<ul><li>Jason Williams, New Orleans Parish District Attorney;</li>\n\t<li>Marilyn Mosby, Baltimore City State’s Attorney;<span class=\"annotation__highlight\" data-annotation=\"<p>On July 22, 2022, Marilyn Mosby was defeated in the primary for the office of State’s Attorney for the City of Baltimore. She lost to former Assistant State’s Attorney Ivan Bates but remains in office until the outcome of the general election is known and her successor is sworn into office.﻿</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>Kim Gardner, St. Louis Circuit Attorney;</li>\n\t<li>John T. Chisholm, Milwaukee County District Attorney;</li>\n\t<li>Larry Krasner, Philadelphia District Attorney;</li>\n\t<li>Kim Foxx, Cook County (Chicago) State’s Attorney;</li>\n\t<li>Raul Torrez, Bernalillo County (Albuquerque) District Attorney;</li>\n\t<li>Mike Freeman, Hennepin County (Minneapolis) Attorney;</li>\n\t<li>John Creuzot, Dallas County District Attorney;</li>\n\t<li>Glenn R. Funk, Nashville District Attorney General;</li>\n\t<li>Santana Deberry, Durham District Attorney;</li>\n\t<li>George Gascon, Los Angeles County District Attorney;</li>\n\t<li>Chesa Boudin, San Francisco District Attorney;<span class=\"annotation__highlight\" data-annotation=\"<p>San Francisco District Attorney Chesa Boudin was recalled in a special election on June 8, 2022. San Francisco Mayor London Breed appointed Assistant District Attorney Brooke Jenkins to serve as District Attorney for the remainder of Boudin’s term.﻿</p>\"><span class=\"annotation-link\">REF</span></span> and</li>\n\t<li>Alvin Bragg, Manhattan District Attorney.</li>\n</ul><p>There were 2,554 homicides in those 30 cities through June 2022. In the 14 cities with Soros-backed rogue prosecutors, there were 1,752 homicides, representing 68 percent of homicides in the 30 top homicide cities in the United States.</p>\n\n<p>Every Soros rogue prosecutor listed above is a Democrat.</p>\n\n<h3>A More Detailed Analysis</h3>\n\n<p>For a deeper dive into the numbers, we performed a more detailed analysis by examining how states’ homicide rates are influenced by particular high-crime counties. Although the authors of the “The Red State Murder Problem” provide the state-by-state data used in their study, they do not directly provide the county-level data necessary to answer this question.<span class=\"annotation__highlight\" data-annotation=\"<p>Murdock and Kessler, “The Red State Murder Problem,”﻿</p>\"><span class=\"annotation-link\">REF</span></span> County Health Rankings & Roadmaps (CHR&R), a program of the University of Wisconsin Population Health Institute, however, does provide these comprehensive data.<span class=\"annotation__highlight\" data-annotation=\"<p>County Health Rankings & Roadmaps, https://www.countyhealthrankings.org/ (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Specifically, CHR&R provides detailed data on health care, education, economic, and demographic variables, including homicide rates and overall state populations on a county-by-county basis all across the country.</p>\n\n<p>Table 2 provides homicide rate rankings across all 50 states based on homicide data from 2014–2020.<span class=\"annotation__highlight\" data-annotation=\"<p>For full details of our methodology, see Appendix, infra.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p> </p>\n\n<p><img alt=\"LM315 Table 2\" data-entity-type=\"file\" data-entity-uuid=\"0fe5611b-fa7d-4a09-b9ac-55752c74b698\" src=\"https://www.heritage.org/sites/default/files/inline-images/LM-blue-city-murder-problem-tables-page2.gif\" /></p>\n\n<p> </p>\n\n<p><img alt=\"LM315 Table 3\" data-entity-type=\"file\" data-entity-uuid=\"a7538e1b-4fa0-4fb5-aa11-ac83b247e7be\" src=\"https://www.heritage.org/sites/default/files/inline-images/LM-blue-city-murder-problem-tables-page3.gif\" /></p>\n\n<p> </p>\n\n<p>A closer examination of the local officials in the counties and cities listed above reveals that the vast majority of them are Democrats.</p>\n\n<ul><li>In Orleans Parish, Louisiana (which encompasses New Orleans), District Attorney Jason Williams, Mayor LaToya Cantrell, and all seven members of the City Council are Democrats.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the New Orleans City Council include Helena Moreno, Jean Paul Morell, Joe Giarrusso, Lesli Harris, Freddie King III, Eugene Green and Oliver Thomas.﻿</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>In Hinds County, Mississippi, District Attorney Jody E. Owens and all five members of the Board of Supervisors are Democrats.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Hinds County Board of Supervisors include Robert Graham, David L. Archie, Credell Calhoun, Vern O. Gavin, and Bobby McGowan.﻿</p>\"><span class=\"annotation-link\">REF</span></span> In Jackson County, Mississippi, District Attorney Angel Myers McIlrath is a Republican, as are four of the five members of the Board of Supervisors,<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Jackson County Board of Supervisors include Barry Cumbest (R); Ennit Morris (D); Ken Taylor (R); Troy Ross (R); and Randy Bosarge (R).﻿</p>\"><span class=\"annotation-link\">REF</span></span> but the City of Jackson Mayor Chokwe Antar Lumumba is a Democrat.</li>\n\t<li>In Jefferson County, Alabama, the Board of Commissions consists of three Republicans and two Democrats.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Jefferson County Board of Commissioners include Lashunda Scales (D); Sheila Tyson (D); James A. Stephens (R); Joe Knight (R); and Steve Ammons (R).﻿</p>\"><span class=\"annotation-link\">REF</span></span> District Attorney Danny Carr is a Democrat, as is Birmingham Mayor Randall Woodfin.</li>\n\t<li>The Montgomery County, Alabama, Board of Commissions consists of three Republicans and two Democrats.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Montgomery County Board of Commissioners include Daniel Harris, Jr. (D); Carmen Moore-Zeigler (R); Ronda M. Walker (R); Isaiah Sankley (D); and Doug Singleton (R).﻿</p>\"><span class=\"annotation-link\">REF</span></span> District Attorney Daryl Bailey is a Democrat, as is Montgomery Mayor Steven Reed.</li>\n\t<li>The elected officials in the City of Saint Louis, Missouri, are all Democrats. The 28 members of the Board of Alderman are all Democrats, as are Circuit Attorney (the equivalent of a local district attorney) Kim Gardner and Mayor Tishaura Jones.</li>\n\t<li>Saint Louis County is equally lopsided with elected Democrats, including five of the seven members of the County Council and District Attorney Wesley Bell.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Saint Louis County Council include Rita Heard Days (D); Kelli Dunaway (D); Tim Fitch (R); Shalonda D. Webb (D); Lisa Clancy (D); Ernie Trakas (R); and Mark Harder (R).﻿</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>The City of Columbia, South Carolina, is unique in that it straddles two counties, Richland and Lexington. Richland County Solicitor (the equivalent of the local district attorney) Byron E. Gipson is a Democrat, as are nine of the 11 members of the Richland County Council.<span class=\"annotation__highlight\" data-annotation=\"<p>The Democrat members of the Richland County Council are Derrek Pugh, Yvonne McBride, Paul Livingston, Allison Terracio, Gretchen Barron, Overture Walker, Jesica Mackey, Cheryl D. English, and Chakisse Newton. The two Republicans are Bill Malinowski and Joe Walker III.﻿</p>\"><span class=\"annotation-link\">REF</span></span> Lexington County Solicitor Rick Hubbard is a Republican, as are all nine members of the Lexington County Council.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Lexington County Council include Scotty Whetstone, Paul Lawrence Brigham, Jr., Darrell Hudson, Debra A. Summers, Gene Jones, Charlene Wessinger, Beth A. Carrigg, Glen M. Conwell, and M. Todd Cullum.﻿</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>In Bernalillo County, New Mexico (which includes Albuquerque), four of the five members of the Board of Commissioners are Democrats, as are Mayor Tim Keller and District Attorney Raul Torrez.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Bernalillo County Board of Commissioners include Debbie O’Malley (D); Steven Michael Quezada (D); Adriann Barboa (D); Walt Benson (R); and Charlene Pyskoty (D).﻿</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>In Shelby County, Tennessee, nine of the 13 members of the Board of Commissioners are Democrats, as are Memphis Mayor Jim Strickland and Shelby County District Attorney Steve Mulroy.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Shelby County Board of Commissioners include Amber Mills (R); David C. Bradford Jr. (R); Mick Wright (R); Brandon C. Morrison (R); Charlie A. Caswell, Jr. (D); Henri E. Brooks (D); Mickell M. Lowery (D); Dr. Edmund Ford Jr. (D); Britney Thornton (D); Miska Clay-Bibbs (D); Erika Sugarmon (D); and Michael Whaley (D).﻿</p>\"><span class=\"annotation-link\">REF</span></span></li>\n\t<li>In Davidson County, Tennessee, members of the Metropolitan Nashville Council are all listed as nonpartisan. However, both District Attorney Glenn Funk and Mayor John Cooper are Democrats.</li>\n\t<li>Fifteen of the 17 members of the Cook County, Illinois (which encompasses Chicago) Board of Commissioners are Democrats,<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the Cook County Board of Commissioners include Democrats Brandon Johnson, Dennis Deer, Bill Lowry, Stanley Moore, Deborah Simms, Donna Miller, Alma E. Anaya, Luis Arroyo Jr., Bridget Gainer, John P. Daley, Bridget Degnen, Larry Suffredin, Scott R. Britton, Kevin B. Morrison, and Frank J. Aguilar. The two Republicans are Peter N. Silvestri and Sean M. Morrison.﻿</p>\"><span class=\"annotation-link\">REF</span></span> as are Cook County State’s Attorney Kim Foxx, the first Soros rogue prosecutor, and Chicago Mayor Lori Lightfoot.</li>\n\t<li>Nine of the 14 members of the Pulaski County, Arkansas, Quorum Court (the county government’s legislative body) are Democrats,<span class=\"annotation__highlight\" data-annotation=\"<p>The Pulaski County Quorum Court includes Democrats Tyler Denton, Kathy Lewison, Julie Blackwood, Lillie McMullen, Donna Massey, Teresa Coney, Curtis Keith, Judy Green, and Staci Medlock. Republican members include Doug Reed, Aaron Robinson, Luke McCoy, Phil Stowers, and Paul Eliot. The seat in District 10 is currently vacant.﻿</p>\"><span class=\"annotation-link\">REF</span></span> as are Mayor Frank Scott Jr. and Prosecuting Attorney Larry Jegley of Pulaski County, which encompasses Little Rock.</li>\n\t<li>In Georgia, all seven members of the Dekalb County Board of Commissioners are Democrats, as are District Attorney Sherry Boston and Atlanta Mayor Andre Dickens.<span class=\"annotation__highlight\" data-annotation=\"<p>The members of the DeKalb County Board of Commissioners include Robert Patrick, Jeff Rader, Larry Johnson, Steve Bradshaw, Mereda Davis Johnson, Ted Terry, and Lorraine Cochran-Johnson. All are Democrats.﻿</p>\"><span class=\"annotation-link\">REF</span></span> DeKalb County encompasses the eastern section of the City of Atlanta.</li>\n\t<li>Four of the seven members of the Board of Commissioners of Fulton County, Georgia, which encompasses the rest of Atlanta, are Democrats,<span class=\"annotation__highlight\" data-annotation=\"<p>Democrat members of the Fulton County Board of Commissioners include Democrats Robb Pitts, Natalie Hall, Marvin S. Arrington, Jr., and Khadijah Abdur-Rahman. Republican members include Liz Hausmann, Bob Ellis, and Lee Morris.﻿</p>\"><span class=\"annotation-link\">REF</span></span> as is District Attorney Fani Willis.</li>\n</ul><p>The authors of the Third Way “study” either intentionally neglected or simply don’t understand that the “criminal justice system” within the 50 states is not a homogeneous nationwide system, but rather an amalgamation of thousands of microcosms consisting of federal, state, county, and local law enforcement agencies and prosecutors and unique approaches to the enforcement of state law. There are, for example, 3,143 counties in this country. Violations of state law are prosecuted largely at the county or city level.</p>\n\n<p>Your public safety as a resident is dramatically impacted by your district attorney and whether he or she is a Soros rogue prosecutor or a law-and-order prosecutor, by your police department, and by whether the local politicians support and adequately fund the police and prosecutor’s offices.</p>\n\n<p>This is why the Soros rogue prosecutor movement has concentrated its fire at identifying, recruiting, and funding candidates for local district attorney races. By elevating pro-criminal, anti-victim zealots into office, the rogue prosecutor movement destabilizes the safety of the community, treats criminals as victims and the police as the criminals, and ignores real victims.</p>\n\n<p>Whether a state as a whole voted for Donald Trump or Joe Biden has nothing whatever to do with the homicide rates within its constituent parts. The authors of the Third Way “study” are either oblivious to this fact or, as we suspect, aware of this but nonetheless determined to flip the political narrative. As we demonstrate, however, the high murder rate is almost exclusively cabined in cities run by Democrats and with Democrat district attorneys, many of whom are Soros bought-and-paid-for rogue prosecutors or inspired by Soros, groups like the egregiously misnamed Fair and Just Prosecution, and other battering rams of the movement.</p>\n\n<p> </p>\n\n<p><img alt=\"LM315 Chart 1\" data-entity-type=\"file\" data-entity-uuid=\"57a48b2d-e5b2-45a7-8a85-ac992de36d7b\" src=\"https://www.heritage.org/sites/default/files/inline-images/LM-blue-city-murder-problem-charts-page1.gif\" /></p>\n\n<p> </p>\n\n<p><img alt=\"LM315 Chart 2\" data-entity-type=\"file\" data-entity-uuid=\"441f2fb0-d002-421e-b498-bd4d3b2c1a7c\" src=\"https://www.heritage.org/sites/default/files/inline-images/LM-blue-city-murder-problem-charts-page2.gif\" /></p>\n\n<p> </p>\n\n<p><img alt=\"LM315 Chart 3\" data-entity-type=\"file\" data-entity-uuid=\"0dd29a53-2fb3-42c6-bf07-25f526f01cb6\" src=\"https://www.heritage.org/sites/default/files/inline-images/LM-blue-city-murder-problem-charts-page3.gif\" /></p>\n\n<p> </p>\n\n<p>As Table 2 illustrates, Washington, DC, has the nation’s highest homicide rate at 19.846 homicides per 100,000 residents yet is completely neglected in “The Red State Murder Problem.” Louisiana, Alabama, and Mississippi are also highly ranked with homicide rates ranging from 13.390 to 10.728 per 100,000 residents).<span class=\"annotation__highlight\" data-annotation=\"<p>While we recognize that the District of Columbia is not a state, for the sake of simplicity and clarity and because of the District’s unique constitutional status and the ongoing debate about whether it should be a state, we include it here. Neither we nor The Heritage Foundation endorse the District of Columbia’s becoming a state, especially by a simple act of Congress. See Zack Smith, “Does D.C. Statehood Require a Constitutional Amendment?: You Better Believe It,” Ohio State Law Journal Online, Vol. 83 (2022), pp. 17–28, https://kb.osu.edu/bitstream/handle/1811/101092/OSLJ_Online_V83_017​.pdf?sequence=1 (accessed November 2, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Louisiana’s homicide rate is heavily dependent on Orleans Parish, which has a homicide rate of 36.126 homicides per 100,000 residents. Removing this locality drops the state’s homicide rate from 13.390 to 11.302, a 15.59 percent reduction.</p>\n\n<p>Alabama’s overall homicide rate is also heavily influenced by a few localities. For example, removing Jefferson County drops the state’s homicide rate from 10.728 to 9.001, a 16.10 percent reduction, and removing Montgomery County drops the homicide rate to 10.220, a 4.74 percent reduction. Dropping both lowers the homicide rate to 8.314, a 22.51 percent reduction, and would lower the state’s ranking in Table 2 from fourth to eighth in the nation. These dramatic drops are illustrated in Chart 1.</p>\n\n<p>Missouri’s overall homicide rate is marked by similar behavior. St. Louis City and St. Louis County heavily influence the state’s homicide rate, having 46.235 and 14.387 homicides per 100,000 residents, respectively. Removing St. Louis City lowers the state’s homicide rate from 9.363 to 7.482 per 100,000 residents, a 20.09 percent reduction. Removing St. Louis County lowers the homicide rate to 8.395 per 100,000 residents,) a 10.34 percent reduction, while dropping both counties reduces the state’s homicide rate by 35.17 percent to 6.070 homicides per 100,000 residents. These reductions are apparent in Chart 2. Looking at Table 2, removing both counties drops Missouri’s homicide ranking from fifth to 20th in the nation.</p>\n\n<p>New Mexico’s homicide rate is heavily dependent on Bernalillo County, encompassing the City of Albuquerque. Bernalillo County is the state’s most populous county and has a homicide rate of 10.241 homicides per 100,000 residents. Removing this county lowers the state’s homicide rate from 8.403 to 7.511 per 100,000 residents, a 10.62 percent reduction, and lowers the county’s homicide rate from eighth to 11th in the nation.</p>\n\n<p>Georgia’s homicide rate is heavily influenced by crime in Atlanta, encompassing Fulton and DeKalb Counties. Dropping these two counties (which have homicide rates of 13.407 and 13.272 per 100,000 residents, respectively) causes the state’s homicide rate to fall from 7.264 to 5.999, a 17.3 percent reduction, and the state’s ranking in Table 2 to fall from 13th to 21st in the nation.</p>\n\n<p>Arkansas’ homicide rate is impacted by Pulaski County, which has 17.199 homicides per 100,000 residents. Removing this county drops the state’s overall homicide rate from 7.688 to 6.256, a 18.63 percent reduction.</p>\n\n<p>Tennessee is heavily influenced by crime in Memphis and Nashville. Removing Shelby County (with a homicide rate of 23.424 per 100,000 residents) surrounding Memphis results in a reduction from 7.783 to 5.327 (per 100,000 residents), a 31.56 percent change. Dropping Davidson County (with a homicide rate of 12.074 per 100,000) surrounding Nashville results in a reduction from 7.783 to 7.299 (per 100,000 residents), a 6.22 percent change. Dropping both counties brings down the state’s homicide rate to 4.432 per 100,000 residents, a 43.05 percent reduction, and lowers the state’s national ranking in Table 2 from ninth to 27th.</p>\n\n<p>Finally, Cook County, Illinois, is another highly influential county. Home to Chicago, Cook County boasts a homicide rate of 13.99 homicides per 100,000 residents, and dropping it from the state’s overall homicide rate calculation lowers the state’s rate from 7.746 to 3.476, a 55.1 percent reduction. (See Chart 3.) This reduction causes the state’s ranking in Table 1 to plummet from 10th to 32nd in the nation.</p>\n\n<p>It is apparent that some states’ homicide rates are determined heavily by crime in certain counties. It is thus naïve and nonsensical to make partisan claims about states’ overall crime rates while completely neglecting how various localities contribute to these rates.</p>\n\n<h3>Policies, Not COVID</h3>\n\n<p>One of the Left’s talking points is that the COVID-19 caused or at least contributed to the general rise in crime and that the rise in crime started during the pandemic. There are no reputable studies that prove that crime increased as a direct result of COVID lockdowns—which makes sense. Many people across the country were locked down, including in the inner cities where most crime takes place. What the data do show is that crime, including violent crime, was rising in cities with the toxic trio prior to<span class=\"annotation__highlight\" data-annotation=\"<p>See Stimson and Smith, “‘Progressive’ Prosecutors Sabotage the Rule of Law, Raise Crime Rates, and Ignore Victims.” See also The Heritage Foundation’s Daily Signal series on rogue prosecutors (The Heritage Foundation, “Rogue Prosecutors,” https://www.heritage.org/rogue-prosecutors), which outlines the rising crime rates for each rogue prosecutor immediately after the elections and imposition of that prosecutor’s pro-criminal, anti-victim policies.﻿</p>\"><span class=\"annotation-link\">REF</span></span> the onset of the pandemic and that the death of George Floyd, which happened in May 2020, led to a rise in murders and auto theft in key cities.<span class=\"annotation__highlight\" data-annotation=\"<p>See Mikaela Meyer, Ahmed Hassafy, Gina Lewis, Prasun Shrestha, Amelia M. Haviland, and Daniel S. Nagin, “Changes in Crime Rates During the COVID-19 Pandemic,” Statistics and Public Policy, Vol. 9, No. 1 (2022), pp. 97–109, https://www.tandfonline.com/doi/pdf/10.1080/2330443X.2022​.2071369?needAccess=true (accessed November 2, 2022). Also, around the world, urban crime fell by over a third during the COVID-19 shutdowns, as evidenced by a University of Cambridge study. Significantly, the study found that theft and robbery almost halved on average in 27 cities across 23 countries in Europe, the Americas, Asia, and the Middle East. See Amy E. Nivette, Renee Zahnow, Raul Aguilar, Andri Ahven, Shai Amram, Barak Ariel, María José Arosemena Burbano, Roberta Astolfi, Dirk Baier, Hyung-Min Bark, Joris E. H. Beijers, Marcelo Bergman, Gregory Breetzke, I. Alberto Concha-Eastman, Sophie Curtis-Ham, Ryan Davenport, Carlos Díaz, Diego Fleitas, Manne Gerell, Kwang-Ho Jang, Juha Kääriäinen, Tapio Lappi-Seppälä, Woon-Sik Lim, Rosa Loureiro Revilla, Lorraine Mazerolle, Gorazd Meško, Noemí Pereda, Maria F. T. Peres, Rubén Poblete-Cazenave, Simon Rose, Robert Svensson, Nico Trajtenberg, Tanja van der Lippe, Joran Veldkamp, Carlos J. Vilalta Perdomo , and Manuel P. Eisner, “A Global Analysis of the Impact of COVID-19 Stay-at-Home Restrictions on Crime,” Nature Human Behaviour, Vol. 5 (July 2021), pp. 868–877, https://www.nature.com​/articles/s41562-021-01139-z (accessed November 2, 2022) . See also Heather Mac Donald, “A New Crime Wave—and What to Do About It,” City Journal, Special Issue: New York City: Reborn, 2021, https://www.city-journal.org/new-york-city-violence-surging (accessed November 2, 2022).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>But numbers themselves do not begin to tell the whole story of why crime rates in these homicide hellholes have risen. Starting in 2016, with the election of the first Soros rogue prosecutor, Kim Foxx, in Chicago, cities with rogue prosecutors have imposed policies that all—each and every one of them—inure to the benefit of criminals, as we have detailed in our scholarship for the past two years.</p>\n\n<p>Those policies include but are not limited to:</p>\n\n<ul><li>Refusing to prosecute entire categories of misdemeanor crimes, including theft, drug possession, shoplifting, receiving stolen property, breaking and entering, destruction of property, disturbing the peace, disorderly conduct, resisting arrest, and more.</li>\n\t<li>Forbidding prosecutors from including sentencing enhancements or allegations of prior convictions or special circumstances for egregious crimes or actions.</li>\n\t<li>Forbidding prosecutors from seeking the death penalty in any case.</li>\n\t<li>Forbidding prosecutors from seeking life without parole sentences for any crime.</li>\n\t<li>Refusing to prosecute violent teenagers in adult court for such crimes as murder, child abuse, and rape.</li>\n\t<li>Requiring prosecutors to ask for the release of duly convicted violent felons, whose appeals have been denied, after these felons have served as least 15 years of a longer sentence.</li>\n\t<li>Prohibiting or limiting prosecutors from asking for bail to ensure the presence of the defendant at the next court hearing and/or taking into consideration the defendant’s prior criminal record.</li>\n</ul><h3>Conclusion</h3>\n\n<p>The foregoing policies—and dozens of other pro-criminal, anti-victim policies—have contributed to the lawlessness across blue cities and the steep rise in crime rates. To suggest now that Republican elected officials who have followed different policies have contributed to crime increases is at best laughable.</p>\n\n<p><i><b>Charles D. Stimson</b> is Deputy Director of the Edwin Meese III Center for Legal and Judicial Studies and Senior Advisor to the President at The Heritage Foundation. He also is a Senior Fellow and Manager of the National Security Law Program in the Meese Center. <b>Zack Smith</b> is a Legal Fellow and Manager of the Supreme Court and Appellate Advocacy Program in the Meese Center. <b>Kevin D. Dayaratna, PhD,</b> is Chief Statistician, Data Scientist, and Senior Research Fellow in the Center for Data Analysis at The Heritage Foundation.</i></p>\n\n<h3>Appendix</h3>\n\n<p>We utilized 2021 homicide data from County Health Rankings & Roadmaps (CHR&R), a program of the University of Wisconsin Population Health Institute. CHR&R provides point and interval estimates for county-level and state-level homicide rates from 2014–2020 and population estimates from 2020.</p>\n\n<p>We took point estimates of these rates and county-level population statistics to compute the raw number of homicides in each county. These estimates were rounded to the nearest integer to avoid fractional homicides and subsequently summed to generate an overall pooled estimate of the state’s raw number of homicides from 2014—2020, which were then divided by the state’s population to determine an overall state-level homicide rate.</p>\n\n<p>These state-level homicide rates differ slightly from the overall state homicide rates reported in CHR&R, likely because the authors of the dataset used a population figure that is different from what is available in the dataset. Nevertheless, the alternative state rankings presented in Table 1 do not differ appreciably from these rankings using the dataset’s original homicide rates. Furthermore, these alternative rankings are necessary for an understanding of particular counties’ impact on overall state-level homicide rates as examined in this report.</p>",
  "pubDate": "Fri, 04 Nov 2022 07:12:18 -0400",
  "dc:creator": "Charles Stimson, Zack Smith , Kevin D. Dayaratna",
  "guid": "https://www.heritage.org/crime-and-justice/report/the-blue-city-murder-problem"
}