{
  "title": "Calling In the Call-Out Culture with Loretta J. Ross (168)",
  "link": "https://therapistuncensored.com/episodes/call-out-culture-168/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=call-out-culture-168",
  "pubDate": "Tue, 01 Feb 2022 00:05:48 +0000",
  "guid": "https://therapistuncensored.com/?p=12579",
  "description": "\"Call-out culture\" - a term coined within the last few years, but a concept that has existed long before. With a society immersed in technology, there are many positives about the seemingly never-ending conversation, but with the increase in connection, there&#039;s also an increase in the ability to speak negatively to and about one another. How do we educate others without tearing them down? In a divided world, changing our approach can help create social change. Loretta J. Ross, an activist, professor, and self-proclaimed \"professional feminist\" has dedicated years of her life to understanding how and why this culture has evolved. Follow along in her insightful discussion with co-host, Sue Marriott as they explore the intentions behind these actions, the root of the issue, and how to more effectively \"call-in\" without \"calling out\" using the \"Five C Continuum\" process.",
  "enclosure": "",
  "itunes:subtitle": "The 5 C&#039;s of effectively getting your point across - it&#039;s not nice, it&#039;s pragmatic!",
  "itunes:summary": "The venerable Loretta Ross shares her techniques of compassionate and practical wisdom from decades of fighting from multiple angles for human rights. From working with familes post-KKK to reproductive justice, she makes no bones about putting people in their place but does so with love and firmness.  This episode will help you more effectively have ANY hard conversation, which with the polarization in families and nationally right now, we all have so much to learn. She describes the appropriate and inappropriate  use of shame, and the surprising and important role of self-forgiveness for people with white bodies.   She talks directly to young activists with love and compassion and fire.  This conversation with Sue Marriott, co-host of Therapist Uncensored, will have you feeling, guaranteed! More at www.therapistuncensored.com/episodes.",
  "itunes:author": "Loretta Ross, Sue Marriott",
  "itunes:image": "",
  "itunes:season": 6,
  "itunes:episode": 168,
  "itunes:title": "Calling in Call-out Culture with expert guest Loretta Ross",
  "itunes:duration": "1:05:22"
}