{
  "title": "S15 Ep103: The Hauntings and History of the Emerald Isle",
  "link": "https://audioboom.com/posts/8098421",
  "itunes:episode": 103,
  "itunes:title": "The Hauntings and History of the Emerald Isle",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4657,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio goes on a journey to the dark side of the Hauntings and History of the Emerald Isle with guest June Gossler Anderson.<br>\n<br>\nEvery year Darkness Radio Dave Schrader goes on fascinating travels to far away places to investigate the history and hauntings of ancient countries, one of his favorite places in the world is Ireland. June Gossler Anderson joined Dave on many of these trips and has begun documenting the stories, the fables and the experiences that are uncovered on these quests. Today we look into the ghost stories and experiences in Ireland and other experiences with the other side that June and Dave shared.<br>\n<br>\nIreland is famous for its “thin places,” a membrane or a thin layer between worlds that cross over each other. From pagan times to the present, Ireland’s dark history has been recorded in its abbeys and churches, forts and castles, jails, and graveyards by those who lived during those turbulent times and often perished because of them. Their ghosts are eyewitnesses to this history and sometimes they are the history. <br>\n<br>\nGet the book here:  <a href=\"https://amzn.to/3dj009A?fbclid=IwAR0cDaYC47jNlqx2rPWfYABmxpsdffTDcmxriF386TmK4vK7WqOzFucvpzY\">https://amzn.to/3dj009A</a>  <br>\n<br>\n<br>\nSee the video here from Ireland discussing The Banshee:   <a href=\"https://bit.ly/3iWpZVn?fbclid=IwAR1Dlq4Fer37C87hn_-oVYuoZB7ZVoY5aWgkqOrVKJOjxR_hgj-gqONoiCk\">https://bit.ly/3iWpZVn</a>  </p>\n",
  "itunes:summary": "Darkness Radio goes on a journey to the dark side of the Hauntings and History of the Emerald Isle with guest June Gossler Anderson.\n\nEvery year Darkness Radio Dave Schrader goes on fascinating travels to far away places to investigate the history and hauntings of ancient countries, one of his favorite places in the world is Ireland. June Gossler Anderson joined Dave on many of these trips and has begun documenting the stories, the fables and the experiences that are uncovered on these quests. Today we look into the ghost stories and experiences in Ireland and other experiences with the other side that June and Dave shared.\n\nIreland is famous for its “thin places,” a membrane or a thin layer between worlds that cross over each other. From pagan times to the present, Ireland’s dark history has been recorded in its abbeys and churches, forts and castles, jails, and graveyards by those who lived during those turbulent times and often perished because of them. Their ghosts are eyewitnes...",
  "pubDate": "Thu, 03 Dec 2020 09:00:00 +0000",
  "guid": "304aff00-b116-4b06-991a-ac85003a9fb3",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}