{
  "id": "https://bibleinoneyear.org/en/youth/66",
  "title": "Day 66: God Has Rescued Me",
  "description": "Psalm 31:1–8, Leviticus 16:21–22, Mark 14:3–9,12-16. As I look back on my life, I can see many occasions when God has rescued me  As you face difficult situations you can trust that God will rescue you",
  "pubDate": "Mon, 07 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/66/",
  "itunes:duration": "12:58",
  "guid": "enyouth07032022-66",
  "length": 778.21,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 66: God Has Rescued Me",
  "itunes:subtitle": "Psalm 31:1–8, Leviticus 16:21–22, Mark 14:3–9,12-16. As I look back on my life, I can see many occasions when God has rescued me  As you face difficult situations you can trust that God will rescue you",
  "itunes:summary": "Tony Bullimore, aged fifty-six, was one of Britain’s most experienced transatlantic yachtsmen. He was feared dead after his sixty-foot yacht, Exide Challenger, capsized amid the icy vastness of the Southern Ocean, two months into the Vendée Globe round-the-world race.\nThe keel came off in fifty-foot waves. The boat went over. In his book, Saved, Bullimore described it as being like the Niagara Falls upside down. For four days he was entombed in a dark, noisy, wet and cold upside-down world with fifty-foot swells and a temperature hovering around freezing.\nHe suffered the discomfort of seasickness and drawing breath from a few feet of air between the water level and what was once the bottom of the boat. He was more than a thousand miles from the nearest land. As the air supply diminished he prayed that he would be rescued.\nIt was the Royal Australian Navy that came to the rescue. With modern satellite and surveillance technology the Australian government had pinpointed the progress of all the yachts and sent out a rescue team.\nAfter four days, Bullimore heard banging on the side of his yacht. He said afterwards, ‘I can never thank the Australian Navy enough for what they have done because they have genuinely saved my life, there is no question.’ The first words when he emerged were, ‘Thank God, it is a miracle.’ He said, ‘I felt like I had been born all over again. I felt like a new man. I felt I had been brought to life again.’\nAs one journalist put it at the time, ‘A rescue that succeeds against all odds and every expectation is the best of all stories. It is pure and spontaneous joy.’ Supremely Jesus ‘gave himself for our sins to rescue us’ (Galatians 1:4a).\nAs I look back on my life, I can see many occasions when God has rescued me. As you face difficult situations you can trust that God will rescue you.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 431
}