{
  "title": "GAN and Deep Fakes, Part 1",
  "link": "https://malicious.life/gan-and-deep-fakes-part-1/",
  "pubDate": "Thu, 19 Dec 2019 15:33:37 +0000",
  "guid": "http://malicious.life/?p=910",
  "comments": "https://malicious.life/gan-and-deep-fakes-part-1/#respond",
  "wfw:commentRss": "https://malicious.life/gan-and-deep-fakes-part-1/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "Over the past two years, the internet has been inundated with celebrity Deep Fake videos of all kinds: Obama, Putin, and Trump deliver speeches they never gave, Gal Gadot \"stars” in a porn video, and professional comedians such as Bill Hader eerily turn into the people they impersonate, like Tom Cruise and Arnold Schwarzenegger. \n\nWhat all of these videos have in common is that they were mostly created by amateur developers or small startups with tight budgets - but their quality is surprisingly good, and in some cases as good as what the biggest movie studios were able to produce with huge budgets just a few years ago. \n\n\n\nSo what happened in the last five years, that turned special effects from being the exclusive domain of industry experts - into something a 14-year-old can create more or less at the touch of a button? Like the top end of a floating glacier, Deep Fakes are by and large only the visible product of a fascinating - and much deeper - technological revolution in the field of artificial intelligence. As we shall soon see, this revolution has the potential to put some very powerful tools in the hands of both attackers and defenders in the world of cyber-security.",
  "content:encoded": "\n<p>Over the past two years, the internet has been inundated with celebrity Deep Fake videos of all kinds: Obama, Putin, and Trump deliver speeches they never gave, Gal Gadot &#8220;stars” in a porn video, and professional comedians such as Bill Hader eerily turn into the people they impersonate, like Tom Cruise and Arnold Schwarzenegger.&nbsp;</p>\n\n\n\n<p>What all of these videos have in common is that they were mostly created by amateur developers or small startups with tight budgets &#8211; but their quality is surprisingly good, and in some cases as good as what the biggest movie studios were able to produce with huge budgets just a few years ago.&nbsp;</p>\n\n\n\n<p>So what happened in the last five years, that turned special effects from being the exclusive domain of industry experts &#8211; into something a 14-year-old can create more or less at the touch of a button? Like the top end of a floating glacier, Deep Fakes are by and large only the visible product of a fascinating &#8211; and much deeper &#8211; technological revolution in the field of artificial intelligence. As we shall soon see, this revolution has the potential to put some very powerful tools in the hands of both attackers and defenders in the world of cyber-security.&nbsp;</p>\n\n\n\n<p> </p>\n",
  "enclosure": "",
  "itunes:subtitle": "Over the past two years, the internet has been inundated with celebrity Deep Fake videos of all kinds: Obama, Putin, and Trump deliver speeches they never gave, Gal Gadot \"stars” in a porn video, and professional comedians such as Bill Hader eerily tur...",
  "itunes:summary": "Over the past two years, the internet has been inundated with celebrity Deep Fake videos of all kinds: Obama, Putin, and Trump deliver speeches they never gave, Gal Gadot \"stars” in a porn video, and professional comedians such as Bill Hader eerily turn into the people they impersonate, like Tom Cruise and Arnold Schwarzenegger. <br />\n<br />\nWhat all of these videos have in common is that they were mostly created by amateur developers or small startups with tight budgets - but their quality is surprisingly good, and in some cases as good as what the biggest movie studios were able to produce with huge budgets just a few years ago. <br />\n<br />\n<br />\n<br />\nSo what happened in the last five years, that turned special effects from being the exclusive domain of industry experts - into something a 14-year-old can create more or less at the touch of a button? Like the top end of a floating glacier, Deep Fakes are by and large only the visible product of a fascinating - and much deeper - technological revolution in the field of artificial intelligence. As we shall soon see, this revolution has the potential to put some very powerful tools in the hands of both attackers and defenders in the world of cyber-security.",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:explicit": "clean",
  "itunes:duration": "43:28"
}