{
  "title": "#492: The Defining Chapters of the Big Seven Harry Potter Characters",
  "link": "https://audioboom.com/posts/7736221",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4000,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Thanks to all who came out to Quizzitch Live: Weasley Thanksgiving edition! If you missed it, <a href=\"https://www.youtube.com/watch?v=5SHi8Lavy_w\">watch it now</a>!</li>\n<li>Main Discussion: What chapters from the Harry Potter books best define the \"Big Seven\" characters?</li>\n<li>Is Harry's heroism better represented anywhere than in \"The Forest Again\"?</li>\n<li>Does Draco's inaction speak as much to his character as his inaction?</li>\n<li>Can a character's defining chapter be the chapter in which they are introduced?</li>\n<li>The hosts propose runner-up chapters that show different sides of a character</li>\n<li>Ginny and Neville both assert themselves in the chapters we chose.</li>\n<li>Is Luna Lovegood's defining chapter one in which she does not physically appear?!</li>\n<li>Listeners weigh in with defining chapters for additional characters!</li>\n<li>Quizzitch: Who did Snape tell off for using the word “Mudblood,” during the Prince's Tale? And who was it said about?</li>\n<li>This week's episode is sponsored by <a href=\"http://www.usualwines.com\">Usual Wines</a> (Enter code \"MuggleCast\" for $8 off your first order and your first glass on us!), <a href=\"https://www.literati.com/mugglecast\">Literati</a> (get 25% off your first two orders!) and <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp</a> (Receive 10% off your first month).</li>\n<li>In Bonus MuggleCast, available exclusively on Patreon, we'll be discussing Dumbledore and Snape's defining chapters, or CHAPTER?!</li>\n<li>Support us on Patreon and receive magical benefits, like Bonus MuggleCast! And, participate in our magical Holiday gift exchange.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 24 Nov 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-11-23:/posts/7736221",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}