{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-8491573717448919493",
  "published": "2020-06-11T11:00:00.000-07:00",
  "updated": "2020-06-15T09:16:55.828-07:00",
  "title": "Susan Wojcicki: My mid-year update to the YouTube community",
  "content": "<i>Several times a year, CEO Susan Wojcicki <a href=\"https://youtube.googleblog.com/2020/02/youtube-at-15-my-personal-journey.html\" target=\"_blank\">updates</a> users and creators on YouTube’s priorities. This Letter addresses initiatives to support the Black community, the impact of COVID-19, and how YouTube is working on behalf of creators. </i><br /><br />In the last few months, we’ve experienced enormous tragedy and loss.  <br /><br />As people around the world have felt the devastating impact of the COVID-19 crisis, they’ve dealt with illness, loneliness, unemployment, and juggled added responsibilities with kids at home. <br /><br />And over the past few weeks, we’ve grieved together as the Black community has endured more senseless acts of racial terror and violence. We know that for many, tragedies like these are a persistent reminder of the harm caused by systemic racism. They also compound the toll of the pandemic, which disproportionately impacted Black and Brown communities in the U.S. and abroad. <br /><br />At YouTube, we believe Black lives matter and we all need to do more to dismantle systemic racism. We join in protest against the murders of George Floyd, Breonna Taylor, Ahmaud Arbery, and so many others before them. <br /><br />The painful events of this year have reminded us of the importance of human connection and the need to continue to strengthen human rights around the world.  <br /><br />Our platform has been a place where people come together since YouTube first launched <a href=\"https://youtube.googleblog.com/2020/02/youtube-at-15-my-personal-journey.html\" target=\"_blank\">15 years ago.</a>&nbsp;And in the midst of uncertainty, creators continue to share stories that might not otherwise be heard while also building online communities.  <br /><br /><h3>Supporting the Black community </h3><br />We have always been proud that we are a platform that celebrates a broad and diverse set of voices. And we have implemented many policies and product features to protect our communities. <br /><br />But we recognize we need to do more, in particular with the Black community, and that is why we are committing to following actions. <br /><br /><h4>Amplifying Black voices </h4><br />We’re committed to doing better as a platform to center and amplify Black voices and perspectives. <br /><br /><br /><ul><li>Today, we’re announcing a multi-year $100 million fund dedicated to amplifying and developing the voices of Black creators and artists and their stories.</li><br /><li>And one example of the type of content we’d like to elevate on the platform will premiere this Saturday, June 13. We’ll host a live stream fundraising event produced by YouTube Originals (YTO), <a href=\"https://www.youtube.com/watch?v=bJ38YduTchI&amp;feature=youtu.be\" target=\"_blank\">“Bear Witness, Take Action.”</a> The YTO will bring together creators, artists, influential public figures and prominent activist voices for roundtable discussions and musical performances, with donations benefiting the <a href=\"https://eji.org/\" target=\"_blank\">Equal Justice Initiative</a>.</li><br /><li>Through the month of June, our Spotlight channel will highlight racial justice issues, including the latest perspectives from the Black community on YouTube alongside historical content, educational videos, and protest coverage. This content showcases incredibly important stories about the centuries-long fight for equity.   </li></ul><br /><br /><h4>Protection from hate and harassment </h4><br />We’ve taken many steps over the years to help protect diverse communities from hate and harassment across the platform, including Black creators and artists. And last year, we developed more stringent <a href=\"https://support.google.com/youtube/answer/2801939?hl=en&amp;ref_topic=9282436\" target=\"_blank\">hate speech</a> and <a href=\"https://support.google.com/youtube/answer/2802268?hl=en\" target=\"_blank\">harassment</a> policies. Our updated hate speech policy specifically bans videos alleging that a group is superior based on qualities like race, gender, religion, or sexual orientation in order to justify discrimination, segregation or exclusion.  <br /><br />As a result of these changes and our ongoing enforcement, last quarter alone we removed over 100,000 videos and 100 million comments for hate and harassment. <br /><br />That said, we know there’s more work to do. <br /><br />Building on our work over the past several years, we’re taking this moment to examine how our policies and products are working for everyone&nbsp;<span style=\"background-color: white; color: #222222; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 16px;\">⁠—</span>&nbsp;but specifically for the Black community&nbsp;<span style=\"background-color: white; color: #222222; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 16px;\">⁠—</span>&nbsp;and close any gaps. And more broadly, we will work to ensure Black users, artists, and creators can share their stories and be protected from hateful, white supremacist, and bullying content.<br /><br />Generations of Black Americans have been waiting for justice in the United States, and we know the effect of inequality is felt around the world.  <br /><br />I’m committed to listening&nbsp;<span style=\"background-color: white; color: #222222; font-family: &quot;roboto&quot; , &quot;arial&quot; , sans-serif; font-size: 16px;\">—&nbsp;</span>to Black employees at YouTube, to Black creators, to Black artists, to leaders in the Black community, and to Black users who tune in to YouTube every day.<br /><br />There is much work to do to advance racial equity in the long-term, and these efforts will continue in the months and years ahead. <br /><br /><h3>Connecting people with useful information, responsibly </h3><br />Over the past few months, another top priority has been connecting people to trusted information as the coronavirus pandemic spread around the globe. Our teams started by engaging with public health officials in more than 90 countries so they could make locally relevant information available, which we display on our homepage and in panels that appear on videos and in search results about COVID-19. Collectively, these panels have been shown more than 200 billion times.  <br /><br />YouTube also launched a dedicated COVID-19 news shelf, with videos from health authorities and news organizations, in more than 30 countries around the world. We’ve found that when people come to YouTube searching for coronavirus topics, on average 94 percent of the videos they see in the top 10 results come from high authority channels. We think this is important progress, even as we keep working to bring that number higher. <br /><br />In addition to raising up trusted information, we have also been focused on combating harmful medical misinformation. We’re consulting on an ongoing basis with health authorities like the WHO and local organizations like the CDC, the Korean Ministry of Health and Welfare, and India’s Ministry of Health and Family Welfare, as well as expert medical and public health professionals, to design policies based on the latest science. We updated our <a href=\"https://support.google.com/youtube/answer/9891785\" target=\"_blank\">policies</a> to prohibit content with harmful medical information, for example saying the virus is a hoax or claiming there is a guaranteed cure. To date, we’ve removed over 200,000 videos for violating these policies.  <br /><br />We also understand the importance of representing a broad set of voices in the public debate. There are a range of opinions on topics like how governments respond to the crisis, when and how we should reopen economies, and criticism of health authorities and government officials. We want to ensure these important discussions continue on the platform, even as we work to combat misinformation.  <br /><br />Creators also have an important role to play in helping connect people to useful information. Forty high-profile creators have spoken with leading health officials, including <a href=\"https://profiles.ucsf.edu/jaime.sepulveda\" target=\"_blank\">Dr. Jaime Sepúlveda’s</a> Spanish-language interviews with creators and <a href=\"https://www.niaid.nih.gov/about/director\" target=\"_blank\">Dr. Anthony Fauci’s</a> conversations with <a href=\"https://www.youtube.com/watch?v=8A3jiM2FNR8\" target=\"_blank\">Trevor Noah</a>, <a href=\"https://www.youtube.com/watch?v=OfcJecd6jtE\" target=\"_blank\">Dr. Mike</a>, <a href=\"https://www.youtube.com/watch?v=F2YKKba6ps0\" target=\"_blank\">Lilly Singh</a>, <a href=\"https://www.youtube.com/watch?v=r3miPW-wkfk&amp;list=PLbpi6ZahtOH71a6AQn1p3XGQ2CQSlfPIU&amp;index=5&amp;t=609s\" target=\"_blank\">Phil DeFranco</a>,&nbsp;<a href=\"https://reginabenjamin.net/\" target=\"_blank\">Dr. Regina Benjamin</a> and <a href=\"https://apha.org/about-apha/executive-board-and-staff/apha-staff/georges-c-benjamin-md\" target=\"_blank\">Dr. Georges Benjamin</a> also spoke with Black creators about the impact of COVID-19 on the Black community. These creator interviews have been seen in more than 160 countries and received more than 43 million views.  <br /><br />And more than 700 creators and artists joined YouTube’s #withme PSA campaign, encouraging users to stay home and highlighting important messages about how to stop the virus.  <br /><br />These public service announcements are reaching people around the world - they’ve received over three billion impressions.  <br /><br />Thank you to all of our creators who led the way with this initiative.  <br /><br /><h3>Learning  </h3><br />YouTube has always been a key learning resource, but we are now seeing a record amount of engagement. The average daily views of videos with homeschooling in the title have more than tripled globally in the last three months. <br /><br />As students began learning from home, some of the first events we featured on Learn@Home were live streams <a href=\"https://www.youtube.com/watch?v=1fSQkPJpBqM\" target=\"_blank\">hosted</a> by The College Board to help high school students <a href=\"https://www.youtube.com/user/advancedplacement\" target=\"_blank\">prepare</a> for Advanced Placement tests in May. The response exceeded our expectations - the videos from the first day of live streaming have received more than 700,000 views. And students preparing for AP exams through the daily live streams received unexpected support from Lin-Manuel Miranda, who recently hosted a special edition U.S. History master class.  <br /><br />Creators have launched live stream series to help students of all ages stay motivated to learn at home, from <a href=\"https://www.youtube.com/user/khanacademy\" target=\"_blank\">Khan Academy</a> to <a href=\"https://www.youtube.com/channel/UCY1kMZp36IQSyNx_9h4mpCg\" target=\"_blank\">Mark Rober</a> to <a href=\"https://www.youtube.com/channel/UCYO_jab_esuFRV4b17AJtAw/featured\" target=\"_blank\">3Blue1Brown</a>. And we’ve seen new read-alongs for children, like PBS Kids with <a href=\"https://www.youtube.com/playlist?list=PLa8HWWMcQEGStVxurBtLn8nkDxGc3j3ow\" target=\"_blank\">Michelle Obama</a> and Dolly Parton’s weekly Goodnight with Dolly. <br /><br />And students are even finding ways to keep up with physical education on YouTube by tuning in to daily shows like <a href=\"https://www.youtube.com/watch?v=jhWmnEVA0y4\" target=\"_blank\">PE with Joe</a> or taking a dance break with <a href=\"https://www.youtube.com/playlist?list=PLMr-d2PLsO95ydptpBnsxdQNSKc9iUNU0\" target=\"_blank\">KIDZ BOP</a>.  <br /><br /><h3>Enabling online connections and communities </h3><br />In our house, kids aren’t just learning online, they’re also virtually celebrating holidays, birthdays, and even hosting sleepovers with their friends. <br /><br />We’re finding new ways to connect, and at YouTube, we’re seeing communities bringing people together online.  <br /><br />People are using live streams at a much higher rate, with live watchtime on TV screens up over 250 percent year-over-year on YouTube globally during the height of stay at home measures around the world. <br /><br />Live streams are also helping us capture moments that otherwise would have been lost, like graduation ceremonies. To mark this key milestone, we developed an online <a href=\"https://www.youtube.com/watch?v=rxpTjcouaeQ\" target=\"_blank\">#DearClassof2020</a> commencement headlined by President Barack Obama and featuring <a href=\"https://www.youtube.com/channel/UCNL1ZadSjHpjm4q9j2sVtOA\" target=\"_blank\">Lady Gaga</a>, <a href=\"https://www.youtube.com/channel/UCRijo3ddMTht_IHyNSNXpNQ\" target=\"_blank\">Dude Perfect</a>, <a href=\"https://www.youtube.com/channel/UCzJIliq68IHSn-Kwgjeg2AQ\" target=\"_blank\">Jackie Aina</a>, <a href=\"https://www.youtube.com/channel/UCpi8TJfiA4lKGkaXs__YdBA\" target=\"_blank\">The Try Guys</a>, <a href=\"https://www.youtube.com/watch?v=8hx0ajieM3M\" target=\"_blank\">Malala Yousafzai</a>, former Secretary of Defense Robert M. Gates, former Secretary of State Condoleezza Rice, and Google’s own Sundar Pichai. <br /><br />Creators have also stepped in to support global relief efforts, like <a href=\"https://www.youtube.com/channel/UCYzPXprvl5Y-Sf0g4vX-m6g\" target=\"_blank\">jacksepticeye’s</a> live stream #HopeFromHome, which raised money for the United Way. Creators in the United Kingdom came together for <a href=\"https://www.youtube.com/watch?v=Pntmw76eQBc\" target=\"_blank\">Stream #WithMe</a>, a live fundraiser benefiting <a href=\"https://uk.virginmoneygiving.com/giving/NHSCharitiesCOVID19/\" target=\"_blank\">NHS</a>. And artists and creators joined <a href=\"https://www.youtube.com/watch?v=-hGR3f1ct9Q\" target=\"_blank\">One Love Asia,</a> a concert benefiting UNICEF. <br /><br />To enable the YouTube community to have even more impact, this year we’ve expanded the access to our donate button from 1,500 eligible channels to more than 40,000, allowing more creators to easily engage their audiences on causes they care about. <br /><br /><h3>Welcoming new creativity  </h3><br />Even during these incredibly difficult times, we’re seeing unprecedented creativity from our creative community. Because creators are experts at filming to suit any style, from high-production to garage studios, they were able to quickly adapt and make content that reflected our new reality, from yoga for stress release to quarantine routines.  <br /><br />And artists are bringing fans together online and making YouTube a virtual concert venue. Bands like the <a href=\"https://www.youtube.com/therollingstones\" target=\"_blank\">Rolling Stones</a>, <a href=\"https://www.youtube.com/Radiohead\" target=\"_blank\">Radiohead</a>, and the <a href=\"https://www.youtube.com/channel/UCPuuuhmMW7jh6roOrIV9yRw\" target=\"_blank\">Grateful Dead</a> are releasing live concert footage every week, giving fans something to look forward to while staying at home. Brazilian singer <a href=\"https://www.youtube.com/channel/UCwfEOn0O1DWcyTgzVVu28ig\" target=\"_blank\">Marília Mendonça</a> hosted a live stream concert on YouTube from her home last month, and the video has been viewed more than 20 million times.  <br /><br />We’re also welcoming cultural institutions that are creating or expanding their YouTube channels, giving audiences the chance to tune in to legendary performances from <a href=\"https://www.youtube.com/user/bolshoi\" target=\"_blank\">The Bolshoi Theater</a>, weekly releases of Andrew Lloyd Weber musicals on <a href=\"https://www.youtube.com/watch?v=OLeErO8nXsc\" target=\"_blank\">The Shows Must Go On</a>, and Shakespeare plays streamed by <a href=\"https://www.youtube.com/user/ShakespearesGlobe/videos\" target=\"_blank\">The Globe Theatre</a>. <br /><br />And there’s been a rise in new formats for content during quarantine. We’ve seen YouTube’s first virtual <a href=\"https://www.youtube.com/watch?v=bm8mbAPAWG0\" target=\"_blank\">fashion show</a> and a streaming <a href=\"https://www.youtube.com/weareone\" target=\"_blank\">global film festival</a>. <br /><br />Gaming creators are also drawing new audiences. <a href=\"https://www.youtube.com/watch?v=wYeFAlVC8qU\" target=\"_blank\">Travis Scott</a> leveraged the power of the popular game Fortnite to perform unreleased music to viewers around the globe without ever leaving his house. Viewers tuned in live to streams from <a href=\"https://www.youtube.com/channel/UC0bC92gFO25qcJcECTQNN_A\" target=\"_blank\">Flakes Power</a>, <a href=\"https://www.youtube.com/channel/UCd534c_ehOvrLVL2v7Nl61w\" target=\"_blank\">Muselk</a>, <a href=\"https://www.youtube.com/watch?v=2kXj0_DYmYg\" target=\"_blank\">Avxry</a>, <a href=\"https://www.youtube.com/watch?v=ej2x205NtlM\" target=\"_blank\">Valkyrae</a> and other gaming creators, with all four experiences garnering 100 million views on YouTube. <br /><br />Thank you to all the creators and organizations who are releasing new content during this time, from <a href=\"https://www.youtube.com/watch?v=5tk0FULFq-M\" target=\"_blank\">tips</a> for <a href=\"https://www.youtube.com/watch?v=K9sspffLAXg\" target=\"_blank\">working</a> at home to DIY advice from a <a href=\"https://www.youtube.com/channel/UCNepEAWZH0TBu7dkxIbluDw/videos\" target=\"_blank\">dad who launched a YouTube channel</a> to answer questions like how to hang a shelf or unclog a drain.  <br /><br />Whether your views are in the hundreds or in the millions, you’re making the world a little brighter for someone watching from home. <br /><br /><h3>YouTube creator updates </h3><br />As creators rose to meet the challenges of the pandemic, they also faced obstacles along the way. We know the uncertainty of the past few months has been hard and our team is working to provide support. In March, we adjusted our policy to enable ads for content from creators and news organizations discussing the coronavirus.  <br /><br />Given fluctuations with the advertising market, we are encouraging creators to also invest in other forms of monetization to <a href=\"https://support.google.com/youtube/answer/72857\" target=\"_blank\">grow and diversify their revenue</a>. Since the beginning of March, we saw over two million viewers support creators by purchasing their first <a href=\"https://youtube.googleblog.com/2017/01/can-we-chat-hello-super-chat.html\" target=\"_blank\">Super Chat</a>, <a href=\"https://youtube-creators.googleblog.com/2019/11/introducing-super-stickers.html\" target=\"_blank\">Super Sticker</a> or <a href=\"https://support.google.com/youtube/answer/7636690?hl=en\" target=\"_blank\">membership</a> on YouTube.  <br /><br />The number of creators earning the majority of their YouTube revenue from memberships and paid digital goods is up 40 percent since January.  <br /><br />And with more artists now going live on YouTube, we recently announced that we’ll be extending the availability of Super Chat and Super Stickers to more artist channels. <br /><br />This year we’ve also worked to give creators more control over monetization decisions and to provide transparency with our policies by expanding <a href=\"https://support.google.com/youtube/answer/7687980?hl=en\" target=\"_blank\">Self Certification</a> to all creators in the YouTube Partner Program (YPP). With Self-Certification, creators tell us what’s in their video and how it complies with our ad-friendly guidelines. <br /><br />In the past few weeks, you may have heard questions raised about Section 230, a regulation in United States law that allows YouTube to be an open platform while protecting the community from harmful content, like content that incites violence or endangers children. We believe undermining Section 230 would impact our ability to protect our users and would also significantly limit content from a wide range of creators across the political spectrum who have a voice on our platform. Such a change might require online services like YouTube to \"over-filter\" content, making it more difficult for creators to share breaking news, create learning content, expose injustice, and amplify a diversity of voices and opinions. <br /><br />We'll continue to work on your behalf to explain how eroding 230 would harm the creator ecosystem globally. <br /><br /><h3>Mental health </h3><br />YouTube creators have long been known for their authenticity, and I appreciate how creators have openly shared how hard it is to create content as we navigate new challenges. It’s important for all of us to make our mental health and wellbeing a top priority.  <br /><br />People come to YouTube every day looking for information and resources, and we realize we have a tremendous opportunity to shine a light on various health issues.  <br /><br />Over the last few months, we’ve seen a 45 percent increase in views of meditation videos and a growing popularity of mindfulness and wellbeing content. <br /><br />Our teams also recently expanded the tools available to users to help prioritize wellbeing. We’ve added a new <a href=\"https://support.google.com/youtube/thread/48055830?hl=en\" target=\"_blank\">bedtime reminder</a>, in addition to our “take a break” option, to help viewers manage their time on YouTube. <br /><br />And through our Get By #WithMe <a href=\"https://www.youtube.com/channel/UCBR8-60-B28hp2BmDPdntcQ\" target=\"_blank\">campaign</a>, we’ve partnered with creators to spotlight videos like Why Support Helps with <a href=\"https://www.youtube.com/user/KatiMorton\" target=\"_blank\">Kati Morton</a>. Creators like Kati are helping educate and reduce the stigma associated with mental health.  <br /><br />The past few months have been incredibly challenging, and we still have a long road ahead of us. But even in these difficult circumstances, I’m finding glimmers of hope every day on YouTube - your passion and creativity have been inspiring.  <br /><br />Thank you for all the ways you’re coming together to support one another, and for all the ways you’re giving back.  <br /><br />You’re reminding us to look for the good, even when so many things about life feel out of order.  <br /><br />Thank you for being a part of our community. Whether you’re connecting with people on YouTube across your city or across the world, your voices are coming together to make a difference. <br /><br /><i>Susan Wojcicki </i>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}