{
  "title": "Political Change with Ed Lopez",
  "pubDate": "Fri, 19 Jul 2019 01:03:20 +0000",
  "guid": "6b247361e3ec4bbd89c768748ffad8d4",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP127Lopez_EDR.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Madmen-Intellectuals-Academic-Scribblers-Political/dp/0804793395/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=c1f64d34361579f1817838ae42b15977&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=0804793395&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=0804793395\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Today's guest is Edward J. Lopez of Western Carolina University. We discuss his book, <a href=\"https://amzn.to/2JP4Ywv\" target= \"_blank\" rel=\"noopener\">Madmen, Intellectuals, and Academic Scribblers: The Economic Engine of Political Change</a>, which was co-authored with Wayne Leighton.</p> <blockquote>Does major political reform require a crisis? When do new ideas emerge in politics? How can one person make a difference?<br /> <br /> In short: how and when does political change happen? Madmen, Intellectuals, and Academic Scribblers tackles these big questions, arguing that ideas and entrepreneurship are the key ingredients in any episode of political change. Authors Wayne A. Leighton and Edward J. López begin with the first lesson in economics — incentives matter — and artfully explain how the lesson applies throughout political life. Incentives explain why democracies often generate policies that impose net costs on society, and why these inefficient policies persist for years.<br /> <br /> Yet beneficial reform does sometimes occur. So Madmen goes beyond incentives to offer a framework in which political change channels its way from ideas in society, through society’s shared institutions (i.e., its rules of the game) , which in turn shape incentives. This type of change is seldom easy, because new ideas for shaping the rules of the game must overcome two forces in society: widely shared beliefs and powerfully vested interests. Yet at certain political moments – perhaps during a crisis, but not always – shared beliefs and vested interests begin to weaken, and the opportunity for reform emerges. Within this framework, Madmen shows why certain inefficient policies eventually get repealed (e.g., airline rate and route regulation), while others endure (e.g., sugar subsidies and tariffs).</blockquote> <hr /> <p><strong>Links</strong></p> <p>In the course of the conversation, Ed mentions <a href= \"https://amzn.to/2LrGMDN\" target=\"_blank\" rel=\"noopener\">Thomas Hazlett's work on the radio spectrum</a> and <a href= \"http://www.econtalk.org/tina-rosenberg-on-the-kidney-market-in-iran/\" target=\"_blank\" rel=\"noopener\">Tina Rosenberg's discussion of Iranian kidney markets on Econtalk.</a></p>",
  "content:encoded": "<a href= \"https://www.amazon.com/Madmen-Intellectuals-Academic-Scribblers-Political/dp/0804793395/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=c1f64d34361579f1817838ae42b15977&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Today's guest is Edward J. Lopez of Western Carolina University. We discuss his book, <a href=\"https://amzn.to/2JP4Ywv\" target= \"_blank\" rel=\"noopener\">Madmen, Intellectuals, and Academic Scribblers: The Economic Engine of Political Change</a>, which was co-authored with Wayne Leighton.</p> Does major political reform require a crisis? When do new ideas emerge in politics? How can one person make a difference?  In short: how and when does political change happen? Madmen, Intellectuals, and Academic Scribblers tackles these big questions, arguing that ideas and entrepreneurship are the key ingredients in any episode of political change. Authors Wayne A. Leighton and Edward J. López begin with the first lesson in economics — incentives matter — and artfully explain how the lesson applies throughout political life. Incentives explain why democracies often generate policies that impose net costs on society, and why these inefficient policies persist for years.  Yet beneficial reform does sometimes occur. So Madmen goes beyond incentives to offer a framework in which political change channels its way from ideas in society, through society’s shared institutions (i.e., its rules of the game) , which in turn shape incentives. This type of change is seldom easy, because new ideas for shaping the rules of the game must overcome two forces in society: widely shared beliefs and powerfully vested interests. Yet at certain political moments – perhaps during a crisis, but not always – shared beliefs and vested interests begin to weaken, and the opportunity for reform emerges. Within this framework, Madmen shows why certain inefficient policies eventually get repealed (e.g., airline rate and route regulation), while others endure (e.g., sugar subsidies and tariffs).  <p>Links</p> <p>In the course of the conversation, Ed mentions <a href= \"https://amzn.to/2LrGMDN\" target=\"_blank\" rel=\"noopener\">Thomas Hazlett's work on the radio spectrum</a> and <a href= \"http://www.econtalk.org/tina-rosenberg-on-the-kidney-market-in-iran/\" target=\"_blank\" rel=\"noopener\">Tina Rosenberg's discussion of Iranian kidney markets on Econtalk.</a></p>",
  "enclosure": "",
  "itunes:duration": "01:05:06",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is Edward J. Lopez of Western Carolina University. We discuss his book, , which was co-authored with Wayne Leighton. Does major political reform require a crisis? When do new ideas emerge in politics? How can one person make a...",
  "itunes:episode": 127,
  "itunes:episodeType": "full"
}