{
  "id": "yt:video:8cncmwzrVmU",
  "yt:videoId": "8cncmwzrVmU",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "The cloud tier list",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-10-23T09:01:03+00:00",
  "updated": "2022-10-23T18:34:48+00:00",
  "media:group": {
    "media:title": "The cloud tier list",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get yourself a clean, waste-free shave with Henson Shaving! Use code \"simon\" for 100 free blades: https://bit.ly/3ga5KYF\n\nClouds come in all sorts of shapes and sizes, and some of them are objectively better than others. In this entirely serious, scientific, and non-biased video I talk about which clouds are great, and which ones can get in the atmospheric bin. If you don't know your cumulus from your cirrus, this video will also help you out.\n\nThis video was chosen by my patrons! You can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty.\nEdited by Luke Negus.\n\nMy super serious cloud tier list, ranking cloud types, Luke Howard birthday, cumulus clouds and cirrus clouds.\n\nHuge thanks to my supporters on Patreon: Mark Injerd, dryfrog, Justin Warren, Jack Grimm, Angela Flierman, Alipasha Sadri, Calum Storey, Mattophobia, Riz, Jan Krüger, The Confusled, Wessel van der Heijden, Conor Safbom, William Pettersson, Paul H and Linda L, Simon Stelling, Gabriele Siino, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Leonard Neamtu, Brady Johnston, Liat Khitman, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Cio Cio San, Farsight101, K.L, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, HandsomeCaveman, Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Rafaela Corrêa Pereira, Colin J. Brown, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}