{
  "title": "What Is The Goal of Building AIs?",
  "link": "",
  "updated": "2021-07-10T00:00:00-07:00",
  "id": "http://jtoy.net/blog/what-is-the-goal-of-building-ais?",
  "content": "<h1 id=\"what-is-the-goal-of-building-ais\">What Is The Goal of Building AIs?</h1>\n\n<p>Published Sat, Jul 10, 2021</p>\n\n<p>You’d think with the possibility of the Singularity wiping out humans, we’d be more careful and try not to advance so fast.</p>\n\n<p>There is clearly a strong emphasis of AI in pop culture, government, scientific research, and many other facets of life. Where does this fascination with AI come from?  I want try  to explain our obsession  with wanting to create an Artificial Intelligence.</p>\n\n<p>There are several camps of people trying to bring about artificial intelligence.</p>\n\n<h2 id=\"computer-science\">Computer Science</h2>\n\n<p>Computer Science (CS) is the study of computation and algorithmic processes. One way I like to think about CS is about turning processes and everyday phenomenons into computationally efficient representations.\nThe first Computer Science Degree was creted in 1953 at the University of Cambridge and since then CS has become one of the most widely studied topics in the world. There are a very diverse set of subfields such as operating systems, data structures, algorithms, cryptography, databases, computational chemistry, computational neuroscience, computational physics, compiler design, and of course artifical intelligence. No matter what area a computer scientist focuses on, artificial intelligence will always come up.  To a computer scientist, AI is the pinacle of computer design and engineering.  With building an AI, you could potentially build anything instead of having to hand craft it yourself. Many computer scientists dream of building intelligent computer systems that can solve any computational problem. Often the problems a computer scientist studies in university are very different from real world software engineering problems.</p>\n\n<h2 id=\"philosophers-and-scientific-knowledge-seekers\">Philosophers and scientific knowledge seekers</h2>\n<p>People think of AI as a field since basically the early 1900’s, but in  many ways the field is actually a lot older.</p>\n\n<p>In our oldest recorded history there have been philosophers  questioning the very nature of ourselves and intelligence. Why is it that we can communicate with others, yet animals cannot do so at the level we can.  Humans can use multitudes of tools, think about the past and future, recognize themselves, while most other animals can’t do any of  these things. Over the thousands of years of recorded human history, we have been contemplating and theorizing about how we come to be.</p>\n\n<p>For example,  René Descartes published some writing to show that animals were mechanistic robots  that had no emotions which shaped how society treated animals.  Many philosophers and scientist want to fundamentally understand how our mind works and if it is fundamentally possible to create intelligence inside of a computer.  As long as the human race still exists, humans will continue to try and understand how we are different and how our intelligence works.\nWe did not have computers until the 1900’s, but we have been trying to understand these questions using philosophy. Creating AIs helps us to better understand ourselves and all living beings. AIs will ultimately let us know if we are truly unique or just some freak accident in the evolutionary chain that can be replicated and improved.</p>\n\n<h2 id=\"life-extensions-and-immortality\">Life extensions and Immortality</h2>\n<p>Most people dream of living forever and for some of the rich who have made their money through technology ventures, many of them are trying.\n  There are billions of dollars being invested into companies and technologies that could make us immortal such as cryogenics which can freeze our brains and bodies for later revival, stem cell preservation, brain scanning technology, limb replacement technology, brain computer interfaces (BCI), and extreme forms of diets are some of the technologies being developed. AI is seen as a key component to helping us achieve immortality in multiple ways.  AI technologies help researches find answers faster to current scientific problems. For example, in 2021 Google DeepMind released AlphaFold2, an computational model that can predict protein structure.  Proteins are large complex molecules that are essential to all life. Almost all functions that our bodies perform rely on protein and so if we can understand proteins, we gain a deeper understanding of life, biology, aging, and disease.  By knowing the shape of a protein,it’s role within the cell can be estimated and then drugs can be developed that work with those proteins. Typically the way scientists have examined the shape of a single protein is to use advanced technologies such as X-ray crystallography, nuclear magnetic resonance and cryo-electron microscopy. Those experimental technologies are all error prone and cost a lot of resoures, both time and money wise. To see the shape of a single protein structure can take up to years of works and cost millions of dollars.\n   At Seung Lab and Eyewire, we worked on building neural networks that scan brain images to reconstruct a human brain network, called a connectome. The connectome is a complete description of an organism’s structural connectivity of the brain and nervouse system similar to how the genome maps all the genetic material of an organism. Think of the connectome as a wiring diagram of the brain. Due to the massive size and complexity of the human brain, it is not currently possible to scan and store the whole connectome for a single human brain. It would require more storage than currently all the hard drives on earth combined to just store the data. So instead, most research groups focus on cutting out specific brain tissue regions the size of a few microns.</p>\n\n<p>Capitalism, businesses, labor, and algorithmic efficiency</p>\n\n<p>Business are constantly  trying to improve efficiency and lower costs to generate more revenue. If one company finds a technique to lower costs they can then sell to their customers for a cheaper price and generate more revenue. Other companies will try to copy those techniques creating a never ending battle for who can generate the most revenue.  Computers and technology have accelerated this trend even more. Companies that are using technology to compete try to develop more sophisticated algorithms and this has led to using more AI and machine learning as a competitive advantage. If you are a company competing with other companies, you are always looking to be more efficient and replacing human  labor is looked at more often as technology improves. One of the earliest times this happened is when textile factories replaced humans who hand weaved textiles with machines that could weave faster and cheaper.\nAmazon, the online store that sells everything, uses AI and robots to move packages between warehouses, which replaced humans from having to manually move packages across the warehouse. Notably, as of 2021 Amazon or any other company has not figured out a reliable way to use robots to get packages into an individual box destined for a customer’s home. That is due to not having enough technology and understanding of the sensorimotor system to create robotic hands that work like human hands.\nAlmost every large company that has phone support has replaced all or most of their human support specialists with AI computer systems that can talk and understand basic concerns a customer might have. This reduces the cost of having to employ people to man the telephone system.\nMicrosoft, the operating system creator, has implemented an AI technology called CoPilot which gives code snippet suggestions as a software developer types into their code editor. Think of it as super version of spelling and grammar check, but for code. This will allow for faster and cheaper software products to be produced, which will reduce the amount of software engineers employed.</p>\n\n<p>With capitalism, one of the most expensive costs for a business is human labor: salaries are expensive, they can be unreliable, finicky, get sick , need to be managed,  and have other problems,  while a computer can keep going non-stop and won’t complain.<br />\nCapitalists want to take as many human employees out of the job , so they have fewer workers to pay and manage. \nAs long as capitalism’s model of “cheapest cost no matter what” is the main paradigm, this is the path that technology and capitalism with create.</p>\n\n<h2 id=\"racing-to-save-the-planet-and-the-human-race\">Racing to save the planet and the human race</h2>\n\n<p>Many people such as Stephan Hawking and Elon Musk, believe the human race is in a downward spiral.  We are overpopulating the earth, consuming all resources, destroying all the habitats and ecosystems of all living things, which will eventually lead to the destruction of the earth and the human race. The thought is that artificial intelligence could potentially save us. Our scientific knowledge and acquisition moves slow compared to the rate at which humans are utilizing and destroying the earth’s resources. If we could develop an AI, it could potentially learn  much faster than us and help us solve all kinds of problems more efficiently such as:</p>\n<ul>\n  <li>how can we feed the growing human population</li>\n  <li>how can we generate enough energy to power all of humanity’s needs in a clean and environmentally safe way</li>\n</ul>\n\n<h1 id=\"government-and-protecting-countries\">Government and protecting countries</h1>\n\n<p>Governments around the world are constantly trying to gain a competitive advantage against each other economically and/or with military power. During the 2010’s, The United States and China have been developing AI’s as a continuation of an algorithmic arms race. Think about the race in the 1960s to the moon between the US and Russia. They were fighting each other to see who would be the first to make it to the moon and that fight caused them to push each other and accelerate their technology.  Even with a public race, governments are constantly researching new technologies and AI is an are that the US government has spent a lot of time on in for example autonomous vehicles, life long learning models ,symbolic reasoning,  real time machine learning, and more. Its not just about competing with other countries,China is widely known to collect massive amounts of data relating to its people to train  models that are to do full facial scanning of its whole population and give social credit scores to every citizen.   AI is the next level of technology advancement for governments to grow and gain a competitive edge as many technologies such as deep learning show lots of promise. \nVladimir Putin, president of Russia at one time, predicted that whichever country leads the way in AI research will come to dominate global affairs.\npostal workers</p>\n\n<p>As long as the human race exists and true AI hasn’t been created, there will always be people working to solve AI. Humans’ competitive nature and curiosity into the mind along with the never ending technological progress will cause humans to never stop working towards this goal. Only if some large catastrophe will humans stop working toward this.</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>* money/ power\n* solve science\n* Eliminate workers/ jobs\n* Immortality\n* Computer science goals\n* getting off the planet\n* futurists\n</code></pre></div></div>"
}