{
  "title": "131: TREAD",
  "link": "https://audioboom.com/posts/7573928",
  "itunes:episode": 131,
  "itunes:title": "TREAD",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3029,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>YOU GUYS WE REALLY LIKE THIS ONE!! WE ALMOST NEVER SAY THAT!</strong><br>\n<br>\nMarvin Heemeyer was a beloved resident of Granby, Colorado. He was a welder by trade and he loved his work. But slowly he came to believe that the town was out to get him. And then, according to Marvin, God told him to “get” the town first. So he bought a bulldozer and secreted himself away. For months he worked on the “Dozer” turning it into killing machine that the media would call a Kill-Dozer. And on June 4, 2004, he took his sixty-three ton machine on a rampage of the town. And the footage is as unbelievable as the story.<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 05 May 2020 04:00:00 +0000",
  "guid": "tag:audioboom.com,2020-05-04:/posts/7573928",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}