{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-6648999554920055650",
  "published": "2022-11-02T21:40:00.004-05:00",
  "updated": "2022-11-04T11:48:08.626-05:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "We're all supply siders now -- Summers and Poilievre",
  "content": "<p>Larry Summers wrote an interesting&nbsp;<a href=\"https://www.washingtonpost.com/opinions/2022/10/31/inflation-interest-rates-economy-federal-reserve/\" target=\"_blank\">oped at the Washington Post.</a>&nbsp;Mostly, he still is of the adaptive-expectations ISLM view that interest rates must exceed current inflation before inflation will decline. (<a href=\"https://www.blogger.com/blog/posts/582368152716771238\" target=\"_blank\">The issue here</a>.) But listen to this:</p><blockquote><p>Questions of macroeconomic policy are not about values but judgments about the ultimate effects of various actions. As Fed chair during the early 1980s, Paul Volcker famously tamed out-of-control inflation at the cost of a severe recession. But he did so not because he cared less about unemployment or worker incomes than his predecessors did but because he rightly recognized that delay in containing inflation would only mean more pain down the road.</p></blockquote><p>Would we all recognize common goals, but differences on cause and effect to get there. &nbsp;</p><blockquote><p>That’s why it’s vital that the Federal Reserve not waver. Chair Jerome H. Powell has vowed to impose sufficiently restrictive monetary policy to return inflation to within range of the Fed’s 2 percent target. The more confident that workers, businesses and markets are that the Fed will follow through on that, the less painful the process will be.</p></blockquote><p>Within the conventional monetary policy community, praise for Volcker and the view, basically, that the Fed should focus on inflation and the labor market will take care of itself is sensible, but remarkably Reaganish.&nbsp;</p><p>The tidbit that I found most interesting</p><blockquote><p>Finally, the crisis of inflation should not be wasted. A bright spot in the dismal inflation period of the 1970s was the collaboration of Stephen G. Breyer (then counsel to the Senate Judiciary Committee), Sen. Edward M. Kennedy (D-Mass.) and the Carter administration on airline deregulation. In this era, high inflation should be a spur to regulatory changes — from addressing Jones Act increases in shipping costs, to strategic tariffs, to rules that force oil and gas to be transported via truck rather than pipeline, to punitive zoning restrictions — that will both reduce prices and make the economy work better.</p></blockquote><p>As you know I've been preaching that \"supply side\" growth is the central problem and also the key to reducing inflation. Larry hasn't quite gotten to the latter, but this is the economist most identified with \"secular stagnation,\" \"hysteresis\" and the view that all we need to do is borrow or print more money and hand it out to create growth. Now deregulation and the supply side is the key to growth.&nbsp;</p><p>Larry is starting to sound like a Reagan Republican! &nbsp;I'm sure he would say circumstances have changed -- that was ZLB (zero lower bound on interest rates), this is inflation. That's a consistent view. But inflation should wake us all up as it has Larry: All the old verities are over, there is only supply now, and that comes mostly from getting out of the way, as Larry recommends, not new \"investments\" of more borrowed money thrown down ratholes.&nbsp;</p><p>***&nbsp;</p><p>Pierre Poilievre, the leader of Canada's Conservative party,&nbsp;<a href=\"https://nationalpost.com/opinion/pierre-poilievre-spending-must-be-capped-to-end-liberal-induced-inflation\" target=\"_blank\">wrote a great Oped in the National Post</a>. Now that Liz Truss has imploded, perhaps Poilievre will become the international hope for a successful free market libertarian politician.&nbsp;</p><blockquote><p>Finance Minister Chrystia Freeland wants us to believe she has had an epiphany. After years of ignoring my warnings that Liberal deficit spending would cause inflation to balloon, followed by interest rates, she now claims to agree with me in a <a href=\"https://www.thestar.com/politics/federal/2022/10/19/chrystia-freeland-warns-cabinet-ministers-new-programs-must-be-funded-by-budget-cuts.html\" target=\"_blank\">leaked letter</a> to fellow ministers. Even her boss, Prime Minister Justin Trudeau, is uttering words unthinkable to him not long ago: “<a href=\"https://globalnews.ca/news/9217165/canada-fiscal-responsibility-trudeau-recession/\" target=\"_blank\">fiscal responsibility</a>.”</p></blockquote><blockquote><p>The cost of government is driving up the cost of living. A half-trillion dollars of inflationary deficits have sent more dollars chasing fewer goods, which always leads to higher prices.&nbsp;</p></blockquote><p>We're all FTPLers (fiscal theory of the price level) now, some sooner than others. A clear explanation of how central banks create money and buy treasury debt follows. Then</p><blockquote><p>&nbsp;the Bank of Canada must pay interest — at the going rate. Because rates are now rising, the central bank is now losing money and will need a bailout from the federal government for the first time in history — something I predicted would happen two years ago.&nbsp;</p></blockquote><p>Fiscal constraints on monetary policy. Nice.&nbsp;</p><blockquote><p>Liberals like to say that all this inflation is the result of the Russian invasion of Ukraine. But less than 0.3 per cent of Canada’s trade is with those two countries, and the things that they produce are things we already have — food and energy. In fact, the higher commodity prices should have helped our resource-heavy economy, but for the fact that the Trudeau government has hit farmers with fertilizer tariffs and carbon taxes and blocked or bungled every single pipeline or LNG export terminal proposed in seven years.</p></blockquote><p>Beside my thread, but an important point. His bottom line&nbsp;</p><blockquote><p>Instead of creating more cash, we need our economy to produce more of what cash buys: more food, energy and homes. That means removing gatekeepers that have made Canada the second slowest country in all the OECD to get a building permit. As prime minister I would challenge all three levels of government to work together to offer the fastest building permits in the OECD. This would mean going from 250 days to 28 days to beat the now first-placed South Korea....We would remove taxes and tariffs on farmers’ fuel and fertilizer....Finally, we would reform our taxes to reward work, savings, and investment so our workers and businesses can produce more of the goods we need.&nbsp;</p>Simply put, we would stop creating cash and start creating more of what cash buys: food, homes, energy, manufactured goods and more. That is the only path to bigger buying power for paycheques and savings.</blockquote><p>FTPL and deregulation-focused supply side growth. Well, us free market libertarians are like Chicago Cubs fans, there's always hope!</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 9
}