{
  "title": "Let The Women: Roberta Blevins on Living & Leaving LulaRoe",
  "link": "https://audioboom.com/posts/8094030",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3164,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>When Roberta Blevins casually bought a pair of buttery soft, printed leggings from a fellow young mom on Facebook, she never could have imagined the journey that would follow. The rise and fall of LulaRoe –a multi-level marketing company that denies allegations of being a pyramid scheme and still exists today– coincided with Roberta’s experience, carrying her up the Lula-ranks and back down again when she discovered the dark side of direct sales. Come along, hun! We're deconstructing the lifestyle of the Almighty Girlboss.<br>\n<br>\nThis episode is part of a ten-part series called<em> Let The Women Do The Work</em>. Join host Gillian Pensavalle as she follows the stories of ten dynamic, inspiring, badass women in true crime.<br>\n<br>\nThis week's sponsors:<br>\n<br>\nModern Fertility - Get $20 off your fertility test when you go to <a href=\"https://modernfertility.com/WORK/\">ModernFertility.com/WORK</a>.<br>\n<br>\nAthletic Greens - Athletic Greens is going to give you a FREE 1-year supply of immune-supporting Vitamin D AND 5 free travel packs when you go to <a href=\"https://athleticgreens.com/partner/d35ctoffer-lifestyle/en?utm_source=podcast&utm_medium=influencer&utm_campaign=womendothework_d35ct__a4060__o27&utm_term=cac__a4060__o27&utm_content=femalelifestyle__a4060__o27\">athleticgreens.com/WOMEN</a>.<br>\n<br>\nCredit Karma - Ready to find the card for you? Head to <a href=\"https://www.creditkarma.com/\">creditkarma.com</a> and check out your personalized mix of offers today.<br>\n<br>\nApostrophe - Save $15 off your first visit with an Apostrophe provider at <a href=\"https://www.apostrophe.com/pod/WORK/\">Apostrophe.com/work</a> when you use code WORK.</div>\n",
  "pubDate": "Thu, 02 Jun 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-01:/posts/8094030",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}