{
  "title": "S5 Ep49: Director’s Cut: A strategic agenda for the incoming EU presidents",
  "link": "https://audioboom.com/posts/7286782",
  "itunes:episode": 49,
  "itunes:title": "Director’s Cut: A strategic agenda for the incoming EU presidents",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1311,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The next presidents of the European Commission, Council and Parliament will inherit a relatively healthy European economy, but will face three formidable challenges in the next five years.</div>\n<div> </div>\n<div>First, the incoming presidents must define Europe’s place in an increasingly bipolar world driven by a <a href=\"http://bruegel.org/2019/04/europe-in-the-midst-of-china-us-strategic-competition-what-are-the-european-unions-options/\">geostrategic rivalry between the United States and China</a>. Second, global warming is a reality and temperatures appear to be rising faster than forecast. Third, the three presidents need to manage the economy and <a href=\"http://bruegel.org/2019/05/how-to-improve-european-union-cohesion-policy-for-the-next-decade/\">EU cohesion</a>.</div>\n<div> </div>\n<div>In this episode of ‘The Sound of Economics’, Bruegel director Guntram Wolff speaks with Bruegel deputy director Maria Demertzis about the specific measures that the new incumbents should take to tackle these challenges.</div>\n<div> </div>\n<div>Together with senior fellow André Sapir, the two discussants have co-written Bruegel’s memo to the three new presidents, elaborating on the policy priorities for the next institutional cycle.</div>\n",
  "itunes:summary": "In this Director’s Cut of ‘The Sound of Economics’, Bruegel’s Guntram Wolff and Maria Demertzis outline the specific measures that the new presidents of the European Commission, Council and Parliament should take in order to tackle the most formidable challenges arising in the next five years.",
  "pubDate": "Wed, 12 Jun 2019 10:49:52 +0000",
  "guid": "tag:audioboom.com,2019-06-12:/posts/7286782",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}