{
  "title": "What makes love last? With Arthur Aron, PhD",
  "itunes:title": "What makes love last? With Arthur Aron, PhD",
  "pubDate": "Wed, 09 Feb 2022 11:30:00 +0000",
  "guid": "e254aaaf-7b34-4c80-a3dc-a41cb1a42893",
  "link": "http://sopapa.libsyn.com/what-makes-love-last-with-arthur-aron-phd",
  "itunes:image": "",
  "description": "<p>Most of us expect the intensity of new love to fade over time. But some couples remain deeply in love for the long haul, even after years or decades together. What sets those relationships apart? Are some couples just lucky? Or are there things that you can do to sustain love, or rekindle it, in any long-term relationship? Dr. Arthur Aron, of Stonybrook University, discusses what the science says about the secrets of long-term love.<br /> <br /> Links<br /> Arthur Aron, PhD - <a href= \"https://www.stonybrook.edu/commcms/psychology/faculty/faculty_profiles/aaron\"> https://www.stonybrook.edu/commcms/psychology/faculty/faculty_profiles/aaron</a><br />  36 Questions in Love - <a href= \"http://36questionsinlove.com\">http://36questionsinlove.com</a><br />  <br /> Sponsor<br /> <br /> Love Crunch<br /> <a href= \"https://naturespath.com/love-crunch\">https://naturespath.com/love-crunch</a><br />  Get 14% all Love Crunch products during the month of February<br /> Use promo code love14</p>",
  "content:encoded": "<p>Most of us expect the intensity of new love to fade over time. But some couples remain deeply in love for the long haul, even after years or decades together. What sets those relationships apart? Are some couples just lucky? Or are there things that you can do to sustain love, or rekindle it, in any long-term relationship? Dr. Arthur Aron, of Stonybrook University, discusses what the science says about the secrets of long-term love.  Links Arthur Aron, PhD - <a href= \"https://www.stonybrook.edu/commcms/psychology/faculty/faculty_profiles/aaron\"> https://www.stonybrook.edu/commcms/psychology/faculty/faculty_profiles/aaron</a>  36 Questions in Love - <a href= \"http://36questionsinlove.com\">http://36questionsinlove.com</a>   Sponsor  Love Crunch <a href= \"https://naturespath.com/love-crunch\">https://naturespath.com/love-crunch</a>  Get 14% all Love Crunch products during the month of February Use promo code love14</p>",
  "enclosure": "",
  "itunes:duration": "35:26",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Most of us expect the intensity of new love to fade over time. But some couples remain deeply in love for the long haul, even after years or decades together. What sets those relationships apart? Are some couples just lucky? Or are there things that...",
  "itunes:episode": 177,
  "itunes:episodeType": "full"
}