{
  "title": "Supersonic Flight, Technology, and the Overland Ban with Sam Hammond",
  "pubDate": "Fri, 25 Nov 2016 21:08:56 +0000",
  "guid": "76d0248846b48d0eadee1eb7edbc13c7",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP37Hammond_EDR.mp3",
  "itunes:image": "",
  "description": "<p>What follows is an edited transcript of my conversation with Sam Hammond.</p> <hr /> <p><strong>Petersen:</strong> My guest today is <a href= \"https://asp.mercatus.org/samuel-hammond\" target=\"_blank\">Sam Hammond</a>. He's a policy analyst at the <a href= \"https://niskanencenter.org/\" target=\"_blank\">Niskanen Center</a>. Sam, welcome to Economics Detective Radio.</p> <p><strong>Hammond:</strong> Hi!</p> <p><strong>Petersen:</strong> Our topic today is supersonic air travel.</p> <p>Sam has written an article titled <a href= \"https://www.mercatus.org/publications/make-America-boom-again\" target=\"_blank\">\"Make America Boom Again\"</a> along with co-author Eli Dourado which revisits the U.S. Federal Aviation Administration's ban on supersonic flight over the United States. So Sam let's start at the very start. Let's start by talking about the history of flight. How do we get from the Wright brothers to supersonic flight?</p> <p><strong>Hammond:</strong> Well I think the most notable thing about the early history of aviation is how quickly and how rapidly we innovated. So the Wright brothers flew their initial voyage, their milestone flight in 1903 at seven miles per hour and within forty years we were already breaking the speed of sound. And actually very shortly after that not only were we breaking the speed of sound within military jets but we were on the cusp of commercializing it through the Concorde.</p> <p>So, what characterizes the early history of aviation is really rapid innovation. Part of that was driven by obviously two world wars but also that trickled out and percolated into the commercial space. That brings us to today. So in the progress that we made in air speeds in the first say 40 to 50 years of manned flight, we've actually regressed since then.</p> <p><strong>Petersen:</strong> Okay, so the Concorde starts flying in I believe it's 1969 and the subject of your paper---the ban brought in by the F.A.A. on supersonic travel over the United States---comes in just four years later in 1973. So what happened in that four-year period? How did we go from rapidly advancing to banning what was at the time the latest technology?</p> <p><strong>Hammond:</strong> It really began in the 60's. Everyone was seeing the progress that was being made in supersonic aircraft. And it was widely appreciated that it was only a matter of time before it would be commercialized. And there was actually a bit of a race going on between European countries and America of who would develop the first and the best supersonic jet. Because at the time, you know, this is way before Reagan deregulated the airlines. So these were the national projects almost akin to the space race.</p> <p>So in the 60's the F.A.A. and NASA began investigating whether supersonic airplanes could fly overland, because obviously they had them already in the form of military jets. And so they conducted a number of tests. One of the most important and famous tests was the test over Oklahoma City. So in 1964 the F.A.A. began a test over Oklahoma City where supersonic jets---military jets---would fly over the city eight times per day for six months continuously. And these were just regular old military jets, nothing about them was designed to mitigate the sonic boom. So eight times a day people in Oklahoma were hearing the sonic boom. It was rattling their windows. And at the end of it---at the end of the six-month period---even though about 75% of the people they asked said that they could tolerate the booms indefinitely, there were tens of thousands of complaints. And that's when the F.A.A. examined the complaints and rejected the vast majority of them as spurious. And that led to this huge public backlash.</p> <p>And so that was picked up by a guy named <a href= \"http://www.telegraph.co.uk/news/obituaries/1334496/Richard-Wiggs.html\" target=\"_blank\">Richard Wiggs</a> who founded <a href= \"https://en.wikipedia.org/wiki/Anti-Concorde_Project\" target= \"_blank\">the Anti-Concorde project</a>. So the Concorde was being developed in the 60's by a partnership between France and Britain and it sort of represented the frontier of technology---not just aviation technology but technology in total---and Richard Wiggs had this view of the environment and technology as being in conflict. So he believed that as technology advances, we lose touch with our natural environment. And he was actually one of the most innovative, maverick early environmental activists. They're commonplace today but he was actually a pioneer.</p> <p>And so he took the complaints that occurred in Oklahoma City and his philosophy of environment and technology in conflict and began one of the most successful environmental NIMBY campaigns in history. He organized academics, he organized the residential associations near airports. He took out full-page ads in The New York Times. He got people to call their congress people. And so even though this was all becoming organized even before the Concorde was in use in 1973, it persuaded the F.A.A. and Congress to institute a ban on supersonic flying overland. So there is no jurisdiction over the ocean of course, so when the Concorde eventually came out it was able to fly over the ocean. This was their attempt to handicap the Concorde's success.</p> <p><strong>Petersen:</strong> It's so strange to me that the government would fly supersonic jets over one city eight times a day for six months as an experiment. I mean when you experiment, usually you have to get the consent of the people you're experimenting on and that's what I'm familiar with but it's so---</p> <p><strong>Hammond:</strong> This was a different time.</p> <p><strong>Petersen:</strong> Yes, so 1960s! To just experiment on an entire city against their will and just see what happens.</p> <p><strong>Hammond:</strong> Yeah, I mean, any student of US history knows that our toleration for human experimentation has gone down quite a bit from the 60's and 70's. And if anything, flying a supersonic plane over a city was probably one of the least egregious things that was going on at the time.</p> <p><strong>Petersen:</strong> Yeah well, tell me about sonic booms. I'm not a physicist so use small words.</p> <p><strong>Hammond:</strong> Okay. So, if you've ever seen a speedboat drive through the water, it creates a wake in its path. And the same thing happens with planes only it's air. And air is in three dimensions so there's a cone, a wave that goes past an airplane as it flies through the air displacing the air in front of it, pushing it aside. But of course the speed of sound---and we get the concept of the speed of sound because sound is moving through air and so sound can only move as fast as air can move---and so when you approach the speed of sound you're pushing the air in front of the plane. You're pushing it, basically compressing against the air that's already there and so you reach this thing called the sound barrier where upon crossing the sound barrier you produce a shock wave where the air is becoming compacted and compacted and compacted and basically it's like the waves are on top of each other. And that creates a shockwave which radiates around the airplane and will reach the ground as this loud booming noise.</p> <p><strong>Petersen:</strong> So it's not only loud---I've noticed in your paper---some people said it could break windows or damage buildings.</p> <p><strong>Hammond:</strong> Right. So a lot of this goes back to---again---the Oklahoma City experiments where the fighter jets were flown over the city eight times a day. Sonic booms are shockwaves. There is no limit to how powerful a shockwave can be. So in principle sonic booms can break windows. In practice, they are about two pounds per square foot.</p> <p>This is this what the Concorde was approximately. And two pounds per square foot of air pressure is pretty weak. There were studies done in the 70's when the Concorde became active. And they found that it could do damage to old Civil War architecture and stuff like that and if you already had a window that had damage it could crack that window. But for practical purposes, buildings can withstand up to 11 pounds per square foot pressure before experiencing damage---Nasa's tested that extensively.</p> <p>So nonetheless the myth propagated in part because there were people in Oklahoma who claimed that their plaster cracked or that their windows broke. And so when the F.A.A. investigated it and basically threw out most of the claims as not being credible, that caused a big backlash and also caused a huge public relations disaster for the F.A.A. and for supersonic overland more generally and created this myth that it's very easy for a sonic boom to break their window. It's just not.</p> <p><strong>Petersen:</strong> So the ban applies just over the United States. How do we know that that is what has stopped the progress of supersonic flight? After all, you'd think that there's the whole rest of the world and maybe transatlantic or transpacific flights could sustain a supersonic aviation industry?</p> <p><strong>Hammond:</strong> So, there's a lot of variables going on. First of all---as I mentioned earlier---all the supersonic projects up to this point---except the Concorde---were abject failures. The US had one called the <a href= \"https://en.wikipedia.org/wiki/Boeing_2707\" target=\"_blank\">Boeing 2707</a>. It just never got off the ground, in fact, in the industry aerospace engineers have a term for this. It's called a \"boomdoggle\"---a play on boondoggle---because countries that tried to produce a supersonic jet just ended up pouring literally billions of dollars down the drain.</p> <p>And you can't blame that on supersonic per se. That's a failure of central planning. I would say the same thing with the Concorde. The Concorde flew for 27 years. And at times it made money but you have to remember it was never designed with any commercial intent. It was designed to be a commercial airplane but it had no market testing. It was mostly a piece of a diplomatic or political gambit that Britain was using to try to get into the <a href= \"http://economicsdetective.com/2016/06/brexit-european-union-european-economic-area-sam-bowman/\" target=\"_blank\">European Common Market</a>.</p> <p>And so when Kennedy proposed the 2707 as a competitor, he also didn't do market tests or see what the demand was, he looked at the Concorde which sat about 100 passengers and said we need to do better than France so let's make it 300 passengers. And instead of flying at Mach two---twice the speed of sound---let's fly at Mach three---three times the speed of sound---so it was just the one-upmanship of nations, had nothing to do with whether it was market viable.</p> <p>And so the case I make is that, if you had a private sector in airplanes---which at the time we didn't really, at least in supersonic, it was all government driven---the first entry point, the natural entry point would be some kind of smaller business-jet. Because frankly if you don't know which routes are going to demand the most passengers you want to start small. You don't want to jump right to a 300-seat passenger jet. The Concorde was only 100 seats, as I said, and it routinely had trouble filling its cabin.</p> <p>But the thing with business jets---and there have been about half a dozen rigorous market analyses done in the last ten years that have found there is a demand for supersonic business jets---the thing about business jets though is they fly overland about 75% of the time. You're going from regional airports to regional airports.</p> <p>And so if the natural entry point to sort of begin on the supersonic learning curve, learning which routes have the most to manned is a smaller business jet, you're going to have to begin by flying overland. And then once you discover which routes will bear more people you can expand the capacity of the airplane and ultimately I think a private sector would work its way up to having a 100- to 300-seat passenger jet once it had established that the demand existed. And also big part of that is driving down costs, of course. The Concorde was the Concorde it never iterated it. The first model was the last model.</p> <p>In commercial aviation more generally in subsonic aviation we've learned over time how to reduce costs. Even though we fly a slower today than we did 50 years ago, subsonic commercial airplanes are vastly more efficient and we've achieved that efficiency because we've learned over time.</p> <p><strong>Petersen:</strong> Okay, so the natural entry point is maybe carrying businessmen between New York and L.A. say, but that's illegal. And so the industry isn't able to sort of clear that hurdle. Is that basically what you're saying?</p> <p><strong>Hammond:</strong> Yeah, I mean if you have a 12-person business jet. First of all, it's difficult to get a jet that small to have the range to even go across the ocean. You know you wouldn't necessarily being going from coast to coast in a small business jet right away. You might be going from New York to Houston, or something like that. The point is that you don't know. You don't know which routes are going to bear fruit, a priori.</p> <p>The Concorde flew between France and Britain and the U.S., but It also had roots into the Caribbean and lot of those routes have ended up being canceled in the 80's in part because they just kept losing money, but it was because they had tried to plan it all out a priori, as if they could just deduce which routes would make money.</p> <p>I don't trust that model. I think you have to begin by building something small that you know will meet demand and then expanding from that. And the most important part about this is there's open a confluence of technology in just the last 20 years. I have no illusions that supersonic business jets would have been a thing, say, in 1990. I think a lot of this is a recent phenomenon that's why supersonic overland is an idea whose time has come. There's just been such a breakthrough in technology, in reducing the intensity of sonic booms. And that has been really the biggest hurdle is getting the intensity of sonic booms to a level where people will tolerate it.</p> <p><strong>Petersen:</strong> Right. So it seems like the F.A.A., when they banned supersonic flight, the concern was noise but they banned speed as sort of a proxy for noise. But what you're saying is that's a bad proxy you can have the speed without the noise.</p> <p><strong>Hammond:</strong> Exactly. So it was an overreaction. What we advocate in our paper and at <a href= \"http://supersonicmyths.com\" target= \"_blank\">supersonicmyths.com</a> is to replace the ban with a reasonable noise standard. Subsonic airplanes already adhere to a variety of noise standards, noise rules. If the issue is really noise---and we believe the issue is basically noise---the F.A.A. should just set a noise standard, say, 80 decibels, something like that, that would be like a lawnmower going by your house. And then let the market try to get below that line. The F.A.A. stance right now is that it will set a noise rule once it sees a supersonic airplane demonstrate that it can go below the noise that it finds acceptable. But it has never stated what it will find acceptable. So it's a sort of reverse order of operations where the F.A.A. wants to hear something that is quiet enough before telling us what is quiet enough.</p> <p><strong>Petersen:</strong> And if you're Boeing and you're going to invest millions of dollars building an aircraft that does 80 decibels and the F.A.A. says 'not quiet enough' you're out millions of dollars.</p> <p><strong>Hammond:</strong> That's right. And so today the biggest and really only large quiet supersonic project is still within NASA. NASA has been working on quiet supersonic technology pretty much continuously since the mid 80's under a variety of different project titles. And they're the only ones who are able to do it because it's federal money. They have no skin in the game. They do use contracts with, say, Lockheed. But those are still federal contracts. We would like to see more competition in this space.</p> <p>NASA is firm in its belief that a quiet supersonic jet is possible as early as 2020. How much sooner would we have gotten to that if we had the private sector involved?</p> <p><strong>Petersen:</strong> Almost certainly much sooner. If we look at private space companies like Space X, they're an order of magnitude cheaper than NASA. They're much more efficient and able to launch rockets into space for a fraction of the cost that NASA has. So, maybe if we use that as our model, then however much NASA has spent on developing supersonic, divide that by ten and maybe that's what the private sector might cost.</p> <p><strong>Hammond:</strong> Could very well be. The other thing is that, even today, NASA's effort is directed at the big passenger jets. And part of that is out of this democratic aspiration. They're the government, so they're trying to build something that the everyman could ride. But it's pretty common in new technologies for the early additions or for the early adopters to be of a sort of luxury class.</p> <p>You can think about Tesla's business model where they begin with a roadster and a luxury car---which is really only affordable to millionaires and the very wealthy---with the game plan that they're going to have a low volume high profit or high revenue car and reinvest those profits back into developing cheaper and cheaper versions until they get to a mass market version.</p> <p>We argue that that's exactly how the supersonic learning curve probably works as well. You want to begin with business jets which will of course be a luxury flying supersonic getting from New York to L.A. in two hours instead of five or six. It is worth it to some people. But those early models will of course be expensive. It will be expensive to ride not just because it's new technology and we haven't figured out how to drive down costs, but because a lower capacity means you're dividing the cost by fewer people. But over time those companies can reinvest, build bigger designs and drive down costs until you get to the point where virtually anyone can afford it.</p> <p>The company Boom, which is developing a supersonic jet for over the ocean, is projecting to drive their costs down to about $5,000 a ticket to go across the Atlantic, which is on par with business-class and first-class tickets. So they're projecting that for their own costs. It could very well be the case that that technology and that those cost estimates are probably similar for first models in the over-land market as well. And that's a far cry from the Concorde which cost about $20,000 per flight. So going from $20,000 a ticket to $5,000, that's what this one company is projecting and it's only their first model.</p> <p><strong>Petersen:</strong> Right. So if something like Tesla cars or cell phones had to get permission through the political process when they were being developed, then maybe someone in the 90's would have said \"Why should we allow cell phones if only rich people are going to use them?\" And in the 90's they might have been right. But of course now we all have cell phones, and I guess what you're saying is in the 2020s or the 2030s we might all be flying at supersonic speeds when we go on our vacation.</p> <p><strong>Hammond:</strong> I believe that. <a href= \"http://www.spacex.com/sites/spacex/files/hyperloop_alpha-20130812.pdf\" target=\"_blank\">Elon Musk, in his Hyperloop paper,</a> discusses the most efficient way of getting from point A to point B. And he argues in that paper---it's sort of an offhand comment he makes---but he suspects that for any city pair that's over 900 miles apart the most efficient way of getting from that city to the other city is supersonic.</p> <p><strong>Petersen:</strong> So that's most pairs of big cities.</p> <p><strong>Hammond:</strong> Not just most pairs of big cities but the average flight distance, not from where the passenger is starting to where he's going, but the average takeoff to landing for a passenger plane is about 900 miles. So that suggests that if that is an efficient distance for supersonic, the average flight could be flown efficiently at supersonic.</p> <p><strong>Petersen:</strong> One issue that your paper goes into is that some people have alleged that supersonic aircraft---because they fly very high---might damage the ozone layer. Is there anything to that?</p> <p><strong>Hammond:</strong> I won't say there's nothing to it, but it's been vastly overstated. I'll put it that way. This goes back again to the Concorde and the early environmental movement's objections to it. At the time the understanding of atmospheric science was very very poor compared to today and there were concerns that because the emissions from an aircraft include nitrogen oxides---which are a class of molecules that will bind with oxygen in the atmosphere to destroy ozone---that because the Concorde flew so close to the stratosphere---which is where the ozone layer begins---that these emissions could lead to the depletion of ozone.</p> <p>That's been rejected. The most alarmist versions of it were rejected. In the 70's people were claiming that if the Concorde or a fleet of Concordes were permitted to fly that we'd see catastrophic ozone collapse. That did not come to fruition obviously, the Concorde flew for 27 years. More recent studies now that we have large models of the atmosphere, simulated models of the atmosphere, have determined that a supersonic aircraft flying within 50 to 60,000 feet should in theory be ozone neutral. The reason is because there's actually this countervailing effect where a little bit lower in the atmosphere the nitrogen oxides actually produce ozone, and a little bit above in the stratosphere it depletes ozone. And if you're flying right on that line they roughly cancel out.</p> <p><strong>Petersen:</strong> Okay. There were some fears in the 80's and 90's of other things we're doing seriously damaging the ozone layer. But was that a much larger threat than supersonic flight?</p> <p><strong>Hammond:</strong> Well it was just a different sort of threat. There are different emissions in aerosols and so forth, CFCs. But out of the concern for the ozone in the 90's we got the Montreal Protocol and the Montreal Protocol is an international agreement to control the emissions of things that will deplete ozone and as supersonic makes its comeback, they will have to be fully compliant with those protocols.</p> <p>I still recommend that going forward there should be more research into this. Even since the Concorde retired, we have better models of the atmosphere and I'm sure there's actually teams that NASA and MIT that are studying this right now.</p> <p><strong>Petersen:</strong> It can't hurt to look into it. But it seems like once something is banned or, you know, once the government sort of gets its hands on it and says \"we're not so sure about this\" we become incredibly risk-averse, we look at every possible downside and ignore the huge upside of just having a whole other industry and all that consumer surplus that you get from having an entire market that wasn't there before.</p> <p><strong>Hammond:</strong> What I would say is the state of knowledge right now with respect to supersonic and ozone is well established enough to not worry. The catastrophic versions of the concerns have been utterly rejected. Even the more modest versions of it are called into question by the fact that, there seems to be this band around the around 60,000 to 50,000 feet where supersonic emissions are ozone neutral. There, of course, should be more study but we don't have to wait for those studies. The studies we already have are sufficient to suggest that we shouldn't be waiting for more data. We already have enough data to begin today.</p> <p><strong>Petersen:</strong> It seems like there are two models of innovation. At one extreme end is the development of new drugs, where we have years upon years of vetting and studies and you have to comply with many requirements before you can get your new drug on the market and it costs billions of dollars. Adds a lot to the price of developing new medicine. And then there's the other model where somebody just makes something and we start using it. And maybe we worry about the implications, but by the time anyone thinks that \"hey maybe this is a bad idea\" it's already been universally adopted.</p> <p>So something like Facebook, where we were all already on Facebook before people started complaining \"Hey what if this is ruining our social interactions or something?\"</p> <p><strong>Hammond:</strong> Or maybe all the fake news sites. Destroying democracy.</p> <p><strong>Petersen:</strong> Yeah that's topical right? Facebook is now worried about its role as one of the main places young people get their news, or a lot of people get their news, and some things go viral that are not true or and might be misleading and might affect, say, the outcome of elections.</p> <p><strong>Hammond:</strong> Apropos of Facebook and that topic, myths and misconceptions and viral falsehoods and urban legends, those are not new phenomena. That's why I had to create <a href= \"http://supersonicmyths.com\" target= \"_blank\">supersonicmyths.com</a>. Because around supersonic, there's just a lot of misconception because there are a lot of people who think they're experts on the Concorde and think that the Concorde proves that supersonic is not economically viable. But they don't really understand that well.</p> <p><strong>Petersen:</strong> Right and you could use the same sort of logic to say, \"Look how costly the moon landing was. It's clearly impossible at that cost for any kind of <a href= \"http://economicsdetective.com/2016/11/space-debris-governance-economics-space-alex-salter/\" target=\"_blank\">space tourism or space commerce</a> to be economically viable.\" But the issue is that the moon landing was very very expensive, but it was run by the U.S. government which tends to make all its activities very expensive. A future space tourism company might be much much cheaper and we just don't know until we see it, how much cheaper.</p> <p><strong>Hammond:</strong> So I guess I should just comment a little bit on what the new technologies are that have made supersonic overland viable. And they really break down to three: first engines---jet engines---have become a way more powerful, way more efficient. They're way more capable in every way. So, the Concorde used an afterburner on its engine, which means upon takeoff it basically dumped kerosene and lit it on fire and that's why if you watch old videos of the Concorde taking off you see this trail of black smoke coming up behind it. That's the afterburner. Incredibly fuel inefficient, you're just burning fuel. This is what it needed at the time to get the extra boost, to get into the air, because it had to climb to 60,000 feet---which takes quite a bit of energy.</p> <p>Today we have vastly superior engines. In fact, most subsonic aircraft, most passenger planes that you would fly in any consumer flight are capable of going supersonic. They have a top speed which is subsonic but if you put them in overdrive you can go supersonic and in fact, the company I mentioned earlier---Boom---is using off-the-shelf engines to reach its max speed.</p> <p>Second is carbon fiber. So, the shape and the aerodynamics of shape matter a whole lot to supersonic and supersonic overland. The way we reduce booms is by affecting or altering the airfoil around the airplane. So, essentially you can use the shape of the airplane to modify the waves and smooth the waves out. So you don't have this like sudden shock and sudden dip. Instead, you have sort of this gradual rise and fall. And mostly when the human ear detects loudness what it's detecting is suddenness. So you can dramatically reduce the perception of loudness by modifying that airwave and you do that by modifying shape. Most planes are constructed of aluminum, which you can shape reasonably, but not nearly as much as carbon fiber and carbon fiber has become basically a commodity in recent years. It means basically any shape you want is incredibly cheap and incredibly strong.</p> <p>The third and final, probably most important thing is the power of computers and computer simulation. So prior to the early 2000s, I would say, when what's called computational fluid dynamics was really coming up. These are computational simulations of how fluids waters and airs move around shapes. That requires a lot of computing power which we've only recently achieved. Prior to that,</p> <p>if you want to design and test a prototype for a supersonic aircraft you would have to literally build a model and rent a wind tunnel, and then you'd have to have instruments try to imperfectly measure how the wind is moving around the aircraft. That is incredibly costly. So, computer simulation has really democratized. Some of the researchers who've done work on this are just grad students. They have software engineering expertise and they construct algorithms that will search through the space of all possible aircraft designs and try to find the one shape that reduces the sonic boom the best. And then because we have carbon fiber we can go and pour that shape and have the exact shape we want.</p> <p><strong>Petersen:</strong> So it used to be, not only did you need the air tunnel but you had to---if you wanted to test 100 wing shapes---you had to physically build 100 wings. Now you tell a computer \"here's 100 wing shapes,\" hit compile, come back the next morning and you have your simulated sound profiles?</p> <p><strong>Hammond:</strong> It's actually even cooler than that. Instead you tell the program what you're looking for, and what you're looking for is a shape that will reduce the sonic boom to whatever level you're aiming for. Basically you give it an objective and then instead of trying to design 100 designs and let it test 100 designs, you give it an objective and then it searches through literally hundreds of thousands of designs that it evolves on its own. Some of these algorithms are genetic in nature, so they evolve like biology evolves and they try to go down paths and try to find exactly what shape reduces or hits the objective. And you can have multiple objectives. You can even include the objective of low sonic boom, but you can also have that tempered by the objective of efficiency---fuel efficiency.</p> <p>Shape and size obviously you'd want to put into the objective function. We don't want this airplane to be ten miles long. It happened to be the case that the longer, more slender aircraft cut through the air better but a computer doesn't know on its own that a ten-mile long airplane is not feasible. So you basically give it multiple objectives and you hit play and you let the algorithm do its work. And it can literally iterate through hundreds and hundreds of thousands of designs.</p> <p><strong>Petersen:</strong> And this is achievable by grad students just with software that is available, or you can get on a grad student budget?</p> <p><strong>Hammond:</strong> Well, I imagine these are big research projects. They have university backing and industry does that too. But it's a single fixed cost instead of a repeated variable cost of having to rent a wind tunnel every single time you want to test.</p> <p><strong>Petersen:</strong> So it sounds like despite the fact that there's been a supersonic ban and despite the fact that there is no supersonic industry, or no supersonic commercial flights going on in the world today, we still had advancement, but it's been mostly on the technology side, on the theoretical side. What we haven't seen is actual supersonic flights and testing the water, testing the market. I saw in your paper that you go through some estimates of the potential size of the supersonic market. Do you want to talk through some of those?</p> <p><strong>Hammond:</strong> Sure. There has been by my count seven market analyses. Most of them from the mid-2000s till today. The estimates range from 180 supersonic business jets to over 600. So, these are companies like Gulfstream Aerospace, which is a leading business-jet manufacturer. They've done actually two or three of these market analyses. And they foresee up to 350 units for just themselves. So 350 business jets that they could produce over ten years. That is quite a demand.</p> <p><strong>Petersen:</strong> And they're looking at things like whose opportunity cost of their time is high enough that they would pay maybe a few thousand extra dollars, maybe several thousand in order to save a few hours. And right now there are C.E.O.s, there are wealthy people who maybe live in the United Arab Emirates but want to commute to New York and right now that means sitting on a plane for---gosh I don't even know---it would be like 15 hours or something. If it could be six hours, for most of us, we might prefer to sit on a plane longer and pay significantly less. But if your time's really valuable, if you run a multi-million-dollar company, it really can be worth it to save some of your time, even at a high cost.</p> <p><strong>Hammond:</strong> Of course it's possible if you had supersonic overland to leave New York and go to London and then come back to New York on the same day. There are people who would love to do that. I think what gets missed in this it's not just about going faster for its own sake. This makes the world smaller, it makes you rethink travel. So in addition to these American analyses, there have also been some surveys. One survey did a survey of business jet operators and importantly they asked them to basically state an estimate from zero to 100 what the likelihood is that they would buy a supersonic business jet if they could. When they asked that under the condition that there is still an overland ban the number was zero, so zero percent of people. The average person said that there was zero chance they'd buy a supersonic business jet if they can't fly overland but in the case that the ban is lifted, that number jumps to 50%. So half of the businesses that were surveyed would see a chance.</p> <p><strong>Petersen:</strong> That's further evidence that it's not just that supersonic is unviable, it's that this legal restriction is in a very important market which is flying over the United States. That's what's killing the supersonic industry.</p> <p>One other the thing I saw on your website was, you talk about the tradeoff between noise and fuel efficiency in the context of airport noise restrictions. Could you tell me, how does that tradeoff work?</p> <p><strong>Hammond:</strong> I think that one of the biggest barriers to the F.A.A. is the issue of airport noise. The F.A.A. has worked with I.K.O. and I.K.O is the UN's body who deals with aviation standards. They've worked for literally decades to try to ramp up the stringency of noise around airports and they're pretty proud of what they've accomplished. If you live near an airport today it's a much quieter experience than it would have been 20, 30, even 40 years ago.</p> <p>But this comes with a tradeoff. The way aircraft reduce noise is they have a bypass ratio. So at the extreme, you have a turbo-jet, which means all the air passes through the jet and then you have jets which bypass air around the jet. So, you have the jet in the center and that's what's pushing, propelling the plane forward. But then you also bypass air around the jet to basically insulate the noise. But that comes with a tradeoff. So the more air you bypass, the quieter it will be, but also the more fuel and the less thrust you get. And it happens with supersonic because you're going from sea level to 60,000 feet potentially, you actually have to really take off at a steep angle and you have to push up. You have to really get up high, basically, and so you could make the argument that we should tolerate slightly lower airport noise standards for supersonic at first, so they can use lower bypass ratio engines and therefore less fuel when they're making their incline.</p> <p><strong>Petersen:</strong> So there's <a href= \"https://www.mercatus.org/publications/airport-noise-nimbyism\" target=\"_blank\">another paper from Mercatus</a>, also written by your co-author Eli Dourado, and that one talks about the number of airport noise complaints that come from a really small concentrated number of households. I found that very funny.</p> <p>Just how concentrated are the airline airport noise complaints?</p> <p><strong>Hammond:</strong> Let me say first that what we recommend for airport noise standards is stage three noise standards, which are what we currently use. So, currently if you live near an airport and you see a plane taking off and you can hear it slightly, that's the stage three noise standard. We're advocating that supersonic abide by that noise standard. That noise standard is being phased out for stage four and later stage five, which will be even stricter. So we're not saying anything like \"Oh we should let planes be super noisy,\" we're saying \"let supersonic planes be as noisy as the ones that we currently have taking off, and just give them a bit of a window before they're phased into these newer, more stringent noise standards that are coming down the pipeline.\"</p> <p>Eli's work with Raymond Russell, they found an amazing data set that includes records of who is making noise complaints, airport noise complaints. And they have them by airport and the astonishing thing they find is that these airports are getting sometimes tens of thousands of noise complaints every year but when they drill down into the data, it is just a handful of people making all the complaints.</p> <p>So a few examples. I live near Ronald Reagan Washington National Airport and in 2015 they had 8,760 noise complaints. Two individuals at one D.C. residents accounted for 6,852 of those complaints. So, two people in one building accounted for 78% of the complaints. They have a report called <a href= \"https://www.mercatus.org/publications/airport-noise-nimbyism\" target=\"_blank\">\"Airport Noise NIMBYism: An Empirical Investigation\"</a> where they go through all the airports that have this data and they find evidence of the sort of concentration of complainers at every single airport. So, it's a pretty surprising thing and I think it's important to get this information out there because as we know from when the Concorde was banned overland, residents’ associations are a pretty powerful group to mobilize in opposition to something like this, and Congress people have the perception that---like San Francisco in 2015 had almost 900,000 those complaints to San Francisco International Airport. These are constituents, we want to reduce noise this is obviously something they care about. But in fact, in San Francisco's case, only 53 individuals accounted for 25,000 of the complaints. And those 25,000 were all during a single month---the month of October---which meant that the average person was making 477 calls per person. So, 30 days in a month, that's a lot of calls every single day. And this is San Francisco so wouldn't surprise me if there were some enterprising software developers who figured out a way to make complaints automatically.</p> <p><strong>Petersen:</strong> So robot calls. It might be crazy people calling in a complaint every single time they hear an airplane, or it might be clever people robotically calling in a complaint every time there's an airplane. Except that I guess they didn't anticipate that someone would notice that all these calls were coming from the same location which kind of undermines their objective which would be to reduce noise in those areas.</p> <p>Of course, if you bought your house after the airport was already there making noise then economics says that that noise should already be priced into the value of the house. The person who loses is the person whose house is next to an empty lot and then the government announces \"Hey we're going to build an airport here.\" You'd expect the change in home prices to happen immediately when that's announced and then every following owner has already accepted that cost and they've had cheaper real estate prices as a result. So, if you buy a house next to the airport and then try to pressure the airport to make less noise you're sort of trying to boost your property value when you already paid a discounted rate. You are already compensated for accepting that noise.</p> <p><strong>Hammond:</strong> And not only that. But when people have done rigorous cost-benefit analyses of U.S. aviation noise standards and they consistently find that the costs of making airplanes less efficient on takeoff is greater than alternatives which include creative land use policies, like building in barriers that block sound near communities and stuff like that. So, if you have a community living very close to an airport, one alternative is to set global standards which say airplanes are to fly less efficiently and make less noise, or you build a wall. You build up a barrier or some insulation to protect the community from the noise. But the main point of this study that Eli and Raymond did---which by the way, if I remember this correct, is Mercatus's most downloaded paper in history---the main point is that we shouldn't be basing innovation policy, particularly something that can have very high impact, on a few crazy people and enterprising robot callers.</p> <p><strong>Petersen:</strong> People who are affected by having less efficient aircraft, having slower aircraft, more expensive air travel just so outnumber the small number of people who live near airports. And you could get them all double-ply windows and help make their houses more soundproof. Probably much cheaper than hamstringing the entire airline industry.</p> <p><strong>Hammond:</strong> Absolutely. I just want to recapitulate some things. Supersonic overland is today feasible. It can be economical, there are companies chomping at the bit to try to develop something that will be quiet and affordable. The only thing standing in their way is the F.A.A. and a public perception that the Concorde proved that supersonic is not viable. The F.A.A. could act today, it could issue a noise standard and allow developers to shoot for that standard. Even if a bill is passed today, what the F.A.A. wants to do is coordinate internationally with I.K.O. and I.K.O. is the UN body that---it's not a regulator---sets standards.</p> <p>The F.A.A. has a prominent role in guiding us towards standards, but it's an incredibly slow process. I.K.O meets every three years. If the F.A.A. were told to remove the ban tomorrow and they wanted to coordinate internationally, would mean we have to wait about three years. I.K.O. is meeting this year, obviously they're not going to talk about it this year---the agenda is all set. So they're going to be talking about it three years from now and then they'll be finalizing those rules three years from then. And then the F.A.A. will take those rules, propagate them globally and then we will have another two or three year regulating period where there's a notice and comment and everything else.</p> <p>So we're talking about ten years just to change this stupid ban that is obsolete and I think that speaks to a more fundamental problem in U.S. policy and regulation, which is, we create these massive bottlenecks. And it's no surprise that it happens to an idea that is such a no-brainer, like creating a noise rule for supersonic instead of a ban. You can find other examples in every other industry of every other emerging technology, where there are these obsolete rules that are getting in the way of better, more efficient, more affordable, faster technology. And even if they can be rolled out tomorrow, have to go through at times a decadal process of approval. So, I think it's no wonder that productivity innovation seems to be at a historical low.</p> <p><strong>Petersen:</strong> My guest today has been Sam Hammond. Sam, thanks for being part of Economics Detective Radio.</p> <p><strong>Hammond:</strong> Thank you.</p> <hr /> <p> </p>",
  "content:encoded": "<p>What follows is an edited transcript of my conversation with Sam Hammond.</p>  <p>Petersen: My guest today is <a href= \"https://asp.mercatus.org/samuel-hammond\" target=\"_blank\">Sam Hammond</a>. He's a policy analyst at the <a href= \"https://niskanencenter.org/\" target=\"_blank\">Niskanen Center</a>. Sam, welcome to Economics Detective Radio.</p> <p>Hammond: Hi!</p> <p>Petersen: Our topic today is supersonic air travel.</p> <p>Sam has written an article titled <a href= \"https://www.mercatus.org/publications/make-America-boom-again\" target=\"_blank\">\"Make America Boom Again\"</a> along with co-author Eli Dourado which revisits the U.S. Federal Aviation Administration's ban on supersonic flight over the United States. So Sam let's start at the very start. Let's start by talking about the history of flight. How do we get from the Wright brothers to supersonic flight?</p> <p>Hammond: Well I think the most notable thing about the early history of aviation is how quickly and how rapidly we innovated. So the Wright brothers flew their initial voyage, their milestone flight in 1903 at seven miles per hour and within forty years we were already breaking the speed of sound. And actually very shortly after that not only were we breaking the speed of sound within military jets but we were on the cusp of commercializing it through the Concorde.</p> <p>So, what characterizes the early history of aviation is really rapid innovation. Part of that was driven by obviously two world wars but also that trickled out and percolated into the commercial space. That brings us to today. So in the progress that we made in air speeds in the first say 40 to 50 years of manned flight, we've actually regressed since then.</p> <p>Petersen: Okay, so the Concorde starts flying in I believe it's 1969 and the subject of your paper---the ban brought in by the F.A.A. on supersonic travel over the United States---comes in just four years later in 1973. So what happened in that four-year period? How did we go from rapidly advancing to banning what was at the time the latest technology?</p> <p>Hammond: It really began in the 60's. Everyone was seeing the progress that was being made in supersonic aircraft. And it was widely appreciated that it was only a matter of time before it would be commercialized. And there was actually a bit of a race going on between European countries and America of who would develop the first and the best supersonic jet. Because at the time, you know, this is way before Reagan deregulated the airlines. So these were the national projects almost akin to the space race.</p> <p>So in the 60's the F.A.A. and NASA began investigating whether supersonic airplanes could fly overland, because obviously they had them already in the form of military jets. And so they conducted a number of tests. One of the most important and famous tests was the test over Oklahoma City. So in 1964 the F.A.A. began a test over Oklahoma City where supersonic jets---military jets---would fly over the city eight times per day for six months continuously. And these were just regular old military jets, nothing about them was designed to mitigate the sonic boom. So eight times a day people in Oklahoma were hearing the sonic boom. It was rattling their windows. And at the end of it---at the end of the six-month period---even though about 75% of the people they asked said that they could tolerate the booms indefinitely, there were tens of thousands of complaints. And that's when the F.A.A. examined the complaints and rejected the vast majority of them as spurious. And that led to this huge public backlash.</p> <p>And so that was picked up by a guy named <a href= \"http://www.telegraph.co.uk/news/obituaries/1334496/Richard-Wiggs.html\" target=\"_blank\">Richard Wiggs</a> who founded <a href= \"https://en.wikipedia.org/wiki/Anti-Concorde_Project\" target= \"_blank\">the Anti-Concorde project</a>. So the Concorde was being developed in the 60's by a partnership between France and Britain and it sort of represented the frontier of technology---not just aviation technology but technology in total---and Richard Wiggs had this view of the environment and technology as being in conflict. So he believed that as technology advances, we lose touch with our natural environment. And he was actually one of the most innovative, maverick early environmental activists. They're commonplace today but he was actually a pioneer.</p> <p>And so he took the complaints that occurred in Oklahoma City and his philosophy of environment and technology in conflict and began one of the most successful environmental NIMBY campaigns in history. He organized academics, he organized the residential associations near airports. He took out full-page ads in The New York Times. He got people to call their congress people. And so even though this was all becoming organized even before the Concorde was in use in 1973, it persuaded the F.A.A. and Congress to institute a ban on supersonic flying overland. So there is no jurisdiction over the ocean of course, so when the Concorde eventually came out it was able to fly over the ocean. This was their attempt to handicap the Concorde's success.</p> <p>Petersen: It's so strange to me that the government would fly supersonic jets over one city eight times a day for six months as an experiment. I mean when you experiment, usually you have to get the consent of the people you're experimenting on and that's what I'm familiar with but it's so---</p> <p>Hammond: This was a different time.</p> <p>Petersen: Yes, so 1960s! To just experiment on an entire city against their will and just see what happens.</p> <p>Hammond: Yeah, I mean, any student of US history knows that our toleration for human experimentation has gone down quite a bit from the 60's and 70's. And if anything, flying a supersonic plane over a city was probably one of the least egregious things that was going on at the time.</p> <p>Petersen: Yeah well, tell me about sonic booms. I'm not a physicist so use small words.</p> <p>Hammond: Okay. So, if you've ever seen a speedboat drive through the water, it creates a wake in its path. And the same thing happens with planes only it's air. And air is in three dimensions so there's a cone, a wave that goes past an airplane as it flies through the air displacing the air in front of it, pushing it aside. But of course the speed of sound---and we get the concept of the speed of sound because sound is moving through air and so sound can only move as fast as air can move---and so when you approach the speed of sound you're pushing the air in front of the plane. You're pushing it, basically compressing against the air that's already there and so you reach this thing called the sound barrier where upon crossing the sound barrier you produce a shock wave where the air is becoming compacted and compacted and compacted and basically it's like the waves are on top of each other. And that creates a shockwave which radiates around the airplane and will reach the ground as this loud booming noise.</p> <p>Petersen: So it's not only loud---I've noticed in your paper---some people said it could break windows or damage buildings.</p> <p>Hammond: Right. So a lot of this goes back to---again---the Oklahoma City experiments where the fighter jets were flown over the city eight times a day. Sonic booms are shockwaves. There is no limit to how powerful a shockwave can be. So in principle sonic booms can break windows. In practice, they are about two pounds per square foot.</p> <p>This is this what the Concorde was approximately. And two pounds per square foot of air pressure is pretty weak. There were studies done in the 70's when the Concorde became active. And they found that it could do damage to old Civil War architecture and stuff like that and if you already had a window that had damage it could crack that window. But for practical purposes, buildings can withstand up to 11 pounds per square foot pressure before experiencing damage---Nasa's tested that extensively.</p> <p>So nonetheless the myth propagated in part because there were people in Oklahoma who claimed that their plaster cracked or that their windows broke. And so when the F.A.A. investigated it and basically threw out most of the claims as not being credible, that caused a big backlash and also caused a huge public relations disaster for the F.A.A. and for supersonic overland more generally and created this myth that it's very easy for a sonic boom to break their window. It's just not.</p> <p>Petersen: So the ban applies just over the United States. How do we know that that is what has stopped the progress of supersonic flight? After all, you'd think that there's the whole rest of the world and maybe transatlantic or transpacific flights could sustain a supersonic aviation industry?</p> <p>Hammond: So, there's a lot of variables going on. First of all---as I mentioned earlier---all the supersonic projects up to this point---except the Concorde---were abject failures. The US had one called the <a href= \"https://en.wikipedia.org/wiki/Boeing_2707\" target=\"_blank\">Boeing 2707</a>. It just never got off the ground, in fact, in the industry aerospace engineers have a term for this. It's called a \"boomdoggle\"---a play on boondoggle---because countries that tried to produce a supersonic jet just ended up pouring literally billions of dollars down the drain.</p> <p>And you can't blame that on supersonic per se. That's a failure of central planning. I would say the same thing with the Concorde. The Concorde flew for 27 years. And at times it made money but you have to remember it was never designed with any commercial intent. It was designed to be a commercial airplane but it had no market testing. It was mostly a piece of a diplomatic or political gambit that Britain was using to try to get into the <a href= \"http://economicsdetective.com/2016/06/brexit-european-union-european-economic-area-sam-bowman/\" target=\"_blank\">European Common Market</a>.</p> <p>And so when Kennedy proposed the 2707 as a competitor, he also didn't do market tests or see what the demand was, he looked at the Concorde which sat about 100 passengers and said we need to do better than France so let's make it 300 passengers. And instead of flying at Mach two---twice the speed of sound---let's fly at Mach three---three times the speed of sound---so it was just the one-upmanship of nations, had nothing to do with whether it was market viable.</p> <p>And so the case I make is that, if you had a private sector in airplanes---which at the time we didn't really, at least in supersonic, it was all government driven---the first entry point, the natural entry point would be some kind of smaller business-jet. Because frankly if you don't know which routes are going to demand the most passengers you want to start small. You don't want to jump right to a 300-seat passenger jet. The Concorde was only 100 seats, as I said, and it routinely had trouble filling its cabin.</p> <p>But the thing with business jets---and there have been about half a dozen rigorous market analyses done in the last ten years that have found there is a demand for supersonic business jets---the thing about business jets though is they fly overland about 75% of the time. You're going from regional airports to regional airports.</p> <p>And so if the natural entry point to sort of begin on the supersonic learning curve, learning which routes have the most to manned is a smaller business jet, you're going to have to begin by flying overland. And then once you discover which routes will bear more people you can expand the capacity of the airplane and ultimately I think a private sector would work its way up to having a 100- to 300-seat passenger jet once it had established that the demand existed. And also big part of that is driving down costs, of course. The Concorde was the Concorde it never iterated it. The first model was the last model.</p> <p>In commercial aviation more generally in subsonic aviation we've learned over time how to reduce costs. Even though we fly a slower today than we did 50 years ago, subsonic commercial airplanes are vastly more efficient and we've achieved that efficiency because we've learned over time.</p> <p>Petersen: Okay, so the natural entry point is maybe carrying businessmen between New York and L.A. say, but that's illegal. And so the industry isn't able to sort of clear that hurdle. Is that basically what you're saying?</p> <p>Hammond: Yeah, I mean if you have a 12-person business jet. First of all, it's difficult to get a jet that small to have the range to even go across the ocean. You know you wouldn't necessarily being going from coast to coast in a small business jet right away. You might be going from New York to Houston, or something like that. The point is that you don't know. You don't know which routes are going to bear fruit, a priori.</p> <p>The Concorde flew between France and Britain and the U.S., but It also had roots into the Caribbean and lot of those routes have ended up being canceled in the 80's in part because they just kept losing money, but it was because they had tried to plan it all out a priori, as if they could just deduce which routes would make money.</p> <p>I don't trust that model. I think you have to begin by building something small that you know will meet demand and then expanding from that. And the most important part about this is there's open a confluence of technology in just the last 20 years. I have no illusions that supersonic business jets would have been a thing, say, in 1990. I think a lot of this is a recent phenomenon that's why supersonic overland is an idea whose time has come. There's just been such a breakthrough in technology, in reducing the intensity of sonic booms. And that has been really the biggest hurdle is getting the intensity of sonic booms to a level where people will tolerate it.</p> <p>Petersen: Right. So it seems like the F.A.A., when they banned supersonic flight, the concern was noise but they banned speed as sort of a proxy for noise. But what you're saying is that's a bad proxy you can have the speed without the noise.</p> <p>Hammond: Exactly. So it was an overreaction. What we advocate in our paper and at <a href= \"http://supersonicmyths.com\" target= \"_blank\">supersonicmyths.com</a> is to replace the ban with a reasonable noise standard. Subsonic airplanes already adhere to a variety of noise standards, noise rules. If the issue is really noise---and we believe the issue is basically noise---the F.A.A. should just set a noise standard, say, 80 decibels, something like that, that would be like a lawnmower going by your house. And then let the market try to get below that line. The F.A.A. stance right now is that it will set a noise rule once it sees a supersonic airplane demonstrate that it can go below the noise that it finds acceptable. But it has never stated what it will find acceptable. So it's a sort of reverse order of operations where the F.A.A. wants to hear something that is quiet enough before telling us what is quiet enough.</p> <p>Petersen: And if you're Boeing and you're going to invest millions of dollars building an aircraft that does 80 decibels and the F.A.A. says 'not quiet enough' you're out millions of dollars.</p> <p>Hammond: That's right. And so today the biggest and really only large quiet supersonic project is still within NASA. NASA has been working on quiet supersonic technology pretty much continuously since the mid 80's under a variety of different project titles. And they're the only ones who are able to do it because it's federal money. They have no skin in the game. They do use contracts with, say, Lockheed. But those are still federal contracts. We would like to see more competition in this space.</p> <p>NASA is firm in its belief that a quiet supersonic jet is possible as early as 2020. How much sooner would we have gotten to that if we had the private sector involved?</p> <p>Petersen: Almost certainly much sooner. If we look at private space companies like Space X, they're an order of magnitude cheaper than NASA. They're much more efficient and able to launch rockets into space for a fraction of the cost that NASA has. So, maybe if we use that as our model, then however much NASA has spent on developing supersonic, divide that by ten and maybe that's what the private sector might cost.</p> <p>Hammond: Could very well be. The other thing is that, even today, NASA's effort is directed at the big passenger jets. And part of that is out of this democratic aspiration. They're the government, so they're trying to build something that the everyman could ride. But it's pretty common in new technologies for the early additions or for the early adopters to be of a sort of luxury class.</p> <p>You can think about Tesla's business model where they begin with a roadster and a luxury car---which is really only affordable to millionaires and the very wealthy---with the game plan that they're going to have a low volume high profit or high revenue car and reinvest those profits back into developing cheaper and cheaper versions until they get to a mass market version.</p> <p>We argue that that's exactly how the supersonic learning curve probably works as well. You want to begin with business jets which will of course be a luxury flying supersonic getting from New York to L.A. in two hours instead of five or six. It is worth it to some people. But those early models will of course be expensive. It will be expensive to ride not just because it's new technology and we haven't figured out how to drive down costs, but because a lower capacity means you're dividing the cost by fewer people. But over time those companies can reinvest, build bigger designs and drive down costs until you get to the point where virtually anyone can afford it.</p> <p>The company Boom, which is developing a supersonic jet for over the ocean, is projecting to drive their costs down to about $5,000 a ticket to go across the Atlantic, which is on par with business-class and first-class tickets. So they're projecting that for their own costs. It could very well be the case that that technology and that those cost estimates are probably similar for first models in the over-land market as well. And that's a far cry from the Concorde which cost about $20,000 per flight. So going from $20,000 a ticket to $5,000, that's what this one company is projecting and it's only their first model.</p> <p>Petersen: Right. So if something like Tesla cars or cell phones had to get permission through the political process when they were being developed, then maybe someone in the 90's would have said \"Why should we allow cell phones if only rich people are going to use them?\" And in the 90's they might have been right. But of course now we all have cell phones, and I guess what you're saying is in the 2020s or the 2030s we might all be flying at supersonic speeds when we go on our vacation.</p> <p>Hammond: I believe that. <a href= \"http://www.spacex.com/sites/spacex/files/hyperloop_alpha-20130812.pdf\" target=\"_blank\">Elon Musk, in his Hyperloop paper,</a> discusses the most efficient way of getting from point A to point B. And he argues in that paper---it's sort of an offhand comment he makes---but he suspects that for any city pair that's over 900 miles apart the most efficient way of getting from that city to the other city is supersonic.</p> <p>Petersen: So that's most pairs of big cities.</p> <p>Hammond: Not just most pairs of big cities but the average flight distance, not from where the passenger is starting to where he's going, but the average takeoff to landing for a passenger plane is about 900 miles. So that suggests that if that is an efficient distance for supersonic, the average flight could be flown efficiently at supersonic.</p> <p>Petersen: One issue that your paper goes into is that some people have alleged that supersonic aircraft---because they fly very high---might damage the ozone layer. Is there anything to that?</p> <p>Hammond: I won't say there's nothing to it, but it's been vastly overstated. I'll put it that way. This goes back again to the Concorde and the early environmental movement's objections to it. At the time the understanding of atmospheric science was very very poor compared to today and there were concerns that because the emissions from an aircraft include nitrogen oxides---which are a class of molecules that will bind with oxygen in the atmosphere to destroy ozone---that because the Concorde flew so close to the stratosphere---which is where the ozone layer begins---that these emissions could lead to the depletion of ozone.</p> <p>That's been rejected. The most alarmist versions of it were rejected. In the 70's people were claiming that if the Concorde or a fleet of Concordes were permitted to fly that we'd see catastrophic ozone collapse. That did not come to fruition obviously, the Concorde flew for 27 years. More recent studies now that we have large models of the atmosphere, simulated models of the atmosphere, have determined that a supersonic aircraft flying within 50 to 60,000 feet should in theory be ozone neutral. The reason is because there's actually this countervailing effect where a little bit lower in the atmosphere the nitrogen oxides actually produce ozone, and a little bit above in the stratosphere it depletes ozone. And if you're flying right on that line they roughly cancel out.</p> <p>Petersen: Okay. There were some fears in the 80's and 90's of other things we're doing seriously damaging the ozone layer. But was that a much larger threat than supersonic flight?</p> <p>Hammond: Well it was just a different sort of threat. There are different emissions in aerosols and so forth, CFCs. But out of the concern for the ozone in the 90's we got the Montreal Protocol and the Montreal Protocol is an international agreement to control the emissions of things that will deplete ozone and as supersonic makes its comeback, they will have to be fully compliant with those protocols.</p> <p>I still recommend that going forward there should be more research into this. Even since the Concorde retired, we have better models of the atmosphere and I'm sure there's actually teams that NASA and MIT that are studying this right now.</p> <p>Petersen: It can't hurt to look into it. But it seems like once something is banned or, you know, once the government sort of gets its hands on it and says \"we're not so sure about this\" we become incredibly risk-averse, we look at every possible downside and ignore the huge upside of just having a whole other industry and all that consumer surplus that you get from having an entire market that wasn't there before.</p> <p>Hammond: What I would say is the state of knowledge right now with respect to supersonic and ozone is well established enough to not worry. The catastrophic versions of the concerns have been utterly rejected. Even the more modest versions of it are called into question by the fact that, there seems to be this band around the around 60,000 to 50,000 feet where supersonic emissions are ozone neutral. There, of course, should be more study but we don't have to wait for those studies. The studies we already have are sufficient to suggest that we shouldn't be waiting for more data. We already have enough data to begin today.</p> <p>Petersen: It seems like there are two models of innovation. At one extreme end is the development of new drugs, where we have years upon years of vetting and studies and you have to comply with many requirements before you can get your new drug on the market and it costs billions of dollars. Adds a lot to the price of developing new medicine. And then there's the other model where somebody just makes something and we start using it. And maybe we worry about the implications, but by the time anyone thinks that \"hey maybe this is a bad idea\" it's already been universally adopted.</p> <p>So something like Facebook, where we were all already on Facebook before people started complaining \"Hey what if this is ruining our social interactions or something?\"</p> <p>Hammond: Or maybe all the fake news sites. Destroying democracy.</p> <p>Petersen: Yeah that's topical right? Facebook is now worried about its role as one of the main places young people get their news, or a lot of people get their news, and some things go viral that are not true or and might be misleading and might affect, say, the outcome of elections.</p> <p>Hammond: Apropos of Facebook and that topic, myths and misconceptions and viral falsehoods and urban legends, those are not new phenomena. That's why I had to create <a href= \"http://supersonicmyths.com\" target= \"_blank\">supersonicmyths.com</a>. Because around supersonic, there's just a lot of misconception because there are a lot of people who think they're experts on the Concorde and think that the Concorde proves that supersonic is not economically viable. But they don't really understand that well.</p> <p>Petersen: Right and you could use the same sort of logic to say, \"Look how costly the moon landing was. It's clearly impossible at that cost for any kind of <a href= \"http://economicsdetective.com/2016/11/space-debris-governance-economics-space-alex-salter/\" target=\"_blank\">space tourism or space commerce</a> to be economically viable.\" But the issue is that the moon landing was very very expensive, but it was run by the U.S. government which tends to make all its activities very expensive. A future space tourism company might be much much cheaper and we just don't know until we see it, how much cheaper.</p> <p>Hammond: So I guess I should just comment a little bit on what the new technologies are that have made supersonic overland viable. And they really break down to three: first engines---jet engines---have become a way more powerful, way more efficient. They're way more capable in every way. So, the Concorde used an afterburner on its engine, which means upon takeoff it basically dumped kerosene and lit it on fire and that's why if you watch old videos of the Concorde taking off you see this trail of black smoke coming up behind it. That's the afterburner. Incredibly fuel inefficient, you're just burning fuel. This is what it needed at the time to get the extra boost, to get into the air, because it had to climb to 60,000 feet---which takes quite a bit of energy.</p> <p>Today we have vastly superior engines. In fact, most subsonic aircraft, most passenger planes that you would fly in any consumer flight are capable of going supersonic. They have a top speed which is subsonic but if you put them in overdrive you can go supersonic and in fact, the company I mentioned earlier---Boom---is using off-the-shelf engines to reach its max speed.</p> <p>Second is carbon fiber. So, the shape and the aerodynamics of shape matter a whole lot to supersonic and supersonic overland. The way we reduce booms is by affecting or altering the airfoil around the airplane. So, essentially you can use the shape of the airplane to modify the waves and smooth the waves out. So you don't have this like sudden shock and sudden dip. Instead, you have sort of this gradual rise and fall. And mostly when the human ear detects loudness what it's detecting is suddenness. So you can dramatically reduce the perception of loudness by modifying that airwave and you do that by modifying shape. Most planes are constructed of aluminum, which you can shape reasonably, but not nearly as much as carbon fiber and carbon fiber has become basically a commodity in recent years. It means basically any shape you want is incredibly cheap and incredibly strong.</p> <p>The third and final, probably most important thing is the power of computers and computer simulation. So prior to the early 2000s, I would say, when what's called computational fluid dynamics was really coming up. These are computational simulations of how fluids waters and airs move around shapes. That requires a lot of computing power which we've only recently achieved. Prior to that,</p> <p>if you want to design and test a prototype for a supersonic aircraft you would have to literally build a model and rent a wind tunnel, and then you'd have to have instruments try to imperfectly measure how the wind is moving around the aircraft. That is incredibly costly. So, computer simulation has really democratized. Some of the researchers who've done work on this are just grad students. They have software engineering expertise and they construct algorithms that will search through the space of all possible aircraft designs and try to find the one shape that reduces the sonic boom the best. And then because we have carbon fiber we can go and pour that shape and have the exact shape we want.</p> <p>Petersen: So it used to be, not only did you need the air tunnel but you had to---if you wanted to test 100 wing shapes---you had to physically build 100 wings. Now you tell a computer \"here's 100 wing shapes,\" hit compile, come back the next morning and you have your simulated sound profiles?</p> <p>Hammond: It's actually even cooler than that. Instead you tell the program what you're looking for, and what you're looking for is a shape that will reduce the sonic boom to whatever level you're aiming for. Basically you give it an objective and then instead of trying to design 100 designs and let it test 100 designs, you give it an objective and then it searches through literally hundreds of thousands of designs that it evolves on its own. Some of these algorithms are genetic in nature, so they evolve like biology evolves and they try to go down paths and try to find exactly what shape reduces or hits the objective. And you can have multiple objectives. You can even include the objective of low sonic boom, but you can also have that tempered by the objective of efficiency---fuel efficiency.</p> <p>Shape and size obviously you'd want to put into the objective function. We don't want this airplane to be ten miles long. It happened to be the case that the longer, more slender aircraft cut through the air better but a computer doesn't know on its own that a ten-mile long airplane is not feasible. So you basically give it multiple objectives and you hit play and you let the algorithm do its work. And it can literally iterate through hundreds and hundreds of thousands of designs.</p> <p>Petersen: And this is achievable by grad students just with software that is available, or you can get on a grad student budget?</p> <p>Hammond: Well, I imagine these are big research projects. They have university backing and industry does that too. But it's a single fixed cost instead of a repeated variable cost of having to rent a wind tunnel every single time you want to test.</p> <p>Petersen: So it sounds like despite the fact that there's been a supersonic ban and despite the fact that there is no supersonic industry, or no supersonic commercial flights going on in the world today, we still had advancement, but it's been mostly on the technology side, on the theoretical side. What we haven't seen is actual supersonic flights and testing the water, testing the market. I saw in your paper that you go through some estimates of the potential size of the supersonic market. Do you want to talk through some of those?</p> <p>Hammond: Sure. There has been by my count seven market analyses. Most of them from the mid-2000s till today. The estimates range from 180 supersonic business jets to over 600. So, these are companies like Gulfstream Aerospace, which is a leading business-jet manufacturer. They've done actually two or three of these market analyses. And they foresee up to 350 units for just themselves. So 350 business jets that they could produce over ten years. That is quite a demand.</p> <p>Petersen: And they're looking at things like whose opportunity cost of their time is high enough that they would pay maybe a few thousand extra dollars, maybe several thousand in order to save a few hours. And right now there are C.E.O.s, there are wealthy people who maybe live in the United Arab Emirates but want to commute to New York and right now that means sitting on a plane for---gosh I don't even know---it would be like 15 hours or something. If it could be six hours, for most of us, we might prefer to sit on a plane longer and pay significantly less. But if your time's really valuable, if you run a multi-million-dollar company, it really can be worth it to save some of your time, even at a high cost.</p> <p>Hammond: Of course it's possible if you had supersonic overland to leave New York and go to London and then come back to New York on the same day. There are people who would love to do that. I think what gets missed in this it's not just about going faster for its own sake. This makes the world smaller, it makes you rethink travel. So in addition to these American analyses, there have also been some surveys. One survey did a survey of business jet operators and importantly they asked them to basically state an estimate from zero to 100 what the likelihood is that they would buy a supersonic business jet if they could. When they asked that under the condition that there is still an overland ban the number was zero, so zero percent of people. The average person said that there was zero chance they'd buy a supersonic business jet if they can't fly overland but in the case that the ban is lifted, that number jumps to 50%. So half of the businesses that were surveyed would see a chance.</p> <p>Petersen: That's further evidence that it's not just that supersonic is unviable, it's that this legal restriction is in a very important market which is flying over the United States. That's what's killing the supersonic industry.</p> <p>One other the thing I saw on your website was, you talk about the tradeoff between noise and fuel efficiency in the context of airport noise restrictions. Could you tell me, how does that tradeoff work?</p> <p>Hammond: I think that one of the biggest barriers to the F.A.A. is the issue of airport noise. The F.A.A. has worked with I.K.O. and I.K.O is the UN's body who deals with aviation standards. They've worked for literally decades to try to ramp up the stringency of noise around airports and they're pretty proud of what they've accomplished. If you live near an airport today it's a much quieter experience than it would have been 20, 30, even 40 years ago.</p> <p>But this comes with a tradeoff. The way aircraft reduce noise is they have a bypass ratio. So at the extreme, you have a turbo-jet, which means all the air passes through the jet and then you have jets which bypass air around the jet. So, you have the jet in the center and that's what's pushing, propelling the plane forward. But then you also bypass air around the jet to basically insulate the noise. But that comes with a tradeoff. So the more air you bypass, the quieter it will be, but also the more fuel and the less thrust you get. And it happens with supersonic because you're going from sea level to 60,000 feet potentially, you actually have to really take off at a steep angle and you have to push up. You have to really get up high, basically, and so you could make the argument that we should tolerate slightly lower airport noise standards for supersonic at first, so they can use lower bypass ratio engines and therefore less fuel when they're making their incline.</p> <p>Petersen: So there's <a href= \"https://www.mercatus.org/publications/airport-noise-nimbyism\" target=\"_blank\">another paper from Mercatus</a>, also written by your co-author Eli Dourado, and that one talks about the number of airport noise complaints that come from a really small concentrated number of households. I found that very funny.</p> <p>Just how concentrated are the airline airport noise complaints?</p> <p>Hammond: Let me say first that what we recommend for airport noise standards is stage three noise standards, which are what we currently use. So, currently if you live near an airport and you see a plane taking off and you can hear it slightly, that's the stage three noise standard. We're advocating that supersonic abide by that noise standard. That noise standard is being phased out for stage four and later stage five, which will be even stricter. So we're not saying anything like \"Oh we should let planes be super noisy,\" we're saying \"let supersonic planes be as noisy as the ones that we currently have taking off, and just give them a bit of a window before they're phased into these newer, more stringent noise standards that are coming down the pipeline.\"</p> <p>Eli's work with Raymond Russell, they found an amazing data set that includes records of who is making noise complaints, airport noise complaints. And they have them by airport and the astonishing thing they find is that these airports are getting sometimes tens of thousands of noise complaints every year but when they drill down into the data, it is just a handful of people making all the complaints.</p> <p>So a few examples. I live near Ronald Reagan Washington National Airport and in 2015 they had 8,760 noise complaints. Two individuals at one D.C. residents accounted for 6,852 of those complaints. So, two people in one building accounted for 78% of the complaints. They have a report called <a href= \"https://www.mercatus.org/publications/airport-noise-nimbyism\" target=\"_blank\">\"Airport Noise NIMBYism: An Empirical Investigation\"</a> where they go through all the airports that have this data and they find evidence of the sort of concentration of complainers at every single airport. So, it's a pretty surprising thing and I think it's important to get this information out there because as we know from when the Concorde was banned overland, residents’ associations are a pretty powerful group to mobilize in opposition to something like this, and Congress people have the perception that---like San Francisco in 2015 had almost 900,000 those complaints to San Francisco International Airport. These are constituents, we want to reduce noise this is obviously something they care about. But in fact, in San Francisco's case, only 53 individuals accounted for 25,000 of the complaints. And those 25,000 were all during a single month---the month of October---which meant that the average person was making 477 calls per person. So, 30 days in a month, that's a lot of calls every single day. And this is San Francisco so wouldn't surprise me if there were some enterprising software developers who figured out a way to make complaints automatically.</p> <p>Petersen: So robot calls. It might be crazy people calling in a complaint every single time they hear an airplane, or it might be clever people robotically calling in a complaint every time there's an airplane. Except that I guess they didn't anticipate that someone would notice that all these calls were coming from the same location which kind of undermines their objective which would be to reduce noise in those areas.</p> <p>Of course, if you bought your house after the airport was already there making noise then economics says that that noise should already be priced into the value of the house. The person who loses is the person whose house is next to an empty lot and then the government announces \"Hey we're going to build an airport here.\" You'd expect the change in home prices to happen immediately when that's announced and then every following owner has already accepted that cost and they've had cheaper real estate prices as a result. So, if you buy a house next to the airport and then try to pressure the airport to make less noise you're sort of trying to boost your property value when you already paid a discounted rate. You are already compensated for accepting that noise.</p> <p>Hammond: And not only that. But when people have done rigorous cost-benefit analyses of U.S. aviation noise standards and they consistently find that the costs of making airplanes less efficient on takeoff is greater than alternatives which include creative land use policies, like building in barriers that block sound near communities and stuff like that. So, if you have a community living very close to an airport, one alternative is to set global standards which say airplanes are to fly less efficiently and make less noise, or you build a wall. You build up a barrier or some insulation to protect the community from the noise. But the main point of this study that Eli and Raymond did---which by the way, if I remember this correct, is Mercatus's most downloaded paper in history---the main point is that we shouldn't be basing innovation policy, particularly something that can have very high impact, on a few crazy people and enterprising robot callers.</p> <p>Petersen: People who are affected by having less efficient aircraft, having slower aircraft, more expensive air travel just so outnumber the small number of people who live near airports. And you could get them all double-ply windows and help make their houses more soundproof. Probably much cheaper than hamstringing the entire airline industry.</p> <p>Hammond: Absolutely. I just want to recapitulate some things. Supersonic overland is today feasible. It can be economical, there are companies chomping at the bit to try to develop something that will be quiet and affordable. The only thing standing in their way is the F.A.A. and a public perception that the Concorde proved that supersonic is not viable. The F.A.A. could act today, it could issue a noise standard and allow developers to shoot for that standard. Even if a bill is passed today, what the F.A.A. wants to do is coordinate internationally with I.K.O. and I.K.O. is the UN body that---it's not a regulator---sets standards.</p> <p>The F.A.A. has a prominent role in guiding us towards standards, but it's an incredibly slow process. I.K.O meets every three years. If the F.A.A. were told to remove the ban tomorrow and they wanted to coordinate internationally, would mean we have to wait about three years. I.K.O. is meeting this year, obviously they're not going to talk about it this year---the agenda is all set. So they're going to be talking about it three years from now and then they'll be finalizing those rules three years from then. And then the F.A.A. will take those rules, propagate them globally and then we will have another two or three year regulating period where there's a notice and comment and everything else.</p> <p>So we're talking about ten years just to change this stupid ban that is obsolete and I think that speaks to a more fundamental problem in U.S. policy and regulation, which is, we create these massive bottlenecks. And it's no surprise that it happens to an idea that is such a no-brainer, like creating a noise rule for supersonic instead of a ban. You can find other examples in every other industry of every other emerging technology, where there are these obsolete rules that are getting in the way of better, more efficient, more affordable, faster technology. And even if they can be rolled out tomorrow, have to go through at times a decadal process of approval. So, I think it's no wonder that productivity innovation seems to be at a historical low.</p> <p>Petersen: My guest today has been Sam Hammond. Sam, thanks for being part of Economics Detective Radio.</p> <p>Hammond: Thank you.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "51:12",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What follows is an edited transcript of my conversation with Sam Hammond.  Petersen: My guest today is . He's a policy analyst at the . Sam, welcome to Economics Detective Radio. Hammond: Hi! Petersen: Our topic today is supersonic air travel. Sam has..."
}