{
  "title": "Laos rescues 11 Indian nationals trafficked to work as phone scammers",
  "description": "Promised high-paying jobs in Singapore and Dubai, they wound up in the murky Golden Triangle economic zone.",
  "link": "https://www.rfa.org/english/news/laos/trafficked-11032022222930.html",
  "guid": "https://www.rfa.org/english/news/laos/trafficked-11032022222930.html",
  "author": "By RFA Lao",
  "media:content": {
    "media:description": "The Kings Romans casino is seen across the Mekong River in the Golden Triangle Special Economic Zone in northern Laos' Bokeo province, Januar, 2012.",
    "media:credit": "Reuters"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">Authorities in Laos have rescued 11 Indian nationals who were lured to the Chinese-run Golden Triangle Special Economic Zone in the north of the country and put to work as phone scammers, according to the Indian Embassy.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The operation shines a light on the murky enclave in Bokeo province – home to the Kings Roman Casino resort – where many foreigners who were promised lucrative jobs end up held against their will by trafficking rings that exploit them under threat of violence.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The Golden Triangle economic zone is a gambling and tourism hub catering to Chinese citizens situated along the Mekong River where Laos, Myanmar and Thailand meet. In 2018, the U.S. government sanctioned the Chinese tycoon who is said to run the SEZ as head of a trafficking network.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Last week, Lao authorities acted on a tip from the Indian Embassy to rescue 11 Indians who had been held for more than a month by traffickers in the zone. </span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">They were recruited by unscrupulous middlemen to work as IT specialists in Dubai, Singapore and Thailand with offers of well-paying jobs and pre-arranged flights, visas and passports, according to Indian Embassy sources who discussed the situation off the record because they were unauthorized to speak to the press.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Instead, they wound up in northern Laos, where they were forced to work in call centers largely unmonitored by authorities, calling people to solicit money for fraudulent investment schemes or engage in cryptocurrency scams.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Rights groups estimate that at least 1,000 people from South and East Asia have been lured to work as scammers at the Golden Triangle zone, many of whom continue to be held against their will there.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Extricated by Lao officials last week, the 11 workers were brought to the Lao border with Thailand and handed over to a team from the Indian Consulate in Chiang Mai, before being repatriated to India over the weekend via Bangkok, the Indian Embassy in Laos said in an announcement posted to its Facebook page.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">RFA Lao was unable to reach Lao authorities operating in the Golden Triangle economic zone or officials in the Indian Embassy in the Lao capital Vientiane for comment on the rescue operation.</span></p>\n<p></p>\n<p><b>Conditions at scam centers</b></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">A Lao national who previously worked as a scammer in the zone told RFA on condition of anonymity that trafficking is rife there and said several foreign nationals were being held against their will at the call center where he was located.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">“There were three or four Indians and as many as 20 Thais working as scammers [when I was there],” he said, adding that most foreign nationals being held at the zone at the time were Thai, Chinese and Vietnamese, although he also met Indonesians and Malaysians.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The former scam center worker from Laos told RFA that if they follow orders, trafficked workers could earn U.S. $450-725 per month, depending on the number of people they scammed, while those who could speak Thai, Chinese, or Vietnamese could earn even more.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">But rules were strict and anyone who left the call center without informing members of the trafficking ring or escaped and was caught “would face a serious punishment,” he said.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Despite the restrictions and the threat of punishment, the Lao national said that he planned to return to the zone again because “I know how to do the work and they will hire me right away.” </span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">In addition to luring unsuspecting foreign nationals through middlemen, scam centers also “recruit” workers through other means, the Lao national told RFA.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">During an outbreak of COVID-19 in August and September 2021, authorities in Bokeo province temporarily closed the Golden Triangle economic zone to force employers based there to allow their workers to return home and renegotiate hiring contracts, due to the slowdown of the economy. </span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Instead of allowing them to return, he said, many of the centers simply “sold” their workers to trafficking rings who forced them to do the same work stipulated in their existing contracts, threatening them with beatings and imprisonment if they refused.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Meanwhile, the worker said, Lao authorities cannot easily enter the Chinese-run zone, which operates largely beyond the reach of the Lao government, and are often unable to arrest ring leaders because the victims of the scams rarely report their losses to police.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">“Nobody takes them to court because there’s no proof,” he said. “Those who lose money dare not tell the police or take legal action.”</span></p>\n<p></p>\n<p><b>Foreigners targeted</b></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Chinese-run enclaves in Southeast Asia have come under heavy scrutiny in recent months after hundreds of </span><a href=\"https://www.rfa.org/english/news/china/taiwan-cambodia-scam-08232022132211.html\"><span style=\"font-weight: 400;\">Taiwanese nationals</span></a><span style=\"font-weight: 400;\"> were rescued after being lured into human trafficking and abusive jobs scams in Cambodia, with many victims taken to work in Chinese-owned casinos in the coastal city of Sihanoukville.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The government has so far registered 1,267 workers in the Golden Triangle zone, only a fraction of the total, although the exact number employed there is unknown, according to Lao officials. Efforts to register workers to protect them from human trafficking and other abuses </span><a href=\"https://www.rfa.org/english/news/laos/worker-registrations-08242022162635.html\"><span style=\"font-weight: 400;\">have met with limited success</span></a><span style=\"font-weight: 400;\"> because workers balk at paying the fees and fear that signing up will get them sent home, sources have told RFA.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">In addition to the 11 Indian workers rescued last week, authorities freed 44 Pakistanis from the zone on Oct. 20 and seven Malaysians on Oct. 6. Malaysian authorities have said there are 50-100 Malaysians still being held by traffickers in the zone.</span></p>\n<p></p>\n<p><b><i>Translated by Sidney Khotpanya. Written in English by Joshua Lipes.</i></b></p>\n        ",
  "pubDate": "Thu, 03 Nov 2022 22:33:33 -0400"
}