{
  "id": "yt:video:bHFbaF9_kpI",
  "yt:videoId": "bHFbaF9_kpI",
  "yt:channelId": "UC19U0h0sS72el1ht5GjSOKg",
  "title": "The Decemberists - Once In My Life",
  "link": "",
  "author": {
    "name": "TheDecemberistsVEVO",
    "uri": "https://www.youtube.com/channel/UC19U0h0sS72el1ht5GjSOKg"
  },
  "published": "2018-07-17T13:00:10+00:00",
  "updated": "2022-05-20T20:29:13+00:00",
  "media:group": {
    "media:title": "The Decemberists - Once In My Life",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Statement from Colin Meloy:\n\nWe were searching for a video idea for “Once In My Life” that would somehow capture the spirit of the song. In my mind, the song is a meditation, a plea to the cosmos that I imagine everyone, at some point or another, has made. We asked our old friend and collaborator Autumn de Wilde to pitch an idea and she came to us with a simple but powerful story: a depiction of her brother Jacob, a man who has lived with physical and intellectual differences his entire life, dancing in the streets of Los Angeles. The song, in this light, becomes more than just a “celebration of sadness,” (which I have sometimes called it) but suddenly a longing holler to the universe against one’s perceived otherness.\n\nThis idea is particularly close to me as I’ve witnessed how the world sees my son Hank, who is autistic. When I’m out in public with Hank, I’m acutely aware of the world’s attachment to social and behavioral norms; in these situations, Hank’s otherness can suddenly be put in stark relief. Through the lens of Jacob’s joyful and defiant movement in Autumn’s video, we see a man shrugging off the constraints of an unaccommodating and judgmental world and truly reveling in his body and mind.\n\nStatement from Autumn de Wilde:\n\nMy brother Jacob is 7’2”.\nHis feet are size 22.\nHe has Auditory Processing Disorder.\nHe likes to dress up as Chewbacca.\nHe is not a basketball player.\nThis video is my love letter to him.\n\nMy mother said to me recently when we were talking about the way the people tend to react to Jacob, someone who looks and sounds extraordinarily different from their opinion of what normal is: “When we see someone new or different, we have to stop thinking about ourselves for a moment in order to really experience them. As humans, we tend to want to put our fingerprints all over other people.”\n\nThe Decemberists’ song “Once In My Life” is the song I needed when I was young.... when I felt stared at, mocked or unseen for my heart and mind. Jacob also had an immediate emotional reaction to the song when I played it for him the first time. I had been wanting to explore a creative collaboration with my brother for a while, and this was the perfect song.\n\nI have a very strong connection to Hank Meloy, Colin Meloy and Carson Ellis' son, who is autistic. He has very much inspired my mind and imagination as an artist and a thinker. Although Jacob and Hank's bodies and diagnosis are very different, Jacob, Hank and all of us who look different, sound different, or think different have a connection in our experience of otherness. There are many of us who feel sometimes like we live in a sort of dollhouse for the wrong doll but our perspective can shift dramatically when we realize, in fact, that our difference has simply redefined the space we are in. My brother is in his 40's and his long journey to achieve the comfort and understanding in how he moves, communicates and connects to others is inspiring to me. Self-love and acceptance are the real superpowers waiting for all of us.\n\nEveryone featured in the video and working on the crew is a friend who gave 100% to this project. I wanted Jacob to be surrounded by friends who were committed to helping him tell this story, but also create a safe space for Jacob, which changed our pace and usual process for filmmaking. It was thrilling as a director and a sister to challenge Jacob and myself. I am honored to have put the spotlight on him, watched my brother flourish as an artistic human onscreen and show us how gorgeous different is.\n\nDirected by Autumn de Wilde (http://autumndewilde.com) \n\nMusic video by The Decemberists performing Once In My Life. © 2018 Capitol Records, LLC\n\nhttp://vevo.ly/J1jpzr",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}