{
  "id": "yt:video:HnsKfdnKZVk",
  "yt:videoId": "HnsKfdnKZVk",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "Batteries are dirty. Geothermal power can help.",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-11-01T12:00:10+00:00",
  "updated": "2022-11-02T14:13:32+00:00",
  "media:group": {
    "media:title": "Batteries are dirty. Geothermal power can help.",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A better future can’t just be green, it must also be fair.\n\nSubscribe and turn on notifications 🔔 so you don't miss any videos: http://goo.gl/0bsAjO \n\nLithium-ion batteries are a transformative technology in the fight against climate change. Most notably, they power electric vehicles, which have the potential to replace emissions produced by road transportation. \n\nBut there’s a problem. These batteries require nickel. And in Indonesia, where the majority of nickel is produced, the production process emits large amounts of carbon and pollution. It’s impacting the people who live by the production centers, who are registering an increase in respiratory illnesses. The US is essentially outsourcing carbon emissions and pollution in exchange for green energy. \n\nIt doesn’t have to be this way. Indonesia sits along the Ring of Fire, one of the most geologically active regions in the world, making it an ideal place to produce geothermal energy.\n\nGeothermal energy taps into the heat beneath the ground mostly found in volcanic regions. To use the heat beneath the earth’s surface, we need to drill into the ground, draw up the hot water, and use it to turn turbines that produce electricity. After, the water is funneled back underground, making geothermal a mostly clean and renewable energy source. \n\nWhile the exploration and development process of geothermal energy can be expensive, Indonesia already has more than 30 active geothermal facilities. \n\nAs the world’s need for lithium-ion batteries increases, Indonesia and the companies invested in the region have the opportunity to make their processes greener from start to finish — and protect the people that live next to nickel production centers.\n\nTo understand the repercussions of nickel production in Indonesia and how geothermal energy could help fix the air pollution and emissions it produces, watch our video.\n\nThe Future Perfect team at Vox explores big problems and the big ideas that can tackle them. Read more here: https://www.vox.com/future-perfect  \n\nThis video was made possible by a grant from the BEMC Foundation.\n\nWatch previous episodes of Future Perfect here: https://youtube.com/playlist?list=PLJ8cMiYb3G5dAchmwTsFnuMu3xgEkQ0ra\n\nMake sure you never miss behind-the-scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}