{
  "id": "yt:video:4b80sR-joNY",
  "yt:videoId": "4b80sR-joNY",
  "yt:channelId": "UCV4Rx1m-9HmtqHET7GjnVOA",
  "title": "Who cares about atoms - simulating a continuous perspective on matter",
  "link": "",
  "author": {
    "name": "braintruffle",
    "uri": "https://www.youtube.com/channel/UCV4Rx1m-9HmtqHET7GjnVOA"
  },
  "published": "2021-09-03T12:33:09+00:00",
  "updated": "2022-06-28T09:02:22+00:00",
  "media:group": {
    "media:title": "Who cares about atoms - simulating a continuous perspective on matter",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is the second part in a series about Computational Fluid Dynamics where we build a Fluid Simulator from scratch.\n\nWe derive the Macroscopic Perspective (Continuum) from the Microscopic Perspective (Molecules) covering: Collective Molecular Behavior, Local (Non-)Equilibria, Classical Statistical Mechanics, Rarefied Gas Dynamics, and Continuum Gas Dynamics.\n\nThe Macroscopic Perspective provides the ground for the next part where we make it all numerically accessible - the Discretization.\n\n\nTimetable:\n-----------------\n00:00 - Why we need a Macroscopic Perspective\n01:44 - Particles Collective Behavior\n05:33 - Using Equilibria for Reduction\n08:17 - Statistical Mechanics and Rarefied Gas Dynamics\n12:00 - Continuum Gas Dynamics\n16:09 - Building Macroscopic Quantities\n23:05 - Linking Macroscopic Quantities\n34:09 - Recap\n\n\nSelected Papers and Learning Resources:\n-------------------------------------------------------------------\nSorted by Topics:\n01:44 - Local (Non-)Equilibrium; Necessity of Collisions; Fluctuations; Molecular Chaos; Initial Perturbation; Statistical Perspective; Statistical Ensemble Averaging; Time Reversibility (to be discussed), Equilibria of different Degrees-of-Freedom (to be discussed): [1,2,3]\n08:17 - Rarefied Gas Dynamics: [1,4]\n08:17 - Phase Space (one-particle vs. N-particle): [1,5,6]\n08:17 - Boltzmann Equation derived via BBGKY Hierarchy from Liouville Theorem: [6]\n12:00 - Continuum Gas Dynamics, Continuum Hypothesis/Assumption, Alternative Flow Regimes Classifications: [1]\n12:00 - Local Knudsen Number and alternative Rarefaction Indicators: [1,4]\n16:09 - Macroscopic Quantities: Density, Flow Velocity, Pressure, Temperature [1]\n23:05 - Macroscopic Equations: Conservation Laws; Mass; Momentum; Energy [1]\n27:20 - Navier-Stokes Equations; Densities of Forces; Pressure Gradient; Viscosity: [1,7]\n27:41 - Time Derivatives along with flow; Lagrangian vs. Eulerian Formulation; Lagrangian vs. Eulerian Coordinate Systems: [8]\n30:12 - Velocity and Temperature Profiles for Couette Flow: [9]\n32:45 - Macroscopic Equations: Equations of State; Ideal Gas Law; Calorically Perfect Gas: [1]\n\nSelected References:\n[1] - Lecture Notes: from \"http://volkov.eng.ua.edu/ME591_491_NEGD/2017-Spring-NEGD-01-ElemKineticTheory.pdf\" to \"NEGD-06\"\n[2] - Paper: Maes, Christian, and Karel Netočný. \"Time-reversal and entropy.\" Journal of statistical physics 110.1 (2003): 269-310.\n[3] - Paper: \"Parker, J. G. Rotational and vibrational relaxation in diatomic gases. The Physics of Fluids 2.4 (1959): 449-462.\"\n[4] - Paper: Macrossan, M. N. \"Scaling parameters for hypersonic flow: correlation of sphere drag data.\", 2007.\n[5] - Lecture Notes: \"Cerfon, Antoine. Mechanics (Classical and Quantum). https://www.math.nyu.edu/~cerfon/mechanics.html\"\n[6] - Lecture Notes: \"Kenkre, V. M.. Statistical Mechanics. https://www.unm.edu/~aierides/505/\" specifically \".../bbgky2.pdf\" &  \".../bbgky3.pdf\"\n[7] - Book: Anderson, John D. \"Governing equations of fluid dynamics.\" Computational fluid dynamics. Springer, Berlin, Heidelberg, 1992. 15-51.\n[8] - Essay: Price, James F. \"Lagrangian and eulerian representations of fluid flow: Kinematics and the equations of motion.\" MIT OpenCourseWare, 2006.\n[9] - Paper: Marques Jr, W., G. M. Kremer, and F. M. Sharipov. \"Couette flow with slip and jump boundary conditions.\" Continuum Mechanics and Thermodynamics 12.6 (2000): 379-386.\n\n\nDisclaimer:\n------------------\nThis series focuses specifically on the aspect of information reduction in dynamical systems. For the sake of clarity, I had to omit many interesting aspects of the topics addressed in the video. So, the video itself is a reduction. :-)\n\n\nPlease note:\n------------------\nWatching this video with very low resolution produces the continua right away :-), thanks to the video compression!\n\n\nI hope you enjoyed this little braintruffle!\n\nIf you like this series and want to support my work, you may consider subscribing to the channel. I would really appreciate it!\n\nThank you for watching and I hope to see you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}