{
  "title": "48: The Times of Harvey Milk",
  "link": "https://audioboom.com/posts/6909962",
  "itunes:episode": 48,
  "itunes:title": "The Times of Harvey Milk",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3598,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>There are no two ways about it, Harvey Milk looked great in a T-Shirt. <br>\n<br>\n\n</div>\n<div>Happy Pride, everyone! Let's talk about some gay stuff! (don't worry, this one is super true-crimey too.). In 1978, Harvey Milk became one of the first openly gay elected officials in the US when he won a seat on the San Francisco Board of Supervisors. 11 months later Milk and Mayor George Moscone were gunned down in their offices by Dan White, another of the city's Supervisors. This doc tells the story of Milk's rise to prominence and circumstances that led to the double assassination. This one is full of the gayest gays (Hey Girls!), The smartest lesbians (Hey Girls!), a FABULOUS pair of seashell earrings, and a union guy who, just trust us on this, gets a pass on calling Harvey Milk a \"Fruit.\" Oh AND this case gives us \"The Twinkie Defense,\" which is exactly as bullshit as it sounds. <br>\n<br>\n\n</div>\n<div>Looking for more TCO? <a href=\"https://www.patreon.com/TrueCrimeObsessed\">We're on Patreon!</a> And we're covering \"Serial\" episode-by-episode--we're currently up to episode 10 and it's bonkers.  After \"Serial,\" we're diving into \"The Staircase\" episode-by-episode. In addition, hear our two other full bonus episodes, extended outtakes from our episodes, and 8 mini-episodes (which are basically funny stories about everything from the time Patrick's kid went missing in the middle of the night to Gillian and Patrick's misadventures at CrimieCon). <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Check it all out here!</a>\n</div>\n",
  "pubDate": "Tue, 26 Jun 2018 04:01:00 +0000",
  "guid": "tag:audioboom.com,2018-06-26:/posts/6909962",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}