{
  "title": "#454: Drinky Winky (OOTP 18, Dumbledore's Army)",
  "link": "https://audioboom.com/posts/7513268",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4143,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News covers <a href=\"https://www.hypable.com/cormoran-strike-book-5-release-date/\">Cormoran Strike Book 5 \"Troubled Blood,\"</a> Cursed Child Japan and Fantastic Beasts 3</li>\n<li>Muggle Mail: Harry's post-Hogwarts career, a sibling rivalry, and Dumbledore's boggart</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 18: Dumbledore's Army</li>\n<li>7-Word Summary: Hogwarts is holding a group defense meeting</li>\n<li>Harry can Accio a bullfrog? J.K. Rowling has said you can't accio inanimate objects</li>\n<li>Are the Hogwarts professors secretly teaching DADA in their own classes?</li>\n<li>How exactly did that conversation go between Dumbledore and Umbridge about the Gryffindor Quidditch Team?</li>\n<li>Is Hermione right to reconsider forming Dumbledore's Army?</li>\n<li>Is Sirius truly “reckless” and “living through” the trio?</li>\n<li>Harry's connection with Voldemort strengthens! Why doesn't Harry consult an adult ?</li>\n<li>Dobby, Winky, Hedwig and the Room of Requirement</li>\n<li>We compare the Room of Requirement's use in Order of the Phoenix to it's use in Half-Blood Prince</li>\n<li>We rate the the proposed names for Dumbledore's Army</li>\n<li>Professor Potter</li>\n<li>The Umbridge Suck Count climbs to 35!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: What does Hermione use to bewitch the golden coins for DA members?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n<li>MuggleCast has launched a listener survey so we can hear what you think of the show. <a href=\"https://forms.gle/EyfFrFvovQhHisiE8\">Please take a couple minutes to fill it out</a>!</li>\n<li>This week's episode is sponsored by Openfit (texted 'MuggleCast' to 505050 for a free trial), Quip (visit <a href=\"http://www.GetQuip.com/muggle\">GetQuip.com/muggle</a> to get your first refill free) and ThirdLove (Visit <a href=\"http://www.ThirdLove.com/MuggleCast\">ThirdLove.com/MuggleCast</a> for 15% off your perfect fitting bra). This </li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 25 Feb 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-24:/posts/7513268",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}