{
  "title": "How this startup is facilitating change within the rental market in SEA",
  "link": "https://e27.co/how-this-startup-is-facilitating-change-within-the-rental-market-in-sea-20221030/",
  "dc:creator": "Luca Bregoli",
  "pubDate": "Wed, 02 Nov 2022 04:00:18 +0000",
  "category": [
    "Community",
    "Property & Construction",
    "Smart Cities",
    "Cove"
  ],
  "guid": "https://e27.co/?p=475195",
  "description": "<p>Across Southeast Asia, young professionals are struggling harder and longer than their parents and grandparents in their pursuit of owning a home. More often than not, owning a home will take up a chunk of their income and leaves no room for any semblance of financial freedom, causing stress and sometimes leading to debt. However, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/how-this-startup-is-facilitating-change-within-the-rental-market-in-sea-20221030/\">How this startup is facilitating change within the rental market in SEA</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-475366 size-full\" src=\"https://e27.co/wp-content/uploads/2022/11/e27-33.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p><span style=\"font-weight: 400;\">Across Southeast Asia, young professionals are struggling harder and longer than their parents and grandparents in their pursuit of owning a home. More often than not, owning a home will take up a chunk of their income and leaves no room for any semblance of financial freedom, causing stress and sometimes leading to debt. </span></p>\n<p><span style=\"font-weight: 400;\">However, younger Southeast Asians are no longer willing to put off having their own space and have found that renting a place can be the next best thing.</span></p>\n<img loading=\"lazy\" class=\"aligncenter wp-image-475360 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/e27-32-1.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p><span style=\"font-weight: 400;\">As a result, the stigma associated with renting is less apparent. Furthermore, with an increasing number of companies catering to the needs and concerns of the younger generation, a shift in perspective has come about. </span></p>\n<p><span style=\"font-weight: 400;\">Renting is no longer seen as an unnecessary expense and a hindrance to the long-term goal of being a homeowner. Instead, it is now seen as an immediate and more flexible solution. </span></p>\n<h1>Progressive structures for the younger generation</h1>\n<p><span style=\"font-weight: 400;\">The conventional and restrictive structure of the real estate market no longer attracts younger and modern Southeast Asians. </span></p>\n<p><span style=\"font-weight: 400;\">This can be seen across the region, particularly in Singapore, where the landscape is continuously changing. </span><span style=\"font-weight: 400;\">Traditionally, the Housing & Development Board (HDB) scheme has enabled very high levels of home ownership. </span></p>\n<p><span style=\"font-weight: 400;\">However, with the rising prices of HDBs, especially in the resale market, coupled with the supply being unable to keep up with demand due to delays in the construction of Build-to-Order (BTO) properties, which can be as long as five or six years, home ownership in Singapore has declined over the years.</span></p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/casa-mia-a-singapore-coliving-startups-success-story-20220224/\">Casa Mia, a Singapore coliving startup’s success story</a></strong></p>\n<p><span style=\"font-weight: 400;\">This was further exacerbated by the pandemic, where many Singaporeans were cooped up with their families, prompting Singaporeans to opt for a more immediate solution.  </span></p>\n<p><span style=\"font-weight: 400;\">Furthermore, the requirements for owning an HDB are becoming more and more confining, with criteria indicating that one has to be married or above 35 years old to own a home. This does not gel well with the progressive population of young people who are less likely to be in traditional relationships and are choosing to get married later. </span></p>\n<p><span style=\"font-weight: 400;\">The alternative of waiting until age 35 to get a place is equally unattractive, and young people are no longer prepared to live with their parents until that age, hence the appeal of renting.  </span></p>\n<p>In Indonesia, similar trends of declining home ownership have been observed. This is also due to the rising cost; <a rel=\"follow\" href=\"https://www.thejakartapost.com/news/2021/06/28/indonesian-homeownership-slides-as-affordability-issues-arise.html\">according to data from Statistics Indonesia (BPS)</a>, the national share of households with a home of their own fell to just over 80 per cent last year from nearly 85 per cent in 1999. This is in line with the higher number of Indonesians renting a home at 37.71 per cent in 2020.</p>\n<p><span style=\"font-weight: 400;\">Additionally, with the greater focus on remote working, many Southeast Asians echo the same sentiments regarding home ownership and no longer feel the need to stay put in one place. This makes renting a more enticing option to cater to their mobile lifestyle. </span></p>\n<h2>SEA&#8217;s home rental platform Cove leads a paradigm shift in the rental market</h2>\n<p><span style=\"font-weight: 400;\">Cove</span><span style=\"font-weight: 400;\">, Southeast Asia’s leading one-stop home rental platform, saw that rental was growing everywhere. As experienced renters, the founders realised that the available offerings in the market were very sparse.</span></p>\n<p><span style=\"font-weight: 400;\">Having collectively rented over 30 properties in around 14 cities globally, the founders are familiar with the experience and the hurdles that young professionals have to go through to find suitable accommodation. </span></p>\n<p><span style=\"font-weight: 400;\">They understand the importance of homes to people and how homes are their safe spaces, where they live out many important moments in their lives. They held on to a belief that everyone, whether they rent or own, deserves to have a high-quality, comfortable place to live where they can feel a sense of belonging in.</span></p>\n<p><span style=\"font-weight: 400;\">To lead a shift in perspective amongst Southeast Asians, Cove knew the long-established rental processes had to change. Often tedious, antiquated and not tech-enabled, the undertaking alone can be a deterrent, with multiple agents, in-person viewings, poor listing websites and lots of paperwork. </span></p>\n<p><span style=\"font-weight: 400;\">In addition, there is often a prolonged process before tenants can settle down, namely, having to set up utilities, buy furniture and have very inflexible long contracts. </span></p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/throw-your-paper-based-biz-card-away-because-scard-has-a-better-alternative-20221007/\">Throw your paper-based biz card away because Scard has a better alternative</a></strong></p>\n<p><span style=\"font-weight: 400;\">With that in mind, Cove has used technology and a consumer-first approach to transform and make the experience more seamless. With flexible stays starting from three months only, everything is managed by state-of-the-art technology, from Virtual Reality (VR) tours to online booking and even the integration of smart home technology where possible. </span></p>\n<p><span style=\"font-weight: 400;\">The goal is to strengthen mindsets further that renting is the new norm. In just over four years, Cove has expanded its portfolio across Singapore and Jakarta to 6,000 rooms, more than 30 times the roughly 200 rooms it had in 2019.</span></p>\n<h2>The future of the rental market</h2>\n<p><span style=\"font-weight: 400;\">Southeast Asia has always been conventionally a house-buying market, and stereotypes about renting have long been ingrained within the population. However, there has also been a growing acceptance that times are evolving and that a different approach is necessary. </span></p>\n<p><span style=\"font-weight: 400;\">Millennials and Gen Z now see renting as an investment in the quality of life rather than a “waste of money”. There has been a greater need to leave the nest earlier and live independently, enabling them to build life skills around budgeting and managing multiple responsibilities. </span></p>\n<p><span style=\"font-weight: 400;\">Companies like Cove put renters at the core of their business by making renting more affordable through products like co-living, enabling young people to rent a place while still being able to save and ultimately buy a property in the future. </span></p>\n<p><span style=\"font-weight: 400;\">The all-inclusive nature of their offering also gives more visibility to utility costs. In addition, things like wifi and housekeeping are all included, reducing the administrative burden for people with limited time. </span></p>\n<p><span style=\"font-weight: 400;\">Ultimately, renting a home is becoming the norm as younger professionals put their quality of life above anything else. However, the changing real estate market and mindsets call for more inclusive choices.</span></p>\n<p><span style=\"font-weight: 400;\">Businesses like Cove have kept up with the trends and placed people at the centre of their business model, evolving with their customers’ needs for a more sustainable and long-term outlook.</span></p>\n<p>&#8211;</p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image credit: Canva Pro</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/how-this-startup-is-facilitating-change-within-the-rental-market-in-sea-20221030/\">How this startup is facilitating change within the rental market in SEA</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}