{
  "title": "A faster experiment to find and study topological materials",
  "link": "https://news.mit.edu/2022/faster-topological-materials-quantum-1026",
  "description": "Using machine learning and simple X-ray spectra, researchers can uncover compounds that might enable next-generation computer chips or quantum devices.",
  "pubDate": "Wed, 26 Oct 2022 09:00:00 -0400",
  "guid": "https://news.mit.edu/2022/faster-topological-materials-quantum-1026",
  "dc:creator": "David L. Chandler | MIT News Office",
  "content:encoded": "<p>Topological materials, an exotic class of materials whose surfaces exhibit different electrical or functional properties than their interiors, have been a frontier of research in the past decade — a finding that sparked further research and precipitated a Nobel Prize in Physics in 2016. These materials are thought to have great potential in a variety of fields, and might someday be used in ultraefficient electronic or optical devices, or key components of quantum computers.</p>\n\n<p></p>\n\n<p>But there are many thousands of compounds that may theoretically have topological characteristics, and synthesizing and testing even one such material to determine its topological properties can take months of experiments and analysis. Now a team of researchers at MIT and elsewhere have come up with a new approach that can rapidly screen candidate materials and determine with more than 90 percent accuracy whether they are topological.</p>\n\n<p></p>\n\n<p>Using this new method, the researchers have produced a list candidate materials. A few of these were already known to have topological properties, but the rest are newly predicted by this approach.</p>\n\n<p></p>\n\n<p>The findings are reported in the journal <em>Advanced Materials</em> in a paper by Mingda Li, the Class ’47 Career Development Professor at MIT, graduate students (and twin sisters) Nina Andrejevic at MIT and Jovana Andrejevic at Harvard University, and seven others at MIT, Harvard, Princeton University, and Argonne National Laboratory.</p>\n\n<p></p>\n\n<p>Topological materials are named after a branch of mathematics that describes shapes based on their invariant characteristics, which persist no matter how much an object is continuously stretched or squeezed out of its original shape. Topological materials, similarly, have properties that remain constant despite changes in their conditions, such as external perturbations or impurities.</p>\n\n<p></p>\n\n<p>There are several varieties of topological materials, including semiconductors, conductors, and semimetals, among others. Initially, it was thought that there were only a handful of such materials, but recent theory and calculations have predicted that in fact thousands of different compounds may have at least some topological characteristics. The hard part is figuring out experimentally which compounds may be topological.</p>\n\n<p></p>\n\n<p>Applications for such materials span a wide range, including devices that could perform computational and data storage functions similarly to silicon-based devices but with far less energy loss, or devices to harvest electricity efficiently from waste heat, for example in thermal power plants or in electronic devices. Topological materials can also have superconducting properties, which could potentially be used to build the quantum bits for topological quantum computers.</p>\n\n<p></p>\n\n<p>But all of this relies on developing or discovering the right materials. “To study a topological material, you first have to confirm whether the material is topological or not,” Li says, “and that part is a hard problem to solve in the traditional way.” A method called density functional theory is used to perform initial calculations, which then need to be followed with complex experiments that require cleaving a piece of the material to atomic-level flatness and probing it with instruments under high-vacuum conditions. “Most materials cannot even be measured due to various technical difficulties,” Nina Andrejevic says. But for those that can, the process can take a long time. “It’s a really painstaking procedure,” she says.</p>\n\n<p></p>\n\n<p>Whereas the traditional approach relies on measuring the material’s photoemissions or tunneling electrons, Li explains, the new technique he and his team developed relies on absorption, specifically, the way the material absorbs X-rays. Unlike the expensive apparatus needed for the conventional tests, X-ray absorption spectrometers are readily available and can operate at room temperature and atmospheric pressure, with no vacuum needed. Such measurements are widely conducted in biology, chemistry, battery research, and many other applications, but they had not previously been applied to identifying topological quantum materials.</p>\n\n<p></p>\n\n<p>X-ray absorption spectroscopy provides characteristic spectral data from a given sample of material. The next challenge is to interpret that data and how it relates to the topological properties. For that, the team turned to a machine-learning model, feeding in a collection of data on the X-ray absorption spectra of known topological and nontopological materials, and training the model to find the patterns that relate the two. And it did indeed find such correlations.</p>\n\n<p></p>\n\n<p>“Surprisingly, this approach was over 90 percent accurate when tested on more than 1500 known materials,” Nina Andrejevic says, adding that the predictions take only seconds. “This is an exciting result given the complexity of the conventional process.”</p>\n\n<p></p>\n\n<p>Though the model works, as with many results from machine learning, researchers don’t yet know exactly why it works or what the underlying mechanism is that links the X-ray absorption to the topological properties. “While the learned function relating X-ray spectra to topology is complex, the result may suggest that certain attributes the measurement is sensitive to, such as local atomic structures, are key topological indicators,” Jovana Andrejevic says.</p>\n\n<p>The team has used the model to construct a periodic table that displays the model’s overall accuracy on compounds made from each of the elements. It serves as a tool to help researchers home in on families of compounds that may offer the right characteristics for a given application. The researchers have also produced a preliminary study of compounds that they have used this X-ray method on, without advance knowledge of their topological status, and compiled a list of 100 promising candidate materials — a few of which were already known to be topological.</p>\n\n<p></p>\n\n<p>“This work represents one of the first uses of machine learning to understand what experiments are trying to tell us about complex materials,” says Joel Moore, the Chern-Simons Professor of Physics at the University of California at Berkeley, who was not associated with this research. “Many kinds of topological materials are well-understood theoretically in principle, but finding material candidates and verifying that they have the right topology of their bands can be a challenge. Machine learning seems to offer a new way to address this challenge: Even experimental data whose meaning is not immediately obvious to a human can be analyzed by the algorithm, and I am excited to see what new materials will result from this way of looking.”</p>\n\n<p></p>\n\n<p>Anatoly Frenkel, a professor in the Department of Materials Science and Chemical Engineering at Stony Brook University and a senior chemist at Brookhaven National Laboratory, further commented that “It was a really nice idea to&nbsp;consider that the X-ray absorption spectrum may hold a key to the topological character in the measured sample.”</p>\n\n<p></p>\n\n<p>The research team included Andrei Bernevig and Nicolas Regnault at Princeton University, Fei Han and Thanh Nguyen and Nathan Drucker at MIT, Chris Rycroft at Harvard University, and Gilberto Fabbris at Argonne National Laboratory. The work was supported by the U.S. Department of Energy and National Science Foundation.</p>",
  "media:content": {
    "media:description": "Topological materials are an exotic class of materials whose surfaces can have different electrical or optical properties than their interiors and might someday be used in next-generation computer chips or quantum devices.",
    "media:credit": "Image: Stock images, edited by MIT News"
  },
  "category": [
    "Nuclear science and engineering",
    "Electronics",
    "Machine learning",
    "Computer science and technology",
    "Materials science and engineering",
    "Computer modeling",
    "Research",
    "Quantum computing",
    "Quantum mechanics",
    "DMSE",
    "School of Engineering",
    "Department of Energy (DoE)",
    "National Science Foundation (NSF)"
  ]
}