{
  "title": "58: The Galapagos Affair",
  "link": "https://audioboom.com/posts/7010897",
  "itunes:episode": 58,
  "itunes:title": "The Galapagos Affair",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3477,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>In 1930 4 SUPER grumpy people moved to the Galapagos Islands’ most deserted, most isolated, most remote outpost (that is Patrick you’re hearing having the GAYEST panic attack at the thought). Not only did the all HATE each other, they were bored to death. Enter the Baroness and her two….boyfriends? Gay best friends? Slaves? Nobody really knows, BUT WHO CARES BECAUSE THEY WERE FABULOUS AND FUN AND THE BARONESS IS TOTALLY NOT HERE FOR YOUR SHIT. But then people started to disappear. And die. Coincidence? We may never know.</p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> Check out our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">bonus episodes on Patreon!</a> We covered <strong>\"Serial\"</strong> episode-by-episode and capped the series off with an interview with <strong>Rabia Chaudry</strong>--Adnan's friend who brought his story to <strong>Sarah Koenig</strong> AND with <strong>Asia Mcclain</strong>--Adnan's alibi witness! Now we're covering <strong>\"The Staircase\"</strong> episode-by-episode. Episodes 1 - 10 are live now! We also have extended outtakes for our episodes and two other full bonus episodes--<strong>ALL COMMERCIAL FREE!</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join here!</a></p>\n\n\n<p><strong>Looking for our Advertisers / Promo Codes?</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Go Here!</a> We now have a whole page of our site for you to check out and <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">GET. THOSE. DISCOUNTS!</a></p>\n",
  "pubDate": "Tue, 18 Sep 2018 04:01:00 +0000",
  "guid": "tag:audioboom.com,2018-09-18:/posts/7010897",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}