{
  "id": "tag:blogger.com,1999:blog-8698702854482141883.post-6409096798615993619",
  "published": "2022-05-20T08:00:00.066-07:00",
  "updated": "2022-05-23T09:36:22.583-07:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "GSoC 2022 accepted Contributors announced!",
  "content": "<p>May is here and we’re pleased to announce the <a href=\"http://g.co/gsoc\" target=\"_blank\">Google Summer of Code</a> (GSoC) Contributors for 2022. Our 196 mentoring organizations have spent the last few weeks making the difficult decisions on which applicants they will be mentoring this year as GSoC Contributors.<a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgolzJjEMdfqz_veFPVZJ9A6FvwYW47uiDFS2m15-wPbF3JM70Oov-K3-01JCg1LNOCLn4b25Apj02lze34OA0_Omxyl0yu5_dVjHPox6OIH9BvZH5ceCWSoWySfJciCZ8IAaK5g05gisVes74s7qE7KfR7MyVkofJtufpfngA6iq7lZNG0Be26rgli/s400/OSS%20Blog%20GSoC%20Asset.png\" style=\"clear: left; float: left; margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"300\" data-original-width=\"300\" height=\"275\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgolzJjEMdfqz_veFPVZJ9A6FvwYW47uiDFS2m15-wPbF3JM70Oov-K3-01JCg1LNOCLn4b25Apj02lze34OA0_Omxyl0yu5_dVjHPox6OIH9BvZH5ceCWSoWySfJciCZ8IAaK5g05gisVes74s7qE7KfR7MyVkofJtufpfngA6iq7lZNG0Be26rgli/w275-h275/OSS%20Blog%20GSoC%20Asset.png\" width=\"275\" /></a></p><div>Some notable results from this year’s application period:<br /><ul style=\"text-align: left;\"><li>Over 4,000 applicants from 96 countries</li><li>5,155 proposals submitted</li><li>1,209 GSoC contributors accepted from 62 countries</li><li>1,882 mentors and organization administrators</li></ul> For the next few weeks our GSoC 2022 Contributors will be actively engaging with their new open source community and learning the ins and outs of how their new community works. Mentors will help guide them through the documentation and processes the community uses as well as helping the GSoC Contributors with planning their milestones and projects for the summer. This <a href=\"https://google.github.io/gsocguides/student/how-gsoc-works\" target=\"_blank\">Community Bonding</a> period helps familiarize the GSoC Contributors with the languages and tools they will need to successfully complete their projects. Coding begins June 13th and for most folks will wrap up September 5th, however this year GSoC Contributors can request a longer coding period wrapping up their projects by mid November.<div><br />Thank you to all the applicants who reached out to our mentoring organizations to learn more about the work they do and for the time they spent crafting their project proposals. We hope you all learned more about open source and maybe even found a community you want to contribute to even outside of GSoC. Staying connected with the community or reaching out to other organizations is a great way to set the stage for future opportunities. Open source communities are always looking for new, excited contributors to bring fresh perspectives and ideas to the table. We hope you connect with an open source community or apply to a future GSoC.<div><br />There are many changes to this 18th year of GSoC and we are excited to see how our GSoC Contributors and mentoring organizations take advantage of these adjustments. A big thank you to all our mentors and organization administrators who make this program so special.<div><br />GSoC Contributors—have fun this summer and keep learning! Your mentors and community members have dozens and in some cases, hundreds of years of experience, let them share their knowledge with you and help you become awesome open source contributors!<div><br /><em>By Stephanie Taylor, Google Open Source</em></div></div></div></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Open Source Programs Office",
    "uri": "http://www.blogger.com/profile/11192158996903493674",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}