{
  "title": "S1E41 - Chess on Bikes with Olympic Cyclist Giddeon Massie",
  "guid": "https://pinecast.com/guid/88f6e76b-250e-4121-8337-686d20f33073",
  "pubDate": "Tue, 20 Apr 2021 06:30:00 -0000",
  "itunes:duration": "00:58:35",
  "description": "<p>Joining Laura on the podcast today is Olympic cyclist Giddeon Massie. Among his many accomplishments are more than 20 U.S. Elite National Titles, Pan American Games Gold and Silver Medals, competing at two Olympic Games, and being selected by the U.S. Anti-Doping Agency to participate in a series of public service announcements that promoted clean, honest, and fair competition. Giddeon has also been the Program Manager for an International Education and Mentorship Non-profit organization, called ‘<a href=\"http://www.classroomchampions.org/\" rel=\"nofollow\">Classroom Champions</a>’, and he remains committed to community outreach.\n \nIn today’s conversation, Giddeon shares how he first became involved in cycling, his training experience at the Velodrome, his breakout moment, and his time at the Olympic Training Centre. He goes on to review and compare his Olympic experiences, his perspective on doping in sport, the various cycling events in which he competed, the impact of not qualifying for the 2012 Games, and his transition from his cycling career to his current career in real estate. Giddeon finishes up by offering his sincere and deeply thoughtful advice to athletes in setting and achieving their goals in their sport. Uniquely experienced in the joys and challenges of a life both within the world of an elite athlete and beyond, Giddeon takes this opportunity to share his measured and contemplative insights and advice for the benefit of all listeners here today.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>How he found his way into cycling</li>\n<li>The Velodrome</li>\n<li>Giddeon’s breakout moment</li>\n<li>His time at the Olympic Training Centre</li>\n<li>Comparing his Olympic experiences</li>\n<li>His perspective on doping in sport</li>\n<li>The various cycling events in which he raced</li>\n<li>Failing to qualify for the 2012 Games</li>\n<li>Transitioning from cycling to real estate</li>\n<li>Giddeon’s advice for athletes coming up with dreams and goals</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“The sprint disciplines were more intriguing and just looked more fun and appealing to me.”</li>\n<li>“It was a gradual progression and I learned from some of the best.”</li>\n<li>“You know sometimes you go years without something, and other times you have a year where you have two or three or four falls.”</li>\n<li>“We lived that together, and we supported one another, and that was a great, great thing about that space.”</li>\n<li>“The whole experience… is pretty overwhelming and special that first time.”</li>\n<li>“I feel bad for those people that choose to go that route, but it doesn't impact what I do and how I approach what I do. I sleep comfortably at night.”</li>\n<li>“If you don't have a purpose it's kind of like not having a destination.”</li>\n<li>“I'm very comfortable in uncertainty because I know that my preparation is such that, if given the opportunity, I'm going to be where I need to be.”</li>\n<li>“The individual stuff, it's like, you know, it's chess on bikes.”</li>\n<li>“I think every Games has its own lifeblood to it.”</li>\n<li>“Watching from the outside… that was very hard.”</li>\n<li>“I wasn't ready to be done.”</li>\n<li>“Sometimes I tell people I'm a recovering Olympic athlete.”</li>\n<li>“You lose some of yourself when you step away from that because not everybody cares about the Olympics and not everybody cares about, you know, what you’ve spent most of your life doing.”</li>\n<li>“Okay, what have I learned that I can actually apply here?”</li>\n<li>“It starts with having a healthy respect for the sport that you're participating in, for the people that are devoting the time to invest in you, to being willing to accept the critique and the criticism.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a>\n \nConnect with Giddeon:\n  \nInstagram: @giddeon\n<a href=\"https://giddeonmassie.firstteam.com/\" rel=\"nofollow\">Giddeon's Real Estate homepage</a></p>",
  "itunes:title": "Chess on Bikes with Olympic Cyclist Giddeon Massie",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 41
}