{
  "title": "Web3 Ride-Hailing App Drife Takes on Uber in India",
  "link": "https://spectrum.ieee.org/blockchain-ridehailing-app-drife-takes-on-uber-in-india",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/3-people-stand-at-a-car-with-the-drife-logo-on-it-smiling-at-the-camera.jpg?id=31180016&width=1200&height=400&coordinates=0%2C68%2C0%2C1197\"/><br/><br/><p>Ride-hailing in India is dominated by Uber and local rival <a href=\"https://www.olacabs.com/mobile\" target=\"_blank\">Ola</a>, but startup <a href=\"https://www.drife.io/\" target=\"_blank\">Drife </a>thinks blockchain technology could be the key to breaking up their duopoly.</p><p>CEO and cofounder <a href=\"https://www.linkedin.com/in/firdosh-sheikh/?originalSubdomain=ae\" rel=\"noopener noreferrer\" target=\"_blank\">Firdosh Sheikh</a> used to be a power user of Uber, racking up more than 5,000 rides in total. But after speaking to drivers she discovered many were unhappy with the commissions the platform charged and the often opaque rules that governed which rides they get assigned. Riders also get a raw deal, she says, with little control over what they pay for their rides or who they travel with.</p><p>The problem, Sheikh decided, boiled down to having a middleman controlling the relationship between riders and drivers. So she set out to build a decentralized ride-hailing platform that puts control back into the hands of users via <a data-linked-post=\"2653906605\" href=\"https://spectrum.ieee.org/cryptocurrency-blockchains-dont-need-to-be-energy-intensive\" target=\"_blank\">blockchain</a> technology. Last November, after three years of development, she and her cofounders launched the Drife app in the southern city of Bangalore. Today, they have more than 10,000 drivers and 100,000 riders signed up to the platform.</p><p>One of the main things that differentiates them from companies like Uber, says Sheikh, is that they don’t charge any commission. Drivers get to keep the entire fare and will instead pay a monthly subscription to use the platform, although the company is currently waiving this to encourage sign-ups.</p><p>“We don’t charge anything from the fare that you pay as a rider,” she says. “A centralized entity who has a profit motive in the fare that I pay as a rider will start manipulating the fare and exploiting it for their own profit motive, and that’s where both drivers and riders struggle.”</p><p>A base fare is set based on the class of vehicle and the distance of the trip, but after that riders can boost the amount they are willing to pay to attract more drivers. Drivers can also make counteroffers. The rider then chooses who to go with based either on price or driver ratings. This means pricing is purely market-driven, and because Drife isn’t taking a cut, fares should be cheaper than alternatives, says Sheikh.</p><p>The company also has its own cryptocurrency, called DRF. At present it can’t be used for much, but the token will play an important role in Drife’s expansion plans, says Sheikh. The company plans to operate on a franchise model, with local entrepreneurs bidding to run Drife operations in new cities in return for a share of subscription fees. But to apply for a franchise, they will need to purchase a large chunk of DRF tokens and lock them up for the duration of their contract. So far the company has received about 60 franchise requests from cities across the world, says Sheikh.</p><p>About 30 percent of DRF tokens have also been reserved for an “ecosystem fund,” which will be used for incentives and rewards for drivers and riders. Besides being tradable for real money, these tokens will also confer the right to vote in a decentralized autonomous organization (DAO)—a kind of member-run organization whose internal rules are encoded into a blockchain. Each city will have their own DAO, which will be responsible for choosing franchisees.</p><p class=\"pull-quote\">“Nothing that we see today can work at the scale that we want to grow,” says Sheikh. “That’s why we’ve started our own side project where we’re working on a blockchain customized to our own needs.”</p><p>Crucially, users won’t need to take Drife’s word for any of this, as the entire system will be governed by <a href=\"https://spectrum.ieee.org/how-smart-contracts-work\" target=\"_self\">smart contracts</a>. These are software programs that live inside a blockchain and automate transactions according to predefined rules that are visible to everyone. “Nobody’s going to trust me if I say I don’t manipulate it unless I show them that I don’t have any power to manipulate that data,” says Sheikh. “That’s only possible through blockchain.”</p><p>In reality, however, Drife is building the plane while flying it. The firm’s smart-contract system is built on <a href=\"https://polygon.technology/\" target=\"_blank\">Polygon</a>, which is an extension of the Ethereum blockchain. But because they are constantly tweaking features and functionality, Sheikh admits that most of the time operations are actually running on a back-end server that mimics the processing the blockchain is supposed to do.</p><p>And many of the details about how the platform will work still need to be ironed out. How to ensure the DAO voting system isn’t dominated by those who hold the most tokens is a work in progress, says Sheikh. Most blockchains are also geared toward settling financial transactions, and it’s not clear if they can cope with the volume of real-world data involved in running a large-scale ride-hailing business. “Nothing that we see today can work at the scale that we want to grow,” says Sheikh. “That’s why we’ve started our own side project where we’re working on a blockchain customized to our own needs.”</p><p>It might still be some time before that becomes a problem. Despite a promising number of sign-ups, the company is currently doing only around 7,000 rides a week, compared to the millions done by Uber and Ola every day.<br/> </p><p>Mobility consultant <a href=\"https://www.linkedin.com/in/vinay-piparsania-6992779b/?original_referer=&originalSubdomain=in\" rel=\"noopener noreferrer\" target=\"_blank\">Vinay Piparsania</a>, founder of MillenStrat Advisory & Research, says that blockchain technology holds considerable promise for disrupting the ride-hailing industry and breaking the monopolies of the big players. The biggest challenge for startups like Drife, though, is matching their financial and operational capabilities.</p><p>“Unfortunately, at this time, such driver-focused startups are much too small and fragmented to make the difference to the duopolic might of Uber and Ola,” he says. It’s a David and Goliath situation, Piparsania adds, so for the time being these companies should focus on “nibbling away in some key towns and categories by attracting and holding onto drivers, and actually demonstrating to riders that they can compete on delivery.”</p><p><em>This article appears in the November 2022 print issue as “Blockchain Ride-Hailing App Takes on Uber in India.”<br/></em></p>",
  "pubDate": "Fri, 26 Aug 2022 03:00:00 +0000",
  "guid": "https://spectrum.ieee.org/blockchain-ridehailing-app-drife-takes-on-uber-in-india",
  "category": [
    "Blockchain",
    "Ride-hailing",
    "Drife",
    "Ethereum",
    "Web3"
  ],
  "dc:creator": "Edd Gent",
  "media:content": ""
}