{
  "title": "Episode 136: &#8220;My Generation&#8221; by the Who",
  "link": "https://500songs.com/podcast/episode-136-my-generation-by-the-who/",
  "pubDate": "Wed, 03 Nov 2021 01:47:54 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=919",
  "description": "Episode one hundred and thirty-six of <em>A History of Rock Music in Five Hundred Songs</em> is a special long episode, running almost ninety minutes, looking at \"My Generation\" by the Who. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/58230940\">\"The Name Game\" by Shirley Ellis</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\nI mispronounce the Herman's Hermits track \"Can't You Hear My Heartbeat\" as \"Can You Hear My Heartbeat\".\nI say \"Rebel Without a Cause\" when I mean \"The Wild One\". Brando was not in \"Rebel Without a Cause\".\n<strong>Resources</strong>\n\nAs usual, I’ve created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-136-my-generation/\">a Mixcloud playlist</a> of the music excerpted here. This mix does not include the Dixon of Dock Green theme, as I was unable to find a full version of that theme anywhere (though a version with Jack Warner singing, titled \"An Ordinary Copper\" is often labelled as it) and what you hear in this episode is the only fragment I could get a clean copy of.\n\nThe best compilation of the Who's music is <a href=\"https://amzn.to/3q26FNW\"><em>Maximum A's & B's</em></a>, a three-disc set containing the A and B sides of every single they released.\n\nThe <a href=\"https://amzn.to/3jWhOfe\">super-deluxe five-CD version of the <em>My Generation</em> album</a> appears to be out of print as a CD, but can be purchased digitally.\n\nI referred to a lot of books for this episode, including:\n\n<a href=\"https://amzn.to/31rVeEX\"><em>Generations: The History of America's Future, 1584 to 2069</em></a> by William Strauss and Neil Howe, which I don't necessarily recommend reading, but which is certainly an influential book.\n\n<a href=\"https://amzn.to/3nLpzFO\"><em>Revolt Into Style: The Pop Arts </em></a>by George Melly which I *do* recommend reading if you have any interest at all in British pop culture of the fifties and sixties.\n\n<a href=\"https://amzn.to/2ZLJQU4\"><em>Jim Marshall: The Father of Loud</em></a> by Rich Maloof gave me all the biographical details about Marshall.\n\n<a href=\"https://amzn.to/31uXbk9\"><em>The Who Before the Who</em></a> by Doug Sandom, a rather thin book of reminiscences by the group's first drummer.\n\n<a href=\"https://amzn.to/3EGae0d\"><em>The Ox</em></a> by Paul Rees, an authorised biography of John Entwistle based on notes for his never-completed autobiography.\n\n<a href=\"https://amzn.to/3EzuVe4\"><em>Who I Am</em></a>, the autobiography of Pete Townshend, is one of the better rock autobiographies.\n\n<a href=\"https://amzn.to/2YfMalq\"><em>A Band With Built-In Hate</em></a> by Peter Stanfield is an examination of the group in the context of pop-art and Mod.\n\nAnd <a href=\"https://amzn.to/3mGcuyy\"><em>Anyway, Anyhow, Anywhere</em> </a>by Andy Neill and Matt Kent is a day-by-day listing of the group's activities up to 1978.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nIn 1991, William Strauss and Neil Howe wrote a book called Generations: The History of America's Future, 1584 to 2069. That book was predicated on a simple idea -- that there are patterns in American history, and that those patterns can be predicted in their rough outline. Not in the fine details, but broadly -- those of you currently watching the TV series Foundation, or familiar with Isaac Asimov's original novels, will have the idea already, because Strauss and Howe claimed to have invented a formula which worked as well as Asimov's fictional Psychohistory.\n\nTheir claim was that, broadly speaking, generations can be thought to have a dominant personality type, influenced by the events that took place while they were growing up, which in turn are influenced by the personality types of the older generations. Because of this, Strauss and Howe claimed, American society had settled into a semi-stable pattern, where events repeat on a roughly eighty-eight-year cycle, driven by the behaviours of different personality types at different stages of their lives. You have four types of generation, which cycle -- the Adaptive, Idealist, Reactive, and Civic types. At any given time, one of these will be the elder statespeople, one will be the middle-aged people in positions of power, one will be the young rising people doing most of the work, and one will be the kids still growing up. You can predict what will happen, in broad outline, by how each of those generation types will react to challenges, and what position they will be in when those challenges arise. The idea is that major events change your personality, and also how you react to future events, and that how, say, Pearl Harbor affected someone will have been different for a kid hearing about the attack on the radio, an adult at the age to be drafted, and an adult who was too old to fight.\n\nThe thesis of this book has, rather oddly, entered mainstream thought so completely that its ideas are taken as basic assumptions now by much of the popular discourse, even though on reading it the authors are so vague that pretty much anything can be taken as confirmation of their hypotheses, in much the same way that newspaper horoscopes always seem like they could apply to almost everyone's life.\n\nAnd sometimes, of course, they're just way off. For example they make the prediction that in 2020 there would be a massive crisis that would last several years, which would lead to a massive sense of community, in which \"America will be implacably resolved to do what needs doing and fix what needs fixing\", and in which the main task of those aged forty to sixty at that point would be to restrain those in leadership positions in the sixty-to-eighty age group from making irrational, impetuous, decisions which might lead to apocalypse. The crisis would likely end in triumph, but there was also a chance it might end in \"moral fatigue, vast human tragedy, and a weak and vengeful sense of victory\".\n\nI'm sure that none of my listeners can think of any events in 2020 that match this particular pattern.\n\nDespite its lack of rigour, Strauss and Howe's basic idea is now part of most people's intellectual toolkit, even if we don't necessarily think of them as the source for it. Indeed, even though they only talk about America in their book, their generational concept gets applied willy-nilly to much of the Western world.\n\nAnd likewise, for the most part we tend to think of the generations, whether American or otherwise, using the names they used. For the generations who were alive at the time they were writing, they used five main names, three of which we still use. Those born between 1901 and 1924 they term the \"GI Generation\", though those are now usually termed the \"Greatest Generation\". Those born between 1924 and 1942 were the \"Silent Generation\", those born 1943 through 1960 were the Boomers, and those born between 1982 and 2003 they labelled Millennials.\n\nThose born between 1961 and 1981 they labelled \"thirteeners\", because they were the unlucky thirteenth generation to be born in America since the declaration of independence.\n\nBut that name didn't catch on. Instead, the name that people use to describe that generation is \"Generation X\", named after a late-seventies punk band led by Billy Idol:\n\n[Excerpt: Generation X, \"Your Generation\"]\n\nThat band were short-lived, but they were in constant dialogue with the pop culture of ten to fifteen years earlier, Idol's own childhood. As well as that song, \"Your Generation\", which is obviously referring to the song this week's episode is about, they also recorded versions of John Lennon's \"Gimme Some Truth\", of Johnny Kidd and the Pirates' \"Shakin' All Over\", and an original song called \"Ready Steady Go\", about being in love with Cathy McGowan, the presenter of that show.\n\nAnd even their name was a reference, because Generation X were named after a book published in 1964, about not the generation we call Generation X, but about the Baby Boomers, and specifically about a series of fights on beaches across the South Coast of England between what at that point amounted to two gangs.\n\nThese were fights between the old guard, the Rockers -- people who represented the recent past who wouldn't go away, what Americans would call \"greasers\", people who modelled themselves on Marlon Brando in Rebel Without A Cause, and who thought music had peaked with Gene Vincent and Eddie Cochran -- and a newer, younger, hipper, group of people, who represented the new, the modern -- the Mods:\n\n[Excerpt: The Who, \"My Generation\"]\n\nJim Marshall, if he'd been American, would have been considered one of the Greatest Generation, but his upbringing was not typical of that, or of any, generation. When he was five, he was diagnosed as having skeletal tuberculosis, which had made his bones weak and easily broken. To protect them, he spent the next seven years of his life, from age five until twelve, in hospital in a full-body cast. The only opportunity he got to move during those years was for a few minutes every three months, when the cast would be cut off and reapplied to account for his growth during that time.\n\nUnsurprisingly, once he was finally out of the cast, he discovered he loved moving -- a lot. He dropped out of school aged thirteen -- most people at the time left school at aged fourteen anyway, and since he'd missed all his schooling to that point it didn't seem worth his while carrying on -- and took on multiple jobs, working sixty hours a week or more. But the job he made most money at was as an entertainer. He started out as a tap-dancer, taking advantage of his new mobility, but then his song-and-dance man routine became steadily more song and less dance, as people started to notice his vocal resemblance to Bing Crosby.\n\nHe was working six nights a week as a singer, but when World War II broke out, the drummer in the seven-piece band he was working with was drafted -- Marshall wouldn't ever be drafted because of his history of illness. The other members of the band knew that as a dancer he had a good sense of rhythm, and so they made a suggestion -- if Jim took over the drums, they could split the money six ways rather than seven.\n\nMarshall agreed, but he discovered there was a problem. The drum kit was always positioned at the back of the stage, behind the PA, and he couldn't hear the other musicians clearly. This is actually OK for a drummer -- you're keeping time, and the rest of the band are following you, so as long as you can *sort of* hear them everyone can stay together. But a singer needs to be able to hear everything clearly, in order to stay on key. And this was in the days before monitor speakers, so the only option available was to just have a louder PA system. And since one wasn't available, Marshall just had to build one himself. And that's how Jim Marshall started building amplifiers.\n\nMarshall eventually gave up playing the drums, and retired to run a music shop. There's a story about Marshall's last gig as a drummer, which isn't in the biography of Marshall I read for this episode, but is told in other places by the son of the bandleader at that gig. Apparently Marshall had a very fraught relationship with his father, who was among other things a semi-professional boxer, and at that gig Marshall senior turned up and started heckling his son from the audience. Eventually the younger Marshall jumped off the stage and started hitting his dad, winning the fight, but he decided he wasn't going to perform in public any more.\n\nThe band leader for that show was Clifford Townshend, a clarinet player and saxophonist whose main gig was as part of the Squadronaires, a band that had originally been formed during World War II by RAF servicemen to entertain other troops. Townshend, who had been a member of Oswald Moseley's fascist Blackshirts in the thirties but later had a change of heart, was a second-generation woodwind player -- his father had been a semi-professional flute player.\n\nAs well as working with the Squadronaires, Townshend also put out one record under his own name in 1956, a version of \"Unchained Melody\" credited to \"Cliff Townsend and his singing saxophone\":\n\n[Excerpt: Cliff Townshend and his Singing Saxophone, \"Unchained Melody\"]\n\nCliff's wife often performed with him -- she was a professional singer who had  actually lied about her age in order to join up with the Air Force and sing with the group -- but they had a tempestuous marriage, and split up multiple times. As a result of this, and the travelling lifestyle of musicians, there were periods where their son Peter was sent to live with his grandmother, who was seriously abusive, traumatising the young boy in ways that would affect him for the rest of his life.\n\nWhen Pete Townshend was growing up, he wasn't particularly influenced by music, in part because it was his dad's job rather than a hobby, and his parents had very few records in the house. He did, though, take up the harmonica and learn to play the theme tune to Dixon of Dock Green:\n\n[Excerpt: Tommy Reilly, \"Dixon of Dock Green Theme\"]\n\nHis first exposure to rock and roll wasn't through Elvis or Little Richard, but rather through Ray Ellington. Ellington was a British jazz singer and drummer, heavily influenced by Louis Jordan, who provided regular musical performances on the Goon Show throughout the fifties, and on one episode had performed \"That Rock 'n' Rollin' Man\":\n\n[Excerpt: Ray Ellington, \"That Rock 'N' Rollin' Man\"]\n\nYoung Pete's assessment of that, as he remembered it later, was \"I thought it some kind of hybrid jazz: swing music with stupid lyrics. But it felt youthful and rebellious, like The Goon Show itself.\"\n\nBut he got hooked on rock and roll when his father took him and a friend to see a film:\n\n[Excerpt: Bill Haley and the Comets, \"Rock Around the Clock\"]\n\nAccording to Townshend's autobiography, \"I asked Dad what he thought of the music. He said he thought it had some swing, and anything that had swing was OK. For me it was more than just OK. After seeing Rock Around the Clock with Bill Haley, nothing would ever be quite the same.\" Young Pete would soon go and see Bill Haley live – his first rock and roll gig.\n\nBut the older Townshend would soon revise his opinion of rock and roll, because it soon marked the end of the kind of music that had allowed him to earn his living -- though he still managed to get regular work, playing a clarinet was suddenly far less lucrative than it had been.\n\nPete decided that he wanted to play the saxophone, like his dad, but soon he switched first to guitar and then to banjo. His first guitar was bought for him by his abusive grandmother, and three of the strings snapped almost immediately, so he carried on playing with just three strings for a while. He got very little encouragement from his parents, and didn't really improve for a couple of years.\n\nBut then the trad jazz boom happened, and Townshend teamed up with a friend of his who played the trumpet and French horn. He had initially bonded with John Entwistle over their shared sense of humour -- both kids loved Mad magazine and would make tape recordings together of themselves doing comedy routines inspired by the Goon show and Hancock's Half Hour -- but Entwistle was also a very accomplished musician, who could play multiple instruments.\n\nEntwistle had formed a trad band called the Confederates, and Townshend joined them on banjo and guitar, but they didn't stay together for long. Both boys, though, would join a variety of other bands, both together and separately.\n\nAs the trad boom faded and rock and roll regained its dominance among British youth, there was little place for Entwistle's trumpet in the music that was popular among teenagers, and at first Entwistle decided to try making his trumpet sound more like a saxophone, using a helmet as a mute to try to get it to sound like the sax on \"Ramrod\" by Duane Eddy:\n\n[Excerpt: Duane Eddy, \"Ramrod\"]\n\nEddy soon became Entwistle's hero. We've talked about him before a couple of times, briefly, but not in depth, but Duane Eddy had a style that was totally different from most guitar heroes. Instead of playing mostly on the treble strings of the guitar, playing high twiddly parts, Eddy played low notes on the bass strings of his guitar, giving him the style that he summed up in album titles like \"The Twang's the Thang\" and \"Have Twangy Guitar Will Travel\".\n\nAfter a couple of years of having hits with this sound, produced by Lee Hazelwood and Lester Sill, Eddy also started playing another instrument, the instrument variously known as the six-string bass, the baritone guitar, or the Danelectro bass (after the company that manufactured the most popular model).  The baritone guitar has six strings, like a normal guitar, but it's tuned lower than a standard guitar -- usually a fourth lower, though different players have different preferences. The Danelectro became very popular in recording studios in the early sixties, because it helped solve a big problem in recording bass tones.\n\nYou can hear more about this in the episodes of Cocaine and Rhinestones I recommended last week, but basically double basses were very, very difficult to record in the 1950s, and you'd often end up just getting a thudding, muddy, sound from them, which is one reason why when you listen to a lot of early rockabilly the bass is doing nothing very interesting, just playing root notes -- you couldn't easily get much clarity on the instrument at all.\n\nConversely, with electric basses, with the primitive amps of the time, you didn't get anything like the full sound that you'd get from a double bass, but you *did* get a clear sound that would cut through on a cheap radio in a way that the sound of a double bass wouldn't.\n\nSo the solution was obvious -- you have an electric instrument *and* a double bass play the same part. Use the double bass for the big dull throbbing sound, but use the electric one to give the sound some shape and cut-through. If you're doing that, you mostly want the trebly part of the electric instrument's tone, so you play it with a pick rather than fingers, and it makes sense to use a Danelectro rather than a standard bass guitar, as the Danelectro is more trebly than a normal bass.\n\nThis combination, of Danelectro and double bass, appears to have been invented by Owen Bradley, and you can hear it for example on this record by Patsy Cline, with Bob Moore on double bass and Harold Bradley on baritone guitar:\n\n[Excerpt: Patsy Cline, \"Crazy\"]\n\nThis sound, known as \"tic-tac bass\", was soon picked up by a lot of producers, and it became the standard way of getting a bass sound in both Nashville and LA. It's all over the Beach Boys' best records, and many of Jack Nitzsche's arrangements, and many of the other records the Wrecking Crew played on, and it's on most of the stuff the Nashville A-Team played on from the late fifties through mid-sixties, records by people like Elvis, Roy Orbison, Arthur Alexander, and the Everly Brothers.\n\nLee Hazelwood was one of the first producers to pick up on this sound -- indeed, Duane Eddy has said several times that Hazelwood invented the sound before Owen Bradley did, though I think Bradley did it first -- and many of Eddy's records featured that bass sound, and eventually Eddy started playing a baritone guitar himself, as a lead instrument, playing it on records like \"Because They're Young\":\n\n[Excerpt: Duane Eddy, \"Because They're Young\"]\n\nDuane Eddy was John Entwistle's idol, and Entwistle learned Eddy's whole repertoire on trumpet, playing the saxophone parts. But then, realising that the guitar was always louder than the trumpet in the bands he was in, he realised that if he wanted to be heard, he should probably switch to guitar himself. And it made sense that a bass would be easier to play than a regular guitar -- if you only have four strings, there's more space between them, so playing is easier. So he started playing the bass, trying to sound as much like Eddy as he could.\n\nHe had no problem picking up the instrument -- he was already a multi-instrumentalist -- but he did have a problem actually getting hold of one, as all the electric bass guitars available in the UK at the time were prohibitively expensive. Eventually he made one himself, with the help of someone in a local music shop, and that served for a time, though he would soon trade up to more professional instruments, eventually amassing the biggest collection of basses in the world.\n\nOne day, Entwistle was approached on the street by an acquaintance, Roger Daltrey, who said to him \"I hear you play bass\" -- Entwistle was, at the time, carrying his bass. Daltrey was at this time a guitarist -- like Entwistle, he'd built his own instrument -- and he was the leader of a band called Del Angelo and his Detours. Daltrey wasn't Del Angelo, the lead singer -- that was a man called Colin Dawson who by all accounts sounded a little like Cliff Richard -- but he was the bandleader, hired and fired the members, and was in charge of their setlists. Daltrey lured Entwistle away from the band he was in with Townshend by telling him that the Detours were getting proper paid gigs, though they weren't getting many at the time.\n\nUnfortunately, one of the group's other guitarists, the member who owned the best amp, died in an accident not long after Entwistle joined the band. However, the amp was left in the group's possession, and Entwistle used it to lure Pete Townshend into the group by telling him he could use it -- and not telling him that he'd be sharing the amp with Daltrey.\n\nTownshend would later talk about his audition for the Detours -- as he was walking up the street towards Daltrey's house, he saw a stunningly beautiful woman walking away from the house crying. She saw his guitar case and said \"Are you going to Roger's?\"\n\n\"Yes.\"\n\n\"Well you can tell him, it's that bloody guitar or me\".\n\nTownshend relayed the message, and Daltrey responded \"Sod her. Come in.\"\n\nThe audition was a formality, with the main questions being whether Townshend could play two parts of the regular repertoire for a working band at that time -- \"Hava Nagila\", and the Shadows' \"Man of Mystery\":\n\n[Excerpt: The Shadows, \"Man of Mystery\"]\n\nTownshend could play both of those, and so he was in. The group would mostly play chart hits by groups like the Shadows, but as trad jazz hadn't completely died out yet they would also do breakout sessions playing trad jazz, with Townshend on banjo, Entwistle on trumpet and Daltrey on trombone.\n\nFrom the start, there was a temperamental mismatch between the group's two guitarists. Daltrey was thoroughly working-class, culturally conservative,  had dropped out of school to go to work at a sheet metal factory, and saw himself as a no-nonsense plain-speaking man. Townshend was from a relatively well-off upper-middle-class family, was for a brief time a member of the Communist Party, and was by this point studying at art school, where he was hugely impressed by a lecture from Gustav Metzger titled “Auto-Destructive Art, Auto-Creative Art: The Struggle For The Machine Arts Of The Future”, about Metzger's creation of artworks which destroyed themselves.\n\nTownshend was at art school during a period when the whole idea of what an art school was for was in flux, something that's typified by a story Townshend tells about two of his early lectures. At the first, the lecturer came in and told the class to all draw a straight line. They all did, and then the lecturer told off anyone who had drawn anything that was anything other than six inches long, perfectly straight, without a ruler, going north-south, with a 3B pencil, saying that anything else at all was self-indulgence of the kind that needed to be drummed out of them if they wanted to get work as commercial artists.\n\nThen in another lecture, a different lecturer came in and asked them all to draw a straight line. They all drew perfectly straight, six-inch, north-south lines in 3B pencil, as the first lecturer had taught them. The new lecturer started yelling at them, then brought in someone else to yell at them as well, and then cut his hand open with a knife and dragged it across a piece of paper, smearing a rough line with his own blood, and screamed \"THAT'S a line!\"\n\nTownshend's sympathies lay very much with the second lecturer.\n\nAnother big influence on Townshend at this point was a jazz double-bass player, Malcolm Cecil. Cecil would later go on to become a pioneer in electronic music as half of TONTO's Expanding Head Band, and we'll be looking at his work in more detail in a future episode, but at this point he was a fixture on the UK jazz scene. He'd been a member of Blues Incorporated, and had also played with modern jazz players like Dick Morrissey:\n\n[Excerpt: Dick Morrissey, \"Jellyroll\"]\n\nBut Townshend was particularly impressed with a performance in which Cecil demonstrated unorthodox ways to play the double-bass, including playing so hard he broke the strings, and using a saw as a bow, sawing through the strings and damaging the body of the instrument.\n\nBut these influences, for the moment, didn't affect the Detours, who were still doing the Cliff and the Shadows routine. Eventually Colin Dawson quit the group, and Daltrey took over the lead vocal role for the Detours, who settled into a lineup of Daltrey, Townshend, Entwistle, and drummer Doug Sandom, who was much older than the rest of the group -- he was born in 1930, while Daltrey and Entwistle were born in 1944 and Townshend in 1945. For a while, Daltrey continued playing guitar as well as singing, but his hands were often damaged by his work at the sheet-metal factory, making guitar painful for him.\n\nThen the group got a support slot with Johnny Kidd and the Pirates, who at this point were a four-piece band, with Kidd singing backed by bass, drums, and Mick Green playing one guitar on which he played both rhythm and lead parts:\n\n[Excerpt: Johnny Kidd and the Pirates, \"Doctor Feel Good\"]\n\nGreen was at the time considered possibly the best guitarist in Britain, and the sound the Pirates were able to get with only one guitar convinced the Detours that they would be OK if Daltrey switched to just singing, so the group changed to what is now known as a \"power trio\" format. Townshend was a huge admirer of Steve Cropper, another guitarist who played both rhythm and lead, and started trying to adopt parts of Cropper's style, playing mostly chords, while Entwistle went for a much more fluid bass style than most, essentially turning the bass into another lead instrument, patterning his playing after Duane Eddy's work.\n\nBy this time, Townshend was starting to push against Daltrey's leadership a little, especially when it came to repertoire. Townshend had a couple of American friends at art school who had been deported after being caught smoking dope, and had left their records with Townshend for safe-keeping. As a result, Townshend had become a devotee of blues and R&B music, especially the jazzier stuff like Ray Charles, Mose Allison, and Booker T and the MGs. He also admired guitar-based blues records like those by Howlin' Wolf or Jimmy Reed.\n\nTownshend kept pushing for this music to be incorporated into the group's sets, but Daltrey would push back, insisting as the leader that they should play the chart hits that everyone else played, rather than what he saw as Townshend's art-school nonsense. Townshend insisted, and eventually won -- within a short while the group had become a pure R&B group, and Daltrey was soon a convert, and became the biggest advocate of that style in the band.\n\nBut there was a problem with only having one guitar, and that was volume. In particular, Townshend didn't want to be able to hear hecklers. There were gangsters in some of the audiences who would shout requests for particular songs, and you had to play them or else, even if they were completely unsuitable for the rest of the audience's tastes. But if you were playing so loud you couldn't hear the shouting, you had an excuse.\n\nBoth Entwistle and Townshend had started buying amplifiers from Jim Marshall, who had opened up a music shop after quitting drums -- Townshend actually bought his first one from a shop assistant in Marshall's shop, John McLaughlin, who would later himself become a well-known guitarist. Entwistle, wanting to be heard over Townshend, had bought a cabinet with four twelve-inch speakers in it. Townshend, wanting to be heard over Entwistle, had bought *two* of these cabinets, and stacked them, one on top of the other, against Marshall's protestations -- Marshall said that they would vibrate so much that the top one might fall over and injure someone. Townshend didn't listen, and the Marshall stack was born.\n\nThis ultra-amplification also led Townshend to change his guitar style further. He was increasingly reliant on distortion and feedback, rather than on traditional instrumental skills.\n\nNow, there are basically two kinds of chords that are used in most Western music. There are major chords, which consist of the first, third, and fifth note of the scale, and these are the basic chords that everyone starts with. So you can strum between G major and F major:\n\n[demonstrates G and F chords]\n\nThere's also minor chords, where you flatten the third note, which sound a little sadder than major chords, so playing G minor and F minor:\n\n[demonstrates Gm and Fm chords]\n\nThere are of course other kinds of chord -- basically any collection of notes counts as a chord, and can work musically in some context. But major and minor chords are the basic harmonic building blocks of most pop music.\n\nBut when you're using a lot of distortion and feedback, you create a lot of extra harmonics -- extra notes that your instrument makes along with the ones you're playing. And for mathematical reasons I won't go into here because this is already a very long episode, the harmonics generated by playing the first and fifth notes sound fine together, but the harmonics from a third or minor third don't go along with them at all.\n\nThe solution to this problem is to play what are known as \"power chords\", which are just the root and fifth notes, with no third at all, and which sound ambiguous as to whether they're major or minor. Townshend started to build his technique around these chords, playing for the most part on the bottom three strings of his guitar, which sounds like this:\n\n[demonstrates G5 and F5 chords]\n\nTownshend wasn't the first person to use power chords -- they're used on a lot of the Howlin' Wolf records he liked, and before Townshend would become famous the Kinks had used them on \"You Really Got Me\" -- but he was one of the first British guitarists to make them a major part of his personal style.\n\nAround this time, the Detours were starting to become seriously popular, and Townshend was starting to get exhausted by the constant demands on his time from being in the band and going to art school. He talked about this with one of his lecturers, who asked how much Townshend was earning from the band. When Townshend told him he was making thirty pounds a week, the lecturer was shocked, and said that was more than *he* was earning. Townshend should probably just quit art school, because it wasn't like he was going to make more money from anything he could learn there.\n\nAround this time, two things changed the group's image. The first was that they played a support slot for the Rolling Stones in December 1963. Townshend saw Keith Richards swinging his arm over his head and then bringing it down on the guitar, to loosen up his muscles, and he thought that looked fantastic, and started copying it -- from very early on, Townshend wanted to have a physical presence on stage that would be all about his body, to distract from his face, as he was embarrassed about the size of his nose.\n\nThey played a second support slot for the Stones a few weeks later, and not wanting to look like he was copying Richards, Townshend didn't do that move, but then he noticed that Richards didn't do it either. He asked about it after the gig, and Richards didn't know what he was talking about -- \"Swing me what?\" -- so Townshend took that as a green light to make that move, which became known as the windmill, his own.\n\nThe second thing was when in February 1964 a group appeared on Thank Your Lucky Stars:\n\n[Excerpt: Johnny Devlin and the Detours, \"Sometimes\"]\n\nJohnny Devlin and the Detours had had national media exposure, which meant that Daltrey, Townshend, Entwistle, and Sandom had to change the name of their group. They eventually settled on \"The Who\",\n\nIt was around this time that the group got their first serious management, a man named Helmut Gorden, who owned a doorknob factory. Gorden had no management experience, but he did offer the group a regular salary, and pay for new equipment for them. However, when he tried to sign the group to a proper contract, as most of them were still under twenty-one he needed their parents to countersign for them. Townshend's parents, being experienced in the music industry, refused to sign, and so the group continued under Gorden's management without a contract.\n\nGorden, not having management experience, didn't have any contacts in the music industry. But his barber did. Gorden enthused about his group to Jack Marks, the barber, and Marks in turn told some of his other clients about this group he'd been hearing about. Tony Hatch wasn't interested, as he already had a guitar group with the Searchers, but Chris Parmenter at Fontana Records was, and an audition was arranged. At the audition, among other numbers, they played Bo Diddley's \"Here 'Tis\":\n\n[Excerpt: Bo Diddley, \"Here 'Tis\"]\n\nUnfortunately for Doug, he didn't play well on that song, and Townshend started berating him. Doug also knew that Parmenter had reservations about him, because he was so much older than the rest of the band -- he was thirty-four at the time, while the rest of the group were only just turning twenty -- and he was also the least keen of the group on the R&B material they were playing. He'd been warned by Entwistle, his closest friend in the group, that Daltrey and Townshend were thinking of dropping him, and so he decided to jump before he was pushed, walking out of the audition. He agreed to come back for a handful more gigs that were already booked in, but that was the end of his time in the band, and of his time in the music industry -- though oddly not of his friendship with the group. Unlike other famous examples of an early member not fitting in and being forced out before a band becomes big, Sandom remained friends with the other members, and Townshend wrote the foreword to his autobiography, calling him a mentor figure, while Daltrey apparently insisted that Sandom phone him for a chat every Sunday, at the same time every week, until Sandom's death in 2019 at the age of eighty-nine.\n\nThe group tried a few other drummers, including someone who Jim Marshall had been giving drum lessons to, Mitch Mitchell, before settling on the drummer for another group that played the same circuit, the Beachcombers, who played mostly Shadows material, plus the Beach Boys and Jan and Dean songs that their drummer, Keith Moon, loved. Moon and Entwistle soon became a formidable rhythm section, and despite having been turned down by Fontana, they were clearly going places.\n\nBut they needed an image -- and one was provided for them by Pete Meaden. Meaden was another person who got his hair cut by Jack Marks, and he had had  little bit of music business experience, having worked for Andrew Oldham, the Rolling Stones' manager, for a while before going on to manage a group called the Moments, whose career highlight was recording a soundalike cover version of \"You Really Got Me\" for an American budget label:\n\n[Excerpt: The Moments, \"You Really Got Me\"]\n\nThe Moments never had any big success, but Meaden's nose for talent was not wrong, as their teenage lead singer, Steve Marriott, later went on to much better things.\n\nPete Meaden was taken on as Helmut Gorden's assistant, but from this point on the group decided to regard him as their de facto manager, and as more than just a manager. To Townshend in particular he was a guru figure, and he shaped the group to appeal to the Mods.\n\nNow, we've not talked much about the Mods previously, and what little has been said has been a bit contradictory. That's because the Mods were a tiny subculture at this point -- or to be more precise, they were three subcultures.\n\nThe original mods had come along in the late 1950s, at a time when there was a division among jazz fans between fans of traditional New Orleans jazz -- \"trad\" -- and modern jazz. The mods were modernists, hence the name, but for the most part they weren't as interested in music as in clothes. They were a small group of young working-class men, almost all gay, who dressed flamboyantly and dandyishly, and who saw themselves, their clothing, and their bodies as works of art. In the late fifties, Britain was going through something of an economic boom, and this was the first time that working-class men *could* buy nice clothes. These working-class dandies would have to visit tailors to get specially modified clothes made, but they could just about afford to do so.\n\nThe mod image was at first something that belonged to a very, very, small clique of people. But then John Stephens opened his first shop. This was the first era when short runs of factory-produced clothing became possible, and Stephens, a stylish young man, opened a shop on Carnaby Street, then a relatively cheap place to open a shop. He painted the outside yellow, played loud pop music, and attracted a young crowd. Stephens was selling factory-made clothes that still looked unique -- short runs of odd-coloured jeans, three-button jackets, and other men's fashion.\n\nSoon Carnaby Street became the hub for men's fashion in London, thanks largely to Stephens. At one point Stephens owned fifteen different shops, nine of them on Carnaby Street itself, and Stephens' shops appealed to the kind of people that the Kinks would satirise in their early 1966 hit single \"Dedicated Follower of Fashion\":\n\n[Excerpt: The Kinks, \"Dedicated Follower of Fashion\"]\n\nMany of those who visited Stephens' shops were the larger, second, generation of mods. I'm going to quote here from George Melly's Revolt Into Style, the first book to properly analyse British pop culture of the fifties and sixties, by someone who was there: \"As the ‘mod’ thing spread it lost its purity. For the next generation of Mods, those who picked up the ‘mod’ thing around 1963, clothes, while still their central preoccupation, weren’t enough. They needed music (Rhythm and Blues), transport (scooters) and drugs (pep pills). What’s more they needed fashion ready-made. They hadn’t the time or the fanaticism to invent their own styles, and this is where Carnaby Street came in.\"\n\nMelly goes on to talk about how these new Mods were viewed with distaste by the older Mods, who left the scene. The choice of music for these new Mods was as much due to geographic proximity as anything else. Carnaby Street is just round the corner from Wardour Street, and Wardour Street is where the two clubs that between them were the twin poles of the London R&B scenes, the Marquee and the Flamingo, were both located. So it made sense that the young people frequenting John Stephens' boutiques on Carnaby Street were the same people who made up the audiences -- and the bands -- at those clubs.\n\nBut by 1964, even these second-generation Mods were in a minority compared to a new, third generation, and here I'm going to quote Melly again:\n\n\"But the Carnaby Street Mods were not the final stage in the history of this particular movement. The word was taken over finally by a new and more violent sector, the urban working class at the gang-forming age, and this became quite sinister.\n\nThe gang stage rejected the wilder flights of Carnaby Street in favour of extreme sartorial neatness. Everything about them was neat, pretty and creepy: dark glasses, Nero hair-cuts, Chelsea boots, polo-necked sweaters worn under skinny V-necked pullovers, gleaming scooters and transistors. Even their offensive weapons were pretty—tiny hammers and screwdrivers. En masse they looked like a pack of weasels.\"\n\nI would urge anyone who's interested in British social history to read Melly's book in full -- it's well worth it.\n\nThese third-stage Mods soon made up the bulk of the movement, and they were the ones who, in summer 1964, got into the gang fights that were breathlessly reported in all the tabloid newspapers.\n\nPete Meaden was a Mod, and as far as I can tell he was a leading-edge second-stage Mod, though as with all these things who was in what generation of Mods is a bit blurry. Meaden had a whole idea of Mod-as-lifestyle and Mod-as-philosophy, which worked well with the group's R&B leanings, and with Townshend's art-school-inspired fascination with the aesthetics of Pop Art.\n\nMeaden got the group a residency at the Railway Hotel, a favourite Mod hangout, and he also changed their name -- The Who didn't sound Mod enough. In Mod circles at the time there was a hierarchy, with the coolest people, the Faces, at the top, below them a slightly larger group of people known as Numbers, and below them the mass of generic people known as Tickets. Meaden saw himself as the band's Svengali, so he was obviously the Face, so the group had to be Numbers -- so they became The High Numbers.\n\nMeaden got the group a one-off single deal, to record two songs he had allegedly written, both of which had lyrics geared specifically for the Mods. The A-side was \"Zoot Suit\":\n\n[Excerpt: The High Numbers, \"Zoot Suit\"]\n\nThis had a melody that was stolen wholesale from \"Misery\" by the Dynamics:\n\n[Excerpt: The Dynamics, \"Misery\"]\n\nThe B-side, meanwhile, was titled \"I'm the Face\":\n\n[Excerpt: The High Numbers, \"I'm the Face\"]\n\nWhich anyone with any interest at all in blues music will recognise immediately as being \"Got Love if You Want It\" by Slim Harpo:\n\n[Excerpt: Slim Harpo, \"Got Love if You Want it\"]\n\nUnfortunately for the High Numbers, that single didn't have much success. Mod was a local phenomenon, which never took off outside London and its suburbs, and so the songs didn't have much appeal in the rest of the country -- while within London, Mod fashions were moving so quickly that by the time the record came out, all its up-to-the-minute references were desperately outdated.\n\nBut while the record didn't have much success, the group were getting a big live following among the Mods, and their awareness of rapidly shifting trends in that subculture paid off for them in terms of stagecraft. To quote Townshend:\n\n\"What the Mods taught us was how to lead by following. I mean, you'd look at the dance floor and see some bloke stop during the dance of the week and for some reason feel like doing some silly sort of step. And you'd notice some of the blokes around him looking out of the corners of their eyes and thinking 'is this the latest?' And on their own, without acknowledging the first fellow, a few of 'em would start dancing that way. And we'd be watching. By the time they looked up on the stage again, we'd be doing that dance and they'd think the original guy had been imitating us. And next week they'd come back and look to us for dances\".\n\nAnd then Kit Lambert and Chris Stamp came into the Railway Hotel.\n\nKit Lambert was the son of Constant Lambert, the founding music director of the Royal Ballet, who the economist John Maynard Keynes described as the most brilliant man he'd ever met. Constant Lambert was possibly Britain's foremost composer of the pre-war era, and one of the first people from the serious music establishment to recognise the potential of jazz and blues music. His most famous composition, \"The Rio Grande\", written in 1927 about a fictitious South American river, is often compared with Gershwin's Rhapsody in Blue:\n\n[Excerpt: Constant Lambert, \"The Rio Grande\"]\n\nKit Lambert was thus brought up in an atmosphere of great privilege, both financially and intellectually, with his godfather being the composer Sir William Walton while his godmother was the prima ballerina Dame Margot Fonteyn, with whom his father was having an affair. As a result of the problems between his parents, Lambert spent much of his childhood living with his grandmother.\n\nAfter studying history at Oxford and doing his national service, Lambert had spent a few months studying film at the Institut des hautes études cinématographiques in Paris, where he went because Jean-Luc Godard and Alain Renais taught there -- or at least so he would later say, though there's no evidence I can find that Godard actually taught there, so either he went there under a mistaken impression or he lied about it later to make himself sound more interesting.\n\nHowever, he'd got bored with his studies after only a few months, and decided that he knew enough to just make a film himself, and he planned his first documentary. In early 1961, despite having little film experience, he joined two friends from university, Richard Mason and John Hemming, in an attempt to make a documentary film tracing the source of the Iriri, a river in South America that was at that point the longest unnavigated river in the world. Unfortunately, the expedition was as disastrous as it's possible for such an expedition to be.\n\nIn May 1961 they landed in the Amazon basin and headed off on their expedition to find the source of the Iriri, with the help of five local porters and three people sent along by the Brazillian government to map the new areas they were to discover. Unfortunately, by September, not only had they not found the source of the Iriri, they'd actually not managed to find the Iriri itself, four and a half months apparently not being a long enough time to find an eight-hundred-and-ten-mile-long river.\n\nAnd then Mason made his way into history in the worst possible way, by becoming the last, to date, British person to be murdered by an uncontacted indigenous tribe, the Panará, who shot him with eight poison arrows and then bludgeoned his skull.\n\nA little over a decade later the Panará made contact with the wider world after nearly being wiped out by disease. They remembered killing Mason and said that they'd been scared by the swishing noise his jeans had made, as they'd never encountered anyone who wore clothes before. Before they made contact, the Panará were also known as the Kreen-Akrore, a name given them by the Kayapó people, meaning \"round-cut head\", a reference to the way they styled their hair, brushed forward and trimmed over the forehead in a way that was remarkably similar to some of the Mod styles. Before they made contact, Paul McCartney would in 1970 record an instrumental, \"Kreen Akrore\", after being inspired by a documentary called The Tribe That Hides From Man. McCartney's instrumental includes sound effects, including McCartney firing a bow and arrow, though apparently the bow-string snapped during the recording:\n\n[Excerpt: Paul McCartney, \"Kreen Akrore\"]\n\nFor a while, Lambert was under suspicion for the murder, though the Daily Express, which had sponsored the expedition, persuaded Brazillian police to drop the charges. While he was in Rio waiting for the legal case to be sorted, Lambert developed what one book on the Who describes as \"a serious anal infection\".\n\nAstonishingly, this experience did not put Lambert off from the film industry, though he wouldn't try to make another film of his own for a couple of years. Instead, he went to work at Shepperton Studios, where he was an uncredited second AD on many films, including From Russia With Love and The L-Shaped Room. Another second AD working on many of the same films was Chris Stamp, the brother of the actor Terence Stamp, who was just starting out in his own career.\n\nStamp and Lambert became close friends, despite -- or because of -- their differences. Lambert was bisexual, and preferred men to women, Stamp was straight. Lambert was the godson of a knight and a dame, Stamp was a working-class East End Cockney. Lambert was a film-school dropout full of ideas and grand ambitions, but unsure how best to put those ideas into practice, Stamp was a practical, hands-on, man. The two complemented each other perfectly, and became flatmates and collaborators.\n\nAfter seeing A Hard Day's Night, they decided that they were going to make their own pop film -- a documentary, inspired by the French nouvelle vague school of cinema, which would chart a pop band from playing lowly clubs to being massive pop stars. Now all they needed was to find a band that were playing lowly clubs but could become massive stars. And they found that band at the Railway Hotel, when they saw the High Numbers.\n\nStamp and Lambert started making their film, and completed part of it, which can be found on YouTube:\n\n[Excerpt: The High Numbers, \"Oo Poo Pa Doo\"]\n\nThe surviving part of the film is actually very, very, well done for people who'd never directed a film before, and I have no doubt that if they'd completed the film, to be titled High Numbers, it would be regarded as one of the classic depictions of early-sixties London club life, to be classed along with The Small World of Sammy Lee and Expresso Bongo. What's even more astonishing, though, is how *modern* the group look.\n\nMost footage of guitar bands of this period looks very dated, not just in the fashions, but in everything -- the attitude of the performers, their body language, the way they hold their instruments. The best performances are still thrilling, but you can tell when they were filmed.\n\nOn the other hand, the High Numbers look ungainly and awkward, like the lads of no more than twenty that they are -- but in a way that was actually shocking to me when I first saw this footage. Because they look *exactly* like every guitar band I played on the same bill as during my own attempts at being in bands between 2000 and about 2005. If it weren't for the fact that they have such recognisable faces, if you'd told me this was footage of some band I played on the same bill with at the Star and Garter or Night and Day Cafe in 2003, I'd believe it unquestioningly.\n\nBut while Lambert and Stamp started out making a film, they soon pivoted and decided that they could go into management. Of course, the High Numbers did already have management -- Pete Meaden and Helmut Gorden -- but after consulting with the Beatles' lawyer, David Jacobs, Lambert and Stamp found out that Gorden's contract with the band was invalid, and so when Gorden got back from a holiday, he found himself usurped.\n\nMeaden was a bit more difficult to get rid of, even though he had less claim on the group than Gorden -- he was officially their publicist, not their manager, and his only deal was with Gorden, even though the group considered him their manager. While Meaden didn't have a contractual claim though, he did have one argument in his favour, which is that he had a large friend named Phil the Greek, who had a big knife. When this claim was put to Lambert and Stamp, they agreed that this was a very good point indeed, one that they hadn't considered, and agreed to pay Meaden off with two hundred and fifty pounds.\n\nThis would not be the last big expense that Stamp and Lambert would have as the managers of the Who, as the group were now renamed. Their agreement with the group had the two managers taking forty percent of the group's earnings, while the four band members would split the other sixty percent between themselves -- an arrangement which should theoretically have had the managers coming out ahead. But they also agreed to pay the group's expenses. And that was to prove very costly indeed.\n\nShortly after they started managing the group, at a gig at the Railway Hotel, which had low ceilings, Townshend lifted his guitar up a bit higher than he'd intended, and broke the headstock. Townshend had a spare guitar with him, so this was OK, and he also remembered Gustav Metzger and his ideas of auto-destructive art, and Malcolm Cecil sawing through his bass strings and damaging his bass, and decided that it was better for him to look like he'd meant to do that than to look like an idiot who'd accidentally broken his guitar, so he repeated the motion, smashing his guitar to bits, before carrying on the show with his spare.\n\nThe next week, the crowd were excited, expecting the same thing again, but Townshend hadn't brought a spare guitar with him. So as not to disappoint them, Keith Moon destroyed his drum kit instead.\n\nThis destruction was annoying to Entwistle, who saw musical instruments as something close to sacred, and it also annoyed the group's managers at first, because musical instruments are expensive. But they soon saw the value this brought to the band's shows, and reluctantly agreed to keep buying them new instruments.\n\nSo for the first couple of years, Lambert and Stamp lost money on the group. They funded this partly through Lambert's savings, partly through Stamp continuing to do film work, and partly from investors in their company, one of whom was Russ Conway, the easy-listening piano player who'd had hits like \"Side Saddle\":\n\n[Excerpt: Russ Conway, \"Side Saddle\"]\n\nConway's connections actually got the group another audition for a record label, Decca (although Conway himself recorded for EMI), but the group were turned down. The managers were told that they would have been signed, but they didn't have any original material.\n\nSo Pete Townshend was given the task of writing some original material. By this time Townshend's musical world was expanding far beyond the R&B that the group were performing on stage, and he talks in his autobiography about the music he was listening to while he was trying to write his early songs. There was \"Green Onions\", which he'd been listening to for years in his attempt to emulate Steve Cropper's guitar style, but there was also The Freewheelin' Bob Dylan, and two tracks he names in particular, \"Devil's Jump\" by John Lee Hooker:\n\n[Excerpt: John Lee Hooker, \"Devil's Jump\"]\n\nAnd \"Better Get Hit in Your Soul\" by Charles Mingus:\n\n[Excerpt: Charles Mingus, \"Better Get Hit In Your Soul\"]\n\nHe was also listening to what he described as \"a record that changed my life as a composer\", a recording of baroque music that included sections of Purcell's Gordian Knot Untied:\n\n[Excerpt: Purcell, Chaconne from Gordian Knot Untied]\n\nTownshend had a notebook in which he listed the records he wanted to obtain, and he reproduces that list in his autobiography -- \"‘Marvin Gaye, 1-2-3, Mingus Revisited, Stevie Wonder, Jimmy Smith Organ Grinder’s Swing, In Crowd, Nina in Concert [Nina Simone], Charlie Christian, Billie Holiday, Ella, Ray Charles, Thelonious Monk Around Midnight and Brilliant Corners.’\"\n\nHe was also listening to a lot of Stockhausen and Charlie Parker, and to the Everly Brothers -- who by this point were almost the only artist that all four members of the Who agreed were any good, because Daltrey was now fully committed to the R&B music he'd originally dismissed, and disliked what he thought was the pretentiousness of the music Townshend was listening to, while Keith Moon was primarily a fan of the Beach Boys. But everyone could agree that the Everlys, with their sensitive interpretations, exquisite harmonies, and Bo Diddley-inflected guitars, were great, and so the group added several songs from the Everlys' 1965 albums Rock N Soul and Beat N Soul to their set, like \"Man With Money\":\n\n[Excerpt: The Everly Brothers, \"Man With Money\"]\n\nDespite Daltrey's objections to diluting the purity of the group's R&B sound, Townshend brought all these influences into his songwriting. The first song he wrote to see release was not actually recorded by the Who, but a song he co-wrote for a minor beat group called the Naturals, who released it as a B-side:\n\n[Excerpt: The Naturals, \"It Was You\"]\n\nBut shortly after this, the group got their first big break, thanks to Lambert's personal assistant, Anya Butler. Butler was friends with Shel Talmy's wife, and got Talmy to listen to the group. Townshend in particular was eager to work with Talmy, as he was a big fan of the Kinks, who were just becoming big, and who Talmy produced.\n\nTalmy signed the group to a production deal, and then signed a deal to license their records to Decca in America -- which Lambert and Stamp didn't realise wasn't the same label as British Decca. Decca in turn sublicensed the group's recordings to their British subsidiary Brunswick, which meant that the group got a minuscule royalty for sales in Britain, as their recordings were being sold through three corporate layers all taking their cut.\n\nThis didn't matter to them at first, though, and they went into the studio excited to cut their first record as The Who. As was typical at the time, Talmy brought in a few session players to help out. Clem Cattini turned out not to be needed, and left quickly, but Jimmy Page stuck around -- not to play on the A-side, which Townshend said was \"so simple even I could play it\", but the B-side, a version of the old blues standard \"Bald-Headed Woman\", which Talmy had copyrighted in his own name and had already had the Kinks record:\n\n[Excerpt: The Who, \"Bald-Headed Woman\"]\n\nApparently the only reason that Page played on that is that Page wouldn't let Townshend use his fuzzbox.\n\nAs well as Page and Cattini, Talmy also brought in some backing vocalists. These were the Ivy League, a writing and production collective consisting at this point of John Carter and Ken Lewis, both of whom had previously been in a band with Page, and Perry Ford. The Ivy League were huge hit-makers in the mid-sixties, though most people don't recognise their name. Carter and Lewis had just written \"Can You Hear My Heartbeat\" for Herman's Hermits:\n\n[Excerpt: Herman's Hermits, \"Can You Hear My Heartbeat?\"]\n\nAnd, along with a couple of other singers who joined the group, the Ivy League would go on to sing backing vocals on hits by Sandie Shaw, Tom Jones and others. Together and separately the members of the Ivy League were also responsible for writing, producing, and singing on \"Let's Go to San Francisco\" by the Flowerpot Men, \"Winchester Cathedral\" by the New Vaudeville Band, \"Beach Baby\" by First Class, and more, as well as their big hit under their own name, \"Tossing and Turning\":\n\n[Excerpt: The Ivy League, \"Tossing and Turning\"]\n\nThough my favourite of their tracks is their baroque pop masterpiece \"My World Fell Down\":\n\n[Excerpt: The Ivy League, \"My World Fell Down\"]\n\nAs you can tell, the Ivy League were masters of the Beach Boys sound that Moon, and to a lesser extent Townshend, loved. That backing vocal sound was combined with a hard-driving riff inspired by the Kinks' early hits like \"You Really Got Me\" and \"All Day and All of the Night\", and with lyrics that explored inarticulacy, a major theme of Townshend's lyrics:\n\n[Excerpt: The Who, \"I Can't Explain\"]\n\n\"I Can't Explain\" made the top ten, thanks in part to a publicity stunt that Lambert came up with. The group had been booked on to Ready, Steady, Go!, and the floor manager of the show mentioned to Lambert that they were having difficulty getting an audience for that week's show -- they were short about a hundred and fifty people, and they needed young, energetic, dancers. Lambert suggested that the best place to find young, energetic, dancers, was at the Marquee on a Tuesday night -- which just happened to be the night of the Who's regular residency at the club. Come the day of filming, the Ready, Steady, Go! audience was full of the Who's most hardcore fans, all of whom had been told by Lambert to throw scarves at the band when they started playing. It was one of the most memorable performances on the show.\n\nBut even though the record was a big hit, Daltrey was unhappy. The man who'd started out as guitarist in a Shadows cover band and who'd strenuously objected to the group's inclusion of R&B material now had the zeal of a convert. He didn't want to be doing this \"soft commercial pop\", or Townshend's art-school nonsense. He wanted to be an R&B singer, playing hard music for working-class men like him.\n\nTwo decisions were taken to mollify the lead singer. The first was that when they went into the studio to record their first album, it was all soul and R&B apart from one original. The album was going to consist of three James Brown covers, three Motown covers, Bo Diddley's \"I'm a Man\", and a cover of Paul Revere and the Raiders' \"Louie Louie\" sequel \"Louie Come Home\", retitled \"Lubie\". All of this was material that Daltrey was very comfortable with.\n\nAlso, Daltrey was given some input into the second single, which would be the only song credited to Daltrey and Townshend, and Daltrey's only songwriting contribution to a Who A-side.\n\nTownshend had come up with the title \"Anyway, Anyhow, Anywhere\" while listening to Charlie Parker, and had written the song based on that title, but Daltrey was allowed to rewrite the lyrics and make suggestions as to the arrangement. That record also made the top ten:\n\n[Excerpt: The Who, \"Anyway, Anyhow, Anywhere\"]\n\nBut Daltrey would soon become even more disillusioned. The album they'd recorded was shelved, though some tracks were later used for what became the My Generation album, and Kit Lambert told the Melody Maker “The Who are having serious doubts about the state of R&B. Now the LP material will consist of hard pop. They’ve finished with ‘Smokestack Lightning’!”\n\nThat wasn't the only thing they were finished with -- Townshend and Moon were tired of their band's leader, and also just didn't think he was a particularly good singer -- and weren't shy about saying so, even to the press. Entwistle, a natural peacemaker, didn't feel as strongly, but there was a definite split forming in the band.\n\nThings came to a head on a European tour. Daltrey was sick of this pop nonsense, he was sick of the arty ideas of Townshend, and he was also sick of the other members' drug use. Daltrey didn't indulge himself, but the other band members had been using drugs long before they became successful, and they were all using uppers, which offended Daltrey greatly. He flushed Keith Moon's pill stash down the toilet, and screamed at his band mates that they were a bunch of junkies, then physically attacked Moon.\n\nAll three of the other band members agreed -- Daltrey was out of the band. They were going to continue as a trio.\n\nBut after a couple of days, Daltrey was back in the group. This was mostly because Daltrey had come crawling back to them, apologising -- he was in a very bad place at the time, having left his wife and kid, and was actually living in the back of the group's tour van. But it was also because Lambert and Stamp persuaded the group they needed Daltrey, at least for the moment, because he'd sung lead on their latest single, and that single was starting to rise up the charts.\n\n\"My Generation\" had had a long and torturous journey from conception to realisation. Musically it originally had been inspired by Mose Allison's \"Young Man's Blues\":\n\n[Excerpt: Mose Allison, \"Young Man's Blues\"]\n\nTownshend had taken that musical mood and tied it to a lyric that was inspired by a trilogy of TV plays, The Generations, by the socialist playwright David Mercer, whose plays were mostly about family disagreements that involved politics and class, as in the case of the first of those plays, where two upwardly-mobile young brothers of very different political views go back to visit their working-class family when their mother is on her deathbed, and are confronted by the differences they have with each other, and with the uneducated father who sacrificed to give them a better life than he had:\n\n[Excerpt: Where the Difference Begins]\n\nTownshend's original demo for the song was very much in the style of Mose Allison, as the excerpt of it that's been made available on various deluxe reissues of the album shows:\n\n[Excerpt: Pete Townshend, \"My Generation (demo)\"]\n\nBut Lambert had not been hugely impressed by that demo. Stamp had suggested that Townshend try a heavier guitar riff, which he did, and then Lambert had added the further suggestion that the music would be improved by a few key changes -- Townshend was at first unsure about this, because he already thought he was a bit too influenced by the Kinks, and he regarded Ray Davies as, in his words, \"the master of modulation\", but eventually he agreed, and decided that the key changes did improve the song.\n\nStamp made one final suggestion after hearing the next demo version of the song. A while earlier, the Who had been one of the many British groups, like the Yardbirds and the Animals, who had backed Sonny Boy Williamson II on his UK tour. Williamson had occasionally done a little bit of a stutter in some of his performances, and Daltrey had picked up on that and started doing it. Townshend had in turn imitated Daltrey's mannerism a couple of times on the demo, and Stamp thought that was something that could be accentuated.\n\nTownshend agreed, and reworked the song, inspired by John Lee Hooker's \"Stuttering Blues\":\n\n[Excerpt: John Lee Hooker, \"Stuttering Blues\"]\n\nThe stuttering made all the difference, and it worked on three levels. It reinforced the themes of inarticulacy that run throughout the Who's early work -- their first single, after all, had been called \"I Can't Explain\", and Townshend talks movingly in his autobiography about talking to teenage fans who felt that \"I Can't Explain\" had said for them the things they couldn't say themselves -- and how they even found it difficult to say *that* themselves.  Here is a character who is trying to be a spokesman for his generation, but he is literally unable to force the words out.\n\nIt was also a shoutout to the Mod audience, more subtle than the obvious references on things like \"I'm the Face\". The Mod drug of choice was speed, and one common effect of amphetamine use is that users tend to stutter when on high doses -- amphetamines raise dopamine levels in the brain to such an extent that the basal ganglia-thalamocortical motor circuits of the brain are thrown off, leading to a similar inability to control the muscles used in speech as one gets in Parkinson's disease, for similar underlying reasons, even as the sped-up thought processes caused by amphetamines make it seem that much more urgent to get the words out. By having the protagonist of the song stutter, Townshend was telling the group's Mod listeners \"this character is on the same drugs as you\", without doing anything so crude as just flat-out saying that.\n\nAnd finally, the stutter also allowed Townshend to hint at things he wouldn't be allowed to say on the radio. Every teenage listener knew what \"Why don't you all f-f-f-...\" was leading up to, and could dig what he was saying, even if the eventual words that came out were more broadcastable:\n\n[Excerpt: The Who, \"My Generation\"]\n\nThere were two other aspects of the record that were unlike anything else that was on the pop charts at the time. The first was the bass solo, which was not, as some have claimed, the first bass solo on record -- even leaving aside jazz and only looking at hit singles, Grady Martin had played a Danelectro fuzz solo a full five years earlier on Marty Robbins' top five US chart hit \"Don't Worry\":\n\n[Excerpt: Marty Robbins, \"Don't Worry\"]\n\nBut it was one of the most prominent bass solos on a rock single, and one of the first times that the bass had really seemed like a lead instrument on a rock and roll record.\n\nEntwistle's solo was meant to be recorded on a Danelectro, but there was a problem. Danelectros had thinner strings than a normal bass, and Entwistle was a very heavy-handed player. Often one can use the same bass strings for years without breaking a string, but the combination of the thinner strings and Entwistle's playing meant that he broke strings when playing the solo.\n\nThe problem was that because the Danelectro didn't use the same strings as other instruments, because it wasn't normal for people to break bass strings very often, and because it was an extremely rare instrument in the UK at the time, you couldn't buy those strings separately -- the only way you could get new strings for a Danelectro was to buy a whole new instrument. After the third time Entwistle broke a Danelectro string, and now owning three Danelectros he couldn't play because of broken strings, he decided to play it on a Fender Jazz bass instead, and that's what's used on the finished record:\n\n[Excerpt: The Who, \"My Generation\"]\n\nAnd after all these innovations, the band saved the most astonishing thing for last, ending the song in a cacophony of feedback and drums, which was the kind of thing that several acts had been doing live, but which had not made it to a pop single at this point:\n\n[Excerpt: The Who, \"My Generation\"]\n\nThe record became the group's biggest hit to that point, reaching number two on the UK charts (kept off the top by \"The Carnival is Over\" by the Seekers), though it only made number seventy-five in the US. And as Daltrey was the lead singer on the record, it was decided that they'd better let him stay in the group. But the dynamic of the band had changed forever. The band that had been led by Roger Daltrey were now, for better or for worse, Pete Townshend's band.",
  "itunes:subtitle": "Episode one hundred and thirty-six of A History of Rock Music in Five Hundred Songs is a special long episode, running almost ninety minutes, looking at My Generation by the Who. Click the full post to read liner notes, links to more information, and a t",
  "itunes:keywords": "Billy Idol,Chris Stamp,Clem Cattini,Duane Eddy,George Melly,Jim Marshall,Jimmy Page,John Entwistle,Johnny Kidd and the Pirates,Keith Moon,Kit Lambert,Lee Hazlewood,Lester Sill,Malcolm Cecil,Mitch Mitchell,Paul McCartney,Pete Townshend,Roger Daltrey,Shel Talmy,Steve Marriott,The Ivy League,The Kinks,The Rolling Stones,the who",
  "content:encoded": "Episode one hundred and thirty-six of <em>A History of Rock Music in Five Hundred Songs</em> is a special long episode, running almost ninety minutes, looking at \"My Generation\" by the Who. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/58230940\">\"The Name Game\" by Shirley Ellis</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Errata</strong>\nI mispronounce the Herman's Hermits track \"Can't You Hear My Heartbeat\" as \"Can You Hear My Heartbeat\".\nI say \"Rebel Without a Cause\" when I mean \"The Wild One\". Brando was not in \"Rebel Without a Cause\".\n<strong>Resources</strong>\n\nAs usual, I’ve created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-136-my-generation/\">a Mixcloud playlist</a> of the music excerpted here. This mix does not include the Dixon of Dock Green theme, as I was unable to find a full version of that theme anywhere (though a version with Jack Warner singing, titled \"An Ordinary Copper\" is often labelled as it) and what you hear in this episode is the only fragment I could get a clean copy of.\n\nThe best compilation of the Who's music is <a href=\"https://amzn.to/3q26FNW\"><em>Maximum A's & B's</em></a>, a three-disc set containing the A and B sides of every single they released.\n\nThe <a href=\"https://amzn.to/3jWhOfe\">super-deluxe five-CD version of the <em>My Generation</em> album</a> appears to be out of print as a CD, but can be purchased digitally.\n\nI referred to a lot of books for this episode, including:\n\n<a href=\"https://amzn.to/31rVeEX\"><em>Generations: The History of America's Future, 1584 to 2069</em></a> by William Strauss and Neil Howe, which I don't necessarily recommend reading, but which is certainly an influential book.\n\n<a href=\"https://amzn.to/3nLpzFO\"><em>Revolt Into Style: The Pop Arts </em></a>by George Melly which I *do* recommend reading if you have any interest at all in British pop culture of the fifties and sixties.\n\n<a href=\"https://amzn.to/2ZLJQU4\"><em>Jim Marshall: The Father of Loud</em></a> by Rich Maloof gave me all the biographical details about Marshall.\n\n<a href=\"https://amzn.to/31uXbk9\"><em>The Who Before the Who</em></a> by Doug Sandom, a rather thin book of reminiscences by the group's first drummer.\n\n<a href=\"https://amzn.to/3EGae0d\"><em>The Ox</em></a> by Paul Rees, an authorised biography of John Entwistle based on notes for his never-completed autobiography.\n\n<a href=\"https://amzn.to/3EzuVe4\"><em>Who I Am</em></a>, the autobiography of Pete Townshend, is one of the better rock autobiographies.\n\n<a href=\"https://amzn.to/2YfMalq\"><em>A Band With Built-In Hate</em></a> by Peter Stanfield is an examination of the group in the context of pop-art and Mod.\n\nAnd <a href=\"https://amzn.to/3mGcuyy\"><em>Anyway, Anyhow, Anywhere</em> </a>by Andy Neill and Matt Kent is a day-by-day listing of the group's activities up to 1978.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nIn 1991, William Strauss and Neil Howe wrote a book called Generations: The History of America's Future, 1584 to 2069. That book was predicated on a simple idea -- that there are patterns in American history, and that those patterns can be predicted in their rough outline. Not in the fine details, but broadly -- those of you currently watching the TV series Foundation, or familiar with Isaac Asimov's original novels, will have the idea already, because Strauss and Howe claimed to have invented a formula which worked as well as Asimov's fictional Psychohistory.\n\nTheir claim was that, broadly speaking, generations can be thought to have a dominant personality type, influenced by the events that took place while they were growing up, which in turn are influenced by the personality types of the older generations. Because of this, Strauss and Howe claimed, American society had settled into a semi-stable pattern, where events repeat on a roughly eighty-eight-year cycle, driven by the behaviours of different personality types at different stages of their lives. You have four types of generation, which cycle -- the Adaptive, Idealist, Reactive, and Civic types. At any given time, one of these will be the elder statespeople, one will be the middle-aged people in positions of power, one will be the young rising people doing most of the work, and one will be the kids still growing up. You can predict what will happen, in broad outline, by how each of those generation types will react to challenges, and what position they will be in when those challenges arise. The idea is that major events change your personality, and also how you react to future events, and that how, say, Pearl Harbor affected someone will have been different for a kid hearing about the attack on the radio, an adult at the age to be drafted, and an adult who was too old to fight.\n\nThe thesis of this book has, rather oddly, entered mainstream thought so completely that its ideas are taken as basic assumptions now by much of the popular discourse, even though on reading it the authors are so vague that pretty much anything can be taken as confirmation of their hypotheses, in much the same way that newspaper horoscopes always seem like they could apply to almost everyone's life.\n\nAnd sometimes, of course, they're just way off. For example they make the prediction that in 2020 there would be a massive crisis that would last several years, which would lead to a massive sense of community, in which \"America will be implacably resolved to do what needs doing and fix what needs fixing\", and in which the main task of those aged forty to sixty at that point would be to restrain those in leadership positions in the sixty-to-eighty age group from making irrational, impetuous, decisions which might lead to apocalypse. The crisis would likely end in triumph, but there was also a chance it might end in \"moral fatigue, vast human tragedy, and a weak and vengeful sense of victory\".\n\nI'm sure that none of my listeners can think of any events in 2020 that match this particular pattern.\n\nDespite its lack of rigour, Strauss and Howe's basic idea is now part of most people's intellectual toolkit, even if we don't necessarily think of them as the source for it. Indeed, even though they only talk about America in their book, their generational concept gets applied willy-nilly to much of the Western world.\n\nAnd likewise, for the most part we tend to think of the generations, whether American or otherwise, using the names they used. For the generations who were alive at the time they were writing, they used five main names, three of which we still use. Those born between 1901 and 1924 they term the \"GI Generation\", though those are now usually termed the \"Greatest Generation\". Those born between 1924 and 1942 were the \"Silent Generation\", those born 1943 through 1960 were the Boomers, and those born between 1982 and 2003 they labelled Millennials.\n\nThose born between 1961 and 1981 they labelled \"thirteeners\", because they were the unlucky thirteenth generation to be born in America since the declaration of independence.\n\nBut that name didn't catch on. Instead, the name that people use to describe that generation is \"Generation X\", named after a late-seventies punk band led by Billy Idol:\n\n[Excerpt: Generation X, \"Your Generation\"]\n\nThat band were short-lived, but they were in constant dialogue with the pop culture of ten to fifteen years earlier, Idol's own childhood. As well as that song, \"Your Generation\", which is obviously referring to the song this week's episode is about, they also recorded versions of John Lennon's \"Gimme Some Truth\", of Johnny Kidd and the Pirates' \"Shakin' All Over\", and an original song called \"Ready Steady Go\", about being in love with Cathy McGowan, the presenter of that show.\n\nAnd even their name was a reference, because Generation X were named after a book published in 1964, about not the generation we call Generation X, but about the Baby Boomers, and specifically about a series of fights on beaches across the South Coast of England between what at that point amounted to two gangs.\n\nThese were fights between the old guard, the Rockers -- people who represented the recent past who wouldn't go away, what Americans would call \"greasers\", people who modelled themselves on Marlon Brando in Rebel Without A Cause, and who thought music had peaked with Gene Vincent and Eddie Cochran -- and a newer, younger, hipper, group of people, who represented the new, the modern -- the Mods:\n\n[Excerpt: The Who, \"My Generation\"]\n\nJim Marshall, if he'd been American, would have been considered one of the Greatest Generation, but his upbringing was not typical of that, or of any, generation. When he was five, he was diagnosed as having skeletal tuberculosis, which had made his bones weak and easily broken. To protect them, he spent the next seven years of his life, from age five until twelve, in hospital in a full-body cast. The only opportunity he got to move during those years was for a few minutes every three months, when the cast would be cut off and reapplied to account for his growth during that time.\n\nUnsurprisingly, once he was finally out of the cast, he discovered he loved moving -- a lot. He dropped out of school aged thirteen -- most people at the time left school at aged fourteen anyway, and since he'd missed all his schooling to that point it didn't seem worth his while carrying on -- and took on multiple jobs, working sixty hours a week or more. But the job he made most money at was as an entertainer. He started out as a tap-dancer, taking advantage of his new mobility, but then his song-and-dance man routine became steadily more song and less dance, as people started to notice his vocal resemblance to Bing Crosby.\n\nHe was working six nights a week as a singer, but when World War II broke out, the drummer in the seven-piece band he was working with was drafted -- Marshall wouldn't ever be drafted because of his history of illness. The other members of the band knew that as a dancer he had a good sense of rhythm, and so they made a suggestion -- if Jim took over the drums, they could split the money six ways rather than seven.\n\nMarshall agreed, but he discovered there was a problem. The drum kit was always positioned at the back of the stage, behind the PA, and he couldn't hear the other musicians clearly. This is actually OK for a drummer -- you're keeping time, and the rest of the band are following you, so as long as you can *sort of* hear them everyone can stay together. But a singer needs to be able to hear everything clearly, in order to stay on key. And this was in the days before monitor speakers, so the only option available was to just have a louder PA system. And since one wasn't available, Marshall just had to build one himself. And that's how Jim Marshall started building amplifiers.\n\nMarshall eventually gave up playing the drums, and retired to run a music shop. There's a story about Marshall's last gig as a drummer, which isn't in the biography of Marshall I read for this episode, but is told in other places by the son of the bandleader at that gig. Apparently Marshall had a very fraught relationship with his father, who was among other things a semi-professional boxer, and at that gig Marshall senior turned up and started heckling his son from the audience. Eventually the younger Marshall jumped off the stage and started hitting his dad, winning the fight, but he decided he wasn't going to perform in public any more.\n\nThe band leader for that show was Clifford Townshend, a clarinet player and saxophonist whose main gig was as part of the Squadronaires, a band that had originally been formed during World War II by RAF servicemen to entertain other troops. Townshend, who had been a member of Oswald Moseley's fascist Blackshirts in the thirties but later had a change of heart, was a second-generation woodwind player -- his father had been a semi-professional flute player.\n\nAs well as working with the Squadronaires, Townshend also put out one record under his own name in 1956, a version of \"Unchained Melody\" credited to \"Cliff Townsend and his singing saxophone\":\n\n[Excerpt: Cliff Townshend and his Singing Saxophone, \"Unchained Melody\"]\n\nCliff's wife often performed with him -- she was a professional singer who had  actually lied about her age in order to join up with the Air Force and sing with the group -- but they had a tempestuous marriage, and split up multiple times. As a result of this, and the travelling lifestyle of musicians, there were periods where their son Peter was sent to live with his grandmother, who was seriously abusive, traumatising the young boy in ways that would affect him for the rest of his life.\n\nWhen Pete Townshend was growing up, he wasn't particularly influenced by music, in part because it was his dad's job rather than a hobby, and his parents had very few records in the house. He did, though, take up the harmonica and learn to play the theme tune to Dixon of Dock Green:\n\n[Excerpt: Tommy Reilly, \"Dixon of Dock Green Theme\"]\n\nHis first exposure to rock and roll wasn't through Elvis or Little Richard, but rather through Ray Ellington. Ellington was a British jazz singer and drummer, heavily influenced by Louis Jordan, who provided regular musical performances on the Goon Show throughout the fifties, and on one episode had performed \"That Rock 'n' Rollin' Man\":\n\n[Excerpt: Ray Ellington, \"That Rock 'N' Rollin' Man\"]\n\nYoung Pete's assessment of that, as he remembered it later, was \"I thought it some kind of hybrid jazz: swing music with stupid lyrics. But it felt youthful and rebellious, like The Goon Show itself.\"\n\nBut he got hooked on rock and roll when his father took him and a friend to see a film:\n\n[Excerpt: Bill Haley and the Comets, \"Rock Around the Clock\"]\n\nAccording to Townshend's autobiography, \"I asked Dad what he thought of the music. He said he thought it had some swing, and anything that had swing was OK. For me it was more than just OK. After seeing Rock Around the Clock with Bill Haley, nothing would ever be quite the same.\" Young Pete would soon go and see Bill Haley live – his first rock and roll gig.\n\nBut the older Townshend would soon revise his opinion of rock and roll, because it soon marked the end of the kind of music that had allowed him to earn his living -- though he still managed to get regular work, playing a clarinet was suddenly far less lucrative than it had been.\n\nPete decided that he wanted to play the saxophone, like his dad, but soon he switched first to guitar and then to banjo. His first guitar was bought for him by his abusive grandmother, and three of the strings snapped almost immediately, so he carried on playing with just three strings for a while. He got very little encouragement from his parents, and didn't really improve for a couple of years.\n\nBut then the trad jazz boom happened, and Townshend teamed up with a friend of his who played the trumpet and French horn. He had initially bonded with John Entwistle over their shared sense of humour -- both kids loved Mad magazine and would make tape recordings together of themselves doing comedy routines inspired by the Goon show and Hancock's Half Hour -- but Entwistle was also a very accomplished musician, who could play multiple instruments.\n\nEntwistle had formed a trad band called the Confederates, and Townshend joined them on banjo and guitar, but they didn't stay together for long. Both boys, though, would join a variety of other bands, both together and separately.\n\nAs the trad boom faded and rock and roll regained its dominance among British youth, there was little place for Entwistle's trumpet in the music that was popular among teenagers, and at first Entwistle decided to try making his trumpet sound more like a saxophone, using a helmet as a mute to try to get it to sound like the sax on \"Ramrod\" by Duane Eddy:\n\n[Excerpt: Duane Eddy, \"Ramrod\"]\n\nEddy soon became Entwistle's hero. We've talked about him before a couple of times, briefly, but not in depth, but Duane Eddy had a style that was totally different from most guitar heroes. Instead of playing mostly on the treble strings of the guitar, playing high twiddly parts, Eddy played low notes on the bass strings of his guitar, giving him the style that he summed up in album titles like \"The Twang's the Thang\" and \"Have Twangy Guitar Will Travel\".\n\nAfter a couple of years of having hits with this sound, produced by Lee Hazelwood and Lester Sill, Eddy also started playing another instrument, the instrument variously known as the six-string bass, the baritone guitar, or the Danelectro bass (after the company that manufactured the most popular model).  The baritone guitar has six strings, like a normal guitar, but it's tuned lower than a standard guitar -- usually a fourth lower, though different players have different preferences. The Danelectro became very popular in recording studios in the early sixties, because it helped solve a big problem in recording bass tones.\n\nYou can hear more about this in the episodes of Cocaine and Rhinestones I recommended last week, but basically double basses were very, very difficult to record in the 1950s, and you'd often end up just getting a thudding, muddy, sound from them, which is one reason why when you listen to a lot of early rockabilly the bass is doing nothing very interesting, just playing root notes -- you couldn't easily get much clarity on the instrument at all.\n\nConversely, with electric basses, with the primitive amps of the time, you didn't get anything like the full sound that you'd get from a double bass, but you *did* get a clear sound that would cut through on a cheap radio in a way that the sound of a double bass wouldn't.\n\nSo the solution was obvious -- you have an electric instrument *and* a double bass play the same part. Use the double bass for the big dull throbbing sound, but use the electric one to give the sound some shape and cut-through. If you're doing that, you mostly want the trebly part of the electric instrument's tone, so you play it with a pick rather than fingers, and it makes sense to use a Danelectro rather than a standard bass guitar, as the Danelectro is more trebly than a normal bass.\n\nThis combination, of Danelectro and double bass, appears to have been invented by Owen Bradley, and you can hear it for example on this record by Patsy Cline, with Bob Moore on double bass and Harold Bradley on baritone guitar:\n\n[Excerpt: Patsy Cline, \"Crazy\"]\n\nThis sound, known as \"tic-tac bass\", was soon picked up by a lot of producers, and it became the standard way of getting a bass sound in both Nashville and LA. It's all over the Beach Boys' best records, and many of Jack Nitzsche's arrangements, and many of the other records the Wrecking Crew played on, and it's on most of the stuff the Nashville A-Team played on from the late fifties through mid-sixties, records by people like Elvis, Roy Orbison, Arthur Alexander, and the Everly Brothers.\n\nLee Hazelwood was one of the first producers to pick up on this sound -- indeed, Duane Eddy has said several times that Hazelwood invented the sound before Owen Bradley did, though I think Bradley did it first -- and many of Eddy's records featured that bass sound, and eventually Eddy started playing a baritone guitar himself, as a lead instrument, playing it on records like \"Because They're Young\":\n\n[Excerpt: Duane Eddy, \"Because They're Young\"]\n\nDuane Eddy was John Entwistle's idol, and Entwistle learned Eddy's whole repertoire on trumpet, playing the saxophone parts. But then, realising that the guitar was always louder than the trumpet in the bands he was in, he realised that if he wanted to be heard, he should probably switch to guitar himself. And it made sense that a bass would be easier to play than a regular guitar -- if you only have four strings, there's more space between them, so playing is easier. So he started playing the bass, trying to sound as much like Eddy as he could.\n\nHe had no problem picking up the instrument -- he was already a multi-instrumentalist -- but he did have a problem actually getting hold of one, as all the electric bass guitars available in the UK at the time were prohibitively expensive. Eventually he made one himself, with the help of someone in a local music shop, and that served for a time, though he would soon trade up to more professional instruments, eventually amassing the biggest collection of basses in the world.\n\nOne day, Entwistle was approached on the street by an acquaintance, Roger Daltrey, who said to him \"I hear you play bass\" -- Entwistle was, at the time, carrying his bass. Daltrey was at this time a guitarist -- like Entwistle, he'd built his own instrument -- and he was the leader of a band called Del Angelo and his Detours. Daltrey wasn't Del Angelo, the lead singer -- that was a man called Colin Dawson who by all accounts sounded a little like Cliff Richard -- but he was the bandleader, hired and fired the members, and was in charge of their setlists. Daltrey lured Entwistle away from the band he was in with Townshend by telling him that the Detours were getting proper paid gigs, though they weren't getting many at the time.\n\nUnfortunately, one of the group's other guitarists, the member who owned the best amp, died in an accident not long after Entwistle joined the band. However, the amp was left in the group's possession, and Entwistle used it to lure Pete Townshend into the group by telling him he could use it -- and not telling him that he'd be sharing the amp with Daltrey.\n\nTownshend would later talk about his audition for the Detours -- as he was walking up the street towards Daltrey's house, he saw a stunningly beautiful woman walking away from the house crying. She saw his guitar case and said \"Are you going to Roger's?\"\n\n\"Yes.\"\n\n\"Well you can tell him, it's that bloody guitar or me\".\n\nTownshend relayed the message, and Daltrey responded \"Sod her. Come in.\"\n\nThe audition was a formality, with the main questions being whether Townshend could play two parts of the regular repertoire for a working band at that time -- \"Hava Nagila\", and the Shadows' \"Man of Mystery\":\n\n[Excerpt: The Shadows, \"Man of Mystery\"]\n\nTownshend could play both of those, and so he was in. The group would mostly play chart hits by groups like the Shadows, but as trad jazz hadn't completely died out yet they would also do breakout sessions playing trad jazz, with Townshend on banjo, Entwistle on trumpet and Daltrey on trombone.\n\nFrom the start, there was a temperamental mismatch between the group's two guitarists. Daltrey was thoroughly working-class, culturally conservative,  had dropped out of school to go to work at a sheet metal factory, and saw himself as a no-nonsense plain-speaking man. Townshend was from a relatively well-off upper-middle-class family, was for a brief time a member of the Communist Party, and was by this point studying at art school, where he was hugely impressed by a lecture from Gustav Metzger titled “Auto-Destructive Art, Auto-Creative Art: The Struggle For The Machine Arts Of The Future”, about Metzger's creation of artworks which destroyed themselves.\n\nTownshend was at art school during a period when the whole idea of what an art school was for was in flux, something that's typified by a story Townshend tells about two of his early lectures. At the first, the lecturer came in and told the class to all draw a straight line. They all did, and then the lecturer told off anyone who had drawn anything that was anything other than six inches long, perfectly straight, without a ruler, going north-south, with a 3B pencil, saying that anything else at all was self-indulgence of the kind that needed to be drummed out of them if they wanted to get work as commercial artists.\n\nThen in another lecture, a different lecturer came in and asked them all to draw a straight line. They all drew perfectly straight, six-inch, north-south lines in 3B pencil, as the first lecturer had taught them. The new lecturer started yelling at them, then brought in someone else to yell at them as well, and then cut his hand open with a knife and dragged it across a piece of paper, smearing a rough line with his own blood, and screamed \"THAT'S a line!\"\n\nTownshend's sympathies lay very much with the second lecturer.\n\nAnother big influence on Townshend at this point was a jazz double-bass player, Malcolm Cecil. Cecil would later go on to become a pioneer in electronic music as half of TONTO's Expanding Head Band, and we'll be looking at his work in more detail in a future episode, but at this point he was a fixture on the UK jazz scene. He'd been a member of Blues Incorporated, and had also played with modern jazz players like Dick Morrissey:\n\n[Excerpt: Dick Morrissey, \"Jellyroll\"]\n\nBut Townshend was particularly impressed with a performance in which Cecil demonstrated unorthodox ways to play the double-bass, including playing so hard he broke the strings, and using a saw as a bow, sawing through the strings and damaging the body of the instrument.\n\nBut these influences, for the moment, didn't affect the Detours, who were still doing the Cliff and the Shadows routine. Eventually Colin Dawson quit the group, and Daltrey took over the lead vocal role for the Detours, who settled into a lineup of Daltrey, Townshend, Entwistle, and drummer Doug Sandom, who was much older than the rest of the group -- he was born in 1930, while Daltrey and Entwistle were born in 1944 and Townshend in 1945. For a while, Daltrey continued playing guitar as well as singing, but his hands were often damaged by his work at the sheet-metal factory, making guitar painful for him.\n\nThen the group got a support slot with Johnny Kidd and the Pirates, who at this point were a four-piece band, with Kidd singing backed by bass, drums, and Mick Green playing one guitar on which he played both rhythm and lead parts:\n\n[Excerpt: Johnny Kidd and the Pirates, \"Doctor Feel Good\"]\n\nGreen was at the time considered possibly the best guitarist in Britain, and the sound the Pirates were able to get with only one guitar convinced the Detours that they would be OK if Daltrey switched to just singing, so the group changed to what is now known as a \"power trio\" format. Townshend was a huge admirer of Steve Cropper, another guitarist who played both rhythm and lead, and started trying to adopt parts of Cropper's style, playing mostly chords, while Entwistle went for a much more fluid bass style than most, essentially turning the bass into another lead instrument, patterning his playing after Duane Eddy's work.\n\nBy this time, Townshend was starting to push against Daltrey's leadership a little, especially when it came to repertoire. Townshend had a couple of American friends at art school who had been deported after being caught smoking dope, and had left their records with Townshend for safe-keeping. As a result, Townshend had become a devotee of blues and R&B music, especially the jazzier stuff like Ray Charles, Mose Allison, and Booker T and the MGs. He also admired guitar-based blues records like those by Howlin' Wolf or Jimmy Reed.\n\nTownshend kept pushing for this music to be incorporated into the group's sets, but Daltrey would push back, insisting as the leader that they should play the chart hits that everyone else played, rather than what he saw as Townshend's art-school nonsense. Townshend insisted, and eventually won -- within a short while the group had become a pure R&B group, and Daltrey was soon a convert, and became the biggest advocate of that style in the band.\n\nBut there was a problem with only having one guitar, and that was volume. In particular, Townshend didn't want to be able to hear hecklers. There were gangsters in some of the audiences who would shout requests for particular songs, and you had to play them or else, even if they were completely unsuitable for the rest of the audience's tastes. But if you were playing so loud you couldn't hear the shouting, you had an excuse.\n\nBoth Entwistle and Townshend had started buying amplifiers from Jim Marshall, who had opened up a music shop after quitting drums -- Townshend actually bought his first one from a shop assistant in Marshall's shop, John McLaughlin, who would later himself become a well-known guitarist. Entwistle, wanting to be heard over Townshend, had bought a cabinet with four twelve-inch speakers in it. Townshend, wanting to be heard over Entwistle, had bought *two* of these cabinets, and stacked them, one on top of the other, against Marshall's protestations -- Marshall said that they would vibrate so much that the top one might fall over and injure someone. Townshend didn't listen, and the Marshall stack was born.\n\nThis ultra-amplification also led Townshend to change his guitar style further. He was increasingly reliant on distortion and feedback, rather than on traditional instrumental skills.\n\nNow, there are basically two kinds of chords that are used in most Western music. There are major chords, which consist of the first, third, and fifth note of the scale, and these are the basic chords that everyone starts with. So you can strum between G major and F major:\n\n[demonstrates G and F chords]\n\nThere's also minor chords, where you flatten the third note, which sound a little sadder than major chords, so playing G minor and F minor:\n\n[demonstrates Gm and Fm chords]\n\nThere are of course other kinds of chord -- basically any collection of notes counts as a chord, and can work musically in some context. But major and minor chords are the basic harmonic building blocks of most pop music.\n\nBut when you're using a lot of distortion and feedback, you create a lot of extra harmonics -- extra notes that your instrument makes along with the ones you're playing. And for mathematical reasons I won't go into here because this is already a very long episode, the harmonics generated by playing the first and fifth notes sound fine together, but the harmonics from a third or minor third don't go along with them at all.\n\nThe solution to this problem is to play what are known as \"power chords\", which are just the root and fifth notes, with no third at all, and which sound ambiguous as to whether they're major or minor. Townshend started to build his technique around these chords, playing for the most part on the bottom three strings of his guitar, which sounds like this:\n\n[demonstrates G5 and F5 chords]\n\nTownshend wasn't the first person to use power chords -- they're used on a lot of the Howlin' Wolf records he liked, and before Townshend would become famous the Kinks had used them on \"You Really Got Me\" -- but he was one of the first British guitarists to make them a major part of his personal style.\n\nAround this time, the Detours were starting to become seriously popular, and Townshend was starting to get exhausted by the constant demands on his time from being in the band and going to art school. He talked about this with one of his lecturers, who asked how much Townshend was earning from the band. When Townshend told him he was making thirty pounds a week, the lecturer was shocked, and said that was more than *he* was earning. Townshend should probably just quit art school, because it wasn't like he was going to make more money from anything he could learn there.\n\nAround this time, two things changed the group's image. The first was that they played a support slot for the Rolling Stones in December 1963. Townshend saw Keith Richards swinging his arm over his head and then bringing it down on the guitar, to loosen up his muscles, and he thought that looked fantastic, and started copying it -- from very early on, Townshend wanted to have a physical presence on stage that would be all about his body, to distract from his face, as he was embarrassed about the size of his nose.\n\nThey played a second support slot for the Stones a few weeks later, and not wanting to look like he was copying Richards, Townshend didn't do that move, but then he noticed that Richards didn't do it either. He asked about it after the gig, and Richards didn't know what he was talking about -- \"Swing me what?\" -- so Townshend took that as a green light to make that move, which became known as the windmill, his own.\n\nThe second thing was when in February 1964 a group appeared on Thank Your Lucky Stars:\n\n[Excerpt: Johnny Devlin and the Detours, \"Sometimes\"]\n\nJohnny Devlin and the Detours had had national media exposure, which meant that Daltrey, Townshend, Entwistle, and Sandom had to change the name of their group. They eventually settled on \"The Who\",\n\nIt was around this time that the group got their first serious management, a man named Helmut Gorden, who owned a doorknob factory. Gorden had no management experience, but he did offer the group a regular salary, and pay for new equipment for them. However, when he tried to sign the group to a proper contract, as most of them were still under twenty-one he needed their parents to countersign for them. Townshend's parents, being experienced in the music industry, refused to sign, and so the group continued under Gorden's management without a contract.\n\nGorden, not having management experience, didn't have any contacts in the music industry. But his barber did. Gorden enthused about his group to Jack Marks, the barber, and Marks in turn told some of his other clients about this group he'd been hearing about. Tony Hatch wasn't interested, as he already had a guitar group with the Searchers, but Chris Parmenter at Fontana Records was, and an audition was arranged. At the audition, among other numbers, they played Bo Diddley's \"Here 'Tis\":\n\n[Excerpt: Bo Diddley, \"Here 'Tis\"]\n\nUnfortunately for Doug, he didn't play well on that song, and Townshend started berating him. Doug also knew that Parmenter had reservations about him, because he was so much older than the rest of the band -- he was thirty-four at the time, while the rest of the group were only just turning twenty -- and he was also the least keen of the group on the R&B material they were playing. He'd been warned by Entwistle, his closest friend in the group, that Daltrey and Townshend were thinking of dropping him, and so he decided to jump before he was pushed, walking out of the audition. He agreed to come back for a handful more gigs that were already booked in, but that was the end of his time in the band, and of his time in the music industry -- though oddly not of his friendship with the group. Unlike other famous examples of an early member not fitting in and being forced out before a band becomes big, Sandom remained friends with the other members, and Townshend wrote the foreword to his autobiography, calling him a mentor figure, while Daltrey apparently insisted that Sandom phone him for a chat every Sunday, at the same time every week, until Sandom's death in 2019 at the age of eighty-nine.\n\nThe group tried a few other drummers, including someone who Jim Marshall had been giving drum lessons to, Mitch Mitchell, before settling on the drummer for another group that played the same circuit, the Beachcombers, who played mostly Shadows material, plus the Beach Boys and Jan and Dean songs that their drummer, Keith Moon, loved. Moon and Entwistle soon became a formidable rhythm section, and despite having been turned down by Fontana, they were clearly going places.\n\nBut they needed an image -- and one was provided for them by Pete Meaden. Meaden was another person who got his hair cut by Jack Marks, and he had had  little bit of music business experience, having worked for Andrew Oldham, the Rolling Stones' manager, for a while before going on to manage a group called the Moments, whose career highlight was recording a soundalike cover version of \"You Really Got Me\" for an American budget label:\n\n[Excerpt: The Moments, \"You Really Got Me\"]\n\nThe Moments never had any big success, but Meaden's nose for talent was not wrong, as their teenage lead singer, Steve Marriott, later went on to much better things.\n\nPete Meaden was taken on as Helmut Gorden's assistant, but from this point on the group decided to regard him as their de facto manager, and as more than just a manager. To Townshend in particular he was a guru figure, and he shaped the group to appeal to the Mods.\n\nNow, we've not talked much about the Mods previously, and what little has been said has been a bit contradictory. That's because the Mods were a tiny subculture at this point -- or to be more precise, they were three subcultures.\n\nThe original mods had come along in the late 1950s, at a time when there was a division among jazz fans between fans of traditional New Orleans jazz -- \"trad\" -- and modern jazz. The mods were modernists, hence the name, but for the most part they weren't as interested in music as in clothes. They were a small group of young working-class men, almost all gay, who dressed flamboyantly and dandyishly, and who saw themselves, their clothing, and their bodies as works of art. In the late fifties, Britain was going through something of an economic boom, and this was the first time that working-class men *could* buy nice clothes. These working-class dandies would have to visit tailors to get specially modified clothes made, but they could just about afford to do so.\n\nThe mod image was at first something that belonged to a very, very, small clique of people. But then John Stephens opened his first shop. This was the first era when short runs of factory-produced clothing became possible, and Stephens, a stylish young man, opened a shop on Carnaby Street, then a relatively cheap place to open a shop. He painted the outside yellow, played loud pop music, and attracted a young crowd. Stephens was selling factory-made clothes that still looked unique -- short runs of odd-coloured jeans, three-button jackets, and other men's fashion.\n\nSoon Carnaby Street became the hub for men's fashion in London, thanks largely to Stephens. At one point Stephens owned fifteen different shops, nine of them on Carnaby Street itself, and Stephens' shops appealed to the kind of people that the Kinks would satirise in their early 1966 hit single \"Dedicated Follower of Fashion\":\n\n[Excerpt: The Kinks, \"Dedicated Follower of Fashion\"]\n\nMany of those who visited Stephens' shops were the larger, second, generation of mods. I'm going to quote here from George Melly's Revolt Into Style, the first book to properly analyse British pop culture of the fifties and sixties, by someone who was there: \"As the ‘mod’ thing spread it lost its purity. For the next generation of Mods, those who picked up the ‘mod’ thing around 1963, clothes, while still their central preoccupation, weren’t enough. They needed music (Rhythm and Blues), transport (scooters) and drugs (pep pills). What’s more they needed fashion ready-made. They hadn’t the time or the fanaticism to invent their own styles, and this is where Carnaby Street came in.\"\n\nMelly goes on to talk about how these new Mods were viewed with distaste by the older Mods, who left the scene. The choice of music for these new Mods was as much due to geographic proximity as anything else. Carnaby Street is just round the corner from Wardour Street, and Wardour Street is where the two clubs that between them were the twin poles of the London R&B scenes, the Marquee and the Flamingo, were both located. So it made sense that the young people frequenting John Stephens' boutiques on Carnaby Street were the same people who made up the audiences -- and the bands -- at those clubs.\n\nBut by 1964, even these second-generation Mods were in a minority compared to a new, third generation, and here I'm going to quote Melly again:\n\n\"But the Carnaby Street Mods were not the final stage in the history of this particular movement. The word was taken over finally by a new and more violent sector, the urban working class at the gang-forming age, and this became quite sinister.\n\nThe gang stage rejected the wilder flights of Carnaby Street in favour of extreme sartorial neatness. Everything about them was neat, pretty and creepy: dark glasses, Nero hair-cuts, Chelsea boots, polo-necked sweaters worn under skinny V-necked pullovers, gleaming scooters and transistors. Even their offensive weapons were pretty—tiny hammers and screwdrivers. En masse they looked like a pack of weasels.\"\n\nI would urge anyone who's interested in British social history to read Melly's book in full -- it's well worth it.\n\nThese third-stage Mods soon made up the bulk of the movement, and they were the ones who, in summer 1964, got into the gang fights that were breathlessly reported in all the tabloid newspapers.\n\nPete Meaden was a Mod, and as far as I can tell he was a leading-edge second-stage Mod, though as with all these things who was in what generation of Mods is a bit blurry. Meaden had a whole idea of Mod-as-lifestyle and Mod-as-philosophy, which worked well with the group's R&B leanings, and with Townshend's art-school-inspired fascination with the aesthetics of Pop Art.\n\nMeaden got the group a residency at the Railway Hotel, a favourite Mod hangout, and he also changed their name -- The Who didn't sound Mod enough. In Mod circles at the time there was a hierarchy, with the coolest people, the Faces, at the top, below them a slightly larger group of people known as Numbers, and below them the mass of generic people known as Tickets. Meaden saw himself as the band's Svengali, so he was obviously the Face, so the group had to be Numbers -- so they became The High Numbers.\n\nMeaden got the group a one-off single deal, to record two songs he had allegedly written, both of which had lyrics geared specifically for the Mods. The A-side was \"Zoot Suit\":\n\n[Excerpt: The High Numbers, \"Zoot Suit\"]\n\nThis had a melody that was stolen wholesale from \"Misery\" by the Dynamics:\n\n[Excerpt: The Dynamics, \"Misery\"]\n\nThe B-side, meanwhile, was titled \"I'm the Face\":\n\n[Excerpt: The High Numbers, \"I'm the Face\"]\n\nWhich anyone with any interest at all in blues music will recognise immediately as being \"Got Love if You Want It\" by Slim Harpo:\n\n[Excerpt: Slim Harpo, \"Got Love if You Want it\"]\n\nUnfortunately for the High Numbers, that single didn't have much success. Mod was a local phenomenon, which never took off outside London and its suburbs, and so the songs didn't have much appeal in the rest of the country -- while within London, Mod fashions were moving so quickly that by the time the record came out, all its up-to-the-minute references were desperately outdated.\n\nBut while the record didn't have much success, the group were getting a big live following among the Mods, and their awareness of rapidly shifting trends in that subculture paid off for them in terms of stagecraft. To quote Townshend:\n\n\"What the Mods taught us was how to lead by following. I mean, you'd look at the dance floor and see some bloke stop during the dance of the week and for some reason feel like doing some silly sort of step. And you'd notice some of the blokes around him looking out of the corners of their eyes and thinking 'is this the latest?' And on their own, without acknowledging the first fellow, a few of 'em would start dancing that way. And we'd be watching. By the time they looked up on the stage again, we'd be doing that dance and they'd think the original guy had been imitating us. And next week they'd come back and look to us for dances\".\n\nAnd then Kit Lambert and Chris Stamp came into the Railway Hotel.\n\nKit Lambert was the son of Constant Lambert, the founding music director of the Royal Ballet, who the economist John Maynard Keynes described as the most brilliant man he'd ever met. Constant Lambert was possibly Britain's foremost composer of the pre-war era, and one of the first people from the serious music establishment to recognise the potential of jazz and blues music. His most famous composition, \"The Rio Grande\", written in 1927 about a fictitious South American river, is often compared with Gershwin's Rhapsody in Blue:\n\n[Excerpt: Constant Lambert, \"The Rio Grande\"]\n\nKit Lambert was thus brought up in an atmosphere of great privilege, both financially and intellectually, with his godfather being the composer Sir William Walton while his godmother was the prima ballerina Dame Margot Fonteyn, with whom his father was having an affair. As a result of the problems between his parents, Lambert spent much of his childhood living with his grandmother.\n\nAfter studying history at Oxford and doing his national service, Lambert had spent a few months studying film at the Institut des hautes études cinématographiques in Paris, where he went because Jean-Luc Godard and Alain Renais taught there -- or at least so he would later say, though there's no evidence I can find that Godard actually taught there, so either he went there under a mistaken impression or he lied about it later to make himself sound more interesting.\n\nHowever, he'd got bored with his studies after only a few months, and decided that he knew enough to just make a film himself, and he planned his first documentary. In early 1961, despite having little film experience, he joined two friends from university, Richard Mason and John Hemming, in an attempt to make a documentary film tracing the source of the Iriri, a river in South America that was at that point the longest unnavigated river in the world. Unfortunately, the expedition was as disastrous as it's possible for such an expedition to be.\n\nIn May 1961 they landed in the Amazon basin and headed off on their expedition to find the source of the Iriri, with the help of five local porters and three people sent along by the Brazillian government to map the new areas they were to discover. Unfortunately, by September, not only had they not found the source of the Iriri, they'd actually not managed to find the Iriri itself, four and a half months apparently not being a long enough time to find an eight-hundred-and-ten-mile-long river.\n\nAnd then Mason made his way into history in the worst possible way, by becoming the last, to date, British person to be murdered by an uncontacted indigenous tribe, the Panará, who shot him with eight poison arrows and then bludgeoned his skull.\n\nA little over a decade later the Panará made contact with the wider world after nearly being wiped out by disease. They remembered killing Mason and said that they'd been scared by the swishing noise his jeans had made, as they'd never encountered anyone who wore clothes before. Before they made contact, the Panará were also known as the Kreen-Akrore, a name given them by the Kayapó people, meaning \"round-cut head\", a reference to the way they styled their hair, brushed forward and trimmed over the forehead in a way that was remarkably similar to some of the Mod styles. Before they made contact, Paul McCartney would in 1970 record an instrumental, \"Kreen Akrore\", after being inspired by a documentary called The Tribe That Hides From Man. McCartney's instrumental includes sound effects, including McCartney firing a bow and arrow, though apparently the bow-string snapped during the recording:\n\n[Excerpt: Paul McCartney, \"Kreen Akrore\"]\n\nFor a while, Lambert was under suspicion for the murder, though the Daily Express, which had sponsored the expedition, persuaded Brazillian police to drop the charges. While he was in Rio waiting for the legal case to be sorted, Lambert developed what one book on the Who describes as \"a serious anal infection\".\n\nAstonishingly, this experience did not put Lambert off from the film industry, though he wouldn't try to make another film of his own for a couple of years. Instead, he went to work at Shepperton Studios, where he was an uncredited second AD on many films, including From Russia With Love and The L-Shaped Room. Another second AD working on many of the same films was Chris Stamp, the brother of the actor Terence Stamp, who was just starting out in his own career.\n\nStamp and Lambert became close friends, despite -- or because of -- their differences. Lambert was bisexual, and preferred men to women, Stamp was straight. Lambert was the godson of a knight and a dame, Stamp was a working-class East End Cockney. Lambert was a film-school dropout full of ideas and grand ambitions, but unsure how best to put those ideas into practice, Stamp was a practical, hands-on, man. The two complemented each other perfectly, and became flatmates and collaborators.\n\nAfter seeing A Hard Day's Night, they decided that they were going to make their own pop film -- a documentary, inspired by the French nouvelle vague school of cinema, which would chart a pop band from playing lowly clubs to being massive pop stars. Now all they needed was to find a band that were playing lowly clubs but could become massive stars. And they found that band at the Railway Hotel, when they saw the High Numbers.\n\nStamp and Lambert started making their film, and completed part of it, which can be found on YouTube:\n\n[Excerpt: The High Numbers, \"Oo Poo Pa Doo\"]\n\nThe surviving part of the film is actually very, very, well done for people who'd never directed a film before, and I have no doubt that if they'd completed the film, to be titled High Numbers, it would be regarded as one of the classic depictions of early-sixties London club life, to be classed along with The Small World of Sammy Lee and Expresso Bongo. What's even more astonishing, though, is how *modern* the group look.\n\nMost footage of guitar bands of this period looks very dated, not just in the fashions, but in everything -- the attitude of the performers, their body language, the way they hold their instruments. The best performances are still thrilling, but you can tell when they were filmed.\n\nOn the other hand, the High Numbers look ungainly and awkward, like the lads of no more than twenty that they are -- but in a way that was actually shocking to me when I first saw this footage. Because they look *exactly* like every guitar band I played on the same bill as during my own attempts at being in bands between 2000 and about 2005. If it weren't for the fact that they have such recognisable faces, if you'd told me this was footage of some band I played on the same bill with at the Star and Garter or Night and Day Cafe in 2003, I'd believe it unquestioningly.\n\nBut while Lambert and Stamp started out making a film, they soon pivoted and decided that they could go into management. Of course, the High Numbers did already have management -- Pete Meaden and Helmut Gorden -- but after consulting with the Beatles' lawyer, David Jacobs, Lambert and Stamp found out that Gorden's contract with the band was invalid, and so when Gorden got back from a holiday, he found himself usurped.\n\nMeaden was a bit more difficult to get rid of, even though he had less claim on the group than Gorden -- he was officially their publicist, not their manager, and his only deal was with Gorden, even though the group considered him their manager. While Meaden didn't have a contractual claim though, he did have one argument in his favour, which is that he had a large friend named Phil the Greek, who had a big knife. When this claim was put to Lambert and Stamp, they agreed that this was a very good point indeed, one that they hadn't considered, and agreed to pay Meaden off with two hundred and fifty pounds.\n\nThis would not be the last big expense that Stamp and Lambert would have as the managers of the Who, as the group were now renamed. Their agreement with the group had the two managers taking forty percent of the group's earnings, while the four band members would split the other sixty percent between themselves -- an arrangement which should theoretically have had the managers coming out ahead. But they also agreed to pay the group's expenses. And that was to prove very costly indeed.\n\nShortly after they started managing the group, at a gig at the Railway Hotel, which had low ceilings, Townshend lifted his guitar up a bit higher than he'd intended, and broke the headstock. Townshend had a spare guitar with him, so this was OK, and he also remembered Gustav Metzger and his ideas of auto-destructive art, and Malcolm Cecil sawing through his bass strings and damaging his bass, and decided that it was better for him to look like he'd meant to do that than to look like an idiot who'd accidentally broken his guitar, so he repeated the motion, smashing his guitar to bits, before carrying on the show with his spare.\n\nThe next week, the crowd were excited, expecting the same thing again, but Townshend hadn't brought a spare guitar with him. So as not to disappoint them, Keith Moon destroyed his drum kit instead.\n\nThis destruction was annoying to Entwistle, who saw musical instruments as something close to sacred, and it also annoyed the group's managers at first, because musical instruments are expensive. But they soon saw the value this brought to the band's shows, and reluctantly agreed to keep buying them new instruments.\n\nSo for the first couple of years, Lambert and Stamp lost money on the group. They funded this partly through Lambert's savings, partly through Stamp continuing to do film work, and partly from investors in their company, one of whom was Russ Conway, the easy-listening piano player who'd had hits like \"Side Saddle\":\n\n[Excerpt: Russ Conway, \"Side Saddle\"]\n\nConway's connections actually got the group another audition for a record label, Decca (although Conway himself recorded for EMI), but the group were turned down. The managers were told that they would have been signed, but they didn't have any original material.\n\nSo Pete Townshend was given the task of writing some original material. By this time Townshend's musical world was expanding far beyond the R&B that the group were performing on stage, and he talks in his autobiography about the music he was listening to while he was trying to write his early songs. There was \"Green Onions\", which he'd been listening to for years in his attempt to emulate Steve Cropper's guitar style, but there was also The Freewheelin' Bob Dylan, and two tracks he names in particular, \"Devil's Jump\" by John Lee Hooker:\n\n[Excerpt: John Lee Hooker, \"Devil's Jump\"]\n\nAnd \"Better Get Hit in Your Soul\" by Charles Mingus:\n\n[Excerpt: Charles Mingus, \"Better Get Hit In Your Soul\"]\n\nHe was also listening to what he described as \"a record that changed my life as a composer\", a recording of baroque music that included sections of Purcell's Gordian Knot Untied:\n\n[Excerpt: Purcell, Chaconne from Gordian Knot Untied]\n\nTownshend had a notebook in which he listed the records he wanted to obtain, and he reproduces that list in his autobiography -- \"‘Marvin Gaye, 1-2-3, Mingus Revisited, Stevie Wonder, Jimmy Smith Organ Grinder’s Swing, In Crowd, Nina in Concert [Nina Simone], Charlie Christian, Billie Holiday, Ella, Ray Charles, Thelonious Monk Around Midnight and Brilliant Corners.’\"\n\nHe was also listening to a lot of Stockhausen and Charlie Parker, and to the Everly Brothers -- who by this point were almost the only artist that all four members of the Who agreed were any good, because Daltrey was now fully committed to the R&B music he'd originally dismissed, and disliked what he thought was the pretentiousness of the music Townshend was listening to, while Keith Moon was primarily a fan of the Beach Boys. But everyone could agree that the Everlys, with their sensitive interpretations, exquisite harmonies, and Bo Diddley-inflected guitars, were great, and so the group added several songs from the Everlys' 1965 albums Rock N Soul and Beat N Soul to their set, like \"Man With Money\":\n\n[Excerpt: The Everly Brothers, \"Man With Money\"]\n\nDespite Daltrey's objections to diluting the purity of the group's R&B sound, Townshend brought all these influences into his songwriting. The first song he wrote to see release was not actually recorded by the Who, but a song he co-wrote for a minor beat group called the Naturals, who released it as a B-side:\n\n[Excerpt: The Naturals, \"It Was You\"]\n\nBut shortly after this, the group got their first big break, thanks to Lambert's personal assistant, Anya Butler. Butler was friends with Shel Talmy's wife, and got Talmy to listen to the group. Townshend in particular was eager to work with Talmy, as he was a big fan of the Kinks, who were just becoming big, and who Talmy produced.\n\nTalmy signed the group to a production deal, and then signed a deal to license their records to Decca in America -- which Lambert and Stamp didn't realise wasn't the same label as British Decca. Decca in turn sublicensed the group's recordings to their British subsidiary Brunswick, which meant that the group got a minuscule royalty for sales in Britain, as their recordings were being sold through three corporate layers all taking their cut.\n\nThis didn't matter to them at first, though, and they went into the studio excited to cut their first record as The Who. As was typical at the time, Talmy brought in a few session players to help out. Clem Cattini turned out not to be needed, and left quickly, but Jimmy Page stuck around -- not to play on the A-side, which Townshend said was \"so simple even I could play it\", but the B-side, a version of the old blues standard \"Bald-Headed Woman\", which Talmy had copyrighted in his own name and had already had the Kinks record:\n\n[Excerpt: The Who, \"Bald-Headed Woman\"]\n\nApparently the only reason that Page played on that is that Page wouldn't let Townshend use his fuzzbox.\n\nAs well as Page and Cattini, Talmy also brought in some backing vocalists. These were the Ivy League, a writing and production collective consisting at this point of John Carter and Ken Lewis, both of whom had previously been in a band with Page, and Perry Ford. The Ivy League were huge hit-makers in the mid-sixties, though most people don't recognise their name. Carter and Lewis had just written \"Can You Hear My Heartbeat\" for Herman's Hermits:\n\n[Excerpt: Herman's Hermits, \"Can You Hear My Heartbeat?\"]\n\nAnd, along with a couple of other singers who joined the group, the Ivy League would go on to sing backing vocals on hits by Sandie Shaw, Tom Jones and others. Together and separately the members of the Ivy League were also responsible for writing, producing, and singing on \"Let's Go to San Francisco\" by the Flowerpot Men, \"Winchester Cathedral\" by the New Vaudeville Band, \"Beach Baby\" by First Class, and more, as well as their big hit under their own name, \"Tossing and Turning\":\n\n[Excerpt: The Ivy League, \"Tossing and Turning\"]\n\nThough my favourite of their tracks is their baroque pop masterpiece \"My World Fell Down\":\n\n[Excerpt: The Ivy League, \"My World Fell Down\"]\n\nAs you can tell, the Ivy League were masters of the Beach Boys sound that Moon, and to a lesser extent Townshend, loved. That backing vocal sound was combined with a hard-driving riff inspired by the Kinks' early hits like \"You Really Got Me\" and \"All Day and All of the Night\", and with lyrics that explored inarticulacy, a major theme of Townshend's lyrics:\n\n[Excerpt: The Who, \"I Can't Explain\"]\n\n\"I Can't Explain\" made the top ten, thanks in part to a publicity stunt that Lambert came up with. The group had been booked on to Ready, Steady, Go!, and the floor manager of the show mentioned to Lambert that they were having difficulty getting an audience for that week's show -- they were short about a hundred and fifty people, and they needed young, energetic, dancers. Lambert suggested that the best place to find young, energetic, dancers, was at the Marquee on a Tuesday night -- which just happened to be the night of the Who's regular residency at the club. Come the day of filming, the Ready, Steady, Go! audience was full of the Who's most hardcore fans, all of whom had been told by Lambert to throw scarves at the band when they started playing. It was one of the most memorable performances on the show.\n\nBut even though the record was a big hit, Daltrey was unhappy. The man who'd started out as guitarist in a Shadows cover band and who'd strenuously objected to the group's inclusion of R&B material now had the zeal of a convert. He didn't want to be doing this \"soft commercial pop\", or Townshend's art-school nonsense. He wanted to be an R&B singer, playing hard music for working-class men like him.\n\nTwo decisions were taken to mollify the lead singer. The first was that when they went into the studio to record their first album, it was all soul and R&B apart from one original. The album was going to consist of three James Brown covers, three Motown covers, Bo Diddley's \"I'm a Man\", and a cover of Paul Revere and the Raiders' \"Louie Louie\" sequel \"Louie Come Home\", retitled \"Lubie\". All of this was material that Daltrey was very comfortable with.\n\nAlso, Daltrey was given some input into the second single, which would be the only song credited to Daltrey and Townshend, and Daltrey's only songwriting contribution to a Who A-side.\n\nTownshend had come up with the title \"Anyway, Anyhow, Anywhere\" while listening to Charlie Parker, and had written the song based on that title, but Daltrey was allowed to rewrite the lyrics and make suggestions as to the arrangement. That record also made the top ten:\n\n[Excerpt: The Who, \"Anyway, Anyhow, Anywhere\"]\n\nBut Daltrey would soon become even more disillusioned. The album they'd recorded was shelved, though some tracks were later used for what became the My Generation album, and Kit Lambert told the Melody Maker “The Who are having serious doubts about the state of R&B. Now the LP material will consist of hard pop. They’ve finished with ‘Smokestack Lightning’!”\n\nThat wasn't the only thing they were finished with -- Townshend and Moon were tired of their band's leader, and also just didn't think he was a particularly good singer -- and weren't shy about saying so, even to the press. Entwistle, a natural peacemaker, didn't feel as strongly, but there was a definite split forming in the band.\n\nThings came to a head on a European tour. Daltrey was sick of this pop nonsense, he was sick of the arty ideas of Townshend, and he was also sick of the other members' drug use. Daltrey didn't indulge himself, but the other band members had been using drugs long before they became successful, and they were all using uppers, which offended Daltrey greatly. He flushed Keith Moon's pill stash down the toilet, and screamed at his band mates that they were a bunch of junkies, then physically attacked Moon.\n\nAll three of the other band members agreed -- Daltrey was out of the band. They were going to continue as a trio.\n\nBut after a couple of days, Daltrey was back in the group. This was mostly because Daltrey had come crawling back to them, apologising -- he was in a very bad place at the time, having left his wife and kid, and was actually living in the back of the group's tour van. But it was also because Lambert and Stamp persuaded the group they needed Daltrey, at least for the moment, because he'd sung lead on their latest single, and that single was starting to rise up the charts.\n\n\"My Generation\" had had a long and torturous journey from conception to realisation. Musically it originally had been inspired by Mose Allison's \"Young Man's Blues\":\n\n[Excerpt: Mose Allison, \"Young Man's Blues\"]\n\nTownshend had taken that musical mood and tied it to a lyric that was inspired by a trilogy of TV plays, The Generations, by the socialist playwright David Mercer, whose plays were mostly about family disagreements that involved politics and class, as in the case of the first of those plays, where two upwardly-mobile young brothers of very different political views go back to visit their working-class family when their mother is on her deathbed, and are confronted by the differences they have with each other, and with the uneducated father who sacrificed to give them a better life than he had:\n\n[Excerpt: Where the Difference Begins]\n\nTownshend's original demo for the song was very much in the style of Mose Allison, as the excerpt of it that's been made available on various deluxe reissues of the album shows:\n\n[Excerpt: Pete Townshend, \"My Generation (demo)\"]\n\nBut Lambert had not been hugely impressed by that demo. Stamp had suggested that Townshend try a heavier guitar riff, which he did, and then Lambert had added the further suggestion that the music would be improved by a few key changes -- Townshend was at first unsure about this, because he already thought he was a bit too influenced by the Kinks, and he regarded Ray Davies as, in his words, \"the master of modulation\", but eventually he agreed, and decided that the key changes did improve the song.\n\nStamp made one final suggestion after hearing the next demo version of the song. A while earlier, the Who had been one of the many British groups, like the Yardbirds and the Animals, who had backed Sonny Boy Williamson II on his UK tour. Williamson had occasionally done a little bit of a stutter in some of his performances, and Daltrey had picked up on that and started doing it. Townshend had in turn imitated Daltrey's mannerism a couple of times on the demo, and Stamp thought that was something that could be accentuated.\n\nTownshend agreed, and reworked the song, inspired by John Lee Hooker's \"Stuttering Blues\":\n\n[Excerpt: John Lee Hooker, \"Stuttering Blues\"]\n\nThe stuttering made all the difference, and it worked on three levels. It reinforced the themes of inarticulacy that run throughout the Who's early work -- their first single, after all, had been called \"I Can't Explain\", and Townshend talks movingly in his autobiography about talking to teenage fans who felt that \"I Can't Explain\" had said for them the things they couldn't say themselves -- and how they even found it difficult to say *that* themselves.  Here is a character who is trying to be a spokesman for his generation, but he is literally unable to force the words out.\n\nIt was also a shoutout to the Mod audience, more subtle than the obvious references on things like \"I'm the Face\". The Mod drug of choice was speed, and one common effect of amphetamine use is that users tend to stutter when on high doses -- amphetamines raise dopamine levels in the brain to such an extent that the basal ganglia-thalamocortical motor circuits of the brain are thrown off, leading to a similar inability to control the muscles used in speech as one gets in Parkinson's disease, for similar underlying reasons, even as the sped-up thought processes caused by amphetamines make it seem that much more urgent to get the words out. By having the protagonist of the song stutter, Townshend was telling the group's Mod listeners \"this character is on the same drugs as you\", without doing anything so crude as just flat-out saying that.\n\nAnd finally, the stutter also allowed Townshend to hint at things he wouldn't be allowed to say on the radio. Every teenage listener knew what \"Why don't you all f-f-f-...\" was leading up to, and could dig what he was saying, even if the eventual words that came out were more broadcastable:\n\n[Excerpt: The Who, \"My Generation\"]\n\nThere were two other aspects of the record that were unlike anything else that was on the pop charts at the time. The first was the bass solo, which was not, as some have claimed, the first bass solo on record -- even leaving aside jazz and only looking at hit singles, Grady Martin had played a Danelectro fuzz solo a full five years earlier on Marty Robbins' top five US chart hit \"Don't Worry\":\n\n[Excerpt: Marty Robbins, \"Don't Worry\"]\n\nBut it was one of the most prominent bass solos on a rock single, and one of the first times that the bass had really seemed like a lead instrument on a rock and roll record.\n\nEntwistle's solo was meant to be recorded on a Danelectro, but there was a problem. Danelectros had thinner strings than a normal bass, and Entwistle was a very heavy-handed player. Often one can use the same bass strings for years without breaking a string, but the combination of the thinner strings and Entwistle's playing meant that he broke strings when playing the solo.\n\nThe problem was that because the Danelectro didn't use the same strings as other instruments, because it wasn't normal for people to break bass strings very often, and because it was an extremely rare instrument in the UK at the time, you couldn't buy those strings separately -- the only way you could get new strings for a Danelectro was to buy a whole new instrument. After the third time Entwistle broke a Danelectro string, and now owning three Danelectros he couldn't play because of broken strings, he decided to play it on a Fender Jazz bass instead, and that's what's used on the finished record:\n\n[Excerpt: The Who, \"My Generation\"]\n\nAnd after all these innovations, the band saved the most astonishing thing for last, ending the song in a cacophony of feedback and drums, which was the kind of thing that several acts had been doing live, but which had not made it to a pop single at this point:\n\n[Excerpt: The Who, \"My Generation\"]\n\nThe record became the group's biggest hit to that point, reaching number two on the UK charts (kept off the top by \"The Carnival is Over\" by the Seekers), though it only made number seventy-five in the US. And as Daltrey was the lead singer on the record, it was decided that they'd better let him stay in the group. But the dynamic of the band had changed forever. The band that had been led by Roger Daltrey were now, for better or for worse, Pete Townshend's band.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and thirty-six of A History of Rock Music in Five Hundred Songs is a special long episode, running almost ninety minutes, looking at \"My Generation\" by the Who. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"The Name Game\" by Shirley Ellis.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\nI mispronounce the Herman's Hermits track \"Can't You Hear My Heartbeat\" as \"Can You Hear My Heartbeat\".\nI say \"Rebel Without a Cause\" when I mean \"The Wild One\". Brando was not in \"Rebel Without a Cause\".\nResources\n\nAs usual, I’ve created a Mixcloud playlist of the music excerpted here. This mix does not include the Dixon of Dock Green theme, as I was unable to find a full version of that theme anywhere (though a version with Jack Warner singing, titled \"An Ordinary Copper\" is often labelled as it) and what you hear in this episode is the only fragment I could get a clean copy of.\n\nThe best compilation of the Who's music is Maximum A's & B's, a three-disc set containing the A and B sides of every single they released.\n\nThe super-deluxe five-CD version of the My Generation album appears to be out of print as a CD, but can be purchased digitally.\n\nI referred to a lot of books for this episode, including:\n\nGenerations: The History of America's Future, 1584 to 2069 by William Strauss and Neil Howe, which I don't necessarily recommend reading, but which is certainly an influential book.\n\nRevolt Into Style: The Pop Arts by George Melly which I *do* recommend reading if you have any interest at all in British pop culture of the fifties and sixties.\n\nJim Marshall: The Father of Loud by Rich Maloof gave me all the biographical details about Marshall.\n\nThe Who Before the Who by Doug Sandom, a rather thin book of reminiscences by the group's first drummer.\n\nThe Ox by Paul Rees, an authorised biography of John Entwistle based on notes for his never-completed autobiography.\n\nWho I Am, the autobiography of Pete Townshend, is one of the better rock autobiographies.\n\nA Band With Built-In Hate by Peter Stanfield is an examination of the group in the context of pop-art and Mod.\n\nAnd Anyway, Anyhow, Anywhere by Andy Neill and Matt Kent is a day-by-day listing of the group's activities up to 1978.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nIn 1991, William Strauss and Neil Howe wrote a book called Generations: The History of America's Future, 1584 to 2069. That book was predicated on a simple idea -- that there are patterns in American history, and that those patterns can be predicted in their rough outline. Not in the fine details, but broadly -- those of you currently watching the TV series Foundation, or familiar with Isaac Asimov's original novels, will have the idea already, because Strauss and Howe claimed to have invented a formula which worked as well as Asimov's fictional Psychohistory.\n\nTheir claim was that, broadly speaking, generations can be thought to have a dominant personality type, influenced by the events that took place while they were growing up, which in turn are influenced by the personality types of the older generations. Because of this, Strauss and Howe claimed, American society had settled into a semi-stable pattern, where events repeat on a roughly eighty-eight-year cycle, driven by the behaviours of different personality types at different stages of their lives. You have four types of generation, which cycle -- the Adaptive, Idealist, Reactive, and Civic types. At any given time, one of these will be the elder statespeople, one will be the middle-aged people in positions of power, one will be the young rising people doing most of the ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and thirty-six of A History of Rock Music in Five Hundred Songs is a special long episode, running almost ninety minutes, looking at \"My Generation\" by the Who. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a fifteen-minute bonus episode available, on \"The Name Game\" by Shirley Ellis.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nErrata\nI mispronounce the Herman's Hermits track \"Can't You Hear My Heartbeat\" as \"Can You Hear My Heartbeat\".\nI say \"Rebel Without a Cause\" when I mean \"The Wild One\". Brando was not in \"Rebel Without a Cause\".\nResources\n\nAs usual, I’ve created a Mixcloud playlist of the music excerpted here. This mix does not include the Dixon of Dock Green theme, as I was unable to find a full vers",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}