{
  "title": "The Empirical Case for School Choice with Corey A. DeAngelis",
  "pubDate": "Mon, 20 Aug 2018 18:16:14 +0000",
  "guid": "7545585066de44a7890040da8c386357",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP104DeAngelis_EDR.mp3",
  "itunes:image": "",
  "description": "<p><a href=\"https://www.cato.org/people/corey-deangelis\" target= \"_blank\" rel=\"noopener\">Corey A. DeAngelis</a> of the Cato Institute joins the podcast to discuss <a href= \"https://www.cato.org/publications/policy-analysis/public-schooling-public-good-analysis-schooling-externalities\" target=\"_blank\" rel=\"noopener\">his review</a> of the school choice research.</p> <blockquote>Is public schooling a public good, a merit good, or a demerit good? Public schooling fails both conditions specified in the standard economic definition of a public good. In order to place public schooling into one of the remaining two categories, I first assess all of the theoretical positive and negative externalities resulting from public schooling as opposed to publicly financed universal school vouchers. Then, in an original contribution to the literature, I quantify the magnitude and sign of the net externality of government schooling in the United States using the preponderance of the most rigorous scientific evidence.</blockquote> <p>We discuss this paper in addition to <a href= \"https://www.cato.org/blog/we-shouldnt-need-use-science-grant-educational-freedom\" target=\"_blank\" rel=\"noopener\">a recent blog post</a> Corey wrote entitled \"We Shouldn’t Need to Use Science to Grant Educational Freedom.\" Corey argues that we should have a strong presumption in favour of letting families choose where their kids go to school. In the academic debate on school choice, people adopt an implicit balance of evidence standard for supporting or opposing school choice. But it makes more sense to place the burden of evidence on those who seek to limit others' choices.</p> <hr /> <p> </p>",
  "content:encoded": "<p><a href=\"https://www.cato.org/people/corey-deangelis\" target= \"_blank\" rel=\"noopener\">Corey A. DeAngelis</a> of the Cato Institute joins the podcast to discuss <a href= \"https://www.cato.org/publications/policy-analysis/public-schooling-public-good-analysis-schooling-externalities\" target=\"_blank\" rel=\"noopener\">his review</a> of the school choice research.</p> Is public schooling a public good, a merit good, or a demerit good? Public schooling fails both conditions specified in the standard economic definition of a public good. In order to place public schooling into one of the remaining two categories, I first assess all of the theoretical positive and negative externalities resulting from public schooling as opposed to publicly financed universal school vouchers. Then, in an original contribution to the literature, I quantify the magnitude and sign of the net externality of government schooling in the United States using the preponderance of the most rigorous scientific evidence. <p>We discuss this paper in addition to <a href= \"https://www.cato.org/blog/we-shouldnt-need-use-science-grant-educational-freedom\" target=\"_blank\" rel=\"noopener\">a recent blog post</a> Corey wrote entitled \"We Shouldn’t Need to Use Science to Grant Educational Freedom.\" Corey argues that we should have a strong presumption in favour of letting families choose where their kids go to school. In the academic debate on school choice, people adopt an implicit balance of evidence standard for supporting or opposing school choice. But it makes more sense to place the burden of evidence on those who seek to limit others' choices.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "58:47",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "of the Cato Institute joins the podcast to discuss  of the school choice research. Is public schooling a public good, a merit good, or a demerit good? Public schooling fails both conditions specified in the standard economic definition of a public...",
  "itunes:episode": 104,
  "itunes:episodeType": "full"
}