{
  "title": "ZBT #302: Conversation On Veteran Suicide, Guns, And Why 22 Pushup Challenges Are Worthless",
  "description": "<p>Bit of a longer episode, but we promise you'll love it or your money back.\n\nTake advantage of some sponsors!\n-Barkbox.com/ZBT for a free dog toy each time you get a package\n-Invets.org/Zero create a free career profile and get a free shirt!!!\n\nRound 1: Magawa, our friend who happens to be a rat from Tanzania, is finally given an award for his heroics. You’re not gonna believe what this African giant poached rat has accomplished. \n\nRound 2: It’s an ammunition backpack, Micheal. What could it weigh? 20lbs? The Navy is rolling out a backpack that can carry a mollywhooping 650 rounds of 7.62 ammo. Wowzers. \n\nRound 3: Man-baby admits that he goes to the doctor all the time. He’s what we in the military would call a sick-call warrior. It’s time to make fun of a weenie. Sorry, Kate. \n\nRound 4: The Marine Corps is considering shutting down both of its Recruit Depots so that they can train co-ed. Shhhh… If you listen closely… you can hear angry goateed and bearded veterans grabbing their keys in order to film an angry rant in their trucks. \n\nRound 5: Kate’s interviews Chris Marvin, former helo pilot \nWhy 22 Pushups Don't Help: The Role of Guns in Veteran Suicide - Veterans for Gun Sense 2020\n\nRound 6: There’s certain people who have a lifetime of stories that youd love to listen to while drinking a hot tea and sugar cookies. Lillian Brown is one of those people. She was the makeup artist for NINE US Presidents..</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "1b1e3ae8-4fd9-4e86-bf17-bc1089345019",
  "pubDate": "Tue, 29 Sep 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "02:02:34",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}