{
  "title": "Five new Manhattans",
  "description": "\n<p><a href=\"https://twitter.com/mnolangray/status/1587674919638159360?cn=ZmxleGlibGVfcmVjcw%3D%3D&refsrc=email\"><span style=\"color: #0000ff;\"><strong>This tweet</strong></span></a> caught my eye:</p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-62165\" src=\"https://www.econlib.org/wp-content/uploads/2022/11/Screen-Shot-2022-11-02-at-2.18.03-PM-e1667416464541.png\" alt=\"\" width=\"730\" height=\"500\" /></p>\n<p>I prefer the glass half full (or more precisely one fourth full) interpretation.  Especially if the glass is very large.  And LA is an exceedingly large glass, comprising 502 square miles of land.  That means there is roughly 125 square miles of non-residentially zoned land, more than five times larger than Manhattan (which is 23 square miles.) Even though I&#8217;d prefer no zoning at all, I&#8217;m actually quite pleased to hear both candidates support much more housing in non-residential portions of LA.</p>\n<p>Residential zoning is a huge problem, but it&#8217;s far from the only problem when it comes to housing construction in California.  Almost as important is the excessively restrictive regulations on building new housing <em>anywhere</em> in the city, which make new housing construction much more expensive than it would be in a free market, or even in a less tightly regulated market like Chicago.</p>\n<p>Consider the following two facts:</p>\n<p>1. In recent years, California has been experiencing a net out-migration of residents.</p>\n<p>2. Most of California is run by progressive governments with highly dysfunctional policies in areas such as taxes, business regulation, crime and education.</p>\n<p>You might assume that those facts are closely related.  In fact, almost the entire <strong><em>net</em></strong> population outflow is due to bad housing policies.  If California simply deregulated housing, its population might grow almost as fast as in Texas and Florida.  Given the extremely high prices here, the construction of new housing would be enormously profitable if not constrained by regulation.</p>\n<p>I live in Orange County, one of the few places in California that is not poorly governed.  It also has a nice climate.  And yet the county is now actually losing population.  Irvine is the only Orange County community that is still growing rapidly.  That&#8217;s not because it&#8217;s better governed than the other OC cities, rather it is one of the few that still allows substantial home building.  </p>\n<p>Republicans like to criticize the ineffective progressive governance in most of this state.  And yet, even if all of the problems they correctly cite were fixed&#8212;if California were to become as business friendly as Texas and Florida&#8212;it would do little to stem the outflow of population from coastal California (although it would help the Central Valley.)  Unfortunately, some Republicans refuse to embrace the deregulation of housing, and at the national level the GOP is gradually shifting in a NIMBY direction.</p>\n(13 COMMENTS)",
  "link": "https://www.econlib.org/five-new-manhattans/",
  "guid": "https://www.econlib.org/five-new-manhattans/",
  "category": [
    "Economic Growth",
    "Regulation",
    "Supply-side Economics",
    "California",
    "NIMBY",
    "progressives",
    "residential zoning"
  ],
  "pubDate": "Wed, 02 Nov 2022 23:50:03 +0000"
}