{
  "title": "Thoughts on “Things Hidden Since the Foundation of the World”",
  "link": "https://awjuliani.medium.com/thoughts-on-things-hidden-since-the-foundation-of-the-world-51855f479b5f?source=rss-18dfe63fa7f0------2",
  "guid": "https://medium.com/p/51855f479b5f",
  "category": [
    "anthropology",
    "philosophy",
    "psychology",
    "literature-review",
    "religion"
  ],
  "dc:creator": "Arthur Juliani",
  "pubDate": "Tue, 06 Apr 2021 00:12:34 GMT",
  "atom:updated": "2021-04-12T16:28:17.285Z",
  "content:encoded": "<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*v9VLGB8X2PKCtoy-OJILIw.jpeg\" /></figure><p>When I shared my thoughts on the book <em>Sapiens</em> by Yuval Noah Harari, I expressed the hope that the book would present a sweeping and all-encompassing theory of human culture. Despite being compelling in its own right, it largely failed to live up to such an expectation. On the other hand, <a href=\"https://en.wikipedia.org/wiki/Things_Hidden_Since_the_Foundation_of_the_World\"><em>Things Hidden Since the Foundation of the World</em></a> written in 1978 by Rene Girard (hereafter referred to as <em>Things Hidden</em>), more than delivers on the same promise. In this work, Girard, a philosopher and historian, presents a remarkably simple hypothesis which he claims can account for large swaths of findings in anthropology, theology, psychology, and literature. His theory proposes that imitation (referred to in the book as mimesis, a word with its own long history in philosophy) is the driving force behind the dynamics of all of human culture. The audacity of such a proposal alone had me hooked.</p><p>An expansion on that basic thesis goes something like this. Girard acknowledges that our capacity for imitation is not wholly unique, and rather is part of a continuity of abilities shared with other animals. Nonetheless, he suggests that we humans imitate to a degree at which something special begins to happen. Unlike other animals, our capacity for imitation is strong enough to enable rapid learning of skills and knowledge, which can be handed down across generations, thus making possible the development of lasting cultures. According to Girard, this capacity also leads inevitably to increased conflict and violence, which must be managed collectively. It is the dual implications of imitation through which Girard unlocks the genesis and development of our cultural institutions. For Girard, the first and primary cultural institution is that of religion, which he suggests exists to provide prohibitions on certain behaviors which would aggravate the human tendency toward violence, as well as to provide a mechanism by which the violent escalation caused by mimesis can be negated: the expulsion of a sacrificial victim in the form of the scapegoat.</p><p><em>Things Hidden</em> as a book is the result of a series of conversations that Girard had with two psychoanalysts, Jean-Michel Oughourlian and Guy Lefort, over the course of a number of days. This produced a work which is surprisingly easy to read and even entertaining at points, due to its conversational nature. It also starkly contrasts with the works by many of Girard’s French contemporaries at the time, who can be poetic at best and impenetrable at worst. The two other voices serve as interviewers, acolytes, and occasionally critics, both asking questions and providing relevant commentary throughout the work. At certain points it even struck me that the two interviewers had fit themselves into the classic good-cop/bad-cop dynamic, where one would speak in praising terms of Girard’s theories, and the other would bring up relevant criticism in sequence. The effect produced by this choice of structure allowed me to appreciate many of the nuances of the argument that I would have easily missed if the work was simply presented from a univocal perspective. Girard’s disdain for the obfuscative writing of his contemporaries is also quite apparent, and his general desire for clarity and comprehension comes through both in his discussion of his theories and within the internal logic of the theories themselves.</p><p>As I mentioned above, the core of Girard’s thesis is that a whole host of complex human behavior and cultural institutions can be made sense of simply by thinking through the implications of what he calls the mimetic process. As someone with a background in psychology, what came to my mind at the mention of this mimetic process was the now-famous <a href=\"https://en.wikipedia.org/wiki/Mirror_neuron\">mirror neurons</a>. This class of neurons were first discovered in monkeys, when experiments demonstrated that certain motor neurons in the monkey’s cortex would activate both when the animal performed a task and when the animal observed a human perform the task. These cells were given the name mirror neurons, as they seemed to be mirrorining what they observed. Importantly, it was shown that populations of neurons could activate both when they were directly involved in a task as well as when a task was being imagined or even observed. Since the initial discovery of motor neurons with this mirroring property, many other brain regions have been found which contain similar mirror neurons. One group which has gotten particular attention have been those involved in affective processing, which have been hypothesized to provide the basis for empathy.</p><p>We can interpret these neurons as providing the basis for Girard’s notion of mimetic desire. When we see someone perform an action, regardless of how inherently desirable that action might have been to us beforehand, a part of us now wants to carry out that action ourselves. It is easy to see how this kind of desire can enable the spread of useful cultural skills and knowledge. Violence and conflict first come into the picture when two individual’s desire to carry out the same action becomes incompatible. Imagine a scenario where a person sees his neighbor picking and eating an apple from the tree. The observer of this scenario might now want to pick and eat an apple from that tree themselves. But, let’s imagine that there is now only a single apple left. If two people both want to eat the last apple, a conflict arises. If one of these neighbors commits an act of violence in order to ensure that they have exclusive access to the apple, then a third party might witness the violence, and then seek to avenge the attacked individual. In this way the mimetic conflict becomes a kind of contagion which spreads throughout a community, and the original source of the conflict becomes long since forgotten. Indeed, history is filled with countless examples of such bloody rivalries between groups extending for generations and generations, with the original offense lost to time. In this way, what serves as the mechanism by which learning can take place also serves as the mechanism by which humans enter into such violent struggle. According to Girard these two phenomena are coextensive with one another.</p><p>All of what I have described above is largely described in the first of three sections of the <em>Things Hidden</em>. The second part focuses on a textual analysis of the Christian Bible, while the third presents a discussion of psychoanalytic theory in the context of mimesis. All three are quite striking, even if I found myself somewhat incredulous in the face of the increasingly sweeping theories presented. The central thesis of the second part of the book is that the Christian Gospels present a radically anti-sacrifice and anti-violence message, in more or less contrast to all religious systems beforehand which were explicitly based on the violent sacrifice. It seems that this special place Girard affords Christianity largely ignores the particulars of eastern religions such as Buddhism, which could just as well be presented as embodying a similar radical departure from the primitive role of the religion which Girard describes in the first section of the book. It is perhaps also the case that the specifically Catholic experience of living in France in the 20th century greatly colors his thinking here. I am also sure that contemporary scholarship would likely point out that there were many ancient cultures not based around ritual sacrifice, and thus don’t so easily fit the mould he describes here.</p><p>The third section serves as an extensive critique of Freudian concepts of Narcissism and the Oedipal complex. Here Girard applies his mimetic theory to deconstructing these concepts by showing that they can all be more simply and completely accounted for using his mimetic theory. Narcissism, for example, is presented not as an extreme love of oneself, but rather as a dynamic whereby one plays at loving oneself in order to provide a mimetic model for others to love one in return. He also includes a long discussion on why Marcel Proust has a more acute understanding of human psychology than Freud. My personal bias is to favor Proust as well, though for readers less interested in literature, this section could be a bit of a slog. This is especially true because by this point in the book, Girard’s approach is more than clear, and the application of mimesis to nearly any problem of human behavior begins to look a bit like a hammer in perpetual search for the nail. Still, it is impressive the extent to which Girard is able to fashion so many aspects of human psychology into just such nails.</p><p><em>Things Hidden Since the Foundation of the World</em> was written over forty years ago by a man clearly steeped in philosophical and literary, rather than scientific, traditions. As such, it is difficult to take what is presented in the book as a scientific theory, especially in light of all we now know about human psychology, anthropology, and neuroscience that he didn’t. That being said, I found myself imagining how to bring Girard’s theories to bear on more modern phenomena than anything he could have known in the 1970s: the internet and social media. In his book, Girard speaks a lot about mimetic models, which provide the example by which mimetic desire can become attached. Social media does not simply present a handful of mimetic models to an individual, as one might have found at some earlier point in human culture, but instead provides a countless number of such models, all of whom are also reacting and desiring in ways which are the product of the desires and actions of others.</p><p>Girard’s theory of mimetic desire actually gives us a way to think about this process, not because it is complex, but rather because it is simple. The reason that a theory like that of mimetic desire can ostensibly account for the complex phenomena that it does is because it relies on the emergent properties of dynamical systems. While he does not use these terms, Girard presents a theory which relies on exactly the same kind of mechanism that govern <a href=\"https://en.wikipedia.org/wiki/Conway's_Game_of_Life\">Conway’s Game of Life</a>, or any emergent system. A few simple rules describing atomic interactions over time produce complex emergent behavior and structure which could not have been predicted from the outset. Mimesis is in effect one such rule: humans will desire to do to do what they see others doing. Social media exists as this process playing itself out on a rapid time scale and with a large and highly connected number of individuals. One could even imagine a researcher running simulations of mimetic desire in such complex networks of individuals, and watching the results play out similarly to how they do in reality.</p><p>Throughout my time reading the book, I also found myself reflecting on the ways in which Girard’s mimetic desire principle operates within my own life and relationship with social media. Like many, I spend a certain amount of time each day on social media, reading about the actions and accomplishments of my peers. In light of Girard’s theory, I have found myself wondering the extent to which my own desires may not so much be the result of inner drives, as much as the result of the mimetic process at work. Indeed, every individual I follow online or post I see serves as a potential mimetic model to follow. Whether or not I do end up following (or desiring to follow) that model is the result of both conscious and unconscious processes and interactions. I found myself contemplating a thought experiment: if I had been exposed to different mimetic models only years earlier, how different might my interests be at this very moment? It is of course an impossible question to answer, but one that feels worthwhile reflecting on. Especially because I do believe that there is such a thing as internal drives which are not simply the result of mimesis, it is all the more important to attempt to sift through which are which.</p><p>As far as I know, the theories which Girard developed and presented in this book have largely fallen out of favor, or else been taken up under very different, more scientific framings by those who followed. In one sense, his theory and work might be seen as a kind of dead-end, or literary curiosity. A work of philosophy which aspires to being a new science of behavior, but doesn’t quite reach that mark. Still, I have found myself coming back to mimetic desire, and thinking about the social world around me in what feels like new and exciting ways the past few weeks. As far as I am concerned, that counts as a success for Rene Girard and his work.</p><p><em>(04/12/2021) Postscript: After publishing this essay, I learned about the role that venture capitalist </em><a href=\"https://en.wikipedia.org/wiki/Peter_Thiel\"><em>Peter Thiel</em></a><em> has played in promoting Girard’s ideas in Silicon Valley and beyond. Thiel was a student of Girard’s at Stanford in the 1980s, and his understanding of Girard’s theory of mimetic desire apparently helped to influence his decision to become an early investor in Facebook. Since then, he has regularly recommended reading Girard’s work, and “Things Hidden” in particular. For another perspective on Girard, which goes deeper into his influence on Thiel, see </em><a href=\"https://justinehsmith.substack.com/p/who-is-ren-girard\"><em>this somewhat more critical article</em></a><em>. I am personally not a fan of Peter Thiel’s philosophy or politics, and am reminded of the ways in which theories meant to be descriptive of social behavior, such as “mimetic desire,” can unfortunately all too often be manipulated to be used as active tools of social engineering and exploitation.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=51855f479b5f\" width=\"1\" height=\"1\" alt=\"\">"
}