{
  "title": "Episode 130 (video): Why Are We So Fascinated by Famous People?",
  "pubDate": "Mon, 23 Aug 2010 01:17:29 +0000",
  "guid": "episode-130-video-why-are-we-so-fascinated-by-f",
  "link": "http://www.thepsychfiles.com/2010/08/episode-130-video-why-are-we-so-fascinated-by-famous-people/",
  "itunes:image": "",
  "description": "If you've ever met a famous person you know how exciting that feels.  But why?  What is it about fame that draws so many people to it?  In this episode I examine fame from two very perspectives: the Basking in Reflected Glory theory and Terror Management Theory.  Along the way we'll see what this all has to do with the rock band Queen, baseball and Chelsea Clinton's wedding.",
  "content:encoded": "If you've ever met a famous person you know how exciting that feels.  But why?  What is it about fame that draws so many people to it?  In this episode I examine fame from two very perspectives: the Basking in Reflected Glory theory and Terror Management Theory.  Along the way we'll see what this all has to do with the rock band Queen, baseball and Chelsea Clinton's wedding.",
  "enclosure": "",
  "itunes:duration": "20:53",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,Management,psychology,fame,terror",
  "itunes:subtitle": "If you've ever met a famous person you know how exciting that feels.  But why?  What is it about fame that draws so many people to it?  In this episode I examine fame from two very perspectives: Basking in Reflected Glory and Terror Management Theory.  ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "If you've ever met a famous person you know how exciting that feels. But why? What is it about fame that draws so many people to it? In this episode I examine fame from two very perspectives: the Basking in Reflected Glory theory and Terror Management Theory. Along the way we'll see what this all has to do with the rock band Queen, baseball and Chelsea Clinton's wedding."
}