{
  "title": "FishLog raises US$3.5M to empower cold storage warehouses in Indonesia to improve utility",
  "link": "https://e27.co/fishlog-raises-us3-5m-from-bri-ventures-accel-others-20221103/",
  "dc:creator": "Sainul",
  "pubDate": "Thu, 03 Nov 2022 05:35:07 +0000",
  "category": [
    "Agritech",
    "Indonesia",
    "Investments",
    "Accel",
    "BRI Ventures",
    "FishLog",
    "Indogen Capital",
    "Insignia Ventures Partners",
    "Patamar Capital",
    "Triputra Agri Group"
  ],
  "guid": "https://e27.co/?p=475645",
  "description": "<p>FishLog, an ecosystem enabler for the fisheries cold chain industry in Indonesia, has closed its US$3.5 million pre-Series A round from BRI Ventures, Accel, Insignia Ventures Partners, Patamar Capital, Indogen Capital, and Triputra Agri Group. FishLog was established in 2020 by Bayu Anggara, Reza Fahlepi, and Abdul Halim to solve the fragmentation in cold chain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/fishlog-raises-us3-5m-from-bri-ventures-accel-others-20221103/\">FishLog raises US$3.5M to empower cold storage warehouses in Indonesia to improve utility</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475646\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475646\" loading=\"lazy\" class=\"size-full wp-image-475646\" src=\"https://e27.co/wp-content/uploads/2022/11/fishlog_pre_series_a_news.png\" alt=\"\" width=\"690\" height=\"390\" /><p id=\"caption-attachment-475646\" class=\"wp-caption-text\">(L-R) FishLog Co-Founders Abdul Halim (CBDO), Bayu Anggara (CEO), and Reza Fahlepi (CCO)</p></div>\n<p>FishLog, an ecosystem enabler for the fisheries cold chain industry in Indonesia, has closed its US$3.5 million pre-Series A round from BRI Ventures, Accel, Insignia Ventures Partners, Patamar Capital, Indogen Capital, and Triputra Agri Group.</p>\n<p>FishLog was established in 2020 by Bayu Anggara, Reza Fahlepi, and Abdul Halim to solve the fragmentation in cold chain fisheries in Indonesia.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/the-future-of-farming-in-the-asia-pacific-is-here-to-empower-farmers-20221012/\">The future of farming in the Asia Pacific is here to empower farmers</a></strong></p>\n<p>The agritech startup improves cold storage, processor, and distribution in Indonesia&#8217;s fisheries to enable the industry to meet global supply and demand better. It activates fisheries coastal areas by establishing FishLog Quality Centers, an O2O hybrid platform that works with local cold storage partners. These centres provide local stakeholders, including fishermen, aggregators and traders, greater access to buyers by listing their inventory in the FishLog marketplace and digitising their operation.</p>\n<p>FishLog also enables fisheries businesses to maximise upstream-to-downstream operations through its four products: inventory handling, financing, B2B marketplace, and cold storage digitisation.</p>\n<p>The fresh funding will allow FishLog to improve this ecosystem of services further by providing existing players greater access to tools, operating models, and liquidity, and enhancing the industry&#8217;s ability to process products and SKUs.</p>\n<p>Bayu Anggara, CEO and Co-Founders of FishLog, said, &#8220;While there is massive global business potential for the Indonesian fisheries sector, it has long been plagued by inefficiencies and fragmentation. Our mission at FishLog is to unlock the selling potential and maximise the storage utility of Indonesia&#8217;s fragmented fishing industry, building the best and most affordable way to ensure product and labour sustainability in the industry.&#8221;</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/efishery-secures-us32m-loan-from-dbs-indonesia-to-support-expansion-move-20221007/\">eFishery secures US$32M loan from DBS Indonesia to support expansion move</a></strong></p>\n<p>&#8220;Through this funding, we will continue to build the cold chain ecosystem enabler and operating system for the fisheries in Indonesia. Our vision is for all stakeholders in the sector to be able to participate productively in this industry, transacting safely, trusted by and seamlessly integrated,&#8221; he added.</p>\n<p>&#8212;</p>\n<div class=\"post-container x-post-content\">\n<div class=\"post-container x-post-content\">\n<div class=\"post-container x-post-content\">\n<p>Fundraising or preparing your startup for fundraising? Build your investor network, search from 400+ SEA investors on e27, and get connected or get insights regarding fundraising. <a class=\"ProsemirrorEditor-link\" rel=\"follow\" href=\"https://e27.co/membership/?utm_source=Boilerplate&utm_medium=Articles&utm_campaign=300TRIAL&utm_id=300TRIAL\" rel=\"follow\">Try e27 Pro for free today</a>.</p>\n</div>\n</div>\n</div>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/fishlog-raises-us3-5m-from-bri-ventures-accel-others-20221103/\">FishLog raises US$3.5M to empower cold storage warehouses in Indonesia to improve utility</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}