{
  "title": "172: Framing Britney Spears Part 2",
  "link": "https://audioboom.com/posts/7818012",
  "itunes:episode": 172,
  "itunes:title": "Framing Britney Spears Part 2",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3649,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>OOPS WE DID IT AGAIN! This is Part 2 of our 2-part series covering \"Framing Britney Spears.\"</strong><br>\n<br>\nHow does a talented, productive, and financially successful pop star lose complete legal control of her life? Imagine, one minute you’re a singer at the top of you game—touring the world, selling millions of albums—and the next minute a father you have no relationship with is in full control of your finances, can decided who you can and can’t talk to, and can have you committed to a mental hospital with no explanation necessary.  That is the story of Britney Spears and the #FreeBritney movement. Come hear us scream about it for 2 episodes, won’t you?<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 09 Mar 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-08:/posts/7818012",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}