{
  "title": "S16 Ep136: TCT: The JFK Assassination Dissected w/ Dr. Cyril Wecht",
  "link": "https://audioboom.com/posts/8098275",
  "itunes:episode": 136,
  "itunes:title": "TCT: The JFK Assassination Dissected w/ Dr. Cyril Wecht",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1954,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>True Crime Tuesday presents The JFK Assassination Dissected with Forensic Pathologist Cyril Wecht<br>\n<br>\nDr. Wecht is fearless about complaining about the phony-baloney Warren Commission Report, the absurdity of the president's autopsy, and the media malpractice and cover-up that persists even now when it comes to the coup d'etat that rocked the USA and the globe.</p>\n\n<p>Since President John F. Kennedy's 1963 murder in Dallas, medical examiner and lawyer Dr. Cyril Wecht was initially inclined to accept the official theory that one person alone was responsible for the crime. But as Wecht delved into the evidence with boundless curiosity and unprecedented access, he came to understand that America had, instead, suffered a coup d'etat at the hands of rogue elements within our own government. Nobody else has Wecht's up-close and personal experience in uncovering the facts behind this assassination - and now he's sharing it with the world. </p>\n\n<p>Cyril H. Wecht M.D., J.D., is an internationally acclaimed forensic pathologist, attorney, and medical-legal consultant who has personally performed more than 21,000 autopsies and consulted on more than 41,000 death probes. Besides the JFK case, Wecht's expertise has been called upon in cases involving Senator Robert F. Kennedy, Martin Luther King, Jr., Elvis Presley, JonBenét Ramsey, Laci Peterson, and Kurt Cobain, the fatal stabbings of the family of Dr. Jeffrey MacDonald, the O.J. Simpson slayings, and the Waco Branch Davidian fire, among others.<br>\n<br>\nGET THE BOOK HERE: <a href=\"https://www.google.com/url?q=https://amzn.to/3HLqwHp&sa=D&source=calendar&usd=2&usg=AOvVaw2ZBKQwEo4_QhrcGh5MpCSN\">https://amzn.to/3HLqwHp</a></p>\n",
  "pubDate": "Tue, 23 Nov 2021 23:14:00 +0000",
  "guid": "370f7d4a-9a10-482c-aa7b-ade9017d62c8",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}