{
  "id": "https://bibleinoneyear.org/en/youth/267",
  "title": "Day 267: Mystery",
  "description": "Psalm 111:2–10, Isaiah 57:19, 58:6–10, Ephesians 3:4–19.  In the Old Testament, we see only hints of this – it was concealed to some extent  Now, however, the mystery has been revealed in Christ",
  "pubDate": "Fri, 24 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/267/?ignore",
  "itunes:duration": "15:40",
  "guid": "enyouth24092021-267",
  "length": 940.85,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 267: Mystery",
  "itunes:subtitle": "Psalm 111:2–10, Isaiah 57:19, 58:6–10, Ephesians 3:4–19.  In the Old Testament, we see only hints of this – it was concealed to some extent  Now, however, the mystery has been revealed in Christ",
  "itunes:summary": "The best novelists are able to write in such a way that as you read through a story, the ending is a mystery but, when you look back from the end, the clues were there all along.\nIn today’s New Testament passage, the apostle Paul tells us that God has revealed the mystery of Christ. He writes about ‘the mystery made known to me by revelation... the mystery of Christ, which was not made known to people in other generations as it has now been revealed by the Spirit’ (Ephesians 3:3–5).\nReading the Old Testament is like going into a dark room full of furniture. We get a sense of what is inside the room by feeling the sofas, chairs and pictures. But, as we read the New Testament, it is as if a light is switched on and we see the room clearly. Jesus places the Old Testament in new light. To paraphrase St Augustine, ‘In the Old the New is concealed, in the New the Old is revealed.’\nJesus is the climax of God’s great plan for the world. Thus, Paul writes, ‘My task is to bring out in the open and make plain what God, who created all this in the first place, has been doing in secret and behind the scenes all along’ (vv.8–9, MSG). The word that Paul uses (photisai) means ‘to turn the light on so that people can see’.\nThe secret God reveals in Jesus is reconciliation not only with God but also with one another. Paul tells us, ‘This mystery is that through the gospel the Gentiles are heirs together with Israel, members together of one body, and sharers together in the promise in Christ Jesus’ (v.6). Both Jews and Gentiles can now approach God on equal terms.\nIf we are in Christ, we are all reconciled to God and to one another – regardless of race or social and cultural background. It must also apply to the church: Catholic, Orthodox, Protestant, Pentecostal, and so on. In the Old Testament, we see only hints of this – it was concealed to some extent. Now, however, the mystery has been revealed in Christ.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 267
}