{
  "title": "The French Revolution, Property Rights, and the Coase Theorem with Noel Johnson",
  "pubDate": "Fri, 28 Jul 2017 14:35:01 +0000",
  "guid": "dfdf4cd7ec873ff354019774c1c110ae",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EPJohnson_EDR.mp3",
  "itunes:image": "",
  "description": "<p>My guest for this episode is <a href= \"http://noeldjohnson.net/noeldjohnson.net/Home.html\" target= \"_blank\">Noel Johnson of George Mason University</a>, and if that name sounds familiar, it's because he was the coauthor on the paper <a href= \"http://economicsdetective.com/2017/06/state-capacity-rise-modern-nation-state-mark-koyama/\" target=\"_blank\">I discussed with Mark Koyama last month</a>.</p> <p>Noel recently released a working paper titled <a href= \"http://noeldjohnson.net/noeldjohnson.net/Research_files/Revolutionary%20Redistribution%207-13-17.pdf\" target=\"_blank\">\"The Effects of Land Redistribution: Evidence from the French Revolution.\"</a> It is coauthored with Theresa Finley and Raphael Franck. The paper examines the consequences of the land auctions held by the Revolutionary government in France. The abstract reads as follows:</p> <blockquote>This study exploits the confiscation and auctioning off of Church property that occurred during the French Revolution to assess the role played by transaction costs in delaying the reallocation of property rights in the aftermath of fundamental institutional reform. French districts with a greater proportion of land redistributed during the Revolution experienced higher levels of agricultural productivity in 1841 and 1852 as well as more investment in irrigation and more efficient land use. We trace these increases in productivity to an increase in land inequality associated with the Revolutionary auction process. We also show how the benefits associated with the head-start given to districts with more Church land initially, and thus greater land redistribution by auction during the Revolution, dissipated over the course of the nineteenth century as other districts gradually overcame the transaction costs associated with reallocating the property rights associated with the feudal system.</blockquote> <p>What's so interesting about this particular instance of land redistribution is the fact that it was all sold to the highest bidder rather than being given to the poor. This breaks with the pattern of most attempts at land reform throughout history. People have been trying to take land away from the rich and give it to the poor since at least <a href= \"https://en.wikipedia.org/wiki/Tiberius_Gracchus\" target= \"_blank\">Tiberius Gracchus</a> in the second century BCE. But the Revolutionary government needed money and they needed it fast. So they concocted a plan to seize and auction off all French lands owned by the Catholic Church, which comprised about 6.5 percent of the country.</p> <p>Land auctions take time though, and the government desperately needed funds in the short term, so they issued a monetary instrument known as the <a href= \"https://en.wikipedia.org/wiki/Assignat\" target= \"_blank\">assignat</a> that could be used in these land auctions. The land was eventually auctioned off and then traded in secondary markets, where much of it was consolidated into large estates that could employ capital-intensive agricultural practices on a large scale.</p> <p>The evidence suggests that these land auctions added to the productivity of the regions where they occurred. Noel argues that this occurred because the reduction in transaction costs allowed for a more efficient allocation of property rights. One could argue, however, that the Church might have simply owned more productive land to begin with, and the paper uses a series of identification strategies to show that this is not the main driver of their results.</p> <hr /> <p><strong>Related Links:</strong></p> <p><a href= \"http://www.deirdremccloskey.com/docs/pdf/Article_306.pdf\" target= \"_blank\">McCloskey (1998) on the Coase theorem</a>.</p> <p><a href=\"http://piketty.pse.ens.fr/files/GalorMoavRES2004.pdf\" target=\"_blank\">Galor and Moav (2004) on the relationship between inequality and productivity in economies dependent on physical capital vs human capital</a>.</p> <p><a href=\"http://gallica.bnf.fr\" target=\"_blank\">Gallica, the website where you can download a ton of digitized French archives</a>.</p> <p><a href=\"https://economics.mit.edu/files/4466\" target= \"_blank\">Acemoglu, Johnson, and Robinson (2005) on Atlantic trade</a>.</p> <p>Rachel Laudan discusses <a href= \"http://www.econtalk.org/archives/2015/08/rachel_laudan_o.html\" target=\"_blank\">the history of potatoes and other foods</a> on EconTalk.</p> <p>Photo credit: Early French banknote issue during the French Revolution (Assignat) for 400 livres, (1792), from the National Numismatic Collection at the Smithsonian Institution.</p> <p> </p>",
  "content:encoded": "<p>My guest for this episode is <a href= \"http://noeldjohnson.net/noeldjohnson.net/Home.html\" target= \"_blank\">Noel Johnson of George Mason University</a>, and if that name sounds familiar, it's because he was the coauthor on the paper <a href= \"http://economicsdetective.com/2017/06/state-capacity-rise-modern-nation-state-mark-koyama/\" target=\"_blank\">I discussed with Mark Koyama last month</a>.</p> <p>Noel recently released a working paper titled <a href= \"http://noeldjohnson.net/noeldjohnson.net/Research_files/Revolutionary%20Redistribution%207-13-17.pdf\" target=\"_blank\">\"The Effects of Land Redistribution: Evidence from the French Revolution.\"</a> It is coauthored with Theresa Finley and Raphael Franck. The paper examines the consequences of the land auctions held by the Revolutionary government in France. The abstract reads as follows:</p> This study exploits the confiscation and auctioning off of Church property that occurred during the French Revolution to assess the role played by transaction costs in delaying the reallocation of property rights in the aftermath of fundamental institutional reform. French districts with a greater proportion of land redistributed during the Revolution experienced higher levels of agricultural productivity in 1841 and 1852 as well as more investment in irrigation and more efficient land use. We trace these increases in productivity to an increase in land inequality associated with the Revolutionary auction process. We also show how the benefits associated with the head-start given to districts with more Church land initially, and thus greater land redistribution by auction during the Revolution, dissipated over the course of the nineteenth century as other districts gradually overcame the transaction costs associated with reallocating the property rights associated with the feudal system. <p>What's so interesting about this particular instance of land redistribution is the fact that it was all sold to the highest bidder rather than being given to the poor. This breaks with the pattern of most attempts at land reform throughout history. People have been trying to take land away from the rich and give it to the poor since at least <a href= \"https://en.wikipedia.org/wiki/Tiberius_Gracchus\" target= \"_blank\">Tiberius Gracchus</a> in the second century BCE. But the Revolutionary government needed money and they needed it fast. So they concocted a plan to seize and auction off all French lands owned by the Catholic Church, which comprised about 6.5 percent of the country.</p> <p>Land auctions take time though, and the government desperately needed funds in the short term, so they issued a monetary instrument known as the <a href= \"https://en.wikipedia.org/wiki/Assignat\" target= \"_blank\">assignat</a> that could be used in these land auctions. The land was eventually auctioned off and then traded in secondary markets, where much of it was consolidated into large estates that could employ capital-intensive agricultural practices on a large scale.</p> <p>The evidence suggests that these land auctions added to the productivity of the regions where they occurred. Noel argues that this occurred because the reduction in transaction costs allowed for a more efficient allocation of property rights. One could argue, however, that the Church might have simply owned more productive land to begin with, and the paper uses a series of identification strategies to show that this is not the main driver of their results.</p>  <p>Related Links:</p> <p><a href= \"http://www.deirdremccloskey.com/docs/pdf/Article_306.pdf\" target= \"_blank\">McCloskey (1998) on the Coase theorem</a>.</p> <p><a href=\"http://piketty.pse.ens.fr/files/GalorMoavRES2004.pdf\" target=\"_blank\">Galor and Moav (2004) on the relationship between inequality and productivity in economies dependent on physical capital vs human capital</a>.</p> <p><a href=\"http://gallica.bnf.fr\" target=\"_blank\">Gallica, the website where you can download a ton of digitized French archives</a>.</p> <p><a href=\"https://economics.mit.edu/files/4466\" target= \"_blank\">Acemoglu, Johnson, and Robinson (2005) on Atlantic trade</a>.</p> <p>Rachel Laudan discusses <a href= \"http://www.econtalk.org/archives/2015/08/rachel_laudan_o.html\" target=\"_blank\">the history of potatoes and other foods</a> on EconTalk.</p> <p>Photo credit: Early French banknote issue during the French Revolution (Assignat) for 400 livres, (1792), from the National Numismatic Collection at the Smithsonian Institution.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "52:09",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest for this episode is , and if that name sounds familiar, it's because he was the coauthor on the paper . Noel recently released a working paper titled  It is coauthored with Theresa Finley and Raphael Franck. The paper examines the...",
  "itunes:episodeType": "full"
}