{
  "title": "BONUS: Teenagers Surfing on the Wave of the Apocalypse",
  "itunes:title": "BONUS: Teenagers Surfing on the Wave of the Apocalypse",
  "link": "https://www.kcrw.com/culture/shows/lost-notes/bonus-teenagers-surfing-on-the-wave-of-the-apocalypse?utm_source=KCRW&utm_medium=RSS&utm_campaign=kcrw-show-rss",
  "description": "<p><span style=\"font-weight: 400;\">Our second of two </span><i><span style=\"font-weight: 400;\">Lost Notes</span></i><span style=\"font-weight: 400;\"> bonus episodes for this summer. This one is about The Student Teachers. </span><span style=\"font-weight: 400;\">In 1977, a group of music obsessed friends got together and decided to form a band. Most of them were still in high school and almost none of them had even picked up an instrument before, but they lived and breathed the New York City music scene and wanted nothing more than to be a part of it. They worked in record stores, ran fan clubs, and spent every second they could together, hanging in clubs like CBGB’s and Max’s Kansas City — clubs they’d eventually headline. </span></p>\n<p><span style=\"font-weight: 400;\">Soon after they formed the band, they played a practice gig at one of their high schools and took off from there. They spent their days studying for physics tests and practicing for French finals and spent their nights drinking White Russians and rubbing elbows with their rock heroes.  In their two years together, they headlined their favorite clubs, went on tour, made recordings, got interviewed on the radio, opened for Iggy Pop and hung with David Bowie in the recording studio. As the decade came to a close and they got a little older, their love for each other dwindled, and the band imploded. But what a beautiful and wild ride it was. This is the story of the Student Teachers, in their own words. </span></p>",
  "itunes:summary": "Our second of two Lost Notes bonus episodes for this summer. This one is about The Student Teachers. In 1977, a group of music obsessed friends got together and decided to form a band. Most of them were still in high school and almost none of them had even picked up an instrument before, but they lived and breathed the New York City music scene and wanted nothing more than to be a part of it. They worked in record stores, ran fan clubs, and spent every second they could together, hanging in clubs like CBGB’s and Max’s Kansas City — clubs they’d eventually headline. \n Soon after they formed the band, they played a practice gig at one of their high schools and took off from there. They spent their days studying for physics tests and practicing for French finals and spent their nights drinking White Russians and rubbing elbows with their rock heroes. In their two years together, they headlined their favorite clubs, went on tour, made recordings, got interviewed on the radio, opened for Iggy Pop and hung with David Bowie in the recording studio. As the decade came to a close and they got a little older, their love for each other dwindled, and the band imploded. But what a beautiful and wild ride it was. This is the story of the Student Teachers, in their own words.",
  "media:description": "Our second of two Lost Notes bonus episodes for this summer. In 1977, a group of music obsessed friends got together and decided to form a band. Most of them were still in high school, almost none of them had even picked up...",
  "author": "webmaster@kcrw.org (KCRW)",
  "itunes:author": "KCRW",
  "pubDate": "Thu, 06 Aug 2020 01:00:00 -0700",
  "guid": "ce0806b9bebe47c9937c28112839a361",
  "enclosure": "",
  "itunes:duration": "00:38:55",
  "media:content": "",
  "itunes:explicit": "yes",
  "itunes:keywords": "",
  "itunes:episodeType": "bonus",
  "content:encoded": "<p><span style=\"font-weight: 400;\">Our second of two </span><i><span style=\"font-weight: 400;\">Lost Notes</span></i><span style=\"font-weight: 400;\"> bonus episodes for this summer. This one is about The Student Teachers. </span><span style=\"font-weight: 400;\">In 1977, a group of music obsessed friends got together and decided to form a band. Most of them were still in high school and almost none of them had even picked up an instrument before, but they lived and breathed the New York City music scene and wanted nothing more than to be a part of it. They worked in record stores, ran fan clubs, and spent every second they could together, hanging in clubs like CBGB’s and Max’s Kansas City — clubs they’d eventually headline. </span></p>\n<p><span style=\"font-weight: 400;\">Soon after they formed the band, they played a practice gig at one of their high schools and took off from there. They spent their days studying for physics tests and practicing for French finals and spent their nights drinking White Russians and rubbing elbows with their rock heroes.  In their two years together, they headlined their favorite clubs, went on tour, made recordings, got interviewed on the radio, opened for Iggy Pop and hung with David Bowie in the recording studio. As the decade came to a close and they got a little older, their love for each other dwindled, and the band imploded. But what a beautiful and wild ride it was. This is the story of the Student Teachers, in their own words. </span></p>"
}