{
  "title": "Where the President-Elect Candidates Stand on Key Issues",
  "link": "https://spectrum.ieee.org/where-the-president-elect-candidates-stand-on-key-issues",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-four-people-standing-next-to-each-other.jpg?id=30828495&width=2000&height=1500&coordinates=0%2C0%2C1%2C0\"/><br/><br/><p>Two virtual events were held in <a href=\"https://connect.ieee.org/NzU2LUdQSC04OTkAAAGFjPZmgZUOEh0N2DiBcFq4hoWbZtWefEHg3lbb2og-d_UyXnsFm4d8PtPC7FhjZgvfvsp5wIA=\" rel=\"noopener noreferrer\" target=\"_blank\">June</a> and <a href=\"https://connect.ieee.org/n/NzU2LUdQSC04OTkAAAGFjPZmgePrERqr463Ke7sfa6WjgDrTCyEIKBmJbxgApfIub6kPo79uSl2-P3VxgD6z1vtVnsI=\" rel=\"noopener noreferrer\" target=\"_blank\">July</a> for members to get to know the four candidates running for 2023 IEEE president-elect. President <a href=\"https://spectrum.ieee.org/ieee-presidents-note-june-2022\" target=\"_self\">Ray Liu</a> asked <a href=\"https://candidates.ieee.org/candidates/nominees/thomas-m-coughlin/\" rel=\"noopener noreferrer\" target=\"_blank\">Thomas M. Coughlin</a>, <a href=\"https://candidates.ieee.org/candidates/nominees/kazuhiro-kosuge/\" rel=\"noopener noreferrer\" target=\"_blank\">Kazuhiro Kosuge</a>, <a href=\"https://candidates.ieee.org/candidates/nominees/kathleen-a-kramer/\" rel=\"noopener noreferrer\" target=\"_blank\">Kathleen A. Kramer</a>, and <a href=\"https://candidates.ieee.org/candidates/nominees/maike-luiken/\" rel=\"noopener noreferrer\" target=\"_blank\">Maike Luiken</a> questions submitted by members on issues important to them. </p><p>The candidates were asked about their plans for increasing diversity, equity, and inclusion at IEEE; expanding science, technology, engineering, and math education programs; and ways to attract and retain members. They also spoke about IEEE’s role in addressing the global climate crisis.</p><p>The candidates were given 90 seconds to answer each question. The following is a summary of some of their answers. Both events are available <a href=\"https://engage.ieee.org/June-IEEE-PE-Panel-Sign-Up.html\" rel=\"noopener noreferrer\" target=\"_blank\">on demand</a> on IEEE.tv.</p><h2>Increasing Diversity, Equity, and Inclusion</h2><p>IEEE is committed to increasing DEI within the organization as well as in the engineering profession as a whole. How the organization will go about doing so was top of mind for some members.</p><p>Coughlin said diversity gives the organization “strength and multiple perspectives,” and he said he believes that is “important for IEEE members to be able to develop technology to help solve the world’s problems.” One of his goals, he said, is to increase the number of women who volunteer and hold leadership positions.</p><p>Kramer said one of her priorities should she be elected would be to make inclusivity at IEEE more effective and equitable for “diverse and global members as the organization advances technology.” She said the organization needs to understand just how diverse and inclusive IEEE regions and sections are and make them “accountable for increasing their efforts.”</p>\n<p>Coughlin and Kramer serve on a committee in the IEEE Santa Clara Valley (Calif.) Section that is working to incentivize the chapters to add more female speakers at their events.</p><p>Luiken said gender diversity within IEEE is improving but said the organization’s leaders need to “keep their eyes open” to what other types of diversity—including age, cultural, and geographic—need to be increased within the organization. If elected, she said, she will focus on increasing the number of women who become life members because, she said, right now women make up only 2 percent of that membership designation. (To achieve “life” status, a member must be at least 65 years old and have been a member of IEEE for such a period of time that the sum of their age and their years of membership equals or exceeds 100.)</p><p>Kosuge said IEEE sections and regions play an important role in increasing diversity and inclusion within the organization. He would tailor IEEE’s strategies for increasing DEI to each region so that they better respect local cultures.</p><h2>IEEE’s Role in Preuniversity Education</h2><p>Kramer said her main priority as president-elect would be to inspire and engage the next generation of IEEE members. She acknowledged that the organization has been increasing such efforts but said she wants to do more, as she believes it’s essential for IEEE to play a role in preuniversity education.</p><p>Coughlin praised current IEEE programs such as TryEngineering, which provides teachers, parents, and students with a variety of educational resources including hands-on classroom activities. But, he said, IEEE also should produce educational materials for 3- and 4-year-olds. One example he shared was the IEEE science-kit program being offered at libraries in Region 4. The kits teach elementary school pupils what engineers do, as well as how to code, build robots, design video games, and create animations.</p><p>“We need to show [schoolchildren] the value of a professional society when they are young,” Coughlin said.</p><p>He said he also wants IEEE to support STEM competitions and events held by other organizations such as First Robotics and the Maker Faire. In the First Robotics competitions, student teams design, program, and build robots. At Maker Faire conventions, people engage in hands-on DIY and STEM activities.</p><p>Luiken agreed with Coughlin about the importance of making educational materials available earlier to youngsters. She said she also wants to give members more opportunities to go into classrooms and share their expertise through talks or hands-on activities. She said the organization should offer more resources to teachers.</p><p>Kosuge reiterated that IEEE has many “amazing” educational programs, and he said he wants to make them available globally and in multiple languages.</p><p>The candidates were asked how IEEE could do a better job of encouraging children from underrepresented groups and underserved communities to pursue a STEM career.</p><p>Kramer said IEEE needs to offer more mentorship opportunities.</p><p>Kosuge said the organization should start at the local level. Chapters and sections could host events or go to schools to engage students.</p><p>Luiken pointed out that several such programs already exist, such as IEEE REACH, a program that provides teachers with resources to help them explain the history of technology and the roles played by engineers. She said the program should increase its efforts to distribute the materials more widely. She added that IEEE “needs to work with other organizations around the world, such as UNESCO, to make the materials available to underprivileged communities.”</p><p>Coughlin agreed and said IEEE should be collaborating with groups such as the U.S. National Society of Black Engineers to conduct outreach programs.</p><h2>Attracting and Retaining Members</h2><p>One of Kosuge’s priorities would be to ensure IEEE’s products and services meet members’ needs—which he believes would help with retention. One of his plans would be to offer services in languages other than English. Many lectures, courses, and publications are offered only in English, he noted. He said that offering publications and services in other languages would not only help IEEE attract new members but also retain current ones.</p><p>Coughlin said it’s critical to attract and engage student members because the average age of IEEE members has been increasing. If he could accomplish one thing as president-elect, he said, it would be to make the organization valuable to the next generation of engineers. He said he plans to do so by establishing more local sections and chapters to show young engineers the value of being a member. He suggested that IEEE should sponsor career fairs at universities to attract young engineers.</p><p>“If they got a job because of the career fair,” he said, “they may have a bigger interest in becoming a member.”</p><p>Kramer said that to retain members, IEEE needs to change the way it communicates with them about membership.</p><p>“Membership has become a cost rather than a value,” she said. </p><p>Luiken suggested that the organization personalize its interaction with its members.</p><p>All the candidates weighed in with suggestions on how to better engage industry professionals. Kosuge said one way is to offer continuing education courses designed for engineers working in industry.</p><p>Coughlin agreed that such courses are important because “technology is changing all the time, and we need to address that.” Another one of his strategies is for IEEE to hold senior member elevation events at companies.</p><p>If Kramer becomes president-elect, she said, she will develop a strategy to increase IEEE’s member engagement.</p><p>Luiken said that to better connect with engineers, IEEE needs to understand what they value and what their goals are.</p><p>“Common goals give the organization an opportunity to engage with students, industry professionals, and young professionals,” she said. </p><p>She added that she wants to create a program whereby IEEE members—in industry and academia—work with local organizations and government agencies to develop goals.</p><h2>Tackling Climate Change</h2><p>How IEEE can help address the climate crisis was a popular topic at both forums.</p><p>Luiken said one of her goals would be to “mobilize IEEE to help answer the challenges of climate change and build a more sustainable planet.” She wants to create more opportunities for members to share their technical know-how with the world—which she said would “make a true difference.”</p><p>“Knowledge breeds responsibility,” she said, “and it’s our responsibility to serve.”</p><p>Coughlin said IEEE could increase its climate-change impact by increasing its outreach.</p><p>“We need to engage with other parts of the world and other organizations such as the Engineering Change Lab–USA,” he said. “This would help us address climate change and help other organizations see us as a valuable resource.” Engineers and technical organizations use the Engineering Change Lab as a platform to share their perspectives and collaborate on projects.</p><p>Coughlin noted that an IEEE ad hoc committee on climate change recently was formed. He reiterated the fact that the organization has the capabilities to impact public policy on climate change worldwide and that “members can be important agents on technical details necessary to deal with the global threat.”</p><p>Kramer agreed with Coughlin that increasing IEEE’s outreach is key. The organization needs to play a role in directing the technical aspects of sustainable development and be involved in creating policy, she said.</p><p>Kosuge said he wants to create a technology road map to provide government agencies and other organizations with steps to tackle the climate crisis.</p><p>To learn more about the candidates and to read their position statements, visit the <a href=\"https://candidates.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE President-Elect Candidates website</a>.</p><p>The annual <a href=\"https://spectrum.ieee.org/the-institute/ieee-news/voting-in-ieee-election-starts-in-august\" target=\"_self\">IEEE election</a> process begins on 15 August. Be sure to check your email for electronic voting instructions, or your mailbox for your ballot. For more information about the offices up for election, the process of getting on the ballot, and deadlines, visit the <a href=\"http://www.ieee.org/elections\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Annual Election</a> page or write to <a href=\"mailto:mailto:elections@ieee.org\">elections@ieee.org</a>.</p>",
  "pubDate": "Fri, 12 Aug 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/where-the-president-elect-candidates-stand-on-key-issues",
  "category": [
    "Ieee news",
    "Ieee president elect",
    "Ieee election",
    "Ieee news",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}