{
  "title": "Google Assistant offers information and hope for Breast Cancer Awareness Month",
  "link": "https://blog.google/products/assistant/google-assistant-offers-information-and-hope-for-breast-cancer-awareness-month/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"mea5w\">It has been nearly 15 years since that otherwise ordinary Thursday afternoon when my mom came home with a diagnosis that would change our lives, irrevocably and forever: Stage II breast cancer. Despite the visceral and all-consuming fear that accompanies a cancer diagnosis, the oncologists reassured us hers was treatable, that she’d be there to dance at our weddings, that she’d live to grow old.</p><p data-block-key=\"6vjrd\">But she died instead.</p><p data-block-key=\"6lk72\">Her cancer was too aggressive. She ran out of treatment options. Just two years after the word “cancer” cleaved our lives in half, she was gone — destroyed by a disease that could’ve been stopped had we just known sooner.</p><p data-block-key=\"3a38i\">Unfortunately this experience — this painfully tragic, heartbreaking and circuitous trajectory — is shared by too many people. Every year, approximately <a href=\"https://www.cdc.gov/cancer/breast/basic_info/index.htm\">42,000 women</a> in the U.S. die of breast cancer, and <a href=\"https://www.cdc.gov/cancer/breast/young_women/bringyourbrave/breast_cancer_young_women/index.htm#:~:text=About%201%20in%208%20women,than%2045%20years%20of%20age.\">one of every eight women</a> in the U.S. will be diagnosed with the disease over the course of her lifetime. These are women we love fiercely — our moms, sisters, friends, neighbors, daughters and <a href=\"https://blog.google/perspectives/ruth-porat/breast-cancer-and-tech-optimism/\">leaders</a>. And like my mom, for most of them — <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3519312/#:~:text=18%E2%80%9320%20However%2C%20breast%20cancers,family%20history%20of%20the%20disease\">nearly 85%</a> — this diagnosis comes with no family history whatsoever.</p><p data-block-key=\"3l30e\">While we can’t stop the incidence of breast cancer, we know one thing is true: <a href=\"https://www.cdc.gov/cancer/breast/pdf/breast-cancer-fact-sheet-508.pdf\">Early detection saves lives</a>. Women who catch their cancers early — through regular screenings, checkups and mammograms — have a much higher chance of surviving. Of responding to treatments. Of living to meet their grandchildren.</p><p data-block-key=\"9va2d\">That’s why, in honor of Breast Cancer Awareness Month, we’re sharing updates around how Google is helping. On top of our work <a href=\"https://blog.google/technology/health/artificial-intelligence-breast-cancer-screening/\">building AI models</a> that can improve the detection of breast cancer in screenings, we’re raising awareness about the importance of these checkups. For instance, we’re building features into products like Google Assistant to help people take early steps to protect themselves against breast cancer.</p><h2 data-block-key=\"8teu8\">Breast cancer facts and resources on Assistant</h2><p data-block-key=\"7oaec\">Since more than 700 million people turn to Google Assistant every month as their go-to helper, it’s a great way to reach them in their everyday moments.</p><p data-block-key=\"blkfa\">If you’re prone to putting off your checkups, just tell your Assistant, “Hey Google, set an <a href=\"https://support.google.com/assistant/answer/9387035?hl=en&amp;co=GENIE.Platform%3DAndroid\">annual reminder</a> to get my breast exam on [date].” And if you say, “Hey Google, tell me about Breast Cancer Awareness Month” or “Give me a Breast Cancer Awareness fact” in the U.S., you’ll receive facts from the <a href=\"https://www.cdc.gov/cancer/breast/index.htm\">Centers for Disease Control and Prevention</a> (CDC) about the critical importance of early detection and <a href=\"https://www.cdc.gov/cancer/breast/basic_info/mammograms.htm\">mammography</a> in improving prognoses and saving lives. From here on out, you can always turn to Assistant as a fast and reliable source of this information, not just during Breast Cancer Awareness Month.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"A graphic shows someone asking Google Assistant for a Breast Cancer Awareness fact, followed by a response referencing the CDC’s guidance to lower one’s risk of breast cancer.\" class=\"article-image--large\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/BreastCancerAwareness.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/BreastCancerAwareness.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/BreastCancerAwareness.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"mea5w\">To reach even more people, during the month of October we’re also sharing more information about breast cancer in response to some of the most common questions people ask their Assistant every day — including “What’s up?” and “How are you?” Give it a try today in the U.S. on your home or mobile device.</p><p data-block-key=\"b1a6n\">Like so many, I’ve learned firsthand that our lives can change in a single, ordinary moment — with the discovery of a tumor you pray is benign, a diagnosis for which you hope there is a cure, the fear that the person you love may not celebrate another birthday or live to become a grandmother. While breast cancer took my mom's life far too soon, I can think of no greater gift to share in her memory than the reminder for other women to detect and treat their diseases early. Before they’re too aggressive to cure. Before they can circumvent even the strongest treatments. Before it’s too late.</p><p data-block-key=\"67cf5\">For the millions who use Google Assistant, we want to make this information as easy to find as a simple, “Hey Google, how are you?” And by doing that, provide something just as meaningful: a place to start, and a glimmer of hope.</p></div></div></body></html>",
  "pubDate": "Wed, 19 Oct 2022 13:00:00 +0000",
  "guid": "https://blog.google/products/assistant/google-assistant-offers-information-and-hope-for-breast-cancer-awareness-month/",
  "category": [
    "Google Assistant",
    "Health"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Google Assistant offers information and hope for Breast Cancer Awareness Month",
    "description": "For Breast Cancer Awareness Month, Google Assistant is launching new features to spread awareness about the importance of early detection.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Assistant_Breast_Cancer_Riva_and_Mom.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/products/assistant/google-assistant-offers-information-and-hope-for-breast-cancer-awareness-month/"
  },
  "author": {
    "name": "Riva Sciuto",
    "title": "Keyword Contributor",
    "department": "",
    "company": ""
  }
}