{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-2636489935894278774",
  "published": "2022-09-09T18:50:00.000-05:00",
  "updated": "2022-09-09T18:50:08.942-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Energy Agony",
  "content": "<p>Two era-defining articles popped up in today's Wall Street Journal.&nbsp;</p><p>In \"<a href=\"https://www.wsj.com/articles/the-coming-global-crisis-of-climate-policy-europe-germany-energy-prices-bankruptcy-winter-subsidies-borrowing-green-nuclear-11662651070\" target=\"_blank\">the coming global crisis of climate policy,</a>\" Joseph Sternberg writes&nbsp;</p><blockquote><p>...Anyone who still thinks climate change is a greater threat than climate policy to financial stability deserves to be exiled to a peat-burning yurt in the wilderness.</p></blockquote><blockquote><p>...the world’s central banks and other regulators are in the middle of a major push to introduce various forms of climate stress testing into their oversight. ...The fad is for quantifying, with preposterous faux-precision, the costs of reinsuring flood risks, or fire, or the depressed corporate profits of a dystopian hotter future.</p></blockquote><blockquote><p>Well, if you seek “climate risk” to financial stability, look around you. It has arrived, although in exactly the opposite manner to what our current crop of eco-financiers predicted....</p></blockquote><blockquote><p>The U.K. may be facing a wave of business bankruptcies exceeding anything witnessed during the post-2008 panic and recession...The culprit is energy prices...Matters are probably worse in Germany,...</p></blockquote><blockquote><p>Banks and other financial firms inevitably will find themselves right at the edge of the water if or when a tsunami of energy-price bankruptcies washes ashore.</p></blockquote><p><span></span></p><a name='more'></a>If you've been living in that solar-heated yurt, you may not be aware that central banks and financial regulators (SEC) are moving headlong to de-fund fossil fuel investments via regulation. The fig leaf for this activity is the notion that fossil fuel companies, though funded almost entirely by common equity, pose \"risks\" to the financial system. (Lots on this in previous blog posts, click the \"environment\" tag.)&nbsp;<p></p><p><i>Getting transition risk wrong.&nbsp;</i></p><p>Sternberg got a detail wrong and unintentionally pulled a punch. Writing,&nbsp;</p><blockquote><p>The Federal Reserve, Bank of England and European Central Bank, among others, want to know how global temperature variations a century hence might weigh on Citi’s or Barclays’ or Deutsche Bank’s capital and risk weightings today.&nbsp;</p></blockquote><p>Actually, no. The \"climate financial risk\" stress tests aren't quite that transparently dumb, since bank balance sheets don't have risks more than 5 to 10 years out. Instead they start with the theory that extreme weather events will cause financial problems in this shorter horizon. When it's pointed out that even the IPCC says that the probability distribution of weather really isn't changing that fast, and economists point out that floods and hurricanes have never caused a financial system crash, they admit that's really not going to happen. They move on to stress test \"transition risk,\" that governments might pass climate policies so extreme that they cause a financial meltdown.&nbsp;<i>This is exactly what is just about to happen.&nbsp;</i></p><p>That observation is the really devastating one: They were supposed to stress test \"transition risk.\" But governments&nbsp;<i>did</i>&nbsp;pass transition policies&nbsp;that threaten a really big risk to the financial system. And &nbsp;those were exactly the same policies that the aforementioned central banks wish to&nbsp;<i>privilege</i>&nbsp;as a result of these \"stress tests,\" namely banning fossil fuels before replacements are available at scale and subsidizing electric cars, windmills and solar panels. But <i>they got the sign exactly wrong.</i> The transition risk to the financial system is not that governments would bankrupt oil companies. Duh, restrict supply, the price goes up, not down. The transition risk is that oil companies are swimming in profits and everyone else is going to go bust. &nbsp;</p><blockquote><p>Does anyone know what exactly any of this will mean for the financial system? Of course not. No one has seriously bothered to “stress test” catastrophic increases in energy prices.</p></blockquote><p><i>The unraveling of risk regulation.&nbsp;</i></p><p>Actually, the point is even deeper and more devastating. &nbsp;What we are seeing is the fourth grand failure in 15 years of the whole idea that regulators can monitor bank assets and thereby keep the financial system safe. The financial crisis of 2008 erupted despite plenty of bank risk regulation. Rivers of new rules were adopted, including the US Dodd-Frank act and subsidiary regulations, along with stress tests, all aimed at regulators supervising bank assets. No sooner had the barn door been closed after the departing horse, but the European debt crisis broke out. This too was fundamentally a banking crisis: Allowing Greece to fail would have imperiled too many banks, French and German as well as Greek. So much for the asset risk regulators. 12 years of heightened regulation and stress tests later, along came covid-19, threatening another wave of bankruptcies, and another perceived threat to the financial system. No stress tester ever thought about \"what if there is a pandemic,\" despite their repeated eruption through human history. The Fed bailed out treasury markets, money market funds, individual companies, state and local governments, and even issued a Mario-Draghi-worthy \"whatever it takes\" to prop up the price of corporate bonds. This time nobody even had the decency to worry about containing moral hazard. And <i>that</i> horse having just left the barn, here we are once more facing an even larger financial crisis... that not a single stress tester had the imagination to foresee as even a possibility.&nbsp;</p><p>I don't fault them, they're only human. The point: the whole project of counting on armies of bureaucrats to foresee risks and safeguard bank assets is hopeless. &nbsp;If it's hopeless for real estate, soveriegn default, pandemic, and war (when our side has visibly invited the Trojan pipeline in), goodness gracious the idea that the same system can foresee \"climate risk to the financial system\" is ludicrous. &nbsp;</p><p><i>Fiscal crisis?&nbsp;</i></p><p>What next? Well, stress testing having failed once again, here comes the bailout and stimulus, which seems to be our governments' only response to anything.&nbsp;</p><blockquote><p>European governments aren’t blind to the energy-price threat—an awareness that, perversely, creates a threat of its own. The only politically viable solution for this winter will be subsidies on a monumental scale. Hundreds of billions of dollars for households and businesses (and utilities) across the Continent already have been announced, and desperate capitals won’t stop there. This will require substantial borrowing on top of the fisc-wrecking bond issuance during the pandemic.</p></blockquote><p>And also &nbsp;</p><blockquote><p>...on top of the additional borrowing governments normally do during recessions to finance social-welfare assistance. All of this while interest rates start rising after resting for more than a decade on (or below) the floor.</p></blockquote><p>There is no lack of demand mysterious Keynesian economics afoot here. This is a good old fashioned shoot-self-in-foot supply shock. Borrowed or printed money cannot make a nation better off.&nbsp;</p><p>I have been opining that the next crisis, with trillions in bailout and stimulus might be the one in which investors finally say no more. We shall see.&nbsp;</p><p><i>Meanwhile, back in the UK; economic fallacies</i></p><p><a href=\"https://www.wsj.com/articles/u-k-government-to-cap-household-energy-prices-for-two-years-11662634632\" target=\"_blank\">&nbsp;U.K. Government to Cap Household Energy Prices for Two Years</a></p><blockquote><p>The U.K. government said it would cap household energy prices over the next two years, a costly bailout aimed at staving off a deep recession and bringing down inflation, but one that could add to growing worries about the British government’s financial health.</p></blockquote><blockquote><p>The package, which economists say is likely to be worth more than $120 billion, ... also marks the first big act in office for new U.K. Prime Minister Liz Truss...</p></blockquote><p>Ms. Truss was advertised as a libertarian. I see that lasted about 10 minutes.</p><p>Perhaps the most basic principle of sound economics is, \"<i>don't transfer income by distorting prices.</i>\" Don't silence the incentive. If one wishes to cushion the effect of a shock, then send people money to keep their real incomes constant, but don't subsidize the thing in short supply.&nbsp;</p><p>Yet the political system inexorably controls prices. Usually that means rationing, &nbsp;though the UK may be able to import what people demand at the controlled prices instead.&nbsp;</p><p>Why? There must be a question to which this is an answer. And I suspect this is it: Citizens of a democracy don't really care about the effects of energy prices on overall income distribution. What they really want is to go about their business as before. They don't want a 2,000 pound check and still have to figure out a way to save gas. They want to drive to bloody work just as before. They don't want precisely the pain of substitution that relative prices would signal. And politicians of a democracy give them what they want.&nbsp;</p><p>In this theory, politicians aren't dumb. They're doing what people want them to do.&nbsp;</p><p>\"Bringing down inflation\" is another economic howler. What a brilliant idea! We can just stop inflation altogether! Just require that every store charge exactly what it did a year ago, and the government will borrow or print money to make up the difference! I hope you can see the problem here. Economic principle #2 for today: <i>Cheaper to the individual, at the point of sale, does not mean cheaper to society as a whole</i>. You can pay at the pump or you can pay the tax man. This fallacy pervades the recent \"inflation reduction act\" in the US. Subsidies to solar panels, windmills, electric cars, and price caps on prescription drugs do not make them \"cheaper\" to society. It just changes where you pay.&nbsp;</p><p>\"Growing worries\" You bet. We create inflation by printing up money and debt and handing it out. Then, to solve the problem we... print up more money and debt and hand it out. You can see where this is heading. Another economic principle: <i>there is always supply and demand.</i>&nbsp; Politicians blame \"supply\" for higher prices, but the prices would not be high if people were not demanding all those expensive goods, and willing and able to fork over the money.&nbsp;</p><blockquote><p>“Extraordinary challenges call for extraordinary measures, ensuring that the United Kingdom is never in this situation again,” Ms. Truss said.</p></blockquote><p>Or ensuring that the United Kingdom is perpetually in this situation, perhaps. &nbsp;</p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 20
}