{
  "id": "https://bibleinoneyear.org/en/youth/147",
  "title": "Day 147: The Power of Unity",
  "description": "Psalm 68:7-10, 1 Samuel 20:42, John 17:9–23. In unity, these two men, one a Catholic and the other a Protestant, bore witness together to their common Lord – Jesus Christ  Unity is so powerful",
  "pubDate": "Thu, 27 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/147/?ignore",
  "itunes:duration": "13:46",
  "guid": "enyouth27052021-147",
  "length": 826.91,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 147: The Power of Unity",
  "itunes:subtitle": "Psalm 68:7-10, 1 Samuel 20:42, John 17:9–23. In unity, these two men, one a Catholic and the other a Protestant, bore witness together to their common Lord – Jesus Christ  Unity is so powerful",
  "itunes:summary": "In Buchenwald concentration camp, 56,000 people were put to death by a totalitarian regime that saw the Christian faith as a threat to its ideology. One block of cells in the camp was reserved for prisoners who were deemed especially dangerous or notable. Paul Schneider, a Lutheran pastor who was called ‘the preacher of Buchenwald’, was placed in this special block because even from the small window in his cell he loudly proclaimed the gospel of Jesus Christ – in defiance of the orders of the Gestapo guards.\nOtto Neururer, a Catholic priest whose work on behalf of the Jews and other so called ‘undesirables’ had made him a threat to the Nazi warlords, was also put in this block. He too ministered in Jesus’ name to his fellow inmates in the concentration camp until he was crucified upside down.\nIn unity, these two men, one a Catholic and the other a Protestant, bore witness together to their common Lord – Jesus Christ. Unity is so powerful.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 147
}