{
  "title": "142: 41 Shots: The Killing of Amadou Diallo (Trial By Media Episode 3)",
  "link": "https://audioboom.com/posts/7642755",
  "itunes:episode": 142,
  "itunes:title": "41 Shots: The Killing of Amadou Diallo (Trial By Media Episode 3)",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2975,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In the early hours of February 4, 1999, 23-year-old Amadou Dialo, an unarmed black man standing on the steps of his apartment building, was fatally shot by four plain clothes New York City police officers. The officers shot 41 times with 19 of the bullets striking Dialo. The four officers were charged with second degree murder as New York City was taken over by protests and and demonstrations in response to the shooting. And of course, the whole thing was covered by Court TV. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more!<br>\n<br>\n<a href=\"https://www.disappearedpod.com/\">FAM! WE LAUNCHED A NEW PODCAST</a>! <strong>\"Obsessed With: Disappeared.\"</strong> It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\"  Episodes are live now! Be sure to check out our episode covering <a href=\"https://www.disappearedpod.com/episodes/episode/50959f8d/6-the-disappearance-of-maura-murray-s1-e6\">the disappearance of Maura Murray</a> <a href=\"https://www.disappearedpod.com/episodes/episode/50a1423d/an-interview-with-julie-murray-maura-murrays-sister\"><strong>AND PATRICK'S IN-DEPTH INTERVIEW WITH MAURA'S SISTER, JULIE MURRAY!</strong></a>\n</div>\n",
  "pubDate": "Tue, 28 Jul 2020 10:03:00 +0000",
  "guid": "tag:audioboom.com,2020-07-28:/posts/7642755",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}