{
  "title": "Haunting At A Nursing Home | RGSO Classic",
  "link": "https://audioboom.com/posts/8129719",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2027,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Who was the source of unknown voices and sounds in the halls and rooms of an old nursing home?<br>\nHere is a preview of the story.<br>\n“Staff would check and there would be nothing in those rooms. Most of the time the lights would enter or exit a room of someone who had passed shortly before or very near to the sightings. She would tell of the patients who would say they see family members in the room telling them they will be back to get them later and the patient would die overnight. Other patients would say oh look there its Jesus saying he’s taking me home. The patients would then die either within minutes or just that night. Many weird patient sightings would be encountered over the years. There was the looming black shadow figure that staff called the grim reaper. It would be seen in the hall and whenever it was seen to enter a patients room the staff knew to get ready for the death of that patient because it always happened if it was seen. Two of the creepiest stories she ever told us happened again on night shift. The first one she would say that one night she was sitting at the nurse’s station at the intersection of several halls. She was there with a co-worker just talking and doing paperwork.”<br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Wed, 17 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-29:/posts/8129719",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}