{
  "id": "tag:theatlantic.com,2021:39-617796",
  "content": "<p><small><em>This article was published online on February 12, 2021.</em></small></p><p class=\"dropcap\">I<span class=\"smallcaps\">n the mid-1990s</span>, when I was in middle school, my family moved to the suburbs of Seattle, where my father had gotten a job at Boeing. My parents would drive my sister and me down I-90 to the Bellevue Square mall on weekends, and I’d sit on the carpet of the B. Dalton bookstore, reading magazines. A mile and a half up Bellevue Way, in the garage of a rented house, Jeff Bezos was starting Amazon. For some time, Amazon’s influence was little noticed. In high school, the drive to my part-time job took me through what was then the nondescript South Lake Union neighborhood—dotted with auto shops, warehouses, and, along the waterfront, a few marinas. The main landmark was Denny Triangle’s Elephant Car Wash, with its <a href=\"https://www.seattletimes.com/pacific-nw-magazine/seattles-queen-of-neon/\">pair of pink, elephant-shaped</a> neon signs. It was a perfect specimen of the kitsch for which Seattle was known at the time, and I loved it.</p><p>Only recently has the South Lake Union area that I remember been transformed by the sprawling landscape of Amazon’s campus, which includes a <i>Harry Potter</i>–themed library, a dog deck featuring a fake fire hydrant, and three enormous, spherical plant conservatories. This past October, the Denny Triangle Elephant Car Wash closed down, under pressure from the pandemic and rising taxes and rent. Its owner donated one of the elephant signs to Amazon. “They asked for it, they wanted to have it,” <a href=\"https://www.seattletimes.com/business/small-pink-elephant-car-wash-sign-donated-to-amazon/\">Bob Haney told <i>The Seattle Times</i></a>. “So I gifted it to them.”</p><p>Haney isn’t a character in <i>Fulfillment: Winning and Losing in One-Click America</i>, Alec MacGillis’s wide-ranging, impressionistic tour of a nation whose citizens’ existence has become intertwined with a single corporation, but he easily could have been. Plenty of books have been written about Amazon, so MacGillis wasn’t interested in probing the inner workings of the corporation itself. Instead, he set out to explore “the America that fell in the company’s lengthening shadow”—that is, the places where Amazon’s influence has undermined social cohesion in pervasive ways. Finding such places turns out to be easy.</p><p class=\"dropcap\"><span class=\"smallcaps\">There are </span>countless ways to measure Amazon’s hold on American life. More people in the U.S. subscribe to its Prime service than voted for either Donald Trump or Joe Biden in the past election: more than 100 million, by <a href=\"https://fortune.com/2020/01/16/amazon-prime-subscriptions/\">recent</a> <a href=\"https://www.digitalcommerce360.com/article/amazon-prime-membership/\">estimates</a>. Amazon reaps fully half of what people in this country spend online. It is the second-biggest private workplace in the United States, after Walmart, employing more than 800,000 people, most of whom will never set foot in the Seattle headquarters’ plant spheres. Among Amazon’s large Arizona-based workforce, most of it inside warehouses, <a href=\"https://thecounter.org/amazon-snap-employees-five-states/\">one in three people was on the federal Supplemental Nutrition Assistance Program in 2017</a>. Incidentally, Amazon, along with Walmart, has been one of the biggest beneficiaries of an arrangement that allows food stamps to be used for online groceries, bringing in large amounts of government money. Bezos, Amazon’s CEO, is the richest person alive.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>As MacGillis notes, understanding how a single corporation became so widely and deeply entrenched requires historical perspective. Starting in the late 1970s, federal regulations governing business consolidation were loosened, and antitrust enforcement waned. Predictably, a growing share of corporate wealth began flowing to a small number of firms and, in turn, people. The rise of the internet in the 2000s accelerated the process in ways we’re by now familiar with, and a handful of companies—Google, Facebook, Apple, and Amazon, in particular—<a href=\"https://www.theatlantic.com/ideas/archive/2020/07/pandemic-making-monopolies-worse/614644/?utm_source=feed\">came to dominate large swaths of economic life</a>. What MacGillis feels is underappreciated is the geographical remapping of wealth—and, with it, power—that the transformation has brought about.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2020/07/big-tech-pandemic-power-grab/612238/?utm_source=feed\">Read: What Big Tech wants out of the pandemic</a>]</i></p><p>MacGillis, a reporter at ProPublica and the author of a Mitch McConnell biography titled <i>The Cynic</i>, was one of the first journalists to begin documenting the socioeconomic upheaval that helped shift the rural Rust Belt from blue to red and put Donald Trump in the White House. In <i>Fulfillment</i>, he is less concerned with the much-discussed electoral implications than with the tech-era upheaval itself. The superficially equalizing promise that customers everywhere can enjoy unprecedented convenience with a mere click has intensified the differences in the choices available to the rich and the poor. MacGillis describes how, while rich corporations and their top employees have settled in a small number of wealthy coastal cities, the rest of the American landscape has been leached of opportunities.</p><p>Portraying the phenomenon as a widening urban-rural divide is the simplistic version of a more nuanced and bigger story, MacGillis emphasizes. In 1969, the 30 metropolitan areas with the highest per capita personal income included Detroit, Cleveland, and three other midwestern cities. In 2019, only two midwestern names—Chicago and Minneapolis—appeared on that list, and nearly all the rest were on the coasts. Meanwhile, within the coastal cities that have grown wealthier, the gains have been disturbingly uneven. Rising rents and a lack of affordable housing have left the Seattle area, for example, with <a href=\"https://www.huduser.gov/portal/sites/default/files/pdf/2019-AHAR-Part-1.pdf\">the third-biggest population of homeless people in the U.S.</a>, after New York City and Los Angeles, according to 2019 data.</p><p>These numbers document a stark divergence, but they don’t capture its human dimensions. That is MacGillis’s goal, as he explores what the erosion of power and possibility means for regular people. Internally, Amazon uses the word <i>fulfillment</i> in reference to processing customers’ orders. MacGillis, of course, has another usage in mind: the very American emphasis on the chance to seek satisfaction—a sense of meaning, purpose, and value; a feeling of personal empowerment and communal solidarity—in our labor. No corporation provides a clearer vantage, or more angles, than Amazon does on the strategic choices that have expressly contributed to foiling that quest.</p><p class=\"dropcap\">F<em><span class=\"italic caps smallcaps smallcaps-italic\"> ulfillment</span></em> begins in a basement. Hector Torrez (a pseudonym) is an Amazon warehouse employee in Thornton, Colorado, who earns $15.60 an hour moving packages and boxes all night long. When the book opens, he has learned—from co-workers, not the company—that he has been exposed to the coronavirus on the job, and his wife has exiled him downstairs. From Torrez’s basement, MacGillis travels to Seattle and Washington, D.C., where so much of Amazon’s wealth is concentrated, as well as to cities in Maryland, Ohio, and Pennsylvania that have Amazon to blame, at least indirectly, for their historic decline in fortunes since the ’90s.</p><p>In some of MacGillis’s stories, the connection to Amazon is so tenuous as to be almost indiscernible; the characters’ problems seem to arise more from larger forces, such as globalization, gentrification, and the opioid crisis, than from any one corporation’s influence. A young man from small-town Ohio—alienated by his experience in D.C., where he starts college—returns home and enters Democratic politics. After scoring a local success, he runs for Congress, determined that the party not write off his opioid-ravaged, Trump-supporting region, but he fails to drum up more than a couple of union endorsements. A gospel singer who became a cultural force in Seattle during the ’80s watches as her neighbors are pushed out of the city’s historically Black Central District one by one.</p><p>Local energies may have been sapped for many reasons, yet in the coastal cities that MacGillis visits, Amazon’s disproportionate ability to further enrich and empower already thriving places and workers is glaring. Familiar though they are, evocations of the six-figure salaries and amenities available to young Amazon programmers—a café catering to their dogs, meeting space in a giant replica of a bird’s nest—acquire new salience set against Torrez’s experience. And the sense of entitlement on display in the company’s search for a second headquarters site is breathtaking. Local officials across hard-knock America prostrate themselves for a chance to host it. In the end, Amazon chooses the suburbs of the nation’s capital—already one of the wealthiest areas in the country—and walks away having amassed a great deal of useful regional data provided by eager bidders who probably never stood a chance.</p><p>In the less glamorous pockets of the country—the rural areas and small cities where MacGillis has spent so much time as a reporter—Amazon’s role in making economic hardship more entrenched is no less stark. In El Paso, Texas, Amazon has aggressively marketed itself to the city government as a go-to source for office supplies—which has pushed local purveyors to open up online storefronts on Amazon; a large cut of their sales goes to the corporation. In York, Pennsylvania, the headquarters of the once-fashionable Bon-Ton department store has been made extinct by Amazon and the broader retail consolidation it represents. The crisis of unemployment that has ensued is one that Amazon exploits, finding able bodies for its warehouses in nearby towns.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2018/06/amazon-flex-workers/563444/?utm_source=feed\">Read: I delivered packages for Amazon and it was a nightmare</a>]</i></p><p>On his home turf of Baltimore, MacGillis explores most intimately the ebbing of human fulfillment that has accompanied Amazon’s promise of high-speed customer service. He profiles Bill Bodani Jr., who spent most of his working life at Bethlehem Steel’s Sparrows Point complex, outside the city. In the early 2000s, a serious injury forced him to retire in his mid-50s, around the time that foreign competition and other factors pushed the company into bankruptcy. Eventually, the Sparrows Point plant shut down and Bodani’s monthly pension payment was cut from $3,000 to $1,600. Now 69 years old and back at work as a forklift driver in a 22-acre Amazon warehouse, he returns every day to the exact same piece of land. The peninsula has been rebranded—it’s called Tradepoint Atlantic now—and has become what MacGillis calls an “all-purpose logistics hub” that houses, among other facilities, an Amazon fulfillment center.</p><p>Bodani’s young co-workers call him “Pops” and “Old Man”—he’s by far the oldest one around. He starts out making about $12 an hour, compared with the $35 an hour he earned at his steel job. Other indignities are more insidious. The company uses an algorithm to track how productive its workers are and how much time they spend off task, flagging people for termination if the data show them underperforming. In other words, <a href=\"https://www.theverge.com/2019/4/25/18516004/amazon-warehouse-fulfillment-centers-productivity-firing-terminations\">a worker can be fired with minimal involvement by a supervisor</a>. Time-limited bathroom breaks mean that Bodani sometimes pees in a quiet corner of the warehouse, parking the forklift to shield him. Yet he draws comfort from working on the same physical terrain where he began his career: He sought out the job at the old Sparrows Point because it gave him a sense of belonging. “It’s a feeling of being home,” he tells MacGillis.</p><p>A man who clearly sets store by solidarity and continuity, Bodani still hangs out regularly with the Retirees United Local 9477, gathering for lunch with former Sparrows Point steelworkers and other union members—the kind of custom no Amazon worker will enjoy, if the anti-union corporation has its way. One day, he drops by a United Steelworkers office and collects some material on the right to organize. At work, he shows it to a young man he’s been training to operate the forklifts, who plainly chafes at Amazon’s culture—“the constant pressure to ratchet goals upward, the sense of total surveillance, the workers’ lack of a voice,” as MacGillis puts it. The next day, Bodani’s supervisor, three decades his junior, chastises him for passing out literature. The young man to whom he gave the flyers hasn’t been circumspect in distributing them; later, that worker is furloughed. (Amazon has denied that he was suspended.) When the supervisor threatens to dock Bodani’s pay over a bathroom break, Bodani has had enough. “You got to be kidding me,” he tells the supervisor. After a 50-year career at Sparrows Point, he quits, amid the holiday crush.</p><p class=\"dropcap\"><span class=\"smallcaps\">When he </span>began this project, MacGillis could not have anticipated just how timely a book about Amazon’s power—and the powerlessness of those in its path—would be. Recent press accounts have exposed that blue-collar labor at Amazon is not just exhausting but extremely dangerous, <a href=\"https://revealnews.org/article/how-amazon-hid-its-safety-crisis/\">with injury rates about double the industry average</a>. The company has <a href=\"https://www.geekwire.com/2020/amazon-avoided-unions-25-years-heres-labor-leaders-think-soon-change/\">actively sought</a> to head off <a href=\"https://www.vox.com/recode/2020/10/6/21502639/amazon-union-busting-tracking-memo-spoc\">unionization efforts</a>. The revelations came as the pandemic gave Amazon its most profitable year in history by far, thanks to people resorting to shopping online rather than at brick-and-mortar stores.</p><p>Last year, Bezos’s net worth rose by more than $67 billion (or 60 percent) to $182 billion. During roughly the same period, according to Amazon, almost 20,000 of Amazon’s frontline workers, such as warehouse employees and Whole Foods clerks, tested positive for the coronavirus. Step back, and the pattern holds. The world’s billionaires increased their wealth by about a fifth over the course of last year—to more than $11 trillion, according to <i>Forbes</i>. Meanwhile, a quarter of U.S. adults said someone in their household was laid off or lost a job because of the pandemic.</p><p>Addressing the regional imbalances in America would be an enormous undertaking, and MacGillis doesn’t presume to offer prescriptions. But his book suggests one very big place to start: Serious workplace reforms would affect hundreds of thousands of workers, as well as help reshape the broader labor landscape. Hector Torrez, whom MacGillis revisits toward the end of <i>Fulfillment</i>, remains wary. He is still employed at the Thornton warehouse, and Amazon has taken some action to keep workers safe—offering up to two weeks of paid leave to anyone with a COVID-19 diagnosis and a temporary raise for those who kept working at the height of the spring outbreak. The company has implemented basic precautionary measures, such as issuing masks and disinfecting work sites. For Torrez, those steps don’t offer much consolation. “What I see around me is a lot of people who don’t have much choice,” he tells MacGillis. Torrez’s quarantine period ended a long time ago. But not wanting to risk infecting his wife or children, he’s still in the basement.</p><hr><p><small><em>This article appears in the March 2021 print edition with the headline “The United States of Amazon.” </em></small></p>",
  "author": {
    "name": "Vauhini Vara",
    "uri": "http://www.theatlantic.com/author/vauhini-vara/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Illustration by Ryan Haskins; images from GraphicaArtis / Getty; Shutterstock"
  },
  "title": "Amazon Has Transformed the Geography of Wealth and Power",
  "published": "2021-02-12T06:00:00-05:00",
  "updated": "2021-02-12T08:22:41-05:00",
  "summary": "Understanding America in the giant company’s shadow",
  "link": ""
}