{
  "id": "https://bibleinoneyear.org/en/youth/352",
  "title": "Day 352: How to Honour the Lord",
  "description": "Proverbs 30:32–33, Ezra 2:68–69a, Revelation 10:1–3,5–11.  My greatest fear is that I might do or say something that will bring dishonour to his name  My deepest longing is to see the name of the Lord honoured again in our society",
  "pubDate": "Sat, 18 Dec 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/352/?ignore",
  "itunes:duration": "14:17",
  "guid": "enyouth18122021-352",
  "length": 857.78,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 352: How to Honour the Lord",
  "itunes:subtitle": "Proverbs 30:32–33, Ezra 2:68–69a, Revelation 10:1–3,5–11.  My greatest fear is that I might do or say something that will bring dishonour to his name  My deepest longing is to see the name of the Lord honoured again in our society",
  "itunes:summary": "One billion people watched the rescue. On 13 October 2010 at 10pm (GMT) Jose Henriquez Gonzalez emerged from 2,300 feet underground after being trapped for sixty-nine days when the San Jose mine collapsed in northern Chile.\nIt was originally thought that no one had survived the collapse, or that the thirty-three trapped underground would starve to death before they were found.\nMany of them had been atheists, agnostics, un-believers or semi-believers. Jose Henriquez Gonzalez was known as the ‘evangelist’ because he led so many of the others to faith in Jesus Christ. He formed and led a prayer group. With thirty-three tiny Bibles sent down by friends, he led devotions twice a day.\nThey testified to the presence of a thirty-fourth person. Nineteen-year-old miner, Jimmy Sanchez, said, ‘There are actually thirty-four of us, because God has never left us down here.’ Jesus was there with them. When they emerged out of the mine the rescued men were all wearing similar t-shirts. The shirts said on the front, ‘Thank you, Lord’, and on the back it said, ‘To him be the glory and honour’.\nI had the privilege of interviewing Jose Henriquez at HTB. ‘The true hero is Jesus Christ,’ he said. ‘He is the only hero that should be mentioned. Apart from what man may have done both inside and outside that mine, he is the one who deserves the honour and the glory.’\nJesus taught us to pray that God’s name should be honoured (Matthew 6:9). My greatest fear is that I might do or say something that will bring dishonour to his name. My deepest longing is to see the name of the Lord honoured again in our society.\nHow should you act in order to see his name honoured?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 352
}