{
  "title": "Calcium Carbonate to store CO₂ ?",
  "description": "<p>The earth’s oceans contain a great deal of dissolved inorganic carbon (DIC) and a decent concentration of calcium (about 10mM).\nFurthermore the ocean has a huge surface area and is able to take up large quantities of CO₂ from the atmosphere.\nIt is thus sometimes suggested that inducing precipitation of calcium carbonate (CaCO₃) from seawater could be a viable method to \nlock down carbon into a solid form, which could then be safely and easily stored somewhere. The thought is that removing carbonate from the \nocean would subsequently cause it to absorb more CO₂ from the atmosphere.</p>\n\n<p>Unintuitively, it turns out that this is not the case due to the way in which the ocean carbon chemistry works. \nParadoxically, the exact opposite is true - precipitation of CaCO₃ in the ocean <strong>releases</strong> CO₂ to the atmosphere - how can this be ? \nThis fallacy appears frequently enough, surprisingly sometimes even in peer reviewed papers <a href=\"https://chemistry-europe.onlinelibrary.wiley.com/doi/10.1002/cssc.202100134\">¹</a>ᐧ <a href=\"https://pubs.acs.org/doi/full/10.1021/acssuschemeng.0c08561\">²</a> <a href=\"https://newscenter.lbl.gov/2022/05/16/using-bacteria-to-accelerate-co2-capture-in-oceans/\">⁴</a></p>\n\n<p>or startups</p>\n\n<p><a href=\"https://www.fastcompany.com/90642340/this-carbon-capture-tech-removes-co2-from-the-ocean-by-making-seashells\">³</a>, that it bears illuminating.</p>\n\n<h2 id=\"inorganic-carbon-in-the-ocean\">Inorganic carbon in the ocean</h2>\n\n<p>Most gases like O₂ or N₂ are not all that soluble in water because water is a polar liquid and these small molecules are non-polar.\nAt first glance CO₂ might be thought to behave similarly, after all it’s not particularly polar.\nHowever, when CO₂ dissolves in water it can react with a hydroxyl ion to form a bicarbonate ion.</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>CO₂ + OH⁻  → HCO₃⁻ \n</code></pre></div></div>\n\n<p>The bicarbonate ion can further react with another hydroxyl ion to form a carbonate ion.</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>HCO₃⁻ + OH⁻  → CO₃²⁻ \n</code></pre></div></div>\n\n<p><sup>(These reactions are often written as between CO₂ and water, releasing protons, but for \nillustration purposes i think it’s more instructive to think of it the above way.)\n</sup></p>\n\n<p>The key is that unlike CO₂ these carbonate ions are charged and tremendously soluble in water.</p>\n\n<p>In pure water the availability of hydroxyl ions is very small, available only from the small amount of water that is always dissociated \ninto H⁺ and OH⁻. Any CO₂ that dissolves from the air quickly reacts with the available OH⁻ and the subsequent imbalance of H⁺ and OH⁻ results in the solution to become acidic. \nThis makes the availablity of OH⁻ even smaller and opposes further reaction.\nThus the solubility of CO₂ in pure water is not much greater than that of other simple gases like O₂ or N₂, which do not react with water.\nHow could we increase the ability of water to absorb CO₂ ? Simple: supply more OH⁻ ions that can gobble up CO₂ and \nturn it into bicarbonate, in other words, make the water more <em>alkaline</em>. This excess quantity of hydroxyl ions, which can react with CO₂, \nis called the water’s “alkalinity”. Thus the most basic way to express a quantifiable alkalinity is</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>Alk = [HCO₃⁻] + 2×[CO₃²⁻] + [OH⁻] + ... \n</code></pre></div></div>\n\n<p>This reflects both the excess OH⁻ that has already reacted with CO₂ into bicarbonate/carbonate ions (first two terms) and any free OH⁻ that is still available to react (third term).\nThis quantity effectively respresents the capacity of a body of water to absorb CO₂, irrespective of how much CO₂ it has currently taken up.\n<a href=\"https://en.wikipedia.org/wiki/Alkalinity\">Alkalinity</a> is a complicated concept and a full expression includes a number of other weak bases, \nbut the carbonate ions are typically the most important and this simplified view is sufficient to understand carbonate precipitation.</p>\n\n<p>Seawater contains a large quantity of alkalinity, which originates from dissolving alkaline rocks, which flows into the sea with the rivers.\nThis alkalinity allows seawater to hold a huge quantity of CO₂; in fact the total quantity of CO₂ dissolved in the ocean (37000GtC) is \n45 times greater than in the atmosphere (840GtC). Most of it is, of course, in the form of bicarbonate (89%)  and carbonate ions (10%).\nOnly a tiny fraction (0.5%) is dissolved as actual CO₂, like an ordinary gas.</p>\n\n<h2 id=\"precipitating-carbonates\">Precipitating carbonates</h2>\n\n<p>To understand why precipitating carbonates lead to the release of CO₂ into the atmosphere, let’s look at the precipitation of CaCO₃. \nThe reaction can be written in a number of ways, but they all result in the same outcome:\nLets try one line of argument: Since most of the available carbonates are in the bicarbonate form (HCO₃⁻) one way to write the precipitation is :</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code> Ca²⁺ + 2HCO₃⁻ → CaCO₃ + CO₂ + H₂O\n</code></pre></div></div>\n\n<p>You can immediately see that for every CaCO₃ created, one CO₂ is moved from the carbonate pool (highly soluble) to the gas form (poorly soluble),\nand is thus released back into the atmosphere.</p>\n\n<p>Another way to think about it is to ask “what would we need to do to restore the ocean to its prior state after precipitating a CaCO₃ ?”\nFirst, we precipitate the CaCO₃:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code> Ca²⁺ + CO₃²⁻ → CaCO₃ \n</code></pre></div></div>\n\n<p>Now, let’s restore the used-up CO₃²⁻ by bringing in a CO₂ from the atmosphere:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code> CO₂ + 2OH⁻ → CO₃²⁻ + H₂O \n</code></pre></div></div>\n\n<p>You can see that doing so requires us to add two OH⁻ back to the ocean, in addition to the CO₂. (We won’t worry here about changes in the Ca²⁺ concentration). \nIn other words a process that removes calcium carbonate from the ocean in a pH-neutral way needs to replenish the \nalkalinity from somewhere. If not, we will decrease the oceans capacity to store CO₂ by <em>two</em> units (we used up two OH⁻), for every <em>one</em> unit carbon we’ve precipitated.\nSince we’ve only removed one mol of carbon from the ocean, another unit of carbon will be released to the atmosphere.</p>\n\n<h2 id=\"making-alkalinity\">Making alkalinity</h2>\n\n<p>Ok, but what if we generated new OH⁻ (i.e. alkalinity) in some way (for example using electrochemistry, like \nthe <a href=\"https://en.wikipedia.org/wiki/Chloralkali_process\">Chlor Alkali</a> process or by mining alkaline minerals) - could we use those to precipitate CaCO₃ and lock down CO₂ ?\nYes, absolutely that would work. For every two moles of OH⁻ you could lock down one mol of carbon:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code> Ca²⁺ + CO₂ + 2OH⁻ → CaCO₃ + H₂O\n</code></pre></div></div>\n\n<p>But, wait! There’s an even better thing you could do. You could simply add the alkalinity to the ocean and <em>not</em> precipitate any calcium carbonate. As we discussed earlier that would\nraise the oceans capacity to absorb CO₂ by two moles! Now you’re getting twice the bang for your buck: every mol of OH⁻ pulls down one mol of carbon! (actually the true number is a little lower, about 0.85 or so, for complicated reasons we won’t go into here).\nWhy ? Because in the ocean most of the carbon is stored as bicarbonate instead of carbonate, and to convert a CO₂ to HCO₃⁻ you only need <em>one</em> OH⁻:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code> CO₂ + OH⁻ → HCO₃⁻ \n</code></pre></div></div>\n\n<p>Note that storing CO₂ in the ocean this way doesn’t acidify the ocean, since we have added the necessary alkalinity to go with it.\nThere are many research proposals out there looking at the various ways to add alkalinity to the ocean to counteract it’s acidification and provide capacity to store the excess CO₂ in a pH neutral way. To learn more, this is a good place to start: <a href=\"https://agupubs.onlinelibrary.wiley.com/doi/10.1002/2016RG000533\">Assessing ocean alkalinity for carbon sequestration</a></p>",
  "pubDate": "Thu, 01 Jul 2021 00:00:00 +0000",
  "link": "http://mtyka.github.io//climate/2021/07/01/calcium-carbonate.html",
  "guid": "http://mtyka.github.io//climate/2021/07/01/calcium-carbonate.html",
  "category": "climate"
}