{
  "id": "yt:video:nD2o8bJCDkI",
  "yt:videoId": "nD2o8bJCDkI",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Why Does Everyone Suddenly Hate Netflix?",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-14T19:00:28+00:00",
  "updated": "2022-10-17T19:12:32+00:00",
  "media:group": {
    "media:title": "Why Does Everyone Suddenly Hate Netflix?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "By now, I’m sure that you’re aware that Netflix stock has been getting crushed. A lot of the selloff can be attributed to the market downturn but not all of it. Fundamental struggles within Netflix have definitely resulted in the stock performing even worse. Usually, the average person is indifferent about such downturns, but with Netflix, it actually seems like the average person is happy. They almost have this attitude of Netflix got what they deserved. The top complaint is usually that Netflix’s content library isn’t that great for how much they're charging. But, it seems like this problem is much more deep-rooted than that. The truth is that there is objectively no streaming service that is better than Netflix. In fact, when surveyed about which platform people would choose if they could only have one, Netflix won by a long shot. So, clearly, content alone is not the problem. Rather the problem seems to be that streaming is no longer the antithesis of cable/satellite television. One of the biggest selling points of Netflix was that it could offer great movies and TVs for a cheaper price with no ads. But, nowadays between all the streaming platforms that you need to get and all the ads you have to watch, it almost feels like we’re back to ground 0. And the service that people blame for this regression is Netflix. This video explains why everyone suddenly hates Netflix and why they’re happy that Netflix is doing badly. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - The State Of Netflix\n1:45 - The Case For Netflix\n4:57 - What People Really Hate\n7:54 - The New Normal\n11:01 - The Future Of Netflix\n\nResources: \nhttps://pastebin.com/7AkxusAc",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}