{
  "title": "Election Reform: Is History Repeating? A Q&#038;A with Jack Santucci",
  "link": "https://www.aei.org/politics-and-public-opinion/election-reform-is-history-repeating-a-qa-with-jack-santucci/",
  "dc:creator": "George Pierson",
  "pubDate": "Mon, 31 Oct 2022 10:00:00 +0000",
  "category": [
    "Elections",
    "Politics and Public Opinion",
    "Election reform",
    "Election reform Q&A"
  ],
  "guid": "https://www.aei.org/?p=1008663815",
  "description": "<p>With the rise of Americans who are unhappy with the quality of government, calls for election reform have increased. Dr. Jack Santucci answers questions about some commonly proposed reforms and election concerns.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/election-reform-is-history-repeating-a-qa-with-jack-santucci/\">Election Reform: Is History Repeating? A Q&#038;A with Jack Santucci</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"284\" src=\"https://www.aei.org/wp-content/uploads/2021/05/Kosar-Series-Banner_1-1024x284.jpg?x91208\" alt=\"\" class=\"wp-image-1008601867\"/></figure>\n\n\n\n<p>Many Americans are unhappy with the quality of governance and the two major parties. Last month, <a href=\"https://news.gallup.com/poll/15370/party-affiliation.aspx\" target=\"_blank\" rel=\"noreferrer noopener\">43 percent of Americans</a> surveyed by Gallup declared themselves independents. Unsurprisingly, public dissatisfaction has coincided with calls to reform elections, including nonpartisan primaries, ranked-choice voting, and other systems.</p>\n\n\n\n<p>We have been here before. Dr. Jack Santucci’s new book, <a href=\"https://amzn.to/3swdSWF\" target=\"_blank\" rel=\"noreferrer noopener\">More Parties or No Parties: The Politics of Electoral Reform in America</a> (Oxford University Press), tells the story of the election reform movement of a century ago. While history is not quite repeating, it may be rhyming. I recently caught up with Jack, an assistant teaching professor of politics at Drexel University, to get his take on the state of play.</p>\n\n\n\n<p><strong>Your book begins with a tweet by Mark Cuban: “</strong><a href=\"https://twitter.com/mcuban/status/1319287043311063041\" target=\"_blank\" rel=\"noreferrer noopener\">The solution is walking away from parties</a><strong>, expanding ranked-choice voting, hopefully leading to more independent legislators.” This sentiment was in the air a century ago, wasn’t it?</strong></p>\n\n\n\n<p>Yes, in the mid-1890s, the Gilded Age party system started falling apart. Some of this turns up as third-party activity, mainly on the left (e.g., People’s Party, flavors of Socialism). Another group of Americans targeted parties <em>in general</em>. These mugwumps tended to speak in terms of anti-corruption and <a href=\"https://catalog.hathitrust.org/Record/001140455\" target=\"_blank\" rel=\"noreferrer noopener\">disliked</a> party discipline at all levels of government.</p>\n\n\n\n<p><strong>One major reform movement, which your book details, pushed to enact reforms that sound a lot like what gets called “ranked-choice voting” today.</strong></p>\n\n\n\n<p>The <a href=\"https://doi.org/10.17645/pag.v9i2.3955\" target=\"_blank\" rel=\"noreferrer noopener\">set of reforms</a> we call “ranked-choice voting” (RCV) was known as “preferential voting” or “the preferential ballot.” Preferential voting came in three basic flavors, two of which are still around. One was an attempt to <a href=\"https://books.google.com/books?id=hftm7pqI9a0C&newbks=1&newbks_redir=0&lpg=PA231&dq=american%2520direct%2520primary%2520alternative%2520vote&pg=PA231#v=onepage&q=american%2520direct%2520primary%2520alternative%2520vote&f=false\" target=\"_blank\" rel=\"noreferrer noopener\">manage factionalism</a> in party primaries, which also were new at the time. Another was part of a larger effort to restructure city governments, mainly by adopting at-large elections, and allowed the majority faction to win every seat in council. The third attempted to improve on the second by giving seats to one or more numerical minorities. Political scientists call the third version single transferable vote (STV). Reformers now call it proportional RCV.</p>\n\n\n\n<p>Overall, RCV was part of the movement for nonpartisan elections. Supporters <a href=\"https://doi.org/10.1002/ncr.4110030316\" target=\"_blank\" rel=\"noreferrer noopener\">made</a> <a href=\"https://doi.org/10.1002/ncr.4110010306\" target=\"_blank\" rel=\"noreferrer noopener\">arguments</a> we again hear today: more choice for voters, lower barriers to candidates, no gatekeeping by “bosses,” more positive campaigns, cost savings from getting rid of primaries, etc. One advocate even <a href=\"https://www.jstor.org/stable/1011423\" target=\"_blank\" rel=\"noreferrer noopener\">wrote</a> that the nonpartisan, ranked-choice ballot “results practically in an educational qualification for voters, and greatly reduces the number of ignorant and corrupt votes.” They felt parties were in the way of “good government,” and the solution was a better algorithm.</p>\n\n\n\n<p><strong>Many cities and some states made these changes—61 or more, according to your book. But these reforms got rolled back by politics. What happened?</strong></p>\n\n\n\n<p>One way to understand the reform trajectory is in terms of ‘shifting coalitions.’ Party systems are changing all the time, but sometimes the change accelerates. Modern examples might be ‘education polarization’ or recent rates of vote switching.</p>\n\n\n\n<p>If reform is about getting (or keeping) control of government, <a href=\"https://doi.org/10.1007/s10602-021-09326-w\" target=\"_blank\" rel=\"noreferrer noopener\">a</a> <a href=\"https://press.uchicago.edu/ucp/books/book/chicago/W/bo11315021.html\" target=\"_blank\" rel=\"noreferrer noopener\">simple</a> <a href=\"https://doi.org/10.1017/CBO9781139814775\" target=\"_blank\" rel=\"noreferrer noopener\">model</a> implies three reform types: an existing coalition seeks to <em>insulate</em> itself, some coalition-in-waiting seeks to <em>realign</em> the party system, and opposing sides of the aisle seek to <em>polarize</em> politics because some middle is (or has become) unpredictable.</p>\n\n\n\n<p>My book focused on the STV cases. Broadly, STV came from a party alignment in which activists disliked parties. Not all reformers felt that way, but in 1913, the mugwumps blocked <a href=\"https://www.aei.org/politics-and-public-opinion/what-is-the-one-vote-system-a-qa-with-jack-santucci/\" target=\"_blank\" rel=\"noreferrer noopener\">proportional representation based on party lists</a>. Two-dozen cities went on to adopt STV. It did not produce a multiparty system. STV held firm as long as reformers could reinvent the corruption issue and keep it salient. They even formed good government parties to do so, but new issues pulled them apart. Case specifics vary, but one frequent factor was major-party leadership quitting the good-government alliance. STV then got repealed in <em>polarizing</em> fashion.</p>\n\n\n\n<p>What about the other types of RCV? In <a href=\"https://www.jstor.org/stable/42879396\" target=\"_blank\" rel=\"noreferrer noopener\">party primaries</a>, it went away quietly or got replaced by runoffs. In local government, however, the non-RCV reforms persisted: nonpartisan, at-large elections to small city councils.</p>\n\n\n\n<p><strong>Fast-forward to today. Democracies don’t work without parties, right? So, in thinking about election reform should we aim to improve the two party system or go for more parties?</strong></p>\n\n\n\n<p>I don’t think we can pull multiparty politics out of a hat—especially the <a href=\"https://www.newamerica.org/political-reform/reports/political-parties-good-for/the-development-and-decay-of-democracy\" target=\"_blank\" rel=\"noreferrer noopener\">left-wing sort</a> that <a href=\"https://journals.sagepub.com/doi/full/10.1177/0010414018762369\" target=\"_blank\" rel=\"noreferrer noopener\">catalyzed</a> <a href=\"https://doi.org/10.1017/S1755773919000225\" target=\"_blank\" rel=\"noreferrer noopener\">reform</a> in other countries. That leaves us with no reform at all, or with the independent-politics reforms we’re again seeing. We should be prepared for those reforms to get repealed and take care to not combine them with features we might regret.</p>\n\n\n\n<p>More broadly, there should be less fear of multiparty politics. The old instability arguments <a href=\"https://www.journals.uchicago.edu/doi/abs/10.1086/708937\" target=\"_blank\" rel=\"noreferrer noopener\">don’t hold up</a> <a href=\"https://doi.org/10.12987/9780300210705\" target=\"_blank\" rel=\"noreferrer noopener\">in most cases</a>, and the factional politics described in my book were anything but stable.</p>\n\n\n\n<p><strong>Thank you, Jack.</strong></p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/op-eds/americas-fiscal-stewards-have-left-their-stations/\">America’s Fiscal Stewards Have Left Their Stations</a> | <a href=\"https://www.aei.org/op-eds/to-win-more-seats-in-congress-the-gop-must-rethink-primaries/\">To Win More Seats in Congress, the GOP Must Rethink Primaries</a> | <a href=\"https://www.aei.org/op-eds/alaskas-election-results-do-not-discredit-final-four-voting%ef%bf%bc/\">Alaska’s Election Results Do Not Discredit ‘Final Four’ Voting</a> | <a href=\"https://www.aei.org/uncategorized/whats-going-on-with-ranked-choice-voting-in-utah-a-qa-with-derek-monson/\">What’s Going On with Ranked Choice Voting in Utah? A Q&A with Derek Monson</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/election-reform-is-history-repeating-a-qa-with-jack-santucci/\">Election Reform: Is History Repeating? A Q&#038;A with Jack Santucci</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}