{
  "title": "Coping With Loss | True Ghost Stories",
  "link": "https://audioboom.com/posts/8120711",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1843,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What happens when one is forced to cope with a shocking loss, only to have the very person who passed, return from the grave? Here is a preview of the story. “A few years went by, and he passed away in a terrible motorcycle accident. A few days after he pasted, my wife and I thought about what we could do to try and cope with the loss. We decided to go to one of the fishing holes that he and I always fished at, in honor of him. When we pulled up, we started walking the trail that led into the woods and a couple miles down there was a small lake. As we reached the lake a giant coyote came walking out of the trees. He did not seem angry or want to mess with us. He just looked at us for a few minutes and went about his way down the shoreline. I remember my stepbrother loving coyotes, he even had a tattoo of one and right then I knew it was him giving me a sign. Fast forward to present day. That was a couple years ago now. Just the other day I was listening to your show, it was around 8 AM. I remember you and carol, and it was the episode a woman was talking about how a rainbow reminded her of someone she loved and as she is saying this, I am thinking about the time I seen the coyote. I had GPS on because I was trying reach a destination around an area I did not know very well. My GPS started rendering and saying,\" rerouting \" \" rererouting\", finally it told me take a right in 100 feet. I slowed down in a panic and the safest way possible. Then it started rendering again. I was a little frustrated, so I pulled over in the nearest drive I seen. It was a large iron gate; I then exited out of GPS and opened the app back up. It corrected itself so I put my car in reverse and looked back up.” Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a> If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802! If you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a> Follow Tony: Instagram: <a href=\"http://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a> TikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a> Facebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski<br>\n</a><br>\n\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 17 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-14:/posts/8120711",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}