{
  "title": "Why Hayek Matters with Pete Boettke",
  "pubDate": "Sat, 01 Sep 2018 15:32:59 +0000",
  "guid": "2910d220c99a460fae630745257656ef",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP105Boettke_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href=\"https://www.peter-boettke.com/\" target=\"_blank\" rel=\"noopener\">Peter Boettke</a> of George Mason University and we're discussing his recent book in the Great Thinkers in Economics series: <a href= \"https://www.palgrave.com/in/book/9781137411594\" target=\"_blank\" rel=\"noopener\">F. A. Hayek: Economics, Political Economy and Social Philosophy</a>.</p> <blockquote>This book explores the life and work of Austrian-British economist, political economist, and social philosopher, Friedrich Hayek. Set within a context of the recent financial crisis, alongside the renewed interest in Hayek and the Hayek-Keynes debate, the book introduces the main themes of Hayek’s thought. These include the division of knowledge, the importance of rules, the problems with planning and economic management, and the role of constitutional constraints in enabling the emergence of unplanned order in the market by limiting the perverse incentives and distortions in information often associated with political discretion. Key to understanding Hayek's development as a thinker is his emphasis on the knowledge problem that economic decision makers face and how alternative institutional arrangements either hinder or assist them in overcoming that epistemic dilemma. Hayek saw order emerging from individual action and responsibility under the appropriate institutional order that itself emerges from actors discovering new and better ways to coordinate their behavior. This book will be of interest to all those keen to gain a deeper understanding of this great 20th century thinker in economics.</blockquote> <hr /> <p>Note for those interested in buying the book: IF you are at a university and your university library has the Springer subscription (which most do), you can order a print-on-demand version---MyCopy---for $25, so that makes it somewhat more reasonable than the library prices. You can also get a discount flyer <a href= \"http://www.coordinationproblem.org/2018/08/coming-to-a-library-near-you.html\" target=\"_blank\" rel=\"noopener\">here</a>.</p>",
  "content:encoded": "<p>Today's guest is <a href=\"https://www.peter-boettke.com/\" target=\"_blank\" rel=\"noopener\">Peter Boettke</a> of George Mason University and we're discussing his recent book in the Great Thinkers in Economics series: <a href= \"https://www.palgrave.com/in/book/9781137411594\" target=\"_blank\" rel=\"noopener\">F. A. Hayek: Economics, Political Economy and Social Philosophy</a>.</p> This book explores the life and work of Austrian-British economist, political economist, and social philosopher, Friedrich Hayek. Set within a context of the recent financial crisis, alongside the renewed interest in Hayek and the Hayek-Keynes debate, the book introduces the main themes of Hayek’s thought. These include the division of knowledge, the importance of rules, the problems with planning and economic management, and the role of constitutional constraints in enabling the emergence of unplanned order in the market by limiting the perverse incentives and distortions in information often associated with political discretion. Key to understanding Hayek's development as a thinker is his emphasis on the knowledge problem that economic decision makers face and how alternative institutional arrangements either hinder or assist them in overcoming that epistemic dilemma. Hayek saw order emerging from individual action and responsibility under the appropriate institutional order that itself emerges from actors discovering new and better ways to coordinate their behavior. This book will be of interest to all those keen to gain a deeper understanding of this great 20th century thinker in economics.  <p>Note for those interested in buying the book: IF you are at a university and your university library has the Springer subscription (which most do), you can order a print-on-demand version---MyCopy---for $25, so that makes it somewhat more reasonable than the library prices. You can also get a discount flyer <a href= \"http://www.coordinationproblem.org/2018/08/coming-to-a-library-near-you.html\" target=\"_blank\" rel=\"noopener\">here</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:05:53",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of George Mason University and we're discussing his recent book in the Great Thinkers in Economics series: . This book explores the life and work of Austrian-British economist, political economist, and social philosopher, Friedrich...",
  "itunes:episode": 105,
  "itunes:episodeType": "full"
}