{
  "title": "S14 Ep64: The Holy Water Incident",
  "link": "https://audioboom.com/posts/8098566",
  "itunes:episode": 64,
  "itunes:title": "The Holy Water Incident",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4879,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS is waist deep in The Holy Water Incident: The True Story of a Daughter's Possession and Exorcism with guest William Dorian<br>\n<br>\nWilliam Dorian and his daughter Brittany learned the hard way that demonic possession is very real. <br>\n<br>\nBeginning with an innocent session with a spirit communication board and building in intensity to the point where multiple demons take hold of an innocent teenager's life, our guest shines a light on the traumatic wounds a possession can inflict ... and the extreme measures a family will take to save their daughter from evil entities that are hell-bent on chaos and destruction<br>\n<br>\nGet the book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS is waist deep in The Holy Water Incident: The True Story of a Daughter's Possession and Exorcism with guest William Dorian\n\nWilliam Dorian and his daughter Brittany learned the hard way that demonic possession is...",
  "pubDate": "Sun, 04 Aug 2019 08:00:00 +0000",
  "guid": "3694258d-d83e-4230-96f8-412261d10771",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}