{
  "title": "147: Atlanta Child Murders: Part 1",
  "link": "https://audioboom.com/posts/7672082",
  "itunes:episode": 147,
  "itunes:title": "Atlanta Child Murders: Part 1",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2753,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>From 1979 - 1981, a string of murder of black children terrorized the city of Atlanta, igniting terror and frustration from a community that increasingly feels neglected. Is it the work of the KKK or a cold blooded serial killer? After years of dead ends, the police get creative and stop a man on a bridge just after 3 am. Did he just dump a body? Could he be their guy?<strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><strong><br>\n</strong><br>\n<strong>AM!! WE LAUNCHED A NEW PODCAST!! </strong><a href=\"https://www.unjustandunsolved.com/post/preview-unjust-and-unsolved\">Check out the trailer for \"Unjust and Unsolved\" with investigative journalist Maggie Freleng. </a>\"Unjust and Unsolved\" is a podcast about wrongful convictions. Each episode tells the story of a wrongfully convicted person who was convicted of a very serious crime despite substantial evidence pointing away from their guilt. The stories are told through Maggie's original interviews with the convicted, their loved ones and lawyers, exhaustive investigative work, and news footage. Maggie also tells the story of the crime, details how the person was convicted, and lays out all the evidence. <strong>FIND AND SUBSCRIBE TO \"UNJUST AND UNSOLVED WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 01 Sep 2020 09:50:33 +0000",
  "guid": "tag:audioboom.com,2020-09-01:/posts/7672082",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}