{
  "title": "Are Robots and AI Really Going to Displace All Workers? Probably Not",
  "link": "https://mises.org/node/60748",
  "description": "<p>Among the components of the World Economic Forum’s <a href=\"https://www.weforum.org/great-reset/\">Great Reset</a> are a drastically reduced population and the replacement of human labor with robots and artificial intelligence (AI). The question immediately comes to mind: can robots and AI really make all the stuff for the elites after they have gotten rid of the people?</p>\n<p>Because a plan has been formulated and described does not mean that it is possible to realize. The plan may contradict laws of logic or reality, or assume the existence of resources that do not exist.</p>\n<p>Podcaster and journalist James Delingpole, <a href=\"HYPERLINK%20%22https:/delingpole.podbean.com/e/whitney-webb/%22\">speaking</a> to investigative journalist Whitney Webb on October 23, 2021, discussed this topic with his guest. I have transcribed several minutes from their conversation, edited for concision:</p>\n<blockquote><p><strong>Webb</strong>: The fourth industrial revolution. One of the main pillars of that is automation and artificial intelligence. We’ve already seen that with corporate behemoths, like Amazon’s efforts to replace human workers with robots. Starbucks is piloting their AI barista with plans to have at least one in most if not all locations…. How long until humans are gone entirely? That’s in a retail setting.</p>\n<p>In the UK Tesco recently joined the cashier less checkout. It’s all done on your phone. You scan when you enter the store. Everything is tied to you, your unique digital identifier with the corporation. You can just walk out of the store. How convenient that you didn’t have to walk by a cashier at all.</p>\n<p>We’re going to see this happen in big ways in manufacturing. Chile is one of the biggest producers of copper in the world. In the northern part of Chile, the economy is driven by mining…. They are automating the mining here [in Chile]. Most of Chile’s middle class in the north work in the mining industry. They are about to all be cut out….</p>\n<p>It’s infinitely more profitable for a corporation to make an initial investment in a robot or an AI algorithm than to continuously pay a worker. Not have to deal with sick pay. There are efforts all over the world to demand better worker benefits. Better hours. Robots are the ultimate worker for a lot of these people because they are not interested in the human equation of things. There is a move to a human-free future coupled with anti-human rhetoric.</p></blockquote>\n<p>The substitution of machines for human labor is a process that has been going on since the first industrial revolution. A considerable amount of manufacturing is already done by robots. But does it matter if a machine is a robot or not? Telecommunications switches connect calls that used to be done by <a href=\"https://en.wikipedia.org/wiki/Hello_Girls\">telephone operators</a>. We do not identify these machines as robots (perhaps because <a href=\"https://www.spectrumvoip.com/network-switch-pbx/\">they do not have a recognizable torso and limbs</a> or perhaps because they perform their work on data rather than physical objects) but the impact on the demand for labor to perform those tasks is the same.</p>\n<p>Contrary to Webb, it is not “infinitely more profitable” for a corporation to use an AI-powered robot in place of a person. Profitability is a calculation that depends on the price of the robot, the productivity of the robot, the wages of the person and the productivity of the human worker.</p>\n<p>The substitution of capital for labor makes economic sense when the cost of the capital goods per unit value of output—including paying for the entire supply chain—is less than the wages of the person that is replaced.</p>\n<p>Yes, workers are paid wages. However, robots and other machines are themselves not free goods. They must be designed, tested, and maintained. They are made of many parts which must be manufactured and transported. The manufacturing process is performed by some combination of people and other machines. The parts are ultimately made from materials that are mostly mined or extracted from the earth, also by men and machines.</p>\n<p>Workers prefer better working conditions over worse. And for machines as well there are optimal working conditions. A truck that is driven on poor roads in bad weather will wear out or break down more quickly. Computers need a carefully tuned environment that is temperature and humidity controlled. Computer servers are housed in a complex capital good known as a “data center.”</p>\n<p>The wages that are required to hire the workers are determined on the labor market, by the various competing uses for each person’s skills. If the cost of the robot is less than the worker, that is only because their labor is more urgently demanded doing something else. There is a greater need for human labor somewhere else in the world.</p>\n<p>AI itself is not inexpensive. Building and running AI requires engineering effort and computing resources such as networks, servers, and storage. AI models are trained by data that must originate with the same human intelligence that the AI is trying to reproduce. If you want to train AI to recognize photographs of cats, someone must have taken the photographs and classified them as cats or “not cats” so that the AI can be validated. If the photos come from security cameras, someone must have installed the cameras.</p>\n<p>After the model is built it must be maintained. AI models do not run perfectly forever. They must be monitored for drift, and it requires a human to determine if the drift is due to an error in the ingestion of data, such as a change in units, or a true change in the customer preferences that the model is trying to extract. In the latter case, the model must be retrained on a new data set.</p>\n<p>Modern computer systems are built with some degree of self-diagnosing and self-repairing abilities. But the automation must punt all but the most straightforward cases into a call for help that brings a human into the process. Humans are necessary to diagnose problems and restore service when something has gone wrong.</p>\n<p>The manufacture of machines such as robots requires a complex structure of production with perhaps tens of thousands of individual parts. Each part must be designed—by a person—manufactured and integrated with the other parts. The integrations, including isolating manufacturing defects, must be tested, and debugged.</p>\n<p>Parts are transported by industries such as shipping and trucking. All of these steps involve combinations of labor and capital goods. It is true that people take sick days, however, machines break, wear out, and, and require repairs. The humans who repair the machines also have kids and take sick days. If you need to send the robot out for service, a mover will pack it up and load it on a truck. Self-driving cars? Maybe someday, <a href=\"https://www.bloomberg.com/news/features/2022-10-06/even-after-100-billion-self-driving-cars-are-going-nowhere\">but not any day soon</a>.</p>\n<p>Robots and made out of metals, which are mined out of the ground. Mineral deposits are not straightforward to find, to delineate and to mine. The discovery and extraction of mineral resources is a tremendously high-intellect activity. A small number of exploration geologists—many with doctoral degrees in fields such as geology and geophysics—have discovered a disproportionate fraction of mineable mineral deposits. Without labor, where would the metals come from to build the robots?</p>\n<p>Someone like Webb might respond that robots will replace all of these functions as well. And some day, they might. However, the replacement of humans by machines for one task creates a need for labor—with different skills—to operate the machines. That is why we now have jobs for truckers, power plant operators, and machinists instead of wood cutters.</p>\n<p>If miners were replaced with robots—how much labor would be required to build the robots including the entire supply chain, transportation, and the energy used to run them? It’s hard to say but a fraction of the impact would be shifts in the type of employment.</p>\n<p>Has the substitution of capital for human labor over the centuries since the industrial revolution has reduced overall employment? Not so much. We have far more need for labor now because we have accumulated so much capital and require more labor to operate it. The human population has increased—in lockstep with the demand for human labor—because we are so much more productive with our enormous legacy of capital goods that we can support much more population.</p>\n<p>Replacing the most routine and repeatable human labor with machines creates demand for the currently irreplaceable types of labor: creativity and problem-solving skills. It is true that boundaries of what machines can do expands over time. For example, voice recognition, which used to be quite poor, now handles a range of accents much better. However, AI is still at a point where it can at best replicate human learning by observing many samples created by humans. But for anyone who has tried to change their airline ticket by talking to a chat bot, it is clear that AI is at present limited to a standardized set of tasks.</p>\n<p>As we can afford it, out of our accumulated savings, capitalists will continue to invest in robots and other forms of automation to replace workers. When this results in cost savings, that means more output at a lower cost, and a rising standard of living. As certain goods become cheaper to manufacture, workers can demand other, new and different goods and services, which feeds the indirect demand for labor in those industries.</p>\n\n",
  "author": "Robert Blumen",
  "enclosure": "",
  "guid": 60748,
  "pubDate": "Sat, 05 Nov 2022 06:00:00 -0500",
  "source": "Mises Wire"
}