{
  "title": "Episode #382:  Truth Or Consequences",
  "link": "https://www.krpoliticaljunkie.com/episode-382-truth-or-consequences/",
  "pubDate": "Wed, 16 Feb 2022 23:42:26 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=21991",
  "description": "<p>The health of a New Mexico Democrat becomes critical in a Senate that is split 50-50.  And Mike Pence, who spent four years as a compliant vice president, surprised many with his break from Donald Trump over the correct course of action on that fateful Jan. 6th day.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-382-truth-or-consequences/\">Episode #382:  Truth Or Consequences</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "The health of a New Mexico Democrat becomes critical in a Senate that is split 50-50.  And Mike Pence, who spent four years as a compliant vice president, surprised many with his break from Donald Trump over the correct course of action on that fateful...",
  "itunes:summary": "With the Senate tied at 50-50 and a crucial Supreme Court confirmation vote coming up, the last thing the Democrats wanted, politically, was to see one of its own, New Mexico&#8217;s Ben Ray Lujan, sent to the hospital with a stroke.  New Mexico political blogger Joe Monahan sums up the dilemma facing a party that can&#8217;t afford to lose even one of its members.<br />\nAnd Joel Goldstein, a preeminent expert on the vice presidency, sums up Mike Pence&#8217;s decision to declare Donald Trump &#8220;wrong&#8221; for thinking he could pressure him into altering the 2020 electoral college results, something Trump had been insisting on as part of his effort to undo the election that made Joe Biden president.<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 382,
  "itunes:title": "Truth Or Consequences",
  "itunes:duration": "31:25"
}