{
  "title": "China moves to take control of private tech firms with 'joint venture' deals",
  "description": "The move is a significant departure from market-oriented economic policies of the last four decades, analysts say.",
  "link": "https://www.rfa.org/english/news/china/ventures-11042022140146.html",
  "guid": "https://www.rfa.org/english/news/china/ventures-11042022140146.html",
  "author": "By Gu Ting and Hwang Chun-mei for RFA Mandarin, Cheryl Tung for RFA Cantonese",
  "media:content": {
    "media:description": "A man walks past the Tencent headquarters in Shenzhen, in China's southern Guangdong province, July 10, 2022.",
    "media:credit": "AFP"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">In a major departure from the market-oriented economic policy of the past 40 years, the Chinese Communist Party is moving to take greater control of technology and telecoms companies, with a return to the era of \"joint ventures\" between the state and private sector.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">China's market regulatory body approved a new joint venture between the investment arm of state-owned telecoms giant China Unicom and tech giant Tencent, the agency said in an announcement on its official website last week.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The joint venture was \"based on the strategic needs of the company’s comprehensive advancement into the digital economy,\" according to statements filed by China Unicom to the Shanghai and Hong Kong stock exchanges.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Tencent brings to the deal a massive amount of data gleaned from its WeChat super app that provides social media, payments and messaging services to 1.4 billion people in China and beyond.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">However, Unicom Innovation Venture Capital will hold a 48% stake compared with Tencent subsidiary Shenzhen Tencent Industry Venture Capital's 42% stake, the state-run Global Times newspaper reported.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Meanwhile, the Shanghai subsidiary of China Mobile signed a strategic cooperation agreement on Nov. 1 with e-commerce giant JD.com's subsidiary JD Technology.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The goal of that joint venture is smart city technology, digital governance, big data and communications, Shanghai Securities News reported.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Sources familiar with the private sector in China said further similar deals are expected by year's end, with major private tech firms assigned a state-owned \"partner,\" meaning the state will effectively take control of at least some of their assets.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">The move follows a </span><a href=\"https://www.rfa.org/english/news/china/tech-crackdown-09062021151158.html\"><span style=\"font-weight: 400;\">regulatory crackdown on privately owned tech giants</span></a><span style=\"font-weight: 400;\"> in recent years. </span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">In July 2021, state-owned assets spokesman Peng Huagang said his agency would press ahead with </span><a href=\"https://www.rfa.org/english/news/china/tech-07192021134345.html\"><span style=\"font-weight: 400;\">\"mergers\" between private sector and state-owned companies</span></a><span style=\"font-weight: 400;\">, with takeovers implemented both by paid acquisitions and uncompensated nationalization, as well as share transfers. </span></p>\n<p></p>\n<figure><img alt=\"ENG_CHN_PlannedEconomy_11042022.2.JPG\" class=\"image-richtext image-inline\" src=\"https://www.rfa.org/english/news/china/eng_chn_plannedeconomy_11042022-2.jpg/@@images/890c15aa-72f4-44e4-9d8f-d4631903b064.jpeg\" title=\"ENG_CHN_PlannedEconomy_11042022.2.JPG\"/>\n<figcaption>Huang Guangyu, chairman of GOME Electrical Appliances Holding Ltd., shown in this 2006 file photo, and his wife are selling off their shares in their private retail empire GOME. Credit: Reuters</figcaption>\n</figure>\n<p><b>Accelerating nationalization</b></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Hangzhou-based scholar Chang Yu said the nationalization process now appears to be accelerating in the wake of the Chinese Communist Party's 20th National Congress last month. </span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"Everyone knows that this public-private 'partnership' only works in one direction,\" Chang told RFA. \"Even before the party congress, the government was moving against [what they termed] the disorderly expansion of capital, and stopped allowing private companies to expand.\"</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"Now the party congress is over, they can speed up that process and take more drastic steps.\"</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Beijing-based commentator Wu Qiang said the moves are another indicator that Chinese leader Xi Jinping is taking China away from the market reforms introduced by late supreme leader Deng Xiaoping in 1979, and in the direction of a state-controlled economy similar to that of the Mao era.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"This heralds an era of a planned economy as mentioned in [Xi Jinping's] report to the 20th party congress,\" Wu told RFA. \"This will place private capital, particularly Tencent and JD.com, under the control of the government in Beijing.\"</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"Looking at the shareholding structure, it seems to be a hybrid kind of joint venture driven by ideology,\" he said.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Wu said it was made clear during the party congress that nobody should be lobbying to protect or endorse major private companies.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"The last protections and lobbying [attempts] for these huge online platforms have been removed,\" he said.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Current affairs commentator Ma Ju said the purpose of the joint ventures was to ensure state control of resources and technology.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"The aim of the cooperation agreements between China Unicom and Tencent and China Mobile and JD.com is [state] control over the flow of information and materials,\" Ma told RFA. \"For [the Chinese Communist Party], anything relating to the internet is a matter of national security.\"</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"They are controlling these companies in exactly the way they did back in 1953, through public-private 'partnerships,’\" he said.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Political commentator Jiang Feng said some private companies could eventually be eliminated.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"Private enterprises encourage a market economy, which goes against totalitarian rule, so they must be restricted or even eliminated,\" he told RFA's Asia Wants to Talk chat show.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"They are laying the groundwork for a command economy.\"</span></p>\n<p></p>\n<p><b>China’s wealthy looking for an out</b></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Reports are emerging that China's wealthiest people are getting the message, with home electronics magnate Huang Guangyu and his wife selling off their shares in their private retail empire GOME, cashing out to the tune of H.K. $960 million (U.S. $122.3 million) and reducing the size of their stake from 51.5% to 42.8% across the course of this year.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Nanjing-based retailer Xu Jing said many wealthy business owners are highly pessimistic about their future in China, and will leave if they can.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"Wanting to leave and being allowed to leave aren't necessarily the same thing ... because [entrepreneurs may now be] on a government [border] control list because they have a lot of debt,\" Xu said. \"Particularly real estate bosses.\"</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Changsha-based real estate insider Tian Hui gave a similar account. \"Business is not good now; earnings are low, yet expenditures are ongoing,\" he said. \"Returns are too slow, and there are bank loans [to pay back].\"</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"[The wealthy] have been selling off famous artworks and properties ever since 2019, and they are taking the money to the United States to buy land and build properties there,\" he said.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Scholar Ma Hong said in a joking reference to a 1980s Chinese rock anthem by Cui Jian, \"Rock and Roll on the New Long March.\" </span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">\"These rich people and bigwigs are all heading out on the new Long March, because now the government is promoting socialism in the new era,\" Ma said.</span></p>\n<p></p>\n<p><b><i>Translated and edited by Luisetta Mudie.</i></b></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 14:03:04 -0400"
}