{
  "id": "https://bibleinoneyear.org/en/youth/249",
  "title": "Day 249: How to Love Your Lord",
  "description": "Psalm 105:39–44,45, Isaiah 10:20, 11:1–4,6,9, 2 Corinthians 8:16,18–21, 22-24.  The New Testament understanding of the Lord helps us interpret the Old Testament use of ‘The LORD’  The Old Testament enriches our understanding of what the New Testament means when it speaks of ‘The LORD’",
  "pubDate": "Mon, 06 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/249/?ignore",
  "itunes:duration": "13:54",
  "guid": "enyouth06092021-249",
  "length": 834.56,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 249: How to Love Your Lord",
  "itunes:subtitle": "Psalm 105:39–44,45, Isaiah 10:20, 11:1–4,6,9, 2 Corinthians 8:16,18–21, 22-24.  The New Testament understanding of the Lord helps us interpret the Old Testament use of ‘The LORD’  The Old Testament enriches our understanding of what the New Testament means when it speaks of ‘The LORD’",
  "itunes:summary": "What was wrong with these people? Were they weird? Was it a cult? What was this strange expression they seemed to use?\nOf course, I knew that God or even Jesus could be called ‘Lord’, but never before had I heard God referred to so often by a group of people as ‘The Lord’. In the years since then, as I have studied the Bible, I have begun to understand why these Christians, whom I first met at university, used this expression so often: they loved their Lord! Now he is my Lord. I, too, love the Lord.\n‘The LORD’ is the most common way of referring to God in the Old Testament. When written in capitals, this word translates the Jewish covenant name for God, YHWH. Out of respect for God, Jews do not use the word. Historically, we have often pronounced the word as ‘Jehovah’, when in fact it sounds more like ‘Yahweh’. When the Old Testament was first translated into Greek (c.250 BC) the name YHWH was translated as Kurios (the Lord). This translation is then reflected in the New Testament.\nThe New Testament gives us a more Trinitarian understanding of ‘The LORD’. It makes the remarkable claim that Jesus is the Lord. In fact, whether someone can say ‘Jesus is Lord’ becomes the test of Christian authenticity (1 Corinthians 12:3). It also makes the claim that the Holy Spirit is Lord: ‘Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom’ (2 Corinthians 3:17).\nGod the Father is Lord. God the Son is Lord. God the Holy Spirit is Lord. But there is only one Lord: ‘One Lord… one God’ (Ephesians 4:5–6). The one Trinitarian God is Lord. The New Testament understanding of the Lord helps us interpret the Old Testament use of ‘The LORD’. The Old Testament enriches our understanding of what the New Testament means when it speaks of ‘The LORD’.\nHow can you love your Lord?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 249
}