{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-1314657839423682669",
  "published": "2019-02-21T12:17:00.000-08:00",
  "updated": "2019-02-21T12:17:08.502-08:00",
  "title": "Balance Sheet News",
  "content": "The FOMC minutes for the <a href=\"https://www.federalreserve.gov/monetarypolicy/fomcminutes20190130.htm\">January 29-30 meeting</a>, released yesterday, contain some important information about the Fed's balance sheet, and plans for the FOMC's future operating strategy. Let's unpack this, to try to understand what they're up to.<br /><br />The key information is in the section in the minutes on \"Long Run Monetary Policy Implementation Frameworks.\" This section deals with presentations from staff economists (in part from the previous FOMC meeting), and discussion of that material. The minutes say: <blockquote>The staff briefing also included a discussion of factors relevant in judging the level of reserves that would support the efficient implementation of monetary policy.</blockquote>The key word is \"efficient.\" It's not clear why we would just look at the level of an item on the liabilities side of the Fed's balance sheet to determine what would permit \"efficient\" monetary policy. It's also not clear what \"efficient\" means. But whatever it is, some people seem convinced that the Fed has almost attained it: <blockquote>Some recent survey information and other evidence suggested that reserves might begin to approach an efficient level later this year.</blockquote>So, what to do? <blockquote>Against this backdrop, the staff presented options for substantially slowing the decline in reserves by ending the reduction in asset holdings at some point over the latter half of this year and thereafter holding the size of the SOMA portfolio roughly constant for a time so that the average level of reserves would fall at a very gradual pace reflecting the trend growth in other Federal Reserve liabilities.</blockquote>Note that, at that point in the meeting, this is all coming from staff economists. There's a statement about the objective, which is efficiency, a conclusion that we're close to efficiency, and a recommendation as to what to do once efficiency is achieved. That is, later in the year, the Fed should start buying securities again, so as to maintain the size of the balance sheet at a constant nominal level, until further notice. Ultimately, the minutes indicate that the FOMC agreed to that.<br /><br />What's going on? Total securities held outright by the Fed look like this: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-fo0USnc6bjg/XG3baooZXJI/AAAAAAAADX0/h-Iq5RblmDIgmUP01Lx-RRiuXoTFgZOnACLcBGAs/s1600/securities.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-fo0USnc6bjg/XG3baooZXJI/AAAAAAAADX0/h-Iq5RblmDIgmUP01Lx-RRiuXoTFgZOnACLcBGAs/s640/securities.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>So, in terms of the nominal quantity of securities held, there hasn't really been much \"normalization\" of the asset portfolio. And it's not like we would arrive at a different conclusion if we were to look at total Fed assets as a percentage of GDP: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-NdzsCqJ3vng/XG3cFOPBFhI/AAAAAAAADX8/3_zgFWAEUX8mDoiZgR-seKq_G8cq503EACLcBGAs/s1600/assets-gdp.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-NdzsCqJ3vng/XG3cFOPBFhI/AAAAAAAADX8/3_zgFWAEUX8mDoiZgR-seKq_G8cq503EACLcBGAs/s640/assets-gdp.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>That is, 20% of GDP is lower than the peak of 25% of GDP, but it's a lot higher than the pre-crisis 6%. If 6% was OK before the financial crisis, why is something a little less than 20% \"efficient\" now?<br /><br />It might help to look at what is happening on the liabilities side of the balance sheet. Two key Fed liabilities are currency and reserves, of course, but there are also a couple of weird items that we wouldn't normally be concerned about, which are reverse repos of foreign institutions (including foreign central banks), and the Treasury's general account with the Fed. First, currency: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-K5sJYjuDFWA/XG3evpA1bzI/AAAAAAAADYI/E_e5uSFomfM4AbEzgMp3NbNkEN9DB--9ACLcBGAs/s1600/currency.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-K5sJYjuDFWA/XG3evpA1bzI/AAAAAAAADYI/E_e5uSFomfM4AbEzgMp3NbNkEN9DB--9ACLcBGAs/s640/currency.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>The stock of currency in circulation has more than doubled in nominal terms since before the last recession. Even more impressive is what we see if we look at the currency/GDP ratio:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-YkhMtfvjTJE/XG3fLxfbHzI/AAAAAAAADYQ/Z8gCKxfryEwFMKK3DYE2eohYekqw2BLIQCLcBGAs/s1600/currency-gdp.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-YkhMtfvjTJE/XG3fLxfbHzI/AAAAAAAADYQ/Z8gCKxfryEwFMKK3DYE2eohYekqw2BLIQCLcBGAs/s640/currency-gdp.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>U.S. currency held in the world has increased from about 5.5% of U.S. GDP before the financial crisis, to over 8% of GDP today. Thus, the Fed now needs an asset portfolio of 8% of GDP just to support the demand for U.S. currency. Still, that's far short of 20%.<br /><br />With respect to those weird Fed liabilities, look at this:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-aBve71XtTHA/XG3gGIOFbZI/AAAAAAAADYc/hfu0bTHJks0deqjzLLlQ_feT8LNgUyXJQCLcBGAs/s1600/other.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-aBve71XtTHA/XG3gGIOFbZI/AAAAAAAADYc/hfu0bTHJks0deqjzLLlQ_feT8LNgUyXJQCLcBGAs/s640/other.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>First, what are those reverse repos, \"foreign and international accounts?\" Details on this are on the <a href=\"https://www.newyorkfed.org/aboutthefed/fedpoint/fed20\">New York Fed's website.</a> These are \"accounts\" held by \"250 central banks, governments and international official institutions.\" The accounts are reserve accounts. The accounts are reserves during the day, and then become Fed reverse repos overnight, secured by securities in the Fed's portfolio. Thus, like the Fed's domestic reverse repo (ON-RRP) facility, this basically permits the Fed to pay interest on a reserve account to an entity which is not permitted to receive interest on reserves given the rules set up by Congress. Calling this \"reverse repurchase agreements\" is just a convenient fiction to get around the law. The key point is that these reverse repos have grown from about $50 billion before the financial crisis to about $250 billion today. What's driving that? The New York Fed says: <blockquote>Like other factors affecting the level of reserves in the U.S. banking system, an increase in investment in the foreign repo pool results in a corresponding decrease in reserves. Given that a change in the size of the foreign repo pool alters the availability of reserves in the U.S. financial system, the New York Fed can manage the overall size of the foreign repo pool or individual account participation in the foreign repo pool in order to maintain orderly market or reserve management conditions. In addition, the New York Fed may choose to limit the overall size of, or individual account participation in, the foreign repo pool based on other factors, such as the amount of available securities held at any time in the SOMA.</blockquote>This recognizes that more reserves held by these foreign entities means less reserves held by domestic entities, and that this could mess with the Fed's monetary policy actions. But, the quote tells us that the quantity of outstanding reverse repos of this type is purely discretionary. So, for some unspecified reason the Fed decided to increase the \"foreign repo pool,\" and presumably there is no reason outstanding reverse repos could not be reduced to their pre-crisis levels or lower.<br /><br />Next, consider the balance in the Treasury's General Account, in the last chart (in blue). It's become large, and it's highly variable. For any central bank, managing reserve balances of the fiscal authority at the central bank is an issue. Whenever tax revenue flows into the fiscal authority's reserve account, that reduces reserves held by the private sector. And, when the fiscal authority issues more debt, that also reduces reserves in private hands. So, if the central bank is running a conventional corridor system, as for example in Canada, with zero reserves held overnight, inflows and outflows in the fiscal authority's reserve account can thwart monetary policy, unless these inflows and outflows are offset. For example, the Bank of Canada conducts a twice-daily auction of government of Canada reserve balances. Some of these auctions involve secured funds, some are unsecured, and the funds are lent out at various maturities. <br /><br />In the US, before the financial crisis, the Fed implemented monetary policy in a corridor system, where the lower bound on overnight interest rates was zero. In that system, part of the mechanism in place to deal with fiscal effects on reserve balances was the <a href=\"https://www.newyorkfed.org/aboutthefed/fedpoint/fed21.html\">Treasury Tax and Loan Program,</a> which parked tax revenues in private financial institutions rather than in the Treasury's reserve account. That solved part of the problem, and presumably the New York Fed was actively engaged in offsetting the effects of Treasury auctions and maturing government debt, which would be predictable on a daily basis. All of that is out the window, apparently, as part of the Fed's current floor system. Treasury balances are large - close to $400 billion currently - and highly volatile, with swings of up to $100-$300 billion over short periods of time. Apparently this amount of volatility is of no concern to the Fed currently.<br /><br />In total, the weird Fed liabilities comprise roughly 3% of GDP, so this is significant.<br /><br />What's left, in terms of Fed liabilities? Reserves, of course: <div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-1ZSTjM-c5cs/XG7VMAb0A8I/AAAAAAAADYo/yIZQ_lgpjFob8uYgkBC7DwwGUa1aWTv0wCLcBGAs/s1600/reserves.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-1ZSTjM-c5cs/XG7VMAb0A8I/AAAAAAAADYo/yIZQ_lgpjFob8uYgkBC7DwwGUa1aWTv0wCLcBGAs/s640/reserves.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>So, at the current rate of decline, reserves could be down to the vicinity of $1 trillion toward the end of the year. It appears that this is the number that the Fed people think is \"efficient.\"<br /><br />So, it appears the FOMC has decided: (i) that a floor system is better than a corridor system; (ii) that it might take $1 trillion in reserves to support a floor system. What are their arguments?<br /><br />1. <i>Transitioning back to a corridor system would be difficult.</i> From the FOMC minutes, the argument seems to be that, given uncertainty about the level of reserves required to support the floor system, we would have to go through a period of volatile short-term interest rates in the transition period. Nonsense. The problem here follows from a poor choice of the Fed's interest rate target. If the Fed were to target a repo rate, rather than the fed funds rate, the problem goes away. Here's how to do it. For now, set the target repo rate equal to IOER (interest rate on reserves). Then, auction either repos or reverse repos at that rate - fixed rate full allotment.<br />2. <i>Survey evidence indicates that the demand for reserves is large.</i> The survey evidence comes from the <a href=\"https://www.federalreserve.gov/data/sfos/files/senior-financial-officer-survey-201809.pdf\">Senior Financial Officer Survey.</a> Basically, people in the banking industry respond to survey questions in a way that appears to indicate that their institutions would continue to hold large quantities of reserves, even if they were giving up 25 to 50 basis points by foregoing lending in the repo market, for example. If this were true, this indicates significant friction in overnight markets, and we should see that in market interest rates.  Currently, IOER is at 2.4%, and the fed funds rate is 2.4%. The last date on which the fed funds rate was less than IOER was December 14, 2018. The <a href=\"https://www.newyorkfed.org/markets/treasury-repo-reference-rates\">repo rates measured by the NY Fed</a> are currently 2.39%, 2.37%, and 2.37%, so right now financial arbitrage in overnight markets seems pretty good. So, I think the interpretation of the survey evidence is nonsense too.<br />3. <i>Regulation has increased the demand for reserves.</i> On this one, a <a href=\"https://www.federalreserve.gov/newsevents/speech/quarles20180504a.htm\">speech by Randy Quarles</a> is helpful. Quarles explains how Basel III regulatory changes regarding liquidity coverage ratios (LCR) were implemented in the United States. Basically, commercial banks need to hold sufficient liquid assets to buffer potential outflows of wholesale deposits. This is essentially a type of reserve requirement. But what's a liquid asset for regulatory purposes? It turns out that Treasury securities and reserves are equivalent, and some other assets are deemed less liquid, and get a haircut when the LCR is calculated. As Quarles says: <blockquote>One could envision that as the Fed reduces its securities holdings, a large share of which consists of Treasury securities, banks would easily replace any reduction in reserve balances with Treasury holdings, thereby keeping their LCRs roughly unchanged.</blockquote>It's not clear in Quarles's speech whether he buys that argument or not - he's just laying out the arguments. But I think that argument is powerful. A reduction in the Fed's balance sheet is essentially a swap of Treasury securities for reserves. In fulfilling the LCR, Treasuries and reserves are equivalent, and should be. Given a deposit outflow, a bank can reduce reserves, it could sell Treasuries, or it could borrow in the repo market with Treasuries as collateral. A financial system with a lot of Treasuries and not so much reserves is just as liquid as a financial system with not so much Treasuries and a lot of reserves. In fact, we could argue that the the first system is <i>more</i> liquid, since Treasuries can be traded widely while reserves are confined to those financial institutions with reserve accounts. I'd say this argument is nonsense too.<br />4. <i>Short-term interest rates are more volatile in a corridor system than in a floor system.</i>Again, this depends on what interest rate the Fed targets. Using the fed funds rate as a target has its problems, for two reasons. First, under its corridor system, the Fed did not intervene in the fed funds market - it was typically intervening in the overnight repo market. Essentially, the Fed varied the quantity of repos in order to hit a fed funds target, without being able to see the actual fed funds rate while it was intervening. You can see why that might not work so well. Further, fed funds lending is unsecured, so in times of financial market turmoil, the fed funds market is contaminated with risk. The Fed may be pegging the fed funds rate in such situations, but volatility in risk will then cause volatility in safe rates of interest. Again, these problems can be solved easily if the Fed were to target an overnight repo rate, as is done in many other countries. Here in Canada, the Bank of Canada has no problem with volatility of short-term interest rates, in running its corridor system.<br /><br />Overall, the Fed is overly-focused on reserves, as if monetary policy implementation could be represented satisfactorily in terms of some static demand and supply analysis of the \"market for reserves.\" That's very misleading. Any central bank has a lot of options in implementing monetary policy, but basically there are two broad approaches. Market interest rates can be targeted through variation in the central bank's lending, or in its borrowing. When the Fed was founded, the founders envisioned that the intervention would happen through lending, and that the key instrument would be the discount rate - with potentially different discount rates for different Fed districts. Roughly, the ECB intervenes by lending to banks in the Euro zone - it's key policy rate is its refinancing rate (at least when it's running a corridor and not a floor). Before the financial crisis, the Fed intervened day-to-day by lending on the repo market. Here's what that looked like:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-4qHCXVmZPZE/XG76M4KvnKI/AAAAAAAADY0/vyFmyYvbPd8ADnMKw4qag_bXrGf4det8gCLcBGAs/s1600/repos.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-4qHCXVmZPZE/XG76M4KvnKI/AAAAAAAADY0/vyFmyYvbPd8ADnMKw4qag_bXrGf4det8gCLcBGAs/s640/repos.png\" width=\"640\" height=\"258\" data-original-width=\"1168\" data-original-height=\"470\" /></a></div>So, repos outstanding fluctuated between $20 billion and $40 billion, for the most part. The Fed could have chosen to intervene by varying the quantity of reverse repos outstanding (on the borrowing side), and that would not have made much difference. In the current floor system, the Fed intervenes on the borrowing side, fixing the interest rate on reserves, and letting the private sector determine the quantity of reserves and currency to hold, given that currency can be converted to reserves one-for-one.<br /><br />However the Fed intervenes, this involves varying the quantity of some Fed asset or liability, so as to peg the market interest rate on that asset or liability. This intervention is most effective if the Fed can essentially set that market interest rate, and then let the market determine the quantity. For that to work, the relevant market should be sufficiently liquid, and the Fed needs to have an adequate buffer stock of that asset or liability. Apparently, before the financial crisis, the Fed was successful in intervening with a stock of repos of from $20 billion to $40 billion. So why does the Fed think it needs $1 trillion in reserves outstanding to allow it to peg short-term interest rates by setting IOER?<br /><br />As <a href=\"http://macromarketmusings.blogspot.com/\">David Beckworth points out,</a> between spring 2009 and spring 2010, the Bank of Canada ran a floor system with about $3 billion in reserves held overnight. As is well known, translating between Canada and the US involves multiplying by a factor of 10, so accounting for the exchange rate, that's about $40 billion in US reserves - in the ballpark of outstanding repos prior to the financial crisis. Canada has a very different institutional setup, but one would have to make the case that the US financial system has <i>huge</i> financial market frictions relative to Canada to justify a threshold of $1 trillion to make a floor system work.<br /><br />But what's the harm in a large Fed balance sheet? The larger the balance sheet, the lower is the quantity of Treasury securities in financial markets, and the higher is reserves. Treasuries are highly liquid, widely-traded securities that play a key role in overnight repo markets. Reserves are highly liquid - for the institutions that hold them - but they are held only by a subset of financial institutions. Thus, a large Fed balance sheet could harm the operation of financial markets. As I pointed out <a href=\"http://newmonetarism.blogspot.com/2018/07/fed-balance-sheet-policy-and-treasury.html\">here</a> and <a href=\"http://newmonetarism.blogspot.com/2018/08/feds-portfolio-manager-says-not-to-worry.html\">here,</a> there's evidence that such harm was being done. That is, if there's harm, it would be reflected in a scarcity of collateral in overnight financial markets - in market interest rates. Before early 2018, T-bill rates and repo rates tended to be lower than the fed funds rate, and the fed funds rate was lower than IOER. Now, all those rates are about the same. The Fed thinks the difference is more Treasury debt, but I think the end of the Fed's reinvestment program mattered, in that it increased the stock of on-the-run Treasuries. Whichever it was, apparently the quantity of Treasuries outstanding matters for the smooth - indeed, efficient - operation of financial markets, and the Fed should not mess with that. My prediction would be that, if we get to the end of the year and the Fed is again buying Treasuries, that we'll see repo rates and T-bill rates dropping below IOER. Watch for that.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}