{
  "id": "yt:video:fDnHyewnRyU",
  "yt:videoId": "fDnHyewnRyU",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Who Will Be The Next CEO Of Apple?",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-12T19:00:12+00:00",
  "updated": "2022-10-25T04:47:31+00:00",
  "media:group": {
    "media:title": "Who Will Be The Next CEO Of Apple?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Last year, Tim Cook announced that he probably wouldn’t be at Apple in 10 years' time. While this may have come as a surprise to some, this made sense to most given that he’s already in his 60s and has led Apple for over 10 years now. This isn’t to say that anyone wants him to leave though given Apple’s tremendous performance under his leadership. Since Tim took over, Apple stock has grown over 10X even with the recent selloff. But, it seems like Tim wants to call it a day while things are still going well, and it seems that he just wants to stick around for one more product launch. Naturally, this raises the question of who will be Apple’s next CEO? While the fan favorite is Craig Federighi, there are several other viable choices as well. This list primarily includes Jeff Williams, Eddy Cue, and Greg Joswiak. Given their respective ages though, it’s very possible that Apple decides to go with someone a little young like Craig Federighi or John Ternus. This video discusses the top candidates for the role of Apple’s next CEO and each of their respective pros and cons. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Tim Cook Retiring\n2:16 - Jeff Williams\n4:46 - Eddy Cue\n7:37 - Greg Joswiak\n9:32 - Oddballs\n11:53 - Craig Federighi\n13:58 - Apple’s Next CEO\n\nThumbnail Credit:\nhttps://apple.co/3CpCK6K\n\nResources: \nhttps://pastebin.com/uAAuHdyw",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}