{
  "title": "#459: Magicare For All (OOTP 22, St. Mungo's, Part 2)",
  "link": "https://audioboom.com/posts/7543686",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4465,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We had a blast with our first-ever <a href=\"https://www.youtube.com/watch?time_continue=3502&v=UEjZXWTRnAI&feature=emb_logo\">Quizzitch Live</a>!</li>\n<li>J.K. Rowling returns to Twitter to comfort Voldemort, reveal her favorite Mario Kart character and more!</li>\n<li>Muggle Mail covers why Harry didn't see thestrals at the end of Goblet of Fire!</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 22: St. Mungo's for Magical Maladies and Injuries (Part Two)</li>\n<li>7-Word Summary: Harry ventures to the hospital with family </li>\n<li>Why does Harry feel as if he is an intruder upon the Weasley family's guilt? Is he not a member of their family?</li>\n<li>Why doesn't Sirius take Harry seriously when he explains what really happened?</li>\n<li>What if... J.K. Rowling had killed Arthur Weasley (as he had originally intended)?</li>\n<li>Welcome to St. Mungo's for Magical Maladies and Injuries!</li>\n<li>Why couldn't the hospital have been built underground like the Ministry?</li>\n<li>How is the hospital funded? Do wizards have health insurance?</li>\n<li>How does a wizard become a Healer? There are no classes at Hogwarts!</li>\n<li>Broderick Bode has a visitor!</li>\n<li>St. Mungo's is a SECURITY NIGHTMARE!</li>\n<li>Despite all that's happened, Arthur couldn't be in better spirits!</li>\n<li>Why does Arthur not tell his kids what really happened? Was it irresponsible of him to not have a personal talk with Harry?</li>\n<li>Why won't Arthur's wounds close? What's so special about Nagini's bite?</li>\n<li>Did the movies miss a big opportunity in not including St. Mungo’s?</li>\n<li>The Umbridge Suck Count stays put at 49!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What does Harry get Ron for Christmas in his fifth year?</li>\n<li><h1>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</h1>\n</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 31 Mar 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-03-30:/posts/7543686",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}