{
  "title": "S15 Ep36: Cursed by The Conjuring House & Supernatural News/Parashare",
  "link": "https://audioboom.com/posts/8098487",
  "itunes:episode": 36,
  "itunes:title": "Cursed by The Conjuring House & Supernatural News/Parashare",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6079,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio is Cursed by The Conjuring House with guests Cody and Jennifer Heinzen!<br>\n<br>\n<br>\nWhat happens when Hollywood meets REAL Horror? Today we visit with the new owners of the house made famous in the fright fest movie, The Conjuring. <br>\n<br>\nWe have spoken to past residents, but is the house STILL active? Cody & Jennifer Heinzen drop by to fill us in on the history and haunting of this famous house, PLUS we discuss the upcoming Live Paranormal Experiment that will be taking place there for the whole world to witness, May 9-16th!<br>\n<br>\nGet more information on the event and reserve you spot to watch the events unfold, in real time, unedited, unscripted and unreal! Get discounted presales tickets now at <a href=\"http://www.TheDarkZone.tv\">www.TheDarkZone.tv</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio is Cursed by The Conjuring House with guests Cody and Jennifer Heinzen!\n\n\nWhat happens when Hollywood meets REAL Horror? Today we visit with the new owners of the house made famous in the fright fest movie, The Conjuring....",
  "pubDate": "Sat, 02 May 2020 08:00:00 +0000",
  "guid": "30ea23f7-2e53-4d5a-94de-346bbe15a213",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}