{
  "title": "Long-Haulers and Labor Market Outcomes",
  "link": "https://fedinprint.org/item/fedmoi/94528/original",
  "description": "There have been growing concerns about long-haulers or individuals with long-term COVID-19 health complications (long-haul COVID). While the medical field has been investigating the health complications, there has been limited research on the relationship between long-haul COVID and labor market outcomes. To investigate this relationship, I used the University of Southern California Understanding America Study COVID-19 longitudinal survey to provide a snapshot of mid-2021. I first find about 24.1% of individuals who have had COVID are long-haulers and 25.9% of long-haulers reported that their long-haul COVID affected employment or work hours. I then find that a majority of these affected long-haulers remained employed and in same employment type. But I find that their mean change in work hours and paycheck declined. Afterwards, I tested whether long-haul COVID is associated with negative changes in labor market outcomes. When I combined long-haulers who reported that their health complications did or did not affect work, I failed to find that long-haulers are less likely to be employed relative to individuals without prior COVID infection. But, when I discern long-haulers by whether long-haul COVID affected work, I find that long-haulers who reported long-haul COVID affected work are 10 percentage points less likely to be employed and, on average, work 50% fewer hours than individuals without prior COVID infection. In contrast, I failed to find evidence that affected long-haulers receive a lower paycheck earning relative to individuals without prior COVID infection. Lastly, when comparing these affected long-haulers against similar individuals, I find evidence that they are more impacted in their employed status and work hours. Due to limitations, future data collection and research would provide a more robust picture.",
  "guid": "https://fedinprint.org/item/fedmoi/94528/original",
  "dc:creator": "Ham, Dasom I.",
  "dc:date": "2022-07-07",
  "dc:subject": "Labor market outcomes; Long-COVID",
  "swpo:hasNumber": 60,
  "identifiers:doi": "10.21034/iwp.60",
  "bibo:series": "Opportunity and Inclusive Growth Institute Working Papers"
}