{
  "title": "585: Does the Sorting Hat Divide Students Equally Across Hogwarts Houses? And More MuggleMail",
  "link": "https://audioboom.com/posts/8185272",
  "itunes:episode": 585,
  "itunes:title": "Does the Sorting Hat Divide Students Equally Across Hogwarts Houses? And More MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4133,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode we dig deep into our MuggleMail bag as listeners weigh in on our latest chapter-by-chapter discussions. One voicemail leads the hosts to take sides in a Harry Potter date debate! Plus, we have fun paging through the beautifully illustrated <em>Order of the Phoenix</em> by Jim Kay.<br>\n<br>\n\n</div>\n<ul>\n<li>We review the <em>Order of the Phoenix</em> Illustrated Illustrated Edition. There's SO much to love in this one!</li>\n<li>Speaking of books, don't forget to check out <em>The Magic of MinaLima, </em>which is an exhaustive look at MinaLima's work for the Harry Potter movies.</li>\n<li>Voicemails cover magic's origin, a Harry Potter first date, a Draco-focused Harry Potter TV show and more</li>\n<li>Several listeners write in about Christmas gifts and Quidditch rules</li>\n<li>Why doesn’t Hermione use her own wand to stop the troll? </li>\n<li>Why did Hagrid <em>really</em> go to get Harry from the Dursleys?</li>\n<li>Should Ron be allowed to have a rat at Hogwarts?</li>\n<li>Is it the job of the Sorting Hat to equally divide the first year students?</li>\n<li>One listener presents a strong defense of Petunia Dursley</li>\n<li>Is the Hogwarts Express super inconvenient for students who already live close to Hogwarts?</li>\n<li>Troll in the Dungeon:  is Dumbledore sending the Slytherins to their doom?</li>\n<li>Quizzitch: When McGonagall gives detentions to the trio and Neville in Book 1, she says she's \"never heard of such a thing before.\" What is the \"thing\" to which she is referring?</li>\n<li>Next week: Chapter-by-Chapter returns with Chapters 15 (The Forbidden Forest) & 16 (Through The Trapdoor) of Sorcerer's Stone</li>\n<li>This week's episode is brought to you by MasterClass ( get 15% off an annual membership at <a href=\"http://www.MasterClass.com/MuggleCast\">MasterClass.com/MuggleCast</a>).</li>\n</ul>\n",
  "pubDate": "Tue, 01 Nov 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-31:/posts/8185272",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}