{
  "title": "160: The Trials of Ted Haggard",
  "link": "https://audioboom.com/posts/7746289",
  "itunes:episode": 160,
  "itunes:title": "The Trials of Ted Haggard",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3566,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>It's a weird one, you guys, but I really think it's one of our best episodes yet: </strong><br>\n<br>\nTed Haggard was living the life. As the founder and head, like, Pastor (?) of the New Life Church, Haggard was one of the most rich, famous, influential Evangelicals in America. He, his wife Gayle, and their two kids had it all. <br>\n<br>\n<strong>And then Ted Haggard got busted buying Crystal Meth from and paying for sex with a gay male sex worker. WHOOPS! </strong>Haggard, who quickly \"admitted\" he'd been \"struggling with this sexual problem\" all his life was quickly ex-communicated from the church and his family was BANISHED--YES, BANISHED--from the state of Colorado. In this film, documentarian Alexandra Pelosi (name sound familiar, yeah, Nancy is her mom) basically follows Haggard around while he tries to pick up the pieces of his life. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div><a href=\"https://audioboom.com/posts/7703675-death-at-the-mansion-rebecca-zahau-part-1/edit\">Update Description</a></div>\n<div>\n<br>\n<strong>YOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. From the 220 year old murder that brought Alexander Hamilton and Aaron Burr together to fight for the defense, to Jazz Age thrill killers, Lady mob bosses, murdering grandmothers, and serial killers you've never heard of. <strong>Check out \"Crimes of the Centuries wherever you get your podcasts. </strong>\n</div>\n",
  "pubDate": "Tue, 08 Dec 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-12-08:/posts/7746289",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}