{
  "title": "123: Oxygen's \"Up and Vanished\"",
  "link": "https://audioboom.com/posts/7520237",
  "itunes:episode": 123,
  "itunes:title": "Oxygen's \"Up and Vanished\"",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2963,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On October 21, 2005, local beauty queen, Tara Grinsted vanished from her home in Ocilla, Georgia. 12 years later, two men were arrested for her murder. This was thanks in part to Payne Lindsay's popular podcast by the same name. So Payne is here to take us through the events surrounding her disappearance and the arrests. He and his team are not convinced the police got it right. And the are going to GET. TO. THE. BOTTOM. OF. IT. <br>\n<br>\n<a href=\"https://cart.2st.com/true-crime-obsessed/2267?_ga=2.9610037.1609385445.1582578353-216236744.1581368928\"><strong>YOU GUYS WE'RE GOING TO BROADWAY!!!</strong></a><strong> THAT'S RIGHT, TCO WILL BE THE FIRST PODCAST EVER TO PLAY THE GREAT WHITE WAY!</strong> This one-night only event is happening June 1st. We're being joined by our fancy Broadway friends, we're recapping the bonkers 2018 documentary \"Frank Serpico\" AND WE WANT YOU TO COME MAKE HISTORY WITH US! There are only a handful of tickets left! <strong>Get your tickets here!<br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 03 Mar 2020 05:00:00 +0000",
  "guid": "tag:audioboom.com,2020-03-03:/posts/7520237",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}