{
  "title": "This Computer Pioneer’s Invention Made Zoom Possible",
  "link": "https://spectrum.ieee.org/erol-gelenbe-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/peter-weiner.jpg?id=29946417&width=1200&height=800&coordinates=0%2C0%2C0%2C581\"/><br/><br/><p>Many IEEE members credit a parent or a teacher for encouraging them to pursue an engineering career, but for <a href=\"https://www.linkedin.com/in/erol-gelenbe-1025ba/?originalSubdomain=uk\" rel=\"noopener noreferrer\" target=\"_blank\">Erol Gelenbe</a> it was his next-door neighbor in his hometown of Ankara, Turkey.</p><p><a href=\"https://en.wikipedia.org/wiki/Egbert_Adriaan_Kreiken\" rel=\"noopener noreferrer\" target=\"_blank\">Egbert Adriaan Kreiken</a>, a professor of astronomy at <a href=\"https://www.ankara.edu.tr/en/\" rel=\"noopener noreferrer\" target=\"_blank\">Ankara University</a>, convinced the teenager that electronics engineering was going to be the “next big thing.” That was in the late 1950s.</p><p>“Kreiken told me studying anything else was absolutely crazy,” Gelenbe recalls. “He started selling the idea to me and even bribed me by promising an internship at <a href=\"https://www.philips.com/a-w/about.html\" rel=\"noopener noreferrer\" target=\"_blank\">Philips</a>, where he had connections. He had emigrated from the Netherlands. He kind of twisted my arm.” Philips was the largest electronics company in the world.</p><p>Because electrical engineering uses a lot of mathematics, a subject Gelenbe liked, he figured he wouldn’t be wasting his time by studying EE. He ended up loving the subject and went on to earn a bachelor’s, a master’s, and a doctoral degree, all in EE. And Kreiken did keep his promise about that internship at Philips, where Gelenbe conducted measurements on some early transistor circuits.</p><p>Riding the wave of that “next big thing” has paid off for the IEEE Fellow. He is recognized as a pioneer in the field of modeling and performance evaluation of computer systems and networks. He is best known for creating <a href=\"https://link.springer.com/article/10.1007/BF02033314\" rel=\"noopener noreferrer\" target=\"_blank\">G-networks</a> and random neural networks, probabilistic models inspired by the spiking behavior of neurons. An RNN can offer efficient learning algorithms for recurrent networks such as those used for cybersecurity applications and video compression.</p><p>Other technologies he invented can be found in production lines and in the first packet-based video-conferencing systems.</p><p>“For my Ph.D., I was interested in computers, but not computers in the sense of practical things,” Gelenbe says. “I was interested in computation—how computers can calculate and also by how the languages that the computers are able to process are transformed by random events that can occur for a variety of reasons. Then I became interested in the foundations of the design of computer systems and networks, and how design choices impact their performance.”</p><p>Gelenbe has spent his entire career in academia, and he has established a computer research lab at just about every university where he taught. Currently he is a professor at the <a href=\"https://www.iitis.pl/en\" rel=\"noopener noreferrer\" target=\"_blank\">Polish Academy of Sciences’ Institute of Theoretical and Applied Informatics</a>, in Gliwice, where he conducts research and supervises Ph.D. students.</p><p>To recognize his many contributions, this year the <a href=\"https://iasworld.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Islamic World Academy of Sciences</a> made Gelenbe an honorary Fellow. </p><p><strong>BUILDING A FIELD</strong></p><p>Gelenbe graduated in 1966 with a bachelor’s degree in engineering from <a href=\"https://www.metu.edu.tr/\" rel=\"noopener noreferrer\" target=\"_blank\">Middle East Technical University</a>, in Ankara. He was awarded a <a href=\"https://us.fulbrightonline.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Fulbright</a> fellowship to pursue a master’s degree at Polytechnic Institute of Brooklyn (now part of <a href=\"https://engineering.nyu.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">New York University</a>) which, in the 1960s, was considered one of the leading engineering schools. With financial support from a <a href=\"https://www.ndc.nato.int/research/research.php?icode=4\" rel=\"noopener noreferrer\" target=\"_blank\">NATO</a> science fellowship, he stayed on at the school to earn a doctorate in electrical engineering in 1970.</p><p>His doctoral thesis was on stochastic automata theory, “which was an esoteric subject at that time for the foundation of computers, with impacts on digital systems and formal languages,” he says. “The results in my thesis were about how randomness can actually enhance the power of computation.”</p><p>His first teaching job was as an assistant professor of computer, information, and control engineering at the <a href=\"https://umich.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Michigan</a> in Ann Arbor. The university had one of the first computer science departments in the United States. One of the two courses he was assigned to teach each semester was on computer systems. </p><p>But Gelenbe had a problem. “I knew nothing about computer systems,” he now acknowledges with a laugh. At that time there wasn’t much literature on the field, so he says he devised explanations based on conducting research and writing research papers.</p><p>“I barely kept one step ahead of the students, researching and learning at night and teaching in the morning,” he says. “To develop a rational and systematic understanding of the subject so that I could explain it in a sensible way to the students, I was doing research about aspects that I did not understand.</p><p>“If you have something which is not really built on theory but just built on practice, you must extract or invent the theoretical elements. Through theoretical methods and math-based methods I became interested in explaining how computer systems and networks work.”</p><p>He found out that a few other professors at the time were in the same boat.</p><p>“It turned out that I was not the only poor chap or poor woman trying to do that, because some colleagues also had this problem,” he says. “The field was essentially built through the work of a few people like me who were at other universities such as Princeton and Harvard.”</p><p>He began contributing groundbreaking research himself while at Michigan. He developed queueing network models of computer systems and networks, through which he was able to establish optimum design choices for diverse issues such as computer communication protocols, optimum checkpointing in databases, and page-replacement problems in virtual memory systems.</p><p>He invented G-networks, generalized queueing networks that model both data networks and neural networks. A G-network, also known as a Gelenbe network, is used for queueing systems with specific control functions, such as data packets waiting to be transmitted to devices, like those used for network telephony. </p><p>In addition, he worked on improving the performance of multiprogramming computer systems, virtual memory management, and database reliability. He designed and built the first random-access LAN that uses fiber-optic connections, long before Ethernet became the standard.</p><p>Gelenbe says he had the most fun inventing the cognitive packet network for real-time adaptive routing in packet networks without routing tables, for which he holds a <a href=\"https://patents.google.com/patent/US6804201B1/en\" rel=\"noopener noreferrer\" target=\"_blank\">patent</a>. He holds two patents for the first packet-voice telephone switch, which he designed in the 1990s. The switch is used in <a href=\"https://www.skype.com/en/\" rel=\"noopener noreferrer\" target=\"_blank\">Skype</a> and<a href=\"https://zoom.us/\" rel=\"noopener noreferrer\" target=\"_blank\"> Zoom</a> video-conferencing services. He also created the <a href=\"https://econpapers.repec.org/article/eeeejores/v_3a53_3ay_3a1991_3ai_3a2_3ap_3a149-165.htm\" rel=\"noopener noreferrer\" target=\"_blank\">FlexSim</a>, a computer-based model of a production system used for inventory, assembly, and transportation systems. </p><p>Not only was he inventing, he also was busy setting up computer science research labs around the world. They include the<a href=\"https://www.inria.fr/en/research-and-innovation\" rel=\"noopener noreferrer\" target=\"_blank\"> Modeling and Performance Evaluation of Computer Systems research group</a> at<a href=\"https://www.inria.fr/en\" rel=\"noopener noreferrer\" target=\"_blank\"> Inria</a>, the French national research institute for digital science and technology, in Paris. There is also the<a href=\"https://www.lri.fr/presentation_en.php\" rel=\"noopener noreferrer\" target=\"_blank\"> Laboratory for Computer Science</a> at <a href=\"https://www.universite-paris-saclay.fr/en/about/universite-paris-saclay\" rel=\"noopener noreferrer\" target=\"_blank\">Université Paris-Saclay</a>; <a href=\"https://www.hesias.fr/\" rel=\"noopener noreferrer\" target=\"_blank\">L’école d’Informatique Hesias</a> at <a href=\"https://u-paris.fr/en/universite-de-paris/\" rel=\"noopener noreferrer\" target=\"_blank\">Université Paris Cité</a>; and the<a href=\"https://www.ucf.edu/\" rel=\"noopener noreferrer\" target=\"_blank\"> </a><a href=\"https://www.ucf.edu/\" target=\"_blank\">University of Central Florida</a>’s <a href=\"https://www.ucf.edu/college/engineering-computer-science/\" rel=\"noopener noreferrer\" target=\"_blank\">college of electrical engineering and computer science</a>, in Orlando.</p><p>After retiring in 2019 from <a href=\"https://www.imperial.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">Imperial College London</a>, Gelenbe joined the Polish Academy of Sciences. There he is researching energy-efficient computer systems, self-aware networks, network security, and networked auctions. He also consults for several companies. </p><p>He enjoys academia, he says, because “you’re always surrounded by young people, so you’re constantly in contact with people who are asking questions and don’t take things for granted.”</p><p><strong>ACCOLADES APLENTY</strong></p><p>Gelenbe has been elected Fellow of the French <a href=\"https://www.academie-technologies.fr/en/\" rel=\"noopener noreferrer\" target=\"_blank\">National Academy of Technologies</a>, the Belgian <a href=\"https://council.science/member/belgium-royal-academies-for-science-and-the-arts-of-belgium-rasab/\" rel=\"noopener noreferrer\" target=\"_blank\">Royal Academy of Sciences, Arts, and Letters</a>, and the science academies of <a href=\"https://mta.hu/english/\" rel=\"noopener noreferrer\" target=\"_blank\">Hungary</a>, <a href=\"https://pasific.pan.pl/polish-academy-of-sciences/\" rel=\"noopener noreferrer\" target=\"_blank\">Poland</a>, and <a href=\"https://en.bilimakademisi.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Turkey</a>. In 2008 <a href=\"https://www.acm.org/\" rel=\"noopener noreferrer\" target=\"_blank\">ACM</a> awarded him its annual <a href=\"https://www.sigmetrics.org/awards.shtml#achievementaward\" rel=\"noopener noreferrer\" target=\"_blank\">Sigmetrics Achievement Award</a>. ACM said he was “the single individual who, over a span of 30 years, has made the greatest overall contribution to the field of computer system and network performance evaluation.” </p><p>France bestowed on him its <a href=\"https://www.legiondhonneur.fr/en/node/37\" rel=\"noopener noreferrer\" target=\"_blank\">Order of the Legion of Honor</a>’s chevalier award, and named him a commander of the National Order of Merit for his service to higher education and research in the country. While serving as a science and technology advisor to the French minister for universities from 1984 to 1986, he introduced computer science education to all undergraduate programs.</p><p>Italy honored him with a Commander of Merit award and named him a grand officer of the Order of the Star.</p><p><strong>UNFAIR TREATMENT</strong></p><p>Despite Gelenbe’s storied career, he has faced racism along the way.</p><p>“I’ve experienced forms of discrimination in every country I’ve been to,” he says. “Sometimes it’s blatant.”</p><p>In his first academic job in France, he says, one day he found a note written in French and posted on his office door. It said: “Immigrant worker in his Sunday best.” </p><p>“The implication was that I was an immigrant, which is true, and a worker, which is also true. I like to work hard,” he says. “All that is fine but, the ‘Sunday best<em>’</em> reference was that I was trying to look better than I should.”</p><p>Another example was an article about him that said: “Someone like that should not be a professor here, because most people who come from that same country are working in the coal mines.”</p><p>He says he hasn’t overcome the pain such comments have caused him; he’s just developed a thick skin: “I have accepted that it’s ‘normal’ that I will not get equal treatment in certain circumstances. I’ve compensated for this by the fact that I am quite gregarious and have developed connections with people.”</p><p><strong>THE VALUE OF VOLUNTEERISM</strong></p><p>Gelenbe joined IEEE as a student member because, he says, it gave him easy access to its publications—which is harder today because a subscription is needed to the <a href=\"https://ieeexplore.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Xplore Digital Library</a>.</p><p>An active volunteer, he was the faculty advisor to Imperial College’s IEEE student branch. From 1979 to 1986 he chaired the <a href=\"http://computer.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Computer Society</a>’s <a href=\"https://ewh.ieee.org/r8/france/cs/\" rel=\"noopener noreferrer\" target=\"_blank\">France Section</a>. He also helped found the society’s <a href=\"https://mascots.iitis.pl/\" rel=\"noopener noreferrer\" target=\"_blank\">International Symposium on Modeling, Analysis, and Simulation of Computer and Telecommunication Systems Conference</a>. Today he is a <a href=\"https://www.computer.org/profiles/erol-gelenbe\" rel=\"noopener noreferrer\" target=\"_blank\">Distinguished Visitor</a> for the society.</p><p>He says IEEE gives people in engineering professions the possibility of a career path.</p><p>“It is a way of viewing themselves not just in terms of who is employing them but also in terms of their professional standing and their professional activities, which are going to be outside of their strict job requirements. I would certainly recommend membership to anyone with a career in our fields, whether the person is an academic or not.”</p>",
  "pubDate": "Tue, 07 Jun 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/erol-gelenbe-profile",
  "category": [
    "Ieee member news",
    "Careers",
    "Random neural networks",
    "Skype",
    "Zoom",
    "Videoconferencing",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}