{
  "title": "covrpage, more information on unit testing",
  "link": "https://itsalocke.com/blog/covrpage-more-information-on-unit-testing/",
  "pubDate": "Mon, 10 Dec 2018 00:00:00 +0000",
  "guid": "https://itsalocke.com/blog/covrpage-more-information-on-unit-testing/",
  "description": "<p>In this post, we shall explore the first R package that received <a href=\"https://itsalocke.com/blog/package-support-offer/\">Locke Data&rsquo;s new support</a>, <a href=\"https://yonicd.github.io/covrpage/\"><code>covrpage</code></a> by Jonathan Sidi! With this nifty package you can better communicate the unit testing completeness and goodness of your package!</p>\n\n<h1 id=\"what-s-covrpage\">What&rsquo;s <code>covrpage</code>?</h1>\n\n<p>Trust is earned not <del>inherited</del> importedFrom. Now that you&rsquo;ve built a cool package, you want potential users to trust it so that they might adopt it. So how can you build trust in your software? Unit testing is one of the components building trustworthiness of your package. Imagine you&rsquo;re at the point where you&rsquo;ve tested most lines of your code with thorough assertions, including checks of edge cases. Proof of that hard work will be a high test coverage, that potential users of your package might notice thanks to a bright green coverage badge.</p>\n\n\n<figure >\n    \n        <img src=\"../img/covrpage_readme_badge.png\" />\n    \n    \n    <figcaption>\n        <h4>Green coverage badge for the rfm package</h4>\n        \n    </figcaption>\n    \n</figure>\n\n\n<p>But how would they know your tests are thorough? That&rsquo;s what <code>covrpage</code> helps you with, by creating a summary report of your tests that goes beyond the coverage percentage.</p>\n\n\n<figure >\n    \n        <img src=\"../img/covrpage_tests_readme.png\" />\n    \n    \n    <figcaption>\n        <h4>Tests summary report for the rfm package</h4>\n        \n    </figcaption>\n    \n</figure>\n\n\n<p>This way, potential users can see at a glance how good the unit testing of your package is. This report can be used as a README for the tests folder, as well as a vignette in the <code>pkgdown</code> website and/or CRAN page of a package.</p>\n\n<h2 id=\"is-the-covrpage-report-only-for-users\">Is the <code>covrpage</code> report only for users?</h2>\n\n<p>No, it can also inform your work on your package, by helping you track progress of the unit tests you&rsquo;re working on, and it can show to potential <em>contributors</em> where help is needed.</p>\n\n<h1 id=\"how-do-i-publish-the-covrpage-report\">How do I publish the <code>covrpage</code> report?</h1>\n\n<p>There are two places where you can keep the <code>covrpage</code> report, and it&rsquo;s advised to use both since they will get seen by different readers:</p>\n\n<ul>\n<li><p>A README for the tests/ folder, which is the original report location. <code>covrpage::covrpage()</code> sets it up. Target audience: users or collaborators browsing the GitHub repo of your package, possibly guided there by a badge in the main README.</p></li>\n\n<li><p>A vignette, that&rsquo;ll get inserted into the <code>pkgdown</code> website of your package, and the <a href=\"https://cran.r-project.org/web/packages/texPreview/index.html\">CRAN page</a> if/when your package is released on CRAN. <code>covrpage::use_covrpage_vignette()</code> sets it up. Target audience: users reading the rendered documentation.</p></li>\n</ul>\n\n<p>In both cases, you can also ensure the report stays up-to-date by having it deployed from Travis every time you push to your repository.</p>\n\n<h1 id=\"can-i-get-a-covrpage-report-for-any-package\">Can I get a <code>covrpage</code> report for any package?</h1>\n\n<p>See a new package on GitHub that you would like to use, but need to feel more comfortable before <em>committing</em> to it? You can run <code>covrpage_snapshot()</code> to create a report in a sterile environment, without affecting your <code>.libPaths</code>, and make a more informed decision wether to install the package.</p>\n\n<p>For more information see the <a href=\"https://yonicd.github.io/covrpage/articles/snapshots.html\">snapshots</a> vignette.</p>\n\n<h1 id=\"how-do-i-learn-more-about-covrpage\">How do I learn more about <code>covrpage</code>?</h1>\n\n<p>To read more about getting started with <code>covrpage</code> in your own package in a few lines of code only, we recommend checking out the <a href=\"https://yonicd.github.io/covrpage/articles/get-started.html\">&ldquo;get started&rdquo; vignette</a>. It explains more how to setup the Travis deploy, mentions which functions power the <code>covrpage</code> report, and gives more motivation for using <code>covrpage</code>.</p>\n\n<p>And to learn how the information provided by <code>covrpage</code> should be read, read the <a href=\"https://yonicd.github.io/covrpage/articles/how-to-read-covrpage-report.html\">&ldquo;How to read the <code>covrpage</code> report&rdquo; vignette</a>.</p>\n\n<h1 id=\"what-did-covrpage-gain-from-locke-data-s-help\">What did <code>covrpage</code> gain from Locke Data&rsquo;s help?</h1>\n\n\n<figure >\n    \n        <img src=\"../img/covrpageLogo.png\" />\n    \n    \n    <figcaption>\n        <h4>covrpage logo</h4>\n        \n    </figcaption>\n    \n</figure>\n\n\n<p>As <a href=\"https://itsalocke.com/blog/package-support-offer/\">announced recently</a>, we at Locke Data will help a package a month get more widely adopted. In the case of <code>covrpage</code>, our main input was:</p>\n\n<ul>\n<li><p>the creation of a nice logo by <a href=\"https://twitter.com/LockeCreatives\">Oz Locke</a>. The logo highlights that <code>covrpage</code> extends the <code>covr</code> and <code>testthat</code> packages by helping the user inspect their results.</p></li>\n\n<li><p>the improvement of documentation, in particular vignettes and the README, to make it clearer why potential users should care about <code>covrpage</code>.</p></li>\n\n<li><p>exploration of Travis deploy of the report via the <code>tic</code> package, to make the setup smoother.</p></li>\n</ul>\n\n<p>Thanks Jonathan for letting us get involved for your package, and good luck with future development! And if <em>you</em> think your broadly applicable package could benefit from our support getting your package into shape then <a href=\"https://airtable.com/shrH3z9fQIbEJzPUn\">apply now</a>.</p>"
}