{
  "title": "S1E26 - Grins, Gold & Becoming a #GirlDad with Olympic Swimmer Nathan Adrian",
  "guid": "https://pinecast.com/guid/18e35eda-c08e-47a1-aba4-09fe92d10926",
  "pubDate": "Tue, 01 Dec 2020 07:30:00 -0000",
  "itunes:duration": "00:59:44",
  "description": "<p>Laura is absolutely thrilled to welcome Olympic champion swimmer Nathan Adrian to the podcast today. Nathan is an eight-time Olympic medalist who has played key roles in some of the fastest relay teams in history. From 2008 to 2019, he won gold at World Championships, Pan Pacific Championships, or the Olympics every year but one. He has 16 World Championships medals (LCM) to his name, and has served as a USA Swimming Foundation Ambassador since 2014.</p>\n<p>In today’s episode, Nathan shares his history in sports and specifically swimming right from the start up to current day. Along the way, he discusses his college experience, his experiences at Worlds and the Olympics and what he learned from them, his training, becoming Team USA’s Captain, and his sense of joy and optimism as well as some tips he follows to maintain it. Nathan also recounts some of his most memorable performances, the importance of having humbling moments and knowing yourself, and his cancer diagnosis and its impact upon him. He draws the episode to a close by sharing how the pandemic and Tokyo postponement have affected him, and his thoughts on becoming a father in the near future. Nathan’s fascinating journey is one filled with both highs and lows, and, throughout it all, he demonstrates the wisdom to tease out the lessons to be learned from each experience – lessons not only about sports, but about life in general, which he translates into valuable advice for us all here today.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Nathan’s start in sports and journey to swimming</li>\n<li>His college experience</li>\n<li>Nathan’s advice for athletes when choosing their college</li>\n<li>The impact of training with Mike Bottom’s professional team</li>\n<li>What he learned through his first Worlds and Olympic Trials experiences</li>\n<li>Nathan’s first Olympics</li>\n<li>The differences between his three Olympics</li>\n<li>Expectations for those who make the USA Olympics Swimming Team</li>\n<li>His experience as Team Captain</li>\n<li>Nathan’s sense of joy and optimism and some ways he maintains it</li>\n<li>How his approach to training changes for swimming yards or meters</li>\n<li>Nathan’s most memorable performances</li>\n<li>The importance of having humbling moments and knowing how you operate the best</li>\n<li>Transitioning from college to pro</li>\n<li>Nathan’s diagnosis of testicular cancer</li>\n<li>His return to training after his treatment</li>\n<li>The impact of the pandemic and the Olympic postponement</li>\n<li>Becoming a parent soon</li>\n</ul>\n<p>Quotes:</p>\n<p>“I was always competing in my own little third child way.”</p>\n<p>“I was trying to keep up with these guys, all the time, everyday.”</p>\n<p>“No matter how hard you think you have tried, or no matter how any given competition has gone up until that point, like, your next race might be the one.”</p>\n<p>“Team USA and USA Swimming do a great job of, you know, helping you, make you feel secure.”</p>\n<p>“I felt like my job there was to go to swim as fast as I could on the relay for Team USA and then try to just soak up all the knowledge and experience, and just watch people go through what they need to go through to be successful.”</p>\n<p>“We are going to do whatever we can to give you something to be successful.”</p>\n<p>“You don’t want to be Captain to be enforcer of rules or punishments.”</p>\n<p>“I do seem to err on the side of optimism.”</p>\n<p>“What contributing factors perhaps put me in, you know, this sort of rut, and what can I do in the future to try to avoid that?”</p>\n<p>“My freestyle, I have, I’d say, let’s just call it like five different gears…let’s call six gears.”</p>\n<p>“It takes a long time at the beginning of the season to sort of groove those neuropatterns out, but once you’re clicking…you just kind of do it.”</p>\n<p>“I think every athlete that gets up to a certain level has these sorts of stories where they just totally sucked, and no matter what their resume is, that story is still there.”</p>\n<p>“You really have to know yourself.”</p>\n<p>“You, as the patient, still have to make actual decisions.”</p>\n<p>“The diagnosis itself will definitely change your outlook, especially, I think for an athlete who is all about that delayed gratification, that payoff at the end of the season.”</p>\n<p>“I still look forward to going to practice even to this day.”</p>\n<p>“It certainly shaped my own paradigm moving forward…I almost got so much just ripped away.”</p>\n<p>“My wife was a saint through it.”</p>\n<p>“Something feels off…like, my left foot doesn’t sweat – it’s like the weirdest thing ever.”</p>\n<p>“Your body has this incredible way of finding a way to compensate and, you know, figure out a way to still move through the water.”</p>\n<p>“I’m just getting a little bit better each and every week.”</p>\n<p>Links:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a>\nMental Training:   <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a><br>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Connect with Nathan:\nHomepage:   <a href=\"http://www.nathanadrian.com/\" rel=\"nofollow\">http://www.nathanadrian.com/</a>\nInstagram:   <a href=\"https://www.instagram.com/nathangadrian/\" rel=\"nofollow\">https://www.instagram.com/nathangadrian/</a>\nTwitter:   <a href=\"https://twitter.com/nathangadrian\" rel=\"nofollow\">https://twitter.com/nathangadrian</a></p>",
  "itunes:title": "Grins, Gold & Becoming a #GirlDad with Olympic Swimmer Nathan Adrian",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 26
}