{
  "title": "Innovative Shins Turn Quadrupedal Robot Biped",
  "link": "https://spectrum.ieee.org/quadrupedal-robot-shins-turns-biped",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-video-clip-showing-a-quadrupedal-robot-with-shin-extensions-standing-up-on-its-hind-legs.gif?id=32019322&width=1245&height=700&coordinates=0%2C23%2C0%2C23\"/><br/><br/><p>\n\tThe word <em>quadruped</em> means, technically, “four feet.” Roboticists tend to apply the term to anything that uses four limbs to walk, differentiating it from bipedal robots, which walk on two limbs instead. But there’s a huge, blurry crossover there, in both robotics and biology, where you find animals (and occasionally robots) that can transition from quadruped to biped when they need to (for example) manipulate something.\n</p><p>\n\tIf you look at quadrupedal robots simply as robots with four limbs rather than robots with four feet, they start to seem much more versatile, but that transition can be a tricky one. At the <a href=\"https://iros2022.org/\" target=\"_blank\">2022 IEEE/RSJ International Conference on Intelligent Robots and Systems</a> (IROS 2022) in Kyoto, Japan, last week, researchers from <a href=\"https://www.wpi.edu/\" target=\"_blank\">Worcester Polytechnic Institute (WPI), in Massachusetts</a>, and ShanghaiTech University <a href=\"https://chenaah.github.io/multimodal/\" target=\"_blank\">presented</a> a generalizable method whereby an off-the-shelf quadruped robot can turn into a biped with some clever software and a tiny bit of mechanical modification.\n</p><hr/><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"bb5c78fbb0670171a354b39c52329e2e\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/Xf-fKWNRLcc?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>\n\tWe’ve seen robots that can transition from quadruped to biped before, but they’re almost always designed very deliberately to be able to do this, and they pay a penalty in weight, complexity, and cost. What’s unique about this research is that it’s intended to be applied to any quadruped at all—with some very minor hardware, your quadruped can become a biped, too.\n</p><p>\n\tThe mechanical side of this bipedalization is a 3D-printed stick that gets installed onto the shin of each of the quadruped’s hind legs. This provides additional support so that the robot can stand and walk robustly—without the shin attachments, the robot wouldn’t be statically stable. This is especially useful as the robot stands up, since its center of mass is fully supported during that process. The video shows this working on what looks like a <a href=\"https://robots.ieee.org/robots/minicheetah/\" target=\"_blank\">Mini Cheetah</a> robot, but again, the platform really doesn’t matter as long as it meets some basic requirements.\n</p><p class=\"pull-quote\">“We [seek] to reap the benefits from two worlds: stability and speed from quadrupeds, manipulability and a gain in operational height from bipeds.”<br/>—Andre Rosendo, Worcester Polytechnic Institute</p><p>\n\tOnce the robot is upright, walking comes from a policy that’s trained first in simulation and then transferred onto the real robot. This isn’t trivial, because the controller is trying to get the robot to both walk and not fall over, which is a bit of a contradiction, but the best performing policy was able to get the robot to walk for several meters. It’s important to remember that this is a robot that was not designed to walk bipedally at all, so in some sense you’ve got software struggling to get hardware to work in a way that it isn’t supposed to and certainly isn’t optimized for. Perhaps if this kind of thing catches on, quadruped designers might be given incentives to build a little extra flexibility into their platforms to make them more adaptable.\n</p><p>\n\tFor more on this research, <em>IEEE Spectrum</em> spoke with <a href=\"https://www.wpi.edu/people/faculty/arosendo\" rel=\"noopener noreferrer\" target=\"_blank\">Andre Rosendo, who is now a professor at WPI</a>.\n</p><p><strong>Fundamentally is there a difference between a four-legged robot and a four-limbed robot?</strong>\n</p><p>\n<strong>Andre Rosendo: </strong>As seen in nature, quadruped locomotion enables higher speeds, and the robot is noticeably faster when moving with four legs. That said, the benefits related to manipulability seen in this animal transition from four to two legs (for example, <a href=\"https://humanorigins.si.edu/evidence/human-fossils/species/australopithecus-afarensis\" target=\"_blank\">Australopithecus</a> using their hands to bring food to their mouths) are also true to robots. We are currently developing a “variant end effector” for the forelimbs to allow this quadruped robot to become a “two-arm manipulator” when standing, handling objects and operating environments.\n</p><p>\n<strong>Why did you decide on this particular system to enable the bipedal transition?</strong>\n</p><p>\n<strong>Rosendo: </strong>We noticed that it is quite easy to adapt the hind legs of a quadruped robot with a fixed structure, with very little drop in performance. Although not as aesthetically pleasing as an active structure, advances in materials nowadays allow us to use a small carbon-fiber link protruding from the leg to mimic the same passive stability that our feet give us (known in legged locomotion as the <a href=\"https://en.wikipedia.org/wiki/Support_polygon\" target=\"_blank\">polygon of stability</a>). An active retractable system, on the other hand, would add a tiny motor to the leg, increasing the <a href=\"https://www.britannica.com/science/moment-of-inertia\" target=\"_blank\">moment of inertia</a> of that leg during locomotion, affecting performance negatively.\n</p><p>\n<strong>What are the limitations to the walking performance of this system?</strong>\n</p><p>\n<strong>Rosendo: </strong>We trained the robot in a simulated environment, and the walking gait, after being transferred to the real world, is stable, albeit slow. Bipedal robots usually have more degrees of freedom in their legs to allow a more dynamic and adaptive locomotion, but in our case, we are focusing on the multimodal aspect to reap the benefits from two worlds: stability and speed from quadrupeds, manipulability and a gain in operational height from bipeds.\n</p><p>\n<strong>What are you working on next?</strong>\n</p><p>\n<strong>Rosendo: </strong>Our next steps...will be on the development of the manipulability of this robot. More specifically, we have been asking ourselves the question: “Now that we can stand up, what can we do that other robots cannot?”, and we already have some preliminary results on climbing to places that are higher than the center of gravity of the robot itself. After mechanical changes on the forelimbs, we will better evaluate complex handling that might require both hands at the same time, which is rare in current mobile robots.\n</p><div class=\"horizontal-rule\">\n</div><p><em>Multi-Modal Legged Locomotion Framework with Automated Residual Reinforcement Learning</em>, by Chen Yu and Andre Rosendo from ShanghaiTech University, was presented this week at IROS 2022 in Kyoto, Japan. More details are available <a href=\"https://chenaah.github.io/multimodal/\" rel=\"noopener noreferrer\" target=\"_blank\">on Github</a>.</p>",
  "pubDate": "Wed, 02 Nov 2022 16:16:56 +0000",
  "guid": "https://spectrum.ieee.org/quadrupedal-robot-shins-turns-biped",
  "category": [
    "Quadruped robots",
    "Bipedal robots",
    "Iros",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}