{
  "id": "yt:video:FqQuSQmV_b4",
  "yt:videoId": "FqQuSQmV_b4",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "How to prepare for a psychedelic trip | Scientific insights on set and setting",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2020-07-20T00:12:37+00:00",
  "updated": "2022-05-27T20:42:13+00:00",
  "media:group": {
    "media:title": "How to prepare for a psychedelic trip | Scientific insights on set and setting",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Having the right preparation for your trip is essential!\n\nYou need to really take stock of what is going on internally (in your mind and body) and externally (in your immediate environment). This can make or break your trip!\n\nIn psychedelic circles, these are often referred to as your 'set' and 'setting'.\n\nIn this video I dive deep into what set and setting are and give a bunch of tips for each to best ensure you have a positive expeirence!!\n\n*This video is for harm reduction and educational purpose only. I am not advocating the use of illegal substances*\n\nDon't forget to follow me on social media for all the latest updates: \n\nInstagram\nhttps://www.instagram.com/thepsychedelicscientist \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychedelic-Scientist-113887593677455 \n\nMore info about the host:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/Manesh_Girn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}