{
  "title": "S15 Ep59: Banishing Dark Spirits",
  "link": "https://audioboom.com/posts/8098464",
  "itunes:episode": 59,
  "itunes:title": "Banishing Dark Spirits",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4838,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio is Banishing Dark Spirits with guests Robert Major and Antoinette<br>\n<br>\nGhosts are spirits of the dead who failed to transition to the afterlife for one reason or another. Some merely ghost indefinitely. Others however, achieve the ability to haunt, disrupt, influence, Attach to, and even possess living human beings. The experiences of those afflicted are often discredited and they themselves dismissed. However, there are explanations for these occurrences. There is help and we have the answer with Robert Major & Antoinette.<br>\n<br>\nToday, they share some of their chilling experiences and how they can help you or others you know with attachments.<br>\nFor Help reach out to them at: <a href=\"http://www.GhostRemover.com\">www.GhostRemover.com</a><br>\n<br>\nGet your awesome Paranormal needs met here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio is Banishing Dark Spirits with guests Robert Major and Antoinette\n\nGhosts are spirits of the dead who failed to transition to the afterlife for one reason or another. Some merely ghost indefinitely. Others however, achieve...",
  "pubDate": "Sun, 19 Jul 2020 08:00:00 +0000",
  "guid": "c6a55a17-0381-4800-b939-65284744cb6b",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}