{
  "title": "Brazil: Lula Should Urgently Address Amazon Crisis",
  "link": "https://www.hrw.org/news/2022/11/04/brazil-lula-should-urgently-address-amazon-crisis",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Deforested area in the Yanomami Indigenous Territory, located in the Brazilian states of Roraima and Amazonas, in June 2021.\n                    © 2021 Gabriel Chaim\n          \n\n  \n<p>(São Paulo) – Brazil’s President-Elect Luiz Inácio Lula da Silva should commit to concrete measures to back up his promises on the environment as government representatives gather for the COP27 climate summit meeting in Egypt, Human Rights Watch said today.</p>\n\n<p>In his first public statement after winning the election on October 30, 2022, Lula, as he is known in Brazil, pledged to reduce deforestation in the Amazon rainforest to zero, defend Indigenous rights, and take a leading role in responding to the climate crisis. The administration of the incumbent, Jair Bolsonaro, whose term ends on December 31, will represent Brazil at the 27th annual United Nations Climate Change Conference (COP27). Lula is also expected to attend.</p>\n\n<p>“As COP27 begins a week after his election, Lula should specify how he plans to uphold the rule of law in the Amazon and protect both the forest and its defenders as soon as he takes office,” said Maria Laura Canineu, Brazil director at Human Rights Watch. “He should commit to rebuilding the capacity of federal agencies responsible for environmental protection and upholding Indigenous rights.”</p>\n\n<p>Lula inherited one of the highest Amazon deforestation rates on record when he took office as president in 2003. By the end of his second term, in 2010, the rate of deforestation had dropped by 67 percent.</p>\n\n<p>Among the measures that led to this result were the effective enforcement of environmental laws, the creation of protected areas, the demarcation of Indigenous territories, and restrictions on access to credit for large landowners who had taken over public land and lacked legal title or had violated environmental laws. But local communities and organizations expressed concern about the high environmental and social impact of dams and other projects his administration promoted in the Amazon.</p>\n\n<p>At COP26, the 2021 climate summit in Glasgow, Brazil signed on to initiatives to reverse forest loss and pledged to end illegal deforestation by 2028. In practice, though, the Bolsonaro administration’s policies have enabled illegal deforestation to increase in the Brazilian Amazon, an ecosystem vital for combatting climate change, while creating an environment of impunity for those responsible.</p>\n\n<p>Under Bolsonaro, deforestation in the Amazon increased 73 percent in 2021 compared with 2018, its highest level in 15 years. About 34,000 square kilometers of the Amazon rainforest were cleared between 2019 and 2021, according to official data. Nearly 99 percent of deforestation recorded in 2021 had some irregularity indicating illegality.</p>\n\n<p>Fires, often used to clear land and prepare it for crops or pasture, soared alongside deforestation. The number of hotspots, the indicator of fire activity, in the Amazon from 2019 to October 2022 was 368,642. The number of fires from January through October in 2022 is already the highest for the period since 2010.</p>\n\n<p>Scientists have warned that increased deforestation and fires are pushing the Amazon to a “tipping point,” from which the rainforest would not recover, underscoring the urgency to reverse the damage.</p>\n\n<p>If this destruction continues, vast portions of the rainforest may dry out in coming years, releasing billions of tons of stored carbon, disturbing weather patterns across South America, and decimating agriculture. Large areas of the Amazon have already been logged and degraded, reducing the forest’s capacity to regenerate, a study led by the Amazon Network of Georeferenced Socio-Environmental Information, a consortium of civil society organizations, showed.</p>\n\n<p>The destruction of the Amazon goes hand in hand with serious rights violations, such as encroachment on protected land, and violence and intimidation against Indigenous peoples and other communities that play a crucial role in protecting the forests. Since 2019, at least 89 people have been killed in conflicts over land and resources in the Brazilian Amazon, the nongovernmental group Pastoral Land Commission (CPT) reported. Illegal logging, mining, poaching, and land seizures in Indigenous territories increased 180 percent in 2021, compared with 2018, the year before President Bolsonaro took office, the nonprofit Indigenist Missionary Council reported.</p>\n\n<p>In April, the Bolsonaro administration submitted an updated climate action plan, a “Nationally Determined Contribution,” or NDC, that effectively proposed smaller emissions reductions than the government had promised in 2016. This is contrary to Brazil’s obligation under the Paris Agreement on climate change to make progressively ambitious pledges.</p>\n\n<p>As one of the world’s top 10 emitters, Brazil has contributed to the climate crisis that is having a growing toll on human rights. The latest data available shows that Brazil released 2.42 billion tons of carbon dioxide into the atmosphere in 2021, according to an analysis by the Greenhouse Gas Emissions Estimates System, a coalition of climate scientists. This is a 12 percent increase in relation to 2020. Deforestation has been the main factor that has driven up overall emissions.</p>\n\n<p>At the current pace, Brazil could exceed its already weak 2030 emission target by up to 137 percent, according to researchers from the Center for Integrated Studies on the Environment and Climate Change at the Federal University of Rio de Janeiro.</p>\n\n<p>Countries have a human rights obligation to protect people from the foreseeable harm of climate change and reduce greenhouse gas emissions that are driving it. Brazil’s duty to protect forest defenders and others from violence and intimidation by criminal groups involved in environmental destruction, and to bring those responsible for these acts to justice, is also an obligation under international human rights law.</p>\n\n<p>The Lula transition team should prepare a strategy with concrete steps to reverse the rampant environmental destruction that has taken place under Bolsonaro’s presidency, including:</p>\n\nA renewed climate action plan that is more ambitious than the original submission in 2016 and that is consistent with the goal of keeping global warming under 1.5 degrees Celsius. The plan should incorporate pledges under the Glasgow Declaration on Forests and the Global Methane Pledge, and include a detailed implementation strategy;\n\tA plan, in consultation with nongovernmental groups and affected communities, with concrete, operational steps, and measurable targets to dramatically reduce deforestation and fires, including by restoring the capacity of environmental agencies to ensure effective enforcement of environmental laws;\n\tMeasures to ensure the protection of the rights of Indigenous peoples, including by resuming the demarcation of Indigenous territories, protecting these territories from illegal land seizures, and strengthening the Indigenous rights agency;\n\tA national plan to protect environmental defenders and work with governors and the Attorney General’s Office to ensure that those responsible for violence and intimidation against them are rigorously investigated and prosecuted; and\n\tA strategy to defeat bills under consideration in Congress that would arbitrarily curtail the rights of Indigenous peoples to their territories and accelerate deforestation.\n<p>In May, the Climate Observatory, a coalition of Brazilian civil society organizations, released a comprehensive agenda on environmental policies with key recommendations for the next administration. In November, Política Por Inteiro, a group that monitors government policies, has called on the new president to review, revoke, or replace hundreds of Bolsonaro’s environmental regulations.</p>\n\n<p>As two of Brazil’s major trading partners, the European Union and the United States should adopt laws that restrict the import of agricultural commodities such as cattle, soy, and palm oil and their derived products linked to illegal deforestation and human rights abuses.</p>\n\n<p>The European Union should not consider ratifying a pending trade agreement with Mercosur, a customs union of which Brazil is a member, until Brazil shows it is ready to uphold its commitments to protect the Amazon rainforest and address violence against forest defenders. The trade deal, agreed to in principle in 2019, includes commitments to uphold the Paris Climate Agreement and fight deforestation.</p>\n\n<p>Members of the Organisation of Economic Cooperation and Development (OECD) should also ensure that Brazil has taken concrete measures to halt deforestation and protect environmental defenders before considering the country’s membership in the organization. In June, the OECD adopted a roadmap stressing that Brazil must adopt and fully implement policies in line with its climate goals, including by tackling forest loss, strengthening environmental agencies, protecting the rights of Indigenous peoples and local communities, and addressing impunity of violence and intimidation against environmental defenders.</p>\n\n<p>“Brazil has wasted a lot of time for addressing the urgent climate crisis,” Canineu said. “The international community should continue closely monitoring the situation in the Amazon and support efforts to fight deforestation and protect forest defenders.”</p>",
  "pubDate": "Fri, 04 Nov 2022 00:00:01 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/04/brazil-lula-should-urgently-address-amazon-crisis"
}