{
  "title": "What's a Hipster?",
  "link": "http://awww.libsyn.com/whats-a-hipster",
  "description": "Get out your skinny jeans and pass the PBR! Martha and Grant discuss the definition of the word hipster. Also, what happens when you pull a brodie? And why do we describe something cheap or poorly made as cheesy? Also, sawbucks, pulling a brodie, shoestring budgets, the origins of bootlegging, and cabbie lingo, including the slang word bingo.  FULL DETAILS  A former cabbie shares his favorite jargon, like green pea and making your nut. Someone waving down an occupied cab is known as a bingo, and the cabbie will usually tell the dispatcher to send another car. A San Diego cabdriver has gathered much more taxi slang here.  Is there any etymological connection between the dairy product and the adjective cheesy, meaning inferior, cheap, or otherwise sub-par? This descriptive term for something lowbrow or poorly made at one point had positive connotations in the 1800s, when something great could be said to be cheesy as a rare Stilton. Over time, though, cheesy took on the connotation of something unappealing, an apparent reference to a low quality, stinky cheese.  A shoestring budget is a spending plan that's as thin and spindly as a shoestring. Not surprisingly, the term gained popularity during the Great Depression.  A line from The Moor of Venice, that I would liefer bide, features an old word for rather that shares a root with the words love and leave, as in by your leave.  Cabbies are sometimes known to stretch their hood, which means to fib to the dispatcher about their location. Sometimes they have to drive out of bounds to pick up a fare.  Quiz Guy Greg Pliska has a word puzzle based on so-called container clues, where the answer is divided into two words, one which is found inside the other. For this game, the answers are all Greek gods.  A Word-Book of Virginia Folk Speak from 1912 includes this gem: Bachelors' wives and old maid's children are the best people in the world.  What is a hipster? Is it an insult to call someone a hipster, even if they're, well, a hipster? Do hipsters identify themselves as hipsters? Grant traces the label from 1960s counterculture to today's skinny-jeaned Brooklyn paradox.  The handy term omnishambles means all in shambles, and has found its way from the British TV comedy The Thick of It to the floor of the House of Commons.  What is a cuculoris? This lighting grate, which also goes by such names as cookie, gobo, and dapple sheet, is used in photography to cast a dramatic shadow. There are lots of spellings of this word, including cucoloris, kookaloris, cookaloris, and cucalorus. The name may have to do with George Cukor, an early pioneer of the tool in old Hollywood.  Add this to your list of paraprosdokians: Two guys walked into a bar. The third one ducked.  Where does the term bootleg come from? Originally, smugglers tucked bottles of alcohol into their pants to sneak them onto Indian reservations to sell illegally. The term knockoff also refers to pants, and buttleg is a variant that can refer to contraband cigarettes.  Why do we call a ten-dollar bill a sawbuck? The support for woodworking known as a sawbuck folds out into the shape of an X, the same shape as the Roman numeral for ten. Hence, the slang term for the currency worth ten bucks.  Can you get away with calling a misspelled word a typo if you didn't know how to spell it in the first place? One variety of mistake is called a performance error, where the goof is somehow related to the machine or keyboard. A competence error occurs when someone doesn't know the difference between your and you're in the first place.  To spin a brodie or pull a brodie is to spin a doughnut in a car. The term derives from the name of Steve Brodie, who allegedly jumped off the Brooklyn Bridge in 1886. To do a brodie, originally meaning to jump or fall, came to mean any kind of stunt.  On the website A Poem From Us, people upload videos of themselves reading poetry from other writers. Here, David Jones reads \"A Cradle Song\" by William Butler Yeats. \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Sun, 24 Jun 2012 16:54:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Hosted by Martha Barnette and Grant Barrett. Produced by Stefanie Levine.",
  "itunes:image": "",
  "itunes:subtitle": "Get out your skinny jeans and pass the PBR!",
  "itunes:summary": "Get out your skinny jeans and pass the PBR! Martha and Grant discuss the definition of the word hipster. Also, what happens when you pull a brodie? And why do we describe something cheap or poorly made as cheesy? Also, sawbucks, pulling a brodie, shoestring budgets, the origins of bootlegging, and cabbie lingo, including the slang word bingo.  FULL DETAILS  A former cabbie shares his favorite jargon, like green pea and making your nut. Someone waving down an occupied cab is known as a bingo, and the cabbie will usually tell the dispatcher to send another car. A San Diego cabdriver has gathered much more taxi slang here.  Is there any etymological connection between the dairy product and the adjective cheesy, meaning inferior, cheap, or otherwise sub-par? This descriptive term for something lowbrow or poorly made at one point had positive connotations in the 1800s, when something great could be said to be cheesy as a rare Stilton. Over time, though, cheesy took on the connotation of something unappealing, an apparent reference to a low quality, stinky cheese.  A shoestring budget is a spending plan that's as thin and spindly as a shoestring. Not surprisingly, the term gained popularity during the Great Depression.  A line from The Moor of Venice, that I would liefer bide, features an old word for rather that shares a root with the words love and leave, as in by your leave.  Cabbies are sometimes known to stretch their hood, which means to fib to the dispatcher about their location. Sometimes they have to drive out of bounds to pick up a fare.  Quiz Guy Greg Pliska has a word puzzle based on so-called container clues, where the answer is divided into two words, one which is found inside the other. For this game, the answers are all Greek gods.  A Word-Book of Virginia Folk Speak from 1912 includes this gem: Bachelors' wives and old maid's children are the best people in the world.  What is a hipster? Is it an insult to call someone a hipster, even if they're, well, a hipster? Do hipsters identify themselves as hipsters? Grant traces the label from 1960s counterculture to today's skinny-jeaned Brooklyn paradox.  The handy term omnishambles means all in shambles, and has found its way from the British TV comedy The Thick of It to the floor of the House of Commons.  What is a cuculoris? This lighting grate, which also goes by such names as cookie, gobo, and dapple sheet, is used in photography to cast a dramatic shadow. There are lots of spellings of this word, including cucoloris, kookaloris, cookaloris, and cucalorus. The name may have to do with George Cukor, an early pioneer of the tool in old Hollywood.  Add this to your list of paraprosdokians: Two guys walked into a bar. The third one ducked.  Where does the term bootleg come from? Originally, smugglers tucked bottles of alcohol into their pants to sneak them onto Indian reservations to sell illegally. The term knockoff also refers to pants, and buttleg is a variant that can refer to contraband cigarettes.  Why do we call a ten-dollar bill a sawbuck? The support for woodworking known as a sawbuck folds out into the shape of an X, the same shape as the Roman numeral for ten. Hence, the slang term for the currency worth ten bucks.  Can you get away with calling a misspelled word a typo if you didn't know how to spell it in the first place? One variety of mistake is called a performance error, where the goof is somehow related to the machine or keyboard. A competence error occurs when someone doesn't know the difference between your and you're in the first place.  To spin a brodie or pull a brodie is to spin a doughnut in a car. The term derives from the name of Steve Brodie, who allegedly jumped off the Brooklyn Bridge in 1886. To do a brodie, originally meaning to jump or fall, came to mean any kind of stunt.  On the website A Poem From Us, people upload videos of themselves reading poetry from other writers. Here, David Jones reads \"A Cradle Song\" by William Butler Yeats. \nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>Get out your skinny jeans and pass the PBR! Martha and Grant discuss the definition of the word hipster. Also, what happens when you pull a brodie? And why do we describe something cheap or poorly made as cheesy? Also, sawbucks, pulling a brodie, shoestring budgets, the origins of bootlegging, and cabbie lingo, including the slang word bingo.<br> <br> FULL DETAILS<br> <br> A former cabbie shares his favorite jargon, like green pea and making your nut. Someone waving down an occupied cab is known as a bingo, and the cabbie will usually tell the dispatcher to send another car. A San Diego cabdriver has gathered much more taxi slang <a href=\"http://socalcabbie.blogspot.com/2007/03/taxi-lingo-and-few-tricks-of-trade.html\">here</a>.<br> <br> Is there any etymological connection between the dairy product and the adjective cheesy, meaning inferior, cheap, or otherwise sub-par? This descriptive term for something lowbrow or poorly made at one point had positive connotations in the 1800s, when something great could be said to be cheesy as a rare Stilton. Over time, though, cheesy took on the connotation of something unappealing, an apparent reference to a low quality, stinky cheese.<br> <br> A shoestring budget is a spending plan that's as thin and spindly as a shoestring. Not surprisingly, the term gained popularity during the Great Depression.<br> <br> A line from <a href=\"http://www.classical.net/music/comp.lst/works/verdi/otello/otstory.php\">The Moor of Venice</a>, that I would liefer bide, features an old word for rather that shares a root with the words love and leave, as in by your leave.<br> <br> Cabbies are sometimes known to stretch their hood, which means to fib to the dispatcher about their location. Sometimes they have to drive out of bounds to pick up a fare.<br> <br> Quiz Guy Greg Pliska has a word puzzle based on so-called container clues, where the answer is divided into two words, one which is found inside the other. For this game, the answers are all Greek gods.<br> <br> <a href=\"http://books.google.com/books?id=KmYPAAAAYAAJ&source=gbs_book_other_versions\">A Word-Book of Virginia Folk Speak</a> from 1912 includes this gem: Bachelors' wives and old maid's children are the best people in the world.<br> <br> What is a <a href=\"http://nplusonemag.com/what-was-hipster\">hipster</a>? Is it an <a href=\"http://kottke.org/12/05/what-is-a-hipster\">insult</a> to call someone a hipster, even if they're, well, a hipster? Do hipsters identify themselves as <a href=\"http://www.theonion.com/articles/two-hipsters-angrily-call-each-other-hipster,5230/\">hipsters</a>? Grant traces the label from 1960s counterculture to today's skinny-jeaned Brooklyn paradox.<br> <br> The handy term <a href=\"http://www.worldwidewords.org/turnsofphrase/tp-omn1.htm\">omnishambles</a> means all in shambles, and has found its way from the British TV comedy <a href=\"http://www.bbc.co.uk/blogs/comedy/2009/10/the-thick-of-it-new-viewers-st.shtml\">The Thick of It</a> to the floor of the House of Commons.<br> <br> What is a <a href=\"http://lowel.com/edu/light_controls/cookaloris.html\">cuculoris</a>? This lighting grate, which also goes by such names as cookie, gobo, and dapple sheet, is used in photography to cast a dramatic shadow. There are lots of spellings of this word, including cucoloris, kookaloris, cookaloris, and cucalorus. The name may have to do with George Cukor, an early pioneer of the tool in old Hollywood.<br> <br> Add this to your list of <a href=\"http://www.englishforums.com/content/humour/paraprosdokians.htm\">paraprosdokians</a>: Two guys walked into a bar. The third one ducked.<br> <br> Where does the term bootleg come from? Originally, smugglers tucked bottles of alcohol into their pants to sneak them onto Indian reservations to sell illegally. The term knockoff also refers to pants, and buttleg is a variant that can refer to contraband cigarettes.<br> <br> Why do we call a ten-dollar bill a sawbuck? The <a href=\"http://www.endtimesreport.com/pictures/sawbuck-1.jpg\">support for woodworking</a> known as a sawbuck folds out into the shape of an X, the same shape as the Roman numeral for ten. Hence, the slang term for the currency worth ten bucks.<br> <br> Can you get away with calling a misspelled word a typo if you didn't know how to spell it in the first place? One variety of mistake is called a performance error, where the goof is somehow related to the machine or keyboard. A competence error occurs when someone doesn't know the difference between your and you're in the first place.<br> <br> To spin a brodie or pull a brodie is to spin a doughnut in a car. The term derives from the name of Steve Brodie, who <a href=\"http://books.google.com/books?id=Qwkexx6OATEC&pg=PA145&dq=steve+brodie+brooklyn+bridge&hl=en&sa=X&ei=y03eT7HrBYiG8QTX_7X0Cg&ved=0CEMQ6AEwAQ#v=onepage&q&f=false\">allegedly jumped off the Brooklyn Bridge</a> in 1886. To do a brodie, originally meaning to jump or fall, came to mean any kind of stunt.<br> <br> On the website <a href=\"http://apoemfromus.com\">A Poem From Us</a>, people upload videos of themselves reading poetry from other writers. Here, David Jones reads <a href=\"http://apoemfromus.com/poems/a-cradle-song/\">\"A Cradle Song\"</a> by William Butler Yeats.<br> <br></p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 3170,
  "itunes:explicit": "no",
  "guid": "b5410a50b032526892564c554d53cf98",
  "enclosure": ""
}