{
  "title": "EPISODE 11 Caravaggio (Part 1): Light and Darkness",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 18 Aug 2016 08:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2016/8/15/episode-11-caravaggio-part-1-light-and-darkness",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:57b21ab703596e58a6a962f4",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1471290228925-IL5HI3QU6ESED6LDTXUW/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"57b21b72414fb514a391e71b\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1471290228925-IL5HI3QU6ESED6LDTXUW/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n\n\n\n<p class=\"\">During a visit to a church in Sicily, a priest offered Caravaggio holy water. Caravaggio asked the old priest what it was for. “It will cancel your venial sins, my son,” replied the priest. “Then it’s no use—Caravaggio commented—My sins are all mortal.”</p><p class=\"\">Gilles Lambert about Caravaggio and his friends: “They provoked the Papal police, hung around with the many Roman women of easy virtue, drank excessively and frightened the bourgeoisie.”</p><p class=\"\">He was the greatest artist of his age, and also an outlaw whose passion for hookers was only second to his propensity for ending up in jail. Caravaggio was equally talented with paint and canvas as he was with the sword and with the art of breaking out of prison. With the same hand with which he painted the most amazing masterpieces of the Renaissance, he stabbed pimps and bludgeoned cops. His art was as scandalous as his life: he brought a lowbrow brand of violent realism and sexuality to the traditional religious subjects that were commissioned by the Church: imagine Quentin Tarantino painting scenes from the Bible. But the more the elite hated him, the more the common people adored him. No painter of his day—and probably ever—was able to have such a magnetic effect on masses of people.&nbsp;</p><p class=\"\">This first part of his tale features a plague killing most of Caravaggio’s family, attempts at theocracy in the Milan of the late 1500s, the Italian Robin Hood Marco di Sciarra, street life in Rome, “no hope-no fear”, the Cenci execution, and Caravaggio becoming a superstar of the Roman art scene.&nbsp;</p><p class=\"\">Please, show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a> and use the code “daniele” at checkout for a discount.&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "01:56:16",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 11,
  "itunes:title": "EPISODE 11 Caravaggio (Part 1): Light and Darkness",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 11 Caravaggio (Part 1): Light and Darkness"
  }
}