{
  "title": "16: Episode 15",
  "link": "https://audioboom.com/posts/7316383",
  "itunes:episode": 16,
  "itunes:title": "Episode 15",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5003,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our November 12th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>Our huge live show with PotterCast, recorded at Manhattan’s Union Square Barnes & Noble right after the premiere of <em>Harry Potter and the Goblet of Fire</em>. More than 500 fans came out to say hello; we all were downright terrified.<br>\n<br>\n\n</div>\n<ul>\n<li>Melissa’s mom brings us reports from the official <em>Goblet</em> after-party –<br>\nEmma Watson, Jamie Waylett, Robert Pattinson, Matthew Lewis, Katie<br>\nLeung and Tolga Safer live on the show</li>\n<li>The actors about the volume of the Barnes & Noble crowd: “Oh-my-god!”</li>\n<li>Andrew is extraordinarily agreeable. “Yeah? YEAH!!!”</li>\n<li>Emerson and Melissa revisit the delusional debacle: Emerson comes face<br>\nto face with an H/H’er</li>\n<li>The real Micah Tannenbaum stood up, and his news voice sat down</li>\n<li>John Noe cries</li>\n<li>GOF: Better than POA? “YEAH!!!”</li>\n<li>The crew discuss the film in full detail – spoilers everywhere and no one cares</li>\n<li>House-elves, magical creatures, the maze, angry roots and impatient fug</li>\n<li>Kevin Steck is backwards compatible</li>\n<li>Dumbledore: too aggressive?</li>\n<li>John summons the (clumsy) ghost of Sirius Black</li>\n<li>Sue has a close encounter of the real kind with Jason Isaacs, who we<br>\nlearn enjoys a nice Potter podcast on his morning jog</li>\n<li>Hi, Jason!</li>\n<li>The scoop on Skeeter in Movie 4</li>\n<li>Dan Radcliffe: looking forward to filming the Book 6 scenes with Ginny</li>\n<li>Andrew “row’s” with the audience over pronunciation</li>\n<li>Mama Sue warns about <em>Goblet’s</em> intense ending</li>\n<li>A fan chooses the podcast over DisneyWorld (we tried to make it up to her)</li>\n<li>Was it a good time? Yeah. Yeah? YEAH!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Sat, 12 Nov 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316383",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}