{
  "title": "The Edition: Putin's rage",
  "link": "https://audioboom.com/posts/8041163",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2303,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: What’s the mood on the ground in Ukraine and Russia?</div>\n<div><br>\n</div>\n<div>For this week’s cover piece, Owen Matthews asks whether the invasion of Ukraine will mean the end of Putin’s regime. And in this week’s Spectator diary, Freddy Gray reports on pride and paranoia on the streets of Lviv. They join the podcast, to talk about Russia’s future and Ukraine’s present. (00:49)</div>\n<div><br>\n</div>\n<div>Also this week: Is Germany ready to tackle its dependence on Russian gas?</div>\n<div><br>\n</div>\n<div>In response to Russia’s invasion, Germany has abandoned its Nord Stream 2 pipeline, sent lethal weapons to Ukraine and, most strikingly of all, has committed to the Nato target of spending 2 per cent of GDP on defence - a €100 billion fund. James Forsyth, who writes about Germany’s new reality in this week’s magazine, joins the podcast along with Stefanie Bolzen, a journalist for Welt. (17:18)</div>\n<div><br>\n</div>\n<div>And finally: Are traditional British brands losing their soul?</div>\n<div><br>\n</div>\n<div>Harry Wallop, in this week’s Spectator, wonders why some of Britain's oldest and most distinctive brands are trashing their reputation. They are selling out, changing the very thing that made them special in order to appeal to foreign millionaires. He joins the podcast along with a popular culture expert. Nick Ede.</div>\n<div>(29:40)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 03 Mar 2022 13:00:25 +0000",
  "guid": "tag:audioboom.com,2022-03-03:/posts/8041163",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}