{
  "title": "The Alpha Albums Contest: Pygmalion Edition",
  "link": "https://blog.wolframalpha.com/2014/09/02/the-alpha-albums-contest-pygmalion-edition/",
  "comments": "https://blog.wolframalpha.com/2014/09/02/the-alpha-albums-contest-pygmalion-edition/#comments",
  "pubDate": "Tue, 02 Sep 2014 14:04:56 +0000",
  "dc:creator": "The Wolfram&#124;Alpha Team",
  "category": [
    "Culture & Media",
    "Music",
    "Words & Linguistics"
  ],
  "guid": "https://blog.wolframalpha.com/?p=28592",
  "description": "This year, Wolfram is excited to be sponsoring the tenth anniversary of the annual Pygmalion Music Festival, which takes place in our hometown of Champaign&#8211;Urbana. If you aren’t familiar with Pygmalion, it’s a music festival held locally that brings together incredible musical artists, authors, and vendors in one amazing weekend. Of course, the music is [&#8230;]",
  "content:encoded": "<p>This year, Wolfram is excited to be sponsoring the tenth anniversary of the annual <a href=\"http://www.thepygmalionfestival.com/\" target=\"_blank\">Pygmalion Music Festival</a>, which takes place in our hometown of Champaign&#8211;Urbana. If you aren’t familiar with Pygmalion, it’s a music festival held locally that brings together incredible musical artists, authors, and vendors in one amazing weekend. Of course, the music is always the focus, and to really get behind that, we’ve got a great way to interact with fans of both math and music.</p>\n<p>We’re bringing back our <a href=\"https://blog.wolframalpha.com/2013/12/09/alpha-albums/\">Alpha Albums contest</a> with new song lyrics (collected in collaboration with <a href=\"http://www.lyricfind.com/\" target=\"_blank\">LyricFind</a>) from some of the bands that will be featured at this year’s festival! What that means is that we take albums from the artists, enter a word cloud query request in Wolfram|Alpha for that album, and post the generated image in a tweet. From there, all you loyal fans will have one hour to submit your guesses via <a href=\"https://twitter.com/wolfram_alpha\" target=\"_blank\">Twitter</a> in an @-reply; at the end of the submission period, we will choose a random winner from the correct entries.<span id=\"more-28592\"></span></p>\n<p><img class=\"alignnone size-full wp-image-28644\" title=\"Last Splash word cloud\" src=\"https://content.wolfram.com/uploads/sites/35/2014/08/breeders.png\" alt=\"Last Splash word cloud\" width=\"445\" height=\"579\" srcset=\"https://content.wolfram.com/uploads/sites/35/2014/08/breeders.png 445w, https://content.wolfram.com/uploads/sites/35/2014/08/breeders-230x300.png 230w\" sizes=\"(max-width: 445px) 100vw, 445px\" /></p>\n<p>We know it will be mighty tempting to cheat the system and try to search the lyrics online, but we’re hoping that everyone will play nice and keep the competition fair. Here are a few helpful hints to get you started:</p>\n<ul>\n<li>The largest words, closest to the center, appear most frequently on the album. Common words like &#8220;and,&#8221; &#8220;or,&#8221; etc., are removed by default.</li>\n<li>Look for unusual words that might tip you off to specific songs, like “cannonball” in the word cloud pictured above (from <em>Last Splash</em> by The Breeders).</li>\n</ul>\n<p>So what&#8217;s in it for you? Our lucky winners will receive three free months of <a href=\"http://www.wolframalpha.com/pro/\">Wolfram|Alpha Pro</a>!</p>\n<p>And as an added bonus for those of you attending Pygmalion, Wolfram will have a booth at the festival on Saturday and Sunday where you can participate in a live version of this contest. Fans who correctly guess the word clouds on display at the booth will have the opportunity to win posters of the word clouds! The grand prize winner will have his or her poster autographed by one of the headliners!</p>\n<p>The contest goes live tomorrow at 1pm CDT and will be held every Wednesday running up to the first day of the festival, Thursday, September 25. Good luck!</p>\n<p>For a full list of Alpha Albums contest rules, visit <a href=\"https://blog.wolframalpha.com/official-rules-for-the-wolframalpha-alpha-albums-contest-pygmalion\">Official Rules for the Wolfram|Alpha® Alpha Albums Contest</a>. Let us know your thoughts in the comments or on Twitter, and have a great time!</p>\n",
  "wfw:commentRss": "https://blog.wolframalpha.com/2014/09/02/the-alpha-albums-contest-pygmalion-edition/feed/",
  "slash:comments": 1
}