{
  "title": "Powell Admits the Fed Is Failing on Inflation, and Promises More Rate Hikes",
  "link": "https://mises.org/node/60854",
  "description": "<p>The Federal Reserve's Federal Open Market Committee (FOMC) raised the target federal funds rate 75 basis points on Wednesday, marking the fourth 75-basis-point hike in a row since June. </p>\n<p>The federal funds rate is now the highest it's been since December of 2007 when the Fed was in the process of lowering the target rate as part of an effort to stimulate in the economy in the lead up to the 2008 financial crisis. The target rate still remains 1.25 percent below the peak rate of 5.25 percent reached during much of 2006 and 2007. </p>\n<div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/ffr_6.jpg\" title=\"ffr\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-D289x7XeyO0\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"ffr\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"1\" alt=\"ffr\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/ffr_6.jpg?itok=MxVbYNNy\" width=\"1160\" height=\"806\" title=\"\" /></a></div>\n<p>According to <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/monetary20221102a.htm\">the Fed's press release</a> for Wednesday's announcement, the FOMC at this time expects additional rate increases:</p>\n<blockquote><p>The Committee anticipates that ongoing increases in the target range will be appropriate in order to attain a stance of monetary policy that is sufficiently restrictive to return inflation to 2 percent over time. In determining the pace of future increases in the target range, the Committee will take into account the cumulative tightening of monetary policy, the lags with which monetary policy affects economic activity and inflation, and economic and financial developments. In addition, the Committee will continue reducing its holdings of Treasury securities and agency debt and agency mortgage-backed securities, as described in the Plans for Reducing the Size of the Federal Reserve's Balance Sheet that were issued in May. The Committee is strongly committed to returning inflation to its 2 percent objective.</p></blockquote>\n<p><a href=\"https://www.youtube.com/watch?v=V7TqBEgjIyE\">Some observers</a> seized upon the language about taking into \"account the cumulative tightening of monetary policy, the lags with which monetary policy affects economic activity and inflation,\" as evidence that the FOMC is currently looking to reduce its pace of rate increases. For example, <a href=\"https://www.reuters.com/markets/us/fed-set-another-big-rate-hike-may-tamp-down-future-tightening-2022-11-02/\">according to Reuters</a>, this section of the press release \"signals possible smaller increases ahead.\" </p>\n<p>Moreover, during Powell's Wednesday press conference, the Fed chairman noted that a re-assessment of the current rate of hikes \"It may come as soon as the next meeting or the one after that ... No decision has been made. It is likely we will have a discussion about this at the next meeting.\"</p>\n<p>Yet, Powell also emphasized repeatedly that the FOMC does not anticipate a full reversal of its current tightening stance. Throughout the press conference, Powell repeatedly used phrases like \"we will stay the course\" and \"we still have some ways to go\" and \"it is very premature to talk about pausing [interest rate hikes].\"  </p>\n<p>Interestingly, Powell also continued his habit—developed in recent months—of admitting that the Fed is essentially winging it when it comes to choosing the \"correct\" policy. For example, on the issue of how high to raise the policy rate, Powell stated \"that level is very uncertain\" and he suggested he remains agnostic on the issue of whether or not the policy rate needs to \"to get above the [core PCE] inflation rate.\" Employing language used by Powell in the past to describe the sort of inflation that the Fed would absolutely prevent, one reporter asked Powell if inflation has become \"entrenched.\" In response Powell stated \"we don't have a scientitic understanding of at what point inflation becomes entrenched.\" </p>\n<p>Another aspect of Powell's comments was to defend himself from constant—and tiresomely incorrect—criticism on Wall Street that Powell has \"overtightened\" on policy. On this, Powell simply declared \"I don't think we've overtightened\" and fell back yet again on strong employment data. </p>\n<p>Yet, another reporter noted that with the yield-curve spread so small—<a href=\"https://www.reuters.com/markets/us/several-parts-us-yield-curve-are-inverted-what-does-it-tell-us-2022-11-01/\">and in some cases inverted</a>—\"why are you so confident you have not overtightened.\" This, of course, was a reference to the fact that a yield-curve inversion shows the economy is on its way to recession. On this, Powell offered no direct answer except for a jumbled response about how the Fed keeps track of it all. </p>\n<p>Powell increasingly appears to be a man increasingly coming to the realization that an economic bust is inevitable, although Powell will never admit that the Fed's inflationary boom is what is behind the bust. </p>\n<p>Finally, when asked about whether or not a \"soft landing\" was still possible, Powell claimed that it is \"hard to say\" and \"the path [to a soft landing] has narrowed\" and yet is still possible. The reason he gave for this is the fact that in spite of repeated rate hikes, \"we haven't seen inflation coming down. ...that means we have to make policy more restrictive and that narrows the path to a soft landing.\" As Robert Aro <a href=\"https://mises.org/power-market/powells-soft-landing\">points out</a>, however, the Fed has never actually defined what a \"soft landing\" actually is. </p>\n<p>It is quite interesting to note the<a href=\"https://mises.org/wire/fed-making-it-it-goes-so-it-ditched-forward-guidance\"> evolution of Powell's confidence since July</a>, and by \"evolution,\" I mean decline. In late 2021, after all, Powell spoke with immense confidence about <a href=\"https://mises.org/power-market/entrenched-new-transitory\">how the Fed had sufficient tools to \"prevent inflation from becoming entrenched</a>.\" Now he says he says the Fed lacks the information to know if inflation is entrenched. Forward guidance—remember that?—is also long gone. </p>\n<p>Instead what we have from the Fed and FOMC are increasingly vague statements about what the Fed may or may not do, and how it will re-evaluate its decisions at some point in the future. The Fed steadfastly refuses to provide any solid objectives, measures, or definitions for what will guide its policy, and instead relies on nonspecific statements about \"financial considtions\" and how the future is uncertain and \"patience\" is required. Notably, Powell did not say at this meeting—in contrast with other recent press conferences—that he does not see a recession on the horizon. </p>\n<p>These are the same people, of course, who now claim to be \"surprised\" by the appearance of 40-year highs in price inflation rates over the past year—after printing trillions of dollars—and insist no one saw it coming. These are supposed to be America's most brilliant and insightful observers of the economy. Powell's promises of using Fed policy tools to head off trouble have been repeatedly exposed as empty promises, and it is clear the Fed is simply improvising in hopes of somehow bringing down inflation rates without a severe recession. If this does come to pass, it's safe to say it will not be due to any particular insight, prudence, or wisdom on the part of the Fed and its officials. </p>\n\n",
  "author": "Ryan McMaken",
  "enclosure": "",
  "guid": 60854,
  "pubDate": "Wed, 02 Nov 2022 17:45:00 -0500",
  "source": "Mises Wire"
}