{
  "title": "Laminar mixed convection in an eccentric annular horizontal duct for a thermodependent non-Newtonian fluid. (arXiv:2211.01754v1 [physics.flu-dyn])",
  "link": "http://arxiv.org/abs/2211.01754",
  "description": "<p>The present work focuses on the study of mixed convection of a purely viscous\nshear-thinning fluid in a horizontal annular eccentric duct. The inner and\nouter cylinders are heated with constant and uniform heat flux densities. The\nobjective of this work is to study the effect of the variation of eccentricity,\nrheological behavior of the fluid as well as the thermodependency of the\nrheological parameters on the reorganization of the flow and thermal\nstratification caused by the buoyancy forces. At the entrance of the heating\nzone, the dynamic regime is assumed to be established and the temperature\nprofile uniform. The conservation equations are solved numerically using a\nfinite difference method with implicit schemes. A secondary azimuthal flow,\ninduced by natural convection, develops downstream of the inlet section. This\nflow creates a stratification of the thermal field on a given section of the\nduct, which intensifies downstream from the entrance. On the other hand, the\ndecrease in consistency with increasing temperature near the heated walls\nproduces a centrifugal radial flow towards the walls. The presence of an\neccentricity induces in turn a significant effect on the main dynamic field and\nthe stratification of the thermal field. Two cases of upward and downward\neccentricity are treated. These show that an upward shift increases the\nstratification of the thermal field, while the stratification begins to weaken\nfrom a certain amount of eccentricity in the case of downward shift. This\nrepresents an important result in terms of possible industrial applications. We\nmay indeed conclude that an appropriate choice of downward eccentricity can\nreduce the thermal stratification, observed experimentally in the case of a\nconcentric heated annular duct [1], when this stratification is undesirable.\nThe choice of this eccentricity depends on rheological and thermal properties\nof the fluid.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Messaoudene_N/0/1/0/all/0/1\">N Ait Messaoudene</a> (UB1), <a href=\"http://arxiv.org/find/physics/1/au:+Horimek_A/0/1/0/all/0/1\">A Horimek</a> (UB1), <a href=\"http://arxiv.org/find/physics/1/au:+Nouar_C/0/1/0/all/0/1\">C Nouar</a> (LEMTA), <a href=\"http://arxiv.org/find/physics/1/au:+Benaouda_Zouaoui_B/0/1/0/all/0/1\">B Benaouda-Zouaoui</a> (UB1)"
}