{
  "title": "Ep 255: London Has a Problem and It's a Job for a Psychologist",
  "pubDate": "Wed, 16 Mar 2016 15:12:41 +0000",
  "guid": "ef506979d8cdc624ff1a4cd6311d0801",
  "link": "http://thepsychfiles.libsyn.com/ep-255-london-has-a-problem-and-its-a-job-for-a-psychologist-tube",
  "itunes:image": "",
  "description": "<p>London needs help and only a person trained in psychology can fix this. There are just too many Londoners using their subway (the \"tube\") and instead of standing side by side as they go up the escalator, people are doing what they always do - they stand single file on the right of the escalator so that people in a hurry can pass on the left. That's a fine social norm when there aren't that many people, but if London transport is going to be usable as the population grows they're going to have to get people to behave differently.</p>\n<p>How can we break such a strong norm? It's not just London's problem. When you go up the stairs which side do you stand on? The right of course, and you expect the people coming down the stairs to stay to their right. When someone doesn't follow the norm we can get pretty annoyed.</p>\n<p>So what can we do to create a wide scale change in behavior? We have to apply a little social psychology.</p>",
  "content:encoded": "<p>London needs help and only a person trained in psychology can fix this. There are just too many Londoners using their subway (the \"tube\") and instead of standing side by side as they go up the escalator, people are doing what they always do - they stand single file on the right of the escalator so that people in a hurry can pass on the left. That's a fine social norm when there aren't that many people, but if London transport is going to be usable as the population grows they're going to have to get people to behave differently.</p>\n<p>How can we break such a strong norm? It's not just London's problem. When you go up the stairs which side do you stand on? The right of course, and you expect the people coming down the stairs to stay to their right. When someone doesn't follow the norm we can get pretty annoyed.</p>\n<p>So what can we do to create a wide scale change in behavior? We have to apply a little social psychology.</p>",
  "enclosure": "",
  "itunes:duration": "18:29",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "London needs help and only a person trained in psychology can fix this. There are just too many Londoners using their subway (the \"tube\") and instead of standing side by side as they go up the escalator, people are doing what they always do - they...",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "London needs help and only a person trained in psychology can fix this. There are just too many Londoners using their subway (the \"tube\") and instead of standing side by side as they go up the escalator, people are doing what they always do - they stand single file on the right of the escalator so that people in a hurry can pass on the left. That's a fine social norm when there aren't that many people, but if London transport is going to be usable as the population grows they're going to have to get people to behave differently. How can we break such a strong norm? It's not just London's problem. When you go up the stairs which side do you stand on? The right of course, and you expect the people coming down the stairs to stay to their right. When someone doesn't follow the norm we can get pretty annoyed. So what can we do to create a wide scale change in behavior? We have to apply a little social psychology."
}