{
  "title": "I'm Loyal to Nothing Except the Dream",
  "description": "<!--kg-card-begin: markdown--><p>There is much I take for granted in my life, and the normal functioning of American government is one of those things. In my 46 years, I've lived under nine different presidents. The first I remember is Carter. I've voted in every presidential election since 1992,</p>",
  "link": "https://blog.codinghorror.com/im-loyal-to-nothing-except-the-dream/",
  "guid": "5988f60721f57d0019a2e127",
  "dc:creator": "Jeff Atwood",
  "pubDate": "Mon, 30 Jan 2017 09:19:56 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>There is much I take for granted in my life, and the normal functioning of American government is one of those things. In my 46 years, I've lived under nine different presidents. The first I remember is Carter. I've voted in every presidential election since 1992, but I do not consider myself a Democrat, or a Republican. I vote based on leadership &#x2013; above all, leadership &#x2013; and issues.</p>\n<p>In my 14 years of blogging, I've never written a political blog post. I haven't needed to.</p>\n<p>Until now.</p>\n<p>It is quite clear <strong>something has become deeply unglued in the state of American politics.</strong></p>\n<ul>\n<li>\n<p>The nuclear doomsday clock was <a href=\"http://www.reuters.com/article/us-science-doomsdayclock-idUSKBN15A2JJ\">just moved as close to midnight</a> as it has been in 64 years.</p>\n</li>\n<li>\n<p>America was downgraded from a <a href=\"http://www.cnbc.com/2017/01/25/us-is-no-longer-a-full-democracy-eiu-warns.html\">Democracy to a Flawed Democracy</a>.</p>\n</li>\n</ul>\n<p>As of 2017, the United States, through a sequence of highly improbable events, managed to elect an extremely controversial president.</p>\n<p><img src=\"https://blog.codinghorror.com/content/images/2017/01/voting-in-2016-presidential-election.png\" alt loading=\"lazy\"></p>\n<p>A president with <a href=\"http://fortune.com/2017/01/29/donald-trump-approval-rating-gallup/\">historically low approval ratings</a>, elected on a platform many considered <a href=\"https://www.theguardian.com/technology/2016/oct/31/peter-thiel-defends-donald-trump-muslim-ban-mexico-wall\">too extreme to even be taken literally</a>:</p>\n<blockquote>\n<p>Asked about Trump&#x2019;s statements proposing the construction of a wall on the US-Mexico border and a ban on all Muslims entering the country, Thiel suggested that Trump supporters do not actually endorse those policies.</p>\n<p>&#x201C;I don&#x2019;t support a religious test. I certainly don&#x2019;t support the specific language that Trump has used in every instance,&#x201D; he said. &#x201C;But I think one thing that should be distinguished here is that the media is always taking Trump literally. It never takes him seriously, but it always takes him literally.&#x201D;</p>\n<p>The billionaire went on to define how he believes the average Trump supporter interprets the candidate&#x2019;s statements. &#x201C;I think a lot of voters who vote for Trump take Trump seriously but not literally, so when they hear things like the Muslim comment or the wall comment their question is not, &#x2018;Are you going to build a wall like the Great Wall of China?&#x2019; or, you know, &#x2018;How exactly are you going to enforce these tests?&#x2019; What they hear is we&#x2019;re going to have a saner, more sensible immigration policy.&#x201D;</p>\n</blockquote>\n<p>A little over a week into the new presidency, it is obvious that <strong>Trump meant every word of what he said.</strong> He will <a href=\"https://www.nytimes.com/2017/01/26/world/mexicos-president-cancels-meeting-with-trump-over-wall.html\">build a US-Mexico wall</a>. And he signed an executive order that <em>literally</em>, not figuratively, <a href=\"http://www.cnn.com/2017/01/28/politics/donald-trump-executive-order-immigration-reaction/\">banned Muslims from entering the US</a> &#x2014; even if they held valid green cards.</p>\n<p>As I said, I vote on policies, and <strong>as an American, I reject these two policies.</strong> Our Mexican neighbors are not an evil to be kept out with a wall, but an ally to be cherished. One of my <a href=\"https://en.wikipedia.org/wiki/Miguel_de_Icaza\">favorite people</a> is a Mexican immigrant. Mexican culture is ingrained deeply into America and we are all better for it. The history of America is the history of immigrants seeking religious freedom from persecution, finding a new life in the land of opportunity. Imagine the bravery it takes to leave everything behind, your relatives, your home, your <em>whole life as you know it</em>, to take your entire family on a five thousand mile journey to another country on nothing more than the promise of a dream. I've never done that, though my great-great grandparents did. Muslim immigrants are <a href=\"https://www.buzzfeed.com/sarahmathews/how-to-get-your-green-card-in-america?utm_term=.lsbOAjkpl#.vjXYP1qbQ\">more American than I will ever be</a>, and I am incredibly proud to have them here, as fellow Americans.</p>\n<p><a href=\"http://www.snopes.com/superman-1950-poster-diversity/\"><img src=\"https://blog.codinghorror.com/content/images/2017/01/help-keep-your-school-all-american.jpg\" alt=\"Help Keep Your School All American!\"></a></p>\n<p>Trump is the first president in 40 years to <a href=\"http://money.cnn.com/2017/01/23/news/economy/donald-trump-tax-returns/\">refuse to release</a> his tax returns in office. He has also refused to <a href=\"http://www.npr.org/sections/thetwo-way/2017/01/12/509421108/u-s-ethics-official-trumps-divestiture-is-hard-pricy-and-essential\">divest himself</a> from his dizzying array of businesses across the globe, which present financial conflicts of interest. All of this, plus the hasty way he is ramrodding his campaign plans through on executive orders, with little or no forethought to how it would work &#x2013; or if it would work at all &#x2013; speaks to <strong>how negligent and dangerous Trump is as the leader of the free world.</strong> I want to reiterate that I don't care about party; I'd be absolutely over the moon with President Romney or President McCain, or any other rational form of leadership at this point.</p>\n<p>It is unclear to me how we got where we are today. But echoes of this appeal to nationalism <a href=\"https://www.washingtonpost.com/world/europe/in-poland-a-window-on-what-happens-when-populists-come-to-power/2016/12/18/083577e8-c203-11e6-92e8-c07f4f671da4_story.html?utm_term=.31b3ca7bd3e6\">in Poland</a>, and <a href=\"https://www.washingtonpost.com/posteverything/wp/2017/01/27/in-venezuela-we-couldnt-stop-chavez-dont-make-the-same-mistakes-we-did/?utm_term=.b8a94d3760b2\">in Venezula</a>, offer clues. We brought <a href=\"https://bbs.boingboing.net/t/when-youre-accustomed-to-privilege-equality-feels-like-oppression/81995\">fact checkers to a culture war</a> &#x2026; and we lost. During the election campaign, I was strongly reminded of Frank Miller's 1986 Nuke story arc, which I read in Daredevil as a teenager &#x2014; the seductive appeal of unbridled nationalism bleeding across the page in stark primary colors.</p>\n<p><a href=\"https://www.amazon.com/dp/0785134816/?tag=codihorr-20\"><img src=\"https://blog.codinghorror.com/content/images/2017/01/daredevil-233-page.png\" alt=\"Daredevil issue 233, page excerpt\" loading=\"lazy\"></a></p>\n<p>Nuke is a self-destructive form of <a href=\"https://library.ucsd.edu/dc/search?f%5Bcollection_sim%5D%5B%5D=Dr.+Seuss+Political+Cartoons&f%5Bobject_type_sim%5D%5B%5D=image&f%5Bsubject_topic_sim%5D%5B%5D=War+and+domestic+issues--America+first\">America First nationalism</a> that, for whatever reasons, won the presidency through dark subvocalized whispers, and is now playing out in horrifying policy form. But we are not now a different country; we remain <em>the very same country that elected Reagan and Obama.</em> We lead the free world. And we do it by taking the higher moral ground, choosing to do what is <em>right</em> before doing what is expedient.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mUkv_jPgTeg\" frameborder=\"0\" allowfullscreen></iframe>\n<p>I exercised my rights as a American citizen and I voted, yes. But <strong>I mostly ignored government beyond voting</strong>. I assumed that the wheels of American government would turn, and reasonable decisions would be made by reasonable people. Some I would agree with, others I would not agree with, but I could generally trust that the arc of American history inexorably bends toward justice, towards freedom, toward equality. Towards the things that make up the underlying American dream that this country is based on.</p>\n<p>This is no longer the case.</p>\n<p>I truly believe we are at an unprecedented time in American history, in uncharted territory. I have benefited from democracy passively, without trying at all, for 46 years. I now understand that the next four years is perhaps <a href=\"http://fusion.net/story/379938/comic-trump-election-protest-civil-rights-movement-memphis/\">the most important time to be an activist in the United States since the civil rights movement</a>. <strong>I am ready to do the work.</strong></p>\n<ul>\n<li>\n<p>I have never once in my life called my representatives in congress. That will change. I will be calling and writing my representatives regularly, using <a href=\"https://5calls.org/\"><strong>tools like 5 Calls</strong></a> to do so.</p>\n</li>\n<li>\n<p>I will strongly support, advocate for, and advertise any technical tools on web or smartphone that help Americans have their voices heard by their representatives, even if it takes faxing to do so. Build these tools. <em>Make them amazing</em>.</p>\n</li>\n<li>\n<p>I am subscribing to support essential investigative journalism such as the <a href=\"https://www.nytimes.com/subscriptions/Multiproduct/lp8HYKU.html\">New York Times</a>, <a href=\"https://myaccount2.latimes.com/dsssubscribe.aspx\">Los Angeles Times</a>, and <a href=\"https://subscribe.washingtonpost.com/\">Washington Post</a>.</p>\n</li>\n<li>\n<p>I have set up large monthly donations to the <a href=\"https://www.aclu.org/\">ACLU</a> which is doing critical work in fighting governmental abuse under the current regime.</p>\n</li>\n<li>\n<p>I have set up monthly donations to independent journalism such as <a href=\"https://www.propublica.org/donate/\">ProPublica</a> and <a href=\"http://www.npr.org/stations/\">NPR</a>.</p>\n</li>\n<li>\n<p>I have set up monthly donations to agencies that fight for vulnerable groups, such as <a href=\"https://www.plannedparenthood.org/\">Planned Parenthood</a>, <a href=\"https://www.reproductiverights.org/\">Center for Reproductive Rights</a>, <a href=\"https://refugeerights.org/\">Refugee Rights</a>, <a href=\"http://www.naacp.org/\">NAACP</a>, <a href=\"http://www.maldef.org/\">MALDEF</a>, <a href=\"http://www.thetrevorproject.org/\">the Trevor Project</a>, and so on.</p>\n</li>\n<li>\n<p>I wish to see the formation of a third political party in the United States, led by those who are willing to speak truth to power like <a href=\"https://www.evanmcmullin.com/\">Evan McMullin</a>. It is shameful how many elected representatives will not speak out. Those who do: trust me, we're watching and taking notes. And we will be bringing all our friends and audiences to bear to help you win.</p>\n</li>\n<li>\n<p>I will be watching closely to see which representatives rubber-stamp harmful policies and appointees, and I will vote against them across the ticket, on every single ticket I can vote on.</p>\n</li>\n<li>\n<p>I will actively support all efforts to make the <a href=\"https://en.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact\">National Popular Vote Interstate Compact</a> happen, to reform the electoral college.</p>\n</li>\n<li>\n<p>To the extent that my schedule allows, I will participate in protests to combat policies that I believe are harmful to Americans.</p>\n</li>\n<li>\n<p>I am not quite at a place in my life where I'd consider running for office, but I will be, eventually. To the extent that <a href=\"https://stackoverflow.blog/2010/12/stack-exchange-moderator-elections-begin/\">any Stack Overflow user can be elected a moderator</a>, I could be elected into office, locally, in the house, even the senate. Has anyone asked Joel Spolsky if he'd be willing to run for office? Because I'd be hard pressed to come up with someone I trust more than my old business partner Joel to do the right thing. I would vote for him so hard I'd break the damn voting machine.</p>\n</li>\n</ul>\n<p>I want to pay back this great country for everything it has done for me in my life, and carry the dream forward, not just selfishly for myself and my children, but for everyone's children, and our children's children. I do not mean <a href=\"http://progressive.org/dispatches/howard-zinn-s-july-4-wisdom-stands-test-time/\">the hollow promises of American nationalism</a> &#x2026;</p>\n<blockquote>\n<p>We would do well to renounce nationalism and all its symbols: its flags, its pledges of allegiance, its anthems, its insistence in song that God must single out America to be blessed.</p>\n<p>Is not nationalism&#x2014;that devotion to a flag, an anthem, a boundary so fierce it engenders mass murder&#x2014;one of the great evils of our time, along with racism, along with religious hatred?</p>\n<p>These ways of thinking&#x2014;cultivated, nurtured, indoctrinated from childhood on&#x2014; have been useful to those in power, and deadly for those out of power.</p>\n</blockquote>\n<p>&#x2026; but the enduring values of freedom, justice, and equality that this nation was founded on. <strong>I pledge my allegiance to the American dream, and the American people</strong> &#x2013; not to the nation, <em>never</em> to the nation.</p>\n<p><a href=\"https://www.amazon.com/dp/0785134816/?tag=codihorr-20\"><img src=\"https://blog.codinghorror.com/content/images/2017/01/daredevil-233-page-loyal-to-nothing-except-the-dream.png\" alt=\"Daredevil issue 233, page excerpt\" loading=\"lazy\"></a></p>\n<p>I apologize that it's taken me 46 years to wake up and realize that some things, like the American dream, aren't guaranteed. There will come a time where you <em>have</em> to stand up and fight for them, for democracy to work. I will.</p>\n<p>Will you?</p>\n<table>\n<tr><td class=\"welovecodinghorror\">\n[advertisement] At Stack Overflow, we help developers learn, share, and grow. Whether you&#x2019;re looking for your next dream job or looking to build out your team, <a href=\"http://careers.stackoverflow.com\" rel=\"nofollow\">we've got your back</a>.\n</td></tr>\n</table><!--kg-card-end: markdown-->"
}