{
  "title": "10: Episode 10",
  "link": "https://audioboom.com/posts/7316369",
  "itunes:episode": 10,
  "itunes:title": "Episode 10",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2520,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our October 09th, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>Philadelphia International? The Barnes & Noble bathroom? Andrew wants you to come up with the wackiest, yet realistic places to podcast from. And as the crew discusses Harry?s most visible physical attribute and its connection to the final word in the last installment, is it possible that the dementors somehow <em>scarred</em> Petunia? Is her past seemingly more connected to the wizarding world than we realize? Plus, will Harry <em>remember</em> to check the Pensieve before he goes on his newest adventure?<br>\n<br>\n\n</div>\n<div>We?re throwing it all back with Andrew, Ben, and Kevin on this week?s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>The original three hosts reminisce on the short history of the show</li>\n<li>Andrew says we’re the number one un-promoted podcast on iTunes</li>\n<li>Take that, Al Franken</li>\n<li>Andrew and Ben reveal their plans for special journey podcast</li>\n<li>Impromptu meet-up plan: 6 PM, November 9th at Philly International!</li>\n<li>Andrew will be wearing his…uh…hmm… …oh forget it</li>\n<li>We’ll be setting new standards in podcasting during the NYC premiere</li>\n<li>Will Philly International Security stop us from recording?</li>\n<li>Main topic: GOF media madness</li>\n<li>Are all these pictures too much for the fans?</li>\n<li>TV Spots go high-res online</li>\n<li>Don’t date the show!</li>\n<li>Mad-Eye Moody mini-section</li>\n<li>Actor/Character comparisons</li>\n<li>GOF video game/soundtrack release date screw-up</li>\n<li>Andrew tells a secret</li>\n<li>Will the Dursleys make an appearance in the 7th book? Why does Petunia act strangely around Harry?</li>\n<li>Ben tells what he thinks is the “Ultimate Plot Twist of All Time”</li>\n<li>Our thoughts on the GOF video games</li>\n<li>Andrew calls out EA for a free video game to review. He promises a positive review!</li>\n<li>…while Kevin says he’ll review one honestly.</li>\n<li>Has Aunt Petunia had a run in with dementors in the past?</li>\n<li>What does the last word being “scar” in HP 7 mean?</li>\n<li>Is it possible that Dumbledore stored his memories in a Pensieve?</li>\n<li>Andrew’s Listener Challenge x2 (NYC podcasting ideas and remixes)</li>\n<li>Spy on Spartz</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Sun, 09 Oct 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316369",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}