{
  "title": "EPISODE 37 The 47 Ronin (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 26 Jul 2018 13:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2018/7/23/episode-37-the-47-ronin-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5b55fc2c2b6a28c467f55f59",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1532361816226-4L56TLT7V7YQVDN4H1SE/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5b55fc55575d1f489ac90dc9\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1532361816226-4L56TLT7V7YQVDN4H1SE/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Among other things, the Way of the Samurai requires that he realize that something may occur at any moment to test the depth of his resolution, and day and night he must sort out his thought and prepare a line of action. Depending on the circumstances, he may win or lose. But avoiding dishonor is quite a separate consideration from winning or losing.”</em>&nbsp;— Hagakure </p><p class=\"\">&nbsp;<em>“It would not befit a samurai wife to shed sorrowful tears, so please be strong. Of course I will miss you, but this is what a warrior must do.” —</em> Kamisaki Norisuke</p><p class=\"\">The tale of the 47 Ronin is one of the most renowned revenge tales to ever come out of Japan. It is the subject of countless books, plays, and movies. It is also a story that has ignited never-ending debates. Some people argue that the 47 Ronin were paragons of virtue—perfect embodiments of the loyalty and honor that should be expected from the samurai. They offered the answer to the riddle that was plaguing the samurai at the beginning of the 1700s: what does being a member of a warrior class at a time of enduring peace? Other people instead look at the same story and walk away feeling like the 47 Ronin were violent thugs animated by questionable motives. In this two-part series of History on Fire, we dive deep into legend & history to find answers.&nbsp;</p><p class=\"\">In this episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">The conflict between the author of the Hagakure and the 47 Ronin</p></li><li><p class=\"\">Oishi’s long con</p></li><li><p class=\"\">Zen master Hakuin and social reputation</p></li><li><p class=\"\">Cutting family ties and getting ready to die</p></li><li><p class=\"\">The raid in the snow</p></li><li><p class=\"\">Giving a pep talk to a guy trying to cut your head off</p></li></ul><p class=\"\">This episode is brought to you by NordicTrack. NordicTrack has a series of training equipment to give you amazing workouts in the convenience of your home, including treadmills, exercise bikes, incline trainers, etc.&nbsp; Personally, I’m a huge fan of their products so I am quite excited to let you know about them. History on Fire listeners get $ 75 off your NordicTrack purchase by visiting: <a href=\"https://www.nordictrack.com/history\">https://www.nordictrack.com/history</a> and using the offer code ‘history’ at checkout. &nbsp;</p><p class=\"\">Today’s episode is supported by “<em>Human Circus Podcast</em>”—a great historical podcast by Devon Field. The <em>Human Circus Podcast</em> tells the tales of medieval travelers leaving their homelands for adventure in distant lands. You can listen and subscribe at <a href=\"https://humancircuspodcast.com/\">https://humancircuspodcast.com/</a> or on any podcast platform. Please, also add it on twitter at <a href=\"https://twitter.com/circus_human\">https://twitter.com/circus_human</a>&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get $ 30 off your first order—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing, and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">History on Fire is brought to you by Kannaway. All CBD products are from organic, non-GMO European HEMP grown on generational family farms. The products all have a triple authenticated process guaranteeing you’re getting exactly what you are paying for. Because all of the CBD is from hemp and NOT cannabis, it is legal to use and possess in all 50 states AND Europe! Now you can get 100% THC-free CBD oil from hemp, delivered to your door in all 50 of the Unites States and the whole of Europe. Please check them out at: <a href=\"https://kannaway.com/2496006\">https://kannaway.com/2496006</a>&nbsp;</p><p class=\"\">A huge thank you to <a href=\"https://www.dynastyforge.com/\">https://www.dynastyforge.com/</a> for sharing with me their amazing swords.&nbsp;</p><p class=\"\">If you train in Jiujitsu (or any other sport for that matter), check out the knee braces at <a href=\"https://nevertapgear.com/\">https://nevertapgear.com/</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">And Donations in crypto-currencies can be made to:&nbsp;</p><p class=\"\">Btc: 1Fdzfr1aPMFdwBY5GXe71nLo11HSMxEfRw</p><p class=\"\">Eth: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924&nbsp;</p><p class=\"\">Ltc: LMW7m54iovT1GK6yZxYXUVPT52pXD9CmjN </p><p class=\"\">Zec: t1NgHHkaEqFM9XzdAZf5u16MRmmz6ruHyTD&nbsp;</p><p class=\"\">Slt: 0x0deedc896c8e23c3a9daf39e4a9fadada656e924</p><p class=\"\"><br>My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:18:27",
  "itunes:image": "",
  "itunes:title": "EPISODE 37 The 47 Ronin (Part 2)",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 37 The 47 Ronin (Part 2)"
  }
}