{
  "title": "How Interconnected Are Cryptocurrencies and What Does This Mean for Risk Management",
  "link": "https://fedinprint.org/item/fedhle/93855",
  "description": "In the past couple of years, the market for digital currencies, commonly known as cryptocurrencies because transactions are verified using cryptography, has expanded significantly in terms of transaction volumes, market capitalization, and the number of digital currencies in existence. On January 1, 2018, the market capitalizations (market caps1) of Bitcoin and Ethereum were $226 billion and $75 billion, respectively. By May 10, 2021, Bitcoin’s market cap had reached almost $1 trillion and Ethereum’s $478 billion.\nIn this article, I measure the market’s interconnections in term of prices and volatility. Measuring \ninterconnection (or connectedness) is important for both measuring and managing risk. The more the \nmarket is connected, the more sensitive it is to shocks. While the cryptocurrency market is not very \nlarge relative to the other markets studied in the literature, it is growing at a fast pace and a preliminary \nassessment might be useful. Moreover, the risk associated with a portfolio of cryptocurrencies is \nnot simply a weighted sum of the risks of its components; rather, the overall risk depends on how the \npieces interact—whether and how they are connected. Similarly, in an interconnected market, the \nrisk of a single currency does not depend only on its own idiosyncratic characteristics, but also on \nthe volatility of other currencies and on the extent to which they are interconnected.",
  "guid": "https://fedinprint.org/item/fedhle/93855",
  "dc:creator": "Ferroni, Filippo",
  "dc:date": "2022-03-01",
  "rdau:hasExtent": 5,
  "dc:subject": "Cryptocurrencies; Market integration; Connectedness and Spillover; VAR; Portfolio Choice; investment decisions; Financial Forecasting and Simulation; Federal Reserve Bank of Chicago; Chicago Fed; Federal Reserve System",
  "bibo:issue": 466,
  "bibo:series": "Chicago Fed Letter"
}