{
  "title": "Day 62: Spies Sent to Canaan (2021)",
  "link": "https://bibleinayear.fireside.fm/day-62",
  "guid": "d890f0b6-9046-4697-9caf-0d8bbd3ff11f",
  "pubDate": "Wed, 03 Mar 2021 00:00:00 -0500",
  "author": "Ascension",
  "enclosure": "",
  "itunes:episodeType": "full",
  "itunes:author": "Ascension",
  "itunes:subtitle": "As we read Numbers 12 and 13, Deuteronomy 11, and Psalm 94, Fr. Mike reflects on the conflict between Aaron, Miriam, and Moses and explains why Miriam appears to be the only one punished. He also mentions the lack of trust the people continue to have in God, as they discover that the land of Canaan is occupied by a seemingly stronger force. For the complete reading plan visit ascensionpress.com/bibleinayear.",
  "itunes:duration": "21:22",
  "itunes:explicit": "no",
  "description": "As we read Numbers 12 and 13, Deuteronomy 11, and Psalm 94, Fr. Mike reflects on the conflict between Aaron, Miriam, and Moses and explains why Miriam appears to be the only one punished. He also mentions the lack of trust the people continue to have in God, as they discover that the land of Canaan is occupied by a seemingly stronger force.\nFor the complete reading plan visit ascensionpress.com/bibleinayear.",
  "itunes:keywords": "aaron, moses, miriam, canaan, numbers 12, numbers 13, deuteronomy 11, psalm 94, psalms, promised land, land of canaan, israel, people of israel, israelites, tribes of israel, desert wanderings, 40 years in the desert, catholic, bible, bible in a year, bible in a year with fr.mike, bible in a year with fr.mike schmitz, bible in a year with fr mike, bible in a year with father mike, bible in a year with father mike schmitz, the bible in a year with fr.mike schmitz, the bible in a year with fr mike, the bible in a year with father mike, the bible in a year with father mike schmitz, father mike, fr.mike, fr mike, fr. mike schmitz, father mike schmitz, bible podcast, read the bible, read the bible in a year, bible in a year podcast, bible podcast fr mike, bible podcast fr.mike, bible podcast fr.mike schmitz, bible podcast father mike, bible podcast father mike schmitz, scripture, god’s word, the word of god, Catholic Church, catholicism, catholic faith, catholic priest, ascension, ascension press, christianity, catholic bible,roman catholic, christian, catholics, catholic bible, totus tuus, bible study, Catholic Bible Study, ascension presents, salvation history, the great adventure bible, the great adventure timeline, catholics, ascension catholic, religion, jesus, jesus christ, catholic religion, god,",
  "content:encoded": "<p>As we read Numbers 12 and 13, Deuteronomy 11, and Psalm 94, Fr. Mike reflects on the conflict between Aaron, Miriam, and Moses and explains why Miriam appears to be the only one punished. He also mentions the lack of trust the people continue to have in God, as they discover that the land of Canaan is occupied by a seemingly stronger force.</p>\n\n<p>For the complete reading plan visit ascensionpress.com/bibleinayear.</p><p><a href=\"https://ascensionpress.com/products/support-ascension\" rel=\"payment\">Support The Bible in a Year (with Fr. Mike Schmitz)</a></p>",
  "itunes:summary": "<p>As we read Numbers 12 and 13, Deuteronomy 11, and Psalm 94, Fr. Mike reflects on the conflict between Aaron, Miriam, and Moses and explains why Miriam appears to be the only one punished. He also mentions the lack of trust the people continue to have in God, as they discover that the land of Canaan is occupied by a seemingly stronger force.</p>\n\n<p>For the complete reading plan visit ascensionpress.com/bibleinayear.</p><p><a href=\"https://ascensionpress.com/products/support-ascension\" rel=\"payment\">Support The Bible in a Year (with Fr. Mike Schmitz)</a></p>",
  "fireside:playerURL": "https://fireside.fm/player/v2/pkZrCg5G+q_ozQhYV",
  "fireside:playerEmbedCode": "<iframe src=\"https://fireside.fm/player/v2/pkZrCg5G+q_ozQhYV\" width=\"740\" height=\"200\" frameborder=\"0\" scrolling=\"no\">"
}