{
  "title": "Individual Choice and Social Welfare with Viktor Vanberg",
  "pubDate": "Fri, 21 Sep 2018 17:17:30 +0000",
  "guid": "a6d8d40974ec437dae8225672a94bb88",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP106Vanberg_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href= \"https://www.eucken.de/en/mitarbeiter/prof-dr-viktor-j-vanberg/\" target=\"_blank\" rel=\"noopener\">Viktor Vanberg</a> of the Walter Eucken Institute. We discuss a recent working paper of his entitled <a href= \"https://www.econstor.eu/bitstream/10419/175379/1/1014349494.pdf\" target=\"_blank\" rel=\"noopener\">Individual Choice and Social Welfare: Theoretical Foundations of Political Economy</a>.</p> <blockquote>What we call an economy, i.e. the nexus of economic activities and relations within some defined regional limits – e.g. a local, a national or the world economy –, has always been subject to measures taken, or constraints imposed by political authorities. How economies work is inevitably, and to a significant extent, contingent on the political environment within which they operate.<br /> <br /> It is not surprising that economists studying the working principles of economic systems have rarely been content with confining their work to describing and explaining the economic realities they observe. Their ambitions always extended to passing judgments on the policies that shaped these realities and to providing guidance for what politics ought to do to improve economic matters. In economics explanations of what is and judgments on what politics should do are often not only more closely intertwined than in most other fields of scientific inquiry, and more than from practitioners in other fields the general public expects economists to pass such policy judgments.</blockquote> <p>We discuss welfare economics, what it means for economics to be an applied science, and the work of the late James Buchanan.</p> <hr /> <p> </p>",
  "content:encoded": "<p>Today's guest is <a href= \"https://www.eucken.de/en/mitarbeiter/prof-dr-viktor-j-vanberg/\" target=\"_blank\" rel=\"noopener\">Viktor Vanberg</a> of the Walter Eucken Institute. We discuss a recent working paper of his entitled <a href= \"https://www.econstor.eu/bitstream/10419/175379/1/1014349494.pdf\" target=\"_blank\" rel=\"noopener\">Individual Choice and Social Welfare: Theoretical Foundations of Political Economy</a>.</p> What we call an economy, i.e. the nexus of economic activities and relations within some defined regional limits – e.g. a local, a national or the world economy –, has always been subject to measures taken, or constraints imposed by political authorities. How economies work is inevitably, and to a significant extent, contingent on the political environment within which they operate.  It is not surprising that economists studying the working principles of economic systems have rarely been content with confining their work to describing and explaining the economic realities they observe. Their ambitions always extended to passing judgments on the policies that shaped these realities and to providing guidance for what politics ought to do to improve economic matters. In economics explanations of what is and judgments on what politics should do are often not only more closely intertwined than in most other fields of scientific inquiry, and more than from practitioners in other fields the general public expects economists to pass such policy judgments. <p>We discuss welfare economics, what it means for economics to be an applied science, and the work of the late James Buchanan.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "52:50",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of the Walter Eucken Institute. We discuss a recent working paper of his entitled . What we call an economy, i.e. the nexus of economic activities and relations within some defined regional limits – e.g. a local, a national or the...",
  "itunes:episode": 106,
  "itunes:episodeType": "full"
}