{
  "title": "UFYB 255: Healthism, Chronic Pain, and Thought Work: A Conversation with Deb Malkin and Michelle Kapler",
  "itunes:title": "Healthism, Chronic Pain, and Thought Work: A Conversation with Deb Malkin and Michelle Kapler",
  "pubDate": "Thu, 15 Sep 2022 07:00:00 +0000",
  "guid": "6c2f9a13-74ee-4a19-843d-4eb99baaac0d",
  "link": "https://unfuckyourbrain.com/255",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Sometimes, despite our best efforts, our bodies simply don’t work the way we want them to.</span> <span style=\"font-weight: 400;\">Maybe it’s an occasional occurrence for you or maybe it’s something you live with every day. We take on all sorts of messages about what health is (and what it’s not), how we get healthy, and how we stay healthy. But is all of the social messaging we absorb really helping us measure health? Or is it something that has been designed and packaged to tell us how to measure our own morality and worth?</span></p> <p> </p> <p><span style=\"font-weight: 400;\">Tune into my conversation with two of my students, Deb Malkin and Michelle Kapler, to learn why health is so challenging for so many of us, how we try to control our health, and how (as usual) trying to control something we can’t control, can make everything feel worse. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">Get full show notes and more information here: <a href=\"https://unfuckyourbrain.com/255\" target= \"_blank\" rel= \"noopener\">https://unfuckyourbrain.com/255</a></span></p>",
  "content:encoded": "<p>Sometimes, despite our best efforts, our bodies simply don’t work the way we want them to. Maybe it’s an occasional occurrence for you or maybe it’s something you live with every day. We take on all sorts of messages about what health is (and what it’s not), how we get healthy, and how we stay healthy. But is all of the social messaging we absorb really helping us measure health? Or is it something that has been designed and packaged to tell us how to measure our own morality and worth?</p> <p> </p> <p>Tune into my conversation with two of my students, Deb Malkin and Michelle Kapler, to learn why health is so challenging for so many of us, how we try to control our health, and how (as usual) trying to control something we can’t control, can make everything feel worse. </p> <p> </p> <p>Get full show notes and more information here: <a href=\"https://unfuckyourbrain.com/255\" target= \"_blank\" rel= \"noopener\">https://unfuckyourbrain.com/255</a></p>",
  "enclosure": "",
  "itunes:duration": "48:59",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Sometimes, despite our best efforts, our bodies simply don’t work the way we want them to. Maybe it’s an occasional occurrence for you or maybe it’s something you live with every day. We take on all sorts of messages about what health is (and...",
  "itunes:episode": 255,
  "itunes:episodeType": "full",
  "itunes:author": "Kara Loewentheil"
}