{
  "title": "The Kindness of Strangers with Michael McCullough",
  "pubDate": "Sun, 11 Oct 2020 17:35:45 +0000",
  "guid": "9ec51d97-94a4-45e0-b5c1-d4825f3bb07c",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/151_McCullough.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is Michael McCullough of the University of California, San Diego. We are discussing his book <a href= \"https://amzn.to/3dpUWQY\" target=\"_blank\" rel=\"noopener\">The Kindness of Strangers: How a Selfish Ape Invented a New Moral Code</a>.</p> <blockquote>How did humans, a species of self-centered apes, come to care about others? Since Darwin, scientists have tried to answer this question using evolutionary theory. In The Kindness of Strangers, psychologist Michael E. McCullough shows why they have failed and offers a new explanation instead. From the moment nomadic humans first settled down until the aftermath of the Second World War, our species has confronted repeated crises that we could only survive by changing our behavior. As McCullough argues, these choices weren’t enabled by an evolved moral sense, but with moral invention — driven not by evolution’s dictates but by reason.<br /> <br /> Today's challenges — climate change, mass migration, nationalism — are some of humanity’s greatest yet. In revealing how past crises shaped the foundations of human concern, The Kindness of Strangers offers clues for how we can adapt our moral thinking to survive these challenges as well.</blockquote> <hr />",
  "content:encoded": "<p>Today's guest is Michael McCullough of the University of California, San Diego. We are discussing his book <a href= \"https://amzn.to/3dpUWQY\" target=\"_blank\" rel=\"noopener\">The Kindness of Strangers: How a Selfish Ape Invented a New Moral Code</a>.</p> How did humans, a species of self-centered apes, come to care about others? Since Darwin, scientists have tried to answer this question using evolutionary theory. In The Kindness of Strangers, psychologist Michael E. McCullough shows why they have failed and offers a new explanation instead. From the moment nomadic humans first settled down until the aftermath of the Second World War, our species has confronted repeated crises that we could only survive by changing our behavior. As McCullough argues, these choices weren’t enabled by an evolved moral sense, but with moral invention — driven not by evolution’s dictates but by reason.  Today's challenges — climate change, mass migration, nationalism — are some of humanity’s greatest yet. In revealing how past crises shaped the foundations of human concern, The Kindness of Strangers offers clues for how we can adapt our moral thinking to survive these challenges as well. ",
  "enclosure": "",
  "itunes:duration": "59:44",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is Michael McCullough of the University of California, San Diego. We are discussing his book . How did humans, a species of self-centered apes, come to care about others? Since Darwin, scientists have tried to answer this question using...",
  "itunes:episode": 151,
  "itunes:episodeType": "full"
}