{
  "id": "tag:blogger.com,1999:blog-17171206.post-6378481353383398249",
  "published": "2014-06-20T14:03:00.002-07:00",
  "updated": "2014-06-20T14:03:33.028-07:00",
  "title": "Blog posts and Summer gigs",
  "content": "I have recently heard complaints that this blog is <a href=\"http://www.stackdriver.com/top-devops-influencers-blogs-follow/\">rather quiet lately</a>. I agree. I have definitely been focused on publishing through other sources and have found little time to write interesting things here. On the one hand, I find twitter ideal for communicating quick and short ideas, thoughts, or pointers. You should definitely <a href=\"http://www.twitter.com/xamat\">follow me</a> there if you want to keep up to date. On the other hand,&nbsp; I have published a couple of posts on the <a href=\"http://techblog.netflix.com/\">Netflix Techblog</a>. A few months ago we published a post describing <a href=\"http://techblog.netflix.com/2013/03/system-architectures-for.html\">our three-tier system architecture</a> for personalization and recommendations. More recently we described our implementation of <a href=\"http://techblog.netflix.com/2014/02/distributed-neural-networks-with-gpus.html\">distributed Neural Networks</a> using GPUs and the AWS cloud.<br /><br />The other thing I continue on doing very often is give talks of our work at different events and venues. In the last few months, for instance, I have given talks at LinkedIn, Facebook, and <a href=\"http://i.stanford.edu/infoseminar/\">Stanford</a>.<br /><br />This week I gave a talk and attended the Workshop on Algorithms for Modern Massive Datasets (<a href=\"http://mmds-data.org/\">MMDS</a>). This is a very interesting workshop organized by <a href=\"http://www.stat.berkeley.edu/~mmahoney/\">Michael Mahoney</a> every two years. It brings together a diverse crowd of people, from theoretical physicist and statisticians to industry practicioners. All of them are united by their work on large scale data-driven algorithms. You can find the slides of my presentation <a href=\"http://www.slideshare.net/xamat/mmds-2014-talk-distributing-ml-algorithms-from-gpus-to-the-cloud\">here</a>.<br /><br />So, what is next? If you want to catch some of my future talks, I will be giving a couple of public ones in the next few months.<br /><br />First, I will be lecturing in the Machine Learning Summer School (<a href=\"http://www.mlss2014.com/\">MLSS</a>) at CMU in early July. I am really looking forward to joining such a great least of speakers and visiting Pittsburgh for the first time. I will be lecturing on Recommendation Systems and Machine Learning Algorithms for Collaborative Filtering.<br /><br />Late August I will be giving a 3 hour long <a href=\"http://www.kdd.org/kdd2014/tutorials.html\">Tutorial</a> at KDD in New York. The tutorial is entitled \"The Recommender Problem Revisited\" and I will be sharing stage with <a href=\"http://www.cdm.depaul.edu/people/pages/facultyinfo.aspx?fid=653\">Bamshad Mobasher</a>.<br /><br />Finally, I was recently notified that a shorter version of the same tutorial has been accepted at <a href=\"http://recsys.acm.org/recsys14/\">Recsys</a>, which this year is held in the Silicon Valley.<br /><br />I look forward to meeting many of you in any of these events. Don't hesitate to ping me if you will be attending.<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Xavier Amatriain",
    "uri": "http://www.blogger.com/profile/14166119485952054870",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}