{
  "id": "yt:video:lY1X2BnjmNI",
  "yt:videoId": "lY1X2BnjmNI",
  "yt:channelId": "UCdZcGRaBV-VRRyU4t6Ur0mw",
  "title": "How Do Verbs Cause Things? Splitting the Verb Phrase",
  "link": "",
  "author": {
    "name": "The Ling Space",
    "uri": "https://www.youtube.com/channel/UCdZcGRaBV-VRRyU4t6Ur0mw"
  },
  "published": "2017-04-27T17:52:51+00:00",
  "updated": "2022-10-27T11:57:19+00:00",
  "media:group": {
    "media:title": "How Do Verbs Cause Things? Splitting the Verb Phrase",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "How do verbs like \"give\" and \"put\" juggle more than one object? Is there an element that lets verbs cause things to happen? In this week's episode, we talk about splitting up the verb phrase: how our basic syntactic theory has a hard time with verbs with more than one object; how the syntax of causation shows us why we should expand our trees; and how once we break the phrase up, we can capture all sorts of facts, from two-object verbs to ambiguities.\n\nThis is Topic #88!\n\nThis week's tag language: Kajin M̧ajeļ!\n\nRelated videos:\nHappy Little Trees: The Syntax of X' Theory - https://youtu.be/7UOcoQr0hvg\nReferential Treatment: Pronouns and Binding Theory - https://youtu.be/9sqm_cex4kA\nUp, Up, and Away: The Verb Phrase Initial Subject Hypothesis - https://youtu.be/EJoUyPIdu18\n\nLast episode:\nWorlds Between Us: The Pragmatics of Presuppositions - https://youtu.be/-iQ7XrehKdw\n\nOther of our syntax videos:\nRaising the Bar: Raising and Control Verbs - https://youtu.be/SYoYNeaSYrU\nDesert Island Words: Syntactic Islands - https://youtu.be/01uH4XfJx3g\nA Clause for Celebration: A History of Syntactic Clauses - https://youtu.be/980meOhBGR8\n\nOur website also has extra content about this week's topic, on how these ideas connect to the passive voice, at: http://www.thelingspace.com/episode-88/\n\nFind us on all the social media worlds:\nTumblr: http://thelingspace.tumblr.com/\nTwitter: http://twitter.com/TheLingSpace\nFacebook: http://www.facebook.com/thelingspace/\n\nAnd at our website, http://www.thelingspace.com/ !\nYou can also find our store at the website, https://thelingspace.storenvy.com/\n\nWe also have forums to discuss this episode, and linguistics more generally.\n\nSources:\nMuch of the basic argument found in the video can be found in this set of slides: https://apps.carleton.edu/people/cussery/assets/7._Introducing_little_v.pdf\n\nExamples were taken from Lisa Travis's 2010 book Inner Aspect (http://blogs.mcgill.ca/mcling/files/2012/01/Travis2010InnerAspect_Chpt6.pdf) and this paper by Heidi Harley: \nhttp://babel.ucsc.edu/~hank/mrg.readings/harley_06_On-the-causativ.pdf\n\nThere's also good stuff in the Wikipedia article on causatives: https://en.wikipedia.org/wiki/Causative#Lexical\n\nSome of the original work proposing splitting the VP includes Angelika Kratzer's 1996 paper \"Severing the external\nargument from its verb\" in Rooryck & Zaring, eds., \"Phrase structure and the lexicon, 109-137\". (https://people.ucsc.edu/~mcclosk/Teaching/severing-external-arg.pdf) and Richard Larson's 1988 paper \"On the double object construction\" in Linguistic Inquiry 19(3), 335-391.\n\nLooking forward to next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}