{
  "title": "\"Nothing About Us Without Us\"",
  "link": "https://spectrum.ieee.org/bionic-hand-editorial",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-two-people-holding-signs-outside-one-is-in-a-wheelchair.png?id=31822925&width=1200&height=600&coordinates=0%2C440%2C0%2C440\"/><br/><br/><p><strong>Before we redesigned</strong> our website a couple of years ago, we took pains to have some users show us how they navigate our content or complete specific tasks like leaving a comment or listening to a podcast. We queried them about what they liked or didn’t like about how our content is presented. And we took onboard their experiences and designed a site and a magazine based on that feedback.</p><p>So when I read this month’s cover story by Britt Young about using a variety of high- and low-tech prosthetic hands, I was surprised to learn that much bionic-hand development is conducted without taking the lived experience of people who use artificial hands into account.</p><hr/><p>I shouldn’t have been. While user-centered design is a long-standing practice in Web development, it doesn’t seem to have expanded deep into other product-development practices. A quick search on the IEEE Xplore Digital Library tallied less than 2,000 papers (out of 5.7 million) on “user-centered design.” Five papers bubbled up when searching “user-centered design” and “prosthesis.” </p><p>Young, who is working on a book about the prosthetics industry, was in the first cohort of toddlers fitted with a myoelectric prosthetic hand, which users control by tensing and relaxing their muscles against sensors inside the device’s socket. Designed by people Young characterizes as “well-intentioned engineers,” these technologically dazzling hands try to recreate in all its complex glory what Aristotle called “the instrument of instruments.” </p><p class=\"pull-quote\">“It’s more important that we get to live the lives we want, with access to the tools we need, than it is to make us look like everyone else.”</p><p>While high-tech solutions appeal to engineers, Young makes the case that low-tech solutions like the split hook are often more effective for users. “Bionic hands seek to make disabled people ‘whole,’ to have us participate in a world that is culturally two-handed. But it’s more important that we get to live the lives we want, with access to the tools we need, than it is to make us look like everyone else.”</p><p>As Senior Editor Stephen Cass pointed out to me, one of the rallying cries of the disabled community is “nothing about us, without us.” It is a response to a long and often cruel history of able-bodied people making decisions for people with disabilities. Even the best intentions don’t make up for doing things <em>for</em> disabled people instead of <em>with</em> them, as we see in Young’s article.</p><p>Assistive and other technologies can indeed have huge positive impacts on the lives of people with disabilities. <em>IEEE Spectrum</em> has covered many of these developments over the decades, but generally speaking it has involved able-bodied journalists writing <em>about</em> assistive technology, often with the perspective of disabled people relegated to a quote or two, if it was included at all. </p><p>We are fortunate now to have the chance to break that pattern, thanks to a grant from the IEEE Foundation and the Jon C. Taenzer Memorial Fund. With the grant, <em>Spectrum</em> is launching a multiyear fellowship program for disabled writers. The goal is to develop writers with disabilities as technology journalists and provide practical support for their reporting. These writers will investigate not just assistive technologies, but also look at other technologies with ambitions for mass adoption through a disability lens. Will these technologies be built with inclusion in mind, or will disabled people be a literal afterthought? Our first step will be to involve people with disabilities in the design of the program, and we hope to begin publishing articles by fellows early next year. </p><p><em>This article appears in the October 2022 print issue.</em></p>",
  "pubDate": "Sat, 01 Oct 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/bionic-hand-editorial",
  "category": [
    "Prosthetics",
    "Bionic hand",
    "Prosthetic hand",
    "Product design",
    "User-centered design"
  ],
  "dc:creator": "Harry Goldstein",
  "media:content": ""
}