{
  "title": "Are Mentors Modeling Toxic ‘Ideal Worker’ Norms?",
  "link": "https://sloanreview.mit.edu/article/are-mentors-modeling-toxic-ideal-worker-norms/",
  "comments": "https://sloanreview.mit.edu/article/are-mentors-modeling-toxic-ideal-worker-norms/#comments",
  "pubDate": "Wed, 12 Oct 2022 11:00:25 +0000",
  "dc:creator": "Rajashi Ghosh and Sanghamitra (Sonai) Chaudhuri. <p>Rajashi Ghosh is an associate professor and department chair in the School of Education at Drexel University. Sanghamitra (Sonai) Chaudhuri is an associate professor in the College of Management at Metropolitan State University.</p>\n",
  "category": [
    "Decision-Making",
    "Diversity",
    "Human Psychology",
    "Mentoring",
    "Relationship Management",
    "Managing Your Career",
    "Skills & Learning",
    "Workplace, Teams, & Culture"
  ],
  "description": "Mentoring programs are a popular and important tool to support employees in developing skills and advancing at work. At their best, they provide a way for senior managers to nurture promising employees, sometimes by advocating for them at key moments, and other times by helping them navigate the challenges of their roles. But mentoring can [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1012_Ghosh-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>Mentoring programs are a popular and important tool to support employees in developing skills and advancing at work. At their best, they provide a way for senior managers to nurture promising employees, sometimes by advocating for them at key moments, and other times by helping them navigate the challenges of their roles.</p>\n<p>But mentoring can also miss the mark. Senior managers can end up perpetuating noninclusive and harmful norms of an “ideal worker” instead of empowering their mentees to challenge the status quo.</p>\n<p>In our research about mentoring relationships, we seldom see mentors use their roles to engage in identity work that celebrates the unique characteristics of their mentees. Instead, mentors often advise mentees on how to “fit in” and assimilate to toxic behaviors and gendered cultures at organizations. Mentoring becomes another tool of oppression rather than one of enlightenment and inclusion.</p>\n<p></p>\n<p>Here’s an example: Latika was a mentee paired with Agnes in the formal mentoring program of their financial services organization. Agnes had risen up the ranks through hard work and had a reputation as a tough but fair leader. In their first meetings, Agnes emphasized the sacrifices she had made. “You cannot be halfway in,” she said. “If they want you to close business deals over late-night meetings, you do that. If getting things done means skipping lunch, you do that. You have to show that your work is the most important thing in your life.” Agnes told Latika that as a woman, she would have to do even more than a man to prove herself.</p>\n<p>While Latika appreciated Agnes’s directness, she was disappointed. She wondered whether it is truly impossible for someone as accomplished as Agnes to challenge the culture of overwork and discrimination. She wondered what following in Agnes’s footsteps would mean for her health, well-being, and work-life balance. She wondered whether that is all that mentors do — help people like her adjust to making trade-offs.</p>\n<p>That disappointment is not unjustified. Ambitious young people, especially women and people of color, are looking for role models who are pioneers not just in achieving personal success but in changing unhealthy and inequitable cultures for the better. They’re looking for ways to succeed without molding themselves to fit the definition of so-called ideal workers and without the requirement to limit their identity expression. In the case of Latika, she wondered why Agnes wasn’t questioning the unreasonable expectations of the organization instead of following them to prove her worth. Maybe she needed to do that when she was at a junior level in her career, but she had become a reputed leader. Why was she still playing by their rules?</p>\n<p>Our research suggests that mentoring can be a missed opportunity if mentors like Agnes view these relationships merely as ways to socialize mentees into inequitable structures and cultures. If Agnes is not reflective of her opportunity to call into question some of the poisonous expectations of her organization, she becomes complicit in perpetuating practices that reinforce power inequities between women — especially women of color — and their White, male counterparts. Instead, if mentors like Agnes could partner with mentees like Latika to collectively reflect on how following expectations blindly might yield short-term gains in terms of a promotion but hamper long-term outcomes such as well-being and equity, then mentoring relationships could become vehicles of change.</p>\n<p></p>\n<h3>Tips for Mentors to Challenge the ‘Ideal Worker’ Status Quo</h3>\n<p>Creating a mutually trusting partnership — one of respect and of valuing both vulnerability and strengths — depends on the extent to which mentors are willing to see the mentoring relationship as a space for identity work and not just skill development.</p>\n<p>We recently published a study that describes how the two of us, as immigrant academic mothers, experienced <a href=\"https://journals.sagepub.com/doi/10.1177/13505076211062900\">our co-mentoring relationship</a> as a healing space during the pandemic. Drawing insights from that work and our <a href=\"https://onlinelibrary.wiley.com/doi/10.1002/hrdq.21386\">research on mutual mentoring partnerships</a>, we offer some concrete tips on how mentors (formal and informal) can help mentees thrive. This sometimes means helping mentees avoid the scrutiny that minorities and women experience in their day-to-day work lives based on stereotypes, negative attributions, and perceived lack of competence — scrutiny that shapes their image as those who are less-than-ideal workers.</p>\n<p><strong>Redefine the yardstick of success.</strong> Mentors need to consider the ideal worker image their organization promotes implicitly and explicitly. Is it healthy, or is it detrimental to their mentees’ well-being? Mentors have a critical opportunity to redefine the often-gendered rhetoric of success that rewards ideal working at the cost of well-being. They can broaden the definition of success to include notions of compassion, vulnerability, and care. Our recent studies confirm earlier work that shows that such care and trust are invaluable for fostering a high-quality mentoring relationship that can challenge the status quo in organizations.</p>\n<p></p>\n<p><strong>Practice mutuality.</strong> Leaders need to recognize that mentoring relationships, especially ones in which their mentee does not share similar personal, social, or organizational identities, are inherently hierarchical. These relational dynamics can inhibit mentees from bringing their authentic selves to the relationship. “Practicing mutuality” can mean having mentors challenge themselves to learn from their mentees, or it can mean discussing how the power imbalance in the relationship might be affecting the mentoring. Mentoring offers mentors a rare opportunity to learn different perspectives. Opting to be mentored by a more junior-level employee in a <a href=\"https://www.researchgate.net/publication/352058876_Engagement_inclusion_knowledge_sharing_and_talent_development_is_reverse_mentoring_a_panacea_to_all_Findings_from_literature_review\">reverse-mentoring relationship</a> can prepare them for mutuality in mentoring as well.</p>\n<p><strong>Engage in identity work.</strong> We recommend that mentors reflect critically on how their multiple identities position them to interact with mentees. “Identity work” means understanding that your experiences are a function of how your identities interact with systems and that your experiences may not match the lived reality of your mentees, especially if they have marginalized identities. For instance, research indicates that mentoring can offer a relational space for the identity work needed for <a href=\"https://journals.sagepub.com/doi/10.1177/15344843211040732?icid=int.sj-full-text.citing-articles.112\">developing diverse leaders</a> and thus <a href=\"https://researchportal.northumbria.ac.uk/en/publications/meaning-in-mentoring-more-than-meets-the-eyei\">goes beyond mere skill development</a> to enabling growth in both the mentor’s and mentee’s identities.</p>\n<p><strong>Offer allyship.</strong> While giving tips on how to develop certain skills and attitudes is important, it may not be sufficient for having an impact on a mentee’s career. If an organization’s systems and practices are biased against those from marginalized backgrounds, asking mentees to develop certain skills or mold themselves to fit the organization’s way of doing things is harmful. Instead, <a href=\"https://journals.sagepub.com/doi/abs/10.1177/1052562917710687?journalCode=jmed\">mentors have a powerful opportunity</a> to challenge themselves to leverage their positions of power and privilege to advocate for mentees with marginalized identities.</p>\n<p><strong>Encourage mentees to be self-authoring.</strong> Mentors should want mentees to <a href=\"https://journals.sagepub.com/doi/abs/10.1177/1059601119838689\">respect them, not mimic them</a>. Mentors should make clear at the onset of the relationship that they want their mentees to grow in ways that <em>go beyond</em> what the mentor has been able to effect or achieve. Mentees need to be encouraged to nurture the capacity to generate their own standards and values (that is, self-author their lives and careers) without pressure to conform to any ideal worker prototype. While mentors should share their experiences and the steps they took in different situations, they also should encourage mentees to bring their own uniqueness and problem-solving to the table.</p>\n<h3>Tips for Mentees to Resist Mentors’ Modeling of ‘Ideal Worker’ Norms</h3>\n<p>We also have developed tips on how mentees can prioritize their health and well-being over untenable expectations potentially modeled by their mentors — without derailing their career trajectories.</p>\n<p><strong>Practice critical reflection.</strong> Mentees often worship their mentors’ experience and expertise, but mentors are human and can be questioned. High-quality relationships need a strong foundation of trust, but that can’t be built if a mentee doesn’t feel free to question their mentor’s advice and engage in a conversation about why that advice may not apply to their lived reality. Mentees should not be afraid to speak up. And critical reflection is a learning opportunity for both mentees and mentors: In our recent article about co-mentoring each other during the pandemic, we note the importance of having each other to challenge our assumptions about working and mothering.</p>\n<p><strong>Reflect on the mentoring schema.</strong> Everyone has a mental script on what mentoring is and what each role involves. But that script might need to be broadened if each side is to better the other. For example, if the mentee’s schema primarily guides them to defer to the mentor without questioning their advice, there’s a missed opening to cocreate knowledge. Having an awareness of mentoring schema can enable mentees to expand their ideas of the responsibilities of mentor/mentee roles to <a href=\"https://www.semanticscholar.org/paper/Exploring-the-lived-experiences-of-mutuality-in-the-Ghosh-Hutchins/2ca2ab195c2ed799694a6d7a148e9a797f875855\">accommodate mutual learning</a>.</p>\n<p><strong>Bring your whole self to the mentoring relationship.</strong> Mentees should feel free to acknowledge without inhibition who they are at the intersections of their different identities. The editing of identities can be especially harmful to <a href=\"https://journals.sagepub.com/doi/abs/10.1177/15344843211040732\">mentees from marginalized backgrounds</a>. Mentees who find themselves limiting their self-expression and truncating their identities to fit someone else’s expectations should seek mentoring elsewhere.</p>\n<p><strong>Discuss the costs and benefits of challenging the status quo.</strong> While we have mentioned the importance of challenging the status quo several times, it is, of course, wise to be careful about the implications of such challenges. This is an especially good topic to explore with a mentor. A mentor might be able to help figure out low-risk situations where the mentee can begin to let go of the organization’s mantle of ideal working. Small experiments can limit the risks of such actions. In our recent co-mentoring study, we discussed the ways in which challenging the status quo of ideal working might be risky for us as women leaders of color in academia and identified situations where we could take such risks.</p>\n<p></p>\n<p><strong>Compare and contrast the advice of multiple mentors.</strong> Mentees can certainly be proactive in designing a network of mentors instead of restricting themselves to one. With multiple mentors, ambitious workers are able to compare and mix advice to find a best path forward. Recent research has underscored the <a href=\"https://sloanreview.mit.edu/article/making-the-most-of-conflicting-advice-from-mentors/\">value of divergent advice</a> from multiple mentors as a catalyst for growth. If one mentor gives advice that is not aligned with a mentee’s values and interests, that mentee has other advisers to turn to.</p>\n<p>It is time to look beyond the traditional benefits that mentoring can offer in regard to skill and attitude development. Mentoring has the potential to be a tool for change where both mentors and mentees can practice critical reflection — together — to promote equity and well-being. Being mindful of the tips we’ve offered can help mentors and mentees to take significant steps toward carefully challenging the status quo of ideal working without jeopardizing their careers.</p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/are-mentors-modeling-toxic-ideal-worker-norms/feed/",
  "slash:comments": 1
}