{
  "id": "yt:video:q5yjq_z7ags",
  "yt:videoId": "q5yjq_z7ags",
  "yt:channelId": "UCXDc-ckqru8BgppXbCt0APw",
  "title": "Luke Barrington‎ - Simulation City: Transforming Real-World Data Into A 3D Digital Twin Of The Earth",
  "link": "",
  "author": {
    "name": "Google Developer Groups",
    "uri": "https://www.youtube.com/channel/UCXDc-ckqru8BgppXbCt0APw"
  },
  "published": "2021-12-09T18:02:16+00:00",
  "updated": "2022-07-23T06:10:13+00:00",
  "media:group": {
    "media:title": "Luke Barrington‎ - Simulation City: Transforming Real-World Data Into A 3D Digital Twin Of The Earth",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "For simulation to be valuable as a learning tool, it has to closely match our target domain – performing rider-only trips for Waymo One and goods delivery trips for Waymo Via in the real world– in which case, there is only one question that matters. Did the Waymo Driver safely and efficiently complete the trip? \n\nTo answer this question, Waymo created a software solution internally dubbed SimulationCity to add to our industry-leading evaluation tools. SimulationCity automatically synthesizes entire journeys to assess the Waymo Driver's performance – whether it's safely completing a 20-minute Waymo One rider-only trip across San Francisco or efficiently running an 11-hour goods-only Waymo Via trip from Phoenix to Dallas. Come to this talk to learn more!\n\n\nBio\nLuke Barrington‎ is a startup founder, A.I. PhD and, these days, a senior Product Manager in Google AI. He's spent his career inventing and building products to help understand our ever-changing planet. He will present his current mission to transform billions of real-world images into a \"digital twin\"; a realistic, editable 3D model of the earth.\n\nhttps://twitter.com/lukeinusa\n\nThis talk is part of our DevFest Inspire event! #DevFestInspire\n\nDevFest Inspire is a virtual event celebrating the end of the DevFest 2021 season where we’ll recognize content created by the community, as well as Googlers from Europe and Africa. \n\nYou can also network and connect with other developers during the event! \n→ Learn more and sign up at https://goo.gle/devfest-inspire !\n→ Check more events and content:  https://gdg.community.dev/events/#/list",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}