{
  "title": "Week note",
  "link": "https://ianozsvald.com/2020/05/06/week-note/",
  "dc:creator": "Ian",
  "pubDate": "Wed, 06 May 2020 12:41:51 +0000",
  "category": "Python",
  "guid": "https://ianozsvald.com/?p=3840",
  "description": "Well, mid-next-week note I guess. I gave another variant of my higher performance Python talk last night for PyDataUK to 250 live streamers, we had some good questions, cheers all. On Friday Micha & I heard that the 2nd edition of our Higher Performance Python book has gone to the printers &#8211; we&#8217;d said we&#8217;d [&#8230;]",
  "content:encoded": "<p>Well, mid-next-week note I guess. I gave another variant of my higher performance Python talk last night for PyDataUK to 250 live streamers, we had some good questions, cheers all.</p>\n<p>On Friday Micha & I heard that the 2nd edition of our Higher Performance Python book has <em>gone to the printers</em> &#8211; we&#8217;d said we&#8217;d do 1 person-month each on it last summer and 9 months later (with many-person-months invested each) we&#8217;re finally there. Phew.</p>\n<p>I now have an <a href=\"https://github.com/dabl/dabl/pull/231\">open PR</a> on the dabl project to add ordinal-sorted y-axis box plot items in place of the default always-sort-by-median, which I think makes some of the exploratory process more intuitive. This also involved figuring out a new weird matplotlib rendering behaviour and writing my first unit test where I make up a dummy matplotlib figure in a test which is rendered but never displayed. There&#8217;s always a million new things to learn, right?</p>\n<p>I&#8217;ve also been digging into Companies House data to look at how the <a href=\"https://twitter.com/ianozsvald/status/1257280918944993280\">economy</a> is <a href=\"https://twitter.com/ianozsvald/status/1253236523568332805\">responding</a> to the pandemic and this lets me play with some higher performance Pandas operations (for my talks) and to dig into pivot_table, pivot, groupby and crosstab along with stack & unstack in Pandas. I&#8217;ve always been confused about how many options I have available here, I&#8217;m less confused now, but I still don&#8217;t understand some of the performance differences I see for otherwise-equivalent operations. I also discovered the Pandas <a href=\"https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.xs.html\">xs</a> operation (take a cross-section of a dataframe) whilst reading a wikipedia page on crosstabs. Learning. Always learning.</p>\n<p>My <a href=\"https://twitter.com/ianozsvald/status/1258013685907435520\">kneaded sourdough</a> is improving, I&#8217;m up to 1kg now. I think I&#8217;m done with no-knead for a bit, that was fun but the really-wet dough is hard to handle. Radishes are great, pretty big now, but annoyingly the snails have found my lettuce.</p>\n<hr>\nIan is a Chief Interim Data Scientist via his <a href=http://morconsulting.com>Mor Consulting</a>. Sign-up for <a href=http://eepurl.com/Z44HT>Data Science tutorials in London</a> and to hear about his <a href=https://ianozsvald.com/data-science-jobs/>data science thoughts and jobs</a>. He lives in London, is walked by his high energy Springer Spaniel and is a consumer of fine coffees."
}