{
  "title": "Nonparty Subpoenas: The Latest Lawfare Threat to the First Amendment",
  "link": "https://www.heritage.org/the-constitution/report/nonparty-subpoenas-the-latest-lawfare-threat-the-first-amendment",
  "description": "<p>Liberal advocacy groups and the U.S. Department of Justice have recently served broad-ranging, nonparty subpoenas on conservative organizations, seeking their internal and external communications with other groups and elected representatives dating back many years. It seems clear that these subpoenas are intended to harass those who are on the conservative side of policy debates in order to chill their speech, to deter their active participation in the democratic legislative process, and to discourage individuals and potential partners from contributing to or otherwise affiliating with them.</p>\n\n<p>These abusive discovery requests threaten the First Amendment rights of those organizations and their members to engage in free speech, associate with others who share their beliefs, and speak to their elected representatives and other government officials about public policy issues that concern them. Membership organizations need to fight this discovery lawfare vigorously, and courts must protect the basic First Amendment rights of citizens—rights that are vital to a functioning republic—by quashing such discovery requests and sanctioning the lawyers and parties who engage in such abusive behavior.</p>\n\n<h3>Applicable Civil Procedure Rule</h3>\n\n<p>Subpoenas in civil lawsuits are authorized under Federal Rule of Civil Procedure (FRCP) 45 and allow parties to the suit to require testimony and the production of documents, electronically stored information, and other “tangible things,” including from nonparties. The extent to which parties can engage in such discovery is outlined by FRCP 26(b)(1), which states that:</p>\n\n<blockquote>Parties may obtain discovery regarding any nonprivileged matter that is relevant to any party’s claim or defense and proportional to the needs of the case, considering the importance of the issues at stake in the action, the amount in controversy, the parties’ relative access to relevant information, the parties’ resources, the importance of the discovery in resolving the issues, and whether the burden or expense of the proposed discovery outweighs its likely benefits.<span class=\"annotation__highlight\" data-annotation=\"<p>FRCP 26(b)(1), https://www.law.cornell.edu/rules/frcp/rule_26.﻿</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>FRCP 45(d)(1) also provides that subpoenas should not impose an “undue burden or expense on a person subject to the subpoena.”<span class=\"annotation__highlight\" data-annotation=\"<p>FRCP 45(d)(1), https://www.law.cornell.edu/rules/frcp/rule_45.﻿</p>\"><span class=\"annotation-link\">REF</span></span> Courts are directed to “protect a person who is neither a party nor a party’s officer from significant expense resulting from compliance.”<span class=\"annotation__highlight\" data-annotation=\"<p>FRCP 45(d)(2)(B)(ii).﻿</p>\"><span class=\"annotation-link\">REF</span></span> The factors outlined in FRCP 26 guide the analysis of what constitutes an undue burden,<span class=\"annotation__highlight\" data-annotation=\"<p>Watts v. SEC, 482 F.3d 501, 509 (D.C. Cir. 2007).﻿</p>\"><span class=\"annotation-link\">REF</span></span> and courts are directed to quash or modify any subpoena that “(iii) requires disclosure of privileged or other protected matter, if no exception or waiver applies; or (iv) subjects a person to undue burden.”<span class=\"annotation__highlight\" data-annotation=\"<p>FRCP 45(d)(3)(A)(iii) and (iv).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>Example of an Abusive Subpoena</h3>\n\n<p>An example of this type of lawfare is the broad, voluminous subpoena that was served on the Eagle Forum of Alabama on August 10, 2022, by the U.S. Justice Department.<span class=\"annotation__highlight\" data-annotation=\"<p>Eknes-Tucker v. Marshall, Case No. 22-184 (M.D. Alabama August 9, 2022), Subpoena to Produce Documents. A similar subpoena was served on the Southeast Law Institute.﻿</p>\"><span class=\"annotation-link\">REF</span></span> The Eagle Forum of Alabama is a small, 501(c)(3) nonprofit organization. It has one full-time employee and one part-time employee. Virtually all of its work on issues of interest to its members is done by volunteers. It is the quintessential, uniquely American grassroots membership organization that French historian Alexis de Tocqueville lauded in <i>Democracy in America</i>.<span class=\"annotation__highlight\" data-annotation=\"<p>Alexis de Tocqueville, Democracy in America, University of Chicago Press (2000), https://press.uchicago.edu/Misc/Chicago/805328.html.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>As the Motion to Quash the government subpoena filed by the Eagle Forum on September 7 says, one issue of concern to its members is “gender-altering medical treatment to minors” and the “permanent and adverse effects of such medical procedures on those minors.”<span class=\"annotation__highlight\" data-annotation=\"<p>Eknes-Tucker v. Marshall, Case No. 22-184 (M.D. Alabama Sept 7, 2022), Nonparty Eagle Forum of Alabama’s Objection to and Motion to Quash Document Subpoena, or in the Alternative Motion to Modify Subpoena, p. 2, https://secureservercdn.net/166.62.112.107/v3x.f9c.myftpupload.com/wp​-content/uploads/2022/09/Motion-to-Quash-DE-151-Sept-7.2022.pdf.﻿</p>\"><span class=\"annotation-link\">REF</span></span> Those serious, lifelong effects deeply concern many physicians and parents.</p>\n\n<p>Members of the Eagle Forum made their concerns known by taking actions that every American has an absolute right to take: They spoke out, made speeches, organized meetings, talked to other residents and organizations in Alabama, and contacted their elected state representatives.<span class=\"annotation__highlight\" data-annotation=\"<p>Id., Declarations of Becky Gerritson and Margaret S. Clarke.﻿</p>\"><span class=\"annotation-link\">REF</span></span> More specifically, they exercised their constitutional rights to engage in “freedom of speech,” “peaceably to assemble,” and “to petition the Government for a redress of grievances.”<span class=\"annotation__highlight\" data-annotation=\"<p>U.S. Const. amend. I.﻿</p>\"><span class=\"annotation-link\">REF</span></span> They also exercised their right to associate in concerted action with other citizens who are similarly concerned about this important public policy issue.</p>\n\n<p>As a result, perhaps, of the concerns expressed by these groups and other constituents, the Alabama Legislature passed the Alabama Vulnerable Child Compassion and Protection Act (the Act), which became effective on May 8, 2022. The Act bans puberty blockers, hormone therapy, and surgery to alter the biological sex of a minor.<span class=\"annotation__highlight\" data-annotation=\"<p>Act No. 2022-289, Senate Bill 184 (2022), https://legiscan.com/AL/text/SB184/2022.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The state was immediately sued over the new law by plaintiffs represented by lawyers from a variety of left-wing organizations, including the Southern Poverty Law Center, the National Center for Lesbian Rights, GLBTQ Legal Advocates & Defenders, and the Human Rights Campaign Foundation.<span class=\"annotation__highlight\" data-annotation=\"<p>Eknes-Tucker v. Marshall, First Amended Complaint for Declaratory and Injunctive Relief (August 9, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> The Justice Department intervened in the lawsuit, echoing their claims that the new Alabama law violates the Equal Protection Clause of the Fourteenth Amendment.<span class=\"annotation__highlight\" data-annotation=\"<p>Eknes-Tucker v. Marshall, United States Motion to Intervene (April 29, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Eagle Forum is not a party to the lawsuit. Yet the Justice Department subpoena demanded that the Eagle Forum (and its members) turn over all:</p>\n\n<ul><li>Materials that the Eagle Forum considered connected to the legislation or any draft, proposed, or model bills, including medical studies, opinions, or evidence.</li>\n\t<li>Documents concerning the Eagle Forum’s “legislative or policy goals, initiatives, and/or strategies relating to medical care or treatment of transgender minors, or minors with gender dysphoria.”</li>\n\t<li>Communications with—and testimony, letters, reports, etc., sent to—state legislators or their staff and any other government agencies and officials in Alabama over the legislation or medical care “related to gender identity, transgender minors or youth, ‘transidentifying’<span class=\"annotation__highlight\" data-annotation=\"<p>The Merriam-Webster dictionary does not list “transidentifying” as a recognizable word. See https://www.merriam-webster.com/dictionary​/transidentifying.﻿</p>\"><span class=\"annotation-link\">REF</span></span> minors or youth, or youth with gender dysphoria.”</li>\n\t<li>Communications with all other nongovernmental organizations, consultants, or lobbyists related to the gender issue.</li>\n\t<li>Internal minutes and records of meetings, polling and public opinion data, video presentations and speeches, newsletters and emails, and social media postings related to the legislation and the gender issue.</li>\n</ul><p>In other words, the Justice Department wanted to turn the Eagle Forum of Alabama inside out, forcing it to disclose all of the records of its activities—and of its volunteer members—related to this public policy dispute. This would let government lawyers and lawyers representing the other organizations in this lawsuit that are ideologically on the opposing side of this highly contentious issue paw through and scrutinize everything the Eagle Forum does, including personal discussions and communications with other private citizens and nonprofit organizations.</p>\n\n<p>It is difficult to imagine what possible relevance any of the documents sought by the Justice Department has to the pending lawsuits. Whether it is the “social media postings” of members of the Eagle Forum or the organization’s “polling and public opinion data” or its internal “policy goals” or “strategies,” all of this information is completely immaterial to the question of whether the Alabama Act violates the U.S. Constitution.</p>\n\n<p>Fifty-three nonprofit organizations and membership associations, federal and state legislators, and individual citizens<span class=\"annotation__highlight\" data-annotation=\"<p>The author is one of the amicus parties in his former capacity as a member of the Federal Election Commission and Counsel to the Assistant Attorney General for Civil Rights at the U.S. Department of Justice.﻿</p>\"><span class=\"annotation-link\">REF</span></span> filed an amicus curiae (friend of the court) brief supporting the Eagle Forum’s Motion to Quash and objecting to the Justice Department subpoena, outlining the significant threat that it poses to fundamental First Amendment activity.<span class=\"annotation__highlight\" data-annotation=\"<p>Boe v. Marshall, Case No. 22-184 (M.D. Alabama Sept. 20, 2022), Brief of 53 Organizations, Federal and State Legislators and Individual Citizens as Amici Curiae in Support of Nonparty Eagle Forum of Alabama’s Objection to and Motion to Quash Document Subpoena.﻿</p>\"><span class=\"annotation-link\">REF</span></span> The amicus brief starkly outlines the conflict between such intrusive discovery of nonparties and the First Amendment rights of membership organizations and individual citizens to engage freely in protected political, petitioning, and associational speech and activity.</p>\n\n<p>As the amicus brief states, this subpoena is a “transparent use of the civil litigation process to chill the speech and political organizing of those who hold views contrary to those” of the Department of Justice and the other parties in the lawsuits.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 2.﻿</p>\"><span class=\"annotation-link\">REF</span></span> It is threatening enough when private parties demand such discovery. It becomes even more dangerous and intimidating when the law enforcement arm of the federal government engages in such egregious and outrageous demands.</p>\n\n<p>Such harassing discovery “harms not just members of the public across all ideological and political spectra, who will be inhibited from open discourse and petitioning, but also legislators themselves, who benefit from hearing from their constituents without those citizens fearing subsequent federal investigations seeking reams of protected materials.” There is little doubt that such subpoenas will, and were intended to, inhibit citizens and their member issue organizations from speaking to and petitioning their representatives, which is fundamental to the democratic process.<span class=\"annotation__highlight\" data-annotation=\"<p>Id.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>Legal Precedent on the Dangers of Abusive Discovery</h3>\n\n<p>The pivotal legal precedent on the dangers of such abusive discovery and the constitutional threat that it poses is the 1958 case of <i>NAACP v. Alabama ex rel. Patterson</i>, in which the Supreme Court of the United States in a unanimous decision stopped Alabama from demanding that the NAACP turn over its membership rolls as a condition of being qualified to do business in the state. Alabama was attempting to deter the activities of the NAACP by violating the free speech and associational rights of the organization and its members under the First Amendment. The Court held—and correctly so—that the privacy rights of such organizations and their members are “indispensable to preservation of freedom of association, particularly where a group espouses dissident beliefs.”<span class=\"annotation__highlight\" data-annotation=\"<p>NAACP v. Alabama ex rel. Patterson, 357 U.S. 449, 462 (1958). The Supreme Court held in 1925 that the First Amendment is applicable to the states through the Fourteenth Amendment. Gitlow v. New York, 268 U.S. 652 (1925).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Furthermore, the Court added, “it is immaterial whether the beliefs sought to be advanced by association pertain to political, economic, religious or cultural matters, and state action which may have the effect of curtailing the freedom to associate is <i>subject to the closest scrutiny</i>.”<span class=\"annotation__highlight\" data-annotation=\"<p>NAACP, 357 U.S. at 461 (emphasis added).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>In 2021, in <i>Americans for Prosperity v. Bonta,</i> the Supreme Court weighed in on California’s demand that all charitable organizations soliciting funds in the state file copies of their IRS Form B, which lists their major donors, with the state’s attorney general.<span class=\"annotation__highlight\" data-annotation=\"<p>Americans for Prosperity v. Bonta, 141 S.Ct. 2373 (2021).﻿</p>\"><span class=\"annotation-link\">REF</span></span> In reversing the Ninth Circuit’s holding that nonprofits (such as the Eagle Forum, The Heritage Foundation, and a variety of other groups across the political spectrum) have to turn over such information, the Supreme Court said California’s requirement was facially unconstitutional and did not survive exacting scrutiny, which requires that a government-mandated disclosure regime be narrowly tailored in that there must be “a substantial relation between the disclosure requirement and a sufficiently important governmental interest.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 2383.﻿</p>\"><span class=\"annotation-link\">REF</span></span> The Court added that “[e]very demand that might chill association” is constitutionally suspect.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 2387.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>It seems obvious that if the Supreme Court views the forced public disclosure of donors to disfavored or “dissident” organizations as constitutionally suspect because it can subject them to harassment and intimidation, deterring their participation, so does forced disclosure of the identity and internal and external communications of the volunteer members of such issue organizations.</p>\n\n<p>In contrast to its now-overturned holding in <i>Americans for Prosperity</i>, when nonparty subpoenas were served by gay rights advocacy groups on supporters of California’s Proposition 8, which defined marriage as between a man and a woman, seeking all “internal campaign communications relating to campaign strategy and advertising,” the Ninth Circuit quashed the subpoenas, overruling the district court. It held that such “discovery would have the practical effect of discouraging the exercise of First Amendment associational rights.”<span class=\"annotation__highlight\" data-annotation=\"<p>Perry v. Schwarzenegger, 591 F.3d 1126, 1131–32 (9th Cir. 2009).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The Ninth Circuit applied a burden-shifting analysis over the assertion of First Amendment privilege. The target of the subpoena had to show that the discovery demand would “result in (1) harassment, membership withdrawal, or discouragement of new members, or (2) other consequences which objectively suggest an impact on, or ‘chilling’ of, the members’ associational rights.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 1140 (citations omitted).﻿</p>\"><span class=\"annotation-link\">REF</span></span> Once this prima facie showing has been made, the burden shifts to the government to “demonstrate that the information sought through the [discovery] is rationally related to a compelling governmental interest [and] the ‘least restrictive means’ of obtaining the desired information.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. (citation omitted).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The Fourth Circuit has held that when a subpoena is directed to a nonparty, discovery “must be limited even more” because:</p>\n\n<blockquote>[B]ystanders should not be drawn into the parties’ dispute without some good reason, even if they have information that falls within the scope of party discovery…. [C]ourts must give the recipient’s nonparty status “special weight,” leading to an even more “demanding and sensitive inquiry” than the one governing discovery generally.<span class=\"annotation__highlight\" data-annotation=\"<p>Virginia Dept. of Corrections v. Jordan, 921 F.3d 180, 189 (4th Cir. 2019), citing In re Pub. Offering PLE Antitrust Litig., 427 F.3d 49, 53 (1st Cir. 2005).﻿</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>To the extent that the party issuing the subpoena, such as the Justice Department, tries to argue that the activities of a private organization like the Eagle Forum (or The Heritage Foundation) and its communications with legislators is relevant to the intent of legislators in passing particular legislation that is being challenged, that argument is contrary to the holding in the recent <i>Dobbs </i>decision. In that case, citing the 1968 decision in <i>U.S. v. O’Brien</i>, the Supreme Court emphasized once again that:</p>\n\n<blockquote>Inquiries into legislative motive “are a hazardous matter.” Even when an argument about legislative motive is backed by statements made by legislators who voted for a law, we have been reluctant to attribute those motives to the legislative body as a whole. “What motivates one legislator to make a speech about a statute is not necessarily what motivates scores of others to enact it.”<span class=\"annotation__highlight\" data-annotation=\"<p>Dobbs v. Jackson Women’s Health Org., 142 S.Ct. 2228, 2256 (2022) (quoting U.S. v. O’Brien, 391 U.S. 367, 384 (1968)). See also Tenney v. Brandhove, 341 U.S. 367 (1951) (The Court’s many previous holdings that “it was not consonant with our scheme of government for a court to inquire into the motives of legislators, has remained unquestioned.” Id. at 377).﻿</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>The 11th Circuit has similarly said that when “the import of words Congress has used is clear…we need not resort to legislative history, and we certainly should not do so to undermine the plain meaning of the statutory language.”<span class=\"annotation__highlight\" data-annotation=\"<p>CBS Inc. v. PrimeTime 24 Joint Venture, 245 F.3d 1217, 1222 (11th Cir. 2001).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>State courts have followed the same rule. In Alabama, for example, the state supreme court has said that the “intention of the Legislature, to which effect must be given, is that expressed in the statute, and <i>the courts will not inquire into the motives which influenced the Legislature or individual members in voting for its passage</i>.”<span class=\"annotation__highlight\" data-annotation=\"<p>State v. 223,405.86, 203 So. 3d 816, 831 (Ala. 2016) (citations omitted) (emphasis added).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>If statements by individual legislators are not relevant to determining intent, then the statements, communications, and speeches of private organizations and individuals that have no authority or power to pass legislation are even further removed from having any relevance in determining the intent of a legislative body in passing specific legislation. It also seems clear that the chilling effect on the political speech and interactions of citizens with their legislators far outweighs any possible relevance their actions could possibly have to determining the constitutionality of a statute or the actions of a legislative body.</p>\n\n<p>As summarized by The Heritage Foundation in its objection to a similarly egregious Rule 45 document demand in a Texas case in which it was also not a party:</p>\n\n<blockquote>If the Supreme Court has made clear that inquiry into the motives of <i>legislators—</i>who choose a life of public scrutiny—is legally out of bounds, then it simply goes without saying that, <i>a fortiori</i>, it is unduly burdensome to force private citizens and their association to produce for inspection their protected communications with the very state officials whose motivations are irrelevant. Accordingly, Plaintiffs cannot express a legitimate basis for the requested documents, let alone a compelling need sufficient to justify infringing Heritage’s First Amendment rights.<span class=\"annotation__highlight\" data-annotation=\"<p>La Union Del Pueblo Entero v. Abbot, Case. No. 21-844 (W.D. TX), Nonparty The Heritage Foundation’s Objections to Plaintiffs’ Rule 45 Request for Production of Documents (March 25, 2022), p. 5.﻿</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>In the words of the amicus brief supporting the Eagle Forum, the Justice Department is trying “to use its party status to issue subpoenas to acquire sensitive information it could never otherwise obtain in compliance with the First Amendment.” In fact:</p>\n\n<blockquote>The mere issuance of this subpoena—even if it is ultimately quashed—severely chills First Amendment rights because individuals will now fear that their communications on any controversial issue—either now or in the future—will be subjected to a subpoena issued by an Assistant United States Attorney on behalf of the federal government.</blockquote>\n\n<p>There seems little doubt that such individuals will “curtail their political activities as a result.”<span class=\"annotation__highlight\" data-annotation=\"<p>Amicus Brief at 9.﻿</p>\"><span class=\"annotation-link\">REF</span></span> Moreover, such discovery demands, which the Fifth Circuit in a similar case found “disturbing,” would force an issue-oriented membership organization “to turn over <i>to a public policy opponent</i> its internal communications, setting a precedent that may be replicated in litigation anywhere.”<span class=\"annotation__highlight\" data-annotation=\"<p>Whole Woman’s Health v. Smith, 896 F.3d 362, 373 (5th Cir. 2018), as revised (July 17, 2018) (emphasis in original) (holding that compelling an ecclesiastical association to reveal internal communications regarding its view on the treatment of fetal remains through a subpoena and subjecting the association to sanctions constituted a substantial burden).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>This type of discovery abuse also implicates the right of citizens to freely petition the government and communicate with their legislators. The Supreme Court has identified this right as one of “the most precious of the liberties safeguarded by the Bill of Rights,” a “right that is implied by ‘[t]he very idea of a government, republican in form.’”<span class=\"annotation__highlight\" data-annotation=\"<p>BE&K Const. Co. v. NLRB, 536 U.S. 516, 525–26 (2002) (quoting Mine Workers v. Illinois Bar Assn., 389 U.S. 217, 222 (1967)). See also U.S. v. Cruikshank, 92 U.S. 542 (1876).﻿</p>\"><span class=\"annotation-link\">REF</span></span> The right to petition entitles citizens to communicate freely with government officials, including legislators, to advance their ideas and advocate for particular causes.<span class=\"annotation__highlight\" data-annotation=\"<p>Borough of Duryea, Pa. v. Guarnieri, 564 U.S. 379, 388–89 (2011).﻿</p>\"><span class=\"annotation-link\">REF</span></span> That protection applies in the context of compelled discovery that would substantially burden such core First Amendment activity.<span class=\"annotation__highlight\" data-annotation=\"<p>AFL-CIO v. FEC, 333 F.3d 168, 175–76 (D.C. Cir. 2003) (citing Buckley v. Valeo, 424 U.S. 1, 64–68 (1976)).﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>It is a new tactic of the Left and the current Justice Department to use discovery lawfare to harass conservative organizations like the Eagle Forum that are not parties to a lawsuit. The intent is to create expense and hassle for the target of these subpoenas or to hope that the organization cannot afford to fight to quash or limit the scope of those subpoenas. This allows ideological opponents to obtain communications and documents that are irrelevant to the underlying lawsuit but that can be used to embarrass the analysts, staff, and volunteers of those organizations, as well as their members and coalition partners, politically; damage the organization with respect to the ongoing policy dispute that triggered the lawsuit; and deter the type of coalition building and activism that the conservative legal and advocacy world uses to convince state governments to implement beneficial legislation and government policies in many areas, including election reform.</p>\n\n<p>The Heritage Foundation, Heritage Action for America, and the Public Interest Legal Foundation, among other groups, have been hit with similar subpoenas and discovery demands in other lawsuits filed by liberal groups.<span class=\"annotation__highlight\" data-annotation=\"<p>La Union Del Pueblo Entero v. Abbott, Case No. 21-844 (W.D. Texas) (Rule 45 Request for Production of Documents to Heritage Foundation); In re Georgia Senate Bill 202, Case No. 21-55555 (N.D. Georgia) (Rule 45 Subpoena for Documents to Heritage Action). These lawsuits all involve claims that election reform legislation passed by state legislatures are somehow discriminatory under the Voting Rights Act or unconstitutional under the U.S. Constitution.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>Revised Justice Department Subpoena as Objectionable as the Original</h3>\n\n<p>On October 7, 2022, after the Motion to Quash the Justice Department’s third-party subpoena was filed by the Eagle Forum and the amicus brief supporting that motion was filed, the Justice Department suddenly filed a notice with the court that it was narrowing the scope of its subpoena and now only wants the Eagle Forum to turn over “any medical studies or literature referenced in Section 2” of the new Alabama law.<span class=\"annotation__highlight\" data-annotation=\"<p>Boe v. Marshall, Case No. 22-184 (M.D. Alabama October 7, 2022), Notice Regarding Subpoenas to Third Parties Eagle Forum of Alabama and Southeast Law Institute.﻿</p>\"><span class=\"annotation-link\">REF</span></span> Section 2 contains a series of findings by the legislature. The Justice Department is apparently referring to paragraph (14) of Section 2 in which the legislature stated that “Several studies demonstrate that hormonal and surgical interventions often do not resolve the underlying psychological issues affecting the individual.”</p>\n\n<p>This revised subpoena, albeit narrower in scope, is just as objectionable as the original. If the Justice Department wants to know what studies this legislation is referring to, it should obtain that information from the legislators who sponsored and voted for the bill, not a nonparty like the Eagle Forum or its volunteers who are not legislators and did not and do not have the power and authority to enact this—or any other—bill into law.</p>\n\n<p>In a hearing held on October 14, Judge Liles C. Burke castigated the Justice Department for its “vastly overbroad and unduly burdensome” subpoena. In fact, he asked, “how in the world could what the Department of Justice is asking for possibly be relevant to this case and its outcome,” given that the issue is “whether or not this statute is constitutional”?<span class=\"annotation__highlight\" data-annotation=\"<p>Eknes-Tucker v. Ivey, Case No. 22-184 (M.D. Alabama Oct. 14, 2022), Transcript of Hearing Before the Honorable Liles C. Burke, pp. 9 and 3.﻿</p>\"><span class=\"annotation-link\">REF</span></span> When the judge asked the Justice Department lawyer, Jason Cheek, why the department had suddenly gone from “asking for [an] ‘everything we can think of subpoena’ down to [a] ‘we just really actually only need one thing’” subpoena, the only answer the lawyer seemed to be able to give was the “amicus briefs filed by numerous organizations” and his complaint that the Eagle Forum did not first have a “conversation” with the department to negotiate a narrowing of the scope of the subpoena.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 6, 7, and 10.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>In other words, only vigorous opposition that entailed cost and legal representation to multiple organizations caused the Justice Department to withdraw its outrageous subpoena.</p>\n\n<p>The lawyer for the Eagle Forum, John Graham, pointed out that FRCP 45 “imposes no such obligation” on the target to try to negotiate a “deal” with the Justice Department. The rule requires those “serving a subpoena—the federal government in this case—to take reasonable steps to avoid imposing undue burden and expense on the recipient of the subpoena, and authorizes sanctions on a party or attorney who fails to comply,” Graham added. “Rule 45 leaves no room for a party or attorney to issue an untimely, facially overbroad and unduly burdensome subpoena and expect to work out the details later.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 34.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Here, Justice Department lawyers failed entirely to abide by their ethical and professional duty to ensure that they do not engage in abusive discovery that is burdensome and, as the judge said, “not reasonably calculated to lead to the discovery of admissible evidence” as required by FRCP 26(b)(1).<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 3.﻿</p>\"><span class=\"annotation-link\">REF</span></span> Judge Burke warned the department about the dire consequences of its misbehavior:</p>\n\n<blockquote>Administrations change every four years, or at least every eight. Is the new standard going to be that these kind of subpoenas go out in legislation to any advocacy organization, and they want emails to their members, they want social media posts, they want things that the group just considered in their advocacy? And that’s all the things you are asking for. Is that where you think the Department of Justice thinks we need to go in this country? Because I promise you this, at some point this will be aimed at the Southern Poverty Law [Center] and the ACLU, and their efforts, as well. Is this where we need to go?<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 18.﻿</p>\"><span class=\"annotation-link\">REF</span></span></blockquote>\n\n<p>On October 24, Judge Burke issued an order quashing the subpoenas served on the Eagle Forum (and the Southeast Law Institute), including the supposedly “narrowed” subpoena.<span class=\"annotation__highlight\" data-annotation=\"<p>Boe v. Marshall, Opinion and Order (Oct. 24, 2022).﻿</p>\"><span class=\"annotation-link\">REF</span></span> He held that the Justice Department is seeking “material outside the scope of discovery” that is “unlikely to reveal or lead to any information that would help resolve the fundamental issue in this case,” which is whether the Act “is constitutional under the Fourteenth Amendment.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 5.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Moreover, “the burden of the requested material” on nonprofit organizations that are “staffed almost entirely” by volunteers “greatly outweighs any slight relevance it may have.” Judge Burke also chastised the government for providing “neither evidence nor argument to refute these conclusions.” In fact, Burke said, “the Government’s eleventh-hour ‘narrowing’ of the requested material suggests that the subpoenas, as written, are overly broad and unduly burdensome given the limited resources of the nonparties.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 5–6. In a footnote, Judge Burke noted that the Justice Department’s supposedly “narrowed request” “does not fit squarely into any of the eleven categories of evidence listed” in the original subpoena. Burke stated that he took “no position on whether the Government’s narrowed request falls within the scope of discovery.” Id. at 6, note 14.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<h3>Conclusion</h3>\n\n<p>It is clear that judges reviewing challenges to nonparty subpoenas will have to review each such challenge on a case-by-case basis, as such issues tend to be fact-intensive inquiries. Judges must understand, though, that intrusive, compelled disclosure requests such as the one issued by the Justice Department to the Eagle Forum of Alabama are not only an unacceptable burden under the applicable rules of civil procedure, but also “likely to affect adversely the ability of the group and its members to pursue their collective effort to foster beliefs which they admittedly have the right to advocate.”<span class=\"annotation__highlight\" data-annotation=\"<p>NAACP, 357 U.S. at 462–63.﻿</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>Such discovery requests to nonparties violate the First Amendment rights of the targeted organizations to speak, advocate, associate, and petition the government freely. The actions of nonparties who are not legislators or government officials and who have no power or authority to pass or enforce legislation are immaterial and irrelevant when the issue is the constitutionality or legality of a particular statute. Neither the government nor private litigants have a compelling interest that justifies such discovery demands and the violation of fundamental rights.</p>\n\n<p>Nonprofit membership organizations, regardless of ideology, should vigorously contest these types of subpoenas and discovery requests by immediately filing motions to quash them. Any attempt to reach an accommodation or negotiate a compromise will only encourage the use of such tactics in future cases. A no-holds-barred, no-quarter-given attitude broadly adopted by all similarly situated organizations that presents a united front could help to short-circuit the further use and development of this type of discovery lawfare, which, as the Supreme Court warned in 1958, endangers the fundamental workings of our democracy.</p>\n\n<p>As Judge Burke concluded in the Alabama case, he hoped that we are “not going to go down this road with any organization in addition to Eagle Forum…. I understand why they are here today, and they should be here today”<span class=\"annotation__highlight\" data-annotation=\"<p>Transcript at 41.</p>\"><span class=\"annotation-link\">REF</span></span> to fight this type of abusive discovery. It is lawfare at its worst.</p>\n\n<p><i><b>Hans von Spakovsky</b> is Manager of the Election Law Reform Initiative and Senior Legal Fellow in the Edwin Meese III Center for Legal and Judicial Studies at The Heritage Foundation. </i></p>",
  "pubDate": "Tue, 01 Nov 2022 15:05:56 -0400",
  "dc:creator": "Hans von Spakovsky",
  "guid": "https://www.heritage.org/the-constitution/report/nonparty-subpoenas-the-latest-lawfare-threat-the-first-amendment"
}