{
  "title": "In Government-Regulated Healthcare, There Is No Competition Like No Competition",
  "link": "https://mises.org/node/60745",
  "description": "<p>Imagine you are a young, idealistic doctor. After some years in clinical practice at a private hospital you tire of the fact that more of your time is spent filling out forms and attending staff meeting than with your patients. You went to medical school all bright eyed with the dream of making a good living making a difference. You ran the gauntlet during your residency, sometimes working ninety-hour weeks, skipping meals and even showers so you would have more free time to study, because you believed in the end it would all be worth it.</p>\n<p>In some ways it is, there are times you love your job—but you are also disillusioned by the fact that you barely get time to really know your patients and give them the quality of care you think could really help them thrive. Speaking to some of your former classmates you notice you’re not the only one feeling the way. You meet a few other idealists at continuing medical education conferences and together, you decide you want to branch out together and create your own little hospital, employing staff that agree with your ethos and want to offer the quality of care that patients deserve. You dream that perhaps your little project with serve as a model to the world of how healthcare can be done, and people will start copying it.</p>\n<p>After taking some months off work to plan your little benevolent social enterprise, you and your cofounders discover that opening a new hospital is harder than you thought it would be. For one thing, you find out that in your state (as in most states) if you want to open a hospital you are obligated to obtain a “certificate of need” from the government to open a hospital. You have to present yourself before an official board and <em>prove</em> that your community “needs” another hospital, and that you are willing and able to fund it all by yourself.</p>\n<p>As if that wasn’t bad enough—the people on the board include senior administrators from already existing hospitals in the area, and they want the competition from you about as much as a gunshot to the head! You think to yourself: “Imagine I wanted to open up a café, but I needed permission from the local Starbucks and Tim Horton’s!”</p>\n<p>In addition to that, <em>Obamacare</em><em>,</em> passed in 2010, prevents government payments to any hospitals owned by doctors! This puts you at another unfair advantage compared to the existing commercial hospitals in your area who are taking Medicare and Medicaid patients. You are willing to persist though, because you’re an idealist, and you’re starting to think it might not be too great taking government money anyway as this often leads to overtreatment, corruption, and strings attached.</p>\n<p>You had the great idea of training your own assistant-technicians on the site to take runaway tasks off the hands of your physicians and save patients money. You soon discovered that you weren’t allowed to train anyone to do anything unless they were fully licensed and qualified to do it at college already—even if these little tasks would only really take a few weeks or months of training.</p>\n<p>So there goes your idea of avoiding excessive staff meetings and form filling. You and your specialized colleagues (who also must run the damn hospital) want to tend to severe cases that you were highly trained for. But you are forced to spend lots of time attending to patients with relatively trivial complaints, because no one else is allowed to do it. (See the chapter <em>Getting Schooled </em>for full details.)</p>\n<p>You dreamed of offering mentorship programs to college graduates, thinking employing young doctors would keep staff costs down for patients and help graduates get a good start, but because there are so few medical schools due to government restrictions on building them, you found it extremely hard to compete with more commercial hospitals when it came to recruiting new talent. And because medical education is so expensive, and all these graduates were six figures in debt, they expected to be paid handsomely from the off so they could get their finances back in the black as quickly as possible.</p>\n<p>You thought you could attract custom by charging patients and private insurance companies more fairly, but you just never counted on how much money would have to go to administrators, lawyers, actuaries, and other bureaucrats just to make sure that you were fully in compliance with all the reams and reams of government regulations your hospital had to conform to. From what you could tell, the vast majority of these did less than nothing to protect patients or improve the quality of care they received.</p>\n<p>But they did mean you had to charge their insurance companies more to cover the cost of extra cost of staff, plus you had to dictate endless numbers of letters and reports to stenographers to keep records so you couldn’t be sued for anything. On that point, you were paying out huge sums of money to insuring yourself, your practice, your hospital, and all your colleagues against malpractice suits. The cost of all that also had to be passed on to patients. All this was clearly pushing the price of provision through the roof.</p>\n<p>Sometimes patients without insurance simply did not pay, and you had to absorb the cost of uncompensated care. There was nothing the state could (or were willing) to do about it—you just had to suck it up and charge other patients more to recoup the costs.</p>\n<p>The government <em>forced </em>you to keep open arms of the hospital that were unprofitable, and you ended up having to compensate for the losses by overcharging in other areas. You ended up investing in unnecessary imaging equipment because running patients through tests always prove to be very profitable. You sometimes suspected that patients were being ran through some of these tests because your colleagues just liked your fancy new gadgets, but the insurance was happy to pay, so you never bothered to ask about it or set a policy to prevent these tests being used unnecessarily.</p>\n<p>You also found yourself forced to open a cancer care department, orthopedic surgery center, and neurosurgery center because those always made a profit, but in order to staff them you had to find specialists that didn’t fully understand the ethos of your original project, and—frankly—by this point, it was pretty hard impressing that ethos upon anyone, because your hospital was starting to look rather like all the other commercial hospital did.</p>\n<p>These are only some of the ways that the government limits competition in the medical sphere, driving the price of healthcare through the roof in the United States.</p>\n<p>They could be remedied with some embarrassingly simple policy changes:</p>\n<p>1) Abolish certificate of need restrictions on the building of private hospitals.</p>\n<p>2) Abolish restrictions on the opening of new medical schools including removing laws which limit some states to only having one.</p>\n<p>3) Allow doctors, clinics, and hospitals to train and certify their own assistants to allow lower-wage trainees to take responsibilities off the hands of highly specialized staff.</p>\n<p>4) Relax liability standards on professionals particularly when they are acting in a voluntary capacity.</p>\n<p>5) Reduce red tape so fewer resources have to be spent on administrators and bureaucrats rather than medical staff, and so that physicians need to spend less time on paperwork, electronic record keeping, and desk work.</p>\n<p>6) Tackle the five major causes of waste in American medical expenditure, as identified by former Administrator for the Centers for Medicare and Medicaid Services Dr. Donald Berwick: overtreatment, failure to coordinate care, the administrative complexity of the system, burdensome rules, and fraud.</p>\n<p>7) Tackle the problem of governments and insurance companies paying for unnecessary and wasteful tests, treatments, and procedures.</p>\n<p>8) Remove the legal requirement for hospitals to keep unprofitable departments open.</p>\n<p>Please download my e-book: <em><a href=\"HYPERLINK%20%22https:/7pharmamyths.com/%22\">7 Big Pharma Myths Debunked</a></em>.</p>\n<p> </p>\n\n",
  "author": "Antony Sammeroff",
  "enclosure": "",
  "guid": 60745,
  "pubDate": "Fri, 04 Nov 2022 06:00:00 -0500",
  "source": "Mises Wire"
}