{
  "title": "Are we in a ‘loneliness pandemic’? With Louise Hawkley, PhD",
  "itunes:title": "Are we in a ‘loneliness pandemic’? With Louise Hawkley, PhD",
  "pubDate": "Wed, 11 May 2022 10:30:00 +0000",
  "guid": "f27affde-8022-4d82-a1f7-89f68d017526",
  "link": "http://sopapa.libsyn.com/are-we-in-a-loneliness-pandemic-with-louise-hawkley-phd",
  "itunes:image": "",
  "description": "<p>Even before the COVID-19 pandemic scrambled our social connections, Americans were worried about an epidemic of loneliness. Louise Hawkley, PhD, principal research scientist at NORC at the University of Chicago, talks about the difference between being alone and being lonely, how loneliness can harm our health, whether we really are lonelier than ever these days, and how to identify and address the root causes of loneliness.<br /> <br /> Links<br /> <br /> <a href= \"https://www.norc.org/Experts/Pages/louise-hawkley.aspx\">Louise Hawkley, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a><br /> <br /> Sponsor<br /> <br /> <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "content:encoded": "<p>Even before the COVID-19 pandemic scrambled our social connections, Americans were worried about an epidemic of loneliness. Louise Hawkley, PhD, principal research scientist at NORC at the University of Chicago, talks about the difference between being alone and being lonely, how loneliness can harm our health, whether we really are lonelier than ever these days, and how to identify and address the root causes of loneliness.  Links  <a href= \"https://www.norc.org/Experts/Pages/louise-hawkley.aspx\">Louise Hawkley, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a>  Sponsor  <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "enclosure": "",
  "itunes:duration": "37:03",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Even before the COVID-19 pandemic scrambled our social connections, Americans were worried about an epidemic of loneliness. Louise Hawkley, PhD, principal research scientist at NORC at the University of Chicago, talks about the difference between...",
  "itunes:episode": 190,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}