{
  "title": "#453: 2 Fast, 2 Illustrated (OOTP 17, Educational Decree Number 24)",
  "link": "https://audioboom.com/posts/7501224",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5332,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We offer our thoughts on the recent Johnny Depp / Amber Heard case</li>\n<li>Another Illustrated Edition: <a href=\"https://minalima.com/product/harry-potter-and-the-philosophers-stone-signed-copy/\">MinaLima</a> joins the party!</li>\n<li>Muggle Mail covers Harry's battle with Dementors and his post-Hogwarts career</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix – Chapter 17: Educational Decree Number Twenty-Four</li>\n<li>7-Word Summary: Sirius is in trouble with Umbridge’s reach</li>\n<li>Harry's finally HAPPY! It lasts for two pages...</li>\n<li>We discuss the symbolism of the educational decree covering everything else on the Common Room notice board!</li>\n<li>Hogwarts is becoming a police state! Umbridge is monitoring all non-class student activity as well as the lines of communication</li>\n<li>Is it possible Umbridge was planning this decree prior to the formation of Dumbledore’s Army? Shouldn’t students be able to complain to their heads of House about this? To their parents?</li>\n<li>Hedwig, Thestrals, McGonagall and Grubbly-Plank</li>\n<li>Neville and Draco:  always be mindful of thinking before you speak</li>\n<li>Snape and Umbridge</li>\n<li>Trelawney is on probation - are we surprised? Do we feel bad for her?</li>\n<li>Sirius has some advice for Hermione, reveals Dung has been trailing Harry and shares news from Molly</li>\n<li>Hogwarts is a Security Nightmare! Is Umbridge right to be watching the Floo Network?</li>\n<li>The Umbridge Suck Count climbs to 32!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: What spell does Gryffindor use to help them practice quidditch?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n<li>MuggleCast has launched a listener survey so we can hear what you think of the show. <a href=\"https://forms.gle/EyfFrFvovQhHisiE8\">Please take a couple minutes to fill it out</a>!</li>\n<li>Bonus MuggleCast, coming later this week to Patreon: We take a look at the life of <a href=\"https://www.wizardingworld.com/writing-by-jk-rowling/dolores-umbridge\">Dolores Jane Umbridge</a>! Was she always this sadistic? What was her childhood like? Did she ever marry? Where did J.K. Rowling get the inspiration for this character?</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 11 Feb 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-11:/posts/7501224",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}