{
  "title": "Did This Person Become Possessed? | Best of Real Ghost Stories Online",
  "link": "https://audioboom.com/posts/8086847",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1927,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What was the negative wave of energy that overcame one person in the middle of their workday?<br>\nHere is a preview of the story.<br>\n“I used to work at a historical park where we dressed in historical dress, with recreations of a few of the old buildings, some antiques from the time and area. The site is about a mile long. There is a gravel road that connects the parking lot/visitor Centre to all the different buildings, info plaques, picnic area, and church with a cemetery. We would station ourselves around the site to educate and interact with visitors.<br>\n<br>\n\n</div>\n<div>In the morning we would drive the site to open all the buildings. Some mornings I would open a specific building and be hit with a negative wave of energy as I entered the building, like walking into a room where people are fighting, mad and aggressive. I would kindly greet the former lady of the house, ask her how her night was and tell her that we are going to have a wonderful day. I know it sounds strange and if anyone had witnessed it, they would have thought me crazy, but I swear it helped, the negativity dispersed, and I was able to stay in the house. Sometimes the day started out ok but the energy on the house would shift throughout the day, leaving me anxious, uncomfortable and spending as much time as I could outside on the picnic table.”<br>\n<br>\n\n</div>\n<div>To hear more real ghost stories, become a supporter of our show and get every episode, including our weekly bonus episodes at <a href=\"http://www.ghostpodcast.com\">http://www.ghostpodcast.com</a> or <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>Follow Tony:<br>\nInstagram: <a href=\"http://HTTP://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a><br>\nTikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a><br>\nFacebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Thu, 19 May 2022 20:14:14 +0000",
  "guid": "tag:audioboom.com,2022-05-19:/posts/8086847",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}