{
  "title": "530: Celebrating and Criticizing Gryffindor House",
  "link": "https://audioboom.com/posts/7941460",
  "itunes:episode": 530,
  "itunes:title": "Celebrating and Criticizing Gryffindor House",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4511,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week, the MuggleCasters tackle the fiercest Hogwarts house of them all with their main discussion centered on Gryffindor! Joining the discussion is long-time friend of the show and boyfriend of Andrew, Pat! The panel of current and former Gryffindors talk about the good and the bad traits of Gryffindor, like why being bold can be a bad thing, and how being \"daring\" can mean you like to get into trouble. The hosts also examine Gryffindor's security system, ask why it is so insecure, and how famous Gryffindors like Minerva McGonagall and Peter Pettigrew fit into their house assignments!<br>\n<br>\n\n</div>\n<ul>\n<li>On this episode we conclude our epic House-themed discussions with Gryffindor House!</li>\n<li>What do daring, nerve and chivalry have to do with the panel's own experiences as former/current Gryffindors?</li>\n<li>Is the Sorting Hat's description of Gryffindors the complete picture? Why is Pottermore's welcome letter for Gryffindors so hilariously short?</li>\n<li>We examine the good and bad of Gryffindor, including their readiness to admit fault once they've been proven wrong, their hot-headedness and ill temper, and loyalty to one another.</li>\n<li>Is everything Snape said about Gryffindors true? We examine moments between he and the Marauders.</li>\n<li>What does it mean that Gryffindor House has had two pairs of troublemakers that we know of across two generations?</li>\n<li>What happens when Gryffindors fight each other? Seamus and Harry's argument in Book Five may give us insight into the personalities of Gryffindor.</li>\n<li>The Fat Lady's password system STINKS! It's a security nightmare! </li>\n<li>Notable Gryffindors include Dumbledore, McGonagall and... Peter Pettigrew? The hosts discuss who fits in and who doesn't.</li>\n<li>Quizzitch: The Sorting Hat tells us that Hufflepuff came from Valley Broad, Slytherin from Fen, and Ravenclaw from Glen, but from where did Godric hail?</li>\n<li>This week's episode is brought to you by Quip -- get $5 off a mouthwash starter kit at <a href=\"http://www.GetQuip.com/muggle5\">GetQuip.com/muggle5</a>\n</li>\n<li>Coming up later this week on Bonus MuggleCast, <a href=\"http://www.patreon.com/mugglecast\">available on Patreon</a>, the hosts discuss HBO Max's new Harry Potter Hub, where the platform makes TV and Movie suggestions based on what Hogwarts House you're in. Do we agree with HBO Max's choices? Definitely not -- Laura is hurt by the Ravenclaw picks.</li>\n</ul>\n",
  "pubDate": "Tue, 14 Sep 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-09-13:/posts/7941460",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}