{
  "title": "US May Soon Push Ambitious Antitrust Crackdown on Big Tech in Congress",
  "link": "https://news.slashdot.org/story/22/11/05/1848205/us-may-soon-push-ambitious-antitrust-crackdown-on-big-tech-in-congress?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "America's federal government \"is planning a post-midterms push for antitrust legislation that would rein in the power of the world's largest tech companies,\" reports Bloomberg, \"a last-ditch effort to get a stalled pair of bills through Congress before a predicted Republican takeover in January.\"\n\nThe lame-duck period after Tuesday's U.S. election may be the last shot to pass the landmark legislation, the American Innovation and Choice Online Act and Open App Markets Act. The bills, which would prevent the tech companies from using their platforms to thwart competitors, would be the most significant expansion of antitrust law in over a century.... Republicans have made it clear that they won't support the bills if they retake control of either chamber of Congress. That has supporters urging the White House to mount a push in the final weeks before a new Congress is seated early next year. \n\nAdvocates have criticized the White House for failing to prioritize the legislation, which major tech companies have spent more than $100 million to defeat. Alphabet's Google, Amazon, Apple and Meta all oppose the bill. \"There is bipartisan support for antitrust bills, and no reason why Congress can't act before the end of the year,\" said White House spokesperson Emilie Simons. \"We are planning on stepping up engagement during the lame duck on the president's agenda across the board, antitrust included.\" Versions of both bills have made it through committees but await action by the full House and Senate. \n\nIf Congress doesn't act before the end of the year, it will likely be years before U.S. lawmakers pass any legislation to crack down on the power of the tech giants.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+May+Soon+Push+Ambitious+Antitrust+Crackdown+on+Big+Tech+in+Congress%3A+https%3A%2F%2Fbit.ly%2F3NF4uta\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F22%2F11%2F05%2F1848205%2Fus-may-soon-push-ambitious-antitrust-crackdown-on-big-tech-in-congress%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/22/11/05/1848205/us-may-soon-push-ambitious-antitrust-crackdown-on-big-tech-in-congress?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22337803&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "EditorDavid",
  "dc:date": "2022-11-05T19:34:00+00:00",
  "dc:subject": "usa",
  "slash:department": "too-big-to-flail",
  "slash:section": "news",
  "slash:comments": 7,
  "slash:hit_parade": "7,7,5,5,0,0,0"
}