{
  "title": "Health eCareers Announces Partnership With TopResume",
  "link": "https://www.ziffdavis.com/about/news/health-ecareers-announces-partnership-with-topresume",
  "dc:creator": "Jeremy Jones",
  "pubDate": "Wed, 28 Sep 2022 17:24:13 +0000",
  "category": [
    "Recent News",
    "Health eCareers"
  ],
  "guid": "https://www.ziffdavis.com/?p=4339",
  "description": "<p>\"We are excited to partner with TopResume to provide job seekers access to the highest-quality resume- and CV-review and writing services,\" said Health eCareers managing director Greg Chang. \"In addition to discovering the best career opportunities through Health eCareers extensive job network with the nation's top employers, healthcare professionals can now better position themselves for the best roles across the industry by tailoring their resume or CV with expertise from TopResume.\"</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.ziffdavis.com/about/news/health-ecareers-announces-partnership-with-topresume\">Health eCareers Announces Partnership With TopResume</a> appeared first on <a rel=\"nofollow\" href=\"https://www.ziffdavis.com\">Ziff Davis</a>.</p>\n",
  "content:encoded": "\n<p>&#8220;We are excited to partner with TopResume to provide job seekers access to the highest-quality resume- and CV-review and writing services,&#8221; said Health eCareers managing director Greg Chang. &#8220;In addition to discovering the best career opportunities through Health eCareers extensive job network with the nation&#8217;s top employers, healthcare professionals can now better position themselves for the best roles across the industry by tailoring their resume or CV with expertise from TopResume.&#8221;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.ziffdavis.com/about/news/health-ecareers-announces-partnership-with-topresume\">Health eCareers Announces Partnership With TopResume</a> appeared first on <a rel=\"nofollow\" href=\"https://www.ziffdavis.com\">Ziff Davis</a>.</p>\n"
}