{
  "title": "Episode 409: Lessons from Phil’s Viral Video on Racism",
  "pubDate": "Wed, 17 Jun 2020 15:54:13 +0000",
  "guid": "b9661386-705d-4eab-98af-73a08ab41fe7",
  "link": "https://thephilvischerpodcast.libsyn.com/episode-409-lessons-from-phils-viral-video-on-racism",
  "itunes:image": "",
  "description": "<p class=\"p1\">Can a tweet really change anyone’s mind? Do hashtags and slogans help engagement or shut it down? The Holy Post crew discuss what they’re learning about effective communication following the publication of Skye’s op-ed in USA Today and the release of Phil’s viral video on the history of racism. Also this week, the Supreme Court protects LGBT citizens from employment discrimination. What does it mean for religious organizations? Is there a difference between saying “Black Lives Matter” and supporting the organization with that name? Plus, why is Jerry Falwell Jr. apologizing?<br /> <br /> <em>If you would like a special opportunity to see Christian’s upcoming film, <a href=\"http://www.thegirlwhoworefreedom.com\">The Girl Who Wore Freedom</a>, please donate a minimum of $25 here: <a href= \"http://www.thegirlwhoworefreedom.com/donate\">www.thegirlwhoworefreedom.com/<wbr />donate</a>, and send your receipt to <a href=\"mailto:normandystories@gmail.com\" target=\"_blank\" rel=\"noopener\">normandystories@gmail.com</a>. You will then receive further instructions. </em></p>",
  "content:encoded": "<p class=\"p1\">Can a tweet really change anyone’s mind? Do hashtags and slogans help engagement or shut it down? The Holy Post crew discuss what they’re learning about effective communication following the publication of Skye’s op-ed in USA Today and the release of Phil’s viral video on the history of racism. Also this week, the Supreme Court protects LGBT citizens from employment discrimination. What does it mean for religious organizations? Is there a difference between saying “Black Lives Matter” and supporting the organization with that name? Plus, why is Jerry Falwell Jr. apologizing?  <em>If you would like a special opportunity to see Christian’s upcoming film, <a href=\"http://www.thegirlwhoworefreedom.com\">The Girl Who Wore Freedom</a>, please donate a minimum of $25 here: <a href= \"http://www.thegirlwhoworefreedom.com/donate\">www.thegirlwhoworefreedom.com/donate</a>, and send your receipt to <a href=\"mailto:normandystories@gmail.com\" target=\"_blank\" rel=\"noopener\">normandystories@gmail.com</a>. You will then receive further instructions. </em></p>",
  "enclosure": "",
  "itunes:duration": "57:20",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Can a tweet really change anyone’s mind? Do hashtags and slogans help engagement or shut it down? The Holy Post crew discuss what they’re learning about effective communication following the publication of Skye’s op-ed in USA Today and the...",
  "itunes:episodeType": "full"
}