{
  "id": "https://bibleinoneyear.org/en/youth/42",
  "title": "Day 42: Freedom",
  "description": "Psalm 20:1-7, Exodus 9:1, Matthew 26:69–75, 27:1–5.  It is the story of God’s desire and purpose to free his people  You are set free",
  "pubDate": "Thu, 11 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/42/?ignore",
  "itunes:duration": "13:12",
  "guid": "enyouth11022021-42",
  "length": 792.08,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 42: Freedom",
  "itunes:subtitle": "Psalm 20:1-7, Exodus 9:1, Matthew 26:69–75, 27:1–5.  It is the story of God’s desire and purpose to free his people  You are set free",
  "itunes:summary": "Steve McQueen’s film Twelve Years a Slave is based on the memoirs of Solomon Northup, born free in New York state but kidnapped in Washington DC in 1841, sold into slavery and kept in bondage for twelve years in Louisiana. He describes at length the horrors of slavery on the cotton and sugar plantations.\nEventually, in 1853, he was rescued from slavery and reunited with his family. He wrote, ‘They embraced me, and with tears flowing down their cheeks, hung upon my neck. But I draw a veil over a scene that can better be imagined than described... I have been restored to happiness and liberty.’\nSlavery, in any form, is a horrific evil. Freedom is a wonderful blessing.\nMoses is the liberator of God’s people in the Old Testament. He foreshadows Jesus – the supreme liberator. As Moses set God’s people free from slavery, so Jesus sets you free from slavery to sin.\n‘Freedom’ is probably the best contemporary word to define what the Bible means by ‘salvation’. The whole Bible could be summed up as the ‘history of salvation’. It is the story of God’s desire and purpose to free his people. You are set free.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 42
}