{
  "id": "https://bibleinoneyear.org/en/youth/283",
  "title": "Day 283: Surprised by Joy",
  "description": "Psalm 119:9–16, Jeremiah 23:5-6, 1 Thessalonians 2:19–20, 3:2–12.  It is not a fleeting emotion, but a deep way of being – a state of mind that is available to everybody  It is not found in things, but in a Person",
  "pubDate": "Sun, 10 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/283/?ignore",
  "itunes:duration": "13:27",
  "guid": "enyouth10102021-283",
  "length": 807.97,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 283: Surprised by Joy",
  "itunes:subtitle": "Psalm 119:9–16, Jeremiah 23:5-6, 1 Thessalonians 2:19–20, 3:2–12.  It is not a fleeting emotion, but a deep way of being – a state of mind that is available to everybody  It is not found in things, but in a Person",
  "itunes:summary": "‘Surprised by joy’ is how C.S. Lewis described his conversion from atheism to faith in Jesus Christ. He had never expected that there was any connection between God and joy. If anything, he had thought it would be the opposite: ‘For all I knew, the total rejection of what I called Joy might be one of the demands.’\nConvinced that it was true, Lewis ‘admitted that God was God’. At that moment, he was ‘the most dejected and reluctant convert in all England’. To his great surprise he found that following Jesus was the very opposite to what he expected. He experienced great joy through his new-found faith. He discovered that ‘the heart of reality’ is to be found in a Person. He was surprised by joy.\nMany people confuse pleasure, contentment and joy. ‘Pleasure’ can come from a good holiday, a pay rise or a bar of chocolate. People can become pleasure addicts – always seeking the next fix. But these experiences of pleasure come and go.\n‘Contentment’ is longer term – being satisfied with your life, your home, your job and your relationships.\nBut there is another kind of happiness that we call ‘joy’. It is not a fleeting emotion, but a deep way of being – a state of mind that is available to everybody. It is not found in things, but in a Person.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 283
}