{
  "title": "#475: Denial and Acceptance (OOTP 38, The Second War Begins)",
  "link": "https://audioboom.com/posts/7641866",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5844,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>It's our final Chapter-by-Chapter episode! The <a href=\"https://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">reading archive</a> is now complete!</li>\n<li>Congratulations to our recent Quizzitch Live winners Morg97, Molly, Melissa, Kate, and Kiran.</li>\n<li>Eric has a new podcast, <a href=\"https://podcasts.apple.com/us/podcast/thank-you-for-spieling-podcast/id1521109520\">Thank You For Spieling</a>! Find it on your favorite podcast app.</li>\n<li>MuggleMail includes Occlumency lessons, the Marauders watching Snape and Lily, and whether you can grow out of reading Harry Potter books.</li>\n<li>\n<a href=\"https://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> CONCLUDES with Harry Potter and the Order of the Phoenix – Chapter 38: Second War Begins</li>\n<li>7-Word Summary: Hogwarts is not the most safe space </li>\n<li>Fudge's behavior following Voldemort's return leaves the hosts all bothered.</li>\n<li>What really happened to Umbridge, and how did Dumbledore leave the Forest unscathed?</li>\n<li>Malfoy means business, but is his anger misplaced? Snape and McGonagall square off.</li>\n<li>Why can't Hagrid make Harry feel better? Can anyone?</li>\n<li>To add insult to injury, Harry discovers Sirius' mirror...</li>\n<li>...and Nearly-Headless Nick is roped into a counselor role for his fellow Gryffindor.</li>\n<li>Luna offers hope. Why doesn't Harry talk to Lupin? And the book ends!</li>\n<li>Our final Umbridge Suck Count segment is Brutal! Listen for the final tally.</li>\n<li>MVP of the Week and Rename The Chapter</li>\n<li>To wrap up this book, we each share our favorite character and a lesson we each learned from Order of the Phoenix.</li>\n<li>Quizzitch: Multiple Choice! How many times does the word “grim” appear in Book 5, including in ‘Grimmauld Place’? A) 50-79 times B) 80-119 times C)120-149 times D)150+ times</li>\n<li>This week's episode is brought to you by Thirdlove. Find your perfect fitting bra by going to <a href=\"http://www.Thirdlove.com/mugglecast\">Thirdlove.com/mugglecast</a>, and get 15% off your first order!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 28 Jul 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-07-27:/posts/7641866",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}