{
  "id": "https://bibleinoneyear.org/en/youth/291",
  "title": "Day 291: The Life of a Leader",
  "description": "Psalm 119:57-64, Jeremiah 38:14–20, 1 Timothy 3:1-16.  You do not have to be perfect to be an example  However, we try to ensure that the lifestyle and character of our leaders is in line with the New Testament",
  "pubDate": "Tue, 18 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/291/",
  "itunes:duration": "13:53",
  "guid": "enyouth18102022-291",
  "length": 833.91,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 291: The Life of a Leader",
  "itunes:subtitle": "Psalm 119:57-64, Jeremiah 38:14–20, 1 Timothy 3:1-16.  You do not have to be perfect to be an example  However, we try to ensure that the lifestyle and character of our leaders is in line with the New Testament",
  "itunes:summary": "Good leadership is vital at all times, in all places and in all areas of life. But what is good leadership?\n‘Leadership is a potent combination of strategy and character. But if you must be without one, be without the strategy.’ These are the words of General Norman Schwarzkopf, commander of the coalition forces in the Gulf War of 1991. Character is what really matters. It is the only thing that counts in the end.\nWe make a distinction in our church between those in positions of leadership and those ‘on their way in’. We welcome everyone regardless of their lifestyle. We have a big front door. Everyone is welcome. The church is not a museum displaying perfect people. It is a hospital in the traditional sense of the word – a place of hospitality and restoration. It is a place where the wounded, hurt, broken and injured find healing. It is a community of sinners.\nOn the other hand, we do not put people in positions of leadership if their lifestyle is in direct contrast to the New Testament. Leadership is not only functional, but also involves a responsibility to live as an example to others. Leaders are models for the rest of the congregation. Of course, no one is perfect. You do not have to be perfect to be an example. However, we try to ensure that the lifestyle and character of our leaders is in line with the New Testament.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 656
}