{
  "title": "Episode 108: &#8220;I Wanna Be Your Man&#8221; by the Rolling Stones",
  "link": "https://500songs.com/podcast/episode-108-i-wanna-be-your-man-by-the-rolling-stones/",
  "pubDate": "Wed, 16 Dec 2020 19:30:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=332",
  "description": "Episode 108 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Wanna Be Your Man\" by the Rolling Stones and how the British blues scene of the early sixties was started by a trombone player.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/45109577\">The Monkey Time\" by Major Lance.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-108-i-wanna-be-your-man/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\ni used a lot of resources for this episode. Information on Chris Barber comes from&nbsp;<a href=\"https://amzn.to/34eIjor\"><em>Jazz Me Blues: The Autobiography of Chris Barber</em></a> by Barber and Alyn Shopton.\n\nInformation on Alexis Korner comes from&nbsp;<a href=\"https://amzn.to/385KQSW\"><em>Alexis Korner: The Biography</em></a> by Harry Shapiro.\n\nTwo resources that I've used for this and all future Stones episodes --&nbsp;<a href=\"https://amzn.to/3oQAsFs\"><em>The Rolling Stones: All The Songs</em> by Phillipe Margotin and Jean-Michel Guesden</a> is an invaluable reference book, while&nbsp;<a href=\"https://amzn.to/3p0VBwS\"><em>Old Gods Almost Dead&nbsp;</em>by Stephen Davis</a> is the least inaccurate biography.\n\nI've also used Andrew Loog Oldham's autobiography&nbsp;<a href=\"https://amzn.to/3mpoukC\"><em>Stoned</em></a>, and Keith Richards'<a href=\"https://amzn.to/34iRBzO\">&nbsp;<em>Life</em>,</a> though be warned that both casually use slurs.\n\n<a href=\"https://amzn.to/3r2nNkD\">This compilation </a>contains Alexis Korner's pre-1963 electric blues material, while <a href=\"https://amzn.to/3oY75Rt\">this</a> contains the earlier skiffle and country blues music.\n\nThe live performances by Chris Barber and various blues legends I've used here come from volumes <a href=\"https://amzn.to/3npirxK\">one</a> and t<a href=\"https://amzn.to/3ah6ari\">wo</a> of a three-CD series of these recordings.\n\nAnd <a href=\"https://amzn.to/3ms7Ssl\"> this three-CD set</a> contains the A and B sides of all the Stones' singles up to 1971.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at a group who, more than any other band of the sixties, sum up what \"rock music\" means to most people. This is all the more surprising as when they started out they were vehemently opposed to being referred to as \"rock and roll\". We're going to look at the London blues scene of the early sixties, and how a music scene that was made up of people who thought of themselves as scholars of obscure music, going against commercialism ended up creating some of the most popular and commercial music ever made. We're going to look at the Rolling Stones, and at \"I Wanna Be Your Man\":\n\n[Excerpt: The Rolling Stones, \"I Wanna Be Your Man\"]\n\nThe Rolling Stones' story doesn't actually start with the Rolling Stones, and they won't be appearing until quite near the end of this episode, because to explain how they formed, I have to explain the British blues scene that they formed in.\n\nOne of the things people asked me when I first started doing the podcast was why I didn't cover people like Muddy Waters and Howlin' Wolf in the early episodes -- after all, most people now think that rock and roll started with those artists. It didn't, as I hope the last hundred or so episodes have shown. But those artists did become influential on its development, and that influence happened largely because of one man, Chris Barber.\n\nWe've seen Barber before, in a couple of episodes, but this, even more than his leading the band that brought Lonnie Donegan to fame, is where his influence on popular music really changes everything. On the face of it, Chris Barber seems like the last person in the world who one would expect to be responsible, at least indirectly, for some of the most rebellious popular music ever made. He is a trombone player from a background that is about as solidly respectable as one can imagine -- his parents were introduced to each other by the economist John Maynard Keynes, and his father, another economist, was not only offered a knighthood for his war work (he turned it down but accepted a CBE), but Clement Atlee later offered him a safe seat in Parliament if he wanted to become Chancellor of the Exchequer.\n\nBut when the war started, young Chris Barber started listening to the Armed Forces Network, and became hooked on jazz. By the time the war ended, when he was fifteen, he owned records by Louis Armstrong, Bessie Smith, Duke Ellington, Jelly Roll Morton and more -- records that were almost impossible to find in the Britain of the 1940s.\n\nAnd along with the jazz records, he was also getting hold of blues records by people like Cow Cow Davenport and Sleepy John Estes:\n\n[Excerpt: Sleepy John Estes, \"Milk Cow Blues\"]\n\nIn his late teens and early twenties, Barber had become Britain's pre-eminent traditional jazz trombonist -- a position he held until he retired last year, aged eighty-nine -- but he wasn't just interested in trad jazz, but in all of American roots music, which is why he'd ended up accidentally kick-starting the skiffle craze when his guitarist recorded an old Lead Belly song as a track on a Barber album, as we looked at back in the episode on \"Rock Island Line\".\n\nIf that had been Barber's only contribution to British rock and roll, he would still have been important -- after all, without \"Rock Island Line\", it's likely that you could have counted the number of British boys who played guitar in the fifties and sixties on a single hand. But he did far more than that.\n\nIn the mid to late fifties, Barber became one of the biggest stars in British music. He didn't have a breakout chart hit until 1959, when he released \"Petit Fleur\", engineered by Joe Meek:\n\n[Excerpt: Chris Barber, \"Petit Fleur\"]\n\nAnd Barber didn't even play on that – it was a clarinet solo by his clarinettist Monty Sunshine.\n\nBut long before this big chart success he was a huge live draw and made regular appearances on TV and radio, and he was hugely appreciated among music lovers. A parallel for his status in the music world in the more modern era might be someone like, say, Radiohead -- a band who aren't releasing number one singles, but who have a devoted fanbase and are more famous than many of those acts who do have regular hits.\n\nAnd that celebrity status put Barber in a position to do something that changed music forever. Because he desperately wanted to play with his American musical heroes, and he was one of the few people in Britain with the kind of built-in audience that he could bring over obscure Black musicians, some of whom had never even had a record released over here, and get them on stage with him. And he brought over, in particular, blues musicians.\n\nNow, just as there was a split in the British jazz community between those who liked traditional Dixieland jazz and those who liked modern jazz, there was a similar split in their tastes in blues and R&B. Those who liked modern jazz -- a music that was dominated by saxophones and piano -- unsurprisingly liked modern keyboard and saxophone-based R&B. Their R&B idol was Ray Charles, whose music was the closest of the great R&B stars to modern jazz, and one stream of the British R&B movement of the sixties came from this scene -- people like the Spencer Davis Group, Georgie Fame and the Blue Flames, and Manfred Mann all come from this modernist scene.\n\nBut the trad people, when they listened to blues, liked music that sounded primitive to them, just as they liked primitive-sounding jazz. Their tastes were very heavily influenced by Alan Lomax -- who came to the UK for a crucial period in the fifties to escape McCarthyism -- and they paralleled those of the American folk scene that Lomax was also part of, and followed the same narrative that Lomax's friend John Hammond had constructed for his Spirituals to Swing concerts, where the Delta country blues of people like Robert Johnson had been the basis for both jazz and boogie piano. This entirely false narrative became the received wisdom among the trad scene in Britain, to the extent that two of the very few people in the world who had actually heard Robert Johnson records before the release of the King of the Delta Blues Singers album were Chris Barber and his sometime guitarist and banjo player Alexis Korner. These people liked Robert Johnson, Big Bill Broonzy, Lead Belly, and Lonnie Johnson's early recordings before his later pop success. They liked solo male performers who played guitar.\n\nThese two scenes were geographically close -- the Flamingo Club, a modern jazz club that later became the place where Georgie Fame and Chris Farlowe built their audiences, was literally across the road from the Marquee, a trad jazz club that became the centre of guitar-based R&B in the UK. And there wasn't a perfect hard-and-fast split, as we'll see -- but it's generally true that what is nowadays portrayed as a single British \"blues scene\" was, in its early days, two overlapping but distinct scenes, based in a pre-existing split in the jazz world.\n\nBarber was, of course, part of the traditional jazz wing, and indeed he was so influential a part of it that his tastes shaped the tastes of the whole scene to a large extent. But Barber was not as much of a purist as someone like his former collaborator Ken Colyer, who believed that jazz had become corrupted in 1922 by the evil innovations of people like Louis Armstrong and Fletcher Henderson, who were too modern for his tastes. Barber had preferences, but he could appreciate -- and more importantly play -- music in a variety of styles.\n\nSo Barber started by bringing over Big Bill Broonzy, who John Hammond had got to perform at the Spirituals to Swing concerts when he'd found out Robert Johnson was dead. It was because of Barber bringing Broonzy over that Broonzy got to record with Joe Meek:\n\n[Excerpt: Big Bill Broonzy, \"When Do I Get to Be Called a Man?\"]\n\nAnd it was because of Barber bringing Broonzy over that Broonzy appeared on Six-Five Special, along with Tommy Steele, the Vipers, and Mike and Bernie Winters, and thus became the first blues musician that an entire generation of British musicians saw, their template for what a blues musician is. If you watch the Beatles Anthology, for example, in the sections where they talk about the music they were listening to as teenagers, Broonzy is the only blues musician specifically named. That's because of Chris Barber.\n\nBroonzy toured with Barber several times in the fifties, before his death in 1958, but he wasn't the only one. Barber brought over many people to perform and record with him, including several we've looked at previously. Like the rock and roll stars who visited the UK at this time, these were generally people who were past their commercial peak in the US, but who were fantastic live performers. The Barber band did recording sessions with Louis Jordan:\n\n[Excerpt: Louis Jordan and the Chris Barber band, \"Tain't Nobody's Business\"]\n\nAnd we're lucky enough that many of the Barber band's shows at the Manchester Free Trade Hall (a venue that would later host two hugely important shows we'll talk about in later episodes) were recorded and have since been released. With those recordings we can hear them backing Sister Rosetta Tharpe:\n\n[Excerpt: Sister Rosetta Tharpe and the Chris Barber band, \"Peace in the Valley\"]\n\nSonny Terry and Brownie McGhee:\n\n[Excerpt: Sonny Terry, Brownie McGhee and the Chris Barber band, \"This Little Light of Mine\"]\n\nAnd others like Champion Jack Dupree and Sonny Boy Williamson. But there was one particular blues musician that Barber brought over who changed everything for British music.\n\nBarber was a member of an organisation called the National Jazz Federation, which helped arrange transatlantic musician exchanges. You might remember that at the time there was a rule imposed by the musicians' unions in the UK and the US that the only way for an American musician to play the UK was if a British musician played the US and vice versa, and the National Jazz Federation helped set these exchanges up. Through the NJF Barber had become friendly with John Lewis, the American pianist who led the Modern Jazz Quartet, and was talking with Lewis about what other musicians he could bring over, and Lewis suggested Muddy Waters.\n\nBarber said that would be great, but he had no idea how you'd reach Muddy Waters -- did you send a postcard to the plantation he worked on or something? Lewis laughed, and said that no, Muddy Waters had a Cadillac and an agent.\n\nThe reason for Barber's confusion was fairly straightfoward -- Barber was thinking of Waters' early recordings, which he knew because of the influence of Alan Lomax.\n\nLomax had discovered Muddy Waters back in 1941. He'd travelled to Clarksdale, Mississippi hoping to record Robert Johnson for the Library of Congress -- apparently he didn't know, or had forgotten, that Johnson had died a few years earlier. When he couldn't find Johnson, he'd found another musician, who had a similar style, and recorded him instead. Waters was a working musician who would play whatever people wanted to listen to -- Gene Autry songs, Glenn Miller, whatever -- but who was particularly proficient in blues, influenced by Son House, the same person who had been Johnson's biggest influence. Lomax recorded him playing acoustic blues on a plantation, and those recordings were put out by the Library of Congress:\n\n[Excerpt: Muddy Waters, \"I Be's Troubled\"]\n\nThose Library of Congress recordings had been hugely influential among the trad and skiffle scenes -- Lonnie Donegan, in particular, had borrowed a copy from the American Embassy's record-lending library and then stolen it because he liked it so much.\n\nBut after making those recordings, Waters had travelled up to Chicago and gone electric, forming a band with guitarist Jimmie Rodgers (not the same person as the country singer of the same name, or the 50s pop star), harmonica player Little Walter, drummer Elgin Evans, and pianist Otis Spann.\n\nWaters had signed to Chess Records, then still named Aristocrat, in 1947, and had started out by recording electric versions of the same material he'd been performing acoustically:\n\n[Excerpt: Muddy Waters, \"I Can't Be Satisfied\"]\n\nBut soon he'd partnered with Chess' great bass player, songwriter, and producer Willie Dixon, who wrote a string of blues classics both for Waters and for Chess' other big star Howlin' Wolf. Throughout the early fifties, Waters had a series of hits on the R&B charts with his electric blues records, like the great \"Hoochie Coochie Man\", which introduced one of the most copied blues riffs ever:\n\n[Excerpt: Muddy Waters, \"Hoochie Coochie Man\"]\n\nBut by the late fifties, the hits had started to dry up. Waters was still making great records, but Chess were more interested in artists like Chuck Berry, Bo Diddley, and the Moonglows, who were selling much more and were having big pop hits, not medium-sized R&B ones. So Waters and his pianist Otis Spann were eager to come over to the UK, and Barber was eager to perform with them.\n\nLuckily, unlike many of his trad contemporaries, Barber was comfortable with electric music, and his band quickly learned Waters' current repertoire. Waters came over and played one night at a festival with a different band, made up of modern jazz players who didn't really fit his style before joining the Barber tour, and so he and Spann were a little worried on their first night with the group when they heard these Dixieland trombones and clarinets.\n\nBut as soon as the group blasted out the riff of \"Hoochie Coochie Man\" to introduce their guests, Waters and Spann's faces lit up -- they knew these were musicians they could play with, and they fit in with Barber's band perfectly:\n\n[Excerpt: Muddy Waters, Otis Spann, and the Chris Barber band, \"Hoochie Coochie Man\"]\n\nNot everyone watching the tour was as happy as Barber with the electric blues though -- the audiences were often bemused by the electric guitars, which they associated with rock and roll rather than the blues. Waters, like many of his contemporaries, was perfectly willing to adapt his performance to the audience, and so the next time he came over he brought his acoustic guitar and played more in the country acoustic style they expected.\n\nThe time after that he came over, though, the audiences were disappointed, because he was playing acoustic, and now they wanted and expected him to be playing electric Chicago blues. Because Muddy Waters' first UK tour had developed a fanbase for him, and that fanbase had been cultivated and grown by one man, who had started off playing in the same band as Chris Barber.\n\nAlexis Korner had started out in the Ken Colyer band, the same band that Chris Barber had started out in, as a replacement for Lonnie Donegan when Donegan was conscripted. After Donegan had rejoined the band, they'd played together for a while, and the first ever British skiffle group lineup had been Ken and Bill Colyer, Korner, Donegan, and Barber. When the Colyers had left the group and Barber had taken it over, Korner had gone with the Colyers, mostly because he didn't like the fact that Donegan was introducing country and folk elements into skiffle, while Korner liked the blues.\n\nAs a result, Korner had sung and played on the very first ever British skiffle record, the Ken Colyer group's version of \"Midnight Special\":\n\n[Excerpt: The Ken Colyer Skiffle Group, \"Midnight Special\"]\n\nAfter that, Korner had also backed Beryl Bryden on some skiffle recordings, which also featured a harmonica player named Cyril Davies:\n\n[Excerpt: Beryl Bryden Skiffle Group, \"This Train\"]\n\nBut Korner and Davies had soon got sick of skiffle as it developed -- they liked the blues music that formed its basis, but Korner had never been a fan of Lonnie Donegan's singing -- he'd even said as much in the liner notes to an album by the Barber band while both he and Donegan were still in the band -- and what Donegan saw as eclecticism, including Woody Guthrie songs and old English music-hall songs, Korner saw as watering down the music. Korner and Donegan had a war of words in the pages of Melody Maker, at that time the biggest jazz periodical in Britain. Korner started with an article headlined \"Skiffle is Piffle\", in which he said in part:\n\n\"It is with shame and considerable regret that I have to admit my part as one of the originators of the movement...British skiffle is, most certainly, a commercial success. But musically it rarely exceeds the mediocre and is, in general, so abysmally low that it defies proper musical judgment\".\n\nDonegan replied pointing out that Korner was playing in a skiffle group himself, and then Korner replied to that, saying that what he was doing now wasn't skiffle, it was the blues.\n\nYou can judge for yourself whether the “Blues From the Roundhouse” EP, by Alexis Korner's Breakdown Group, which featured Korner, Davies on guitar and harmonica, plus teachest bass and washboard, was skiffle or blues:\n\n[Excerpt: Alexis Korner's Breakdown Group, \"Skip to My Lou\"]\n\nBut soon Korner and Davies had changed their group's name to Blues Incorporated, and were recording something that was much closer to the Delta and Chicago blues Davies in particular liked.\n\n[Excerpt: Alexis Korner's Blues Incorporated feat. Cyril Davies, \"Death Letter\"]\n\nBut after the initial recordings, Blues Incorporated stopped being a thing for a while, as Korner got more involved with the folk scene. At a party hosted by Ramblin' Jack Elliot, he met the folk guitarist Davey Graham, who had previously lived in the same squat as Lionel Bart, Tommy Steele's lyricist, if that gives some idea of how small and interlocked the London music scene actually was at this time, for all its factional differences.\n\nKorner and Graham formed a guitar duo playing jazzy folk music for a while:\n\n[Excerpt: Alexis Korner and Davey Graham, \"3/4 AD\"]\n\nBut in 1960, after Chris Barber had done a second tour with Muddy Waters, Barber decided that he needed to make Muddy Waters style blues a regular part of his shows. Barber had entered into a partnership with an accountant, Harold Pendleton, who was secretary of the National Jazz Federation. They co-owned a club, the Marquee, which Pendleton managed, and they were about to start up an annual jazz festival, the Richmond festival, which would eventually grow into the Reading Festival, the second-biggest rock festival in Britain.\n\nBarber had a residency at the Marquee, and he wanted to introduce a blues segment into the shows there. He had a singer -- his wife, Ottilie Patterson, who was an excellent singer in the Bessie Smith mould -- and he got a couple of members of his band to back her on some Chicago-style blues songs in the intervals of his shows. He asked Korner to be a part of this interval band, and after a little while it was decided that Korner would form the first ever British electric blues band, which would take over those interval slots, and so Blues Incorporated was reformed, with Cyril Davies rejoining Korner.\n\nThe first time this group played together, in the first week of 1962, it was Korner on electric guitar, Davies on harmonica, and Chris Barber plus Barber's trumpet player Pat Halcox, but they soon lost the Barber band members. The group was called Blues Incorporated because they were meant to be semi-anonymous -- the idea was that people might join just for a show, or just for a few songs, and they never had the same lineup from one show to the next. For example, their classic album R&B From The Marquee, which wasn't actually recorded at the Marquee, and was produced by Jack Good, features Korner, Davies, sax player Dick Heckstall-Smith, Keith Scott on piano, Spike Heatley on bass, Graham Burbridge on drums, and Long John Baldry on vocals:\n\n[Excerpt: Blues Incorporated, \"How Long How Long Blues\"]\n\nBut Burbridge wasn't their regular drummer -- that was a modern jazz player named Charlie Watts. And they had a lot of singers. Baldry was one of their regulars, as was Art Wood (who had a brother, Ronnie, who wasn't yet involved with these players). When Charlie quit the band, because it was taking up too much of his time, he was replaced with another drummer, Ginger Baker. When Spike Heatley left the band, Dick Heckstall-Smith brought in a new bass player, Jack Bruce. Sometimes a young man called Eric Clapton would get up on stage for a number or two, though he wouldn't bring his guitar, he'd just sing with them. So would a singer and harmonica player named Paul Jones, later the singer with Manfred Mann, who first travelled down to see the group with a friend of his, a guitarist named Brian Jones, no relation, who would also sit in with the band on guitar, playing Elmore James numbers under the name Elmo Lewis. A young man named Rodney Stewart would sometimes join in for a number or two.\n\nAnd one time Eric Burdon hitch-hiked down from Newcastle to get a chance to sing with the group. He jumped onto the stage when it got to the point in the show that Korner asked for singers from the audience, and so did a skinny young man. Korner diplomatically suggested that they sing a duet, and they agreed on a Billy Boy Arnold number. At the end of the song Korner introduced them -- \"Eric Burdon from Newcastle, this is Mick Jagger\".\n\nMick Jagger was a middle-class student, studying at the London School of Economics, one of the most prestigious British universities. He soon became a regular guest vocalist with Blues Incorporated, appearing at almost every show. Soon after, Davies left the group -- he wanted to play strictly Chicago style blues, but Korner wanted to play other types of R&B. The final straw for Davies came when Korner brought in Graham Bond on Hammond organ -- it was bad enough that they had a saxophone player, but Hammond was a step too far.\n\nSometimes Jagger would bring on a guitar-playing friend for a song or two -- they'd play a Chuck Berry song, to Davies' disapproval. Mick Jagger and Keith Richards had known each other at primary school, but had fallen out of touch for years. Then one day they'd bumped into each other at a train station, and Richards had noticed two albums under Jagger's arm -- one by Muddy Waters and one by Chuck Berry, both of which he'd ordered specially from Chess Records in Chicago because they weren't out in the UK yet. They'd bonded over their love for Berry and Bo Diddley, in particular, and had soon formed a band themselves, Little Boy Blue and the Blue Boys, with a friend, Dick Taylor, and had made some home recordings of rock and roll and R&B music:\n\n[Excerpt: Little Boy Blue and the Blue Boys, \"Beautiful Delilah\"]\n\nMeanwhile, Brian Jones, the slide player with the Elmore James obsession, decided he wanted to create his own band, who were to be called The Rollin' Stones, named after a favourite Muddy Waters track of his. He got together with Ian Stewart, a piano player who answered an ad in Jazz News magazine. Stewart had very different musical tastes to Jones -- Jones liked Elmore James and Muddy Waters and Howlin' Wolf and especially Jimmy Reed, and very little else, just electric Chicago blues. Stewart was older, and liked boogie piano like Albert Ammons and Pete Johnson, and jump band R&B like Wynonie Harris and Louis Jordan, but he could see that Jones had potential. They tried to get Charlie Watts to join the band, but he refused at first, so they played with a succession of other drummers, starting with Mick Avory.\n\nAnd they needed a singer, and Jones thought that Mick Jagger had genuine star potential. Jagger agreed to join, but only if his mates Dick and Keith could join the band. Jones was a little hesitant -- Mick Jagger was a real blues scholar like him, but he did have a tendency to listen to this rock and roll nonsense rather than proper blues, and Keith seemed even less of a blues purist than that. He probably even listened to Elvis. Dick, meanwhile, was an unknown quantity. But eventually Jones agreed -- though Richards remembers turning up to the first rehearsal and being astonished by Stewart's piano playing, only for Stewart to then turn around to him and say sarcastically \"and you must be the Chuck Berry artist\".\n\nTheir first gig was at the Marquee, in place of Blues Incorporated, who were doing a BBC session and couldn't make their regular gig. Taylor and Avory soon left, and they went through a succession of bass players and drummers, played several small gigs, and also recorded a demo, which had no success in getting them a deal:\n\n[Excerpt: The Rollin' Stones, \"You Can't Judge a Book By its Cover\"]\n\nBy this point, Jones, Richards, and Jagger were all living together, in a flat which has become legendary for its squalour. Jones was managing the group (and pocketing some of the money for himself) and Jones and Richards were spending all day every day playing guitar together, developing an interlocking style in which both could switch from rhythm to lead as the song demanded.\n\nTony Chapman, the drummer they had at the time, brought in a friend of his, Bill Wyman, as bass player -- they didn't like him very much, he was older than the rest of them and seemed to have a bad attitude, and their initial idea was just to get him to leave his equipment with them and then nick it -- he had a really good amplifier that they wanted -- but they eventually decided to keep him in the band.\n\nThey kept pressuring Charlie Watts to join and replace Chapman, and eventually, after talking it over with Alexis Korner's wife Bobbie, he decided to give it a shot, and joined in early 1963. Watts and Wyman quickly gelled as a rhythm section with a unique style -- Watts would play jazz-inspired shuffles, while Wyman would play fast, throbbing, quavers. The Rollin' Stones were now a six-person group, and they were good.\n\nThey got a residency at a new club run by Giorgio Gomelsky, a trad jazz promoter who was branching out into R&B. Gomelsky named his club the Crawdaddy Club, after the Bo Diddley song that the Stones ended their sets with. Soon, as well as playing the Crawdaddy every Sunday night, they were playing Ken Colyer's club, Studio 51, on the other side of London every Sunday evening, so Ian Stewart bought a van to lug all their gear around.\n\nGomelsky thought of himself as the group's manager, though he didn't have a formal contract, but Jones disagreed and considered himself the manager, though he never told Gomelsky this. Jones booked the group in at the IBC studios, where they cut a professional demo with Glyn Johns engineering, consisting mostly of Bo Diddley and Jimmy Reed songs:\n\n[Excerpt: The Rollin' Stones, \"Diddley Daddy\"]\n\nGomelsky started getting the group noticed. He even got the Beatles to visit the club and see the group, and the two bands hit it off -- even though John Lennon had no time for Chicago blues, he liked them as people, and would sometimes pop round to the flat where most of the group lived, once finding Mick and Keith in bed together because they didn't have any money to heat the flat.\n\nThe group's live performances were so good that the Record Mirror, which as its name suggested only normally talked about records, did an article on the group. And the magazine's editor, Peter Jones, raved about them to an acquaintance of his, Andrew Loog Oldham.\n\nOldham was a young man, only nineteen, but he'd already managed to get himself a variety of jobs around and with famous people, mostly by bluffing and conning them into giving him work. He'd worked for Mary Quant, the designer who'd popularised the miniskirt, and then had become a freelance publicist, working with Bob Dylan and Phil Spector on their trips to the UK, and with a succession of minor British pop stars. Most recently, he'd taken a job working with Brian Epstein as the Beatles' London press agent.\n\nBut he wanted his own Beatles, and when he visited the Crawdaddy Club, he decided he'd found them. Oldham knew nothing about R&B, didn't like it, and didn't care -- he liked pure pop music, and he wanted to be Britain's answer to Phil Spector. But he knew charisma when he saw it, and the group on stage had it. He immediately decided he was going to sign them as a manager. However, he needed a partner in order to get them bookings -- at the time in Britain you needed an agent's license to get bookings, and you needed to be twenty-one to get the license. He first offered Brian Epstein the chance to co-manage them -- even though he'd not even talked to the group about it. Epstein said he had enough on his plate already managing the Beatles, Gerry and the Pacemakers, and his other Liverpool groups. At that point Oldham quit his job with Epstein and looked for another partner.\n\nHe found one in Eric Easton, an agent of the old school who had started out as a music-hall organ player before moving over to the management side and whose big clients were Bert Weedon and Mrs. Mills, and who was letting Oldham use a spare room in his office as a base. Oldham persuaded Easton to come to the Crawdaddy Club, though Easton was dubious as it meant missing Sunday Night at the London Palladium on the TV, but Easton agreed that the group had promise -- though he wanted to get rid of the singer, which Oldham talked him out of.\n\nThe two talked with Brian Jones, who agreed, as the group's leader, that they would sign with Oldham and Easton. Easton brought traditional entertainment industry experience, while Oldham brought an understanding of how to market pop groups. Jones, as the group's leader, negotiated an extra five pounds a week for himself off the top in the deal.\n\nOne piece of advice that Oldham had been given by Phil Spector and which he'd taken to heart was that rather than get a band signed to a record label directly, you should set up an independent production company and lease the tapes to the label, and that's what Oldham and Easton did. They formed a company called Impact, and went into the studio with the Stones and recorded the song they performed which they thought had the most commercial potential, a Chuck Berry song called \"Come On\" -- though they changed Berry's line about a \"stupid jerk\" to being about a \"stupid guy\", in order to make sure the radio would play it:\n\n[Excerpt: The Rolling Stones, \"Come On\"]\n\nDuring the recording, Oldham, who was acting as producer, told the engineer not to mic up the piano. His plans didn't include Ian Stewart.\n\nNeither the group nor Oldham were particularly happy with the record -- the group because they felt it was too poppy, Oldham because it wasn't poppy enough. But they took the recording to Decca Records, where Dick Rowe, the man who had turned down the Beatles, eagerly signed them. The conventional story is that Rowe signed them after being told about them by George Harrison, but the other details of the story as it's usually told -- that they were judging a talent contest in Liverpool, which is the story in most Stones biographies, or that they were appearing together on Juke Box Jury, which is what Wikipedia and articles ripped off from Wikipedia say -- are false, and so it's likely that the story is made up.\n\nDecca wanted the Stones to rerecord the track, but after going to another studio with Easton instead of Oldham producing, the general consensus was that the first version should be released. The group got new suits for their first TV appearance, and it was when they turned up to collect the suits and found there were only five of them, not six, that Ian Stewart discovered Oldham had had him kicked out of the group, thinking he was too old and too ugly, and that six people was too many for a pop group.\n\nStewart was given the news by Brian Jones, and never really forgave either Jones or Oldham, but he remained loyal to the rest of the group. He became their road manager, and would continue to play piano with them on stage and in the studio for the next twenty-two years, until his death -- he just wasn't allowed in the photos or any TV appearances.\n\nThat wasn't the only change Oldham made -- he insisted that the group be called the Rolling Stones, with a g, not Rollin'. He also changed Keith Richards' surname, dropping the s to be more like Cliff, though Richards later changed it back again.\n\n\"Come On\" made number twenty-one in the charts, but the band were unsure of what to do as a follow-up single. Most of their repertoire consisted of hard blues songs, which were unlikely to have any chart success. Oldham convened the group for a rehearsal and they ran through possible songs -- nothing seemed right.\n\nOldham got depressed and went out for a walk, and happened to bump into John Lennon and Paul McCartney. They asked him what was up, and he explained that the group needed a song. Lennon and McCartney said they thought they could help, and came back to the rehearsal studio with Oldham. They played the Stones an idea that McCartney had been working on, which they thought might be OK for the group. The group said it would work, and Lennon and McCartney retreated to a corner, finished the song, and presented it to them.\n\nThe result became the Stones' second single, and another hit for them, this time reaching number twelve. The second single was produced by Easton, as Oldham, who is bipolar, was in a depressive phase and had gone off on holiday to try to get out of it:\n\n[Excerpt: The Rolling Stones, \"I Wanna Be Your Man\"]\n\nThe Beatles later recorded their own version of the song as an album track, giving it to Ringo to sing -- as Lennon said of the song, \"We weren't going to give them anything great, were we?\":\n\n[Excerpt: The Beatles, \"I Wanna Be Your Man\"]\n\nFor a B-side, the group did a song called \"Stoned\", which was clearly \"inspired\" by \"Green Onions\":\n\n[Excerpt: The Rolling Stones, \"Stoned\"]\n\nThat was credited to a group pseudonym, Nanker Phelge -- Nanker after a particular face that Jones and Richards enjoyed pulling, and Phelge after a flatmate of several of the band members, James Phelge.\n\nAs it was an original, by at least some definitions of the term original, it needed publishing, and Easton got the group signed to a publishing company with whom he had a deal, without consulting Oldham about it. When Oldham got back, he was furious, and that was the beginning of the end of Easton's time with the group.\n\nBut it was also the beginning of something else, because Oldham had had a realisation -- if you're going to make records you need songs, and you can't just expect to bump into Lennon and McCartney every time you need a new single.\n\nNo, the Rolling Stones were going to have to have some originals, and Andrew Loog Oldham was going to make them into writers. We'll see how that went in a few weeks' time, when we pick up on their career.",
  "itunes:subtitle": "Episode 108 of A History of Rock Music in Five Hundred Songs looks at I Wanna Be Your Man by the Rolling Stones and how the British blues scene of the early sixties was started by a trombone player.\n\nClick the full post to read liner notes, links to more",
  "itunes:keywords": "Alan Lomax,Alexis Korner,Andrew Loog Oldham,Big Bill Broonzy,Bill Wyman,Brian Jones,British rock,Charlie Watts,Chess Records,Chris Barber,Chuck Berry,Cyril Davies,Davey Graham,Decca Records,Dick Heckstall-Smith,Dick Rowe,Dick Taylor,Eric Burdon,Eric Clapton,George Harrison,Ginger Baker,Giorgio Gomelsky,Glyn Johns,Graham Bond,Ian Stewart,Jack Bruce,Jack Good,Joe Meek,John Hammond,John Lennon,Keith Richards,Long John Baldry,Lonnie Donegan,Louis Jordan,Mick Avory,Mick Jagger,Muddy Waters,Paul Jones,Paul McCartney,Phil Spector,Robert Johnson,Rod Stewart,Sister Rosetta Tharpe,Six-Five Special,skiffle,The Beatles,the blues,The Rolling Stones,trad jazz",
  "itunes:episodeType": "full",
  "itunes:episode": 108,
  "content:encoded": "Episode 108 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"I Wanna Be Your Man\" by the Rolling Stones and how the British blues scene of the early sixties was started by a trombone player.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/45109577\">The Monkey Time\" by Major Lance.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-108-i-wanna-be-your-man/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\ni used a lot of resources for this episode. Information on Chris Barber comes from&nbsp;<a href=\"https://amzn.to/34eIjor\"><em>Jazz Me Blues: The Autobiography of Chris Barber</em></a> by Barber and Alyn Shopton.\n\nInformation on Alexis Korner comes from&nbsp;<a href=\"https://amzn.to/385KQSW\"><em>Alexis Korner: The Biography</em></a> by Harry Shapiro.\n\nTwo resources that I've used for this and all future Stones episodes --&nbsp;<a href=\"https://amzn.to/3oQAsFs\"><em>The Rolling Stones: All The Songs</em> by Phillipe Margotin and Jean-Michel Guesden</a> is an invaluable reference book, while&nbsp;<a href=\"https://amzn.to/3p0VBwS\"><em>Old Gods Almost Dead&nbsp;</em>by Stephen Davis</a> is the least inaccurate biography.\n\nI've also used Andrew Loog Oldham's autobiography&nbsp;<a href=\"https://amzn.to/3mpoukC\"><em>Stoned</em></a>, and Keith Richards'<a href=\"https://amzn.to/34iRBzO\">&nbsp;<em>Life</em>,</a> though be warned that both casually use slurs.\n\n<a href=\"https://amzn.to/3r2nNkD\">This compilation </a>contains Alexis Korner's pre-1963 electric blues material, while <a href=\"https://amzn.to/3oY75Rt\">this</a> contains the earlier skiffle and country blues music.\n\nThe live performances by Chris Barber and various blues legends I've used here come from volumes <a href=\"https://amzn.to/3npirxK\">one</a> and t<a href=\"https://amzn.to/3ah6ari\">wo</a> of a three-CD series of these recordings.\n\nAnd <a href=\"https://amzn.to/3ms7Ssl\"> this three-CD set</a> contains the A and B sides of all the Stones' singles up to 1971.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at a group who, more than any other band of the sixties, sum up what \"rock music\" means to most people. This is all the more surprising as when they started out they were vehemently opposed to being referred to as \"rock and roll\". We're going to look at the London blues scene of the early sixties, and how a music scene that was made up of people who thought of themselves as scholars of obscure music, going against commercialism ended up creating some of the most popular and commercial music ever made. We're going to look at the Rolling Stones, and at \"I Wanna Be Your Man\":\n\n[Excerpt: The Rolling Stones, \"I Wanna Be Your Man\"]\n\nThe Rolling Stones' story doesn't actually start with the Rolling Stones, and they won't be appearing until quite near the end of this episode, because to explain how they formed, I have to explain the British blues scene that they formed in.\n\nOne of the things people asked me when I first started doing the podcast was why I didn't cover people like Muddy Waters and Howlin' Wolf in the early episodes -- after all, most people now think that rock and roll started with those artists. It didn't, as I hope the last hundred or so episodes have shown. But those artists did become influential on its development, and that influence happened largely because of one man, Chris Barber.\n\nWe've seen Barber before, in a couple of episodes, but this, even more than his leading the band that brought Lonnie Donegan to fame, is where his influence on popular music really changes everything. On the face of it, Chris Barber seems like the last person in the world who one would expect to be responsible, at least indirectly, for some of the most rebellious popular music ever made. He is a trombone player from a background that is about as solidly respectable as one can imagine -- his parents were introduced to each other by the economist John Maynard Keynes, and his father, another economist, was not only offered a knighthood for his war work (he turned it down but accepted a CBE), but Clement Atlee later offered him a safe seat in Parliament if he wanted to become Chancellor of the Exchequer.\n\nBut when the war started, young Chris Barber started listening to the Armed Forces Network, and became hooked on jazz. By the time the war ended, when he was fifteen, he owned records by Louis Armstrong, Bessie Smith, Duke Ellington, Jelly Roll Morton and more -- records that were almost impossible to find in the Britain of the 1940s.\n\nAnd along with the jazz records, he was also getting hold of blues records by people like Cow Cow Davenport and Sleepy John Estes:\n\n[Excerpt: Sleepy John Estes, \"Milk Cow Blues\"]\n\nIn his late teens and early twenties, Barber had become Britain's pre-eminent traditional jazz trombonist -- a position he held until he retired last year, aged eighty-nine -- but he wasn't just interested in trad jazz, but in all of American roots music, which is why he'd ended up accidentally kick-starting the skiffle craze when his guitarist recorded an old Lead Belly song as a track on a Barber album, as we looked at back in the episode on \"Rock Island Line\".\n\nIf that had been Barber's only contribution to British rock and roll, he would still have been important -- after all, without \"Rock Island Line\", it's likely that you could have counted the number of British boys who played guitar in the fifties and sixties on a single hand. But he did far more than that.\n\nIn the mid to late fifties, Barber became one of the biggest stars in British music. He didn't have a breakout chart hit until 1959, when he released \"Petit Fleur\", engineered by Joe Meek:\n\n[Excerpt: Chris Barber, \"Petit Fleur\"]\n\nAnd Barber didn't even play on that – it was a clarinet solo by his clarinettist Monty Sunshine.\n\nBut long before this big chart success he was a huge live draw and made regular appearances on TV and radio, and he was hugely appreciated among music lovers. A parallel for his status in the music world in the more modern era might be someone like, say, Radiohead -- a band who aren't releasing number one singles, but who have a devoted fanbase and are more famous than many of those acts who do have regular hits.\n\nAnd that celebrity status put Barber in a position to do something that changed music forever. Because he desperately wanted to play with his American musical heroes, and he was one of the few people in Britain with the kind of built-in audience that he could bring over obscure Black musicians, some of whom had never even had a record released over here, and get them on stage with him. And he brought over, in particular, blues musicians.\n\nNow, just as there was a split in the British jazz community between those who liked traditional Dixieland jazz and those who liked modern jazz, there was a similar split in their tastes in blues and R&B. Those who liked modern jazz -- a music that was dominated by saxophones and piano -- unsurprisingly liked modern keyboard and saxophone-based R&B. Their R&B idol was Ray Charles, whose music was the closest of the great R&B stars to modern jazz, and one stream of the British R&B movement of the sixties came from this scene -- people like the Spencer Davis Group, Georgie Fame and the Blue Flames, and Manfred Mann all come from this modernist scene.\n\nBut the trad people, when they listened to blues, liked music that sounded primitive to them, just as they liked primitive-sounding jazz. Their tastes were very heavily influenced by Alan Lomax -- who came to the UK for a crucial period in the fifties to escape McCarthyism -- and they paralleled those of the American folk scene that Lomax was also part of, and followed the same narrative that Lomax's friend John Hammond had constructed for his Spirituals to Swing concerts, where the Delta country blues of people like Robert Johnson had been the basis for both jazz and boogie piano. This entirely false narrative became the received wisdom among the trad scene in Britain, to the extent that two of the very few people in the world who had actually heard Robert Johnson records before the release of the King of the Delta Blues Singers album were Chris Barber and his sometime guitarist and banjo player Alexis Korner. These people liked Robert Johnson, Big Bill Broonzy, Lead Belly, and Lonnie Johnson's early recordings before his later pop success. They liked solo male performers who played guitar.\n\nThese two scenes were geographically close -- the Flamingo Club, a modern jazz club that later became the place where Georgie Fame and Chris Farlowe built their audiences, was literally across the road from the Marquee, a trad jazz club that became the centre of guitar-based R&B in the UK. And there wasn't a perfect hard-and-fast split, as we'll see -- but it's generally true that what is nowadays portrayed as a single British \"blues scene\" was, in its early days, two overlapping but distinct scenes, based in a pre-existing split in the jazz world.\n\nBarber was, of course, part of the traditional jazz wing, and indeed he was so influential a part of it that his tastes shaped the tastes of the whole scene to a large extent. But Barber was not as much of a purist as someone like his former collaborator Ken Colyer, who believed that jazz had become corrupted in 1922 by the evil innovations of people like Louis Armstrong and Fletcher Henderson, who were too modern for his tastes. Barber had preferences, but he could appreciate -- and more importantly play -- music in a variety of styles.\n\nSo Barber started by bringing over Big Bill Broonzy, who John Hammond had got to perform at the Spirituals to Swing concerts when he'd found out Robert Johnson was dead. It was because of Barber bringing Broonzy over that Broonzy got to record with Joe Meek:\n\n[Excerpt: Big Bill Broonzy, \"When Do I Get to Be Called a Man?\"]\n\nAnd it was because of Barber bringing Broonzy over that Broonzy appeared on Six-Five Special, along with Tommy Steele, the Vipers, and Mike and Bernie Winters, and thus became the first blues musician that an entire generation of British musicians saw, their template for what a blues musician is. If you watch the Beatles Anthology, for example, in the sections where they talk about the music they were listening to as teenagers, Broonzy is the only blues musician specifically named. That's because of Chris Barber.\n\nBroonzy toured with Barber several times in the fifties, before his death in 1958, but he wasn't the only one. Barber brought over many people to perform and record with him, including several we've looked at previously. Like the rock and roll stars who visited the UK at this time, these were generally people who were past their commercial peak in the US, but who were fantastic live performers. The Barber band did recording sessions with Louis Jordan:\n\n[Excerpt: Louis Jordan and the Chris Barber band, \"Tain't Nobody's Business\"]\n\nAnd we're lucky enough that many of the Barber band's shows at the Manchester Free Trade Hall (a venue that would later host two hugely important shows we'll talk about in later episodes) were recorded and have since been released. With those recordings we can hear them backing Sister Rosetta Tharpe:\n\n[Excerpt: Sister Rosetta Tharpe and the Chris Barber band, \"Peace in the Valley\"]\n\nSonny Terry and Brownie McGhee:\n\n[Excerpt: Sonny Terry, Brownie McGhee and the Chris Barber band, \"This Little Light of Mine\"]\n\nAnd others like Champion Jack Dupree and Sonny Boy Williamson. But there was one particular blues musician that Barber brought over who changed everything for British music.\n\nBarber was a member of an organisation called the National Jazz Federation, which helped arrange transatlantic musician exchanges. You might remember that at the time there was a rule imposed by the musicians' unions in the UK and the US that the only way for an American musician to play the UK was if a British musician played the US and vice versa, and the National Jazz Federation helped set these exchanges up. Through the NJF Barber had become friendly with John Lewis, the American pianist who led the Modern Jazz Quartet, and was talking with Lewis about what other musicians he could bring over, and Lewis suggested Muddy Waters.\n\nBarber said that would be great, but he had no idea how you'd reach Muddy Waters -- did you send a postcard to the plantation he worked on or something? Lewis laughed, and said that no, Muddy Waters had a Cadillac and an agent.\n\nThe reason for Barber's confusion was fairly straightfoward -- Barber was thinking of Waters' early recordings, which he knew because of the influence of Alan Lomax.\n\nLomax had discovered Muddy Waters back in 1941. He'd travelled to Clarksdale, Mississippi hoping to record Robert Johnson for the Library of Congress -- apparently he didn't know, or had forgotten, that Johnson had died a few years earlier. When he couldn't find Johnson, he'd found another musician, who had a similar style, and recorded him instead. Waters was a working musician who would play whatever people wanted to listen to -- Gene Autry songs, Glenn Miller, whatever -- but who was particularly proficient in blues, influenced by Son House, the same person who had been Johnson's biggest influence. Lomax recorded him playing acoustic blues on a plantation, and those recordings were put out by the Library of Congress:\n\n[Excerpt: Muddy Waters, \"I Be's Troubled\"]\n\nThose Library of Congress recordings had been hugely influential among the trad and skiffle scenes -- Lonnie Donegan, in particular, had borrowed a copy from the American Embassy's record-lending library and then stolen it because he liked it so much.\n\nBut after making those recordings, Waters had travelled up to Chicago and gone electric, forming a band with guitarist Jimmie Rodgers (not the same person as the country singer of the same name, or the 50s pop star), harmonica player Little Walter, drummer Elgin Evans, and pianist Otis Spann.\n\nWaters had signed to Chess Records, then still named Aristocrat, in 1947, and had started out by recording electric versions of the same material he'd been performing acoustically:\n\n[Excerpt: Muddy Waters, \"I Can't Be Satisfied\"]\n\nBut soon he'd partnered with Chess' great bass player, songwriter, and producer Willie Dixon, who wrote a string of blues classics both for Waters and for Chess' other big star Howlin' Wolf. Throughout the early fifties, Waters had a series of hits on the R&B charts with his electric blues records, like the great \"Hoochie Coochie Man\", which introduced one of the most copied blues riffs ever:\n\n[Excerpt: Muddy Waters, \"Hoochie Coochie Man\"]\n\nBut by the late fifties, the hits had started to dry up. Waters was still making great records, but Chess were more interested in artists like Chuck Berry, Bo Diddley, and the Moonglows, who were selling much more and were having big pop hits, not medium-sized R&B ones. So Waters and his pianist Otis Spann were eager to come over to the UK, and Barber was eager to perform with them.\n\nLuckily, unlike many of his trad contemporaries, Barber was comfortable with electric music, and his band quickly learned Waters' current repertoire. Waters came over and played one night at a festival with a different band, made up of modern jazz players who didn't really fit his style before joining the Barber tour, and so he and Spann were a little worried on their first night with the group when they heard these Dixieland trombones and clarinets.\n\nBut as soon as the group blasted out the riff of \"Hoochie Coochie Man\" to introduce their guests, Waters and Spann's faces lit up -- they knew these were musicians they could play with, and they fit in with Barber's band perfectly:\n\n[Excerpt: Muddy Waters, Otis Spann, and the Chris Barber band, \"Hoochie Coochie Man\"]\n\nNot everyone watching the tour was as happy as Barber with the electric blues though -- the audiences were often bemused by the electric guitars, which they associated with rock and roll rather than the blues. Waters, like many of his contemporaries, was perfectly willing to adapt his performance to the audience, and so the next time he came over he brought his acoustic guitar and played more in the country acoustic style they expected.\n\nThe time after that he came over, though, the audiences were disappointed, because he was playing acoustic, and now they wanted and expected him to be playing electric Chicago blues. Because Muddy Waters' first UK tour had developed a fanbase for him, and that fanbase had been cultivated and grown by one man, who had started off playing in the same band as Chris Barber.\n\nAlexis Korner had started out in the Ken Colyer band, the same band that Chris Barber had started out in, as a replacement for Lonnie Donegan when Donegan was conscripted. After Donegan had rejoined the band, they'd played together for a while, and the first ever British skiffle group lineup had been Ken and Bill Colyer, Korner, Donegan, and Barber. When the Colyers had left the group and Barber had taken it over, Korner had gone with the Colyers, mostly because he didn't like the fact that Donegan was introducing country and folk elements into skiffle, while Korner liked the blues.\n\nAs a result, Korner had sung and played on the very first ever British skiffle record, the Ken Colyer group's version of \"Midnight Special\":\n\n[Excerpt: The Ken Colyer Skiffle Group, \"Midnight Special\"]\n\nAfter that, Korner had also backed Beryl Bryden on some skiffle recordings, which also featured a harmonica player named Cyril Davies:\n\n[Excerpt: Beryl Bryden Skiffle Group, \"This Train\"]\n\nBut Korner and Davies had soon got sick of skiffle as it developed -- they liked the blues music that formed its basis, but Korner had never been a fan of Lonnie Donegan's singing -- he'd even said as much in the liner notes to an album by the Barber band while both he and Donegan were still in the band -- and what Donegan saw as eclecticism, including Woody Guthrie songs and old English music-hall songs, Korner saw as watering down the music. Korner and Donegan had a war of words in the pages of Melody Maker, at that time the biggest jazz periodical in Britain. Korner started with an article headlined \"Skiffle is Piffle\", in which he said in part:\n\n\"It is with shame and considerable regret that I have to admit my part as one of the originators of the movement...British skiffle is, most certainly, a commercial success. But musically it rarely exceeds the mediocre and is, in general, so abysmally low that it defies proper musical judgment\".\n\nDonegan replied pointing out that Korner was playing in a skiffle group himself, and then Korner replied to that, saying that what he was doing now wasn't skiffle, it was the blues.\n\nYou can judge for yourself whether the “Blues From the Roundhouse” EP, by Alexis Korner's Breakdown Group, which featured Korner, Davies on guitar and harmonica, plus teachest bass and washboard, was skiffle or blues:\n\n[Excerpt: Alexis Korner's Breakdown Group, \"Skip to My Lou\"]\n\nBut soon Korner and Davies had changed their group's name to Blues Incorporated, and were recording something that was much closer to the Delta and Chicago blues Davies in particular liked.\n\n[Excerpt: Alexis Korner's Blues Incorporated feat. Cyril Davies, \"Death Letter\"]\n\nBut after the initial recordings, Blues Incorporated stopped being a thing for a while, as Korner got more involved with the folk scene. At a party hosted by Ramblin' Jack Elliot, he met the folk guitarist Davey Graham, who had previously lived in the same squat as Lionel Bart, Tommy Steele's lyricist, if that gives some idea of how small and interlocked the London music scene actually was at this time, for all its factional differences.\n\nKorner and Graham formed a guitar duo playing jazzy folk music for a while:\n\n[Excerpt: Alexis Korner and Davey Graham, \"3/4 AD\"]\n\nBut in 1960, after Chris Barber had done a second tour with Muddy Waters, Barber decided that he needed to make Muddy Waters style blues a regular part of his shows. Barber had entered into a partnership with an accountant, Harold Pendleton, who was secretary of the National Jazz Federation. They co-owned a club, the Marquee, which Pendleton managed, and they were about to start up an annual jazz festival, the Richmond festival, which would eventually grow into the Reading Festival, the second-biggest rock festival in Britain.\n\nBarber had a residency at the Marquee, and he wanted to introduce a blues segment into the shows there. He had a singer -- his wife, Ottilie Patterson, who was an excellent singer in the Bessie Smith mould -- and he got a couple of members of his band to back her on some Chicago-style blues songs in the intervals of his shows. He asked Korner to be a part of this interval band, and after a little while it was decided that Korner would form the first ever British electric blues band, which would take over those interval slots, and so Blues Incorporated was reformed, with Cyril Davies rejoining Korner.\n\nThe first time this group played together, in the first week of 1962, it was Korner on electric guitar, Davies on harmonica, and Chris Barber plus Barber's trumpet player Pat Halcox, but they soon lost the Barber band members. The group was called Blues Incorporated because they were meant to be semi-anonymous -- the idea was that people might join just for a show, or just for a few songs, and they never had the same lineup from one show to the next. For example, their classic album R&B From The Marquee, which wasn't actually recorded at the Marquee, and was produced by Jack Good, features Korner, Davies, sax player Dick Heckstall-Smith, Keith Scott on piano, Spike Heatley on bass, Graham Burbridge on drums, and Long John Baldry on vocals:\n\n[Excerpt: Blues Incorporated, \"How Long How Long Blues\"]\n\nBut Burbridge wasn't their regular drummer -- that was a modern jazz player named Charlie Watts. And they had a lot of singers. Baldry was one of their regulars, as was Art Wood (who had a brother, Ronnie, who wasn't yet involved with these players). When Charlie quit the band, because it was taking up too much of his time, he was replaced with another drummer, Ginger Baker. When Spike Heatley left the band, Dick Heckstall-Smith brought in a new bass player, Jack Bruce. Sometimes a young man called Eric Clapton would get up on stage for a number or two, though he wouldn't bring his guitar, he'd just sing with them. So would a singer and harmonica player named Paul Jones, later the singer with Manfred Mann, who first travelled down to see the group with a friend of his, a guitarist named Brian Jones, no relation, who would also sit in with the band on guitar, playing Elmore James numbers under the name Elmo Lewis. A young man named Rodney Stewart would sometimes join in for a number or two.\n\nAnd one time Eric Burdon hitch-hiked down from Newcastle to get a chance to sing with the group. He jumped onto the stage when it got to the point in the show that Korner asked for singers from the audience, and so did a skinny young man. Korner diplomatically suggested that they sing a duet, and they agreed on a Billy Boy Arnold number. At the end of the song Korner introduced them -- \"Eric Burdon from Newcastle, this is Mick Jagger\".\n\nMick Jagger was a middle-class student, studying at the London School of Economics, one of the most prestigious British universities. He soon became a regular guest vocalist with Blues Incorporated, appearing at almost every show. Soon after, Davies left the group -- he wanted to play strictly Chicago style blues, but Korner wanted to play other types of R&B. The final straw for Davies came when Korner brought in Graham Bond on Hammond organ -- it was bad enough that they had a saxophone player, but Hammond was a step too far.\n\nSometimes Jagger would bring on a guitar-playing friend for a song or two -- they'd play a Chuck Berry song, to Davies' disapproval. Mick Jagger and Keith Richards had known each other at primary school, but had fallen out of touch for years. Then one day they'd bumped into each other at a train station, and Richards had noticed two albums under Jagger's arm -- one by Muddy Waters and one by Chuck Berry, both of which he'd ordered specially from Chess Records in Chicago because they weren't out in the UK yet. They'd bonded over their love for Berry and Bo Diddley, in particular, and had soon formed a band themselves, Little Boy Blue and the Blue Boys, with a friend, Dick Taylor, and had made some home recordings of rock and roll and R&B music:\n\n[Excerpt: Little Boy Blue and the Blue Boys, \"Beautiful Delilah\"]\n\nMeanwhile, Brian Jones, the slide player with the Elmore James obsession, decided he wanted to create his own band, who were to be called The Rollin' Stones, named after a favourite Muddy Waters track of his. He got together with Ian Stewart, a piano player who answered an ad in Jazz News magazine. Stewart had very different musical tastes to Jones -- Jones liked Elmore James and Muddy Waters and Howlin' Wolf and especially Jimmy Reed, and very little else, just electric Chicago blues. Stewart was older, and liked boogie piano like Albert Ammons and Pete Johnson, and jump band R&B like Wynonie Harris and Louis Jordan, but he could see that Jones had potential. They tried to get Charlie Watts to join the band, but he refused at first, so they played with a succession of other drummers, starting with Mick Avory.\n\nAnd they needed a singer, and Jones thought that Mick Jagger had genuine star potential. Jagger agreed to join, but only if his mates Dick and Keith could join the band. Jones was a little hesitant -- Mick Jagger was a real blues scholar like him, but he did have a tendency to listen to this rock and roll nonsense rather than proper blues, and Keith seemed even less of a blues purist than that. He probably even listened to Elvis. Dick, meanwhile, was an unknown quantity. But eventually Jones agreed -- though Richards remembers turning up to the first rehearsal and being astonished by Stewart's piano playing, only for Stewart to then turn around to him and say sarcastically \"and you must be the Chuck Berry artist\".\n\nTheir first gig was at the Marquee, in place of Blues Incorporated, who were doing a BBC session and couldn't make their regular gig. Taylor and Avory soon left, and they went through a succession of bass players and drummers, played several small gigs, and also recorded a demo, which had no success in getting them a deal:\n\n[Excerpt: The Rollin' Stones, \"You Can't Judge a Book By its Cover\"]\n\nBy this point, Jones, Richards, and Jagger were all living together, in a flat which has become legendary for its squalour. Jones was managing the group (and pocketing some of the money for himself) and Jones and Richards were spending all day every day playing guitar together, developing an interlocking style in which both could switch from rhythm to lead as the song demanded.\n\nTony Chapman, the drummer they had at the time, brought in a friend of his, Bill Wyman, as bass player -- they didn't like him very much, he was older than the rest of them and seemed to have a bad attitude, and their initial idea was just to get him to leave his equipment with them and then nick it -- he had a really good amplifier that they wanted -- but they eventually decided to keep him in the band.\n\nThey kept pressuring Charlie Watts to join and replace Chapman, and eventually, after talking it over with Alexis Korner's wife Bobbie, he decided to give it a shot, and joined in early 1963. Watts and Wyman quickly gelled as a rhythm section with a unique style -- Watts would play jazz-inspired shuffles, while Wyman would play fast, throbbing, quavers. The Rollin' Stones were now a six-person group, and they were good.\n\nThey got a residency at a new club run by Giorgio Gomelsky, a trad jazz promoter who was branching out into R&B. Gomelsky named his club the Crawdaddy Club, after the Bo Diddley song that the Stones ended their sets with. Soon, as well as playing the Crawdaddy every Sunday night, they were playing Ken Colyer's club, Studio 51, on the other side of London every Sunday evening, so Ian Stewart bought a van to lug all their gear around.\n\nGomelsky thought of himself as the group's manager, though he didn't have a formal contract, but Jones disagreed and considered himself the manager, though he never told Gomelsky this. Jones booked the group in at the IBC studios, where they cut a professional demo with Glyn Johns engineering, consisting mostly of Bo Diddley and Jimmy Reed songs:\n\n[Excerpt: The Rollin' Stones, \"Diddley Daddy\"]\n\nGomelsky started getting the group noticed. He even got the Beatles to visit the club and see the group, and the two bands hit it off -- even though John Lennon had no time for Chicago blues, he liked them as people, and would sometimes pop round to the flat where most of the group lived, once finding Mick and Keith in bed together because they didn't have any money to heat the flat.\n\nThe group's live performances were so good that the Record Mirror, which as its name suggested only normally talked about records, did an article on the group. And the magazine's editor, Peter Jones, raved about them to an acquaintance of his, Andrew Loog Oldham.\n\nOldham was a young man, only nineteen, but he'd already managed to get himself a variety of jobs around and with famous people, mostly by bluffing and conning them into giving him work. He'd worked for Mary Quant, the designer who'd popularised the miniskirt, and then had become a freelance publicist, working with Bob Dylan and Phil Spector on their trips to the UK, and with a succession of minor British pop stars. Most recently, he'd taken a job working with Brian Epstein as the Beatles' London press agent.\n\nBut he wanted his own Beatles, and when he visited the Crawdaddy Club, he decided he'd found them. Oldham knew nothing about R&B, didn't like it, and didn't care -- he liked pure pop music, and he wanted to be Britain's answer to Phil Spector. But he knew charisma when he saw it, and the group on stage had it. He immediately decided he was going to sign them as a manager. However, he needed a partner in order to get them bookings -- at the time in Britain you needed an agent's license to get bookings, and you needed to be twenty-one to get the license. He first offered Brian Epstein the chance to co-manage them -- even though he'd not even talked to the group about it. Epstein said he had enough on his plate already managing the Beatles, Gerry and the Pacemakers, and his other Liverpool groups. At that point Oldham quit his job with Epstein and looked for another partner.\n\nHe found one in Eric Easton, an agent of the old school who had started out as a music-hall organ player before moving over to the management side and whose big clients were Bert Weedon and Mrs. Mills, and who was letting Oldham use a spare room in his office as a base. Oldham persuaded Easton to come to the Crawdaddy Club, though Easton was dubious as it meant missing Sunday Night at the London Palladium on the TV, but Easton agreed that the group had promise -- though he wanted to get rid of the singer, which Oldham talked him out of.\n\nThe two talked with Brian Jones, who agreed, as the group's leader, that they would sign with Oldham and Easton. Easton brought traditional entertainment industry experience, while Oldham brought an understanding of how to market pop groups. Jones, as the group's leader, negotiated an extra five pounds a week for himself off the top in the deal.\n\nOne piece of advice that Oldham had been given by Phil Spector and which he'd taken to heart was that rather than get a band signed to a record label directly, you should set up an independent production company and lease the tapes to the label, and that's what Oldham and Easton did. They formed a company called Impact, and went into the studio with the Stones and recorded the song they performed which they thought had the most commercial potential, a Chuck Berry song called \"Come On\" -- though they changed Berry's line about a \"stupid jerk\" to being about a \"stupid guy\", in order to make sure the radio would play it:\n\n[Excerpt: The Rolling Stones, \"Come On\"]\n\nDuring the recording, Oldham, who was acting as producer, told the engineer not to mic up the piano. His plans didn't include Ian Stewart.\n\nNeither the group nor Oldham were particularly happy with the record -- the group because they felt it was too poppy, Oldham because it wasn't poppy enough. But they took the recording to Decca Records, where Dick Rowe, the man who had turned down the Beatles, eagerly signed them. The conventional story is that Rowe signed them after being told about them by George Harrison, but the other details of the story as it's usually told -- that they were judging a talent contest in Liverpool, which is the story in most Stones biographies, or that they were appearing together on Juke Box Jury, which is what Wikipedia and articles ripped off from Wikipedia say -- are false, and so it's likely that the story is made up.\n\nDecca wanted the Stones to rerecord the track, but after going to another studio with Easton instead of Oldham producing, the general consensus was that the first version should be released. The group got new suits for their first TV appearance, and it was when they turned up to collect the suits and found there were only five of them, not six, that Ian Stewart discovered Oldham had had him kicked out of the group, thinking he was too old and too ugly, and that six people was too many for a pop group.\n\nStewart was given the news by Brian Jones, and never really forgave either Jones or Oldham, but he remained loyal to the rest of the group. He became their road manager, and would continue to play piano with them on stage and in the studio for the next twenty-two years, until his death -- he just wasn't allowed in the photos or any TV appearances.\n\nThat wasn't the only change Oldham made -- he insisted that the group be called the Rolling Stones, with a g, not Rollin'. He also changed Keith Richards' surname, dropping the s to be more like Cliff, though Richards later changed it back again.\n\n\"Come On\" made number twenty-one in the charts, but the band were unsure of what to do as a follow-up single. Most of their repertoire consisted of hard blues songs, which were unlikely to have any chart success. Oldham convened the group for a rehearsal and they ran through possible songs -- nothing seemed right.\n\nOldham got depressed and went out for a walk, and happened to bump into John Lennon and Paul McCartney. They asked him what was up, and he explained that the group needed a song. Lennon and McCartney said they thought they could help, and came back to the rehearsal studio with Oldham. They played the Stones an idea that McCartney had been working on, which they thought might be OK for the group. The group said it would work, and Lennon and McCartney retreated to a corner, finished the song, and presented it to them.\n\nThe result became the Stones' second single, and another hit for them, this time reaching number twelve. The second single was produced by Easton, as Oldham, who is bipolar, was in a depressive phase and had gone off on holiday to try to get out of it:\n\n[Excerpt: The Rolling Stones, \"I Wanna Be Your Man\"]\n\nThe Beatles later recorded their own version of the song as an album track, giving it to Ringo to sing -- as Lennon said of the song, \"We weren't going to give them anything great, were we?\":\n\n[Excerpt: The Beatles, \"I Wanna Be Your Man\"]\n\nFor a B-side, the group did a song called \"Stoned\", which was clearly \"inspired\" by \"Green Onions\":\n\n[Excerpt: The Rolling Stones, \"Stoned\"]\n\nThat was credited to a group pseudonym, Nanker Phelge -- Nanker after a particular face that Jones and Richards enjoyed pulling, and Phelge after a flatmate of several of the band members, James Phelge.\n\nAs it was an original, by at least some definitions of the term original, it needed publishing, and Easton got the group signed to a publishing company with whom he had a deal, without consulting Oldham about it. When Oldham got back, he was furious, and that was the beginning of the end of Easton's time with the group.\n\nBut it was also the beginning of something else, because Oldham had had a realisation -- if you're going to make records you need songs, and you can't just expect to bump into Lennon and McCartney every time you need a new single.\n\nNo, the Rolling Stones were going to have to have some originals, and Andrew Loog Oldham was going to make them into writers. We'll see how that went in a few weeks' time, when we pick up on their career.",
  "enclosure": "",
  "itunes:summary": "Episode 108 of A History of Rock Music in Five Hundred Songs looks at \"I Wanna Be Your Man\" by the Rolling Stones and how the British blues scene of the early sixties was started by a trombone player.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on \"The Monkey Time\" by Major Lance.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\ni used a lot of resources for this episode. Information on Chris Barber comes from&nbsp;Jazz Me Blues: The Autobiography of Chris Barber by Barber and Alyn Shopton.\n\nInformation on Alexis Korner comes from&nbsp;Alexis Korner: The Biography by Harry Shapiro.\n\nTwo resources that I've used for this and all future Stones episodes --&nbsp;The Rolling Stones: All The Songs by Phillipe Margotin and Jean-Michel Guesden is an invaluable reference book, while&nbsp;Old Gods Almost Dead&nbsp;by Stephen Davis is the least inaccurate biography.\n\nI've also used Andrew Loog Oldham's autobiography&nbsp;Stoned, and Keith Richards'&nbsp;Life, though be warned that both casually use slurs.\n\nThis compilation contains Alexis Korner's pre-1963 electric blues material, while this contains the earlier skiffle and country blues music.\n\nThe live performances by Chris Barber and various blues legends I've used here come from volumes one and two of a three-CD series of these recordings.\n\nAnd  this three-CD set contains the A and B sides of all the Stones' singles up to 1971.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to look at a group who, more than any other band of the sixties, sum up what \"rock music\" means to most people. This is all the more surprising as when they started out they were vehemently opposed to being referred to as \"rock and roll\". We're going to look at the London blues scene of the early sixties, and how a music scene that was made up of people who thought of themselves as scholars of obscure music, going against commercialism ended up creating some of the most popular and commercial music ever made. We're going to look at the Rolling Stones, and at \"I Wanna Be Your Man\":\n\n[Excerpt: The Rolling Stones, \"I Wanna Be Your Man\"]\n\nThe Rolling Stones' story doesn't actually start with the Rolling Stones, and they won't be appearing until quite near the end of this episode, because to explain how they formed, I have to explain the British blues scene that they formed in.\n\nOne of the things people asked me when I first started doing the podcast was why I didn't cover people like Muddy Waters and Howlin' Wolf in the early episodes -- after all, most people now think that rock and roll started with those artists. It didn't, as I hope the last hundred or so episodes have shown. But those artists did become influential on its development, and that influence happened largely because of one man, Chris Barber.\n\nWe've seen Barber before, in a couple of episodes, but this, even more than his leading the band that brought Lonnie Donegan to fame, is where his influence on popular music really changes everything. On the face of it, Chris Barber seems like the last person in the world who one would expect to be responsible, at least indirectly, for some of the most rebellious popular music ever made. He is a trombone player from a background that is about as solidly respectable as one can imagine -- his parents were introduced to each other by the economist John Maynard Keynes, and his father, another economist, was not only offered a knighthood for his war work (he turned it down but accepted a CBE), but Clement Atlee lat",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 108 of A History of Rock Music in Five Hundred Songs looks at \"I Wanna Be Your Man\" by the Rolling Stones and how the British blues scene of the early sixties was started by a trombone player.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on \"The Monkey Time\" by Major Lance.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\ni used a lot of resources for this episode. Information on Chris Barber comes from&nbsp;Jazz Me Blues: The Autobiography of Chris Barber by Barber and Alyn Shopton.\n\nInformation on Alexis Korner comes from&nbsp;Alexis Korner: The Biography by Harry ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}