{
  "title": "Hunter Biden “Should Be In Prison!” Says Joe Biden",
  "itunes:title": "Hunter Biden “Should Be In Prison!” Says Joe Biden",
  "pubDate": "Fri, 15 Jul 2022 05:11:36 +0000",
  "guid": "8bd02bcf-e717-4f54-94e3-dfacaab8770d",
  "link": "https://thejimmydoreshow.libsyn.com/hunter-biden-should-be-in-prison-says-joe-biden",
  "itunes:image": "",
  "description": "<p>Hunter Biden is back in the news, this time as the victim of a hack revealing photos, videos and texts on his phone, and it’s all pretty damning. Biden is shown weighing his crack, smoking crack and engaging in other decidedly prurient acts. So what does Hunter’s father, President Joe Biden, think about all of this? There’s no comment from the White House after this most recent hack, but as Jimmy reveals, back in his Senate days Joe had plenty to say about what kind of punishment people like Hunter should face.<br /> <br /> Plus a segment on CNN's COVID fearmongering, labeling BA.5 the \"worst variant ever.\"<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger, Malcolm Fleschner and Mike MacRae! And phone calls from Joe Biden and the World Economic Forum's Klaus Schwab!</p>",
  "content:encoded": "<p>Hunter Biden is back in the news, this time as the victim of a hack revealing photos, videos and texts on his phone, and it’s all pretty damning. Biden is shown weighing his crack, smoking crack and engaging in other decidedly prurient acts. So what does Hunter’s father, President Joe Biden, think about all of this? There’s no comment from the White House after this most recent hack, but as Jimmy reveals, back in his Senate days Joe had plenty to say about what kind of punishment people like Hunter should face.  Plus a segment on CNN's COVID fearmongering, labeling BA.5 the \"worst variant ever.\"  Also featuring Stef Zamorano, Kurt Metzger, Malcolm Fleschner and Mike MacRae! And phone calls from Joe Biden and the World Economic Forum's Klaus Schwab!</p>",
  "enclosure": "",
  "itunes:duration": "57:04",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Hunter Biden is back in the news, this time as the victim of a hack revealing photos, videos and texts on his phone, and it’s all pretty damning. Biden is shown weighing his crack, smoking crack and engaging in other decidedly prurient acts. So what...",
  "itunes:episodeType": "full",
  "itunes:summary": "Hunter Biden is back in the news, this time as the victim of a hack revealing photos, videos and texts on his phone, and it’s all pretty damning. Biden is shown weighing his crack, smoking crack and engaging in other decidedly prurient acts. So what does Hunter’s father, President Joe Biden, think about all of this? There’s no comment from the White House after this most recent hack, but as Jimmy reveals, back in his Senate days Joe had plenty to say about what kind of punishment people like Hunter should face. Plus a segment on CNN's COVID fearmongering, labeling BA.5 the \"worst variant ever.\" Also featuring Stef Zamorano, Kurt Metzger, Malcolm Fleschner and Mike MacRae! And phone calls from Joe Biden and the World Economic Forum's Klaus Schwab!"
}