{
  "title": "Apple Kicks Off the Cell-Calls-From-Space Race",
  "link": "https://spectrum.ieee.org/5g-from-space-apple-spacex",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/man-talking-on-apple-smartphone.jpg?id=31529965&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>The race to deliver cellular calls from space passes two milestones this month and saw one major announcement last month. First, <a href=\"https://www.apple.com/iphone-14/\" target=\"_blank\">Apple will offer emergency satellite messaging on two of its latest iPhone models</a>, the company announced on Wednesday. Second, AST SpaceMobile plans a launch on Saturday, 10 September, of an experimental satellite to test full-fledged satellite 5G service. In addition, T-Mobile USA and SpaceX intend to offer their own messaging and limited data service via the second generation of SpaceX’s Starlink satellite constellation, as <a href=\"https://www.youtube.com/watch?v=Qzli-Ww26Qs\" rel=\"noopener noreferrer\" target=\"_blank\">the two companies announced on 25 August</a>. </p><p>Each contender is taking a different approach to space-based cellular service. The Apple offering <a href=\"https://www.lightreading.com/5g/globalstars-mystery-deepens/d/d-id/771369https://investors.globalstar.com/node/14431/html\" rel=\"noopener noreferrer\" target=\"_blank\">uses the existing satellite bandwidth</a> Globalstar once used for messaging offerings, but without the need for a satellite-specific handset. The AST project and another company, <a href=\"https://lynk.global/\" target=\"_blank\">Lynk Global</a>, would use a dedicated network of satellites with larger-than-normal antennas to produce a 4G, 5G, and someday 6G cellular signal compatible with any existing 4G-compatible phone (as detailed in <a href=\"https://spectrum.ieee.org/5g-satellite\" target=\"_blank\">other recent <em>IEEE</em> <em>Spectrum</em></a><a href=\"https://spectrum.ieee.org/5g-satellite\"> coverage</a> of space-based 5G offerings). Assuming regulatory approval is forthcoming, the technology would work first in equatorial regions and then across more of the planet as these providers expand their satellite constellations. T-Mobile and Starlink’s offering would work in the former PCS band in the United States. SpaceX, like AST and Lynk, would need to negotiate access to spectrum on a country-by-country basis.</p><p>Apple’s competitors are unlikely to see commercial operations before 2024.</p><p class=\"pull-quote\">“Regulators have not decided on the power limits from space, what concerns there are about interference, especially across national borders. There’s a whole bunch of regulatory issues that simply haven’t been thought about to date.”<br/>—Tim Farrar, telecommunications consultant</p><p>The T-Mobile–Starlink announcement is “in some ways an endorsement” of AST and Lynk’s proposition, and “in other ways a great threat,” says telecommunications consultant Tim Farrar of <a href=\"http://www.tmfassociates.com/Principals.html\" target=\"_blank\">Tim Farrar Associates</a> in Menlo Park, Calif. AST and Lynk have so far told investors they expect their national mobile network operator partners to charge per use or per day, but T-Mobile announced that they plan to include satellite messaging in the 1,900-megahertz range in their existing services. Apple said their Emergency SOS via Satellite service would be free the first two years for U.S. and Canadian iPhone 14 buyers, but did not say what it would cost after that. For now, the Globalstar satellites it is using cannot offer the kind of broadband bandwidth AST has promised, but Globalstar has reported to investors orders for new satellites that might offer new capabilities, including new gateways.</p><p>Even under the best conditions—a clear view of the sky—users will need 15 seconds to send a message via Apple’s service. They will also have to follow onscreen guidance to keep the device pointed at the satellites they are using. Light foliage can cause the same message to take more than a minute to send. Ashley Williams, a satellite engineer at Apple who recorded the service’s announcement, also mentioned a data-compression algorithm and a series of rescue-related suggested auto-replies intended to minimize the amount of data that users would need to send during a rescue.</p><p>Meanwhile, AST SpaceMobile says it aims to launch an experimental satellite Saturday, 10 September, to test its cellular broadband offering.</p><p>Last month’s T-Mobile-SpaceX <a href=\"https://www.t-mobile.com/news/un-carrier/t-mobile-takes-coverage-above-and-beyond-with-spacex\" target=\"_blank\">announcement</a> “helped the world focus attention on the huge market opportunity for SpaceMobile, the only planned space-based cellular broadband network. BlueWalker 3, which has a 693 sq ft array, is scheduled for launch within weeks!” <a href=\"https://twitter.com/AbelAvellan/status/1562987060977614848?s=20&t=0CE866Ew1r_F2YjDQCR77Q\" rel=\"noopener noreferrer\" target=\"_blank\">tweeted</a> AST SpaceMobile CEO Abel Avellan on 25 August. The size of the array matters because AST SpaceMobile has so far indicated in its applications for experimental satellite licenses that it intends to use lower radio frequencies (700–900 MHz) with less propagation loss but that require antennas much larger than conventional satellites carry.</p><p>The size of the array will also make it more reflective, which has raised concerns among astronomers. The size of Starlink’s planned constellation has already provoked complaints among astronomers because it will interfere with their ability to observe space. <em>Sky & Telescope</em> magazine <a href=\"https://skyandtelescope.org/astronomy-news/as-bluewalker-satellites-join-a-brightening-sky-heres-how-you-can-help/\" rel=\"noopener noreferrer\" target=\"_blank\">published on 1 September a call</a> for both professional and amateur astronomers to observe the growing constellations of satellites to document the interference. Professional astronomy societies have <a href=\"https://aas.org/posts/advocacy/2021/08/impacts-large-satellite-constellations-astronomy-live-updates\" rel=\"noopener noreferrer\" target=\"_blank\">lobbied U.S. government agencies and Congress on the issue and met with SpaceX officials in May to discuss a recent change that brightened satellites by 0.5 visual magnitudes</a>. </p><p>So far government agencies have issued licenses for thousands of low-Earth-orbiting satellites, which have the biggest impact on astronomers. Even with the constellations starting to form, satellite-cellular telecommunications companies are still open to big regulatory risks. “Regulators have not decided on the power limits from space, what concerns there are about interference, especially across national borders. There’s a whole bunch of regulatory issues that simply haven’t been thought about to date,” Farrar says.</p><p>For a hiker with a twisted ankle, a messaging service that takes a while to connect and twinkles in and out of service as satellites fly by may be better than nothing, but early space-based cellular <a href=\"https://frankrayal.com/2022/08/29/t-mobile-spacex-direct-satellite-to-handset-service-lots-of-hype-and-little-reality/\" target=\"_blank\">will not be a seamless way to connect to video calls from out at sea</a>.</p><p>“User cooperation is in my view the single most critical aspect of whether this service will attract mass-market usage or people willing to pay a significant amount for this service,” Farrar says.</p>",
  "pubDate": "Thu, 08 Sep 2022 14:18:38 +0000",
  "guid": "https://spectrum.ieee.org/5g-from-space-apple-spacex",
  "category": [
    "5g",
    "Satellite broadband",
    "Apple",
    "Spacex"
  ],
  "dc:creator": "Lucas Laursen",
  "media:content": ""
}