{
  "title": "We Need More Than Just Electric Vehicles",
  "link": "https://spectrum.ieee.org/electric-cars-2657880896",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-worker-works-on-the-frame-of-a-car-on-an-assembly-line.jpg?id=31044266&width=1200&height=800&coordinates=0%2C107%2C0%2C107\"/><br/><br/><p>\n<strong>EVs have finally come of age. </strong>The total cost of purchasing and driving one—the cost of ownership—has fallen <a href=\"https://www.cer-rec.gc.ca/en/data-analysis/energy-markets/market-snapshots/2019/market-snapshot-levelized-costs-driving-evs-conventional-vehicles.html\" target=\"_blank\">nearly to parity</a> with a typical gasoline-fueled car. Scientists and engineers have extended the range of EVs by cramming ever more energy into their batteries, and vehicle-charging networks have expanded in many countries. In the United States, for example, there are <a href=\"https://afdc.energy.gov/fuels/electricity_locations.html#/find/nearest?fuel=ELEC&country=US\" target=\"_blank\">more than 49,000 public charging stations</a>, and it is now possible to <a href=\"https://www.jdpower.com/cars/shopping-guides/can-you-drive-an-electric-car-across-the-country\" target=\"_blank\">drive an EV</a> from New York to California using public charging networks.\n</p><p>\n\tWith all this, consumers and policymakers alike are hopeful that society will soon greatly reduce its carbon emissions by replacing today’s cars with electric vehicles. Indeed, adopting electric vehicles will go a long way in helping to improve environmental outcomes. But EVs come with important weaknesses, and so people shouldn’t count on them alone to do the job, even for the transportation sector.\n</p><hr/><p>\n\tWhy not? EVs lack tailpipe emissions, sure, but producing, operating, and disposing of these vehicles creates greenhouse-gas emissions and other environmental burdens. Driving an EV pushes these problems upstream, to the factory where the vehicle is made and beyond, as well as to the power plant where the electricity is generated. The entire life cycle of the vehicle must be considered, from cradle to grave. When you do that, the promise of electric vehicles doesn’t shine quite as brightly. Here we’ll show you in greater detail why that is.\n</p><p>\n<strong>The life cycle to which we refer </strong>has two parts: The vehicle cycle begins with mining the raw materials, refining them, turning them into components, and assembling them. It ends years later with salvaging what can be saved and disposing of what remains. Then there is the fuel cycle—the activities associated with producing and using the fuel or electricity to power the vehicle through its working life.\n</p><p>\n\tFor EVs, much of the environmental burden centers on the production of batteries, the most energy- and resource-intensive component of the vehicle. Each stage in production matters—mining, refining, and producing the raw materials, manufacturing the components, and finally assembling them into cells and battery packs.\n</p><p>\n\tWhere all this happens matters, too, because a battery factory uses a lot of electricity, and the source for that electricity varies from one region to the next. Manufacturing an EV battery using coal-based electricity results in more than three times the greenhouse-gas emissions of manufacturing a battery with electricity from renewable sources. And about \n\t<a href=\"https://www.spglobal.com/marketintelligence/en/news-insights/blog/top-electric-vehicle-markets-dominate-lithium-ion-battery-capacity-growth\" target=\"_blank\">70 percent</a> of lithium-ion batteries are produced in China, which derived <a href=\"https://www.iea.org/data-and-statistics/data-browser?country=CHINA&fuel=Electricity%20and%20heat&indicator=ElecGenByFuel\" target=\"_blank\">64 percent</a> of its electricity from coal in 2020.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A worker inspects rows of electric vehicle batteries.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"a25d298959339a1133e766c836a8edd9\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"bb46a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-worker-inspects-rows-of-electric-vehicle-batteries.jpg?id=31044309&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The manufacture of lithium batteries for EVs, like those shown here, is energy intensive, as is the mining and refining of the raw materials. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">AFP/Getty Images</small>\n</p><p>\n\tMost automotive manufacturers say they plan to use renewable energy in the future, but for now, most battery production relies on electric grids largely powered by fossil fuels. \n\t<a href=\"https://econpapers.repec.org/article/natnatcli/v_3a10_3ay_3a2020_3ai_3a12_3ad_3a10.1038_5fs41558-020-00921-7.htm\" target=\"_blank\">Our 2020 study</a>, published in <em>Nature Climate Change</em>, found that manufacturing a typical EV sold in the United States in 2018 emitted about 7 to 12 tonnes of carbon dioxide, compared with about 5 to 6 tonnes for a gasoline-fueled vehicle.\n</p><p>\n\tYou also must consider the electricity that charges the vehicle. In 2019, \n\t<a href=\"https://ourworldindata.org/electricity-mix\" target=\"_blank\">63 percent of global electricity</a> was produced from fossil-fuel sources, the exact nature of which varies substantially among regions. China, using largely coal-based electricity, had <a href=\"https://iea.blob.core.windows.net/assets/ad8fb04c-4f75-42fc-973a-6e54c8a4449a/GlobalElectricVehicleOutlook2022.pdf\" target=\"_blank\">6 million EVs</a> in 2021, constituting the largest total stock of EVs in the world.\n</p><p>\n\tBut coal use varies, even within China. The southwest province of Yunnan derives about 70 percent of its electricity from hydropower, slightly more than the percentage in Washington state, while Shandong, a coastal province in the east, derives about 90 percent of its electricity from coal, similar to West Virginia.\n</p><p>\n\tNorway has the highest per capita number of EVs, which represented \n\t<a href=\"https://insideevs.com/news/558447/norway-plugin-car-sales-december2021/\" target=\"_blank\">more than 86 percent</a> of vehicle sales in that country in 2021. And it produces almost all its electricity from hydro and solar. Therefore, an EV operated in Shandong imposes a much bigger environmental burden than that same EV would in Yunnan or Norway.\n</p><p>\n\tThe United States falls somewhere in the middle, deriving \n\t<a href=\"https://www.eia.gov/tools/faqs/faq.php?id=427\" target=\"_blank\">about 60 percent of its electricity</a> from fossil fuels, primarily natural gas, which produces less carbon than coal does. In our model, using electricity from the 2019 U.S. grid to charge a typical 2018 EV would produce between 80 and 120 grams of carbon dioxide per kilometer traveled, compared with about 240 to 320 g/km for a gasoline vehicle. Credit the EV’s advantage to its greater efficiency in the conversion of chemical energy to motion—77 percent, compared with 12 to 30 percent for a gasoline car—along with the potential to generate electricity using low-carbon sources. That’s why operating EVs typically releases less carbon than operating gasoline vehicles of similar size, even in coal-heavy grids like Shandong or West Virginia.\n</p><p class=\"pull-quote\">\n\tAn EV operated in Shandong or West Virginia emits about 6 percent \n\t<i>more</i> greenhouse gas over its lifetime than does a conventional gasoline vehicle of the same size. An EV operated in Yunnan emits about 60 percent less.\n</p><p>\n\tBut when you factor in the greenhouse-gas emissions associated with vehicle manufacture, the calculus changes. As an illustration, an EV operated in Shandong or West Virginia emits about 6 percent \n\t<em>more</em> greenhouse gas over its lifetime than does a conventional gasoline vehicle of the same size. An EV operated in Yunnan emits about 60 percent less.<br/>\n</p><p>\n<strong>Can EVs</strong> be good enough—and can manufacturers roll them out fast enough—to meet the goals set in 2021 by the 26th United Nations Climate Change Conference (COP26)? The <a href=\"https://unric.org/en/cop26-a-snapshot-of-the-agreement/\" target=\"_blank\">197 signatory nations agreed</a> to hold the increase in the average global temperature to no more than 2 °C above preindustrial levels and to pursue efforts to limit the increase to 1.5 °C.\n</p><p>\n\tOur \n\t<a href=\"https://www.nature.com/articles/s41558-020-00921-7\" target=\"_blank\">analysis</a> shows that to bring the United States into line with even the more modest 2-degree goal would require electrifying about 90 percent of the U.S. passenger-vehicle fleet by 2050—some 350 million vehicles.\n</p><p>\n\tTo arrive at this number, we first had to decide on an appropriate carbon budget for the U.S. fleet. Increases in global average temperature are largely proportional to cumulative global emissions of carbon dioxide and other greenhouse gases. Climate scientists use this fact to set a limit on the total amount of carbon dioxide that can be emitted before the world surpasses the 2-degree goal; this amount constitutes the global carbon budget.\n</p><p>\n\tWe then used results from a model of the global economy to allocate a portion of this global budget specifically to the U.S. passenger-vehicle fleet over the period between 2015 and 2050. This portion came out to around 45 billion tonnes of carbon dioxide, roughly equivalent to a single year of global greenhouse-gas emissions.\n</p><div class=\"ieee-factbox-left\">\n<h3>6 million</h3>\n<p>\nNumber of EVs on the road in China in 2021\n\t</p>\n</div><p>\n\tThis is a generous allowance, but that’s reasonable because transportation is harder to decarbonize than many other sectors. Even so, working within that budget would require a 30 percent reduction in the projected cumulative emissions from 2015 to 2050 and a 70 percent reduction in annual emissions in 2050, compared with the business-as-usual emissions expected in a world without EVs.\n</p><p>\n\tNext, we turned to our model of the U.S fleet of light vehicles. Our model simulates for each year from 2015 to 2050 how many new vehicles are manufactured and sold, how many are scrapped, and the associated greenhouse-gas emissions. We also keep track of how many vehicles are on the road, when they were made, and how far they are likely to drive. We used this information to estimate annual greenhouse-gas emissions from the fuel cycle, which depend partly on the average vehicle size and partly on how much vehicle efficiency improves over time.\n</p><p>\n\tFinally, we compared the carbon budget with our model of total cumulative emissions (that is, both vehicle-cycle and fuel-cycle emissions). We then systematically increased the share of EVs among new vehicle sales until the cumulative fleet emissions fell within the budget. The result: EVs had to make up the vast majority of vehicles on the road by 2050, which means they must make up the vast majority of vehicle sales a decade or more earlier.\n\t<br/>\n</p><p>\n\tThat would require a dramatic increase in EV sales: In the United States in 2021, just over 1 million vehicles—less than 1 percent of those on the road—were fully electric. And only 3 percent of the new vehicles sold were fully electric. Considering the long lifetime of a vehicle, about 12 years in the United States, we would need to ramp up sales of EVs dramatically starting now to meet the 2-degree target. In our model, over 10 percent of all new vehicles sold by 2020 would have had to be electric, rising above half by 2030, and essentially all by 2035. Studies conducted in other countries, such as China and Singapore, have arrived at similar results.\n</p><p class=\"pull-quote\">\n\tOur analysis shows that to bring the United States into line with even the more modest 2-degree goal would require electrifying about 90 percent of the U.S. passenger-vehicle fleet by 2050—some 350 million vehicles.\n</p><p>\n\tThe good news is that 2035 is the year suggested at the COP26 for all new cars and vans in leading markets to be zero-emissions vehicles, and many manufacturers and governments have committed to it. The bad news is that some major automotive markets, such as China and the United States, have not yet made that pledge, and the United States has already missed the 10 percent sales share for 2020 that our study recommended. Of course, meeting the more ambitious 1.5 °C climate target would require even larger-scale deployment of EVs and therefore earlier deadlines for meeting these targets.\n</p><p>\n<strong>It’s a tall order</strong>, and a costly one, to make and sell so many EVs so soon. Even if that were possible, there would also have to be an enormous increase in charging infrastructure and in material supply chains. And that much more vehicle charging would then put great pressure on our electricity grids.\n</p><p>\n\tCharging matters, because one of the commonly cited obstacles to EV adoption is range anxiety. Shorter-range EVs, like the Nissan Leaf, have a manufacturer’s \n\t<a href=\"https://www.nissanusa.com/vehicles/electric-cars/leaf/features/range-charging-battery.html\" target=\"_blank\">reported range</a> of just 240 km, although a 360-km model is also available. Longer-range EVs, like the Tesla Model 3 Long Range, have a manufacturer’s reported range of 600 km. The shorter driving ranges of most EVs are no problem for daily commutes, but range anxiety is real for longer trips, especially in cold weather, which can cut driving ranges substantially due to the energy demand of heating the cabin and lower battery capacity.\n</p><p>\n\tMost EV owners recharge their cars at home or at work, meaning that chargers need to be available in garages, driveways, on-street parking, apartment-building parking areas, and commercial parking lots. A couple of hours at home is sufficient to recharge from a typical daily commute, while overnight charging is needed for longer trips. In contrast, public charging stations that use fast charging can add several hundred kilometers of range in 15 to 30 minutes. This is an impressive feat, but it still takes longer than refilling a gas tank.\n</p><p>\n\tAnother barrier to the adoption of EVs is the price, which is largely a function of the cost of the batteries, which make the purchase price 25 to 70 percent higher than that of an equivalent conventional vehicle. Governments have offered subsidies or tax rebates to make EVs more appealing, a policy which the U.S. Inflation Reduction Act has just augmented. But such measures, while easy enough to implement in the early days of a new technology, would become prohibitively expensive as EV sales mount.\n</p><p>\n\tAlthough EV battery costs have fallen dramatically over the past decade, the International Energy Agency is projecting a \n\t<a href=\"https://www.iea.org/reports/global-ev-outlook-2022/executive-summary\" target=\"_blank\">sudden reversal</a> of that trend in 2022 due to increases in prices of critical metals and a surge in demand for EVs. While projections of future prices vary, highly cited long-term projections from <a href=\"https://about.bnef.com/blog/the-ev-price-gap-narrows/\" target=\"_blank\">BloombergNEF</a> suggest the cost of new EVs will reach price parity with conventional vehicles by 2026, even without government subsidies. In the meantime, EV buyers’ sticker shock could be alleviated by the knowledge that fuel and maintenance costs are far lower for EVs and that total ownership costs are about the same.\n</p><h3>1,700 terawatt-hours per year</h3><br/><p>Additional electricity needed to electrify 90 percent of U.S. passenger vehicles  </p><p>\n\tBut what drivers gain, governments might lose. The International Energy Agency \n\t<a href=\"https://iea.blob.core.windows.net/assets/ed5f4484-f556-4110-8c5c-4ede8bcba637/GlobalEVOutlook2021.pdf\" target=\"_blank\">estimates</a> that by 2030 the deployment of EVs could cut global receipts from fossil-fuel taxes by around US $55 billion. Those tax revenues are necessary for the maintenance of roads. To make up for their loss, governments will need some other source of revenue, such as vehicle registration fees.\n</p><p>\n<span style=\"background-color: initial;\"><strong>The growth in the number </strong></span><span style=\"background-color: initial;\">of EVs introduces various other challenges, too, not the least of which are the greater demands placed on material</span> <span style=\"background-color: initial;\">supply chains for </span><span style=\"background-color: initial;\">EV</span> batteries and electricity grids. Batteries require raw materials such as lithium, copper, nickel, cobalt, manganese, and graphite. Some of these materials are highly concentrated in a few countries.<br/>\n</p><p>\n\tFor example, the Democratic Republic of Congo (DRC) holds about 50 percent of the world’s cobalt reserves. Just two countries—Chile and Australia—account for over two-thirds of global lithium reserves, and South Africa, Brazil, Ukraine, and Australia have almost all the manganese reserves. This concentration is problematic because it can lead to volatile markets and supply disruptions.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Miners move large bags at a cobalt mine.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"6df1fad56200185a03434ff0320005b5\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"af1c4\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/miners-move-large-bags-at-a-cobalt-mine.jpg?id=31044395&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Cobalt mining for batteries in the Democratic Republic of Congo has been linked to water-quality problems, armed conflicts, child labor, respiratory disease, and birth defects.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Sebastian Meyer/Corbis/Getty Images</small>\n</p><p>\n\tThe COVID pandemic has shown just what supply-chain disruptions can do to other products dependent on scarce materials, notably semiconductors, the shortage of which has forced several automotive manufacturers to stop producing vehicles. It is unclear whether suppliers will be able to meet the future demand for some critical raw materials for electric batteries. Market forces may lead to innovations that will increase the supplies of these materials or reduce the need for them. But for now, the implications for the future are not at all obvious.\n</p><p>\n\tThe scarcity of these materials reflects not only the varying endowment of various countries but also the social and environmental consequences of extraction and production. The presence of cobalt mines in the DRC, for example, reduced water quality and expanded armed conflicts, child labor, respiratory disease, and birth defects. International regulatory frameworks must therefore not only protect supply chains from disruption but also protect human rights and the environment.\n</p><p>\n\tSome of the problems in securing raw material could be mitigated by new battery chemistries—several manufacturers have announced plans to switch to lithium iron phosphate batteries, which are cobalt free—or battery-recycling programs. But neither option totally removes supply-chain or socio-environmental concerns.\n</p><p>\n\tThat leaves the electricity grid. We estimate that electrifying 90 percent of the U.S. light-duty passenger fleet by 2050 would raise demand for electricity by up to 1,700 terawatt-hours per year—41 percent of U.S. electricity generation in 2021. This additional new demand would greatly change the shape of the consumption curve over daily and weekly periods, which means the grid and its supply would have to be remodeled accordingly.\n</p><p>\n\tAnd because the entire point of EVs is to replace fossil fuels, the grid would need more renewable sources of energy, which typically generate energy intermittently. To smooth out the supply and ensure reliability, the grid will need to add energy-storage capacity, perhaps in the form of \n\t<a href=\"https://spectrum.ieee.org/vehicle-to-grid\" target=\"_self\">vehicle-to-grid technologies</a> that exploit the installed base of EV batteries. Varying the price of electricity throughout the day could also help to flatten the demand curve.\n</p><p>\n<strong>All said, EVs present both a</strong> challenge and an opportunity. The challenge could be hard to manage if EVs are deployed too rapidly—but rapid deployment is exactly what is needed to meet climate targets. These hurdles can be overcome, but they cannot be ignored: In the end, the climate crisis will require us to electrify road transport. But this step alone cannot solve our environmental woes. We need to pursue other strategies.\n</p><p>\n\tWe should try as much as possible, for example, to avoid motorized travel by cutting the frequency and length of car trips through better urban planning. Promoting mixed-use neighborhoods—areas that put work and residence in proximity—would allow more bicycling and walking.\n</p><p>\n\tBetween 2007 and 2011, the city of Seville built an \n\t<a href=\"https://www.euronews.com/2018/10/12/seville-how-a-small-spanish-city-became-a-cycling-hub-for-all-view\" target=\"_blank\">extensive cycling network</a>, increasing the number of daily bike trips from about 13,000 to more than 70,000—or 6 percent of all trips. In Copenhagen, cycling accounts for <a href=\"https://www.visitdenmark.com/press/latest-news/facts-and-figures-cycling-denmark\" target=\"_blank\">16 percent of all trips</a>. Cities around the world are experimenting with a wide range of other supporting initiatives, such as Barcelona’s <a href=\"https://www.citiesforum.org/news/superblock-superilla-barcelona-a-city-redefined/\" target=\"_blank\">superblocks</a>, regions smaller than a neighborhood that are designed to be hospitable to walking and cycling. Congestion charges have been levied in Stockholm and London to limit car traffic. Paris has gone further, with a forthcoming private-vehicle ban. Taken together, changes in urban form can reduce transport energy demand by 25 percent, according to a recent installment of the <a href=\"https://www.ipcc.ch/assessment-report/ar6/\" target=\"_blank\">Sixth Assessment </a>Report from the Intergovernmental Panel on Climate Change.\n</p><p>\n\tWe should also shift from using cars, which often have just one person inside, to less energy-intensive modes of travel, such as public transit. Ridership on buses and trains can be increased by improving connectivity, frequency, and reliability. Regional rail could supplant much intercity driving. At high occupancy, buses and trains can typically keep their emissions to below 50 grams of carbon dioxide per person per kilometer, even when powered by fossil fuels. In electrified modes, these emissions can drop to a fifth as much.\n</p><p>\n\tBetween 2009 and 2019, Singapore’s investment in mass rapid transit helped reduce the share of private vehicle transport from 45 percent to 36 percent. From 1990 to 2015, Paris slashed vehicle travel by 45 percent through sustained investment in both public transit and active transit infrastructure.\n</p><p>\n\tImplementing these complementary strategies could ease the transition to EVs considerably. We shouldn’t forget that addressing the climate crisis requires more than just technology fixes. It also demands individual and collective action. EVs will be a huge help, but we shouldn’t expect them to do the job alone. \n\t<span class=\"ieee-end-mark\"></span>\n</p><p><em>This article appears in the November 2022 print issue as “The Electric Vehicle Is Not Enough.”</em></p>",
  "pubDate": "Sat, 20 Aug 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/electric-cars-2657880896",
  "category": [
    "Ev lifecycle",
    "Electric vehicles",
    "Climate change",
    "Co2 emissions",
    "Greenhouse gases"
  ],
  "dc:creator": "Heather L. MacLean",
  "media:content": ""
}