{
  "title": "Weeknote (dtype-diet)",
  "link": "https://ianozsvald.com/2020/06/02/weeknote-dtype-diet/",
  "dc:creator": "Ian",
  "pubDate": "Tue, 02 Jun 2020 17:16:29 +0000",
  "category": [
    "Data science",
    "Week notes"
  ],
  "guid": "https://ianozsvald.com/?p=3857",
  "description": "Over the weekend I hacked on dtype_diet &#8211; a tool for Pandas users that checks their DataFrame to see if smaller datatypes might be applicable. If so they&#8217;d offer no data loss and a reduction in RAM, for Categorical data there&#8217;s also the possibility of faster calculations. This tool makes no changes, it recommends the [&#8230;]",
  "content:encoded": "<p>Over the weekend I hacked on <a href=\"https://github.com/ianozsvald/dtype_diet/\">dtype_diet</a> &#8211; a tool for Pandas users that checks their DataFrame to see if smaller datatypes might be applicable. If so they&#8217;d offer no data loss and a reduction in RAM, for Categorical data there&#8217;s also the possibility of faster calculations. This tool makes no changes, it recommends the code you might copy into your project. I developed this as one of the ideas I didn&#8217;t get around to building whilst I was working on my book, but since that&#8217;s now published&#8230;</p>\n<p>Talking of which &#8211; Micha and I have cleaned up our profiles on Amazon and Goodreads for High Performance Python 2nd ed. It is a pity we can&#8217;t do any book signings at events (seeing as we won&#8217;t have physical events for a while!). One thing I might do via my &#8220;<a href=\"https://ianozsvald.com/data-science-jobs/\">thoughts & jobs</a>&#8221; email list is to organise a Friday &#8220;coffee morning&#8221; to chat with whoever turns up about high performance Python and other subjects.</p>\n<p>I&#8217;ve also learned that if I make a 1kg sourdough dough, immediately after kneading I can put 0.5kg into the fridge and 4 days later it cooks just fine. This is a nice refinement. I&#8217;m now interspersing buying fresh bread (for variety and convenience) with making my own and it feels like a more sustainable practice.</p>\n<p>All going well I&#8217;ll be talking this month at PyDataAmsterdam and next month at EuroPython on higher performance Python and Pandas, I figure the dtype_diet tool will fit in nicely with a discussion about the new Pandas dtypes and their benefits over numpy dtypes.</p>\n<hr>\nIan is a Chief Interim Data Scientist via his <a href=http://morconsulting.com>Mor Consulting</a>. Sign-up for <a href=http://eepurl.com/Z44HT>Data Science tutorials in London</a> and to hear about his <a href=https://ianozsvald.com/data-science-jobs/>data science thoughts and jobs</a>. He lives in London, is walked by his high energy Springer Spaniel and is a consumer of fine coffees."
}