{
  "title": "U.S. offers $5 million for info on North Korean smuggling",
  "description": "Singaporean national Kwek Kee Seng is accused of helping North Korea evade sanctions.",
  "link": "https://www.rfa.org/english/news/korea/north-korea-reward-11042022093851.html",
  "guid": "https://www.rfa.org/english/news/korea/north-korea-reward-11042022093851.html",
  "author": "Alex Willemyns for RFA",
  "media:content": {
    "media:description": "In 2020, Cambodian authorities seized the oil tanker M/T Courageous and handed it over to the United States. The U.S. Department of Justice said satellite images showed the vessel transferring $1.5 million worth of oil to a North Korean ship.",
    "media:credit": "AFP/U.S. Department of Justice"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">The United States is offering a $5 million reward for information about a smuggling operation run by Singaporean businessman Kwek Kee Seng to ship luxury goods, money, petrol and weapon-making materials to North Korea in violation of U.N. Security Council sanctions.</span></p>\n<p><span style=\"font-weight: 400;\">Kwek is responsible for delivering oil shipments to North Korea in exchange for funds laundered through shell companies based in Panama and Singapore, and had a federal arrest warrant issued in April 2021, says a statement from the U.S. State Department on Thursday.</span></p>\n<p><span style=\"font-weight: 400;\">“Kwek Kee Seng has directed the delivery of petroleum products directly to the DPRK as well as ship-to-ship transfers of fuel destined for the DPRK using one of Kwek’s oil tankers,” the State Department said, using an acronym for North Korea’s government. It added that “Kwek and his co-conspirators sought to obscure their identities.” </span></p>\n<p><span style=\"font-weight: 400;\">Cambodian authorities in 2020 </span><a href=\"https://www.aljazeera.com/news/2021/7/31/us-seizes-tanker-used-to-evade-north-korea\"><span style=\"font-weight: 400;\">seized a ship</span></a><span style=\"font-weight: 400;\"> operated by one of Kwek’s companies and handed it over to the United States, with the U.S. Department of Justice saying at the time that satellite images showed the vessel transferring $1.5 million worth of oil to a North Korean ship.</span></p>\n<figure><img alt=\"ENG_KOR_Smuggling_reward_11032022.2.jpg\" class=\"image-richtext image-inline\" src=\"https://www.rfa.org/english/news/korea/north-korea-reward-11042022093851.html/eng_kor_smuggling_reward_11032022-2.jpg/@@images/eb4813f0-ece3-4d80-8565-9066d6ec12bd.jpeg\" title=\"ENG_KOR_Smuggling_reward_11032022.2.jpg\"/>\n<figcaption>The Biden administration is offering a reward of up to $5 million for information about Kwek Kee Seng, a Singapore-based businessman previously accused by the Justice Department of facilitating fuel shipments to North Korea in violation of U.N. sanctions. (FBI via Associated Press)</figcaption>\n</figure>\n<p><span style=\"font-weight: 400;\">The U.S. Treasury Department last month </span><a href=\"https://home.treasury.gov/news/press-releases/jy1000\"><span style=\"font-weight: 400;\">cited</span></a><span style=\"font-weight: 400;\"> Kwek as a key player in what it called an “international evasion network” that helps to smuggle fuel into North Korea, which it said “directly supports the development of DPRK weapons programs and its military,” including missile launches.</span></p>\n<p><span style=\"font-weight: 400;\">The $5 million reward comes amid a renewed round of missile testing from North Korea, with Pyongyang </span><a href=\"https://www.rfa.org/english/news/korea/missiles-11022022125243.html\"><span style=\"font-weight: 400;\">firing some 26 missiles</span></a><span style=\"font-weight: 400;\">, as well as a possibly failed intercontinental ballistic missile, into waters near South Korea and Japan this week, also in violation of U.N. sanctions.</span></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 09:40:00 -0400"
}