{
  "id": "yt:video:AUAEBjlROWQ",
  "yt:videoId": "AUAEBjlROWQ",
  "yt:channelId": "UCzR-rom72PHN9Zg7RML9EbA",
  "title": "Where Did Water Come From?",
  "link": "",
  "author": {
    "name": "PBS Eons",
    "uri": "https://www.youtube.com/channel/UCzR-rom72PHN9Zg7RML9EbA"
  },
  "published": "2022-09-27T20:38:04+00:00",
  "updated": "2022-10-02T23:21:20+00:00",
  "media:group": {
    "media:title": "Where Did Water Come From?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Mercury, Venus, and Mars are all super low on water – so where did ours come from and why do we have so much of it? We think our water came from a few unlikely sources: meteorites, space dust, and even the sun.\n\n*****\nPBS Member Stations rely on viewers like you. To support your local station, go to http://to.pbs.org/DonateEons\n*****\n\nProduced by Complexly for PBS Digital Studios\n\nSuper special thanks to the following Patreon patrons for helping make Eons possible:\nAmanda Ward, Avery Sanford, Hillary Ryde-Collins, Stephanie Tan, Stephen Patterson, Mark Foster, Karen Farrell, Trevor Long, Raphael Haase, daniel blankstein, Roberto Adrian Ramirez Flores, Jason Rostoker, Jonathan Rust, Mary Tevington, Bart & Elke van Iersel - De Jong, William Craig II, James Dowling-Healey, Irene Wood, Derek Helling, WilCatRhClPPh33, Mark Talbott-Williams, Nomi Alchin, Eric Roberto Rodriguez, Yu Mei, Dan Ritter, 4th_phase, Jayme Coyle, Albert Folsom, Oscar Amoros Huguet, Patrick Wells, Dan Caffee, Nick Ryhajlo, Sean Dennis, Michael McClellan, Tsee Lee, Robert Hill, Ben Cooper, Matt Parker, Jerrit Erickson, MissyElliottSmith, Stefan Weber, Merri Snaidman, Gabriel Cortez, Marcus Lejon, Todd Dittman, Betsy Radley, Anthony, Philip Slingerland, John Vanek, Eric Vonk, Jon Monteiro, James Bording, Miles Chaston, Jeff Graham, Daisuke Goto, Gregory Kintz, Chandler Bass\nIf you'd like to support the channel, head over to http://patreon.com/eons and pledge for some cool rewards!\n\nWant to follow Eons elsewhere on the internet?\nFacebook - https://www.facebook.com/eonsshow\nTwitter - https://twitter.com/eonsshow\nInstagram - https://www.instagram.com/eonsshow/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}