{
  "id": "yt:video:Bra5gExyPbY",
  "yt:videoId": "Bra5gExyPbY",
  "yt:channelId": "UCdZcGRaBV-VRRyU4t6Ur0mw",
  "title": "How Can Sentences Work Like Adjectives? The Syntax and Semantics of Relative Clauses",
  "link": "",
  "author": {
    "name": "The Ling Space",
    "uri": "https://www.youtube.com/channel/UCdZcGRaBV-VRRyU4t6Ur0mw"
  },
  "published": "2017-06-01T18:54:30+00:00",
  "updated": "2022-10-28T10:49:07+00:00",
  "media:group": {
    "media:title": "How Can Sentences Work Like Adjectives? The Syntax and Semantics of Relative Clauses",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We can put whole clauses inside other phrases, but what does that do to their structure and their meaning? In this week's episode, we take a look at the syntax and semantics of relative clauses: how these clauses kind of look like adjectives; how using them creates islands from which words can't escape; and how moving things around in them throws semantic variables into the sentence setup.\n\nThis is Topic #89!\n\nThis week's tag language: Tajik!\n\nRelated videos:\nWhat's the Structure Behind a Sentence? X' Theory: https://youtu.be/7UOcoQr0hvg\nHow Do We Build Meaning with Math? Set Theory and Adjectives: https://youtu.be/M96aiDk2ePw\nWhat Questions Can't We Ask? Syntactic Islands: https://youtu.be/01uH4XfJx3g\n\nLast episode:\nHow Do Verbs Cause Things? Splitting the Verb Phrase: https://youtu.be/lY1X2BnjmNI\n\nOther of our syntax videos:\nHow Can We Tell What Roles Nouns Play? Case Theory: https://youtu.be/8Xi81H80J-w\nWhat Changes in a Sentence When We Swap Verbs? Raising and Control Verbs: https://youtu.be/SYoYNeaSYrU\nHow Do Pronouns Even Work? Binding Theory: https://youtu.be/9sqm_cex4kA\n\nOur website also has extra content about this week's topic, on other kinds of relative clauses, at: http://www.thelingspace.com/episode-89/\n\nFind us on all the social media worlds:\nTumblr: http://thelingspace.tumblr.com/\nTwitter: http://twitter.com/TheLingSpace\nFacebook: http://www.facebook.com/thelingspace/\n\nAnd at our website, http://www.thelingspace.com/ !\nYou can also find our store at the website, https://thelingspace.storenvy.com/\n\nWe also have forums to discuss this episode, and linguistics more generally.\n\nSources:\nMuch of the material in this week's episode is based on Semantics in Generative Grammar, by Irene Heim and Angelika Kratzer.\n\nThe material's also well-covered in Elizabeth Coppock's Semantics Boot Camp (http://eecoppock.info/semantics-boot-camp.pdf), and Anders Schoubye's Formal Semantics Notes (http://schoubye.org/teaching/Formal-Semantics/FormalSemanticsNotes2014.pdf).\n\nLooking forward to next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}