{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-8433392280611286668",
  "published": "2018-02-28T07:20:00.003-08:00",
  "updated": "2018-02-28T07:22:23.570-08:00",
  "title": "Post-Columbine students do not support gun control",
  "content": "In their coverage of the Parkland school shooting, <a href=\"https://www.economist.com/news/united-states/21737268-might-be-start-something-high-school-pupils-plan-protest-against-mad-gun\"><i>The Economist</i> writes</a>:<br /><blockquote class=\"tr_bq\"><i>Though polling suggests that young people are only slightly more in favour of gun-control measures than their elders, those surveys focus on those aged 18 and above. There may be a pre- and post-Columbine divide within that group.</i></blockquote>Based on my analysis of data from the General Social Survey (GSS) and the CIRP Freshman Survey, I think the first sentence is false and the second is unlikely: young people are substantially <i>less</i> in favor of gun-control measures than their elders.<br /><br />Here's the figure, <a href=\"http://allendowney.blogspot.com/2018/02/support-for-gun-control-is-lower-among.html\">from my previous article</a>, showing these trends:<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-qzUY5sfnWi4/WpbDF-71XOI/AAAAAAAAE3A/1eY21l_YC0cw8quQ4MPGZ35NGeV-ZQfAACLcBGAs/s1600/permit_cohort_cirp.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1100\" data-original-width=\"1600\" height=\"440\" src=\"https://2.bp.blogspot.com/-qzUY5sfnWi4/WpbDF-71XOI/AAAAAAAAE3A/1eY21l_YC0cw8quQ4MPGZ35NGeV-ZQfAACLcBGAs/s640/permit_cohort_cirp.png\" width=\"640\" /></a></div><br />The blue line shows the fraction of respondents in the GSS who would favor \"a law which would require a person to obtain a police permit before he or she could buy a gun?\"<br /><br />Among people born before 1980, support for this form of gun control is strong: around 75% for people born between 1910 and 1940, and approaching 80% for people born between 1950 and 1980.<br /><b>But among people born in the 1980s and 90s, support for gun control is below 70%.</b><br /><br />The orange line shows the fraction of respondents to the CIRP Freshman Survey who \"Agree\" or \"Strongly agree\" that<br /><blockquote class=\"tr_bq\"><i>The federal government should do more to control the sale of handguns.</i></blockquote>This dataset does not go back as far, but shows the same pattern: a large majority of people born before 1980 supported gun control (when they were surveyed as college freshmen); among people born after 1980, far fewer support gun control.<br /><br />However, these results are based on people people who are currently young adults.&nbsp; Maybe, as the Economist speculates:<br /><blockquote class=\"tr_bq\"><i>The pupils, in their late teens, started their education after a massacre at Columbine High School in Colorado in 1999, in which 13 were killed. That means they have been practising active-shooter drills in the classroom since kindergarten. Seeing a school shooting as an event to prepare for, rather than an awful aberration, seems to have fuelled the students’ anger.&nbsp;</i></blockquote>They may be angry, but at least so far, their anger has not led them to support gun control.&nbsp; Data from the Freshman Survey makes this clear.&nbsp; The following figure shows, for survey respondents from 1989 to 2013, the fraction that agree or strongly agree that:<br /><blockquote class=\"tr_bq\"><i>The federal government should do more to control the sale of handguns.</i></blockquote><div>And for respondents in 2016,&nbsp;the fraction that agree or strongly agree that:</div><blockquote class=\"tr_bq\"><i>The federal government should have stricter gun control laws.</i></blockquote><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-pcJiekk73EE/WpbEbKkUFdI/AAAAAAAAE3I/CRnjguzDuXs2dXkq3rzAYjJu331NRBYzACLcBGAs/s1600/control_year_cirp.png\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1100\" data-original-width=\"1600\" height=\"440\" src=\"https://4.bp.blogspot.com/-pcJiekk73EE/WpbEbKkUFdI/AAAAAAAAE3I/CRnjguzDuXs2dXkq3rzAYjJu331NRBYzACLcBGAs/s640/control_year_cirp.png\" width=\"640\" /></a></div><br /><br /><div>The change in wording makes it hard to compare the last data point with the previous trend, but it is clear at least that college freshmen in 2013 were substantially less likely than previous generations to support gun control: <b>at 64%, they were 20 percentage points down from the peak, at 84%.</b></div><div><br /></div><div>A large majority of the 2013 respondents were born in 1995.&nbsp; They were 3 when Columbine was in the news, 10 during the Red Lake shootings, 11 during the West Nickel Mines school shooting, 12 during the Virginia Tech shooting, and 13 during the&nbsp;Northern Illinois University shooting.</div><br />They were 17 during the&nbsp;Chardon High School shooting, the Oikos University shooting, and the&nbsp;Sandy Hook Elementary School shooting.<br /><br />And when they were surveyed in 2013, less than a year after Sandy Hook, more than 33% of them <i>did not agree</i> that the federal government should do more to control the sale of handguns, more than in any previous year of the survey.<br /><br />Seeing these horrific events in the news, during their entire conscious lives, with increasingly dramatic and graphic coverage, might have made these students angry, but it did not make more of them support gun control.<br /><br />Practicing active-shooter drills since kindergarten might have made these students angry, but it did not make more of them support gun control.<br /><br />Maybe, as <i>The Economist</i> suggests, these students see a school shooting as \"an event to prepare for, rather than an awful aberration\".&nbsp; &nbsp;But that does not make them more likely to support gun control.<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}