{
  "title": "U.S. Economy: When to Worry About the Yield Curve",
  "description": "<p>While there continues to be a lot of market chatter surrounding recession risks and the U.S. Treasury yield curve, there are several key factors that make the most recent dip into inversion different. Chief Global Economist Seth Carpenter and Head of U.S. Interest Rate Strategy Guneet Dhingra discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Seth Carpenter:</strong> Welcome to Thoughts on the Market. I'm Seth Carpenter, Morgan Stanley's Chief Global Economist,&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> and I'm Guneet Dhingra, Head of U.S. Interest Rate Strategy.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> And on this episode of Thoughts on the Market, we're going to be discussing the sometimes inconsistent signals of economic recession and what investors should be watching. It's Thursday, April 14th at 10 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> All right, Guneet, as I think most listeners probably know by now, there's a lot of market chatter about recession risks. However, if you look just at the hard data in the United States, I think it's clear that the U.S. economy right now is actually quite strong. If you look at the last jobs report, we had almost 450,000 new jobs created in the month of March. And between that, the strength of the economy right now and the multi-decade highs in inflation, the Federal Reserve is ready to go, starting to tighten monetary policy by raising short term interest rates and running off its balance sheet. That said, every time short term interest rates start to rise, they rise more than longer term interest rates do, and we get a flattening in the yield curve. The yield curve flattened so much recently that it actually inverted briefly where 2's were higher than 10's in yield. And as we've talked about before on this very podcast, there has been historically a signal from an inverted 2s10s curve to a recession probability, rising and rising and rising. Some of the work you've been doing recently, I think you've argued very eloquently, that this time is different. Can you walk me through why this time is different?&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> Yeah, absolutely. I mean, right now you cannot have a conversation with investors without discussing yield curve inversion and the associated recession risks. So I think the way I've been framing it, this time is different because of two particular reasons that haven't been always true. The first one is the yield curve today is artificially very distorted by a multitude of factors. The number one and the most obvious one is the massive amounts of central bank bond buying from the Fed, from the ECB, from the Bank of Japan over the last few years. And so that puts a lot of flattening pressure on the curve, which makes it appear that the curve is too flat, whereas in practice it's just the residual effect of how central banks have affected the yield curve. On top of that, what's also happening is the Fed is obviously trying to address the inflation risk and they are looking to make policy restrictive in the next couple of years. So take the dot plot for instance, right, at the March meeting the Fed gave us a dot plot where the median participant expects the Fed funds rate to get to close to 3% in 2023, and the neutral rate that they see for the economy is close to 2.5%. So in essence, the Fed is telegraphing a form of inversion and ultimately the markets are mimicking what the Fed is telling them, which naturally leads to some curve inversion. So overall, I would say a combination of artificially flattening forces, a restrictive fed, just means that 2s10s curve today is not the macro signal it used to be.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> Got it, got it, so that helps and that squares things, I think, with the way we on the economics team are looking at it. Because in our baseline forecast, there is not a recession in the US. But if that's right, and if we end up avoiding a recession, you've got a bunch of clients, we've got a bunch of clients who are trying to make trades in a market. What are you telling investors that they should be doing, how do you trade in an environment with an inverted curve?&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> Right. So I think the way I talk to investors about this issue is the 2s10s curve merely inverting is not the signal used to be, which means for the yield curve to be predictive for a recession this time, the level threshold is much lower. So, for instance, you can imagine an economy where 2s10s curve inverting to minus 50 or minus 75 is the real true signal for a slowdown ahead and a recession ahead. And so what I tell investors today is do not get concerned about the yield curve getting to 0 basis points, there's a lot more room for the yield curve to keep inverting. And the target you should have for yield curve flattening trade should be more like minus 50 or minus 75.&nbsp;</p><p>&nbsp;</p><p><strong>Seth Carpenter:</strong> Got it. That that's a very big difference, very far away from where we are now. And in fact, as I mentioned earlier, the inversion that we did see was somewhat short lived and we've actually had a bit of a steepening off the back of it. I guess one question, and this is something that you've also written about is, what's driving that tightening? Is it because the Fed is going to be unwinding its balance sheet, doing so-called quantitative tightening. If the quantitative easing that they were doing flattened the curve, are you seeing the quantitative tightening is the thing that's going to be steepening the curve?&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> I think instinctively, many investors think tightening is the opposite of easing, so that must mean quantitative tightening is the opposite of quantitative easing. And that's why I think a big fallacy lies in how people are simplifying the understanding of QT. I think the reality is quantitative tightening is perhaps not the perfect term for what the Fed is going to do next. The main thing to understand here is when the Fed does QE, the Fed chooses which part of the Treasury curve are they going to target, and that ultimately decides whether the curve will steepen or flatten. However, in this case, it's the U.S. Treasury, which is going to decide once the Fed stops reinvesting, how will the U.S. Treasury respond by increasing supply in the front end or the back end? And that decides whether the yield curve should steepen or flatten, quite the opposite from QE where the Fed decides. So the way I sort of summarize this to people is QT is not the opposite of QE, asset sales are. So Seth, you spent 15 years working at the Fed. Do you think the FOMC cares about an inverted curve?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> I would not say that the core of the FOMC cares about an inverted curve the same way that the average market participant does. I think it's undeniable that the Fed is aware of all of the research, all of the history, all of the correlation between an inverted curve and a recession. But I don't think it's a dispositive signal. And by that what I mean is, if we got to the point where the 2s10s curve were pancake flat, it was a zero or even slightly inverted, but if at the same time we were still getting 400-500,000 nonfarm payrolls per month, I think then that signal from the yield curve would get dismissed against the evidence that the economy is very, very strong. So I think an inverted curve is the sort of thing that would cause the Fed to double check their math in some sense. But it's not going to be the signal by itself. And then, going back to what you had said earlier about the dot plot. I think that's very important. What the Fed is trying to do is engineer a so-called soft landing. That is, they are trying to tighten policy so that the economy slows a lot, but not too much. So that the inflationary pressures that we see start to abate. How would they do that? Well, in part, they'd be raising the short term interest rate. They'd be raising it above their own estimate of neutral. And as you pointed out, in their last dot plot they said they'll go up to maybe 3% before eventually coming back down to 2.5%. So achieving that soft landing is almost surely going to end up creating an inverted yield curve anyway.&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> Yeah, so you talk about the Fed engineering a soft landing. Have they successfully done it in the past? And what makes you think that they can do it this time?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> So two very, very important questions. The answer to the first one, have they done it in the past, is a bit in the eye of the beholder. If you listen to Chair Powell a couple of weeks ago, when he gave a speech at the National Association of Business Economists conference, he gave at least three different examples where he says historically the Fed has achieved a soft landing. If I was going to point to a soft landing, I would look at 1994 to 1995. The economy did slow pretty dramatically after the Fed had hiked rates fairly aggressively, and then the Fed paused the hiking and eventually reversed course, and the economic expansion continued. I think you could consider that to be a soft landing. The big difference this time is that this is the first rate hiking cycle since the 1970s where the Fed is actively trying to bring inflation down. Whereas the more recent cycles have been the Fed trying to keep inflation from rising above their target. So bringing it down as opposed to keeping it down are two very different things. So the way I like to think about it is the Fed's got a very difficult job. Can they do it? Yes, I absolutely think they can do it. And part of what gives me hope is the episode in late 2018 to early 2019, the last time the Fed was hiking, running off the balance sheet, raising short term interest rates. We had that period where the economy slowed, risk markets cracked. And what did the Fed do? They reversed course. Chair Powell has taken to using the word nimble a lot recently. I think if they can be that responsive to conditions, it increases the chances that they pull it off. But it's going to be difficult.&nbsp;</p><p><br></p><p><strong>Seth Carpenter: </strong>Well Guneet, I think we would both agree that we don't think an inverted yield curve is signaling a recession, but that doesn't mean that one can't happen. The world is an uncertain place, but thanks for joining us and taking the time to talk.&nbsp;</p><p><br></p><p><strong>Guneet Dhingra: </strong>Absolutely. Great speaking to you Seth.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> And as a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people to find the show. </p>",
  "itunes:title": "U.S. Economy: When to Worry About the Yield Curve",
  "itunes:episodeType": "full",
  "itunes:episode": 596,
  "itunes:summary": "While there continues to be a lot of market chatter surrounding recession risks and the U.S. Treasury yield curve, there are several key factors that make the most recent dip into inversion different. Chief Global Economist Seth Carpenter and Head of U.S. Interest Rate Strategy Guneet Dhingra discuss.",
  "content:encoded": "<p>While there continues to be a lot of market chatter surrounding recession risks and the U.S. Treasury yield curve, there are several key factors that make the most recent dip into inversion different. Chief Global Economist Seth Carpenter and Head of U.S. Interest Rate Strategy Guneet Dhingra discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Seth Carpenter:</strong> Welcome to Thoughts on the Market. I'm Seth Carpenter, Morgan Stanley's Chief Global Economist,&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> and I'm Guneet Dhingra, Head of U.S. Interest Rate Strategy.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> And on this episode of Thoughts on the Market, we're going to be discussing the sometimes inconsistent signals of economic recession and what investors should be watching. It's Thursday, April 14th at 10 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> All right, Guneet, as I think most listeners probably know by now, there's a lot of market chatter about recession risks. However, if you look just at the hard data in the United States, I think it's clear that the U.S. economy right now is actually quite strong. If you look at the last jobs report, we had almost 450,000 new jobs created in the month of March. And between that, the strength of the economy right now and the multi-decade highs in inflation, the Federal Reserve is ready to go, starting to tighten monetary policy by raising short term interest rates and running off its balance sheet. That said, every time short term interest rates start to rise, they rise more than longer term interest rates do, and we get a flattening in the yield curve. The yield curve flattened so much recently that it actually inverted briefly where 2's were higher than 10's in yield. And as we've talked about before on this very podcast, there has been historically a signal from an inverted 2s10s curve to a recession probability, rising and rising and rising. Some of the work you've been doing recently, I think you've argued very eloquently, that this time is different. Can you walk me through why this time is different?&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> Yeah, absolutely. I mean, right now you cannot have a conversation with investors without discussing yield curve inversion and the associated recession risks. So I think the way I've been framing it, this time is different because of two particular reasons that haven't been always true. The first one is the yield curve today is artificially very distorted by a multitude of factors. The number one and the most obvious one is the massive amounts of central bank bond buying from the Fed, from the ECB, from the Bank of Japan over the last few years. And so that puts a lot of flattening pressure on the curve, which makes it appear that the curve is too flat, whereas in practice it's just the residual effect of how central banks have affected the yield curve. On top of that, what's also happening is the Fed is obviously trying to address the inflation risk and they are looking to make policy restrictive in the next couple of years. So take the dot plot for instance, right, at the March meeting the Fed gave us a dot plot where the median participant expects the Fed funds rate to get to close to 3% in 2023, and the neutral rate that they see for the economy is close to 2.5%. So in essence, the Fed is telegraphing a form of inversion and ultimately the markets are mimicking what the Fed is telling them, which naturally leads to some curve inversion. So overall, I would say a combination of artificially flattening forces, a restrictive fed, just means that 2s10s curve today is not the macro signal it used to be.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> Got it, got it, so that helps and that squares things, I think, with the way we on the economics team are looking at it. Because in our baseline forecast, there is not a recession in the US. But if that's right, and if we end up avoiding a recession, you've got a bunch of clients, we've got a bunch of clients who are trying to make trades in a market. What are you telling investors that they should be doing, how do you trade in an environment with an inverted curve?&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> Right. So I think the way I talk to investors about this issue is the 2s10s curve merely inverting is not the signal used to be, which means for the yield curve to be predictive for a recession this time, the level threshold is much lower. So, for instance, you can imagine an economy where 2s10s curve inverting to minus 50 or minus 75 is the real true signal for a slowdown ahead and a recession ahead. And so what I tell investors today is do not get concerned about the yield curve getting to 0 basis points, there's a lot more room for the yield curve to keep inverting. And the target you should have for yield curve flattening trade should be more like minus 50 or minus 75.&nbsp;</p><p>&nbsp;</p><p><strong>Seth Carpenter:</strong> Got it. That that's a very big difference, very far away from where we are now. And in fact, as I mentioned earlier, the inversion that we did see was somewhat short lived and we've actually had a bit of a steepening off the back of it. I guess one question, and this is something that you've also written about is, what's driving that tightening? Is it because the Fed is going to be unwinding its balance sheet, doing so-called quantitative tightening. If the quantitative easing that they were doing flattened the curve, are you seeing the quantitative tightening is the thing that's going to be steepening the curve?&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> I think instinctively, many investors think tightening is the opposite of easing, so that must mean quantitative tightening is the opposite of quantitative easing. And that's why I think a big fallacy lies in how people are simplifying the understanding of QT. I think the reality is quantitative tightening is perhaps not the perfect term for what the Fed is going to do next. The main thing to understand here is when the Fed does QE, the Fed chooses which part of the Treasury curve are they going to target, and that ultimately decides whether the curve will steepen or flatten. However, in this case, it's the U.S. Treasury, which is going to decide once the Fed stops reinvesting, how will the U.S. Treasury respond by increasing supply in the front end or the back end? And that decides whether the yield curve should steepen or flatten, quite the opposite from QE where the Fed decides. So the way I sort of summarize this to people is QT is not the opposite of QE, asset sales are. So Seth, you spent 15 years working at the Fed. Do you think the FOMC cares about an inverted curve?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> I would not say that the core of the FOMC cares about an inverted curve the same way that the average market participant does. I think it's undeniable that the Fed is aware of all of the research, all of the history, all of the correlation between an inverted curve and a recession. But I don't think it's a dispositive signal. And by that what I mean is, if we got to the point where the 2s10s curve were pancake flat, it was a zero or even slightly inverted, but if at the same time we were still getting 400-500,000 nonfarm payrolls per month, I think then that signal from the yield curve would get dismissed against the evidence that the economy is very, very strong. So I think an inverted curve is the sort of thing that would cause the Fed to double check their math in some sense. But it's not going to be the signal by itself. And then, going back to what you had said earlier about the dot plot. I think that's very important. What the Fed is trying to do is engineer a so-called soft landing. That is, they are trying to tighten policy so that the economy slows a lot, but not too much. So that the inflationary pressures that we see start to abate. How would they do that? Well, in part, they'd be raising the short term interest rate. They'd be raising it above their own estimate of neutral. And as you pointed out, in their last dot plot they said they'll go up to maybe 3% before eventually coming back down to 2.5%. So achieving that soft landing is almost surely going to end up creating an inverted yield curve anyway.&nbsp;</p><p><br></p><p><strong>Guneet Dhingra:</strong> Yeah, so you talk about the Fed engineering a soft landing. Have they successfully done it in the past? And what makes you think that they can do it this time?&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> So two very, very important questions. The answer to the first one, have they done it in the past, is a bit in the eye of the beholder. If you listen to Chair Powell a couple of weeks ago, when he gave a speech at the National Association of Business Economists conference, he gave at least three different examples where he says historically the Fed has achieved a soft landing. If I was going to point to a soft landing, I would look at 1994 to 1995. The economy did slow pretty dramatically after the Fed had hiked rates fairly aggressively, and then the Fed paused the hiking and eventually reversed course, and the economic expansion continued. I think you could consider that to be a soft landing. The big difference this time is that this is the first rate hiking cycle since the 1970s where the Fed is actively trying to bring inflation down. Whereas the more recent cycles have been the Fed trying to keep inflation from rising above their target. So bringing it down as opposed to keeping it down are two very different things. So the way I like to think about it is the Fed's got a very difficult job. Can they do it? Yes, I absolutely think they can do it. And part of what gives me hope is the episode in late 2018 to early 2019, the last time the Fed was hiking, running off the balance sheet, raising short term interest rates. We had that period where the economy slowed, risk markets cracked. And what did the Fed do? They reversed course. Chair Powell has taken to using the word nimble a lot recently. I think if they can be that responsive to conditions, it increases the chances that they pull it off. But it's going to be difficult.&nbsp;</p><p><br></p><p><strong>Seth Carpenter: </strong>Well Guneet, I think we would both agree that we don't think an inverted yield curve is signaling a recession, but that doesn't mean that one can't happen. The world is an uncertain place, but thanks for joining us and taking the time to talk.&nbsp;</p><p><br></p><p><strong>Guneet Dhingra: </strong>Absolutely. Great speaking to you Seth.&nbsp;</p><p><br></p><p><strong>Seth Carpenter:</strong> And as a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people to find the show. </p>",
  "guid": "gid://art19-episode-locator/V0/_pNLIJ6mpCH2GausL_boV8uqpRYg_yWh-l5hRpWCuAs",
  "pubDate": "Fri, 15 Apr 2022 11:59:58 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends",
  "itunes:duration": "00:09:03",
  "enclosure": ""
}