{
  "id": "tag:theatlantic.com,2019:50-603622",
  "content": "<p>In exchange for a salary, office workers do a great many dreadful things: sit through meetings, make the trek to and from work each day, feign enthusiasm for their employer’s particular vision.</p><p>Come holiday season, they also—compelled by a strange mix of perceived obligation and genuine holiday spirit—sometimes exchange gifts with one another. One common, and frequently awkward, form of this yearly tradition is the Secret Santa, in which participants randomly select a co-worker’s name and then anonymously give a small gift to that person. Plenty of office workers happily channel their holiday cheer into Secret Santa, but a lot of people, even those who don’t exhibit the least bit of grinchiness otherwise, aren’t into it.</p><p>“I feel like [my co-workers] can’t really know me well enough to give me a gift that’s meaningful in any sense,” Beatrice Loayza, a 26-year-old writer who has an administrative office job during the day, told me. She said the gifts people in her office get one another tend to be unimaginative, “like a generic piece of clothing or some generic masculine or feminine gift. Everything that’s being exchanged feels a little forced.” A year or two ago, she received a foldable tote bag “in these horrible bright womanly colors” that currently sits, still unused, underneath her desk. Her Secret Santa contributions have been just as half-hearted, she said: “I go and get a bottle of wine 15 minutes before the party or something like that.”</p><p>Recently, Loayza’s Secret Santa experience almost went from mediocre to actively unpleasant. “This year, I chose [from a hat] the one person that I legitimately do not like,” she said. “In the past, there’s been times when he’s eaten my lunch.” To get out of this predicament, she pretended to have drawn her own name, which under the rules of Secret Santa necessitates the selection of another name.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/business/archive/2016/12/remote-workers-holiday-parties/510434/?utm_source=feed\">Read: The rise of the remote-work holiday party</a>]</i></p><p>Loayza has participated in her workplace’s Secret Santa exchange, somewhat grudgingly, for five years running. “Because there’s this pseudo-family small-office intimacy to it, it’s very glaring if someone were not to participate,” she told me.</p><p>She is not alone in her disenchantment. According to <a href=\"https://www.jobsite.co.uk/worklife/the-gifts-that-keep-on-taking-millennials-feel-fleeced-by-office-whip-rounds-24681/\">a survey published last month</a> by the British job-listings platform Jobsite, 20 percent of workers in the U.K. would prefer not to have office celebrations, including Secret Santas and gatherings honoring an employee’s promotion or birthday, if they involve financial contributions from employees. Millennials in particular seemed to dislike these festivities, with 73 percent of them reporting that they had at some point spent more than they could afford to on such events, compared with 58 percent of workers overall.</p><p>And many people feel they can’t opt out of office-sponsored “fun,” whether it’s organized by the company or by a few jolly employees. “How can you say no to what your company is asking you to do?” wrote Sam Warren, a professor of organization studies and human-resource management at the University of Portsmouth, in an email. “Would it affect your [job] prospects? What does it say about your attitude to being a team player, or your relationship with your co-workers? How can you say no to FUN?”</p><p>Warren has studied the dynamics of fun at workplaces, and when employees enjoy themselves with co-workers, she noted, it can make them less stressed and more loyal to their employer. But what management considers to be enjoyable can sometimes make labor uneasy. “Often employees have a ‘work self’ and a ‘personal self’ and it’s uncomfortable to mix the two,” she wrote. “Modern-day work cultures encourage a blurring of boundaries that asks a lot of some employees who would prefer to keep things separate—particularly introverts.”</p><p>Last year, <em>The Cut</em> <a href=\"https://www.thecut.com/2018/12/nobody-likes-doing-secret-santa-at-work.html\">documented</a> several Secret Santa horror stories—one woman said her boss gave her a book of sex tips—and they are indeed awful, but what I heard from those I interviewed were anecdotes of viciously mundane gifting. Kishan Purohit, a 29-year-old consultant in Mumbai, has participated in seven or eight office Secret Santas, and the least inspiring gift he got was a coffee mug with a trite motivational quote on it. “It said ‘Seize the day’ or something,” which he had no use for, not least because “I usually seize my day always.” He gave it away.</p><p>In his first years in an office setting, he didn’t mind gift exchanges, but they started to grate on him as he got trapped in a cycle of receiving meaningless paraphernalia (like the mug) and giving boxes of chocolates to near-strangers (“a safe bet”). Several of the Secret Santas Purohit has been involved in were enormous, with 100 people or more giving one another gifts. (Multiple times, the person he was assigned to buy a gift for was someone he’d never interacted with.) He’d rather the company organize a dinner or a community-service event, but Secret Santa persists and, out of fear of being seen as a party pooper, so does Purohit’s participation in it.</p><p>Some of the distaste that Rob, a 37-year-old working at a tech company in Amsterdam, has for Secret Santa is also tied to a disappointing gift. One year, “everyone got quite nice, thoughtful gifts, and what I got was a metal sign that said, if I remember correctly, <span class=\"smallcaps\">Yeah sure, I’ll solve your problem—just as soon as I’ve solved everyone else’s</span>,” he told me. “I remember thinking, <em>God damn, is this is the impression that people have of me, that I would find this funny?</em>” To make matters worse, there was a policy against pinning things up in Rob’s office. (Perhaps it was intended as home decor?) “It went in the trash,” he said. (Rob requested to be identified only by his first name, because he doesn’t want to hurt his relationships with his co-workers.)</p><p>Another grievance of his is that some people adhere to the stated rules and others don’t, completely ignoring spending limits or trying to swap names so that they can get a gift for one of their friends. “Despite the 15-euro limit, at least one person received a Lego set that cost around 100 euros. My desk mate received a paperback book on Christianity—so, a mixed bag,” he told me.</p><p>Rob has had it with Secret Santas, and after years of participating in these “theoretically optional” activities, he’s finally opting out now that he feels like he’s established himself socially at work. “I’m just going to let the deadline pass, and if anybody says anything, I’m just going to say I forgot,” he told me.</p><p>The times Rob actually enjoyed exchanging gifts with co-workers were when he and some work friends set up their own small Secret Santa. “It was the work equivalent of the WhatsApp group that springs off from the WhatsApp group that excludes the two really annoying people,” he said.</p><p>Indeed, “The <a href=\"https://www.emerald.com/insight/content/doi/10.1108/ER-10-2013-0152/full/html\">research on fun at work</a> shows that self-authored fun (fun things people do by themselves) are the only activities that people genuinely find enjoyable,” said Warren, the business-school professor.</p><p>One twist, though, is that workers sometimes make their own fun from within the confines of their employer’s prescribed framework. “Often the ‘laughable’ fun program, which people see as a superficial management gimmick, becomes an object of ridicule and self-authored fun itself—so the end result is the same,” Warren said. But if the best part of office Secret Santa is making fun of it, well, that says it all.</p>",
  "author": {
    "name": "Joe Pinsker",
    "uri": "http://www.theatlantic.com/author/joe-pinsker/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "The Atlantic"
  },
  "title": "There’s No Fun Like Mandatory Office Holiday Fun",
  "published": "2019-12-16T10:36:49-05:00",
  "updated": "2019-12-16T12:29:40-05:00",
  "summary": "Secret Santa gift exchanges at work make many people grinchy—for good reason.",
  "link": ""
}