{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-4126549761854025550",
  "published": "2022-02-02T09:28:00.001-05:00",
  "updated": "2022-02-02T09:28:10.146-05:00",
  "title": "Maps 101: How Google Maps reviews work",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEgI4AOJ9ul9q9QM6g1ABOfMUcEAYRDoPgbAVFEPknuxSazT58nRBTg1Y8_4KpL2yd3fr2ltSxdvt-rNbPi-lXjztf57RmAcEWzYhBvoiIv-fqK6kmmWLLc8v8H2HwHrhaqlSC8R9z-4jbeNK5shQoMqSiJZXqpl0HaT5rcb5h7Gi_XACcRi8OoRi8zw=s1426\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"795\" data-original-width=\"1426\" height=\"357\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEgI4AOJ9ul9q9QM6g1ABOfMUcEAYRDoPgbAVFEPknuxSazT58nRBTg1Y8_4KpL2yd3fr2ltSxdvt-rNbPi-lXjztf57RmAcEWzYhBvoiIv-fqK6kmmWLLc8v8H2HwHrhaqlSC8R9z-4jbeNK5shQoMqSiJZXqpl0HaT5rcb5h7Gi_XACcRi8OoRi8zw=w640-h357\" width=\"640\" /></a></div><br /><div style=\"text-align: center;\"><br /></div>When exploring new places, reviews on Google are a treasure trove of local knowledge that can point you to the places and businesses you’ll enjoy most — whether it’s a bakery with the best gluten-free cupcake or a nearby restaurant with live music.&nbsp;<div><br /></div><div><br /></div><div>With millions of reviews posted every day from people around the world, we have around-the-clock support to keep the information on Google relevant and accurate. Much of our work to prevent inappropriate content is done behind the scenes, so we wanted to shed some light on what happens after you hit “post” on a review.&nbsp;</div><div><br /></div><div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"266\" src=\"https://www.youtube.com/embed/TMjezeeGVfY\" width=\"320\" youtube-src-id=\"TMjezeeGVfY\"></iframe></div><br /><div><br /></div><div><b>How we create and enforce our policies&nbsp;</b></div><div><br /></div><div>We’ve created <a href=\"https://support.google.com/contributionpolicy/answer/7422880?hl=en&amp;ref_topic=7422769\">strict content policies</a> to make sure reviews are based on real-world experiences and to keep irrelevant and offensive comments off of Google Business Profiles.&nbsp;</div><div><br /></div><div>As the world evolves, so do our policies and protections. This helps us guard places and businesses from violative and off-topic content when there’s potential for them to be targeted for abuse. For instance, when governments and businesses started requiring proof of COVID-19 vaccine before entering certain places, we put extra protections in place to remove Google reviews that criticize a business for its health and safety policies or for complying with a vaccine mandate.&nbsp;</div><div><br /></div><div>Once a policy is written, it’s turned into training material — both for our operators and machine learning algorithms — to help our teams catch policy-violating content and ultimately keep Google reviews helpful and authentic.&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div><b>Moderating reviews with the help of machine learning&nbsp;</b></div><div><b><br /></b></div><div>As soon as someone posts a review, we send it to our moderation system to make sure the review doesn’t violate any of our policies. You can think of our moderation system as a security guard that stops unauthorized people from getting into a building — but instead, our team is stopping bad content from being posted on Google.&nbsp;</div><div><br /></div><div><br /></div><div>Given the volume of reviews we regularly receive, we’ve found that we need both the nuanced understanding that humans offer and the scale that machines provide to help us moderate contributed content. They have different strengths so we continue to invest tremendously in both.&nbsp;</div><div><br /></div><div><br /></div><div>Machines are our first line of defense because they’re good at identifying patterns. These patterns often immediately help our machines determine if the content is legitimate, and the vast majority of fake and fraudulent content is removed before anyone actually sees it.&nbsp;</div><div><br /></div><div><br /></div><div>Our machines look at reviews from multiple angles, such as:&nbsp;</div><div><ul style=\"text-align: left;\"><li>The content of the review: Does it contain offensive or off-topic content?&nbsp;</li><li>The account that left the review: Does the Google account have any history of suspicious behavior?</li><li>The place itself: Has there been uncharacteristic activity — such as an abundance of reviews over a short period of time? Has it recently gotten attention in the news or on social media that would motivate people to leave fraudulent reviews?&nbsp;</li></ul><div><br /></div>Training a machine on the difference between acceptable and policy-violating content is a delicate balance. For example, sometimes the word “gay” is used as a derogatory term, and that’s not something we tolerate in Google reviews. But if we teach our machine learning models that it’s only used in hate speech, we might erroneously remove reviews that promote a gay business owner or an LGBTQ+ safe space. Our human operators regularly run quality tests and complete additional training to remove bias from the machine learning models. By thoroughly training our models on all the ways certain words or phrases are used, we improve our ability to catch policy-violating content and reduce the chance of inadvertently blocking legitimate reviews from going live.&nbsp;</div><div><br /></div><div><br /></div><div>If our systems detect no policy violations, then the review can post within a matter of seconds. But our job doesn’t stop once a review goes live. Our systems continue to analyze the contributed content and watch for questionable patterns. These patterns can be anything from a group of people leaving reviews on the same cluster of Business Profiles to a business or place receiving an unusually high number of 1 or 5-star reviews over a short period of time.&nbsp;</div><div><br /></div><div><br /></div><div><b>Keeping reviews authentic and reliable&nbsp;</b></div><div><br /></div><div>Like any platform that welcomes contributions from users, we also have to stay vigilant in our efforts to prevent fraud and abuse from appearing on Maps. Part of that is making it easy for people using Google Maps to flag any policy-violating reviews. If you think you see a policy-violating review on Google, we encourage you to report it to our team. Businesses can report reviews on their profiles <a href=\"https://support.google.com/business/answer/4596773?hl=en\">here</a>, and consumers can report them <a href=\"https://support.google.com/contributionpolicy/answer/7445749?hl=en&amp;ref_topic=7422769#zippy=\">here</a>.&nbsp;</div><div><br /></div><div style=\"text-align: center;\"><span id=\"docs-internal-guid-190c4716-7fff-3b3f-f0fc-d923a6421df9\"><span style=\"background-color: white; color: #202124; font-family: &quot;Google Sans&quot;, sans-serif; font-size: 10pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><span style=\"border: none; display: inline-block; height: 350px; overflow: hidden; width: 350px;\"><img height=\"350\" src=\"https://lh5.googleusercontent.com/CIhDZdww6v8hQ5yjAd0e92s8pIHOVv1H-DxnjrMnzau4ceZ5VRV5ejxzOU_rTJZ0Fb6RLTgo4TZLG-yXhMxtvZfZ62jaYXwwKT2a5CvxCA1Vk4qbVvS-TFyal4J_QOBqwxFHnKcXUQ\" style=\"margin-left: 0px; margin-top: 0px;\" width=\"350\" /></span></span></span></div><div><br /></div><div>Our team of human operators works around the clock to review flagged content. When we find reviews that violate our policies, we remove them from Google and, in some cases, suspend the user account or even pursue litigation.&nbsp;</div><div><br /></div><div><br /></div><div>In addition to reviewing flagged content, our team proactively works to identify potential abuse risks, which reduces the likelihood of successful abuse attacks. For instance, when there’s an upcoming event with a significant following — such as an election — we implement elevated protections to the places associated with the event and other nearby businesses that people might look for on Maps. We continue to monitor these places and businesses until the risk of abuse has subsided to support our mission of only publishing authentic and reliable reviews. Our investment in analyzing and understanding how contributed content can be abused has been critical in keeping us one step ahead of bad actors.&nbsp;</div><div><br /></div><div><br /></div><div>With more than 1 billion people turning to Google Maps every month to navigate and explore, we want to make sure the information they see — especially reviews — is reliable for everyone. Our work is never done; we’re constantly improving our system and working hard to keep abuse, including fake reviews, off of the map.&nbsp;</div><div><br /></div><div><br /></div><div><span class=\"post-author\">Posted by Ian Leader Product Lead, User Generated Content</span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}