{
  "id": "yt:video:rtAWPMLYMpQ",
  "yt:videoId": "rtAWPMLYMpQ",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "Brazil’s Lula da Silva, explained",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-10-25T16:25:02+00:00",
  "updated": "2022-11-03T02:38:56+00:00",
  "media:group": {
    "media:title": "Brazil’s Lula da Silva, explained",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Lula da Silva wants to be president for a second time. But Brazil has changed.\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nOn October 2, 2022, Brazilians voted in the first round of their presidential election. The top two finishers were current president Jair Bolsonaro and former president Luiz Inácio Lula da Silva. Both candidates will face each other in a run-off on October 30. Lula is considered likely to win. \n\nLula is arguably Brazil’s most well-known and complex politician. He helped form a powerful political party, had two successful terms in office, and even served jail time over corruption and bribery allegations. After four years of Bolsonaro’s presidency, the core of Lula’s campaign has focused on restoring the Brazil of his own presidency. But a lot has changed in Brazil since his time in office.\n\nWatch this video for a glance at Lula’s career and to understand why his second time as president would be very different than his first.\n\nSome sources that were helpful to us in researching this story: \n\nThe Brazilian Report’s election coverage\nhttps://brazilian.report/ \n\nLula and His Politics of Cunning by John French \nhttps://uncpress.org/book/9781469655765/lula-and-his-politics-of-cunning/ \n\nNurturing Hope, Deepening Democracy, and Combating Inequalities in Brazil: Lula, the Workers' Party, and Dilma Rousseff's 2010 Election as President by John French and Alexandre Fortes\nhttps://read.dukeupress.edu/labor/article-abstract/9/1/7/28306/Nurturing-Hope-Deepening-Democracy-and-Combating?redirectedFrom=fulltext\n\nLula’s Second Act by Giancarlo Summa \nhttps://www.dissentmagazine.org/online_articles/lulas-second-act \n\nCan Brazil Turn Back the Clock by Brian Winter \nhttps://www.foreignaffairs.com/articles/brazil/2022-06-21/brazil-turn-back-clock \n\nHow Bolsonaro Might Win-Even If He Loses by Brian Winter \nhttps://www.foreignaffairs.com/brazil/how-bolsonaro-might-win-even-if-he-loses \n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}