{
  "title": "584: Harry Potter and the Hotly Debated Book Title (Sorcerer's Stone, Chapters 13 - 14)",
  "link": "https://audioboom.com/posts/8180018",
  "itunes:episode": 584,
  "itunes:title": "Harry Potter and the Hotly Debated Book Title (Sorcerer's Stone, Chapters 13 - 14)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4234,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week the hosts are joined by Andy of Harry Potter Fan Zone, and Chapter by Chapter continues with chapters 13 and 14 of Sorcerer's Stone. Listen as we discuss the real-life origins of Nicolas Flamel, debate whether 'Sorcerer's Stone' or 'Philosopher's Stone' is a better title, and revisit a fan theory about what Dumbledore did with alchemy. Then, the trio visit Hagrid's Hut and Harry uses his powers of persuasion that he may or may not have inherited from Voldemort?! All this and more, including:<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome back, Andy! Check out <a href=\"https://www.harrypotterfanzone.com/\">Harry Potter Fan Zone</a>, the top Australian HP fan site.</li>\n<li>News: Many new books are now available including Tom Felton's autobiography, Alan Rickman's posthumous diary, and Order of the Phoenix illustrated by Jim Kay. The hosts discuss which ones they'll be checking out.</li>\n<li>Main Discussion #1: Sorcerer's Stone, Chapter 13: Nicolas Flamel</li>\n<li>7-Word Summary: Secrets are revealed when chocolate is eaten.</li>\n<li>We never did find out what work Dumbledore and Nicolas did on alchemy. Did <em>Fantastic Beasts</em> reveal more?</li>\n<li>We review an old fan theory that we love about Credence's origins.</li>\n<li>In talking about the Sorcerer's/Philosopher's Stone, Andrew explains who was responsible for the title change.</li>\n<li>Which is better, saying \"Sorcerer's Stone\" (snappy, alliterative) or \"Philosopher's Stone\" (boring)? Andy and the American hosts all debate.</li>\n<li>The hosts review some early Mary GrandPré artwork including an alternate cover that Andy shares with the title \"Harry Potter and the School of Magic\".</li>\n<li>In fact, Harry Potter Fan Zone has the <a href=\"https://www.harrypotterfanzone.com/book-1/\">most impressive gallery</a> of official artwork, exhaustingly sourced and categorized by Andy. Worth your time to check out!</li>\n<li>Main Discussion #2: Sorcerer's Stone, Chapter 14: Norbert the Norwegian Ridgeback</li>\n<li>7-Word Summary: Hagrid reveals illegal practices inside his hut</li>\n<li>This rare chapter is, in many ways, completely self-contained. The conflict presented is resolved at the end.</li>\n<li>Life lessons from HP #???: Flattery will get you ev-erywhere!</li>\n<li>Andrew's new proposal of an HBO Max television show features Hagrid and his pet dragon. We're in love.</li>\n<li>Hagrid clearly has a soft spot for clearly dangerous creatures. Is this intentional foreshadowing to his plotline in Chamber of Secrets?</li>\n<li>Is it reckless for Ron not to be honest with Madame Pomfrey about his bite? What if it's magically infected?</li>\n<li>The scene with Charlie's friends is unspoilt by adaptation. What do we see when we see it in our heads?</li>\n<li>We close out the chapter with our MVPs of the Week</li>\n<li>Next Week: It's a MuggleMail episode! Send us your thoughts on our recent chapters or tell us what's on your mind!</li>\n<li>Quizzitch: Which real-life Wizard Rock artist wrote a classic spurned love ballad titled \"1991 - Charlie Weasley\"</li>\n<li>This week's episode is brought to by <a href=\"http://Stamps.com\">Stamps.com</a> (Get a 4-week trial, free postage, and a digital scale at <a href=\"https://www.stamps.com/mugglecast\">https://www.stamps.com/mugglecast</a>. Thanks to<br>\n<a href=\"http://Stamps.com\">Stamps.com</a> for sponsoring the show!), BetterHelp (Get 10% off your first month at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>), and Shudder (Get your first 30 days free by using code 'mugglecast')!</li>\n</ul>\n",
  "pubDate": "Tue, 25 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-24:/posts/8180018",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}