{
  "title": "Test Engineer to Data Science: Career Switch",
  "link": "https://dimensionless.in/test-engineer-data-science/",
  "comments": "https://dimensionless.in/test-engineer-data-science/#respond",
  "dc:creator": "Pooja Sahatiya",
  "pubDate": "Fri, 31 Jan 2020 07:10:40 +0000",
  "category": [
    "Career Transitions",
    "Data Science",
    "Career Switch Data Science",
    "Career Transition",
    "data science careers",
    "data science job",
    "data science professional",
    "data science skillset",
    "Data Science Success Story",
    "future ready careers",
    "Hardware Engineer",
    "Learn Data Science and Business Analytics",
    "Machine Learning",
    "Network Engineer",
    "Research Associate"
  ],
  "guid": "https://dimensionless.in/?p=219134",
  "description": "My actual Data Science journey began the day I decided to switch careers and enrolled with Dimensionless.",
  "content:encoded": "\n<h2>My Journey: From Test Engineer to Data Science</h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Correct Guidance is the key to a successful Career Switch. That&#8217;s how I was able to cover the journey of Test Engineer to Data Science.</p>\n<cite>&#8211; <a href=\"https://www.linkedin.com/in/megha-kansal-711700115/\">Megha Kansal</a></cite></blockquote>\n\n\n\n<h3>Background</h3>\n\n\n\n<p><strong>Education:</strong> B Tech IT</p>\n\n\n\n<table class=\"wp-block-table is-style-stripes\" style=\"height: 139px;\" width=\"478\">\n<tbody>\n<tr>\n<td><strong>Previous Profile  >>></strong></td>\n<td><strong>Current Profile</strong></td>\n</tr>\n<tr>\n<td>\n<p>Profile: <strong>Test Engineer</strong><br />Designation: Test Lead<br />Experience: 3 years</p>\n</td>\n<td>\n<p>Profile: <strong>Data Scientist<br /></strong>Designation: Manager &#8211; Data Science</p>\n</td>\n</tr>\n</tbody>\n</table>\n\n\n\n<div class=\"wp-block-spacer\" style=\"height: 32px;\" aria-hidden=\"true\"> </div>\n\n\n\n<h3>My journey into Data Science</h3>\n\n\n\n<h4>Why Data Science?</h4>\n\n\n\n<p>Frankly, I started finding my job a bit monotonous. Testing was a lucrative career a few years back, but with new technologies coming in, I wanted to explore the possibility of upskilling and switching careers. I spoke to friends and researched a bit about Data Science. Since I was not from a coding background, I really worried whether I could learn to code efficiently. I tried to understand R and Python on my own. There were 2 things I found out: the languages are basically plain English, easy to understand, and I will definitely need guidance because Data Science is much more than just learning a language.</p>\n\n\n\n<h4>Why Dimensionless?</h4>\n\n\n\n<p>I had enquired in a lot of institutes. While the curriculum and other offerings were perfect, there was one particular detail for which I was convinced to join Dimensionless. I did not want to learn with 40-50 other people in a class, where the teacher hardly has any time to interact or resolve doubts. There was one institute which said that they have around 120 people in one batch! Dimensionless promised to not have more than 20 people in one batch! </p>\n<p>Also, when I spoke to one of the mentors, he carefully studied my background and made me understand my career transition path in the first call itself. It gave me the confidence to finally pursue Data Science. I enrolled with Dimensionless for their next batch.</p>\n\n\n\n<h4>Experience with Dimensionless?</h4>\n\n\n\n<p>Really good. The classes were very interactive. Teachers ensured that everyone participated in the class. They would ask us to answer in individually and explain patiently whenever we were wrong or were confused. It hardly felt like a virtual classroom. Mentors were always available to have a word or discuss any doubts we had.</p>\n\n\n\n<h3>Career Transition to Data Science</h3>\n\n\n\n<p>For cracking interviews in Data Science, or any Tech, it is essential you have hands-on knowledge. To practice on real-time projects, I started practising Data Science techniques I had learnt in Dimensionless in my then-current project. Another thing that helped was the Resume Upgrading sessions and Case Studies given by Dimensionless.</p>\n<p>I got a lot of exposure and confidence for interviews. Almost 5-6 job openings were shared every day by the Dimensionless Team. It took me some time but I finally started hearing back from good companies. I got offers from SpectraMedix, Genpact and Excel. My current company wanted to retain me and they offered me an internal transfer. That&#8217;s where my Data Science journey began.</p>\n\n\n\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>My actual Data Science journey began the day I decided to switch careers and enrolled with Dimensionless.</p>\n</blockquote>\n</figure>\n<p>There are many more like Megha who switched to Data Science from different domains. Read their <a href=\"https://dimensionless.in/category/career-transitions/\">success stories here</a>.</p>\n<p>Want to know whether such a Career Transition is possible for you?<br /><strong>Follow this </strong><a href=\"http://dimensionless.in/\"><strong>link</strong></a>, and make it possible with <a href=\"http://dimensionless.in\">Dimensionless Techademy</a>!</p>\n\n\n\n<p>Furthermore, if you want to read more about data science, you can <strong>read our blogs </strong><a href=\"http://dimensionless.in/blog\"><strong>here</strong></a><strong>.</strong></p>\n\n\n",
  "wfw:commentRss": "https://dimensionless.in/test-engineer-data-science/feed/",
  "slash:comments": 0
}