{
  "title": "S14 Ep101: Facing Death To Fight The Devil",
  "link": "https://audioboom.com/posts/8098529",
  "itunes:episode": 101,
  "itunes:title": "Facing Death To Fight The Devil",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6364,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Reverend Shawn Whittington is an Ordained and trained Registered Exorcism - Deliverance Minister. His wife Sharon is a near death experience survivor, a certified Stephen Minister through her Lutheran faith, and a sensitive/ intuitive. (Both have suffered and survived severe demonic attacks.) They are a husband and wife ghost busting team based in Las Vegas, Nevada with over 40 years combined experience. Rev. Shawn joins us today to talk about his beginnings, fight with evil, and how he has survived and helped others!<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nYou know that person who’s just a gift enigma, completely impossible to shop for? Bombas is the gift even that person will love. Go to <a href=\"http://BOMBAS.com/DARKNESS\">BOMBAS.com/DARKNESS</a> TODAY, and get twenty percent off your first purchase!",
  "itunes:summary": "Reverend Shawn Whittington is an Ordained and trained Registered Exorcism - Deliverance Minister. His wife Sharon is a near death experience survivor, a certified Stephen Minister through her Lutheran faith, and a sensitive/ intuitive....",
  "pubDate": "Sun, 08 Dec 2019 10:00:00 +0000",
  "guid": "89121947-4339-46fc-a49f-f3724f314604",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}