{
  "title": "The Minimum Wage and Labour Market Dynamics with Jonathan Meer",
  "pubDate": "Fri, 14 Dec 2018 17:38:20 +0000",
  "guid": "3f72f5acee754af6a7ddb02e1fd713ea",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP110Meer_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href=\"http://people.tamu.edu/~jmeer/\" target=\"_blank\" rel=\"noopener\">Jonathan Meer</a> of Texas A&M. We discuss <a href=\"https://economics.mit.edu/files/9497\" target= \"_blank\" rel=\"noopener\">his work on the minimum wage</a>.</p> <blockquote>The voluminous literature on minimum wages offers little consensus on the extent to which a wage floor impacts employment. For both theoretical and econometric reasons, we argue that the effect of the minimum wage should be more apparent in new employment growth than in employment levels. In addition, we conduct a simulation showing that the common practice of including state-specific time trends will attenuate the measured effects of the minimum wage on employment if the true effect is in fact on the rate of job growth. Using three separate state panels of administrative employment data, we find that the minimum wage reduces net job growth, primarily through its effect on job creation by expanding establishments. These effects are most pronounced for younger workers and in industries with a higher proportion of low-wage workers.</blockquote> <hr /> <p> </p>",
  "content:encoded": "<p>Today's guest is <a href=\"http://people.tamu.edu/~jmeer/\" target=\"_blank\" rel=\"noopener\">Jonathan Meer</a> of Texas A&M. We discuss <a href=\"https://economics.mit.edu/files/9497\" target= \"_blank\" rel=\"noopener\">his work on the minimum wage</a>.</p> The voluminous literature on minimum wages offers little consensus on the extent to which a wage floor impacts employment. For both theoretical and econometric reasons, we argue that the effect of the minimum wage should be more apparent in new employment growth than in employment levels. In addition, we conduct a simulation showing that the common practice of including state-specific time trends will attenuate the measured effects of the minimum wage on employment if the true effect is in fact on the rate of job growth. Using three separate state panels of administrative employment data, we find that the minimum wage reduces net job growth, primarily through its effect on job creation by expanding establishments. These effects are most pronounced for younger workers and in industries with a higher proportion of low-wage workers.  <p> </p>",
  "enclosure": "",
  "itunes:duration": "53:51",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of Texas A&M. We discuss . The voluminous literature on minimum wages offers little consensus on the extent to which a wage floor impacts employment. For both theoretical and econometric reasons, we argue that the effect of the...",
  "itunes:episode": 110,
  "itunes:episodeType": "full"
}