{
  "title": "Feds charge former MoviePass execs with securities and wire fraud",
  "description": "<p>The former executives in charge of <a href=\"https://www.engadget.com/moviepass-beta-launch-date-details-waitlist-movies-144903613.html\">MoviePass</a> have been indicted in what the Justice Department calls \"a scheme to defraud investors.\" Ex-MoviePass CEO J. Mitchell Lowe and Theodore Farnsworth, who used to be the chairman of the service's former parent company Helios and Matheson Analytics (HMNY), have been <a href=\"https://www.justice.gov/opa/pr/former-ceos-moviepass-and-parent-company-charged-securities-fraud-scheme\">charged with</a> one count of securities fraud and three counts of wire fraud. Federal authorities accuse them of making materially false and misleading claims regarding MoviePass' business in press releases, interviews and even SEC filings in a bid to artificially inflate HMNY's stocks and entice new investors.&nbsp;</p><p>According to the newly unsealed court documents, Farnsworth and Lowe allegedly knew from the start that the business' $9.95 \"unlimited\" plan was a temporary gimmick to attract new subscribers and, hence, artificially inflate HMNY's stock prices. They also falsely claimed that the business model was tested to be sustainable and that it was possible to become profitable on subscription fees alone, the feds said.&nbsp;</p><span id=\"end-legacy-contents\"></span><p>In addition, the executives allegedly claimed that HMNY had \"big data\" and AI technologies that could be used to generate revenue for the company by analyzing data collected from MoviePass subscribers. The indictment accuses them of making the claim even though they knew that HMNY did not have the technology or the capability to monetize subscriber data.&nbsp;</p><p>Another allegation against the executives is that they'd made false representations that MoviePass was earning considerable money from multiple revenue streams. The business did not have a non-subscription revenue stream that would make it self-sufficient or offset its losses, according to authorities. Farnsworth and Lowe were also accused of implementing various tactics to prevent certain subscribers from being able to use their \"unlimited\" service. If you'll recall, MoviePass had to <a href=\"https://www.engadget.com/moviepass-settles-with-ftc-122507602.html\">settle with the FTC in 2021</a> over allegations that it invalidated subscriber passwords on purpose to give it sufficient reason to freeze accounts of frequent users.&nbsp;</p><p>In a statement made to <a href=\"https://www.theverge.com/2022/11/4/23441119/moviepass-fraud-criminal-charges-mitch-lowe-hmny\"><em>The Verge</em></a>, the spokesperson for Farnsworth said: \"The indictment repeats the same allegations made by the Securities and Exchange Commission in the Commission's recent complaint filed on September 27th against Mr. Farnsworth, concerning matters that were publicly disclosed nearly three years ago and widely reported by the news media. As with the SEC filing, Mr. Farnsworth is confident that the facts will demonstrate that he has acted in good faith, and his legal team intends to contest the allegations in the indictment until his vindication is achieved.\"</p><p>The <a href=\"https://www.engadget.com/sec-sues-moviepass-executives-220027888.html\">SEC sued MoviePass</a> for fraud back in September and also accused the executives of misleading investors about the viability of the company's $9.95-per-month business model. Despite its tumultuous past and all the accusations the former people in charge still have to face, <a href=\"https://www.engadget.com/moviepass-relaunch-beta-chicago-dallas-kansas-city-185321715.html\">MoviePass is back</a>. Stacy Spikes, its original co-founder, purchased it back after HMNY filed for bankruptcy. The service relaunched in September 5th and now charges subscribers $10 a month for up to three movies, $20 a month for up to four and $30 for a maximum of five movies a month.&nbsp;</p><p>As for Farnsworth and Lowe, they're now facing a maximum penalty of 20 years in prison for each count of securities and wire fraud.</p>",
  "link": "https://www.engadget.com/charge-former-moviepass-execs-securities-wire-fraud-103054548.html?src=rss",
  "source_id": "engadget_479",
  "guid": "668d1c6e-c546-425c-b6b3-9571c124f47c",
  "dc:creator": "Mariella Moon",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Sat, 05 Nov 2022 10:30:54 +0000",
  "ingested": 1667643659,
  "modified": "2022-11-05T10:21:03+00:00",
  "category": [
    "Company Legal & Law Matters",
    "Business",
    "Society & Culture",
    "Crime & Justice",
    "Finance",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Mariella Moon"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "Joe Scarnici via Getty Images",
      "media:description": "LA QUINTA, CA - APRIL 15: Big Boi performs at the MoviePass x iHeartRadio Festival Chateau at The Chateau at Lake La Quinta on April 15, 2018 in La Quinta, California. (Photo by Joe Scarnici/Getty Images for MoviePass)",
      "media:title": "MoviePass x iHeartRadio Festival Chateau"
    }
  ]
}