{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-8617559883051288709",
  "published": "2021-08-18T00:01:00.004+10:00",
  "updated": "2021-08-18T00:01:00.203+10:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "Pixel Buds A-Series: Rich sound, iconic design, just $159",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-um80UoWeD9s/YRuEMiXPEdI/AAAAAAAAC4k/Wp-G3BuaVSIvX-Ep4DOz54ymDtvIoTCAQCLcBGAsYHQ/s2048/Google%2BPixel%2BBuds%2BA-Series%2B%25281%2529.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1366\" data-original-width=\"2048\" height=\"426\" src=\"https://1.bp.blogspot.com/-um80UoWeD9s/YRuEMiXPEdI/AAAAAAAAC4k/Wp-G3BuaVSIvX-Ep4DOz54ymDtvIoTCAQCLcBGAsYHQ/w640-h426/Google%2BPixel%2BBuds%2BA-Series%2B%25281%2529.jpg\" width=\"640\" /></a></div><div><br /><div>When we first introduced our truly wireless Pixel Buds, we were most excited about how such a small product could pack so much functionality. Now, we’re making that same premium sound quality, along with hands-free help from Google Assistant and real-time translation, available at an even more affordable price.&nbsp;</div><div>Introducing Pixel Buds A-Series: rich sound, clear calls and Google helpfulness, all in a low-profile design – for just $159.&nbsp;</div><div><b><br /></b></div><div><b>A premium audio experience&nbsp;</b></div><div>Our research shows that most people describe great sound as full, clear and natural. This is what guides our audio tuning process and shows up in other devices, like Nest Audio. And Pixel Buds A-Series are no exception. Custom-designed 12mm dynamic speaker drivers deliver full, clear and natural sound, with the option for even more power in those low tones with Bass Boost.&nbsp;</div><div>To experience the full range of the speaker’s capabilities, especially in the low frequencies, a good seal is essential. We’ve scanned thousands of ears to make Pixel Buds A-Series fit securely with a gentle seal. In order to keep the fit comfortable over time, a spatial vent reduces in-ear pressure.&nbsp;</div><div>Each earbud also connects to the main device playing audio, and has strong individual transmission power, to keep your sound clear and uninterrupted.&nbsp;</div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-mqpvE4wMprg/YRuEZYWsm9I/AAAAAAAAC4o/oULl7RUu_hwivN7ztfP_NgoHVHApFz8vwCLcBGAsYHQ/s2048/Google%2BPixel%2BBuds%2BA-Series%2B%2528Clearly%2BWhite%2529%2B-%2BCase.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"2048\" data-original-width=\"1333\" height=\"400\" src=\"https://1.bp.blogspot.com/-mqpvE4wMprg/YRuEZYWsm9I/AAAAAAAAC4o/oULl7RUu_hwivN7ztfP_NgoHVHApFz8vwCLcBGAsYHQ/w260-h400/Google%2BPixel%2BBuds%2BA-Series%2B%2528Clearly%2BWhite%2529%2B-%2BCase.png\" width=\"260\" /></a></div>Sound quality can also be affected by your environment. The new Pixel Buds A-Series come with Adaptive Sound, which increases or decreases the volume based on your surroundings. This comes in handy when you're moving from the quiet of your home to somewhere noisy like a city street, or while jogging past a loud construction site.&nbsp;</div><div>And your calls will have great sound too. To make sure your calls are as clear as they can be, Pixel Buds A-Series use beamforming mics to focus on your voice and reduce outside noise, making your calls crystal clear (though of course, overall call quality depends on signal strength, environment, network, and other factors). Once your call is over, quickly get back to your music with a simple “Hey Google, Play my music.”&nbsp;</div><div><br /></div><div><b>Stylish and hardworking&nbsp;</b></div><div>For Pixel Buds A-Series, we wanted to bring back the iconic Clearly White, but added a twist with new grey undertones.&nbsp;</div><div>Pixel Buds’ design is inspired by the idea that great things can come in small packages: Pixel Buds A-Series include up to five hours of listening time on a single charge or up to 24 hours using the charging case. And with the ability to get a quick charge — about 15 minutes in the case gives you up to three hours of listening time — you can keep listening anywhere.1&nbsp;</div><div>They’re comfortable enough for those long listening sessions, and don’t worry if some of that time is devoted to a sweaty workout or a run in the rain: The earbuds are also sweat and water-resistant.2&nbsp;</div><div><b><br /></b></div><div><b>Hands-free access to the best of Google&nbsp;</b></div><div>Google Assistant is built right into the Pixel Buds A-Series. You can get quick hands-free help to check the weather, get an answer, change the volume, or have notifications read to you with a simple “Hey Google.”&nbsp;</div><div><b><br /></b></div><div><b>Added accessories&nbsp;</b></div><div>To help protect your new Pixel Buds A-Series, there is now the Tech21 EvoSlim — a lightweight case to shield your smallest tech from drops and scratches. It is made with a built-in microbe-reducing formula and has an easy-to-attach carabiner to help keep your Pixel Buds A-Series safe and close to hand. Available on the <a href=\"https://store.google.com/product/tech21_buds_a_case?hl=en-GB\">Google Store</a> soon.&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"266\" src=\"https://www.youtube.com/embed/FkquLh_qaQ0\" width=\"320\" youtube-src-id=\"FkquLh_qaQ0\"></iframe></div><div>Pixel Buds A-Series are now available for pre-order in Australia from the <a href=\"https://store.google.com/au/product/pixel_buds_a_series?hl=en-GB\">Google Store</a>, arriving to customers from August 25. Pixel Buds A-Series will be available online from August 25 at JB Hi-Fi, Harvey Norman, and Officeworks, and available at Optus and Vodafones later this year. Pixel Buds A-Series will also be available online at Telstra from August 27. For more country availability and waitlist options, visit <a href=\"http://g.co/pixelbudsaseries\">g.co/pixelbudsaseries</a>.&nbsp;</div><div><br /></div><div><br /></div><div><span style=\"font-size: x-small;\">1 All listening times are approximate and were measured using music playback with pre-production hardware and software, with fully charged Pixel Buds A-Series and case, and other features disabled. Case is used to recharge Pixel Buds A-Series when their batteries are depleted. Charging times are approximate. Use of other features will decrease battery life. Battery life depends on device, features enabled, usage, environment and many other factors. Actual battery life may be lower.&nbsp;</span></div><div><span style=\"font-size: x-small;\">2 Pixel Buds A-Series (earbuds only) have a water protection rating of IPx4 under IEC standard 60529. Water resistance is not a permanent condition and may be compromised by normal wear and tear, repair, disassembly, or damage.&nbsp;</span></div><div><br /></div><div><span class=\"byline-author\">Posted by Matt Gaskell, Director, Devices &amp; Services Business Organisation ANZ</span> <span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}