{
  "title": "504: The Achievements of Women in Harry Potter",
  "link": "https://audioboom.com/posts/7817875",
  "itunes:episode": 504,
  "itunes:title": "The Achievements of Women in Harry Potter",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4552,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Welcome Slug Club guest Olivia!</li>\n<li>The Hogwarts Legacy video game will <a href=\"https://www.polygon.com/22309068/hogwarts-legacy-transinclusive-character-creation-jk-rowling\">reportedly allow</a> for players to customize their character's gender identity. </li>\n<li>To celebrate International Womens Day 2021, the hosts discuss achievements by women in the <em>Harry Potter</em> series</li>\n<li>Not only did Lily Potter save her son, but she ended the war with Voldemort the first time, saving thousands of lives!</li>\n<li>Hermione has saved Ron and Harry's lives more times than we can count!</li>\n<li>Ginny overcame the trauma of Tom Riddle's teenage Horcrux and turned out well adjusted, in spite of a lack of psychological services at Hogwarts</li>\n<li>Fleur Delacour and Nymphadora Tonks distinguish themselves as strong and powerful witches</li>\n<li>Sirius Black's mother defeats the Order of the Phoenix! How comes nobody could get her painting down?</li>\n<li>The hosts uncomfortably talk about Umbridge's attack on Privet Drive and Harry, before they even met. </li>\n<li>Others we discuss include Luna, Professor McGonagall, Narcissa, and Molly.</li>\n<li>Do the ladies on our panel feel like women in the series were brought to the forefront in a way they're happy with<em>?</em>\n</li>\n<li>To wrap up our International Womens Day celebration, the hosts tackle multiple choice trivia questions based on J.K. Rowling's <a href=\"https://harrypotter.fandom.com/wiki/Wizard_of_the_Month#:~:text=Wizard%20of%20the%20Month%20was,the%20first%20of%20every%20month.\">Witch or Wizard of the Month segment</a>\n</li>\n<li>And finally, we recognize that the author herself faced an uphill battle in the publishing industry as a woman, which she overcame.</li>\n<li>Quizzitch: Name this famous female campaigner for breaking the Statute of Secrecy, she's been imprisoned several times for her blatant and deliberate use of magic in public placesVisit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by MD Acne (<a href=\"http://www.mdacne.com/mugglecast\">Take the quiz</a> and get your first month supply for free, just pay shipping) and <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (Get 20% off your first purchase)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 09 Mar 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-08:/posts/7817875",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}