{
  "guid": "urn:uuid:71715422-7c65-4c01-bfdf-de5521ba3117",
  "link": "https://www.who.int/news/item/17-10-2022-towards-stronger-food-safety-systems-and-global-cooperation",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Towards stronger food safety systems and global cooperation",
  "description": "Today WHO launches the WHO Global Strategy for Food Safety 2022-2030, adopted by Member States at the 75th Session of the World Health Assembly - Resolution WHA75(22). The launch marks a milestone in WHO work to promote health, keep the world safe and protect the vulnerable.",
  "pubDate": "Wed, 12 Oct 2022 10:15:34 Z",
  "a10:content": "<div></div><p>Today WHO launches the WHO Global Strategy for Food Safety 2022-2030, adopted by Member States at the 75th Session of the World Health Assembly - <a href=\"https://apps.who.int/gb/ebwha/pdf_files/WHA75/A75(22)-en.pdf\"></a><a href=\"https://apps.who.int/gb/ebwha/pdf_files/WHA75/A75(22)-en.pdf\" target=\"_blank\">Resolution WHA75(22)</a>. The launch marks a milestone in WHO work to promote health, keep the world safe and protect the vulnerable.</p><p>Every year, one in ten people globally fall ill due to foodborne diseases. Contaminated food can cause over 200 diseases, and the magnitude of public health burden is comparable to malaria or HIV AIDS. Children under five are at higher risk, as one in six deaths from diarrhoea are caused by unsafe food. </p><p>The updated WHO Global Strategy for Food Safety is a step towards a safer and healthier world, but also towards strengthening multisectoral collaboration and innovative public health approaches. The Global Food Safety Strategy has been developed to guide and support Member States in their efforts to prioritize, plan, implement, monitor and regularly evaluate actions towards the reduction of the burden of foodborne diseases (FBD) by continuously strengthening food safety systems and promoting global cooperation.</p><p>The Strategy&rsquo;s vision is that all people, everywhere, consume safe and healthy food so as to reduce the burden of FBDs. This strategy gives stakeholders the tools they need to strengthen their national food safety systems and collaborate with partners around the world.</p><p>This new WHO Global Strategy for Food Safety 2022-2030 addresses current and emerging challenges, incorporates new technologies and includes innovative approaches for strengthening food safety systems. It also reflects feedback received through a comprehensive consultation process with Member States and governmental institutions, United Nations agencies and other intergovernmental organizations, academic institutions, non-governmental organizations, private sector entities, and individuals working in public health and food safety.</p><p>The strategy also sets concrete targets and aims to reduce the burden of foodborne diseases by reducing 40% the number of cases of foodborne diarrheal diseases incidence that affects most the children under 5 and other vulnerable populations. It also has a target of 100% of functional coordination mechanisms to manage foodborne events and enhanced laboratory capacity for foodborne disease surveillance.</p><p>The strategy has identified five interlinked and mutually reinforcing strategic priorities with respective strategic objectives. Using the identified five strategic priorities and respective strategic objectives, the strategy aims to build proactive, forward-looking, evidence-based, people-centred, and cost-effective food safety systems with coordinated governance and adequate infrastructures. </p><p><strong>Strategic priorities:</strong></p><ul><li>Strengthening national food control systems. </li><li>Identifying and responding to food safety challenges resulting from global changes and food systems transformation.</li><li>Improving the use of food chain information, scientific evidence and risk assessment in making risk management decisions.</li><li>Strengthening stakeholder engagement and risk communication.</li><li>Promoting food safety as an essential component in domestic, regional and international food trade.</li></ul><p>WHO and the members of the <a href=\"https://www.who.int/groups/technical-advisory-group-on-food-safety-safer-food-for-better-health/about\"></a><a target=\"_blank\" href=\"https://www.who.int/groups/technical-advisory-group-on-food-safety-safer-food-for-better-health\">Technical Advisory Group on Food Safety</a> are working on tools to complement the existing sources from WHO, FAO and other organizations to support Member States in the implementation of the strategy over 2022-2030. The collaboration among different sectors and stakeholders is key for the implementation of the strategy, and the implementation plan of the strategy is aligned with the FAO food safety strategic priorities through a joint coordination framework.</p><p><strong>Background</strong></p><p>In 2020, the Resolution 73.5 titled &lsquo;&lsquo;Strengthening efforts on food safety&rsquo;&rsquo; was adopted by the Seventy-third World Health Assembly. In the resolution, Member States requested WHO to update the WHO Global Strategy for Food Safety to address current and emerging challenges, incorporate new technologies and include innovative approaches for strengthening food safety systems.</p><p>In response to this request, the WHO Secretariat has prepared a WHO Global Strategy for Food Safety with the advice of the Technical Advisory Group (TAG) on Food Safety: Safer food for better health. The current strategy reflects feedback received through a comprehensive consultation process with Member States and governmental institutions, United Nations agencies and other intergovernmental organizations, academic institutions, non-governmental organizations, private sector entities, and individuals working in public health and food safety.&nbsp;</p><p>WHO Global Strategy for Food Safety 2022-2030, adopted by Resolution 75(22) during the 75th World Health Assembly, is available  <a href=\"https://www.who.int/publications-detail-redirect/9789240057685\" target=\"_blank\">here</a>.</p><p>For more information about the strategy, join the launch webinar on October 17 at 12:00 CET. Register <a href=\"https://who.zoom.us/webinar/register/WN_fJl9E3MDTAiG8dALx9bTkQ\"></a><a href=\"https://who.zoom.us/webinar/register/WN_fJl9E3MDTAiG8dALx9bTkQ\" target=\"_blank\">here</a>.</p><p></p>"
}