{
  "title": "ZBT #308: An International Military News Tour!",
  "description": "<p>Presented by Arbortech Tools! Check out arbortechtools.com/zero for the premiere wood carving tools that can turn anybody into an expert wood carver. Promo code \"Zero\" for 10% off already low sale prices!\n\n-3chi.com promo code \"Zero\" for 5% your favorite Delta 8 THC products.\n-InVets.org/Zero, you fill out a profile and you get a free t-shirt. Don't be a dummy, get a free t-shirt\n\nRound 1: Azerbaijan Military began trending on Twitter, on account of it being very, very odd. But…. I LOVE IT! They have the fire, the passion, and the pizzaz I need from a good ole propaganda music video!\n\nRound 2: Although our political climate currently seems like a sitcom that no one would willingly watch, except for maybe those weirdo Walking Dead Fans, the Mexican Defense news story of the week would make an amazing movie. \n\nRound 3: Our friends in Canada freaked people out by using loudspeakers with wolves sounds for a psychological deterrent training session. Would that work? We’ll talk about what would work better. \n\nRound 4: :Russia Claims UK Covid Vaccine Will Turn You Into A Monkey. We’re gonna take a look at the science because that doesn’t seem correct. WE AREN’T SAYING IT ISN’T CORRECT. WE JUST WANNA TAKE A LOOK. Plus, if it does turn you into a monkey… SIGN ME UP!\n\nRound 5: Chaps sat down with Jake Wood, the founder of Team Rubicon and v handsome man!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "195bd012-9cf3-4dc9-b684-63fae85d284a",
  "pubDate": "Tue, 20 Oct 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:13:27",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}