{
  "title": "\"The View\" Hosts Spew McCarthyite Propaganda",
  "itunes:title": "\"The View\" Hosts Spew McCarthyite Propaganda",
  "pubDate": "Fri, 18 Mar 2022 05:55:29 +0000",
  "guid": "6b4bf7f7-ee23-4304-974c-b9aa242caca4",
  "link": "https://thejimmydoreshow.libsyn.com/the-view-hosts-spew-mccarthyite-propaganda",
  "itunes:image": "",
  "description": "<p dir=\"ltr\" data-test-bidi=\"\">The View's Whoopi Goldberg, Joy Behar, Ana Navarro and Sunny Hostin dedicated a full segment to calling Ukraine war critics Tulsi Gabbard and Tucker Carlson as traitors who should be investigated and possibly arrested for questioning the dominant media and government narrative about the conflict.</p> <p dir=\"ltr\" data-test-bidi=\"\">Plus a segment on mainstream journalists' efforts to smear actor, comedian and podcaster Russell Brand for allegedly spreading conspiracies and misinformation on his way to becoming \"The next Joe Rogan.\"<br /> <br /> Also featuring Stef Zamorano, Max Blumenthal, Kurt Metzger and Mike MacRae! And phone calls from Al Pacino and Bernie Sanders!</p>",
  "content:encoded": "<p dir=\"ltr\" data-test-bidi=\"\">The View's Whoopi Goldberg, Joy Behar, Ana Navarro and Sunny Hostin dedicated a full segment to calling Ukraine war critics Tulsi Gabbard and Tucker Carlson as traitors who should be investigated and possibly arrested for questioning the dominant media and government narrative about the conflict.</p> <p dir=\"ltr\" data-test-bidi=\"\">Plus a segment on mainstream journalists' efforts to smear actor, comedian and podcaster Russell Brand for allegedly spreading conspiracies and misinformation on his way to becoming \"The next Joe Rogan.\"  Also featuring Stef Zamorano, Max Blumenthal, Kurt Metzger and Mike MacRae! And phone calls from Al Pacino and Bernie Sanders!</p>",
  "enclosure": "",
  "itunes:duration": "01:17:47",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The View's Whoopi Goldberg, Joy Behar, Ana Navarro and Sunny Hostin dedicated a full segment to calling Ukraine war critics Tulsi Gabbard and Tucker Carlson as traitors who should be investigated and possibly arrested for questioning the dominant...",
  "itunes:episodeType": "full",
  "itunes:summary": "The View's Whoopi Goldberg, Joy Behar, Ana Navarro and Sunny Hostin dedicated a full segment to calling Ukraine war critics Tulsi Gabbard and Tucker Carlson as traitors who should be investigated and possibly arrested for questioning the dominant media and government narrative about the conflict. Plus a segment on mainstream journalists' efforts to smear actor, comedian and podcaster Russell Brand for allegedly spreading conspiracies and misinformation on his way to becoming \"The next Joe Rogan.\" Also featuring Stef Zamorano, Max Blumenthal, Kurt Metzger and Mike MacRae! And phone calls from Al Pacino and Bernie Sanders!"
}