{
  "title": "S17 Ep122: Bitter or Better: The Consequences of Hiring A Hit Man w/ Melisa Schonfield",
  "link": "https://audioboom.com/posts/8172542",
  "itunes:episode": 122,
  "itunes:title": "Bitter or Better: The Consequences of Hiring A Hit Man w/ Melisa Schonfield",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 9514,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>True Crime Tuesday presents Bitter or Better: The Consequences of Hiring A Hit Man with Author, Melisa Schonfield!<br>\n<br>\nHow many times have we been in a situation that pushes us to our limit and we feel we have no way out? For Melisa Schonfield, her breaking point came when the justice system failed her and she decided to take matters into her own hands - by hiring a hitman to kill the abusive father of her daughter and grandson.<br>\n<br>\nMelisa's family was the last place you would expect to find a murder-for-hire plot. These were esteemed members of the community. But having done the wrong thing for the right reason, Melisa had to make choices as she was going through the legal system and divorce. This intense true story shows how she chose to find herself better and not bitter in the midst of chaos and adversity.<br>\n<br>\nMelisa joins TCT to talk about how she has turned adversity into advantage, how her daughter and son cope now, where she is now, and how the entire experience shook out! <br>\n<br>\nPLUS: An ALL NEW Dumb Crimes/Stupid Criminals w/ Beer City Bruiser!<br>\n<br>\nGet your Copy of Bitter or Better: The Melisa Schonfield Story Here:  <a href=\"https://amzn.to/3Ta3XB3\">https://amzn.to/3Ta3XB3</a><br>\n<br>\nProtect your online activity TODAY with the VPN rated #1 by Business Insider. Visit our exclusive link<strong> </strong><a href=\"https://www.expressvpn.com/darkness\">https://www.expressvpn.com/darkness</a><strong> </strong>and you can get an extra 3 months FREE on a one-year package. <br>\n<br>\n#crime #truecrime #truecrimepodcasts #truecrimetuesday #melisaschonfield #bitterorbetter #POSSD # #murder #hitman #NYState #jeffersoncounty #BedfordHills #Taconic #mentalabuse #physicalabuse #medicalneglect  #dumbcrimesstupidcriminals #TimDennis #BeerCityBruiser #ROH #RingofHonorWrestling #floridaman #drugcrimes #foodcrimes #stupidcrimes #funnycrimes<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 11 Oct 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-11:/posts/8172542",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}