{
  "title": "Nevada Governor Candidates Are Debating a ProPublica Investigation — but Not Always Accurately",
  "link": "https://www.propublica.org/article/covid-testing-nevada-northshore-governor-debate",
  "pubDate": "Fri, 28 Oct 2022 06:00:00 -0400",
  "guid": "https://www.propublica.org/article/covid-testing-nevada-northshore-governor-debate",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/anjeanette-damon\">Anjeanette Damon</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. <a href=\"https://www.propublica.org/newsletters/dispatches?source=54G&placement=top-note&region=local\">Sign up for Dispatches</a>, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">A politically connected COVID-19-testing company with a stunningly high error rate in Nevada has become a key issue in the state’s closely fought governor’s race.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">In May, <a href=\"https://www.propublica.org/article/covid-testing-nevada-false-negatives-northshore\">a ProPublica investigation</a> detailed how Gov. Steve Sisolak’s administration fast-tracked the license for Northshore Clinical Labs, a company with ties to a family that has donated nearly $50,000 to his political campaigns since 2011, including $40,000 to his gubernatorial races. The investigation also revealed that the company missed 96% of COVID-19 cases in a sample of 51 PCR tests from the University of Nevada Reno campus, used questionable billing practices and had widespread problems with the testing it provided to five government agencies. The article also noted how the lab was allowed to continue operating in the state despite repeated warnings from public health scientists.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">Now, as Sisolak, a Democrat, seeks a second term, he is fending off relentless Republican attacks labeling him “corrupt” and pointing out that he failed to notify the public of the problematic tests. His opponent, Clark County Sheriff Joe Lombardo, as well as the Republican Governors Association and an independent political action committee, have spent millions of dollars on mailers and television, radio and digital ads hyping the issue. Lombardo’s Republican allies in the Legislature have <a href=\"https://thenevadaindependent.com/article/state-senator-requests-federal-investigation-into-northshore-labs\">unsuccessfully asked for audits and investigations</a> into Northshore’s dealings. And the two candidates for governor <a href=\"https://www.youtube.com/watch?v=QBwO7wABiOU\">spent nearly 10 minutes arguing</a> the issue this month in their only debate.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">“Gov. Sisolak covered up a public health crisis for five months,” Lombardo’s spokesperson, Elizabeth Ray, said. “Sisolak knew about this crisis back in January, and he failed to alert the public. His inaction in this ‘pay-to-plague’ scandal could have cost Nevadans their lives.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">In response, Sisolak’s campaign has accused Republicans of exaggerating the nature of the testing problems and the governor’s role in it.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">“Joe Lombardo and national Republicans have spent tens of millions of dollars spreading lies, misconstruing the truth and misleading Nevadans,” Molly Forgey, Sisolak’s campaign spokesperson, said. “Plain and simple: Republicans are desperate. Lombardo doesn’t have any real plans or vision so instead, he’s scraping the bottom of the barrel in an attempt to shift the narrative away from his pattern of corruption and his out-of-touch stances.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">Shortly after ProPublica published its investigation, a government spokesperson for the Sisolak administration said his office was exploring legal avenues to hold the company accountable for botched testing services that put its customers’ health at risk. This week, however, the spokesperson confirmed the administration has yet to take action beyond assisting <a href=\"https://www.propublica.org/article/northshore-labs-nevada-investigation\">federal investigators looking into Northshore’s practices</a>.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">“I don’t have many updates for you,” spokesperson Meghin Delaney said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">Northshore and its representatives have consistently declined to comment on ProPublica’s reporting.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">As the debate has raged, both sides have bent the facts in making their cases to the voters. According to ProPublica’s extensive reporting on the issue, which included a review of more than 3,000 pages of internal emails, here is what both sides have gotten wrong.</p>\n        \n    \n                        \n    \n        Misleading: “Steve Sisolak’s administration fast-tracked a contract for a shady company tied to a campaign donor.” — A Republican Governors Association ad\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">Among Republicans’ most repeated errors is the claim that Sisolak handed a state contract to the testing company. In some cases, Republicans have accused Sisolak of giving Northshore a $165 million contract.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">In reality, the state did not sign a contract with Northshore, nor did it pay the company $165 million. That figure is the total amount of money the company, which says it operated in more than 20 states at the height of the pandemic, billed the federal government for COVID-19 tests it said it provided to people with no health insurance.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">The Sisolak administration, however, did let Northshore jump ahead of other companies waiting for inspections so it could more quickly obtain its state laboratory license.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">Northshore had contracted with brothers Gregory and Angelo Palivos to build clientele and manage its operations in Nevada. Their parents, Peter and Vicky Palivos, have donated heavily to Sisolak’s campaign and are personal friends of the governor’s. The Palivos brothers worked with an influential lobbyist who used his ties to the administration to help Northshore with its state laboratory license.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.4\">After the lobbyist emailed Sisolak’s chief of staff, the head of the licensing bureau urged the health inspectors to move up Northshore’s inspection.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.5\">“I want to let you know how frustrating it is to have my staff schedule their inspections only to have labs use previous directors to influence or pressure us into having businesses that they represent, jump ahead of others that are patiently waiting for their inspections,” the state’s lead inspector wrote to his boss in an email obtained by ProPublica.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.6\">In a written statement earlier this year, a spokesperson for the Palivos brothers said they were unaware of Northshore’s problems when they were hired to manage its Nevada operations. The spokesperson said they were driven by their desire to help Nevada in the middle of a testing crisis and that they relied on Northshore “for standard operating procedures, licensing, compliance, test supplies, molecular lab work, reporting of test results, and billing.” She also said the Palivos brothers pushed the company to fix the problems with its tests before the state became involved.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.7\">Sisolak has repeatedly said he had no conversations about Northshore with Palivos family members. The Palivos brothers also said they never spoke with the governor about their testing business.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.8\">“This guy — on my life, on my mother, my children, my wife’s life — never asked me about this testing company,” Sisolak said during the Oct. 2 gubernatorial debate, referring to Peter Palivos. “Never talked to me. Never sent me an email. Never made a phone call. Never sent me a text. Never did anything. They followed the procedures. That’s what happened.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.9\">The Palivos family’s political donations didn’t stop amid the Northshore debacle. On Jan. 17, three days after the state scheduled its investigation into complaints about Northshore’s operations, a limited liability company operated by Peter and Vicky Palivos donated $10,000 to Sisolak’s campaign.</p>\n        \n    \n                        \n    \n        Incorrect: “Now, Sisolak is under federal investigation.” — Better Nevada PAC ad\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.0\">Both the Lombardo campaign and the Better Nevada PAC, which said it has spent more than $1 million on ads about Northshore, have claimed Sisolak is being investigated by the federal government.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.1\"><a href=\"https://www.propublica.org/article/northshore-labs-nevada-investigation\">ProPublica confirmed</a> that the Inspector General’s Office of the U.S. Department of Health and Human Services expanded its investigation into Northshore to Nevada after the initial story ran in May. An email from the OIG investigator did not indicate that Sisolak or his administration were under investigation.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.2\">“Myself and other law enforcement agencies have had a case opened regarding Northshore Clinical Lab for quite some time,” wrote Special Agent Peter Theiler, who is based in Chicago. “After reading the ProPublica article on Northshore Clinical Lab regarding Nevada patients, we are interested in obtaining records related to testing for COVID-19 for Northshore Clinical Lab rapid test results and PCR test results for Nevada.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.3\">Spokespeople for both Lombardo’s campaign and the Better Nevada PAC point to the Sisolak administration’s comments about the OIG investigation as evidence Sisolak himself is under investigation.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.4\">But that’s not supported by public records. The OIG has declined to comment on the investigation.</p>\n        \n    \n                        \n    \n        Incorrect: “As soon as we found out, their license was revoked.” — Sisolak during his Oct. 2 debate with Lombardo\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.0\">The state never revoked Northshore’s license. Instead, it tried working with the company to bring it into compliance before ultimately closing the license at the company’s request.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.1\">Delaney declined to address this inaccuracy when ProPublica asked about it. His campaign spokesperson also did not explain the inaccuracy.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.2\">That’s not to say Sisolak’s administration ignored the problem. The Nevada Bureau of Health Care Quality and Compliance immediately began investigating after the Washoe County Health District filed a complaint detailing errors with the company’s PCR tests.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.3\">Northshore had been conducting both rapid and PCR tests. In “several hundred”cases, the rapid test came back positive, but the PCR test came back negative, according to a Jan. 10 email from Washoe County Health District’s epidemiology manager. At state and local health officials’ urging, Northshore voluntarily stopped using PCR tests. However, state officials allowed the company to continue conducting rapid tests across the state despite it not having the proper licensing to do that.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.4\">In their investigation, state inspectors noted deficiencies with Northshore’s operations and were working with the company to correct them. During that process, Northshore abruptly announced it was pulling out of the state and asked for its license to be closed.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.5\">State officials closed the license but also reported their findings to Centers for Medicare and Medicaid Services, the State Board of Nursing and the company itself.</p>\n        \n    \n                        \n    \n        Incorrect: “We were cooperating in a federal investigation.” — Sisolak during the debate\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.0\">During the debate, moderator Jon Ralston asked Sisolak <a href=\"https://www.youtube.com/watch?v=QBwO7wABiOU\">why he never alerted the public</a> to the problems with Northshore’s tests when he became aware of them in January 2022.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"9.1\">“We were cooperating in a federal investigation into the company, which we’re still cooperating with,” Sisolak answered.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.0\">According to documents obtained by ProPublica, however, the federal investigation into Northshore didn’t include its Nevada operations until May, after the ProPublica story ran.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.1\">The governor may have misspoken. (Delaney and Forgey also refused to address this inaccuracy.) At the time, Nevada health officials had launched a state investigation into the reported testing inaccuracies and told local media they could not comment on the ongoing investigation.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.2\">Sisolak’s answer drew an attack from Lombardo, who said the governor had owed the public a warning for their personal safety.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"11.3\">“You should have, front-facing as the leader of this state, said, ‘Hey, if you took this test, come in and get another test because we have determined they are all false, or the percentage of them, the majority of them were false,’” Lombardo said during the debate.</p>\n        \n    \n                    \n\n    <p>\n        <strong><a href=\"https://www.propublica.org/getinvolved/send-propublica-story-tips\">Do You Have a Tip for ProPublica? Help Us Do Journalism.</a></strong>\n    </p>\n\n        \n                                   ",
  "dc:subject": "",
  "dc:date": "2022-10-28T06:00:00-04:00",
  "dc:creator": "by Anjeanette Damon"
}