{
  "title": "On the Role of Fiducial Structures in Minisuperspace Reduction and Quantum Fluctuations in LQC. (arXiv:2211.01268v1 [gr-qc] CROSS LISTED)",
  "link": "http://arxiv.org/abs/2211.01268",
  "description": "<p>We study the homogeneous minisuperspace reduction within the canonical\nframework for a scalar field theory and gravity. Symmetry reduction is\nimplemented via second class constraints for the field modes over a\npartitioning of the non-compact spatial slice $\\Sigma$ into disjoint cells. The\ncanonical structure of the resulting homogeneous theories is obtained via the\nassociated Dirac bracket which can only be defined on a finite number of cells\nhomogeneously patched together and agrees with the full theory Poisson bracket\nfor the averaged fields. This identifies a finite region $V_o$, the fiducial\ncell, whose size $L$ sets the physical scale over which homogeneity is imposed,\nnamely a wavelength cutoff. The reduced theory results from 1) selecting a\nsubset of $V_o$-averaged observables of the full theory; 2) neglecting\ninhomogeneous $\\vec k\\neq\\mathbf0$ modes with wavelengths $\\lambda\\geq L$ and\n$\\lambda&lt; L$; 3) neglecting boundary terms encoding interactions between\nneighbouring cells. The error made is of order $\\mathcal O(1/kL)$. As a result,\nthe off-shell structures of the reduced theory depend on the size of $V_o$ and\ndifferent $V_o$ identify canonically inequivalent theories whose dynamics\nthough is $V_o$-independent. Their quantisation leads then to a family of\n$V_o$-labeled quantum representations and the quantum version of an active\nrescaling of $V_o$ is implemented via a suitable dynamics-preserving\nisomorphism between the different theories. We discuss the consequences for\nstatistical moments, fluctuations, and semiclassical states in both a standard\nand polymer quantisation. For a scalar field of mass $m$, we also sketch the\nquantum reduction and identify a subsector of the QFT where the results of\nthe\"first reduced, then quantised\" theories can be reproduced with good\napproximation as long as $m\\gg1/L$. Finally, a strategy to include\ninhomogeneities in cosmology is outlined.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Mele_F/0/1/0/all/0/1\">Fabio M. Mele</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Munch_J/0/1/0/all/0/1\">Johannes M&#xfc;nch</a>"
}