{
  "id": "yt:video:xXIG8DiMmw8",
  "yt:videoId": "xXIG8DiMmw8",
  "yt:channelId": "UCTUtqcDkzw7bisadh6AOx5w",
  "title": "This Rhythm Is Impossible",
  "link": "",
  "author": {
    "name": "12tone",
    "uri": "https://www.youtube.com/channel/UCTUtqcDkzw7bisadh6AOx5w"
  },
  "published": "2022-10-07T17:00:45+00:00",
  "updated": "2022-10-07T17:00:45+00:00",
  "media:group": {
    "media:title": "This Rhythm Is Impossible",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Not hard, just impossible.\nSupport 12tone on Patreon to help us keep making cool videos! https://www.patreon.com/12tonevideos\n\nThe word \"impossible\" gets thrown around a lot in music, but usually what we really mean is just extremely difficult. That's not always the case, though: Sometimes, there are musical ideas so complicated that they wind up being not just physically impossible, but conceptually impossible as well. But did Brahms write one of those? Well... It's complicated.\n\nMerch: http://standard.tv/12tone\nDiscord: https://discord.gg/pq2QBEw\nFacebook: https://www.facebook.com/12tonevideos\nTwitter: https://twitter.com/12tonevideos\nTwitch: https://www.twitch.tv/12tonevideos\nEmail: 12tonevideos@gmail.com\n\nScript: https://tinyurl.com/mwb5t7tn\n\nHuge thanks to our Elephant Club members:\n\nSusan Jones\nJill Jones\nDuck \nHoward Levine\nLen Lanphar\nWarren Huart\nKen Arnold\nKevin Wilamowski\nGrant Aldonas\nElaine Pratt\nWilliam (Bill) Boston\nChris Prentice\nJack Carlson\nChristopher Lucas\nAndrew Beals\nDov Zazkis\nHendrik P\nThomas Morley\nJacob Helwig\nDavis Sprague\nKelly Christoffersen\nBraum Meakes\nDonal Botkin\nHendrik Stüwe\nStephen Cook\nDan Bonelli\nKevin Boyce\nDavid Bartz\nDarius Rudominer\nLuke\nIan Seymour\nDhruv Monga\nKen Jones\nObadiah Wright\nCarlos Rendon\nKylie McInnes\nJody \nDamien Fuller-Sutherland\nPhilRosas \nReiji Kobayashi\nNeil Moore\nCatherine Berry\nMatt Ivaliotes\nKai\nChris Davis\nLiz Webb\nLuke Klima\nFred Kroon\nOrionWolfie \nLaurence T Maloney\nOliver Marchand\nHardScale\nChris Piro\nMatt Robbins\nRyan Evans\nShanta Kaneshiro\n\nAnd thanks as well to Henry Reich, Gabi Ghita, Gene Lushtak, Eugene Bulkin, Logan Jones, Oliver, Anna Work, Adam Neely, Rick Lees, Dave Mayer, CodenaCrow, Arnas, Caroline Simpson, Michael Alan Dorman, Blake Boyd, Charles Gaskell, Trevor Sullivan, Tom Evans, JH, David Conrad, Ducky, Todd Davidson, Chris Borland, Jake Lizzio, Chris Connett, Elliot Burke, Tim S., Elias Simon, Kenneth Kousen, h2g2guy, W. Dennis Sorrell, Jerry D. Brown, Ohad Lutzky, Peter Leventis, Symmetry, James A. Thornton, Andrew Engel, Peter Brinkmann, Stefan Strohmaier, Shadow Kat, Adam Wurstmann, Michael Mol, Angela Flierman, Richard T. Anderson, Kevin Johnson, naomio, Alex Mole, Joshua La Macchia, Rodrigo \"rrc2soft\" Roman, Jeremy Zolner, Patrick Callier, Francois LaPlante, Volker Wegert, Britt Ratliff, John Bejarano, Betsy, Tonya Custis, Dave Shapiro, Jacopo Cascioli, Gary Butterfield, Steve Brand, Rene Miklas, Rafael Martinez Salas, Walther, Red Uncle, Graeme Lewis, Jake Sand, Doug Nottingham, Nicholas Wolf, Robert Beach, Jason Nebergall, Jim Hayes, Scott Albertine, Mathew Wolak, S, Lincoln Mendell, Evan Satinsky, Conor Stuart Roe, Sam Rezek, Destros, Lucas Augusto, ZagOnEm, RaptorCat, Dragix PL, Jigglypuffer, leftaroundabout ., Mikely Whiplash, Austin Amberg, Kottolett, Dylan Vidas, Francisco Rodrigues, Michael Tsuk, ThoraSTooth, Brandon Legawiec, Hikaru Katayamma, Brian Miller, Rob Hardy, Bryn Davis, Pamela O'Neill, Patrick Chieppe, Eric Stark, David Haughn, Gordon Dell, Byron DeLaBarre, Matty Crocker, anemamata, Lee-orr Orbach, Eric Plume, Thomas Morgan, Ludwick Kennedy, Caitlin Olsen, Jason Peterson, Peggy Youell, Ridley Kemp, Mark James, EJ Hambleton, Jos Mulder, Daryl Banttari, J.T. Vandenbree, Adam Ziegenhals, Mark, Amelia Lewis, sonicolasj, John Castle, Kristofer Hill, William Merryman, Ryan Mayle, Justin St John-Brooks, AkselA, Sam Plotkin, David MacDonald, Nellie Speirs Baron, Charles R., Joshua Lewis, DialMForManning, Joseph Satin, Piush Dahal, Matthew Moore, Sam, Wayne Weil, Andrew Wyld, JD White, David T Peterson, Bryan C. Mills, Joe Johnston, Jordan Friendshuh, XCompWiz, Michael Blaby, Bean, A Devoted Servant, Milan Brezovsky, Edmund Horner, NinoDoko, vivi mouse emoji, Claymore Alexander, Dixon Roberts, M. Bock, Daniel Joseph Moynihan, gunnito, Josh Witkowski, Coffee, Graham Orndorff, Jason McPherson, Chris Robson, A.J. Yates, Matt Moulder, Leander Tietjen, Joel LaRosa, Daniel Sim, Alex Tafur, findRED, Howl’s one-handed, Gary Backaus, Chris Breault, David Wagner, Jeffrey Mann, Drunk Wookiee, Eugen Lounkine, Fernando Gros, Geoffrey Barnett, OVB_2nd, William, Joe Molloy, Douglas Anderson, Foreign Man, Vigilance Deadname, Boomer Dell, RoxyPop, Paul Tanenholz, Lev, Justin Zboyovski, Adam Poata-Smith, J.R. Hyde, A, Tom, Christopher Beattie, triskadecaepyon, Abie, Charles Jordan, Kelly Walker, William Christie, Taylor Malik, Stephen Tolputt, Patterner, Messier42, Bradley Crowley, Mark Mitchell Gloster, Andy Maurer, William Spratley, Samuel Ollesh, Don Jennings, Cormag81, Derek Hiemforth, Bryan, Mikeyxote, Milan Durnell, Dan Whitmer, Thel 'Vadam, Cole McIntyre, Andrew Herald, Mireille C, Justin Carpenter, N Zaph, David Dynes, M3RK Chaos, Marc Testart, Charles Miller, Ceri Williams, Peter, Michael Morris, Bill Owens, Stephanie Miller, Martin Romano, George Burgyan, Patrick Jillett, Belinda Reid, and rpenguinboy! Your support helps make 12tone even better!\n\nAlso, thanks to Jareth Arnold!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}