{
  "title": "How e-commerce merchants can capture growth in international markets",
  "link": "https://e27.co/how-e-commerce-merchants-can-capture-growth-in-international-markets-20220418/",
  "dc:creator": "Rajkishore Agrawal",
  "pubDate": "Fri, 28 Oct 2022 06:00:15 +0000",
  "category": [
    "Community",
    "Consumer",
    "E-commerce",
    "Fintech",
    "PayPal Pte Ltd"
  ],
  "guid": "https://e27.co/?p=457770",
  "description": "<p>Global e-commerce markets are increasing, creating plenty of opportunities for local small and medium-sized businesses (SMBs) to grow beyond their borders. In 2021, over 300 Singaporean companies ventured overseas, in an expansion estimated to generate SG$4.6 billion in overseas sales. Consider the United States, the largest export partner for Singapore. While just 12 per cent [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/how-e-commerce-merchants-can-capture-growth-in-international-markets-20220418/\">How e-commerce merchants can capture growth in international markets</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<img loading=\"lazy\" class=\"aligncenter wp-image-457821 size-full\" src=\"https://e27.co/wp-content/uploads/2022/04/e27-26.png\" alt=\"\" width=\"690\" height=\"390\" />\n<p>Global e-commerce markets are increasing, creating plenty of opportunities for local small and medium-sized businesses (SMBs) to grow beyond their borders. In 2021, over 300 Singaporean companies ventured overseas, in an expansion estimated <a rel=\"follow\" href=\"https://www.techinasia.com/singapore-tech-firms-successful-expansions\">to generate SG$4.6 billion in overseas sales</a>.</p>\n<p>Consider the United States, the largest export partner for Singapore. While just 12 per cent of the e-commerce market comprises international sales, cross-border shopping has grown <a rel=\"follow\" href=\"https://www.statista.com/statistics/1175801/cross-border-web-sales-yoy-growth-usa/\">42 per cent since 2019</a>, which points to the substantial growth potential.</p>\n<p>According to the <a rel=\"follow\" rel=\"follow\" href=\"https://newsroom.apac.paypal-corp.com/PayPal-survey-shows-adaptability-of-SMBs-in-Singapore-to-survive-and-thrive-during-pandemic\">PayPal Singapore Online SMB Survey 2021</a><u>,</u> 81 per cent of SMBs in Singapore are already engaged or planning to engage in cross-border trade. A successful cross-border strategy equally needs a robust international payments approach.</p>\n<p>As we see more SMBs make the step into cross-border trade, I believe that five key principles will help bring them one step closer to success.</p>\n<h1>Winning new customers through payments security</h1>\n<p><a rel=\"follow\" href=\"https://e27.co/there-is-a-concerning-lack-of-cybersecurity-talent-heres-how-to-tackle-it-20220128/\">Most people are security conscious</a> when shopping online. <a rel=\"follow\" href=\"https://www.thedrum.com/news/2021/12/10/consumers-asia-pacific-want-businesses-address\">In Singapore, 82 per cent of consumers consider security as the most important factor in online transactions.</a> These security concerns are amplified when consumers shop from merchants overseas.</p>\n<p>Creating a secure checkout experience is key to easing customer concerns. Using payment processors with poor security standards exposes customers to risk and can harm a brand’s reputation.</p>\n<p>By contrast, merchants who adopt reliable and secure digital payment options can gain customer trust and brand loyalty.</p>\n<h2>Localise payment options</h2>\n<p>Understanding local payment preferences is a fundamental part of driving conversion. <a rel=\"follow\" rel=\"follow\" rel=\"follow\" href=\"https://newsroom.apac.paypal-corp.com/2021-Borderless-Commerce-Report#:~:text=As%20part%20of%20its%20commitment,to%20identify%20potential%20growth%20areas\">In Japan, consumers overwhelmingly choose credit cards; in mainland China, the digital wallet Alipay is the payment method of choice; while in France, debit cards are the preferred payment method for online shopping</a>.</p>\n<p>Adapting to these different methods has never been easier with global payment solutions that can present consumers across different markets with their locally preferred options.</p>\n<h2>Know your consumer trends and preferences</h2>\n<p>Catering to consumer trends and preferences requires another layer of consideration, the unique characteristics of local market consumers.</p>\n<p>Concerns about delivery time and costs and the proliferation of counterfeit goods remain the major cross-border barriers for American online shoppers. <a rel=\"follow\" rel=\"follow\" rel=\"follow\" href=\"https://newsroom.apac.paypal-corp.com/2021-Borderless-Commerce-Report#:~:text=As%20part%20of%20its%20commitment,to%20identify%20potential%20growth%20areas\">While in mainland China, Singapore’s third-largest export market, mobile-friendly e-commerce websites with Chinese language options are a major draw for cross-border shoppers</a>.</p>\n<p>For continued success across markets, merchants must keep a pulse on evolving consumer behaviour and adapt accordingly. <a rel=\"follow\" href=\"https://newsroom.paypal-corp.com/2022-03-14-Inspiring-Change-in-the-Business-of-Fine-Foods\">Sasha’s Fine Foods</a>, one of our local merchant partners in Singapore, provides a great example.</p>\n<p>Launched in 2011, the company was Singapore’s first online-only grocer. Fast forward to 2020, demand increased by 300 per cent at the pandemic’s peak.</p>\n<p>By pre-empting consumers’ needs and demands, founder Sasha Conlan had systems in place to ensure that her suppliers overseas continued upholding sustainable modes of farming and that her business could keep up with orders.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-can-you-get-ahead-of-the-game-with-e-commerce-in-the-australian-market-20220321/\">How can you get ahead of the game with e-commerce in the Australian market?</a></strong></p>\n<p>Harnessing readily available analytics through e-commerce and payment platforms can provide merchants with real-world insights to optimise their business.</p>\n<h2>Capitalise on holiday seasons</h2>\n<p>Discounts are universally appealing, and gift-giving traditions are relevant among price-conscious consumers.</p>\n<p><a rel=\"follow\" rel=\"follow\" rel=\"follow\" href=\"https://newsroom.apac.paypal-corp.com/2021-Borderless-Commerce-Report#:~:text=As%20part%20of%20its%20commitment,to%20identify%20potential%20growth%20areas\">The global e-commerce phenomenon called Singles Day, or “11.11” in mainland China, in 2019, saw an impressive US$115 billion of online sales across 11 days.</a> Similarly, seasonal events like Diwali also attract strong online participation in India.</p>\n<p>Tracking holiday events across the international market can help merchants become locally relevant and top of mind as consumers hunt for deals.</p>\n<h2>Drive engagement and optimisation through social channels</h2>\n<p>During the pandemic, <a rel=\"follow\" rel=\"follow\" href=\"https://newsroom.apac.paypal-corp.com/PayPal-survey-shows-adaptability-of-SMBs-in-Singapore-to-survive-and-thrive-during-pandemic\">social media emerged as the top growth channel for Singaporean SMBs. Of the SMBs we surveyed, 53 per cent currently use social media to sell their products compared to online marketplaces such as Lazada and Qoo10 (40 per cent) and third-party e-commerce platforms such as Shopify (25 per cent)</a>.</p>\n<p>The borderless nature of social media makes it easier for brands to be discovered and become focal points for loyal customers. The key is to develop curated social media content such as snippets and teasers to engage consumers.</p>\n<p>Merchants should also turn their social media feeds from a shop front into a direct sales channel by including direct payment links to drive conversion.</p>\n<p><a rel=\"follow\" href=\"https://intl.anothersole.com/\">Anothersole</a> is a great example of a Singaporean brand selling globally, which has a strong social media presence through its curated content, amassing nearly 50K followers on Instagram.</p>\n<p>Their effective user-generated campaign using the hashtag #myanothersole also fuels regular follower engagement, with everyday consumers actively sharing how they style their shoes.</p>\n<h2>Punching above our weight has never been easier</h2>\n<p>While Singapore is a small domestic market, we can punch above our weight through cross-border trade. The road to success lies in customer centricity, from understanding consumer trends and adapting to their preferences to creating a secure and frictionless environment from which they can buy.</p>\n<p>With third-party digital platforms and partners making cross-border e-commerce more accessible, it has never been easier to capture global market opportunities.</p>\n<p>As we look ahead, I hope to see even more local merchants of all shapes and sizes become famous international brands selling to consumers worldwide. To me, this is the spirit of Singapore.<a rel=\"follow\" href=\"#_ftnref1\" name=\"_ftn1\"></a><a rel=\"follow\" href=\"#_ftnref7\" name=\"_ftn7\"></a><a rel=\"follow\" href=\"#_ftnref8\" name=\"_ftn8\"></a></p>\n<p>&#8211;</p>\n<p>Editor’s note: <b >e27</b> aims to foster thought leadership by publishing views from the community. Share your opinion by <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/contributor\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://e27.co/contributor\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">submitting</a> an article, video, podcast, or infographic.</p>\n<p>Join our <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://t.me/joinchat/HmTbfBcGCZeykhM8NOlQ-g\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Telegram group</a>, <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/groups/e27co/permalink/886904662065955/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">FB community</a>, or like the <b >e27</b> <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://www.facebook.com/e27/?ref=your_pages\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https://www.facebook.com/e27/?ref=your_pages\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\">Facebook page</a></p>\n<p>Image Credit: PayPal</p>\n<p><a rel=\"follow\" href=\"#_ftnref2\" name=\"_ftn2\"></a></p>\n<p><a rel=\"follow\" href=\"#_ftnref3\" name=\"_ftn3\"></a></p>\n<p><a rel=\"follow\" href=\"#_ftnref5\" name=\"_ftn5\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/how-e-commerce-merchants-can-capture-growth-in-international-markets-20220418/\">How e-commerce merchants can capture growth in international markets</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}