{
  "title": "From Local to Global: Spectral-Inspired Graph Neural Networks. (arXiv:2209.12054v2 [stat.ML] UPDATED)",
  "link": "http://arxiv.org/abs/2209.12054",
  "description": "<p>Graph Neural Networks (GNNs) are powerful deep learning methods for\nNon-Euclidean data. Popular GNNs are message-passing algorithms (MPNNs) that\naggregate and combine signals in a local graph neighborhood. However, shallow\nMPNNs tend to miss long-range signals and perform poorly on some heterophilous\ngraphs, while deep MPNNs can suffer from issues like over-smoothing or\nover-squashing. To mitigate such issues, existing works typically borrow\nnormalization techniques from training neural networks on Euclidean data or\nmodify the graph structures. Yet these approaches are not well-understood\ntheoretically and could increase the overall computational complexity. In this\nwork, we draw inspirations from spectral graph embedding and propose\n$\\texttt{PowerEmbed}$ -- a simple layer-wise normalization technique to boost\nMPNNs. We show $\\texttt{PowerEmbed}$ can provably express the top-$k$ leading\neigenvectors of the graph operator, which prevents over-smoothing and is\nagnostic to the graph topology; meanwhile, it produces a list of\nrepresentations ranging from local features to global signals, which avoids\nover-squashing. We apply $\\texttt{PowerEmbed}$ in a wide range of simulated and\nreal graphs and demonstrate its competitive performance, particularly for\nheterophilous graphs.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Huang_N/0/1/0/all/0/1\">Ningyuan Huang</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Villar_S/0/1/0/all/0/1\">Soledad Villar</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Priebe_C/0/1/0/all/0/1\">Carey E. Priebe</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Zheng_D/0/1/0/all/0/1\">Da Zheng</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Huang_C/0/1/0/all/0/1\">Chengyue Huang</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Yang_L/0/1/0/all/0/1\">Lin Yang</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Braverman_V/0/1/0/all/0/1\">Vladimir Braverman</a>"
}