{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-5641302371161843747",
  "published": "2021-09-30T07:00:00.001+10:00",
  "updated": "2021-09-30T07:00:00.317+10:00",
  "category": "",
  "title": "YouTube Shorts Fund expands to Australia",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-YZbIH7lhcBQ/YVQraM-p4xI/AAAAAAAAC5c/mOkGGaMc6a8t_iv34lvcMe-mk1EzWp2BgCLcBGAsYHQ/s386/Screen%2BShot%2B2021-09-29%2Bat%2B7.00.53%2Bpm.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"370\" data-original-width=\"386\" height=\"307\" src=\"https://1.bp.blogspot.com/-YZbIH7lhcBQ/YVQraM-p4xI/AAAAAAAAC5c/mOkGGaMc6a8t_iv34lvcMe-mk1EzWp2BgCLcBGAsYHQ/s320/Screen%2BShot%2B2021-09-29%2Bat%2B7.00.53%2Bpm.png\" width=\"320\" /></a></div><div>Australian creators are now eligible for a Shorts Fund bonus! We started the YouTube Shorts Fund to reward creators who make creative and unique Shorts - and now we’re expanding eligibility to over 30 new countries, including Australia!&nbsp;</div><div>First <a href=\"https://blog.youtube/news-and-events/10-ways-monetize-youtube/\">announced</a> by Robert Kyncl, YouTube’s Chief Business Officer in August, the US$100M fund will be distributed over 2021-2022. Each month, we’ll invite thousands of <a href=\"https://support.google.com/youtube/thread/119786698/it%E2%80%99s-here-the-youtube-shorts-fund-%F0%9F%92%B0?hl=en\">eligible creators</a> to claim a payment from the Fund. This is the first step in our journey to build a monetisation model for Shorts on YouTube and any creator that meets our eligibility criteria can participate.&nbsp;</div><div>We’re excited about what this means for creators in Australia. Not only does the Shorts Fund reward the next generation of mobile creators for their original contributions to Shorts, it also offers them a new way to earn money and build a business on YouTube.&nbsp;</div><div>YouTube has helped a growing community of creators and artists to transform their creativity into viable businesses. We laid the groundwork for this modern-day creator economy over 14 years ago when we launched the YouTube Partner Program (YPP) — a first-of-its kind business model that shares the majority of revenue generated on the platform with creators. Along the way, we’ve continued investing in new monetisation options for creators beyond advertising, including, <a href=\"https://creatoracademy.youtube.com/page/course/merchandise\">Merchandise</a>, <a href=\"https://creatoracademy.youtube.com/page/course/channel-memberships\">Channel Memberships</a>, <a href=\"https://creatoracademy.youtube.com/page/course/superchat-and-superstickers?hl=en\">Super Chats and Super Stickers</a>. In just over the last three years, we’ve paid more than $30 billion to creators, artists, and media companies. And in Q2 2021, we paid more to YouTube creators and partners than in any quarter in our history.&nbsp;</div><div>What do <a href=\"https://www.youtube.com/c/howridiculous\">How Ridiculous</a>, <a href=\"https://www.youtube.com/channel/UCZ4AMrDcNrfy3X6nsU8-rPg\">Economics Explained</a> and <a href=\"https://www.youtube.com/c/Sakshammagic\">Saksham Magic</a> all have in common? They’re storytellers, directors, editors, marketers, and entrepreneurs — all in one. The incredible range of talents and skills of creators is inspiring. To give creators the opportunities they need to find success, YouTube has evolved from being just a place where people upload and share videos. It’s now a destination where creators can find new audiences, connect with fans in different ways, and build growing businesses. Our shared goal with creators is to help them build robust and diversified business models that work with both their unique content and community of fans.&nbsp;</div><div>Alongside the Shorts Fund, here are more ways creators can make money and build a business on YouTube:&nbsp;</div><div><ul style=\"text-align: left;\"><li><a href=\"https://blog.youtube/news-and-events/introducing-youtube-shorts-fund/\">Shorts Fund</a>&nbsp;</li><ul><li>The YouTube Shorts Fund, a US$100M fund distributed over 2021-2022, launches today! Each month, we'll reach out to thousands of eligible creators to claim a payment from the Fund - creators can make anywhere from US$100 to US$10,000 based on viewership and engagement on their Shorts. The Shorts Fund is the first step in our journey to build a monetisation model for Shorts on YouTube and is not  limited to just creators in YPP — any creator that meets our eligibility criteria can participate. We're also dedicated to providing funding via our <a href=\"https://blog.youtube/news-and-events/youtube-announces-class-2022-application-date-youtubeblack-voices-fund/\">Black Voices Fund</a>.&nbsp;</li></ul><li><a href=\"http://youtube.com/ads\">Ads</a>&nbsp;</li><ul><li>Ads have been at the core of creators’ revenue streams, and continue to be the main way that creators can earn money on YouTube. Creators receive the majority of the revenue generated from ads on YouTube.&nbsp;</li></ul><li><a href=\"https://www.youtube.com/premium\">YouTube Premium</a>&nbsp;</li><ul><li>YouTube Premium is a paid subscription option which enables members to enjoy ad-free content, background playback, downloads, and premium access to the YouTube Music app. The majority of subscription revenue goes to YouTube partners.&nbsp;</li></ul><li><a href=\"https://blog.youtube/creator-and-artist-stories/3-creators-making-most-their-channel-memberships/\">Channel memberships</a>&nbsp;</li><ul><li>With channel memberships, creators can offer exclusive perks and content to viewers who join their channel as a monthly paying member at prices set by the creator.&nbsp;</li></ul><li><a href=\"https://blog.youtube/news-and-events/can-we-chat-hello-super-chat\">Super Chat</a>&nbsp;</li><ul><li>Fans watching livestreams and Premieres can purchase a Super Chat: a highlighted message in the chat stream that stands out from the crowd to get even more of their favorite creator’s attention.&nbsp;</li></ul><li><a href=\"https://blog.youtube/news-and-events/introducing-newest-member-supers-family-super-thanks/\">Super Thanks</a>&nbsp;</li><ul><li>Now viewers can give thanks and appreciation on uploaded videos as well through Super Thanks. As an added bonus, fans will get a distinct, colourful comment to highlight the purchase, which creators can respond to.&nbsp;</li></ul><li><a href=\"https://blog.youtube/news-and-events/introducing-super-stickers\">Super Stickers</a>&nbsp;</li><ul><li>Another way followers can show support during livestreams and Premieres is with Super Stickers, which allows fans to purchase a fun sticker that stands out.&nbsp;</li></ul><li><a href=\"https://support.google.com/youtube/answer/9454088?hl=en\">Merchandise</a>&nbsp;</li><ul><li>The merch shelf allows channels to showcase their official branded merchandise right on their watch page on YouTube. Creators can choose from 30 different retailers globally.&nbsp;</li></ul><li><a href=\"https://blog.youtube/news-and-events/a-new-way-for-artists-to-sell-tickets/\">Ticketing</a>&nbsp;</li><ul><li>Music fans can learn about upcoming concert listings and with a simple click, go directly to our ticketing partners’ sites to purchase tickets.&nbsp;</li></ul></ul>Every new fan that subscribes to their favourite creators’ channels, every new member that joins, every like, comment received and every dollar earned goes into building the business ventures of tomorrow. At YouTube, the passion and ambition of our creators fuels us to continue innovating new ways to help them realise their goals and we are committed to introducing more revenue opportunities for our creators. As creators become the next generation of media companies, we’ll continue to deliver more ways to help them do just that.&nbsp;</div><div><br /></div><div><span class=\"byline-author\">Posted by YouTube Australia</span><span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}