{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-8995948986177995487",
  "published": "2022-05-11T15:05:00.048-04:00",
  "updated": "2022-05-17T15:28:26.694-04:00",
  "title": "I/O 2022: Android 13 security and privacy (and more!)",
  "content": "<span class=\"byline-author\">Posted by Eugene Liderman and Sara N-Marandi, Android Security and Privacy Team</span><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"536\" src=\"https://www.youtube.com/embed/BK3XSF7V704\" width=\"643\" youtube-src-id=\"BK3XSF7V704\"></iframe></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><p>Every year at I/O we share the latest on privacy and security features on Android. But we know some users like to go a level deeper in understanding how we’re making the latest release safer, and more private, while continuing to offer a seamless experience. So let’s dig into the tools we’re building to better secure your data, enhance your privacy and increase trust in the apps and experiences on your devices.  </p><p><strong>Low latency, frictionless security</strong></p><p>Regardless of whether a smartphone is used for consumer or enterprise purposes, attestation is a key underpinning to ensure the integrity of the device and apps running on the device. Fundamentally, key attestation lets a developer bind a secret or designate data to a device. This is a strong assertion: \"same user, same device\" as long as the key is available, a cryptographic assertion of integrity can be made.  </p><p>With Android 13 we have migrated to a new model for the provisioning of attestation keys to Android devices which is known as Remote Key Provisioning (RKP). This new approach will strengthen device security by eliminating factory provisioning errors and providing key vulnerability recovery by moving to an architecture where Google takes more responsibility in the certificate management lifecycle for these attestation keys. You can learn more about RKP <a href=\"https://android-developers.googleblog.com/2022/03/upgrading-android-attestation-remote.html\">here</a>. </p><div class=\"separator\" style=\"clear: both;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhl7PwFzAWGtrX9cfhfNOH_sRYe-Xz8IUhtCFPjXc6nQKL13f8oimenwvtbOCatj2qheFlO98xyEckfs3fOGwzQ2uau1GPgwPT6r1W8PY7tD37dYiQJ9UMKoFw9MvApUkPvV1vivnWolCbr343QV3hACB1-bWwi2nPgJAzsFOTlqaWHgSvcAZIzy5IMew/s1600/RKP.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1532\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhl7PwFzAWGtrX9cfhfNOH_sRYe-Xz8IUhtCFPjXc6nQKL13f8oimenwvtbOCatj2qheFlO98xyEckfs3fOGwzQ2uau1GPgwPT6r1W8PY7tD37dYiQJ9UMKoFw9MvApUkPvV1vivnWolCbr343QV3hACB1-bWwi2nPgJAzsFOTlqaWHgSvcAZIzy5IMew/w613-h640/RKP.png\" width=\"613\" /></a></div></div><p>We’re also making even more modules updatable directly through <a href=\"https://support.google.com/product-documentation/answer/11462338\">Google Play System Updates</a> so we can automatically upgrade more system components and fix bugs, seamlessly, without you having to worry about it. We now have more than 30 components in Android that can be automatically updated through Google Play, including new modules in Android 13 for Bluetooth and ultra-wideband (UWB).  </p><p>Last year we <a href=\"https://security.googleblog.com/2021/04/rust-in-android-platform.html\">talked about</a> how the majority of vulnerabilities in major operating systems are caused by undefined behavior in programming languages like C/C++. Rust is an alternative language that provides the efficiency and flexibility required in advanced systems programming (OS, networking) but Rust comes with the added boost of memory safety. We are happy to report that Rust is being adopted in security critical parts of Android, such as our key management components and networking stacks. </p><p>Hardening the platform doesn’t just stop with continual improvements with memory safety and expansion of anti-exploitation techniques. It also includes hardening our API surfaces to provide a more secure experience to our end users.  </p><p>In Android 13 we implemented numerous enhancements to help mitigate potential vulnerabilities that app developers may inadvertently introduce. This includes making <a href=\"https://developer.android.com/about/versions/13/features#runtime-receivers\">runtime receivers safer</a> by allowing developers to specify whether a particular broadcast receiver in their app should be exported and visible to other apps on the device. On top of this, <a href=\"https://developer.android.com/about/versions/13/behavior-changes-13#intent-filters\">intent filters block non-matching intents</a> which further hardens the app and its components.  </p><p>For enterprise customers who need to meet certain security certification requirements, we’ve updated our security logging reporting to add more coverage and consolidate security logs in one location. This is helpful for companies that need to meet standards like Common Criteria and is useful for partners such as management solutions providers who can review all security-related logs in one place. </p><p><strong>Privacy on your terms</strong></p><p>Android 13 brings developers more ways to build privacy-centric apps. Apps can now implement a new Photo picker that allows the user to select <a href=\"https://developer.android.com/about/versions/13/features/photopicker\">the exact photos or videos</a> they want to share without having to give another app access to their media library.  </p><div class=\"separator\" style=\"clear: both;\"><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhVG6Q5j03b4kbb19uxYXxpbRREbPFl20RPIsDp_-m8eHZGp3zvyYcoxY63WlQzIoYQap8qpw1_A_mvujlprxDbcE1aqDSvfcSZihCi2WkheXOuU06ut6708TK0nEkW3mtXquTg8FpXP67IiD072UR-X5K2LuPqDpyysIdpktAGODo66VZ1_RownbMVQA/s1296/PhotoPicker.gif\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1296\" data-original-width=\"1080\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhVG6Q5j03b4kbb19uxYXxpbRREbPFl20RPIsDp_-m8eHZGp3zvyYcoxY63WlQzIoYQap8qpw1_A_mvujlprxDbcE1aqDSvfcSZihCi2WkheXOuU06ut6708TK0nEkW3mtXquTg8FpXP67IiD072UR-X5K2LuPqDpyysIdpktAGODo66VZ1_RownbMVQA/w533-h640/PhotoPicker.gif\" width=\"533\" /></a></div></div><p>With Android 13, we’re also reducing the number of apps that require your location to function using the nearby devices permission <a href=\"https://android-developers.googleblog.com/2021/05/android-security-and-privacy-recap.html\">introduced last year</a>. For example, you won’t have to <a href=\"https://developer.android.com/about/versions/13/features/nearby-wifi-devices-permission\">turn on location to enable Wi-fi </a>for certain apps and situations. We’ve also <a href=\"https://developer.android.com/about/versions/13/behavior-changes-13#granular-media-permissions\">changed</a> how storage works, requiring developers to ask for separate permissions to access audio, image and video files.  </p><p>Previously, we’ve limited apps from accessing your clipboard in the background and alerted you when an app accessed it. With Android 13, we’re automatically deleting your clipboard history after a short period so apps are blocked from seeing old copied information.  </p><p>In Android 11, we began <a href=\"https://developer.android.com/about/versions/11/privacy/permissions#auto-reset\">automatically resetting permissions</a> for apps you haven’t used for an extended period of time, and have since <a href=\"https://android-developers.googleblog.com/2021/09/making-permissions-auto-reset-available.html\">expanded the feature</a> to devices running Android 6 and above. Since then, we’ve automatically reset over 5 billion permissions.  </p><p>In Android 13, app makers can go above and beyond in <a href=\"https://developer.android.com/about/versions/13/features#developer-downgradable-permissions\">removing permissions</a> even more proactively on behalf of their users. Developers will be able to provide even more privacy by reducing the time their apps have access to unneeded permissions. </p><p>Finally, we know notifications are critical for many apps but are not always of equal importance to users. In Android 13, you’ll have more control over which apps you would like to get alerts from, as new apps on your device are <a href=\"https://developer.android.com/about/versions/13/changes/notification-permission\">required to ask you for permission</a> by default before they can send you notifications. </p><p><strong>Apps you can trust</strong></p><p>Most app developers build their apps using a variety of software development kits (SDKs) that bundle in pre-packaged functionality. While SDKs provide amazing functionality, app developers typically have little visibility or control over the SDK code or insight into their performance.  </p><p>We’re working with developers to make their apps more secure with a new <a href=\"https://goo.gle/play-sdk\">Google Play SDK Index</a> that helps them see SDK safety and reliability signals before they build the code into their apps. This ensures we're helping everyone build a more secure and private app ecosystem.   </p><p>Last month, we also started rolling out <a href=\"https://blog.google/products/google-play/data-safety/\">a new Data safety section</a> in Google Play to help you understand how apps plan to collect, share, and protect your data, before you install it. To instill even more trust in Play apps, we're enabling developers to have their apps independently validated against <a href=\"https://github.com/OWASP/owasp-masvs\">OWASP’s MASVS</a>, a globally recognized standard for mobile app security.   </p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3xQaTmfUanLNiXLrXItyinPvHLr7iU4GScRRpI2Pg9dXFmccOgBx6zZfOfFlyljdsKaH_wi_xCqrcHt_-IatiU1-jVxmiWO3ULI29tP-Wo9xddxABtIxlcJeRMZ7xQaMdvS5M5iwrTQUovG5Q_rJYF89y1DWdN4nH5c6MG8mppfZ04rdMksd3SJT4Wg/s8522/17530%20l%20Images%20for%20Android%20Security%20Blog_01.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"8522\" data-original-width=\"7102\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj3xQaTmfUanLNiXLrXItyinPvHLr7iU4GScRRpI2Pg9dXFmccOgBx6zZfOfFlyljdsKaH_wi_xCqrcHt_-IatiU1-jVxmiWO3ULI29tP-Wo9xddxABtIxlcJeRMZ7xQaMdvS5M5iwrTQUovG5Q_rJYF89y1DWdN4nH5c6MG8mppfZ04rdMksd3SJT4Wg/w533-h640/17530%20l%20Images%20for%20Android%20Security%20Blog_01.png\" width=\"533\" /></a></div><p>We’re working with a small group of developers and authorized lab partners to evolve the <a href=\"https://appdefensealliance.dev/masa\">program</a>. Developers who have completed this independent validation can showcase this on their Data safety section.   </p><p><strong>Additional mobile security and safety</strong></p><p>  </p><p>Just like our anti-malware protection Google Play, which now scans 125 billion apps a day, we believe spam and phishing detection should be built in. We’re proud to announce that in a recent <a href=\"https://omdia.tech.informa.com/commissioned-research/articles/omdia-consumer-mobile-security-scorecard\">analyst report</a>, Messages was the highest rated built-in messaging app for anti-phishing and scams protection. </p><p>Messages is now also helping to protect you against 1.5 billion spam messages per month, so you can avoid both annoying texts and attempts to access your data. These phishing attempts are increasingly how bad actors are trying to get your information, by getting you to click on a link or download an app, so we are always looking for ways to offer another line of defense.  </p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgUjFj-dm2HkOn1SxzGKpgfOUzW_qvQx4yKUJCRoT2U0pmLHwW2Z8g9L6dfvaTVuSndbPS_zNlxHXb2z1Nv0N-PdDaCwDIMdBNZlWeDGCoWtPyWXI5FNh-Jenw5aynMRhpjnG9S2_QUMtNjypdaCdn0HtnnS6t028QAAnyZIPoTX1YBae0UQlCLi7X_6w/s8522/17530%20l%20Images%20for%20Android%20Security%20Blog_02.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"8522\" data-original-width=\"7102\" height=\"640\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgUjFj-dm2HkOn1SxzGKpgfOUzW_qvQx4yKUJCRoT2U0pmLHwW2Z8g9L6dfvaTVuSndbPS_zNlxHXb2z1Nv0N-PdDaCwDIMdBNZlWeDGCoWtPyWXI5FNh-Jenw5aynMRhpjnG9S2_QUMtNjypdaCdn0HtnnS6t028QAAnyZIPoTX1YBae0UQlCLi7X_6w/w533-h640/17530%20l%20Images%20for%20Android%20Security%20Blog_02.png\" width=\"533\" /></a></div><p>Last year, we introduced&nbsp;<a href=\"https://www.android.com/google-features-on-android/summer-2021/#summer-2021-end-to-end-contents\">end-to-end encryption in Messages&nbsp;</a>to provide more security for your mobile conversations. Later this year, we’ll launch end-to-end encryption group conversations in beta to ensure your personal messages get even more protection.</p><p>As with a lot of features we build, we try to do it in an open and transparent way. In Android 11 we announced a new <a href=\"https://security.googleblog.com/2020/10/privacy-preserving-features-in-mobile.html\">platform feature</a> that was backed by an <a href=\"https://www.iso.org/standard/69084.html\">ISO standard</a> to enable the use of digital IDs on a smartphone in a privacy-preserving way. When you hand over your plastic license (or other credential) to someone for verification it’s all or nothing which means they have access to your full name, date of birth, address, and other personally identifiable information (PII). The mobile version of this allows for much more fine-grained control where the end user and/or app can select exactly what to share with the verifier. In addition, the verifier must declare whether they intend to retain the data returned. In addition, you can present certain details of your credentials, such as age, without revealing your identity.  </p><p>Over the last two Android releases we have been improving this API and making it easier for third-party organizations to leverage it for various digital identity use cases, such as driver’s licenses, student IDs, or corporate badges. We’re now announcing that Google Wallet uses Android <a href=\"https://source.android.com/security/features/identity-credentials\">Identity Credential</a> to support digital IDs and driver’s licenses. We’re working with states in the US and governments around the world to bring digital IDs to Wallet later this year. You can learn more about all of the new enhancements in Google Wallet <a href=\"https://blog.google/products/android/ask-a-techspert-google-wallet\">here</a>.</p><p><strong>Protected by Android</strong></p><p>We don’t think your security and privacy should be hard to understand and control. Later this year, we’ll begin rolling out a new destination in settings on Android 13 devices that puts all your device security and data privacy front and center.   </p><div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhMpxpS2sjJ4oxiTGhvyY1v6T1o5asTvjSkeyLP-bkc5ppCodXYaHYVeqfELNXAq-EY36dz-RQo9HWyn7nwFBK3RIAjqQA3a6gq8mhq1vJKRdVM0w170GD0s0awhCIBFMLP1D69ZpHkdLepfcFxM58sSry32BTG7jCwbiHG1Qeiwou0GZNhZY22g0srzA/s1600/single-image.png\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img border=\"0\" data-original-height=\"2176\" data-original-width=\"2476\" height=\"562\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhMpxpS2sjJ4oxiTGhvyY1v6T1o5asTvjSkeyLP-bkc5ppCodXYaHYVeqfELNXAq-EY36dz-RQo9HWyn7nwFBK3RIAjqQA3a6gq8mhq1vJKRdVM0w170GD0s0awhCIBFMLP1D69ZpHkdLepfcFxM58sSry32BTG7jCwbiHG1Qeiwou0GZNhZY22g0srzA/w640-h562/single-image.png\" width=\"640\" /></a></div><p>The new Security &amp; Privacy settings page will give you a simple, color-coded way to understand your safety status and will offer clear and actionable guidance to improve it. The page will be anchored by new action cards that notify you of critical steps you should take to address any safety risks. In addition to notifications to warn you about issues, we’ll also provide timely recommendations on how to enhance your privacy.  </p><p>We know that to feel safe and in control of your data, you need to have a secure foundation you can count on. Because if your device isn’t secure, it’s not private either. We’re working hard to make sure you’re always protected by Android. Learn more about these protections on our <a href=\"android.com/safety\">website</a>.  </p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google",
    "uri": "http://www.blogger.com/profile/11822708545141062574",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}