{
  "title": "How to Increase Housing Affordability: Understanding Local Deterrents to Building Multifamily Housing",
  "link": "https://fedinprint.org/item/fedbwp/94892/original",
  "description": "This paper studies how local land-use regulations and community opposition affect the trade-offs to building single-family, multifamily, and affordable housing and how their effects on rents differ from their effects on house prices. Using lot-level zoning regulations and a boundary discontinuity design at regulation boundaries in Greater Boston, we obtain causal estimates for the effects of zoning regulations on the supply of different types of housing, single-family-house prices, multifamily rents, and households’ willingness to pay for higher density. We find that relaxing density restrictions (minimum lot size and maximum number of dwelling units)—either alone or in combination with relaxing maximum-height restrictions or allowing multifamily housing—is the most fruitful policy reform for increasing the housing supply and reducing multifamily rents and single-family-house prices. However, adopting multifamily zoning or relaxing height regulations alone has little effect on the number of units built or on rents. Moreover, in each land-use relaxation scenario where rents fall, house prices also fall, complicating the political economy of land-use reform. We also find that mature suburbs that are closer to a city center and have a representative town meeting structure of local governance are the most restrictive with respect to adding multi-unit housing. Furthermore, inclusionary zoning policies such as Massachusetts’s Chapter 40B rarely substitute for relaxing zoning regulations, particularly restrictions on building multifamily housing.",
  "guid": "https://fedinprint.org/item/fedbwp/94892/original",
  "dc:creator": "Sood, Aradhya; Chiumenti, Nicholas; Kulka, Amrita",
  "dc:date": "2022-06-01",
  "rdau:hasExtent": 89,
  "dc:subject": "multifamily zoning; height restrictions; density; house prices; rents",
  "swpo:hasNumber": "22-10",
  "identifiers:doi": "10.29412/res.wp.2022.10",
  "bibo:series": "Working Papers"
}