{
  "title": "IKEA Bullies Indie Developer Into Changing Game Set In A Furniture Store",
  "link": "https://www.techdirt.com/2022/11/03/ikea-bullies-indie-developer-into-changing-game-set-in-a-furniture-store/",
  "comments": "https://www.techdirt.com/2022/11/03/ikea-bullies-indie-developer-into-changing-game-set-in-a-furniture-store/#comments",
  "dc:creator": "Dark Helmet",
  "pubDate": "Thu, 03 Nov 2022 19:53:07 +0000",
  "category": [
    1,
    "ikea",
    "fair use",
    "the store is closed",
    "trademark",
    "video games"
  ],
  "guid": "https://www.techdirt.com/?p=381369&#038;preview=true&#038;preview_id=381369",
  "description": "Big businesses really should know better as to how trademark law works. Or, failing that, their corporate counsels should. And yet we see far too often that big businesses take an aggressive approach to anything remotely resembling trademark infringement that they do not like. Take The Store is Closed, an as yet unreleased video game [&#8230;]",
  "content:encoded": "<p>Big businesses really should know better as to how trademark law works. Or, failing that, their corporate counsels should.  And yet we see far too often that big businesses take an aggressive approach to anything remotely resembling trademark infringement that they do not like.</p>\n<p>Take <em>The Store is Closed</em>, an as yet unreleased video game stemming from a Kickstarter campaign.  This game takes place in a neverending furniture store, has horror game and crafting elements, and heavy exploration gameplay. Said horror store briefly is shown to have a blue box architecture, a Scandanavian name, and gray floors.  Basically due to that, IKEA reached out to the game&#8217;s creator, Jacob Shaw, <a href=\"https://kotaku.com/ikea-furniture-horror-game-store-is-closed-kickstarter-1849715848\">demanding that the game be changed</a> to remove all of that &#8220;trademark infringement.&#8221;</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>“Our client has learned that you are developing a video game, ‘The Store is Closed’,” the legal letter explains, “which uses, without our client’s authorization, indicia associated with the famous IKEA stores. Your game uses a blue and yellow sign with a Scandinavian name on the store, a blue box-like building, yellow vertical stiped shirts identical to those worn by IKEA personnel, a gray path on the floor, furniture that looks like IKEA furniture, and product signage that looks like IKEA signage. All the foregoing immediately suggest that the game takes place in an IKEA store.&#8221;</em></p>\n</blockquote>\n<p>Where to begin.  For starters, some of the items listed among the complaints are fleeting at best. For instance, Kotaku&#8217;s review of a build of the game notes that the look of the store and the signage IKEA is complaining about only show up on the menu screen, rather than in the game itself.  Also, IKEA isn&#8217;t mentioned anywhere in the game or the Kickstarter. Instead, the store is named STYR, which is a Swedish word meaning &#8220;controls.&#8221;  As Kotaku notes, IKEA isn&#8217;t even a Swedish or Scandanavian word.  </p>\n<p>As for the claim that the furniture looks like IKEA furniture, well&#8230;</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>Shaw disputes that he designed any furniture with Ikea in mind. “I bought generic furniture asset packs to make this game,” Shaw said, meaning that this is furniture that can be featured in any game for a price. “I don’t know what that means.” The game does, however, have a grey path on the floor. It is also common for stores to have signage that tells the customer where to go.</em></p>\n</blockquote>\n<p>None of this constitutes trademark infringement. But, where IKEA is likely getting irritated is when several press outlets that have reviewed early builds of the game <em>have</em> referenced the company, stating that the store reminds them of playing the whole thing out in an IKEA store.  But that <em>still</em> isn&#8217;t trademark infringement.  The First Amendment allows content creators to create parody or homages using real world brands and this is done all the time. Just think of literally almost everything in many <em>Grand Theft Auto</em> games, for instance.</p>\n<p>But IKEA&#8217;s threat letter demanded Shaw remove all the &#8220;offending&#8221; content within 10 days or risk legal action. And, because trademark bullying works, Shaw is complying.</p>\n<blockquote class=\"wp-block-quote\">\n<p><em>“I was going to spend the last week of my Kickstarter preparing an update for all the new alpha testers,” Shaw told Kotaku. “But now I’ve got to desperately revamp the entire look of the game so I don’t get sued.”</em></p>\n</blockquote>\n<p>All while IKEA is trotting out the well-worn excuse that it had to take these actions or risk losing its trademarks, which also isn&#8217;t true. </p>\n<p>In fact, the real horror here isn&#8217;t so much the game, but the mega-brand that bullied a small creator for no reason.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/03/ikea-bullies-indie-developer-into-changing-game-set-in-a-furniture-store/comments/feed/",
  "slash:comments": 20
}