{
  "title": "Ground Plane Matters: Picking Up Ground Plane Prior in Monocular 3D Object Detection. (arXiv:2211.01556v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01556",
  "description": "<p>The ground plane prior is a very informative geometry clue in monocular 3D\nobject detection (M3OD). However, it has been neglected by most mainstream\nmethods. In this paper, we identify two key factors that limit the\napplicability of ground plane prior: the projection point localization issue\nand the ground plane tilt issue. To pick up the ground plane prior for M3OD, we\npropose a Ground Plane Enhanced Network (GPENet) which resolves both issues at\none go. For the projection point localization issue, instead of using the\nbottom vertices or bottom center of the 3D bounding box (BBox), we leverage the\nobject's ground contact points, which are explicit pixels in the image and easy\nfor the neural network to detect. For the ground plane tilt problem, our GPENet\nestimates the horizon line in the image and derives a novel mathematical\nexpression to accurately estimate the ground plane equation. An unsupervised\nvertical edge mining algorithm is also proposed to address the occlusion of the\nhorizon line. Furthermore, we design a novel 3D bounding box deduction method\nbased on a dynamic back projection algorithm, which could take advantage of the\naccurate contact points and the ground plane equation. Additionally, using only\nM3OD labels, contact point and horizon line pseudo labels can be easily\ngenerated with NO extra data collection and label annotation cost. Extensive\nexperiments on the popular KITTI benchmark show that our GPENet can outperform\nother methods and achieve state-of-the-art performance, well demonstrating the\neffectiveness and the superiority of the proposed approach. Moreover, our\nGPENet works better than other methods in cross-dataset evaluation on the\nnuScenes dataset. Our code and models will be published.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Yang_F/0/1/0/all/0/1\">Fan Yang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_X/0/1/0/all/0/1\">Xinhao Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_H/0/1/0/all/0/1\">Hui Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Guo_Y/0/1/0/all/0/1\">Yuchen Guo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Han_J/0/1/0/all/0/1\">Jungong Han</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ni_K/0/1/0/all/0/1\">Kai Ni</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ding_G/0/1/0/all/0/1\">Guiguang Ding</a>"
}