{
  "id": "https://bibleinoneyear.org/en/youth/183",
  "title": "Day 183: Transform Your World",
  "description": "Psalm 79:8–13, 2 Kings 5:1,9–16, Acts 22:1–16,21.  I have changed from a violent, loveless drug addict to a man who is happily married and full of love  I’m now running Alphas for all types of people, from gangs to grannies, and I’m seeing their lives changed",
  "pubDate": "Sat, 02 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/183/",
  "itunes:duration": "15:53",
  "guid": "enyouth02072022-183",
  "length": 953.73,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 183: Transform Your World",
  "itunes:subtitle": "Psalm 79:8–13, 2 Kings 5:1,9–16, Acts 22:1–16,21.  I have changed from a violent, loveless drug addict to a man who is happily married and full of love  I’m now running Alphas for all types of people, from gangs to grannies, and I’m seeing their lives changed",
  "itunes:summary": "My new friend from Scotland, Dez, told me, ‘I was a doorman; a bouncer. I was quite a violent guy. I took a lot of drugs. I was a cocaine addict. My life revolved around fighting, taking drugs, partying and living in that cycle.’\nHe said, ‘One night I had taken a massive overdose. I felt like I was having a heart attack. My heart was jumping out of my chest. And I cried out in what I didn’t know then was a prayer: to live. And I woke up the next day and I never touched coke again.’\nAfter that, Dez kept meeting Christians. One in particular was Fiona, who really lived out her faith. He asked her out a few times, but she said ‘No’. Mainly because he wasn’t a Christian.\nShe gave him a Bible and he started reading: ‘I started tearing through it trying to find something and I ended up finding Jesus. Suddenly, my whole life made sense.’\nHe called Fiona and asked her to take him to church. There he heard about Alpha. ‘On Alpha, I met Jesus and it changed my life. I was this drug-fuelled, violent person and now I love people and love God. I just want to share my story.’\nDez has just finished his studies in Theology and is working for Alpha Scotland.\nAnd, he married Fiona. He is now a happy husband and a loving father.\nDez sums up his complete transformation: ‘Jesus turned the questions I had about whether God exists into a belief that God cares about me. I have changed from a violent, loveless drug addict to a man who is happily married and full of love. I’m now running Alphas for all types of people, from gangs to grannies, and I’m seeing their lives changed.’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 548
}