{
  "title": "303 - Bruce Damer (Origins of Life/Future in Space)",
  "description": "<p>Bruce Damer is a Canadian-American multi-disciplinary scientist, designer, and author. He collaborates with colleagues developing and testing a new model for the origin of life on Earth and in the design of spacecraft architectures to provide a viable path for expansion of human civilization beyond the Earth. He began his career in the 1980s developing some of the earliest user interfaces for personal computers, led a community in the 1990s bringing the first multi-user virtual worlds to the Internet, and since 2000 supported NASA and the space industry on numerous simulations and spacecraft designs. He has spent 25 years chronicling the history of computing in his DigiBarn Computer Museum and curates archives of counterculture figures such as Dr. Timothy Leary, Terence McKenna and others. He currently serves as Principal Scientist at DigitalSpace; Associate Researcher in the Department of Biomolecular Engineering at UC Santa Cruz; Associate of the NASA Astrobiology Center; Member of the International Society for the Study of the Origin of Life, and Founding Director of the Contact Consortium. He also served as Visiting Scholar at the University of Washington and as a member of the Faculty at Charles University, Prague. Bruce also hosts a podcast called <a href=\"http://www.levityzone.org/\" target=\"_blank\" rel=\"noopener\">Levity Zone</a>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://chrisryan.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">chrisryan.substack.com/subscribe</a>",
  "link": "https://chrisryan.substack.com/p/303-bruce-damer-origins-of-lifefuture-cb5",
  "guid": "b449beaf4cc70e46cadcb6b910ae9e15",
  "dc:creator": "Chris Ryan",
  "pubDate": "Fri, 09 Feb 2018 20:48:02 GMT",
  "enclosure": "",
  "itunes:author": "Chris Ryan",
  "itunes:subtitle": "Bruce Damer is a Canadian-American multi-disciplinary scientist, designer, and author. He collaborates with colleagues developing and testing a new model for the origin of life on Earth and in the design of spacecraft architectures to provide a...",
  "itunes:explicit": "No",
  "itunes:duration": 11354,
  "itunes:image": ""
}