{
  "title": "Alexei Navalny’s Support in the North Caucasus: More About Corruption Than Navalny",
  "link": "https://jamestown.org/alexei-navalnys-support-in-the-north-caucasus-more-about-corruption-than-navalny/",
  "dc:creator": "web1983",
  "pubDate": "Thu, 11 Mar 2021 22:59:29 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=88851",
  "description": "<p>On February 20, Ruslan Ablyakimov was walking in Makhachkala, the capital of Dagestan, with two friends when he was stopped by six young men who proceeded to beat him. “Where did you come here from?” they asked, “You are from Moscow, right? What are you doing here?” Before the men left Ablyakimov, they told him, “You have until tomorrow to &#8230; <a href=\"https://jamestown.org/alexei-navalnys-support-in-the-north-caucasus-more-about-corruption-than-navalny/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/alexei-navalnys-support-in-the-north-caucasus-more-about-corruption-than-navalny/\">Alexei Navalny’s Support in the North Caucasus: More About Corruption Than Navalny</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>On February 20, Ruslan Ablyakimov was walking in Makhachkala, the capital of Dagestan, with two friends when he was stopped by six young men who proceeded to beat him. “Where did you come here from?” they asked, “You are from Moscow, right? What are you doing here?” Before the men left Ablyakimov, they told him, “You have until tomorrow to get out of here” (<a href=\"https://meduza.io/feature/2021/02/20/my-predpolagali-chto-budet-kakaya-to-zhest\">Meduza</a>, February 20).</p>\n<p>Why did these men choose Ablyakimov to beat up? The answer is straightforward: he was the coordinator of the new Navalny Regional Headquarters in Makhachkala. Following this violent event, Ablyakimov complained that he could not find any space to rent for the headquarters, and he ultimately left Dagestan. He promised that this did not mean the headquarters would not open eventually; but its future is uncertain (<a href=\"https://www.kavkaz-uzel.eu/articles/360041/\">Kavkazsky Uzel</a>, February 22).</p>\n<p>Authorities in Dagestan have not been friendly to supporters of Russian opposition leader and anti-corruption crusader Alexei Navalny in recent months. In late January, protests erupted across Russia, including, on a small scale, in Makhachkala. On January 21, a lone protester was detained by the police with his sign that read “Freedom for Navalny/Freedom for political prisoners” (<a href=\"https://www.kavkazr.com/a/31061020.html\">Kavkaz Realii,</a> January 21). Two days later, over 40 protesters were arrested, including students, in the center of Makhachkala, a city of about half a million (<a href=\"https://www.kavkazr.com/a/31065101.html\">Kavkaz Realii</a>, January 23).</p>\n<p>According to journalist Magomed Magomedov, there are two groups of Navalny supporters in Dagestan. The majority of them support his anti-corruption efforts but do not necessarily share his political views; the rest are those who would like to see Navalny as president (<a href=\"https://www.kavkaz-uzel.eu/articles/358895/\">Kavkazsky Uzel</a>, January 21). Neither of these groups are particularly large, and videos of protests in Makhachkala show only a small crowd—tens, not hundreds (<a href=\"https://www.kavkazr.com/a/31065101.html\">Kavkaz Realii</a>, January 23).</p>\n<p>These protests, which occurred all across Russia, took on a different meaning in the North Caucasus. Indeed, in Makhachkala, protesters frequently distanced themselves from Navalny and said that their actions were in response to dissatisfaction with the authorities in general (<a href=\"https://www.eng.kavkaz-uzel.eu/articles/53543/\">Kavkazsky Uzel</a>, February 1). While protests against corruption in the North Caucasus are not an everyday occurrence, there is precedent. In 2017, a few hundred demonstrators came out to support Navalny’s anti-corruption message (<a href=\"https://www.kavkaz-uzel.eu/articles/304200/\">Kavkazsky Uzel</a>, June 12, 2017).  Earlier, in October 2011, hundreds protested corruption in Makhachkala itself (see <a href=\"https://jamestown.org/program/peaceful-dissent-grows-in-dagestan-in-opposition-to-government-corruption/\">EDM</a>, October 12, 2011).</p>\n<p>Still, support and turnout for the Navalny protests in particular was low in the region (<a href=\"https://www.kavkaz-uzel.eu/articles/358895/\">Kavkazsky Uzel,</a> January 21). So why were authorities so quick to arrest protesters and reticent to allow these actions in the first place? What threat did they perceive? The answer lies not in Makhachkala, but in Moscow. The authorities in the North Caucasus understood that to allow these rallies to move forward would not align with Moscow’s directives to quash any Navalny-related activity, however small the demonstrations may be (<a href=\"https://www.kavkaz-uzel.eu/articles/358895/\">Kavkazsky Uzel</a>, January 21). And in the North Caucasus, alignment with Moscow is often vital for regional elites to maintain their power and privilege. Both economically and administratively, Moscow pulls many strings in the region, by appointing outsider governors like Dagestan’s Sergei Melikov and by ordering financial policy in republics like Ingushetia (see <a href=\"https://jamestown.org/program/moscow-moves-to-tighten-grip-over-north-caucasus-republics/\">EDM</a>, November 16, 2020). In 2014, subsidies to the North Caucasus Republics were all higher per capita than the average in Russia with the exception of Stavropol Krai (Edward C. Holland, “<a href=\"https://www.researchgate.net/publication/288857136_Economic_Development_and_Subsidies_in_the_North_Caucasus\">Economic Development and Subsidies in the North Caucasus</a>,” <em>Problems of Post-Communism</em>, December 2015).</p>\n<p>The hard line on even limited protests in Makhachkala suggests that any open displays of discontent in opposition to Moscow’s official stance will not be tolerated in Dagestan. At the same time, this implies that Alexei Navalny is likely not the man to mobilize the masses in the North Caucasus, even though some citizens there are sympathetic to his anti-corruption campaign.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/alexei-navalnys-support-in-the-north-caucasus-more-about-corruption-than-navalny/\">Alexei Navalny’s Support in the North Caucasus: More About Corruption Than Navalny</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}