{
  "id": "yt:video:2tvo36_4xwU",
  "yt:videoId": "2tvo36_4xwU",
  "yt:channelId": "UCpVm7bg6pXKo1Pr6k5kxG9A",
  "title": "Wayfinding Through the Human Genome | Podcast | Overheard at National Geographic",
  "link": "",
  "author": {
    "name": "National Geographic",
    "uri": "https://www.youtube.com/channel/UCpVm7bg6pXKo1Pr6k5kxG9A"
  },
  "published": "2022-11-01T11:59:46+00:00",
  "updated": "2022-11-02T19:12:31+00:00",
  "media:group": {
    "media:title": "Wayfinding Through the Human Genome | Podcast | Overheard at National Geographic",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Where ancient Polynesians studied the stars to navigate the vast Pacific Ocean, Hawaii’s first Native genomic scientist is analyzing genetic data to rewrite the narratives of Indigenous communities and help change their future.\n\nNational Geographic Explorer Keolu Fox grew up hearing stories about his ancestors, Polynesian navigators, and the men who in the late 1970s led the first Hōkūleʻa voyage to Tahiti. As the first Native Hawaiian with a Ph.D. in genomic sciences, Fox tells us how genetic data can help reveal powerful narratives about the history of Indigenous people and their achievements, and empower communities to use data to improve public health and preserve their culture.\n\nCredit: Through his genomic analyses, Keolu Fox hopes to find clues that lead to new medicines, better health care, and even land reclamation. Photo by Rebecca Hale\n\n➡ Subscribe: http://bit.ly/NatGeoSubscribe \n➡ Get more of Overheard at National Geographic here: https://bit.ly/OverheardPodcast \n➡ Catch up on all episodes of Overheard at National Geographic: https://on.natgeo.com/3n9D3cF \n\nYou can also listen to the Overheard at National Geographic podcast on these platforms:\n➡ Apple: https://bit.ly/OverheardOnApple \n➡ Spotify: https://bit.ly/OverheardOnSpotify \n➡ Stitcher: https://bit.ly/OverheardOnStitcher \n➡ Google Podcasts: https://bit.ly/OverheardOnGoogle \n➡ iHeart Radio: https://bit.ly/OverheardOniHeart \n➡ Castbox: https://bit.ly/OverheardOnCastbox \n\n#NationalGeographic #Overheard #HumanGenome\n\nAbout Overheard at National Geographic:\nDocumenting democracy, Untwisting the world’s largest tornado. Searching for wrecks of lost slave ships. Dinosaur hunting in Morocco. Accidentally inventing a new color. Come dive into one of the curiously delightful conversations overheard at National Geographic’s headquarters, as we follow explorers, photographers, and scientists to the edges of our big, weird, beautiful world. Hosted by Peter Gwin and Amy Briggs.\n\nAbout National Geographic:\nNational Geographic is the world's premium destination for science, exploration, and adventure. Through their world-class scientists, photographers, journalists, and filmmakers, Nat Geo gets you closer to the stories that matter and past the edge of what's possible.\n\nGet More National Geographic:\nOfficial Site: http://bit.ly/NatGeoOfficialSite  \nFacebook: http://bit.ly/FBNatGeo \nTwitter: http://bit.ly/NatGeoTwitter \nInstagram: http://bit.ly/NatGeoInsta \nTikTok: http://www.tiktok.com/@natgeo \nTenor: http://on.natgeo.com/31b3Koc \n\nWayfinding Through the Human Genome | Podcast | Overheard at National Geographic\nhttps://youtu.be/2tvo36_4xwU\n\nNational Geographic\nhttps://www.youtube.com/natgeo",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}