{
  "title": "#470: Silky Smooth Snape (OOTP 32, Out of the Fire)",
  "link": "https://audioboom.com/posts/7613690",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4837,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>International football star David Beckham joins actor David Tennant to read <a href=\"https://www.wizardingworld.com/chapters/reading-quidditch\">the Quidditch chapter</a> of Book One. And now viewing this requires a login?</li>\n<li>The MuggleCast 15th Anniversary T-Shirt is here! <a href=\"http://www.patreon.com/mugglecast\">Just one week left</a> to become a Patron at the Dumbledore’s Army level or higher to get yours!</li>\n<li>MuggleMail topics include exams in other countries, the secrecy surrounding the prophecy, and whether Hagrid had a battle assist from Dumbledore (sorry McGonagall!)</li>\n<li>\n<a href=\"https://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix - Chapter 32: Out of the Fire</li>\n<li>7-Word Summary: Umbridge catches heroes using losers for hire</li>\n<li>Hermione's point about Sirius and Voldemort is a good one - why doesn't Harry listen?</li>\n<li>Why doesn't the trio think of Snape before they're caught?</li>\n<li>The pitfall of Hermione bringing up Harry's \"Saving People Thing\"</li>\n<li>Here *lies* Kreacher, Mwahahahahaha</li>\n<li>Harry speaks in code as a last resort. Does Snape understand?</li>\n<li>DEBATE: as Umbridge prepares use an Unforgivable on Harry, the hosts ask. Who is a worse villain? Voldemort or Umbridge?</li>\n<li>How realistic is Hermione's plan? What makes Umbridge buy it? And why does she decide to go alone?</li>\n<li>(Spoilers!) Our Umbridge Suck Count passes 100! (Were you really surprised?)</li>\n<li>Quizzitch: What spell does Neville use to escape his captors?</li>\n<li>This week’s episode is sponsored by MeUndies (Underwear that's so good, Dobby would never take it off his head! Get 15% off your first order and free shipping by going to <a href=\"http://www.MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a>), <a href=\"https://audioboom.com/channels/5017114\">Truth Vs Hollywood</a> podcast, and Quip dental care (Visit <a href=\"http://www.GetQuip.com/muggle\">GetQuip.com/muggle</a> to get your first refill free!)</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 23 Jun 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-06-22:/posts/7613690",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}