{
  "title": "Why is Qatar Opposing a Remedy Fund for Migrant Workers?",
  "link": "https://www.hrw.org/news/2022/11/02/why-qatar-opposing-remedy-fund-migrant-workers",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Parents of Ram Kishun Sahani, a Nepali migrant worker who died in Qatar. \n                    © 2022 Private\n          \n\n  \n<p>Qatar’s Labour Minister Ali bin Samikh Al Marri rejected creating a remedy fund for harmed migrant workers today.</p>\n\n<p>His response ignores growing criticism of Qatar’s labor rights record and support for the migrant workers who faced abuses creating the World Cup infrastructure. Instead, Al Marri cited Qatar’s recent labor reforms and questioned the feasibility of the remedy fund.</p>\n\n<p>While Qatar has made notable reforms, research by Human Rights Watch has found that they came late, were narrow in scope, or were weakly enforced, which meant many workers who helped build the World Cup infrastructure fell through the cracks.</p>\n\n<p>Also, Qatari authorities and origin country governments do have data and information on abuses – including worker deaths. A remedy fund would strengthen existing compensation schemes and reach more workers, including those still seeking wages stolen from them.  It would also reach the families of workers who died in circumstances Qatari authorities never investigated, allowing families who lost a provider to feed themselves and send their children to school.</p>\n\n<p>Regardless of Qatar’s response, FIFA, football’s global governing body, has the resources and the responsibility to act.</p>\n\n<p>At the October 13th Council of Europe hearing on labor rights in Qatar, FIFA Deputy Secretary General Alasdair Bell stated that “compensation is certainly something that we’re interested in progressing.”</p>\n\n<p>The Union of European Football Associations (UEFA) Working Group on Workers’ Rights in Qatar met with FIFA, and requested it answer calls for remedy on migrant workers by the end of October. In June, FIFA already told UEFA it was “looking into compensation mechanisms” and would respond within weeks.</p>\n\n<p>Calls to compensate migrant workers who experienced abuse building World Cup infrastructure are unprecedented, including from football associations, sponsors, political leaders, athletes, and fans. Migrant workers have bravely come forward with their stories of abuse, despite reprisal risks.</p>\n\n<p>FIFA has long contributed to World Cup “legacy funds” to support projects following events. In the past, FIFA has allocated at least US$260 million for World Cup “legacy” including to former hosts South Africa ($100 million), Brazil ($100 million), and Russia ($60 million).</p>\n\n<p>As the clock ticks to opening day for the World Cup, FIFA should commit now to pay compensation for every worker who has suffered to make this tournament happen.</p>",
  "pubDate": "Wed, 02 Nov 2022 14:24:39 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/why-qatar-opposing-remedy-fund-migrant-workers"
}