{
  "title": "A County Elections Director Stood Up to Locals Who Believe the Voting System Is Rigged. They Pushed Back Harder.",
  "link": "https://www.propublica.org/article/north-carolina-election-denial-voting-surry",
  "pubDate": "Mon, 31 Oct 2022 06:00:00 -0400",
  "guid": "https://www.propublica.org/article/north-carolina-election-denial-voting-surry",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/doug-bock-clark\">Doug Bock Clark</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. <a href=\"https://www.propublica.org/newsletters/dispatches?source=54G&placement=top-note&region=local\">Sign up for Dispatches</a>, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">On a Saturday in late March, the woman who runs elections in the rural hills of Surry County, North Carolina, was pulling another weekend shift preparing for the upcoming primary, when she began to hear on the other side of her wall the thunder of impassioned speeches. She was dismayed that the voices were questioning the election she’d overseen in 2020 and implying that corrupted voting machines had helped steal it. She also believed it was no coincidence that the Surry County GOP convention — the highlight of which was a lecture from a nationally prominent proponent of the stolen-election myth — was taking place in a public meeting room right next to her office.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">The elections director, 47-year-old Michella Huff, who’d lived in the county since high school and knew many voters by name, considered it ludicrous that anyone could think the election had been rigged in Surry County. Donald Trump had received upward of 70% of the roughly 36,000 votes cast. Huff, a registered Republican for most of her adult life, had personally certified the vote.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">Yet people had begun approaching Huff in church recently, saying things like, “I know you didn’t do anything, but that election was stolen.” In February, a longtime acquaintance of Huff’s cornered her in a bluegrass music store and berated her with complaints rooted in conspiracy theories. Huff started limiting her trips to town, even doing her grocery order online. “I didn’t want to have to deal with that,” she said of the election backlash. But it was hard to live in partial hiding. “I’m not that kind of person. I’m a people person.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">Unbeknownst to Huff, a national network of election deniers had been making inroads in Surry County, on the fringe of Appalachia. In early 2022, several members of the Surry County GOP had attended a training, put on by North Carolina Audit Force, which describes itself as a group that forms grassroots coalitions to “reveal election irregularities.” There, they were taught to “canvass” for election fraud by door-knocking to check for inaccuracies in public records, such as if a different person lived at an address than was listed on voter rolls. Discrepancies, canvassers claim, can indicate fraud — <a href=\"https://apnews.com/article/elections-media-arizona-ap-fact-check-phoenix-96f95a57cd361006d3398b0902a3e0d8\">though experts say that canvassers often misinterpret normal imperfections in difficult-to-maintain voter lists</a>, such as someone failing to update their address when moving. By early March, canvassers were crisscrossing Surry County, following “walk books” put together by data analysts associated with North Carolina Audit Force, who mapped routes for efficiency.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">The featured lecturer at the Surry County GOP convention, Douglas Frank, is the face of the nationwide canvassing movement and claims to have established campaigns with the help of “supermoms” in at least 40 states. Frank and other speakers spent hours at the convention blaming corrupted voting machines and collusion among Democrats, Big Tech and nefarious forces for stealing the election. The assembly ultimately passed resolutions to create an election integrity task force and push for an audit, tactics espoused by Trump supporters.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">The following Monday morning, Frank showed up at the service window of Huff’s office with William Keith Senter, the new chair of the Surry County GOP, and a woman who signed the guestbook as “NC Audit Force.” Huff believed that the group wanted to get inside her office — where voting equipment was kept — so she stepped into the cramped lobby with them, letting the door to her office automatically lock behind her.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">The bowtie-wearing Frank began complaining to Huff about “phantom voters” discovered through canvassing and declaring that if he could just take an electromagnetic field meter tool to her DS200 ballot tabulators, he could reveal a minuscule modem that had helped switch votes from Trump to Joe Biden. It wasn’t the first time that Frank had encouraged an election official to let outsiders access election equipment. About 11 months before, he’d offered to help bring in a “team” to “audit” machines for Colorado officials, according to an affidavit for an <a href=\"https://ewscripps.brightspotcdn.com/da/1e/c9e276ac4079b026e842268481f4/sandra-brown-affidavit.pdf\">arrest warrant</a> of an official charged in the incident and to Frank himself. In September, Frank posted on Telegram that his <a href=\"https://www.washingtonpost.com/investigations/2022/09/15/douglas-frank-fbi-phone-lindell/\">phone had been seized</a> by FBI agents investigating the incident, according to <a href=\"https://www.washingtonpost.com/investigations/2022/09/15/douglas-frank-fbi-phone-lindell/\">The Washington Post</a>. Frank has not been charged. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">“My objective is to help the clerk understand how they’re being hacked and what they need to do to fix it,” Frank said when asked about Colorado, using another term for election officials. In reference to Huff, he said: “I was there trying to offer a service to the clerk. I always assume clerks want to have clean elections, which is why I offered to help her find out if her machines were online or not.” Frank claimed to have convinced “dozens” of other election and county-level officials of the need to probe voting machines, “and that’s why counties all across the country are taking the machines out of the election process.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">It was not Frank who most concerned Huff, however, but Senter — a high school auto shop teacher and cattle farmer with a mechanic’s callused hands and baseball hat declaring “Pray for America” atop his silvering hair. The new GOP chair — who, according to three members of the Surry County GOP, replaced a predecessor who hadn’t sufficiently backed claims of election fraud — would remain in Huff’s orbit long after the barnstorming Frank left town. Indeed, Senter was only at the beginning of a campaign that would include efforts to drastically cut Huff’s pay and call into question even the most mundane functions of her office.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">Huff told ProPublica that, as the men pressured her for more than an hour, Senter threatened that she should comply with their demands or the county commission would fire her. (She initially <a href=\"https://www.reuters.com/world/us/exclusive-local-election-chief-threatened-by-republican-leader-seeking-illegal-2022-04-23/\">described this incident</a> in an article by Reuters.) She feared that her reddening face and neck gave away her fear. (The commission has no authority to fire Huff; she is appointed by and answers to the county and state boards of elections. Senter denied threatening Huff’s job and wrote to ProPublica that “I speak loudly because I do not hear well. I drove a loud race car for years and have shot high powered rifles all of my life, so I have high frequency hearing loss.” Frank said that descriptions of Senter as threatening were “overblown,” and that “he might have been emphatic, but never, like, threatening.”)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">But Huff refused to give in.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">Huff is hardly the only election official struggling to stand up to those who believe the voting system is rigged; such confrontations have dramatically unfolded across the country, from <a href=\"https://www.propublica.org/article/gods-will-is-being-thwarted-even-in-solid-republican-counties-hard-liners-seek-more-partisan-control-of-elections\">Hood County, Texas</a>, to <a href=\"https://www.washingtonpost.com/nation/2022/03/14/georgia-elections-fraud-purge/\">Floyd County, Georgia</a>, to <a href=\"https://www.pbs.org/newshour/politics/distrust-in-election-process-grips-nevada-community\">Nye County, Nevada</a>. Her circumstances illustrate how the efforts to target her are part of a larger playbook, with tactics that are replicated throughout the country.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">“Election officials in small rural offices are absolutely more vulnerable,” said Paul Manson, who studies the demography of election officials and serves as the research director for the Elections & Voting Information Center at Reed College. Because such offices have fewer resources, Manson said, they have a harder time adapting to the increasingly controversial nature of election administration in the United States. These types of offices also represent the vast majority of the nation’s roughly 10,000 election jurisdictions, according to Manson’s research, with 48% of offices staffed by only one or two people and an additional 40% having between two and five. (Huff’s office has four full-time staff members, including her.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">As she juggled budget challenges and harassment, Huff has sought help from the North Carolina State Board of Elections, but that agency has faced struggles of its own. The GOP-dominant legislature has deprived the board of federal funding it had intended to use to hire and retain staff, instead sending it directly to counties. Moreover, groups claiming election fraud have organized campaigns against the agency, leaving it straining to support the 100 far-flung county boards of elections it oversees, officials say.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">Laws and regulations were not written for the hostile environment of today, said Richard L. Hasen, a professor and director of the Safeguarding Democracy Project at the University of California, Los Angeles. Many of the individuals challenging election officials are even using the law itself, such as overwhelming those offices with public records requests, a practice that Senter would soon take up in Surry County and that “election integrity” groups would employ against the North Carolina State Board of Elections.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">Hasen warned: “The country’s election infrastructure isn’t designed to stand up to one of its two major parties turning against it.”</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">When Michella Huff accepted the job as Surry County’s elections director in 2019, she thought she knew what she was getting into. On her first day, in October, she parked at a strip mall neighbored by corn fields, a hunting supply store and a chicken processing plant, and walked into a former grocery store, which had closed as the region bled jobs and had been renovated to house the county’s tax, agricultural and elections divisions. After more than two decades as the head of groundskeeping for Mount Airy, population roughly 10,500 and the largest town in the county, located about 100 miles north of Charlotte, she was giving her aching back a rest and working in an air-conditioned office.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">Each fall, for most of her adult life, she’d taken a few weeks off from mowing and planting to be a poll worker during early voting and then run a polling site as a chief precinct judge on Election Day. Though the days could be long and the pay little, she loved how some people kept their “I Voted” stickers pristine to add to lifetime collections and how others brought in homemade grape jelly for poll workers. Most of all, she was motivated by the certainty that she was making American democracy function.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">After the 2020 presidential election went off smoothly, Huff was aware of the “Stop the Steal” movement promoted by Trump, but, given her knowledge of how election security worked, she knew that its claims of Venezuelan software flipping votes from Trump to Biden were baseless. In the aftermath of Jan. 6, she assured herself that that kind of chaos would never come to sleepy Surry County.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Mount Airy, population roughly 10,500, is the largest town in Surry County.\n    \n            (Cornell Watson for ProPublica)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">But instead of the conspiracy theories dying down, they intensified. Soon after taking the job, she had switched her party status to independent “to reflect the way that this office must be portrayed in a nonpartisan manner.” It wasn’t until Biden took office that people in the community began to ask her about this. Huff recalls that one afternoon in early March 2021, she was surprised by a visitor at her office: Kevin Shinault, her former elementary school teacher and a GOP precinct chair, who she said accused her of participating in a <a href=\"https://www.politifact.com/factchecks/2022/mar/15/michael-gableman/courts-have-repeatedly-upheld-grants-gableman-says/\">debunked conspiracy theory</a> known as “Zuckerbucks.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">In 2020, Meta CEO Mark Zuckerberg had provided grants to election officials through the Center for Tech and Civic Life to help with unexpected pandemic expenses, and critics held that this had been part of a plot to throw the election to Joe Biden. Huff happily explained that the $48,584 she’d received from the group had been used for straightforward expenses, like hiring a Spanish-language interpreter. Nearly every election office in North Carolina had accepted such grants. Shinault, however, argued that hiring a Spanish-language interpreter had nefariously boosted Hispanic participation to the Democrats’ advantage. Huff assured him that helping Spanish-speaking voters wasn’t partisan. (Shinault did not respond to requests for comment.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">That night, Huff attended the biweekly county commissioners meeting, at which the chair of the county Elections Board asked the five county commissioners to split $20,000 left over from the previous year’s federal grants between Huff and her staff as belated hazard pay for their efforts during the pandemic. Huff figured it was a routine request. Numerous other counties had used the money this way; Surry’s bipartisan Elections Board had already signed off on it; and records show that about two months earlier, commissioners had reviewed the grants without comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">The county commissioners, however, sharply questioned the chair of the Elections Board for nearly an hour, implying that unless more county employees got such pay, it wasn’t fair. Eddie Harris, a commissioner who works at a luxury saddle-making company his family owns, declared, “I will never take one penny from Mark Zuckerberg or any of his ilk,” calling the Meta CEO “a left-wing radical extremist bigot.” (Senter wrote to ProPublica, “As a party, we approached the commissioners and ask [sic] them to send the Zuckerbucks back, and they agreed.” Harris did not respond to requests for comment.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.4\">Huff realized that her decadeslong relationships with people wouldn’t prevent them from envisioning her as part of some dark conspiracy. The next month, the commissioners unanimously voted to return nearly $100,000 in pandemic grant money, including the Center for Tech and Civic Life grant and around $60,000 from the USC Schwarzenegger Institute for State and Global Policy, named for the former Republican governor of California. They also returned the $20,000 in federal funding, rather than divvying it up among the elections staff.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.5\">Huff felt that returning the money was “very unfair,” but she resolved not to let it affect her performance. The best way to rebut conspiracy theories was to run her elections perfectly. She hoped the election conspiracy theories “would be a dead issue after the money was sent back.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.6\">But once Senter and Frank confronted her in March 2022, she realized the target on her back was permanent.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.7\">After that heated visit, Senter kept showing up at the elections office. With the service window between them, Huff helped him file public records requests, which he insisted on scrawling by hand. (He explained to ProPublica that the handwritten requests were necessary, “so they could not be doctored by anyone else.”) Huff politely did her duty, but whenever she saw him, “My gut flipped. It makes me angry that he has that power — I can’t help how my body reacts.” When Huff and her staff finished work late in the evening, police escorted them to their cars, past campaign-style signs that Senter had put up reading “The People’s Trust is SHATTERED” and “We DEMAND a Full FORENSIC Audit.” Huff repeatedly took them down, until the sheriff decided the signs should stay up, as they were legal political expression on public property.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.8\">In March and April, Senter sent numerous emails and texts to the county commissioners, which ProPublica obtained through public records requests. On March 31, he emailed the commissioners asking them to “please consider our recommendations that are in the attachment,” which included a suggestion to reduce her pay and stated that “there is NO requirement to fund any additional election support staff.” Though Huff answers to the county and state elections boards, the county commissioners set her budget and salary.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.9\">Later that day, Senter <a href=\"https://www.documentcloud.org/documents/23218764-keith-senter-and-surry-county-commissioners-text-messages\">texted the commissioners</a>, “Y’all might better get Michella in check,” complaining about her charging 5 cents per copy for public records. “It’s gonna get ugly if she don’t jump on board. Cut her salary to 12 bucks an hour like the law says you can do.” (Senter told ProPublica: “The ugly part is in reference to the phone calls, text, threats and pressure I was receiving due to her lies and deceit that she reported to the media”; but his message to the commissioners made no reference to those things, and Huff said she had not spoken to the media about Senter as of the end of March.) </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.10\">North Carolina law does specify that elections directors can be paid a minimum of $12 an hour (less than $25,000 annually), but two lawyers specializing in elections told ProPublica that any attempt to drastically reduce Huff’s salary, which was $71,000 as of March, would almost certainly be struck down, as courts have found that elections director salaries must be in line with those of their peers; a ProPublica review of elections director salaries in North Carolina found that the average is about $61,000.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.11\">Commissioners responded only occasionally to Senter’s messages about Huff, according to the documents ProPublica received from public records requests, such as the commission chair texting Senter instructions for how to avoid paying for public information requests to Huff’s office. (Only one of the county commissioners responded to a request for comment. Mark Marion said, “We have signified that we are behind our elections department.” When pressed for specific instances, he pointed to “our day-to-day conversations and visits” with elections staff.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.12\">At an April 18 commissioners meeting, Senter asked the panel during the public comment period to consider not using the county’s voting machines in the upcoming May primary because of his and others’ suspicions that they had been corrupted. He was backed by a parade of speakers, among them Shinault.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.13\">At a commissioners meeting the following month, the room was filled, with the overflow watching on a livestream. Essentially, the whole meeting was given over to election deniers, some of whom traveled from elsewhere in North Carolina and the nation and presented slideshows on the vulnerabilities of voting machines and the so-called evidence from canvassing efforts.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.14\">Near the end of the meeting, a commissioner read prewritten remarks explaining that the requests to discard the voting machines were outside their power.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.15\">Afterward, the crowd assembled on the courthouse lawn, alongside a memorial to Confederate soldiers. People chanted, “Hell no, the machines gotta go!” A succession of speakers promised to fight on, with one declaiming so vehemently that he tore his lips on the microphone mesh, spotting it with blood.</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.16\">In late August, Senter traveled to Missouri for a weekendlong gathering of hundreds of election deniers put on by Mike Lindell, the MyPillow CEO who claims to have spent at least $35 million of his fortune on efforts to prove the 2020 election was fraudulent. At Lindell’s event, activists from all 50 states touted their campaigns, which often involved pressuring county and state election officials. “We’ve had a few victories,” Senter told the crowd when he <a href=\"https://frankspeech.com/video/north-carolina-election-fraud-moment-truth-summit\">presented as the representative</a> for North Carolina. “We feel like if you’ve got a committed group of patriots, and some county commissioners that are not afraid to face the establishment and do their job, and local law enforcement that will hear the evidence that you produce to them, we can actually get something done in your county. So if you’d like that strategy, hit us up in North Carolina, and we’ll help you out with it.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.17\">After returning home, Senter submitted to Huff’s office a time-consuming public records request similar to one that Lindell had promoted, which required one of Huff’s three full-time staff members to spend 60 hours at a scanner uploading 2020 “poll tapes,” the physical receipts from tabulators. Across North Carolina and nationwide, short-staffed offices reported <a href=\"https://www.washingtonpost.com/nation/2022/09/11/trump-election-deniers-voting/\">being overwhelmed with often identical requests</a>. Senter’s requests to Huff came atop dozens of others from different sources, including a sweeping request from a lawyer for the Republican National Committee. Before 2020, Surry County’s elections office had received an estimated half-dozen public records requests a year; in the first 10 months of 2022, it received 81.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.18\">An ally of Senter’s filed requests for court-ordered mediation and a lawsuit against Huff, seeking the same records that Lindell’s campaign has recommended asking for. While none of the legal actions have so far been successful, shortly before Surry County’s 2020 elections-related paper records were to be routinely discarded, the county Board of Elections agreed to preserve them for three more years. Huff said that each legal action resulted in her and her staff having to spend significant time with lawyers and on paperwork, rather than on actual elections administration.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.19\">Most laws and regulations that govern public records requests and elections do little to ease the disruptions that Huff and others were enduring — and offer few means to hold anyone accountable. “I don’t think there’s a silver bullet solution, unfortunately,” said Lawrence Norden, the senior director of the Elections and Government Program at the Brennan Center for Justice, a nonprofit law and public policy institute. He noted that public records laws are necessary tools to ensure government transparency. “In a lot of cases, if election officials had more resources available to them, it would be easier to push back on some of these things.” He said that officials in smaller jurisdictions often need to turn to professional associations, nonprofits or their state election agencies for help.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.20\">The organization most responsible for supporting Huff is the North Carolina State Board of Elections, which is responsible for statewide election infrastructure, such as its voter registration database, and which provides oversight and help for county offices. It had dispatched staff to back up Huff when election deniers were holding rallies in the county and offered legal advice and support over the phone.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.21\">But the state board, too, was being overwhelmed by public information requests. Before 2020, only several dozen requests would come in per year, said Patrick Gannon, its public information director. In 2021, there were 380, with some coming from the same people who submitted requests to Huff. Meanwhile, the number of people on the communications team had dwindled from four to two, in large part due to reductions in federal funding and the GOP-led legislature not meeting budgeting requests, according to board officials. By late October, the officials said, five employees had accepted buyout offers. To make payroll, the agency also let two people go and did not fill 17 positions — reducing its staff by more than 20% during its busiest time and limiting the services it could provide counties.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Huff helps election workers test voting machines to ensure each is functioning properly.\n    \n            (Cornell Watson for ProPublica)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.0\">Huff’s experiences with so-called election integrity activists were more intense than what other North Carolina election workers were facing, though many of them were also enduring their own challenges. After the May primary, at least 14 counties reported complaints to the state board about aggressive poll observers, according to an internal survey obtained through a public records request. The complaints and additional documentation from one of the counties described two instances in which observers tailed election workers in their cars, among other examples of observers “intimidating poll workers.” This led the agency to pass rules to ensure that observers — the individuals assigned by political parties to monitor election officials — didn’t do things like stand so close to voting equipment that they could see confidential information. However, these rules <a href=\"https://www.newsobserver.com/news/politics-government/election/article264905839.html#storylink=cpy\">were nullified</a> when they were sent for approval to a board appointed by the GOP-controlled state legislature.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.1\">Even states considered to be on the forefront of election administration — such as Colorado, where legislators <a href=\"https://trackbill.com/bill/colorado-senate-bill-153-internal-election-security-measures/2242196/\">have passed laws</a> addressing rising security risks, and Kentucky, where the Republican secretary of state has pushed back against conspiracy theories — have experienced significant disruptions as a result of the organized campaigns by 2020 election deniers. “It’s the new normal, until we have our political leaders in both parties pushing back strongly against it,” Norden said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.2\">One of the individuals helping Senter in his Surry County campaign is Carol Snow, the North Carolina Audit Force leader who accompanied Senter and Frank to the elections office during their March confrontation with Huff. In a May email from Snow to Senter with the subject line “Surry Co Dirt,” which ProPublica obtained through public records requests, she provides him with a PowerPoint presentation. Its 61 slides outline supposed errors in North Carolina’s voter registration database. In an August email Snow sent to the county commissioners, copying Senter, she presented them with supposed evidence of voter-registration fraud in Surry County assembled through canvassing. She also suggested that law enforcement could subpoena information inaccessible through public records requests, which she claimed might reveal “individual voter fraud” or systemwide “election fraud.” She concluded, “We will get to the bottom of this or die (or be imprisoned for) trying.” The commissioners did not respond to the email. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.3\">(Snow declined to comment on the emails; in response to earlier questions about North Carolina Audit Force’s efforts in Surry County, Snow wrote: “Americans have every right to oversee our election process. That’s what should happen in a free society.”)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.4\">Until recently, Snow was also a leader in the North Carolina Election Integrity Team, a statewide affiliate of the nationwide Election Integrity Network, which has trained thousands of activists in the battleground states to scrutinize election officials. The network’s goal is to make sure there are “local election integrity task forces organized at every local election office in America,” according to its <a href=\"https://www.nceit.org/files/ugd/71310cf06a43795f68464c99002c03bbfda79d.pdf\">training manual</a>, and it lays out how to aggressively scrutinize officials in ways that are similar to what Huff has experienced, such as through filing public records requests and investigating voting machines and voter lists. “The goal is for the task force members to be ever-present at the election office and board meetings,” it reads.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.5\">Jim Womack, <a href=\"https://www.theassemblync.com/politics/elections/north-carolina-election-integrity/\">the head of the North Carolina Election Integrity Team</a>, told ProPublica that the group had nothing to do with the events in Surry County and that Snow’s actions there were “her business.” He and Snow said she had recently left the organization.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.6\">Womack estimated that as of August, the North Carolina Election Integrity Team had trained more than 1,000 volunteers, who would be present in most major North Carolina counties in November, including Surry. “As long as” election officials are “doing things in accordance with the law and the books, they shouldn’t have anything to worry about,” Womack said. “And if that causes stress, I'm sorry.”</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.7\">In the months before the November 2022 midterm election, Huff decided to go on the offensive against misinformation, giving speeches to various civic groups about how elections actually work, like the local real estate agents association.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.8\">One afternoon toward the end of the summer, she showed up at a country club for what she had believed was a concerned citizens meeting — and found waiting for her eight local conservative leaders, including county commissioner Harris, who had fiercely criticized the Center for Tech and Civic Life money. For two and a half hours, Huff answered the Republicans’ questions, largely about election security, explaining the safeguards that kept voting tabulators from being hacked. The discussion was tense but civil, and while Huff kept her hands clasped atop a table, her feet compulsively kicked an orange golf tee beneath it. As Huff headed for the door, she reminded her hosts, “The people who work in the elections office, we’re real people who love our community too.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"5.9\">Afterward, a ProPublica reporter asked an attendee, Earl Blackburn, a Republican candidate for a local school board, if Huff’s presentation had made him feel better about election security. Though Huff had taken more than 15 minutes to explain directly to Blackburn how the voting machines couldn’t be hacked, he said, “I don’t know that she has satisfactorily answered my question.” To explain how the machines could be hacked anyway, Blackburn referenced <a href=\"https://www.rottentomatoes.com/m/entrapment\">a badly reviewed</a> <a href=\"https://www.youtube.com/watch?v=2QVLc0Qfb5Y\">Sean Connery heist movie</a> that hinges on thieves dodging a laser beam alarm system to break into a global bank.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Huff speaks during a September training for election workers at the Surry County Board of Elections.\n    \n            (Cornell Watson for ProPublica)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.0\">On Sept. 19, Huff hosted a watch party in the public meeting room next to the elections office for a livestream of speeches in which experts and North Carolina State Board of Elections members explained election security, hoping that some of the Surry County GOP might attend — or at the very least some skeptical citizens. But the only people who came were longtime poll workers who already understood how elections worked.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.1\">As September turned to October, she and her staff hosted another event at which they publicly tested the dozens of voting machines that would be used in November to prove their accuracy. She hoped some of the election deniers might assuage their fears at the event, but none showed up.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.2\">No matter how many questions she answered or how many times she proved the soundness of the voting machines, it wasn’t clear that she was convincing anyone.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.3\">When Huff had taken the job in 2019, she had told the Board of Elections that she expected to stay 20 years. But recently there had been many nights she had wondered how she could continue. She said, “If this is what every day and every night looks like, how could anyone keep this up for 17 more years?” She wasn’t just thinking of herself but also about how the stress she brought home and the controversies surrounding her would affect her children, who are in high school and college, and her husband.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"7.4\">Coming home late from work each night, Huff parked beside a plot that was normally filled with heirloom tomatoes, cucumbers, herbs and peppers, but which was now just dirt. Instead of tending her garden, she was trapped all day in the halogen-lit office. Still, in her most hopeful moods, she could imagine that instead of cultivating the land she was cultivating democracy. “It’s a seed. You plant it. It grows. It flowers. It fruits,” she said. “It takes careful tending to make sure that it survives and becomes something beautiful.”</p>\n        \n    \n                    \n\n    <p>\n        <strong><a href=\"https://www.propublica.org/getinvolved/help-propublica-investigate-threats-to-u-s-democracy\">Help ProPublica Investigate Threats to U.S. Democracy</a></strong>\n    </p>\n\n        \n                                   ",
  "dc:subject": "Democracy",
  "dc:date": "2022-10-31T06:00:00-04:00",
  "dc:creator": "by Doug Bock Clark"
}