{
  "title": "Exploring education from all angles",
  "link": "https://news.mit.edu/2022/david-spicer-education-policy-1104",
  "description": "Senior David Spicer advocates for students at MIT and beyond as he cultivates his interest in education policy.",
  "pubDate": "Fri, 04 Nov 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/david-spicer-education-policy-1104",
  "dc:creator": "Laura Rosado | MIT News correspondent",
  "content:encoded": "<div>\n<p>As a tenth grader, David Spicer organized a student petition to create more Advanced Placement classes at his high school. He knew another high school in the area offered a dozen more, and he couldn’t see a reason for the disparity. After collecting 250 signatures from fellow students, he presented it to his school’s principal, then circulated it to the school district’s superintendent.</p>\n\n<p>In retrospect, Spicer says, “I was certainly a bit of an annoying high schooler, but that experience taught me how important it is to not only advocate for the topics that you care about, but also the issues that impact those around you.” It was also his first exposure to the complexity of education policy and governance, a subject he has remained interested in ever since.</p>\n\n<p>Now a senior studying political science and the president of MIT’s Undergraduate Association (UA), Spicer has continued to explore education from all angles. “Education is one of those things that everyone has an experience with,” he says. “And those experiences inform how you think of issues in education.”</p>\n\n<p>Thinking about those issues goes beyond just the classroom, where Spicer has balanced theory and practice while taking classes spanning education policy, research, and leadership, at MIT and Harvard University. He has also worked at multiple levels of education, from teaching in K-12 classrooms to interning with the U.S. Department of Education.</p>\n\n<p>Spicer’s passion for education and education policy dovetails with his involvement in the UA. Starting out as a member, then chairing the Community and Diversity Committee for two years, and now serving as president, Spicer often finds himself face-to-face with different stakeholders — university administrators, faculty, members of the Cambridge community — with the task of advocating for his fellow students.</p>\n\n<p>“I was always really interested in the biggest, most pressing student-life issues, whether it be around mental health, diversity, equity, and inclusion, or public service,” says Spicer. He praises the UA as “one of the most enjoyable aspects of my MIT journey so far,” as well as being instrumental in sharpening his own advocacy skills.</p>\n\n<p><strong>From Cambridge to L.A.</strong></p>\n\n<p>This semester, Spicer is spearheading the launch of the UA Leadership Forum, intended to bring UA officers and committee chairs into conversations with local, state, and federal politicians. The series aims to provide professional development opportunities and “pop the MIT bubble” by getting student leaders thinking about how issues can be resolved on a broader scale, not just on MIT’s campus.</p>\n\n<p>Spicer has taken plenty of opportunities to “pop the bubble” as well. As UA president, he spoke on a student panel at the Ronald Reagan Institute to talk about topics like freedom of expression, digital citizenship, and pandemic learning. He’s also spoken with producers and directors in Los Angeles to help them more accurately represent the student experience in movies and shows.</p>\n\n<p>“I’ve really enjoyed the fact that being UA president has given me a position to elevate conversations that students care about so much at a local level,” Spicer says. “I have this position to bring this to national attention and bring it to changemakers who are going to take what I’m saying and incorporate it.”</p>\n\n<p><strong>Cultivating community </strong></p>\n\n<p>Spicer grew up in a small town in southwest Louisiana — “the type of town where you know everyone” — but when it came time to pick a college, he “wanted a 180 in terms of the city.” MIT certainly fulfilled that desire, and the small, close-knit political science department also contributed to that decision: “I knew I wanted to do social sciences, and I like having that small sense of community while still having the benefit of being at a big school and living in a big city.”</p>\n\n<p>Giving back to communities is important to Spicer. For the past five semesters, he has been a teaching assistant for Concourse, a first-year learning community that emphasizes the study of humanities alongside the sciences.</p>\n\n<p>When asked what his post-graduation plans are, Spicer says he wants to return to Louisiana to work for the Board of Regents, which oversees statewide higher education policy. He’s already worked under the Louisiana Commissioner of Education, Kim Hunter Reed, and appreciates how he not only got the chance to interact with the state’s own government, but with officials in other states as well.</p>\n\n<p>“There’s a real emphasis on building relationships in higher education. It’s a very collaborative space. It’s a very innovative space as well,” he says.</p>\n\n<p>Looking further into the future, Spicer hopes to attend law school and obtain a PhD in education leadership.</p>\n\n<p>“Education law and education policy are distinct, but they have these really amazing and incredible conversations with one another. For a state like Louisiana, I think it’s really critical to be able to pull together education law and policy in conversation.”</p>\n\n<p>As a personal goal for this senior year, Spicer is focused on cultivating the friendships and communities he’s formed throughout his years at MIT.</p>\n\n<p>“I just want to make sure that when I graduate, that I leave very happy and keep up these contacts with so many amazing folks I’ve met.”</p>\n</div>",
  "media:content": {
    "media:description": "MIT political science major and Undergraduate Association President David Spicer is exploring education from all angles, spanning teaching, policy, research, and more.",
    "media:credit": "Photo: Jake Belcher"
  },
  "category": [
    "Profile",
    "Students",
    "Undergraduate",
    "Political science",
    "K-12 education",
    "Student life",
    "Community",
    "Diversity and inclusion",
    "School of Humanities Arts and Social Sciences"
  ]
}