{
  "title": "Data Science Book: Profit Driven Business Analytics",
  "link": "http://www.dataminingblog.com/data-science-book-profit-driven-business-analytics/",
  "pubDate": "Mon, 28 May 2018 19:16:52 +0000",
  "dc:creator": "Sandro Saitta",
  "category": "data mining",
  "guid": "http://www.dataminingblog.com/?p=2505",
  "description": "Verbeke, Baesens and Bravo have written a data science book focusing on profit. Instead of the typical statistical or programming point of view, Profit Driven Business Analytics has a self-proclaimed value-centric perspective. This means the book approaches each topic with a focus on profit, costs and ROI. Each data science subject is briefly explained and [&#8230;]",
  "content:encoded": "<p><img class=\"alignleft size-medium wp-image-2506\" src=\"http://www.dataminingblog.com/wp-content/uploads/1119286557-199x300.jpg\" alt=\"\" width=\"199\" height=\"300\" srcset=\"http://www.dataminingblog.com/wp-content/uploads/1119286557-199x300.jpg 199w, http://www.dataminingblog.com/wp-content/uploads/1119286557.jpg 300w\" sizes=\"(max-width: 199px) 100vw, 199px\" />Verbeke, Baesens and Bravo have written a data science book focusing on profit. Instead of the typical statistical or programming point of view, Profit Driven Business Analytics has a self-proclaimed value-centric perspective.</p>\n<p>This means the book approaches each topic with a focus on profit, costs and ROI. Each data science subject is briefly explained and illustrated with business cases. The authors concentrate on how profit can be taken into account (e.g. cost matrix and cost-sensitive methods).</p>\n<p>After a quick overview of data preparation, each classical machine learning algorithm is discussed (high level). The chapter on uplift modeling has a particular attention. Several business applications are covered such as fraud, risk management, HR analytics and marketing. The book has a strong academic flavor with plenty of exercises and references. Profit Driven Business Analytics is an excellent reading, should you need to justify data science projects and focus on moving from accuracy percentage to benefits in money.</p>\n<p><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=http%3A%2F%2Fwww.dataminingblog.com%2Fdata-science-book-profit-driven-business-analytics%2F&title=Data%20Science%20Book%3A%20Profit%20Driven%20Business%20Analytics\" data-a2a-url=\"http://www.dataminingblog.com/data-science-book-profit-driven-business-analytics/\" data-a2a-title=\"Data Science Book: Profit Driven Business Analytics\"><img src=\"https://static.addtoany.com/buttons/share_save_171_16.png\" alt=\"Share\"></a></p>"
}