{
  "title": "Marijuana and me",
  "link": "https://www.getrichslowly.org/marijuana-and-me/",
  "comments": "https://www.getrichslowly.org/marijuana-and-me/#comments",
  "dc:creator": "J.D. Roth",
  "pubDate": "Tue, 30 Aug 2022 15:00:12 +0000",
  "category": "Administration",
  "guid": "https://www.getrichslowly.org/?p=244285",
  "description": "<p>This article is difficult to write. It's an admission that I failed. And it's not like I failed once, but failed repeatedly over the course of several years. And it's not that I really <em>failed</em> failed, you know. It's that I failed myself. I failed to live up to my own expectations.</p>\n<p>But I'm getting ahead of myself. Let me start at the beginning.</p>\n<h2>Goody Two-Shoes</h2>\n<p>I grew up Mormon. Among other things, this meant that nobody in my family consumed recreational drugs of any kind. Mormons have a strict prohibition against such indulgences. And, as most folks know, they even take their stricture against \"strong drink\" to mean that caffeine is forbidden.</p>\n<p>So, my parents didn't drink alcohol or coffee. They didn't smoke cigarettes. They didn't do anything that led to altered states. Hell, my father even hated television because he considered it a \"plug-in drug\". For much of my childhood, we didn't have a TV. When we did have a TV, access was often restricted.</p>\n<p>My parents left the Mormon church when I was a freshman in high school. We returned to the local Mennonite congregation in which my father was raised. Mennonites aren't quite so restrictive with mind-altering substance as Mormons are — they <em>love</em> their coffee! — but they're close.</p>\n<p>In high school, I was never tempted by alcohol. I had friends who would drink, but it never appealed to me. Plus, it was against the rules.</p>\n<p>Also in high school, I had friends who discovered marijuana. While I was ambivalent about booze, I was actively opposed to pot. I believed it was evil. Plus, it was illegal. As a rule follower, there was no way I would touch the stuff. And when I was with friends who did get stoned, I'd read them the riot act. (I once chewed out my best friend Sparky because he had the gall to get stoned while we were waiting in line to buy tickets for a Tears for Fears concert.)</p>\n<p>Essentially, I started life as a Goody Two-Shoes. I refused to do anything illegal or immoral, and I condemned others for choosing anything that I wouldn't choose. I was a self-righteous young man who couldn't see that there's no single Right Answer to life.</p>\n",
  "content:encoded": "<p>This article is difficult to write. It's an admission that I failed. And it's not like I failed once, but failed repeatedly over the course of several years. And it's not that I really <em>failed</em> failed, you know. It's that I failed myself. I failed to live up to my own expectations.</p>\n<p>But I'm getting ahead of myself. Let me start at the beginning.</p>\n<h2>Goody Two-Shoes</h2>\n<p>I grew up Mormon. Among other things, this meant that nobody in my family consumed recreational drugs of any kind. Mormons have a strict prohibition against such indulgences. And, as most folks know, they even take their stricture against &#8220;strong drink&#8221; to mean that caffeine is forbidden.</p>\n<p>So, my parents didn't drink alcohol or coffee. They didn't smoke cigarettes. They didn't do anything that led to altered states. Hell, my father even hated television because he considered it a &#8220;plug-in drug&#8221;. For much of my childhood, we didn't have a TV. When we did have a TV, access was often restricted.</p>\n<p>My parents left the Mormon church when I was a freshman in high school. We returned to the local Mennonite congregation in which my father was raised. Mennonites aren't quite so restrictive with mind-altering substance as Mormons are — they <em>love</em> their coffee! — but they're close.</p>\n<p>In high school, I was never tempted by alcohol. I had friends who would drink, but it never appealed to me. Plus, it was against the rules.</p>\n<p>Also in high school, I had friends who discovered marijuana. While I was ambivalent about booze, I was actively opposed to pot. I believed it was evil. Plus, it was illegal. As a rule follower, there was no way I would touch the stuff. And when I was with friends who did get stoned, I'd read them the riot act. (I once chewed out my best friend Sparky because he had the gall to get stoned while we were waiting in line to buy tickets for a Tears for Fears concert.)</p>\n<p>Essentially, I started life as a Goody Two-Shoes. I refused to do anything illegal or immoral, and I condemned others for choosing anything that I wouldn't choose. I was a self-righteous young man who couldn't see that there's no single Right Answer to life.<span id=\"more-244285\"></span></p>\n<h2>Hello, College</h2>\n<p>College opened my eyes. I was exposed to hundreds of other smart kids, most of whom had radically different backgrounds from my own. They believed different things than I did and they made different choices. Because I lived with them and saw that they were (mostly) good people, it was impossible for me to condemn my classmates as evil or immoral. No, they simply had different backgrounds which led them to have different worldviews.</p>\n<p>Most of my friends in college drank alcohol, for instance. Our campus was a sort of safe haven for underage drinking, with an explicit &#8220;don't ask, don't tell&#8221; policy. So, kids drank. A lot. I experimented with alcohol a bit too, but I didn't like the stuff so didn't drink regularly.</p>\n<p>It's probably no surprise that college is where I first smoked pot. Marijuana use wasn't common, but it wasn't rare either. And the kids who used it didn't try to hide it. By the time my moral stance against the stuff had weakened, it was a simple matter to find somebody in the dorm who would show me how to get stoned.</p>\n<p>I smoked pot three times in college. The first time was <em>awesome</em>. It's still one of my favorite memories. But the other two times I smoked the stuff, I was unimpressed. I barely remember the incidents. Weed held even less appeal to me than booze.</p>\n<p>As an adult, marijuana was never an option. For one, it was still illegal and I am still (mostly) a rule follower. More to the point, my ex-wife was a forensic chemist for the state police. She wasn't allowed to use illegal drugs or to be around anyone else who was using them. To do so would have cost her a career. She was well aware of this, and so was I. Neither of us were ever remotely tempted.</p>\n<p>So it is that I managed to avoid marijuana from the time I left college until the time recreational use became legal in the state of Oregon.</p>\n<h2>Legalized Marijuana</h2>\n<p>When Kim and I returned from our 15-month RV trip, Oregon had legalized marijuana. I decided to experiment with it.</p>\n<p>My experience with pot started slowly. I had real problems inhaling the stuff, so I shied away from smoking it and opted instead for edibles. I liked gummies. I also liked tinctures I could take under my tongue.</p>\n<p>The problem with edibles and tinctures, though, is that they tend to have variable onset and variable effects. If I eat a gummy at, say, six in the evening, it could take anywhere from thirty minutes to three hours to set in. And when it sets in, it could give me a mild buzz <em>or</em> it could turn me into a puddle of pudding on the couch.</p>\n<p>In time, though, I learned how to smoke weed. I also learned which strains gave me a happy little high (as opposed to sending me to Crazy Town). I particularly liked <a href=\"https://www.leafly.com/strains/willys-wonder\" rel=\"noopener\">Willy's Wonder</a>.</p>\n<p>In late 2016, when I first began experimenting with pot, I maybe used it once a week. Instead of drinking on a Friday night, I'd get stoned.</p>\n<p>The frequency with which I used pot increased over time. This happened for a few reasons.</p>\n<ul>\n<li>First, pot is cheaper than alcohol. It's <em>much</em> cheaper, in fact. A package of ten gummies might cost me $20 (although it's usually less). At one or two gummies per use, that's only $2 or $4 per evening of fun.</li>\n<li>Second, pot has fewer calories than alcohol. If you smoke marijuana, you consume no calories at all. Wine and (especially) beer are packed with calories. So, in theory, using pot is smarter for my waistline. (In reality, using pot almost always gave me the proverbial &#8220;munchies&#8221;. My snacking while stoned was off the charts!)</li>\n<li>Third, and most importantly, pot helped me sleep. I have trouble sleeping. It sucks. But when I take pot I sleep soundly. It's so amazing!</li>\n</ul>\n<p>Because of these three factors — especially because of the better sleep — my pot use crept from once or twice a week to almost every single night. It took a couple of years to get there, but get there it did.</p>\n<p>By the time the pandemic hit, I was a daily marijuana user. If you've been reading me for a while, you know that this was also around the time that my mental health problems peaked. <em>(Shocking!)</em></p>\n<h2>Stoner J.D.</h2>\n<p>I've always struggled with depression — that's been present since fifth or sixth grade — but by 2019 I'd sunk to new lows. And as 2020 arrived, the depression became coupled with anxiety. Oh, how much anxiety I had! It was dreadful. It prevented me from accomplishing even basic tasks. (Ask Kim how difficult it was to get me to make a basic phone call&#8230;)</p>\n<p>But the worst thing was that I'd become stupid. I've always thought of myself as a smart guy, a guy who likes to read and think Deep Thoughts and have complex discussions with friends. But I was becoming dumber and dumberer, and I could sense it. I truly began to panic once I realized that I was losing the ability to write a coherent article or essay.</p>\n<p>For me, <strong>writing is life</strong>. Writing is how I process my thoughts and feelings and the world around me. If I can't write, I'm crippled. The pot was leaving me wordless and broken.</p>\n<p>But I didn't know that the <em>pot</em> was taking away my ability to write. I didn't know that the pot was making it tough for me to read. I didn't know that the pot was exacerbating my depression and causing my anxiety and turning me into a bitter old man. I couldn't see the source of my problems. All I knew was that these things were happening, and I hated it. To cope, I got stoned. Again. And getting stoned just made me more anxious and stupid.</p>\n<p>There were times I'd go weed-free for a while. These instances generally happened when I was traveling. If I were headed to Europe for a few weeks, for instance, I'd have no access to marijuana. I was fine with that. In my head, I didn't have a problem with the stuff. Pot was just something I used to sleep and (once or twice a week) as an alternative to alcohol.</p>\n<p>I was missing some obvious signs that yes, I really did have a problem. Here's an example.</p>\n<p>During my three-week trip to Portugal, Wisconsin, and California in 2019, I had real trouble at the start of the adventure. I was attending an F.I. chautauqua, which should have been fun and exciting. Instead, I struggled mightily. I slept like shit. I could not focus. Worst of all, I was irritable. I was an asshole. I managed to alienate a couple of colleagues, which I deeply regret.</p>\n<p>By the time I reached Joshua Tree at the end of those three weeks, my disposition had improved. But still I didn't realize that yes, I had a problem with pot. That yes, I'd experienced <a href=\"https://www.healthline.com/health/marijuana-withdrawal#symptoms\" rel=\"noopener\">withdrawal symptoms</a> in Portugal. That yes, quitting might be the best move for me.</p>\n<p>Nope.</p>\n<p>When I returned home, I resumed taking THC to help me sleep every night. In fact, I upped my marijuana use because I was trying to lose weight. I sharply curtailed my alcohol intake and allowed myself to use as much pot as I wanted — especially once COVID hit a couple of months later.</p>\n<p>I became your stereotypical stoner.</p>\n<h2>By the Numbers</h2>\n<p>As most of you know, I'm a numbers nerd. I like to track things in spreadsheets. No surprise then that for the past eighteen months, I've been logging <em>every</em> alcoholic drink I consume and <em>every</em> time I use pot.</p>\n<p>This has been helpful.</p>\n<p>Instead of guessing at how much I drink and how much pot I use, the numbers tell me the truth. (It helps that I'm completely honest with my spreadsheet. It makes no sense to &#8220;cheat&#8221; by putting in false numbers. That would defeat the purpose.)</p>\n<p><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/substance-use.jpg\" width=\"800\" height=\"250\" class=\"aligncenter green-border\" alt=\"My substance use spreadsheet\" title=\"My substance use spreadsheet\" /></p>\n<p>I began this spreadsheet because I wanted to document my problems with alcohol. Instead, I found myself more concerned with my marijuana use. Yes, the numbers showed that I ought to reduce my alcohol intake, but my drinking really wasn't too far out of line with recommended guidelines. My pot use was.</p>\n<p>I took 265 doses of marijuana during 2021 — then a similar amount during the first half of this year. And those doses grew stronger and stronger with time. When I smoked, I took deeper hits. When I consumed edibles, I took more of them.</p>\n<p>Then, about two months ago, I stopped using marijuana. This wasn't deliberate at first. It just happened.</p>\n<p>During the day, I was performing heavy physical labor as I landscaped the front yard. This physical exertion made it easy to fall asleep at night. Plus, in the evening Kim and I were drinking more beer as warm weather set in. These two factors led to a streak of ten days during which I didn't use pot at all.</p>\n<p>I extended this streak when Kim and I flew to visit her mother in Colorado. I had no pot with me, so I wasn't tempted. By the time we returned home, I'd noticed something interesting: I felt great. For the first time in a long time, I felt clear-headed. I felt motivated. I felt like my old self again.</p>\n<p>&#8220;Do you think I feel good because two weeks has been enough time for the THC to leave my system?&#8221; I asked Kim. (THC is the active chemical in marijuana, the stuff that gets you &#8220;high&#8221;. It lingers in the bloodstream, which leads to residual effects even if you haven't used it for a while.)</p>\n<p>&#8220;Maybe,&#8221; she said. &#8220;Probably. You should keep testing it.&#8221; So I did.</p>\n<p>Two weeks without pot turned into three weeks without pot. That turned into four weeks. Then five and then six. It's now been nearly two months since I used marijuana. At this point, I feel confident concluding that the marijuana was causing many of my problems. Not <em>all</em> of my problems, of course, but many of them.</p>\n<p>I last used marijuana on Independence Day. Since then, my mood has improved remarkably. My fragile mental health seems to be regaining stability. I've been <em>vastly</em> more productive in the past two months than at any other point since returning from the RV trip. I've become more sociable. I'm reading more and making more long-term plans. I'm writing a <em>ton</em>. The only thing that's really suffered has been my sleep. (Marijuana sure helps me sleep!)</p>\n<h2>Marijuana Is Not My Friend</h2>\n<p>Look, I'm not anti-pot.</p>\n<p>I'm not here to condemn marijuana use for society at large. I'm here to condemn marijuana use for <em>me</em>.</p>\n<p>But here's the thing. While I support <em>your</em> ability to choose marijuana, I no longer want to choose it for myself. I've seen first-hand just how profound an effect it can have on a person. Each day that passes since my last use, my mind boggles at how much happier and more productive I've become.</p>\n<p>Again, this is true for <em>me</em>. It might not be true for others, including you. If using pot helps you, fantastic. Puff away. It didn't help me — even when I thought it was doing so. I had, essentially, allowed myself to become the stereotypical high-school stoner: lazy, unmotivated, nonchalant, apathetic. This led to deep self-recrimination&#8230;then further pot use.</p>\n<p>It feels awesome to be my old self again. This summer, I've truly enjoyed rediscovering how to read books and how to write long articles like this one. I'm impressed by my ability to have some difficult (but much-needed) conversations, conversations that in some cases I've put off for <em>years</em> due to marijuana-enhanced anxiety.</p>\n<p>I'm not saying that all of my problems have magically disappeared. I'm still just as messed up as the next person. But at least right now, I'm not adding fuel to the fire. I haven't shackled myself in the chains of THC. I'm granting myself the ability to work my way through some of my issues instead of increasing the burden with weed.</p>\n<p>Next up? <a href=\"https://www.discovermagazine.com/health/this-is-your-brain-off-alcohol\" rel=\"noopener\">Alcohol.</a></p>\n<p>When I decided to give up pot in July, I gave myself permission to drink what I wanted for a while. Well, it's been a while. It's time for me to cut back on the booze again.</p>\n<h2>A Difficult Day</h2>\n<p>Today was tough. Kim and I reached the difficult decision to euthanize Mom's cat. We fostered Bonnie in January when Mom moved to memory care, and it's been one long, costly, flea-infested adventure.</p>\n<p>Before taking her to the vet, however, I drove ninety minutes north to give Mom and Bonnie some final time together. For nearly an hour, they melted into one. They were both so, so happy. Then I drove ninety minutes back to Corvallis and sat with Bonnie until she had crossed the Rainbow Bridge.</p>\n<p><img loading=\"lazy\" src=\"https://www.getrichslowly.org/wp-content/uploads/IMG_6051-scaled.jpeg\" width=\"800\" height=\"600\" class=\"aligncenter\" alt=\"Bonnie on Mom's lap for one final visit\" title=\"Bonnie on Mom's lapt for one final visit\" /></p>\n<p>Now, as we near bedtime, I'm agitated and wide awake. I know from experience that this is a bad combination. The likely result is that I won't be able to fall asleep. I'll toss and turn and my mind will spin, but I'll be up until midnight or one o'clock — or maybe even four.</p>\n<p>My normal solution for this — normal since 2016, anyhow — would be to smoke some weed. When I'm wired at night, I know that a hit of Willy's Wonder or Blue Dream will knock me out.</p>\n<p>I'm not going to do it, though. Yes, I'll likely be miserable tomorrow due to lack of sleep. I accept that. But you know what? I'd rather have one bad night than allow myself to relapse into that dark and constant state of self-loathing that's been my norm for the past six years&#8230;</p>\n<div id=\"mediavine-settings\" data-blacklist-content-desktop=\"1\" data-blacklist-content-mobile=\"1\"></div>\n",
  "wfw:commentRss": "https://www.getrichslowly.org/marijuana-and-me/feed/",
  "slash:comments": 25
}