{
  "title": "The Slowdown returns with new host Ada Limón",
  "guid": "/americanpublicmedia/podcasts/theslowdown/2021/09/theslowdown_20210909_20210909_128.mp3",
  "itunes:author": "American Public Media",
  "description": "<p>Poetry can help anchor us to the world amidst the chaos and uncertainty of daily life. Look for new weekday episodes with host Ada Limón beginning September 21, 2021.</p>\n<h3 id=\"h3_transcript\">Transcript</h3>\n<p><strong>Ada Limón:</strong> Many years ago, when I was just 20 and heartbroken, I walked home from my bus stop and noticed a tree illuminated by a streetlight. Each time I passed that tree, I grew more attached to it. It seemed it was the only living thing in the world that wasn’t asking me how I was doing or offering me some unasked for advice. And when the fall deepened and the leaves fell, it seemed to be extending some sort of goodness toward me. Like notes scattered at its roots asking me to pay attention. Each large and many-colored leaf was like a new contract with possibility. A small doorway where I might enter the world again. Enter the world through attention.</p>\n<p>To me, that is what poetry does. It offers no advice, no breaking news, no wisdom, no “and the moral of the story.” Instead, it offers connection and reciprocity. The inner and outer world colliding for one brief instant so that it’s not about having answers, being right or being wrong, but recommitting ourselves again to the mystery, silence, and awe of the world. </p>\n<p>I hope The Slowdown can be that type of unexpected goodness for its listeners. Brought to you by American Public Media and produced in partnership with the Poetry Foundation, The Slowdown will begin on September 21st with me, your host, Ada Limón. With a poem offered every weekday and, like that tree that I used to pass, only asking for a brief moment of attention.</p>\n<p>The Slowdown hopes to give you a much-needed break to stop and recognize what matters. Listen wherever you get your podcasts.</p>\n<p><br></p>\n",
  "enclosure": "",
  "pubDate": "Thu, 09 Sep 2021 17:00:00 +0000",
  "itunes:duration": "00:02:22",
  "itunes:explicit": "no"
}