{
  "id": "yt:video:OFWdXq_QgcU",
  "yt:videoId": "OFWdXq_QgcU",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "Animated view of latest Soviet Jet Fighter Aircraft and US aircraft...HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T12:06:53+00:00",
  "updated": "2022-05-19T02:57:25+00:00",
  "media:group": {
    "media:title": "Animated view of latest Soviet Jet Fighter Aircraft and US aircraft...HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675041092_Admiral-Connolly_fighter-aircrafts_Soviet-Jet-plane_F-14-Tomcat\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nAnimated view of Soviet Jet Fighter Aircraft, and various U.S.aircraft of the same cold war era.\n\nCold war era animated view of latest Soviet Jet Interceptor and Fighter Aircraft.  (Narrator mistakenly identifies the Flagon as a Su-11 but it is a Su-15.) MiG including MiG-23 planes developed by aircraft designers Mikoyan and Gurevich (MiG). Deputy Chief of Naval Operations (Air) Admiral Thomas Connolly discusses the development of United States fighter aircrafts. US aircraft F-8 Crusader landing on an Aircraft Carrier deck.  U.S. Navy F-4 Phantom fighter taking off from a Carrier deck. Aerial closeup view of formation of F-4 planes in flight. New F-14 Tomcat fighter planes described by Connolly. Location: United States. Date: 1972.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}