{
  "title": "Episode 36: Kitty Genovese: What Really Happened?",
  "pubDate": "Thu, 13 Jan 2022 11:55:47 +0000",
  "guid": "1479316f-546d-428e-b2bd-de3f6bfd8737",
  "link": "http://thepsychfiles.libsyn.com/episode-36-kitty-genovese-what-really-happened",
  "itunes:image": "",
  "description": "<p><strong>Kitty Genovese</strong>: what you know about what happened to her is <strong>wrong</strong>.</p> <h3>Kitty Genovese was repeatedly attacked while others watched and did nothing - right?</h3> <h3>Wrong.</h3> <p>While the story lead to a long and successful line of research in the area of <strong>bystander intervention</strong> and <strong>diffusion of responsibility</strong>, the facts of the story are incorrect.</p> <p>What are the facts behind the Kitty Genovese case and if groups are so unlikely to help, how do you explain how people came together to help at 911? Let's take another look at the legacy of this famous story in this episode.</p>",
  "content:encoded": "<p>Kitty Genovese: what you know about what happened to her is wrong.</p> Kitty Genovese was repeatedly attacked while others watched and did nothing - right? Wrong. <p>While the story lead to a long and successful line of research in the area of bystander intervention and diffusion of responsibility, the facts of the story are incorrect.</p> <p>What are the facts behind the Kitty Genovese case and if groups are so unlikely to help, how do you explain how people came together to help at 911? Let's take another look at the legacy of this famous story in this episode.</p>",
  "enclosure": "",
  "itunes:duration": "20:20",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Kitty Genovese: what you know about what happened to her is wrong. Kitty Genovese was repeatedly attacked while others watched and did nothing - right? Wrong. While the story lead to a long and successful line of research in the area of bystander...",
  "itunes:episodeType": "full",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Kitty Genovese: what you know about what happened to her is wrong. Kitty Genovese was repeatedly attacked while others watched and did nothing - right? Wrong. While the story lead to a long and successful line of research in the area of bystander intervention and diffusion of responsibility, the facts of the story are incorrect. What are the facts behind the Kitty Genovese case and if groups are so unlikely to help, how do you explain how people came together to help at 911? Let's take another look at the legacy of this famous story in this episode."
}