{
  "id": "yt:video:b7i0gAgcf7k",
  "yt:videoId": "b7i0gAgcf7k",
  "yt:channelId": "UC6dI8msF1_I9HuDSvMtk_nQ",
  "title": "The Roblox Counter-Strike Clone That Became An Esport - Counter Blox",
  "link": "",
  "author": {
    "name": "Akshon Esports",
    "uri": "https://www.youtube.com/channel/UC6dI8msF1_I9HuDSvMtk_nQ"
  },
  "published": "2022-06-04T14:00:16+00:00",
  "updated": "2022-07-08T21:37:10+00:00",
  "media:group": {
    "media:title": "The Roblox Counter-Strike Clone That Became An Esport - Counter Blox",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Counter Blox - Roblox’s FPS Gateway\n\nCounter Strike. It’s known to many as one of the biggest tactical FPS games on the market and to some, it’s known as THE FPS game to play. \n\nWith over 20 years passing since its initial release and multiple iterations of the game, this tactical shooter is now one of the biggest esport titles today. Fans worldwide witnessed years of professional gameplay, legends in the making, and teams that solidified their names on history books forever. \n\nWhile Counter-Strike and many games like it were available to the public, a large demographic was blocked off simply due to an age restriction, that demographic being kids. While there are tactical FPS games now with a Teen rating like Valorant being able to disable mature graphic content, Counter-Strike is and has always been an 18+ or Mature-rated game. \n\nThat age rating was often bypassed by entering your birth year to be in the 1900s but other than that, there was no legitimate way for kids and teens to play a tactical FPS game… or was there? \n\nInside the sandbox world of blocks sparked a gateway for many players today, in this video, we will be covering the competitive scene of Counter Blox, Roblox’s FPS Gateway.\n\nSupport us on Patreon: https://patreon.com/akshonesports\nSubscribe to our channel! https://goo.gl/OvCljl\n\nJoin our Discord community: https://discord.gg/ZHeCNJQUpY\n\nBecome a Member to support us: https://www.youtube.com/channel/UC6dI8msF1_I9HuDSvMtk_nQ/join\n\nFollow us to stay up to date with our releases! \n\nWebsite: https://www.akshonmedia.com/\nFacebook: https://www.facebook.com/akshonesports/\nInstagram: https://www.instagram.com/akshonesports/\nTwitter: https://twitter.com/akshonesports\n\n#esports #gaming #roblox",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}