{
  "title": "S17 Ep106: Mystery At The Blue Sea Cottage w/ James Stewart",
  "link": "https://audioboom.com/posts/8152416",
  "itunes:episode": 106,
  "itunes:title": "Mystery At The Blue Sea Cottage w/ James Stewart",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 9294,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>True Crime Tuesday presents Mystery At The Blue Sea Cottage with Author, James Stewart!! <br>\n<br>\nSet in Jazz Age San Diego against the backdrop of yellow journalism, notorious Hollywood scandals, Prohibition corruption and a lively culture war, Mystery At The Blue Sea Cottage tells the intriguing true crime story of a beautiful dancer, a playboy actor, and a debonair doctor.<br>\n<br>\nIn January 1923, 20-year-old Fritzie Mann left home for a remote cottage by the sea to meet a man whose identity she had revealed to no one. The next morning, the barely clad body of the beautiful and bewitching dancer washed up on lonely Torrey Pines beach, her party dress and possessions strewn about on the sand.<br>\n<br>\nThe scene baffled investigators. Was it suicide, murder, or an accidental drowning? A botched autopsy created more questions than it answered. However, the investigation revealed a scandalous secret and, possibly, a powerful motive for murder.<br>\n<br>\nAfter a suspect was arrested and charged with murder, an ambitious district attorney battled a high-profile L.A. private counsel in the most sensational trial in San Diego’s history that was followed avidly across the nation. The big question: <em>What really happened at the Blue Sea Cottage? </em>Author James Stewart joins TCT to tell us the story!  <em><br>\n</em><br>\nPLUS: an all new Dumb Crimes/Stupid Criminals with Beer City Bruiser!<br>\n<br>\nGet the book, \"Mystery At The Blue Sea Cottage...\", Here: <a href=\"https://wildbluepress.com/last-jewish-gangster-middle-years-true-crime/\">https://wildbluepress.com/mystery-at-the-blue-sea-cottage-james-stewart-true-crime/</a><br>\n<br>\nCheck out more about James Stewart at : <a href=\"https://www.jamesstewartauthor.com/\">https://www.jamesstewartauthor.com/</a><br>\n<br>\n#crime #truecrime #truecrimepodcasts #truecrimetuesday #jamesstewart #mysteryattheblueseacottage #fritziemann #jazzage #torreypines #1920s #historicaltruecrime #autopsy #murdermystery #oldhollywood #cecillebdemille  #dumbcrimesstupidcriminals #TimDennis #BeerCityBruiser #ROH #RingofHonorWrestling #floridaman #drugcrimes #foodcrimes #stupidcrimes #funnycrimes </div>\n",
  "pubDate": "Tue, 06 Sep 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-06:/posts/8152416",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}