{
  "id": "https://bibleinoneyear.org/en/youth/293",
  "title": "Day 293: Hard Times",
  "description": "Psalm 119:66–72, Jeremiah 43:1–2, 44:1–5, 1 Timothy 5:1–20, 6:1-2.  We live in a fallen world  Everyone goes through hard times and some people find themselves in circumstances that make life hard all of the time",
  "pubDate": "Thu, 20 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/293/",
  "itunes:duration": "14:50",
  "guid": "enyouth20102022-293",
  "length": 890.98,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 293: Hard Times",
  "itunes:subtitle": "Psalm 119:66–72, Jeremiah 43:1–2, 44:1–5, 1 Timothy 5:1–20, 6:1-2.  We live in a fallen world  Everyone goes through hard times and some people find themselves in circumstances that make life hard all of the time",
  "itunes:summary": "Smith Wigglesworth was born on 8 June 1859 to an impoverished family in Yorkshire. As a small child he worked in the fields pulling turnips alongside his mother. He was illiterate until, at the age of twenty-three, he married Polly, who taught him to read. He often said that the Bible was the only book he ever read.\nHe was a plumber by trade but had to abandon it after he became too busy with an amazing ministry of preaching and healing. There are even accounts of people being raised from the dead through his ministry. Yet, he said on one occasion that he would rather see one person saved through his preaching than 10,000 healed.\nLife was not always easy for Smith Wigglesworth. He went through some very hard times. He wrote, ‘Great faith is a product of great fights. Great testimonies are the outcome of great tests. Great triumphs can only come out of great trials.’\nThe Bible is very realistic. We live in a fallen world. Everyone goes through hard times and some people find themselves in circumstances that make life hard all of the time.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 658
}