{
  "title": "#426: Discovering Sorcerer's Stone",
  "link": "https://audioboom.com/posts/7322485",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4421,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Do the people behind Wizards Unite listen to MuggleCast? Some new game features would suggest so!</li>\n<li>Eric announces the <a href=\"http://www.mugglenet.com/fans-fun/crazy-caption-contest/\">MuggleNet Caption Contest</a> is back!</li>\n<li>#MuggleCasTBT takes us back to a bold prediction made about Nicolas Flamel and his \"safe house\" in Crimes of Grindelwald</li>\n<li>We take listener feedback on last week's Dark Mark tattoo debate</li>\n<li>Our Main Discussion focuses on The Beginning of Harry Potter</li>\n<li>Did Sorcerer's Stone launch a generation of readers?</li>\n<li>Harry Potter's biggest ally may have been the Internet!</li>\n<li>How did all of the hosts get started on the Potter series?</li>\n<li>We discuss J.K. Rowling's struggles behind getting published, including being a woman</li>\n<li>Did you know Rowling didn't even have a middle name until Sorcerer's Stone was published?</li>\n<li>We revisit our <a href=\"http://www.mugglecast.com/episode-200/\">Episode 200 interview</a> with Harry Potter producer David Heyman, who talks about how he found Harry</li>\n<li>Was it really necessary to change Book 1's name to Sorcerer's Stone in the United States? We read interesting comments from Scholastic's Editor at the time, Arthur Levine.</li>\n<li>The hosts share what moments in Sorcerer's Stone really resonated with them and name their favorite chapter</li>\n<li>Quizzitch: What time does the Hogwarts Express depart from platform 9¾?</li>\n<li>There's never been a better time to support the show! <a href=\"http://www.patreon.com/mugglecast\">Become a Patron</a> by July 31 and get this year's physical gifts - signed album art and a MuggleCast tote bag!</li>\n</ul>\n",
  "pubDate": "Mon, 22 Jul 2019 15:26:38 +0000",
  "guid": "tag:audioboom.com,2019-07-22:/posts/7322485",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}