{
  "title": "Launching Today: Mathematica Online!",
  "link": "https://blog.wolframalpha.com/2014/09/15/launching-today-mathematica-online/",
  "pubDate": "Mon, 15 Sep 2014 19:20:44 +0000",
  "dc:creator": "Stephen Wolfram",
  "category": "News",
  "guid": "https://blog.wolframalpha.com/?p=28730",
  "description": "It&#8217;s been many years in the making, and today I&#8217;m excited to announce the launch of Mathematica Online: a version of Mathematica that operates completely in the cloud&#8212;and is accessible just through any modern web browser. In the past, using Mathematica has always involved first installing software on your computer. But as of today that&#8217;s [&#8230;]",
  "content:encoded": "<p><em></em>It&#8217;s been many years in the making, and today I&#8217;m excited to announce the launch of <a href=\"http://www.wolfram.com/mathematica/online/\"><em>Mathematica</em> Online</a>: a version of <a href=\"http://www.wolfram.com/mathematica/\"><em>Mathematica</em></a> that operates completely in the <a href=\"http://www.wolfram.com/cloud\">cloud</a>&#8212;and is accessible just through any modern web browser.</p>\n<p>In the past, using <em>Mathematica</em> has always involved first installing software on your computer. But as of today that&#8217;s no longer true. Instead, all you have to do is point a web browser at <em>Mathematica</em> Online, then log in, and immediately you can start to use <em>Mathematica</em>&#8212;with zero configuration.</p>\n<p>Here&#8217;s what it looks like:</p>\n<p><a href=\" https://mathematica.wolframcloud.com/app/objects/blog-posts/MathematicaOnlineExample.nb\" target=\"_blank\"><img src=\"http://blog.stephenwolfram.com/data/uploads/2014/09/mathematica-online-notebook.png\" title=\"Click to open in Mathematica Online (you will need to log in or create a free account)\" alt=\"Click to open in Mathematica Online (you will need to log in or create a free account)\" /></a><br />\n<span id=\"more-28730\"></span></p>\n<p>It&#8217;s a notebook interface, just like on the desktop. You interactively build up a computable document, mixing text, code, graphics, and so on&#8212;with inputs you can immediately run, hierarchies of cells, and even things like <a style=\"font-family: Arial, Helvetica, sans-serif;\" href=\"http://reference.wolfram.com/language/ref/Manipulate.html\">Manipulate</a>. It&#8217;s taken a lot of effort, but we&#8217;ve been able to implement almost all the major features of the standard <em>Mathematica</em> notebook interface purely in a web browser&#8212;extending <a href=\"http://www.wolfram.com/cdf/\">CDF</a> (Computable Document Format) to the cloud.</p>\n<p>There are some tradeoffs of course. For example, <a style=\"font-family: Arial, Helvetica, sans-serif;\" href=\"http://reference.wolfram.com/language/ref/Manipulate.html\">Manipulate</a> can&#8217;t be as zippy in the cloud as it is on the desktop, because it has to run across the network.  But because its Cloud CDF interface is running directly in the web browser, it can immediately be embedded in any web page, without any plugin, like right here:</p>\n<p><iframe src=\"https://www.wolframcloud.com/objects/74d61f78-480b-4d8b-acbd-d143e93f409f?_view=MOBILE\" frameborder=\"0\" width=\"505\" height=\"560\"></iframe><br />\nAnother huge feature of <em>Mathematica</em> Online is that because your files are stored in the cloud, you can immediately access them from anywhere. You can also easily collaborate: all you have to do is set <a href=\"http://reference.wolfram.com/language/ref/Permissions.html\">permissions</a> on the files so your collaborators can access them.  Or, for example, in a class, a professor can create notebooks in the cloud that are set so each student gets their own active copy to work with&#8212;that they can then email or share back to the professor.</p>\n<p>And since <em>Mathematica</em> Online runs purely through a web browser, it immediately works on mobile devices too. Even better, there&#8217;s soon going to be a Wolfram Cloud app that provides a native interface to <em>Mathematica</em> Online, both on tablets like the iPad, and on phones:</p>\n<div class=\"colorbox-container\"><a class=\"colorbox\" title=\"\" href=\"http://blog.stephenwolfram.com/data/uploads/2014/09/wolfram-cloud-app-mathematica-online-interface-full.png\"><img title=\"Wolfram Cloud app: native interface to Mathematica Online\" src=\"http://blog.stephenwolfram.com/data/uploads/2014/09/wolfram-cloud-app-mathematica-online-interface.png\" alt=\"Wolfram Cloud app: native interface to Mathematica Online\" /></a></div>\n<p>There are lots of great things about <em>Mathematica</em> Online. There are also lots of great things about traditional desktop <em>Mathematica</em>. And I, for one, expect routinely to use both of them.</p>\n<p>They fit together really well.  Because from <em>Mathematica</em> Online there&#8217;s a single button that &#8220;peels off&#8221; a notebook to run on the desktop. And within desktop <em>Mathematica</em>, you can seamlessly access notebooks and other files that are stored in the cloud.</p>\n<p>If you have desktop <em>Mathematica</em> installed on your machine, by all means use it.  But get <em>Mathematica</em> Online too (which is easy to do&#8212;through Premier Service Plus for individuals, or a site license add-on).  And then use the Wolfram Cloud to store your files, so you can access and compute with them from anywhere with <em>Mathematica</em> Online. And so you can also immediately share them with anyone you want.</p>\n<p><img src=\"http://blog.stephenwolfram.com/data/uploads/2014/09/mathematica-online-share-access.png\" alt=\"Share access easily from Mathematica Online\" title=\"Share access easily from Mathematica Online\" width=\"505\" height=\"306\" class=\"alignnone size-full wp-image-8882\" /></p>\n<p>By the way, when you run notebooks in the cloud, there are some extra web-related features you get&#8212;like being able to embed inside a notebook other web pages, or videos, or actually absolutely any HTML code.</p>\n<p><em>Mathematica</em> Online is initially set up to run&#8212;and store content&#8212;in our main <a href=\"http://www.wolfram.com/cloud/\">Wolfram Cloud</a>. But it&#8217;ll soon also be possible to get a Wolfram Private Cloud&#8212;so you operate entirely in your own infrastructure, and for example let people in your organization access <em>Mathematica</em> Online without ever using the public web.</p>\n<p>A few weeks ago we launched the <a href=\"http://www.wolfram.com/programming-cloud/\">Wolfram Programming Cloud</a>&#8212;our very first full product based on the <a href=\"http://www.wolfram.com/language/\">Wolfram Language</a>, and Wolfram Cloud technology. <em>Mathematica</em> Online is our second product based on this technology stack.</p>\n<p>The Wolfram Programming Cloud is focused on creating deployable cloud software. <em>Mathematica</em> Online is instead focused on providing a lightweight web-based version of the traditional <em>Mathematica</em> experience. Over the next few months, we&#8217;re going to be releasing a sequence of other products based on the same technology stack, including the <a href=\"http://www.wolfram.com/discovery-platform/\">Wolfram Discovery Platform</a> (providing unlimited access to the <a href=\"http://www.wolfram.com/knowledgebase/\">Wolfram Knowledgebase</a> for R&D) and the <a href=\"http://www.wolfram.com/data-science-platform/\">Wolfram Data Science Platform</a> (providing a complete data-source-to-reports data science workflow).</p>\n<p>One of my goals since the beginning of <em>Mathematica</em> more than a quarter century ago has been to make the system as widely accessible as possible. And it&#8217;s exciting today to be able to take another major new step in that direction&#8212;making <em>Mathematica</em> immediately accessible to anyone with a web browser.</p>\n<p>There&#8217;ll be many applications. From allowing remote access for existing <em>Mathematica</em> users. To supporting mobile workers. To making it easy to administer <em>Mathematica</em> for project-based users, or on public-access computers. As well as providing a smooth new workflow for group collaboration and for digital classrooms.</p>\n<p>But for me right now it&#8217;s just so neat to be able to see all the power of <em>Mathematica</em> immediately accessible through a plain old web browser&#8212;on a computer or even a phone.</p>\n<p>And all you need do is go to the <a href=\"http://mathematica.wolframcloud.com\"><em>Mathematica</em> Online website</a>&#8230;</p>\n<hr>\n<p><em>To comment, please visit the copy of this post at the <a href=\"http://blog.wolfram.com/2014/09/15/launching-today-mathematica-online\">Wolfram Blog »</a></em></p>\n"
}