{
  "title": "The Battle Over Parents’ Rights in Education Is Just Getting Started",
  "link": "https://www.heritage.org/education/commentary/the-battle-over-parents-rights-education-just-getting-started",
  "description": "<p>It should come as no surprise that parents have been fighting for their rights so vociferously when it comes to public education. They’re fighting because they sense that those rights are under attack.</p>\n\n<p>It started with the <a href=\"https://www.cnn.com/2020/03/17/health/restrictions-lockdowns-confusion-coronavirus-intl/index.html\" target=\"_blank\">lockdowns in 2020</a>. For the first time, many parents suddenly saw, courtesy of online conferencing apps like Zoom, what their kids were being taught. And they didn’t like it: <a href=\"https://www.city-journal.org/yes-critical-race-theory-is-being-taught-in-schools\" target=\"_blank\">Toxic and divisive ideas about race</a>—disguised as lessons on slavery and racism—contradicted the belief in racial equality that most Americans—whatever their politics—shared with civil rights leaders like Dr. Martin Luther King, Jr.</p>\n\n<p>But critical race theory is far less shocking than the radical<a href=\"https://www.cnn.com/2020/06/10/health/gender-identity-explainer-wellness/index.html\" target=\"_blank\"> gender ideology</a> that seems to have overtaken our nation’s schools. It teaches children that “some people are boys, some people are girls, some people are both, neither, or somewhere in between”’—as <a href=\"https://www.prideandlessprejudice.org/book-gallery/it-feels-good-to-be-yourself\" target=\"_blank\">one popular children’s book</a> puts it.</p>\n\n<p>Schools are promoting the notion that some kids—perhaps many kids if recent trends continue—are born in the wrong body. Suddenly, from Florida to Texas to Wyoming, parents are discovering that schools are teaching, seemingly across the curriculum, that an internal sense of gender trumps biological sex. Worse, some schools are changing, at their students’ request—but <a href=\"https://www.washingtonpost.com/education/2022/08/20/gender-transition-identity-montgomery-county/\" target=\"_blank\">without their parents’ knowledge</a> or consent—their students’ names and pronouns to conform to a child’s surprising new “gender identity.”</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/education/commentary/americas-school-choice-moment-cant-be-missed-midterm-elections\">America’s School Choice Moment Can’t Be Missed at Midterm Elections</a></strong></p>\n\n<p>When parents come to school board meetings to complain, far too many are met with silence or risible accusations that they are politicizing education. Parents have the primary right and responsibility to raise and teach their children.</p>\n\n<p>Many parents delegate part of the teaching task to schools, in an act of trust. Rather than acting as faithful stewards of that trust, too many schools have decided that it’s their job to alienate kids from “regressive” views of their parents.</p>\n\n<p>Is it any wonder that this has proved controversial?</p>\n\n<p>We could dissipate some of the heat by increasing the rights of parents over their children’s schooling. States should connect school money to children, rather than to school buildings. Universal school choice for everyone—rich and poor, conservative and liberal—would not just make schools better and more competitive. It would make them less of an arena for the culture war that is otherwise roiling our culture.</p>",
  "pubDate": "Fri, 04 Nov 2022 17:24:22 -0400",
  "dc:creator": "Jay W. Richards, Ph.D.",
  "guid": "https://www.heritage.org/education/commentary/the-battle-over-parents-rights-education-just-getting-started"
}