{
  "title": "A CCP Is a CCP Is a CCP",
  "link": "https://fedinprint.org/item/fedhpd/93561",
  "description": "Central counterparties (CCPs) are an important part of contemporary financial market infrastructure. The orderly risk management operations and financial resilience of CCPs and other market infrastructures are essential for financial stability.\nRegulators and other policymakers face a major challenge constructing appropriate regulatory \nframeworks for central clearing, given unique features of CCP risk profiles and, in particular, the \nmutualization of default losses. While CCPs may have superficial similarities to other infrastructures and exposed to risks like those borne by banks and other participants in the financial system, CCPs are best seen as “commitment mechanisms” that assure the performance of financial contract obligations. How they perform that function sets them apart from other infrastructures, intermediaries and financial institutions.\nThe challenge of establishing standards for CCP risk management and resilience is even more difficult \nwhen policymakers view CCPs through the lens of bank regulation. CCPs are not banks. Their function \nas commitment mechanisms bears little resemblance to the risk-taking function of banks. Nor are CCPs depositories, payment systems, insurance companies or exchanges, although they have features that resemble insurance and may have connections to other market infrastructures\nThis paper discusses many differences between CCPs and banks and the significance of those differences, including their business models and risk profiles, with CCPs acting as risk managers that are uniquely subject to the credit and liquidity risk of clearing member default. In particular, we focus on differences in the roles that capital and collateral play in connection with CCP and bank risk management. From this discussion, we draw the following policy conclusions: (1) a CCP’s capital cannot be the primary (or a significant) resource for loss absorption without fundamentally altering the incentive structure embedded in the default “waterfall” through which losses are mutualized, if not the business model of the CCP itself; (2) accordingly, capital analysis alone tells us little or nothing about CCP resilience or ability to recover from threats to the viability of the CCP; and (3) stress testing for CCPs must focus on features that are unique to central clearing, principally the possibility and consequences of member default.",
  "guid": "https://fedinprint.org/item/fedhpd/93561",
  "dc:creator": "Cox, Robert; Steigerwald, Robert",
  "dc:date": "2017-04-01",
  "rdau:hasExtent": 21,
  "dc:subject": "Central Counterparties; Risk Management; Credit; Liquidity",
  "bibo:series": "Policy Discussion Paper Series"
}