{
  "title": "Your Democracy Was Stolen Long Before January 6",
  "itunes:title": "Your Democracy Was Stolen Long Before January 6",
  "pubDate": "Fri, 07 Oct 2022 05:30:00 +0000",
  "guid": "93c4517f-1fb1-4751-bab5-5cf56decf0c3",
  "link": "https://thejimmydoreshow.libsyn.com/your-democracy-was-stolen-long-before-january-6",
  "itunes:image": "",
  "description": "<p>Chris Hedges is among the most incisive, trenchant analysts of the social, economic and political factors influencing the world for the past 30 years. And he’s here to tell you that the January 6th riots were not the great threat to American democracy they’re cracked up to be. American democracy has been steadily eroding since the Reagan administration, Hedges says, and if you think Donald Trump’s arrival on the political scene is what killed democracy you have not been paying attention.<br /> <br /> Jimmy and his panel of Hedges and America’s comedian Kurt Metzger discuss the myriad ways Wall Street, Big Pharma, weapons manufacturers, Big Ag and other powerful sectors snatched away the reins of power from the American people decades ago.<br /> <br /> Plus a segment on news that the Nord Stream 2 was not, in fact, permanenly disabled by the recent sabotage attempt, and may be operational again very soon.<br /> <br /> Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Alec Baldwin and Joe Biden!</p>",
  "content:encoded": "<p>Chris Hedges is among the most incisive, trenchant analysts of the social, economic and political factors influencing the world for the past 30 years. And he’s here to tell you that the January 6th riots were not the great threat to American democracy they’re cracked up to be. American democracy has been steadily eroding since the Reagan administration, Hedges says, and if you think Donald Trump’s arrival on the political scene is what killed democracy you have not been paying attention.  Jimmy and his panel of Hedges and America’s comedian Kurt Metzger discuss the myriad ways Wall Street, Big Pharma, weapons manufacturers, Big Ag and other powerful sectors snatched away the reins of power from the American people decades ago.  Plus a segment on news that the Nord Stream 2 was not, in fact, permanenly disabled by the recent sabotage attempt, and may be operational again very soon.  Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Alec Baldwin and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "56:12",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Chris Hedges is among the most incisive, trenchant analysts of the social, economic and political factors influencing the world for the past 30 years. And he’s here to tell you that the January 6th riots were not the great threat to American...",
  "itunes:episodeType": "full",
  "itunes:summary": "Chris Hedges is among the most incisive, trenchant analysts of the social, economic and political factors influencing the world for the past 30 years. And he’s here to tell you that the January 6th riots were not the great threat to American democracy they’re cracked up to be. American democracy has been steadily eroding since the Reagan administration, Hedges says, and if you think Donald Trump’s arrival on the political scene is what killed democracy you have not been paying attention. Jimmy and his panel of Hedges and America’s comedian Kurt Metzger discuss the myriad ways Wall Street, Big Pharma, weapons manufacturers, Big Ag and other powerful sectors snatched away the reins of power from the American people decades ago. Plus a segment on news that the Nord Stream 2 was not, in fact, permanenly disabled by the recent sabotage attempt, and may be operational again very soon. Also featuring Stef Zamorano, Aaron Maté and Mike MacRae! And phone calls from Alec Baldwin and Joe Biden!"
}