{
  "title": "Inflation &#8211; Should We Be Worried?",
  "link": "https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/",
  "comments": "https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Tue, 11 Jan 2022 18:51:09 +0000",
  "category": [
    "The MMM Blog",
    "inflation",
    "investing",
    "Retirement"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=17986",
  "description": "I’ve been writing about money for almost eleven years now, and in that time the world has become an immensely richer place. Here in the US, our economy has grown by about 25% even after inflation, world economic output has grown even faster, and the number of people living in extreme poverty has been cut [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/\"><img style=\"max-width:100%;height:auto\" width=\"563\" height=\"800\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-fears.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-fears.jpg 563w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-fears-211x300.jpg 211w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-fears-127x180.jpg 127w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-fears-106x150.jpg 106w\" sizes=\"(max-width: 563px) 100vw, 563px\" /></a>\n\n<p>I’ve been writing about money for almost eleven years now, and in that time the world has become an <em>immensely richer place.</em> </p>\n\n\n\n<p>Here in the US, our economy has grown by about 25% even after inflation, world economic output has grown even faster, and the number of people living in extreme poverty has been cut roughly in half.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-1024x473.jpg\" alt=\"\" class=\"wp-image-17989\" width=\"457\" height=\"211\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-1024x473.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-300x139.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-200x92.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-768x355.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-1536x710.jpg 1536w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-150x69.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021-900x416.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-GDP-2011-2021.jpg 1554w\" sizes=\"(max-width: 457px) 100vw, 457px\" /></a><figcaption>US Real Economic Growth over the Mustachian Era</figcaption></figure></div>\n\n\n\n<p>If this seems like just a fluke, you might be happy to learn that it is not. This is just the latest decade in a long era of increasing wealth. Here&#8217;s a similar chart, but zoomed out to cover the past 1.2 centuries and include the whole world:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-1024x689.jpg\" alt=\"\" class=\"wp-image-17990\" width=\"438\" height=\"295\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-1024x689.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-300x202.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-200x135.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-768x517.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-1536x1033.jpg 1536w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-150x101.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp-900x605.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/world-gdp.jpg 1802w\" sizes=\"(max-width: 438px) 100vw, 438px\" /></a><figcaption>World economic output, even after inflation. What&#8217;s your guess at what might happen next? (source: <a rel=\"noreferrer noopener\" href=\"https://ourworldindata.org/grapher/world-gdp-over-the-last-two-millennia?time=1900..2015\" target=\"_blank\">Our World In Data</a>)</figcaption></figure></div>\n\n\n\n<p>If you’ve been following the Principles of Mustachianism for a while now, you have probably noticed the same thing: <em>“Gosh Darnit, it may just be a long run of good luck, but today I am richer than ever!”</em></p>\n\n\n\n<div class=\"mmm-box\"></p>\n\n\n\n<p><em><strong>By the Way:</strong> Are you new here and ready for the full zero-to-hero program on wealth and less-ridiculous living? I have set up a Free &#8220;MMM Bootcamp&#8221; email series which you can join <strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://mrmoneymustache.ck.page/68f9e9826c\" target=\"_blank\">here</a></span></strong> if you click the drop-down box and find the &#8220;bonus option&#8221;.</em></p>\n\n\n\n<p><em><br> No spam, no courses to sell, just the 35-ish most useful articles from the entire history of this blog, spoon-fed to you on a weekly basis until you graduate.</em> </p>\n\n\n\n<p></div>\n\n\n\n<p>.</p>\n\n\n\n<p>For people who have combined solid money habits with this long economic boom, this means that early retirements have come even earlier than expected, and I have noticed the same thing: my own net worth has gone up several hundred percent since officially “retiring” in 2011. Sure, I’ve continued to live a somewhat reasonable lifestyle and spend less than I earn. But most of the boost has come from the increasing value of productive investments including houses, shares in companies, and local businesses.</p>\n\n\n\n<p>Still,&nbsp; throughout all this time, as the world churned on and we all got richer, I have received a stream of critical comments like this one claiming that <strong>Inflation </strong>is the critical flaw that means none of this is real:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed.png\" alt=\"\" class=\"wp-image-17991\" width=\"689\" height=\"161\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed.png 927w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed-300x70.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed-200x47.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed-768x180.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed-150x35.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/unnamed-900x211.png 900w\" sizes=\"(max-width: 689px) 100vw, 689px\" /></figure></div>\n\n\n\n<p><strong>Does Nick Have a Point? Is Inflation going to Kill us?</strong></p>\n\n\n\n<p>Inflation has been around since the dawn of money, so we <em>know </em>that it can co-exist with an increase in prosperity. But for the past few decades, the rate of inflation in most rich economies has been extremely low, which means it simply hasn’t been at the top of the news headlines.&nbsp;</p>\n\n\n\n<p>Until today, when inflation has made a sudden return.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-1024x362.jpg\" alt=\"\" class=\"wp-image-17992\" width=\"597\" height=\"211\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-1024x362.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-300x106.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-200x71.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-768x272.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-150x53.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines-900x318.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/inflation-headines.jpg 1470w\" sizes=\"(max-width: 597px) 100vw, 597px\" /></figure></div>\n\n\n\n<p> Suddenly, everyone from Ted the Conservative Senator to Chad the Newly minted Bitcoin Bro is going off about about how “<em>The Fed is debasing our currency by printing too much money</em>&#8220;, &#8220;<em>We’re already seeing hyperinflation</em>&#8221; and everything is <em>just about to slide into the shitter.&nbsp;</em></p>\n\n\n\n<p>&nbsp;So should we be worried?</p>\n\n\n\n<p>Well, let’s start by ignoring the talking heads and opening up a proper graph of what has actually been happening:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2.jpg\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" width=\"1024\" height=\"425\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-1024x425.jpg\" alt=\"\" class=\"wp-image-18018\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-1024x425.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-300x124.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-200x83.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-768x318.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-1536x637.jpg 1536w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-150x62.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2-900x373.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/01/US-inflation-history-2.jpg 1756w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></a><figcaption><strong>Red line:</strong> overall inflation rate over roughly my lifetime.<br><strong>Blue line: </strong>same thing but with volatile food and energy prices stripped out.<br><strong>Summary:</strong> inflation fluctuates, no big deal.</figcaption></figure></div>\n\n\n\n<p>So it looks like this year, we are seeing overall prices rise at a 5-6% rate. More than the 2% we had become accustomed to, but far less than the 70s and 80s. But still, what does this really <em>mean?</em></p>\n\n\n\n<p>As always, Warren Buffett has a wise and concise opinion on the subject, paraphrased as:</p>\n\n\n\n<p class=\"has-text-align-center\"><em>“Over my lifetime, the US dollar has lost over ninety percent of its purchasing power. Yet even after adjusting for that inflation, the net output of our economy has grown by over twenty times &#8211; over 2000%”</em></p>\n\n\n\n<p>So the opinions vary widely. But in order to form a valid opinion for ourselves, let’s just dive in and understand the underlying big picture. It’s surprisingly simple.</p>\n\n\n\n<p><strong>What Causes Inflation?</strong></p>\n\n\n\n<p>This part of it is quite intuitive: <strong>when too much money is chasing too few goods and services,</strong> you get inflation.</p>\n\n\n\n<p>For example, If there is only one house for sale in town and you and I both really want it, we are going to place competing bids back and forth, and the seller will let it go to the highest bidder.</p>\n\n\n\n<p>Houses are the perfect illustration of supply and demand, because people want them so much that they will go nuts trying to outbid each other, and thus the prices can get high. When this happens, economists say that the <strong>demand is </strong><strong><em>inelastic</em></strong><em>.</em></p>\n\n\n\n<p>Meanwhile, some things are considered less essential, which means our demand for them becomes more elastic. If you’re accustomed to buying bananas at 69 cents per pound and suddenly the price jumps to $2.99, your response is likely to be&nbsp;</p>\n\n\n\n<p><em>“TWO NINETY NINE!!!?? FUCK THAT WHAT KIND OF DAMN FOOL DO YOU TAKE ME FOR? I’ll just skip the bananas this week.”</em></p>\n\n\n\n<p>Demand becomes even more elastic if we have the option of <strong>substitute goods. </strong>If you have just finished cussing out the $2.99 bananas but then see a pile of 99 cent per pound apples, you will likely just switch to the new fruit this week. And then do the opposite next week if the price trend reverses.</p>\n\n\n\n<p><strong>Price Competition</strong></p>\n\n\n\n<p>Meanwhile, all of this decision-making goes on in reverse on the other side of the cash register. If Pete’s Grocery store tries to jack up its banana prices to $2.99, but Jill across the street is still offering them for 99 cents, people will just vote with their wallets and Jill will get almost all the business.</p>\n\n\n\n<p><strong>Elastic Supply</strong></p>\n\n\n\n<p>On the other hand, if there is a <em>worldwide shortage </em>of bananas, then there just aren’t enough to go around. This causes more of that “selling to the highest bidder” we saw with the houses above, which means the wholesale prices that all the grocery stores have to pay goes up. Does this mean $2.99 bananas forever?</p>\n\n\n\n<p>In the short term, yes. Bananas take a while to grow, so when you harvest them all, they are gone.&nbsp;</p>\n\n\n\n<p>In the long term, no. A tripling of the price of bananas means that the <em>whole banana industry is now more profitable, </em>which means more farmers will choose to plant bananas. Over time, the supply will rise and price competition will work out the kinks of the system.</p>\n\n\n\n<p>In other words, in the longer term <strong>the supply of almost everything is elastic </strong>&#8211; if the price of something rises, more of it will eventually be produced. And then even more, and sometimes so much that the prices go back down <em>below </em>where they were in the first place.</p>\n\n\n\n<p>The magic of economics is that in the long run, prices for almost anything compete themselves all the way down to the point where it is barely profitable to make a product. And this is why over time, life keeps getting cheaper and our standard of living keeps rising. Despite the fact that inflation keeps happening in the background.</p>\n\n\n\n<p><strong>Why Inflation does NOT mean we are getting poorer</strong></p>\n\n\n\n<p>If the price of bananas doubles, and your salary doubles, nothing has really changed: you can still afford exactly the same number of them. And with typical inflation, this is exactly what happens: the prices of everything gradually rise, including the price of labor (aka YOU), which means your paycheck rises.</p>\n\n\n\n<p>Even if you’re retired and living off of your investments, inflation is typically harmless: the prices of assets (like houses, buildings, or slices of businesses known as “stocks”) also inflate right along with currency, so you are at least as well-off as before.</p>\n\n\n\n<p>Even better, if you are a <em>borrower, </em>inflation actually helps you: If you borrowed $300,000 for a house ten years ago that is now worth $600k, the full value of the house is yours but the bank only expects their 300k back.&nbsp;</p>\n\n\n\n<p><strong>In the Long Run, Technology And Trade are Deflationary</strong></p>\n\n\n\n<p>I bought my first Windows PC (a 486 DX2-80)  as an Engineering Student in 1994 at the staggering cost of $2600 ($4800 in today’s dollars!) Today, there is more processing power in a <span style=\"text-decoration: underline;\"><a href=\"https://amzn.to/3OBoLiE\">nine dollar WiFi smart outlet</a></span>. And the $1200 high-end laptop I’m using to type this article would run laps around the CIA’s grocery-store-sized mainframe computers from the nineties.</p>\n\n\n\n<p>When I was a kid, a gallon of milk cost four dollars (about ten bucks today). But you can still get a gallon for only four of <em>today’s </em>dollars in any grocery store. When my mom took me back-to-school shopping in 1984, I remember her wincing at the forty dollar price tag of Levi’s jeans, and today jeans are often under $20.</p>\n\n\n\n<p>On and on the list goes: in the nineties a car that could hit 60 MPH in four seconds was called a “Lamborghini” and cost $250,000. Today that’s a base model Tesla that holds five people, costs five times less, never needs an oil change, and costs about eight bucks to fill up with 360 miles of electricity. Appliances are better and cheaper. Yesterday’s top luxuries are dumped on today’s Craigslist for almost free. University tuition is rising but education is far cheaper than ever. Medical procedures and doctor salaries are going up, but being healthy is cheaper and easier than ever &#8211; thanks to the wealth of free knowledge on what’s actually good for us.</p>\n\n\n\n<p>And this trend is only getting started &#8211; technology is on an exponential curve and we are just starting to see its steepening trajectory right now.</p>\n\n\n\n<p><strong>Why S</strong><strong><em>ome</em></strong><strong> Inflation is Good:</strong></p>\n\n\n\n<p>So, inflation is good for borrowers, neutral for investors, and it’s only bad for people who are either holding cash, or stuck with an income source that does <em>not</em> keep up with inflation.&nbsp;</p>\n\n\n\n<p>But it’s also good for the economy in general. Why? Because if people expect that prices will rise slightly over time, it encourages them to spend and invest <em>right now. </em>If prices are stable or dropping, we have an incentive to wait as long as possible to make a purchase, to get the lowest possible price. This isn’t just hypothetical &#8211; deflation has been happening in Japan for over 20 years, and has been a core part of that country’s chronic economic problems.</p>\n\n\n\n<p>Because of this, the central bankers that pull the strings behind our economy (Federal Reserve bank and the Treasury) generally work together to engineer a controlled rate of economic expansion and inflation over time. If things get too hot, they slow it down by raising interest rates. If we have a harsh recession, they do the opposite and drop interest rates as well as “printing money” to purchase bonds, loans, sometimes even stocks in order to prop up prices and re-start the economic engine. This practice is controversial at times, but as you can see from stock and house prices, company profits and “Now Hiring” signs everywhere, it does work.</p>\n\n\n\n<p><strong>And Then Covid Hit</strong></p>\n\n\n\n<p>At last, we’re ready to understand what is happening right now, how we got here, and what will happen next.&nbsp;</p>\n\n\n\n<p>So we cruised our way through the 1990s, 2000s, and 2010s with lots of economic growth. There were occasional shocks (the Great Financial Crisis of 2008 comes to mind), and yet somehow the world cranked on.&nbsp;</p>\n\n\n\n<p>Until March 2020, when the entire world conducted an unprecedented experiment:</p>\n\n\n\n<ol><li>We shut down many of our businesses, factories, and shipping ports.</li><li>While simultaneously giving everybody free money and lowering interest rates in a (successful) bid to avoid a second Great Depression.</li></ol>\n\n\n\n<p>Item (1) is still having ripple effects: as different governments impose and lift lockdowns and quarantines, factories and shipping ports are still not up to full speed.</p>\n\n\n\n<p>Then item (2) multiplied those effects because we were all stuck at home with extra money, meaning we spent less on restaurants and more on stuff from Amazon, appliances, new cars, and so on.&nbsp;</p>\n\n\n\n<p>And on top of that, the low interest rates made house payments more affordable, which allowed people to leverage even further to bid up prices of scarce housing. Businesses did the same, trying to expand and competing for the same scarce supply of products as everyone else.</p>\n\n\n\n<p>While the pandemic itself took everyone by surprise, the aftermath has been completely predictable and straight out of an Economics 101 textbook. Which makes me happy, because Economics has always been one of my favorite fields.</p>\n\n\n\n<p><strong>So What Happens Now?</strong></p>\n\n\n\n<p>The first rule of this situation is the same as all other situations: <strong>don’t panic, and enjoy this whole journey as a learning experience</strong>. Prices will fluctuate, and the world’s economy will adjust accordingly in the coming years. You and I will continue to prosper.</p>\n\n\n\n<p>The big picture magic is already starting to happen: supply chains are beginning to untangle themselves, and companies are making big new investments to increase production. Despite the rumors of &#8220;all the jobs going overseas&#8221;, the opposite is actually happening. Intel is building <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://www.reuters.com/technology/intel-breaks-ground-20-bln-arizona-plants-us-chip-factory-race-heats-up-2021-09-24/\" target=\"_blank\">$20 <em>billion </em>worth of factories</a></span> in Arizona to address the world&#8217;s semiconductor supply, and Austin Texas is now home to what will soon be the <a rel=\"noreferrer noopener\" href=\"https://www.google.com/search?q=giga+texas&tbm=isch\" target=\"_blank\">world&#8217;s biggest automotive factory</a>. These are just two of thousands of similar projects around the world right now.</p>\n\n\n\n<p>Meanwhile, while the big picture sorts things out slowly, you can also make some immediate changes in your personal financial life:</p>\n\n\n\n<p><strong>Don’t look at <em>Prices, </em>look at <em>Relative Prices</em></strong></p>\n\n\n\n<p>Don&#8217;t get anchored on those 69 cent bananas, because 79 cents today may be exactly equal to 69 cents a few years ago. The real price has not risen, the currency has simply decreased slightly in value. What really matters is the cost of your lifestyle, as a percentage of your total income.</p>\n\n\n\n<p>Your salary should also be rising. At least keeping up with inflation but ideally much faster if your skills are growing. If you don’t see this, negotiate a raise and simultaneously start shopping for new jobs. </p>\n\n\n\n<p>For retired people like me, it can be helpful to compare the price of necessities to the value of my investments. I happen to have most of my wealth stored in the overall stock market through the VTI index fund, which has risen over 18% in the past year. Since consumer prices are only up about 6%, in reality <strong>everything should now feel about twelve percent cheaper to me today</strong> than it did even after this record year of inflation!</p>\n\n\n\n<p>On top of that, you can always take some steps to lower your own “personal rate of inflation” even more:</p>\n\n\n\n<p><strong>Substitute things to create happier days <em>and </em>lower costs.&nbsp;</strong></p>\n\n\n\n<p>If steak is getting more expensive, make something else for dinner. If gasoline prices are spiking, just plan your life to include more local activities and less driving. Also, electric cars, electric bikes and regular bikes are a big upgrade over traditional cars in <em>every </em>way, and you&#8217;ll never care about the price of gas again.</p>\n\n\n\n<p><strong>Delay expensive things.&nbsp;</strong></p>\n\n\n\n<p>As a carpenter, my favorite hobby was hit by a massive spike in lumber prices last year. But I happened to have a long list of metalworking projects on my to-do list, and a sizeable pile of steel already sitting around. So I spent 2021 building all of the elaborate fences, balconies, gates and railings that I had been procrastinating on, and now enjoy the results every day. Meanwhile, lumber prices eventually dipped over the summer so I stocked up at that time too &#8211; and now I’m good for another year of hard work and creativity.</p>\n\n\n\n<p>And so concludes our lesson on the current ‘scare’ of our news cycle. As always, it’s an opportunity for learning rather than worry, and even more importantly: you have more control over it&nbsp; than you might think.</p>\n\n\n\n<p>So here’s to 2022 &#8211; a year of happy Growth in all dimensions!</p>\n\n\n\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p><em><strong>In the Comments: </strong>Have you been affected or at least concerned by inflation? Are the news headlines or conversations with your friends and colleagues making you feel better, or worse about the current economic trends?</em></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/feed/",
  "slash:comments": 192,
  "post-id": 17986
}