{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-6327838904048105258",
  "published": "2020-03-11T09:00:00.000-07:00",
  "updated": "2020-03-11T09:00:05.170-07:00",
  "title": "Coronavirus: An update on creator support and resources",
  "content": "Dear Creators and Artists,<br /><br /><br /><br />Over the past several weeks, as we’ve all seen the growing crisis around the coronavirus, we at YouTube have been thinking about how these developments might affect you. We often say that you’re the heart of YouTube, and during this difficult time we wanted to share how <a href=\"https://www.blog.google/inside-google/company-announcements/coronavirus-covid19-response/\" target=\"_blank\">we’re working to help</a> and support you.<br /><br /><br /><br /><h3>Keeping our community informed</h3><br /><br /><br />There’s a lot of uncertainty right now, and we understand the importance of helping people find authoritative sources of news and information. We're using our homepage to direct users to the World Health Organization (<a href=\"https://www.who.int/\" target=\"_blank\">WHO</a>), the Centers for Disease Control and Prevention (<a href=\"https://www.cdc.gov/\" target=\"_blank\">CDC</a>), and other local authoritative organizations around the world to ensure users can easily find updates. We're also donating advertising inventory to governments and NGOs in impacted regions, who are using it to spotlight timely, helpful information.<br /><br /><br /><br />It remains our top priority to provide information to users in a responsible way. From the very beginning of this outbreak, we’ve worked to prevent misinformation associated with the spread of the virus. We’re also <a href=\"https://youtube.googleblog.com/2019/12/the-four-rs-of-responsibility-raise-and-reduce.html\" target=\"_blank\">raising up</a> authoritative sources in search and recommendations and showing <a href=\"https://support.google.com/youtube/answer/9004474?hl=en\" target=\"_blank\">information panels</a> on relevant videos. YouTube will continue to quickly remove videos that violate our <a href=\"https://support.google.com/youtube/answer/2801964\" target=\"_blank\">policies </a>when they are flagged, including those that discourage people from seeking medical treatment or claim harmful substances have health benefits. Finding trustworthy content is especially critical as news is breaking, and we’ll continue to make sure YouTube delivers accurate information for our users.<br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-ep3SFNH_B_A/Xmg98Mq9X0I/AAAAAAAACeA/of4XfP5cp24hjLALUuD_1Q4ljPRYOdeGQCLcBGAsYHQ/s1600/20200306_cv_proudct_youtube_mobile_grey.gif\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1000\" data-original-width=\"1000\" src=\"https://1.bp.blogspot.com/-ep3SFNH_B_A/Xmg98Mq9X0I/AAAAAAAACeA/of4XfP5cp24hjLALUuD_1Q4ljPRYOdeGQCLcBGAsYHQ/s1600/20200306_cv_proudct_youtube_mobile_grey.gif\" /></a></div><br /><h3>Partnering to help others</h3><br /><br /><br />The situation is evolving every day, and we're committed to providing you updates along the way, including any changes that may impact our processes and support systems. Check in <a href=\"https://support.google.com/youtube/answer/9777243?p=covid19_updates&amp;visit_id=637194868739116880-4122912225&amp;rd=1\" target=\"_blank\">here</a> to find the latest resources from YouTube.<br /><br /><br /><br />People around the world come to YouTube for information, but they’re also looking for something more: to find relief and connect as a community. Creators and artists bring us together, offering entertainment and solace through conversations that help us feel less alone. We’re working to help make those connections possible by meeting the increased demand for <a href=\"https://support.google.com/youtube/topic/9257891\" target=\"_blank\">live streaming</a>&nbsp;as <a href=\"https://news.stanford.edu/2020/03/05/events-postponed-canceled-stanford-responds-coronavirus-outbreak/\" target=\"_blank\">university events</a>, <a href=\"https://cloud.withgoogle.com/next/sf\" target=\"_blank\">conferences</a>, and <a href=\"https://www.youtube.com/watch?v=f5FC_a8yN3k\" target=\"_blank\">religious services</a> move their gatherings online.  <br /><br /><br /><br /><h3>Supporting creators: updates to monetization for coronavirus-related content</h3><br /><br /><br />YouTube’s policies are designed to support your work on the platform, to protect users, and to give advertisers confidence about where their ads run. We know many of you have had questions about our <a href=\"https://support.google.com/youtube/answer/6162278#Controversial_sensitive\" target=\"_blank\">sensitive events</a> policy, which currently does not allow monetization if a video includes more than a passing mention of the coronavirus. Our sensitive events policy was designed to apply to short-term events of significant magnitude, like a natural disaster. It’s becoming clear this issue is now an ongoing and important part of everyday conversation, and we want to make sure news organizations and creators can continue producing quality videos in a sustainable way. In the days ahead, we will enable ads for content discussing the coronavirus on a limited number of channels, including creators who accurately <a href=\"https://www.youtube.com/watch?v=bK2xupRNgaU\" target=\"_blank\">self-certify</a> and a range of news partners. We’re preparing our policies and enforcement processes to expand monetization to more creators and news organizations in the coming weeks. <br /><br /><br /><br /><h3>The power of community</h3><br /><br /><br />YouTube creators have shown time and again the difference it makes when we come together. We appreciate everything you do to create positive communities that allow people to turn to each other in times of need. Let’s continue to support each other as we navigate these challenging times.<br /><br /><br /><br /><i>Susan Wojcicki</i><br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}