{
  "title": "S1E35 - How to Face and Overcome Fear with Our Host, Laura Wilkinson",
  "guid": "https://pinecast.com/guid/c5189d8f-d34a-4033-abff-1f249c062ad1",
  "pubDate": "Tue, 02 Mar 2021 07:30:00 -0000",
  "itunes:duration": "00:14:38",
  "description": "<p>Due to the winter storm that hit Texas recently, and the ensuing power outage, Laura has had to postpone some of the fantastic interviews she had lined up for the podcast. However, today’s episode proves equally fascinating as she delves into something which we all experience, and about which she is asked all the time: fear. While no one is immune from it, there are ways to manage it rather than let it spiral out of control, and today, Laura breaks it all down for you.\n \nShe begins by defining what fear actually is, how healthy fear works and can help, the relationship between fear and control, and the only way to overcome fear. She also discusses the need to change the way we talk and think about fear through refocusing and reframing, the gift of gaining courage through fear and commitment, and then finishes with an offer to participate in her ‘Free 5 Day Fear Challenge’. This is a topic with which Laura possesses a vast amount of experience, and her insights and advice here today, once again, go far beyond the world of sports and into each of our daily lives, making this yet another ‘must listen’ episode of ‘The Pursuit of Gold’.</p>\n<p>Episode Highlights:\n </p>\n<ul>\n<li>Defining what fear actually is</li>\n<li>Healthy fear</li>\n<li>Fear and control</li>\n<li>Overcoming fear</li>\n<li>Changing the way we talk and think about fear</li>\n<li>Refocusing and reframing</li>\n<li>Gaining courage</li>\n<li>Commitment</li>\n<li>Laura’s Free 5 Day Fear Challenge</li>\n</ul>\n<p>Quotes:\n </p>\n<ul>\n<li>“Fear is huge in my sport…I am no stranger to fear.”</li>\n<li>“Fear basically boils down to a strong feeling.”</li>\n<li>“A healthy fear should not be absolutely paralyzing.”</li>\n<li>“However big your fears are, you are not powerless against these fears.”</li>\n<li>“Fear has no actual control over you, it’s only making you feel a certain way.”</li>\n<li>“When we ignore our fears, they don’t get smaller, they begin to grow.”</li>\n<li>“When we’re trying to push our fears away, we’re actively interacting with them.”</li>\n<li>“The only way to overcome fear is to face it.”</li>\n<li>“We have to begin trusting ourselves and our knowledge and what we know will help us.”</li>\n<li>“You cannot have courage or be brave unless you are first afraid.”</li>\n<li>“The most important ingredient to becoming courageous is commitment.”</li>\n<li>“It’s normal to freeze up and get scared just before a big, important moment. That just let’s you know how important it is to you.”</li>\n<li>“You can’t dip your toe in from the 10m to see if the water feels nice.”</li>\n<li>“The thing on the other side of fear is more important to me than the fear itself.”</li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold homepage</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>\n \nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">  Laura's Instagram</a>\nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">  Laura's Facebook page</a></p>",
  "itunes:title": "How to Face and Overcome Fear with Our Host, Laura Wilkinson",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 35
}