{
  "title": "Join the Women of AdSense summit",
  "link": "https://blog.google/products/adsense/join-women-adsense-summit/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Google AdSense is proud to partner with so many inspiring and successful businesses in Europe, the Middle East and Africa. We believe that the uniqueness of the people running these businesses is integral to what we do, and we love to see this diversity shining through the content you produce. </p><p>We’d like to show our support by inviting you to the Women of AdSense summit, which fosters leadership, inclusion and connection in the AdSense community. March is Women's History Month, a time to highlight the contributions of women throughout history and in contemporary society. We’d love to celebrate with you at the summit, which will take place on Wednesday, March 31 and is free to registered participants.<br/></p><p>During the event you will: </p><ul><li><p>Discover opportunities to grow your publishing business through monetization and content development.</p></li><li><p>Hear stories from your fellow women publishers.</p></li><li><p>Learn more about balance and resilience from our guest keynote speaker.</p></li></ul><p>This virtual event is aimed at empowering Women of AdSense across Europe, the Middle East and Africa. However, we welcome anyone who's interested in attending as an ally and supporting women in the workplace and beyond.</p><p>Applications will be accepted until Sunday, March 21. <a href=\"https://forms.gle/znxAEzJdto4kGLtFA\">Apply to participate in the event</a> and get ready to be inspired!</p><p><br/></p></div></div></body></html>",
  "pubDate": "Wed, 17 Mar 2021 16:00:00 +0000",
  "guid": "https://blog.google/products/adsense/join-women-adsense-summit/",
  "category": [
    "Google in Europe",
    "AdSense",
    "Diversity and Inclusion",
    "Google in the Middle East"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Join the Women of AdSense summit",
    "description": "Join us at the Women of AdSense summit to celebrate the women in publishing and learn how you can grow your business with AdSense.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Blog_image_r0Adbvi.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/adsense/join-women-adsense-summit/"
  },
  "author": {
    "name": "Daryna",
    "title": "Marketing Communications Program Manager",
    "department": "",
    "company": ""
  }
}