{
  "title": "S14 Ep14: Identified Flying Objects: A Multidisciplinary Scientific Approach to the UFO Phenomenon",
  "link": "https://audioboom.com/posts/8098616",
  "itunes:episode": 14,
  "itunes:title": "Identified Flying Objects: A Multidisciplinary Scientific Approach to the UFO Phenomenon",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4954,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS sees Identified Flying Objects: A Multidisciplinary Scientific Approach to the UFO Phenomenon with Dr. Michael Masters.<br>\n<br>\nCould \"aliens\" simply be us, but from the future? <br>\n<br>\nUsing an academic approach firmly rooted in Anthropology, Astronomy, Astrobiology, and Physics, Dr. Michael P. Masters, author of Identified Flying Objects: A Multidisciplinary Scientific Approach to the UFO Phenomenon, explores the premise that \"UFOs\" & \"Aliens,\" if real, are our distant human descendants, who are returning from the future to study us as members of their own hominin evolutionary past.<br>\n<br>\nVisit our guest's page: <a href=\"https://idflyobj.com/\">https://idflyobj.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nTrying to solve your own life’s mysteries?  Psychic Source is a 24/7 phone, online chat and video psychic service.  Your first three minutes are free plus it’s only .83 cents a minute for a reading up to 30-minutes. Just mention promo code DARKNESS when you call  1-800-355-9214 or sign up online at psychic source dot com.",
  "itunes:summary": "BEYOND the DARKNESS sees Identified Flying Objects: A Multidisciplinary Scientific Approach to the UFO Phenomenon with Dr. Michael Masters.\n\nCould \"aliens\" simply be us, but from the future? \n\nUsing an academic approach firmly rooted...",
  "pubDate": "Sun, 17 Feb 2019 10:00:00 +0000",
  "guid": "f5691ce6-b457-415a-9467-fca79b01a60d",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}