{
  "title": "This Implant Turns Brain Waves Into Words",
  "link": "https://spectrum.ieee.org/brain-computer-interface-speech",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-using-an-interface-looking-at-a-screen-with-words-on-it.png?id=32005613&width=1245&height=700&coordinates=156%2C0%2C157%2C0\"/><br/><br/><p>\n<strong>A computer screen </strong>shows the question “Would you like some water?” Underneath, three dots blink, followed by words that appear, one at a time: “No I am not thirsty.”\n</p><p>\n\tIt was brain activity that made those words materialize—the brain of a man who has not spoken for more than 15 years, ever since a stroke damaged the connection between his brain and the rest of his body, leaving him mostly paralyzed. He has used many other technologies to communicate; most recently, he used a pointer attached to his baseball cap to tap out words on a touchscreen, a method that was effective but slow. He volunteered for \n\t<a href=\"https://changlab.ucsf.edu/\" target=\"_blank\">my research group</a>’s clinical trial at the <a href=\"https://www.ucsf.edu/\" target=\"_blank\">University of California, San Francisco</a> in hopes of pioneering a faster method. So far, he has used the brain-to-text system only during research sessions, but he wants to help develop the technology into something that people like himself could use in their everyday lives.\n</p><hr/><p>\n\tIn \n\t<a href=\"https://www.nejm.org/doi/full/10.1056/NEJMoa2027540\" target=\"_blank\">our pilot study</a>, we draped a thin, flexible electrode array over the surface of the volunteer’s brain. The electrodes recorded neural signals and sent them to a speech decoder, which translated the signals into the words the man intended to say. It was the first time a paralyzed person who couldn’t speak had used neurotechnology to broadcast whole words—not just letters—from the brain.\n</p><p>\n\tThat trial was the culmination of more than a decade of research on the underlying brain mechanisms that govern speech, and we’re enormously proud of what we’ve accomplished so far. But we’re just getting started. \n\t<a href=\"http://changlab.ucsf.edu/\" target=\"_blank\">My lab at UCSF</a> is working with colleagues around the world to make this technology safe, stable, and reliable enough for everyday use at home. We’re also working to improve the system’s performance so it will be worth the effort.\n</p><h2>How neuroprosthetics work</h2><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A series of three photographs shows the back of a man\\u2019s head that has a device and a wire attached to the skull. A screen in front of the man shows three questions and responses, including \\u201cWould you like some water?\\u201d and \\u201cNo I am not thirsty.\\u201d\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"9c244396817e338bf94872811b9ab530\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"dfde7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-series-of-three-photographs-shows-the-back-of-a-man-u2019s-head-that-has-a-device-and-a-wire-attached-to-the-skull-a-screen-i.png?id=32001054&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">The first version of the brain-computer interface gave the volunteer a vocabulary of 50 practical words. </small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">University of California, San Francisco</small></p><p>\n\tNeuroprosthetics have come a long way in the past two decades. Prosthetic implants for hearing have advanced the furthest, with designs that interface with the \n\t<a href=\"https://en.wikipedia.org/wiki/Cochlear_implant\" target=\"_blank\">cochlear nerve</a> of the inner ear or directly into the <a href=\"https://www.mayoclinic.org/tests-procedures/auditory-brainstem-implant/about/pac-20384649\" target=\"_blank\">auditory brain stem</a>. There’s also considerable research on <a href=\"https://spectrum.ieee.org/french-regulators-approve-human-trial-of-a-bionic-eye\" target=\"_self\">retinal</a> and <a href=\"https://spectrum.ieee.org/progress-toward-a-brain-implant-for-the-blind\" target=\"_self\">brain implants</a> for vision, as well as efforts to give people with prosthetic hands <a href=\"https://spectrum.ieee.org/bionic-hands-let-amputees-feel-and-grip\" target=\"_self\">a sense of touch</a>. All of these sensory prosthetics take information from the outside world and convert it into electrical signals that feed into the brain’s processing centers.\n</p><p>\n\tThe opposite kind of neuroprosthetic records the electrical activity of the brain and converts it into signals that control something in the outside world, such as a \n\t<a href=\"https://spectrum.ieee.org/a-better-way-for-brains-to-control-robotic-arms\" target=\"_self\">robotic arm</a>, a <a href=\"https://spectrum.ieee.org/quadriplegic-pilots-race-for-gold-in-cybathlon-brain-race\" target=\"_self\">video-game controller</a>, or a <a href=\"https://spectrum.ieee.org/new-record-for-typing-by-brain-paralyzed-man-uses-brain-implant-to-type-8-words-per-minute\" target=\"_self\">cursor</a> on a computer screen. That last control modality has been used by groups such as the <a href=\"https://www.braingate.org/\" target=\"_blank\">BrainGate consortium</a> to enable paralyzed people to <a href=\"https://spectrum.ieee.org/people-paralysis-command-computers-wirelessly\" target=\"_self\">type words</a>—sometimes one letter at a time, sometimes using an autocomplete function to speed up the process.\n</p><p>\n\tFor that typing-by-brain function, an implant is typically placed in the motor cortex, the part of the brain that controls movement. Then the user imagines certain physical actions to control a cursor that moves over a virtual keyboard. Another approach, pioneered by some of my collaborators in a \n\t<a href=\"https://www.nature.com/articles/s41586-021-03506-2.epdf?sharing_token=DsRZtRuFdieF5Yaw89p1GdRgN0jAjWel9jnR3ZoTv0No0Kktd9EUuDWeYWONAJ_7c9Vh-4dwWbu73lNBtR0SQIf6IATlhZ46V90CDPbxsChH4nCQRro7BGVvoyq7J1WjdI7xyn5OqpUdtG17JjQqmnEw1vWhwTgHs15FL3T_UOt48eOhTNkpTZ2H2CIz3RxMjlpXcdtJjKbGa1Ecdmbxh24IPyhEhFKcZ3e6zl5sF2YI4i7R7KRSp2iyVjkqgbvGAaTaWTrtF-jHWV5gqTXgF8vPfRjc-_gqpuUB58vK_mTr00cZmL7718XZrMGfw2ow&tracking_referrer=spectrum.ieee.org\" target=\"_self\">2021 paper</a>, had one user imagine that he was holding a pen to paper and was writing letters, creating signals in the motor cortex that were translated into text. That approach <a href=\"https://spectrum.ieee.org/braincomputer-interface-smashes-previous-record-for-typing-speed\" target=\"_self\">set a new record for speed</a>, enabling the volunteer to write about 18 words per minute.\n</p><p>\n\tIn my lab’s research, we’ve taken a more ambitious approach. Instead of decoding a user’s intent to move a cursor or a pen, we decode the intent to control the vocal tract, comprising dozens of muscles governing the larynx (commonly called the voice box), the tongue, and the lips.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A photo taken from above shows a room full of computers and other equipment with a man in a wheelchair in the center, facing a screen. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"a99c14fa3abed1263e636f1a3c75356d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"76dc9\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-taken-from-above-shows-a-room-full-of-computers-and-other-equipment-with-a-man-in-a-wheelchair-in-the-center-facing-a-s.png?id=32001098&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The seemingly simple conversational setup for the paralyzed man [in pink shirt] is enabled by both sophisticated neurotech hardware and machine-learning systems that decode his brain signals. </small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">University of California, San Francisco</small></p><p>\n\tI began working in this area more than 10 years ago. As a neurosurgeon, I would often see patients with severe injuries that left them unable to speak. To my surprise, in many cases the locations of brain injuries didn’t match up with the syndromes I learned about in medical school, and I realized that we still have a lot to learn about how language is processed in the brain. I decided to study the underlying neurobiology of language and, if possible, to develop a brain-machine interface (BMI) to restore communication for people who have lost it. In addition to my neurosurgical background, my team has expertise in linguistics, electrical engineering, computer science, bioengineering, and medicine. Our ongoing clinical trial is testing both hardware and software to explore the limits of our BMI and determine what kind of speech we can restore to people.\n</p><h2>The muscles involved in speech</h2><p>\n\tSpeech is one of the behaviors that \n\t<a href=\"https://bmcbiol.biomedcentral.com/articles/10.1186/s12915-017-0405-3\" target=\"_blank\">sets humans apart</a>. Plenty of other species vocalize, but only humans combine a set of sounds in myriad different ways to represent the world around them. It’s also an extraordinarily complicated motor act—some experts believe it’s the most complex motor action that people perform. Speaking is a product of modulated air flow through the vocal tract; with every utterance we shape the breath by creating audible vibrations in our laryngeal vocal folds and changing the shape of the lips, jaw, and tongue.\n</p><p>\n\tMany of the muscles of the vocal tract are quite unlike the joint-based muscles such as those in the arms and legs, which can move in only a few prescribed ways. For example, the muscle that controls the lips is a sphincter, while the muscles that make up the tongue are governed more by hydraulics—the tongue is largely composed of a fixed volume of muscular tissue, so moving one part of the tongue changes its shape elsewhere. The physics governing the movements of such muscles is totally different from that of the biceps or hamstrings.\n</p><p>\n\tBecause there are so many muscles involved and they each have so many degrees of freedom, there’s essentially an infinite number of possible configurations. But when people speak, it turns out they use a relatively small set of core movements (which differ somewhat in different languages). For example, when English speakers make the “d” sound, they put their tongues behind their teeth; when they make the “k” sound, the backs of their tongues go up to touch the ceiling of the back of the mouth. Few people are conscious of the precise, complex, and coordinated muscle actions required to say the simplest word.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A man looks at two large display screens; one is covered in squiggly lines, the other shows text.\\u00a0\" class=\"rm-shortcode\" data-rm-shortcode-id=\"cff1723a7666c03132d4cc94943f4e92\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ef273\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-man-looks-at-two-large-display-screens-one-is-covered-in-squiggly-lines-the-other-shows-text-u00a0.png?id=32001182&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Team member David Moses looks at a readout of the patient’s brain waves [left screen] and a display of the decoding system’s activity [right screen].</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">University of California, San Francisco</small></p><p>\n\tMy research group focuses on the parts of the brain’s motor cortex that send movement commands to the muscles of the face, throat, mouth, and tongue. Those brain regions are multitaskers: They manage muscle movements that produce speech and also the movements of those same muscles for swallowing, smiling, and kissing.\n</p><p>\n\tStudying the neural activity of those regions in a useful way requires both spatial resolution on the scale of millimeters and temporal resolution on the scale of milliseconds. Historically, noninvasive imaging systems have been able to provide one or the other, but not both. When we started this research, we found remarkably little data on how brain activity patterns were associated with even the simplest components of speech: phonemes and syllables.\n</p><p>\n\tHere we owe a debt of gratitude to our volunteers. At the UCSF epilepsy center, patients preparing for surgery typically have electrodes surgically placed over the surfaces of their brains for several days so we can map the regions involved when they have seizures. During those few days of wired-up downtime, many patients volunteer for neurological research experiments that make use of the electrode recordings from their brains. My group asked patients to let us study their patterns of neural activity while they spoke words.\n</p><p>\n\tThe hardware involved is called \n\t<a href=\"https://en.wikipedia.org/wiki/Electrocorticography\" target=\"_blank\">electrocorticography</a> (ECoG). The electrodes in an ECoG system don’t penetrate the brain but lie on the surface of it. Our arrays can contain several hundred electrode sensors, each of which records from thousands of neurons. So far, we’ve used an array with 256 channels. Our goal in those early studies was to discover the patterns of cortical activity when people speak simple syllables. We asked volunteers to say specific sounds and words while we recorded their neural patterns and tracked the movements of their tongues and mouths. Sometimes we did so by having them wear colored face paint and using a computer-vision system to extract the kinematic gestures; other times we used an ultrasound machine positioned under the patients’ jaws to image their moving tongues.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A diagram shows a man in a wheelchair facing a screen that displays two lines of dialogue: \\u201cHow are you today?\\u201d and \\u201cI am very good.\\u201d Wires connect a piece of hardware on top of the man\\u2019s head to a computer system, and also connect the computer system to the display screen. A close-up of the man\\u2019s head shows a strip of electrodes on his brain.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d278d132f84073773405b4318e67f3ed\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3689a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-diagram-shows-a-man-in-a-wheelchair-facing-a-screen-that-displays-two-lines-of-dialogue-u201chow-are-you-today-u201d-and-u.png?id=32001118&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The system starts with a flexible electrode array that’s draped over the patient’s brain to pick up signals from the motor cortex. The array specifically captures movement commands intended for the patient’s vocal tract. A port affixed to the skull guides the wires that go to the computer system, which decodes the brain signals and translates them into the words that the patient wants to say. His answers then appear on the display screen.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chris Philpot</small></p><p>\n\tWe used these systems to match neural patterns to movements of the vocal tract. At first we had a lot of questions about the neural code. One possibility was that neural activity encoded directions for particular muscles, and the brain essentially turned these muscles on and off as if pressing keys on a keyboard. Another idea was that the code determined the velocity of the muscle contractions. Yet another was that neural activity corresponded with coordinated patterns of muscle contractions used to produce a certain sound. (For example, to make the “aaah” sound, both the tongue and the jaw need to drop.) What we discovered was that there is a map of representations that controls different parts of the vocal tract, and that together the different brain areas combine in a coordinated manner to give rise to fluent speech.\n</p><h2>The role of AI in today’s neurotech</h2><p>\n\tOur work depends on the advances in artificial intelligence over the past decade. We can feed the data we collected about both neural activity and the kinematics of speech into a neural network, then let the machine-learning algorithm find patterns in the associations between the two data sets. It was possible to make connections between neural activity and produced speech, and to use this model to produce computer-generated speech or text. But this technique couldn’t train an algorithm for paralyzed people because we’d lack half of the data: We’d have the neural patterns, but nothing about the corresponding muscle movements.\n</p><p>\n\tThe smarter way to use machine learning, we realized, was to break the problem into two steps. First, the decoder translates signals from the brain into intended movements of muscles in the vocal tract, then it translates those intended movements into synthesized speech or text.\n</p><p>\n\tWe call this a biomimetic approach because it copies biology; in the human body, neural activity is directly responsible for the vocal tract’s movements and is only indirectly responsible for the sounds produced. A big advantage of this approach comes in the training of the decoder for that second step of translating muscle movements into sounds. Because those relationships between vocal tract movements and sound are fairly universal, we were able to train the decoder on large data sets derived from people who weren’t paralyzed.\n</p><h2>A clinical trial to test our speech neuroprosthetic</h2><p>\n\tThe next big challenge was to bring the technology to the people who could really benefit from it.\n</p><p>\n\tThe National Institutes of Health (NIH) is funding \n\t<a href=\"https://reporter.nih.gov/search/kfhqyDGlEk-BF89Lei3E3w/project-details/10113331\" target=\"_blank\">our pilot trial</a>, which began in 2021. We already have two paralyzed volunteers with implanted ECoG arrays, and we hope to enroll more in the coming years. The primary goal is to improve their communication, and we’re measuring performance in terms of words per minute. An average adult typing on a full keyboard can type 40 words per minute, with the fastest typists reaching speeds of more than 80 words per minute.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A man in surgical scrubs and wearing a magnifying lens on his glasses looks at a screen showing images of a brain.\\u00a0\" class=\"rm-shortcode\" data-rm-shortcode-id=\"84af6259f58fc96ea52ef1660e994a3c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"37775\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-man-in-surgical-scrubs-and-wearing-a-magnifying-lens-on-his-glasses-looks-at-a-screen-showing-images-of-a-brain-u00a0.png?id=32001077&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Edward Chang was inspired to develop a brain-to-speech system by the patients he encountered in his neurosurgery practice. </small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Barbara Ries</small></p><p>\n\tWe think that tapping into the speech system can provide even better results. Human speech is much faster than typing: An English speaker can easily say 150 words in a minute. We’d like to enable paralyzed people to communicate at a rate of 100 words per minute. We have a lot of work to do to reach that goal, but we think our approach makes it a feasible target.\n</p><p>\n\tThe implant procedure is routine. First the surgeon removes a small portion of the skull; next, the flexible ECoG array is gently placed across the surface of the cortex. Then a small port is fixed to the skull bone and exits through a separate opening in the scalp. We currently need that port, which attaches to external wires to transmit data from the electrodes, but we hope to make the system wireless in the future.\n</p><p>\n\tWe’ve considered using penetrating microelectrodes, because they can record from smaller neural populations and may therefore provide more detail about neural activity. But the current hardware isn’t as robust and safe as ECoG for clinical applications, especially over many years.\n</p><p>\n\tAnother consideration is that penetrating electrodes typically require daily recalibration to turn the neural signals into clear commands, and research on neural devices has shown that speed of setup and performance reliability are key to getting people to use the technology. That’s why we’ve prioritized stability in \n\t<a href=\"https://www.nature.com/articles/s41587-020-0662-5\" rel=\"noopener noreferrer\" target=\"_blank\">creating a “plug and play” system</a> for long-term use. We conducted a study looking at the variability of a volunteer’s neural signals over time and found that the decoder performed better if it used data patterns across multiple sessions and multiple days. In machine-learning terms, we say that the decoder’s “weights” carried over, creating consolidated neural signals.\n</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"d4c17701550c87cb08654854e1344975\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/AfX-fH3A6Bs?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">University of California, San Francisco</small></p><p>\n\tBecause our paralyzed volunteers can’t speak while we watch their brain patterns, we asked our first volunteer to try two different approaches. He started with a list of 50 words that are handy for daily life, such as “hungry,” “thirsty,” “please,” “help,” and “computer.” During 48 sessions over several months, we sometimes asked him to just imagine saying each of the words on the list, and sometimes asked him to overtly \n\t<em>try</em> to say them. We found that attempts to speak generated clearer brain signals and were sufficient to train the decoding algorithm. Then the volunteer could use those words from the list to generate sentences of his own choosing, such as “No I am not thirsty.”\n</p><p>\n\tWe’re now pushing to expand to a broader vocabulary. To make that work, we need to continue to improve the current algorithms and interfaces, but I am confident those improvements will happen in the coming months and years. Now that the proof of principle has been established, the goal is optimization. We can focus on making our system faster, more accurate, and—most important— safer and more reliable. Things should move quickly now.\n</p><p>\n\tProbably the biggest breakthroughs will come if we can get a better understanding of the brain systems we’re trying to decode, and how paralysis alters their activity. We’ve come to realize that the neural patterns of a paralyzed person who can’t send commands to the muscles of their vocal tract are very different from those of an epilepsy patient who can. We’re attempting an ambitious feat of BMI engineering while there is still lots to learn about the underlying neuroscience. We believe it will all come together to give our patients their voices back. <span class=\"ieee-end-mark\"></span>\n</p>",
  "pubDate": "Sat, 29 Oct 2022 15:00:03 +0000",
  "guid": "https://spectrum.ieee.org/brain-computer-interface-speech",
  "category": [
    "Neuroprosthetics",
    "Brain-machine interface",
    "Neurotechnology",
    "Brain implants",
    "Speech"
  ],
  "dc:creator": "Edward Chang",
  "media:content": ""
}