{
  "id": "yt:video:DvkUo05xtFM",
  "yt:videoId": "DvkUo05xtFM",
  "yt:channelId": "UCimiUgDLbi6P17BdaCZpVbg",
  "title": "8 Million Species of Aliens",
  "link": "",
  "author": {
    "name": "exurb1a",
    "uri": "https://www.youtube.com/channel/UCimiUgDLbi6P17BdaCZpVbg"
  },
  "published": "2021-10-28T20:40:57+00:00",
  "updated": "2022-05-17T15:53:04+00:00",
  "media:group": {
    "media:title": "8 Million Species of Aliens",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I think therefore I bork.\n*the adverb mention is just straight up wrong. \"F-ing unhinged\" is still an adjective. Excuse my silliness. (More things to waste your time with below.)\n\nThe grammatical variations of a certain f-word were of course yoinked from George Carlin's bit which did it better: (Seems to be George Carlin originally anyway.) https://youtu.be/xZkb4TPI-Lo\n\nThe mention about toile and toilet was put extremely badly. \"Toilette\" was the diminutive, not the other way around as poor wording implied.\n\nThere's some controversy surrounding how efficient a bee's waggle dance actually is. I'm no apiologist (no seriously, that's a specialist of bee science), but the problem doesn't seem to bee (heh) with the waggle dance. Rather, the dispute is over how much of a difference it makes to bees watching the dance itself. For 1000x more depth than this video went into: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3153927/\n\nOne of the opening slides shows the greatest copypasta known to humankind: https://knowyourmeme.com/memes/navy-seal-copypasta\n\nThe \"If this little lion could speak...\" line is lifted almost directly from Wittgenstein. The original line is \"If a lion could speak, we could not understand him.\" As in: even *with* complex language, alien minds might still be incomprehensible. \n\nQuite a lot of the silliness with English was taken from John McWhorter's brilliant Our Magnificent Bastard Tongue: The Untold History of English. It's a great read: https://www.goodreads.com/en/book/show/3143472-our-magnificent-bastard-tongue\n\nThis one was largely inspired by a friend trying to convince me that animals don't just have a 'smaller' form of human intelligence,  they've gone off in other evolutionary directions and we should probably count those different types of smarts as valid too. So, thank you to HF for that.\n\nThe thumbnail is an axolotl, and just in case you haven't come across them yet they're quite fantastic: https://en.wikipedia.org/wiki/Axolotl\n\nThe Cephalotes Varians ant photo has been used with a commercial license courtesy of smugmug.com \n\nBonus fun: I spent about a month trying to come up with the title for this one. \"The Tower of Babble\" seemed like a fun comedy twist on the biblical story. I looked it up. No one seemed to have used it already. Well, I felt terribly proud of that and walked with a spring in my step for several weeks. Just before uploading today I thought I'd check again. I hadn't noticed Google was kindly correcting the typo for me. Of course The Tower of Babble is already a thing; books, films, podcasts. Almost threw myself out the window.\n\nBooks what I wrote ► https://tinyurl.com/ycnl5bo3 \nT-shirts, mugs, and sadness ► https://teespring.com/stores/exurb1a \nI also make horrendous music ► https://soundcloud.com/exurbia-1 \nFor sending personalised insults ► https://www.facebook.com/exurb1a/ \nHelp me to do this full-time if you're deranged enough ► https://www.patreon.com/exurb1r?ty=h",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}