{
  "title": "How job loss and economic stress affect workers and their families, with Anna Gassman-Pines, PhD",
  "itunes:title": "How job loss and economic stress affect workers and their families, with Anna Gassman-Pines, PhD",
  "pubDate": "Wed, 31 Aug 2022 10:30:00 +0000",
  "guid": "c45b6e4b-f3f5-4213-a060-87e8600d7abc",
  "link": "http://sopapa.libsyn.com/how-job-loss-and-economic-stress-affect-workers-and-their-families-with-anna-gassman-pines-phd",
  "itunes:image": "",
  "description": "<p>For many Americans, the past two-and-a-half years have been a time of economic turmoil. Anna Gassman-Pines, PhD, of Duke University, talks about how job loss, unstable work schedules and other hardships affect workers, their families and even entire communities, and about how working families – particularly low-wage workers – fared through the pandemic.<br /> <br /> <strong>Links</strong><br /> <br /> <a href=\"https://sanford.duke.edu/profile/anna-gassman-pines/\">Anna Gassman-Pines, PhD</a><br /> <a href=\"https://www.speakingofpsychology.org\">Speaking of Psychology Homepage</a></p>",
  "content:encoded": "<p>For many Americans, the past two-and-a-half years have been a time of economic turmoil. Anna Gassman-Pines, PhD, of Duke University, talks about how job loss, unstable work schedules and other hardships affect workers, their families and even entire communities, and about how working families – particularly low-wage workers – fared through the pandemic.  Links  <a href=\"https://sanford.duke.edu/profile/anna-gassman-pines/\">Anna Gassman-Pines, PhD</a> <a href=\"https://www.speakingofpsychology.org\">Speaking of Psychology Homepage</a></p>",
  "enclosure": "",
  "itunes:duration": "30:04",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For many Americans, the past two-and-a-half years have been a time of economic turmoil. Anna Gassman-Pines, PhD, of Duke University, talks about how job loss, unstable work schedules and other hardships affect workers, their families and even entire...",
  "itunes:episode": 204,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}