{
  "title": "Flexible committed use discounts — a simple new way to discount Compute Engine instances",
  "link": "https://cloud.google.com/blog/products/compute/save-money-with-the-new-compute-engine-flexible-cuds/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Saving money never goes out of style. Today, many of our customers use Compute Engine resource-based <a href=\"https://cloud.google.com/compute/docs/instances/signing-up-committed-use-discounts#memory-optimized_commitments\">committed use discounts (CUDs)</a> to help them save on steady-state compute usage within a specific machine family and region. As part of our commitment to offer more flexible and easy ways for you to manage your spend, we now offer a new type of committed use discount for Compute Engine: flexible CUDs.</p><p>Flexible CUDs are spend-based commitments that offer predictable and simple flat-rate discounts (28% off 1-year, and 46% off 3-years) that apply across multiple VM families and regions. Similar to <a href=\"https://cloud.google.com/compute/docs/instances/signing-up-committed-use-discounts#memory-optimized_commitments\">resource-based CUDs</a>, you can apply flexible CUDs across projects within the same billing account, and to VMs of different sizes and tenancy, to support changing workload requirements while keeping costs down. </p><p>Today, Compute Engine flexible CUDs are available for most general-purpose (N1, N2, E2, N2D) and compute-optimized (C2, C2D) VM usage, including instance CPU and memory usage across all regions (refer to <a href=\"https://cloud.google.com/skus/sku-groups/compute-engine-flexible-cud-eligible-skus\">the complete list</a> with more VM families to come). </p><p>Similar to resource-based CUDs, flexible CUDs are discounts over usage, not capacity reservations. To ensure capacity availability, make a separate <a href=\"https://cloud.google.com/compute/docs/instances/reserving-zonal-resources\">reservation</a>, and CUDs will apply automatically to any eligible usage as a result.</p><p>You can <a href=\"https://cloud.google.com/docs/cuds-spend-based#purchasing\">purchase</a> CUDs from any billing account, and the discount can apply to any eligible usage in projects paid for by that billing account. When you purchase a flexible CUD, you pay the same commitment fee for the entirety of the commitment term, even if your usage falls below this commitment value. The commitment fee is billed monthly. Once a commitment is purchased, it cannot be canceled.</p><p>For the best combination of savings and flexibility, you can combine resource-based CUDs and flexible CUDs together. You can have standard resource-based CUDs to cover your most stable resource usage and flexible spend based CUDs to cover your more dynamic resource usage. Every hour, standard CUDs apply first to any eligible usage followed by flexible CUDs, optimizing the use of your CUDs. Finally, any usage overage or usage that’s not eligible for either type of CUDs, will be charged based on your on-demand rates. </p><p>Here is a quick summary of the differences between resource based CUDs and flexible CUDs</p></div></div><div class=\"block-image_full_width\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid\"><figure class=\"article-image--large h-c-grid__col h-c-grid__col--6 h-c-grid__col--offset-3 \"><img alt=\"1 cud.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/1_cud.max-1000x1000.jpg\"/></figure></div></div></div><div class=\"block-paragraph_with_image\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid uni-paragraph-wrap\"><div class=\"uni-paragraph h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3\"><figure class=\"article-image--wrap-small \"><img alt=\"medianet.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/medianet.0997024407070405.max-1000x1000.jpg\"/></figure><div class=\"rich-text\"><h3>What customers are saying about flexible CUDs</h3><p><i>“Media.net is a global company with dynamic resource requirements. With flexible CUDs, Media.net is able to quickly and easily save money on baseline workload requirements, while giving it the flexibility to use different machine types and regions. Media.net chose Spot VMs after exploring various options to support spiky workloads, as they provided Media.net with both deep discounts and simple, predictable pricing. Flexible CUDs and Spot VMs were the perfect combination to optimize costs for the dynamic capacity needs of the business.” <b>— Amit Bhawani, Sr VP of Engineering, Media.net</b></i></p></div></div></div></div></div><div class=\"block-paragraph_with_image\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid uni-paragraph-wrap\"><div class=\"uni-paragraph h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3\"><figure class=\"article-image--wrap-small \"><img alt=\"lucidworks.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/lucidworks.0993024407480489.max-1000x1000.jpg\"/></figure><div class=\"rich-text\"><p><i>“As Lucidworks expands our product offerings, Google Cloud's Flexible CUDs have been the perfect solution to optimize cost while giving us the flexibility to shift workloads to different regions based on customer demographics and different instance families based on performance characteristics.\" — <b>Matt Roca, Director of Cloud Governance and Security, Lucidworks</b></i></p></div></div></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3>Understanding flexible CUDs </h3><p>You can <a href=\"https://cloud.google.com/docs/cuds-spend-based#purchasing\">purchase</a> a flexible CUD in the Google Cloud console or via the API. A flexible CUD goes into effect one hour after purchase, and the discounts will automatically be applied to any eligible usage. </p><p>Your flexible CUD is applied to eligible on-demand spend by the hour. If during a given hour, you spend less than what you committed to, you will not fully utilize your commitment or realize your full discount.</p><p>For example: If you want to cover $100 worth of on-demand spend every hour by a flexible CUD, you will pay $54/hour (46% off) for 3 years (payable monthly), and receive a $100 credit that applies automatically to any eligible on-demand spend. The $100 credit burns down at the eligible on-demand rate for every eligible SKU, and expires if unused.</p></div></div><div class=\"block-image_full_width\"><div class=\"article-module h-c-page\"><div class=\"h-c-grid\"><figure class=\"article-image--large h-c-grid__col h-c-grid__col--6 h-c-grid__col--offset-3 \"><img alt=\"2 cud.jpg\" src=\"https://storage.googleapis.com/gweb-cloudblog-publish/images/2_cud.max-1000x1000.jpg\"/></figure></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p><b>Attributing flexible CUDs credits</b><b><br/></b>If you are running multiple projects within the same billing account, the credits from flexible CUDs are attributed proportionally across projects within the billing account and across SKUs within the same project according to their usage proportion.</p><p><b>Planning for flexible CUDs purchases</b><b><br/></b>A good way to think about how to purchase and use resource based CUDs with flexible CUDs is to first forecast and purchase resource based CUDs based on your steady state resource spend, to get the deepest discounts. A best practice is to use flexible CUDs for more variable and growing workloads, and to use on-demand VMs, or <a href=\"https://cloud.google.com/blog/products/compute/google-cloud-spot-vm-use-cases-and-best-practices\">Spot VMs</a>, for the rest of your usage. </p><h3>Get started with flexible CUDs today</h3><p>Building a business in the cloud can be complicated; paying for it should be easy. We designed flexible CUDs to make it easy for organizations to enjoy significant discounts across a wide variety of Google Cloud resources in a way that’s simple and predictable. For more details on how to <a href=\"https://cloud.google.com/docs/cuds-spend-based#purchasing\">purchase</a> and use flexible CUDs and to get started, refer to <a href=\"https://cloud.google.com/compute/docs/instances/committed-use-discounts-overview\">this documentation</a>.</p></div></div></body></html>",
  "pubDate": "Fri, 04 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/products/compute/save-money-with-the-new-compute-engine-flexible-cuds/",
  "category": [
    "Cloud Operations",
    "Infrastructure",
    "Google Cloud",
    "Compute"
  ],
  "og": {
    "type": "article",
    "title": "Flexible committed use discounts — a simple new way to discount Compute Engine instances",
    "description": "You can use new flexible committed use discounts (CUDs) across multiple VM families and regions and get 28% off one year and 46% off 3 years.",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/products/compute/save-money-with-the-new-compute-engine-flexible-cuds/"
  },
  "author": {
    "name": "Yasmin Mowafy",
    "title": "Product Manager",
    "department": "",
    "company": ""
  }
}