{
  "title": "Egg-Crate Nanostructured PV Crosses Solar Threshold",
  "link": "https://spectrum.ieee.org/perovskite",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/different-colored-layers-and-textures.jpg?id=32046017&width=1245&height=700&coordinates=0%2C103%2C0%2C104\"/><br/><br/><p>By adding periodic nanostructures that look like egg-crate foam to <a href=\"https://spectrum.ieee.org/power-from-commercial-perovskite-solar-cells-is-coming-soon\" target=\"_self\">tandem solar cells</a> made of silicon and perovskites, researchers at the Helmholtz-Zentrum Berlin in Germany have achieved a certified efficiency of 29.8 percent. </p><p>This was the world record for tandem solar-cell efficiency until July of this year, when researchers at the Swiss Federal Institute of Technology Lausanne (EPFL) surpassed it slightly, setting a new record of 31 percent. The German team, however, has presented details of how they achieved their milestone efficiency—and insights about how to further the <a href=\"https://spectrum.ieee.org/power-from-commercial-perovskite-solar-cells-is-coming-soon\" target=\"_blank\">promise of perovskite solar tech</a>—in a recent paper in <em><a href=\"https://www.nature.com/articles/s41565-022-01228-8\" rel=\"noopener noreferrer\" target=\"_blank\">Nature Nanotechnology</a></em>. </p><p>Silicon solar cells have a theoretical efficiency limit of around 29 percent, with the best cells today reaching efficiencies of just under 27 percent. Solar cells made of III-V semiconductors can achieve efficiencies higher than 30 percent, but those materials are expensive and difficult to process. </p><p><a href=\"https://spectrum.ieee.org/perovskites-for-tandem-solar-cells-\" target=\"_self\">Tandem cells</a>, in which silicon is coated with easy-to-make <a href=\"https://spectrum.ieee.org/stable-perovskite-cell-boosts-solar-power\" target=\"_self\">photovoltaic perovskites</a>, offer a way to achieve efficiencies over 40 percent, in theory at least, at low cost and without needing drastically different manufacturing facilities. </p><p>Teams working on such tandem devices have so far tried to eke out every little efficiency gain by tweaking the chemical composition of the perovskites, making nicer more uniform layers, and improving the contact between the two material layers, among other tricks.</p><p>The German team, and the Swiss team after them, boosted efficiency by creating a texture on the silicon surface. Texturing solar cells reduces reflection losses, which increases the current that the device generates, says Philipp Tockhorn, a researcher at Helmholtz-Zentrum and first author of the new paper. “Textures are essential to tap the full optical potential of perovskite–silicon tandem solar cell and to reduce optical losses to a minimum.”</p><p>The standard way to texture silicon-only cells is to create random pyramidal structures that are several micrometers in size. But that doesn’t work for tandem cells because the height of standard pyramidal textures surpasses the thickness of the perovskite layer, Tockhorn says. To overcome that, researchers have tried to either alter the perovskite deposition method while keeping the pyramid texture the same, or tried tweaking the pyramidal textures to more easily deposit perovskite solution on them. “There is a challenge to fully cover the texture without pinholes, which would deteriorate the performance,” he says.</p><p>The Swiss EPFL team’s solution was to use a <a href=\"https://actu.epfl.ch/news/new-world-records-perovskite-on-silicon-tandem-sol/\" rel=\"noopener noreferrer\" target=\"_blank\">hybrid vapor/solution</a> processing technique that is compatible with <a href=\"https://www.pv-magazine.com/2022/04/29/epfl-achieves-29-2-efficiency-for-tandem-solar-cell-with-fully-textured-silicon/\" rel=\"noopener noreferrer\" target=\"_blank\">pyramidal textured</a> silicon surfaces. They made a 1-square-centimeter<sup> </sup>solar cell with a power conversion efficiency of 31.25 percent.</p><p>But Tockhorn and his colleagues decided to investigate shallower nanotextures. Based on previous experimental work and backed up by optical simulations, the team decided on a sinusoidal design with a hexagonal arrangement. These nanotextures can be easily coated with perovskite without compromising the quality of the perovskite, he says.</p><p>Not only did the nanotexturing improve efficiency, it also increased the yield of high-quality tandem solar cells. That’s because the textured surface retained the perovskite solution better than a flat silicon surface, resulting in a better-quality perovskite film. Out of 45 nanotextured tandem solar cells, only two had visible holes after perovskite coating, making for about 95 percent yield. The planar devices had a 50 percent yield: 15 out of 30 devices showed macroscopic holes.</p><p>The German group used ultraviolet nanoimprint lithography and etching to make the nanostructured silicon surface. The final perovskite–silicon cell was 1 cm<sup>2</sup> in size. The nanoimprint techniques they used are relatively easy to scale up to large area, Tockhorn says. “Many researchers from academia regard nanoimprint lithography as a very promising tool for solar cells due to its sheer simplicity and versality in terms of structure type.”</p><p>Now that they have a proof-of-concept demonstration for making solution-based perovskite layers on textured silicon wafers, he says they are working on improving the devices to boost efficiency even further. “We need to aim for a fully textured perovskite top cell, that is textured at the front and at the interface between perovskite and silicon.” </p>",
  "pubDate": "Fri, 04 Nov 2022 16:06:49 +0000",
  "guid": "https://spectrum.ieee.org/perovskite",
  "category": [
    "Perovskite",
    "Perovskite-silicon tandems",
    "Nanostructured silicon",
    "Tandem solar cell",
    "Solar power",
    "Photovoltaics"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}