{
  "id": "https://bibleinoneyear.org/en/youth/325",
  "title": "Day 325: How to Pray with Power",
  "description": "Psalm 130:1–5, Ezekiel 40:4, James 5:13–18. Watchman Nee wrote, ‘Our prayers lay the track down which God’s power can come  Like a mighty locomotive, his power is irresistible, but it cannot reach us without rails",
  "pubDate": "Sun, 21 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/325/?ignore",
  "itunes:duration": "13:05",
  "guid": "enyouth21112021-325",
  "length": 785.76,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 325: How to Pray with Power",
  "itunes:subtitle": "Psalm 130:1–5, Ezekiel 40:4, James 5:13–18. Watchman Nee wrote, ‘Our prayers lay the track down which God’s power can come  Like a mighty locomotive, his power is irresistible, but it cannot reach us without rails",
  "itunes:summary": "I received a call from someone in our church. He wanted me to go and pray for his wife who had suddenly been admitted to hospital for an operation.\nAs it happened, I myself had an appointment nearby to have an injection in my shoulder. I’d had a ‘frozen shoulder’ for almost two years. However, in the previous couple of days, it had suddenly got better. I explained what had happened to the consultant. He looked at me and said, ‘It’s a miracle!’ I said, ‘Don’t frozen shoulders suddenly get better?’ Over and over again, he repeated, ‘No, it is a miracle.’ Here was a secular doctor trying to persuade a rather faithless pastor that what had happened could only be explained by the supernatural power of God!\nI thanked him very much for raising my faith, as I was about to go and pray in the hospital. As I walked through the corridors, I passed a hospital porter who was singing (quite loudly!), ‘Lay your hands on the sick and they will be healed.’ I said, ‘That is exactly what I am about to go and do.’ He looked deeply shocked and surprised. He obviously didn’t think I looked like the sort of person who could possibly believe that!\nI went upstairs to pray for the woman and explained why my faith was riding high. She then said she had been reading James 5 (our passage for today), which says, ‘Is any one of you sick? Call the elders of the church to pray over you… And the prayer offered in faith will make you well’ (James 5:14–15). By now the Lord had given (even me!) enough signs to pray in faith. The Holy Spirit came upon her with great power. She was not immediately healed (although she is better now), but it gave me a greater understanding of ‘the prayer of faith’.\nWatchman Nee wrote, ‘Our prayers lay the track down which God’s power can come. Like a mighty locomotive, his power is irresistible, but it cannot reach us without rails.’\nHow then can you pray with power?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 325
}