{
  "title": "561: Why Did the Qilin Bow to Dumbledore? Listeners React to 'Fantastic Beasts 3'",
  "link": "https://audioboom.com/posts/8076385",
  "itunes:episode": 561,
  "itunes:title": "Why Did the Qilin Bow to Dumbledore? Listeners React to 'Fantastic Beasts 3'",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4525,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we bust open our Muggle Mailbag to answer your burning questions and take your feedback on <em>Fantastic Beasts: The Secrets of Dumbledore</em>!<br>\n<br>\n\n</div>\n<ul>\n<li>Twitter Polls Galore! <a href=\"https://twitter.com/MuggleCast/status/1519108430748807168\">Which host would the Qilin bow to</a>? <a href=\"https://twitter.com/MuggleCast/status/1519108432938225664\">What was the best Secrets of Dumbledore ship</a>? <a href=\"https://twitter.com/MuggleCast/status/1517317994807894021\">And overall, what did listeners think of the movie</a>?</li>\n<li>What did Yusuf Kama have to help fight Grindelwald?</li>\n<li>The hosts celebrate Eulalie Hicks after leaving her hanging in our initial review!</li>\n<li>Why did Grindelwald's followers not kill Theseus when they captured him?</li>\n<li>Why did Theseus not question Queenie after her return to the good side?</li>\n<li>Did Dumbledore and Grindelwald's fight scene fail to deliver?</li>\n<li>Why did the Qilin bow to Dumbledore? Why not Newt? Or Jacob?</li>\n<li>Did the producers tie up loose ends enough so that this could be the last film?</li>\n<li>Where are Graves and Nagini?</li>\n<li>How did Jacob and Queenie get permission to marry?</li>\n<li>Prediction Time: Which host was closest to the box office number and what does this number mean for the future of the franchise?</li>\n<li>On next week's episode: What questions should’ve <em>Secrets of Dumbledore</em> answered, and what questions must <em>Fantastic Beasts 4</em> answer?</li>\n<li>Quizzitch: What book hits Lucius Malloy in the eye during his tussle with Arthur Weasley in Flourish and Blotts?</li>\n<li>Later this week on Bonus MuggleCast: Why has J.K. Rowling been completely silent about Fantastic Beasts 3? You can get Bonus MuggleCast and other great benefits by becoming a patron at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a>!</li>\n<li>This week's episode is brought to you by Framebridge (visit <a href=\"http://www.framebridge.com\">Framebridge.com</a> and use promo code MUGGLE to save an additional 15% off your first order) and BetterHelp (MuggleCast listeners get 10% off their first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/MuggleCast</a>).</li>\n</ul>\n",
  "pubDate": "Tue, 03 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-02:/posts/8076385",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}