{
  "title": "Fear will destroy you or drive you | Tony, world-champion triathlete Siri Lindley, and Free Solo’s Sanni McCandless on how fear can fuel your fire",
  "pubDate": "Mon, 12 Aug 2019 23:46:29 +0000",
  "guid": "68cae03532a1477eb235db1a10defd80",
  "link": "https://tonyrobbins.libsyn.com/fear-will-destroy-you-or-drive-you-tony-world-champion-triathlete-siri-lindley-and-free-solos-sanni-mccandless-on-how-fear-can-fuel-your-fire",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">We all experience fear.</span> <span style=\"font-weight: 400;\">Fear of failure, fear of rejection, fear that we’re just not enough – fear is a common current that runs through all of our lives.</span> <span style= \"font-weight: 400;\">For so many of us, fear rules everything and</span> <span style=\"font-weight: 400;\">prevents us from reaching our true potential.</span> <span style= \"font-weight: 400;\">In this episode, we’re diving into fear – how it shows up, how we handle it in different ways, and how we can use it to serve a valuable purpose and achieve the lives we truly desire.</span></p> <p><span style=\"font-weight: 400;\">You’ll hear from Tony, as she shares his strategies on how he’s conditioned his own mind to overcome fear and become a successful entrepreneur that impacts the lives of millions. You’ll also hear from Siri Lindley, a world-champion triathlete and coach – who shares how she  overcame her fear and OCD, and went on to become the best triathlete in the world while finding love and respect for herself along the way. </span></p> <p><span style=\"font-weight: 400;\">And, if you’ve seen the Oscar-winning documentary, ‘Free Solo,’ you might remember Sanni McCandless, whose boyfriend, Alex Honnold climbed El Capitan – the 3,000 foot granite face looming over Yosemite Valley, without any ropes or safety harnesses. Sanni is a skilled life coach, and here she explains how she helps her coaching clients work through their everyday fears. Listen as she shares how she felt on the day of Alex’s free solo climb, and she overcame her own fear of losing him on that fateful day.</span></p>",
  "content:encoded": "<p>We all experience fear. Fear of failure, fear of rejection, fear that we’re just not enough – fear is a common current that runs through all of our lives. For so many of us, fear rules everything and prevents us from reaching our true potential. In this episode, we’re diving into fear – how it shows up, how we handle it in different ways, and how we can use it to serve a valuable purpose and achieve the lives we truly desire.</p> <p>You’ll hear from Tony, as she shares his strategies on how he’s conditioned his own mind to overcome fear and become a successful entrepreneur that impacts the lives of millions. You’ll also hear from Siri Lindley, a world-champion triathlete and coach – who shares how she  overcame her fear and OCD, and went on to become the best triathlete in the world while finding love and respect for herself along the way. </p> <p>And, if you’ve seen the Oscar-winning documentary, ‘Free Solo,’ you might remember Sanni McCandless, whose boyfriend, Alex Honnold climbed El Capitan – the 3,000 foot granite face looming over Yosemite Valley, without any ropes or safety harnesses. Sanni is a skilled life coach, and here she explains how she helps her coaching clients work through their everyday fears. Listen as she shares how she felt on the day of Alex’s free solo climb, and she overcame her own fear of losing him on that fateful day.</p>",
  "enclosure": "",
  "itunes:duration": "38:50",
  "itunes:explicit": false,
  "itunes:keywords": "rock,climbing,free,tony,solo,robbins,lindley,siri,triathlete,mccandless,sanni",
  "itunes:subtitle": "We all experience fear. Fear of failure, fear of rejection, fear that we’re just not enough – fear is a common current that runs through all of our lives. For so many of us, fear rules everything and prevents us from reaching our true potential....",
  "itunes:episodeType": "full"
}