{
  "id": "yt:video:hVAbK9bWcxE",
  "yt:videoId": "hVAbK9bWcxE",
  "yt:channelId": "UCtXKDgv1AVoG88PLl8nGXmw",
  "title": "Peter Schiff | CEO & Chief global strategist of Euro Pacific Cap Inc | web3 talks | Sep 29th 2022",
  "link": "",
  "author": {
    "name": "Google TechTalks",
    "uri": "https://www.youtube.com/channel/UCtXKDgv1AVoG88PLl8nGXmw"
  },
  "published": "2022-10-25T21:04:45+00:00",
  "updated": "2022-10-29T03:46:09+00:00",
  "media:group": {
    "media:title": "Peter Schiff | CEO & Chief global strategist of Euro Pacific Cap Inc | web3 talks | Sep 29th 2022",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Hey frenz,\n\nHope you enjoyed our session with Raoul Pal, drum roll please...our next guest will be the king of econ Peter Schiff (http://goog_751751745/), CEO and chief global strategist of Euro Pacific Capital Inc. (https://en.wikipedia.org/wiki/Peter_Schiff)\n \nWe'll be diving deep into capital markets, gold, BTC, macros and how crypto might have a long term play in society or not? Peter has been a global economics icon for his bold market predictions in 2008 and firm stance on asset markets, crypto and capitalism. You've seen him on CNN, Yahoo Finance, NYTimes, Bloomberg, Fox, MSNBC, Schiff Radio (https://schiffradio.com/) and many more.\n \nLinkedin: https://tinyurl.com/392nupyj\nTwitter: https://tinyurl.com/3dpyh46x\n\nCareer snapshot\nPeter Schiff began his investment career as a financial consultant with Shearson Lehman Brothers, after having earned a degree in finance and accounting from U.C. Berkeley in 1987. A financial professional for over twenty years, he is the owner of Euro Pacific Asset Management, Chief Economist and Global Strategist for Euro Pacific Capital (a division of Alliance Global Partners), and Chairman of SchiffGold (a precious metals dealer based out of Manhattan). He is also the host of The Peter Schiff Show Podcast. An expert on money, economic theory, and international investing, Peter is a highly recommended broker by many leading financial newsletters and investment advisory services.  He holds FINRA Series 4, 7, 24, 27, 53, 55, 63 & 65 licenses.\n\nNotable achievements\nPeter achieved national notoriety in 2008 as being one of the few economists to have accurately forecast the financial crisis well in advance. Between 2004 and 2006 he had made numerous high-profile statements predicting the bursting of the real estate bubble, significant declines in national real estate prices, the collapse of the mortgage market and the banking sector, the bankruptcy and bailout of Fannie Mae and Freddie Mac. Peter has authored several best-selling books including Crash Proof, Crash Proof 2.0, How and Economy Grows and Why it Crashes, The Little Book of Bull Moves in Bear Markets, and The Real Crash. He also served as an economic advisor to the 2008 Ron Paul presidential campaign.\n\nHosted by,\nRaphael Hyde\nhttps://www.linkedin.com/in/raphael-hyde-4416494/\nGoogle web3 community lead | Google UX | web3 Angel\n\nMusic by Sunset Music Inc",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}