{
  "title": "51: The Dog",
  "link": "https://audioboom.com/posts/6943360",
  "itunes:episode": 51,
  "itunes:title": "The Dog",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3339,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The working title for this one was: “Three Gays Rob a Bank”. And we have an idea for the sitcom version.<br>\n<br>\n\n</div>\n<div>In August 1972, John Wojtowicz attempted to rob a Brooklyn bank to finance his lover's sex-reassignment surgery. The act resulted in a fourteen-hour hostage situation that was broadcast on TV. Three years later Al Pacino portrayed his crime in DOG DAY AFTERNOON.<br>\n<br>\n\n</div>\n<div>Directors Allison Berg and Frank Keraudren began filming THE DOG in 2002 and continued for ten years. Drawing upon extraordinary archival footage, the film shuffles between the 1970s and the 2000s. We gain a historic perspective on New York's gay liberation movement, in which Wojtowicz played an active role. In later footage, he remains a subversive force, backed by the unconditional love of his mother Terry, whose wit and charm infuse the film. How and why the bank robbery took place is recounted in gripping detail by Wojtowicz and various eyewitnesses.<br>\n<br>\n\n</div>\n<div>Looking for more TCO? <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Check out our bonus episodes on Patreon</a>! We covered \"Serial\" episode-by-episode and capped the series off with an interview with <strong>Rabia Chaudry</strong>--Adnan's friend who brought his story to Sarah Koenig AND with <strong>Asia Mcclain</strong>--Adnan's alibi witness! Now we're covering \"The Staircase\" episode-by-episode. Episodes 1 and 2 are live now! We also have extended outtakes for our episodes and two other full bonus episodes--ALL COMMERCIAL FREE! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join here!</a>\n</div>\n",
  "pubDate": "Tue, 24 Jul 2018 04:01:00 +0000",
  "guid": "tag:audioboom.com,2018-07-24:/posts/6943360",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}