{
  "title": "The Metaverse Needs Standards, Too",
  "link": "https://spectrum.ieee.org/metaverse-standards-forum",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-diverse-group-of-people-meeting-in-a-conference-room-in-the-metaverse.jpg?id=31247491&width=1200&height=600&coordinates=0%2C68%2C0%2C52\"/><br/><br/><p>When Meta (formerly Facebook) announced in October 2021 that <a href=\"https://about.fb.com/news/2021/10/facebook-company-is-now-meta/\" target=\"_blank\">it would be developing metaverse technologies</a>, it prompted a flurry of speculation and attendant announcements from other companies. Beyond that, it triggered an avalanche of confusion around <a href=\"https://spectrum.ieee.org/metaverse-second-life\" target=\"_self\">what exactly</a> <a href=\"https://spectrum.ieee.org/meta-offers-nothing-new-to-the-metaverse\" target=\"_self\">the metaverse</a> <a href=\"https://spectrum.ieee.org/silicon-valleys-metaverse-problem\" target=\"_self\">is supposed to be</a>.<br/></p><p>Nearly a year later, the concrete details of the metaverse are as opaque as ever. The <a href=\"https://metaverse-standards.org/\" target=\"_blank\">Metaverse Standards Forum</a>, which launched on 21 June 2022, isn’t trying to wrangle those details—not directly. But the forum sees an opportunity to get everyone to sit down at the same (probably virtual) table and hash out the basic technologies needed. With a more solid foundation, the forum believes, the metaverse can better develop and evolve.</p><p>Now, the forum has announced that after two months of hashing priorities, it has a list of initial priority topics that will steer metaverse standards development in its domain working groups. The topics include both straightforward technical problems like augmented and virtual reality standards, as well as concerns around privacy, ethics, and user safety.</p><p class=\"pull-quote\">“I like the theory that there’s only one metaverse, and you go between different experiences within the metaverse. Because we need an analogy to the Web.”<br/>—Neil Trevett, Metaverse Standards Forum</p><p>To be clear: The metaverse does not exist yet, and probably won’t for some years to come. But there’s enough industry interest in beginning the process toward building it—whatever it may ultimately be. So <a href=\"https://www.linkedin.com/in/neil-trevett-748791\" rel=\"noopener noreferrer\" target=\"_blank\">Neil Trevett</a>, the chair of the Metaverse Standards Forum, says now is the time to start standardizing. “I think what we’re seeing, much to everyone’s surprise—including our own—is the level of interest in standards for the metaverse. I think there is a thirst, or hunger, for them.”</p><p>The Metaverse Standards Forum is being organized by the <a href=\"https://www.khronos.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Khronos Group</a>, a software consortium developing royalty-free standards around technologies like virtual reality, augmented reality, and vision processing. The forum began with just 35 founding members, but its roster has in two months already ballooned to 1,500.</p><h3>Standardizing the Standards</h3><p>The MSF isn’t a standards body, Trevett says, so much as it’s a liaison to improve coordination and trust between the big commercial metaverse interests to date—including Google, Meta, Microsoft, and others using the technologies required for the creation, care, and maintenance of virtual worlds—as well as the standards organizations that will define those technologies. </p><p>“What we’re doing is casting a wide net, because some of the companies and organizations in the forum know each other, but there are lots of people that don’t know each other at all,” says Trevett. Trevett is also president of the Khronos Group.</p><p>Although there are numerous competing visions of what the metaverse will be, many such visions have common points of connection. <a href=\"https://spectrum.ieee.org/the-metaverse-could-help-us-better-understand-reality\" target=\"_self\">Virtual reality</a> (VR) and <a href=\"https://spectrum.ieee.org/metaverse-niantic-augmented-reality\" target=\"_self\">augmented reality</a> (AR) tech will probably be involved. As will the drive toward shared experiences—whether that’s something exciting like <a href=\"https://www.hollywoodreporter.com/business/digital/iheartmedia-iheartland-fortnite-1235204209/\" target=\"_blank\">attending a concert</a> or more mundane like renewing your drivers license.</p><p>“I like the theory that there’s only one metaverse and you go between different experiences within the metaverse, because we need an analogy to the Web,” says Trevett.</p><p>“It’s going to be an evolution of the Internet as we know it today,” says <a href=\"https://www.linkedin.com/in/david-morin\" target=\"_blank\">David Morin</a>, the executive director of the <a href=\"https://www.aswf.io/\" target=\"_blank\">Academy Software Foundation</a>, an organization working to standardize the visual-effects technologies pioneered by the movie industry. Morin says one way to envision that evolution is as a collection of situations to experience—a virtual Amazon storefront in which to browse products, rather than a flat Webpage—with the option to move between one situation and another. The idea isn’t entirely novel, he adds: \"Many of these thoughts and experiments already exist in some corner of an industry or another.”</p><p>“I think most people have in mind something like the web,” says <a href=\"https://fr.linkedin.com/in/dominiquehazaelmassieux/fr\" rel=\"noopener noreferrer\" target=\"_blank\">Dominque Hazael-Massieux</a>, part of the management team for the <a href=\"https://www.w3.org/\" rel=\"noopener noreferrer\" target=\"_blank\">World Wide Web Consortium</a> standards body. ”You go to one place and another, and it just works, and you can keep some of the data you have from one place to another.”</p><h3>Making the Virtual a Reality</h3><p>So how will the metaverse <a href=\"https://spectrum.ieee.org/is-the-metaverse-even-feasible\" target=\"_blank\">feasibly be realized</a>?<br/></p><p>Some see it as a future iteration of (or replacement for) the Internet. But if so, the technologies that make it happen will need to be  more tightly integrated than they are now. Beyond standardizing just AR and VR come related technologies like 3D modeling, volumetric video, and geospatial data.</p><p>According to <strong></strong>Trevett, the Metaverse Standards Forum’s first meetings—held via Zoom—yielded a Google spreadsheet that spelled out the forum’s priority topics, enabling members to garner support for their own preferences.</p><p> “We’re seeing a number of domains emerging,” says Trevett. “At the highest level, there’s spatial computing—which is all the 3D stuff and 3D assets—avatars and apparel, geospatial, [extended reality], and user interface.”<strong> </strong>Trevett points to additional interest in user identity, privacy, ethics, openness, and accessibility concerns.</p><p><a href=\"https://www.linkedin.com/in/nadinealameh\" target=\"_blank\">Nadine Alameh</a>, the CEO of the <a href=\"https://www.ogc.org/\" target=\"_blank\">Open Geospatial Consortium</a>, which is developing geospatial and location data standards, says part of the forum’s appeal is that, beyond the nuts and bolts of technical standards, there simply hasn’t been a centralized place to talk about the vision and implications of the technology. “Because some of these conversations that are happening are not about standards at all,” she says. “But people don’t have another forum to talk about the vision of the metaverse.”</p><p>In all, members proposed more than 200 potential topics to prioritize for metaverse development. That list <a href=\"https://metaverse-standards.org/news/blog/setting-course-for-an-open-metaverse-part-1-updates-from-the-first-60-days-of-the-metaverse-standards-forum/\" target=\"_blank\">has been narrowed down to eight areas of interest</a>, which will form the first domain working groups for the forum’s members to join. The list includes more technical challenges, such as interoperable 3D assets, user identity, augmented and virtual reality, and user interfaces. Broader challenges are also highlighted, including metaverse ethics, privacy and governance, and education and certification. </p><p>Trevett calls the forum’s approach “Darwinian.” It’s focusing for now on foundational matters like technical standards. Then, how it functions and is used will remain up to member companies like Amazon, Google, Meta, Microsoft, and others. </p><p>Many of the forum members that <em>IEEE Spectrum</em> spoke with felt strongly about the problem of metaverse openness. Open standards—as opposed to proprietary ones—make a shared foundation with increased interoperability more likely. By analogy, think of the Worldwide Web’s <a href=\"https://en.wikipedia.org/wiki/Hypertext_Transfer_Protocol\" target=\"_blank\">HTTP protocol</a>. Were it a closed or proprietary standard, multiple “webs” would likely have cropped up with varying user bases as well as technological standards. And whatever the proprietary “Web” would have ultimately become, it’d also likely have taken much longer to develop and blossom, if it ever would have blossomed at all.</p><p>As a second analogy, the wireless industry began working on 6G cellular standards in 2019. But 6G likely <a href=\"https://spectrum.ieee.org/6g-geopolitics\" target=\"_self\">won’t come to fruition until 2030</a>. Building the metaverse will be a multiyear effort, if not a generational one. “We’re just doing the building blocks,” says Alameh. “It’s really our kids who will actually build whatever that is. We’re just enabling, and I think that’s why you need to inject the ethics and the responsibility, because you’re building something new.”</p>",
  "pubDate": "Wed, 31 Aug 2022 20:07:02 +0000",
  "guid": "https://spectrum.ieee.org/metaverse-standards-forum",
  "category": [
    "Metaverse",
    "Standards",
    "Internet",
    "Virtual reality",
    "Augmented reality"
  ],
  "dc:creator": "Michael Koziol",
  "media:content": ""
}