{
  "title": "60: Resilience & WILD Habits with Tara Mackey",
  "pubDate": "Wed, 09 May 2018 18:33:05 +0000",
  "guid": "ac8bdc402a5620deb6554af5db3ac0b8",
  "link": "https://sites.libsyn.com/94610/60-resilience-wild-habits-with-tara-mackey",
  "itunes:image": "",
  "description": "<p class=\"p1\">In today’s episode, we are going to answer one of the most asked questions in our Kwik Podcast FB community:<br /> <br /> “I’m going through a lot of difficult times right now, things are a little bit crazy. How do I stay focused and resilient during these tough times?”<br /> <br /> When you think about resilience, you think about the capacity to cope with stress and adversity. But it’s not necessarily a trait people are born with. The good news is that it involves behavior, thoughts, habits, mindset, and actions that we can all learn and develop over time.<br /> <br /> To answer this important topic, I want to introduce you to Tara Mackey. She is a scientist, a #1 bestselling author of “Cured By Nature,” a health & wellness advocate, and an amazing human being.<br /> <br /> Her story is absolutely incredible. Listen in as she shares her techniques to unlock your mind and master your habits so you can be more resilient throughout your day.<br /> <br /> Be sure to check out her brand new book, “Wild Habits,” at <a href= \"http://www.wildhabitsbook.com\"><span class= \"s1\">www.wildhabitsbook.com</span></a> and you can find her @taraamackey on socials.<br /> <br /> *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "content:encoded": "<p class=\"p1\">In today’s episode, we are going to answer one of the most asked questions in our Kwik Podcast FB community:  “I’m going through a lot of difficult times right now, things are a little bit crazy. How do I stay focused and resilient during these tough times?”  When you think about resilience, you think about the capacity to cope with stress and adversity. But it’s not necessarily a trait people are born with. The good news is that it involves behavior, thoughts, habits, mindset, and actions that we can all learn and develop over time.  To answer this important topic, I want to introduce you to Tara Mackey. She is a scientist, a #1 bestselling author of “Cured By Nature,” a health & wellness advocate, and an amazing human being.  Her story is absolutely incredible. Listen in as she shares her techniques to unlock your mind and master your habits so you can be more resilient throughout your day.  Be sure to check out her brand new book, “Wild Habits,” at <a href= \"http://www.wildhabitsbook.com\">www.wildhabitsbook.com</a> and you can find her @taraamackey on socials.  *Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "19:47",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In today’s episode, we are going to answer one of the most asked questions in our Kwik Podcast FB community:  “I’m going through a lot of difficult times right now, things are a little bit crazy. How do I stay focused and resilient during these...",
  "itunes:episodeType": "full"
}