{
  "title": "Will China fall into the middle/high income trap?",
  "link": "https://audioboom.com/posts/7813524",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2445,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This episode is part of the ZhōngHuá Mundus series of The Sound of Economics.<br>\n<br>\n\n</div>\n<div>ZhōngHuá Mundus is a new newsletter by Bruegel, bringing you monthly analysis of China in the world, as seen from Europe. <a href=\"https://bruegel.secure.force.com/events/UpdateAcc?sf=1&s4=1\">Sign up now</a> to receive it in your mailbox!</div>\n<div><br>\n</div>\n<div>The middle-income trap describes a situation in which a country, having attained a certain income level, gets stuck there (due to given advantages). The high-income trap is of a similar nature, because although the positioning of these economies might be more advantageous to begin with, they find it difficult to promote innovation in manufacturing or upgrade to higher value-added services to remain competitive and provide benefits to a wider spectrum of society.<br>\n<br>\n\n</div>\n<div>In this episode of The Sound of Economics, <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> and <a href=\"https://www.bruegel.org/author/alicia-garcia-herrero/\">Alicia García-Herrero</a> are joined by <a href=\"https://www.bruegel.org/author/syaru-shirley-lin/\">Syaru Shirley Lin</a>, Compton Visiting Professor in World Politics at the Miller Center of Public Affairs at the University of Virginia. They discuss the middle/high-income trap in East Asia, and especially in China. Is the high-income trap different between East Asia and Western Europe, especially in terms of their economic relationship with China? How has COVID-19 changed the economic landscape?<br>\n<br>\n\n</div>\n",
  "itunes:summary": "The middle to high-income trap in East Asia and its China dilemma.",
  "pubDate": "Wed, 03 Mar 2021 09:15:00 +0000",
  "guid": "tag:audioboom.com,2021-03-02:/posts/7813524",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}