{
  "title": "2019 Retrospective",
  "description": "<h2 id=\"2019-retrospective\">2019 Retrospective</h2>\n\n<p>Well, <a href=\"http://korbonits.github.io/2019/01/01/New-Years-Resolutions-2019.html\">that was ambitious</a>!</p>\n\n<p>All in all, I did pretty well. My sailing skill increased dramatically and I continued to write albeit with less zeal. I read a lot of books, and traveled to one new country (Japan) and new parts of others (Montréal). I learned how to learn better than I had for a while.</p>\n\n<p>The MOST important update of 2019 is that I met the love of my life (first week of 2019!), we fell in love, and planned a trip for early 2020 to propose to each other. Wasn’t even on the list. Definitely the best surprise of the year (and of my life). Renders 2019 a success no matter how you look at it. Looking forward to writing about this in a subsequent blog post :).</p>\n\n<h3 id=\"grading-myself\">Grading myself</h3>\n\n<p>At a high level, for 2019 I had goals in the following categories:</p>\n<ul>\n  <li>Reading: success/failure</li>\n  <li>Writing: success/failure</li>\n  <li>Travel: success</li>\n  <li>Language: failure</li>\n  <li>Fitness: failure</li>\n  <li>Sailing: success/failure</li>\n  <li>Organization: success</li>\n  <li>Use less technology: success</li>\n</ul>\n\n<h4 id=\"reading-successfailure\">Reading: success/failure</h4>\n\n<ul>\n  <li>Read 50 books/15,000+ pages: success</li>\n  <li>Great Books, year one: failure</li>\n  <li>Classic machine learning papers: failure</li>\n</ul>\n\n<p>In 2019 I read 16,918 pages of <strong>completed</strong> books on Goodreads, which is 50 books: first time hitting my goal! Here are <a href=\"https://www.goodreads.com/review/list/49504536-alex-korbonits?read_at=2019\">my 2019 books</a>.</p>\n\n<p>Great Books: didn’t make any headway here. Ironically, I picked up a full set (pristine!) of the Harvard Classics, so, Hutchins and Adler have some competition for my reading attention.</p>\n\n<p>Classic machine learning papers: this just wasn’t high on the interest list in 2019. Dropping it until further notice. I did however spend real quality time dissecting the latest NLP papers, math and all, on whiteboards or on Google Hangouts. BERT, Attention is All You Need, ELMo, etc., they were great reads but by far the better part was the sharing of knowledge with curious colleagues and friends.</p>\n\n<h4 id=\"writing-successfailure\">Writing: success/failure</h4>\n\n<p>In early 2019, fresh off the huge NaNoWriMo tailwinds of hitting 50,000 words in late 2018, I started one of two fiction courses at <a href=\"https://hugohouse.org/\">Hugo House</a>: Fiction II and Fiction III.</p>\n\n<p>I was very invested in Fiction II but conflicts with sailing and other obligations had me missing out on Fiction III and I unfortunately withdrew from participation after workshopping a piece of flash fiction derived from one of my NaNoWriMo scenes.</p>\n\n<p>After reading a lot of Poetry Magazine, I decided I’d like to take the trilogy of poetry courses at Hugo House when I can. Poetry suits the way I think better than the punishing detail and convention that prose requires to be readable. Writing prose is very difficult.</p>\n\n<h4 id=\"travel-success\">Travel: success</h4>\n\n<p>Started off strong with entering 2019 in Puerto Vallarta, Mexico.</p>\n\n<p>Here’s a list of destinations I went to in 2019:</p>\n<ul>\n  <li>Puerto Vallarta, Mexico (January)</li>\n  <li>Vancouver, BC, Canada (April)</li>\n  <li>Japan (Osaka, Kobe, Kyoto, Himeji, Tokyo) (May)</li>\n  <li>Portland, OR (June)</li>\n  <li>Lopez Island, WA (July)</li>\n  <li>Los Angeles, Santa Monica, Malibu (x3 for each) (August, October, November)</li>\n  <li>Newport, OR (August)</li>\n  <li>Chicago (September)</li>\n  <li>New York City (September)</li>\n  <li>Troy, NY; Lake George; Lake Champlain (September)</li>\n  <li>Montréal, QC, Canada (September/October)</li>\n  <li>San Francisco (November)</li>\n</ul>\n\n<p>Wow. This is perhaps the most travel I’ve done in a single calendar year. Two continents (Asia (first time!) and North America), four countries (Japan, USA, Canada, Mexico), five states (Washington, Oregon, California, Illinois, New York), two provinces (British Columbia, Quebec), and 16 flights. I traveled for weddings, conferences, romantic adventures, Thanksgiving, family birthdays, and of course sailing.</p>\n\n<p>By far Japan was the most memorable trip (unfair competition). Can’t wait to go back. Would be nice to have gone for longer or to have gone without the sailing festivities to focus purely on traveling. Would love to spend more time in Kyoto and Tokyo, specifically. One day in Kyoto and three days in Tokyo were simply not enough, although I did manage to do and see quite a lot in those days with friends as well as on my own. Could not have done it without one of my college friends acting as the Virgil to my Dante helping me carve out a semi-optimal path through these complex cities. Food was the main anchor point followed by Shinto Shrines and long walks.</p>\n\n<h4 id=\"language-failure-with-computer-language-success\">Language: failure (with computer language success)</h4>\n\n<p>Knowing at the outset of 2019 that I’d be in Japan for a fortnight in May, I had a lot of motivation to learn Japanese. I tried duolingo for awhile but I felt like I was missing a lot of structure and it was a steep learning curve. I think lessons or Rosetta Stone would have been a better choice. In retrospect, it was so easy to get around Japan because everything is so LOGICAL there. Train stations in particular. Even in places where English signage was de minimus or nonexistent, it was easy to navigate. Having a lot of wifi to use Google Maps helped too, obviously, but English wasn’t really necessary for that either. Place names and the ability to interpret symbols on maps or signs was all one needed to be successful. Most practically, knowing how to politely greet, thank, and ask simple questions was important. Food names second. I tried hard not to take advantage of the privilege of being a native English speaker and an American too much in order to get around and ask for help. In being able to communicate so little I had this wonderful experience of having to communicate what was absolutely essential in a minimalistic way. It forced me to be thoughtful about information, expression, and voice. It was isolating <strong>and</strong> liberating. It made me crave learning language so I could talk to locals and share human connection. It made traveling to Japan (which is obviously a very safe place with best-in-the-world ameninites and infrastructure) feel so much more foreign, new, and different, but still within my comfort zone. I loved it. It made me feel more open to more foreign-feeling places in the future.</p>\n\n<p>That being said, I <em>did</em> spend a lot of time studying computer science in 2019 and learned how to write a lot of cool algorithms from scratch. That was dollar-per-minute some of the best time I’ve invested in myself. Not all self-investment has to be monetary but it helped me make a quantum leap.</p>\n\n<p>Computer languages are much easier than natural languages but I will give myself some partial credit.</p>\n\n<h4 id=\"fitness-failure-w-sailing-success\">Fitness: failure (w/ sailing success)</h4>\n\n<ul>\n  <li>Run 365 miles in 2019: failure</li>\n  <li>Stretch goal 1: enter some races, starting with a 5k: failure</li>\n  <li>Stretch goal 2: new PRs for distance, mile, and 5k.: failure</li>\n  <li>Yoga: try it out, see if it sticks: failure</li>\n  <li>Lose 10lbs sustainably: failure</li>\n</ul>\n\n<p>2019 was not my strong suit for fitness. I probably spent the most focus on steps/day. My average steps/day in 2019 were 7,898 which is quite remarkable. It was my default form of exercise and I often went on walks after work for an hour or more, listening to books. Plus walking to/from work. And walking during all that travel. I did not work on aerobic fitness and certainly didn’t push myself in 2019. Work was stressful and walking was relaxing/calming. I also used the sauna quite a bit and regularly completed the executive triathlon (dry sauna + steam room + jacuzzi) with religious zeal.</p>\n\n<h4 id=\"sailing-success\">Sailing: success</h4>\n\n<p>Racing:</p>\n\n<p>2019 was a banner year for sailing. It was hard to get onto fast boats as a crew person (lack of sailing resume, preparation, and networking) but I did do some fantastic networking and proved myself as capable rail meat, spinnaker trimmer, and “mast” person on some of those fast boat races. I really honed my main trim and jib/spinnaker trimming abilities on J22s and J24s. Got a lot of practice on other boats too in those positions. All that being said I also enjoyed myself a lot. And stretched myself. Did some white-knuckle racing in squalls and almost gale-force winds on a very tippy Tiger 10 – got to hang on to stay on.</p>\n\n<p>Specifically, I trained for the Takarabune Regatta, which is a regatta between the Suma Yacht Club of Kobe, Japan, and the Seattle Yacht Club of Seattle, WA (of which I am a member). It was an honor to be chosen to crew on a boat in this regatta. Unforgettable trip to Japan and raced against great sailors (and our hosts) in Kobe. Can’t wait to see them again in 2022 in Seattle.</p>\n\n<p>Cruising:</p>\n\n<p>Didn’t really do this. s/v Wind Child is not in good shape for cruising, and frankly, I don’t have the skills nor interest in DIY’ing her into cruising shape. Frankly I think I’m destined to outgrow her and find a larger, newer sailboat with more comfortable amenities. The idea of cruising for months in the summer with a WiFi hotspot to do work sounds really great.</p>\n\n<h4 id=\"organization-2019-success\">Organization, 2019: success</h4>\n\n<p>Throughout the year I became progressively more organized. I had many more demands on my time from a variety of existing and new sources and had to stay organized to keep it all together. I failed to read Part II of Getting Things Done, but I still kept up the spirit of Part I by using my personal Trello as a kanban board. If you’re not wasting time it’s amazing how much you can get done if you keep your time well-organized.</p>\n\n<h4 id=\"use-less-technology-2019-success\">Use less technology, 2019: success</h4>\n\n<p>Speaking of wasting less time, I’d say that’s definitely true of 2019. Screen time was down. I spent more time reading, more time outside, more time traveling (and without internet in foreign places), and more time spending time with others &lt;3. At some point in the year I read Cal Newport’s <a href=\"https://www.amazon.com/Digital-Minimalism-Choosing-Focused-Noisy/dp/0525536515\">Digital Minimalism</a> and deleted Twitter, Instagram, and Facebook from my phone. Though sometimes I continued to log in via Chrome or Safari, the lack of push notifiactions alone drastically reduced my usage and the increased friction/reduced UX also helped reduce my time spent doomscrolling. I would highly recommend this approach. Just removing one’s access altogether or making it slightly more cumbersome. Time is the most valuable commodity I have and choosing to spend less of it on social media has made me feel happier.</p>",
  "pubDate": "Wed, 01 Jan 2020 00:00:00 +0000",
  "link": "http://korbonits.github.io/2020/01/01/Retrospective-on-2019.html",
  "guid": "http://korbonits.github.io/2020/01/01/Retrospective-on-2019.html"
}