{
  "title": "506 - A Climate Change Activist Reacts to the Climate Change Bill",
  "itunes:title": "506 - A Climate Change Activist Reacts to the Climate Change Bill",
  "pubDate": "Wed, 17 Aug 2022 10:00:00 +0000",
  "guid": "8adc5c53-610a-412f-933d-98581ac9261e",
  "link": "https://johnshopkinssph.libsyn.com/506-a-climate-change-activist-reacts-to-the-climate-change-bill",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">President Biden is poised to sign the historic Inflation Reduction Act that will, among other things, enact sweeping changes to the US energy sector and efforts to fight climate change.</span> <strong>Tiernan Sittenfeld,</strong> <span style=\"font-weight: 400;\">the senior vice president of the League of Conservation Voters, talks with guest host</span> <strong>Shelley Hearne</strong> <span style= \"font-weight: 400;\">about the bill and its game-changing potential for the environment and public health. They also discuss why major climate legislation has failed in the past and what needs to be done to ensure that implementation is successful.</span></p>",
  "content:encoded": "<p>President Biden is poised to sign the historic Inflation Reduction Act that will, among other things, enact sweeping changes to the US energy sector and efforts to fight climate change. Tiernan Sittenfeld, the senior vice president of the League of Conservation Voters, talks with guest host Shelley Hearne about the bill and its game-changing potential for the environment and public health. They also discuss why major climate legislation has failed in the past and what needs to be done to ensure that implementation is successful.</p>",
  "enclosure": "",
  "itunes:duration": "12:16",
  "itunes:explicit": false,
  "itunes:keywords": "energy,green,environment,climate,health,President,bill,pollution,ozone",
  "itunes:subtitle": "President Biden is poised to sign the historic Inflation Reduction Act that will, among other things, enact sweeping changes to the US energy sector and efforts to fight climate change. Tiernan Sittenfeld, the senior vice president of the League of...",
  "itunes:season": 6,
  "itunes:episode": 506,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}