{
  "id": "yt:video:b4NTGitP8_Y",
  "yt:videoId": "b4NTGitP8_Y",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Dandapani | The Power of Unwavering Focus | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-03T16:00:19+00:00",
  "updated": "2022-10-05T23:54:54+00:00",
  "media:group": {
    "media:title": "Dandapani | The Power of Unwavering Focus | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Dandapani discusses his book \"The Power of Unwavering Focus.\" Anxiety, stress, worry, and fear—these mental maladies are making us increasingly unhappy and unhealthy. Dandapani—argues that learning how to concentrate is the cure. The Power of Unwavering Focus distills his wisdom and learnings into a step-by-step guide to taking charge of your life by understanding the mind, harnessing awareness, and cultivating a concentration practice.\n\nGet the book here: https://goo.gle/3qJYFjJ.\n\nDandapani is a Hindu priest, entrepreneur, and former monk of ten years. After graduating university with a degree in Electrical Engineering he left it all behind to become a Hindu monk under the guidance of one of Hinduism’s foremost spiritual leaders of our time, Sivaya Subramuniyaswami. For 10 years he lived a life of serious personal discipline and training at his guru’s cloistered monastery in Hawaii.\n\nWhen his vows expired, he chose to venture out into the world making New York City his home. He works with entrepreneurs and some of the top athletes in the world in helping them understand and leverage their mind so that they can be the best at what they do. He does this by empowering them with tools and teachings that have been used by Hindu monks of his tradition for thousands of years. An internationally renowned speaker and world-leading expert on leveraging the human mind to create a life of purpose and joy, Dandapani has shared the stage with world-renowned leaders, companies and many individuals. \n\nModerated by Shilpa Maniar.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}