{
  "id": "yt:video:oa5VYKtFZcE",
  "yt:videoId": "oa5VYKtFZcE",
  "yt:channelId": "UCSmjcWvgVBqF3x_7e5rfe3A",
  "title": "Don't Get Got! How to Avoid a Privacy Disaster with Samantha Floreani",
  "link": "",
  "author": {
    "name": "OWASP DevSlop",
    "uri": "https://www.youtube.com/channel/UCSmjcWvgVBqF3x_7e5rfe3A"
  },
  "published": "2022-03-19T12:10:34+00:00",
  "updated": "2022-08-27T08:26:41+00:00",
  "media:group": {
    "media:title": "Don't Get Got! How to Avoid a Privacy Disaster with Samantha Floreani",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "▬▬▬▬▬▬ SHOW SPONSOR ✨  ▬▬▬▬▬▬\nAs a special offer for the OWASP DevSlop audience, sign up for a free 2-week Datadog trial and receive a Datadog t-shirt! https://www.datadoghq.com/owasp-devslop\n▬▬▬▬▬▬   📝 ABSTRACT & BIO   ▬▬▬▬▬▬\nIn the age of ubiquitous technology and pervasive data collection, people often lament that \"privacy is dead\". But if that's the case, then why do we keep hearing about it? Hardly a week goes by without some form of privacy scandal: Cambridge Analytica, the Ashley Madison data breach, hell, even governments have been riddled with privacy disasters over recent years.\n\nSo how can you make sure that this doesn't happen to you? And, perhaps more importantly, how can you make sure that you are protecting your users from privacy-related harms?\n\nBuilding security into software is essential--you know this already. But what about privacy? This session explores how to think about building privacy into design from the start, to avoid a big ol' privacy mess later on. We'll do a 101 of privacy law, and talk through some tips to put privacy into practice. We'll also explore some bigger ideas about privacy and why it's so important *beyond* just making sure you're complying with the law and avoiding a reputational disaster.\n\nSAMANTHA FLOREANI\n\nSamantha Floreani (@samfloreani) works at the intersection of human rights, technology, and feminism. Sam is currently the Program Lead at Digital Rights Watch, where they advocate for human rights in the digital age. Their areas of interest include the impacts of pervasive surveillance and privacy as a collective good. Sam has experience working in privacy in government, the private sector, and now in civil society. She has previously served on the board of the Australian Privacy Foundation, and was the Program Director of Code Like a Girl while studying postgraduate data science.\n▬▬▬▬▬▬   🔗 LINKS   ▬▬▬▬▬▬\nShoshana Zuboff's The Age of Surveillance Capitalism ISBN: 9781781256855\nhttps://cookieconsentspeed.run/\n▬▬▬▬▬▬ 🎥 Producer ▬▬▬▬▬▬ \nNancy Gariché                       ►  https://www.linkedin.com/in/nancygariche\n▬▬▬▬▬▬   🎙️Hosts   ▬▬▬▬▬▬ \nBec                                    ►  https://twitter.com/errbufferoverfl\nJames                        ►  https://twitter.com/devec0\nLilly                            ►   https://twitter.com/attacus_au\nMimi                           ►   https://twitter.com/p0kemina\n▬▬▬▬▬▬   👋 Connect with Us   ▬▬▬▬▬▬ \nTWITCH                                 ► https://www.twitch.tv/owasp_devslop\nDEV                                        ►  https://dev.to/devslop​\nINSTAGRAM                         ►  https://www.instagram.com/owaspdevslop/​\nTWITTER                               ►  https://twitter.com/owasp_devslop​\nMEETUP                               ►  https://www.meetup.com/OWASP-DevSlop-Project/",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}