{
  "title": "2022 Global Economic Outlook, Pt. 2: Debates and Uncertainties",
  "description": "<p>Andrew Sheets continues his discussion with Chief Global Economist Seth Carpenter on Morgan Stanley’s more optimistic economic outlook for 2022, what’s misunderstood and where it could be wrong.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Seth Carpenter </strong>And I'm Seth Carpenter. I'm Morgan Stanley's Chief Global Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And on part two of the special episode of Thoughts on the Market, Seth and I will be continuing our discussion on the 2022 outlook for the global economy and how that outlook could impact markets in the coming year. It's Friday, November 19th at 5:00 p.m. in London.</p><p><br></p><p><strong>Seth Carpenter </strong>And if it's five pm in London, it's noon in New York.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, you speak to a wide variety of clients, and this topic of the supply chain, you know, keeps coming up in a variety of formats. It comes up in our financial discussions. It comes up in the popular press. Is there a part of this story that you think is poorly understood or maybe misunderstood, you know, amidst all this focus of supply chain stress?</p><p><br></p><p><strong>Seth Carpenter </strong>I think I'd point to two key areas where maybe there could be a little bit more attention focused. The first one, and I was sort of talking in these terms before, is the difference between the price level and inflation. Now, if I am at the store and I'm looking at milk on the shelf, all I care about is the price level itself: is milk more expensive than it was before? Is the price high? When the central bank, when investors look at prices, they're actually measuring inflation, the rate of growth of those prices. And I think that key distinction is one of the big parts here. If supply chains stop getting worse, then it seems like in general, at some point the price level should stop going up. It'd still be a high price and it'd still be unpleasant for consumers. But the inflation on that would end up being zero. And I think that difference between growth rates and price levels is one thing that probably deserves a little bit more scrutiny.</p><p><br></p><p><strong>Seth Carpenter </strong>And I think the second part is-- I'm going to use an economics type term here-- how non-linear some of these effects are. And so what do I mean there? If you think about the auto industry, which has been in the news a lot for having a shortage of microchips, for example. But suppose you had a car that had 95% of the parts already assembled, 5% were missing. That's not a car. That's spare parts. Suppose you had a hundred cars that were 95% done. In a linear version of the world, 95% of one hundred is 95 cars. But you still really just have a pile of spare parts at that point. And so it's not as though you get proportional reduction in output. You can get all of the output disrupted for one of just a few parts. I'm curious to see how it resolves on the other side. Does it turn out then that all of a sudden, we're faced with a glut of extra products because those few missing parts are now delivered and so all of a sudden that final assembly can get done and we have a lot. I don't know what the answer is. We've assumed that it's much smoother than that when things unwind, but there really is a lot of uncertainty here.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Seth, the last 18 months have been really hard. But you know, you could maybe argue that for the Fed, its decisions have been somewhat easy. And we've seen the Fed and other central banks take extraordinary action. But, you know, now the Fed, the European Central Bank, you know, a lot of these central banks are now coming under a lot more pressure on the one side to say, you know, inflation's now picking up, you're making a mistake to, you know, the economy still not normal. It still needs a lot of support. How do you see those debates playing out? And how do you think some of that ultimately resolves itself next year?</p><p><br></p><p><strong>Seth Carpenter</strong> I mean, debate is exactly the right word, and I love to note to clients that my job used to be to argue over what should happen with policy but now my job is just to think about what's likely to happen. And there I turn to the policymakers themselves, and so when I think about Chair Powell, I think about the fact that they announced a tapering of their asset purchases, and he said he expects that to run through the middle of next year. He also said that he expects inflation to come down, but he doesn't expect it to materially come down until Q2 or Q3 of next year. In that context, that to me says he's probably waiting for a while to see how the data resolve themselves.</p><p><br></p><p><strong>Seth Carpenter </strong>What I've also heard Chair Powell say is that their conditions for raising short term interest rates is both having inflation doing what they want it to do, but also full employment. And he's tried to give a few different measures of full employment means to them. It's not just the measured unemployment rate, but it's also people getting jobs. It's also people who have left the labor market coming back into the labor market. And so in the forecast that the US economics team has, inflation is coming down over the course of 2022, labor supply measured by the labor force participation rate in their forecast is going up. And so when the US economics team puts those two together and thinks about how Chair Powell has characterized the Fed's decision making process, they come to the conclusion that it seems natural to think that he's going to want them to wait at least through the end of 2022 and right at the beginning of 2023 before starting to raise short term interest rates. Now you're our cross asset strategist and so you know for a fact that markets have been pricing lots of other things.</p><p><br></p><p><strong>Andrew Sheets </strong>And Seth, it's fair to say that's probably one of our more controversial assumptions for next year, this idea that the Federal Reserve doesn't end up raising interest rates in 2022, even though that is, as you mentioned, what the market's currently expecting.</p><p><br></p><p><strong>Seth Carpenter </strong>Correct. It's definitely a place where we are out of consensus. And I think as we got the recent consumer price index report that showed still quite high inflation. And as markets start to look for, you know, the next couple of months where there's inflation prints go, I think the market is expecting inflation to stay high for sufficiently long that Chair Powell and the Fed change their minds. And that clearly could happen.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, the thing I wanted to close with was, you know, a real central part of our research process at Morgan Stanley-- and this is true in strategy and economics down to our stock analysts-- is to not just try to think about a likely base case, but also think about a bull and a bear case around it. Kind of realistic, good and bad scenarios that could happen over the next 12 months. So let's get the bad news out of the way. If you think about a realistic bad case for the global economy next year, what does it look like and what gets us there?</p><p><br></p><p><strong>Seth Carpenter </strong>Wow. So this is where I have to admit, being my first time in this outlook process, I may have tipped the apple cart over just a little bit because I threw the team a curveball and I said there are actually two key ways that I could be disappointed in the global economy. And the first one is a worse outcome for the supply side. That is our assumption that supply chains get better over time. That might not happen, right? That might stay bad for longer, we might have more frictions in the labor market than we expect. In that version of the world, we likely get both weaker economic growth than we think and higher inflation than we forecast because the supply disruptions would feed into sustained inflationary pressures that keep those price prices rising and rising and rising over time as supply chains get worse. And at the same time, we could easily see, under those circumstances, central banks globally shifting towards tighter monetary policy. If we get much higher inflationary outcomes than we currently forecast we're just going to see more tightening. And so you get that double whammy of less production, less economic activity because supply disruptions and also tighter financial conditions. And so that's an outcome that we can't rule out. And that's troubling.</p><p><br></p><p><strong>Seth Carpenter </strong>On the other hand, we could be wrong about the lack of a fiscal drag in the United States. We could be wrong about how much fiscal support there is going to be in Europe, for example. We could be wrong about how the Chinese economy recovers from the recent slowdown. And so we could have a demand side bear case, a demand side worse outcome. In that case, though, the world looks a little bit more normal the way, you know, markets and economists would have thought about these things pre-pandemic, i.e. slower growth, lower inflation. In that version of the world though central banks tend to sit back, I think, and wait to see how things turn out. But that, I think, is a really good illustration of just how much uncertainty there is right now. There's a version of the world where we have worse growth and higher inflation. There's a version of the world where we have worse growth and lower inflation. And I have to admit I spent some time wringing my hands, worrying about each of them.</p><p><br></p><p><strong>Andrew Sheets </strong>And finally, Seth, to end on a high note, what's the most realistic, positive case for the global economy next year and how could we get there?</p><p><br></p><p><strong>Seth Carpenter </strong>Andrew, you know, I'm an economist, which means that I'm uncomfortable being cheerful, but I'll give it a shot. So those global supply disruptions, the sort of inability of consumer goods to sort of flow to market as fast as people want to buy them, the restrictions on commodity production that have led to the really high prices. I have to believe there's a version of the world where that all gets resolved much more quickly. Right? Where all of those partially produced goods that only need one or two extra spare parts, that ship arrives, those spare parts come in, and then all of a sudden, we've got a glut of supply instead of a shortage of supply. I think in that version of the world, we have a really virtuous cycle. A couple of things happen. One, inflation starts to come down much more quickly because there's much more availability of all those goods that people are looking to buy. Second, there's a lot more availability of all those goods that people are willing to buy. And so as a result, you can have that economic activity picking up. I think at the same time, in the same spirit of a better supply outlook, the labor supply could fix itself more quickly. In which case wage pressures start to ease a little bit, people feel more comfortable coming back to the labor market. Maybe that's because of the increasing vaccinations, especially among children. Maybe it's because we get past the winter and we have a milder winter when it comes to the to the pandemic. All of those sort of supply things, both physical goods and greater supply and more labor supply-- if those happened together than we should have faster growth. But as it turns out, a bit less in the way of inflationary pressures. And so that really would be sort of a fantastic outcome.</p><p><br></p><p><strong>Andrew Sheets </strong>We'll have to stay tuned. Seth, thanks for taking the time to talk.</p><p><br></p><p><strong>Seth Carpenter </strong>I have to say, Andrew, it's always my pleasure to get to talk to you.</p><p><br></p><p><strong>Andrew Sheets </strong>Thanks for listening. If you enjoy thoughts on the market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.</p>",
  "itunes:title": "2022 Global Economic Outlook, Pt. 2: Debates and Uncertainties",
  "itunes:episodeType": "full",
  "itunes:episode": 498,
  "itunes:summary": "Andrew Sheets continues his discussion with Chief Global Economist Seth Carpenter on Morgan Stanley’s more optimistic economic outlook for 2022, what’s misunderstood and where it could be wrong.",
  "content:encoded": "<p>Andrew Sheets continues his discussion with Chief Global Economist Seth Carpenter on Morgan Stanley’s more optimistic economic outlook for 2022, what’s misunderstood and where it could be wrong.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Seth Carpenter </strong>And I'm Seth Carpenter. I'm Morgan Stanley's Chief Global Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And on part two of the special episode of Thoughts on the Market, Seth and I will be continuing our discussion on the 2022 outlook for the global economy and how that outlook could impact markets in the coming year. It's Friday, November 19th at 5:00 p.m. in London.</p><p><br></p><p><strong>Seth Carpenter </strong>And if it's five pm in London, it's noon in New York.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, you speak to a wide variety of clients, and this topic of the supply chain, you know, keeps coming up in a variety of formats. It comes up in our financial discussions. It comes up in the popular press. Is there a part of this story that you think is poorly understood or maybe misunderstood, you know, amidst all this focus of supply chain stress?</p><p><br></p><p><strong>Seth Carpenter </strong>I think I'd point to two key areas where maybe there could be a little bit more attention focused. The first one, and I was sort of talking in these terms before, is the difference between the price level and inflation. Now, if I am at the store and I'm looking at milk on the shelf, all I care about is the price level itself: is milk more expensive than it was before? Is the price high? When the central bank, when investors look at prices, they're actually measuring inflation, the rate of growth of those prices. And I think that key distinction is one of the big parts here. If supply chains stop getting worse, then it seems like in general, at some point the price level should stop going up. It'd still be a high price and it'd still be unpleasant for consumers. But the inflation on that would end up being zero. And I think that difference between growth rates and price levels is one thing that probably deserves a little bit more scrutiny.</p><p><br></p><p><strong>Seth Carpenter </strong>And I think the second part is-- I'm going to use an economics type term here-- how non-linear some of these effects are. And so what do I mean there? If you think about the auto industry, which has been in the news a lot for having a shortage of microchips, for example. But suppose you had a car that had 95% of the parts already assembled, 5% were missing. That's not a car. That's spare parts. Suppose you had a hundred cars that were 95% done. In a linear version of the world, 95% of one hundred is 95 cars. But you still really just have a pile of spare parts at that point. And so it's not as though you get proportional reduction in output. You can get all of the output disrupted for one of just a few parts. I'm curious to see how it resolves on the other side. Does it turn out then that all of a sudden, we're faced with a glut of extra products because those few missing parts are now delivered and so all of a sudden that final assembly can get done and we have a lot. I don't know what the answer is. We've assumed that it's much smoother than that when things unwind, but there really is a lot of uncertainty here.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Seth, the last 18 months have been really hard. But you know, you could maybe argue that for the Fed, its decisions have been somewhat easy. And we've seen the Fed and other central banks take extraordinary action. But, you know, now the Fed, the European Central Bank, you know, a lot of these central banks are now coming under a lot more pressure on the one side to say, you know, inflation's now picking up, you're making a mistake to, you know, the economy still not normal. It still needs a lot of support. How do you see those debates playing out? And how do you think some of that ultimately resolves itself next year?</p><p><br></p><p><strong>Seth Carpenter</strong> I mean, debate is exactly the right word, and I love to note to clients that my job used to be to argue over what should happen with policy but now my job is just to think about what's likely to happen. And there I turn to the policymakers themselves, and so when I think about Chair Powell, I think about the fact that they announced a tapering of their asset purchases, and he said he expects that to run through the middle of next year. He also said that he expects inflation to come down, but he doesn't expect it to materially come down until Q2 or Q3 of next year. In that context, that to me says he's probably waiting for a while to see how the data resolve themselves.</p><p><br></p><p><strong>Seth Carpenter </strong>What I've also heard Chair Powell say is that their conditions for raising short term interest rates is both having inflation doing what they want it to do, but also full employment. And he's tried to give a few different measures of full employment means to them. It's not just the measured unemployment rate, but it's also people getting jobs. It's also people who have left the labor market coming back into the labor market. And so in the forecast that the US economics team has, inflation is coming down over the course of 2022, labor supply measured by the labor force participation rate in their forecast is going up. And so when the US economics team puts those two together and thinks about how Chair Powell has characterized the Fed's decision making process, they come to the conclusion that it seems natural to think that he's going to want them to wait at least through the end of 2022 and right at the beginning of 2023 before starting to raise short term interest rates. Now you're our cross asset strategist and so you know for a fact that markets have been pricing lots of other things.</p><p><br></p><p><strong>Andrew Sheets </strong>And Seth, it's fair to say that's probably one of our more controversial assumptions for next year, this idea that the Federal Reserve doesn't end up raising interest rates in 2022, even though that is, as you mentioned, what the market's currently expecting.</p><p><br></p><p><strong>Seth Carpenter </strong>Correct. It's definitely a place where we are out of consensus. And I think as we got the recent consumer price index report that showed still quite high inflation. And as markets start to look for, you know, the next couple of months where there's inflation prints go, I think the market is expecting inflation to stay high for sufficiently long that Chair Powell and the Fed change their minds. And that clearly could happen.</p><p><br></p><p><strong>Andrew Sheets </strong>Seth, the thing I wanted to close with was, you know, a real central part of our research process at Morgan Stanley-- and this is true in strategy and economics down to our stock analysts-- is to not just try to think about a likely base case, but also think about a bull and a bear case around it. Kind of realistic, good and bad scenarios that could happen over the next 12 months. So let's get the bad news out of the way. If you think about a realistic bad case for the global economy next year, what does it look like and what gets us there?</p><p><br></p><p><strong>Seth Carpenter </strong>Wow. So this is where I have to admit, being my first time in this outlook process, I may have tipped the apple cart over just a little bit because I threw the team a curveball and I said there are actually two key ways that I could be disappointed in the global economy. And the first one is a worse outcome for the supply side. That is our assumption that supply chains get better over time. That might not happen, right? That might stay bad for longer, we might have more frictions in the labor market than we expect. In that version of the world, we likely get both weaker economic growth than we think and higher inflation than we forecast because the supply disruptions would feed into sustained inflationary pressures that keep those price prices rising and rising and rising over time as supply chains get worse. And at the same time, we could easily see, under those circumstances, central banks globally shifting towards tighter monetary policy. If we get much higher inflationary outcomes than we currently forecast we're just going to see more tightening. And so you get that double whammy of less production, less economic activity because supply disruptions and also tighter financial conditions. And so that's an outcome that we can't rule out. And that's troubling.</p><p><br></p><p><strong>Seth Carpenter </strong>On the other hand, we could be wrong about the lack of a fiscal drag in the United States. We could be wrong about how much fiscal support there is going to be in Europe, for example. We could be wrong about how the Chinese economy recovers from the recent slowdown. And so we could have a demand side bear case, a demand side worse outcome. In that case, though, the world looks a little bit more normal the way, you know, markets and economists would have thought about these things pre-pandemic, i.e. slower growth, lower inflation. In that version of the world though central banks tend to sit back, I think, and wait to see how things turn out. But that, I think, is a really good illustration of just how much uncertainty there is right now. There's a version of the world where we have worse growth and higher inflation. There's a version of the world where we have worse growth and lower inflation. And I have to admit I spent some time wringing my hands, worrying about each of them.</p><p><br></p><p><strong>Andrew Sheets </strong>And finally, Seth, to end on a high note, what's the most realistic, positive case for the global economy next year and how could we get there?</p><p><br></p><p><strong>Seth Carpenter </strong>Andrew, you know, I'm an economist, which means that I'm uncomfortable being cheerful, but I'll give it a shot. So those global supply disruptions, the sort of inability of consumer goods to sort of flow to market as fast as people want to buy them, the restrictions on commodity production that have led to the really high prices. I have to believe there's a version of the world where that all gets resolved much more quickly. Right? Where all of those partially produced goods that only need one or two extra spare parts, that ship arrives, those spare parts come in, and then all of a sudden, we've got a glut of supply instead of a shortage of supply. I think in that version of the world, we have a really virtuous cycle. A couple of things happen. One, inflation starts to come down much more quickly because there's much more availability of all those goods that people are looking to buy. Second, there's a lot more availability of all those goods that people are willing to buy. And so as a result, you can have that economic activity picking up. I think at the same time, in the same spirit of a better supply outlook, the labor supply could fix itself more quickly. In which case wage pressures start to ease a little bit, people feel more comfortable coming back to the labor market. Maybe that's because of the increasing vaccinations, especially among children. Maybe it's because we get past the winter and we have a milder winter when it comes to the to the pandemic. All of those sort of supply things, both physical goods and greater supply and more labor supply-- if those happened together than we should have faster growth. But as it turns out, a bit less in the way of inflationary pressures. And so that really would be sort of a fantastic outcome.</p><p><br></p><p><strong>Andrew Sheets </strong>We'll have to stay tuned. Seth, thanks for taking the time to talk.</p><p><br></p><p><strong>Seth Carpenter </strong>I have to say, Andrew, it's always my pleasure to get to talk to you.</p><p><br></p><p><strong>Andrew Sheets </strong>Thanks for listening. If you enjoy thoughts on the market, please take a moment to rate and review us on the Apple Podcast app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/PmWe7JZcljRDK_E-dkBhtMpayhZqWgqHR36M2HGAJ6s",
  "pubDate": "Fri, 19 Nov 2021 23:49:03 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:09:54",
  "enclosure": ""
}