{
  "title": "Actual Journalists Slam Corporate Media To Their Faces",
  "itunes:title": "Actual Journalists Slam Corporate Media To Their Faces",
  "pubDate": "Fri, 22 Jul 2022 06:00:00 +0000",
  "guid": "993978b6-6583-49cb-974e-c3468392e91e",
  "link": "https://thejimmydoreshow.libsyn.com/actual-journalists-slam-corporate-media-to-their-faces",
  "itunes:image": "",
  "description": "<p>The Grayzone journalists Max Blumenthal and Aaron Maté recently traveled to Canada to attend Collision Toronto, \"North America's fastest growing tech conference,\" and sat for an interview where they described an audience filled with representatives of the mainstream media as duplicitous, fake news-spreading propagandists. Jimmy speaks with Aaron and Max about the experience, and how it felt to tell the truth about the malign influence of the corporate media right to their glaring faces.<br /> <br /> Plus a segment on The Guardian newspaper's call for an immediate escalation in Ukraine that will likely lead to World War III.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from Brad Pitt as well as Joe Biden and Joe Manchin!</p>",
  "content:encoded": "<p>The Grayzone journalists Max Blumenthal and Aaron Maté recently traveled to Canada to attend Collision Toronto, \"North America's fastest growing tech conference,\" and sat for an interview where they described an audience filled with representatives of the mainstream media as duplicitous, fake news-spreading propagandists. Jimmy speaks with Aaron and Max about the experience, and how it felt to tell the truth about the malign influence of the corporate media right to their glaring faces.  Plus a segment on The Guardian newspaper's call for an immediate escalation in Ukraine that will likely lead to World War III.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from Brad Pitt as well as Joe Biden and Joe Manchin!</p>",
  "enclosure": "",
  "itunes:duration": "01:03:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The Grayzone journalists Max Blumenthal and Aaron Maté recently traveled to Canada to attend Collision Toronto, \"North America's fastest growing tech conference,\" and sat for an interview where they described an audience filled with representatives...",
  "itunes:episodeType": "full",
  "itunes:summary": "The Grayzone journalists Max Blumenthal and Aaron Maté recently traveled to Canada to attend Collision Toronto, \"North America's fastest growing tech conference,\" and sat for an interview where they described an audience filled with representatives of the mainstream media as duplicitous, fake news-spreading propagandists. Jimmy speaks with Aaron and Max about the experience, and how it felt to tell the truth about the malign influence of the corporate media right to their glaring faces. Plus a segment on The Guardian newspaper's call for an immediate escalation in Ukraine that will likely lead to World War III. Also featuring Stef Zamorano and Mike MacRae! And phone calls from Brad Pitt as well as Joe Biden and Joe Manchin!"
}