{
  "title": "AMD RDNA 3 GPU Unveil \"together we advance_gaming” Live Blog (1pm PT/20:00 UTC)",
  "dc:creator": "Ryan Smith & Gavin Bonshor",
  "description": " <p>Following hot on the heels of AMD&rsquo;s major CPU launch of the year &ndash; the Zen 4 architecture and <a href=\"https://www.anandtech.com/show/17585/amd-zen-4-ryzen-9-7950x-and-ryzen-5-7600x-review-retaking-the-high-end\">Ryzen 7000 family</a> &ndash; today AMD will be giving their GPU architecture its moment in the sun with their gaming-centric &ldquo;together we advance_gaming&rdquo; event. Today&rsquo;s event will be all about AMD&rsquo;s next-generation Radeon GPU architecture, <a href=\"https://www.anandtech.com/show/17444/amd-rdnanavi-3x-update-50-better-perfperwatt-using-chiplets-for-first-time\">RDNA 3</a>, which among other things, promises a 50% improvement in performance-per-watt over the previous-generation RDNA 2 (Radeon RX 6000 series) parts.</p>\n\n<p>Notably, unlike AMD&rsquo;s CPU event back in August, AMD has held their (video) cards closer to their proverbial chest for this event. We know that it&rsquo;s all about the RDNA 3 architecture, but AMD is being quieter about product information and details. For example, any &ldquo;Radeon RX 7000 series&rdquo; branding is completely absent from all of AMD&rsquo;s official communiques. So while the Radeon RX 7000 series is still the branding we&rsquo;re expecting to see, AMD is leaving themselves a noticeable amount of room to throw some curveballs here.</p>\n\n<p>In any case, AMD has offered a few high-level details on the RDNA 3 architecture throughout the year. The biggest items disclosed thus far are that AMD is targeting another 50% increase in performance-per-watt, and that these new GPUs (Navi 3x) will be made on a 5nm process (undoubtedly TSMC&rsquo;s). Past that, AMD hasn&rsquo;t given any guidance on what to expect for performance.</p>\n\n<p>One interesting aspect, however, is that AMD has confirmed that they will be employing chiplets with this generation of products. To what extent, and whether that&rsquo;s on all parts or just some, remains to be seen. But chiplets are in some respects the holy grail of GPU construction, because they give GPU designers options for scaling up GPUs past today&rsquo;s die size (reticle) and yield limits. That said, it&rsquo;s also a holy grail because the immense amount of data that must be passed between different parts of a GPU (on the order of terabytes per second) is very hard to do &ndash; and very necessary to do if you want a multi-chip GPU to be able to present itself as a single device.</p>\n\n<p>We&rsquo;re also apparently in store for some more significant upgrades to AMD&rsquo;s overall GPU architecture. Though what exactly a &ldquo;rearchitected compute unit&rdquo; and &ldquo;optimized graphics pipeline&rdquo; fully entail remains to be seen.</p>\n\n<p>The answers to all that, and more, are coming up here in a few hours. So be sure to join us today, November 3<sup>rd</sup>, at 1pm Pacific (20:00 UTC) for our full live blog coverage of AMD&rsquo;s latest GPU announcements. We can&rsquo;t wait!</p>\n",
  "link": "https://www.anandtech.com/show/17635/amd-rdna-3-gpu-unveil-live-blog-1pm-pt-2000-utc",
  "pubDate": "Thu, 03 Nov 2022 12:00:00 EDT",
  "guid": "tag:www.anandtech.com,17635:news",
  "category": " GPUs"
}