{
  "id": "yt:video:p1Zb90MFf20",
  "yt:videoId": "p1Zb90MFf20",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "The Turbulent Tale of Yandere Dev - A Six Year Struggle | TRO (ft. Thafnine)",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-05-04T20:00:02+00:00",
  "updated": "2022-05-18T23:43:31+00:00",
  "media:group": {
    "media:title": "The Turbulent Tale of Yandere Dev - A Six Year Struggle | TRO (ft. Thafnine)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Right Opinion: The Turbulent Tale of Yandere Dev - A Six Year Struggle | TRO (ft. Thafnine)\n\nThis content is meant to inform, educate, and document, and should be strictly interpreted in that context.\n\nIntro Preview:\n\nAh anime… my favourite, what do people who like anime say... uwu? I’m gonna level with you guys here, one of my most commonly asked questions is if I watch anime, and although I have seen a couple movies when I was much younger: Spirited Away, Howl's Moving Castle, I haven’t really had the chance to enjoy much of it, although I have heard great things, and I really do respect the art, some of the art is truly beautiful. Now anime has been relatively popular since the early 20th century, it obviously originated in Japan, and often represented the cultural zeitgeist at the time.\n\nThe development of digital mediums has allowed the art to flourish and expand into new genres. One of those is of course, the video game genre. There are many anime video games, and it was in the video game heyday of the 1980s that anime inspired video games, and video game inspired anime rose to prominence. Since then, their popularity has continued to extend beyond their borders, with the style attaining international prestige amongst a variety of audiences. I also want to take a moment to talk about manga, which is typically used to refer to comics and graphic novels, often created in the Japanese style, manga precedes anime, and although mangas may be made reflecting an anime style, they are by no means the same. However, there is overlap, that overlap can be demonstrated in many characterisations of individuals, this is where we meet the Yandere. \n\nYandere is a portmanteau (which is our word of the day) of the words “Yanderu” and “Deredere”, Yanderu meaning sick, and deredere meaning infatuated, deeply in love. So combined you reach the lovely idea that this person is in love to a sick extent, they will do anything for their senpai, even if that means often less than charitable activities. This personality trait is attributed to manga, however, it has gained popularity in anime as well, with many characters being modelled around that mould. The psychotic behaviour paired with an often cute design seems to be a good contrast that has become quite the rave, and it wasn’t until one very cheeky game developer had a very cheeky idea, how about we make a whole video game from the perspective of a Yandere.\n\nThat cheeky game developer was a person by the name of Alex Mahan, currently operating under the very fitting name of Yandere Dev.\n\nWatch more to find out...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}