{
  "title": "Resource-aware Deep Learning for Wireless Fingerprinting Localization. (arXiv:2211.01759v1 [cs.NI])",
  "link": "http://arxiv.org/abs/2211.01759",
  "description": "<p>Location based services, already popular with end users, are now inevitably\nbecoming part of new wireless infrastructures and emerging business processes.\nThe increasingly popular Deep Learning (DL) artificial intelligence methods\nperform very well in wireless fingerprinting localization based on extensive\nindoor radio measurement data. However, with the increasing complexity these\nmethods become computationally very intensive and energy hungry, both for their\ntraining and subsequent operation. Considering only mobile users, estimated to\nexceed 7.4 billion by the end of 2025, and assuming that the networks serving\nthese users will need to perform only one localization per user per hour on\naverage, the machine learning models used for the calculation would need to\nperform $65 \\times 10^{12}$ predictions per year. Add to this equation tens of\nbillions of other connected devices and applications that rely heavily on more\nfrequent location updates, and it becomes apparent that localization will\ncontribute significantly to carbon emissions unless more energy-efficient\nmodels are developed and used. In this Chapter, we discuss the latest results\nand trends in wireless localization and look at paths towards achieving more\nsustainable AI. We then elaborate on a methodology for computing DL model\ncomplexity, energy consumption and carbon footprint and show on a concrete\nexample how to develop a more resource-aware model for fingerprinting. We\nfinally compare relevant works in terms of complexity and training CO$_2$\nfootprint.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Cerar_G/0/1/0/all/0/1\">Gregor Cerar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Bertalanic_B/0/1/0/all/0/1\">Bla&#x17e; Bertalani&#x10d;</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Fortuna_C/0/1/0/all/0/1\">Carolina Fortuna</a>"
}