{
  "title": "Episode 110: &#8220;Be My Baby&#8221; by the Ronettes",
  "link": "https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/",
  "pubDate": "Sat, 09 Jan 2021 23:14:39 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-110-be-my-baby-by-the-ronettes/",
  "description": "Episode 110 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Be My Baby\", and at the career of the Ronettes and Ronnie Spector.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/46017797\">on \"Little Saint Nick\" by the Beach Boys.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Erratum</strong>\n\nI say Ray Peterson's version of \"Tell Laura I Love Her\" was an American number one. It wasn't -- it only made number seven.\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-110-be-my-baby/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\n<a href=\"https://amzn.to/2LE99j7\">Be My Baby: How I Survived Mascara Miniskirts and Madness, or My Life as a Fabulous Ronette </a>by Ronnie Spector and Vince Waldron is Ronnie's autobiography and was the main source.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene, and provided me with the information on Barry and Greenwich.\n\nI've referred to two biographies of Spector in this episode,&nbsp;<a href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em>&nbsp;by Richard Williams</a>&nbsp;and&nbsp;<a href=\"https://amzn.to/32OKWMK\"><em>He's a Rebel</em>&nbsp;by Mark Ribkowsky</a>.\n\nAnd information on the Wrecking Crew largely comes from&nbsp;<a href=\"https://amzn.to/35FhkUh\"><em>The Wrecking Crew&nbsp;</em>by Kent Hartman</a>.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\">&nbsp;<em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.\n\nIf you want something just covering Ronnie Spector and the Ronettes,&nbsp;<em>T<a href=\"https://amzn.to/3bqDL2C\">he Very Best of Ronnie Spector</a></em>&nbsp; covers all the Ronettes hits and the best of her solo career.\n\nAnd the AFM contract listing the musicians on \"Be My Baby\" can be found <a href=\"http://wreckingcrewfilm.com/afmcontracts/Ronettes,The_BeMyBaby.pdf\">here</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to take a look at the record that, more than anything, ensured Phil Spector's place in popular music history -- a record that changed the lives of several people who heard it for the better, and changed the life of its singer for the worse, and one which has the most imitated drum intro in the world. We're going to look at \"Be My Baby\" by the Ronettes:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nBefore I start this one, two things need saying. The first is that this episode, by necessity, deals with spousal abuse. As always, I will try to discuss the issue with sensitivity, and touch on it as briefly as possible, but if you worry that it might upset you, please either skip this episode, or read the transcript to see if you'll be OK listening to it. I imagine that very few people will be upset by anything I say here, but it's always a possibility.\n\nAnd secondly, I'd like to apologise for this episode being so late. I had a major disruption in my personal life over Christmas -- one of those really bad life events that only happens once or twice in most people's lifetimes -- and that made it impossible for me to get any work done at all for the last couple of weeks. I'm now able to work again, and this should not be anything that affects the podcast for the rest of the year.\n\nAnyway, enough about that, let's get on with the story.\n\nThe story of the Ronettes begins when Ronnie Bennett, a mixed-race girl from Harlem, became obsessed with the sound of Frankie Lymon and the Teenagers:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\nRonnie became the Teenagers' biggest fan, and even managed to arrange a meeting between herself and Lymon when they were both thirteen, but had her illusions torn away when he turned up drunk and made a pass at her.\n\nBut that didn't stop her from trying her best to imitate Lymon's vocals, and forming a vocal group with several friends and relatives. That group had a male lead singer, but when they made their first appearance on one of the Harlem Apollo's talent shows, the lead singer got stage fright and couldn't start singing when he got on stage. Ronnie stepped forward and took over the lead vocal, and the group went down well enough even with the Apollo's notoriously hostile audience that a smaller group of them decided to start performing regularly together.\n\nThe group took the name Ronnie and the Relatives, and consisted of Ronnie, her sister Estelle, and their cousin Nedra Talley. They originally only performed at private parties, bar mitzvahs and the like, but they soon reached the attention of Stu Phillips at Colpix Records, a label owned by the film studio Columbia Pictures.\n\nThe first single by Ronnie and the Relatives was not a success -- \"I Want a Boy\" came out in August 1961 and didn't chart:\n\n[Excerpt: Ronnie and the Relatives, \"I Want a Boy\"]\n\nAnd nor did their second, \"I'm Gonna Quit While I'm Ahead\":\n\n[Excerpt: Ronnie and the Relatives, \"I'm Gonna Quit While I'm Ahead\"]\n\nThose records did apparently sell to at least one person, though, as when Ronnie met President Clinton in 1997, he asked her to sign a record, and specifically got her to sign an album of those early recordings for Colpix.\n\nWhile the girls were not having any commercial success, they did manage to accidentally get themselves a regular gig at the most important nightclub in New York. They went to the Peppermint Lounge, just as the Twist craze was at its height, and as they were underage they dressed up especially well in order to make themselves look more grown up so they could get in.\n\nTheir ruse worked better than they expected. As they were all dressed the same, the club's manager assumed they were the dancers he'd booked, who hadn't shown up. He came out and told them to get on stage and start dancing, and so of course they did what he said, and started dancing to the Twist sounds of Joey Dee and the Starliters:\n\n[Excerpt: Joey Dee and the Starliters, \"The Peppermint Twist\"]\n\nThe girls' dancing went down well, and then the band started playing \"What'd I Say?\", a favourite song of Ronnie's and one the group did in their own act, and Ronnie danced over to David Brigati, who was singing lead on the song, and started dancing close to him. He handed her the mic as a joke, and she took over the song. They got a regular spot at the Peppermint Lounge, dancing behind the Starliters for their whole show and joining them on vocals for a few numbers every night.\n\nInspired by the Bobbettes and the Marvelettes, Ronnie and Estelle's mother suggested changing the group's name. She suggested \"the Rondettes\", and they dropped the \"d\", becoming the Ronettes.\n\nThe singles they released on ColPix under the new name did no better than the others, but they were such an important part of the Peppermint Lounge that when the Lounge's owners opened a second venue in Florida, the girls went down there with the Starliters and were part of the show.\n\nThat trip to Florida gave them two very different experiences. The first was that they got to see segregation firsthand for the first time, and they didn't like it -- especially when they, as light-skinned mixed-race women, were read as tanned white women and served in restaurants which then refused to serve their darker-skinned mothers.\n\nBut the second was far more positive. They met Murray the K, who since Alan Freed had been driven out of his job had become the most popular DJ in New York. Murray was down in Florida for a holiday, and was impressed enough by the girls' dancing that he told them if they were ever in New York and wanted a spot on one of his regular shows at the Brooklyn Fox Theatre they should let him know. They replied that they lived in New York and went to those shows all the time -- of course they wanted to perform on his shows. They became regular performers at the Brooklyn Fox, where they danced between the other, bigger, acts, sang backing vocals, did a song or two themselves, and took part in comedy sketches with Murray.\n\nIt was at these shows, as well, that they developed the look they would become famous with -- huge hair piled up on top of their heads, tons of mascara, and tight skirts slit to show their legs. It was a style inspired by street fashion rather than by what the other girl groups were wearing, and it made them incredibly popular with the Fox audience.\n\nBut the Ronettes, even under their new name, and even with the backing of New York's most prominent DJ, were still not selling any records. They knew they were good, and the reaction to their stage performances proved as much, so they decided that the problem must be with Colpix. And so in 1963 they made a New Year's resolution -- they were going to get Phil Spector to produce them.\n\nBy this time, Spector was becoming very well known in the music industry as a hit maker. We already saw in the recent episode on the Crystals how he was making hits for that group and the Blossoms, but he was also making hits with studio groups like Bob B. Soxx and the Blue Jeans, who he took into the top ten with a remake of the old Disney song \"Zip-a-Dee-Doo-Dah\":\n\n[Excerpt: Bob B. Soxx and the Blue Jeans, \"Zip-a-Dee-Doo-Dah\"]\n\nand as well as the records he was putting out on Philles, he was also working as a freelance producer for people like Connie Francis, producing her top ten hit \"Second-Hand Love\":\n\n[Excerpt: Connie Francis, \"Second-Hand Love\"]\n\nSo the Ronettes were convinced that he could make them into the stars they knew they had the potential to be. The group had no idea how to get in touch with Spector, so they tried the direct route -- Estelle called directory enquiries, got the number for Philles Records, and called and asked to be put through to Spector. She was as astonished as anyone when he agreed to talk to her -- and it turned out that he'd seen the group regularly at the Brooklyn Fox and was interested in working with them.\n\nAt their audition for Spector, the group first performed a close-harmony version of \"When the Red Red Robin Goes Bob-Bob-Bobbin' Along\", which they'd been taught by their singing teacher. Spector told them that he wanted to hear what they did when they were singing for themselves, not for a teacher, and so Ronnie launched into \"Why Do Fools Fall In Love?\"\n\nIt only took her getting to the second line of the song before Spector yelled at her to stop -- \"THAT is the voice I've been looking for!\"\n\nThe Ronettes' first recordings for Spector weren't actually issued as by the Ronettes at all. To start with, he had them record a version of a song by the writing team of Jeff Barry and Ellie Greenwich, \"Why Don't They Let Us Fall In Love?\", but didn't release it at the time. It was later released as by \"Veronica\", the name under which he released solo records by Ronnie:\n\n[Excerpt: Veronica, \"Why Don't They Let Us Fall In Love?\"]\n\nBut at the time, when Ronnie asked him when the record was coming out, Spector answered \"Never\". He explained to her that it was a good record, but it wasn't a number one, and he was still working on their first number one record.\n\nTheir next few recordings were covers of then-current dance hits, like \"The Twist\":\n\n[Excerpt, \"The Crystals\", \"The Twist\"]\n\nAnd \"The Wah-Watusi\", one of the few times that one of the other Ronettes took the lead rather than Ronnie, as Nedra sang lead:\n\n[Excerpt, \"The Crystals\", \"The Wah-Watusi\"]\n\nBut these, and two other tracks, were released as album tracks on a Crystals album, credited to the Crystals rather than the Ronettes.\n\nThe song that eventually became the group's first hit, \"Be My Baby\", was mostly written by one of the many husband-and-wife songwriting teams that had developed at the Brill Building, Jeff Barry and Ellie Greenwich.\n\nBarry had started out as a performer who occasionally wrote, putting out records like \"It's Called Rock and Roll\":\n\n[Excerpt: Jeff Barry, \"It's Called Rock and Roll\"]\n\nBut while his performing career had gone nowhere, he'd started to have some success as a songwriter, writing \"Teenage Sonata\" for Sam Cooke:\n\n[Excerpt: Sam Cooke, \"Teenage Sonata\"]\n\nAnd \"Tell Laura I Love Her\", which was recorded by several people, but the biggest hit version was the American number one by Ray Peterson:\n\n[Excerpt: Ray Peterson, \"Tell Laura I Love Her\"]\n\nEllie Greenwich had also started as a performer, recording \"Silly Isn't It?\" under the name Ellie Gaye:\n\n[Excerpt: Ellie Gaye, \"Silly, Isn't It?\"]\n\nShe'd become one of the most important demo singers in New York, and had also started writing songs. She'd first collaborated with Doc Pomus, cowriting songs like \"This is It\", which had been a flop single for Jay and the Americans:\n\n[Excerpt: Jay and the Americans, \"This is It\"]\n\nShe'd then been taken on by Trio Music, Leiber and Stoller's company, where she had largely collaborated with another writer named Tony Powers. Trio had first refusal on anything the two of them wrote, and if Leiber and Stoller didn't like it, they could take the song elsewhere.\n\nGreenwich and Powers had their biggest successes with songs that Leiber and Stoller rejected, which they sold to Aaron Schroeder. And they'd started up a collaboration with Phil Spector -- although Spector and Greenwich's first meeting had not exactly gone smoothly. He'd gone into her office to hear her play a song that she thought would be suitable for the Paris Sisters, but had kept wandering out of the office, and had kept looking at himself in a mirror and primping himself rather than listen to her song. Eventually she said to him &nbsp;\"Listen to me, you little prick. Did you come to look at yourself or to hear my songs?\", and she didn't make that sale.\n\nBut later on, Spector became interested in a song she'd sold to Schroeder, and made an appointment to meet her and talk about her writing some stuff for him -- that second meeting, which Spector didn't realise was with someone he'd already made a bad impression on, Spector turned up four hours late. &nbsp;But despite that, Greenwich and Powers wrote several songs for Spector, who was also given songwriting credit, and which became big hits in versions he produced -- \"(Today I Met) The Boy I'm Gonna Marry\", a single by Darlene Love:\n\n[Excerpt: Darlene Love, \"(Today I Met) The Boy I'm Gonna Marry\"]\n\nAnd \"Why Do Lovers Break Each Others' Hearts?\", released as by Bob B. Soxx and the Blue Jeans, but with Love once again on lead vocals:\n\n[Excerpt: Bob B. Soxx and the Blue Jeans, \"Why Do Lovers Break Each Others' Hearts?\"]\n\nI say that Spector was also given songwriting credit on those records, because there is some debate about how much he contributed to the songs he's credited on. Some of his co-writers have said that he would often only change a word or a phrase, and get himself cut in on an already-completed song, while others have said that he contributed a reasonable amount to the songwriting, though he was never the primary writer -- for example Barry Mann has said that Spector came up with the middle section for \"You've Lost That Lovin' Feelin'\". I tend towards the belief that Spector's contribution to the writing on those songs he's co-credited on was minimal -- in his whole career, the number of songs he wrote on his own seems to be in the single figures, while those other writers wrote dozens of hit records without any contribution from Spector -- and so when I talk about records he produced I'll tend to use phrasing like \"a Goffin and King song co-credited to Phil Spector\" rather than \"a song by Goffin, King, and Spector\", but I don't want that to give the impression that I'm certain Spector made no contribution.\n\nBut while Greenwich and Powers were a mildly successful team, their partnership ended when Greenwich met Jeff Barry at a family Thanksgiving dinner -- Greenwich's uncle was Barry's cousin. As Greenwich later put it, when they started talking together about music and realised how much they had in common, \"I went 'ooh', he went 'mmmhh', and his wife went 'I don't think I like this'\". Soon their previous partnerships, both romantic and musical, were over, and Jeff Barry and Ellie Greenwich became the third of the great Brill Building husband-and-wife songwriting teams.\n\nWhere Goffin and King had a sophisticated edge to their writing, with a hint of sexual subversion and the mingling of pain and pleasure, and Mann and Weill tried to incorporate social comment into their songs, Barry and Greenwich were happy to be silly -- they were writing songs like \"Hanky Panky\", \"Da Doo Ron Ron\", &nbsp;and \"Doo Wah Diddy Diddy\":\n\n[Excerpt: Ellie Greenwich \"Doo Wah Diddy Diddy (demo)\"]\n\nThis worked extremely well for them, to the extent that after they broke up a few years later, Barry would continue this formula with songs such as \"Sugar Sugar\", \"Jingle Jangle\" and \"Bang Shang A Lang\".\n\nBarry and Greenwich's style was to jam in as many hooks as possible, maybe put in a joke or two, keep the lyrics simple, and get out in two minutes. Very few of their songs were masterpieces of songwriting, but they *were* absolutely perfect templates for masterpieces of production. It sounds like I'm damning them with faint praise, but I'm really not. There is a huge skill involved in what they were doing -- if you're writing some heartwrenching masterpiece about the human condition, people will forgive the odd lapse in craft, but if you're writing \"My baby does the hanky panky\", there's no margin for error, and you're not going to get forgiven if you mess it up.\n\nBarry and Greenwich were good enough at this that they became the go-to writers for Spector for the next couple of years. He would record songs by most of the Brill Building teams, but when you think of the classic records Spector produced, they're far more likely than not to be Barry and Greenwich songs -- of the twenty-seven Philles singles released after Barry and Greenwich started writing together, fourteen are credited to Barry/Greenwich/Spector, and other than the joke release \"Let's Dance the Screw\", which we talked about back in the episode on the Crystals, there's a run of eleven singles released on the label between late 1962 and early 1964 which are credited either as Greenwich/Powers/Spector or Barry/Greenwich/Spector.\n\nAnd so it was naturally to Barry and Greenwich that Spector turned to write the first big hit for the Ronettes -- and he let Ronnie hear the writing session. By this time, Spector had become romantically involved with Ronnie, and he invited her into his apartment to sit in the next room and listen to them working on the song -- usually they got together in hotels rather than at Spector's home. While she was there, she found several pairs of women's shoes -- Spector hadn't told her he was married, and claimed to her when she asked that they belonged to his sister. This should probably have been a sign of things to come.\n\nAssuming that Spector did contribute to the writing, I think it's easy to tell what he brought to “Be My Baby”. If you listen to that Connie Francis record I excerpted earlier, on which Spector is also a credited co-writer, the melody line for the line “that you don't feel the same” leading into the chorus:\n\n[Excerpt: Connie Francis, “Second-Hand Love”]\n\nis identical to the melody line leading into the chorus of “Be My Baby”:\n\n[Excerpt: The Ronettes, “Be My Baby”]\n\nSo that transition between the verse and the chorus is likely his work.\n\nAfter rehearsing Ronnie for several weeks in New York, Spector flew her out to LA to make the record in Gold Star Studios, where she spent three days recording the lead vocals. The backing vocals weren't provided by the other Ronettes, but rather by the Blossoms, with a few extra singers -- notably Spector's assistant Sonny Bono, and his new girlfriend Cher -- but what really made the track was not the vocals -- although the song was perfect for Ronnie -- but Hal Blaine's drum intro:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nThat intro was utterly simple -- Blaine was always a minimalist player, someone who would play for the song rather than play fussy fills -- but that simple part, combined with the powerful sound that the engineer Larry Levine got, was enough to make it one of the most memorable intros in rock music history. Brian Wilson of the Beach Boys talks to this day about how he had to pull over to the side of the road when he first heard it on his car radio, and he would listen to the record incessantly for hours at a time.\n\nIncidentally, since I'm talking about the musicians, a lot of sources credit Carol Kaye for playing the bass on this track, so I'm going to say something once, here, which should be taken as read whenever I'm talking about records made in LA in the sixties -- Carol Kaye is not only an unreliable source about what records she played on, she is an utterly dishonest one. For those who don't know, Ms. Kaye was one of the great bass players of the sixties, and also one of the better session guitarists. She played on hundreds of records in the sixties, including many, many, classics from the Beach Boys, Spector, Frank Zappa, and others, and she was the only woman getting regular session work in LA on a rock instrument -- there may have been session orchestral musicians who were women, but when it comes to guitar, bass, drums, keyboards, sax, and so on, she was the only one. For that, she deserves a huge amount of credit.\n\nUnfortunately, she has never been happy only being credited for the records she actually played on, and insists she played on many, many, more. Some of this can be reasonably put down to lapses in memory more than fifty years later -- if you're playing two or three sessions a day, and you play on a bunch of Beach Boys records, then it's easy enough to misremember having played on \"Surfin' USA\" when maybe you played on a similar-sounding record, and there are things like her claiming to have played on \"Good Vibrations\", where there were multiple sessions for that track, and it happened that the takes eventually used weren't the ones where she was playing bass, but she had no way of knowing that. That's completely forgivable.\n\nBut Ms. Kaye also claims, with no evidence whatsoever on her side and a great deal of evidence against her, to have been responsible for playing almost the entire recorded works of James Jamerson, Motown's main bass player, claiming tapes were secretly shipped from Detroit to LA -- something that has been denied by every single person working at Motown, and which can be easily disproved just by listening to the tapes. She claims to have played the bass on \"I'm a Believer\" by the Monkees -- a track recorded in New York, by New York musicians. And whenever anyone points out the falsehoods, rather than saying \"I may have made a mistake\" she hurls abuse at them, and in some cases libels them on her website.\n\nSo, Carol Kaye did not play on this record, and we know that because we have the AFM session sheets, which show that the bass players on the track were Ray Pohlman and Jimmy Bond. I'll link a PDF of that sheet in the show notes. So in future, when I mention someone other than Carol Kaye playing on a song, and Wikipedia or somewhere says she played on it, bear this in mind.\n\nTwo people who did play on the record were Bill Pitman and Tommy Tedesco, and this is why the B-side, an instrumental, is named \"Tedesco and Pitman\". Spector was enough of a control freak that he didn't want DJs ever to play the wrong side of his singles, so he stuck instrumental jam sessions by the studio musicians -- with the songwriting credited to him rather than to them -- on the B-sides.\n\nI don't know about you, but I actually quite like \"Tedesco and Pitman\", but then I've always had a soft spot for the vibraphone:\n\n[Excerpt: \"The Ronettes\" (The Wrecking Crew), Tedesco and Pitman\"]\n\n\"Be My Baby\" was a massive hit -- it went to number one on the Cashbox chart, though only number two on the Billboard chart, and sold millions of copies.\n\nThe group were invited on to Dick Clark's Caravan of Stars tour, but Spector wanted Ronnie to be in California to record the follow-up, so the girls' cousin Elaine filled in for her for the first couple of weeks of the tour, while Ronnie recorded another Barry, Greenwich and Spector song, \"Baby I Love You\":\n\n[Excerpt: The Ronettes, \"Baby I Love You\"]\n\nRonnie didn't realise it at the time, but Spector was trying to isolate her from the other group members, and from her family. But at first this seemed to her like a sensible way of solving the problem, and she rejoined the tour after the record was made.\n\nSoon after this, the group travelled to the UK for a brief tour in early 1964, during which they became friendly with the Beatles -- Ronnie had a brief chaste flirtation with John Lennon, and Estelle something a little more with George Harrison. They also got to know their support act on the tour, the Rolling Stones -- at least once Ronnie had had a row with Andrew Loog Oldham, as Spector had sent a telegram forbidding the Rolling Stones from spending time with the Ronettes. Once Ronnie pointed out that they were there and Spector wasn't, the two groups became very friendly -- and more than friendly, if Keith Richards' autobiography is to be believed.\n\nOn their return to the US, they continued having hits through 1964 -- nothing was as big as \"Be My Baby\", but they had three more top forty hits that year, with two mediocre records, \"The Best Part of Breaking Up\" and \"Do I Love You?\", co-written by the team of Pete Andreoli and Vini Poncia, and then a return to form with the magnificent \"Walking in the Rain\", written by Barry Mann and Cynthia Weill:\n\n[Excerpt: The Ronettes Featuring Veronica, \"Walking in the Rain\"]\n\nBut Spector was becoming more and more erratic in his personal life, and more and more controlling. I won't go into too many details here, because we're going to see a lot more of Phil Spector over the next year or so, but he recorded many great records with the Ronettes which he refused to release, claiming they weren't quite right -- Ronnie has later realised that he was probably trying to sabotage their career so he could have her all to himself, though at the time she didn't know that. Neither of the two singles they did release in 1965 made the top fifty, and the one single they released in 1966, a return to songs by Barry and Greenwich, only made number one hundred, for one week:\n\n[Excerpt: The Ronettes, \"I Can Hear Music\"]\n\nAlso in 1966, the Ronettes were invited by the Beatles to be their support act on their last ever tour, but once again Spector insisted that Ronnie couldn't go, because she needed to be in the studio, so Elaine substituted for her again, much to the Beatles' disappointment. Nothing from the studio sessions during that tour was released.\n\nThe group broke up in 1967, and the next year Ronnie married Phil Spector, who became ever more controlling and abusive. I won't go into details of the way he treated her, which you can read all about in her autobiography, but suffice to say that I was completely unsurprised when he murdered a woman in 2003. You'll probably get some idea of his behaviours when I talk about him in future episodes, but what Ronnie suffered in the years they were together was something no-one should have to go through.\n\nBy the time she managed to leave him, in June 1972, she had only released one track in years, a song that George Harrison had written for her called \"Try Some, Buy Some\", which Spector had recorded with her at Harrison's insistence, during a period when Spector was working with several of the ex-Beatles and trying to rebuild his own career on the back of them:\n\n[Excerpt: Ronnie Spector, \"Try Some, Buy Some\"]\n\nNeither Ronnie nor Spector were particularly keen on the track, and it was a commercial flop -- although John Lennon later said that the track had inspired his \"Happy Xmas (War is Over)\".\n\nRonnie eventually escaped from Spector's abuse -- leaving the house barefoot, as Spector had stolen her shoes so she couldn't leave -- and started to build a new life for herself, though she would struggle with alcoholism for many years. She got nothing in their divorce settlement, as Spector threatened to hire a hit man to kill her if she tried to get anything from him, and she made a living by touring the nostalgia circuit with various new lineups of Ronettes -- the others having given up on their music careers -- and while she never had another hit, she did have a recording career.\n\nHer solo career got its proper start because of a chance meeting in New York. Her old friend John Lennon saw her on the street and called her over for a chat, and introduced her to the friend he was with, Jimmy Iovine, who was producing an album for Southside Johnny and the Asbury Dukes. Bruce Springsteen had written a song for that band, and Iovine thought it might work well as a duet with Ronnie, and he invited her to the studio that day, and she cut the song with them:\n\n[Excerpt: Southside Johnny and the Asbury Dukes, \"You Mean So Much To Me\"]\n\nThat song became one of the most popular songs on the album, and so when the Asbury Dukes toured supporting Bruce Springsteen and the E-Street Band, they brought Ronnie along with them to sing on that song and do a couple of her own hits. That led to the E-Street Band themselves backing Ronnie on a single -- a version of Billy Joel's \"Say Goodbye to Hollywood\", a song that Joel had written with her in mind:\n\n[Excerpt: Ronnie Spector and the E-Street Band, \"Say Goodbye to Hollywood\"]\n\nHowever, that was a flop, and so were all her later attempts to have comebacks, though she worked with some great musicians over the years. But she was able to continue having a career as a performer, even if she never returned to stardom, and she never made much money from her hits. She did, though, sing on one more top-ten hit, singing backing vocals on Eddie Money's \"Take Me Home Tonight\":\n\n[Excerpt: Eddie Money, \"Take Me Home Tonight\"]\n\nPhil Spector continued to earn money from his ex-wife for a long time after their divorce. By 1998, when the Ronettes finally sued Spector for unpaid royalties, they had earned, between them, a total of $14,482.30 in royalties from all their hit records -- the amount that came from a single 1964 royalty payment. In court, Spector argued that he didn't owe them any more, and indeed that *they* still owed *him* money, because the cost of recording their singles meant that they had never actually earned more money than they cost. Eventually, after a series of appeals, the group members each got about half a million dollars in 2002 -- obviously a great deal of money, but a small fraction of what they actually earned.\n\nSpector, who was on the board of the Rock and Roll Hall of Fame, prevented the Ronettes from being inducted out of spite towards his ex until he was imprisoned, at which point they were finally recognised, in 2007.\n\nRonnie continues to perform, and seems to have a happy life. Estelle, sadly, did not -- she suffered from anorexia and schizophrenia, spent a period of time homeless, and died in 2009. Nedra became a born-again Christian shortly after the group split up, and recorded a couple of unsuccessful albums of Christian music in the seventies, before going off to work in real estate. In September last year, it was announced that a film is going to be made of Ronnie Spector's life story. &nbsp;It's nice to know that there'll be something out there telling her story with her as the protagonist, rather than as a background character in the story of her abusive husband.",
  "itunes:subtitle": "Episode 110 of A History of Rock Music in Five Hundred Songs looks at Be My Baby, and at the career of the Ronettes and Ronnie Spector.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon ba",
  "itunes:keywords": "Aaron Schroeder,Brill Building,Bruce Springsteen,Carol Kaye,Colpix Records,Dick Clark,Doc Pomus,Ellie Greenwich,Frankie Lymon,George Harrison,girl groups,Hal Blaine,Jeff Barry,Joey Dee and the Starliters,John Lennon,Leiber and Stoller,Murray the K,Phil Spector,Philles Records,Ronnie Spector,Sonny Bono,The Beatles,The Crystals,The Rolling Stones,The Ronettes,the Twist,The Wrecking Crew,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 110,
  "content:encoded": "Episode 110 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Be My Baby\", and at the career of the Ronettes and Ronnie Spector.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/46017797\">on \"Little Saint Nick\" by the Beach Boys.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n<strong>Erratum</strong>\n\nI say Ray Peterson's version of \"Tell Laura I Love Her\" was an American number one. It wasn't -- it only made number seven.\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-110-be-my-baby/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\n<a href=\"https://amzn.to/2LE99j7\">Be My Baby: How I Survived Mascara Miniskirts and Madness, or My Life as a Fabulous Ronette </a>by Ronnie Spector and Vince Waldron is Ronnie's autobiography and was the main source.\n\n<a href=\"https://amzn.to/325o24w\">Always Magic in the Air: The Bomp and Brilliance of the Brill Building Era</a> by Ken Emerson is a good overview of the Brill Building scene, and provided me with the information on Barry and Greenwich.\n\nI've referred to two biographies of Spector in this episode,&nbsp;<a href=\"https://amzn.to/35C05CU\"><em>Phil Spector: Out of His Head</em>&nbsp;by Richard Williams</a>&nbsp;and&nbsp;<a href=\"https://amzn.to/32OKWMK\"><em>He's a Rebel</em>&nbsp;by Mark Ribkowsky</a>.\n\nAnd information on the Wrecking Crew largely comes from&nbsp;<a href=\"https://amzn.to/35FhkUh\"><em>The Wrecking Crew&nbsp;</em>by Kent Hartman</a>.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting<a href=\"https://amzn.to/3lOXT0V\">&nbsp;<em>Back to Mono</em></a>, a four-CD overview of his career containing all the major singles put out by Philles.\n\nIf you want something just covering Ronnie Spector and the Ronettes,&nbsp;<em>T<a href=\"https://amzn.to/3bqDL2C\">he Very Best of Ronnie Spector</a></em>&nbsp; covers all the Ronettes hits and the best of her solo career.\n\nAnd the AFM contract listing the musicians on \"Be My Baby\" can be found <a href=\"http://wreckingcrewfilm.com/afmcontracts/Ronettes,The_BeMyBaby.pdf\">here</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to take a look at the record that, more than anything, ensured Phil Spector's place in popular music history -- a record that changed the lives of several people who heard it for the better, and changed the life of its singer for the worse, and one which has the most imitated drum intro in the world. We're going to look at \"Be My Baby\" by the Ronettes:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nBefore I start this one, two things need saying. The first is that this episode, by necessity, deals with spousal abuse. As always, I will try to discuss the issue with sensitivity, and touch on it as briefly as possible, but if you worry that it might upset you, please either skip this episode, or read the transcript to see if you'll be OK listening to it. I imagine that very few people will be upset by anything I say here, but it's always a possibility.\n\nAnd secondly, I'd like to apologise for this episode being so late. I had a major disruption in my personal life over Christmas -- one of those really bad life events that only happens once or twice in most people's lifetimes -- and that made it impossible for me to get any work done at all for the last couple of weeks. I'm now able to work again, and this should not be anything that affects the podcast for the rest of the year.\n\nAnyway, enough about that, let's get on with the story.\n\nThe story of the Ronettes begins when Ronnie Bennett, a mixed-race girl from Harlem, became obsessed with the sound of Frankie Lymon and the Teenagers:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\nRonnie became the Teenagers' biggest fan, and even managed to arrange a meeting between herself and Lymon when they were both thirteen, but had her illusions torn away when he turned up drunk and made a pass at her.\n\nBut that didn't stop her from trying her best to imitate Lymon's vocals, and forming a vocal group with several friends and relatives. That group had a male lead singer, but when they made their first appearance on one of the Harlem Apollo's talent shows, the lead singer got stage fright and couldn't start singing when he got on stage. Ronnie stepped forward and took over the lead vocal, and the group went down well enough even with the Apollo's notoriously hostile audience that a smaller group of them decided to start performing regularly together.\n\nThe group took the name Ronnie and the Relatives, and consisted of Ronnie, her sister Estelle, and their cousin Nedra Talley. They originally only performed at private parties, bar mitzvahs and the like, but they soon reached the attention of Stu Phillips at Colpix Records, a label owned by the film studio Columbia Pictures.\n\nThe first single by Ronnie and the Relatives was not a success -- \"I Want a Boy\" came out in August 1961 and didn't chart:\n\n[Excerpt: Ronnie and the Relatives, \"I Want a Boy\"]\n\nAnd nor did their second, \"I'm Gonna Quit While I'm Ahead\":\n\n[Excerpt: Ronnie and the Relatives, \"I'm Gonna Quit While I'm Ahead\"]\n\nThose records did apparently sell to at least one person, though, as when Ronnie met President Clinton in 1997, he asked her to sign a record, and specifically got her to sign an album of those early recordings for Colpix.\n\nWhile the girls were not having any commercial success, they did manage to accidentally get themselves a regular gig at the most important nightclub in New York. They went to the Peppermint Lounge, just as the Twist craze was at its height, and as they were underage they dressed up especially well in order to make themselves look more grown up so they could get in.\n\nTheir ruse worked better than they expected. As they were all dressed the same, the club's manager assumed they were the dancers he'd booked, who hadn't shown up. He came out and told them to get on stage and start dancing, and so of course they did what he said, and started dancing to the Twist sounds of Joey Dee and the Starliters:\n\n[Excerpt: Joey Dee and the Starliters, \"The Peppermint Twist\"]\n\nThe girls' dancing went down well, and then the band started playing \"What'd I Say?\", a favourite song of Ronnie's and one the group did in their own act, and Ronnie danced over to David Brigati, who was singing lead on the song, and started dancing close to him. He handed her the mic as a joke, and she took over the song. They got a regular spot at the Peppermint Lounge, dancing behind the Starliters for their whole show and joining them on vocals for a few numbers every night.\n\nInspired by the Bobbettes and the Marvelettes, Ronnie and Estelle's mother suggested changing the group's name. She suggested \"the Rondettes\", and they dropped the \"d\", becoming the Ronettes.\n\nThe singles they released on ColPix under the new name did no better than the others, but they were such an important part of the Peppermint Lounge that when the Lounge's owners opened a second venue in Florida, the girls went down there with the Starliters and were part of the show.\n\nThat trip to Florida gave them two very different experiences. The first was that they got to see segregation firsthand for the first time, and they didn't like it -- especially when they, as light-skinned mixed-race women, were read as tanned white women and served in restaurants which then refused to serve their darker-skinned mothers.\n\nBut the second was far more positive. They met Murray the K, who since Alan Freed had been driven out of his job had become the most popular DJ in New York. Murray was down in Florida for a holiday, and was impressed enough by the girls' dancing that he told them if they were ever in New York and wanted a spot on one of his regular shows at the Brooklyn Fox Theatre they should let him know. They replied that they lived in New York and went to those shows all the time -- of course they wanted to perform on his shows. They became regular performers at the Brooklyn Fox, where they danced between the other, bigger, acts, sang backing vocals, did a song or two themselves, and took part in comedy sketches with Murray.\n\nIt was at these shows, as well, that they developed the look they would become famous with -- huge hair piled up on top of their heads, tons of mascara, and tight skirts slit to show their legs. It was a style inspired by street fashion rather than by what the other girl groups were wearing, and it made them incredibly popular with the Fox audience.\n\nBut the Ronettes, even under their new name, and even with the backing of New York's most prominent DJ, were still not selling any records. They knew they were good, and the reaction to their stage performances proved as much, so they decided that the problem must be with Colpix. And so in 1963 they made a New Year's resolution -- they were going to get Phil Spector to produce them.\n\nBy this time, Spector was becoming very well known in the music industry as a hit maker. We already saw in the recent episode on the Crystals how he was making hits for that group and the Blossoms, but he was also making hits with studio groups like Bob B. Soxx and the Blue Jeans, who he took into the top ten with a remake of the old Disney song \"Zip-a-Dee-Doo-Dah\":\n\n[Excerpt: Bob B. Soxx and the Blue Jeans, \"Zip-a-Dee-Doo-Dah\"]\n\nand as well as the records he was putting out on Philles, he was also working as a freelance producer for people like Connie Francis, producing her top ten hit \"Second-Hand Love\":\n\n[Excerpt: Connie Francis, \"Second-Hand Love\"]\n\nSo the Ronettes were convinced that he could make them into the stars they knew they had the potential to be. The group had no idea how to get in touch with Spector, so they tried the direct route -- Estelle called directory enquiries, got the number for Philles Records, and called and asked to be put through to Spector. She was as astonished as anyone when he agreed to talk to her -- and it turned out that he'd seen the group regularly at the Brooklyn Fox and was interested in working with them.\n\nAt their audition for Spector, the group first performed a close-harmony version of \"When the Red Red Robin Goes Bob-Bob-Bobbin' Along\", which they'd been taught by their singing teacher. Spector told them that he wanted to hear what they did when they were singing for themselves, not for a teacher, and so Ronnie launched into \"Why Do Fools Fall In Love?\"\n\nIt only took her getting to the second line of the song before Spector yelled at her to stop -- \"THAT is the voice I've been looking for!\"\n\nThe Ronettes' first recordings for Spector weren't actually issued as by the Ronettes at all. To start with, he had them record a version of a song by the writing team of Jeff Barry and Ellie Greenwich, \"Why Don't They Let Us Fall In Love?\", but didn't release it at the time. It was later released as by \"Veronica\", the name under which he released solo records by Ronnie:\n\n[Excerpt: Veronica, \"Why Don't They Let Us Fall In Love?\"]\n\nBut at the time, when Ronnie asked him when the record was coming out, Spector answered \"Never\". He explained to her that it was a good record, but it wasn't a number one, and he was still working on their first number one record.\n\nTheir next few recordings were covers of then-current dance hits, like \"The Twist\":\n\n[Excerpt, \"The Crystals\", \"The Twist\"]\n\nAnd \"The Wah-Watusi\", one of the few times that one of the other Ronettes took the lead rather than Ronnie, as Nedra sang lead:\n\n[Excerpt, \"The Crystals\", \"The Wah-Watusi\"]\n\nBut these, and two other tracks, were released as album tracks on a Crystals album, credited to the Crystals rather than the Ronettes.\n\nThe song that eventually became the group's first hit, \"Be My Baby\", was mostly written by one of the many husband-and-wife songwriting teams that had developed at the Brill Building, Jeff Barry and Ellie Greenwich.\n\nBarry had started out as a performer who occasionally wrote, putting out records like \"It's Called Rock and Roll\":\n\n[Excerpt: Jeff Barry, \"It's Called Rock and Roll\"]\n\nBut while his performing career had gone nowhere, he'd started to have some success as a songwriter, writing \"Teenage Sonata\" for Sam Cooke:\n\n[Excerpt: Sam Cooke, \"Teenage Sonata\"]\n\nAnd \"Tell Laura I Love Her\", which was recorded by several people, but the biggest hit version was the American number one by Ray Peterson:\n\n[Excerpt: Ray Peterson, \"Tell Laura I Love Her\"]\n\nEllie Greenwich had also started as a performer, recording \"Silly Isn't It?\" under the name Ellie Gaye:\n\n[Excerpt: Ellie Gaye, \"Silly, Isn't It?\"]\n\nShe'd become one of the most important demo singers in New York, and had also started writing songs. She'd first collaborated with Doc Pomus, cowriting songs like \"This is It\", which had been a flop single for Jay and the Americans:\n\n[Excerpt: Jay and the Americans, \"This is It\"]\n\nShe'd then been taken on by Trio Music, Leiber and Stoller's company, where she had largely collaborated with another writer named Tony Powers. Trio had first refusal on anything the two of them wrote, and if Leiber and Stoller didn't like it, they could take the song elsewhere.\n\nGreenwich and Powers had their biggest successes with songs that Leiber and Stoller rejected, which they sold to Aaron Schroeder. And they'd started up a collaboration with Phil Spector -- although Spector and Greenwich's first meeting had not exactly gone smoothly. He'd gone into her office to hear her play a song that she thought would be suitable for the Paris Sisters, but had kept wandering out of the office, and had kept looking at himself in a mirror and primping himself rather than listen to her song. Eventually she said to him &nbsp;\"Listen to me, you little prick. Did you come to look at yourself or to hear my songs?\", and she didn't make that sale.\n\nBut later on, Spector became interested in a song she'd sold to Schroeder, and made an appointment to meet her and talk about her writing some stuff for him -- that second meeting, which Spector didn't realise was with someone he'd already made a bad impression on, Spector turned up four hours late. &nbsp;But despite that, Greenwich and Powers wrote several songs for Spector, who was also given songwriting credit, and which became big hits in versions he produced -- \"(Today I Met) The Boy I'm Gonna Marry\", a single by Darlene Love:\n\n[Excerpt: Darlene Love, \"(Today I Met) The Boy I'm Gonna Marry\"]\n\nAnd \"Why Do Lovers Break Each Others' Hearts?\", released as by Bob B. Soxx and the Blue Jeans, but with Love once again on lead vocals:\n\n[Excerpt: Bob B. Soxx and the Blue Jeans, \"Why Do Lovers Break Each Others' Hearts?\"]\n\nI say that Spector was also given songwriting credit on those records, because there is some debate about how much he contributed to the songs he's credited on. Some of his co-writers have said that he would often only change a word or a phrase, and get himself cut in on an already-completed song, while others have said that he contributed a reasonable amount to the songwriting, though he was never the primary writer -- for example Barry Mann has said that Spector came up with the middle section for \"You've Lost That Lovin' Feelin'\". I tend towards the belief that Spector's contribution to the writing on those songs he's co-credited on was minimal -- in his whole career, the number of songs he wrote on his own seems to be in the single figures, while those other writers wrote dozens of hit records without any contribution from Spector -- and so when I talk about records he produced I'll tend to use phrasing like \"a Goffin and King song co-credited to Phil Spector\" rather than \"a song by Goffin, King, and Spector\", but I don't want that to give the impression that I'm certain Spector made no contribution.\n\nBut while Greenwich and Powers were a mildly successful team, their partnership ended when Greenwich met Jeff Barry at a family Thanksgiving dinner -- Greenwich's uncle was Barry's cousin. As Greenwich later put it, when they started talking together about music and realised how much they had in common, \"I went 'ooh', he went 'mmmhh', and his wife went 'I don't think I like this'\". Soon their previous partnerships, both romantic and musical, were over, and Jeff Barry and Ellie Greenwich became the third of the great Brill Building husband-and-wife songwriting teams.\n\nWhere Goffin and King had a sophisticated edge to their writing, with a hint of sexual subversion and the mingling of pain and pleasure, and Mann and Weill tried to incorporate social comment into their songs, Barry and Greenwich were happy to be silly -- they were writing songs like \"Hanky Panky\", \"Da Doo Ron Ron\", &nbsp;and \"Doo Wah Diddy Diddy\":\n\n[Excerpt: Ellie Greenwich \"Doo Wah Diddy Diddy (demo)\"]\n\nThis worked extremely well for them, to the extent that after they broke up a few years later, Barry would continue this formula with songs such as \"Sugar Sugar\", \"Jingle Jangle\" and \"Bang Shang A Lang\".\n\nBarry and Greenwich's style was to jam in as many hooks as possible, maybe put in a joke or two, keep the lyrics simple, and get out in two minutes. Very few of their songs were masterpieces of songwriting, but they *were* absolutely perfect templates for masterpieces of production. It sounds like I'm damning them with faint praise, but I'm really not. There is a huge skill involved in what they were doing -- if you're writing some heartwrenching masterpiece about the human condition, people will forgive the odd lapse in craft, but if you're writing \"My baby does the hanky panky\", there's no margin for error, and you're not going to get forgiven if you mess it up.\n\nBarry and Greenwich were good enough at this that they became the go-to writers for Spector for the next couple of years. He would record songs by most of the Brill Building teams, but when you think of the classic records Spector produced, they're far more likely than not to be Barry and Greenwich songs -- of the twenty-seven Philles singles released after Barry and Greenwich started writing together, fourteen are credited to Barry/Greenwich/Spector, and other than the joke release \"Let's Dance the Screw\", which we talked about back in the episode on the Crystals, there's a run of eleven singles released on the label between late 1962 and early 1964 which are credited either as Greenwich/Powers/Spector or Barry/Greenwich/Spector.\n\nAnd so it was naturally to Barry and Greenwich that Spector turned to write the first big hit for the Ronettes -- and he let Ronnie hear the writing session. By this time, Spector had become romantically involved with Ronnie, and he invited her into his apartment to sit in the next room and listen to them working on the song -- usually they got together in hotels rather than at Spector's home. While she was there, she found several pairs of women's shoes -- Spector hadn't told her he was married, and claimed to her when she asked that they belonged to his sister. This should probably have been a sign of things to come.\n\nAssuming that Spector did contribute to the writing, I think it's easy to tell what he brought to “Be My Baby”. If you listen to that Connie Francis record I excerpted earlier, on which Spector is also a credited co-writer, the melody line for the line “that you don't feel the same” leading into the chorus:\n\n[Excerpt: Connie Francis, “Second-Hand Love”]\n\nis identical to the melody line leading into the chorus of “Be My Baby”:\n\n[Excerpt: The Ronettes, “Be My Baby”]\n\nSo that transition between the verse and the chorus is likely his work.\n\nAfter rehearsing Ronnie for several weeks in New York, Spector flew her out to LA to make the record in Gold Star Studios, where she spent three days recording the lead vocals. The backing vocals weren't provided by the other Ronettes, but rather by the Blossoms, with a few extra singers -- notably Spector's assistant Sonny Bono, and his new girlfriend Cher -- but what really made the track was not the vocals -- although the song was perfect for Ronnie -- but Hal Blaine's drum intro:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nThat intro was utterly simple -- Blaine was always a minimalist player, someone who would play for the song rather than play fussy fills -- but that simple part, combined with the powerful sound that the engineer Larry Levine got, was enough to make it one of the most memorable intros in rock music history. Brian Wilson of the Beach Boys talks to this day about how he had to pull over to the side of the road when he first heard it on his car radio, and he would listen to the record incessantly for hours at a time.\n\nIncidentally, since I'm talking about the musicians, a lot of sources credit Carol Kaye for playing the bass on this track, so I'm going to say something once, here, which should be taken as read whenever I'm talking about records made in LA in the sixties -- Carol Kaye is not only an unreliable source about what records she played on, she is an utterly dishonest one. For those who don't know, Ms. Kaye was one of the great bass players of the sixties, and also one of the better session guitarists. She played on hundreds of records in the sixties, including many, many, classics from the Beach Boys, Spector, Frank Zappa, and others, and she was the only woman getting regular session work in LA on a rock instrument -- there may have been session orchestral musicians who were women, but when it comes to guitar, bass, drums, keyboards, sax, and so on, she was the only one. For that, she deserves a huge amount of credit.\n\nUnfortunately, she has never been happy only being credited for the records she actually played on, and insists she played on many, many, more. Some of this can be reasonably put down to lapses in memory more than fifty years later -- if you're playing two or three sessions a day, and you play on a bunch of Beach Boys records, then it's easy enough to misremember having played on \"Surfin' USA\" when maybe you played on a similar-sounding record, and there are things like her claiming to have played on \"Good Vibrations\", where there were multiple sessions for that track, and it happened that the takes eventually used weren't the ones where she was playing bass, but she had no way of knowing that. That's completely forgivable.\n\nBut Ms. Kaye also claims, with no evidence whatsoever on her side and a great deal of evidence against her, to have been responsible for playing almost the entire recorded works of James Jamerson, Motown's main bass player, claiming tapes were secretly shipped from Detroit to LA -- something that has been denied by every single person working at Motown, and which can be easily disproved just by listening to the tapes. She claims to have played the bass on \"I'm a Believer\" by the Monkees -- a track recorded in New York, by New York musicians. And whenever anyone points out the falsehoods, rather than saying \"I may have made a mistake\" she hurls abuse at them, and in some cases libels them on her website.\n\nSo, Carol Kaye did not play on this record, and we know that because we have the AFM session sheets, which show that the bass players on the track were Ray Pohlman and Jimmy Bond. I'll link a PDF of that sheet in the show notes. So in future, when I mention someone other than Carol Kaye playing on a song, and Wikipedia or somewhere says she played on it, bear this in mind.\n\nTwo people who did play on the record were Bill Pitman and Tommy Tedesco, and this is why the B-side, an instrumental, is named \"Tedesco and Pitman\". Spector was enough of a control freak that he didn't want DJs ever to play the wrong side of his singles, so he stuck instrumental jam sessions by the studio musicians -- with the songwriting credited to him rather than to them -- on the B-sides.\n\nI don't know about you, but I actually quite like \"Tedesco and Pitman\", but then I've always had a soft spot for the vibraphone:\n\n[Excerpt: \"The Ronettes\" (The Wrecking Crew), Tedesco and Pitman\"]\n\n\"Be My Baby\" was a massive hit -- it went to number one on the Cashbox chart, though only number two on the Billboard chart, and sold millions of copies.\n\nThe group were invited on to Dick Clark's Caravan of Stars tour, but Spector wanted Ronnie to be in California to record the follow-up, so the girls' cousin Elaine filled in for her for the first couple of weeks of the tour, while Ronnie recorded another Barry, Greenwich and Spector song, \"Baby I Love You\":\n\n[Excerpt: The Ronettes, \"Baby I Love You\"]\n\nRonnie didn't realise it at the time, but Spector was trying to isolate her from the other group members, and from her family. But at first this seemed to her like a sensible way of solving the problem, and she rejoined the tour after the record was made.\n\nSoon after this, the group travelled to the UK for a brief tour in early 1964, during which they became friendly with the Beatles -- Ronnie had a brief chaste flirtation with John Lennon, and Estelle something a little more with George Harrison. They also got to know their support act on the tour, the Rolling Stones -- at least once Ronnie had had a row with Andrew Loog Oldham, as Spector had sent a telegram forbidding the Rolling Stones from spending time with the Ronettes. Once Ronnie pointed out that they were there and Spector wasn't, the two groups became very friendly -- and more than friendly, if Keith Richards' autobiography is to be believed.\n\nOn their return to the US, they continued having hits through 1964 -- nothing was as big as \"Be My Baby\", but they had three more top forty hits that year, with two mediocre records, \"The Best Part of Breaking Up\" and \"Do I Love You?\", co-written by the team of Pete Andreoli and Vini Poncia, and then a return to form with the magnificent \"Walking in the Rain\", written by Barry Mann and Cynthia Weill:\n\n[Excerpt: The Ronettes Featuring Veronica, \"Walking in the Rain\"]\n\nBut Spector was becoming more and more erratic in his personal life, and more and more controlling. I won't go into too many details here, because we're going to see a lot more of Phil Spector over the next year or so, but he recorded many great records with the Ronettes which he refused to release, claiming they weren't quite right -- Ronnie has later realised that he was probably trying to sabotage their career so he could have her all to himself, though at the time she didn't know that. Neither of the two singles they did release in 1965 made the top fifty, and the one single they released in 1966, a return to songs by Barry and Greenwich, only made number one hundred, for one week:\n\n[Excerpt: The Ronettes, \"I Can Hear Music\"]\n\nAlso in 1966, the Ronettes were invited by the Beatles to be their support act on their last ever tour, but once again Spector insisted that Ronnie couldn't go, because she needed to be in the studio, so Elaine substituted for her again, much to the Beatles' disappointment. Nothing from the studio sessions during that tour was released.\n\nThe group broke up in 1967, and the next year Ronnie married Phil Spector, who became ever more controlling and abusive. I won't go into details of the way he treated her, which you can read all about in her autobiography, but suffice to say that I was completely unsurprised when he murdered a woman in 2003. You'll probably get some idea of his behaviours when I talk about him in future episodes, but what Ronnie suffered in the years they were together was something no-one should have to go through.\n\nBy the time she managed to leave him, in June 1972, she had only released one track in years, a song that George Harrison had written for her called \"Try Some, Buy Some\", which Spector had recorded with her at Harrison's insistence, during a period when Spector was working with several of the ex-Beatles and trying to rebuild his own career on the back of them:\n\n[Excerpt: Ronnie Spector, \"Try Some, Buy Some\"]\n\nNeither Ronnie nor Spector were particularly keen on the track, and it was a commercial flop -- although John Lennon later said that the track had inspired his \"Happy Xmas (War is Over)\".\n\nRonnie eventually escaped from Spector's abuse -- leaving the house barefoot, as Spector had stolen her shoes so she couldn't leave -- and started to build a new life for herself, though she would struggle with alcoholism for many years. She got nothing in their divorce settlement, as Spector threatened to hire a hit man to kill her if she tried to get anything from him, and she made a living by touring the nostalgia circuit with various new lineups of Ronettes -- the others having given up on their music careers -- and while she never had another hit, she did have a recording career.\n\nHer solo career got its proper start because of a chance meeting in New York. Her old friend John Lennon saw her on the street and called her over for a chat, and introduced her to the friend he was with, Jimmy Iovine, who was producing an album for Southside Johnny and the Asbury Dukes. Bruce Springsteen had written a song for that band, and Iovine thought it might work well as a duet with Ronnie, and he invited her to the studio that day, and she cut the song with them:\n\n[Excerpt: Southside Johnny and the Asbury Dukes, \"You Mean So Much To Me\"]\n\nThat song became one of the most popular songs on the album, and so when the Asbury Dukes toured supporting Bruce Springsteen and the E-Street Band, they brought Ronnie along with them to sing on that song and do a couple of her own hits. That led to the E-Street Band themselves backing Ronnie on a single -- a version of Billy Joel's \"Say Goodbye to Hollywood\", a song that Joel had written with her in mind:\n\n[Excerpt: Ronnie Spector and the E-Street Band, \"Say Goodbye to Hollywood\"]\n\nHowever, that was a flop, and so were all her later attempts to have comebacks, though she worked with some great musicians over the years. But she was able to continue having a career as a performer, even if she never returned to stardom, and she never made much money from her hits. She did, though, sing on one more top-ten hit, singing backing vocals on Eddie Money's \"Take Me Home Tonight\":\n\n[Excerpt: Eddie Money, \"Take Me Home Tonight\"]\n\nPhil Spector continued to earn money from his ex-wife for a long time after their divorce. By 1998, when the Ronettes finally sued Spector for unpaid royalties, they had earned, between them, a total of $14,482.30 in royalties from all their hit records -- the amount that came from a single 1964 royalty payment. In court, Spector argued that he didn't owe them any more, and indeed that *they* still owed *him* money, because the cost of recording their singles meant that they had never actually earned more money than they cost. Eventually, after a series of appeals, the group members each got about half a million dollars in 2002 -- obviously a great deal of money, but a small fraction of what they actually earned.\n\nSpector, who was on the board of the Rock and Roll Hall of Fame, prevented the Ronettes from being inducted out of spite towards his ex until he was imprisoned, at which point they were finally recognised, in 2007.\n\nRonnie continues to perform, and seems to have a happy life. Estelle, sadly, did not -- she suffered from anorexia and schizophrenia, spent a period of time homeless, and died in 2009. Nedra became a born-again Christian shortly after the group split up, and recorded a couple of unsuccessful albums of Christian music in the seventies, before going off to work in real estate. In September last year, it was announced that a film is going to be made of Ronnie Spector's life story. &nbsp;It's nice to know that there'll be something out there telling her story with her as the protagonist, rather than as a background character in the story of her abusive husband.",
  "enclosure": "",
  "itunes:summary": "Episode 110 of A History of Rock Music in Five Hundred Songs looks at \"Be My Baby\", and at the career of the Ronettes and Ronnie Spector.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Little Saint Nick\" by the Beach Boys.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nErratum\n\nI say Ray Peterson's version of \"Tell Laura I Love Her\" was an American number one. It wasn't -- it only made number seven.\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\nBe My Baby: How I Survived Mascara Miniskirts and Madness, or My Life as a Fabulous Ronette by Ronnie Spector and Vince Waldron is Ronnie's autobiography and was the main source.\n\nAlways Magic in the Air: The Bomp and Brilliance of the Brill Building Era by Ken Emerson is a good overview of the Brill Building scene, and provided me with the information on Barry and Greenwich.\n\nI've referred to two biographies of Spector in this episode,&nbsp;Phil Spector: Out of His Head&nbsp;by Richard Williams&nbsp;and&nbsp;He's a Rebel&nbsp;by Mark Ribkowsky.\n\nAnd information on the Wrecking Crew largely comes from&nbsp;The Wrecking Crew&nbsp;by Kent Hartman.\n\nThere are many compilations available with some of the hits Spector produced, but I recommend getting&nbsp;Back to Mono, a four-CD overview of his career containing all the major singles put out by Philles.\n\nIf you want something just covering Ronnie Spector and the Ronettes,&nbsp;The Very Best of Ronnie Spector&nbsp; covers all the Ronettes hits and the best of her solo career.\n\nAnd the AFM contract listing the musicians on \"Be My Baby\" can be found here.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to take a look at the record that, more than anything, ensured Phil Spector's place in popular music history -- a record that changed the lives of several people who heard it for the better, and changed the life of its singer for the worse, and one which has the most imitated drum intro in the world. We're going to look at \"Be My Baby\" by the Ronettes:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nBefore I start this one, two things need saying. The first is that this episode, by necessity, deals with spousal abuse. As always, I will try to discuss the issue with sensitivity, and touch on it as briefly as possible, but if you worry that it might upset you, please either skip this episode, or read the transcript to see if you'll be OK listening to it. I imagine that very few people will be upset by anything I say here, but it's always a possibility.\n\nAnd secondly, I'd like to apologise for this episode being so late. I had a major disruption in my personal life over Christmas -- one of those really bad life events that only happens once or twice in most people's lifetimes -- and that made it impossible for me to get any work done at all for the last couple of weeks. I'm now able to work again, and this should not be anything that affects the podcast for the rest of the year.\n\nAnyway, enough about that, let's get on with the story.\n\nThe story of the Ronettes begins when Ronnie Bennett, a mixed-race girl from Harlem, became obsessed with the sound of Frankie Lymon and the Teenagers:\n\n[Excerpt: Frankie Lymon and the Teenagers, \"Why Do Fools Fall In Love?\"]\n\nRonnie became the Teenagers' biggest fan, and even managed to arrange a meeting between herself and Lymon when they were both thirteen, but had her illusions torn away when he turned up drunk and made a pass at her.\n\nBut that didn't stop her from trying her best to imit",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 110 of A History of Rock Music in Five Hundred Songs looks at \"Be My Baby\", and at the career of the Ronettes and Ronnie Spector.&nbsp; Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Little Saint Nick\" by the Beach Boys.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\nErratum\n\nI say Ray Peterson's version of \"Tell Laura I Love Her\" was an American number one. It wasn't -- it only made number seven.\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nA lot of resources were used for this episode.\n\nBe My Baby: How I Survived Mascara Miniskirts and Madness, or My Life as a Fabulous Ronette by Ronni",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}