{
  "title": "Turbulent diffusion of streaming cosmic rays in compressible, partially ionised plasma. (arXiv:2205.08174v2 [astro-ph.GA] UPDATED)",
  "link": "http://arxiv.org/abs/2205.08174",
  "description": "<p>Cosmic rays (CRs) are a dynamically important component of the interstellar\nmedium (ISM) of galaxies. The $\\sim$GeV CRs that carry most CR energy and\npressure are likely confined by self-generated turbulence, leading them to\nstream along magnetic field lines at the ion Alfv\\'en speed. However, the\nconsequences of self-confinement for CR propagation on galaxy scales remain\nhighly uncertain. In this paper, we use a large ensemble of\nmagnetohydrodynamical turbulence simulations to quantify how the basic\nparameters describing ISM turbulence -- the sonic Mach number, $\\mathcal{M}$\n(plasma compressibility), Alfv\\'en Mach number, $\\mathcal{M}_{A0}$ (strength of\nthe large-scale field with respect to the turbulence), and ionisation fraction\nby mass, $\\chi$ -- affect the transport of streaming CRs. We show that the\nlarge-scale transport of CRs whose small-scale motion consists of streaming\nalong field lines is well described as a combination of streaming along the\nmean field and superdiffusion both along (parallel to) and across\n(perpendicular to) it; $\\mathcal{M}_{A0}$ drives the level of anisotropy\nbetween parallel and perpendicular diffusion and $\\chi$ modulates the magnitude\nof the diffusion coefficients, while in our choice of units, $\\mathcal{M}$ is\nunimportant except in the sub-Alfv\\'enic ($\\mathcal{M}_{A0} \\lesssim 0.5$)\nregime. Our finding that superdiffusion is ubiquitous potentially explains the\napparent discrepancy between CR diffusion coefficients inferred from\nmeasurements close to individual sources compared to those measured on larger,\nGalactic scales. Finally, we present empirical fits for the diffusion\ncoefficients as a function of plasma parameters that may be used as sub-grid\nrecipes for global interstellar medium, galaxy or cosmological simulations.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Sampson_M/0/1/0/all/0/1\">Matt L. Sampson</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Beattie_J/0/1/0/all/0/1\">James R. Beattie</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Krumholz_M/0/1/0/all/0/1\">Mark R. Krumholz</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Crocker_R/0/1/0/all/0/1\">Roland M. Crocker</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Federrath_C/0/1/0/all/0/1\">Christoph Federrath</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Seta_A/0/1/0/all/0/1\">Amit Seta</a>"
}