{
  "title": "Episode 40: &#8220;Drugstore Rock &#8216;n&#8217; Roll&#8221; by Janis Martin",
  "link": "https://500songs.com/podcast/episode-40-drugstore-rock-n-roll-by-janis-martin/",
  "pubDate": "Sun, 07 Jul 2019 22:21:17 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-40-drugstore-rock-n-roll-by-janis-martin/",
  "description": "Episode forty of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Drugstore Rock 'n' Roll\", by Janis Martin, an early rockabilly classic by the woman known as \"the Female Elvis\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28207633\">on \"Fever\" by Little Willie John</a>\n\n\n\nA brief apology before I go any further. There is no Mixcloud this week, and also I've only done one edit pass, rather than my customary two, on the podcast sound file, so there might be some noises and so on that would otherwise not be on there, and the sound quality may not be as good as normal. A close family member has had a severe medical emergency this weekend, and I haven't been able to put in the time I normally would. Normal service should be resumed next week, and I hope this is at least adequate.\n\n<strong>Resources</strong>\n\nThere is very little information out there about Janis Martin. Much of this was stitched together from brief mentions in books on other people, and from ten minutes' worth of interview in an out-of-print documentary called <em><a href=\"https://amzn.to/2Jt5Jen\">Welcome to the Club: The Women of Rockabilly</a>. </em>\n\nThe single most important source here was the liner notes for the<a href=\"https://amzn.to/2LJRR2b\"> Bear Family CD collecting all Janis' fifties recordings</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\nSometimes a novelty act will have real talent, and sometimes the things that can bring you the most success initially can be the very things that stop you from building a career. In the case of Janis Martin, \"the female Elvis Presley\", those four words were the reason she became successful, and some say they are also the reason she very quickly dropped into obscurity. There are no books about Janis Martin, who as far as I can tell was the first successful female rockabilly artist. There are no films about her. There are just a handful of articles in obscure fanzines, and pages on unvisited websites, to mark the story of a true pioneer of rockabilly music.\n\nBut I don't think that the way Janis Martin's career stalled was down to that label at all. I think it stalled because of misogyny, plain and simple, and I'm going to explain why in this episode. So a warning right now -- this will deal in passing with abortion and underage marriage. If you are likely to find anything dealing with those things traumatising, please check out the transcript on the podcast website at 500songs.com, to make sure it's something you're comfortable hearing. I won't be going into those things in any great detail, but sometimes better safe than sorry.\n\nJanis Martin was born in 1940, and spent her early years as a child country and western act. She started playing the guitar when she was only four, holding it upright because she wasn't big enough yet to play it normally, and by the age of eleven she was a regular on The Old Dominion Barn Dance. This was at a time when the dominant force in country and western music was a series of live variety shows that would be broadcast by different radio stations, and there was a definite hierarchy there. At the very top of the chain was the Grand Ole Opry, whose performers like Roy Acuff would absolutely dominate the whole medium of country music. If you were on the Opry, you were going to be a big star, and you would be heard by everyone. You'd made it.\n\nSlightly lower than the Opry were shows like the Louisiana Hayride. The Hayride was for those who were on their way up or on their way down. Elvis Presley got a residency on the show when he went down too badly on the Opry for them to book him again, and Hank Williams started performing on it when he was dropped by the Opry for drunkenness, but it also booked acts who weren't quite well known enough to secure a spot on the Opry, people who were still building their names up.\n\nAnd then, a rung below the Hayride, were shows like the Old Dominion Barn Dance. The Barn Dance had some big name acts -- the Carter Family, Flatt and Scruggs, Joe Maphis -- these weren't small-time no-namers by any means. But it wasn't as big as the Hayride.\n\nYoung Janis Martin was a country singer, pushed into the role by her domineering mother. But she wasn't massively interested in country music. She liked the honky-tonk stuff -- she liked Hank Williams, \"Because he had a little rock to his music\":\n\n[Excerpt: Hank Williams, \"Honky Tonkin'\"]\n\nBut she didn't like bluegrass, and she was starting to get bored with the slow country ballads that dominated the pop part of the country field. But luckily, the further down the rungs you got, the more experimental the hillbilly shows could be, and the more they could deviate from the straight formula insisted on by the shows at the top. Shows like the Opry, while wildly popular, were also extraordinarily conservative. The Barn Dance allowed people to try things that were a little different.\n\nJanis Martin was a little different. She changed her whole style with one twist of a radio dial, when she was thirteen. She was going through the radio stations trying to find something she liked, when she hit on a station that was playing \"Mama, He Treats Your Daughter Mean\" by Ruth Brown:\n\n[Excerpt: Ruth Brown, \"Mama, He Treats Your Daughter Mean\"]\n\nShe immediately decided that that was what she wanted to be singing -- \"black R&B\", as she would always put it, not country music. She immediately incorporated \"Mama, He Treats Your Daughter Mean\" into her set, and started adding a lot of similar songs -- not just Ruth Brown songs, though Brown would always remain her very favourite, but songs by LaVern Baker and Dinah Washington as well.\n\nThis was not normal, even for the small number of country musicians who were playing R&B songs. Generally, the few who did that were performing music originally recorded by male jump band artists like Louis Jordan or Big Joe Turner. The songs Brown, Baker, and Washington recorded were all closer to jazz than to country music, and it's actually quite hard for me to imagine how one could perform \"Mama He Treats Your Daughter Mean\" with country instrumentation.\n\nBut this was what Janis Martin was doing, and it went down well with the Old Dominion Barn Dance audience. What worried some of them was another change that went along with this -- she started performing in a manner that they interpreted as overtly sexual. At thirteen and fourteen years old, she was dancing on the stage in a way that was often compared to Elvis Presley -- someone she'd never heard of at the time, and wasn't that impressed by when she did. She preferred Carl Perkins. She wasn't intending to be vulgar or sexual -- it just made no sense to her *not* to dance while she was singing uptempo R&B-style songs.\n\nAs she later said, \"When I was a little girl doing all those rock 'n' roll moves on the barndances, people thought it was cute. But then, when I was fifteen or sixteen, and wearing a ponytail, and out there moving like Elvis, a lot of people thought it was vulgar.\"\n\nBut, at the time, the crowds at the Barndance shows were still happy to hear this music, however different it was from the country music they were used to.\n\nMartin's big break came when two staff announcers on WRVA, the station that hosted the barndance, Carl Stutz and Carl Barefoot, brought her a song they'd written, \"Will You, Willyum?\":\n\n[Excerpt: Janis Martin, \"Will You, Willyum?\"]\n\nThe song itself was not hugely impressive -- it's a standard boogie rhythm country song, and like many second-rate songs of the time it tries to get itself a little second-hand excitement by namechecking another song -- in this case, it references dancing with Henry, a reference to \"the Wallflower\". But Martin's demo of the song was enough to catch the ear of Steve Sholes, the A&R man who had signed Elvis a few months earlier, and so in March 1956, aged just fifteen, Janis Martin was signed to RCA Records, one of the biggest labels in the country.\n\nSholes wanted to record \"Will You Willyum?\" as her first single, but had also suggested that she try writing songs herself. Her very first attempt at writing a song took her, by her own accounts, ten or fifteen minutes to write, and ended up as the B-side. It was \"Drugstore Rock 'n' Roll\":\n\n[Excerpt: Janis Martin, \"Drugstore Rock 'n' Roll\"]\n\nNow, this actually marks something of a turning point in our story, though it may not seem it. Up to this point, the music we've looked at broadly falls into three categories -- R&B and jump band music made by and for black adults, white country musicians imitating that jump band music and generally aiming it at a younger audience, and doo-wop music made by and for black teenagers.\n\n\"Drugstore Rock 'n' Roll\" is the first record we've looked at -- and one of the first records ever made -- to deal specifically with the experience of the white teenagers who were now the music's biggest audience, and deal with it from their own perspective. This is where the 1950s of the popular imagination -- letter sweaters, crewcuts, ponytails, big skirts, dancing to the jukebox, drinking a malt with two straws, the 1950s of \"Happy Days\" and \"American Graffiti\" and Archie Comics, all starts.\n\nNow, in this, we have to consider that the micro and the macro are telling us rather different things, and that both parts of the picture are true. On the one hand, we have a teenage girl, writing her first ever song, talking about her own experiences and doing so in a musical idiom that she loves. On the other hand, we have a massive corporate conglomerate taking musical styles created by marginalised groups, removing those elements that made them distinctive to those groups, and marketing them at a more affluent, privileged, audience.\n\nBoth these things were happening at the same time -- and we'll see, as we look at the next few years of rock and roll history, how an influx of well-meaning -- and often great -- individual white artists making music they truly believed in, and with no racist motives as individuals (indeed many of them were committed anti-racists), would still, in aggregate, turn rock and roll from a music that was dominated by black artists and created for a primarily black audience, into one that was created by and for privileged white teenagers.\n\nOver the next few years the most popular artists in rock and roll music would go from being black men singing about gay sex and poor white sharecroppers singing about drinking liquor from an old fruit jar to being perky teenagers singing about sock hops and going steady, and Janis Martin was an early example of this. But she was still, ultimately, too individual for the system to cope with.\n\nGiven that she supposedly moved like Elvis (I say \"supposedly\" because I haven't been able to find any footage of her to confirm this) and had had a similar career path, RCA decided to market her as \"the Female Elvis\". They got the permission of Elvis and the Colonel to do so, though Martin only ever met Elvis twice, and barely exchanged a couple of words with him when she did.\n\nThey also got in some of the same people who performed on Elvis' records. While Elvis' own musicians weren't available, Chet Atkins, who also produced Janis' sessions, and Floyd Cramer were both on most of Janis' early recordings, and came up with a very similar sound to the Elvis records, and on at least some of her records the Jordanaires provided backing vocals, as they did for Elvis.\n\nThe first single, \"Will You Willyum\" backed with \"Drugstore Rock 'n' Roll\" was a hit, and went to number thirty-five in the pop charts. It sold three quarters of a million copies, and led to performances on most of the big TV shows, as well as on the Grand Ole Opry. But the follow-up, \"Ooby Dooby\" (a cover of a song we'll be dealing with in a future episode) didn't do quite so well. So for her third single they tried to lean into the Elvis comparisons with... a song about Elvis:\n\n[Excerpt: \"My Boy Elvis\", Janis Martin]\n\nShe wasn't particularly keen on the song, but she had no control over the material she was given -- back then, artists on major labels made the records they were told to make, and that was the end of it.\n\n\"My Boy Elvis\" was, in fact, only one of a large number of novelty records about Elvis that hit in 1956. Novelty records were a huge part of the music industry in the 1950s and 60s, and there would not be a trend that would go by without a dozen people putting out records of one kind or another about the trend. And given that Elvis' rise to stardom was the biggest cultural phenomenon the world had ever seen, it's not surprising that a few record company owners figured that if the kids were interested in buying records by Elvis, they might be tricked into buying records about Elvis too.\n\nA typical example of the form was \"I Want Elvis For Christmas\":\n\n[Excerpt: The Holly Sisters, \"I Want Elvis For Christmas\"]\n\nThat song was written by two aspiring songwriters -- Don Kirshner, who would later become one of the most important music publishing executives in the world, and a young man named Walden Cassoto, who would soon change his name to Bobby Darin. The person impersonating Elvis was a country singer called Eddie Cochran, who we'll be hearing a lot more about soon.\n\nSo these novelty records were being released left and right, but very few of them had any success. And Martin's record was no exception. Not only that, the teenage girl audience who were Elvis' biggest fanbase started to resent the marketing -- which she hadn't chosen herself -- comparing her to Elvis. They were in love with Elvis, and didn't like the comparison.\n\nJanis was selling records, but not quite at the level RCA initially hoped – they were having trouble building her audience. That was because in 1956, unlike even a year or so later, record labels had no idea what to do with white rock and roll acts aimed at the teen crowd. There were Bill Haley and Elvis, who were in a league of their own, and there were the Sun Records artists who could be packaged together on tours and play to the same crowds.\n\nBut other than that, rock and roll acts played the chitlin circuit, and that was black acts for black audiences.\n\nThere was a possible solution to this problem -- Elvis. Colonel Parker, Elvis' manager, was a close associate of Steve Sholes, and believed Sholes when he told Parker that Janis Martin was going places. He wanted to sign Janis to a management contract and promote Elvis and Janis as a double-bill, thinking that having a male-female act would be a good gimmick.\n\nBut her parents thought this was a bad idea. Just before she had been signed to RCA, Elvis had very publicly collapsed and been hospitalised with exhaustion through overwork. For all that Martin's mother was a pushy stage mother, she didn't want that for her daughter, and so the Colonel never got to sign Janis, and Janis never got to tour and play to Elvis' audience.\n\nSo since she had come up through the country music scene, and had been signed by RCA's country department, she was put on bills with other RCA country artists like Hank Snow, who made music like this:\n\n[Excerpt: Hank Snow, \"Wedding Bells\"]\n\nUnderstandably, Martin's rock and roll style didn't really fit on the bills, and the audiences were unimpressed. No-one in RCA or her promotional team knew how to deal with a rock and roll star who wasn't the most massive thing on the charts -- there was not, yet, anywhere to put a mid-range rock and roll star.\n\nBut she continued plugging away, making rockabilly records, and slowly building up a fanbase for herself. She even had a screen test with MGM, the film studio that had signed Elvis up so successfully.\n\nBut she had a problem, and one that would eventually cause the end of her career. A few months before she was signed to RCA, she had got married.\n\nThis is less odd than it might now sound. In the southern US in the 1950s, it was perfectly normal for people to get married in their early or mid teens. We will see a few more stories as the series goes on where people have married far, far, too young -- in some cases, because of abuse by an older man, in other cases just because teenage hormones had convinced them that they were definitely mature enough, no matter what those old people said. In this case, she had eloped with a paratrooper, who was stationed in Germany soon after. She only told her parents about the marriage once her husband had left the country.\n\nSo everything was fine -- while she might have been technically married, it wasn't like she was even on the same continent as her husband, so for all practical purposes it was exactly as if she was the single, sweet, innocent teenage girl that RCA wanted people to think she was. And she didn't see the need to tell RCA any different. What they didn't know couldn't hurt them.\n\nAnd that was all fine, until her 1957 European tour. As she was going to be in Europe anyway, her husband asked for a leave of absence and spent thirty days travelling around with her. And when she got back to the US, she was pregnant.\n\nWhen she informed RCA, they were furious. They couldn't have their seventeen-year-old nation's sweetheart going around being visibly pregnant -- even though one of the songs they'd chosen for her to record at her first session, \"Let's Elope Baby\", had described her actual experiences rather better than they'd realised:\n\n[Excerpt: Janis Martin, \"Let's Elope Baby\"]\n\nAnd so they came up with what they thought was the obvious solution -- they tried to persuade her to get an abortion, although that was still illegal in the US at the time. She refused, and the label dropped her.\n\nShe started recording for a small label -- she turned down offers from King and Decca records, and instead went with the tiny Belgian label Palette -- but she never had any success, and soon split from her husband. By 1960, aged twenty, she was on to her second marriage.\n\nHer second husband toured with her for a while, but soon told her that if she wanted to stay with him, she would have to give up on the music industry. For the next thirteen years, while she was married to him, she did just that, and her career was over.\n\nBut then, after her second marriage ended, she put together a band, Janis Martin and the Variations, and started playing gigs again. And the woman whose entire life had been controlled by other people -- first her mother, then her record label, then her husband -- found she liked performing again. She didn't return to full-time music, at least at first -- she held down a day job as the assistant manager of a country club in Virginia -- but she found that she still had fans, especially in Europe. In the late seventies Bear Family Records, a German reissue label that specialises in doing comprehensive catalogue releases by 50s country and rock and roll artists, had put out two vinyl albums collecting everything she'd released in the fifties (and this was later put together as a single-CD set, one of their first CD releases, in the mid-eighties), and she'd become known to a new generation of rockabilly fans in Europe, as well as building up a new small fanbase in the USA. So in 1982, she travelled to Europe for the first time since that 1957 tour, and started performing for audiences who, more than anything else, wanted to hear her own song, \"Drugstore Rock 'n' Roll\".\n\nFor the last few decades of her life, Janis Martin would regularly tour, even though she hated flying, because she felt she owed it to the fans to let them see her perform. Her son played drums with her band, and audiences would regularly thrill to Janis, as this woman who was now a great-grandmother and looked like any other great-grandmother from Virginia, sang her songs of teenage rebellion. Her third marriage, in 1977, was to a man who had been a fan of hers during her first career, and lasted the rest of her life. She was finally happy.\n\nAnd in 2006 she recorded what was intended to be a comeback album, and she was finally able to fulfil a lifetime ambition, and perform with Ruth Brown, singing the song that changed everything for her when she'd heard it more than fifty years earlier:\n\n[Excerpt: Ruth Brown and Janis Martin, \"Mama, He Treats Your Daughter Mean\"]\n\nThat was the first and only time Janis Martin and Ruth Brown would meet and perform together. Ruth Brown died in late 2006, and Janis' son died in early 2007. Janis herself died of cancer in September 2007, having outlived the man with whom she had been compared in her teens by more than thirty years, and having lived to see her work embraced by new generations. There are much worse lives for an Elvis to have had.",
  "itunes:subtitle": "Episode forty of A History of Rock Music in Five Hundred Songs looks at Drugstore Rock n Roll, by Janis Martin, an early rockabilly classic by the woman known as the Female Elvis. Click the full post to read liner notes, links to more information, and a ",
  "itunes:keywords": "Chet Atkins,country and western,Don Kirshner,Elvis Presley,Floyd Cramer,Janis Martin,racism,RCA Records,rockabilly,Ruth Brown,Steve Sholes,The Jordanaires,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 40,
  "content:encoded": "Episode forty of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Drugstore Rock 'n' Roll\", by Janis Martin, an early rockabilly classic by the woman known as \"the Female Elvis\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28207633\">on \"Fever\" by Little Willie John</a>\n\n\n\nA brief apology before I go any further. There is no Mixcloud this week, and also I've only done one edit pass, rather than my customary two, on the podcast sound file, so there might be some noises and so on that would otherwise not be on there, and the sound quality may not be as good as normal. A close family member has had a severe medical emergency this weekend, and I haven't been able to put in the time I normally would. Normal service should be resumed next week, and I hope this is at least adequate.\n\n<strong>Resources</strong>\n\nThere is very little information out there about Janis Martin. Much of this was stitched together from brief mentions in books on other people, and from ten minutes' worth of interview in an out-of-print documentary called <em><a href=\"https://amzn.to/2Jt5Jen\">Welcome to the Club: The Women of Rockabilly</a>. </em>\n\nThe single most important source here was the liner notes for the<a href=\"https://amzn.to/2LJRR2b\"> Bear Family CD collecting all Janis' fifties recordings</a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\nSometimes a novelty act will have real talent, and sometimes the things that can bring you the most success initially can be the very things that stop you from building a career. In the case of Janis Martin, \"the female Elvis Presley\", those four words were the reason she became successful, and some say they are also the reason she very quickly dropped into obscurity. There are no books about Janis Martin, who as far as I can tell was the first successful female rockabilly artist. There are no films about her. There are just a handful of articles in obscure fanzines, and pages on unvisited websites, to mark the story of a true pioneer of rockabilly music.\n\nBut I don't think that the way Janis Martin's career stalled was down to that label at all. I think it stalled because of misogyny, plain and simple, and I'm going to explain why in this episode. So a warning right now -- this will deal in passing with abortion and underage marriage. If you are likely to find anything dealing with those things traumatising, please check out the transcript on the podcast website at 500songs.com, to make sure it's something you're comfortable hearing. I won't be going into those things in any great detail, but sometimes better safe than sorry.\n\nJanis Martin was born in 1940, and spent her early years as a child country and western act. She started playing the guitar when she was only four, holding it upright because she wasn't big enough yet to play it normally, and by the age of eleven she was a regular on The Old Dominion Barn Dance. This was at a time when the dominant force in country and western music was a series of live variety shows that would be broadcast by different radio stations, and there was a definite hierarchy there. At the very top of the chain was the Grand Ole Opry, whose performers like Roy Acuff would absolutely dominate the whole medium of country music. If you were on the Opry, you were going to be a big star, and you would be heard by everyone. You'd made it.\n\nSlightly lower than the Opry were shows like the Louisiana Hayride. The Hayride was for those who were on their way up or on their way down. Elvis Presley got a residency on the show when he went down too badly on the Opry for them to book him again, and Hank Williams started performing on it when he was dropped by the Opry for drunkenness, but it also booked acts who weren't quite well known enough to secure a spot on the Opry, people who were still building their names up.\n\nAnd then, a rung below the Hayride, were shows like the Old Dominion Barn Dance. The Barn Dance had some big name acts -- the Carter Family, Flatt and Scruggs, Joe Maphis -- these weren't small-time no-namers by any means. But it wasn't as big as the Hayride.\n\nYoung Janis Martin was a country singer, pushed into the role by her domineering mother. But she wasn't massively interested in country music. She liked the honky-tonk stuff -- she liked Hank Williams, \"Because he had a little rock to his music\":\n\n[Excerpt: Hank Williams, \"Honky Tonkin'\"]\n\nBut she didn't like bluegrass, and she was starting to get bored with the slow country ballads that dominated the pop part of the country field. But luckily, the further down the rungs you got, the more experimental the hillbilly shows could be, and the more they could deviate from the straight formula insisted on by the shows at the top. Shows like the Opry, while wildly popular, were also extraordinarily conservative. The Barn Dance allowed people to try things that were a little different.\n\nJanis Martin was a little different. She changed her whole style with one twist of a radio dial, when she was thirteen. She was going through the radio stations trying to find something she liked, when she hit on a station that was playing \"Mama, He Treats Your Daughter Mean\" by Ruth Brown:\n\n[Excerpt: Ruth Brown, \"Mama, He Treats Your Daughter Mean\"]\n\nShe immediately decided that that was what she wanted to be singing -- \"black R&B\", as she would always put it, not country music. She immediately incorporated \"Mama, He Treats Your Daughter Mean\" into her set, and started adding a lot of similar songs -- not just Ruth Brown songs, though Brown would always remain her very favourite, but songs by LaVern Baker and Dinah Washington as well.\n\nThis was not normal, even for the small number of country musicians who were playing R&B songs. Generally, the few who did that were performing music originally recorded by male jump band artists like Louis Jordan or Big Joe Turner. The songs Brown, Baker, and Washington recorded were all closer to jazz than to country music, and it's actually quite hard for me to imagine how one could perform \"Mama He Treats Your Daughter Mean\" with country instrumentation.\n\nBut this was what Janis Martin was doing, and it went down well with the Old Dominion Barn Dance audience. What worried some of them was another change that went along with this -- she started performing in a manner that they interpreted as overtly sexual. At thirteen and fourteen years old, she was dancing on the stage in a way that was often compared to Elvis Presley -- someone she'd never heard of at the time, and wasn't that impressed by when she did. She preferred Carl Perkins. She wasn't intending to be vulgar or sexual -- it just made no sense to her *not* to dance while she was singing uptempo R&B-style songs.\n\nAs she later said, \"When I was a little girl doing all those rock 'n' roll moves on the barndances, people thought it was cute. But then, when I was fifteen or sixteen, and wearing a ponytail, and out there moving like Elvis, a lot of people thought it was vulgar.\"\n\nBut, at the time, the crowds at the Barndance shows were still happy to hear this music, however different it was from the country music they were used to.\n\nMartin's big break came when two staff announcers on WRVA, the station that hosted the barndance, Carl Stutz and Carl Barefoot, brought her a song they'd written, \"Will You, Willyum?\":\n\n[Excerpt: Janis Martin, \"Will You, Willyum?\"]\n\nThe song itself was not hugely impressive -- it's a standard boogie rhythm country song, and like many second-rate songs of the time it tries to get itself a little second-hand excitement by namechecking another song -- in this case, it references dancing with Henry, a reference to \"the Wallflower\". But Martin's demo of the song was enough to catch the ear of Steve Sholes, the A&R man who had signed Elvis a few months earlier, and so in March 1956, aged just fifteen, Janis Martin was signed to RCA Records, one of the biggest labels in the country.\n\nSholes wanted to record \"Will You Willyum?\" as her first single, but had also suggested that she try writing songs herself. Her very first attempt at writing a song took her, by her own accounts, ten or fifteen minutes to write, and ended up as the B-side. It was \"Drugstore Rock 'n' Roll\":\n\n[Excerpt: Janis Martin, \"Drugstore Rock 'n' Roll\"]\n\nNow, this actually marks something of a turning point in our story, though it may not seem it. Up to this point, the music we've looked at broadly falls into three categories -- R&B and jump band music made by and for black adults, white country musicians imitating that jump band music and generally aiming it at a younger audience, and doo-wop music made by and for black teenagers.\n\n\"Drugstore Rock 'n' Roll\" is the first record we've looked at -- and one of the first records ever made -- to deal specifically with the experience of the white teenagers who were now the music's biggest audience, and deal with it from their own perspective. This is where the 1950s of the popular imagination -- letter sweaters, crewcuts, ponytails, big skirts, dancing to the jukebox, drinking a malt with two straws, the 1950s of \"Happy Days\" and \"American Graffiti\" and Archie Comics, all starts.\n\nNow, in this, we have to consider that the micro and the macro are telling us rather different things, and that both parts of the picture are true. On the one hand, we have a teenage girl, writing her first ever song, talking about her own experiences and doing so in a musical idiom that she loves. On the other hand, we have a massive corporate conglomerate taking musical styles created by marginalised groups, removing those elements that made them distinctive to those groups, and marketing them at a more affluent, privileged, audience.\n\nBoth these things were happening at the same time -- and we'll see, as we look at the next few years of rock and roll history, how an influx of well-meaning -- and often great -- individual white artists making music they truly believed in, and with no racist motives as individuals (indeed many of them were committed anti-racists), would still, in aggregate, turn rock and roll from a music that was dominated by black artists and created for a primarily black audience, into one that was created by and for privileged white teenagers.\n\nOver the next few years the most popular artists in rock and roll music would go from being black men singing about gay sex and poor white sharecroppers singing about drinking liquor from an old fruit jar to being perky teenagers singing about sock hops and going steady, and Janis Martin was an early example of this. But she was still, ultimately, too individual for the system to cope with.\n\nGiven that she supposedly moved like Elvis (I say \"supposedly\" because I haven't been able to find any footage of her to confirm this) and had had a similar career path, RCA decided to market her as \"the Female Elvis\". They got the permission of Elvis and the Colonel to do so, though Martin only ever met Elvis twice, and barely exchanged a couple of words with him when she did.\n\nThey also got in some of the same people who performed on Elvis' records. While Elvis' own musicians weren't available, Chet Atkins, who also produced Janis' sessions, and Floyd Cramer were both on most of Janis' early recordings, and came up with a very similar sound to the Elvis records, and on at least some of her records the Jordanaires provided backing vocals, as they did for Elvis.\n\nThe first single, \"Will You Willyum\" backed with \"Drugstore Rock 'n' Roll\" was a hit, and went to number thirty-five in the pop charts. It sold three quarters of a million copies, and led to performances on most of the big TV shows, as well as on the Grand Ole Opry. But the follow-up, \"Ooby Dooby\" (a cover of a song we'll be dealing with in a future episode) didn't do quite so well. So for her third single they tried to lean into the Elvis comparisons with... a song about Elvis:\n\n[Excerpt: \"My Boy Elvis\", Janis Martin]\n\nShe wasn't particularly keen on the song, but she had no control over the material she was given -- back then, artists on major labels made the records they were told to make, and that was the end of it.\n\n\"My Boy Elvis\" was, in fact, only one of a large number of novelty records about Elvis that hit in 1956. Novelty records were a huge part of the music industry in the 1950s and 60s, and there would not be a trend that would go by without a dozen people putting out records of one kind or another about the trend. And given that Elvis' rise to stardom was the biggest cultural phenomenon the world had ever seen, it's not surprising that a few record company owners figured that if the kids were interested in buying records by Elvis, they might be tricked into buying records about Elvis too.\n\nA typical example of the form was \"I Want Elvis For Christmas\":\n\n[Excerpt: The Holly Sisters, \"I Want Elvis For Christmas\"]\n\nThat song was written by two aspiring songwriters -- Don Kirshner, who would later become one of the most important music publishing executives in the world, and a young man named Walden Cassoto, who would soon change his name to Bobby Darin. The person impersonating Elvis was a country singer called Eddie Cochran, who we'll be hearing a lot more about soon.\n\nSo these novelty records were being released left and right, but very few of them had any success. And Martin's record was no exception. Not only that, the teenage girl audience who were Elvis' biggest fanbase started to resent the marketing -- which she hadn't chosen herself -- comparing her to Elvis. They were in love with Elvis, and didn't like the comparison.\n\nJanis was selling records, but not quite at the level RCA initially hoped – they were having trouble building her audience. That was because in 1956, unlike even a year or so later, record labels had no idea what to do with white rock and roll acts aimed at the teen crowd. There were Bill Haley and Elvis, who were in a league of their own, and there were the Sun Records artists who could be packaged together on tours and play to the same crowds.\n\nBut other than that, rock and roll acts played the chitlin circuit, and that was black acts for black audiences.\n\nThere was a possible solution to this problem -- Elvis. Colonel Parker, Elvis' manager, was a close associate of Steve Sholes, and believed Sholes when he told Parker that Janis Martin was going places. He wanted to sign Janis to a management contract and promote Elvis and Janis as a double-bill, thinking that having a male-female act would be a good gimmick.\n\nBut her parents thought this was a bad idea. Just before she had been signed to RCA, Elvis had very publicly collapsed and been hospitalised with exhaustion through overwork. For all that Martin's mother was a pushy stage mother, she didn't want that for her daughter, and so the Colonel never got to sign Janis, and Janis never got to tour and play to Elvis' audience.\n\nSo since she had come up through the country music scene, and had been signed by RCA's country department, she was put on bills with other RCA country artists like Hank Snow, who made music like this:\n\n[Excerpt: Hank Snow, \"Wedding Bells\"]\n\nUnderstandably, Martin's rock and roll style didn't really fit on the bills, and the audiences were unimpressed. No-one in RCA or her promotional team knew how to deal with a rock and roll star who wasn't the most massive thing on the charts -- there was not, yet, anywhere to put a mid-range rock and roll star.\n\nBut she continued plugging away, making rockabilly records, and slowly building up a fanbase for herself. She even had a screen test with MGM, the film studio that had signed Elvis up so successfully.\n\nBut she had a problem, and one that would eventually cause the end of her career. A few months before she was signed to RCA, she had got married.\n\nThis is less odd than it might now sound. In the southern US in the 1950s, it was perfectly normal for people to get married in their early or mid teens. We will see a few more stories as the series goes on where people have married far, far, too young -- in some cases, because of abuse by an older man, in other cases just because teenage hormones had convinced them that they were definitely mature enough, no matter what those old people said. In this case, she had eloped with a paratrooper, who was stationed in Germany soon after. She only told her parents about the marriage once her husband had left the country.\n\nSo everything was fine -- while she might have been technically married, it wasn't like she was even on the same continent as her husband, so for all practical purposes it was exactly as if she was the single, sweet, innocent teenage girl that RCA wanted people to think she was. And she didn't see the need to tell RCA any different. What they didn't know couldn't hurt them.\n\nAnd that was all fine, until her 1957 European tour. As she was going to be in Europe anyway, her husband asked for a leave of absence and spent thirty days travelling around with her. And when she got back to the US, she was pregnant.\n\nWhen she informed RCA, they were furious. They couldn't have their seventeen-year-old nation's sweetheart going around being visibly pregnant -- even though one of the songs they'd chosen for her to record at her first session, \"Let's Elope Baby\", had described her actual experiences rather better than they'd realised:\n\n[Excerpt: Janis Martin, \"Let's Elope Baby\"]\n\nAnd so they came up with what they thought was the obvious solution -- they tried to persuade her to get an abortion, although that was still illegal in the US at the time. She refused, and the label dropped her.\n\nShe started recording for a small label -- she turned down offers from King and Decca records, and instead went with the tiny Belgian label Palette -- but she never had any success, and soon split from her husband. By 1960, aged twenty, she was on to her second marriage.\n\nHer second husband toured with her for a while, but soon told her that if she wanted to stay with him, she would have to give up on the music industry. For the next thirteen years, while she was married to him, she did just that, and her career was over.\n\nBut then, after her second marriage ended, she put together a band, Janis Martin and the Variations, and started playing gigs again. And the woman whose entire life had been controlled by other people -- first her mother, then her record label, then her husband -- found she liked performing again. She didn't return to full-time music, at least at first -- she held down a day job as the assistant manager of a country club in Virginia -- but she found that she still had fans, especially in Europe. In the late seventies Bear Family Records, a German reissue label that specialises in doing comprehensive catalogue releases by 50s country and rock and roll artists, had put out two vinyl albums collecting everything she'd released in the fifties (and this was later put together as a single-CD set, one of their first CD releases, in the mid-eighties), and she'd become known to a new generation of rockabilly fans in Europe, as well as building up a new small fanbase in the USA. So in 1982, she travelled to Europe for the first time since that 1957 tour, and started performing for audiences who, more than anything else, wanted to hear her own song, \"Drugstore Rock 'n' Roll\".\n\nFor the last few decades of her life, Janis Martin would regularly tour, even though she hated flying, because she felt she owed it to the fans to let them see her perform. Her son played drums with her band, and audiences would regularly thrill to Janis, as this woman who was now a great-grandmother and looked like any other great-grandmother from Virginia, sang her songs of teenage rebellion. Her third marriage, in 1977, was to a man who had been a fan of hers during her first career, and lasted the rest of her life. She was finally happy.\n\nAnd in 2006 she recorded what was intended to be a comeback album, and she was finally able to fulfil a lifetime ambition, and perform with Ruth Brown, singing the song that changed everything for her when she'd heard it more than fifty years earlier:\n\n[Excerpt: Ruth Brown and Janis Martin, \"Mama, He Treats Your Daughter Mean\"]\n\nThat was the first and only time Janis Martin and Ruth Brown would meet and perform together. Ruth Brown died in late 2006, and Janis' son died in early 2007. Janis herself died of cancer in September 2007, having outlived the man with whom she had been compared in her teens by more than thirty years, and having lived to see her work embraced by new generations. There are much worse lives for an Elvis to have had.",
  "enclosure": "",
  "itunes:summary": "Episode forty of A History of Rock Music in Five Hundred Songs looks at \"Drugstore Rock 'n' Roll\", by Janis Martin, an early rockabilly classic by the woman known as \"the Female Elvis\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Fever\" by Little Willie John\n\n\n\nA brief apology before I go any further. There is no Mixcloud this week, and also I've only done one edit pass, rather than my customary two, on the podcast sound file, so there might be some noises and so on that would otherwise not be on there, and the sound quality may not be as good as normal. A close family member has had a severe medical emergency this weekend, and I haven't been able to put in the time I normally would. Normal service should be resumed next week, and I hope this is at least adequate.\n\nResources\n\nThere is very little information out there about Janis Martin. Much of this was stitched together from brief mentions in books on other people, and from ten minutes' worth of interview in an out-of-print documentary called Welcome to the Club: The Women of Rockabilly. \n\nThe single most important source here was the liner notes for the Bear Family CD collecting all Janis' fifties recordings.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nSometimes a novelty act will have real talent, and sometimes the things that can bring you the most success initially can be the very things that stop you from building a career. In the case of Janis Martin, \"the female Elvis Presley\", those four words were the reason she became successful, and some say they are also the reason she very quickly dropped into obscurity. There are no books about Janis Martin, who as far as I can tell was the first successful female rockabilly artist. There are no films about her. There are just a handful of articles in obscure fanzines, and pages on unvisited websites, to mark the story of a true pioneer of rockabilly music.\n\nBut I don't think that the way Janis Martin's career stalled was down to that label at all. I think it stalled because of misogyny, plain and simple, and I'm going to explain why in this episode. So a warning right now -- this will deal in passing with abortion and underage marriage. If you are likely to find anything dealing with those things traumatising, please check out the transcript on the podcast website at 500songs.com, to make sure it's something you're comfortable hearing. I won't be going into those things in any great detail, but sometimes better safe than sorry.\n\nJanis Martin was born in 1940, and spent her early years as a child country and western act. She started playing the guitar when she was only four, holding it upright because she wasn't big enough yet to play it normally, and by the age of eleven she was a regular on The Old Dominion Barn Dance. This was at a time when the dominant force in country and western music was a series of live variety shows that would be broadcast by different radio stations, and there was a definite hierarchy there. At the very top of the chain was the Grand Ole Opry, whose performers like Roy Acuff would absolutely dominate the whole medium of country music. If you were on the Opry, you were going to be a big star, and you would be heard by everyone. You'd made it.\n\nSlightly lower than the Opry were shows like the Louisiana Hayride. The Hayride was for those who were on their way up or on their way down. Elvis Presley got a residency on the show when he went down too badly on the Opry for them to book him again, and Hank Williams started performing on it when he was dropped by the Opry for drunkenness, but it also booked acts who weren't quite well known enough to secure a spot on the Opry, people who were still building their names up.\n\nAnd then, a rung below the Hayride, were shows like the Old Dominion Barn Dance. The Barn D",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty of A History of Rock Music in Five Hundred Songs looks at \"Drugstore Rock 'n' Roll\", by Janis Martin, an early rockabilly classic by the woman known as \"the Female Elvis\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Fever\" by Little Willie John\n\n\n\nA brief apology before I go any further. There is no Mixcloud this week, and also I've only done one edit pass, rather than my customary two, on the podcast sound file, so there might be some noises and so on that would otherwise not be on there, and the sound quality may not be as good as normal. A close family member has had a severe medical emergency this weekend, and I haven't been able to put in the time I normally would. Normal service should be resumed next week, and I hope this is at least adequate.\n\nResources\n\nThere is very little information out there about Janis Martin. Much of this was stitch",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}