{
  "id": "yt:video:8d9_TA1hi9w",
  "yt:videoId": "8d9_TA1hi9w",
  "yt:channelId": "UCweDKPSF65wRw5VHFUJYiow",
  "title": "'Biology' of Horizon: Zero Dawn | Part II",
  "link": "",
  "author": {
    "name": "Curious Archive",
    "uri": "https://www.youtube.com/channel/UCweDKPSF65wRw5VHFUJYiow"
  },
  "published": "2022-06-10T18:16:29+00:00",
  "updated": "2022-09-02T20:26:03+00:00",
  "media:group": {
    "media:title": "'Biology' of Horizon: Zero Dawn | Part II",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Larger machines lurk in the lost reaches of Horizon: Zero Dawn. Part two of our documentary style deep dive into an artificial ecosystem (Part I: https://youtu.be/Seu7V91vxAo)\n---\nCurious Archive Social Media:\nTwitter: https://twitter.com/Curious_Archive\nInstagram: https://www.instagram.com/CuriousArchive\n\nWelcome back to the world of Horizon. In the most extreme biomes of this planet of machines, ill-tempered titans, skilled survivalists, and genuine terrors still await discovery. Like the animals braving the harshest regions of our current age, these machines have had to get creative to endure the hazards of the elements.\n\nThe environments are perilous, and the machines that live here even more so, but sometimes discovery requires certain risks. And with mysterious robots that aren’t part of the ecosystem awakening in the darkest corners of the land, who knows what final secrets are buried beneath the ground.\n\nSo, join me on the last section of our documentary-style journey, as we conclude our expedition across the uncharted regions…\n\n0:00 Unseen Machines\n1:04 Stormbird\n2:38 Stalker\n4:59 Rockbreaker\n7:03 Corruptor \n9:10 Charger\n10:38 Trampler\n12:37 Control Tower\n14:12 Scorcher\n16:10 Frostclaw and Fireclaw\n17:43 Deathbringer \n19:21 Beyond the Horizon…\n\nCopyright Disclaimer: Under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. All video/image content is edited under fair use rights for reasons of commentary.\n\nI do not own the images, music, or footage used in this video. All rights and credit goes to the original owners.\n\n♫ Music by Kevin MacLeod (incompetech.com): \nBeauty Flow, Firesong, Impact Lento, Majestic Hills, Bittersweet, Floating Cities\nLicensed under Creative Commons: By Attribution 3.0\n\n#CuriousArchive #Horizon #SpeculativeBiology",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}