{
  "title": "NYC council passes a landmark legislation improve equity, inclusion and diversity in the FDNY",
  "link": "https://www.vosa.tv/archives/27359",
  "comments": "https://www.vosa.tv/archives/27359#respond",
  "dc:creator": "World News",
  "pubDate": "Fri, 04 Nov 2022 14:10:07 +0000",
  "category": [
    "New York",
    "News",
    "US"
  ],
  "guid": "https://www.vosa.tv/?p=27359",
  "description": "<p>&#160; NEW YORK: In a major development, New York City Council has passed a landmark legislation to improve equity, inclusion and diversity in the FDNY. New York City Council Speaker Adrienne Adams said: &#8220;By passing this package of bills today, we hope to move the FDNY forward to achieving a workforce fully reflective of the &#8230;</p>\n<p>The post <a href=\"https://www.vosa.tv/archives/27359\">NYC council passes a landmark legislation improve equity, inclusion and diversity in the FDNY</a> first appeared on <a href=\"https://www.vosa.tv\">VOSA</a>.</p>",
  "content:encoded": "<p>&nbsp;</p>\n<p>NEW YORK: In a major development, New York City Council has passed a landmark legislation to improve equity, inclusion and diversity in the FDNY.</p>\n<p>New York City Council Speaker Adrienne Adams said: &#8220;By passing this package of bills today, we hope to move the FDNY forward to achieving a workforce fully reflective of the diversity of our city,&#8221;</p>\n<p>The legislation package requires the FDNY to report on its recruitment and retention efforts of firefighters of diverse racial and ethnic backgrounds.</p>\n<p>The department would also have to survey firehouses and ensure they are equipped to serve a mixed gender workforce.</p>\n<p>The council speaker says currently only 8% of firefighters are Black, 2% are Asian and only 1% are women.</p><p>The post <a href=\"https://www.vosa.tv/archives/27359\">NYC council passes a landmark legislation improve equity, inclusion and diversity in the FDNY</a> first appeared on <a href=\"https://www.vosa.tv\">VOSA</a>.</p>",
  "wfw:commentRss": "https://www.vosa.tv/archives/27359/feed",
  "slash:comments": 0,
  "post-id": 27359
}