{
  "title": "Junta shelling kills 2 family members and injures 2 more in Myanmar’s Sagaing region",
  "description": "A 13-year-old boy and his grandmother died after being hit by shrapnel.",
  "link": "https://www.rfa.org/english/news/myanmar/sagaing-shelling-kills-two-11042022051255.html",
  "guid": "https://www.rfa.org/english/news/myanmar/sagaing-shelling-kills-two-11042022051255.html",
  "author": "By RFA Burmese",
  "media:content": {
    "media:description": "Destroyed buildings in Zee Ka Nar village, which was shelled by the army on Nov. 3, 2022.",
    "media:credit": "Kyunhla Activists Group"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">Army shelling of a village in Sagaing region’s Kanbalu township killed a teenager and his grandmother and injured two other members of the same family.</span></p>\n<p><span style=\"font-weight: 400;\">A junta shell hit a house in Zee Ka Nar village on Thursday. The boy, Paing Set Hmu, was hit in the head and died instantly. His grandmother was also hit by shell fragments and died the next morning, locals told RFA. The boy’s seven-year old sister and a female relative in her 60s suffered minor injuries to their heads, hands and legs.</span></p>\n<p><span style=\"font-weight: 400;\">“Junta troops in Koe Taung Boet village fired a shell and it landed on a house in Zee Ka Nar village which is located in the west [of the township],” a local said, speaking on condition of anonymity for safety reasons.</span></p>\n<p><span style=\"font-weight: 400;\">“The whole family was injured. The 13-year-old boy, Paing Set Hmu, died immediately and his 68-year-old grandmother, Win, was hit in the abdomen and died this morning,” he said.</span></p>\n<p><span style=\"font-weight: 400;\">Junta forces shelled the nearby forest on the same day and fought skirmishes with local People’s Defense Forces, the local said.</span></p>\n<p><span style=\"font-weight: 400;\">Residents said troops stationed in Koe Taung Boet village arrested and interrogated around 10 locals after they attacked villages around the township.   </span></p>\n<p><span style=\"font-weight: 400;\">RFA has not been able to verify the information independently and calls to the junta spokesman for Sagaing region, Social Affairs Minister Aye Hlaing, went unanswered on Friday.</span></p>\n<p><span style=\"font-weight: 400;\">Some 1,512 civilians died in Sagaing in the 21 months since the Feb. 1, 2021 coup, the Institute for Strategy and Policy (ISP) reported at the end of last month.</span></p>\n<p><span style=\"font-weight: 400;\">Sagaing has the largest number of Internally Displaced Persons (IDPs) in Myanmar since the coup, after intense fighting forced them to flee their villages. As of Oct. 19, there were more than</span><a href=\"https://www.ispmyanmar.com/#images-2\"> <span style=\"font-weight: 400;\">680,629 or 41 percent of the country’s IDPs</span></a><span style=\"font-weight: 400;\"> in the region the independent research group said.</span></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 05:46:55 -0400"
}