{
  "title": "FBI Foils Its Own Plot To Kidnap MI Gov Whitmer",
  "itunes:title": "FBI Foils Its Own Plot To Kidnap MI Gov Whitmer",
  "pubDate": "Fri, 15 Apr 2022 05:00:57 +0000",
  "guid": "75cd721a-ff3e-4227-a6a7-2cd5c9bc9ae3",
  "link": "https://thejimmydoreshow.libsyn.com/fbi-foils-its-own-plot-to-kidnap-mi-gov-whitmer",
  "itunes:image": "",
  "description": "<p>Two of the defendents involved in the alleged plot to kidnap Michigan Governor Gretchen Whitmer have been acquitted after a jury heard testimony indicating that the FBI and its informants entrapped the two into participating in the plot, and that the FBI was much more instrumental in planning the kidnapping than the accused. Jimmy and The Grayzone's Max Blumenthal discuss the FBI's practice of enticing marginal individuals into terrorist schemes, then blowing their own horn after \"thwarting\" the plots.<br /> <br /> Plus segments on the New York Times using the recent subway shooting to push pro-cop propaganda and the not-so surprising story of California cities funneling COVID relief money into police departments.<br /> <br /> Also featuring Stef Zamorano, Anya Parampil and Mike MacRae! And phone calls from Andrew Cuomo and Alec Baldwin!</p>",
  "content:encoded": "<p>Two of the defendents involved in the alleged plot to kidnap Michigan Governor Gretchen Whitmer have been acquitted after a jury heard testimony indicating that the FBI and its informants entrapped the two into participating in the plot, and that the FBI was much more instrumental in planning the kidnapping than the accused. Jimmy and The Grayzone's Max Blumenthal discuss the FBI's practice of enticing marginal individuals into terrorist schemes, then blowing their own horn after \"thwarting\" the plots.  Plus segments on the New York Times using the recent subway shooting to push pro-cop propaganda and the not-so surprising story of California cities funneling COVID relief money into police departments.  Also featuring Stef Zamorano, Anya Parampil and Mike MacRae! And phone calls from Andrew Cuomo and Alec Baldwin!</p>",
  "enclosure": "",
  "itunes:duration": "01:06:49",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Two of the defendents involved in the alleged plot to kidnap Michigan Governor Gretchen Whitmer have been acquitted after a jury heard testimony indicating that the FBI and its informants entrapped the two into participating in the plot, and that the...",
  "itunes:episodeType": "full",
  "itunes:summary": "Two of the defendents involved in the alleged plot to kidnap Michigan Governor Gretchen Whitmer have been acquitted after a jury heard testimony indicating that the FBI and its informants entrapped the two into participating in the plot, and that the FBI was much more instrumental in planning the kidnapping than the accused. Jimmy and The Grayzone's Max Blumenthal discuss the FBI's practice of enticing marginal individuals into terrorist schemes, then blowing their own horn after \"thwarting\" the plots. Plus segments on the New York Times using the recent subway shooting to push pro-cop propaganda and the not-so surprising story of California cities funneling COVID relief money into police departments. Also featuring Stef Zamorano, Anya Parampil and Mike MacRae! And phone calls from Andrew Cuomo and Alec Baldwin!"
}