{
  "title": "Microsoft: Two New 0-Day Flaws in Exchange Server",
  "link": "https://krebsonsecurity.com/2022/09/microsoft-two-new-0-day-flaws-in-exchange-server/",
  "comments": "https://krebsonsecurity.com/2022/09/microsoft-two-new-0-day-flaws-in-exchange-server/#comments",
  "dc:creator": "BrianKrebs",
  "pubDate": "Fri, 30 Sep 2022 16:51:57 +0000",
  "category": [
    "Latest Warnings",
    "The Coming Storm",
    "Time to Patch",
    "CVE-2022-41040",
    "CVE-2022-41082",
    "GTSC",
    "Microsoft Exchange Server zero-day",
    "Steven Adair",
    "Volexity",
    "Zimbra Collaboration Suite"
  ],
  "guid": "https://krebsonsecurity.com/?p=61414",
  "description": "Microsoft Corp. is investigating reports that attackers are exploiting two previously unknown vulnerabilities in Exchange Server, a technology many organizations rely on to send and receive email. Microsoft says it is expediting work on software patches to plug the security holes. In the meantime, it is urging a subset of Exchange customers to enable a setting that could help mitigate ongoing attacks.",
  "content:encoded": "<p><strong>Microsoft Corp.</strong> is investigating reports that attackers are exploiting two previously unknown vulnerabilities in <strong>Exchange Server</strong>, a technology many organizations rely on to send and receive email. Microsoft says it is expediting work on software patches to plug the security holes. In the meantime, it is urging a subset of Exchange customers to enable a setting that could help mitigate ongoing attacks.</p>\n<p><img loading=\"lazy\" src=\"https://krebsonsecurity.com/wp-content/uploads/2021/03/exchange.png\" alt=\"\" width=\"1072\" height=\"362\" class=\"aligncenter size-full wp-image-54572\" srcset=\"https://krebsonsecurity.com/wp-content/uploads/2021/03/exchange.png 1072w, https://krebsonsecurity.com/wp-content/uploads/2021/03/exchange-768x259.png 768w\" sizes=\"(max-width: 1072px) 100vw, 1072px\" /></p>\n<p>In <a href=\"https://msrc-blog.microsoft.com/2022/09/29/customer-guidance-for-reported-zero-day-vulnerabilities-in-microsoft-exchange-server/\" rel=\"noopener\" target=\"_blank\">customer guidance</a> released Thursday, Microsoft said it is investigating two reported zero-day flaws affecting Microsoft Exchange Server 2013, 2016, and 2019. <a href=\"https://cve.mitre.org/cgi-bin/cvename.cgi?name=2022-41040\" rel=\"noopener\" target=\"_blank\">CVE-2022-41040</a>, is a Server-Side Request Forgery (SSRF) vulnerability that can enable an authenticated attacker to remotely trigger the second zero-day vulnerability &#8212; <a href=\"https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-41082\" rel=\"noopener\" target=\"_blank\">CVE-2022-41082</a> &#8212; which allows remote code execution (RCE) when <strong>PowerShell</strong> is accessible to the attacker.</p>\n<p>Microsoft said <strong>Exchange Online</strong> has detections and mitigation in place to protect customers. Customers using <em>on-premises</em> Microsoft Exchange servers are urged to review the mitigations suggested in the security advisory, which Microsoft says should block the known attack patterns.</p>\n<p>Vietnamese security firm <strong>GTSC</strong> on Thursday <a href=\"https://gteltsc.vn/blog/warning-new-attack-campaign-utilized-a-new-0day-rce-vulnerability-on-microsoft-exchange-server-12715.html\" rel=\"noopener\" target=\"_blank\">published a writeup on the two Exchange zero-day flaws</a>, saying it first observed the attacks in early August being used to drop &#8220;webshells.&#8221; These web-based backdoors offer attackers an easy-to-use, password-protected hacking tool that can be accessed over the Internet from any browser.</p>\n<p>&#8220;We detected webshells, mostly obfuscated, being dropped to Exchange servers,&#8221; GTSC wrote. &#8220;Using the user-agent, we detected that the attacker uses Antsword, an active Chinese-based opensource cross-platform website administration tool that supports webshell management. We suspect that these come from a Chinese attack group because the webshell codepage is 936, which is a Microsoft character encoding for simplified Chinese.&#8221;</p>\n<p>GTSC&#8217;s advisory includes details about post-compromise activity and related malware, as well as steps it took to help customers respond to active compromises of their Exchange Server environment. But the company said it would withhold more technical details of the vulnerabilities for now.</p>\n<p>In March 2021, hundreds of thousands of organizations worldwide had their email stolen and multiple backdoor webshells installed, all thanks to <a href=\"https://krebsonsecurity.com/2021/03/at-least-30000-u-s-organizations-newly-hacked-via-holes-in-microsofts-email-software/\" rel=\"noopener\" target=\"_blank\">four zero-day vulnerabilities in Exchange Server</a>. </p>\n<p>Granted, the zero-day flaws that powered that debacle were far more critical than the two detailed this week, and there are no signs yet that exploit code has been publicly released (that will likely change soon). But part of what made last year&#8217;s Exchange Server mass hack so pervasive was that vulnerable organizations had little or no advance notice on what to look for before their Exchange Server environments were completely owned by multiple attackers. </p>\n<p>Microsoft is quick to point out that these zero-day flaws require an attacker to have a valid username and password for an Exchange user, but this may not be such a tall order for the hackers behind these latest exploits against Exchange Server. </p>\n<p><strong>Steven Adair</strong> is president of <a href=\"https://www.volexity.com\" rel=\"noopener\" target=\"_blank\">Volexity</a>, the Virginia-based cybersecurity firm that was among the first to sound the alarm about the Exchange zero-days targeted in the 2021 mass hack. Adair said GTSC&#8217;s writeup includes an Internet address used by the attackers that Volexity has tied with high confidence to a China-based hacking group that has recently been observed phishing Exchange users for their credentials. </p>\n<p>In February 2022, Volexity <a href=\"https://www.volexity.com/blog/2022/02/03/operation-emailthief-active-exploitation-of-zero-day-xss-vulnerability-in-zimbra/\" rel=\"noopener\" target=\"_blank\">warned</a> that this same Chinese hacking group was behind the mass exploitation of a zero-day vulnerability in the <strong>Zimbra Collaboration Suite</strong>, which is a competitor to Microsoft Exchange that many enterprises use to manage email and other forms of messaging. </p>\n<p>If your organization runs Exchange Server, please consider reviewing <a href=\"https://msrc-blog.microsoft.com/2022/09/29/customer-guidance-for-reported-zero-day-vulnerabilities-in-microsoft-exchange-server/\" rel=\"noopener\" target=\"_blank\">the Microsoft mitigations</a> and <a href=\"https://gteltsc.vn/blog/warning-new-attack-campaign-utilized-a-new-0day-rce-vulnerability-on-microsoft-exchange-server-12715.html\" rel=\"noopener\" target=\"_blank\">the GTSC post-mortem</a> on their investigations.  </p>\n",
  "wfw:commentRss": "https://krebsonsecurity.com/2022/09/microsoft-two-new-0-day-flaws-in-exchange-server/feed/",
  "slash:comments": 11
}