{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-6116414416992361779",
  "published": "2019-11-21T09:00:00.000-08:00",
  "updated": "2019-12-05T10:50:19.795-08:00",
  "title": "My final letter in 2019: Updates for this year",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><table cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"float: right; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-mAvp965d8h0/XdXIySUcHcI/AAAAAAAACZA/0UD6cFrfOPEXl_Rwfg6l3dYz4B89zdYHQCLcBGAsYHQ/s1600/YT_1.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"844\" data-original-width=\"1500\" src=\"https://1.bp.blogspot.com/-mAvp965d8h0/XdXIySUcHcI/AAAAAAAACZA/0UD6cFrfOPEXl_Rwfg6l3dYz4B89zdYHQCLcBGAsYHQ/s1600/YT_1.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Illustrations by Christopher DeLorenzo</td></tr></tbody></table><br /><br />Dear creators and artists,<br /><br /><br /><br /><br />Every quarter, I give you an update on the highlights of the past few months. In August, I did something different and <a href=\"https://youtube-creators.googleblog.com/2019/08/preserving-openness-through-responsibility.html\" target=\"_blank\">wrote to you</a> about our top priority: the importance of striking the right balance between openness and responsibility. I did this because I received a number of questions about the viability of an open platform, and I wanted to emphasize our commitment to both openness and responsibly protecting our community.  <br /><br /><br /><br /><br />Today I’m returning to our usual format because there are so many new updates to share on our three key priorities: supporting creator and artist success, improving communication and engagement, and living up to our responsibility. <br /><br /><div style=\"text-align: center;\"><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/GSOyIdxNjF4\" width=\"560\"></iframe><br /></div><br /><br />But before I jump into these sections, I want to let all of you know that YouTube as a platform for creators continues to thrive. Compared to last year, the number of creators with a million or more subscribers has grown 65 percent, and creators earning five or six figures, annually, has increased more than 40 percent. <br /><br /><br /><br /><br />We always say that creators are the heart of YouTube. So, with that, let me move to our next section… supporting your success!<br /><br /><br /><br /><br /><h3 style=\"text-align: left;\">Supporting creator and artist success</h3><br /><br /><br /><br />One of the biggest issues we heard about from you this year was around copyright claims, in particular about aggressive manual claiming of short music clips used in monetized videos. Those claims often resulted in all revenue going to the rightsholder, regardless of the length of the music claimed. <br /><br /><br /><br /><br />I’m glad to report we've made progress. A few months ago, we made changes that removed the financial incentive to claim very short and unintentional music use. We also required timestamps for all manual claims so you know exactly which part of your video is being claimed, and made updates to our editing tools so you can <a href=\"https://www.youtube.com/watch?v=EmkiEWIlqtI\" target=\"_blank\">easily remove</a> manually claimed content from your videos.<br /><br /><br /><br /><br />In the months ahead, we’re working to move all creators to the new-and-improved YouTube Studio. We’re making this switch because Classic Studio was built on older technology that doesn’t allow us to put out bug fixes or introduce the new features you’ve requested as quickly as we’d like. Many of YouTube Studio’s updates are inspired by requests from creators, and we think you’ll like its exclusive features, including the new dashboard, powerful analytics, and real-time performance metrics. Access to Classic will be removed for the majority of creators early next year, and you’ll be individually notified in advance of a change to your access. We know it can be hard to change the tools you work with every day, but we believe this new foundation will help us innovate more quickly on your behalf.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-_g0lgB1CR0Y/XdXIiWsM1sI/AAAAAAAACY4/zlZAumom2RQ69JLPTSb7U4xMLQRC92wtwCLcBGAsYHQ/s1600/YT_6b.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"876\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-_g0lgB1CR0Y/XdXIiWsM1sI/AAAAAAAACY4/zlZAumom2RQ69JLPTSb7U4xMLQRC92wtwCLcBGAsYHQ/s1600/YT_6b.png\" /></a></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><br />We’re also looking to support your success by helping you monetize in new ways that go beyond traditional ad revenue and tap into the viewer-creator connection. Today, thousands of channels have more than doubled their YouTube revenue by using <a href=\"https://creatoracademy.youtube.com/page/course/monetization-options?hl=en\" target=\"_blank\">new features</a> that help fans engage with creators, like <a href=\"https://www.youtube.com/watch?v=bnx7kckso88\" target=\"_blank\">Super Chat</a>, <a href=\"https://www.youtube.com/watch?v=RXQO_lQz-T0\" target=\"_blank\">Channel Memberships</a>, and <a href=\"https://www.youtube.com/watch?v=HSVEySFKWTY\" target=\"_blank\">Merchandise</a>. More than 100,000 channels have received Super Chat, and some streams are earning more than $400 per minute as fans reach out to creators to say hello, send congratulations, or just to connect. And we’re building on the success of Super Chat by expanding the launch of Super Stickers to eligible creators in 60 countries around the world.<br /><br /><br /><br /><br />And since we expanded YouTube Stories last year, more creators are using <a href=\"https://www.youtube.com/watch?v=H3sIHuMMZec\" target=\"_blank\">Stories</a> not just to connect with existing subscribers, but also to find new ones. Over the last year, creators who used an active Story on their channel saw an average increase to their subscriber count of more than eight percent compared to creators without Stories.<br /><br /><br /><br /><br />We’re also running experiments to help match content that could be considered edgy with advertising that fits their brand. As you know, yellow icons are a signal that only limited advertising can run on a particular video because of its content. We’re working to identify advertisers who are interested in edgier content, like a marketer looking to promote an R-rated movie, so we can match them with creators whose content fits their ads. In its first month, this program resulted in hundreds of thousands of dollars in ads on yellow icon videos. You can learn more <a href=\"https://www.youtube.com/watch?v=bsHoSp85d8c\" target=\"_blank\">here</a>. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-JkHIVVTaPpE/XdXVtATTodI/AAAAAAAACZw/RhwcWbZt_L0L0JvvsJKf4e1iYHxj_EA7wCLcBGAsYHQ/s1600/YT_7.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1329\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-JkHIVVTaPpE/XdXVtATTodI/AAAAAAAACZw/RhwcWbZt_L0L0JvvsJKf4e1iYHxj_EA7wCLcBGAsYHQ/s1600/YT_7.png\" /></a></div><br /><br /><br />For gaming creators, we’ve heard loud and clear that our policies need to differentiate between real-world violence and gaming violence. We have a policy update coming soon that will do just that. The new policy will have fewer restrictions for violence in gaming, but maintain our high bar to protect audiences from real-world violence.<br /><br /><br /><br /><br /><h3 style=\"text-align: left;\">Improving communication and engagement</h3><br /><br /><br /><br />Meeting creators is always a highlight for me, and this year I’ve met with YouTubers around the globe. A few months ago in London, I sat down with <a href=\"https://www.youtube.com/watch?v=gMINAiDWI6g&amp;t=1838s\" target=\"_blank\">Alfie Deyes</a>, and celebrated the 10 year anniversary of his first YouTube video. I recently spoke with <a href=\"https://www.youtube.com/channel/UCpuSRwCaWi-VqTlYviNW3hQ\" target=\"_blank\">Juanpa Zurita</a> and <a href=\"https://www.youtube.com/watch?v=0RuYEzD4_wQ\" target=\"_blank\">Emma Chamberlain</a> about their creative process, and <a href=\"https://www.youtube.com/watch?v=EBhoWwL1Rzs&amp;t=\" target=\"_blank\">took some tough questions</a> from MatPat of <a href=\"https://www.youtube.com/channel/UCo_IB5145EVNcf8hw1Kku7w\" target=\"_blank\">The Game Theorists</a> at YouTube’s first-ever Gaming Creator Summit. I also met with a group of creators in Europe this summer, including <a href=\"https://www.youtube.com/channel/UC0KiGuCTrehqzSQ7ikjxSQw\" target=\"_blank\">Patricia Bright</a>, <a href=\"https://www.youtube.com/channel/UC-lHJZR3Gqxm24_Vd_AJ5Yw\" target=\"_blank\">PewDiePie</a>, <a href=\"https://www.youtube.com/channel/UCYzPXprvl5Y-Sf0g4vX-m6g\" target=\"_blank\">Jacksepticeye</a>, <a href=\"https://www.youtube.com/channel/UCPNqPbXJHMvrH3NwRKKR5IQ\" target=\"_blank\">Sallys Welt</a>, <a href=\"https://www.youtube.com/channel/UCT3v6vL2H5HK4loLMc8pmCw\" target=\"_blank\">VisualPolitik</a>, <a href=\"https://www.youtube.com/channel/UCM2vdqz-7e4HAuzhpFuRY8w\" target=\"_blank\">Mrbruff</a> and <a href=\"https://www.youtube.com/channel/UCDdi0yUyGW1PKzYXaIACnuA\" target=\"_blank\">Jessica Kellgren-Fozard</a>.<br /><br /><br /><br /><br />To help creators have a better understanding of our guidelines, we will expand our <a href=\"https://www.youtube.com/watch?v=bK2xupRNgaU\" target=\"_blank\">Self Certification pilot </a>next year to hundreds of thousands of YouTube Partner Program (YPP) creators. This program lets creators self-report how their video complies with ad policies. It’s a reinforcing process: the more accurate you are in your self-reporting, the more our system trusts you. Not only does Self Certification give creators more control, it also provides specific feedback on why a video might have monetization issues. <br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /><br />We’ve also heard creators say it feels like an inconvenience when we run experiments or make changes. They ask why we’re trying to fix something that doesn’t seem broken, and they want more of a heads up. So I wanted to give more insights into our development processes.<br /><br /><br /><br /><br />We are always looking for ways to improve the YouTube experience. Every change we make was tested many times, in several variations, before we roll it out. In the last year alone, we launched over 2,500 updates to YouTube. That means every new feature is developed after we test three or four potential versions to determine what works best for users and creators. It’s through all these changes ⁠— big and small ⁠— that we deliver a better product for you to broadcast yourself and make a living in the new creative economy. We’ll do a better job of communicating with you about why we’re undertaking these efforts and how they might impact you. Please remember that our experiments enable us to ultimately have a better outcome for all viewers and creators.<br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-eQLM7CNQA-U/XdXUxriaf6I/AAAAAAAACZg/hm2xXeY3I5MuJ1SK50POsCkYEqyRtZzJQCLcBGAsYHQ/s1600/YT_12a.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"969\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-eQLM7CNQA-U/XdXUxriaf6I/AAAAAAAACZg/hm2xXeY3I5MuJ1SK50POsCkYEqyRtZzJQCLcBGAsYHQ/s1600/YT_12a.png\" /></a></div><br /><br />Lastly, I wanted to mention that we continue to work to support your well being. Many of you have shared your stories about burnout, and we appreciated your honesty. We want to encourage you to <a href=\"https://creatoracademy.youtube.com/page/course/well-being\" target=\"_blank\">take care of yourself</a> and invest in recovery. In particular, I’ve heard some creators say they feel like they <a href=\"https://www.youtube.com/watch?v=SINjqNsWMlU\" target=\"_blank\">can’t take a break</a> from filming because they’re concerned their channel will suffer. So I asked the product team at YouTube to look into it. They went over data from the last six years and found good news. Across millions of channels and hundreds of different time frames for breaks, the same thing was true: On average, channels had more views when they returned than they had right before they left. If you need to take some time off, your fans will understand. After all, they tune into your channel because of you. <br /><br /><br /><br /><br /><h3 style=\"text-align: left;\">Living up to our responsibility</h3><br /><br /><br /><br />You’ve heard me say before that my number one priority is to balance our responsibility to protect our community with the responsibility to protect freedom of expression. One of the most common questions I get is about how we make policy changes and why it seems to take so long. <br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-NdiwByJ2zFk/XdXLBs3rdAI/AAAAAAAACZM/M9Dfh1S-HwIu1_zC2fxs9IIbytnN9axSACEwYBhgL/s1600/YT_15.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"701\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-NdiwByJ2zFk/XdXLBs3rdAI/AAAAAAAACZM/M9Dfh1S-HwIu1_zC2fxs9IIbytnN9axSACEwYBhgL/s1600/YT_15.png\" /></a></div><br /><br />These changes take time because, behind the scenes we bring together hundreds of people at YouTube, in consultation with outside experts. When we updated our hate speech policy a few months ago, we consulted with experts in areas like violent extremism, supremacy, civil rights and free speech. These in-depth conversations help us determine how to write guidelines that will protect our community in the long run. We went through a similar process earlier this year when we updated our policy toward pranks and challenges.<br /><br /><br /><br /><br />We need to ensure our policies address how these issues arise in different cultures and languages, and we also want to make sure our policies can be easily understood by users around the world. YouTube trains all of our reviewers before we implement a new policy, so it will be applied consistently, regardless of what country a user is in when they use YouTube. <br /><br /><br /><br /><br />We also make sure that every policy works in practice and not just in theory. Before a new policy is launched, we test to make sure that our reviewers rate content with a high level of accuracy under the new guidelines. If they don’t, we send the guidelines back and try again. We want to ensure that content is consistently rated correctly, rather than rushing through a change.<br /><br /><br /><br /><br />Right now, we’re in the process of updating our harassment policy guidelines, and we’ll keep you posted as they’re finalized. As with all our policy updates, we’re talking with creators to make sure we’re addressing the issues that are most important to the YouTube community.<br /><br /><br /><br /><br />We’re also changing how we treat data for children’s content on YouTube as part of a settlement with the U.S. Federal Trade Commission and the New York Attorney General that addresses <a href=\"https://youtube.googleblog.com/2019/09/an-update-on-kids.html\" target=\"_blank\">COPPA concerns.</a><br /><br /><br /><br /><br />In order to identify content made for kids, we recently implemented a new audience setting where creators must designate whether their content is made for kids. Starting in January, certain features that rely on user data, such as comments and personalized advertising, will no longer be available on content made for kids. We know there are still many questions about how this is going to affect creators and we’ll provide <a href=\"https://www.youtube.com/watch?v=-JzXiSkoFKw\" target=\"_blank\">updates</a>&nbsp;along the way. You can read more about this change <a href=\"https://support.google.com/youtube/thread/13557434\" target=\"_blank\">here</a>.<br /><br /><br /><br /><br />Finally, I wanted to share some thoughts as I’ve spent more time with policymakers around the world, from New Zealand Prime Minister Jacinda Ardern to legislators in Washington, D.C. to regulators in Europe who are translating Article 17, the EU copyright directive previously called Article 13, into local law. In all of these conversations, it’s clear that we need to continue to help people understand the creator economy, how it contributes to jobs around the world, and how regulation could impact your businesses.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-jWuX_vg2Xbk/XdXLdoA-yYI/AAAAAAAACZU/KmfO88tb8iUurCTPIb3ooV8KTacPHyPDACLcBGAsYHQ/s1600/YT_17.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1134\" data-original-width=\"1600\" src=\"https://1.bp.blogspot.com/-jWuX_vg2Xbk/XdXLdoA-yYI/AAAAAAAACZU/KmfO88tb8iUurCTPIb3ooV8KTacPHyPDACLcBGAsYHQ/s1600/YT_17.png\" /></a></div><br /><br /><br />Last year, I wrote to you about how Article 17 could have unintended consequences that might impact your livelihood. Thanks to all of the creator involvement, we were able to make improvements to the legislation — in particular, securing liability protections when we make best efforts to match copyright material with rights owners. This change made a big difference and moved the copyright directive in a better direction for the internet and YouTube. Now it’s up to European countries to turn the legislation into national laws. As the process moves forward, we're meeting with governments and inviting local creators to help explain to legislators how Article 17 could affect creators like you.<br /><br /><br /><br /><br />We’re in this together. We'll continue to keep you posted as we advocate for responsible copyright reform. We hope to see some early drafts of the new legislation in 2020, but it will take a few years for each EU country to implement Article 17.<br /><br /><br /><br /><br />I’d like to close by saying how powerful it is when creators do good work around the world. So many of you were inspired by Mr. Beast and Mark Rober’s <a href=\"https://teamtrees.org/\" target=\"_blank\">#teamtrees challenge</a> to help plant 20 million trees by January 2020. Last month, I was honored to <a href=\"https://www.youtube.com/watch?v=KEA8wis3FIs\" target=\"_blank\">join in the challenge</a> and plant a tree with Mark.<br /><br /><br /><br /><br />The response from creators to #teamtrees has been so impressive. If you keep up this pace, we’ll hit the goal of 20 million trees! We're excited to help creators support their favorite causes with tools like the YouTube Donate button. In the next few months, the Donate button will come   out of beta and become available to thousands of creators in the U.S. — and later expand to more countries — giving you the opportunity to embed a fundraising campaign next to your videos and live streams.<br /><br /><br /><br /><br />It’s so inspiring to see all of your great work. Keep it up! <br /><br /><i>Susan Wojcicki</i><br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"></div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}