{
  "title": "Could Psychedelics Open New Doors for Science and Business?",
  "link": "https://sloanreview.mit.edu/article/could-psychedelics-open-new-doors-for-science-and-business/",
  "comments": "https://sloanreview.mit.edu/article/could-psychedelics-open-new-doors-for-science-and-business/#respond",
  "pubDate": "Thu, 03 Nov 2022 11:00:53 +0000",
  "dc:creator": "Alyson Meister, Kaja Oppegaard, Eric Grotefeld, and Cyril Bouquet. <p>Alyson Meister (<a href=\"https://twitter.com/alymeister\">@alymeister</a>) is a professor of leadership and organizational behavior at the International Institute for Management Development (IMD) in Lausanne, Switzerland. She was recognized as a Thinkers50 Radar thought leader in 2021 and serves as chair of the Scientific Advisory Committee for One Mind at Work. Kaja Oppegaard is a clinical psychologist, counselor, and meditation instructor. For over 25 years, she has been exploring the workings of the mind through clinical intervention, research, meditation, and yoga. Eric Grotefeld is an impact investor and leadership coach. Eric has been actively involved in supporting psychedelic research for some time, with close collaborations at Imperial College London, Synthesis Institute, University of Zurich, and other institutions. Cyril Bouquet is a professor of innovation and strategy at IMD, where he orchestrates innovation journeys for organizations. He is coauthor of <cite>ALIEN Thinking: The Unconventional Path to Breakthrough Ideas</cite> (PublicAffairs, 2021).</p>\n",
  "category": [
    "Creativity",
    "Well-Being",
    "Disruption",
    "Innovation",
    "Work-Life Balance",
    "Workplace, Teams, & Culture"
  ],
  "description": "Psychedelics. Just mentioning the word triggers a wealth of opinions, stigmas, misconceptions, and judgments that are often based on loosely founded assumptions, Hollywood depictions, or stories of good or bad “trips” that linger in our social consciousness and mythology. Putting preconceptions aside, it’s fair to say we are entering what many are calling a psychedelic [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1103_Meister_Workplace_Psychedelics_base_1290x860.gif\" alt=\"\" /><br />\n</figure>\n<p><em>Psychedelics</em>. Just mentioning the word triggers a wealth of opinions, stigmas, misconceptions, and judgments that are often based on loosely founded assumptions, Hollywood depictions, or stories of good or bad “trips” that linger in our social consciousness and mythology. Putting preconceptions aside, it’s fair to say we are entering what many are calling a <a href=\"https://www.newyorker.com/books/under-review/the-science-of-the-psychedelic-renaissance\">psychedelic renaissance</a> — a new science-driven wave of thinking about psychedelics’ use for psychiatry, mental health, and well-being. </p>\n<p>So, what is this reemergence about? </p>\n<h3>The Psychedelic (Re)Emergence in Science and Business</h3>\n<p>First, a primer. Psychedelics have been used by <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyg.2021.729425/full\">ancient societies</a> across the globe for thousands of years, though rigorous scientific research didn’t begin in this field until the 19th and 20th centuries. They are psychoactive substances that affect several cognitive processes in the brain, leading to altered states of consciousness and influencing perceptions, thoughts, and emotions. </p>\n<p></p>\n<p>By the 1950s and 1960s, there was an explosion of research into the use of psychedelics in mental health and illness. However, the counterculture movement, spikes in recreational use (and <a href=\"https://www.sciencedirect.com/science/article/pii/S0028390818300753\">misuse</a>), and political unrest led to such drugs’ stigmatization, which ultimately resulted in psychedelics being classified as Schedule 1 controlled substances in 1970. This made it nearly impossible to continue conducting clinical research.  </p>\n<p>The wider grouping of classic psychedelics includes various classes and varieties, including LSD (“acid”), psilocybin (“magic mushrooms”), DMT (most associated with plants such as ayahuasca), and other psychedelics such as mescaline (found in cacti such as peyote and San Pedro), ketamine, and MDMA (a component in what is known as ecstasy). </p>\n<p>Each can have different mechanisms of effect within the brain, affecting the mind, perception, and behavior. The effects of psychedelics also very much vary by dose: At high doses, they can induce intense emotional experiences and even hallucinations — which can last for hours. At very low doses (referred to as <em>microdoses</em>), individuals self-administer amounts that do not impact their regular functioning.  </p>\n<p></p>\n<p>Over the past decade, <a href=\"https://pubmed.ncbi.nlm.nih.gov/35022823/\">clinical interest in the field of psychedelics</a> has been reignited, and global research institutes are normalizing the conversation and engaging in multidisciplinary studies, with promising results. (This includes research centers at the University of Zurich, Imperial College, the Multidisciplinary Association for Psychedelic Studies, Johns Hopkins University, and Stanford, among several others.) While in some countries, such as Switzerland, psychedelics have been selectively approved — in a highly controlled manner — for psychiatric care and research for decades, there is now more movement in the U.S. to support the Food and Drug Administration’s approval of certain psychedelic substances as medications. </p>\n<p>When it comes to the business world, the global <a href=\"https://www.globenewswire.com/news-release/2021/10/04/2307610/28124/en/The-Psychedelic-Drugs-Market-Global-Industry-Analysis-2018-2020-Growth-Trends-and-Market-Forecast-2021-2026.html\">market for (legal) psychedelic</a> drugs is expected to grow at a 14.5% compound annual growth rate, reaching $6.3 billion by 2026. This is increasingly drawing the attention of business leaders and the investment industry. For example, the 2022 World Economic Forum in Davos, Switzerland, hosted a Medical Psychedelics House, with the goal of bringing together a wealth of scholars and leaders to discuss the future of psychedelics for their potential to revolutionize the field of mental health. Trade associations are popping up around the globe supporting the drugs’ legal research and use, and alongside many smaller ventures, large, publicly traded companies such as Atai Life Sciences and Compass Pathways have <a href=\"https://www.businessinsider.com/psychedelics-industry-growth-pitch-deck-ipo-ceo-interviews?r=US&IR=T\">raised hundreds of millions of dollars in funding</a>. </p>\n<p></p>\n<h3>What Science Shows About the Effects of Psychedelics</h3>\n<p>What are some of the reasons for this explosion of research and investment in psychedelics? Scientific research has uncovered myriad potential applications that could change people’s lives for the better.  </p>\n<p><strong>Mental health and well-being.</strong> First and foremost, in medically controlled studies, psychedelics have been clinically and empirically explored to treat a wealth of diagnosed disorders, such as <a href=\"https://www.sciencedirect.com/science/article/pii/S2215036616300657\">depression</a>, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4086777/\">anxiety</a>, <a href=\"https://www.frontiersin.org/articles/10.3389/fpsyt.2021.735523/full\">anorexia</a>, <a href=\"https://www.mountsinai.org/about/newsroom/2021/repeated-ketamine-infusions-reduce-symptom-severity-in-individuals-with-chronic-post-traumatic-stress-disorder\">post-traumatic stress disorder</a>, various addictions, obsessive-compulsive disorder, and <a href=\"https://pubmed.ncbi.nlm.nih.gov/33184743/\">migraines</a>. In recent trials by Compass Pathways, a single dose of psilocybin, administered in conjunction with psychological support, led to significant improvements in patients with treatment-resistant depression. In healthy individuals, psychedelics have been shown to <a href=\"https://pubmed.ncbi.nlm.nih.gov/35438609/\">enhance mindfulness</a> and increase feelings of connection, compassion, empathy, and general and spiritual well-being — what <a href=\"https://michaelpollan.com/books/how-to-change-your-mind/\">author Michael Pollan</a> has referred to as “the betterment of well people.” </p>\n<p></p>\n<p><strong>Self-awareness and relationships.</strong> Psychedelics have been shown to be potent modulators of social cognition and behavior. As such, they can influence the information we perceive, process, and act upon in relation to other people. Reported benefits include increased <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5581487/\">emotional empathy</a>, better-quality communication, and strengthened relationships. Research shows that psychedelics can offer crucial insights and awareness regarding one’s behavior toward others, increase feelings of connectedness both internally (to one’s emotions) and externally (to others and the world at large), expand one’s access to previously hidden emotions, and lead to the development of a more positive relationship with oneself (through building competency in areas such as self-awareness, self-compassion, and self-worth).  </p>\n<p><strong>Sustained change through neuroplasticity.</strong> <a href=\"https://pubmed.ncbi.nlm.nih.gov/32194129/\">Research reviews</a> highlight that psychedelic substances can support the rewiring of the brain and thus influence enduring change to psychological functioning and behavior. Some of the most commonly studied long-term changes relate to personality, in particular, heightened openness to experience, increased extraversion, and decreased neuroticism. Studies have also examined psychedelics’ effects on attitude, including mood improvement, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3050654/\">well-being and life satisfaction</a>, and a more enduring positive attitude toward oneself, others, and nature. Increased optimism and mindfulness are seen as key to driving some of these positive and more enduring psychological changes. </p>\n<p><strong>Innovation and creativity.</strong> When it comes to creativity, psychedelics may help people exercise cognitive flexibility by activating or deactivating important brain networks that normally tend to work in opposition. In one study, microdosing LSD was found to support the <a href=\"https://journals.sagepub.com/doi/10.1177/02698811211069113\">generation of creative ideas</a> by increasing the novelty, originality, and surprising nature of participants’ responses to problems compared with those of people who received a placebo. Volunteers attending ayahuasca retreats in the Netherlands developed a significantly higher <a href=\"https://www.frontiersin.org/articles/10.3389/fphar.2021.721537/full\">capacity to decenter themselves</a> (that is, see the world from other people’s perspectives), which is known to stimulate original thinking.  </p>\n<p>Creativity is a particularly challenging concept to measure, especially in a lab setting. But at a minimum, the accumulated body of knowledge attests that psychedelics help users boost their capacity for creativity and pursue unusual, less obvious lines of thought. </p>\n<p>Overall, research indicates that most psychedelics are considered <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(10)61462-6/fulltext\">physiologically safe</a>, with low levels of toxicity and fewer <a href=\"https://journals.sagepub.com/doi/full/10.1177/02698811211069100\">adverse effects</a> than other substances, including alcohol. In controlled research studies conducted during the past 30 years, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8905125/\">no lasting psychiatric consequences</a> attributable to psychedelics were reported among participants, and no significant physiological harm or hospitalizations have occurred during more than 2,000 controlled dosing sessions.  </p>\n<p>That said, psychedelics are powerful and potent drugs that should not be abused or exploited. Especially in larger doses, they must be handled ethically and under the care of experienced professionals. It must also be noted that people with personal or family histories of schizophrenia are advised not to take certain psychedelics, such as DMT, because they can trigger psychotic episodes. Intentionally considering both psychological and physical safety (through what is commonly referred to as <a href=\"https://link.springer.com/chapter/10.1007/7854_2021_298\"><em>set</em> and <em>setting</em></a>) and working with experienced professionals are paramount. </p>\n<p></p>\n<p></p>\n<p>So, what does all of this mean for the business world?</p>\n<p>The intent of this article is not to recommend the use of psychedelics in the workplace but to provide insight into a growing but still controversial and stigmatized industry. The psychedelic renaissance is generating momentum and opportunity and sparking new conversations that bridge the worlds of nature, medicine, and management. </p>\n<p>According to a quotation often attributed to Albert Einstein, “You can’t solve a problem with the same level of consciousness that created it.” Thus, at a time when <a href=\"https://www.who.int/news/item/02-03-2022-covid-19-pandemic-triggers-25-increase-in-prevalence-of-anxiety-and-depression-worldwide\">global mental health is in decline</a>, there’s a need for new and innovative solutions to increasingly complex systemic problems, and organizations are calling for leaders with more connectedness, self-awareness, compassion and empathy, psychedelics may indeed have an increasing role to play.  </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/could-psychedelics-open-new-doors-for-science-and-business/feed/",
  "slash:comments": 0
}