{
  "title": "S15 Ep16: Abduction: The Bigfoot Alien Encounter",
  "link": "https://audioboom.com/posts/8098507",
  "itunes:episode": 16,
  "itunes:title": "Abduction: The Bigfoot Alien Encounter",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5288,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio uncovers an Abduction: The Bigfoot Alien Encounter with guest Patti Houtz!<br>\n<br>\nPatti Houtz recounts an incredible experience from her upcoming memoir, “Solo By Choice.” <br>\n<br>\nMs. Houtz has led a most extraordinary life that only got more unusual when she and her boyfriend were employed in the 1970s by an archaeological society to be part of an expedition that went in search<br>\nof Bigfoot in Big Cypress Swamp in the Everglades. Accompanied by two fisherman, eyewitnesses, a photographer from National Geographic and open minds they become witness to a scenario that defies logic. <br>\n<br>\nWas it Bigfoot, Aliens or something even more remarkable? In Patti’s opinion, it is a life-changing moment, and she is only now willing to share the experience with us.<br>\n<br>\nVisit our shop for exciting new items, clothes, books and more: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping. <br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nStart listening with a 30-day Audible trial. Choose 1 audiobook and 2 Audible Originals<br>\nabsolutely free. Visit <a href=\"http://audible.com/btd\">audible.com/btd</a> or text btd to 500-500.",
  "itunes:summary": "Darkness Radio uncovers an Abduction: The Bigfoot Alien Encounter with guest Patti Houtz!\n\nPatti Houtz recounts an incredible experience from her upcoming memoir, “Solo By Choice.” \n\nMs. Houtz has led a most extraordinary life that only...",
  "pubDate": "Sun, 23 Feb 2020 10:00:00 +0000",
  "guid": "16455107-cec3-4c60-b201-e4410db6b4e8",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}