{
  "title": "Millionaire Interview 339",
  "link": "https://esimoney.com/millionaire-interview-339/",
  "comments": "https://esimoney.com/millionaire-interview-339/#comments",
  "dc:creator": "ESI",
  "pubDate": "Wed, 26 Oct 2022 09:00:08 +0000",
  "category": [
    "Interviews",
    "Millionaires"
  ],
  "guid": "https://esimoney.com/?p=8779",
  "description": "<p>Here’s our latest interview with a millionaire as we seek to learn from those who have grown their wealth to high heights. If you’d like to be considered for an interview, drop me a note and we can chat about specifics. This interview took place in June. My questions are in bold italics and their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-339/\">Millionaire Interview 339</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/06/Mortgage-contract-with-mini-house-new.jpg\"><img class=\"alignleft size-medium wp-image-8780\" src=\"https://esimoney.com/wp-content/uploads/2022/06/Mortgage-contract-with-mini-house-new-300x201.jpg\" alt=\"\" width=\"300\" height=\"201\" srcset=\"https://esimoney.com/wp-content/uploads/2022/06/Mortgage-contract-with-mini-house-new-300x201.jpg 300w, https://esimoney.com/wp-content/uploads/2022/06/Mortgage-contract-with-mini-house-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Here’s our latest <a href=\"https://esimoney.com/category/millionaires/\">interview with a millionaire</a> as we seek to learn from those who have grown their wealth to high heights.</p>\n<p>If you’d like to be considered for an interview, <a href=\"https://esimoney.com/contact/\">drop me a note</a> and we can chat about specifics.</p>\n<p>This interview took place in June.</p>\n<p>My questions are in bold italics and their responses follow in black.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>OVERVIEW</strong></span></h4>\n<p><em><strong>How old are you (and spouse if applicable, plus how long you&#8217;ve been married)?</strong></em></p>\n<p>I am 49 years old, and my wife is 47 years old.</p>\n<p>We have been married for 25 years.</p>\n<p><em><strong>Do you have kids/family (if so, how old are they)?</strong></em></p>\n<p>Yes, I have a 21-year-old and a 16-year-old. Both girls.</p>\n<p>We also have two dogs.</p>\n<p><em><strong>What area of the country do you live in (and urban or rural)?</strong></em></p>\n<p>Rural, just outside of Charlotte at Lake Norman. My wife and I wanted to be on the water when we retired.</p>\n<p>When Covid hit we asked ourselves, “what are we waiting for?&#8221; and decided to move to a lake. Lake Norman was perfect as it’s big and 30 miles from a major city (Charlotte).</p>\n<p><em><strong>What is your current net worth?</strong></em></p>\n<p>$3.1 million.</p>\n<p><em><strong>What are the main assets that make up your net worth (stocks, real estate, business, home, retirement accounts, etc.) and any debt that offsets part of these?</strong></em></p>\n<p>We have about around 650k in brokerage accounts. 500k of that is with a financial advisor the other 150k is with me that I play with. Those accounts are made up of mutual funds, stocks, and ETFs.</p>\n<p>We have 10k in crypto, 15k with Fundrise, and 10k with Yieldstreet.</p>\n<p>We keep 40-50k in checking and 185k in savings accounts.</p>\n<p>We have about 700k in equity in our home and the rest is made up of retirement accounts, 1.5 million.</p>\n<p>I stay cash-heavy because my income is commission-based and being in the mortgage industry you can have vast changes in income.</p>\n<p>Once the economy gets more consistent, I will start to invest the cash back into the market. I will always maintain at least 150k in cash. I realize that is more than most but cash gives you options and takes stress off of income swings. I think this is important for self-employed or commission-based earners.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>EARN</strong></span></h4>\n<p><em><strong>What is your job?</strong></em></p>\n<p>I am in the mortgage business and oversee sales and growth. It’s a senior-level position.</p>\n<p>I have been in the industry for 23 years.</p>\n<p><em><strong>What is your annual income?</strong></em></p>\n<p>It varies a good bit on average its 400k range.</p>\n<p>My wife is in the dental industry on the sales and training side and makes 100k.</p>\n<p><em><strong>Tell us about your income performance over time. What was the starting salary of your first job, how did it grow from there (and what you did to make it grow), and where are you now?</strong></em></p>\n<p>My first year in the mortgage business I made 26k. Second yr 55k, 3rd year 100k and from that point on I never made less than six figures.</p>\n<p>My biggest year was 1.1 million. Normal is 400k-500k. I didn’t get to that level until about 2017. Before that it was 200k-300k range. Every 10 years or so you hit it big when a refi boom hits and or the market takes off.</p>\n<p>I moved out of sales and into management five years into my career. Doing this cut back on my income as sales is where the big money is at. Helping others was my passion so I never looked back.</p>\n<p>My wife started as a dental assistant when we were first married. She stayed in that role until the dentist she worked with retired. She then went into dental sales, did that for a while, and then went to manage a practice for three years. She left that job and is in the position she is in now.</p>\n<p>As she gained skills and experience in other areas of the dental world her pay increased gradually. She made low 30s for 3 years, then moved to mid-50s and jumped to 90-100k when she got on the sales side.</p>\n<p><em><strong>What tips do you have for others who want to grow their career-related income?</strong></em></p>\n<p>First is to love what you do. If you want to make good money, you’re going to have to fight like a dog to beat others out as it’s competitive.</p>\n<p>Second, write down your goal. When I graduated college all I wanted to do was make 100k and wrote it down on a small card that I kept on me. Hitting that mark in my third year was more rewarding than making a million later in my career.</p>\n<p>Third, hang out with people who make more money than you do. You will learn a lot from them. For example: how they carry themselves in public, their habits, and how they politic themselves within their company to be in a position for the next level.</p>\n<p>Finally, you must put in the hours. Successful people do what others are not willing to do.</p>\n<p><em><strong>What&#8217;s your work-life balance look like?</strong></em></p>\n<p>I work a lot as I have to be available because I am in sales. However, it’s not hard work.</p>\n<p>I did construction and worked for a moving company when I was in college. That’s hard work.</p>\n<p>With cell phones and tech, my life is intertwined with work, and I think that’s a win given what I am paid. I catch 90% of my kid’s games and activities and I am home most nights.</p>\n<p>My wife’s work is the same except her hours vary now because we are on the east coast, and she is doing a lot on the West Coast. She travels once or twice a month and enjoys that part.</p>\n<p><em><strong>Do you have any sources of income besides your career?</strong></em></p>\n<p>I don’t have any other sources of income.</p>\n<p>I have tried buying investment properties, building houses, and trading stocks, all with limited success.</p>\n<p>What I have found is the amount of time it takes to get up to speed and then actually do it takes away from what I do best &#8212; which are mortgages.</p>\n<p>For example, we had an investment property for years and the net return on it over a 20-year term was 4.0%. For the work it required, I could have just bought a real estate ETF and got the time back that I spent on managing and maintaining it.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>SAVE</strong></span></h4>\n<p><em><strong>What is your annual spending?</strong></em></p>\n<p>To be honest I don’t track it. If my checking accounts hits 30k we tighten up. I hate budgets and I like to spend money.</p>\n<p>The family I came from were super savers and I think it affected how I looked at the money. I have plenty of friends who have saved more than I have but it has come at a cost of enjoying life and having some fun.</p>\n<p>The real winners to me are those who can balance the two &#8212; make enough to buy toys and/or experiences but at the same time save enough to help your family and others and not become someone else’s burden later in life.</p>\n<p>Think about it, if you&#8217;re saving an extra 5-10% now for when your 70. I think you would enjoy the money now more than then. Odds are you are more active now than when you are at that age. No judgment either way from me, but this is based on what I have observed in my life.</p>\n<p><em><strong>What are the main categories (expenses) this spending breaks into?</strong></em></p>\n<p>We try to keep our fixed expenses at a minimum.</p>\n<p>The only payment we have is our house payment and its around 3700.</p>\n<p>Cars are paid for and if we finance them, it’s for a year or less.</p>\n<p>All toys are paid for in cash for the most part.</p>\n<p><em><strong>Do you have a budget? If so, how do you implement it?</strong></em></p>\n<p>No budget as I don’t like them.</p>\n<p>I run all the finances and if the checking account drops to 30k we tighten up.</p>\n<p>Tightening up looks like eating out less, no travel, and putting projects and toys on hold.</p>\n<p><em><strong>What percentage of your gross income do you save and how has that changed over time?</strong></em></p>\n<p>At a minimum it’s 10%, sometimes it gets as high as 25% if I am having a big year.</p>\n<p>Over time that has changed as we had more disposable income. When we were both starting out it was hard, but we still saved in retirement accounts as a minimum.</p>\n<p><em><strong>What&#8217;s your best tip for saving (accumulating) money?</strong></em></p>\n<p>I am a natural spender and not a saver.</p>\n<p>What we do is auto deposits before we can get our hands on it. Max out your 401k, X amount auto-drafted to your brokerage account and other accounts you’re using to grow money. By doing this we don’t miss the money and I use our checking balance as a gauge of what we can do for the month.</p>\n<p>Although it’s not saving I also round-up on my mortgage payment. For example: if the mortgage payment is 2820. I would round up to 2900.</p>\n<p><em><strong>What&#8217;s your best tip for spending less money?</strong></em></p>\n<p>Enjoy shopping and looking for deals.</p>\n<p>I love looking for good deals. We usually only buy clothes and goods on sale. The same goes for vacations and travel.</p>\n<p>Have drinks before you go out to eat. Cut back on going out to eat if you’re in a jam.</p>\n<p>Shop all your insurance and go with a big deductible. Insurance companies don’t gamble &#8212; having a big deductible offsets that.</p>\n<p><em><strong>What is your favorite thing to spend money on/your secret splurge?</strong></em></p>\n<p>I like cars, toys and having a good time. We have two sports cars, one boat, and two jet skis. We have another car that we share that is practical.</p>\n<p>I also golf and we like to go on mini vacations.</p>\n<p>We have no problem spending money.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>INVEST</strong></span></h4>\n<p><em><strong>What is your investment philosophy/plan?</strong></em></p>\n<p>We have a financial planner. We tell him our goals and he manages the brokerage account and all the retirement.</p>\n<p>My personal philosophy is to invest in what you know and stay in the U.S. Some advisors will tell you that 25% of your portfolio needs to be in international. My experience has been it never pays off. The world economy runs through the US, end of story.</p>\n<p>Go opposite of the crowd. If the market is down, buy a little more than usual. If it’s up, take a little of the top.</p>\n<p>Make sure you are diversified; you don’t know what you don’t know.</p>\n<p><em><strong>What has been your best investment?</strong></em></p>\n<p>Time, consistency, and positive cash flow have been my best investment.</p>\n<p>Put the money into the general market in a number of stocks, ETFs, and mutual funds and watch it grow.</p>\n<p>Keeping fixed expenses low holds the pressure down and allows us to adjust spending quickly if pay changes.</p>\n<p><em><strong>What has been your worst investment?</strong></em></p>\n<p>Life lesson here. I was in the mortgage business in 2008 when the financial world collapsed. The company I worked for matched dollar for dollar in stock via the 401k plan. I never sold the stock, and the company went under. It ended up costing us around 250k which at the time was half our savings.</p>\n<p>I also bought a rental property because of the location and didn’t figure in the cost of upkeep. Run all your numbers before buying investment properties.</p>\n<p>The third was raw land, I got a good deal on a large amount of acreage. The problem was you couldn’t get financing on it. I had to sell it at an auction to get rid of it at a loss. The lesson from that is if people can’t finance something it’s hard to sell.</p>\n<p><em><strong>What&#8217;s been your overall return?</strong></em></p>\n<p>I would estimate 6.5%.</p>\n<p>It’s important to point out that I got into the stock market in 1999. Returns were flat until 2012.</p>\n<p>Everything is all about timing, if you got into the market in 2012 you have had some great returns. If you just started this year your getting killed.</p>\n<p>Good news is if you hang in there it will average out better than most investments.</p>\n<p><em><strong>How often do you monitor/review your portfolio?</strong></em></p>\n<p>I look at retirement funds about once a quarter.</p>\n<p>My play money brokerage account I am in every other day.</p>\n<p>If I get worried about the market or have a life change event, I do reach out to my financial advisor to play out my options and go over a plan.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>NET WORTH</strong></span></h4>\n<p><em><strong>How did you accumulate your net worth?</strong></em></p>\n<p>We made most of our money by investing in our 401ks, not touching it, and never spending the equity in the homes we bought over the years.</p>\n<p>The rest was auto savings and not spending it.</p>\n<p>We also make good money and it’s increased over the years.</p>\n<p>Once you save over 500k it can really start growing quickly.</p>\n<p>We had no inheritance, and I wouldn’t say we are savers like you see online, it’s just consistent and we don’t touch it.</p>\n<p>I also came out of college with no debt. My parents covered the cost of school and I worked as well to cover living expenses. That helped as well.</p>\n<p><em><strong>What would you say is your greatest strength in the ESI wealth-building model (Earn, Save or Invest) and why would you say it&#8217;s tops?</strong></em></p>\n<p>Earning and investing is our greatest strength.</p>\n<p>I don’t think our returns have been the best and I can honestly say we never made a ton of money on selling a home. I know that sounds crazy since I am in the mortgage business, but it just never worked out.</p>\n<p>We could have saved more but it just wasn’t worth the time or loss of memories or good times. <a href=\"https://esimoney.com/life-is-short-retire-early/\">Life is short</a>.</p>\n<p><em><strong>What road bumps did you face along the way to becoming a millionaire and how did you handle them?</strong></em></p>\n<p>The 2008 financial crisis was the biggest. We lost half our 401k, and I was also in the mortgage business which was tough for 3-4 years.</p>\n<p>We overspent on renovating a home and that added up to about a 100k loss.</p>\n<p>Early on we blew money on cars that we didn’t need or were not a good deal. What I learned from that is this: buy cars that don’t depreciate as much as a regular car. How? Buy used sports cars, trucks, or popular SUVs.</p>\n<p><em><strong>What are you currently doing to maintain/grow your net worth?</strong></em></p>\n<p>We are maxing out our 401k’s, HSA’s and investing what we can.</p>\n<p>We have about 700k equity in our home and our rate is only 2.625. We will pay it down at some point because cash flow is king.</p>\n<p>If I could give anyone one piece of advice it would be positive cash flow. Without it in personal or business you are going under.</p>\n<p><em><strong>Do you have a target net worth you are trying to attain?</strong></em></p>\n<p>Yes, I have a goal of 20 million.</p>\n<p>I never plan to really retire as my dad retired early and he is no happier now than when he was working.</p>\n<p>We have saved enough to have a good retirement as is. Because of that I am now in the process of buying into a company. My hope is being an owner of a company will take us to the next level of income.</p>\n<p><em><strong>How old were you when you made your first million and have you had any significant behavior shifts since then?</strong></em></p>\n<p>I think we were 40-42. The only major change since then was the size of the house we bought. We moved to Atlanta and bought a bigger home and got a bigger mortgage. We went from 500k house to 700k house.</p>\n<p>When we moved to the lake, we jumped to a 900k house. The thought was with one lake house and no others it would be cheaper than having a primary residence and a second home.</p>\n<p><em><strong>What money mistakes have you made along the way that others can learn from?</strong></em></p>\n<p>I would never hold a company-matched stock in my 401k. If they are matching with stock, I would sell them and diversify.</p>\n<p>We never saved for college for our kids. My oldest just graduated and that’s real money. Get a 529 and put a little in early, it will ease the burden later.</p>\n<p><em><strong>What advice do you have for ESI Money readers on how to become wealthy?</strong></em></p>\n<p>Invest early in your retirement accounts and learn how to save. <a href=\"https://esimoney.com/the-best-way-to-maximize-your-investment-return/\">Time is your best friend</a> or worst enemy when it comes to investing.</p>\n<p>Second, buy a home that needs a little work. You will get a better deal and gain some equity along the way. Just don’t go overboard on renovating or making changes to it.</p>\n<p><a href=\"https://esimoney.com/the-cost-of-divorce/\">Don’t get divorced</a>. I see people’s financials every day. Divorce will wreck your finances.</p>\n<p>Buy used cars not new ones. I wouldn’t lease cars either, rarely is it a good deal.</p>\n<p>Use auto drafts to invest it and forget it.</p>\n<p>When getting a mortgage look at longer-term arms &#8212; 7 and 10 yr specifically. People are rarely in a home that long with the same mortgage. It can save you hundreds of dollars in payments. We have never had a fixed-rate mortgage ever.</p>\n<p>Make sure you’re solving for a positive cash flow no matter what. That’s hard for someone starting out.</p>\n<p>When we were first married all of our friends were going on vacations and traveling, we didn’t. It was major FOMO but we didn’t have the money and wouldn’t put it on a credit card.</p>\n<p>This is the most important, so I saved it for the last. Learn how to save when you don’t have money. If you can save when you are broke it will be easy once you start making some money.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>FUTURE</strong></span></h4>\n<p><em><strong>What are your plans for the future regarding lifestyle?</strong></em></p>\n<p>My plans are to keep working and saving.</p>\n<p>We save money because it gives us options and buys us time.</p>\n<p>My wife will retire or stop working once my youngest is out of college. This is assuming she wants to. She’s type A so who knows.</p>\n<p>Once we are empty nesters we will travel more.</p>\n<p><em><strong>What are your retirement plans?</strong></em></p>\n<p>I plan on always working at some level. I enjoy work and gives me purpose.</p>\n<p>Over time we will travel more, and the rest will depend on our girls and where they are.</p>\n<p>We do what we do to make sure everyone in the family has a good shot of success.</p>\n<p><em><strong>Are there any issues in retirement that concern you? If so, how are you planning to address them?</strong></em></p>\n<p>Yes, I worry about what the market is going to do.</p>\n<p>What no one tells you is that if the market drops 20% it takes you that much longer to make up the difference.</p>\n<p>All I can really do is keep saving and make sure we are diversified. Doing that and keeping our fixed expenses low is the plan.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>MISCELLANEOUS</strong></span></h4>\n<p><em><strong>How did you learn about finances and at what age did it &#8220;click&#8221;?</strong></em></p>\n<p>I learned early the basics as my dad was a super saver and was also in sales. He hammered into my head the positive cash flow rule and I am thankful for that.</p>\n<p>I learned the rest from hanging out with people who made more money than me. Saving early and maxing out your 401k, don’t leave beyond your means.</p>\n<p>Being in the mortgage business also helped because I could see what people were making and spending money on.</p>\n<p>I do read a lot about the markets and finance because I enjoy it and its part of my job.</p>\n<p><em><strong>Who inspired you to excel in life? Who are your heroes?</strong></em></p>\n<p>My wife and I came from great families, and both made good livings but were grounded. It was more like a standard.</p>\n<p>I have a disabled uncle who no one thought would live past 30 or have a life of his own. He is now 65, owns his own home, and functions as a solid member of society. Any time I start throwing a pity party I think of all he had to overcome to be where he is at.</p>\n<p>If you focus, write down your goals and work towards them you can do anything.</p>\n<p><em><strong>Do you have any favorite money books you like/recommend? If so, can you share with us your top three and why you like them?</strong></em></p>\n<p>I listen to a book a week when I am driving or working out. That’s a great life hack.</p>\n<p>Shoe Dog by Phil Knight is one of my favorites. If you read that you will understand what it’s like to really do what you love and at the same time embrace the grind.</p>\n<p>The Storyteller by Dave Grohl is along the same lines although it’s not a business book.</p>\n<p>Secrets of Closing the Sale by Zig Ziglar. Every salesperson needs to read it. It’s the baseline for all the new guys you see on social media.</p>\n<p>The 4-Hour Work Week by Tim Ferris. It changed how I viewed retirement.</p>\n<p><em><strong>Do you give to charity? Why or why not? If you do, what percent of time/money do you give?</strong></em></p>\n<p>We give to causes and people that we think need help.</p>\n<p>A lot of it these days is Go Fund Me donations for friends and friends of friends who need help.</p>\n<p>We also support our local high school girl athletics. Why? Girl sports need it more than the others.</p>\n<p><em><strong>Do you plan to leave an inheritance for your heirs (how do you plan to distribute your wealth at your death)? What are your reasons behind this plan?</strong></em></p>\n<p>Yes, we will leave money to our girls and probably to whatever causes we get involved with later in life.</p>\n<p>We want to make sure everyone in the family is in the best position possible for the next stage in life.</p>\n<p>Money doesn’t buy happiness, friends and family do that. However, money does give you options.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-339/\">Millionaire Interview 339</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-interview-339/feed/",
  "slash:comments": 6
}