{
  "id": "yt:video:O5d1Cclk5QA",
  "yt:videoId": "O5d1Cclk5QA",
  "yt:channelId": "UCqnbDFdCpuN8CMEg0VuEBqA",
  "title": "The Best Chef in the World | Op-Docs",
  "link": "",
  "author": {
    "name": "The New York Times",
    "uri": "https://www.youtube.com/channel/UCqnbDFdCpuN8CMEg0VuEBqA"
  },
  "published": "2022-09-13T16:00:23+00:00",
  "updated": "2022-10-21T14:34:17+00:00",
  "media:group": {
    "media:title": "The Best Chef in the World | Op-Docs",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "When my father died, he held disappointment in his heart. He was 66 and had only just retired from a life of 80-hour workweeks as a successful lawyer, and this next chapter promised everything he had skimped on since deciding to go to law school: family time, creative pursuits, fun.\n\nHis liver paid no mind, however, and he died on the morning of May 1, 2020. Four days later, I interviewed Sally Schmitt, bathed in golden Californian light, via Zoom, from the damp and shadowy basement of my parents’ home in Nova Scotia.\n\nAs a filmmaker and entrepreneur, I had always admired and studied the chef Thomas Keller, a walking pinnacle of craftsmanship, refinement and success — my father’s kind of guy. I had only recently learned about Ms. Schmitt, a pioneer of the Napa Valley culinary scene and the creator of the French Laundry, the restaurant Mr. Keller made world-famous. Talking to Ms. Schmitt that morning, I learned she held a different kind of wisdom: that success may have other definitions.\n\nMs. Schmitt died on March 5, 2022. But in \"The Best Chef in the World,\" she shares with delightfully coy candor a message about the rewards of balance and the trap of ambition. I made this film for all of us who struggle “to stir and taste the soup” that already sits in front of us. Perhaps with time and Ms. Schmitt’s example, we will.\n\n- by Ben Proudfoot\n\nCredits\nDirector: Ben Proudfoot\nEditors: Nick Garnham Wright \nFeaturing: Sally Schmitt\nCinematographer: Brandon Somerhalder, David Bolen\nOriginal Score Composition and Orchestration: Katya Richardson\nSupervising Sound Editor and Re-Recording Mixer: Sean Higgins\nColorist: Stephen Derluguian\nSenior Post Production Supervisor: Dillon Brown\nPost Production Supervisor: Laura Carlson\nCo-Producers: Beatriz Browne, Abby Lynn Kang Davis, Gabriel Berk Godoi, Rachel Greenwald, Brandon Somerhalder\nAssociate Producers: Elizabeth Brooke, Sarah Stewart\nArchival Producer: Sarah Stewart\nOnline Editor: Tyler Ten Haken\nAssistant Editor : Cody Wilson\nSecond Unit First Assistant Camera: Jordan Scott\nStory Reporting: Kirstin Falk\nArchival Digitization: Hannah Auslander\nSound Effects Editor: Tom Boykin\nFoley Services: POSTRED\nFoley Artist: Biko Gogaladze\nFoley Mixer: Giorgi Lekishvili\nFoley Editor: Alexander Sanikidze\nScoring Mixer: Shachar Boussani\nMusicians: Dominic Flynn, Ian Gottlieb, Vasilije Katanic, Nick Kennerly, Katya Richardson, Jonathan Schlitt, Niall Taro\n\nRead more: \n\nMore from The New York Times Video: \nSubscribe: http://bit.ly/U8Ys7n​​\nWatch all of our videos here: http://nytimes.com/video​​\nFacebook: https://www.facebook.com/nytvideo​​\nTwitter: https://twitter.com/nytvideo​​\n----------\nOp-Docs is a forum for short, opinionated documentaries by independent filmmakers. Learn more about Op-Docs and how to submit to the series. Follow The New York Times Opinion section on Facebook, Twitter and Instagram (@NYTopinion).",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}