{
  "title": "Something Doesn't Feel Right | Best of RGSO",
  "link": "https://audioboom.com/posts/8117331",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2176,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What was the source of anxiety a darkness that slowly lurked into the life an unsuspecting child?<br>\nHere is a preview of the story.<br>\n“Parents were at work; sisters were out with their friends, and I was just enjoying having the house to myself and all the power of the tv remote all mine! But things turned a little sideways when across the room in the kitchen doorway a voice called out. \"Mom?\" Just one simple little phrase came from the voice of a little girl. I turned to look into the kitchen at the EXACT same time that the dog did! We both heard the same voice! Again, I was the only one home and I made sure to check if anyone was home by calling everybody. In the end there was no explanation for the little girl's voice. The voice was too young sounding to be either of my sisters. And again, even the dog heard the same voice from the same doorway! I sat staring at the doorway while all the hair on my body stood one end. I heard the dog shift from her spot, and she stood up and bowed her head sniffing at the doorway staring at it as well. That was enough for me! I shut the tv off and me and the dog both went out for a walk until my parents came home. I was not staying there by myself. I tried to tell myself it was just my mind playing tricks on me. But the voice was so clear and even the dog heard it! The voice was real, and there was no one LIVING in the house at the time. As days progressed two more members of my family heard the voice including my own mother.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 09 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-08:/posts/8117331",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}