{
  "title": "Biden’s “Plan” To Fix Inflation Is Insulting To Your Intelligence",
  "itunes:title": "Biden’s “Plan” To Fix Inflation Is Insulting To Your Intelligence",
  "pubDate": "Fri, 03 Jun 2022 05:00:01 +0000",
  "guid": "05b48f67-3ec6-4b77-8020-8596f867d9ec",
  "link": "https://thejimmydoreshow.libsyn.com/bidens-plan-to-fix-inflation-is-insulting-to-your-intelligence",
  "itunes:image": "",
  "description": "Joe Biden recently published an opinion piece in the Wall Street Journal detailing his plan, to the extent he has one, to deal with the inflation crisis. What the opinion piece reveals, more than anything else, is that Biden not only has no real conception of what is causing prices to rise, but he also is woefully short on ideas for what to do about the problem.  Jimmy and Professor Richard Wolff discuss the spiraling down of the Biden presidency as prices skyrocket.<br /> <br /> Plus a segment on certain municipalities in the United States ending minor traffic stops to prevent police from escalating conflicts with motorists and possibly killing them.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger, Jackson Hinkle and Mike MacRae! And phone calls from David Axelrod and Prince Charles!",
  "content:encoded": "Joe Biden recently published an opinion piece in the Wall Street Journal detailing his plan, to the extent he has one, to deal with the inflation crisis. What the opinion piece reveals, more than anything else, is that Biden not only has no real conception of what is causing prices to rise, but he also is woefully short on ideas for what to do about the problem.  Jimmy and Professor Richard Wolff discuss the spiraling down of the Biden presidency as prices skyrocket.  Plus a segment on certain municipalities in the United States ending minor traffic stops to prevent police from escalating conflicts with motorists and possibly killing them.  Also featuring Stef Zamorano, Kurt Metzger, Jackson Hinkle and Mike MacRae! And phone calls from David Axelrod and Prince Charles!",
  "enclosure": "",
  "itunes:duration": "58:47",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Joe Biden recently published an opinion piece in the Wall Street Journal detailing his plan, to the extent he has one, to deal with the inflation crisis. What the opinion piece reveals, more than anything else, is that Biden not only has no real...",
  "itunes:episodeType": "full",
  "itunes:summary": "Joe Biden recently published an opinion piece in the Wall Street Journal detailing his plan, to the extent he has one, to deal with the inflation crisis. What the opinion piece reveals, more than anything else, is that Biden not only has no real conception of what is causing prices to rise, but he also is woefully short on ideas for what to do about the problem.  Jimmy and Professor Richard Wolff discuss the spiraling down of the Biden presidency as prices skyrocket. Plus a segment on certain municipalities in the United States ending minor traffic stops to prevent police from escalating conflicts with motorists and possibly killing them. Also featuring Stef Zamorano, Kurt Metzger, Jackson Hinkle and Mike MacRae! And phone calls from David Axelrod and Prince Charles!"
}