{
  "title": "76: Dr. Eric Maisel- Your Difficult Family: Eight Skills for Thriving in Any Family Situation",
  "pubDate": "Tue, 25 Jul 2017 05:41:00 +0000",
  "guid": "b7f5352da590b4e29bc850d2081afc83",
  "link": "https://lifeonpurpose.libsyn.com/76-dr-eric-maisel-your-difficult-family-eight-skills-for-thriving-in-any-family-situation",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #76</strong>, my guest is <strong>Dr. Eric Maisel</strong>, a retired family therapist, active life coach, and the author of more than fifty books.<br /> <br /> <strong>Eric</strong> was one of my first guests on <strong>Life on Purpose</strong> and returns to the show for a wide-ranging conversation on meaning, life purpose, and the epidemic of phantom \"mental disorders\" in children. And we focus on his new book, <em>Your Difficult Family: 8 Skills for Thriving in Any Family Situation</em>, in which he shows how to stay sane when family isn’t, providing practical strategies that can be implemented immediately.  <br /> <br /> This empowering book is a “field guide” to common types of dysfunctional families, and a big helping of real life success stories that are dinner table tested and approved. Readers will learn to maintain inner peace in the midst of family chaos and maybe even create a better life for their whole family.<br /> <br /> <em>“There is no pill that can make family life easy. There is no pill that can spare you pain if one of your parents is alcoholic, one of your children is troubled, or your mate is cheating on you. M. Scott Peck begins The Road Less Traveled with a simple, eloquent announcement: “Life is difficult.” Tolstoy famously begins Anna Karenina in an equally eloquent way: “All happy families are alike; each unhappy family is unhappy in its own way.”\"</em><br /> <br /> About: <strong>Eric Maisel</strong> was born in the Bronx, New York, where he lived until the age of 5. He grew up in Brooklyn, attended Stuyvesant High School in Manhattan, and briefly attended Brooklyn College. After serving in the Army from 1965 – 1968 he attended Oregon State University and the University of Oregon, where he received a B.S. in philosophy.<br /> <br /> Dr. Maisel subsequently lived in Boston, New York and San Francisco and traveled extensively in Europe, spending time in London, Dublin and Budapest. He earned a master’s degree in creative writing from San Francisco State University while ghostwriting mysteries and nonfiction and self-publishing fiction. In the ’80s he returned to school and earned a second bachelor’s degree in psychology, a second master’s degree in counseling, and a doctorate in counseling psychology.<br /> <br /> After completing training, Dr. Maisel became a California licensed family therapist and worked exclusively with creative and performing artists. In time he moved from therapy and the medical model to coaching, where he founded the profession of creativity coaching.<br /> <br /> Dr. Maisel has a son, David Maisel, by his first marriage, and two daughters, Natalya Maisel and Kira Maisel, with his wife Ann Mathesius Maisel. In 2012 Eric and Ann celebrated 35 years together.  They live in the San Francisco Bay Area.<br /> <br /> Dr. Maisel served as adjunct faculty at St. Mary’s College (Moraga, California) for ten years and created and wrote Callboard Magazine’s Staying Sane in the Theater column. He has presented lectures and workshops for the American Psychological Association, the California Association of Marriage and Family Therapists, the Paris Writers Workshop, the North Carolina School of the Arts, the Savannah College of Arts and Crafts, the U. C. Berkeley Counseling Center, and many other venues.<br /> <br /> Dr. Maisel has been a guest on, quoted in, or interviewed by Redbook, Glamour, Cosmo Teen, Men’s Health, Body and Soul, KRON television news, Martha Stewart Living, Self, Marin Magazine, The San Francisco Chronicle, The New York Daily News, The Arizona Republic, Common Boundary, and has provided hundreds of radio, television, and print interviews.<br /> <br /> Dr. Maisel has been the keynote speaker at the Jack London Writer’s Conference, Pikes Peak Writer’s Conference, William Saroyan Writer’s Conference, Indiana Arts’ Administrators Conference, Mendocino Writer’s Conference, Santa Fe Conference on Creative Tourism, Arizona State University Arts & Letters Convocation, and many other conferences.<br /> <br /> He presents workshops at the Omega Institute, the Kripalu Center for Yoga and Health, the Esalen Institute, The Hollyhock Centre (in Canada), the Open Center, and Rowe; and at locations worldwide, including in San Francisco, New York, London, Paris, Antwerp, Prague, and Berlin.<br /> <br /> Dr. Maisel writes the Rethinking Mental Health blog for Psychology Today online, a monthly print column for Professional Artist Magazine, and occasional pieces for the Huffington Post. He hosted a hundred episodes of The Joy of Living Creatively and Your Purpose-Centered Life with the Personal Life Media Network and provides core trainings for the Creativity Coaching Association.<br /> <br /> To learn more about <strong>Dr. Maisel's</strong> work, visit: <a href=\"http://ericmaisel.com/\" target= \"_blank\">http://ericmaisel.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #76, my guest is Dr. Eric Maisel, a retired family therapist, active life coach, and the author of more than fifty books.  Eric was one of my first guests on Life on Purpose and returns to the show for a wide-ranging conversation on meaning, life purpose, and the epidemic of phantom \"mental disorders\" in children. And we focus on his new book, <em>Your Difficult Family: 8 Skills for Thriving in Any Family Situation</em>, in which he shows how to stay sane when family isn’t, providing practical strategies that can be implemented immediately.    This empowering book is a “field guide” to common types of dysfunctional families, and a big helping of real life success stories that are dinner table tested and approved. Readers will learn to maintain inner peace in the midst of family chaos and maybe even create a better life for their whole family.  <em>“There is no pill that can make family life easy. There is no pill that can spare you pain if one of your parents is alcoholic, one of your children is troubled, or your mate is cheating on you. M. Scott Peck begins The Road Less Traveled with a simple, eloquent announcement: “Life is difficult.” Tolstoy famously begins Anna Karenina in an equally eloquent way: “All happy families are alike; each unhappy family is unhappy in its own way.”\"</em>  About: Eric Maisel was born in the Bronx, New York, where he lived until the age of 5. He grew up in Brooklyn, attended Stuyvesant High School in Manhattan, and briefly attended Brooklyn College. After serving in the Army from 1965 – 1968 he attended Oregon State University and the University of Oregon, where he received a B.S. in philosophy.  Dr. Maisel subsequently lived in Boston, New York and San Francisco and traveled extensively in Europe, spending time in London, Dublin and Budapest. He earned a master’s degree in creative writing from San Francisco State University while ghostwriting mysteries and nonfiction and self-publishing fiction. In the ’80s he returned to school and earned a second bachelor’s degree in psychology, a second master’s degree in counseling, and a doctorate in counseling psychology.  After completing training, Dr. Maisel became a California licensed family therapist and worked exclusively with creative and performing artists. In time he moved from therapy and the medical model to coaching, where he founded the profession of creativity coaching.  Dr. Maisel has a son, David Maisel, by his first marriage, and two daughters, Natalya Maisel and Kira Maisel, with his wife Ann Mathesius Maisel. In 2012 Eric and Ann celebrated 35 years together.  They live in the San Francisco Bay Area.  Dr. Maisel served as adjunct faculty at St. Mary’s College (Moraga, California) for ten years and created and wrote Callboard Magazine’s Staying Sane in the Theater column. He has presented lectures and workshops for the American Psychological Association, the California Association of Marriage and Family Therapists, the Paris Writers Workshop, the North Carolina School of the Arts, the Savannah College of Arts and Crafts, the U. C. Berkeley Counseling Center, and many other venues.  Dr. Maisel has been a guest on, quoted in, or interviewed by Redbook, Glamour, Cosmo Teen, Men’s Health, Body and Soul, KRON television news, Martha Stewart Living, Self, Marin Magazine, The San Francisco Chronicle, The New York Daily News, The Arizona Republic, Common Boundary, and has provided hundreds of radio, television, and print interviews.  Dr. Maisel has been the keynote speaker at the Jack London Writer’s Conference, Pikes Peak Writer’s Conference, William Saroyan Writer’s Conference, Indiana Arts’ Administrators Conference, Mendocino Writer’s Conference, Santa Fe Conference on Creative Tourism, Arizona State University Arts & Letters Convocation, and many other conferences.  He presents workshops at the Omega Institute, the Kripalu Center for Yoga and Health, the Esalen Institute, The Hollyhock Centre (in Canada), the Open Center, and Rowe; and at locations worldwide, including in San Francisco, New York, London, Paris, Antwerp, Prague, and Berlin.  Dr. Maisel writes the Rethinking Mental Health blog for Psychology Today online, a monthly print column for Professional Artist Magazine, and occasional pieces for the Huffington Post. He hosted a hundred episodes of The Joy of Living Creatively and Your Purpose-Centered Life with the Personal Life Media Network and provides core trainings for the Creativity Coaching Association.  To learn more about Dr. Maisel's work, visit: <a href=\"http://ericmaisel.com/\" target= \"_blank\">http://ericmaisel.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "54:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #76, my guest is Dr. Eric Maisel, a retired family therapist, active life coach, and the author of more than fifty books.  Eric was one of my first guests on Life on Purpose and returns to the show for a wide-ranging...",
  "itunes:episodeType": "full"
}