{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-5414580019437232550",
  "published": "2022-10-14T17:12:00.010-05:00",
  "updated": "2022-10-20T08:52:42.488-05:00",
  "category": [
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "More UK finance regulatory failure",
  "content": "<p>In previous blog posts<a href=\"https://johnhcochrane.blogspot.com/2022/09/a-familiar-finance-fable-in-uk-bonds.html\" target=\"_blank\"> here </a>and <a href=\"https://johnhcochrane.blogspot.com/2022/10/uk-finance-fable-update.html\">here</a>, I criticized UK financial regulators for missing simple leverage and margin requirements in UK pension funds. To be clear, I don't criticize the people. The point is, if after 10 years of intense regulation, a group of really smart and dedicated people can't see plain old leverage, the whole project of regulating risks is broken. And it's not just the UK. The Fed bailed out money market funds in 2020. Again.&nbsp;</p><p>I insinuated the regulators were not paying attention. I was wrong. It turns out they <i>were </i>paying attention. Which makes the failure all the more stark. &nbsp;</p><p>In Friday's Wall Street Journal, <a href=\"https://www.wsj.com/articles/as-bond-investors-bets-blow-up-they-might-usher-in-era-of-higher-rates-11665658801\" target=\"_blank\">Greg Ip writes</a>&nbsp;</p><blockquote><p>In 2018, the Bank of England investigated whether a big rise in interest rates would trigger a cascade of forced selling by bond investors, destabilizing the financial system. The answer was no,&nbsp;</p></blockquote><p>That they <i>did</i> think about it, and they missed it anyway is even more damning for the regulate-risks project.&nbsp;</p><p><span></span></p><a name='more'></a>Part of the explanation:&nbsp;<p></p><blockquote><p>even if long-term rates rose a full percentage point in a week, which had never happened in records going back to 1990.</p></blockquote><blockquote><p>In the days surrounding the British government’s tax-cut announcement on Sept. 23, yields on British government bonds, called gilts, gyrated as much as 1.27 points in a single day&nbsp;</p></blockquote><p>This is part of the problem of regulation. Regulators test a single number, 1.00000 percent rise. But 1.27%? The world ends. Also it's fairly easy to make a strategy that is safe up to 1.0000 percent but blows up at 1.0001 percent.&nbsp;</p><blockquote><p>“The speed and scale of the moves in gilt yields was unprecedented,” the bank explained in a letter to Parliament. The refrain sounded familiar: the stock market crash of 1987, the near-failure of hedge fund Long-Term Capital Management in 1998, and the housing and mortgage crisis of 2007-09 were all precipitated by financial prices moving violently, by magnitudes outside historical experience.&nbsp;</p></blockquote><p>Isn't the point of regulation and stress testing to worry about \"unprecedented\" events? After all, one might trust markets to think about precedented events. And, as the rest of the paragraph points out, it does seem like we're getting 100 year floods every 2 or 3 years these days.&nbsp;</p><p>The regulators even thought about derivatives and margin. Kudos. They just got the answer wrong.&nbsp;</p><blockquote><p>In its November, 2018 financial stability report, the Bank of England included a lengthy analysis of leverage at pension funds, hedge funds, insurance companies and other “nonbanks.” It was mostly concerned that margin calls could lead to forced sales of assets that the market couldn’t absorb without big price moves. It concluded any such selling would be small “as a proportion of the total demand on market liquidity,” even if rates rose a full percentage point in a single day or week, which “has never been experienced in 10-year sterling swap rates looking back to 1990. Even over a month, it would be a 1-in-1,000 event,” plenty of time for a relatively smooth adjustment, BOE wrote.</p></blockquote><p>Is it cheeky to point out that climate risk to the financial system has never happened in 1000 years? &nbsp;</p><blockquote><p>In part thanks to those benign assumptions, the notional value of LDIs soared from £400 billion in 2011 to £1.6 trillion, equivalent to $1.7 trillion, last year, a staggering sum. This indirectly put downward pressure on long-term interest rates, making investors’ expectation of low rates partly self-fulfilling. But as high inflation sent rates higher this year, the opposite happened. LDI positions began to lose money. The jump in yields following the tax-cut announcement triggered widespread margin calls and forced liquidation of positions. A strategy that had once amplified downward pressure on rates is now doing the opposite.</p></blockquote><p>When regulators bless risk taking, that absolves market participants of a lot of due diligence. Like the FDA approving a pill. So regulatory blindness can make matters even worse.&nbsp;</p><p>Again, it's not the people, it's the system. Allowing massive leverage but trusting regulators to regulate risk is broken. &nbsp;</p><p>***&nbsp;</p><p>A lesson in bond yields vs. bond prices for your MBA class.&nbsp;</p><p>Mike Johannes at Columbia sends a great trio of graphs:&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiSRaKIg3uU9kYjpz7SrKnfgC8AMHBpTl0HGiB9ppqo4iU2cmC_b-k3-R_WjBKkc_UU5UVOUN1yTKN8XIIAbnvjzjO2mdSODEHC8TyG2H52EzKE4O2Hf9uwcb60ej1S-R_bvqlGKFa_quAaqrpTLD2bk4feM_stHVu9tL_nAWRUN3dHytHcMc-1Ce4/s1916/image001.gif\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"910\" data-original-width=\"1916\" height=\"304\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiSRaKIg3uU9kYjpz7SrKnfgC8AMHBpTl0HGiB9ppqo4iU2cmC_b-k3-R_WjBKkc_UU5UVOUN1yTKN8XIIAbnvjzjO2mdSODEHC8TyG2H52EzKE4O2Hf9uwcb60ej1S-R_bvqlGKFa_quAaqrpTLD2bk4feM_stHVu9tL_nAWRUN3dHytHcMc-1Ce4/w640-h304/image001.gif\" width=\"640\" /></a></div><br /><p>This is the UK sovereign yield curve. Reading from the bottom, 28, 6, 2 months ago, and now. Looking at the long end, it rises from 1% to a bit over 3%. 3% long-term yields used to be considered very low. This is a disaster? Aha, at low yields, small rises in yield mean big declines in prices. Here are the prices:&nbsp;</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhApHGz3OKkXqK0OrjgxHp8FsjfcBtpaOUEsClYOpyLut5YWQr4gHvgNwtmJ07BCJ__xT7kPi9QCRSrH77Ub407Y4nk1dr8ZHz7DLI0c3iFYK2t-hYB48xGCnpYoirknUAm0gYueNEvOrmeoN03oqRQPQnPUf7w0WB5Ls8EXTkCko4G3Yc0U7OklOo/s1916/screenshot_1665409436027%20(002).gif\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"910\" data-original-width=\"1916\" height=\"304\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhApHGz3OKkXqK0OrjgxHp8FsjfcBtpaOUEsClYOpyLut5YWQr4gHvgNwtmJ07BCJ__xT7kPi9QCRSrH77Ub407Y4nk1dr8ZHz7DLI0c3iFYK2t-hYB48xGCnpYoirknUAm0gYueNEvOrmeoN03oqRQPQnPUf7w0WB5Ls8EXTkCko4G3Yc0U7OklOo/w640-h304/screenshot_1665409436027%20(002).gif\" width=\"640\" /></a></div><p>The price of nominal bonds has gone from 100 to 29!</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjBW1pTPD6d_lInnb4wrsd-Az-hlc-30l5qtrxPrvAOXcBIaVQ_gRM4jYkVXk2ZIU2nXinNugDxzfHHXtmlKwX_QCFbevPD_8DmhZAATkHbZA7H6N_99vUyXmKkd1ki8TiCWBznowwzosFlM3qVATLmWd68kZt9dvmuHaxEotdhnpl6_ecDSrtgD4g/s1916/screenshot_1665409352764%20(002).gif\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"910\" data-original-width=\"1916\" height=\"304\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjBW1pTPD6d_lInnb4wrsd-Az-hlc-30l5qtrxPrvAOXcBIaVQ_gRM4jYkVXk2ZIU2nXinNugDxzfHHXtmlKwX_QCFbevPD_8DmhZAATkHbZA7H6N_99vUyXmKkd1ki8TiCWBznowwzosFlM3qVATLmWd68kZt9dvmuHaxEotdhnpl6_ecDSrtgD4g/w640-h304/screenshot_1665409352764%20(002).gif\" width=\"640\" /></a></div><br /><p>The price of indexed bonds went from 400 to 100.&nbsp;</p><p>Now time to say something nice: The UK government made out like a bandit here. I've been yelling for over a decade that the US should issue long term bonds, precisely to insure against interest rate rises. The UK did that. On a mark to market basis, bondholder loss=government gain. The UK locked in a lot of astoundingly low-interest borrowing. Pensions may be in trouble, but long term debt is great for governments. So long, that is, as the government doesn't turn around and bail out everyone to whom it sold long term debt!</p><p>*****</p><p><i>Update:&nbsp;</i></p><p>In the comments, SRP points to a great post by <a href=\"https://streetwiseprofessor.com/clearing-is-not-a-harmless-bunny-i-told-you-that-i-told-you-that-i-told-you-ad-infinitum-that-i-told-you-so/\" target=\"_blank\">Streetwise Professor</a>,&nbsp;AKA Craig Pirrong, who argues that derivatives margin was the central problem, not leverage. In his story, a typical pension fund has fixed long term liabilities, pensions. Rather than buy bonds, borrow against bonds, and invest in stocks, as I asserted, the typical fund just buys stocks and then a big receive-fixed pay-floating swap to cover its pension obligations. It's the same thing economically, but achieved via the swap contract. Now, interest rates rise, and the swap contract needs massive cash collateral. I hope I got this right.&nbsp;</p><blockquote><p>The instability was centered on UK pension funds engaged in a strategy called Liability Directed Investment (LDI)–which should now be renamed Liquidity Danger Investment. In a nutshell, in LDI defined benefit pension funds hedge the interest rate risk in their liabilities through interest rate swaps that are cleared or otherwise margined daily on a mark-to-market basis, rather than investing in fixed income securities that generate cash flows that match the liabilities. The funds hold non-fixed income assets (sometimes referred to as “growth assets”) in lieu of fixed income. ...</p></blockquote><blockquote><p>On a MTM basis, the funds are hedged: a rise in interest rates causes a decline in the present value of the liabilities, which matches a decline in the value of the swaps. Even if there is a duration match, however, there is not a liquidity match. A rise in interest rates generates no cash inflow on the liabilities (even though they have declined in value), but the clearing/margining of the swaps leads to a variation margin outflow: the funds have to stump up cash to meet VM obligations.</p></blockquote><blockquote><p>And this has happened in a big way due to interest rate increases driven by central bank tightening and the deteriorating fiscal situation in the UK (which has been exacerbated substantially by the energy situation, and the British government’s commitment to absorb a large fraction of energy costs). This led to big margin calls . . . which the funds did not have cash to cover. So, cue a fire sale: the funds dumped their most liquid assets–UK government gilts–which overwhelmed the risk bearing capacity/liquidity of that market, leading to a further spurt in interest rates . . . which led to more VM obligations. Etc., etc., etc.</p></blockquote><p>But note here that the funds have to have substantial gilts to sell. So they're not entirely investing in equities and swapping the interest rates.&nbsp;</p><blockquote><p>The BofE piece also suggests that the underlying issue here is pension fund underfunding. In essence, the pension funds needed to jack up returns to close their funding gap. So instead of investing in fixed income assets with cash flows that mirrored those of its pension liabilities, the funds invested in higher returning assets like equities. Just investing in fixed income would have locked in the funding gap: investing in equities increased the odds of becoming fully funded. But just investing in equities alone would have subjected the funds to substantial interest rate risk. So the LDI strategies were intended to immunize them against this risk.</p></blockquote><p><br /></p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 12
}