{
  "title": "134: Brittany Murphy: An ID Mystery",
  "link": "https://audioboom.com/posts/7590863",
  "itunes:episode": 134,
  "itunes:title": "Brittany Murphy: An ID Mystery",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3230,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Brittany Murphy was a rising star who had it all, beauty, fame, and success … but she also had secrets. When she was found dead in her Los Angeles home at just 32 years old, Hollywood and legions of fans are left in disbelief. While her autopsy revealed that she died of natural causes, many believe foul play was involved. Details of her life and death emerge after her husband, Simon Monjack, and mother, Sharon Murphy, embark on a bizarre media blitz, creating more questions than answers. Then, within months, Monjack perishes under strikingly similarly circumstances – in the same bed he and Brittany once shared, only this time, allegedly with Brittany’s mother sleeping beside him. <br>\n<br>\nFAM! Tune into ID every night this week for a brand new true crime documentary! The lineup is amazing--docs covering everything from Jeffrey Dahmer to Jeffrey Epstein and the real Joe Exotic!<br>\n<br>\n<a href=\"https://www.disappearedpod.com/podcast/episode/5096dd2f/1-obsessed-with-disappeared-preview\"><strong>FAM! THE PREVIEW FOR OUR NEXT ORIGINAL PODCAST IS LIVE! </strong></a>Come check out the preview for \"Obsessed With: Disappeared.\" It's a true crime / comedy podcast hosted by Patrick Hinds and Ellyn Marsh--best friends of 20 years. Going in order, Patrick and Ellyn recap episodes of ID's \"Disappeared.\" We launch on May 27th, <strong>BUT WE'D LOVE FOR YOU TO LISTEN TO THE PREVIEW AND SUBSCRIBE NOW!</strong> <a href=\"https://www.disappearedpod.com/podcast/episode/5096dd2f/1-obsessed-with-disappeared-preview\"><strong>Go here!</strong></a><strong><br>\n<br>\nLOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 26 May 2020 09:02:00 +0000",
  "guid": "tag:audioboom.com,2020-05-25:/posts/7590863",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}