{
  "title": "On Estimation and Inference of Large Approximate Dynamic Factor Models via the Principal Component Analysis. (arXiv:2211.01921v1 [econ.EM])",
  "link": "http://arxiv.org/abs/2211.01921",
  "description": "<p>This paper revisits and provides an alternative derivation of the asymptotic\nresults for the Principal Components estimator of a large approximate factor\nmodel as considered in Stock and Watson (2002), Bai (2003), and Forni et al.\n(2009). Results are derived under a minimal set of assumptions with a special\nfocus on the time series setting, which is usually considered in almost all\nrecent empirical applications. Hence, $n$ and $T$ are not treated\nsymmetrically, the former being the dimension of the considered vector of time\nseries, while the latter being the sample size and, therefore, being relevant\nonly for estimation purposes, but not when it comes to just studying the\nproperties of the model at a population level. As a consequence, following\nStock and Watson (2002) and Forni et al. (2009), estimation is based on the\nclassical $n \\times n$ sample covariance matrix. As expected, all asymptotic\nresults we derive are equivalent to those stated in Bai (2003), where, however,\na $T\\times T$ covariance matrix is considered as a starting point. A series of\nuseful complementary results is also given. In particular, we give some\nalternative sets of primitive conditions for mean-squared consistency of the\nsample covariance matrix of the factors, of the idiosyncratic components, and\nof the observed time series. We also give more intuitive asymptotic expansions\nfor the estimators showing that PCA is equivalent to OLS as long as\n$\\sqrt{T}/n\\to 0$ and $\\sqrt{n}/T\\to 0$, that is loadings are estimated in a\ntime series regression as if the factors were known, while factors are\nestimated in a cross-sectional regression as if the loadings were known. The\nissue of testing multiple restrictions on the loadings as well as building\njoint confidence intervals for the factors is discussed.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/econ/1/au:+Barigozzi_M/0/1/0/all/0/1\">Matteo Barigozzi</a>"
}