{
  "title": "Data-free Defense of Black Box Models Against Adversarial Attacks. (arXiv:2211.01579v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01579",
  "description": "<p>Several companies often safeguard their trained deep models (i.e. details of\narchitecture, learnt weights, training details etc.) from third-party users by\nexposing them only as black boxes through APIs. Moreover, they may not even\nprovide access to the training data due to proprietary reasons or sensitivity\nconcerns. We make the first attempt to provide adversarial robustness to the\nblack box models in a data-free set up. We construct synthetic data via\ngenerative model and train surrogate network using model stealing techniques.\nTo minimize adversarial contamination on perturbed samples, we propose `wavelet\nnoise remover' (WNR) that performs discrete wavelet decomposition on input\nimages and carefully select only a few important coefficients determined by our\n`wavelet coefficient selection module' (WCSM). To recover the high-frequency\ncontent of the image after noise removal via WNR, we further train a\n`regenerator' network with an objective to retrieve the coefficients such that\nthe reconstructed image yields similar to original predictions on the surrogate\nmodel. At test time, WNR combined with trained regenerator network is prepended\nto the black box network, resulting in a high boost in adversarial accuracy.\nOur method improves the adversarial accuracy on CIFAR-10 by 38.98% and 32.01%\non state-of-the-art Auto Attack compared to baseline, even when the attacker\nuses surrogate architecture (Alexnet-half and Alexnet) similar to the black box\narchitecture (Alexnet) with same model stealing strategy as defender. The code\nis available at https://github.com/vcl-iisc/data-free-black-box-defense\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Nayak_G/0/1/0/all/0/1\">Gaurav Kumar Nayak</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khatri_I/0/1/0/all/0/1\">Inder Khatri</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Randive_S/0/1/0/all/0/1\">Shubham Randive</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rawal_R/0/1/0/all/0/1\">Ruchit Rawal</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chakraborty_A/0/1/0/all/0/1\">Anirban Chakraborty</a>"
}