{
  "guid": "urn:uuid:486017dd-79c1-43ab-8b39-11626c9d6cb8",
  "link": "https://www.who.int/news/item/03-11-2022-global-health-agencies-outline-plan-to-support-ugandan-government-led-response-to-outbreak-of-ebola-virus-disease",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Global health agencies outline plan to support Ugandan government-led response to outbreak of ebola virus disease",
  "description": "<p>Following the declaration of an Ebola outbreak in Uganda on 20 September 2022, the outbreak has now spread to seven districts (Kasanda, Kyegegwa, Bunyangabu and Kagadi districts beyond the original epicenter in Mubende district, and then to Kampala City and Wakiso). The government-led response has activated&nbsp;the Incident Management System in order to control the outbreak. In support of the Ministry of Health-led efforts, CEPI, Gavi and WHO have outlined a plan to accelerate research during the outbreak, to ensure access to investigational doses, and to facilitate scaling up and access to any subsequent licensed vaccine.</p><p>Vaccination is usually one of the response interventions in such an outbreak, however, there are currently no licensed vaccines (or therapeutics) for Ebola disease caused by the Sudan ebolavirus (SUDV), though there are several candidate vaccines which appear to be suitable for evaluation in a clinical trial during this outbreak.</p><p>By embedding research at heart of the outbreak response, we can achieve two goals: to evaluate potentially efficacious candidate vaccines, and to potentially contribute to end this outbreak, and protect populations at risk in the future.</p><p>The Ministry of Health has designated the Makerere University Lung Institute to conduct vaccine and therapeutics clinical trials. The clinical trial to evaluate candidate vaccines against this ebolavirus is co-sponsored by the Ministry of Health in Uganda and WHO, and involves support from partners. A Principal investigator from Makerere University Lung Institute will lead the vaccine trial.&nbsp;</p><p>WHO, CEPI and Gavi are providing support to ensure that sufficient doses of candidate vaccines are available for the trial and beyond.&nbsp; If sufficient doses can be made available, the aim of the vaccine trial would be to establish how effective the candidate vaccines are in diverse populations. The vaccine developers and funders who will make the candidate vaccines available include the University of Oxford and the Serum Institute of India, the Sabin Vaccine Institute and the US government institutions Biomedical Advanced Research and Development Authority (BARDA) and National Institutes of Health (NIH), as well as International AIDS Vaccine Initiative (IAVI) and MSD.</p><p>Moreover, there are other organisations committed to supporting the overall response, including Africa Centres for Disease Control and Prevention (Africa CDC), UNICEF, non-governmental organizations, donors, and regulators including the African Vaccine Regulatory Forum (AVAREF).</p><h3>Goals of the collaboration</h3><p>The following goals have been identified for the organizations&rsquo; efforts; these are likely to evolve in response to the outbreak.</p><ul><li>In the short term, supporting the Ministry of Health of Uganda&rsquo;s outbreak response efforts as needed to control SUDV and, under their leadership, support a randomized clinical trial to evaluate one or more candidate vaccines as part of the response to the outbreak.</li><li>In the mid-term, allocating resources to plan for and to reserve sufficient manufacturing capacity to scale up the production of candidate vaccines (even before they are licensed), potentially by establishing a risk-sharing mechanism. This may also involve manufacture of additional vaccines at risk during the trial to ensure that doses of a vaccine found to be efficacious vaccine can be made available to end the outbreak as quickly as possible.</li><li>Over the longer term, exploring pathways to ensure that licensed SUDV vaccine(s) are available via the Ebola stockpile, which is enabled and funded by Gavi and managed by UNICEF on behalf of the WHO-coordinated International Coordinating Group (ICG) mechanism on Vaccine Provision, potentially using innovative market shaping mechanisms.&nbsp;</li><li>Furthermore, committing to developing a mechanism to ensure equitable access and funding for SUDV vaccines research, outbreak response and preventive vaccination. Also, to provide support for development and evaluation of next generation vaccines.</li></ul><p>The signatories commit to be guided by the following principles:&nbsp;</p><ul><li><strong>Leverage organisational strengths towards a common goal:</strong> Considering each institutions&rsquo; mandate and mission and its expertise, all pledged to increase coordination and support the overarching agreed goals which cut across the remit of any one institution</li><li><strong>Country driven and country engaged</strong>: Commit to support the Ministries of Health experiencing the outbreaks and ensure any engagement with the countries is coordinated and aligned with the Ministry of Health and responds to locally identified needs</li><li><strong>Decision making which is evidence-informed and considers access</strong>: Commit to ensure decision making builds on robust scientific assessment of candidate vaccines and considers implications for future equitable access to a licensed vaccine</li><li><strong>End-to-end approach based on access and equity</strong>: Achieve development and delivery goals by accelerating research and development, as well as push and pull mechanisms and other innovative financing &ndash; with access and equity centred at each stage</li><li><strong>Efficient resource allocation</strong>: Ensure adequate funding and resources are available in a timely manner and aligned with national research and response priorities</li><li><strong>Research integrity and ethics</strong>: Conduct research integrated in the response to outbreaks and in accordance with Good Clinical Practices.</li></ul><h3>Global research and development collaboration in response to Ebola outbreaks &nbsp;</h3><p>The actions taken by the Ministry of Health in Uganda and its partners build on past collaboration and experiences responding to Zaire ebolavirus outbreaks (another Ebola virus species), on COVAX lessons learned, and on working on other vaccine stockpile mechanisms.</p><p><strong>A commitment to encourage availability of doses for the candidate vaccines for clinical trial and beyond. </strong>In 2014, the Gavi Board approved a funding envelope for accelerated access to Ebola vaccines including eventual procurement of licensed vaccines, vaccine delivery and support for recovery in affected countries. Gavi subsequently signed an Advance Purchase Commitment (APC) agreement with Merck, securing the commitment to achieve and maintain availability of 300,000 doses of investigational vaccine doses until licensure and WHO recommendation.</p><p><strong>Integrating clinical research in the outbreak response</strong>. Together with the Ministry of Health in Guinea, WHO was part of a broader coalition of countries and partners which worked to assess candidate Ebola vaccines in the context of the West Africa Ebola outbreak caused by Zaire ebolavirus species.&nbsp; In 2014, a WHO-led global consortium rapidly initiated the necessary Phase 1 trials (VEBCON) and a randomized Phase 3 clinical trial in Guinea led by the Ministry of Health and WHO with several other partners which generated the evidence on the efficacy of the rVSV- ZEBOV Ebola vaccine. Additional clinical trials to evaluate various vaccines were conducted in 2015 by the Ministries of Health of Liberia and Sierra Leone and with the support of the US National Institutes of Health, The US Centers for Disease Control and the London School of Hygiene and Public Health among others. The experience of the West Africa Ebola outbreak catalysed the establishment of the WHO R&amp;D Blueprint for epidemics by the World Health Assembly in 2015 after CEPI in 2016.</p><p><strong>Deploying vaccines with proven efficacy yet unlicensed as part of the outbreak response</strong>. After 2015 and before its licensure, the proven effective yet unlicensed vaccine was successfully deployed as part of the response to Ebola outbreaks until 2021 under the leadership of the Ministries of health and with support from WHO, Gavi, UNICEF and other partners. In all the outbreaks since 2016 Ministries of Health, WHO, and several partners have also collected additional evidence on the efficacy of the rVSV-ZEBOV Ebola vaccine. Despite the challenges, during the 2018-2020 outbreaks in Equateur, North Kivu and Ituri provinces of the Democratic Republic of the Congo, over 320,000 people at risk of Ebola (contacts, contacts of contacts, and health care and front-line workers in affected areas) received a safe and effective vaccine.</p><p><strong>Creating a mechanism to ensure availability and access to licensed vaccines</strong>. In 2019, the Gavi Board approved funding for the establishment of a global stockpile of licensed Ebola vaccines, administered via the ICG mechanism &ndash; initially with investigational doses and then licensed vaccine for Ebola Zaire &ndash; but with potential to include other vaccines, depending vaccine availability and following WHO recommendations. Stockpile of licensed doses have since been used to combat recent smaller outbreaks in the Democratic Republic of the Congo and Guinea.</p><p><strong>A global, end-to-end collaboration to promote equitable access in support of countries&rsquo; strategies and needs.</strong> Beyond Ebola, the lessons from the COVID-19 response, including the establishment of the Access to COVID-19 Tools (ACT) Accelerator and key learnings from the vaccine pillar COVAX, are particularly important for the field of vaccine R&amp;D, manufacturing, delivery and country and community engagement.&nbsp;</p><h3><strong style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\"><span style=\"font-family:Arial, Helvetica, sans-serif;\">Notes to editors</span></strong><br /></h3><p><strong>About CEPI</strong></p><p><a href=\"https://eur01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcepi.net%2F&amp;data=05%7C01%7Cmsharafudeen%40gavi.org%7Cb7503e23d70d43565fd208dab73f3617%7C1de6d9f30daf4df6b9d65959f16f6118%7C0%7C0%7C638023779374726713%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=sJLB09ypXvm0MLunoBV9zBuhNv6kPE5aoS6oRexSDMo%3D&amp;reserved=0\">CEPI</a> is an innovative partnership between public, private, philanthropic, and civil organizations, launched in 2017, to develop vaccines against future epidemics. Its mission is to accelerate the development of vaccines and other biologic countermeasures against epidemic and pandemic threats so they can be accessible to all people in need. Prior to COVID-19, CEPI&rsquo;s work focused on developing vaccines against Ebola virus, Lassa virus, Middle East Respiratory Syndrome coronavirus, Nipah virus, Rift Valley Fever virus and Chikungunya virus &ndash; it has over 20 vaccine candidates against these pathogens in development. CEPI has also invested in new platform technologies for rapid vaccine development against unknown pathogens (Disease X).</p><p>CEPI has played a central role in the global response to COVID-19, supporting the development of the world&rsquo;s largest portfolio of vaccines against SARS-CoV-2 and its variants with a focus on speed, scale and access, as well as co-leading COVAX, the global initiative to deliver fair and equitable access to COVID-19 vaccines. CEPI is also the world&rsquo;s leading funder of R&amp;D for broadly protective coronavirus vaccines which could protect against future variants of COVID-19 as well as other coronaviruses with epidemic and pandemic potential.</p><p>CEPI has embarked upon an ambitious US$3.5bn five-year plan &ndash; called CEPI 2.0 - to dramatically reduce or even eliminate the future risk of pandemics and epidemics. Central to the plan is CEPI&rsquo;s goal &ndash; supported by the G7 and G20 - to compress the time taken to develop safe, effective, globally accessible vaccines against new threats to just 100 days. Achieving this &lsquo;<a href=\"https://eur01.safelinks.protection.outlook.com/?url=https%3A%2F%2F100days.cepi.net%2F&amp;data=05%7C01%7Cmsharafudeen%40gavi.org%7Cb7503e23d70d43565fd208dab73f3617%7C1de6d9f30daf4df6b9d65959f16f6118%7C0%7C0%7C638023779374726713%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=KgwWFRexxvFTevCITMKjwcsztAZ%2BYhs2n%2FlMk7xWvWQ%3D&amp;reserved=0\">100 Days Mission&rsquo;</a> would give the world a fighting chance of containing a future outbreak before it spreads to become a global pandemic. Read the plan at <a href=\"https://eur01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fendpandemics.cepi.net%2F&amp;data=05%7C01%7Cmsharafudeen%40gavi.org%7Cb7503e23d70d43565fd208dab73f3617%7C1de6d9f30daf4df6b9d65959f16f6118%7C0%7C0%7C638023779374726713%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=814nvFrzd9x5B88Pg8t2ulW0t%2Bv%2FP%2FS5EpfZRRSrQR8%3D&amp;reserved=0\">endpandemics.cepi.net/</a><br /></p><p><strong>About Gavi</strong></p><p>Gavi, the Vaccine Alliance is a public-private partnership that helps vaccinate half the world&rsquo;s children against some of the world&rsquo;s deadliest diseases. Since its inception in 2000, Gavi has helped to immunise a whole generation &ndash; over 981 million children &ndash; and prevented more than 16.2 million future deaths, helping to halve child mortality in 73 lower-income countries. Gavi also plays a key role in improving global health security by supporting health systems as well as funding global stockpiles for Ebola, cholera, meningococcal and yellow fever vaccines. After two decades of progress, Gavi is now focused on protecting the next generation, above all the zero-dose children who have not received even a single vaccine shot. The Vaccine Alliance employs innovative finance and the latest technology &ndash; from drones to biometrics &ndash; to save millions more lives, prevent outbreaks before they can spread and help countries on the road to self-sufficiency. </p><p>Gavi is a co-convener of COVAX, the vaccines pillar of the Access to COVID-19 Tools (ACT) Accelerator, together with the Coalition for Epidemic Preparedness Innovations (CEPI), the World Health Organization (WHO) and UNICEF. In its role, Gavi is focused on procurement and delivery for COVAX: coordinating the design, implementation and administration of the COVAX Facility and the Gavi COVAX AMC and working with its Alliance partners UNICEF and WHO, along with governments, on country readiness and delivery.</p><p>The Vaccine Alliance brings together developing country and donor governments, the World Health Organization, UNICEF, the World Bank, the vaccine industry, technical agencies, civil society, the Bill &amp; Melinda Gates Foundation and other private sector partners. View the full list of donor governments and other leading organisations that fund Gavi&rsquo;s work <a href=\"https://www.gavi.org/investing-gavi/funding/donor-profiles\" target=\"_blank\">here</a>.<strong>&nbsp;</strong>Learn more&nbsp;at <a href=\"https://www.gavi.org/homepage\" target=\"_blank\">www.gavi.org</a> and connect with us on <a href=\"https://www.facebook.com/GAVI/\" target=\"_blank\">Facebook</a> and <a href=\"https://twitter.com/gavi\" target=\"_blank\">Twitter</a>.</p><p><strong>About WHO</strong></p><p>Dedicated to the well-being of all people and guided by science, the World Health Organization leads and champions global efforts to give everyone, everywhere an equal chance at a safe and healthy life. We are the UN agency for health that connects nations, partners and people on the front lines in 150+ locations &ndash; leading the world&rsquo;s response to health emergencies, preventing disease, addressing the root causes of health issues and expanding access to medicines and health care. Our mission is to promote health, keep the world safe and serve the vulnerable.</p><p>&nbsp;</p>",
  "pubDate": "Thu, 03 Nov 2022 13:40:17 Z"
}