{
  "title": "518: The Lazy Sorting Hat, Pre-DH Final Battle Theories, Hypocrite Draco, and More MuggleMail",
  "link": "https://audioboom.com/posts/7890719",
  "itunes:episode": 518,
  "itunes:title": "The Lazy Sorting Hat, Pre-DH Final Battle Theories, Hypocrite Draco, and More MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4236,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>It's a MuggleMail episode!</li>\n<li>But first: Micah & Eric visit the newly-opened Harry Potter New York flagship store and share some pro tips for fans looking to visit in the near future!</li>\n<li>What are some of the top items? And more importantly, how is the butterbeer?</li>\n<li>To celebrate Pride Month in the Wizarding World, listeners send in their favorite LGBTQ+ couples</li>\n<li>Voicemails cover Draco's \"real\" dad, the Battle of Hogwarts, Sprout & Snape's relationship and more!</li>\n<li>Do the they teach sex education at Hogwarts?</li>\n<li>One listener gives us an epic ending for Trelawney in the Battle of Hogwarts!</li>\n<li>What are some details left out of the Potter movies that should be in the TV show?</li>\n<li>How are wizards educated in early academics?</li>\n<li>Why does Draco criticize students for staying at Hogwarts during the holidays when HE DOES IT HIMSELF?</li>\n<li>We reminisce about where we all though the final battle of the series would take place and the significance of The Veil!</li>\n<li>In Chamber of Secrets, did Harry have an immediate connection to the Diary Horcrux that we all overlooked?</li>\n<li>Selfish Harry! Did Ginny have any say in the naming of her children?</li>\n<li>Draco would NEVER wear Muggle clothes (sorry movies)!</li>\n<li>Was it a matter of convenience that most wizarding families were sorted into the same House (ex: Weasleys)?</li>\n<li>One listener shares a really profound email on fan fiction</li>\n<li>Quizzitch: June 21st is the 18th Anniversary of Harry Potter and the Order of the Phoenix, the longest <em>Potter</em> book ever written. How many chapters are contained in Book 5? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by UE Fits (Visit <a href=\"http://www.UE.com/fits\">UE.com/fits</a> and use promo code 'MuggleCast' for 15% off) and BetterHelp (Get 10% off your first month at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! On this month's Bonus MuggleCast, we share our thoughts on a Harry Potter cast reunion!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 22 Jun 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-06-21:/posts/7890719",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}