{
  "title": "Racism, racial discrimination and mental health, with Riana Elyse Anderson, PhD",
  "itunes:title": "Racism, racial discrimination and mental health, with Riana Elyse Anderson, PhD",
  "pubDate": "Wed, 25 May 2022 10:30:00 +0000",
  "guid": "3a89eb1e-c540-4288-b89f-1ac2211fba42",
  "link": "http://sopapa.libsyn.com/racism-racial-discrimination-and-mental-health-with-riana-elyse-anderson-phd",
  "itunes:image": "",
  "description": "<p>The past two years have taken a heavy toll on the health, mental health and well-being of people of color, who have suffered disproportionately from the COVID-19 pandemic while also facing what some call a second pandemic of racism. Riana Elyse Anderson, PhD, a clinical psychologist and professor at the University of Michigan School of Public Health, discusses why racism is like a virus and what can be done to help people deal with race-based traumatic stress and to protect children against its harmful effects.<br /> <br /> Links</p> <p><a href=\"https://www.rianaelyse.com\">Riana Elyse Anderson, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a><br /> <br /> Sponsor<br /> <br /> <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "content:encoded": "<p>The past two years have taken a heavy toll on the health, mental health and well-being of people of color, who have suffered disproportionately from the COVID-19 pandemic while also facing what some call a second pandemic of racism. Riana Elyse Anderson, PhD, a clinical psychologist and professor at the University of Michigan School of Public Health, discusses why racism is like a virus and what can be done to help people deal with race-based traumatic stress and to protect children against its harmful effects.  Links</p> <p><a href=\"https://www.rianaelyse.com\">Riana Elyse Anderson, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a>  Sponsor  <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "enclosure": "",
  "itunes:duration": "39:14",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The past two years have taken a heavy toll on the health, mental health and well-being of people of color, who have suffered disproportionately from the COVID-19 pandemic while also facing what some call a second pandemic of racism. Riana Elyse...",
  "itunes:episode": 192,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}