{
  "title": "Even if AI is Your Goal, Why Starting Without AI Improves Outcomes",
  "link": "https://kavita-ganesan.com/how-to-improve-ai-outcomes-in-business/",
  "comments": "https://kavita-ganesan.com/how-to-improve-ai-outcomes-in-business/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Fri, 12 Aug 2022 01:24:00 +0000",
  "category": [
    "AI Strategy",
    "Business AI"
  ],
  "guid": "https://kavita-ganesan.com/?p=8000",
  "description": "In this article, you’ll learn why it’s sometimes wiser to start without AI, even if your goal is to integrate AI into products, services, and workflows. You'll also learn tips for handlings AI non-readiness issues. ",
  "content:encoded": "\n<p>When it comes to software automation, many teams turn to&nbsp;AI&nbsp;as their potential answer.</p>\n\n\n\n<p>AI&nbsp;in the form of machine learning or NLP may be an excellent solution to a problem. But did you know that the best way to&nbsp;start&nbsp;AI&nbsp;initiatives is to&nbsp;start&nbsp;with&nbsp;no&nbsp;AI&nbsp;at all?</p>\n\n\n\n<p>This may seem counterintuitive, but there’s a simple reason for it.</p>\n\n\n\n<p>It’s because<em>&nbsp;you may&nbsp;not&nbsp;be ready for&nbsp;AI&nbsp;as a solution</em>. There could be several missing elements that’ll prevent you from seeing success with&nbsp;AI&nbsp;if pursued prematurely.</p>\n\n\n\n<p>When it comes to&nbsp;AI, it’s&nbsp;not&nbsp;far-fetched to say that several critical stars need to align to get results from initiatives from a usability perspective.</p>\n\n\n\n<p>Let’s look at the reasons why it may be wiser to hold off on&nbsp;AI&nbsp;than to&nbsp;start&nbsp;with it and hit roadblocks and, later, tips for how you can eliminate those roadblocks.</p>\n\n\n\n<h2>Why it’s Wiser to Hold Off on AI</h2>\n\n\n\n<h3>1: You don’t yet understand the problem you’re solving</h3>\n\n\n\n<p>Typically, when you’re trying to solve an existing problem with&nbsp;AI, the input, and the desired output are often well understood. You may be looking to&nbsp;AI&nbsp;to improve the accuracy of the existing solution or the speed of completing tasks.</p>\n\n\n\n<p>But from my experience, a large number of problems that engineering teams and entrepreneurs are solving today are&nbsp;<em>new problems.</em>&nbsp;The problems are weakly defined, and you may&nbsp;not&nbsp;fully understand what your expected output is, let alone what you’re input into the system would be.</p>\n\n\n\n<p>Take the problem of sentiment prediction. Do you know if you’re looking to predict broad overall sentiments (e.g., positive or negative) or more granular ones like 10% anger and 90% sadness on some given text? Are you looking to feed in paragraphs of text or just a single sentence or short snippets?</p>\n\n\n\n<p>Yes, this is a design problem. And the right design comes from a good understanding of the problem.&nbsp;Without&nbsp;it, you’ll be battling many design dilemmas. Such design issues, along with the complexity of developing the&nbsp;AI&nbsp;systems, may require you to constantly revamp models to address design changes, introducing confusion and reducing your chances of success with&nbsp;AI.</p>\n\n\n\n<h3>2: You may&nbsp;not&nbsp;have the necessary data</h3>\n\n\n\n<p>As I repeatedly talk about in my&nbsp;<a href=\"https://kavita-ganesan.com/the-business-case-for-ai/#.YuQTgnbMJPY\" target=\"_blank\" rel=\"noreferrer noopener\">book</a>,&nbsp;AI&nbsp;systems demand data. It’s&nbsp;not&nbsp;just data for training models but also data to better understand the problem you’re solving and the expected output from the system.</p>\n\n\n\n<p>Often, when you have a brand new problem, this data is non-existent. Even for old problems that are being manually solved, the data may&nbsp;not&nbsp;exist or may be available in a non-accessible format. This is exactly what happened with a healthcare client. They were performing a billing annotation task for over eight years, but when came time to automate the process, the data just wasn’t there.</p>\n\n\n\n<p>Without&nbsp;the right type of data, you won’t really know what problem you’re solving, let alone train a model.</p>\n\n\n\n<h3>3: Your users may be skeptical of automation</h3>\n\n\n\n<p>Let’s face it. People are suspicious of&nbsp;AI, especially those who don’t know what it is and the current state of its capabilities. The moment you talk about automation within employee workflows, some will get uncomfortable and anxious and&nbsp;start&nbsp;to worry about being replaced by the “AI&nbsp;race.”</p>\n\n\n\n<p>People are also used to their preferred way of doing things. They worry about how their current “efficient” workflow will be affected by the integration of&nbsp;AI. Some think this new&nbsp;AI&nbsp;thing is just a gimmick. This is the exact problem I faced with the healthcare client I mentioned earlier. While the CEO was very enthusiastic about integrating&nbsp;AI&nbsp;in one specific workflow in their business, the employees were&nbsp;not&nbsp;enthusiastic and made that clear.</p>\n\n\n\n<p>The problem with resistance to using&nbsp;AI&nbsp;is that people may&nbsp;not&nbsp;perceive the solution to be a long-term one. Further, subject matter experts who are suspicious of the automation idea may&nbsp;not&nbsp;be willing to help co-develop a working&nbsp;AI&nbsp;solution, as was the case with my healthcare client. Additional education, training, and buy-in were required to get them to see why automation would make their lives easier.&nbsp;Without&nbsp;customer buy-in,&nbsp;no&nbsp;matter how impressive the&nbsp;AI&nbsp;solution, its existence will be short-lived.</p>\n\n\n\n<h4>So, what to give?</h4>\n\n\n\n<p>Forcing an&nbsp;AI&nbsp;solution on people will&nbsp;not&nbsp;work…in the long term.</p>\n\n\n\n<p>Starting&nbsp;an&nbsp;AI&nbsp;initiative&nbsp;without&nbsp;data will ensure you hit a dead end.</p>\n\n\n\n<p>An ill-defined problem will require that you redesign your&nbsp;AI&nbsp;tool over and over again, and this can be expensive.</p>\n\n\n\n<p>What can you do?</p>\n\n\n\n<h2>3 Tips for Handling&nbsp;AI&nbsp;Non-Readiness</h2>\n\n\n\n<p>Even if you’re&nbsp;not&nbsp;ready for&nbsp;AI&nbsp;today, here are three things you can do to eventually see significant benefits from&nbsp;AI&nbsp;for the problems you’ve been struggling with.</p>\n\n\n\n<h3>1:&nbsp;Start&nbsp;with a manual or semi-automatic approach</h3>\n\n\n\n<p>If your users are receptive to&nbsp;AI, but you don’t have the data to support the initiative, or you don’t quite understand what problem you’re solving, consider&nbsp;starting&nbsp;with a manual approach.</p>\n\n\n\n<p>This means you put together a small team (e.g., virtual assistants for non-domain-specific problems) and have them manually execute the tasks while also storing the data from the manual execution.</p>\n\n\n\n<p>Alternatively, if the workload is extremely high, you can consider automating the task with a less-than-ideal software automation to bring in some level of control to the task.</p>\n\n\n\n<p>For example, if your virtual assistant is expected to analyze thousands of images to spot a stop sign. But you know that images with specific color distribution will&nbsp;not&nbsp;have a stop sign with 99% certainty. You can develop a simple software script to weed out such images from review, reducing the workload of your virtual assistants. There are many such possibilities to integrate simple software automation before introducing&nbsp;AI.</p>\n\n\n\n<h4>Why does this work?</h4>\n\n\n\n<ul><li>You can easily change the design of your solution until you’re comfortable.</li><li>You can keep changing the type of data you’re collecting</li><li>You can generate high-quality data for machine learning down the road</li><li>You can establish baseline metrics, which you can later compare with an&nbsp;AI-powered solution</li></ul>\n\n\n\n<h3>2: Collect data efficiently</h3>\n\n\n\n<p>If your only problem is the lack of data to develop your&nbsp;AI&nbsp;solution, there are ways to do this efficiently&nbsp;without&nbsp;completely spawning out a full data strategy.</p>\n\n\n\n<p>I will&nbsp;not&nbsp;get into this in-depth in this article, as you can read my article where I talk about strategies for&nbsp;<a href=\"https://www.opinosis-analytics.com/blog/machine-learning-training-data/\" target=\"_blank\" rel=\"noreferrer noopener\">generating data for your machine learning projects</a>.</p>\n\n\n\n<h3>3: Remove adoption fears</h3>\n\n\n\n<p>If your problem is well understood and you have the necessary data, but users want nothing to do with an automated solution, there’s much work to do on the cultural side of things.</p>\n\n\n\n<p>You’d need to think about how to get buy-in from users, who may be your employees, customers, or even vendors.</p>\n\n\n\n<p>The way to approach this is first to ask them what they think about automating specific tasks. If you sense resistance, you’d want to understand their worries and fear. This will give you a sense of what your emphasis would be when you’re trying to “sell” them a solution.</p>\n\n\n\n<p>If the worry is&nbsp;<a href=\"https://kavita-ganesan.com/will-ai-kill-your-job/\" target=\"_blank\" rel=\"noreferrer noopener\"><em>fear of job loss</em></a>, you can show employees how the nature of their work will change or be simplified with the integration of&nbsp;AI.</p>\n\n\n\n<p>If the fear is potential rigidity in workflows, you can educate users about how you’re&nbsp;not&nbsp;just developing a solution in the dark but rather co-developing one with them (the users) to ensure that they’re happy with it and it’s truly solving a pain point.</p>\n\n\n\n<h4>Why does this work?</h4>\n\n\n\n<ul><li>By actively removing fears and seeking feedback, you’re fostering collaboration.</li><li>The more collaboration between potential consumers of&nbsp;AI, business stakeholders, designers, and developers, the better the solution and the higher the chances of&nbsp;AI&nbsp;adoption.</li></ul>\n\n\n\n<h2>Last Word</h2>\n\n\n\n<p>As you’ve seen in this article, although your business problem may be a good candidate for&nbsp;AI, you may&nbsp;not&nbsp;be ready to&nbsp;start&nbsp;with&nbsp;AI.</p>\n\n\n\n<p>There’s a high likelihood that you lack the data for the initiative, may&nbsp;not&nbsp;understand the problem well, and your users may&nbsp;not&nbsp;be ready for an automated solution. The workaround to this is&nbsp;not&nbsp;to&nbsp;start&nbsp;with&nbsp;AI—but to&nbsp;start&nbsp;without&nbsp;it. Solve the foundational issues using simple but effective approaches.</p>\n\n\n\n<p>That’s all for now.</p>\n\n\n\n<p></p>\n\n\n\n<h2>To Keep Learning From Me:</h2>\n\n\n\n<ul><li><strong>Join my&nbsp;<a href=\"https://kavita-ganesan.com/blog\">AI Integrated newsletter</a>,&nbsp;</strong>which clears the AI confusion and teaches you how to successfully integrate AI to achieve profitability and growth in your business.</li><li><strong>Read&nbsp;&nbsp;<a href=\"http://amazon.aibusinesscasebook.com/?utm_source=newsletter&utm_medium=email&utm_campaign=why_starting_without_ai_improves_outcomes_even_if_ai_is_your_goal&utm_term=2022-08-19\" target=\"_blank\" rel=\"noreferrer noopener\">The Business Case for AI</a></strong>&nbsp;to learn applications, strategies, and best practices to be successful with AI (get 3 free chapters <a href=\"https://kavita-ganesan.com/the-business-case-for-ai/\">here</a>).</li><li><strong><a href=\"/contact-me\">Send me a message</a> </strong>for a more customized roadmap and AI strategy for your business</li></ul>\n\n\n\n<h2>Recommened Articles</h2>\n\n\n\n<ul><li><a href=\"https://kavita-ganesan.com/will-ai-kill-your-job/\">Will AI Really Kill Your Job?</a></li><li><a href=\"https://kavita-ganesan.com/machine-learning-training-data-generation/\">5 Strategies for Generating Data for AI</a></li></ul>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/how-to-improve-ai-outcomes-in-business/feed/",
  "slash:comments": 0,
  "post-id": 8000
}