{
  "title": "IHMC’s Nadia Is a Versatile Humanoid Teammate",
  "link": "https://spectrum.ieee.org/ihmc-nadia-humanoid-robot",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/several-different-views-of-a-headless-black-humanoid-robot-demonstrating-its-flexibility.jpg?id=31870017&width=1200&height=800&coordinates=0%2C208%2C0%2C209\"/><br/><br/><p><a href=\"http://robots.ihmc.us/\" target=\"_blank\">The Florida Institute for Human & Machine Cognition (IHMC)</a> is well known in bipedal robotics circles for teaching very complex humanoid robots to walk. Since 2015, IHMC has been home to a <a href=\"https://spectrum.ieee.org/atlas-drc-robot-is-75-percent-new-completely-unplugged\" target=\"_blank\">Boston Dynamics Atlas (the DRC version)</a> as well as a <a href=\"https://spectrum.ieee.org/update-nasa-valkyrie-robot\" target=\"_blank\">NASA Valkyrie</a>, and significant progress has been made on advancing these platforms toward reliable mobility and manipulation. But fundamentally, we’re talking about some very old hardware here. And there just aren’t a lot of good replacement options (available to researchers, anyway) when it comes to humanoids with human-comparable strength, speed, and flexibility.</p><p>Several years ago, IHMC decided that it was high time to build its own robot from scratch, and in 2019, <a href=\"https://spectrum.ieee.org/ihmc-developing-new-gymnastinspired-humanoid-robot\" target=\"_blank\">we saw some very cool plastic concepts of Nadia</a>—a humanoid designed from the ground up to perform useful tasks at human speed in human environments. After 16 (!) experimental plastic versions, <a href=\"http://robots.ihmc.us/nadia\" target=\"_blank\">Nadia is now a real robot</a>, and it already looks pretty impressive.</p><hr/><p class=\"pull-quote\">For a long time, we’ve been pushing up against the limits of the hardware with DRC Atlas and Valkyrie. We haven’t been able to fully explore the limits of our software and our controls. With Nadia, it’s the other way around, which is really exciting from a research perspective. <br/>—<a href=\"https://www.linkedin.com/in/rjgriffin42/\" rel=\"noopener noreferrer\" target=\"_blank\">Robert Griffin, IHMC</a></p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"ded99ccad6a183902e3d0a76c9a33d67\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/_mQJw8VhZ7w?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>Designed to be essentially the next generation of the DRC Atlas and Valkyrie, Nadia is faster, more flexible, and robust enough to make an excellent research platform. It’s a hybrid of electric and hydraulic actuators: 7 degrees-of-freedom (DoF) electric arms and a 3 DoF electric pelvis, coupled with a 2 DoF hydraulic torso and 5 DoF hydraulic legs. The hydraulics are integrated smart actuators, which we’ve <a href=\"https://spectrum.ieee.org/ihmc-developing-new-gymnastinspired-humanoid-robot\" target=\"_blank\">covered in the past</a>. Nadia’s joints have been arranged to maximize range of motion, meaning that it has a dense manipulation workspace in front of itself (where it really matters) as well as highly mobile legs. Carbon fiber shells covering most of the robot allow for safe contact with the environment. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Two images show a human using a virtual reality system and controllers to control the Nadia robot in manipulating small objects on a table.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b7c8c12071226dc7368ab7b51753a16b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7f53a\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-images-show-a-human-using-a-virtual-reality-system-and-controllers-to-control-the-nadia-robot-in-manipulating-small-objects.jpg?id=31863530&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Teleoperation through immersive virtual reality helps Nadia perform complex tasks.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">IHMC</small></p><p>That large manipulation workspace is particularly relevant because there’s a lot of emphasis on immersive virtual reality teleoperation with Nadia. Not that autonomy isn’t important, but the concept behind Nadia has been shaped (at least in part) by IHMC’s experience at the <a href=\"http://robots.ihmc.us/drc\" target=\"_blank\">DARPA Robotics Challenge Finals</a>: Ideally, you want the robot to manage everything it can on its own, while having a human able to take more direct control over complex tasks. While it’s not the fantasy of a robot being fully autonomous, the fact is that in the near term, this approach is an immediately viable way of getting robots to reliably do useful things in unstructured environments. Overall, the goal with Nadia is to operate as close to human speed as possible when doing urban exploration and manipulation tasks. And if that involves a human directly teleoperating the robot because that’s the best way of doing things, Nadia is designed to handle it.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Two humanoid robots stand next to each other; Nadia on the left is crossing its legs much more than DRC Atlas on the right\" class=\"rm-shortcode\" data-rm-shortcode-id=\"099b13188cff4db8740a5c9649e448f5\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"4710b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-humanoid-robots-stand-next-to-each-other-nadia-on-the-left-is-crossing-its-legs-much-more-than-drc-atlas-on-the-right.jpg?id=31863522&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Nadia demonstrates how much more flexible its hips and legs are relative to DRC Atlas.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">IHMC</small></p><p>For more details about Nadia, we spoke with <a href=\"https://www.linkedin.com/in/rjgriffin42/\" target=\"_blank\">Robert Griffin</a>, a research scientist at IHMC.</p><p><strong></strong><strong>How is Nadia unique among humanoid robots?</strong><br/></p><p><strong>Robert Griffin:</strong> I think the big thing that we’re trying to bring to the table with Nadia is the really high range of motion of a lot of the joints. And it’s not just the range of motion that differentiates Nadia from many other humanoid robots out there, it’s also speed and power. Nadia has much better power-to-weight than the DRC Atlas, making it significantly faster, which improves its general operational speed as well as its stability.</p><p><strong>Can you put your goals with Nadia into context in the humanoid robotics space?</strong></p><p><strong>Griffin: </strong>We’re trying to make Nadia a robot that can function in unstructured environments where you don’t know what it needs to do ahead of time. So, instead of having a set sequence or number of tasks, we’re trying to build up a robot in hardware, software, and interfaces that enable a human-machine team to go into an unknown environment, explore it, map it, and then do meaningful tasks.</p><p><strong>IHMC has a reputation for helping complex humanoid robots like DRC Atlas and Valkyrie with their mobility. How has all of that experience made its way into Nadia’s design?</strong></p><p><strong>Griffin: </strong>You’re right, and we’ve been partnering with <a href=\"https://www.nasa.gov/centers/johnson/home/index.html\" target=\"_blank\">NASA JSC</a> since the DRC—when you see Valkyrie walking now, it’s using IHMC software and controllers. When it comes to applying some of that knowledge to Nadia, we’ve paid special attention to things like Nadia’s range of motion in its legs. Unlike a lot of humanoid platforms, Nadia has really good hip roll (or ab/adduction), which means that it can do really wide steps and also really narrow steps where the feet overlap each other. We think that’s going to help increase mobility by helping with step adjustment and reaching challenging footholds.</p><p>Beyond the hardware, we were also able to use our simulation tools and control stack to really help us specify what the hardware design needed to be in order to accomplish some of these tasks. We weren’t able to optimize all of the joints on the robot—we pretty much stuck with a <a href=\"https://spectrum.ieee.org/ihmc-developing-new-gymnastinspired-humanoid-robot\" target=\"_self\">single hydraulic piston</a> in the legs, for now, but we hope that our future designs will be better integrated and optimized. We do have full ankle actuation, unlike a lot of humanoid robots. Our approach, from the beginning, was to look for the necessary control authority with Nadia’s feet to be able to do precise foot placement, and use that for relatively quick reactive mobility.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-float-right rm-resized-container-35\" data-rm-resized-container=\"35%\" style=\"float: right;\">\n<img alt=\"A man uses a boxing glove on the end of a wooden stick to shove a humanoid robot\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"d63a32cdd1fc88a13a9f5049b17f8c1d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"a1a7c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-man-uses-a-boxing-glove-on-the-end-of-a-wooden-stick-to-shove-a-humanoid-robot.jpg?id=31863517&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Robert Griffin gives Nadia a helpful shove, for science.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">IHMC</small></p><p><strong>As you went from concept to hardware with Nadia, what compromises did you have to make?</strong></p><p><strong>Griffin: </strong>We’re not quite as flexible as a typical human, although we’re not very far off. I was surprised that we lost some range of motion in the mechanisms just because of the hydraulic hose routing, especially around the hips, where we wanted to avoid having big loops of hoses hanging off the robot. We eventually want to take Nadia into the real world, and we don’t want the hoses getting snagged on things.</p><p>Nadia is not quite as fast as a human in some of the joints, and in some of the joints it’s faster. We’re also not quite as compact as we wanted to be originally, because, well, robots are really hard. We’re hoping to get it a little more compact in the future. And we missed our weight margin by a little bit—it’s about 90 kilograms right now, without the hydraulic pump or battery on board. </p><p><strong>Why did you decide to focus on how a human can directly control Nadia in VR, as opposed to more emphasis on autonomy?</strong></p><p><strong>Griffin: </strong>Autonomy works really, really well when you know what the operating conditions are, and what you’re trying to accomplish. Not that it’s easy to automate that, but it’s feasible. We’ve experimented with some autonomous planning and manipulation, and we found that it’s a little limiting in that it doesn’t take advantage of the full capabilities of our platform. And so what we’re looking at doing is trying to automate just key parts of the system—things like footstep planning and grasp planning, which can be automated pretty well. But we also need the ability to interact with novel environments, which is why we’re focusing on developing ways to team with humans through interfaces like virtual reality. With the cognitive capabilities of a human combined with the manipulation capabilities of the robot, we believe you get a ton of versatility. </p><p><strong>How much of a difference has it made to controlling Nadia in VR, that the hardware has humanlike flexibility and a humanlike workspace?</strong></p><p><strong>Griffin: </strong>For manipulation, it’s been huge. We don’t want the user to be operating the robot and feeling like they’re limited in what they can do because of the robot’s constraints. A lot of the manipulation that we’ve been able to do with Nadia we could never have done with our other platforms.</p><p>There are definitely trade-offs—the arms are more designed for speed than for strength, which is going to be a little bit limiting, but we’re hoping to improve that long-term. I think that designing the robot—and especially the control system and software architecture—with the idea of having a human operating it has opened up a lot of capability that we hope will let us rapidly iterate along many different paths.</p><p><strong>What are some things that Nadia will be uniquely capable of?</strong></p><p><strong>Griffin: </strong>We’re hoping that the robot will be uniquely capable of multicontact locomotion—that’s a direction that we’re really hoping to move in, where we’re not just relying on our feet to move through the world. But I don’t necessarily want to say that it’ll be better at that than other robots are, because I don’t know everything that other robots can do. </p><p><strong>Are there practical tasks that you hope Nadia will be able to do at some point in the future?</strong></p><p><strong>Griffin: </strong>Things like disaster response, nuclear remediation, bomb disposal—these tasks are largely done by people right now, because we don’t have robots that are actually capable of doing them adequately despite the amount of time that roboticists have been working on it. I think that by partnering excellent robotic engineering with really incredible operating interfaces and human cognition, these tasks will start to become feasible to do by a robot.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A headless humanoid robot with outstretched arms stands in a lab; on its torso are stickers forming a comical face \" class=\"rm-shortcode\" data-rm-shortcode-id=\"9809398f42490f67b37042f802b7cf74\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"0aedf\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-headless-humanoid-robot-with-outstretched-arms-stands-in-a-lab-on-its-torso-are-stickers-forming-a-comical-face.jpg?id=31863505&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Who needs a real head when you have googly eyes and a shark mouth?</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">IHMC</small></p><p>Even though Nadia is brand new, IHMC already has a bunch of upgrades planned for the robot. The most obvious one is cutting that tether by putting batteries and a custom hydraulic pump into Nadia’s torso. Also on the road map are higher torque arms and lighter, more streamlined legs. In the meantime, the software has a lot of catching up to do to allow Nadia to reach its full potential. And if we know IHMC, that’s going to be an incredibly exciting thing to see.</p>",
  "pubDate": "Wed, 05 Oct 2022 19:16:52 +0000",
  "guid": "https://spectrum.ieee.org/ihmc-nadia-humanoid-robot",
  "category": [
    "Humanoid robots",
    "Ihmc",
    "Bipedal robots",
    "Nadia",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}