{
  "id": "yt:video:raNLUgnfTTQ",
  "yt:videoId": "raNLUgnfTTQ",
  "yt:channelId": "UC9_p50tH3WmMslWRWKnM7dQ",
  "title": "Broiled chocolate chip cookies, v2.0",
  "link": "",
  "author": {
    "name": "Adam Ragusea",
    "uri": "https://www.youtube.com/channel/UC9_p50tH3WmMslWRWKnM7dQ"
  },
  "published": "2022-10-27T18:00:19+00:00",
  "updated": "2022-10-29T19:50:19+00:00",
  "media:group": {
    "media:title": "Broiled chocolate chip cookies, v2.0",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Thanks to Squarespace for sponsoring this video! Go to Squarespace.com for a free trial, and when you’re ready to launch, go to http://squarespace.com/ragusea and add code “RAGUSEA\" at checkout to save 10% off your first purchase of a website or domain.\n\n***RECIPE, MAKES SIX LARGE COOKIES***\n\n113g (1 stick) butter\n200g sugar (1 cup granulated or brown, but I prefer 1 2/3 cups powdered sugar)\n5-10g (1-2 teaspoons) molasses (optional, replicates the taste of brown sugar)\n1 egg\n10g (1 teaspoon of Morton kosher) salt (use 2/3rds of that if your butter is salted)\n4-8g (1-2 teaspoons) vanilla extract\n3g (1/2 teaspoon) baking soda\n230g (about 1.5 cups) bread flour (1 2/3 cups all-purpose flour is OK instead)\n100g chocolate chips or other mix-ins\n\nGet the oven heating to 375ºF/190ºC, convection if you have it.\n\nMelt the butter. Mix in the sugar (and optional molasses) until smooth. Mix in the egg until very smooth. Mix in the salt (FYI, some people might not like their cookies as salty as I do), vanilla, baking soda, flour and chips. The dough should be a little sticky — you can chill it for a few minutes to make it easier to shape.\n\nDivide the dough into six 115g portions and roll each into something like a golf ball. Space them evenly on a baking sheet — no parchment paper, no grease. Flatten each ball into something like a hockey puck and tidy up the circular shape.\n\nTurn the oven off and turn the broiler/grill on maximum. Give it a minute or two to heat up, then put in the cookies near the top. Let the broiler brown the tops of the cookies until golden — this should only take a minute, so don't walk away or they'll burn. If you're doing multiple pans of cookies, brown them each one at a time.\n\nTurn the broiler off and the oven back on to 375ºF/190ºC. Give the broiler a couple minutes to cool down, then return the cookies to the oven. Bake until they spread and look done to you — mine take about eight minutes as this stage, but they'll take longer if you don't have a convection fan. I like the texture when they look a hair underbaked.\n\nLet the cookies cool and solidify before scraping them off the baking sheet.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}