{
  "title": "Episode #364:  Liz Cheney And The Party Of Intolerance",
  "link": "https://www.krpoliticaljunkie.com/episode-364-liz-cheney-and-the-party-of-intolerance/",
  "pubDate": "Fri, 07 May 2021 23:49:01 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=20059",
  "description": "<p>Liz Cheney is about to lose her House leadership position because she refuses to go along with Donald Trump&#039;s lies and misstatements.  Meanwhile, President Biden needs to be cognizant of his barebones majority in the Senate and mindful of the needs of Joe Manchin, the West Virginia Democrat who has become a powerbroker in his own right.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-364-liz-cheney-and-the-party-of-intolerance/\">Episode #364:  Liz Cheney And The Party Of Intolerance</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Liz Cheney is about to lose her House leadership position because she refuses to go along with Donald Trump&#039;s lies and misstatements.  Meanwhile, President Biden needs to be cognizant of his barebones majority in the Senate and mindful of the needs of ...",
  "itunes:summary": "Liz Cheney, the House Republican congresswoman from Wyoming who is her party&#8217;s third-ranking House member, has made it a habit of standing up to Donald Trump&#8217;s lies and misstatements about the validity of the 2020 election and what really happened during the Jan. 6 insurrection in Washington.  For that, she is about to lose her leadership position.  And she is not alone.  Sen. Mitt Romney, who voted to convict Trump during the impeachment trial, barely escaped censure by the Utah GOP.  Jack Pitney of Claremont McKenna College is watching this and sees an alarming lack of tolerance in the party, one that is only getting worse.<br />\nNorm Ornstein of the American Enterprise Institute is watching how President Biden is faring in pushing through his agenda, well aware that in a 50-50 Senate everyone&#8217;s ego needs to be massaged &#8230; perhaps none more so than Joe Manchin of West Virginia.<br />\nMusic heard in this episode<br />\n<a href=\"https://www.youtube.com/watch?v=O2IuJPh6h_A\">Time is Running Out by Muse</a><br />\n<a href=\"https://www.youtube.com/watch?v=mIsnIt1p978\">It&#8217;s My Party by Leslie Gore</a><br />\n<a href=\"https://www.youtube.com/watch?v=s8EUL-O3hRA\">Expecting to Fly by Buffalo Springfield</a><br />\n<a href=\"https://www.youtube.com/watch?v=8LhCd1W2V0Q\">Are You Going My Way by Lenny Kravitz</a><br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 364,
  "itunes:title": "Liz Cheney and the Party of Intolerance",
  "itunes:duration": "47:20"
}