{
  "title": "81: Studio 54",
  "link": "https://audioboom.com/posts/7227423",
  "itunes:episode": 81,
  "itunes:title": "Studio 54",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3354,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>GAYS! DRAG QUEENS! LIZA! DISCO! DRUGS! TAX FRAUD! DO I REALLY NEED TO GO ON?</p>\n\n\n<p>Studio 54 was the epicenter of 70s hedonism--a place that not only redefined the nightclub, but also came to symbolize an entire era. Its co-owners, Ian Schrager and Steve Rubell, two friends from Brooklyn, seemed to come out of nowhere to suddenly preside over a new kind of New York society. Now, 39 years after the velvet rope was first slung across the club's hallowed threshold, a feature documentary tells the real story behind the greatest club of all time and the crimes that brought it down.</p>\n\n\n<p><strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU!</strong> J<a href=\"https://www.patreon.com/TrueCrimeObsessed\">oin our Patreon fam</a> and <strong>instantly get over 80 FULL BONUS episodes</strong> to BINGE RIGHT NOW! Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase\"</strong> and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a></p>\n\n\n<p><strong>COME TO OUR PRIDE SHOW!</strong> Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets here!</a></p>\n\n\n<p><strong>To learn about our sponsors AND GET THOSE PROMO CODES, <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click here!</a></strong></p>\n",
  "pubDate": "Tue, 09 Apr 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-04-09:/posts/7227423",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}