{
  "title": "S14 Ep80: Documented Cases of Pure Evil: The Hatman",
  "link": "https://audioboom.com/posts/8098550",
  "itunes:episode": 80,
  "itunes:title": "Documented Cases of Pure Evil: The Hatman",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4722,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS has Documented Cases of Pure Evil: The Hatman with guest Kyle Macias.<br>\n<br>\nShadow people, the Djinn, Aliens, Demons or something even more sinister is sliding between dimensions and today we discuss some of the most harrowing cases from the new, chilling documentary, The Hat Man: Documented Cases of Pure Evil.<br>\n<br>\nWatch the Documentary here: <a href=\"https://vimeo.com/ondemand/thehatmanfilm\">https://vimeo.com/ondemand/thehatmanfilm</a> <br>\n<br>\nOr get it on DVD or On Demand here:<br>\n<a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !",
  "itunes:summary": "BEYOND the DARKNESS has Documented Cases of Pure Evil: The Hatman with guest Kyle Macias.\n\nShadow people, the Djinn, Aliens, Demons or something even more sinister is sliding between dimensions and today we discuss some of the most harrowing...",
  "pubDate": "Sun, 29 Sep 2019 08:00:00 +0000",
  "guid": "a385cde0-94e7-4d5f-b060-fcce395715bf",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}