{
  "title": "New EV Prototype Leaves Range Anxiety in the Dust",
  "link": "https://spectrum.ieee.org/new-ev-prototype-leaves-range-anxiety-in-the-dust",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-silver-car-driving-down-the-road-with-a-mountain-of-switchbacks-behind-it.jpg?id=30788095&width=1200&height=800&coordinates=0%2C209%2C0%2C0\"/><br/><br/><p>\n\tNot long ago, a 300-mile range seemed like a healthy target for electric cars. More recently, the 520-mile (837-kilometer) Lucid Air became the world’s longest-range EV. But that record may not stand for long.\n</p><p>\n\tThe Mercedes-Benz Vision EQXX, and its showroom-bound tech, looks to banish range anxiety for good: In April, the sleek prototype sedan completed a 621-mile (1,000-km) trek through the Alps from Mercedes’s Sindelfingen facility to the Côte d’Azur in Cassis, France, with battery juice to spare. It built on that feat in late May, when the prototype covered a world-beating, bladder-busting 747 miles (1,202 km) in a run from Germany to the Formula One circuit in Silverstone, England.\n</p><p>\n\tThis wasn’t your usual long-distance, college-engineering project, a single-seat death trap made from Kleenex and balsa wood, with no amenities or hope of being certified for use on public roads. Despite modest power, a futuristic teardrop shape, and next-gen tech, the EQXX—developed in just 18 months—is otherwise a familiar, small Mercedes luxury sedan. That includes a dramatic sci-fi display and human-machine interface that spans the full dashboard. To underline real-world intent, Mercedes vows that the EQXX’s power train will reach showrooms by 2024. An initial showroom model, and surely more to come, will be built on the company’s new \n\t<a href=\"https://insideevs.com/news/589271/mercedes-mma-platform-announced-2024/\" target=\"_blank\">Mercedes Modular Architecture</a> platform, designed for smaller “entry-luxury” models such as the <a href=\"https://www.mbusa.com/en/vehicles/class/a-class/sedan\" target=\"_blank\">A-Class</a> and the <a href=\"https://www.mbusa.com/en/vehicles/class/cla/coupe\" target=\"_blank\">CLA</a> Coupe. While Mercedes was refining its one-off tech showpiece, it even used a current <a href=\"https://www.mbusa.com/en/future-vehicles/2022-eqb-suv\" target=\"_blank\">EQB model</a> as a test mule for the power train.\n</p><p>\n\t“The car is an R&D project, but we’re feeding it into the development of our next compact car platform,” says Conrad Sagert, an engineer at Mercedes who is developing electric drive systems.\n</p><p>\n\tThe engineering team included specialists with the \n\t<a href=\"https://www.mercedes-benz.com/en/art-and-culture/zeitgeist/eq-formulae/\" target=\"_blank\">Mercedes-EQ Formula E team</a>, drawing from their well of electric racing experience. Developed in just 18 months, the rear-drive Vision EQXX is powered by a single radial-flux electric motor—developed entirely in-house—fed by a battery pack with just under 100 kilowatt-hours of usable energy. Inside, environmentally conscious materials include trim panels sourced from cacti, mushroom-based seat inserts and bamboo-fiber shag floor mats, all previewing potential use in showroom cars. One thing that won’t reach production by 2024 is the EQXX’s high-silicon battery anode, which Sagert says is closer to four years from showrooms. Such silicon-rich anodes, which can squeeze more range from batteries, are widely expected to be popularized over the next decade.\n</p><p>\n\tA 241-horsepower output delivers a reasonable 7-second trip from 0 to 60 miles per hour. But from a feathery (for an electric vehicle) 3,900-pound curb weight to wind-cheating aerodynamics, the carbon-fiber-bodied EQXX is designed for pure efficiency, not winning stoplight races. The Benz sipped electrons at 8.7 miles per kilowatt-hour on its Côte d'Azur run, nearly double the roughly 4.5 kWh of the Lucid (the current high for global EVs) and 7.5 miles per kilowatt-hour on the trip to the United Kingdom. If that electric math still seems esoteric, the England-bound Benz delivered the equivalent of 262 miles per gallon, nearly double the 141 mpg of the industry-leading \n\t<a href=\"https://www.tesla.com/model3\" target=\"_blank\">Tesla Model 3 Standard Range</a>.\n</p><p>\n\tA roof panel with 117 solar cells lessens the burden by powering a conventional 12-volt system to run accessories, including lighting, an audio system, and the display screens worthy of \n\t<em><a href=\"https://www.youtube.com/watch?v=PJqbivkm0Ms&ab_channel=Jean-MarcDenis\" target=\"_blank\">Minority Report</a>. </em>On the cloudy April trip to southern France, with plenty of tunnel passages, the panels saved 13 km of range. On the sunnier May drive to the U.K., the solar roof saved 43 km of range.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Roof of a car with solar panels with a beach in the background.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"7e630801e5933b91261fad0e853697bc\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"a55a7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/roof-of-a-car-with-solar-panels-with-a-beach-in-the-background.jpg?id=30788612&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The Vision EQXX’s roof panel has 117 solar cells.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Mercedes-Benz</small>\n</p><p>\n\tAerodynamics naturally play an essential role, including a tiny frontal area and dramatic \n\t<a href=\"https://en.wikipedia.org/wiki/Kammback\" target=\"_blank\">Kamm tail</a> whose active rear diffuser extends nearly 8 inches at speeds above 23 mph. The sidewalls of specially designed Bridgestone tires sit flush with the body and 20-inch magnesium wheels, aiding a claimed drag coefficient of 0.17,  which exceeds any current production car. Surprisingly for such a slippery design, the EQXX features traditional yet aerodynamic exterior mirrors: Mercedes says the camera-based “mirrors” used on many concept cars drew too much electricity to generate a tangible benefit.\n</p><p>\n\tDefying today’s EV norms, the battery and motor are entirely air cooled. Eliminating liquid-cooling circuits, pumps, and fluids set off a spiral of savings in weight and packaging. To cool the battery, a smoothly shaped underbody acts as a heat sink. The design reversed the usual engineering challenge in EVs and internal combustion engine cars alike: The problem was getting heat \n\t<em>into </em>the system to bring battery and motor to optimal operating temperature. Active front shutters can open to boost airflow when necessary.\n</p><p>\n\t“We don’t get enough waste heat, so we had to insulate the electric motor. It’s still about heat management, but the other way around,” Sagert says.\n</p><p>\n\tAdd it up and the EQXX transfers a claimed 95 percent of electric energy into forward motion, up from 90 percent for Mercedes’s current models such as the EQS. If that doesn’t sound like much gain to nonengineers, Sagert puts it another way: The EQXX reduces typical EV energy losses by 50 percent.\n</p><p>\n\t“We’re always hoping for this magical thing, but it’s really the sum of the details,” Sagert says.\n</p><p>\n\tThat obsession with tiny details paid off. Based on computer and dynamometer simulations, engineers saw a 1,000-km run as a challenging target, and plotted a Mediterranean road trip to Cassis, France. Instead, the car blew away those conservative projections. Pulling into Cassis, the EQXX had 140 km of remaining range.\n</p><p>\n\t“We thought about waving and just driving on, but we weren’t allowed,” Sagert says, not least because Mercedes board member and chief technology officer \n\t<a href=\"https://group.mercedes-benz.com/company/corporate-governance/board-of-management/schaefer/\" target=\"_blank\">Markus Schäfer</a> was waiting to greet them. Mercedes then set its sights higher, and chose Silverstone and its Formula One track, ideal for a team meetup.\n</p><p>\n\t“We started thinking, can we do a longer run?” Sagert says. “We always wished to visit our colleagues in Formula E, who did so much for the project. But again we thought, ‘This will be really tough.’ ”\n</p><p>\n\tTo make the runs legit, Mercedes was determined to drive at real-world speeds and conditions, not “<a href=\"https://en.wikipedia.org/wiki/Hypermiling\" target=\"_blank\">hypermile</a>” their way to some illusory record. The car averaged 83 kilometers per hour on its U.K. run, and 87 km/h to Cassis. Test drivers even ran the air conditioning for 8 hours of the two-day, 14 hour-and-30-minute trip to Silverstone, and encountered an autobahn road closure and snarled traffic around London.\n</p><p>\n\tThe sleek sedan capped off the record-breaking trek with an energy-guzzling flourish: Despite some misgivings, the team handed their precious prototype to a Formula E team driver, \n\t<a href=\"https://en.wikipedia.org/wiki/Nyck_de_Vries\" target=\"_blank\">Nyck de Vries</a>. The Type-A racer forgot all about efficiency and pushed the car to its limits on the Silverstone F1 circuit, watched by nervous engineers. Where long-distance drivers had relied almost exclusively on regenerative braking (with four adjustable levels) during their runs, de Vries got to test the car’s novel aluminum brake rotors. Those ultralight rotors are possible because the Benz so rarely needs to use its foot-operated mechanical brakes, as telemetry readings from the track showed.\n</p><p>\n\t“In three laps, de Vries burned more energy using the mechanical brakes than we did on two entire runs” through Europe, Sagert says. “But it was a good feeling, that this wasn’t some show car, and that you could give it to a race driver and not have it fall apart.”\n</p><p>\n\tSome of this prototype tech won’t be feasible on coming production models—a carbon-fiber body, for one, is the stuff of supercars, not small-and-affordable Mercedes. Still, the EQXX offers a tantalizing taste of what’s to come, including all-day range to savor.\n</p><p>\n\t“This range anxiety is not a problem anymore,” Sagert says. “If your range isn’t enough today, wait two years, and the step will be big.”\n</p><p>\n<em>This article appears in the October 2022 print issue as “Deutschland to England, on a Single Charge.”</em>\n</p>",
  "pubDate": "Mon, 08 Aug 2022 16:13:15 +0000",
  "guid": "https://spectrum.ieee.org/new-ev-prototype-leaves-range-anxiety-in-the-dust",
  "category": [
    "Mercedes-benz",
    "Tesla motors",
    "Electric vehicles",
    "Range anxiety"
  ],
  "dc:creator": "Lawrence Ulrich",
  "media:content": ""
}