{
  "title": "Creativity Comes from Idleness",
  "link": "https://danielmiessler.com/blog/creativity-comes-from-idleness/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Wed, 17 Aug 2022 08:32:24 +0000",
  "category": "Creativity",
  "guid": "https://danielmiessler.com/?p=138136",
  "description": "Our creativity is like a daily pool of water within each of us. When we use it, it depletes a bit. When we’re distracted it quickly drains. And when we’re alone with our thoughts it replenishes. In an ideal world you’d wake up and have a full day of creativity ahead of you. You’d just sit down and&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/shower-ideas.png\" alt=\"shower-ideas\" width=\"650\" height=\"651\" class=\"aligncenter size-full wp-image-138138\" /></p>\n\n<p>\n<iframe loading=\"lazy\" src=\"https://omny.fm/shows/unsupervised-learning/creativity-comes-from-idleness-the-idea-series/embed?style=artwork\" allow=\"autoplay; clipboard-write\" width=\"100%\" height=\"180\" frameborder=\"0\" title=\"Creativity Comes From Idleness | THE IDEA SERIES\"></iframe>\n</p>\n\n<p>Our creativity is like a daily pool of water within each of us.</p>\n\n<p>When we use it, it depletes a bit. When we’re distracted it quickly drains. And when we’re alone with our thoughts it replenishes.</p>\n\n<p>In an ideal world you’d wake up and have a full day of creativity ahead of you. You’d just sit down and create, and your reservoir would grow a thousand ideas.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p>But the modern world has tapped our daily reserves with continuous distraction. Most notably our phones. When we stare at a screen our ideas dry up like a cracked lakebed, and somehow it makes us want to eat more dust to quench our thirst.</p>\n\n<p>Showers are an exception. In the shower we become an idea firehose. Why is that?</p>\n\n<p>The reason you become creative in the shower is because it’s (mostly) impossible to be distracted. You’re just there—naked—with your own thoughts. And suddenly you become a genius.</p>\n\n<p>Showers reveal that the natural state is to have ideas, and to be creative. It&#8217;s what happens when you are not distracted, and you can prove this by just sitting in a quiet place with no inputs for 5-30 minutes. You&#8217;ll overflow with thoughts.</p><div data-inline-related-post data-inline-related-post-index=1></div>\n\n<p>This also works with solitary walks. No phone. No podcasts. No audiobooks. Just you and your surroundings. Like in the shower, the ideas will spill from you.</p>\n\n<p>So what’s the lesson here?</p>\n\n<ol>\n<li>In our natural, idle state we produce a replentishing pool of creative water.</li>\n<li>Being distracted siphons off that creativity into nowhere.</li>\n<li>If you value being inspired, spend time alone with nothing but your mind. </li>\n</ol>\n</p>"
}