{
  "title": "The Margin Loan: How to Make a $400,000 Impulse Purchase",
  "link": "https://www.mrmoneymustache.com/2021/01/29/margin-loan-ibkr-review/",
  "comments": "https://www.mrmoneymustache.com/2021/01/29/margin-loan-ibkr-review/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Fri, 29 Jan 2021 17:43:04 +0000",
  "category": [
    "The MMM Blog",
    "investing",
    "Real Estate",
    "stock market"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=17478",
  "description": "So, I kind of just bought the house next door to me. This is already somewhat amazing, for a small-town boy who refuses to even buy himself a new car.&#160; But even stranger are the details that surround this deal: I’m not moving into it. I don’t really need or want a second house. I [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2021/01/29/margin-loan-ibkr-review/\"><img style=\"max-width:100%;height:auto\" width=\"800\" height=\"600\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge-200x150.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge-300x225.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge-768x576.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge-150x113.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/bridge-320x240.jpg 320w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>\n\n<p>So, I kind of just bought the house next door to me. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap-768x1024.jpg\" alt=\"\" class=\"wp-image-17504\" width=\"286\" height=\"380\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap-768x1024.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap-135x180.jpg 135w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap-225x300.jpg 225w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap-112x150.jpg 112w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/front-door-swap.jpg 800w\" sizes=\"(max-width: 286px) 100vw, 286px\" /></a><figcaption>We&#8217;ve already gotten straight into the renovations with a symbolic first step: a new front door.</figcaption></figure></div>\n\n\n\n<p>This is already somewhat amazing, for a small-town boy who refuses to even buy himself a new car.&nbsp; But even stranger are the details that surround this deal:</p>\n\n\n\n<ul><li style=\"padding-bottom: 10px; font-size:17px;\">I’m not moving into it.</li><li style=\"padding-bottom: 10px; font-size:17px;\">I don’t really need or want a second house.</li><li style=\"padding-bottom: 16px; font-size:17px;\">I have no long-term plans to be a landlord.</li><li style=\"padding-bottom: 10px; font-size:17px;\">I made the decision on a whim, and the whole transaction only took about 45 minutes of actual work.</li><li style=\"padding-bottom: 10px; font-size:17px;\">I paid “cash” for the house, avoiding the hassle of getting a mortgage &#8211; while not having to accumulate an entire house price worth of cash.</li></ul>\n\n\n\n<p>And most importantly to <em>you</em>, I used a financial trick that I only recently learned about, but upon further study is an incredibly useful thing to have at your disposal (as long as you use it responsibly).</p>\n\n\n\n<p>The real story is this:&nbsp;</p>\n\n\n\n<p>About two months ago, I learned through the grapevine that the house next door would soon be on the market. There was a cryptic “for sale by owner” entry on Zillow with a $400k asking price, but no pictures and no information on how to contact the sellers.&nbsp;In response to the information vacuum, Zillow had just automatically sucked in a really ugly Google Street View picture of the house.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/justin-listed.jpg\" alt=\"\" class=\"wp-image-17482\" width=\"243\" height=\"364\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/justin-listed.jpg 600w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/justin-listed-120x180.jpg 120w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/justin-listed-200x300.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/justin-listed-100x150.jpg 100w\" sizes=\"(max-width: 243px) 100vw, 243px\" /><figcaption>Figure 1: Just(in) listed<br></figcaption></figure></div>\n\n\n\n<p>In my area, we are in the middle of an insane housing boom. Every new property that comes to market, no matter how modest, is treated like Justin Timberlake stepping onto the stage of a dazzling arena of adoring fans.</p>\n\n\n\n<p>This has left several friends who arrived more recently searching fruitlessly and losing the inevitable bidding war for each uninspiring property, over and over again.</p>\n\n\n\n<p>And my little street happens to tick a lot of boxes for our type of shoppers: a  walkable and bikeable central location which <em>also </em>backs onto open space <em>and </em>features newer (1990s) houses with a layout that can easily be split into two units with separate entrances. All at lower prices than the older houses without views and without <a href=\"https://www.mrmoneymustache.com/2020/10/23/house-hacking/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"house-hacking (opens in a new tab)\">house-hacking</a> potential, just up the hill.&nbsp;<br></p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"978\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-1024x978.jpg\" alt=\"\" class=\"wp-image-17487\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-1024x978.jpg 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-189x180.jpg 189w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-300x286.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-768x733.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-150x143.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1-900x859.jpg 900w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/backyard-1.jpg 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption>Figure 2: Actual scenes from my back yard(!)</figcaption></figure>\n\n\n\n<p>So I knew this place was a good deal and a good investment, and sure enough several friends were interested. The only problem was, so was everybody else: a bidding war was already bubbling up and we only had a few days at most to lock it in.&nbsp;</p>\n\n\n\n<p>And my most interested friend was self-employed, and in the middle of a year-end business boom &#8211;&nbsp; both factors that would delay her ability to get a mortgage. How could we secure this house, so she would get an amazing deal and I would get to live next to a really great group of friends (and continue my plan to gradually take over more of the street) rather than rolling the dice with a random set of new neighbors?</p>\n\n\n\n<p><strong>The solution: </strong>we made a deal where I would make an all-cash offer to buy the house, with very quick and friendly terms to the seller so we could beat the other offers. Then my friend would take her time to get a mortgage, and buy the place from me at a more leisurely pace &#8211; effectively just leasing it from me in the meantime.</p>\n\n\n\n<p><strong>The problem: </strong>I didn’t have anywhere near $400,000 sitting in my checking account, and I did not want to sell a bunch of shares and trigger capital gains taxes (which in my case would be at least $60,000), just for this short term project. I’m a good friend, but not <em>that </em>good.</p>\n\n\n\n<p><strong>The Ultimate Solution: </strong>Learning from a friend who has been doing this for years, I transferred some of my existing investments out of Etrade and into a new brokerage firm (Interactive Brokers), which has an unusually good <strong>Margin Loan </strong>capability. </p>\n\n\n\n<p>This let me borrow money against my own shares, at an interest rate of about one percent (1%!), <em>without selling any of them</em>.&nbsp;</p>\n\n\n\n<p>So end result for me is like a very flexible mortgage, but at less than half the interest rate, and with a virtually-overnight origination speed. And <em>I</em> am the CEO of the bank!</p>\n\n\n\n<p><strong>Introducing the Margin Loan</strong></p>\n\n\n\n<p>Let&#8217;s start with an example of what I did, although with fictional rounded numbers just to make it simple. </p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/margin-limits.png\" alt=\"\" class=\"wp-image-17498\" width=\"426\" height=\"370\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/margin-limits.png 749w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/margin-limits-200x174.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/margin-limits-300x261.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/margin-limits-150x130.png 150w\" sizes=\"(max-width: 426px) 100vw, 426px\" /><figcaption>The way a margin account <em>can </em>work, if you&#8217;re careful.</figcaption></figure></div>\n\n\n\n<p>You may have already heard about the often-risky practice of “buying stocks on margin”, along with its notorious darkside, the possibility of a “margin call”. But there&#8217;s also a big potential advantage, which is why people do it. Let&#8217;s summarize both of them so we can see how to do it right.</p>\n\n\n\n<p><strong>In the best case, a margin account allows you to do things like this:</strong></p>\n\n\n\n<ul><li style=\"padding-bottom: 10px; font-size:17px;\">Put in $100,000 of your own money and buy, say, some shares of the VTI index fund.</li><li style=\"padding-bottom: 10px; font-size:17px;\">Use that as collateral to borrow an additional $100,000 to buy <em>more </em>shares (VTI or otherwise).</li><li style=\"padding-bottom: 10px; font-size:17px;\">You end up with $200,000 invested.</li><li style=\"padding-bottom: 10px; font-size:17px;\">If the stock goes up by 10% per year ($10,000) and you are borrowing the money at only 2% (which costs you $2000), you get $8000 every year for “free”.</li></ul>\n\n\n\n<p><strong>The downside is that this can happen:</strong></p>\n\n\n\n<ul><li style=\"padding-bottom: 10px; font-size:17px;\">You invest your $100k, borrow that second $100k, and buy the same $200k of shares.</li><li style=\"padding-bottom: 10px; font-size:17px;\">COVID hits and your shares suddenly go down 50% (total value is now $100k)</li><li style=\"padding-bottom: 10px; font-size:17px;\">BUT, that $100,000 margin loan you took out hasn&#8217;t changed. In other words, you still owe the brokerage $100k, and your account value is now only $100,000. The total value of your account is now <strong>zero.</strong></li><li style=\"padding-bottom: 10px; font-size:17px;\">Even worse, the brokerage is not cool with this situation, because they require a 50% “maintenance margin”. </li><li style=\"padding-bottom: 10px; font-size:17px;\">They automatically sell half of your shares in order to reduce the loan balance to $50k.</li></ul>\n\n\n\n<p>You’ve just lost 100% of your money (because you own 50k of shares and owe the brokerage 50k), <em>and </em>you were forced to sell the shares at the worst possible time, shutting you out of the possibility of a rapid rebound (like we saw just after the 2020 Coronacrash).</p>\n\n\n\n<p>Note: if the stock drops fast enough, you can even lose <em>more </em>than all your money.</p>\n\n\n\n<p>So, margin is a powerful tool that can multiply your profits <em>or </em>your losses. However, since the stock market tends to rise over time, it can still be a valuable option, as long as you use it with great caution.<br><br><strong>So why, and how, am I using a margin loan?</strong><br><br>Although the basic idea (and risks) are the same, I am using my margin loan a bit differently, to withdraw <em>cash </em>instead of buying more shares. And I am keeping my borrowing well under that 50% threshold in the example above, in order to reduce the risk of trouble in the case of another market crash. Here is what I did:</p>\n\n\n\n<p>I created a new account for myself at Interactive Brokers, selecting  the &#8220;<a href=\"https://www.interactivebrokers.com/en/index.php?f=45500\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"IBKR Pro (opens in a new tab)\">IBKR Pro</a>&#8221; account type to get the lower margin rates, and set it up as a &#8220;margin&#8221; account versus the unnecessarily complex &#8220;portfolio margin&#8221; option. </p>\n\n\n\n<p>I transferred a relatively large amount of shares of stable, diversified companies (mostly the VTI index fund and some Berkshire Hathaway) into this new account.&nbsp;</p>\n\n\n\n<p>With a securities transfer, your actual <em>shares</em> move between from your old brokerage to the new one, rather than being sold on one side and re-bought on the other.  This avoids triggering unnecessary capital gains taxes. I was able to make this part happen entirely online &#8211; no phone calls required.</p>\n\n\n\n<p>Then, since my account was new, I had to sit and wait for 30 days, to clear the security lockup period. This is a good reason to plan in advance by setting up an account when you <em>aren&#8217;t </em>rushing to buy a house. But the deal still worked out, and I&#8217;m even more prepared for next time.</p>\n\n\n\n<p>After that I was able to <strong>withdraw cash using the margin loan feature. </strong>The brokerage lets me go all the way up to 50%, but I kept mine to a lower percentage.</p>\n\n\n\n<p>Now, when I go to make a withdrawal from my account, I see a screen like this one:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/margin-2.png\" alt=\"\" class=\"wp-image-17514\" width=\"318\" height=\"427\"/><figcaption>Although I already have some money borrowed on margin (a negative cash balance), the system calculates how much extra I <strong>could </strong>still borrow based on the current value of my shares.<br>As I pay off this loan, the green number will grow and eventually the red number will rise above zero as well.</figcaption></figure></div>\n\n\n\n<p>This money simply went immediately to my checking account. I used a wire transfer, which the brokerage did for free.</p>\n\n\n\n<p>Within less than an hour of that money hitting my checking account, I was able to wire it right back out to the title company, and buy the house.</p>\n\n\n\n<p><strong>Technical note:</strong> In this case, I did already have a <em>portion</em> of the house price ($140k) available in cash. This allowed me to borrow a smaller amount ($260k) using the margin loan, which made it possible to stay within a conservative borrowing range without requiring millions of dollars in shares.</p>\n\n\n\n<p><strong>The Real Magic: Ludicrously Low Interest Rates</strong></p>\n\n\n\n<p>For a brokerage, a margin loan is an easy and automated way to safely make money off of their clients, because they are really just <em>lending you a portion of your own money. </em></p>\n\n\n\n<p>So as long as they set the rules conservatively, they have your shares as guaranteed collateral and can sell them instantly if needed. This means they can offer rates barely above the prime rate. And Interactive Brokers is particularly aggressive, offering the rates below at the time of writing. </p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"939\" height=\"295\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image.png\" alt=\"\" class=\"wp-image-17492\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image.png 939w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image-200x63.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image-300x94.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image-768x241.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image-150x47.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2021/01/image-900x283.png 900w\" sizes=\"(max-width: 939px) 100vw, 939px\" /><figcaption>(Interactive Broker Margin rates as of Jan 2021. Note: you can always check the current rates on their website <a href=\"https://www.interactivebrokers.com/en/index.php?f=46376\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"here (opens in a new tab)\">here</a>)</figcaption></figure>\n\n\n\n<p>For comparison, Robinhood offers margin loans at 2.5% and Etrade is something silly like 7.95% and up as I write this. Even the low-fee standard Vanguard is in the 7% range. So, Interactive Brokers is truly unique for now &#8211;  which is why I created my account.</p>\n\n\n\n<p><strong><div class=\"mmm-box\">Rates will Fluctuate: </strong></p>\n\n\n\n<p>For US customers, that &#8220;Benchmark Rate&#8221; in the table above is based on a multiple of the Federal Funds rate. As I type this, that rate is around 0.25%, and one year ago it was 1.25%. </p>\n\n\n\n<p>Since it is adjusted during quarterly committee meetings, it rarely moves more than 0.25-0.5% during any given three month period. As example of rapid increase, from 2004-2006 it went up from from 1.25 to 5.25%. <a rel=\"noreferrer noopener\" aria-label=\"More history here (opens in a new tab)\" href=\"https://www.marketplace.org/2019/06/19/a-history-of-the-feds-interest-rate-hikes/\" target=\"_blank\">More history <span style=\"text-decoration: underline;\">here</span></a>.</div></p>\n\n\n\n<p><strong>Cool Implications of This New Trick</strong></p>\n\n\n\n<p><strong>1: Staying fully invested without fear</strong></p>\n\n\n\n<p>In recent years, I have found myself disobeying my own advice and holding more cash in checking accounts than I should have. By foregoing the returns I would have earned if I left this money in the stock market, I have cost myself many thousands of dollars. </p>\n\n\n\n<p>But I was holding back due to a range of fearful excuses like, “What if there’s a stock market crash and I want to get some shares on sale? What if my income tax bill is higher than expected? What if a house comes up on the market and I want to be able to spring on it quickly?”, and so on.</p>\n\n\n\n<p>With the margin loan option now in place, all of these fears disappear. I can now safely remain fully invested, and in the unlikely event of one of those “emergencies” above, I can just pull out any amount of money I might desire. No delays, and no taxes.<br></p>\n\n\n\n<p><strong>2: Being able to buy houses on short notice (or even become a mortgage company for your friends)</strong></p>\n\n\n\n<p>In my situation, I was able to lock in a good deal on a house due to the power of the “cash offer”, which benefits my friend who will eventually buy it from me to become the final owner.  After buying several properties with actual money rather than a mortgage, I have found that the benefits are huge:</p>\n\n\n\n<ul><li style=\"padding-bottom: 10px; font-size:17px;\">By offering cash (and providing proof of funds as needed), you show the seller that you are serious, and that you can actually afford the house. In a hot market, many buyers make offers on houses that they can&#8217;t truly afford. Several weeks later, they find that the financing falls apart, leaving the seller hanging and needing to re-start the sale process. A cash buyer is thus much more reliable</li><li style=\"padding-bottom: 10px; font-size:17px;\">Mortgage companies can be very slow, taking a wise but extensive list of steps before they hand over the money. It can be 6-8 weeks between offer and closing. With your cash, it happens at your own pace (it could be as fast as one day, but 3-4 weeks is reasonable if you are doing inspections and other due diligence.</li><li style=\"padding-bottom: 10px; font-size:17px;\">With a cash offer, you can make your own decisions about how to handle the inspection, or even perform your own (if you happen to be qualified as I am). You also don&#8217;t need to pay an appraiser $600 to take a random dartboard guess at the value of the house you are choosing to pay. As an advanced buyer, <em>you </em>presumably know the value better than anyone else. </li><li style=\"padding-bottom: 10px; font-size:17px;\">Finally, with cash you eliminate any loan origination fees and you can choose your own insurance coverage and deductible, since <em>you </em>are the only one at risk.</li></ul>\n\n\n\n<p>Although this arrangement is unconventional, it doesn&#8217;t feel too risky for me, because the house is solely in my name. If my friend changed her mind or otherwise could not complete the deal, I still own the house, which could be sold at a small profit or rented out. From a legal and accounting perspective, all I’ve done is bought a house as an investment.</p>\n\n\n\n<p>For those with sufficient savings (and who are not prone to worry), this &#8220;Cash Buyer Vigilante&#8221; idea could become a valuable service for other friends, or even a sort of business: you help your clients to make cash offers to buy houses, which gets you a better deal in a competitive market, and you collect a fee for the service. You may also earn a small spread on the difference between the mortgage rate and your broker&#8217;s margin interest rate.</p>\n\n\n\n<p><strong>3: Avoiding unnecessary taxes</strong></p>\n\n\n\n<p>If you never have to sell your shares, you can keep those gains on paper instead of out in the real world &#8211; perhaps even for your entire lifetime.</p>\n\n\n\n<p> As long as you’re comfortable with the margin loan interest rate (which will not always be as low as it is today but should in general remain cheaper than a mortgage), you can borrow against your growing pool of investments for everyday living expenses, house purchases, and even charitable contributions. </p>\n\n\n\n<p>And if you borrow to make additional taxable investments (which is exactly what I have done for the house next door) , the interest itself may be tax deductible as well. For example, consider the following hack, just one of many:</p>\n\n\n\n<p>You have millions of dollars of appreciated Apple and Tesla stock, and want to tax-efficiently fund a nice lifestyle forever. You could</p>\n\n\n\n<ul><li style=\"padding-bottom: 10px; font-size:17px;\">Use a margin loan against these shares to buy a solid multi-unit apartment building (preferably with a high yield and a hands-off management company to manage it for you)</li><li style=\"padding-bottom: 10px; font-size:17px;\">Collect the considerable rent, while taking any allowable depreciation deductions</li><li style=\"padding-bottom: 10px; font-size:17px;\">With a good property, the surplus after all of these expenses will more than pay for your margin loan interest <em>and </em>your own pleasant lifestyle. Groceries, household expenses, kids, travel, whatever you like. And you still own your original investments and haven&#8217;t paid capital gains taxes on anything.</li></ul>\n\n\n\n<p>You do have to be careful, of course. My rule of thumb is to be more than prepared for the worst stock market decline that has ever happened, and even then have a backup plan beyond that. So, my primary house will never be at risk, and only a small portion of my total investments will be subject to margin borrowing.&nbsp;</p>\n\n\n\n<p>But if you do it right, I believe this trick allows you to trade a very small amount of risk for a rather large increase in life options and satisfaction &#8211; in other words, <em>fun</em>. </p>\n\n\n\n<p>So I look forward to sharing more stories of how this neighborly arrangement works out, and the intriguing adventures I have with this new margin account after that.</p>\n\n\n\n<p><strong>In the comments:</strong> if you have more experience and/or questions about margin loans, please share them, and I will update this article so we can make it more comprehensive.</p>\n\n\n\n<p>&#8212;&#8211;</p>\n\n\n\n<p><strong>A note on Interactive Brokers: </strong>I chose this firm based on advice from some friends who are established investors, followed by some online research. I am happy with the results so far, and I received great customer service when setting up the account and going through the learning process of the margin loan (which is really easy). But, like everything in life, I still view it as an <em>experiment</em>. I have lots left to learn.</p>\n\n\n\n<p>The company has a nice &#8220;online-university&#8221; style explanations of all sorts of things, with nicely formatted pages and video lessons &#8211; including more advanced forms of trading that I don&#8217;t plan to get into. But in the case of the margin loan, I found <span style=\"text-decoration: underline;\"><strong><a href=\"https://www.interactivebrokers.com/en/index.php?f=24862#stock-securities-calculation\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"this guide (opens in a new tab)\">this guide</a></strong></span> to be useful.</p>\n\n\n\n<p>IB also offers a <strong><span style=\"text-decoration: underline;\"><a href=\"https://ibkr.com/referral/jon189\">referral program</a></span></strong>. If you establish an account and like the results enough to recommend it, you can share it with your friends. As the program currently stands, you will get $200 for each new customer, and your friend will get up to $1000 (1% of the value of the assets they use to fund it) &#8211; payable in the form of IBKR shares, which is kind of a novel way to pay a bonus.</p>\n\n\n\n<p>If you are thinking of signing up and need a referral link to get your own 1%, you are welcome to use mine <strong><span style=\"text-decoration: underline;\"><a href=\"https://ibkr.com/referral/jon189\">here</a></span></strong> &#8211; which will of course benefit the MMM blog so thanks if you do!</p>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2021/01/29/margin-loan-ibkr-review/feed/",
  "slash:comments": 275,
  "post-id": 17478
}