{
  "id": "yt:video:mZILRPjsaew",
  "yt:videoId": "mZILRPjsaew",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "A Christmas Story Christmas – Official Trailer",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-11-01T16:00:25+00:00",
  "updated": "2022-11-03T17:42:43+00:00",
  "media:group": {
    "media:title": "A Christmas Story Christmas – Official Trailer",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We triple dog dare you to join in on the fun. Ralphie returns in the trailer for #AChristmasStoryChristmas – streaming on HBO Max November 17.\n\nFrom Warner Bros. Pictures and HBO Max comes the family comedy “A Christmas Story Christmas,” the long-awaited follow-up to annual holiday favorite, “A Christmas Story.” This time, Ralphie is all grown up and must deal with Christmas and all that comes with it…as a dad. Peter Billingsley returns to the role that has made kids of all ages anticipate Christmas morning like no other.\n\nStarring alongside Billingsley as Ralphie Parker are Erinn Hayes (“Bill & Ted Face the Music”) as Ralphie’s wife, Sandy; Julianna Layne (“Prodigal Son”) as their daughter, Julie; River Drosche (“Miracle Workers”) as son Mark; Scott Schwartz returning as Flick; RD Robb returning as Schwartz; Ian Petrella reprising his role as Ralphie’s brother, Randy; Davis Murphy (“Looking for Dr. Love”) as Delbert Bumpus; with Zack Ward returning as Scut Farkus; and Julie Hagerty (“Instant Family”) as Ralphie’s mom, Mrs. Parker.\n\nClay Kaytis (“The Christmas Chronicles”) directed from a screenplay by Nick Schenk (“Cry Macho”) and Kaytis, screen story by Schenk and Billingsley, based upon the book In God We Trust, All Others Pay Cash by Jean Shepherd. The film’s producers are Irwin Zwilling, Marc Toberoff, Cale Boyter, Jay Ashenfelter, Billingsley and Vince Vaughn, with Mike Drake, Schenk and Peter Dodd serving as executive producers.\n\nKaytis’s team behind the camera includes director of photography Matthew Clark (“Pitch Perfect 3,” “Mixtape”), production designer Rusty Smith (“Get Out,” “Life of the Party”), editor  David Walsh Heinz (“The Call of the Wild”) and costume designer Shay Cunliffe (“Book Club,” “A  Dog’s Purpose”). The music is by composer Jeff Morrow.\n\nWarner Bros. Pictures and HBO MAX Present A Legendary Pictures / Wild West Picture  Show / Toberoff Production, A Clay Kaytis Film, “A Christmas Story Christmas.” The film will debut on HBO Max on November 17, 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}