{
  "title": "Automated Cloud Driven Scheduling and Optimization of 5G Phased Antenna Arrays",
  "link": "https://www.ansys.com/resource-center/webinar/automated-cloud-driven-scheduling-optimization-5g-phased-antenna-array",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.png?id=26851525&width=980\"/><br/><br/><p>\n\tNokia and Ansys Presents: Automated Cloud Driven Scheduling and Optimization of 5G Phased Antenna Arrays.\n</p><p>\n<a href=\"https://www.ansys.com/resource-center/webinar/automated-cloud-driven-scheduling-optimization-5g-phased-antenna-array\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Register now for this free webinar!</a>\n</p><p>\n\t5G massive MIMO radio applications require more complex antenna systems. The phased antenna array design workflow for such systems is typically both comprehensive and complex, which many times requires a combined effort from different experts.\n</p><hr/><p>\n\tMoreover, the traditional antenna design workflow involves extensive manual tweaking of design parameters to achieve optimum performance. Furthermore, the large 5G phase antenna array simulations are naturally computationally extensive but can mitigated with high-performance computing. However, the most efficient workflow would require a cloud driven workflow that is capable of embarrassingly parallel computation i.e., parallel computing of both the design variations from the optimizer, and the frequency sweep within each design variation.\n</p><p>\n\tThis presentation will show how a real 5G phased antenna array optimization workflow within the Ansys product family, where Ansys ModelCenter is the orchestrator that is scheduling the design variations for the optimizer. The state-of-the-art EM solvers in Ansys HFSS is automatically configured to execute and solve the design variations in parallel in the Ansys cloud environment. The automation of this workflow not only enables a far reduced complexity in the optimization process of 5G phased antenna array, but also considerable time savings due to the hardware availability and parallelism of Ansys Cloud.\n</p><p>\n<strong>What you will learn:</strong>\n</p><ul>\n<li>How to build real 5G phased antenna array optimization workflow</li>\n<li>How to use ModelCenter to schedule the design variations for the optimizer</li>\n<li>How to automatically configure, execute and solve the design variations in parallel</li>\n<li>How to overcome hardware bottlenecks by employing Ansys Cloud</li>\n<li>How to drive time savings in your project</li>\n</ul><p>\n<strong>Who should attend:</strong>\n</p><p>\n\tThis webinar will benefit engineers and designers working with phased antenna array applications. The attendees will learn how Ansys solutions can connect silos, reduce hardware and bottlenecks, and improve time to market.\n</p><h2>CONTINUING EDUCATION CERTIFICATES</h2><p>\n\t\t\tAttendees of this IEEE Spectrum webinar have the opportunity to earn PDHs or Continuing Education Certificates!\n\t\t</p><p>\n\t\t\tTo request your certificate you will need to get a code. You will be provided a code during the webinar (live or on-demand) which will enable you to <a href=\"http://innovationatwork.ieee.org/spectrum/\" rel=\"noopener noreferrer\" target=\"_blank\">complete the form</a> to request the certificate.\n\t\t</p>",
  "pubDate": "Tue, 13 Sep 2022 16:58:45 +0000",
  "guid": "https://www.ansys.com/resource-center/webinar/automated-cloud-driven-scheduling-optimization-5g-phased-antenna-array",
  "category": [
    "5g",
    "Angennas",
    "Ansys",
    "Mimo",
    "Nokia",
    "Type:webinar"
  ],
  "dc:creator": "Ansys",
  "media:content": ""
}