{
  "id": "https://bibleinoneyear.org/en/youth/87",
  "title": "Day 87: In the Day of Trouble",
  "description": "Psalm 38:6-9, Numbers 26:10, Luke 7:11a,12–16,31–35.  Whatever you are facing today, God is able to rescue you  In the passages for today we see examples of troubles – traps, tests and temptations – and how to handle them",
  "pubDate": "Mon, 28 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/87/",
  "itunes:duration": "12:32",
  "guid": "enyouth28032022-87",
  "length": 752.9,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 87: In the Day of Trouble",
  "itunes:subtitle": "Psalm 38:6-9, Numbers 26:10, Luke 7:11a,12–16,31–35.  Whatever you are facing today, God is able to rescue you  In the passages for today we see examples of troubles – traps, tests and temptations – and how to handle them",
  "itunes:summary": "Ajay Gohil was brought up as a Hindu and worked for the family business in a newsagent in North London. At the age of twenty-one he contracted erythrodermic psoriasis, a chronic skin disease. His weight dropped from 11.5 stone (73kg) to 7.5 stone (47.6kg). The disease was all over his body from head to toe. He lost all his friends. His wife and son left him. He wanted to die.\nAs Ajay lay dying in hospital he cried out to God. He looked in his locker and found a Bible there. He opened it at Psalm 38 – the psalm for today. Each and every verse seemed relevant to him. He prayed for God to heal him. He fell into a deep sleep. By the next morning he was totally healed. His skin was new like a baby’s and his life was turned around. He was reunited with his son. I interviewed him in one of the services at HTB. He said, ‘Every day I live for Jesus.’\nLife is not all plain sailing. We will all face troubles. Whatever you are facing today, God is able to rescue you. In the passages for today we see examples of troubles – traps, tests and temptations – and how to handle them.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 452
}