{
  "title": "576: How Are Spells Created? Discussing the Physics of Harry Potter",
  "link": "https://audioboom.com/posts/8147829",
  "itunes:episode": 576,
  "itunes:title": "How Are Spells Created? Discussing the Physics of Harry Potter",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3949,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, the subject of many a late night with Laura and her boyfriend is made into a main discussion for MuggleCast as the hosts and Marc talk through the physics of <em>Harry Potter</em>! Surely magical objects don't come from 'nowhere,' and there must be a magical cost for doing magic somehow? Those big questions and more are our target as Andrew, Eric, Laura, Micah and Marc put on their thinking caps and dive in!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome to this week's special guest, Laura's boyfriend Marc!</li>\n<li>Marc is a game designer with a passion for physics.</li>\n<li>A <a href=\"https://twitter.com/HogwartsLegacy/status/1562143964702146561\">new trailer for <em>Hogwarts Legacy</em></a> has debuted, and we now know what all versions of the game will cost us. You might need to break into Gringotts to be able to afford the Collectors Edition!?</li>\n<li>Main Discussion: The physics of Harry Potter</li>\n<li>Just what is 'physics' and what answers does the study of physics seek to find?</li>\n<li>In the Wizarding World, is there a cost for doing magic? What kind of magic seems limitless, and what kind does not?</li>\n<li>Where does magical ability come from and how does it work?</li>\n<li>Are new magical spells created, or discovered?</li>\n<li>Next the MuggleCasters ask: where does the food come from, and where does your sh** go?</li>\n<li>What do our known laws (such as conservation of mass) have in common with Gamp's known laws of Elemental Transfiguration? We go point by point.</li>\n<li>Does the Vanishing Charm break down an object's atoms, or teleport it to a different dimension?</li>\n<li>In this week's Bonus MuggleCast available <a href=\"https://www.patreon.com/mugglecast/\">exclusively to Patrons</a>, the hosts examine the physics of some magical objects including Invisibility Cloaks, Time Turners and Dumbledore's Deluminator.</li>\n<li>Quizzitch: In Year 4, What does Ron smush in anger after Draco taunts him about having inside-Ministry information regarding the TriWizard Tournament?</li>\n<li>Next week's episode: The hosts are building their own Hogwarts lesson! Come prepared for lectures and a pop quiz!</li>\n<li>This week's episode is brought to you by Backbone! Go to <a href=\"https://www.PlayBackbone.com/mugglecast\">PlayBackbone.com/mugglecast</a> NOW to order your Backbone. For a limited <br>\ntime, and get FREE access to over 350 console games and perks.</li>\n</ul>\n",
  "pubDate": "Tue, 30 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-29:/posts/8147829",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}