{
  "id": "tag:theatlantic.com,2021:39-620169",
  "content": "<figure data-apple-news-hide=\"1\"><img alt=\"Photo of 3 rows of waves cut out of cardboard boxes, with large cardboard tsunami wave that has white crest made of white/black shipping label\" height=\"667\" src=\"https://cdn.theatlantic.com/media/img/posts/2021/10/Dis_Mull_Returns/96951a4de.jpg\" width=\"665\">\n<figcaption class=\"credit\">Jason Fulford and Tamara Shopsin</figcaption>\n</figure><p class=\"dropcap\">C<span class=\"smallcaps\">onsider the dressing room</span>. The concept began its mass-market life as an amenity in Gilded Age department stores, a commercial sanctuary of pedestals and upholstered furniture on which to swoon over the splendid future of your wardrobe. Now, unless you’re rich enough to sip gratis champagne in the apartment-size private shopping suites of European luxury brands, the dressing room you know bears little resemblance to its luxe progenitors.</p><p>Over the course of several decades and just as many rounds of corporate budget cuts, dressing rooms have filled with wonky mirrors and fluorescent lights and piles of discarded clothes. At one point in your life or another, as you wriggled your clammy body into a new bathing suit—underpants still on, for sanitary purposes—you have probably experienced the split-second terror of some space cadet trying to yank the door open (if you’re lucky enough to have a door). Maybe you have heard your own panicked voice croak, “Someone’s in here!”</p><p>Through the 1990s and into the 2000s, even as stores became dingy and understaffed, the dressing room try-on remained a crucial step in the act of clothing yourself. But as online shopping became ever more frictionless—and the conditions in the fitting room ever less desirable—Americans realized that it might just be better to order a few sizes on a retailer’s website and sort it out at home. Estimates vary, but in the past year, one-third to one-half of all clothing bought in the United States came from the internet. More shopping of almost every type shifts online each year, a trend only <a href=\"https://www.theatlantic.com/magazine/archive/2021/03/ultra-fast-fashion-is-eating-the-world/617794/?utm_source=feed\">accelerated by months of pandemic restrictions and shortages</a>.</p><p>This explosive growth in online sales has also magnified one of e-commerce’s biggest problems: returns. When people can’t touch things before buying them—and when they don’t have to stand in front of another human and insist that a pair of high heels they clearly wore actually never left their living room—they send a lot of stuff back. The <a href=\"https://www.cnbc.com/2019/01/10/growing-online-sales-means-more-returns-and-trash-for-landfills.html\">average brick-and-mortar store</a> has a return rate in the single digits, but online, the average rate is somewhere between 15 and 30 percent. For clothing, it can be even higher, thanks in part to bracketing—the common practice of ordering a size up and a size down from the size you think you need. Some retailers actively encourage the practice in order to help customers feel confident in their purchases. At the very least, <a href=\"https://www.theatlantic.com/magazine/archive/2020/01/the-myth-of-free-shipping/603031/?utm_source=feed\">many retailers now offer free shipping</a>, free returns, and frequent discount codes, all of which promote more buying—and more returns. Last year, U.S. retailers <a href=\"https://nrf.com/media-center/press-releases/428-billion-merchandise-returned-2020\">took back more than $100 billion in merchandise sold online</a>.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2021/08/pandemic-american-shoppers-nightmare/619650/?utm_source=feed\">Read: American shoppers are a nightmare</a>]</i></p><p>All of that unwanted stuff piles up. Some of it will be diverted into a global shadow industry of bulk resellers, some of it will be stripped for valuable parts, and some of it will go directly into an incinerator or a landfill.</p><p>It sounds harmful and inefficient—all the box trucks and tractor trailers and cargo planes and container ships set in motion to deal with changed minds or misleading product descriptions, to say nothing of the physical waste of the products themselves, and the waste created to manufacture things that will never be used. That’s because it <i>is</i> harmful and inefficient. Retailers of all kinds have always had to deal with returns, but processing this much miscellaneous, maybe-used, maybe-useless stuff is an invention of the past 15 years of American consumerism. In a race to acquire new customers and retain them at any cost, retailers have taught shoppers to behave in ways that are bad for virtually all involved.</p><p class=\"dropcap\"><span class=\"smallcaps\">The retail-logistics </span>industry<span class=\"smallcaps\"> </span>is split into two halves. Forward logistics—the process of moving goods from manufacturers to their end users—is the half most consumers regularly interact with. It includes postal workers, your neighborhood UPS guy, and the people who stock shelves at Target or pick items and pack boxes at Amazon warehouses. “Pick packing and shipping individual things to satisfy customer orders is a madness, but it’s a straightforward madness,” Mark Cohen, the director of retail studies at the Columbia University School of Business and the former CEO of Sears Canada, told me. The other half—reverse logistics—isn’t straightforward at all.</p><p>“Reverse logistics is nasty,” Tim Brown, the managing director of the Supply Chain and Logistics Institute at Georgia Tech, told me. The process of <a href=\"https://www.theatlantic.com/technology/archive/2019/01/where-amazon-returns-go-to-be-resold-by-hustlers/580363/?utm_source=feed\">getting unwanted items back from consumers and figuring out what to do with them</a> is time- and labor-intensive, and often kind of gross. Online returns are collected one by one from parcel carriers, brick-and-mortar stores, a growing number of third-party services, and sometimes directly from customers’ homes. Workers at sorting facilities open boxes and try to determine whether the thing in front of them is what’s on the packing list—to discern the difference between the various car parts sold on Amazon, or the zillion black polyester dresses available to order from H&amp;M. They also need to figure out whether it’s been used or worn, if it works, if it’s clean, and if it or any of its components are economically and physically salvageable.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2019/01/where-amazon-returns-go-to-be-resold-by-hustlers/580363/?utm_source=feed\">Read: Where Amazon returns go to be resold by hustlers</a>]</i></p><p>Sometimes, the answers to those questions are clear. “Consumers say they’re returning XYZ, but they really return a dead rat and a cinder block,” Brown said. That kind of fraud accounts for 5 to 10 percent of returns. Usually, though, the situation is ambiguous. How used do jeans have to be for them to be considered used? Does a mere try-on count, if they’ve been removed from their packaging?</p><p>We can dispense now with a common myth of modern shopping: The stuff you return probably isn’t restocked and sent back out to another hopeful owner. Many retailers don’t allow any opened product to be resold as new. Brick-and-mortar stores have sometimes skirted that policy; products that are returned directly to the place where they were sold can be deemed close enough to new and sold again. But even if mailed-in products come back in pristine, unused condition—say, because you ordered two sizes of the same bra and the first one you tried on fit fine—the odds that things returned to a sorting facility will simply be transferred to that business’s inventory aren’t great, and in some cases, they’re virtually zero. Getting an item back into a company’s new-product sales stream, which is sometimes in a whole different state, can be logistically prohibitive. Some things, such as beauty products, underwear, and bathing suits, are destroyed for sanitary reasons, even if they appear to be unopened or unused.</p><p>Perfectly good stuff gets thrown away in these facilities all the time, simply because the financial math of doing anything else doesn’t work out; they’re too inexpensive to be worth the effort, or too much time has passed since they were sold. Fast fashion—the extremely low-cost, <a href=\"https://www.theatlantic.com/entertainment/archive/2015/03/the-neurological-pleasures-of-modern-shopping/388577/?utm_source=feed\">quick-churn styles </a>you can buy from brands such as Forever 21 and Fashion Nova—tends to tick both boxes, and the industry <a href=\"https://www.theatlantic.com/magazine/archive/2021/03/ultra-fast-fashion-is-eating-the-world/617794/?utm_source=feed\">generates some of the highest return rates in all of consumer sales</a>. Imagine a dress that sold for $25 and was sent back without its plastic packaging at the end of the typical 30-day return window. Add up the labor to pick, pack, and dispatch the item; the freight both coming and going; the labor to receive and sort the now-returned item; the cardboard and plastic for packaging; and the sorting facility’s overhead, and the seller has already lost money. By one estimate, <a href=\"https://www.wsj.com/articles/amazon-walmart-tell-consumers-to-skip-returns-of-unwanted-items-11610274600\">an online return typically costs a retailer $10 to $20 before the cost of shipping</a>. And in the space of a month, the people who might have paid full price for the dress have moved on to newer items on the seller’s website. At that point, one way or another, the dress has got to go.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2021/03/ultra-fast-fashion-is-eating-the-world/617794/?utm_source=feed\">From the March 2021 issue: Ultra-fast fashion is eating the world</a>]</i></p><p>Many products survive their initial return, and even get sold again—just not to the retailer’s customers. Stores like Neiman Marcus and Target, which carry a bunch of different brands, are often able to return excess product to those brands for at least a partial refund. That might mean a pallet of polo shirts goes back to Ralph Lauren, or Hanes eats part of the loss on a new line of socks that didn’t sell. At that point, the brand or wholesaler taking back the product has to decide whether it should be thrown away or sold.</p><p>Or, when someone returns a computer to Best Buy, for example, the company can try to sell it elsewhere, even if it’s just for parts. Perhaps its outer case would be discarded and its processor and video card removed and off-loaded, along with thousands of others, to a middleman who flips them to repair services or retailers that sell refurbished parts. Bulk sales of intact merchandise supply much of the inventory in domestic deep-discount retailers such as Big Lots, according to Brown, and are also why so many people in countries without American stores wear American clothes. Unwanted clothing and other goods are sold off thousands of pounds at a time in shipping containers; the buyers discard what they can’t resell and ship the rest overseas to wholesale it as fresh merchandise.</p><p>This is why it’s difficult to accurately estimate what portion of returned merchandise is discarded, or even how much waste it adds up to, though we do know that billions of pounds of returns are thrown away in the U.S. every year. Joel Rampoldt, a managing director at the consulting firm AlixPartners, told me that most people in the industry believe that about 25 percent of returns are discarded, although the proportion varies widely depending on the product (clothing tends to be easier to resell than electronics that may contain user data, for example). There are so many points in an object’s life where it could go to the trash heap instead of to a person who will use it, and once it’s off the books—especially if it’s out of the country—American retailers are no longer keeping track. These practices are essentially unregulated; companies do whatever they deem most profitable.</p><p>Now is usually when people start wondering why more returns aren’t just donated. Don’t lots of people in the U.S. need winter coats and smartphones and other crucial tools of everyday life that they can’t afford? Wouldn’t providing those things be good PR for retailers? Wouldn’t it be a tax write-off, at the very least? Donation would be the morally sound move. But companies have little incentive to act morally, and many avoid large-scale domestic donations because of what is politely termed “brand dilution”: If paying customers catch you giving things to poor people for free, the logic goes, they’ll feel like the things you sell are no longer valuable.</p><p>Some of the largest retailers, such as Amazon and Target, have begun to quietly acknowledge that it doesn’t even make sense for them to eat the cost of reverse logistics to get back many of the things they sell. They’ll refund you for your itchy leggings or wonky throw pillows and suggest that you give them away, which feels like an act of generosity but, more likely, is really just farming out the task of product disposal.</p><p class=\"dropcap\"><span class=\"smallcaps\">The birth of </span>the returns problem is almost always pinned on Zappos. In the mid-2000s, the company persuaded millions of Americans to buy shoes online—a turn of events that, at the time, seemed extremely unlikely—by marketing its fast, free shipping and free, no-questions-asked return policy as ardently as it did its products. The easy-returns tactic was hardly new in retail (Nordstrom, among others, was long famous for being so lenient that the store would take back things it didn’t sell in the first place in order to keep customers happy). But the free-returns model had never before been applied at such a large scale to online sales, where the logistics of giving buyers so much latitude is much more costly. Zappos’s success helped shape how people understood online shopping to work. “It’s so baked into consumer expectations, and consumers are very irrational about the cost of shipping and returns,” Rampoldt told me. “To some extent retailers have created that, and now they’re stuck with it.”</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2020/01/the-myth-of-free-shipping/603031/?utm_source=feed\">From the January/February 2020 issue: Stop believing in free shipping</a>]</i></p><p>Businesses often lose money in the pursuit of customers, hoping to make back the initial loss in the long run by creating durable economies of scale, which Zappos has successfully done—Scott Schaefer, the company’s vice president of finance, told me that it’s profitable, and has no need or desire to tighten its shipping and returns policies. But Zappos’s strategy had ramifications far beyond its own sales figures. By changing consumer behavior, it inadvertently pushed lots of other businesses to adopt the buy-it-all, return-it-later policies that have now become the industry standard, especially as e-commerce spending consolidates among a few mega-companies like Amazon, Target, and Walmart. Retailers of that size are better able to absorb the cost of return shipping and junked product than smaller businesses are. But many of those smaller businesses must adopt similar policies anyway to hold on to their customers.</p><p>Alarmingly, the problem almost never comes up in business education. “There’s very, very, very, very little academic work in reverse logistics,” Brown said. Meanwhile, “forward logistics and supply chain is taught in every business school in the country.” People are taught to sell.</p><p>And stores don’t want to talk about returns. Seven of the eight that I contacted for this story, which specialize in everything from cheap dog toys to luxury fashion, declined to comment at all. The issue is a nonstarter in almost every way: No company wants to draw attention to customers who are disappointed in their purchases. If a retailer admits that it wants to cut back on its generous policies, it risks headlines painting it as stingy. And once people start thinking about returns, they might start asking where all that returned product <i>goes</i>, which is a whole other can of public-relations worms.</p><p>This avoidance runs deep—public companies have to disclose a litany of financial details to shareholders every year, but regulatory agencies don’t require them to include return rates or specify their financial impact, so they don’t. When everyone’s mouths are shut, the size of the problem becomes very difficult to discern.</p><p>Schaefer, from Zappos, said that the centrality of returns to the business’s sales model means that the price of service has long been baked in. “I could be significantly more transactionally profitable if I cut off and said no returns,” Schaefer told me. “But I would easily lose all of my customers and all my customer trust.” Because Zappos doesn’t carry fast fashion, it has an advantage over some other apparel retailers; much of its return volume comes back unworn and is reintegrated into its regular inventory.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/entertainment/archive/2015/03/the-neurological-pleasures-of-modern-shopping/388577/?utm_source=feed\">Read: The neurological pleasures of modern shopping</a>]</i></p><p>But even some of the biggest retailers in the world now see rampant returns as an existential threat. In recent years, many have started using third-party software to find and ban their highest-volume returners from sending things back, and sometimes from buying anything at all. Amazon, Sephora, Best Buy, Ulta, and Walmart, among many others, close shoppers’ accounts or bar them from stores if their returns seem atypical or potentially fraudulent. Details on what these companies consider aberrant behavior are scant, but Mark Cohen oversaw one of the first such policies, at Sears Canada in the mid-2000s. In its sweep, he said, Sears found 1,400 people who were engaged in what he called “recreational shopping”—buying things nearly every week and returning all or almost all of them. What’s more, many of these people even employed the tactic with big-ticket items such as tractors, lawn mowers, and refrigerators.</p><p>Third-party businesses have also sprouted up to wrestle returns into some kind of submission. If you shop online with any regularity, you’ve probably interacted with a post-purchase retail-logistics company such as Narvar, even if you didn’t realize it. These companies notify buyers when things have shipped or they’re about to arrive, clean up the tracking information into something understandable at a glance, and collect and organize data about why and how often certain products come back. Other companies promise to intervene in the physical logistics of moving $100 billion in online returns back to sellers. Roadie, for example, will pay gig workers to ferry returns back to sorting facilities in their own cars, ostensibly in situations where drivers are already heading that way. Happy Returns lets shoppers drop off their unwanted, unpackaged goods at “return bars” inside local businesses—drugstores, stationery shops, FedEx offices—which in theory minimizes the hassle, and thus speeds things up. Happy Returns then sorts and sends the items back to retailers, creating some measure of greater efficiency.</p><p>But returns don’t seem like a problem that can necessarily get solved completely. As the places where people used to buy clothes or stationery or kids’ toys in person are pushed out of business, online shopping becomes even more of a necessity. And Americans will probably continue to buy more than they intend to keep, even if it means an extra trip to the UPS store. Prices will go up to account for how expensive it is to send all this unwanted stuff back and forth, and companies will make nonbinding sustainability pledges that attract positive headlines while still shoveling things into landfills. They will do so until that is no longer legal, or no longer profitable for the largest and most powerful retailers, at which point they’ll force their customers to get used to something else.</p><p>When surveyed about their preferences, big majorities of Americans under 40 say that they’d happily pay more to patronize businesses that aren’t wasteful or harmful to the environment. That is the right answer when another human asks you whether you care about the future of the planet. But the receipts tell a different story so far: Those same shoppers do a far larger portion of their shopping online than their older counterparts do, and they’re also more likely to place big orders, buying items in multiple sizes and colors, with the intention of sending some back. That’s the slick thing about shopping now. So much of it takes place in the same manner as returns—in the privacy of your own home, no human interaction or judgment required.</p><hr><p><small><i>This article appears in the <a data-saferedirecturl=\"https://www.google.com/url?q=https://www.theatlantic.com/magazine/toc/2021/11/&amp;source=gmail&amp;ust=1633202161380000&amp;usg=AFQjCNGpCHGPdIYpM8Yv-p-oIGVr97sMGA\" href=\"https://www.theatlantic.com/magazine/toc/2021/11/?utm_source=feed\" target=\"_blank\">November 2021</a> print edition with the headline “</i><em>Unhappy Returns</em><i>.”</i></small></p>",
  "author": {
    "name": "Amanda Mull",
    "uri": "http://www.theatlantic.com/author/amanda-mull/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Jason Fulford and Tamara Shopsin"
  },
  "title": "The Nasty Logistics of Returning Your Too-Small Pants",
  "published": "2021-10-07T07:00:00-04:00",
  "updated": "2021-10-13T10:39:05-04:00",
  "summary": "What happens to the stuff you order online after you send it back?",
  "link": ""
}