{
  "title": "Loopholes in the Global Corporate Minimum Tax",
  "link": "https://conversableeconomist.com/2022/10/26/loopholes-in-the-global-corporate-minimum-tax/",
  "dc:creator": "conversableeconomist",
  "pubDate": "Wed, 26 Oct 2022 18:21:27 +0000",
  "category": "Uncategorized",
  "guid": "https://conversableeconomist.com/?p=13029",
  "description": "<p>There has been a high-profile effort in the last couple of years for an international treaty that would impose a minimum tax on corporate profits across countries. The intuitive appeal is straightforward: corporations can use various methods&#8211;say, where they locate their headquarters or how they finance the firm&#8211;so that profits in an accounting sense happen &#8230; <a href=\"https://conversableeconomist.com/2022/10/26/loopholes-in-the-global-corporate-minimum-tax/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Loopholes in the Global Corporate Minimum Tax</span></a></p>\n<p>The post <a href=\"https://conversableeconomist.com/2022/10/26/loopholes-in-the-global-corporate-minimum-tax/\">Loopholes in the Global Corporate Minimum Tax</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "content:encoded": "<p>There has been a high-profile effort in the last couple of years for an international treaty that would impose a minimum tax on corporate profits across countries. The intuitive appeal is straightforward: corporations can use various methods&#8211;say, where they locate their headquarters or how they finance the firm&#8211;so that profits in an accounting sense happen in a place with low or zero corporate taxes. A minimum corporate tax across countries wouldn&#8217;t eliminate this incentive, but perhaps it could ameliorate it? </p>\n\n\n\n<p>As I have observed before, this intuitive appeal is quickly muddled by the realities of global corporate taxation. For example, should the profits of a multinational firm be allocated across countries by where the production facilities of the firm are based, by where the sales occur, by the legal residence of the firm, by the &#8220;source&#8221; of where the profits are generated through research and development or intellectual property&#8211;or by some overall formula that brings all these factors into the picture? International corporate taxation is messy.</p>\n\n\n\n<p>The underlying issue, of course, is that governments around the world want to attract productive, job-generating companies. Even if an international agreement could be signed to prevent governments from attracting firms by offering a lower corporate tax rate, they can use other kinds of subsidies to attract firms. G<a href=\"https://www.piie.com/blogs/realtime-economics/global-minimum-corporate-tax-will-not-end-forces-drive-tax-competition\">ary Hufbauer mentions some possibilities in &#8220;The global minimum corporate tax will not end forces that drive tax competition&#8221;</a> (Peterson Institute for International Economics, October 25, 2022). </p>\n\n\n\n<p>Hufbauer points out that even as President Biden&#8217;s administration participates in international talks for a global minimum tax, a number of its legislative successes would allow companies to pay less than the minimum. The Creating Helpful Incentives to Produce Semiconductors Act of 2022, know as the CHIPS Act? &#8220;This law will funnel US$76 billion in tax credits and grants to major firms producing semiconductors in the United States &#8230; In fact, by <a href=\"https://www.thirdway.org/blog/adding-it-up-groundbreaking-federal-investments-into-clean-energy-innovation\">some estimates</a>, the Biden administration’s three big accomplishments—the infrastructure law as well as the CHIPS and IRA laws—could funnel hundreds of billions of dollars in subsidies and tax incentives that could benefit large corporations, enabling them to lower the tax liabilities that would be imposed under the global minimum.&#8221; Indeed, the Inflation Reduction Act (IRA) explicitly says that the semiconductor firms receiving assistance from CHIPS can pay lower tax rates than the US corporate minimum. </p>\n\n\n\n<p>This isn&#8217;t just a US issue, of course. Hufbauer writes: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>In today’s highly competitive global economy, public officials are challenged not only to raise tax revenues but also to save jobs, create jobs, advance technology, or deliver essential services, by deploying government incentives. Officials are not always content to let market forces prevail. The result is a mixture of trade protection, subsidies, tax relief, and in extreme cases, state-owned enterprises, depending on the country and its politics. If overt tax competition is ruled out, some officials will likely turn to other means to help favored corporations.&nbsp;&nbsp;</p>\n\n\n\n<p>It is only when you read the fine print in the global minimum tax that you see that it gives an easy pass to these alternatives. So-called Qualified Refundable Tax Credits—credits payable within four years of the designated activity—<a href=\"https://www.oecd.org/tax/beps/tax-challenges-arising-from-the-digitalisation-of-the-economy-global-anti-base-erosion-model-rules-pillar-two.pdf\">are not deducted</a>&nbsp;when calculating the tax paid by a business firm. Under International Financial Reporting Standards (IFRS) accepted by the Organization for Economic Cooperation and Development (OECD), subsidies can be allocated against the cost of an acquired asset, and are thereby only&nbsp;<a href=\"https://advisory.kpmg.us/articles/2019/government-grants-ifrs-compared-to-us-gaap.html\">indirectly subject to tax over a period of years</a>&nbsp;as the reduced cost of the asset is depreciated or amortized.</p>\n</blockquote>\n\n\n\n<p>Of course, countries watch how other countries treat large corporations. For example, the US subsidizes semiconductor makers because other countries do so, and other countries subsidize semiconductor makers because the US does so. Hufbauer writes: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>China, Japan, South Korea, and Taiwan have long subsidized semiconductor fabrication plants (fabs). According to data published by the <a href=\"https://www.semiconductors.org/turning-the-tide-for-semiconductor-manufacturing-in-the-u-s/\">Boston Consulting Group and the Semiconductor Industry Association</a>, subsidies account for 15 percent of the cost of fab operations in Japan, up to 30 percent in Taiwan and South Korea, and up to 40 percent in China. Again, if a global minimum tax had existed in 2000, it would have made no difference to Asian fab incentives. Now that the US federal government has entered the fab subsidy race, <a href=\"https://www.europarl.europa.eu/thinktank/en/document/EPRS_BRI(2022)733585\">so have Europe</a>, <a href=\"https://www.ft.com/content/cbd50844-853e-4435-8028-f581d536a89a\">India</a>, and <a href=\"https://www.theregister.com/2022/08/22/mexico_joins_the_list_nations/\">Mexico</a>. Moreover, the CHIPS Act extends its application to two foreign semiconductor giants, Samsung and Taiwan Semiconductor Manufacturing Corporation (TSMC), and both have announced huge investments in US fabs. </p>\n</blockquote>\n\n\n\n<p>Just to be clear, the existing treaty talks that focus on a minimum global corporate tax rate would have no effect on any of these other ways of subsidizing firms. </p>\n\n\n\n<p></p>\n\n\n\n<p></p>\n<p><a class=\"a2a_button_facebook\" href=\"https://www.addtoany.com/add_to/facebook?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F26%2Floopholes-in-the-global-corporate-minimum-tax%2F&linkname=Loopholes%20in%20the%20Global%20Corporate%20Minimum%20Tax\" title=\"Facebook\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_twitter\" href=\"https://www.addtoany.com/add_to/twitter?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F26%2Floopholes-in-the-global-corporate-minimum-tax%2F&linkname=Loopholes%20in%20the%20Global%20Corporate%20Minimum%20Tax\" title=\"Twitter\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_button_email\" href=\"https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F26%2Floopholes-in-the-global-corporate-minimum-tax%2F&linkname=Loopholes%20in%20the%20Global%20Corporate%20Minimum%20Tax\" title=\"Email\" rel=\"nofollow noopener\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save addtoany_share\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fconversableeconomist.com%2F2022%2F10%2F26%2Floopholes-in-the-global-corporate-minimum-tax%2F&#038;title=Loopholes%20in%20the%20Global%20Corporate%20Minimum%20Tax\" data-a2a-url=\"https://conversableeconomist.com/2022/10/26/loopholes-in-the-global-corporate-minimum-tax/\" data-a2a-title=\"Loopholes in the Global Corporate Minimum Tax\"></a></p><p>The post <a href=\"https://conversableeconomist.com/2022/10/26/loopholes-in-the-global-corporate-minimum-tax/\">Loopholes in the Global Corporate Minimum Tax</a> first appeared on <a href=\"https://conversableeconomist.com\">Conversable Economist</a>.</p>",
  "post-id": 13029
}