{
  "title": "Reinforcement Learning based Cyberattack Model for Adaptive Traffic Signal Controller in Connected Transportation Systems. (arXiv:2211.01845v1 [cs.CR])",
  "link": "http://arxiv.org/abs/2211.01845",
  "description": "<p>In a connected transportation system, adaptive traffic signal controllers\n(ATSC) utilize real-time vehicle trajectory data received from vehicles through\nwireless connectivity (i.e., connected vehicles) to regulate green time.\nHowever, this wirelessly connected ATSC increases cyber-attack surfaces and\nincreases their vulnerability to various cyber-attack modes, which can be\nleveraged to induce significant congestion in a roadway network. An attacker\nmay receive financial benefits to create such a congestion for a specific\nroadway. One such mode is a 'sybil' attack in which an attacker creates fake\nvehicles in the network by generating fake Basic Safety Messages (BSMs)\nimitating actual connected vehicles following roadway traffic rules. The\nultimate goal of an attacker will be to block a route(s) by generating fake or\n'sybil' vehicles at a rate such that the signal timing and phasing changes\noccur without flagging any abrupt change in number of vehicles. Because of the\nhighly non-linear and unpredictable nature of vehicle arrival rates and the\nATSC algorithm, it is difficult to find an optimal rate of sybil vehicles,\nwhich will be injected from different approaches of an intersection. Thus, it\nis necessary to develop an intelligent cyber-attack model to prove the\nexistence of such attacks. In this study, a reinforcement learning based\ncyber-attack model is developed for a waiting time-based ATSC. Specifically, an\nRL agent is trained to learn an optimal rate of sybil vehicle injection to\ncreate congestion for an approach(s). Our analyses revealed that the RL agent\ncan learn an optimal policy for creating an intelligent attack.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Irfan_M/0/1/0/all/0/1\">Muhammad Sami Irfan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Rahman_M/0/1/0/all/0/1\">Mizanur Rahman</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Atkison_T/0/1/0/all/0/1\">Travis Atkison</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dasgupta_S/0/1/0/all/0/1\">Sagar Dasgupta</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hainen_A/0/1/0/all/0/1\">Alexander Hainen</a>"
}