{
  "id": "https://bibleinoneyear.org/en/youth/62",
  "title": "Day 62: How to Exercise Spiritual Authority",
  "description": "Psalm 29:1,4,11, Leviticus 9:23–24, Mark 11:27–33, 12:1–12.  Of course, it can be abused  However, godly, spiritual authority is a source of great blessing",
  "pubDate": "Wed, 03 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/62/?ignore",
  "itunes:duration": "12:48",
  "guid": "enyouth03032021-62",
  "length": 768.76,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 62: How to Exercise Spiritual Authority",
  "itunes:subtitle": "Psalm 29:1,4,11, Leviticus 9:23–24, Mark 11:27–33, 12:1–12.  Of course, it can be abused  However, godly, spiritual authority is a source of great blessing",
  "itunes:summary": "I first met him when he came to speak at a student weekend while I was studying at Cambridge University. Although he was the guest speaker, he was very gracious and I sensed a deep humility.\nWhen he spoke, he did so with real authority. His message was simple and focused on telling people about Jesus. A few years later he came to be the vicar of Holy Trinity Brompton.\nThis modest and deeply spiritual man not only led our church (and others) at a key moment in its growth, but also trained some of the most influential Christian leaders in the UK over the last 40 years. David Watson, David MacInnes, Sandy Millar and John Irvine were all curates to John Collins, a clergyman who has never sought prominence or platform, but who has invested his whole life in serving others.\nHis authority does not come from his position in life or from worldly power. Rather, his authority comes from his relationship with Jesus Christ. It is self-authenticating.\nToday people are very wary of authority. Of course, it can be abused. However, godly, spiritual authority is a source of great blessing.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 62
}