{
  "title": "Improved effective vertices in the multi-orbital Two-Particle Self-Consistent method from Dynamical Mean-Field Theory. (arXiv:2211.01400v1 [cond-mat.str-el])",
  "link": "http://arxiv.org/abs/2211.01400",
  "description": "<p>In this work we present a multi-orbital form of the Two-Particle\nSelf-Consistent approach (TPSC), here the effective local and static\nirreducible interaction vertices are determined by means of the Dynamical\nMean-Field Theory (DMFT). This approach replaces the approximate ansatz\nequations for the double occupations $\\langle\nn^{}_{\\alpha,\\sigma}n^{}_{\\beta,\\sigma'}\\rangle$ by sampling them directly for\nthe same model using DMFT. Compared to the usual Hartree-Fock like ansatz, this\nleads to more accurate local vertices in the weakly correlated regime, and\nprovides access to stronger correlated systems that were previously out of\nreach. This approach is extended by replacing the local component of the TPSC\nself-energy by the DMFT impurity self-energy, which results in an improved\nself-energy that incorporates strong local correlations but retains a\nnon-trivial momentum-dependence. We find that this combination of TPSC and DMFT\nprovides a significant improvement over the multi-orbital formulation of\nmulti-orbital TPSC, as it allows to determine the components of the spin vertex\nwithout artificial symmetry assumptions, and opens the possibility to include\nthe transversal particle-hole channel. The new approach is also able to remove\nunphysical divergences in the charge vertices in TPSC. We find a general trend\nthat lower temperatures can be accessed in the calculation. Benchmarking\nsingle-particle quantities such as the local spectral function with other\nmany-body methods we find significant improvement in the more strongly\ncorrelated regime.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Zantout_K/0/1/0/all/0/1\">Karim Zantout</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Backes_S/0/1/0/all/0/1\">Steffen Backes</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Razpopov_A/0/1/0/all/0/1\">Aleksandar Razpopov</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Lessnich_D/0/1/0/all/0/1\">Dominik Lessnich</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Valenti_R/0/1/0/all/0/1\">Roser Valenti</a>"
}