{
  "title": "In nanotube science, is boron nitride the new carbon?",
  "link": "https://news.mit.edu/2022/nanotube-boron-nitride-1031",
  "description": "A technique for synthesizing many “white graphene” nanotubes at a time paves the way for stronger, heat-resistant composites, and membranes for renewable energy.",
  "pubDate": "Mon, 31 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/nanotube-boron-nitride-1031",
  "dc:creator": "Jennifer Chu | MIT News Office",
  "content:encoded": "<p>Engineers at MIT and the University of Tokyo have produced centimeter-scale structures, large enough for the eye to see, that are packed with hundreds of billions of hollow aligned fibers, or nanotubes, made from hexagonal boron nitride.</p>\n\n<p>Hexagonal boron nitride, or hBN, is a single-atom-thin material that has been coined “white graphene” for its transparent appearance and its similarity to carbon-based graphene in molecular structure and strength. It can also withstand higher temperatures than graphene, and is electrically insulating, rather than conductive. When hBN is rolled into nanometer-scale tubes, or nanotubes, its exceptional properties are significantly enhanced.</p>\n\n<p>The team’s results, published today in the journal <em>ACS Nano</em>, provide a route toward fabricating aligned boron nitride nanotubes (A-BNNTs) in bulk. The researchers plan to harness the technique to fabricate bulk-scale arrays of these nanotubes, which can then be combined with other materials to make stronger, more heat-resistant composites, for instance to shield space structures and hypersonic aircraft.</p>\n\n<p>As hBN is transparent and electrically insulating, the team also envisions incorporating the BNNTs into transparent windows and using them to electrically insulate sensors within electronic devices. The team is also investigating ways to weave the nanofibers into membranes for water filtration and for “blue energy” — a concept for renewable energy in which electricity is produced from the ionic filtering of salt water into fresh water.</p>\n\n<p>Brian Wardle, professor of aeronautics and astronautics at MIT, likens the team’s results to scientists’ decades-long, ongoing pursuit of manufacturing bulk-scale carbon nanotubes.</p>\n\n<p>“In 1991, a single carbon nanotube was identified as an interesting thing, but it’s been 30 years getting to bulk aligned carbon nanotubes, and the world’s not even fully there yet,” Wardle says. “With the work we’re doing, we’ve just short-circuited about 20 years in getting to bulk-scale versions of aligned boron nitride nanotubes.”</p>\n\n<p>Wardle is the senior author of the new study, which includes lead author and MIT research scientist Luiz Acauan, former MIT postdoc Haozhe Wang, and collaborators at the University of Tokyo.</p>\n\n<p><strong>A vision, aligned</strong></p>\n\n<p>Like graphene, hexagonal boron nitride has a molecular structure resembling chicken wire. In graphene, this chicken wire configuration is made entirely of carbon atoms, arranged in a repeating pattern of hexagons. For hBN, the hexagons are composed of alternating atoms of boron and nitrogen. In recent years, researchers have found that two-dimensional sheets of hBN exhibit exceptional properties of strength, stiffness, and resilience at high temperatures. When sheets of hBN are rolled into nanotube form, these properties are further enhanced, particularly when the nanotubes are aligned, like tiny trees in a densely packed forest.</p>\n\n<p>But finding ways to synthesize stable, high quality BNNTs has proven challenging. A handful of efforts to do so have produced low-quality, nonaligned fibers.</p>\n\n<p>“If you can align them, you have much better chance of harnessing BNNTs properties at the bulk scale to make actual physical devices, composites, and membranes,” Wardle says.</p>\n\n<p>In 2020, Rong Xiang and colleagues at the University of Tokyo found they could produce high-quality boron nitride nanotubes by first using a conventional approach of chemical vapor deposition to grow a forest of short, few micron-long carbon nanotubes. They then coated the carbon-based forest with “precursors” of boron and nitrogen gas, which when baked in an oven at high temperatures crystallized onto the carbon nanotubes to form high-quality nanotubes of hexagonal boron nitride with carbon nanotubes inside.</p>\n\n<p><strong>Burning scaffolds</strong></p>\n\n<p>In the new study, Wardle and Acauan have extend and scale Xiang’s approach, essentially removing the underlying carbon nanotubes and leaving the long boron nitride nanotubes to stand on their own. The team drew on the expertise of Wardle’s group, which has focused for years on fabricating high-quality aligned arrays of carbon nanotubes. With their current work, the researchers looked for ways to tweak the temperatures and pressures of the chemical vapor deposition process in order to remove the carbon nanotubes while leaving the boron nitride nanotubes intact.</p>\n\n<p>“The first few times we did it, it was completely ugly garbage,” Wardle recalls. “The tubes curled up into a ball, and they didn’t work.”</p>\n\n<p>Eventually, the team hit on a combination of temperatures, pressures, and precursors that did the trick. With this combination of processes, the researchers first reproduced the steps that Xiang took to synthesize the boron-nitride-coated carbon nanotubes. As hBN is resistant to higher temperatures than graphene, the team then cranked up the heat to burn away the underlying black carbon nanotube scaffold, while leaving the transparent, freestanding boron nitride nanotubes intact.</p>\n<img alt=\"MIT engineers fabricate a forest of “white graphene” nanotubes (shown here patterned as MIT) by burning away a scaffold of black carbon. \" data-align=\"center\" data-caption=\"By using carbon nanotubes as a scaffold, MIT engineers grow forests of “white graphene” that emerge (in MIT pattern) after burning away the black carbon scaffold.&amp;nbsp;Courtesy of the researchers\" data-entity-type=\"file\" data-entity-uuid=\"eeae5690-8642-4e55-b8a6-0afaac779523\" src=\"/sites/default/files/images/inline/boron-fibers.gif\" />\n<p>In microscopic images, the team observed clear crystalline structures — evidence that the boron nitride nanotubes have a high quality. The structures were also dense: Within a square centimeter, the researchers were able to synthesize a forest of more than 100 billion aligned boron nitride nanotubes, that measured about a millimeter in height — large enough to be visible by eye. By nanotube engineering standards, these dimensions are considered to be “bulk” in scale.</p>\n\n<p>“We are now able to make these nanoscale fibers at bulk scale, which has never been shown before,” Acauan says.</p>\n\n<p>To demonstrate the flexibility of their technique, the team synthesized larger carbon-based structures, including a weave of carbon fibers, a mat of “fuzzy” carbon nanotubes, and sheets of randomly oriented carbon nanotubes known as “buckypaper.” They coated each carbon-based sample with boron and nitrogen precursors, then went through their process to burn away the underlying carbon. In each demonstration, they were left with a boron-nitride replica of the original black carbon scaffold.</p>\n\n<p>They also were able to “knock down” the forests of BNNTs, producing horizontally aligned fiber films that are a preferred configuration for incorporating into composite materials.</p>\n\n<p>“We are now working toward fibers to reinforce ceramic matrix composites, for hypersonic and space applications where there are very high temperatures, and for windows for devices that need to be optically transparent,” Wardle says. “You could make transparent materials that are reinforced with these very strong nanotubes.”</p>\n\n<p>This research was supported, in part, by Airbus, ANSYS, Boeing, Embraer, Lockheed Martin, Saab AB, and Teijin Carbon America through MIT’s Nano-Engineered Composite aerospace STructures (NECST) Consortium.</p>",
  "media:content": {
    "media:description": "MIT engineers fabricate a forest of “white graphene” nanotubes (shown here patterned as MIT) by burning away a scaffold of black carbon.",
    "media:credit": "Image: Courtesy of the researchers"
  },
  "category": [
    "Carbon nanotubes",
    "Energy",
    "Graphene",
    "Materials science and engineering",
    "Aeronautical and astronautical engineering",
    "Aircraft",
    "Nanoscience and nanotechnology",
    "Research",
    "Energy storage",
    "School of Engineering"
  ]
}