{
  "title": "Markov-modulated marked Poisson processes for modelling disease dynamics based on medical claims data. (arXiv:2210.13133v2 [stat.AP] UPDATED)",
  "link": "http://arxiv.org/abs/2210.13133",
  "description": "<p>We explore Markov-modulated marked Poisson processes (MMMPPs) as a natural\nframework for modelling patients' disease dynamics over time based on medical\nclaims data. In claims data, observations do not only occur at random points in\ntime but are also informative, i.e. driven by unobserved disease levels, as\npoor health conditions usually lead to more frequent interactions with the\nhealthcare system. Therefore, we model the observation process as a\nMarkov-modulated Poisson process, where the rate of healthcare interactions is\ngoverned by a continuous-time Markov chain. Its states serve as proxies for the\npatients' latent disease levels and further determine the distribution of\nadditional data collected at each observation time, the so-called marks.\nOverall, MMMPPs jointly model observations and their informative time points by\ncomprising two state-dependent processes: the observation process\n(corresponding to the event times) and the mark process (corresponding to\nevent-specific information), which both depend on the underlying states. The\napproach is illustrated using claims data from patients diagnosed with chronic\nobstructive pulmonary disease (COPD) by modelling their drug use and the\ninterval lengths between consecutive physician consultations. The results\nindicate that MMMPPs are able to detect distinct patterns of healthcare\nutilisation related to disease processes and reveal inter-individual\ndifferences in the state-switching dynamics.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/stat/1/au:+Mews_S/0/1/0/all/0/1\">Sina Mews</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Surmann_B/0/1/0/all/0/1\">Bastian Surmann</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Hasemann_L/0/1/0/all/0/1\">Lena Hasemann</a>, <a href=\"http://arxiv.org/find/stat/1/au:+Elkenkamp_S/0/1/0/all/0/1\">Svenja Elkenkamp</a>"
}