{
  "title": "Minkorrekt Folge 13 „Nobelpreis-Sonderfolge“",
  "itunes:title": "Minkorrekt Folge 13 „Nobelpreis-Sonderfolge“",
  "description": "Heute mit allgemeinen Dingen über den Nobelpreis und den Preisträgern 2013 in den Kategorien Physik, Chemie, Medizin und Frieden. Experiment der Woche: \"Fliegendes Graphit\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 05 Nov 2013 22:32:57 +0000",
  "link": "https://minkorrekt.podigee.io/15-minkorrekt-folge-13-nobelpreis-sonderfolge",
  "guid": "http://methodischinkorrekt.wordpress.com/?p=191",
  "content:encoded": "„Nobelpreis-Sonderfolge“ direkt aus der königlichen Akademie der Wissenschaften.\n<p>&nbsp;</p>\n<p><span style=\"font-style: inherit; line-height: 1.625;\">Eine Sonderfolge in der wir uns an die ganz Großen wagen: Wir reden über den Nobelpreis im Allgemeinen aber vor Allem über die Nobelpreisträger 2013.</span></p>\n<p>Zunächst aber geht unser Dank an alle unsere Flatterer, an Philip für die tollen <a href=\"http://molar.es/pages/MInkorrekt.html\">Introvideos</a>, an Franz für die Bierlieferung aus <a href=\"http://de.wikipedia.org/wiki/Wittingen\">Wittingen</a>, an unseren Schwesterpodcast „<a href=\"http://www.konscience.de\">KonScience</a>“ (oder KonScience) und an die obligatorische <a href=\"http://hoersuppe.de\">Hörsuppe</a>.</p>\n<p>Dann stürzen wir uns auf den Nobelpreis. Zunächst ganz im Allgemeinen: Wer darf einen haben? Wie kam Alfred Nobel auf die Idee? Gibt es auch lecker Essen bei der Verleihung? Und wie versteckt man Nobelpreismedaillen? Fakten und Anekdoten rund um den Nobelpreis.</p>\n<p><span id=\"more-944\"></span></p>\n<p>Dann wird es aber feierlich und wir schreiten zur Verleihung der Preise 2013:</p>\n<p>Der Nobelpreis für Chemie für „die Entwicklung von multiskalen Modellen für komplexe chemische Systeme“ – Man nehme etwas Quantenmechanik, eine Prise klassische Kraftfelder. Umrühren. Zack, Nobelpreis fertig. Die Chemieexperimente im Cyberspace.</p>\n<p>Der Nobelpreis für Physik „für die theoretische Entdeckung eines Mechanismus, der zu unserem Verständnis des Ursprungs der Masse subatomarer Teilchen beiträgt, und der kürzlich durch die Entdeckung des vorhergesagten Elementarteilchensdurch die ATLAS- und CMS-Experimente am Large Hadron Collider desCERN bestätigt wurde.“ – Der Titel klingt nicht besonders eingängig? Egal, Reinhard erzählt Euch was das mit Cocktailpartys zu tun hat und warum Teilchen Masse haben. Wer es dann doch etwas qualifizierter und genauer wissen will sei hier natürlich an den großartigen Podcast <a href=\"http://omegataupodcast.net\">omega tau</a> verwiesen.</p>\n<p>Den passenden Song gibt es noch dazu! „<a href=\"http://www.youtube.com/watch?v=28X9czEROPs\">The glorious Higgs!</a>“</p>\n<p>Das Experiment der Woche: Ein <a href=\"http://www.getdigital.de/DIALEV---Schwebendes-Graphitplaettchen.html\">Geburtstagsgeschenk</a> an Reinhard! Bilder (kommen noch) und das Video (kommt noch) vom fliegenden Graphit. Es fliegt durch den <a href=\"http://de.wikipedia.org/wiki/Diamagnetismus\">Diamagnetismus</a>. Damit kann man sogar <a href=\"http://www.youtube.com/watch?v=A1vyB-O5i6E\">Frösche fliegen lassen</a>.</p>\n<p>Der Nobelpreis für Medizin „für die Entdeckungen von Transportprozessen in Zellen“. Wie funktioniert das Adresssystem von Zellen im Körper? Das erklären diese drei Preisträger. Besonders spannend ist der originale Anruf aus Stockholm in dem Prof. Südhof mitgeteit wird, dass er den Nobelpreis gewonnen hat. Er fährt erst mal rechts ran!</p>\n<p>Friedensnobelpreis „für ihre umfänglichen Bemühungen zur Beseitigung chemischer Waffen&#8221; an die Organisation für das Verbot von Chemiewaffen (OPCW). Nicht unumstritten. Genauso wie einige Preisträger zuvor.</p>\n<p>Dazu auch unser Rausschmeißervideo: „<a href=\"http://www.youtube.com/watch?v=PnLqoRtUAVg\">I got a peace prize!</a>“</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 15,
  "itunes:episodeType": "full",
  "itunes:subtitle": "„Nobelpreis-Sonderfolge“ direkt aus der königlichen Akademie der Wissenschaften.",
  "itunes:summary": "Heute mit allgemeinen Dingen über den Nobelpreis und den Preisträgern 2013 in den Kategorien Physik, Chemie, Medizin und Frieden. Experiment der Woche: \"Fliegendes Graphit\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 9812
}