{
  "title": "A Reality Check on the Importance of Teacher Expectations",
  "link": "https://www.aei.org/education/a-reality-check-on-the-importance-of-teacher-expectations/",
  "dc:creator": "George Pierson",
  "pubDate": "Wed, 02 Nov 2022 13:00:00 +0000",
  "category": [
    "Education",
    "Education reform",
    "High Schools",
    "public schools",
    "teachers"
  ],
  "guid": "https://www.aei.org/?p=1008664478",
  "description": "<p>At a time when data-free ideologues are hailing the merits of low expectations in the name of equity and kind-heartedness, Fordham University Professor Seth Gershenson provides a timely reality check.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/education/a-reality-check-on-the-importance-of-teacher-expectations/\">A Reality Check on the Importance of Teacher Expectations</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>As I’ve noted many times (see, for instance, <a href=\"https://www.aei.org/op-eds/oregon-democrats-resurrect-the-soft-bigotry-of-low-expectations/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>, <a href=\"https://www.aei.org/op-eds/california-wants-teachers-to-violate-educations-hippocratic-oath/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>, and <a href=\"https://thedispatch.com/article/defend-gifted-education-and-then/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>), some corners in schooling today are marked by a bizarre enthusiasm for low expectations. This has fueled a push to eliminate graduation requirements, do away with advanced classes, eliminate gifted programs, and stop asking students to show their work. All of this was promoted by self-proclaimed agents of “equity” before the pandemic and has only gained momentum as school leaders “temper” their expectations in light of pandemic-fueled learning loss.</p>\n\n\n\n<p>While going easy may seem like a genial accommodation after the disruptions of the past few years, it does students no favors—with the worst impacts on the most vulnerable kids.</p>\n\n\n\n<p>Now, when the air is thick with suggestions that grading is hopelessly biased and even that hard work is a product of “white supremacy culture,” it takes backbone for teachers to hold fast to high expectations. That’s doubly true when low expectations are easier, making for less work, happier students, and fewer parental gripes about low grades or classroom discipline.</p>\n\n\n\n<p>Despite all of this, some teachers are still willing to hold fast to high expectations. On that score, a provocative new Fordham Institute <a href=\"https://fordhaminstitute.org/national/research/the-power-of-expectations-district-charter\" target=\"_blank\" rel=\"noreferrer noopener\">study</a> by American University professor Seth Gershenson uses federal data from two nationally representative surveys to get a sense of high school teachers’ expectations and how those expectations vary across different kinds of schools.</p>\n\n\n\n<p>Unfortunately, Gershenson struggles with a variety of limitations, since the data sets he uses weren’t necessarily intended for this purpose. For starters, he leans heavily on a question which asks whether teachers think their students will go on to complete a four-year college. This has serious limitations: This metric clearly favors schools focused on preparing students for college. And it’s not a great way to gauge whether teachers have rigorous expectations in the classroom for conduct, effort, or mastery. Of course, Gershenson can only make do with the questions that were asked.</p>\n\n\n\n<p>Another issue is simply the age of the data, as the two data sets Gershenson uses are comprised of students who were in tenth grade in 2002 or 2009. While the analysis is informative, it can’t tell us anything about what expectations look like in 2022—whether they’ve been affected by the pandemic, lowered by a misguided understanding of “equity,” or even if the same patterns are still evident across kinds of schools.</p>\n\n\n\n<p>For all the limitations, though, the results are worth mulling over. Across the data, Gershenson finds that 48 percent of traditional public high school math teachers and 49 percent of their English-teaching peers expected students to complete a four-year college education. At charter high schools, the figures were 63 and 53 percent; at private schools, 79 and 80 percent.</p>\n\n\n\n<p>Since the high expectations in charter and private schools could have been a function of student or school characteristics (rather than teacher mindset), Gershenson used multivariate analysis to try and control for those factors. He found that, other things equal, private high school English and math teachers were about 20 percentage points more likely than their district peers to expect students to complete college. Charter school teachers’ expectations weren’t quite as high as those in private schools, but were noticeably higher than those in district schools.</p>\n\n\n\n<p>Gershenson also finds that when high school teachers have high expectations, it appear to have an impact on things like high school graduation and college completion. This shouldn’t be all that surprising and is consistent with a pretty substantial body of research. But it’s a reminder that seems necessary right about now.</p>\n\n\n\n<p>With its older data, imperfect measures, and statistical gymnastics, this kind of analysis always merits careful handling. But at a time when data-free ideologues are hailing the merits of low expectations in the name of equity and kind-heartedness, Gershenson has provided a timely reality check.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/op-eds/searching-for-common-ground-student-loan-forgiveness-and-the-cost-of-higher-ed/\">Searching for Common Ground: Student-Loan Forgiveness and the Cost of Higher Ed.</a> | <a href=\"https://www.aei.org/op-eds/choice-of-ben-sasse-for-univ-of-florida-causes-a-ruckus-what-do-college-presidents-even-do/\">Choice of Ben Sasse for University of Florida Causes a Ruckus. What Do College Presidents Even Do?</a> | <a href=\"https://www.aei.org/op-eds/scotus-may-end-race-based-admissions-preferences-congress-should-do-same-for-wealth-based-preferences/\">As Supreme Court Considers Affirmative Action's Future, Legacy Admissions Also Need to End</a> | <a href=\"https://www.aei.org/op-eds/whats-the-point-of-civics-education/\">What’s the Point of Civics Education?</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/education/a-reality-check-on-the-importance-of-teacher-expectations/\">A Reality Check on the Importance of Teacher Expectations</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}