{
  "id": "https://bibleinoneyear.org/en/youth/262",
  "title": "Day 262: Refuse to Be Trapped by your Past",
  "description": "Psalm 108:6–13, Isaiah 45:1–24, Galatians 4:21–31, 5:1–6.  You, too, are free  Therefore, refuse to be trapped by your past",
  "pubDate": "Mon, 19 Sep 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/262/",
  "itunes:duration": "15:20",
  "guid": "enyouth19092022-262",
  "length": 920.24,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 262: Refuse to Be Trapped by your Past",
  "itunes:subtitle": "Psalm 108:6–13, Isaiah 45:1–24, Galatians 4:21–31, 5:1–6.  You, too, are free  Therefore, refuse to be trapped by your past",
  "itunes:summary": "He had no one to help him become a lawyer or a politician. He was not interested in the army. He had no desire to be a doctor. Therefore, the only obvious career move in those days for a man of his background was to become a clergyman in the Church of England.\nHe tried to make himself acceptable to God by keeping the whole law, inwardly and outwardly. He got up early. He prayed. He denied himself. He tried to earn forgiveness and peace by increased effort. But he ‘groaned under a heavy yoke’.\nOn 24 May 1738 at 8.45 pm, he heard someone reading a book by the great reformer, Martin Luther. He later recalled, ‘While he was describing the change which God works in the heart through faith in Christ, I felt my heart strangely warmed. I felt I did trust in Christ, Christ alone for salvation; and an assurance was given [to] me that He had taken away my sins, even mine, and saved me from the law of sin and death.’\nJohn Wesley became one of the greatest preachers ever, preaching over 40,000 sermons centred on freedom through faith in Jesus Christ. He had, as he put it, ‘exchanged the faith of a servant for the faith of a son’. He was free at last.\n‘Freedom’ is the word that best sums up the Christian life. You, too, are free. Therefore, refuse to be trapped by your past.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 627
}