{
  "published": "2022-11-05T12:08:54-04:00",
  "updated": "2022-11-05T12:08:54-04:00",
  "title": "Apple’s reportedly building an advertising network around its Major League Soccer deal",
  "content": "<figure>\n      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/Mvgv5ibB2bsvhNqyueGGbb5n7TU=/154x0:1807x1102/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/71588871/Apple_MLS_partnership_June_2022.0.jpg\" />\n        <figcaption>Image: Apple</figcaption>\n    </figure>\n\n  <p id=\"XzIU8a\">Apple’s building an advertising network as part of its deal to start streaming Major League Soccer (MLS) games next year, <a href=\"https://www.bloomberg.com/news/articles/2022-11-04/apple-s-next-step-in-ads-will-be-built-around-new-soccer-deal?sref=ExbtjcSG\">according to a report from <em>Bloomberg</em></a>. Sources familiar with the situation told the outlet that Apple’s in talks with advertisers and MLS sponsors to display ads during soccer games and “related shows.”</p>\n<p id=\"0BFRCe\"><a href=\"https://www.theverge.com/2022/6/14/23167555/apple-tv-mls-live-sports-streaming\">Apple struck a 10-year deal with the MLS</a> in June and will start streaming soccer games through its Apple TV app in February 2023. While the company plans on introducing a separate, <a href=\"https://www.mlssoccer.com/apple/\">Sunday Ticket-like subscription</a> dedicated to streaming every MLS game, it says it’ll make a “broad selection” of MLS and Leagues Cup matches available to Apple TV Plus subscribers, with a “limited number” available for free. </p>\n<p id=\"Wql8cD\">There still isn’t any pricing information about the standalone subscription just yet, but, as noted by <em>Bloomberg</em>, Apple plans on including ads for all MLS viewers, including season pass holders, Apple TV Plus subscribers, and those watching for free. This expands on the commercials <a href=\"https://www.theverge.com/2022/3/8/22967483/apple-tv-plus-friday-night-baseball\">Apple already slips into its Friday Night Baseball games</a>, and marks a continued push into advertising.</p>\n<p id=\"dYRVlo\">In August, <a href=\"https://www.bloomberg.com/news/newsletters/2022-08-14/apple-aapl-set-to-expand-advertising-bringing-ads-to-maps-tv-and-books-apps-l6tdqqmg?sref=ExbtjcSG\"><em>Bloomberg</em> reported</a> that Apple’s advertising business rakes in about $4 billion in revenue annually, and that the company wants to get this number into the double digits. One solution the company’s reportedly considering is <a href=\"https://www.theverge.com/2022/8/14/23305200/iphone-more-ads-advertising-apple-maps-podcasts-books-mark-gurman-rumors\">placing ads in other areas on the iPhone</a>, such as in the Maps, Podcasts, and Books apps. </p>\n<p id=\"IQa99u\">It already brought more ads to the App Store, which now appear in the Today tab and “You Might Also Like” sections beneath app listings. The move drew criticism from developers, who quickly <a href=\"https://www.theverge.com/2022/10/26/23424316/app-store-gambling-ads-listings-apple-developers\">noticed ads for gambling apps appearing on App Store</a> product pages. <a href=\"https://www.theverge.com/2022/10/26/23425637/apple-pauses-gambling-ads-developer-outcry\">Apple has since paused App Store ads related to gambling</a> and “a few other categories,” but hasn’t come forward with a plan to address this issue just yet.</p>",
  "link": "",
  "id": "https://www.theverge.com/2022/11/5/23441872/apple-advertisements-mls-major-league-soccer-games-2023",
  "author": {
    "name": "Emma Roth"
  }
}