{
  "id": "https://bibleinoneyear.org/en/youth/302",
  "title": "Day 302: How to Refresh Your Mind, Heart and Soul",
  "description": "Psalm 119:127, Lamentations 2:11–19, 3:20-24, Philemon 4–18.  Later on in the letter, Paul asks him to ‘*refresh my heart* in Christ’ (v 20)",
  "pubDate": "Sat, 29 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/302/",
  "itunes:duration": "13:55",
  "guid": "enyouth29102022-302",
  "length": 835.47,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 302: How to Refresh Your Mind, Heart and Soul",
  "itunes:subtitle": "Psalm 119:127, Lamentations 2:11–19, 3:20-24, Philemon 4–18.  Later on in the letter, Paul asks him to ‘*refresh my heart* in Christ’ (v 20)",
  "itunes:summary": "The former televangelist, Jim Bakker, in his autobiography I Was Wrong, tells of his descent into ignominy, impoverishment and imprisonment for accounting fraud. He lost his freedom, his sanity, his dignity, his confidence in his faith and, eventually, even his wife. Inmate 07407-058, one-time friend and advisor of presidents, had hit rock bottom.\nAt his very lowest point, a prison official told him, ‘Billy Graham is here to see you!’ He thought, ‘Billy Graham has come here... to this place... to see me.’ When he walked into the room, Billy Graham turned towards him and opened his arms wide.\nAt that moment, Jim Bakker felt total acceptance and love: ‘I will never forget that the man who had just been voted one of the most influential men in the world and who has ministered to millions of people took time out of his busy schedule to come minister to one prisoner.’ He describes how in the midst of his depression, flu, filth and hopelessness, Billy Graham’s visit refreshed his heart and boosted his spirit. ‘I felt as though Jesus Himself had come to visit me.’\nRefreshment means restoring strength, energy and vigour. A light snack is sometimes referred to as a ‘refreshment’. Physical refreshment can also come, for example, from sleep, rest, or exercise.\nPaul tells Philemon that he has ‘refreshed the hearts of the saints’ (Philemon 7). Later on in the letter, Paul asks him to ‘refresh my heart in Christ’ (v.20). But how do you refresh your mind, heart and soul?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 667
}