{
  "title": "Ocean microbes get their diet through a surprising mix of sources, study finds",
  "link": "https://news.mit.edu/2022/prochlorococcus-microbes-food-1103",
  "description": "Up to one-third of the carbon consumed by Prochlorococcus may come from sources other than photosynthesis.",
  "pubDate": "Thu, 03 Nov 2022 12:00:00 -0400",
  "guid": "https://news.mit.edu/2022/prochlorococcus-microbes-food-1103",
  "dc:creator": "Jennifer Chu | MIT News Office",
  "content:encoded": "<p>One of the smallest and mightiest organisms on the planet is a plant-like bacterium known to marine biologists as <em>Prochlorococcus</em>. The green-tinted microbe measures less than a micron across, and its populations suffuse through the upper layers of the ocean, where a single teaspoon of seawater can hold millions of the tiny organisms.</p>\n\n<p><em>Prochlorococcus</em> grows through photosynthesis, using sunlight to convert the atmosphere’s carbon dioxide into organic carbon molecules. The microbe is responsible for 5 percent of the world’s photosynthesizing activity, and scientists have assumed that photosynthesis is the microbe’s go-to strategy for acquiring the carbon it needs to grow.</p>\n\n<p>But a new MIT study in <em>Nature Microbiology </em>today has found that <em>Prochlorococcus</em> relies on another carbon-feeding strategy, more than previously thought.</p>\n\n<p>Organisms that use a mix of strategies to provide carbon are known as mixotrophs. Most marine plankton are mixotrophs. And while <em>Prochlorococcus</em> is known to occasionally dabble in mixotrophy, scientists have assumed the microbe primarily lives a phototrophic lifestyle.</p>\n\n<p>The new MIT study shows that in fact, <em>Prochlorococcus</em> may be more of a mixotroph than it lets on. The microbe may get as much as one-third of its carbon through a second strategy: consuming the dissolved remains of other dead microbes.</p>\n\n<p>The new estimate may have implications for climate models, as the microbe is a significant force in capturing and “fixing” carbon in the Earth’s atmosphere and ocean.</p>\n\n<p>“If we wish to predict what will happen to carbon fixation in a different climate, or predict where <em>Prochlorococcus</em> will or will not live in the future, we probably won’t get it right if we’re missing a process that accounts for one-third of the population’s carbon supply,” says Mick Follows, a professor in MIT’s Department of Earth, Atmospheric and Planetary Sciences (EAPS), and its Department of Civil and Environmental Engineering.</p>\n\n<p>The study’s co-authors include first author and MIT postdoc Zhen Wu, along with collaborators from the University of Haifa, the Leibniz-Institute for Baltic Sea Research, the Leibniz-Institute of Freshwater Ecology and Inland Fisheries, and Potsdam University.</p>\n\n<p><strong>Persistent plankton</strong></p>\n\n<p>Since <em>Prochlorococcus</em> was first discovered in the Sargasso Sea in 1986, by MIT Institute Professor Sallie “Penny” Chisholm and others, the microbe has been observed throughout the world’s oceans, inhabiting the upper sunlit layers ranging from the surface down to about 160 meters. Within this range, light levels vary, and the microbe has evolved a number of ways to photosynthesize carbon in even low-lit regions.</p>\n\n<p>The organism has also evolved ways to consume organic compounds including glucose and certain amino acids, which could help the microbe survive for limited periods of time in dark ocean regions. But surviving on organic compounds alone is a bit like only eating junk food, and there is evidence that <em>Prochlorococcus</em> will die after a week in regions where photosynthesis is not an option.</p>\n\n<p>And yet, researchers including Daniel Sher of the University of Haifa, who is a co-author of the new study, have observed healthy populations of <em>Prochlorococcus</em> that persist deep in the sunlit zone, where the light intensity should be too low to maintain a population. This suggests that the microbes must be switching to a non-photosynthesizing, mixotrophic lifestyle in order to consume other organic sources of carbon.</p>\n\n<p>“It seems that at least some <em>Prochlorococcus</em> are using existing organic carbon in a mixotrophic way,” Follows says. “That stimulated the question: How much?”</p>\n\n<p><strong>What light cannot explain</strong></p>\n\n<p>In their new paper, Follows, Wu, Sher, and their colleagues looked to quantify the amount of carbon that <em>Prochlorococcus </em>is consuming through processes other than photosynthesis.</p>\n\n<p>The team looked first to measurements taken by Sher’s team, which previously took ocean samples at various depths in the Mediterranean Sea and measured the concentration of phytoplankton, including <em>Prochlorococcus</em>, along with the associated intensity of light and the concentration of nitrogen — an essential nutrient that is richly available in deeper layers of the ocean and that plankton can assimilate to make proteins.</p>\n\n<p>Wu and Follows used this data, and similar information from the Pacific Ocean, along with previous work from Chisholm’s lab, which established the rate of photosynthesis that <em>Prochlorococcus </em>could carry out in a given intensity of light.</p>\n\n<p>“We converted that light intensity profile into a potential growth rate — how fast the population of <em>Prochlorococcus </em>could grow if it was acquiring all it’s carbon by photosynthesis, and light is the limiting factor,” Follows explains.</p>\n\n<p>The team then compared this calculated rate to growth rates that were previously observed in the Pacific Ocean by several other research teams.</p>\n\n<p>“This data showed that, below a certain depth, there’s a lot of growth happening that photosynthesis simply cannot explain,” Follows says. “Some other process must be at work to make up the difference in carbon supply.”</p>\n\n<p>The researchers inferred that, in deeper, darker regions of the ocean, <em>Prochlorococcus </em>populations are able to survive and thrive by resorting to mixotrophy, including consuming organic carbon from detritus. Specifically, the microbe may be carrying out osmotrophy — a process by which an organism passively absorbs organic carbon molecules via osmosis.</p>\n\n<p>Judging by how fast the microbe is estimated to be growing below the sunlit zone, the team calculates that <em>Prochlorococcus</em> obtains up to one-third of its carbon diet through mixotrophic strategies.</p>\n\n<p>“It’s kind of like going from a specialist to a generalist lifestyle,” Follows says. “If I only eat pizza, then if I’m 20 miles from a pizza place, I’m in trouble, whereas if I eat burgers as well, I could go to the nearby McDonald’s. People had thought of <em>Prochlorococcus </em>as a specialist, where they do this one thing (photosynthesis) really well. But it turns out they may have more of a generalist lifestyle than we previously thought.”</p>\n\n<p>Chisholm, who has both <a href=\"https://chisholmlab.mit.edu/books/children\">literally</a> and figuratively written the book on <em>Prochlorococcus</em>, says the group’s findings “expand the range of conditions under which their populations can not only survive, but also thrive. This study changes the way we think about the role of&nbsp;<em>Prochlorococcus</em>&nbsp;in the microbial food web.”</p>\n\n<p>This research was supported, in part, by the Israel Science Foundation, the U.S. National Science Foundation, and the Simons Foundation.</p>",
  "media:content": {
    "media:description": "Long thought to rely solely on photosynthesis, the microbe Prochlorococcus may get as much as one-third of its carbon through a second strategy: consuming the dissolved remains of other dead microbes.",
    "media:credit": "Image: Jose-Luis Olivares, MIT"
  },
  "category": [
    "Carbon",
    "Carbon dioxide",
    "Cells",
    "Civil and environmental engineering",
    "Climate change",
    "Climate",
    "EAPS",
    "Microbes",
    "Ocean science",
    "Oceanography and ocean engineering",
    "Research",
    "School of Engineering",
    "National Science Foundation (NSF)"
  ]
}