{
  "id": "https://bibleinoneyear.org/en/youth/55",
  "title": "Day 55: What You Give to God, He Multiplies",
  "description": "Psalm 25:16–21, Exodus 35:10,20–21, Mark 7:31–37, 8:1–8.  You reap what you sow, only many times more  What you give to the Lord, he multiplies",
  "pubDate": "Thu, 24 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/55/",
  "itunes:duration": "13:51",
  "guid": "enyouth24022022-55",
  "length": 831.66,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 55: What You Give to God, He Multiplies",
  "itunes:subtitle": "Psalm 25:16–21, Exodus 35:10,20–21, Mark 7:31–37, 8:1–8.  You reap what you sow, only many times more  What you give to the Lord, he multiplies",
  "itunes:summary": "Hattie May Wiatt, a six-year-old girl, lived near Grace Baptist Church in Philadelphia, USA. The Sunday school was very crowded. Russell H. Conwell, the minister, told her that one day they would have buildings big enough to allow everyone to attend. She said, ‘I hope you will. It is so crowded I am afraid to go there alone.’ He replied, ‘When we get the money we will construct one large enough to get all the children in.’\nTwo years later, in 1886, Hattie May died. After the funeral Hattie’s mother gave the minister a little bag they had found under their daughter’s pillow containing 57 cents in change that she had saved up. Alongside it was a note in her handwriting: ‘To help build bigger so that more children can go to Sunday school.’\nThe minister changed all the money into pennies and offered each one for sale. He received $250 – and 54 of the cents were given back. The $250 was itself changed into pennies and sold by the newly formed ‘Wiatt Mite Society’. In this way, her 57 cents kept on multiplying.\nTwenty-six years later, in a talk entitled, ‘The history of the 57 cents’, the minister explained the results of her 57-cent donation: a church with a membership of over 5,600 people, a hospital where tens of thousands of people had been treated, 80,000 young people going through university, 2,000 people going out to preach the gospel – all this happened ‘because Hattie May Wiatt invested her 57 cents’.\nThe theme of multiplication runs throughout the Bible. What cannot be achieved by addition, God does by multiplication. You reap what you sow, only many times more. What you give to the Lord, he multiplies.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 420
}