{
  "title": "Bullard Speaks about the Fed Funds Rate and Inflation",
  "link": "https://fedinprint.org/item/fedlps/94872",
  "description": "St. Louis Fed President Jim Bullard discussed the Fed’s progress in tightening monetary policy to bring down high inflation. He spoke while participating virtually at a forum hosted by Barclays and the Centre for Economic Policy Research in London.\n\n“No matter how you look at it, we have a serious inflation problem in the U.S., and we’re missing our (2%) inflation target and the credibility of our inflation targeting regime is at risk,” Bullard said. He added that this level of inflation hasn’t been experienced since the late 1970s and early 1980s, when Paul Volcker was chairman of the Fed.\n\nBullard said he recently recalculated the minimal level of the policy rate that could be argued was restrictive monetary policy, and that rate was close to 4.5%, higher than he had calculated in May. He also pointed out that at its last meeting, the Federal Open Market Committee moved up its projections of the needed policy rate level to more in the 4% range.\n\nGiven the level of inflation, the policy rate will need to be high compared with rates over the last 15 years, Bullard said. “In addition, I think we’ll have to stay at that higher rate for some time to make sure that we’ve got the inflation problem under control,” he said.\n\nBullard also noted that tighter monetary policy was in place sooner through market pricing than would be apparent if one just looked at the policy rate itself and did not consider other aspects, including quantitative tightening. “This market pricing leading the Fed is a benefit of the modern era of forward guidance and transparency and has helped us enormously, I think, so far during this episode,” Bullard said.\n\nSo strict comparisons with Volcker are inappropriate at this point, he added.\n\nModern central banks including the Fed have an explicit inflation target of 2%, which is an international standard, Bullard said. That wasn’t the case in Volcker’s time, he noted. “So I think we've got a better chance of success with less disruption to the economy than Volcker would have had,” Bullard said.",
  "guid": "https://fedinprint.org/item/fedlps/94872",
  "dc:creator": "Bullard, James B.",
  "dc:date": "2022-09-27",
  "dc:subject": "federal funds rate; inflation",
  "bibo:series": "Speech"
}