{
  "title": "Bolsonaro breaks silence on election loss",
  "link": "https://www.rt.com/news/565783-bolsonaro-election-admit-defeat/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565783-bolsonaro-election-admit-defeat/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63622c3185f5402ed14829ef.jpg\" /> Brazilian President Jair Bolsonaro has yet to concede his election loss to Lula da Silva, but authorized the transition of power <br/><a href=\"https://www.rt.com/news/565783-bolsonaro-election-admit-defeat/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The Brazilian president stopped short of admitting defeat, but authorized the transition of power</strong></p>\n            \n                        \n            <p>Brazilian President Jair Bolsonaro failed to concede defeat in his first public remarks since Sunday&rsquo;s national election.&nbsp;</p>\n<p>However, his chief of staff Ciro Nogueira claimed that the incumbent had authorized him to begin the transition process for handing over power.</p>\n<p>The news came after ex-president Luiz Inacio Lula da Silva managed to claim victory over Bolsonaro by a narrow margin.</p>\n<p>In a brief speech on Tuesday, breaking his two-day silence, the right-wing president did not directly address the election results, and avoided mentioning the winner by name, though he did vow to abide by the rules set out in the constitution.</p>\n<p><em>&ldquo;I have always been labelled as antidemocratic and, unlike my accusers, I have always played within the four lines of the constitution,&rdquo;</em> he stated.</p>\n<p>He also commented on the widespread protests by his supporters that erupted during the two days of his silence, describing them as <em>&ldquo;the fruit of indignation and a sense of injustice about the way the electoral process took place.&rdquo;</em> While he did not urge them to go back home, he said they should not destroy property.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635f670b20302772c90bb83c.jpg\" alt=\"Brazilian president-elect Luiz Inacio Lula da Silva delivers a speech to supporters after winning the presidential run-off election.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565630-brazil-election-bolsonaro-lula/\">Lula defeats Bolsonaro in Brazilian election</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Later, Nogueira signaled he would work with the new government to carry out the transfer of power. <em>&ldquo;President Jair Messias Bolsonaro authorized me, when it is time, based on the law, to start the transition process,&rdquo;</em> he said.</p>\n<p>Before the presidential election, Bolsonaro had repeatedly claimed that Brazil&rsquo;s electronic voting system is open to fraud, and accused the election authorities of favoring Lula. His criticism appears to echo statements made by former US President Donald Trump &ndash; a leader he has had warm relations with &ndash; who has repeatedly claimed that the 2020 US election was stolen from him. Both Trump and Bolsonaro have failed to provide evidence to support their allegations.</p>\n<p>Bolsonaro lost the second round of the election to former president Luiz Inacio Lula da Silva, who won by a thin margin of 50.9% against the incumbent&rsquo;s 49.1%. The president-elect is set to officially take office on January 1, 2023.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 10:01:16 +0000",
  "dc:creator": "RT"
}