{
  "title": "S16 Ep43: Darkness Radio presents PSYCHO: Ed Gein's Ghosts w/Steve Shippy & Cindy Kaza",
  "link": "https://audioboom.com/posts/8098368",
  "itunes:episode": 43,
  "itunes:title": "Darkness Radio presents PSYCHO: Ed Gein's Ghosts w/Steve Shippy & Cindy Kaza",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4083,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents PSYCHO: Ed Gein's Ghosts with guests Steve Shippy & Cindy Kaza</p>\n\n<p>Dave Schrader speaks with paranormal investigator Steve Shippy & Medium Cindy Kaza about their incredible investigation into one of the most horrific true crime stories and subsequent hauntings in history on their new Shock Doc, Ed Gein: The Real Psycho!</p>\n\n<p>The iconic psychopaths featured in “Silence of the Lambs,” “The Texas Chainsaw Massacre” and “Psycho” were not just fictitious villains, they were inspired by a real-life personification of evil – Ed Gein, a convicted murderer and a grave robber who had a malicious obsession with human flesh. </p>\n\n<p>For the first time in history, cameras are allowed on the Gein property where the gruesome evidence was first discovered. Shippy and Kaza also meet up with local residents who provide insight on Gein and discover never-before-seen artifacts believed to be used by this malevolent monster on his helpless victims. With each investigation, the team reveals more evidence to determine what was behind his drive to kill. Making contact with the world of the dead, they capture terrifying evidence of the supernatural as they seek to answer the ultimate questions: Is Plainfield haunted by Ed Gein, his mother and his victims? Does evil live on forever?</p>\n\n<p>Check out the Shock Doc here: <a href=\"https://bit.ly/3djxO8k\">https://bit.ly/3djxO8k</a></p>\n\n<p>Visit Steve Shippy here: <a href=\"http://www.patreon.com/SteveShippy\">www.patreon.com/SteveShippy</a></p>\n\n<p>Visit Cindy Kaza here: <a href=\"http://www.mediumcindykaza.com/\">www.MediumCindyKaza.com</a></p>\n",
  "itunes:summary": "Darkness Radio presents PSYCHO: Ed Gein's Ghosts with guests Steve Shippy & Cindy Kaza\n\nDave Schrader speaks with paranormal investigator Steve Shippy & Medium Cindy Kaza about their incredible investigation into one of the most horrific true crime stories and subsequent hauntings in history on their new Shock Doc, Ed Gein: The Real Psycho!\n\nThe iconic psychopaths featured in “Silence of the Lambs,” “The Texas Chainsaw Massacre” and “Psycho” were not just fictitious villains, they were inspired by a real-life personification of evil – Ed Gein, a convicted murderer and a grave robber who had a malicious obsession with human flesh. \n\nFor the first time in history, cameras are allowed on the Gein property where the gruesome evidence was first discovered. Shippy and Kaza also meet up with local residents who provide insight on Gein and discover never-before-seen artifacts believed to be used by this malevolent monster on his helpless victims. With each investigation, the team reveals mo...",
  "pubDate": "Fri, 16 Apr 2021 08:00:00 +0000",
  "guid": "ba3861e6-48ec-416a-ba7c-ad0c0040f358",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}