{
  "title": "231: Keep Sweet (The Cult of the FLDS and Warren Jeffs)",
  "link": "https://audioboom.com/posts/8051641",
  "itunes:episode": 231,
  "itunes:title": "Keep Sweet (The Cult of the FLDS and Warren Jeffs)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3202,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>DON’T WORRY, YOU ONLY HAVE TO HEAR WARREN JEFFS SING ONCE. Look, tick tock, it’s cult o’clock. We’re back with the FLDS (the culty fundementialist sect of the Mormon faith) and it’s ten years after that piece of s**t pedophile Warren Jeffs went to prison FOR LIFE. The devoted followers he left behind are suffering and trying to pick up the pieces of their broken lives, all while trying to keep their faith. </div>\n<div>\n<br>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\">COME SEE US ON TOUR</a>!! In May we're hitting Chicago, Boston, Seattle, and Los Angeles!<br>\nWe're covering \"CLASS ACTION PARK.\" You know you want to see us do that one LIVE AND IN-PERSON! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">GET YOUR TICKETS HERE!!!</a><br>\n<br>\n<a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">COME TO OBSESSED FEST!!</a> It's the first-ever OBSESSED NETWORK FAMILY WEEKEND! It's going to be a weekend full of live shows--OWD Friday night, TCO Saturday night (and two non-Obsessed Network live shows as well!), meet & greets, KARAOKE!, meetups, panel chats AND. ONE. INSANE. DRAG. BRUNCH!!! It's all happening at the Hyatt Regency in Columbus, Ohio from September 30 - October 2nd. <a href=\"https://www.indiegogo.com/projects/obsessed-fest-2022#/\">TICKETS ARE ALMOST GONE!! GET YOUR TICKET HERE!!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 300 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"LuLaRich\"</strong> <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>  </div>\n",
  "pubDate": "Tue, 22 Mar 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-03-21:/posts/8051641",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}