{
  "id": "yt:video:So5ksHDmxkU",
  "yt:videoId": "So5ksHDmxkU",
  "yt:channelId": "UCwRXb5dUK4cvsHbx-rGzSgw",
  "title": "xTool D1 Pro 20w Projects",
  "link": "",
  "author": {
    "name": "Derek Banas",
    "uri": "https://www.youtube.com/channel/UCwRXb5dUK4cvsHbx-rGzSgw"
  },
  "published": "2022-11-01T14:19:26+00:00",
  "updated": "2022-11-02T08:47:04+00:00",
  "media:group": {
    "media:title": "xTool D1 Pro 20w Projects",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I am not an expert user of laser cutters / etchers but with the xTool D1 Pro 20w it is so easy to use I feel like I can make anything! It can cut through basically anything including paper, wood, leather, and multiple types of metal and acrylic . It can etch everything including metal and glass. \n\nI'm going to show over 12 projects I made using the xTool D1 Pro 20w and some of its accessories. I use the new Rotary Tool, Honeycomb Working Panel, air assist and some of xTool's engraving accessories. I can't believe I was able to make all of these cool things with zero experience.\n\nThe xTool D1 Pro 20w Cutting and Engraving Machine is an industrial machine downsized for designers and hobbyists. All of the internal moving components are industrialized steel, but it is light enough to easy carry. The laser is accurate to .08 mm and moves with a precision of .01 mm. It has height adjustment, engraves and cuts numerous materials and is easy to adjust.\n\nThe xTool D1 Pro 20w is on Sale Here : https://bit.ly/MBxTool\n\nFULL DISCLOSURE \n\nI was given this kit for free for review. I was however not paid money for this review. You can sign up down below if you want the chance to test products like me.\n\nTEST  PRODUCTS  LIKE  ME\n\nIf  you’d  like  to  apply  to  be  a  product  tester  like  me,  check  out：  https://www.xtool.com/pages/influencer\n  \nOr join their Facebook group:\n https://www.facebook.com/groups/xtoold1\n  \nFIND  OUT  MORE  ABOUT  xTool\nFacebook:    https://www.facebook.com/xToolOfficial    \nInstagram:  https://www.instagram.com/makeblock.xtool/  \n\n#LaserEngraver #LaserCutter #xTool D1 Pro 20w",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}