{
  "title": "Partnering with the state of Oregon to support a skilled tech workforce",
  "link": "https://cloud.google.com/blog/topics/public-sector/partnering-state-oregon-support-skilled-tech-workforce/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>The State of Oregon Employment Department's <a href=\"https://worksourceoregon.org/\" target=\"_blank\">WorkSource Oregon</a> organization defines themselves with a simple mission: \"Support Business - Promote Employment.” Oregon jobseekers work with WorkSource to create a career plan by setting job and career goals, enrolling in trainings and workshops, and searching and applying for jobs. To support this mission, in August 2021, Oregon partnered with Grow with Google and the <a href=\"https://www.naswa.org/google-certificate-scholarship-program\" target=\"_blank\">National Association of State Workforce Agencies</a> (NASWA) to launch the Google Career Certificates for those seeking employment in Oregon, offering 500 scholarships as a pilot. Each scholarship enables a jobseeker to pursue no-cost certificates that provide them with in-demand skills in the fields of data analytics, digital marketing &amp; ecommerce, IT support, project management, and UX design. No prior experience or degree is required and the certificates can be completed 100% online.<br/><br/>To date, <a href=\"https://grow.google/certificates\" target=\"_blank\">Google Career Certificates</a> have helped thousands of residents across the state of Oregon build skills in these in-demand fields and gain access to secure jobs through the Google Employer Consortium.<br/><br/>Anthony Jansen-Yochim, who accessed a Google Career Certificate scholarship through WorkSource, completed his Google Career Certificate in Data Analytics at no cost. Once he completed his certificate, Anthony landed a role as a Continuous Improvement Analyst at Daimler Truck-North America, leveraging the data analysis skills he’d just built. Anthony saw a 40% increase in wages from his previous employment, and shared: “I am very grateful for the opportunity that WorkSource Oregon and the Google Career Certificates gave me to further develop my skills as a budding data scientist.”<br/><br/>Building on the success of Google Career Certificates throughout Oregon, Google sought to support Oregon jobseekers with additional learning paths. One field in particular, cloud computing, is growing rapidly, and experiencing a significant talent gap. There are 27,180 unique cloud roles open in the US as of October 2022, and cloud skills are the most in-demand skill set by IT departments: more than one-third of tech learners said professionals with cloud skills are the most challenging to find.  The average salary for an entry-level cloud role in Oregon is $85,400.</p><p>To help address the talent gap in cloud computing and further support Oregon jobseekers, in August 2022, Google Cloud partnered with WorkSource Oregon on cloud computing skills. Google and WorkSource Oregon are offering 500 additional learning scholarships, this time to <a href=\"https://www.cloudskillsboost.google/\" target=\"_blank\">Google Cloud Skills Boost</a>, which helps learners build skills that prepare them for cloud careers. 82% of hiring managers say that cloud certifications make a candidate more attractive - and jobseekers can complete the training needed for Google Cloud certifications on Google Cloud Skills Boost.<br/><br/>One Oregon resident, Andrew Miller, has started using Google Cloud Skills Boost through the WorkSource Oregon scholarship. “I’ve just completed my 5th Google Cloud lab, and as I do the training, I am getting faster at it. I am really enjoying the training so far.” As Andrew moves through Google Cloud training, he’ll be building skills for one of the fastest-growing industries today.</p></div></div><div class=\"block-pull_quote\"><div class=\"uni-pull-quote h-c-page\"><section class=\"h-c-grid\"><div class=\"uni-pull-quote__wrapper h-c-grid__col h-c-grid__col--8 h-c-grid__col-m--6 h-c-grid__col-l--6 h-c-grid__col--offset-2 h-c-grid__col-m--offset-3 h-c-grid__col-l--offset-3\"><div class=\"uni-pull-quote__inner-wrapper h-c-copy h-c-copy\"><q class=\"uni-pull-quote__text\">These partnerships with Google help residents get on a no-cost path to a technology career at a time when demand is rapidly growing. Google Cloud training is a great advanced opportunity to offer to our IT customers who would like to continue advancing their careers. WorkSource Oregon is grateful to offer this opportunity through our partnership with Google.</q> <cite class=\"uni-pull-quote__author\"><span class=\"uni-pull-quote__author-meta\"><strong class=\"h-u-font-weight-medium\">Adalberto Rubio</strong><br/> Business Analyst at WorkSource Oregon</span></cite></div></div></section></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Together, Oregon and Google are helping meet the market demand for technology talent - and supporting jobseekers as they seek to build their profiles. To learn more about the Google Career Certificates and Google Cloud training available through WorkSource Oregon, please visit<a href=\"https://worksourceoregon.org/jobseekers\" target=\"_blank\">https://worksourceoregon.org/jobseekers</a> and contact a local WorkSource center.<br/><br/></p><p></p><p><sup>1. Source: Lightcast Q4 2022 Data Set | www.economicmodeling.com<br/>2. Source: Robert Half survey of more than 1,500 senior technology managers in the US, March 30, 2022, https://www.roberthalf.com/blog/job-market/cloud-hiring-trends-for-2022<br/></sup><sup>3. Source: Lightcast Q4 2022 Data Set | www.economicmodeling.com<br/></sup><sup>4. Source: State of Cloud Learning Report. A Cloud Guru, 2020, </sup><sup>https://go.acloudguru.com/rs/194-UHP-609/images/State_of_Cloud_Learning_Report_A_Cloud_Guru.pdf</sup></p></div></div></body></html>",
  "pubDate": "Thu, 03 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/public-sector/partnering-state-oregon-support-skilled-tech-workforce/",
  "category": "Public Sector",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Partnering with the state of Oregon to support a skilled tech workforce",
    "description": "Oregon partnered with Grow with Google and the National Association of State Workforce Agencies (NASWA) to launch the Google Career Certificates for those seeking employment in Oregon, offering 500 scholarships as a pilot.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/C5_273_6204204_820657723_5.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/public-sector/partnering-state-oregon-support-skilled-tech-workforce/"
  },
  "author": {
    "name": "Alice Kamens",
    "title": "Strategic Projects and Program Manager",
    "department": "Higher Education",
    "company": "Google Cloud"
  }
}