{
  "title": "Ocean scientists measure sediment plume stirred up by deep-sea-mining vehicle",
  "link": "https://news.mit.edu/2022/sediment-deep-sea-mining-0921",
  "description": "A new field study reveals a previously unobserved fluid dynamic process that is key to assessing impact of deep-sea mining operations.",
  "pubDate": "Wed, 21 Sep 2022 14:00:00 -0400",
  "guid": "https://news.mit.edu/2022/sediment-deep-sea-mining-0921",
  "dc:creator": "Jennifer Chu | MIT News Office",
  "content:encoded": "<p>What will be the impact to the ocean if humans are to mine the deep sea? It’s a question that’s gaining urgency as interest in marine minerals has grown.</p>\n\n<p>The ocean’s deep-sea bed is scattered with ancient, potato-sized rocks called “polymetallic nodules” that contain nickel and cobalt — minerals that are in high demand for the manufacturing of batteries, such as for powering electric vehicles and storing renewable energy, and in response to factors such as increasing urbanization. The deep ocean contains vast quantities of mineral-laden nodules, but the impact of mining the ocean floor is both unknown and highly contested.</p>\n\n<p>Now MIT ocean scientists have shed some light on the topic, with a new study on the cloud of sediment that a collector vehicle would stir up as it picks up nodules from the seafloor.</p>\n\n<p>The study, appearing today in <em>Science Advances,</em> reports the results of a 2021 research cruise to a region of the Pacific Ocean known as the Clarion Clipperton Zone (CCZ), where polymetallic nodules abound. There, researchers equipped a pre-prototype collector vehicle with instruments to monitor sediment plume disturbances as the vehicle maneuvered across the seafloor, 4,500 meters below the ocean’s surface. Through a sequence of carefully conceived maneuvers. the MIT scientists used the vehicle to monitor its own sediment cloud and measure its properties.</p>\n\n<p>Their measurements showed that the vehicle created a dense plume of sediment in its wake, which spread under its own weight, in a phenomenon known in fluid dynamics as a “turbidity current.” As it gradually dispersed, the plume remained relatively low, staying within 2 meters of the seafloor, as opposed to immediately lofting higher into the water column as had been postulated.</p>\n\n<p>“It’s quite a different picture of what these plumes look like, compared to some of the conjecture,” says study co-author Thomas Peacock, professor of mechanical engineering at MIT. “Modeling efforts of deep-sea mining plumes will have to account for these processes that we identified, in order to assess their extent.”</p>\n\n<p>The study’s co-authors include lead author Carlos Muñoz-Royo, Raphael Ouillon, and Souha El Mousadik of MIT; and Matthew Alford of the Scripps Institution of Oceanography.</p>\n\n<p><strong>Deep-sea maneuvers</strong></p>\n\n<p>To collect polymetallic nodules, some mining companies are proposing to deploy tractor-sized vehicles to the bottom of the ocean. The vehicles would vacuum up the nodules along with some sediment along their path. The nodules and sediment would then be separated inside of the vehicle, with the nodules sent up through a riser pipe to a surface vessel, while most of the sediment would be discharged immediately behind the vehicle.</p>\n\n<p>Peacock and his group have <a href=\"https://news.mit.edu/2021/deep-sea-mining-sediment-plumes-0727\" target=\"_blank\">previously studied</a> the dynamics of the sediment plume that associated surface operation vessels may pump back into the ocean. In their current study, they focused on the opposite end of the operation, to measure the sediment cloud created by the collectors themselves.</p>\n\n<p>In April 2021, the team joined an expedition led by Global Sea Mineral Resources NV (GSR), a Belgian marine engineering contractor that is exploring the CCZ for ways to extract metal-rich nodules. A European-based science team, Mining Impacts 2, also conducted separate studies in parallel. The cruise was the first in over 40 years to test a “pre-prototype” collector vehicle in the CCZ. The machine, called Patania II, stands about 3 meters high, spans 4 meters wide, and is about one-third the size of what a commercial-scale vehicle is expected to be.</p>\n\n<p>While the contractor tested the vehicle’s nodule-collecting performance, the MIT scientists monitored the sediment cloud created in the vehicle’s wake. They did so using two maneuvers that the vehicle was programmed to take: a “selfie,” and a “drive-by.”</p>\n\n<p>Both maneuvers began in the same way, with the vehicle setting out in a straight line, all its suction systems turned on. The researchers let the vehicle drive along for 100 meters, collecting any nodules in its path. Then, in the “selfie” maneuver, they directed the vehicle to turn off its suction systems and double back around to drive through the cloud of sediment it had just created. The vehicle’s installed sensors measured the concentration of sediment during this “selfie” maneuver, allowing the scientists to monitor the cloud within minutes of the vehicle stirring it up.</p>\n<p>For the “drive-by” maneuver, the researchers placed a sensor-laden mooring 50 to 100 meters from the vehicle’s planned tracks. As the vehicle drove along collecting nodules, it created a plume that eventually spread past the mooring after an hour or two. This “drive-by” maneuver enabled the team to monitor the sediment cloud over a longer timescale of several hours, capturing the plume evolution.</p>\n\n<p><strong>Out of steam</strong></p>\n\n<p>Over multiple vehicle runs, Peacock and his team were able to measure and track the evolution of the sediment plume created by the deep-sea-mining vehicle.</p>\n\n<p>“We saw that the vehicle would be driving in clear water, seeing the nodules on the seabed,” Peacock says. “And then suddenly there’s this very sharp sediment cloud coming through when the vehicle enters the plume.”</p>\n\n<p>From the selfie views, the team observed a behavior that was predicted by some of their previous <a href=\"https://www.cambridge.org/core/journals/journal-of-fluid-mechanics/article/abs/gravity-currents-from-moving-sources/71A73FE15FC7C8A34A263450041D301E\" target=\"_blank\">modeling studies</a>: The vehicle stirred up a heavy amount of sediment that was dense enough that, even after some mixing with the surrounding water, it generated a plume that behaved almost as a separate fluid, spreading under its own weight in what’s known as a turbidity current.</p>\n\n<p>“The turbidity current spreads under its own weight for some time, tens of minutes, but as it does so, it’s depositing sediment on the seabed and eventually running out of steam,” Peacock says. “After that, the ocean currents get stronger than the natural spreading, and the sediment transitions to being carried by the ocean currents.”</p>\n\n<p>By the time the sediment drifted past the mooring, the researchers estimate that 92 to 98 percent of the sediment either settled back down or remained within 2 meters of the seafloor as a low-lying cloud. There is, however, no guarantee that the sediment always stays there rather than drifting further up in the water column. <a href=\"https://doi.org/10.1017/flo.2022.19\" target=\"_blank\">Recent</a> and future studies by the research team are looking into this question, with the goal of consolidating understanding for deep-sea mining sediment plumes.</p>\n\n<p>“Our study clarifies the reality of what the initial sediment disturbance looks like when you have a certain type of nodule mining operation,” Peacock says. “The big takeaway is that there are complex processes like turbidity currents that take place when you do this kind of collection. So, any effort to model a deep-sea-mining operation’s impact will have to capture these processes.”</p>\n\n<p>“Sediment plumes produced by deep-seabed mining are a major concern with regards to environmental impact, as they will spread over potentially large areas beyond the actual site of mining and affect deep-sea life,” says Henko de Stigter, a marine geologist at the Royal Netherlands Institute for Sea Research, who was not involved in the research.&nbsp;“The current paper provides essential insight in the initial development of these plumes.”</p>\n\n<p>This research was supported, in part, by the National Science Foundation, ARPA-E, the 11th Hour Project, the Benioff Ocean Initiative, and Global Sea Mineral Resources. The funders had no role in any aspects of the research analysis, the research team states.</p>",
  "media:content": {
    "media:description": "The Launch and Recovery System deploying the Patania II pre-prototype collector vehicle from the surface operations vessel MV Normand Energy.",
    "media:credit": "Image: Global Sea Mineral Resources"
  },
  "category": [
    "Energy storage",
    "Environment",
    "Fluid dynamics",
    "Mechanical engineering",
    "Ocean science",
    "Oceanography and ocean engineering",
    "Renewable energy",
    "Research",
    "Sensors",
    "Water",
    "Technology and society",
    "Energy",
    "National Science Foundation (NSF)",
    "School of Engineering"
  ]
}