{
  "title": "Steven H. Knoblauch, \"Bodies and Social Rhythms: Navigating Unconscious Vulnerability and Emotional Fluidity\" (Routledge, 2020)",
  "description": "Psychotherapy tends to be thought of as a verbal enterprise, wherein participants speak and construct meaning through words. However, much goes on between patient and therapist at an embodied, nonverbal level that deserves attention. This is the focus of the book Bodies and Social Rhythms: Navigating Unconscious Vulnerability and Emotional Fluidity (2020, Routledge), written by my guest, Dr. Steven H. Knoblauch. In his new book, he describes the way that cultural meaning can be inscribed and communicated in bodily gestures, and how being open to difference necessitates attention to these embodied registers. For our interview, Dr. Knoblauch unpacks his ideas and shares insights into the personal experiences that have shaped his work. This interview will be relevant for those interested in expanding their awareness of communication that happens outside of words.\nSteven H. Knoblauch is a clinical psychologist and psychoanalyst in private practice in New York City. He is a Clinical Adjunct Associate Professor at the Postdoctoral Program in Psychotherapy and Psychoanalysis of New York University. His prior books are The Musical Edge of Therapeutic Dialogue (2000) and Forms of Intersubjectivity in Infant Research and Adult Treatment (2005).\nEugenio Duarte, Ph.D. is a psychologist and psychoanalyst practicing in Miami. He treats individuals and couples, with specialties in gender and sexuality, eating and body image problems, and relationship issues. He is a graduate and faculty of William Alanson White Institute in Psychiatry, Psychoanalysis, and Psychology in New York City and former chair of their LGBTQ Study Group; and faculty at Florida Psychoanalytic Institute in Miami. He is also a contributing author to the book Introduction to Contemporary Psychoanalysis: Defining Terms and Building Bridges (2018, Routledge).\n \nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/psychoanalysis",
  "pubDate": "Tue, 27 Oct 2020 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 115,
  "itunes:author": "Marshall Poe",
  "itunes:subtitle": "Psychotherapy tends to be thought of as a verbal enterprise, wherein participants speak and construct meaning through words. However, much goes on between patient and therapist at an embodied, nonverbal level that deserves attention...",
  "itunes:summary": "Psychotherapy tends to be thought of as a verbal enterprise, wherein participants speak and construct meaning through words. However, much goes on between patient and therapist at an embodied, nonverbal level that deserves attention. This is the focus of the book Bodies and Social Rhythms: Navigating Unconscious Vulnerability and Emotional Fluidity (2020, Routledge), written by my guest, Dr. Steven H. Knoblauch. In his new book, he describes the way that cultural meaning can be inscribed and communicated in bodily gestures, and how being open to difference necessitates attention to these embodied registers. For our interview, Dr. Knoblauch unpacks his ideas and shares insights into the personal experiences that have shaped his work. This interview will be relevant for those interested in expanding their awareness of communication that happens outside of words.\nSteven H. Knoblauch is a clinical psychologist and psychoanalyst in private practice in New York City. He is a Clinical Adjunct Associate Professor at the Postdoctoral Program in Psychotherapy and Psychoanalysis of New York University. His prior books are The Musical Edge of Therapeutic Dialogue (2000) and Forms of Intersubjectivity in Infant Research and Adult Treatment (2005).\nEugenio Duarte, Ph.D. is a psychologist and psychoanalyst practicing in Miami. He treats individuals and couples, with specialties in gender and sexuality, eating and body image problems, and relationship issues. He is a graduate and faculty of William Alanson White Institute in Psychiatry, Psychoanalysis, and Psychology in New York City and former chair of their LGBTQ Study Group; and faculty at Florida Psychoanalytic Institute in Miami. He is also a contributing author to the book Introduction to Contemporary Psychoanalysis: Defining Terms and Building Bridges (2018, Routledge).\n \nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/psychoanalysis",
  "content:encoded": "<p>Psychotherapy tends to be thought of as a verbal enterprise, wherein participants speak and construct meaning through words. However, much goes on between patient and therapist at an embodied, nonverbal level that deserves attention. This is the focus of the book <a href=\"https://bookshop.org/a/12343/9780367466855\"><em>Bodies and Social Rhythms: Navigating Unconscious Vulnerability and Emotional Fluidity </em></a>(2020, Routledge), written by my guest, Dr. Steven H. Knoblauch. In his new book, he describes the way that cultural meaning can be inscribed and communicated in bodily gestures, and how being open to difference necessitates attention to these embodied registers. For our interview, Dr. Knoblauch unpacks his ideas and shares insights into the personal experiences that have shaped his work. This interview will be relevant for those interested in expanding their awareness of communication that happens outside of words.</p><p><a href=\"https://www.stevenknoblauchphd.com/\">Steven H. Knoblauch</a> is a clinical psychologist and psychoanalyst in private practice in New York City. He is a Clinical Adjunct Associate Professor at the Postdoctoral Program in Psychotherapy and Psychoanalysis of New York University. His prior books are <a href=\"https://www.routledge.com/The-Musical-Edge-of-Therapeutic-Dialogue/Knoblauch/p/book/9781138005464\"><em>The Musical Edge of Therapeutic Dialogue</em> (2000)</a> and <a href=\"https://otherpress.com/books/book/?ean=9781590511510\"><em>Forms of Intersubjectivity in Infant Research and Adult Treatment</em> (2005)</a>.</p><p><a href=\"http://www.eugenioduartephd.com/\"><em>Eugenio Duarte</em></a><em>, Ph.D. is a psychologist and psychoanalyst practicing in Miami. He treats individuals and couples, with specialties in gender and sexuality, eating and body image problems, and relationship issues. He is a graduate and faculty of William Alanson White Institute in Psychiatry, Psychoanalysis, and Psychology in New York City and former chair of their LGBTQ Study Group; and faculty at Florida Psychoanalytic Institute in Miami. He is also a contributing author to the book </em><a href=\"https://www.routledge.com/Introduction-to-Contemporary-Psychoanalysis-Defining-terms-and-building/Charles/p/book/9781138749887\"><em>Introduction to Contemporary Psychoanalysis: Defining Terms and Building Bridges</em></a><em> (2018, Routledge).</em></p><p> </p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/psychoanalysis\">https://newbooksnetwork.supportingcast.fm/psychoanalysis</a></p>",
  "itunes:duration": 2372,
  "itunes:explicit": "no",
  "guid": "2032b6a6-0f04-11eb-b841-bbb11a831336",
  "enclosure": ""
}