{
  "title": "July 2022 Q&#038;A",
  "link": "https://500songs.com/podcast/july-2022-qa/",
  "pubDate": "Sat, 30 Jul 2022 18:24:45 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1257",
  "description": "While I'm still on hiatus, I invited questions from listeners. This is an hour-long podcast answering some of them. (Another hour-long Q&A for Patreon backers only will go up next week).\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\nThere is a Mixcloud of the music excerpted here which can be found at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-qa-edition/\">https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-qa-edition/</a>\n\nClick below for a transcript:\n\n\nHello and welcome to the Q&A  episode I'm doing while I'm working on creating a backlog. I'm making good progress on that, and still hoping and expecting to have episode 151 up some time in early August, though I don't have an exact date yet.\n\nI was quite surprised by the response to my request for questions, both at the amount of it and at where it came from. I initially expected to get a fair few comments on the main podcast, and a handful on the Patreon, and then I could do a reasonable-length Q&A podcast from the former and a shorter one from the latter. Instead, I only got a couple of questions on the main episode, but so many on the Patreon that I had to stop people asking only a day or so after posting the request for questions.\n\nSo instead of doing one reasonable length podcast and one shorter one, I'm actually doing two longer ones.\n\nWhat I'm going to do is do all the questions asked publicly, plus all the questions that have been asked multiple times, in this one, then next week I'm going to put up the more niche questions just for Patreon backers.\n\nHowever, I'm not going to answer *all* of the questions. I got so many questions so quickly that there's not space to answer them all, and several of them were along the lines of \"is artist X going to get an episode?\" which is a question I generally don't answer -- though I will answer a couple of those if there's something interesting to say about them.\n\nBut also, there are some I've not answered for another reason. As you may have noticed, I have a somewhat odd worldview, and look at the world from a different angle from most people sometimes. Now there were several questions where someone asked something that seems like a perfectly reasonable question, but contains a whole lot of hidden assumptions that that person hadn't even considered -- about music history, or about the process of writing and researching, or something else.\n\nNow, to answer that kind of question at all often means unpacking those hidden assumptions, which can sometimes make for an interesting answer -- after all, a lot of the podcast so far has been me telling people that what they thought they knew about music history was wrong -- but when it's a question being asked by an individual and you answer that way, it can sometimes, frankly, make you look like a horribly unpleasant person, or even a bully. \"Don't you even know the most basic things about historical research? I do! You fool! Hey everyone else listening, this person thinks you do research in *this* way, but everyone knows you do it *that* way!\"\n\nNow, that is never how I would intend such answers to come across -- nobody can be blamed for not knowing what they don't know -- but there are some questions where no matter how I phrased the answer, it came across sounding like that. I'll try to hold those over for future Q&A episodes if I can think of ways of unpicking the answers in such a way that I'm not being unconscionably rude to people who were asking perfectly reasonable questions.\n\nSome of the answers that follow might still sound a bit like that to be honest, but if you asked a question and my answer sounds like that to you, please know that it wasn't meant to.\n\nThere's a lot to get through, so let's begin:\n\nSteve from Canada asks:\n\n“Which influential artist or group has been the most challenging to get information on in the last 50 podcasts? We know there has been a lot written about the Beatles, Beach Boys, Motown as an entity, the Monkees and the Rolling Stones, but you mentioned in a tweet that there’s very little about some bands like the Turtles, who are an interesting story. I had never heard of Dino Valenti before this broadcast – but he appeared a lot in the last batch – so it got me curious.\n\n[Excerpt: The Move, “Useless Information”]\n\nIn the last fifty episodes there's not been a single one that's made it to the podcast where it was at all difficult to get information. The problem with many of them is that there's *too much* information out there, rather than there not being enough. No matter how many books one reads on the Beatles, one can never read more than a fraction of them, and there's huge amounts of writing on the Rolling Stones, on Hendrix, on the Doors, on the Byrds... and when you're writing about those people, you *know* that you're going to miss out something or get something wrong, because there's one more book out there you haven't read which proves that one of the stories you're telling is false.\n\nThis is one of the reasons the episodes have got so much longer, and taken so much more time. That wasn't the case in the first hundred episodes -- there were a lot of artists I covered there, like Gene and Eunice, or the Chords, or Jesse Belvin, or Vince Taylor who there's very little information about. And there are some coming up who there's far less information about than people in the last fifty episodes. But every episode since the Beatles has had a surfeit of information.\n\nThere is one exception -- I wanted to do a full episode on \"Rescue Me\" by Fontella Bass, because it would be an interesting lens through which to look at how Chess coped with the change in Black musical styles in the sixties. But there was so little information available about her I ended up relegating it to a Patreon bonus episode, because she makes those earlier artists look well-documented. Which leads nicely into the next question.\n\nNora Tillman asks \"Forgive this question if you’ve answered it before: is there literally a list somewhere with 500 songs you’ve chosen? Has the list changed since you first composed it? Also, when did you first conceive of this list?\"\n\n[Excerpt: John Reed and the D'Oyly Carte Opera Company, \"As Someday it May Happen\"]\n\nMany people have asked this question, or variations upon it. The answer is yes and no. I made a list when I started that had roughly two hundred songs I knew needed to be on there, plus about the same number again of artists who needed to be covered but whose precise songs I hadn't decided on. To make the initial list I pulled a list out of my own head, and then I also checked a couple of other five-hundred-song lists -- the ones put out by Rolling Stone magazine and the Rock and Roll Hall of Fame -- not because I wanted to use their lists; I have very little time for rock critical orthodoxy, as most of my listeners will likely have realised by now, but because I wanted to double-check that I hadn't missed anything obvious out, and that if I was missing something off their lists, I knew *why* I was missing it. To take a ludicrous example, I wouldn't want to get to the end of the 1960s and have someone say \"Wait a minute, what about the Beatles?\" and think \"I *knew* I'd forgotten something!\"\n\nThen, at the start of each fifty-episode season, I put together a more rigorous list of the fifty songs coming up, in order. Those lists *can* still change with the research -- for example, very early on in the research for the podcast, I discovered that even though I was completely unfamiliar with \"Ko Ko Mo\" by Gene and Eunice, it was a hugely important and influential record at the time, and so I swapped that in for another song. Or more recently, I initially intended to have the Doors only have one episode, but when I realised how much I was having to include in that episode I decided to give them a second one.\n\nAnd sometimes things happen the other way -- I planned to do full episodes on Jackie Shane and Fontella Bass, but for both of them I couldn't find enough information to get a decent episode done, so they ended up being moved to Patreon episodes.\n\nBut generally speaking that fifty-song list for a year's episodes is going to remain largely unchanged. I know where I'm going, I know what most of the major beats of the story are, but I'm giving myself enough flexibility to deviate if I find something I need to include.\n\nConnected with this, Rob Johnson asks how I can be confident I'll get back to some stories in later episodes.\n\nWell, like I say, I have a pretty much absolute idea of what I'm going to do in the next year, and there are a lot of individual episodes where I know the structure of the episode long before we get to it. As an example here... I don't want to give too much away, and I'm generally not going to be answering questions about \"will artist X be appearing?\", but Rob also asked about one artist. I can tell you that that artist is one who will not be getting a full episode -- and I already said in the Patreon episode about that artist that they won't -- but as I also said in that episode they *will* get a significant amount of time in another episode, which I now know is going to be 180, which will also deal with another artist from the same state with the same forename, even though it's actually about two English bands.\n\nI've had the structure of that episode planned out since literally before I started writing episode one. On the other hand, episode 190 is a song that wasn't originally going to be included at all. I was going to do a 1967 song by the same artist, but then found out that a fact I'd been going to use was disputed, which meant that track didn't need to be covered, but the artist still did, to finish off a story I'd started in a previous episode.\n\nPatrick asks:\"I am currently in the middle of reading 1971: Never a Dull Moment by David Hepworth and I’m aware that Apple TV have produced a documentary on how music changed that year as well and I was wondering what your opinion on that subject matter? I imagine you will be going into some detail on future podcasts, but until recently I never knew people considered 1971 as a year that brought about those changes.\"\n\n[Excerpt: Rod Stewart, \"Angel\"]\n\nI've not yet read Hepworth's book, but that it's named after an album which came out in 1972 (which is the album that track we just heard came from) says something about how the idea that any one year can in itself be a turning point for music is a little overstated -- and the Apple documentary is based on Hepworth's book, so it's not really multiple people making that argument. Now, as it happens, 1971 is one of the break points for the podcast -- episodes 200 and 201 are both records from July 1971, and both records that one could argue were in their own way signifiers of turning points in rock music history. And as with 1967 it's going to have more than its fair share of records, as it bridges the gap of two seasons. But I think one could make similar arguments for many, many years, and 1971 is  not one of the most compelling cases. I can't say more before I read Hepworth's book, which won't be for a few months yet. I'm instinctively dubious of these \"this year was the big year that changed everything\" narratives, but Hepworth's a knowledgeable enough writer that I wouldn't want to dismiss his thesis without even reading the book.\n\nRoger Pannell asks\n\nI’m a fairly recent joiner-in too so you may have answered this before. What is the theme tune to the podcast please.\n\n[Excerpt: The Boswell Sisters, “Rock and Roll”]\n\nThe theme song to the podcast is \"Rock and Roll\" by the Boswell Sisters. The version I use is not actually the version that was released as a single, but a very similar performance that was used in the film Transatlantic Merry-Go-Round in 1931. I chose it in part because it may well be the first ever record to contain the phrase \"rock and roll\" (though as I've said many times there's no first anything, and there are certainly many records which talk about rocking and/or rolling -- just none I know of with that phrase) so it evokes rock and roll history, partly because the recording is out of copyright, and partly just because I like the Boswell Sisters.\n\nSeveral people asked questions along the lines of this one from Christopher Burnett\n\n\"Just curious if there's any future episodes planned on any non-UK or non-North American songs? The bonus episodes on the Mops and Kyu Sakamoto were fascinating.\"\n\n[Excerpt: Kyu Sakamoto, \"Sukiyaki\"]\n\nSadly, there won't be as many episodes on musicians from outside the UK and North America as I'd like. The focus of the podcast is going to be firmly on British, American, Irish, and Canadian musicians, with a handful from other Anglophone countries like Australia and Jamaica. There *are* going to be a small number of episodes on non-Anglophone musicians, but very few. Sadly, any work of history which engages with injustices still replicates some of those injustices, and one of the big injustices in rock history is that most rock musicians have been very insular, and there has been very little influence from outside the Anglophone world, which means that I can't talk much about influential records made by musicians from elsewhere.  Also, in a lot of cases most of the writing about them is in other languages, and I'm shamefully monolingual (I have enough schoolboy French not to embarrass myself, but not enough to read a biography without a dictionary to hand, and that's it).\n\nThere *will* be quite a few bonus episodes on musicians from non-Anglophone countries though, because this *is* something that I'm very aware of as a flaw, and if I can find ways of bringing the wider story into the podcast I will definitely do so, even if it means changing my plans somewhat, but I'm afraid they'll largely be confined to Patreon bonuses rather than mainline episodes.\n\nEd Cunard asks\n\n\"Is there a particular set of songs you're not looking forward to because you don't care for them, but intend to dive into due to their importance?\"\n\n[Excerpt: Jackie Shane, \"Don't Play That Song\"]\n\nThere are several, and there already have been some, but I'm not going to say what they are as part of anything to do with the podcast (sometimes I might talk about how much I hate a particular record on my personal Twitter account or something, but I try not to on the podcast's account, and I'm certainly not going to in an episode of the podcast itself). One of the things I try to do with the podcast is to put the case forward as to why records were important, why people liked them at the time, what they got out of them. I can't do that if I make it about my own personal tastes.\n\nI know for a fact that there are people who have come away from episodes on records I utterly despise saying \"Wow! I never liked that record before, but I do now!\" and that to me shows that I have succeeded -- I've widened people's appreciation for music they couldn't appreciate before.\n\nOf course, it's impossible to keep my own tastes from showing through totally, but even there people tend to notice much more my like or dislike for certain people rather than for their music, and I don't feel anything like as bad for showing that.\n\nSo I have a policy generally of just never saying which records in the list I actually like and which I hate. You'll often be able to tell from things I talk about elsewhere, but I don't want anyone to listen to an episode and be prejudiced not only against the artist but against the episode  by knowing going in that I dislike them, and I also don't want anyone to feel like their favourite band is being given short shrift. There are several records coming up that I dislike myself but where I know people are excited about hearing the episode, and the last thing I want to do is have those people who are currently excited go in disappointed before they even hear it.\n\nMatt Murch asks:\n\n\"Do you anticipate tackling the shift in rock toward harder, more seriously conceptual moves in 1969 into 1970, with acts like Led Zeppelin, The Who (again), Bowie, etc. or lighter soul/pop artists such as Donna Summer, Carly Simon or the Carpenters?\n\nAlso, without giving too much away, is there anything surprising you've found in your research that you're excited to cover?\n\n[Excerpt: Robert Plant, \"If I Were a Carpenter\"]\n\nOK, for the first question... I don't want to say exactly who will and won't be covered in future episodes, because when I say \"yes, X will be covered\" or \"no, Y will not be covered\", it invites a lot of follow-up discussion along the lines of \"why is X in there and not Y?\" and I end up having to explain my working, when the episodes themselves are basically me explaining my working.\n\nWhat I will say is this... the attitude I'm taking towards who gets included and who gets excluded is, at least in part, influenced by an idea in cognitive linguistics called prototype theory.\n\nAccording to this theory, categories aren't strictly bounded like in Aristotelian thought -- things don't have strict essences that mean they definitely are or aren't members of categories. But rather, categories have fuzzy boundaries, and there are things at the centre that are the most typical examples of the category, and things at the border that are less typical. For example, a robin is a very \"birdy\" bird -- it's very near the centre of the category of bird, it has a lot of birdness -- while an ostrich is still a bird, but much less birdy, it's sort of in the fuzzy boundary area. When you ask people to name a bird, they're more likely to name a robin than an ostrich, and if you ask them “is an ostrich a bird?” they take longer to answer than they do when asked about robins. In the same way, a sofa is nearer the centre of the category of \"furniture\" than a wardrobe is.\n\nNow, I am using an exceptionally wide definition of what counts as rock music, but at the same time, in order for it to be a history of rock music, I do have to spend more time in the centre of the concept than around the periphery. My definition would encompass all the artists you name, but I'm pretty sure that everyone would agree that the first three artists you name are much closer to the centre of the concept of \"rock music\" than the last three. That's not to say anyone on either list is definitely getting covered or is definitely *not* getting covered -- while I have to spend more time in the centre than the periphery, I do have to spend some time on the periphery, and my hope is to cover as many subgenres and styles as I can -- but that should give an idea of how I'm approaching this.\n\nAs for the second question -- there's relatively little that's surprising that I've uncovered in my research so far, but that's to be expected. The period from about 1965 through about 1975 is the most over-covered period of rock music history, and so the basic facts for almost every act are very, very well known to people with even a casual interest. For the stuff I'm doing in the next year or so, like the songs I've covered for the last year, it's unlikely that anything exciting will come up until very late in the research process, the times when I'm pulling everything together and notice one little detail that's out of place and pull on that thread and find the whole story unravelling.\n\nWhich may well mean, of course, that there *are* no such surprising things. That's always a possibility in periods where we're looking at things that have been dealt with a million times before, and this next year may largely be me telling stories that have already been told. Which is still of value, because I'm putting them into a larger context of the already-released episodes, but we'll see if anything truly surprising happens. I certainly hope it does.\n\nJames Kosmicki asks\n\n\"Google Podcasts doesn't seem to have any of the first 100 episodes - are they listed under a different name perhaps?\"\n\n[Excerpt: REM, \"Disappear\"]\n\nI get a number of questions like this, about various podcast apps and sites, and I'm afraid my answer is always the same -- there's nothing I can do about this, and it's something you'd have to take up with the site in question. Google Podcasts picks up episodes from the RSS feed I provide, the same as every other site or app. It's using the right feed, that feed has every episode in it, and other sites and apps are working OK with it.\n\nIn general, I suggest that rather than streaming sites like Google Podcasts or Stitcher or Spotify, where the site acts as a middleman and they serve the podcast to you from their servers, people should use a dedicated podcast app like RadioPublic or Pocketcasts or gPodder, where rather than going from a library of podcast episodes that some third party has stored, you're downloading the files direct from the original server, but I understand that sometimes those apps are more difficult to use, especially for less tech-savvy people.\n\nBut generally, if an episode is in some way faulty or missing on the 500songs.com webpage, that's something I can do something about. If it's showing up wrong on Spotify or Google Podcasts or Stitcher or whatever, that's a problem at their end. Sorry.\n\nDarren Johnson asks \"were there any songs that surprised you? Which one made the biggest change between what you thought you knew and what you learned researching it?\"\n\n[Excerpt: The Turtles, \"Goodbye Surprise\"]\n\nWell, there have been a few, in different ways. The most surprising thing for me actually was in the most recent episode when I discovered the true story behind the \"bigger than Jesus\" controversy during my reading. That was a story I'd known one way for my entire life -- literally I think I first read about that story when I was six or seven -- and it turned out that not one thing I'd read on the subject had explained what had really happened.\n\nBut then there are other things like the story of \"Ko Ko Mo\", which was a record I wasn't even planning on covering at first, but which turned out to be one of the most important records of the fifties.\n\nBut I actually get surprised relatively little by big-picture things. I'll often discover fun details or new connections between things I hadn't noticed before, but the basic outlines of the story never change that much -- I've been reading about music history literally since I learned how to read, and while I do a deep dive for each episode, it's very rare that I discover anything that totally changes my perspective.\n\nThere is always a process of reevaluation going on, and a change in the emphases in my thought, so for example when I started the project I knew Johnny Otis would come up a fair bit in the early years, and knew he was a major figure, but was still not giving him the full credit he deserved in my head. The same goes for Jesse Belvin, and as far as background figures go Lester Sill and Milt Gabler. But all of these were people I already knew were important, i just hadn't connected all the dots in my head. I've also come to appreciate some musicians more than I did previously. But there are very few really major surprises, which is probably to be expected -- I got into this already knowing a *LOT*, because otherwise I wouldn't have thought this was a project I could take on.\n\nTracey Germa -- and I'm sorry, I don't know if that's pronounced with a hard or soft G, so my apologies if I mispronounced it -- asks:\n\n\"Hi Andrew.\n\nWe love everything about the podcast, but are especially impressed with the way you couch your trigger warnings and how you embed social commentary into your analysis of the music. You have such a kind approach to understanding human experiences and at the same time you don’t balk at saying the hard things some folks don’t want to hear about their music heroes.\n\nSo, the question is - where does your social justice/equity/inclusion/suffer no fools side come from? Your family? Your own experiences? School/training?”\n\n[Excerpt: Elvis Costello and the Attractions, \"Little Triggers\"]\n\nWell, firstly, I have to say that people do say  this kind of thing to me quite a lot, and I'm grateful when they say it, but I never really feel comfortable with it, because frankly I think I do very close to the absolute minimum, and I get by because of the horribly low expectations our society has for allocishet white men, which means that making even the tiniest effort possible to be a decent human being looks far more impressive by comparison than it actually is. I genuinely think I don't do a very good job of this at all, although I do try, and that's not false modesty there.\n\nBut to accept the premise of the question for a moment, there are a couple of answers. My parents are both fairly progressive both politically and culturally,  for the time and place where they raised me. They both had strong political convictions, and while they didn't have access to much culture other than what was on TV or in charting records or what have you -- there was no bookshop or record shop in our town, and obviously no Internet back then -- they liked the stuff out of that mix that was forward-thinking, and so was anti-racist, accepting of queerness, and so on. From a very early age, I was listening to things like \"Glad to be Gay\" by the Tom Robinson Band. So from before I really even understood what those concepts were, I knew that the people I admired thought that homophobia and racism were bad things.\n\nI was also bullied a lot at school, because I was autistic and fat and wore glasses and a bunch of other reasons. So I hated bullying and never wanted to be a bully. I get very, very, *very* angry at cruelty and at abuses of power -- as almost all autistic people do, actually.\n\nAnd then, in my twenties and thirties, for a variety of reasons I ended up having a social circle that was predominantly queer and/or disabled and/or people with mental health difficulties. And when you're around people like that, and you don't want to be a bully, you learn to at least try to take their feelings into consideration, though I slipped up a great deal for a long time, and still don't get everything right.\n\nSo that's the \"social justice\" side of things. The other side, the \"understanding human experiences\" side... well, everyone has done awful things at times, and I would hope that none of us would be judged by our worst behaviours. \"Use every man to his desert and who should 'scape whipping?\" and all that. But that doesn't mean those worst behaviours aren't bad, and that they don't hurt people, and denying that only compounds the injustice.\n\nPeople are complicated, societies are complicated, and everyone is capable of great good and great evil. In general I tend to avoid a lot of the worst things the musicians I talk about did, because the podcast *is* about the music, but when their behaviour affects the music, or when I would otherwise be in danger of giving a truly inaccurate picture of someone, I have to talk about those things. You can't talk about Jerry Lee Lewis without talking about how his third marriage derailed his career, you can't talk about Sam Cooke without talking about his death, and to treat those subjects honestly you have to talk about the reprehensible sides of their character. Of course, in the case of someone like Lewis, there seems to be little *but* a reprehensible side, while someone like Cooke could be a horrible, horrible person, but even the people he hurt the most also loved him dearly because of his admirable qualities. You *have* to cover both aspects of someone like him if you want to be honest, and if you're not going to be honest why bother trying to do history at all?\n\nLester Dragstedt says (and I apologise if I mispronounced that): \"I absolutely love this podcast and the perspective you bring. My only niggle is that the sound samples are mixed so low. When listening to your commentary about a song at voice level my fingers are always at the volume knob to turn up when the song comes in.\"\n\n[Excerpt: Bjork, \"It's Oh So Quiet\"]\n\nThis is something that gets raised a lot, but it's not something that's ever going to change. When I started the podcast, I had the music levels higher, and got complaints about that, so I started mixing them lower. I then got complaints about *that*, so I did a poll of my Patreon backers to see what they thought, and by about a sixty-forty margin they wanted the levels to be lower, as they are now, rather than higher as they were earlier.\n\nBasically, there seem to be two groups of listeners. One group mostly listens with headphones, and doesn't like it when the music gets louder, because it hurts their ears. The other group mostly listens in their cars, and the music gets lost in the engine noise. That's a gross oversimplification, and there are headphone listeners who want the music louder and car listeners who want the music quieter, but the listenership does seem to split roughly that way, and there are slightly more headphone listeners.\n\nNow, it's literally *impossible* for me to please everyone, so I've given up trying with this, and it's *not* going to change. Partly because the majority of my backers voted one way, partly because it's just easier to leave things the way they are rather than mess with them given that no matter what I do someone will be unhappy, and partly because both Tilt when he edits the podcast and I when I listen back and tweak his edit are using headphones, and *we* don't want to hurt our ears either.\n\nEric Peterson asks \"if we are basically in 1967 that is when we start seeing Country artists like Johnny Cash and Waylon Jennings - the Man who Survived the Day the Music Died - start to bring more rock songs into their recordings and start to set the ground work in many ways for Country Rock ... how do you envision bringing the role they play in the History of Rock and Roll into the podcast?\"\n\n[Excerpt: The Del McCoury Band, \"Nashville Cats\"]\n\nI will of course be dealing with country rock as one of the subgenres I discuss -- though there's only one real country-rock track coming up in the next fifty, but there'll be more as I get into the seventies, and there are several artists coming up with at least some country influence. But I won't be looking at straight country musicians like Jennings or Cash except through the lens of rock musicians they inspired -- things like me talking about Johnny Cash briefly in the intro to the \"Hey Joe\" episode. I think Cocaine and Rhinestones is already doing a better job of covering country music than I ever could, and so those people will only touch the story tangentially.\n\nNili Marcia says:\n\n\"If one asks a person what's in that room it would not occur to one in 100 to mention the air that fills it. Something so ubiquitous as riff--I don't know what a riff actually is! Will you please define riff, preferably with examples.\"\n\nNow this is something I actually thought I'd explained way back in episode one, and I have a distinct memory of doing so, but I must have cut that part out -- maybe I recorded it so badly that part couldn't be salvaged, which happened sometimes in the early days -- because I just checked and there's no explanation there. I would have come back to this at some point if I hadn't been thinking all along that I'd covered it right at the start, because you're right, it is a term that needs definition.\n\nA riff is, simply, a repeated, prominent, instrumental figure. The term started out in jazz, and there it was a term for a phrase that would be passed back and forth between different instruments -- a trumpet might play a phrase, then a saxophone copy it, then back to the trumpet, then back to the saxophone. But quickly it became a term for a repeated figure that becomes the main accompaniment part of a song, over which an instrumentalist might solo or a singer might sing, but which you remember in its own right. A few examples of well-known riffs might include \"Smoke on the Water\" by Deep Purple:\n\n[Excerpt: Deep Purple, \"Smoke on the Water\"]\n\n\"I Feel Fine\" by the Beatles:\n\n[Excerpt: The Beatles, \"I Feel Fine\"]\n\n\"Last Train to Clarksville\" by the Monkees:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\nThe bass part in “Under Pressure” by Queen and David Bowie:\n\n[Excerpt: Queen and David Bowie, “Under Pressure”]\n\nOr the Kingsmen's version of \"Louie Louie\":\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nBasically, if you can think of a very short, prominent, instrumental idea that gets repeated over and over, that's a riff.\n\nErik Pedersen says \"I love the long episodes and I suspect you do too -- thoroughness. of this kind is something few get the opportunity to do -- but have you ever, after having written a long one, decided to cut them significantly? Are there audio outtakes you might string together one day?\"\n\n[Excerpt: Bing Crosby and Les Paul, \"It's Been a Long, Long Time\"]\n\nI do like *having* done the long episodes, and sometimes I enjoy doing them, but other times I find it frustrating that an episode takes so long, because there are other stories I want to move on to. I'm trying for more of a balance over the next year, and we'll see how that works out. I want to tell the story in the depth it deserves, and the longer episodes allow me to do that, and to experiment with narrative styles and so on, but I also want to get the podcast finished before I die of old age.\n\nAlmost every episode has stuff that gets cut, but it's usually in the writing or recording stage -- I'll realise a bit of the episode is boring and just skip it while I'm recording, or I'll cut out an anecdote or something because it looks like it's going to be a flabby episode and I want to tighten it up, or sometimes I'll realise that because of my mild speech impediments a sentence is literally unspeakable, and I'll rework it. It's very, very rare that I'll cut anything once it's been recorded, and if I do it's generally because when I listen back after it's been edited I'll realise I'm repeating myself or I made a mistake and need to cut a sentence because I said the wrong name, that sort of thing.\n\nI delete all the audio outtakes, but even if I didn't there would be nothing worth releasing. A few odd, out of context sentences, the occasional paragraph just repeating something I'd already said, a handful of actual incorrect facts, and a lot of me burping, or trying to say a difficult name three times in a row, or swearing when the phone rings in the middle of a long section.\n\nLucy Hewitt says \"Something that interests me, and that I’m sure you will cover is how listeners consume music and if that has an impact. In my lifetime we’ve moved from a record player which is fixed in one room to having a music collection with you wherever you go, and from hoping that the song you want to hear might be played on the radio to calling it up whenever you want. Add in the rise of music videos, and MTV, and the way in which people access music has changed a lot over the decades. But has that affected the music itself?\"\n\n[Excerpt: Bow Wow Wow \"C30 C60 C90 Go!\"]\n\nIt absolutely has affected the music itself in all sorts of ways, some of which I've touched on already and some of which I will deal with as we go through the story, though the story I'm telling will end around the time of Napster and so won't involve streaming services and so forth.\n\nBut every technology change leads to a change in the sound of music in both obvious and non-obvious ways. When AM radio was the most dominant form of broadcasting, there was no point releasing singles in stereo, because at that time there were no stereo AM stations. The records also had to be very compressed, so the sound would cut through the noise and interference. Those records would often be very bass-heavy and have a very full, packed, sound. In the seventies, with the rise of eight-track players, you'd often end up with soft-rock and what would later get termed yacht rock having huge success. That music, which is very ethereal and full of high frequencies, is affected less negatively by some of the problems that came with eight-track players, like the tape stretching slightly.\n\nThen post-1974 and the OPEC oil crisis, vinyl became more expensive, which meant that records started being made much thinner, which meant you couldn't cut grooves as deeply, which meant you lost bass response, which again changed the sound of records – and also explains why when CDs came out, people started thinking they sounded better than records, because they *did* sound better than the stuff that was being pressed in the late seventies and early eighties, which was so thin it was almost transparent, even though they sounded nowhere near as good as the heavy vinyl pressings of the fifties and sixties. And then the amount of music one could pack into a CD encouraged longer tracks...\n\nA lot of eighties Hi-NRG and dance-pop music, like the records made by Stock, Aitken, and Waterman, has almost no bass but lots of skittering high-end percussion sounds -- tons of synthesised sleighbells and hi-hats and so on -- because a lot of disco equipment had frequency-activated lights, and the more high-end stuff was going on, the more the disco lights flashed...\n\nWe'll look at a lot of these changes as we go along, but every single new format, every new way of playing an old format, every change in music technology, changes what music gets made quite dramatically.\n\nLucas Hubert asks:\n\n“Black Sabbath being around the corner, how do you plan on dealing with Heavy Metal?\n\nI feel like for now, what is popular and what has had a big impact in Rock history coincide. But that kind of change with metal, no? (Plus, prog and metal are more based on albums than singles, I think.)”\n\n[Excerpt: Black Sabbath, “Sabbath Bloody Sabbath”]\n\nI plan on dealing with metal the same way I've been dealing with every other subgenre. We are, yes, getting into a period where influence and commercial success don't correlate quite as firmly as they did in the early years -- though really we've already been there for quite some time. I've done two episodes so far on the Byrds, a group who only had three top-twenty singles in the US and two in the UK, but only did a bonus episode on Herman's Hermits, who had fourteen in the US and seventeen in the UK. I covered Little Richard but didn't cover Pat Boone, even though Boone had the bigger hits with Richard's songs.\n\nIn every subgenre there are going to be massive influences who had no hits, and people who had lots of hits but didn't really make much of a wider impact on music, and I'll be dealing with the former more than the latter. But also, I'll be dealing most with people who were influential *and* had lots of hits -- if nothing else because while influence and chart success aren't a one-to-one correlation, they're still somewhat correlated.\n\nSo it's unlikely you'll see me cover your favourite Scandinavian Black Metal band who only released one album of which every copy was burned in a mysterious fire two days after release, but you can expect most of the huge names in metal to be covered. Though even there, simply because of the number of subgenres I'm going to cover, I'm going to miss some big ones.\n\nRelated to the question about albums, Svennie asks “This might be a bit of a long winded question so just stick with me here. As the music you cover becomes more elaborate, and the albums become bigger in scale, how do you choose a song which you build the story around while also telling the story of that album? I ask this specifically with the White Album in mind, where you’ve essentially got four albums in one. To that end, what song would you feel defines the White Album?”\n\n[Excerpt: The Beatles, “Revolution #9”]\n\nWell, you'll see how I cover the White Album in episode one hundred and seventy-two -- we're actually going to have quite a long stretch with no Beatles songs covered because I'm going to backfill a lot of 1967 and then we're getting to the Beatles again towards the end of 1968, but it'll be another big one when we get there. But in the general case... the majority of albums to come still had singles released off them, and a lot of what I'm going to be looking at in the next year or two is still hit singles, even if the singles are by people known as album bands.\n\nOther times, a song wasn't a single, but maybe it was covered by someone else -- if I know I'm going to cover a rock band and I also know that one of the soul artists who would do rock covers as album tracks did a version of one of their songs, and I'm going to cover that soul artist, say, then if I do the song that artist covered I can mention it in the episode on the soul singer and tie the two episodes together a bit. In other cases there's a story behind a particular track that's more interesting than other tracks, or the track is itself a cover version of someone else's record, which lets me cover both artists in a single episode, or it's the title track of the album.\n\nA lot of people have asked me this question about how I'd deal with albums as we get to the late sixties and early seventies, but looking at the list of the next fifty episodes, there's actually only two where I had to think seriously about which song I chose from an album -- in one case, I chose the title track, in the other case I just chose the first song on the album (though in that case I may end up choosing another song from the same album if I end up finding a way to make that a more interesting episode). The other forty-eight were all very, very obvious choices.\n\nGary Lucy asks\n\n“Do you keep up with contemporary music at all? If so, what have you been enjoying in 2022 so far…and if not, what was the most recent “new” album you really got into?”\n\n[Excerpt: Stew and the Negro Problem, \"On the Stage of a Blank White Page\"]\n\nI'm afraid I don't. Since I started doing the podcast, pretty much all of my listening time has been spent on going back to much older music, and even before that, when I was listening to then-new music it was generally stuff that was very much inspired by older music, bands like the Lemon Twigs, who probably count as the last new band I really got into with their album Do Hollywood, which came out in 2016 but which I think I heard in 2018.\n\nI'm also now of that age where 2018 seems like basically yesterday, and when I keep thinking \"what relatively recent albums have I liked?\" I think of things like The Reluctant Graveyard by Jeremy Messersmith, which is from 2010, or Ys by Joanna Newsom, which came out in 2006. Not because I haven't bought records released since then, but because my sense of time is so skewed that summer 1994 and summer 1995 feel like epochs apart, hugely different times in every way, but every time from about 2005 to 2020 is just \"er... a couple of years ago? Maybe?\" So without going through every record I've bought in the last twenty years and looking at the release date I couldn't tell you what still counts as contemporary and what's old enough to vote. I have recently listened a couple of times to an album by a band called Wet Leg, who are fairly new, but other than that I can't say.\n\nBut probably the most recent albums to become part of my regular listening rotation are two albums which came out simultaneously in 2018 by Stew and the Negro Problem, Notes of a Native Song, which is a song cycle about James Baldwin and race in America, and The Total Bent, which is actually the soundtrack to a stage musical, and which I think many listeners to the podcast might find interesting, and which is what that last song excerpt was taken from. It's basically a riff on the idea of The Jazz Singer, but set in the Civil Rights era, and about a young politically-radical Black Gospel songwriter who writes songs for his conservative preacher father to sing, but who gets persuaded to become a rock and roll performer by a white British record producer who fetishises Black music. It has a *lot* to say about religion, race, and politics in America -- a couple of the song titles, to give you some idea, are \"Jesus Ain't Sitting in the Back of the Bus\" and \"That's Why He's Jesus and You're Not, Whitey\".\n\nIt's a remarkable album, and it deals with enough of the same subjects I've covered here that I think any listeners will find it interesting. Unfortunately, it was released through the CDBaby store, which closed down a few months later, and unlike most albums released through there it doesn't seem to have made its way onto any of the streaming platforms or digital stores other than Apple Music, which rather limits its availability. I hope it comes out again soon.\n\nAlec Dann says “I haven't made it to the Sixties yet so pardon if you have covered this: what was the relationship between Sun and Stax in their heyday? Did musicians work in both studios?”\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nI've covered this briefly in a couple of the episodes on Stax, but the short version is that Sun was declining just as Stax was picking up. Jim Stewart, who founded Stax, was inspired in part by Sam Phillips, and there was a certain amount of cross-fertilisation, but not that much. Obviously Rufus Thomas recorded for both labels, and there were a few other connections -- Billy Lee Riley, for example, who I did an episode on for his Sun work, also recorded at the Stax studio before going on to be a studio musician in LA, and it was actually at a Billy Lee Riley session that went badly that Booker T and the MGs recorded \"Green Onions\". Also, Sun had a disc-cutting machine and Stax didn't, so when they wanted to get an acetate cut to play for DJs they'd take it to Sun -- it was actually Scotty Moore, who was working for Sun as a general engineer and producer as well as playing RCA Elvis sessions by 1962, who cut the first acetate copy of \"Green Onions\".\n\nBut in general the musicians playing at Stax were largely the next generation of musicians -- people who'd grown up listening to the records Sam Phillips had put out in the very early fifties by Black musicians, and with very little overlap.\n\nRoger Stevenson asks \"This project is going to take the best part of 7 years to complete. Do you have contingency plans in case of major problems? And please look after yourself - this project is gong to be your legacy.\"\n\n[Excerpt: Bonzo Dog Doodah Band, \"Button Up Your Overcoat\"]\n\nI'm afraid there's not much I can do if major problems come up -- by major problems I'm talking about things that prevent me from making the podcast altogether, like being unable to think or write or talk. By its nature, the podcast is my writing and my research and my voice, and if I can't do those things... well, I can't do them. I *am* trying to build in some slack again -- that's why this month off has happened -- so I can deal with delays and short-term illnesses and other disruptions, but if it becomes impossible to do it becomes impossible to do, and there's nothing more I can do about it.\n\nMark Lipson asks \"I’d like to know which episodes you’ve released have been the most & least popular? And going forward, which episodes do you expect to be the most popular?\n\nJust curious to know what music most of your listeners listen to and are interested in.\"\n\n[Excerpt: Sly and the Family Stone, \"Somebody's Watching You\"]\n\nI'm afraid I honestly don't know. Most podcasters have extensive statistical tools available to them, which tell them which episodes are most popular, what demographics are listening to the podcast, where they are in the world, and all that kind of thing. They use that information to sell advertising spots, which is how they make most of their money. You can say \"my podcast is mostly listened to by seventy-five year-olds who google for back pain relief -- the perfect demographic for your orthopedic mattresses\" or \"seven thousand people who downloaded my latest episode also fell for at least one email claiming to be from the wallet inspector last year, so my podcast is listened to by the ideal demographic for cryptocurrency investment\".\n\nNow, I'm lucky enough to be making enough money from my Patreon supporters' generosity that I don't have to sell advertising, and I hope I never do have to. I said at the very start of the process that I would if it became necessary, but that I hoped to keep it ad-free, and people have frankly been so astonishingly generous I should never have to do ads -- though I do still reserve the right to change my mind if the support drops off.\n\nNow, my old podcast host gave me access to that data as standard. But when I had to quickly change providers, I decided that I wasn't going to install any stats packages to keep track of people. I can see a small amount of information about who actually visits the website, because wordpress.com gives you that information – not your identities but just how many people come from which countries, and what sites linked them. But if you're downloading the podcast through a podcast app, or listening through Spotify or Stitcher or wherever, I've deliberately chosen not to access that data. I don't need to know who my audience is, or which episodes they like the most -- and if I did, I have a horrible feeling I'd start trying to tailor the podcast to be more like what the existing listeners like, and by doing so lose the very things that make it unique.\n\nOnce or twice a month I'll look at the major podcast charts, I check the Patreon every so often to see if there's been a massive change in subscriber numbers, but other than that I decided I'm just not going to spy on my listeners (though pretty much every other link in the chain does, I'm afraid, because these days the entire Internet is based on spying on people).\n\nSo the only information I have is the auto-generated \"most popular episodes\" thing that comes up on the front page, which everyone can see, and which shows the episodes people who actually visit the site are listening to most in the last few days, but which doesn't count anything from more than a few days ago, and which doesn't count listens from any other source, and which I put there basically so new listeners can see which ones are popular. At the moment that's showing that the most listened episodes recently are the two most recent full episodes -- \"Respect\" and \"All You Need is Love\" -- the most recent of the Pledge Week episodes, episodes one and two, so people are starting at the beginning, and right now there's also the episodes on \"Ooby Dooby\", \"Needles and Pins\", \"God Only Knows\", \"She Loves You\" and \"Hey Joe\". But in a couple of days' time those last five will be totally different.\n\nAnd again, that's just the information from people actually visiting the podcast website. I've deliberately chosen not to know what people listening in any other way are doing -- so if you've decided to just stream that bit of the Four Tops episode where I do a bad Bob Dylan impression five thousand times in a row, you can rest assured I have no idea you're doing it and your secret is totally safe.\n\nAnyway, that's all I have time for in this episode. In a week or so I'll post a similar-length episode for Patreon backers only, and then a week or two after that the regular podcast will resume, with a story involving folk singers, jazz harmony, angelic visitations and the ghost of James Dean. See you then.",
  "itunes:subtitle": "While Im still on hiatus, I invited questions from listeners. This is an hour-long podcast answering some of them. (Another hour-long Q&A for Patreon backers only will go up next week).\n\nTilt Araiza has assisted invaluably by doing a first-pass edit,",
  "itunes:keywords": "bonus episodes,q&a",
  "itunes:episodeType": "bonus",
  "content:encoded": "While I'm still on hiatus, I invited questions from listeners. This is an hour-long podcast answering some of them. (Another hour-long Q&A for Patreon backers only will go up next week).\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\nThere is a Mixcloud of the music excerpted here which can be found at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-qa-edition/\">https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-qa-edition/</a>\n\nClick below for a transcript:\n\n\nHello and welcome to the Q&A  episode I'm doing while I'm working on creating a backlog. I'm making good progress on that, and still hoping and expecting to have episode 151 up some time in early August, though I don't have an exact date yet.\n\nI was quite surprised by the response to my request for questions, both at the amount of it and at where it came from. I initially expected to get a fair few comments on the main podcast, and a handful on the Patreon, and then I could do a reasonable-length Q&A podcast from the former and a shorter one from the latter. Instead, I only got a couple of questions on the main episode, but so many on the Patreon that I had to stop people asking only a day or so after posting the request for questions.\n\nSo instead of doing one reasonable length podcast and one shorter one, I'm actually doing two longer ones.\n\nWhat I'm going to do is do all the questions asked publicly, plus all the questions that have been asked multiple times, in this one, then next week I'm going to put up the more niche questions just for Patreon backers.\n\nHowever, I'm not going to answer *all* of the questions. I got so many questions so quickly that there's not space to answer them all, and several of them were along the lines of \"is artist X going to get an episode?\" which is a question I generally don't answer -- though I will answer a couple of those if there's something interesting to say about them.\n\nBut also, there are some I've not answered for another reason. As you may have noticed, I have a somewhat odd worldview, and look at the world from a different angle from most people sometimes. Now there were several questions where someone asked something that seems like a perfectly reasonable question, but contains a whole lot of hidden assumptions that that person hadn't even considered -- about music history, or about the process of writing and researching, or something else.\n\nNow, to answer that kind of question at all often means unpacking those hidden assumptions, which can sometimes make for an interesting answer -- after all, a lot of the podcast so far has been me telling people that what they thought they knew about music history was wrong -- but when it's a question being asked by an individual and you answer that way, it can sometimes, frankly, make you look like a horribly unpleasant person, or even a bully. \"Don't you even know the most basic things about historical research? I do! You fool! Hey everyone else listening, this person thinks you do research in *this* way, but everyone knows you do it *that* way!\"\n\nNow, that is never how I would intend such answers to come across -- nobody can be blamed for not knowing what they don't know -- but there are some questions where no matter how I phrased the answer, it came across sounding like that. I'll try to hold those over for future Q&A episodes if I can think of ways of unpicking the answers in such a way that I'm not being unconscionably rude to people who were asking perfectly reasonable questions.\n\nSome of the answers that follow might still sound a bit like that to be honest, but if you asked a question and my answer sounds like that to you, please know that it wasn't meant to.\n\nThere's a lot to get through, so let's begin:\n\nSteve from Canada asks:\n\n“Which influential artist or group has been the most challenging to get information on in the last 50 podcasts? We know there has been a lot written about the Beatles, Beach Boys, Motown as an entity, the Monkees and the Rolling Stones, but you mentioned in a tweet that there’s very little about some bands like the Turtles, who are an interesting story. I had never heard of Dino Valenti before this broadcast – but he appeared a lot in the last batch – so it got me curious.\n\n[Excerpt: The Move, “Useless Information”]\n\nIn the last fifty episodes there's not been a single one that's made it to the podcast where it was at all difficult to get information. The problem with many of them is that there's *too much* information out there, rather than there not being enough. No matter how many books one reads on the Beatles, one can never read more than a fraction of them, and there's huge amounts of writing on the Rolling Stones, on Hendrix, on the Doors, on the Byrds... and when you're writing about those people, you *know* that you're going to miss out something or get something wrong, because there's one more book out there you haven't read which proves that one of the stories you're telling is false.\n\nThis is one of the reasons the episodes have got so much longer, and taken so much more time. That wasn't the case in the first hundred episodes -- there were a lot of artists I covered there, like Gene and Eunice, or the Chords, or Jesse Belvin, or Vince Taylor who there's very little information about. And there are some coming up who there's far less information about than people in the last fifty episodes. But every episode since the Beatles has had a surfeit of information.\n\nThere is one exception -- I wanted to do a full episode on \"Rescue Me\" by Fontella Bass, because it would be an interesting lens through which to look at how Chess coped with the change in Black musical styles in the sixties. But there was so little information available about her I ended up relegating it to a Patreon bonus episode, because she makes those earlier artists look well-documented. Which leads nicely into the next question.\n\nNora Tillman asks \"Forgive this question if you’ve answered it before: is there literally a list somewhere with 500 songs you’ve chosen? Has the list changed since you first composed it? Also, when did you first conceive of this list?\"\n\n[Excerpt: John Reed and the D'Oyly Carte Opera Company, \"As Someday it May Happen\"]\n\nMany people have asked this question, or variations upon it. The answer is yes and no. I made a list when I started that had roughly two hundred songs I knew needed to be on there, plus about the same number again of artists who needed to be covered but whose precise songs I hadn't decided on. To make the initial list I pulled a list out of my own head, and then I also checked a couple of other five-hundred-song lists -- the ones put out by Rolling Stone magazine and the Rock and Roll Hall of Fame -- not because I wanted to use their lists; I have very little time for rock critical orthodoxy, as most of my listeners will likely have realised by now, but because I wanted to double-check that I hadn't missed anything obvious out, and that if I was missing something off their lists, I knew *why* I was missing it. To take a ludicrous example, I wouldn't want to get to the end of the 1960s and have someone say \"Wait a minute, what about the Beatles?\" and think \"I *knew* I'd forgotten something!\"\n\nThen, at the start of each fifty-episode season, I put together a more rigorous list of the fifty songs coming up, in order. Those lists *can* still change with the research -- for example, very early on in the research for the podcast, I discovered that even though I was completely unfamiliar with \"Ko Ko Mo\" by Gene and Eunice, it was a hugely important and influential record at the time, and so I swapped that in for another song. Or more recently, I initially intended to have the Doors only have one episode, but when I realised how much I was having to include in that episode I decided to give them a second one.\n\nAnd sometimes things happen the other way -- I planned to do full episodes on Jackie Shane and Fontella Bass, but for both of them I couldn't find enough information to get a decent episode done, so they ended up being moved to Patreon episodes.\n\nBut generally speaking that fifty-song list for a year's episodes is going to remain largely unchanged. I know where I'm going, I know what most of the major beats of the story are, but I'm giving myself enough flexibility to deviate if I find something I need to include.\n\nConnected with this, Rob Johnson asks how I can be confident I'll get back to some stories in later episodes.\n\nWell, like I say, I have a pretty much absolute idea of what I'm going to do in the next year, and there are a lot of individual episodes where I know the structure of the episode long before we get to it. As an example here... I don't want to give too much away, and I'm generally not going to be answering questions about \"will artist X be appearing?\", but Rob also asked about one artist. I can tell you that that artist is one who will not be getting a full episode -- and I already said in the Patreon episode about that artist that they won't -- but as I also said in that episode they *will* get a significant amount of time in another episode, which I now know is going to be 180, which will also deal with another artist from the same state with the same forename, even though it's actually about two English bands.\n\nI've had the structure of that episode planned out since literally before I started writing episode one. On the other hand, episode 190 is a song that wasn't originally going to be included at all. I was going to do a 1967 song by the same artist, but then found out that a fact I'd been going to use was disputed, which meant that track didn't need to be covered, but the artist still did, to finish off a story I'd started in a previous episode.\n\nPatrick asks:\"I am currently in the middle of reading 1971: Never a Dull Moment by David Hepworth and I’m aware that Apple TV have produced a documentary on how music changed that year as well and I was wondering what your opinion on that subject matter? I imagine you will be going into some detail on future podcasts, but until recently I never knew people considered 1971 as a year that brought about those changes.\"\n\n[Excerpt: Rod Stewart, \"Angel\"]\n\nI've not yet read Hepworth's book, but that it's named after an album which came out in 1972 (which is the album that track we just heard came from) says something about how the idea that any one year can in itself be a turning point for music is a little overstated -- and the Apple documentary is based on Hepworth's book, so it's not really multiple people making that argument. Now, as it happens, 1971 is one of the break points for the podcast -- episodes 200 and 201 are both records from July 1971, and both records that one could argue were in their own way signifiers of turning points in rock music history. And as with 1967 it's going to have more than its fair share of records, as it bridges the gap of two seasons. But I think one could make similar arguments for many, many years, and 1971 is  not one of the most compelling cases. I can't say more before I read Hepworth's book, which won't be for a few months yet. I'm instinctively dubious of these \"this year was the big year that changed everything\" narratives, but Hepworth's a knowledgeable enough writer that I wouldn't want to dismiss his thesis without even reading the book.\n\nRoger Pannell asks\n\nI’m a fairly recent joiner-in too so you may have answered this before. What is the theme tune to the podcast please.\n\n[Excerpt: The Boswell Sisters, “Rock and Roll”]\n\nThe theme song to the podcast is \"Rock and Roll\" by the Boswell Sisters. The version I use is not actually the version that was released as a single, but a very similar performance that was used in the film Transatlantic Merry-Go-Round in 1931. I chose it in part because it may well be the first ever record to contain the phrase \"rock and roll\" (though as I've said many times there's no first anything, and there are certainly many records which talk about rocking and/or rolling -- just none I know of with that phrase) so it evokes rock and roll history, partly because the recording is out of copyright, and partly just because I like the Boswell Sisters.\n\nSeveral people asked questions along the lines of this one from Christopher Burnett\n\n\"Just curious if there's any future episodes planned on any non-UK or non-North American songs? The bonus episodes on the Mops and Kyu Sakamoto were fascinating.\"\n\n[Excerpt: Kyu Sakamoto, \"Sukiyaki\"]\n\nSadly, there won't be as many episodes on musicians from outside the UK and North America as I'd like. The focus of the podcast is going to be firmly on British, American, Irish, and Canadian musicians, with a handful from other Anglophone countries like Australia and Jamaica. There *are* going to be a small number of episodes on non-Anglophone musicians, but very few. Sadly, any work of history which engages with injustices still replicates some of those injustices, and one of the big injustices in rock history is that most rock musicians have been very insular, and there has been very little influence from outside the Anglophone world, which means that I can't talk much about influential records made by musicians from elsewhere.  Also, in a lot of cases most of the writing about them is in other languages, and I'm shamefully monolingual (I have enough schoolboy French not to embarrass myself, but not enough to read a biography without a dictionary to hand, and that's it).\n\nThere *will* be quite a few bonus episodes on musicians from non-Anglophone countries though, because this *is* something that I'm very aware of as a flaw, and if I can find ways of bringing the wider story into the podcast I will definitely do so, even if it means changing my plans somewhat, but I'm afraid they'll largely be confined to Patreon bonuses rather than mainline episodes.\n\nEd Cunard asks\n\n\"Is there a particular set of songs you're not looking forward to because you don't care for them, but intend to dive into due to their importance?\"\n\n[Excerpt: Jackie Shane, \"Don't Play That Song\"]\n\nThere are several, and there already have been some, but I'm not going to say what they are as part of anything to do with the podcast (sometimes I might talk about how much I hate a particular record on my personal Twitter account or something, but I try not to on the podcast's account, and I'm certainly not going to in an episode of the podcast itself). One of the things I try to do with the podcast is to put the case forward as to why records were important, why people liked them at the time, what they got out of them. I can't do that if I make it about my own personal tastes.\n\nI know for a fact that there are people who have come away from episodes on records I utterly despise saying \"Wow! I never liked that record before, but I do now!\" and that to me shows that I have succeeded -- I've widened people's appreciation for music they couldn't appreciate before.\n\nOf course, it's impossible to keep my own tastes from showing through totally, but even there people tend to notice much more my like or dislike for certain people rather than for their music, and I don't feel anything like as bad for showing that.\n\nSo I have a policy generally of just never saying which records in the list I actually like and which I hate. You'll often be able to tell from things I talk about elsewhere, but I don't want anyone to listen to an episode and be prejudiced not only against the artist but against the episode  by knowing going in that I dislike them, and I also don't want anyone to feel like their favourite band is being given short shrift. There are several records coming up that I dislike myself but where I know people are excited about hearing the episode, and the last thing I want to do is have those people who are currently excited go in disappointed before they even hear it.\n\nMatt Murch asks:\n\n\"Do you anticipate tackling the shift in rock toward harder, more seriously conceptual moves in 1969 into 1970, with acts like Led Zeppelin, The Who (again), Bowie, etc. or lighter soul/pop artists such as Donna Summer, Carly Simon or the Carpenters?\n\nAlso, without giving too much away, is there anything surprising you've found in your research that you're excited to cover?\n\n[Excerpt: Robert Plant, \"If I Were a Carpenter\"]\n\nOK, for the first question... I don't want to say exactly who will and won't be covered in future episodes, because when I say \"yes, X will be covered\" or \"no, Y will not be covered\", it invites a lot of follow-up discussion along the lines of \"why is X in there and not Y?\" and I end up having to explain my working, when the episodes themselves are basically me explaining my working.\n\nWhat I will say is this... the attitude I'm taking towards who gets included and who gets excluded is, at least in part, influenced by an idea in cognitive linguistics called prototype theory.\n\nAccording to this theory, categories aren't strictly bounded like in Aristotelian thought -- things don't have strict essences that mean they definitely are or aren't members of categories. But rather, categories have fuzzy boundaries, and there are things at the centre that are the most typical examples of the category, and things at the border that are less typical. For example, a robin is a very \"birdy\" bird -- it's very near the centre of the category of bird, it has a lot of birdness -- while an ostrich is still a bird, but much less birdy, it's sort of in the fuzzy boundary area. When you ask people to name a bird, they're more likely to name a robin than an ostrich, and if you ask them “is an ostrich a bird?” they take longer to answer than they do when asked about robins. In the same way, a sofa is nearer the centre of the category of \"furniture\" than a wardrobe is.\n\nNow, I am using an exceptionally wide definition of what counts as rock music, but at the same time, in order for it to be a history of rock music, I do have to spend more time in the centre of the concept than around the periphery. My definition would encompass all the artists you name, but I'm pretty sure that everyone would agree that the first three artists you name are much closer to the centre of the concept of \"rock music\" than the last three. That's not to say anyone on either list is definitely getting covered or is definitely *not* getting covered -- while I have to spend more time in the centre than the periphery, I do have to spend some time on the periphery, and my hope is to cover as many subgenres and styles as I can -- but that should give an idea of how I'm approaching this.\n\nAs for the second question -- there's relatively little that's surprising that I've uncovered in my research so far, but that's to be expected. The period from about 1965 through about 1975 is the most over-covered period of rock music history, and so the basic facts for almost every act are very, very well known to people with even a casual interest. For the stuff I'm doing in the next year or so, like the songs I've covered for the last year, it's unlikely that anything exciting will come up until very late in the research process, the times when I'm pulling everything together and notice one little detail that's out of place and pull on that thread and find the whole story unravelling.\n\nWhich may well mean, of course, that there *are* no such surprising things. That's always a possibility in periods where we're looking at things that have been dealt with a million times before, and this next year may largely be me telling stories that have already been told. Which is still of value, because I'm putting them into a larger context of the already-released episodes, but we'll see if anything truly surprising happens. I certainly hope it does.\n\nJames Kosmicki asks\n\n\"Google Podcasts doesn't seem to have any of the first 100 episodes - are they listed under a different name perhaps?\"\n\n[Excerpt: REM, \"Disappear\"]\n\nI get a number of questions like this, about various podcast apps and sites, and I'm afraid my answer is always the same -- there's nothing I can do about this, and it's something you'd have to take up with the site in question. Google Podcasts picks up episodes from the RSS feed I provide, the same as every other site or app. It's using the right feed, that feed has every episode in it, and other sites and apps are working OK with it.\n\nIn general, I suggest that rather than streaming sites like Google Podcasts or Stitcher or Spotify, where the site acts as a middleman and they serve the podcast to you from their servers, people should use a dedicated podcast app like RadioPublic or Pocketcasts or gPodder, where rather than going from a library of podcast episodes that some third party has stored, you're downloading the files direct from the original server, but I understand that sometimes those apps are more difficult to use, especially for less tech-savvy people.\n\nBut generally, if an episode is in some way faulty or missing on the 500songs.com webpage, that's something I can do something about. If it's showing up wrong on Spotify or Google Podcasts or Stitcher or whatever, that's a problem at their end. Sorry.\n\nDarren Johnson asks \"were there any songs that surprised you? Which one made the biggest change between what you thought you knew and what you learned researching it?\"\n\n[Excerpt: The Turtles, \"Goodbye Surprise\"]\n\nWell, there have been a few, in different ways. The most surprising thing for me actually was in the most recent episode when I discovered the true story behind the \"bigger than Jesus\" controversy during my reading. That was a story I'd known one way for my entire life -- literally I think I first read about that story when I was six or seven -- and it turned out that not one thing I'd read on the subject had explained what had really happened.\n\nBut then there are other things like the story of \"Ko Ko Mo\", which was a record I wasn't even planning on covering at first, but which turned out to be one of the most important records of the fifties.\n\nBut I actually get surprised relatively little by big-picture things. I'll often discover fun details or new connections between things I hadn't noticed before, but the basic outlines of the story never change that much -- I've been reading about music history literally since I learned how to read, and while I do a deep dive for each episode, it's very rare that I discover anything that totally changes my perspective.\n\nThere is always a process of reevaluation going on, and a change in the emphases in my thought, so for example when I started the project I knew Johnny Otis would come up a fair bit in the early years, and knew he was a major figure, but was still not giving him the full credit he deserved in my head. The same goes for Jesse Belvin, and as far as background figures go Lester Sill and Milt Gabler. But all of these were people I already knew were important, i just hadn't connected all the dots in my head. I've also come to appreciate some musicians more than I did previously. But there are very few really major surprises, which is probably to be expected -- I got into this already knowing a *LOT*, because otherwise I wouldn't have thought this was a project I could take on.\n\nTracey Germa -- and I'm sorry, I don't know if that's pronounced with a hard or soft G, so my apologies if I mispronounced it -- asks:\n\n\"Hi Andrew.\n\nWe love everything about the podcast, but are especially impressed with the way you couch your trigger warnings and how you embed social commentary into your analysis of the music. You have such a kind approach to understanding human experiences and at the same time you don’t balk at saying the hard things some folks don’t want to hear about their music heroes.\n\nSo, the question is - where does your social justice/equity/inclusion/suffer no fools side come from? Your family? Your own experiences? School/training?”\n\n[Excerpt: Elvis Costello and the Attractions, \"Little Triggers\"]\n\nWell, firstly, I have to say that people do say  this kind of thing to me quite a lot, and I'm grateful when they say it, but I never really feel comfortable with it, because frankly I think I do very close to the absolute minimum, and I get by because of the horribly low expectations our society has for allocishet white men, which means that making even the tiniest effort possible to be a decent human being looks far more impressive by comparison than it actually is. I genuinely think I don't do a very good job of this at all, although I do try, and that's not false modesty there.\n\nBut to accept the premise of the question for a moment, there are a couple of answers. My parents are both fairly progressive both politically and culturally,  for the time and place where they raised me. They both had strong political convictions, and while they didn't have access to much culture other than what was on TV or in charting records or what have you -- there was no bookshop or record shop in our town, and obviously no Internet back then -- they liked the stuff out of that mix that was forward-thinking, and so was anti-racist, accepting of queerness, and so on. From a very early age, I was listening to things like \"Glad to be Gay\" by the Tom Robinson Band. So from before I really even understood what those concepts were, I knew that the people I admired thought that homophobia and racism were bad things.\n\nI was also bullied a lot at school, because I was autistic and fat and wore glasses and a bunch of other reasons. So I hated bullying and never wanted to be a bully. I get very, very, *very* angry at cruelty and at abuses of power -- as almost all autistic people do, actually.\n\nAnd then, in my twenties and thirties, for a variety of reasons I ended up having a social circle that was predominantly queer and/or disabled and/or people with mental health difficulties. And when you're around people like that, and you don't want to be a bully, you learn to at least try to take their feelings into consideration, though I slipped up a great deal for a long time, and still don't get everything right.\n\nSo that's the \"social justice\" side of things. The other side, the \"understanding human experiences\" side... well, everyone has done awful things at times, and I would hope that none of us would be judged by our worst behaviours. \"Use every man to his desert and who should 'scape whipping?\" and all that. But that doesn't mean those worst behaviours aren't bad, and that they don't hurt people, and denying that only compounds the injustice.\n\nPeople are complicated, societies are complicated, and everyone is capable of great good and great evil. In general I tend to avoid a lot of the worst things the musicians I talk about did, because the podcast *is* about the music, but when their behaviour affects the music, or when I would otherwise be in danger of giving a truly inaccurate picture of someone, I have to talk about those things. You can't talk about Jerry Lee Lewis without talking about how his third marriage derailed his career, you can't talk about Sam Cooke without talking about his death, and to treat those subjects honestly you have to talk about the reprehensible sides of their character. Of course, in the case of someone like Lewis, there seems to be little *but* a reprehensible side, while someone like Cooke could be a horrible, horrible person, but even the people he hurt the most also loved him dearly because of his admirable qualities. You *have* to cover both aspects of someone like him if you want to be honest, and if you're not going to be honest why bother trying to do history at all?\n\nLester Dragstedt says (and I apologise if I mispronounced that): \"I absolutely love this podcast and the perspective you bring. My only niggle is that the sound samples are mixed so low. When listening to your commentary about a song at voice level my fingers are always at the volume knob to turn up when the song comes in.\"\n\n[Excerpt: Bjork, \"It's Oh So Quiet\"]\n\nThis is something that gets raised a lot, but it's not something that's ever going to change. When I started the podcast, I had the music levels higher, and got complaints about that, so I started mixing them lower. I then got complaints about *that*, so I did a poll of my Patreon backers to see what they thought, and by about a sixty-forty margin they wanted the levels to be lower, as they are now, rather than higher as they were earlier.\n\nBasically, there seem to be two groups of listeners. One group mostly listens with headphones, and doesn't like it when the music gets louder, because it hurts their ears. The other group mostly listens in their cars, and the music gets lost in the engine noise. That's a gross oversimplification, and there are headphone listeners who want the music louder and car listeners who want the music quieter, but the listenership does seem to split roughly that way, and there are slightly more headphone listeners.\n\nNow, it's literally *impossible* for me to please everyone, so I've given up trying with this, and it's *not* going to change. Partly because the majority of my backers voted one way, partly because it's just easier to leave things the way they are rather than mess with them given that no matter what I do someone will be unhappy, and partly because both Tilt when he edits the podcast and I when I listen back and tweak his edit are using headphones, and *we* don't want to hurt our ears either.\n\nEric Peterson asks \"if we are basically in 1967 that is when we start seeing Country artists like Johnny Cash and Waylon Jennings - the Man who Survived the Day the Music Died - start to bring more rock songs into their recordings and start to set the ground work in many ways for Country Rock ... how do you envision bringing the role they play in the History of Rock and Roll into the podcast?\"\n\n[Excerpt: The Del McCoury Band, \"Nashville Cats\"]\n\nI will of course be dealing with country rock as one of the subgenres I discuss -- though there's only one real country-rock track coming up in the next fifty, but there'll be more as I get into the seventies, and there are several artists coming up with at least some country influence. But I won't be looking at straight country musicians like Jennings or Cash except through the lens of rock musicians they inspired -- things like me talking about Johnny Cash briefly in the intro to the \"Hey Joe\" episode. I think Cocaine and Rhinestones is already doing a better job of covering country music than I ever could, and so those people will only touch the story tangentially.\n\nNili Marcia says:\n\n\"If one asks a person what's in that room it would not occur to one in 100 to mention the air that fills it. Something so ubiquitous as riff--I don't know what a riff actually is! Will you please define riff, preferably with examples.\"\n\nNow this is something I actually thought I'd explained way back in episode one, and I have a distinct memory of doing so, but I must have cut that part out -- maybe I recorded it so badly that part couldn't be salvaged, which happened sometimes in the early days -- because I just checked and there's no explanation there. I would have come back to this at some point if I hadn't been thinking all along that I'd covered it right at the start, because you're right, it is a term that needs definition.\n\nA riff is, simply, a repeated, prominent, instrumental figure. The term started out in jazz, and there it was a term for a phrase that would be passed back and forth between different instruments -- a trumpet might play a phrase, then a saxophone copy it, then back to the trumpet, then back to the saxophone. But quickly it became a term for a repeated figure that becomes the main accompaniment part of a song, over which an instrumentalist might solo or a singer might sing, but which you remember in its own right. A few examples of well-known riffs might include \"Smoke on the Water\" by Deep Purple:\n\n[Excerpt: Deep Purple, \"Smoke on the Water\"]\n\n\"I Feel Fine\" by the Beatles:\n\n[Excerpt: The Beatles, \"I Feel Fine\"]\n\n\"Last Train to Clarksville\" by the Monkees:\n\n[Excerpt: The Monkees, \"Last Train to Clarksville\"]\n\nThe bass part in “Under Pressure” by Queen and David Bowie:\n\n[Excerpt: Queen and David Bowie, “Under Pressure”]\n\nOr the Kingsmen's version of \"Louie Louie\":\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nBasically, if you can think of a very short, prominent, instrumental idea that gets repeated over and over, that's a riff.\n\nErik Pedersen says \"I love the long episodes and I suspect you do too -- thoroughness. of this kind is something few get the opportunity to do -- but have you ever, after having written a long one, decided to cut them significantly? Are there audio outtakes you might string together one day?\"\n\n[Excerpt: Bing Crosby and Les Paul, \"It's Been a Long, Long Time\"]\n\nI do like *having* done the long episodes, and sometimes I enjoy doing them, but other times I find it frustrating that an episode takes so long, because there are other stories I want to move on to. I'm trying for more of a balance over the next year, and we'll see how that works out. I want to tell the story in the depth it deserves, and the longer episodes allow me to do that, and to experiment with narrative styles and so on, but I also want to get the podcast finished before I die of old age.\n\nAlmost every episode has stuff that gets cut, but it's usually in the writing or recording stage -- I'll realise a bit of the episode is boring and just skip it while I'm recording, or I'll cut out an anecdote or something because it looks like it's going to be a flabby episode and I want to tighten it up, or sometimes I'll realise that because of my mild speech impediments a sentence is literally unspeakable, and I'll rework it. It's very, very rare that I'll cut anything once it's been recorded, and if I do it's generally because when I listen back after it's been edited I'll realise I'm repeating myself or I made a mistake and need to cut a sentence because I said the wrong name, that sort of thing.\n\nI delete all the audio outtakes, but even if I didn't there would be nothing worth releasing. A few odd, out of context sentences, the occasional paragraph just repeating something I'd already said, a handful of actual incorrect facts, and a lot of me burping, or trying to say a difficult name three times in a row, or swearing when the phone rings in the middle of a long section.\n\nLucy Hewitt says \"Something that interests me, and that I’m sure you will cover is how listeners consume music and if that has an impact. In my lifetime we’ve moved from a record player which is fixed in one room to having a music collection with you wherever you go, and from hoping that the song you want to hear might be played on the radio to calling it up whenever you want. Add in the rise of music videos, and MTV, and the way in which people access music has changed a lot over the decades. But has that affected the music itself?\"\n\n[Excerpt: Bow Wow Wow \"C30 C60 C90 Go!\"]\n\nIt absolutely has affected the music itself in all sorts of ways, some of which I've touched on already and some of which I will deal with as we go through the story, though the story I'm telling will end around the time of Napster and so won't involve streaming services and so forth.\n\nBut every technology change leads to a change in the sound of music in both obvious and non-obvious ways. When AM radio was the most dominant form of broadcasting, there was no point releasing singles in stereo, because at that time there were no stereo AM stations. The records also had to be very compressed, so the sound would cut through the noise and interference. Those records would often be very bass-heavy and have a very full, packed, sound. In the seventies, with the rise of eight-track players, you'd often end up with soft-rock and what would later get termed yacht rock having huge success. That music, which is very ethereal and full of high frequencies, is affected less negatively by some of the problems that came with eight-track players, like the tape stretching slightly.\n\nThen post-1974 and the OPEC oil crisis, vinyl became more expensive, which meant that records started being made much thinner, which meant you couldn't cut grooves as deeply, which meant you lost bass response, which again changed the sound of records – and also explains why when CDs came out, people started thinking they sounded better than records, because they *did* sound better than the stuff that was being pressed in the late seventies and early eighties, which was so thin it was almost transparent, even though they sounded nowhere near as good as the heavy vinyl pressings of the fifties and sixties. And then the amount of music one could pack into a CD encouraged longer tracks...\n\nA lot of eighties Hi-NRG and dance-pop music, like the records made by Stock, Aitken, and Waterman, has almost no bass but lots of skittering high-end percussion sounds -- tons of synthesised sleighbells and hi-hats and so on -- because a lot of disco equipment had frequency-activated lights, and the more high-end stuff was going on, the more the disco lights flashed...\n\nWe'll look at a lot of these changes as we go along, but every single new format, every new way of playing an old format, every change in music technology, changes what music gets made quite dramatically.\n\nLucas Hubert asks:\n\n“Black Sabbath being around the corner, how do you plan on dealing with Heavy Metal?\n\nI feel like for now, what is popular and what has had a big impact in Rock history coincide. But that kind of change with metal, no? (Plus, prog and metal are more based on albums than singles, I think.)”\n\n[Excerpt: Black Sabbath, “Sabbath Bloody Sabbath”]\n\nI plan on dealing with metal the same way I've been dealing with every other subgenre. We are, yes, getting into a period where influence and commercial success don't correlate quite as firmly as they did in the early years -- though really we've already been there for quite some time. I've done two episodes so far on the Byrds, a group who only had three top-twenty singles in the US and two in the UK, but only did a bonus episode on Herman's Hermits, who had fourteen in the US and seventeen in the UK. I covered Little Richard but didn't cover Pat Boone, even though Boone had the bigger hits with Richard's songs.\n\nIn every subgenre there are going to be massive influences who had no hits, and people who had lots of hits but didn't really make much of a wider impact on music, and I'll be dealing with the former more than the latter. But also, I'll be dealing most with people who were influential *and* had lots of hits -- if nothing else because while influence and chart success aren't a one-to-one correlation, they're still somewhat correlated.\n\nSo it's unlikely you'll see me cover your favourite Scandinavian Black Metal band who only released one album of which every copy was burned in a mysterious fire two days after release, but you can expect most of the huge names in metal to be covered. Though even there, simply because of the number of subgenres I'm going to cover, I'm going to miss some big ones.\n\nRelated to the question about albums, Svennie asks “This might be a bit of a long winded question so just stick with me here. As the music you cover becomes more elaborate, and the albums become bigger in scale, how do you choose a song which you build the story around while also telling the story of that album? I ask this specifically with the White Album in mind, where you’ve essentially got four albums in one. To that end, what song would you feel defines the White Album?”\n\n[Excerpt: The Beatles, “Revolution #9”]\n\nWell, you'll see how I cover the White Album in episode one hundred and seventy-two -- we're actually going to have quite a long stretch with no Beatles songs covered because I'm going to backfill a lot of 1967 and then we're getting to the Beatles again towards the end of 1968, but it'll be another big one when we get there. But in the general case... the majority of albums to come still had singles released off them, and a lot of what I'm going to be looking at in the next year or two is still hit singles, even if the singles are by people known as album bands.\n\nOther times, a song wasn't a single, but maybe it was covered by someone else -- if I know I'm going to cover a rock band and I also know that one of the soul artists who would do rock covers as album tracks did a version of one of their songs, and I'm going to cover that soul artist, say, then if I do the song that artist covered I can mention it in the episode on the soul singer and tie the two episodes together a bit. In other cases there's a story behind a particular track that's more interesting than other tracks, or the track is itself a cover version of someone else's record, which lets me cover both artists in a single episode, or it's the title track of the album.\n\nA lot of people have asked me this question about how I'd deal with albums as we get to the late sixties and early seventies, but looking at the list of the next fifty episodes, there's actually only two where I had to think seriously about which song I chose from an album -- in one case, I chose the title track, in the other case I just chose the first song on the album (though in that case I may end up choosing another song from the same album if I end up finding a way to make that a more interesting episode). The other forty-eight were all very, very obvious choices.\n\nGary Lucy asks\n\n“Do you keep up with contemporary music at all? If so, what have you been enjoying in 2022 so far…and if not, what was the most recent “new” album you really got into?”\n\n[Excerpt: Stew and the Negro Problem, \"On the Stage of a Blank White Page\"]\n\nI'm afraid I don't. Since I started doing the podcast, pretty much all of my listening time has been spent on going back to much older music, and even before that, when I was listening to then-new music it was generally stuff that was very much inspired by older music, bands like the Lemon Twigs, who probably count as the last new band I really got into with their album Do Hollywood, which came out in 2016 but which I think I heard in 2018.\n\nI'm also now of that age where 2018 seems like basically yesterday, and when I keep thinking \"what relatively recent albums have I liked?\" I think of things like The Reluctant Graveyard by Jeremy Messersmith, which is from 2010, or Ys by Joanna Newsom, which came out in 2006. Not because I haven't bought records released since then, but because my sense of time is so skewed that summer 1994 and summer 1995 feel like epochs apart, hugely different times in every way, but every time from about 2005 to 2020 is just \"er... a couple of years ago? Maybe?\" So without going through every record I've bought in the last twenty years and looking at the release date I couldn't tell you what still counts as contemporary and what's old enough to vote. I have recently listened a couple of times to an album by a band called Wet Leg, who are fairly new, but other than that I can't say.\n\nBut probably the most recent albums to become part of my regular listening rotation are two albums which came out simultaneously in 2018 by Stew and the Negro Problem, Notes of a Native Song, which is a song cycle about James Baldwin and race in America, and The Total Bent, which is actually the soundtrack to a stage musical, and which I think many listeners to the podcast might find interesting, and which is what that last song excerpt was taken from. It's basically a riff on the idea of The Jazz Singer, but set in the Civil Rights era, and about a young politically-radical Black Gospel songwriter who writes songs for his conservative preacher father to sing, but who gets persuaded to become a rock and roll performer by a white British record producer who fetishises Black music. It has a *lot* to say about religion, race, and politics in America -- a couple of the song titles, to give you some idea, are \"Jesus Ain't Sitting in the Back of the Bus\" and \"That's Why He's Jesus and You're Not, Whitey\".\n\nIt's a remarkable album, and it deals with enough of the same subjects I've covered here that I think any listeners will find it interesting. Unfortunately, it was released through the CDBaby store, which closed down a few months later, and unlike most albums released through there it doesn't seem to have made its way onto any of the streaming platforms or digital stores other than Apple Music, which rather limits its availability. I hope it comes out again soon.\n\nAlec Dann says “I haven't made it to the Sixties yet so pardon if you have covered this: what was the relationship between Sun and Stax in their heyday? Did musicians work in both studios?”\n\n[Excerpt: Booker T. and the MGs, \"Green Onions\"]\n\nI've covered this briefly in a couple of the episodes on Stax, but the short version is that Sun was declining just as Stax was picking up. Jim Stewart, who founded Stax, was inspired in part by Sam Phillips, and there was a certain amount of cross-fertilisation, but not that much. Obviously Rufus Thomas recorded for both labels, and there were a few other connections -- Billy Lee Riley, for example, who I did an episode on for his Sun work, also recorded at the Stax studio before going on to be a studio musician in LA, and it was actually at a Billy Lee Riley session that went badly that Booker T and the MGs recorded \"Green Onions\". Also, Sun had a disc-cutting machine and Stax didn't, so when they wanted to get an acetate cut to play for DJs they'd take it to Sun -- it was actually Scotty Moore, who was working for Sun as a general engineer and producer as well as playing RCA Elvis sessions by 1962, who cut the first acetate copy of \"Green Onions\".\n\nBut in general the musicians playing at Stax were largely the next generation of musicians -- people who'd grown up listening to the records Sam Phillips had put out in the very early fifties by Black musicians, and with very little overlap.\n\nRoger Stevenson asks \"This project is going to take the best part of 7 years to complete. Do you have contingency plans in case of major problems? And please look after yourself - this project is gong to be your legacy.\"\n\n[Excerpt: Bonzo Dog Doodah Band, \"Button Up Your Overcoat\"]\n\nI'm afraid there's not much I can do if major problems come up -- by major problems I'm talking about things that prevent me from making the podcast altogether, like being unable to think or write or talk. By its nature, the podcast is my writing and my research and my voice, and if I can't do those things... well, I can't do them. I *am* trying to build in some slack again -- that's why this month off has happened -- so I can deal with delays and short-term illnesses and other disruptions, but if it becomes impossible to do it becomes impossible to do, and there's nothing more I can do about it.\n\nMark Lipson asks \"I’d like to know which episodes you’ve released have been the most & least popular? And going forward, which episodes do you expect to be the most popular?\n\nJust curious to know what music most of your listeners listen to and are interested in.\"\n\n[Excerpt: Sly and the Family Stone, \"Somebody's Watching You\"]\n\nI'm afraid I honestly don't know. Most podcasters have extensive statistical tools available to them, which tell them which episodes are most popular, what demographics are listening to the podcast, where they are in the world, and all that kind of thing. They use that information to sell advertising spots, which is how they make most of their money. You can say \"my podcast is mostly listened to by seventy-five year-olds who google for back pain relief -- the perfect demographic for your orthopedic mattresses\" or \"seven thousand people who downloaded my latest episode also fell for at least one email claiming to be from the wallet inspector last year, so my podcast is listened to by the ideal demographic for cryptocurrency investment\".\n\nNow, I'm lucky enough to be making enough money from my Patreon supporters' generosity that I don't have to sell advertising, and I hope I never do have to. I said at the very start of the process that I would if it became necessary, but that I hoped to keep it ad-free, and people have frankly been so astonishingly generous I should never have to do ads -- though I do still reserve the right to change my mind if the support drops off.\n\nNow, my old podcast host gave me access to that data as standard. But when I had to quickly change providers, I decided that I wasn't going to install any stats packages to keep track of people. I can see a small amount of information about who actually visits the website, because wordpress.com gives you that information – not your identities but just how many people come from which countries, and what sites linked them. But if you're downloading the podcast through a podcast app, or listening through Spotify or Stitcher or wherever, I've deliberately chosen not to access that data. I don't need to know who my audience is, or which episodes they like the most -- and if I did, I have a horrible feeling I'd start trying to tailor the podcast to be more like what the existing listeners like, and by doing so lose the very things that make it unique.\n\nOnce or twice a month I'll look at the major podcast charts, I check the Patreon every so often to see if there's been a massive change in subscriber numbers, but other than that I decided I'm just not going to spy on my listeners (though pretty much every other link in the chain does, I'm afraid, because these days the entire Internet is based on spying on people).\n\nSo the only information I have is the auto-generated \"most popular episodes\" thing that comes up on the front page, which everyone can see, and which shows the episodes people who actually visit the site are listening to most in the last few days, but which doesn't count anything from more than a few days ago, and which doesn't count listens from any other source, and which I put there basically so new listeners can see which ones are popular. At the moment that's showing that the most listened episodes recently are the two most recent full episodes -- \"Respect\" and \"All You Need is Love\" -- the most recent of the Pledge Week episodes, episodes one and two, so people are starting at the beginning, and right now there's also the episodes on \"Ooby Dooby\", \"Needles and Pins\", \"God Only Knows\", \"She Loves You\" and \"Hey Joe\". But in a couple of days' time those last five will be totally different.\n\nAnd again, that's just the information from people actually visiting the podcast website. I've deliberately chosen not to know what people listening in any other way are doing -- so if you've decided to just stream that bit of the Four Tops episode where I do a bad Bob Dylan impression five thousand times in a row, you can rest assured I have no idea you're doing it and your secret is totally safe.\n\nAnyway, that's all I have time for in this episode. In a week or so I'll post a similar-length episode for Patreon backers only, and then a week or two after that the regular podcast will resume, with a story involving folk singers, jazz harmony, angelic visitations and the ghost of James Dean. See you then.",
  "enclosure": "",
  "itunes:summary": "While I'm still on hiatus, I invited questions from listeners. This is an hour-long podcast answering some of them. (Another hour-long Q&A for Patreon backers only will go up next week).\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nThere is a Mixcloud of the music excerpted here which can be found at https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-qa-edition/\n\nClick below for a transcript:\n\n\nHello and welcome to the Q&A  episode I'm doing while I'm working on creating a backlog. I'm making good progress on that, and still hoping and expecting to have episode 151 up some time in early August, though I don't have an exact date yet.\n\nI was quite surprised by the response to my request for questions, both at the amount of it and at where it came from. I initially expected to get a fair few comments on the main podcast, and a handful on the Patreon, and then I could do a reasonable-length Q&A podcast from the former and a shorter one from the latter. Instead, I only got a couple of questions on the main episode, but so many on the Patreon that I had to stop people asking only a day or so after posting the request for questions.\n\nSo instead of doing one reasonable length podcast and one shorter one, I'm actually doing two longer ones.\n\nWhat I'm going to do is do all the questions asked publicly, plus all the questions that have been asked multiple times, in this one, then next week I'm going to put up the more niche questions just for Patreon backers.\n\nHowever, I'm not going to answer *all* of the questions. I got so many questions so quickly that there's not space to answer them all, and several of them were along the lines of \"is artist X going to get an episode?\" which is a question I generally don't answer -- though I will answer a couple of those if there's something interesting to say about them.\n\nBut also, there are some I've not answered for another reason. As you may have noticed, I have a somewhat odd worldview, and look at the world from a different angle from most people sometimes. Now there were several questions where someone asked something that seems like a perfectly reasonable question, but contains a whole lot of hidden assumptions that that person hadn't even considered -- about music history, or about the process of writing and researching, or something else.\n\nNow, to answer that kind of question at all often means unpacking those hidden assumptions, which can sometimes make for an interesting answer -- after all, a lot of the podcast so far has been me telling people that what they thought they knew about music history was wrong -- but when it's a question being asked by an individual and you answer that way, it can sometimes, frankly, make you look like a horribly unpleasant person, or even a bully. \"Don't you even know the most basic things about historical research? I do! You fool! Hey everyone else listening, this person thinks you do research in *this* way, but everyone knows you do it *that* way!\"\n\nNow, that is never how I would intend such answers to come across -- nobody can be blamed for not knowing what they don't know -- but there are some questions where no matter how I phrased the answer, it came across sounding like that. I'll try to hold those over for future Q&A episodes if I can think of ways of unpicking the answers in such a way that I'm not being unconscionably rude to people who were asking perfectly reasonable questions.\n\nSome of the answers that follow might still sound a bit like that to be honest, but if you asked a question and my answer sounds like that to you, please know that it wasn't meant to.\n\nThere's a lot to get through, so let's begin:\n\nSteve from Canada asks:\n\n“Which influential artist or group has been the most challenging to get information on in the last 50 podcasts? We ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "While I'm still on hiatus, I invited questions from listeners. This is an hour-long podcast answering some of them. (Another hour-long Q&A for Patreon backers only will go up next week).\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nThere is a Mixcloud of the music excerpted here which can be found at https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-qa-edition/\n\nClick below for a transcript:\n\n\nHello and welcome to the Q&A  episode I'm doing while I'm working on creating a backlog. I'm making good progress on that, and still hoping and expecting to have episode 151 up some time in early August, though I don't have an exact date yet.\n\nI was quite surprised by the response to my request for questions, both at the amount of it and at where it came from. I initially expected to get a fair few comm",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}