{
  "title": "S13 Ep121: Spirits Speak to Extraterrestrials",
  "link": "https://audioboom.com/posts/8098654",
  "itunes:episode": 121,
  "itunes:title": "Spirits Speak to Extraterrestrials",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6742,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Author/Talking Board Specialist Barry Strohm specialist joins BEYOND the  DARKNESS to talk about his latest book, and adventures with his talking board!  Barry has transcended talking to his civil war battalion buddies from a past life, and even Saints, religious figures, political figures, and famous people, and has reached out to the furthest edges of our galaxy and made contact with life from other planets!  Barry talks Barry talks about his friend, Mou, the mysteries of the universe, and how he knows all this information is REAL! <br>\n<br>\nBarry Strohm's Website:  <a href=\"http://www.spiritspredict.com/\">http://www.spiritspredict.com/</a><br>\n<br>\nSupport our sponsors for Great Deals!<br>\n<br>\n<a href=\"http://www.UnTuckit.com\">www.UnTuckit.com</a> use Promo Code: Darkness to save 20% on your first order<br>\n<br>\nSign up now with <a href=\"http://Pluto.tv\">Pluto.tv</a> for the leader in FREE Streaming Television, over 100 free TV channels & 1000's of of free movies On Demand <a href=\"http://www.Pluto.tv\">www.Pluto.tv</a><br>\n<br>\nLadies, the future of at-home hair color is here with Madison Reed - Gorgeous salon-quality hair color delivered right to your door for less than $25!<br>\nFind your perfect shade at <a href=\"http://www.Madison-Reed.com\">www.Madison-Reed.com</a> & get 10% off plus free shipping with code: DARKNESS at checkout<br>\n<br>\nGo to <a href=\"http://bombas.com\">bombas.com</a> that’s B-O-M-B-A-S dot com and you’ll get 20% off your first order.  <a href=\"http://BOMBAS.COM/\">BOMBAS.COM/</a> DARKNESS and code: DARKNESS",
  "itunes:summary": "Author/Talking Board Specialist Barry Strohm specialist joins BEYOND the  DARKNESS to talk about his latest book, and adventures with his talking board!  Barry has transcended talking to his civil war battalion buddies from a past life,...",
  "pubDate": "Sun, 07 Oct 2018 08:00:00 +0000",
  "guid": "4d1fe035-c305-42d9-85f3-c4422d56ac3e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}