{
  "title": "Electric Play-Doh Is Mysterious Conductor",
  "link": "https://spectrum.ieee.org/conductive-polymers",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-black-disc-with-gold-nodes-on-the-corners-against-a-gray-background.jpg?id=32045677&width=1200&height=800&coordinates=0%2C240%2C0%2C240\"/><br/><br/><p>\"Electrically conductive Play-Doh\" is how scientists describe new materials they can make like plastic but conduct like metal. It remains a mystery why they conduct electricity so well, since their doing so flies in the face of much of what is known about conductivity. Indeed, the stretchy conductor's surprising capabilities may open up new directions and technological applications in electronics, researchers say.<br/></p><p>The largest group of conductors are metals such as copper, gold and aluminum. Then, about 50 years ago, <u><a href=\"https://en.wikipedia.org/wiki/Conductive_polymer\" target=\"_blank\">conductive organic polymers</a></u> such as <u><a href=\"https://en.wikipedia.org/wiki/Polyacetylene\" rel=\"noopener noreferrer\" target=\"_blank\">polyacetylene</a></u> entered the scene that proved more flexible and easier to process than metals. However, conductive organic polymers are less stable than metals, typically losing their conductivity if exposed to moisture or too much heat.</p><p>The electrical conductivity of both metals and conductive organic polymers depend on straight, closely packed rows of atoms or molecules through which electrons can easily flow, much like cars on a highway. Scientists had thought a material had to have these orderly rows to conduct electricity well.</p><p>Now, in a new study, chemists reveal they have unexpectedly developed new materials that are conductors even though they possess disorderly structures. \"The exact reason for the high conductivity of the materials is still a mystery,\" says study senior author John Anderson, a chemist at the University of Chicago.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"boxes of different intensity of lights\" class=\"rm-shortcode\" data-rm-shortcode-id=\"2b697a47f475e45c7b54bf5ca08324fc\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"6fb97\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/boxes-of-different-intensity-of-lights.jpg?id=32045704&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The brightness of yellow LED bulbs while they touch different conductive materials. Left to right: a pellet of the conductive organic polymer PEDOT:PSS; a NiTTFtt pellet; a NiTTFtt pellet with gold nodes; a copper plate.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Frank Wegloski</small></p><p>The scientists experimented with polymers made using an electron-rich sulfur-based molecule named tetrathiafulvalene tetrathiolate (TTFtt). Much remained uncertain about these materials because they were difficult to synthesize. Recently, the researchers developed new techniques for synthesizing these polymers and began exploring their properties.</p><p>The polymer the scientists created was consisted of molecular chains of nickel atoms and TTFtt arranged together like pearls in a necklace. The resulting material \"is a powder, which we can press into a pellet,\" Anderson says. The powder is \"basically black,\" but \"when it's pressed into a pellet or smoothed out, it's shiny and iridescent, a bit like a metal.\"</p><p>The researchers found the new material has an electrical conductivity of 120,000 <a href=\"https://en.wikipedia.org/wiki/Siemens_(unit)\" target=\"_blank\">siemens per meter</a> at room temperature. This makes it nearly as <u><a href=\"https://en.wikipedia.org/wiki/Electrical_resistivity_and_conductivity#Resistivity_and_conductivity_of_various_materials\" rel=\"noopener noreferrer\" target=\"_blank\">conductive</a></u> as graphite. Moreover, its maximum conductivity may actually be roughly three times greater, Anderson says.</p><p>Moreover, the material proved very stable, keeping electrically conductive even when exposed to air, humidity, acids, and bases ranging in pH from 0 to 14, and temperatures up to 140 degrees C. \"We think this could be really important for applications, and also processability,\" Anderson says.</p><p>The researchers suspect the high conductivity of this material results from how it forms layers, much like sheets in lasagna. Even if the sheets no longer form an orderly stack, electrons can still flow in them as long as the sheets overlap. The result is a material that can get mashed like clay yet still conduct electricity.</p><p>Given how fundamentally important conductors are to electronics, the scientists expect a new kind of conductor may open up new technological applications. For example, metals usually have to be melted in order to be made into the right shape for a device, which limits what one can make with them, since other components of the device have to be able to withstand the heat to process those materials. In comparison, the new material can be made at room temperatures. In addition, the new conductor may prove robust in everyday conditions where conductive organic polymers may fail.</p><p>Currently, \"we're particularly interested in developing paintable or sprayable conducting inks for different applications,\" Anderson says. In addition, \"the pellets are brittle, but we're looking into making thin films now, which we might be able to put down onto flexible substrates.\"</p><p>In the future, the researchers seek to investigate similar polymers. For example, they may replace nickel with other metals such as copper, cobalt, palladium or platinum, or TTFtt with other sulfur-based molecules, Anderson says. \"It's a really exciting area,\" Anderson notes.</p><p>The scientists detailed <u><a href=\"https://www.nature.com/articles/s41586-022-05261-4\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> 26 October in the journal <em>Nature</em>.</p>",
  "pubDate": "Sat, 05 Nov 2022 13:00:00 +0000",
  "guid": "https://spectrum.ieee.org/conductive-polymers",
  "category": [
    "Pedot",
    "Conductive polymers",
    "Conductor"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}