{
  "id": "yt:video:wrTDJbaxhOI",
  "yt:videoId": "wrTDJbaxhOI",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Brick Firing Kiln",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2019-11-29T21:14:20+00:00",
  "updated": "2022-04-08T16:06:35+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Brick Firing Kiln",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Primitive Technology: Brick Firing Kiln – building a brink firing kiln from scratch.\nSubscribe: http://bit.ly/subPT | Never miss a video, enable ‘ALL’ notifications.\nWatch my 4 year anniversary video: https://youtube.com/watch?v=-cgQUrdBoaM&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nBuy my book here: https://penguin.com.au/books/primitive-technology-9781529105834\nor here: http://hyperurl.co/PrimitiveTechnology\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n \nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI built a kiln from bricks for the purpose of firing bricks. I started by using a brick mold made of fired clay from a previous video and made bricks from clay. The bricks were allowed to dry and were then transported to my hut using a brick carrying harness I made from cane and a piece of wood. They were dry stacked onto the wall of the hut to keep them out of the rain while waiting to be fired. I then constructed a brick kiln using mud as a mortar for adhering the bricks together. The kiln had 2 fireboxes side by side and was of the updraft kiln type. The kiln was open at the front and back so it could be stoked from these areas. This gave a more consistent firing I found then a kiln only with firebox opening at the front. I put 40 un-fired bricks into the kiln and fired them for 2 hours 30 minutes. All the bricks were fired sufficiently. I then tested an un-fired brick and a fired one by putting them in water. The un-fired brick dissolved quickly while the fired one survived completely intact. The test was a success. My only issue is the bricks are a little weak due to the clay they're made of. I'll look at refining clay or finding a better source somewhere in this area. \n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}