{
  "guid": "prx_137_9a8a0120-9e98-4dff-9f02-281400da7ff5",
  "title": "714 - Ice Cream Barons | Stan Chronicles 11",
  "pubDate": "Wed, 24 Oct 2018 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/257832",
  "description": "<p>Can Stan and Scoots put the cloud back in place or is it time to accept a world without clouds?<br>\n<br>\n(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 17:00)</p>\n\n<p><br>\nSubscribe to “Adventures in New America”<br>\n- Adventures in New America, a brand new fiction podcast from Night Vale Presents, is the first sci-fi, political satire, Afrofuturistic buddy comedy, serialized for New Americans in a new and desperate time.</p>\n\n<ul>\n<li><p>Set a few years in the future, Adventures in New America follows two mismatched African-New-American best friends as they take on a series of increasingly wild heists to get quick cash to pay for medical treatment.</p></li>\n<li><p>The New York Times calls it \"sympatico with Boots Riley’s ‘Sorry to Bother You’ in its critique of entwined capitalist and racist structures, and [says] the way it makes the horrific funny recalls the new era of social thriller being ushered in by Jordan Peele.\"</p></li>\n<li><p>Tune in for radical reflections on our dangerous, beautiful and heart-pounded world.-Find out more at <a href=\"http://www.adventuresinnewamerica.com\" rel=\"nofollow\" target=\"_blank\">http://www.adventuresinnewamerica.com</a>, or search for the show in your favorite podcast app.</p></li>\n</ul>\n\n<p><br>\nTonight’s show is sponsored by <a href=\"http://www.getquip.com/sleep\" rel=\"nofollow\" target=\"_blank\">Quip</a>! The sensitive sonic toothbrush I have been using for over two years (not over and over! Changing out the brush heads every three months!) <strong>Quip starts at just $25 and if you go to <a href=\"http://www.getquip.com/sleep\" rel=\"nofollow\" target=\"_blank\">http://www.getquip.com/sleep</a>, you get your first refill pack for FREE with a quip electric toothbrush.</strong></p>",
  "enclosure": "",
  "itunes:title": "Ice Cream Barons | Stan Chronicles 11",
  "itunes:subtitle": "Can Stan and Scoots put the cloud back in place or is it time to accept a world without clouds?",
  "itunes:episodeType": "full",
  "itunes:episode": 714,
  "itunes:duration": "01:07:00"
}