{
  "title": "S15 Ep24: A Song of Dance and Death: Magic, Murder, Mayhem",
  "link": "https://audioboom.com/posts/8098499",
  "itunes:episode": 24,
  "itunes:title": "A Song of Dance and Death: Magic, Murder, Mayhem",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6071,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio tunes in A Song of Dance and Death: Magic, Murder, Mayhem and the Diabolical Notes of the Devil's Music with guest Troy Taylor.<br>\n<br>\nAuthor Troy Taylor offers up a strange array of frightening tales from the annals of American music, from the tragic deaths of rock icons to curses, murders, and brushes with the supernatural. Today he guides us into the way that the occult, magic, and the paranormal have shaped the history of rock-n-roll and the part that they've all played in its popularity. We will uncover some of rock-n-roll's most horrific murders, and infamous and little-known twists of fate, like the Buddy Holly Curse, the Curse of the Grand Ole Opry, the 27 Club and others.<br>\n<br>\nVisit his site here: <a href=\"https://www.americanhauntingsink.com/\">https://www.americanhauntingsink.com/</a><br>\n<br>\nGet the book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping. <br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nStart listening with a 30-day Audible trial. Choose 1 audiobook and 2 Audible Originals<br>\nabsolutely free. Visit <a href=\"http://audible.com/btd\">audible.com/btd</a> or text btd to 500-500<br>\n<br>\nGet 3 weeks of EveryPlate meals for only $2.99 per meal by going to <a href=\"http://EveryPlate.com\">EveryPlate.com</a> and entering code beyond3",
  "itunes:summary": "Darkness Radio tunes in A Song of Dance and Death: Magic, Murder, Mayhem and the Diabolical Notes of the Devil's Music with guest Troy Taylor.\n\nAuthor Troy Taylor offers up a strange array of frightening tales from the annals of American...",
  "pubDate": "Sun, 22 Mar 2020 08:00:00 +0000",
  "guid": "d5122a76-b999-4425-9b63-6d37c5c55cde",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}