{
  "title": "S1E55 - Creating Opportunity with 8 Time Olympic Medalist Coach Jane Figueiredo",
  "guid": "https://pinecast.com/guid/86eb5538-5a14-4981-b8f9-9c945a47cfef",
  "pubDate": "Thu, 03 Mar 2022 07:30:00 -0000",
  "description": "<p>On today’s episode, Jane Figueiredo joins Laura Wilkinson to discuss her long standing career as a one-time Olympian and diving coach for the British and Russian Olympic teams and the University of Houston. Among her many accomplishments, Jane was named the NCAA Diving Coach of the Year four times and has coached a number of international divers, including multiple divers, including Tom Daley, to Olympic medals.</p>\n<p>She opens the episode by recounting how she made the leap from her home in South Africa and Zimbabwe to Houston, as well as her experience of becoming a diving Olympian for team Portugal before becoming a coach.  Jane goes on to discuss her coaching career, attributing much of her success in this field to being in the right place at the right time. She also highlights what she learned by working with the Russian Olympic Diving Team, and also by working with Tom Daley. Taking a note from Laura’s book, Jane notes that she has started valuing the importance of mental preparedness more, and encouraging her athletes to focus less on medals, and more on striving to be the best they can. This fascinating interview draws to close with Jane sharing her plans for the future. </p>\n<p>Episode Highlights: </p>\n<ul>\n<li>Growing up in Zimbabwe</li>\n<li>Coaching at University of Houston </li>\n<li>Olympian for one year on Portugal’s team</li>\n<li>International presence</li>\n<li>The importance of being in the right place at the right time</li>\n<li>Figueiredo’s time working as a coach for the Russian team</li>\n<li>Lessons learned from team Russia </li>\n<li>Presently coaching British team</li>\n<li>Tom Daley and his strong work ethic and need for planning</li>\n<li>How Tom made her a better listener</li>\n<li>Tom’s lack of success in Rio</li>\n<li>Confidence going into Tokyo</li>\n<li>The importance of mental preparedness </li>\n<li>Focus on being the best you can be; not gold medals  </li>\n<li>Jane plans to return to London to prepare for Paris Olympics</li>\n</ul>\n<p>Quotes: </p>\n<p>“Obviously, I was born and raised in Southern Africa. And we had, believe it or not, a deep history of diving. Most of the divers that ever came out of Zimbabwe, all dove in the States on scholarship.”</p>\n<p>“There is certainly an extra drive, because you’ve got to understand, a lot of them… they live with their parents for many years into their adult life. So they don't have the same opportunities that American kids have. So yes, the drive is certainly there to try to better themselves in a different way.”</p>\n<p>“My technical knowledge exploded because once I started coaching Vera Ilyina I understood they coached me on twisting technique. Because I would ask a lot of questions.”</p>\n<p>“In the US, we never had trials, and nobody used dry land, whereas in the Russian system, it was 80% dry land. And that's where they develop their divers, in dry land. And then the other 20% was, ‘Okay, let's have a look in the pool.’”</p>\n<p>“Tom called me and said, ‘Hey Jane, I want to come over and chat with you. Can I come train with you?’ I said, “Sure, you can come.” And– I thought he was coming in two weeks. He said, ‘I'll be there tomorrow morning.’”</p>\n<p>“I'm pretty satisfied with my career and the college thing had gone really, really well, and I was okay. I was happy with myself, and then he came along, and I was just like, ‘Oh, my God, this is just, Oh, my God, he's got me.’”</p>\n<p>“I'm happy to admit that as an elite coach, we become quite controlling, because we want to try to control all of it. Sure. We want to try to control the mindset, the physicality, the emotion, the private, because all of it contributes to whether you're successful or not. And then I had to really just let some of it go.”</p>\n<p>“We talked too much about winning the gold medal, and I think that puts so much pressure and expectation on you. And that when you don't deliver, it's like you go below the surface. It's like the iceberg below the water. And so we decided, I don't want to hear a word about it.  Don't let me hear you, in any interview, talk about a gold medal. I don't want to hear about it. Do not say a single word.”</p>\n<p>“Life does not go exactly to schedule. So you know, maybe the event gets postponed, maybe you're up there getting ready to do front, four and a half. And they blow the whistle just as you're running because something's fallen in the pool. I said, ‘Tom, I'm going to schedule this out. But the only thing that I want you to always remember is that things can change.’”</p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a> Website\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson,aps,227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a>\n<a href=\"http://laurawilkinson.com/coffee\" rel=\"nofollow\">Buy Laura a Coffee</a></p>\n<p>Laura's Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook</a></p>\n<p>Jane's Social Media:\n<a href=\"https://www.instagram.com/janefig1218/?hl=en\" rel=\"nofollow\">Jane's Instagram</a></p>",
  "itunes:title": "Creating Opportunity with 8 Time Olympic Medalist Coach Jane Figueiredo",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 55
}