{
  "title": "Accelerate Your Learning by Avoiding these 5 Common Mistakes",
  "description": "How to make your reading more effective",
  "link": "https://datascienceleadership.substack.com/p/accelerate-your-learning-by-avoiding",
  "guid": "https://datascienceleadership.substack.com/p/accelerate-your-learning-by-avoiding",
  "dc:creator": "Tyler Folkman",
  "pubDate": "Sun, 10 Jul 2022 00:06:36 GMT",
  "enclosure": "",
  "content:encoded": "<p>It seems incredibly fashionable to talk about how many books you read. Some people even read multiple books a week and over 100 a year! While that is quite a feat, if your goal is to use books to improve your life in some way, then the number of books you read is almost certainly the wrong metric to measure.</p><p>Instead, it would be best if you were focusing on how your reading helps you to improve. Because just reading a book doesn&#8217;t actually mean anything if your life never changes. It is the application of the knowledge found in books that make them so valuable. Not just the reading of the words.  </p><div class=\"subscription-widget-wrap\" data-attrs=\"{\"url\":\"https://datascienceleadership.substack.com/subscribe?\",\"text\":\"Subscribe\"}\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading Learning With Data! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div><p>So - what common mistakes should you avoid in order to get more out of reading?</p><p><strong>Number one: Start Taking Notes!</strong></p><p>Research shows that writing things down improves your retention of that information. Instead of reading your book as quickly as possible, take your time and write down the items that you really want to remember. Inevitably, you will forget some of what you learned, and having a source of notes to go back to is incredibly valuable to refresh your memory. I strongly suggest some type of digital format so it isn&#8217;t easily lost and can be quickly searched. I frequently go back to my notes to help me find new ideas on how I can improve from things I&#8217;ve already read, but maybe have forgotten.</p><p><strong>Number Two: Don&#8217;t finish every book!</strong></p><p>This one will save you a ton of time. If you realize the book isn&#8217;t providing the value you thought it would, stop reading and move on to another book!</p><p>Or - if you&#8217;ve got what you  need from the book, you might find it more beneficial to put that book down for a while and move on to something else.</p><p>Lastly, some books are really more like reference manuals. Most of the time, you should not try to read these cover to cover. Use the table of contents to allow you to read the sections which you currently need and then come back to it when needed.</p><p><strong>Number Three: Read with a Purpose!</strong></p><p>This is a simple, yet effective tip. Start each of your reading sessions with a purpose. Again, your goal is not to just finish the book. It is to use the book as a means to improve some aspect of your life. Keeping your goal in mind when reading will help you take the best notes as well as keep you focused on what you want to accomplish. </p><p><strong>Number Four: Apply What You Learn!</strong></p><p>This one seems obvious, but most people don&#8217;t do it. When you read something that really resonates and feels like it could greatly help you improve, stop reading! Take that piece of information and figure out how to try to apply it in your own life. Write down a plan on how to apply it and make a goal to track your progress. Once you&#8217;ve got a good plan on how to apply the information you&#8217;ve learned, then continue on with your reading. </p><p>Another option is once you&#8217;ve finished the book, go back to your notes and pick a few key items you&#8217;ve learned to set goals around to ensure you apply them. This is generally the tactic I use as it allows me to first gather the most important information for me into one place and then prioritize what to apply.</p><p><strong>Number Five: Share How You Improved!</strong></p><p>Through this process, you have hopefully used reading as a means to improve your life. That is quite an accomplishment. And one I would strongly recommend sharing with someone. That could be with a friend, on social media, or even in a journal. Recognizing the effort and process you went through to achieve your goal will help you to more clearly see your improvements and motivate you to keep improving!</p><p>I hope these 5 ideas help you get more out of your books. If you found this helpful, I&#8217;d appreciate it if you share it with others! I hope to start writing a bit more and knowing that people find the content valuable definitely helps motivate me to keep writing. </p><p></p><div class=\"subscription-widget-wrap\" data-attrs=\"{\"url\":\"https://datascienceleadership.substack.com/subscribe?\",\"text\":\"Subscribe\"}\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Thanks for reading Learning With Data! Subscribe for free to receive new posts and support my work.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>"
}