{
  "id": "yt:video:AxcxLnszte4",
  "yt:videoId": "AxcxLnszte4",
  "yt:channelId": "UCU63EiU7Y-8xcRntPIRVrzA",
  "title": "Did Jews Go Quietly To Their Deaths In The Holocaust?",
  "link": "",
  "author": {
    "name": "Unpacked",
    "uri": "https://www.youtube.com/channel/UCU63EiU7Y-8xcRntPIRVrzA"
  },
  "published": "2022-11-02T17:30:01+00:00",
  "updated": "2022-11-04T17:50:59+00:00",
  "media:group": {
    "media:title": "Did Jews Go Quietly To Their Deaths In The Holocaust?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "By the 1930’s, Jewish life had prospered in Europe for over 2,000 years. Despite facing expulsion, persecution, and antisemitic rhetoric, Jews survived, sometimes through bribery for security or relocation to “safer” parts of Europe. \n\nWhile this survival tactic served them for centuries, the Nazis rise to power was swift and calculated. Though historians who study this time period can theorize about where and how the tragic death of six million Jews could have occurred, hindsight is 20/20. \n\nWhat the Jews of Europe endured was beyond their control. The reality is that there was nowhere to go, and escape was nearly impossible. With surrounding countries and borders closed to Jews, the pre-World War II European Jewish community of approximately nine million had only a tiny number of survivors to carry on Jewish tradition and continuity into the next generation. \n\nSubscribe and turn on your notifications so you don’t miss future uploads!\nhttps://www.youtube.com/UNPACKED?sub_confirmation=1 \n\nRecommended video— WW2: The Emergence of Nazism and the Holocaust\nhttps://www.youtube.com/watch?v=0FDfhPMA95I&list=PL-DNOnmKkUaa6YEEEhDmTnLlWKc5a3TYH&index=7\n\nWe have merch! – http://shop.jewishunpacked.com/?utm_medium=youtube&utm_source=video-description&utm_campaign=merch\n\nLet’s connect:\nWebsite — https://www.jewishunpacked.com\nInstagram — https://www.instagram.com/jewishunpacked\nTwitter — https://twitter.com/jewishunpacked\nTikTok — https://www.tiktok.com/@jewishunpacked\nFacebook — https://www.facebook.com/jewishunpacked\n\n-----------\nImage and footage credits:\n\nFord Motor Company Collection, Gift of Ford Motor Company and John C. Waddell, 1987\nLibrary of Congress: U.S. News & World Report\nLibrary of Congress\nKheel Center, Cornell University Library\nCIA\nNew Contributed Photographs Collection, Otis Historical Archives, National Museum of Health and Medicine\nNational Archives and Records Administration\nNATO Photos\nHarris & Ewing Collection/Library of Congress\nIsrael Government Press Office/Avraham Soskin\nUnited States Holocaust Museum/Jack J. Silverstein/Muzej Revolucije Narodnosti Jugoslavije\nMetropolitan Museum of Art\nYad Vashem\n-----------\nAbout Explainers: From ancient Jewish traditions to the modern State of Israel, we explain it all. Diving into anything and everything related to Jewish culture, history, and even religion. \nUnderstand Jewish holidays, Israeli politics, Jewish diasporic communities, and more. Learn about Judaism in pop culture, debunking myths about Jews, and explore obscure Israeli landmarks.  We’re asking questions as basic as “What is the Talmud?”, and as obscure as “How did hip-hop boost Kosher wine sales?”, and everything in between.\n\nAbout Unpacked: We provide nuanced insights by unpacking all things Jewish. People are complex and complicated — yet we’re constantly being pushed to oversimplify our world. At Unpacked we know that being complex makes us more interesting. Because of this, we break the world down with nuance and insight to drive your curiosity and challenge your thinking.\n\n#Holocaust #Jewish #antisemitism",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}