{
  "id": "yt:video:Pi0wyvuNn4A",
  "yt:videoId": "Pi0wyvuNn4A",
  "yt:channelId": "UC4EY_qnSeAP1xGsh61eOoJA",
  "title": "Timothy Snyder: The Making of Modern Ukraine. Class16. Colonization, Extermination, Ethnic Cleansing",
  "link": "",
  "author": {
    "name": "YaleCourses",
    "uri": "https://www.youtube.com/channel/UC4EY_qnSeAP1xGsh61eOoJA"
  },
  "published": "2022-11-04T17:58:25+00:00",
  "updated": "2022-11-05T07:18:18+00:00",
  "media:group": {
    "media:title": "Timothy Snyder: The Making of Modern Ukraine. Class16. Colonization, Extermination, Ethnic Cleansing",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Why the 1940s was such a terrible time for Ukraine is the subject of Class 16.\nTimothy Snyder is the Richard C. Levin Professor of History at Yale University and a permanent fellow at the Institute for Human Sciences in Vienna. He speaks five and reads ten European languages.\n\nUkraine must have existed as a society and polity on 23 February 2022, else Ukrainians would not have collectively resisted Russian invasion the next day.  What does it mean for a nation to exist?  Is this a matter of structures, actions, or both?  Why has the existence of Ukraine occasioned such controversy?  In what ways are Polish, Russian, and Jewish self-understanding dependent upon experiences in Ukraine?  Just how and when did a modern Ukrainian nation emerge?  For that matter, how does any modern nation emerge?  Why some and not others?  Can nations be chosen, and can choices be decisive?  If so, whose, and how?  Ukraine was the country most touched by Soviet and Nazi terror: what can we learn about those systems, then, from Ukraine?  Is the post-colonial, multilingual Ukrainian nation a holdover from the past, or does it hold some promise for the future?\n\nCourse reading list: https://snyder.substack.com/p/syllabus-of-my-ukraine-lecture-class\n\nTo see other videos in this course, please click on this playlist link: https://youtube.com/playlist?list=PLh9mgdi4rNewfxO7LhBoz_1Mx1MaO6sw_\n\nFor issues with closed captions, please email guy.ortoleva@yale.edu",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}