{
  "title": "Dissolvable Optical Switches Control Neurons With Light",
  "link": "https://spectrum.ieee.org/brain-machine-interface-optogenetics",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/brain-with-light-pulsating-into-it.jpg?id=31636751&width=1200&height=600&coordinates=0%2C313%2C0%2C313\"/><br/><br/><p>Roughly two decades ago, a strategy called <a href=\"https://spectrum.ieee.org/deep-brain-stimulation\" target=\"_self\">optogenetics</a> emerged to control brain activity with lasers. It uses viruses to insert genes into cells that make them sensitive to light. Optogenetics has revolutionized neuroscience by giving researchers a precise way to excite or suppress brain circuits and shed light on what role they play in the brain. However, a key drawback of this work is that it usually only targets cells that are genetically modified to respond to light. Now scientists in China have developed a new way to control brain cells using light without this limitation, potentially greatly expanding the applications of this optical approach.<br/></p><p>Optogenetics has a number of advantages over previous methods of controlling neurons. Electrical techniques often prove bulky and invasive, triggering inflammation, while drugs often act slowly and imprecisely, with unwanted side effects. However, the fact that optogenetics works only on genetically modified cells has largely limited it to lab research.</p><p>In the new study, researchers experimented with thin-film single-crystal silicon diodes. When illuminated with lasers, the flexible photovoltaic devices could generate either positive or negative electric fields, depending on the polarity of the light.</p><p>In tests on lab-grown neurons, the silicon diodes could excite or inhibit neural activity, depending on their positive or negative voltage. In experiments on mice, the devices could also stimulate or silence neural activity in the hind leg and in the part of the brain that handles the sense of touch.</p><p>The researchers suggest these silicon films can be used in wireless, battery-free neuron stimulation by means of near-infrared light that can penetrate tissue. Potential applications include manipulating peripheral nerves for control of limb movements, the spinal cord for pain relief, the vagus nerve for treating epilepsy, and the retina for visual prosthetics, says study co-senior author Xing Sheng, a materials scientist and electrical engineer at <a href=\"https://www.ee.tsinghua.edu.cn/en/info/1076/1159.htm\" target=\"_blank\">Tsinghua University in Beijing</a>.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"multiple images spanning over days of film dissolving in mice bodies\" class=\"rm-shortcode\" data-rm-shortcode-id=\"41cbe6f08a5ba9e9654b6a3a8d72873d\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"658ef\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/multiple-images-spanning-over-days-of-film-dissolving-in-mice-bodies.jpg?id=31636921&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The top series of images shows the natural dissolution of a silicon film on PLLA–PTMC wrapped around the sciatic nerve of mice. The bottom series shows the natural dissolution of a silicon film on the brain cortex of mice. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Xing Sheng</small></p><p>In addition, these devices are bioresorbable, meaning they naturally dissolve in the body. Therefore, brain surgery is not needed to extract them after they have accomplished any planned therapeutic goal.</p><p>“These days, brain-machine interfaces are very hot topics,” Sheng says. “However, most people focus on either the brain part—neuroscientists; or the machine part—electrical engineers. We really need more people to address the interface, which is the essential key.”</p><p>The scientists note they have not yet seen how their devices might help in models of disease. Currently, “We need to identify the most applicable scenario to use our devices and design the systems accordingly to satisfy the in vivo applications, and meet the standards for clinical grade implants,” Sheng says.</p><p>The researchers detailed <a href=\"https://www.nature.com/articles/s41551-022-00931-0\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a> <a href=\"https://www.biorxiv.org/content/10.1101/2022.06.10.495723v1\" rel=\"noopener noreferrer\" target=\"_blank\">online</a> 5 September in the journal <em>Nature Biomedical Engineering</em>.</p>",
  "pubDate": "Fri, 09 Sep 2022 15:16:16 +0000",
  "guid": "https://spectrum.ieee.org/brain-machine-interface-optogenetics",
  "category": [
    "Optogenetics",
    "Neurons",
    "Brain-machine interface",
    "Optical switch",
    "Optoelectronics"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}