{
  "id": "tag:blogger.com,1999:blog-8474926331452026626.post-2305365824069916944",
  "published": "2022-08-24T11:17:00.001-07:00",
  "updated": "2022-10-21T06:31:28.837-07:00",
  "category": [
    "",
    ""
  ],
  "title": "Using ML to Boost Engagement with a Maternal and Child Health Program in India",
  "content": "<span class=\"byline-author\">Posted by Aparna Taneja, Software Engineer, and Milind Tambe, Principal Scientist, Google Research, India Research Lab</span> <p>The widespread availability of mobile phones has enabled non-profits to deliver critical health information to their beneficiaries in a timely manner. While advanced applications on smartphones allow for richer multimedia content and two-way communication between beneficiaries and health coaches, simpler text and voice messaging services can be effective in disseminating information to large communities, particularly those that are underserved with limited access to information and smartphones. <a href=\"https://armman.org/\">ARMMAN</a><sup id=\"fnref1\"><a href=\"#fn1\" rel=\"footnote\"><span style=\"font-size: x-small;\">1</span></a></sup>, one non-profit doing just this, is based in India with the mission of improving maternal and child health outcomes in underserved communities. </p><a name='more'></a>    <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFapdOe5HopSHcxZLMfKo0Rs9mcxhRQ927F5-ny_y7vve43q60pCzFgIDOGei528_ap7WdV6DwZpz6OIwyy-I3B69NiJShuaJQsHUkwpEI1V5ipLvVPyo6pqT0dr8af_dRk885xzjMNGh9806hiD9y1sODCQTPVXUE2YSFOC40THfPMuC-KDQhteGOuw/s1642/image4.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"876\" data-original-width=\"1642\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjFapdOe5HopSHcxZLMfKo0Rs9mcxhRQ927F5-ny_y7vve43q60pCzFgIDOGei528_ap7WdV6DwZpz6OIwyy-I3B69NiJShuaJQsHUkwpEI1V5ipLvVPyo6pqT0dr8af_dRk885xzjMNGh9806hiD9y1sODCQTPVXUE2YSFOC40THfPMuC-KDQhteGOuw/s16000/image4.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Overview of ARMMAN</td></tr></tbody></table>     <p>One of the programs run by them is <a href=\"https://armman.org/mmitra/\">mMitra</a>, which employs automated voice messaging to deliver timely preventive care information to expecting and new mothers during pregnancy and until one year after birth. These messages are tailored according to the gestational age of the beneficiary. Regular listenership to these messages has been shown to have a high correlation with improved behavioral and health outcomes, such as a 17% increase in infants with tripled birth weight at end of year and a 36% increase in women knowing the importance of taking iron tablets. </p><p>However, a key challenge ARMMAN faced was that about 40% of women gradually stopped engaging with the program. While it’s possible to mitigate this with live service calls to women to explain the advantage of listening to the messages, it is infeasible to call all the low listeners in the program because of limited support staff — this highlights the importance of effectively prioritizing who receives such service calls. </p><p>In “<a href=\"https://research.google/pubs/pub50848/\">Field Study in Deploying Restless Multi-Armed Bandits: Assisting Non-Profits in Improving Maternal and Child Health</a>”, published in <a href=\"https://aaai.org/Conferences/AAAI-22/\">AAAI 2022</a>, we describe an ML-based solution that uses historical data from the NGO to predict which beneficiaries will benefit most from service calls. We address the challenges that come with a large-scale real world deployment of such a system and show the usefulness of deploying this model in a real study involving over 23,000 participants. The model showed an increase in listenership of 30% compared to the current standard of care group. </p><p><b>Background</b><br/>We model this resource optimization problem using <a href=\"https://www.cambridge.org/core/journals/journal-of-applied-probability/article/abs/restless-bandits-activity-allocation-in-a-changing-world/DDEB5E22AFFEFF50AA97ADC96B71AE35\">restless multi-armed bandits</a> (RMABs), which have been well studied for application to such problems in a myriad of domains, including healthcare. An RMAB consists of <em>n</em> arms where each arm (representing a beneficiary) is associated with a two-state <a href=\"https://en.wikipedia.org/wiki/Markov_decision_process#:~:text=In%20mathematics%2C%20a%20Markov%20decision,control%20of%20a%20decision%20maker.\">Markov decision process</a> (MDP). Each MDP is modeled as a two-state (good or bad state, where the good state corresponds to high listenership in the previous week), two-action (corresponding to whether the beneficiary was chosen to receive a service call or not) problem. Further, each MDP has an associated reward function (i.e., the reward accumulated at a given state and action) and a transition function indicating the probability of moving from one state to the next under a given action, under the Markov condition that the next state depends only on the previous state and the action taken on that arm in that time step. The term <em>restless</em> indicates that all arms can change state irrespective of the action. </p>  <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNXOl5--o7B1DwYCUgN5FnC9d6atNdR-V50S2b14hwwXyTdM62_2uCR4OWne2rP4Mc6R2TGx62EUKgFtA_D60qLTVJ9BTjVTzRnhcjjC24I7hBcT8oKHwdlx1qSrt-terI9FghvTp4KA25KkMhJHKSlVtgFojKy-Lz51KW5FwFGYfXTtJWSyD0TXpWNg/s1628/image3.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"570\" data-original-width=\"1628\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjNXOl5--o7B1DwYCUgN5FnC9d6atNdR-V50S2b14hwwXyTdM62_2uCR4OWne2rP4Mc6R2TGx62EUKgFtA_D60qLTVJ9BTjVTzRnhcjjC24I7hBcT8oKHwdlx1qSrt-terI9FghvTp4KA25KkMhJHKSlVtgFojKy-Lz51KW5FwFGYfXTtJWSyD0TXpWNg/s16000/image3.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">State of a beneficiary may transition from good (high engagement) to bad (low engagement) with example passive and active transition probabilities shown in the transition matrix.</td></tr></tbody></table>   <p><b>Model Development</b><br/>Finally, the RMAB problem is modeled such that at any time step, given <em>n</em> total arms, which <em>k</em> arms should be acted on (i.e., chosen to receive a service call), to maximize reward (engagement with the program).  </p><p>The probability of transitioning from one state to another with (active probability) or without (passive probability) receiving a service call are therefore the underlying model parameters that are critical to solving the above optimization. To estimate these parameters, we use the demographic data of the beneficiaries collected at time of enrolment by the NGO, such as age, income, education, number of children, etc., as well as past listenership data, all in-line with the NGO’s data privacy standards (more below).  </p><p>However, the limited volume of service calls limits the data corresponding to receiving a service call. To mitigate this, we use <a href=\"https://en.wikipedia.org/wiki/Cluster_analysis\">clustering techniques</a> to learn from the collective observations of beneficiaries within a cluster and enable overcoming the challenge of limited samples per individual beneficiary. </p><p>In particular, we perform clustering on listenership behaviors, and then compute a mapping from the demographic features to each cluster.  </p>  <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEijvoldXeXl4h6FOtL8qDSyaRPeNmGju1adEyd8Y-Or9oBKZe6rIWpW1cD_UcfCQ-ul-aZsmwryJKMlE9Jawr5g5VifjZR7VHRe8F6EfnsuFVdXjqDjtzWqusF7oOzSsVOF9Np0zt1jKVqCBKS8_11ybQKcQtfyxalT4wp1Jgv3n8Hv1fpBao1dAS98hg/s1494/image5.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"384\" data-original-width=\"1494\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEijvoldXeXl4h6FOtL8qDSyaRPeNmGju1adEyd8Y-Or9oBKZe6rIWpW1cD_UcfCQ-ul-aZsmwryJKMlE9Jawr5g5VifjZR7VHRe8F6EfnsuFVdXjqDjtzWqusF7oOzSsVOF9Np0zt1jKVqCBKS8_11ybQKcQtfyxalT4wp1Jgv3n8Hv1fpBao1dAS98hg/s16000/image5.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Clustering on past listenership data reveals clusters with beneficiaries that behave similarly.  We then infer a mapping from demographic features to clusters.</td></tr></tbody></table>    <p>This mapping is useful because when a new beneficiary is enrolled, we only have access to their demographic information and have no knowledge of their listenership patterns, since they haven’t had a chance to listen yet. Using the mapping, we can infer transition probabilities for any new beneficiary that enrolls into the system. </p><p>We used several qualitative and quantitative metrics to infer the optimal set of of clusters and explored different combinations of training data (demographic features only, features plus passive probabilities, features plus all probabilities, passive probabilities only) to achieve the most meaningful clusters, that are representative of the underlying data distribution and have a low variance in individual cluster sizes.  </p>   <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiW2eOmAL3E9c1dvhDePWe4XVdzfxue8fAAHo6yS8NAXr9GDscnLKxxSS2xwAzYe8SnADeSK1Vlx9K8yAZzNnkSbvI9RjfXOUQrBQX-FkMtBMW1gbrHsA15cDZurw6OFdwQfZZ61j5Vi2NdRiJHcN1ekiix4ZZiebo23XvAmsKLjf0qrmoFg-lsu3H3uA/s1564/image2.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1360\" data-original-width=\"1564\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiW2eOmAL3E9c1dvhDePWe4XVdzfxue8fAAHo6yS8NAXr9GDscnLKxxSS2xwAzYe8SnADeSK1Vlx9K8yAZzNnkSbvI9RjfXOUQrBQX-FkMtBMW1gbrHsA15cDZurw6OFdwQfZZ61j5Vi2NdRiJHcN1ekiix4ZZiebo23XvAmsKLjf0qrmoFg-lsu3H3uA/s16000/image2.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Comparison of passive transition probabilities obtained from different clustering methods with number of clusters <em>s</em> = 20 (red dots) and 40 (green dots), using ground truth passive transition probabilities (blue dots). Clustering based on features+passive probabilities (PPF) captures more distinct beneficiary behaviors across the probability space.</td></tr></tbody></table>   <p>Clustering has the added advantage of reducing computational cost for resource-limited NGOs, as the optimization needs to be solved at a cluster level rather than an individual level. Finally, solving RMAB’s is known to be <a href=\"https://en.wikipedia.org/wiki/PSPACE#PSPACE-completeness\">P-space hard</a>, so we choose to solve the optimization using the popular <a href=\"https://www.cambridge.org/core/journals/journal-of-applied-probability/article/abs/restless-bandits-activity-allocation-in-a-changing-world/DDEB5E22AFFEFF50AA97ADC96B71AE35\">Whittle index approach</a>, which ultimately provides a ranking of beneficiaries based on their likely benefit of receiving a service call. </p><p><b>Results</b><br/>We evaluated the model in a real world study consisting of approximately 23,000 beneficiaries who were divided into three groups: the current standard of care (CSOC) group, the \"round robin\" (RR) group, and the RMAB group. The beneficiaries in the CSOC group follow the original standard of care, where there are no NGO initiated service calls. The RR group represents the scenario where the NGO often conducts service calls using some systematic set order — the idea here is to have an easily executable policy that services enough of a cross-section of beneficiaries and can be scaled up or down per week based on available resources (this is the approach used by the NGO in this particular case, but the approach may vary for different NGOs). The RMAB group receives service calls as predicted by the RMAB model. All the beneficiaries across the three groups continue to receive the automated voice messages independent of the service calls. </p>   <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhfHg1cx-MVYwhILMLHrxooNwLwMA2ajcBYZkIIF7BcohwuDrTvPAgODrDRCaal0vifmQXSzPWwZWeNb9xUMBVurS2fRL3LItZNAvIX2MQitV8q5pPKAJ2rHFdnn4T6JaG2Sl8IHResM2_zBDCNTnUOCsu24WaoEDsCual2CQhRfFCnH3FDrBe8PobA0Q/s1054/image6.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"450\" data-original-width=\"1054\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhfHg1cx-MVYwhILMLHrxooNwLwMA2ajcBYZkIIF7BcohwuDrTvPAgODrDRCaal0vifmQXSzPWwZWeNb9xUMBVurS2fRL3LItZNAvIX2MQitV8q5pPKAJ2rHFdnn4T6JaG2Sl8IHResM2_zBDCNTnUOCsu24WaoEDsCual2CQhRfFCnH3FDrBe8PobA0Q/s16000/image6.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Distributions of clusters picked for service calls by RMAB and RR in week 1 (<b>left</b>) and 2 (<b>right</b>) are significantly different. RMAB is very strategic in picking only a few clusters with a promising probability of success (blue is high and red is low), RR displays no such strategic selection.</td></tr></tbody></table>  <p>At the end of seven weeks, RMAB-based service calls resulted in the highest (and statistically significant) reduction in cumulative engagement drops (32%) compared to the CSOC group. </p>     <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjcYEDGefNeTdysyzZLbvl-0OfWBTI0PvOFBhS5YLLHEUSOp6nS5EkmB1SHKL3gDPX6dnwBuDDHedQQzq6-7pV67Ysg1-dHVL2iu2BrJIdQYzqLM4P7lI5ppnqru_uyd80455MlrquHdaayUD4dpKvfoX0nAQ6xK_hyqajHls2smjG92J3SyZoG2nfz1w/s1518/image7.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"724\" data-original-width=\"1518\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjcYEDGefNeTdysyzZLbvl-0OfWBTI0PvOFBhS5YLLHEUSOp6nS5EkmB1SHKL3gDPX6dnwBuDDHedQQzq6-7pV67Ysg1-dHVL2iu2BrJIdQYzqLM4P7lI5ppnqru_uyd80455MlrquHdaayUD4dpKvfoX0nAQ6xK_hyqajHls2smjG92J3SyZoG2nfz1w/s16000/image7.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">The plot shows cumulative engagement drops prevented compared to the control group.</td></tr></tbody></table>   <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\">  <tbody><tr>   <td>   </td>   <td><b>&nbsp;&nbsp;&nbsp;RMAB vs CSOC&nbsp;&nbsp;&nbsp;</b>   </td>    <td><b>&nbsp;&nbsp;&nbsp;RR vs CSOC&nbsp;&nbsp;&nbsp;</b>   </td>    <td><b>&nbsp;&nbsp;&nbsp;RMAB vs RR&nbsp;&nbsp;&nbsp;</b>   </td>  </tr>  <tr>   <td style=\"text-align: left;\"><em>% reduction in cumulative engagement drops&nbsp;&nbsp;&nbsp;</em>   </td>   <td><b>32.0%</b>   </td>   <td>5.2%    </td>   <td>28.3%    </td>  </tr>  <tr>   <td style=\"text-align: left;\"><em><a href=\"https://en.wikipedia.org/wiki/P-value\">p-value</a></em>   </td>    <td><b>0.044</b>   </td>   <td>0.740    </td>   <td>0.098    </td>  </tr></tbody></table>  <p><b>Ethical Considerations</b><br/>An ethics board at the NGO reviewed the study. We took significant measures to ensure participant consent is understood and recorded in a language of the community's choice at each stage of the program. Data stewardship resides in the hands of the NGO, and only the NGO is allowed to share data. The code will soon be available publicly. The pipeline only uses anonymized data and no personally identifiable information (PII) is made available to the models. Sensitive data, such as caste, religion, etc., are not collected by ARMMAN for mMitra. Therefore, in pursuit of ensuring fairness of the model, we worked with public health and field experts to ensure other indicators of socioeconomic status were measured and adequately evaluated as shown below.   </p>   <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEinTRaA-d_ENirEVSbssIbznJuwt7JJFHxvRx76ACYJR2kkVC-UppoEtJIZxEcJq7yBjS94o5xs8_WPJ-AL6yVKVlaDDTt73qX-vigmrz3ukiLBDSIehQ7FDobZ1t8FGb9a39VbYz5B505dXjfd_2-opFI-1XG_0cnY3YhXtHQlc82FCQHK0tyrKB0gvg/s1248/image2.png\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"864\" data-original-width=\"1248\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEinTRaA-d_ENirEVSbssIbznJuwt7JJFHxvRx76ACYJR2kkVC-UppoEtJIZxEcJq7yBjS94o5xs8_WPJ-AL6yVKVlaDDTt73qX-vigmrz3ukiLBDSIehQ7FDobZ1t8FGb9a39VbYz5B505dXjfd_2-opFI-1XG_0cnY3YhXtHQlc82FCQHK0tyrKB0gvg/s16000/image2.png\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Distribution of highest education received (<b>top</b>) and monthly family income in Indian Rupees (<b>bottom</b>) across a cohort that received service calls compared to the whole population.</td></tr></tbody></table>   <p>The proportion of beneficiaries that received a live service call within each income bracket reasonably matches the proportion in the overall population. However, differences are observed in lower income categories, where the RMAB model favors beneficiaries with lower income and beneficiaries with no formal education. Lastly, domain experts at ARMMAN have been deeply involved in the development and testing of this system and have provided continuous input and oversight in data interpretation, data consumption, and model design.  </p><p><b>Conclusions</b><br/>After thorough testing, the NGO has currently deployed this system for scheduling of service calls on a weekly basis. We are hopeful that this will pave the way for more deployments of ML algorithms for social impact in partnerships with non-profits in service of populations that have so far benefited less from ML. This work was also featured in <a href=\"https://www.youtube.com/watch?t=2670&amp;v=h-jZQaiCmps&amp;feature=youtu.be\">Google for India 2021</a>. </p><p><b>Acknowledgements</b><br/><em>This work is part of our <a href=\"https://ai.google/social-good/\">AI for Social Good</a> efforts and was led by Google Research, India. Thanks to all our collaborators at ARMMAN, Google Research India, Google.org, and University Relations: <a href=\"https://www.linkedin.com/in/dr-aparna-hegde/?originalSubdomain=in\">Aparna Hegde</a>, <a href=\"https://www.linkedin.com/in/neha-madhiwalla-b64a6a141/?originalSubdomain=in\">Neha Madhiwalla</a>, Suresh Chaudhary, <a href=\"https://projects.iq.harvard.edu/adityamate/home\">Aditya Mate</a>, <a href=\"https://research.google/people/LovishMadaan/\">Lovish Madaan</a>, <a href=\"https://research.google/people/ShresthVerma/\">Shresth Verma</a>, <a href=\"https://research.google/people/107972/\">Gargi Singh</a>, <a href=\"https://research.google/people/106305/\">Divy Thakkar</a>.</em></p>  <!--Footnotes--><hr width=\"80%\" /><p>  <span class=\"Apple-style-span\" style=\"font-size: x-small;\"><sup><a name=\"fn1\"><b>1</b></a></sup><a href=\"https://armman.org/\">ARMMAN</a> runs multiple programs to provide preventive care information to women through pregnancy and infancy enabling them to seek care, as well as programs to train and support health workers for timely detection and management of high-risk conditions.&nbsp;<a href=\"#fnref1\" rev=\"footnote\"><sup>↩</sup></a></span></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google AI",
    "uri": "http://www.blogger.com/profile/12098626514775266161",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}