{
  "title": "EX is the New CX",
  "link": "http://rocketdatascience.org/?p=1628",
  "comments": "http://rocketdatascience.org/?p=1628#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Fri, 03 Sep 2021 00:43:42 +0000",
  "category": [
    "Analytics",
    "Artificial Intelligence",
    "Products",
    "Customer Experience"
  ],
  "guid": "http://rocketdatascience.org/?p=1628",
  "description": "(This article is a continuation of my earlier article “When the Voice of the Customer Actually Talks.”) I recently attended (virtually)&#160;CX Summit 2021, presented by&#160;Five9, which focused on “CX Reimagined.” At first this title for the event seemed a bit grandiose to me – Reimagined! After attending the event, I now think the title was [&#8230;]",
  "content:encoded": "\n<p>(This article is a continuation of my earlier article “<a href=\"http://rocketdatascience.org/?p=1622\" target=\"_blank\" rel=\"noreferrer noopener\">When the Voice of the Customer Actually Talks</a>.”)</p>\n\n\n\n<p>I recently attended (virtually)&nbsp;<a href=\"https://five9cxsummit.com/insix\" target=\"_blank\" rel=\"noreferrer noopener\">CX Summit 2021</a>, presented by&nbsp;<a href=\"https://www.five9.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Five9</a>, which focused on “CX Reimagined.” At first this title for the event seemed a bit grandiose to me – Reimagined! After attending the event, I now think the title was perfect, and it could have gone even further. I saw how the “art of the possible” in CX (Customer Experience) and EX (Employee Experience) in the Contact Center is already being realized and is being taken to new realms of possibility through AI and Cloud empowerments.</p>\n\n\n\n<p>The evolved (reimagined) Contact Center now comes with more options for digital channels to accommodate the customer, more voice data-powered services that serve both the customer and the contact center representative, and more seamless actions on both ends of the call line, even for complex inquiries. This is all enabled by the 3 A’s: AI, Automation, and voice Analytics. We have heard it before: “happy employee, happy customer!” That now looks like this: “EX is the new CX.” Boom!</p>\n\n\n\n<p>In an information-packed talk from Gartner Analyst Drew Kraus on “Getting Past the Hype in Customer Service”, where he reviewed just how much hype there is in the customer service and support technologies market, it became clear to me that <a href=\"https://www.five9.com/solutions\" target=\"_blank\" rel=\"noreferrer noopener\">Five9</a> delivers on the needs, not the hype.</p>\n\n\n\n<p>Another informative and data-packed presentation was by Five9 SVP Scott Kolman and COMMfusion analyst Blair Pleasant, where they presented and did a deep dive into the Five9 survey “<a href=\"https://www.businesswire.com/news/home/20210901005157/en/Five9-Survey-Finds-30-of-Customers-Ditched-Brands-They-had-Previously-Been-Loyal-to-Last-Year\" target=\"_blank\" rel=\"noreferrer noopener\">2021 Customer Service Index</a> &#8211; Learn how customers have reimagined the customer service experience.” I won’t go too deep here (you should watch the whole session on-demand). Some interesting highlights include:</p>\n\n\n\n<ol type=\"1\"><li>Five9 surveyed 2048 consumers, with participants from 7 countries, representing ages 19 to early 70’s. They also completed a similar survey in 2020. Side-by-side comparisons of the survey results (by age, by year of survey, and by country) for the different survey questions were quite informative and potentially quite useful for any contact center operation. If that’s what you or your business does, then you should investigate these “Voice of the Customer” results.</li><li>Across all demographics, only 25% of respondents felt that their contact center experience got worse (either “much worse” or “slightly worse”) from 2020 to 2021. We might have expected a different result with the pandemic raging. Everyone else (75%) felt that their experience got better, much better, or had no opinion.</li><li>Some very surprising results appeared (with significant differences between countries) when people were asked to rate the keys to “Good Service Experience”. Highly rated categories were “Rep gets right answer, even if it takes more time” (33%); “Rep can answer my question quickly’’ (26%); and “Don’t have to wait long to reach rep” (20%).</li><li>Similarly, there were some significant differences by country when people were asked to rate the keys to “Bad Service Experience”. Top responses included: “Get passed from one rep to another” (34%); “Have to wait long to reach rep” (26%); and a tie for third place (at 13%) for “Cue/on hold system not helpful” and “Rep cannot answer my question quickly”. (Remember, that despite these seriously bad experiences, only 25% of respondents generally saw a drop in customer service experience in the past year.)</li><li>One of the more enlightening survey results appeared when asked, “How likely are you to do business with a company if you have a Poor Service Experience?” The USA responses were significantly different than responses from the other 6 countries in the survey in one category: over 11% of USA respondents were “very likely” to continue doing business, versus 3-6% of non-USA respondents being “very likely”. However, in the “somewhat likely” category, all countries were in the range 10-16%, with the USA respondents close to the midpoint, near 14%. In my opinion (not expressed by the session presenters), a reason for these seemingly incompatible responses is that there are two sentiments being conflated in this one question. On the one hand, you have the bad experience on “this” call. On the other hand, you have perhaps the much worse (time-consuming) future experience of switching providers and dealing with the corresponding onboarding (for whatever service this is about). I might be “somewhat likely” to switch providers after one bad call experience, but I would not be “very likely” to go through the pain of switching providers and all that entails.</li></ol>\n\n\n\n<p>There were many interesting and powerful sessions in addition to this one, which I focused on here because it presented lots of survey data, and I love data! Another great session was the presentation by former astronaut (now Professor) <a href=\"https://en.wikipedia.org/wiki/Mike_Massimino\" target=\"_blank\" rel=\"noreferrer noopener\">Michael Massimino</a> – brilliant and inspiring, with numerous words of wisdom, leadership advice, and life’s lessons learned. Of course, I admit that I was drawn into his NASA space stories, including the Hubble Telescope repair mission that almost went wrong, because I worked with the Hubble Space Telescope project for 10 years and I worked an additional 10 years at NASA’s Goddard Space Flight Center where many of the telescope’s instruments were tested.</p>\n\n\n\n<p>My big takeaway from the Five9 CX Summit is how cloud, AI, automation, and voice analytics are rapidly driving change in the positive direction for contact center representatives and for customers who call in. Maybe that’s why the customer experience didn’t change much from 2020 to 2021, because a lot of those technologies have already been deployed in the past couple of years, particularly for Five9’s clients. </p>\n\n\n\n<p>Chatbots and conversational AI are just part of the story – there’s so much more. Five9’s new cloud-enabled, AI-powered, voice data-driven <a rel=\"noreferrer noopener\" href=\"https://www.five9.com/solutions\" target=\"_blank\">solutions</a> and <a rel=\"noreferrer noopener\" href=\"https://www.five9.com/contact-center-services\" target=\"_blank\">services</a> described at the summit are definitely worth exploring and investigating for your contact center: IVA (Intelligent Virtual Agents), VoiceStream, Agent Assist, Studio7, Practical AI, WFO (Work Flow Optimization), Conversation Architect, and UC (unified communications) integration into the contact center VX (Voice Experience) workflow.</p>\n\n\n\n<p>Learn more about CX Reimagined and the roles of AI, Automation, Cloud, Voice Analytics, and Omnichannel Customer Engagement in the modern contact center at&nbsp;<a rel=\"noreferrer noopener\" href=\"https://five9cxsummit.com/insix\" target=\"_blank\"><strong>CX Summit 2021</strong></a>, presented by&nbsp;<a rel=\"noreferrer noopener\" href=\"https://www.five9.com/\" target=\"_blank\"><strong>Five9</strong></a>. (Even if you missed the live event, the sessions are recorded, so you can watch them on-demand at any time you wish.)&nbsp;See for yourself where the Reimagined becomes the Realized in CX. And learn why EX is the new CX.</p>\n\n\n\n<p>Note: This article was sponsored. The opinions expressed here are my own and do not represent the opinions of any other person, company, or entity.</p>\n\n\n\n<p>#Five9CXSummit #CXNation </p>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1628",
  "slash:comments": 0
}