{
  "title": "132: Chris Watts: Family Man / Family Murderer",
  "link": "https://audioboom.com/posts/7579825",
  "itunes:episode": 132,
  "itunes:title": "Chris Watts: Family Man / Family Murderer",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3308,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Chris Watts and his wife Shanann seemed to have it all: Thriving careers, wonderful friends, two beautiful kids with a third on the way. But then on August 13, 2018, Shanann’s best friend Nicole can’t get ahold of Shanann. She calls and calls,  and then goes to Shanann’s house. Shanann’s car, purse, phone, wallet, medication are all there, but Shanann and the kids are gone. The mystery of the disappearance of Shanann and the kids unfolds in real time thanks to home security footage, footage from police bodycams, neighborhood security footage, and actual 911 calls. In the end, Chris Watts himself is admits to killing his whole family, leaving everyone around them, and the world at large, wondering why.<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 12 May 2020 08:54:51 +0000",
  "guid": "tag:audioboom.com,2020-05-12:/posts/7579825",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}