{
  "title": "#488: Your Most Controversial Harry Potter Opinions",
  "link": "https://audioboom.com/posts/7714659",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3591,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>In  celebration of Halloween, we're hosting our next Quizzitch Live this Saturday, October 31 at 3 p.m. ET! We hope to see you there!</li>\n<li>Chris Hansen takes on Tom Riddle! Watch it on our social media channels later this week.</li>\n<li>Only one week left until Election Day! Please make sure you are registered to vote in your state right now by visiting <a href=\"http://www.iwillvote.com\">IWillVote.com</a>. You can also find out great ballot information at <a href=\"http://www.ballotready.org\">BallotReady.org</a> and sign up to be a poll worker at <a href=\"http://www.powerthepolls.org\">PowerThePolls.org</a>.</li>\n<li>We review the brand-new, beautifully illustrated MinaLima edition of Sorcerer's Stone. How does it compare to the Jim Kay Illustrated Series?</li>\n<li>We discuss how having worked on the Harry Potter films brings a whole new perspective to this illustrated edition</li>\n<li>Pop-ups galore: Dumbledore's watch, Hogsmeade, The Fat Lady Portrait and more!</li>\n<li>Main Discussion: The Most Controversial Opinions in the Harry Potter series</li>\n<li>What are the Harry Potter opinions that you think would get you in trouble? That would have people flinging an Unforgivable Curse at you? That would cause Umbridge to write a new decree about you? </li>\n<li>Is Hermione a terrible person?</li>\n<li>Are people who’ve only watched the movies and haven’t read the books \"real\" fans?</li>\n<li>Could the chapters that aren’t about Harry be the best parts of the series?</li>\n<li>Was the attack on The Burrow a good addition to the Half-Blood Prince movie?</li>\n<li>Were the Marauders,  while intelligent and witty, actually total a**holes?</li>\n<li>Was Remus Lupin horrible for not writing to Harry in Year 1?</li>\n<li>Quizzitch: What is Harry wearing during his first dream in Gryffindor Tower?</li>\n<li>This week's episode is sponsored by <a href=\"http://www.peacocktv.com\">Peacock TV</a> (watch the Harry Potter movies for free, all October long!) and BeachBody (text ‘mugglecast’ to 30-30-30 to receive a free trial!).</li>\n<li>Support us on Patreon and receive magical benefits, like Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 27 Oct 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-10-26:/posts/7714659",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}