{
  "title": "’Degrowth’ shrinks the fight against climate change",
  "link": "https://www.eastasiaforum.org/2022/11/01/degrowth-shrinks-the-fight-against-climate-change/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=degrowth-shrinks-the-fight-against-climate-change",
  "comments": "https://www.eastasiaforum.org/2022/11/01/degrowth-shrinks-the-fight-against-climate-change/#respond",
  "dc:creator": "Richard Katz",
  "pubDate": "Mon, 31 Oct 2022 23:00:01 +0000",
  "category": [
    "Climate Change",
    "Development",
    "Economic Policy",
    "Economy",
    "Energy",
    "Environment",
    "Environment and Climate Change",
    "Japan",
    "Poverty",
    "resources",
    "capitalism and climate change",
    "climate change and development",
    "degrowth",
    "degrowth movement",
    "ecological disaster",
    "environmentalism",
    "green energy",
    "Japan green growth",
    "Japan's emissions",
    "Marxism",
    "Pollution",
    "renewable energy"
  ],
  "guid": "https://www.eastasiaforum.org/?p=1307440",
  "description": "<p>Author: Richard Katz, Carnegie Council for Ethics in International Affairs Half a million people in Japan have bought the book Capital in the Anthropocene, which claims that the answer to climate change is to shrink the economy. ’Degrowth communism’ is what the author, a Marxist professor named Kohei Saito, calls his policy. If followed, it [&#8230;]</p>\nThe post <a href=\"https://www.eastasiaforum.org/2022/11/01/degrowth-shrinks-the-fight-against-climate-change/\">’Degrowth’ shrinks the fight against climate change</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "content:encoded": "<p>Author: Richard Katz, Carnegie Council for Ethics in International Affairs</p>\n<p>Half a million people in Japan have bought the book <em>Capital in the Anthropocene</em>, which claims that the answer to climate change is to shrink the economy. ’Degrowth communism’ is what the author, a Marxist professor named Kohei Saito, calls his policy. If followed, it would keep billions of people in abject poverty while slashing living standards in rich nations.</p>\n<p><span id=\"more-1307440\"></span></p>\n<p><img class=\"aligncenter wp-image-1307553 size-medium\" title=\"An offshore wind farm is set up by Goto City and Toda Corporation at the Gotō Islands in Goto City, Nagasaki Prefecture, Japan, 6 October 2020 (Photo: Reuters/Masaki Akizuki)\" src=\"https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-400x267.jpg\" alt=\"An offshore wind farm is set up by Goto City and Toda Corporation at the Gotō Islands in Goto City, Nagasaki Prefecture, Japan, 6 October 2020 (Photo: Reuters/Masaki Akizuki)\" width=\"400\" height=\"267\" srcset=\"https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-400x267.jpg 400w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-600x400.jpg 600w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-150x100.jpg 150w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-768x512.jpg 768w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-1536x1024.jpg 1536w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-scaled.jpg 2048w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-300x200.jpg 300w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-100x67.jpg 100w, https://www.eastasiaforum.org/wp-content/uploads/2022/10/2020-10-10T000000Z_1728577829_MT1YOMIUR0003VYSWS_RTRMADP_3_OFFSHORE-WIND-POWER-PLANT-IN-JAPAN-500x333.jpg 500w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></p>\n<p>Were environmentalism to be associated with either communism or ‘degrowth’ — as a minority of environmentalists in the United States, Asia and Europe advocate — it would be the political death knell of the movement and a gift to the peddlers of fossil fuels.</p>\n<p>The problem with <a href=\"https://www.eastasiaforum.org/2022/02/07/kishidas-new-capitalism-raises-more-questions-than-it-answers/\" target=\"_blank\" rel=\"noopener noreferrer\">capitalism</a>, Saito contends, is that it worships economic growth. The problem with growth, he claims, is that it inevitably brings on ecological disasters.</p>\n<p>While Karl Marx claimed that, under socialism, growth would create abundance galore while still protecting nature, Saito is part of a group of academics calling themselves Marxist, but who have rewritten Marx as if he were a Malthusian. Marx’s real complaint about capitalism was his belief that capitalism would inevitably put a fetter on growth while harming workers and nature. In reality, global per capita GDP has increased fourfold over the last 70 years.</p>\n<p>The solution to the problems created by growth is even more growth and further technological progress. Consider the nearly three billion people who rely on animal dung and wood to cook and heat their homes. A firewood stove generates 100 times more emissions than one fuelled by natural gas. The biggest growth in emissions comes from countries that are neither poor nor rich but are in transition. Once countries get rich, carbon emissions <a href=\"https://nyc3.digitaloceanspaces.com/owid-public/data/co2/owid-co2-data.xlsx\" target=\"_blank\" rel=\"noopener noreferrer\">tend to slow</a> and eventually decline.</p>\n<p>In Japan, the United States and Europe, carbon dioxide emissions rose in tandem with GDP during their transition to affluence. But in the 1970s, <a href=\"https://www.eastasiaforum.org/2021/12/09/japans-carbon-neutrality-challenge/\" target=\"_blank\" rel=\"noopener noreferrer\">carbon dioxide emissions in Japan</a> slowed, then flattened out and finally started falling in the past decade, even as GDP kept rising. Japan’s 2019 emissions were 15 per cent below 2007 levels.</p>\n<p>A similar trend of falling emissions can be seen in the United States, Europe and China. In the United States, emissions in 2019 were 16 per cent below those of 2007. In Europe, carbon dioxide emissions peaked in 1980 and fell 30 per cent by 2019. The decline in China began a decade ago, but it’s too early to be sure this trend will last.</p>\n<p>While the arc of development bends toward greener energy, these natural processes do not move speedily enough to avoid catastrophe. They need to be accelerated by government policies. Fortunately, support for green policies rises with per capita GDP. Once a population’s basic survival needs are satisfied, voters have the economic means and the political desire to reduce pollution and conquer climate change.</p>\n<p>For example, Japan’s famous ‘Pollution Diet’ in 1970 — a session of parliament dominated by concerns over pollution — passed a series of strong pollution laws under pressure from the public. In China, citizen outrage has compelled the government in Beijing to <a href=\"https://aqli.epic.uchicago.edu/news/pollution-in-beijing-is-down-by-half-since-the-last-olympics-adding-four-years-onto-lives/\" target=\"_blank\" rel=\"noopener noreferrer\">halve the city’s air pollution</a> from its level in 2013, raising life expectancy.</p>\n<p>Today, half the world’s population lives in countries where it now <a href=\"https://www.bloomberg.com/news/articles/2021-06-23/building-new-renewables-cheaper-than-running-fossil-fuel-plants\" target=\"_blank\" rel=\"noopener noreferrer\">costs less</a> to build and operate new wind or solar plants than to operate existing coal or gas-fired power plants, let alone build anew. With each passing year, the cost advantage of renewables is growing. The poorest countries can shift from dung and firewood directly to renewables, bypassing the carbon-intensive phases of coal, oil and gas required by past generations. More developed countries can afford to phase out fossil fuels. That is already beginning to happen. In 2020, renewables supplied more than 80 per cent of global growth in electric capacity.</p>\n<p>But the pace of the energy transition sometimes depends as much on a country’s politics as on its level of development. The European Union is halfway toward the elimination of coal by 2030. While China is still increasing its use of coal, it has also increased solar and wind from 5 per cent of its electricity output in 2011 to 24 per cent in 2020. During the same period, renewables’ share of the energy supply in India rose from 7 per cent to 18 per cent.</p>\n<p>In contrast, Japan has tripled its reliance on coal for electricity generation since 1985. Although renewable energy prices are falling in Japan, they are still among the highest in the world for political reasons. For example, the price of land for solar and wind farms is high because Japan’s regulations <a href=\"https://www.pv-magazine.com/2020/08/20/japans-struggle-to-drive-down-renewables-costs/\" target=\"_blank\" rel=\"noopener noreferrer\">restrict the use</a> of even abandoned farmland.</p>\n<p>Saito and other ‘degrowthers’ retort that this partnership between growth and greener energy is temporary. Even without climate change, they contend there is still an absolute limit to resources.</p>\n<p>But what counts as a resource is technologically-determined. In the 19th century, people feared running out of firewood and predicted that city streets would be covered in disease-spreading horse manure. The firewood shortage was solved by coal and eventually by oil. The horse manure malady ended with the rise of automobiles.</p>\n<p>The real danger is not that any country will adopt degrowth policies but rather that by discrediting environmentalism, the degrowth movement could undermine efforts to <a href=\"https://www.eastasiaforum.org/2022/09/16/balancing-geopolitics-and-energy-security-with-decarbonisation/\" target=\"_blank\" rel=\"noopener noreferrer\">defeat climate change</a>.</p>\n<p><em>Richard Katz is Senior Fellow at the Carnegie Council for Ethics in International Affairs. This article is digested from </em>Japan Economy Watch<em>, parts </em><a href=\"https://richardkatz.substack.com/p/bestseller-in-japan-degrowth-communism\" target=\"_blank\" rel=\"noopener noreferrer\"><em>1</em></a><em>, </em><a href=\"https://richardkatz.substack.com/p/degrowth-movement-would-abort-renewables\" target=\"_blank\" rel=\"noopener noreferrer\"><em>2</em></a><em> and </em><a href=\"https://richardkatz.substack.com/p/japan-unlikely-to-meet-2030-goal\" target=\"_blank\" rel=\"noopener noreferrer\"><em>3</em></a><em>.</em></p>The post <a href=\"https://www.eastasiaforum.org/2022/11/01/degrowth-shrinks-the-fight-against-climate-change/\">’Degrowth’ shrinks the fight against climate change</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "wfw:commentRss": "https://www.eastasiaforum.org/2022/11/01/degrowth-shrinks-the-fight-against-climate-change/feed/",
  "slash:comments": 0,
  "post-id": 1307440
}