{
  "title": "Reduce food waste to improve sustainability and financial results in retail with Amazon Forecast",
  "link": "https://aws.amazon.com/blogs/machine-learning/reduce-food-waste-to-improve-sustainability-and-financial-results-in-retail-with-amazon-forecast/",
  "dc:creator": "Josie Cheng",
  "pubDate": "Thu, 27 Oct 2022 16:31:14 +0000",
  "category": [
    "Amazon Forecast",
    "Artificial Intelligence",
    "Best Practices",
    "Customer Solutions",
    "Intermediate (200)",
    "Sustainability"
  ],
  "guid": "701bb97391d4e5c0c1fc64ed8177df3a8820bdbe",
  "description": "With environmental, social, and governance (ESG) initiatives becoming more important for companies, our customer, one of Greater China region’s top convenience store chains, has been seeking a solution to reduce food waste (currently over $3.5 million USD per year). Doing so will allow them to not only realize substantial operating savings, but also support corporate […]",
  "content:encoded": "<p>With environmental, social, and governance (ESG) initiatives becoming more important for companies, our customer, one of Greater China region’s top convenience store chains, has been seeking a solution to reduce food waste (currently over $3.5 million USD per year). Doing so will allow them to not only realize substantial operating savings, but also support corporate sustainability goals.</p> \n<p>In this post, we focus on forecasting demand of freshly prepared food by retail convenience stores. Our customer sells ready-to-eat food items with a short shelf life—typically 2–3 days. They faced two challenges: how to reduce food waste, and how to manage forecast models for over 10,000 SKUs and thousands of stores efficiently and at scale.</p> \n<p>With <a href=\"https://aws.amazon.com/forecast/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Forecast</a>, and support from the <a href=\"https://aws.amazon.com/professional-services/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS ProServe</a> team and <a href=\"https://aws.amazon.com/ml-solutions-lab/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Machine Learning Solutions Lab</a>, our customer—with limited internal data scientists—now has state-of-the-art forecasting capabilities. Within a few months, this forecasting solution has helped them reduce product waste by 37%, resulting in cost savings of 22% across 168 stores and three merchandise categories.</p> \n<p>To achieve these operational benefits, they implemented a number of best practice processes, including a fast data iteration and testing cycle, and parallel testing to find optimal data combinations. They also established data processing and forecasting pipelines, which can scale to thousands of stores and product categories, and developed a scalable reference architecture to be used for future extensions.</p> \n<h2>The fresh foods ESG challenge</h2> \n<p>In addition to selling environmentally sustainable products, it’s also important for the retail industry to strive for environmentally friendly processes that minimize waste. Advanced inventory forecasting using machine learning (ML) allows retail stores to maximize sales and minimize waste through more effective inventory management and turnover. Inventory that can’t be sold is a problem for convenience store chains—it drives financial losses and furthers negative environmental effects through excess usage of energy inputs and inefficient production processes. And due to large volumes, short-dated fresh food items can play a big role in both financial and sustainability results.</p> \n<p>Besides having a short shelf life, additional demand forecasting challenges for fresh food include rapid turnover, frequent new product launches, and high SKU volumes. Specifically:</p> \n<ul> \n <li>Compared to other categories, short-dated perishables must be sold within a short time window, otherwise they will expire and be discarded. Therefore, accurate forecasting is more important than for items that can be stored and sold over a longer time period.</li> \n <li>New product launches are frequent, making forecasting more challenging at the SKU-level (the cold start problem).</li> \n <li>A large number of items can cause model management issues for traditional algorithms such as ARIMA, which are configured for each item. Many models will need to be maintained, which is both costly and hard to scale.</li> \n</ul> \n<h2>Inventory forecasting</h2> \n<p>Amazon Forecast is a fully managed AI/ML service from AWS, and includes both statistical and deep learning algorithms that are based on over 20 years of forecasting experience. With item-level ensemble modeling and automatic model hyperparameter optimization, it provides forecasts that are up to 40% more accurate that using traditional methods alone. In addition, features such as predictor retraining can reduce training time and cost by up to 50%.</p> \n<p>To optimize inventory forecasting, we looked at the main drivers of demand. Even within the fresh food category, there are items that are more popular—with higher inventory turnover—and items that sell slower. By separating popular from unpopular items and training predictors, we found that predictors can fit the dataset better and enhance model accuracy with different statistical distributions. In addition, because Forecast provides probabilistic forecasts based on customer-selected quantiles, we set up prediction quantiles based on item expiration dates and item profitability.</p> \n<p>To implement demand forecasting that enhances sustainability, we also considered industry-specific properties:</p> \n<ul> \n <li>Short lead times</li> \n <li>High order frequencies</li> \n <li>Product alternatives and substitutes</li> \n <li>Consumer psychology (often, consumers are more likely to make a purchase if they have a diverse set of products to select from)</li> \n</ul> \n<p>To balance shelf diversity against inventory wastage, we not only produced daily demand forecasts, but also performed what-if analyses to optimize promotion of unsold items before they expire.</p> \n<p>We were able to incorporate these considerations and address our customer’s requirements with Forecast. In the next section, we walk through how the customer solution has been created in more detail.</p> \n<h2>Solution overview</h2> \n<p>To train a predictor, training data is ingested into data storage from a data source, using one of the <a href=\"https://docs.aws.amazon.com/forecast/latest/dg/dataset-import-guidelines-troubleshooting.html\" target=\"_blank\" rel=\"noopener noreferrer\">formats supported</a> by Forecast. <a href=\"http://aws.amazon.com/s3\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Simple Storage Service</a> (Amazon S3) is an object storage service offering industry-leading scalability, data availability, security, and performance. In the ingestion phase, we transform data from our source to the Forecast dataset format. Forecast uses three types of data: target time series (TTS), which is required, and related time series (RTS) and item metadata (IM), both of which are optional.</p> \n<p>We started with the most-wasted SKUs at the stores that had the most waste. To forecast each store’s daily demand, we first started with time series (revenues, inventories, promotions) and then fine-tuned our approach based on store properties such as whether it’s a franchise or company-owned store, store type, restroom availability, store size (small or large), and store age. We also used industry knowledge, such as local holidays, promotions, weather, and daily traffic. Our TTS dataset consisted of timestamp, item ID, and demand; RTS consisted of timestamp, item ID, discount, inventory, and weather; and the IM dataset consisted of item ID, category, and store infrastructures. To quantify the importance of these features on our forecasts, we used <a href=\"https://aws.amazon.com/blogs/machine-learning/new-amazon-forecast-api-that-creates-up-to-40-more-accurate-forecasts-and-provides-explainability/\" target=\"_blank\" rel=\"noopener noreferrer\">explainability</a>—a Forecast built-in feature that measures the relative impact of different attributes on forecast values.</p> \n<p>A dataset must be created and associated with a dataset group to train the predictor. When creating a predictor, Forecast automatically selects the right algorithms, tunes hyperparameters, and performs ensemble modeling. In an interesting finding from this case, we used cross-COVID-19 data (from 2018–2021) to train the model and found that we didn’t need to add other COVID-19 features such as number of daily confirmed cases. The deep neural network models can learn directly from daily revenue.</p> \n<p>The following diagram illustrates the solution architecture.</p> \n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-44568\" style=\"margin: 10px 0px 10px 0px;border: 1px solid #CCCCCC\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/21/ml-11987-arch-diag.jpg\" alt=\"Inventory forecasting solution architecture\" width=\"1446\" height=\"694\"></p> \n<p>Our customer maintains their transactional records in <a href=\"https://aws.amazon.com/rds/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Relational Database Service</a> (Amazon RDS). We also use <a href=\"https://aws.amazon.com/glue/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Glue</a> to conduct ETL (extract, transform, and load), read data covering the target SKUs across a meaningful time range, and load data to Amazon S3 with an indicated prefix. After data is loaded to Amazon S3, an S3 event triggers <a href=\"https://aws.amazon.com/lambda/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Lambda</a> and invokes <a href=\"https://aws.amazon.com/step-functions/?step-functions.sort-by=item.additionalFields.postDateTime&amp;step-functions.sort-order=desc\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Step Functions</a> as an orchestration tool.</p> \n<p>In Step Functions, we prepare datasets that include target time series, related time series, and item metadata. We use an AWS Glue job to process the data into an S3 bucket. We can then call a Forecast API to create a dataset group and import data from the processed S3 bucket. When those datasets are ready, we can start to train the predictor.</p> \n<p>To train a predictor, Forecast ensemble models six different algorithms and applies the optimal combination of algorithms to each time series in your dataset. We use the <code>AutoPredictor</code> API, which is also accessible through the Forecast console.</p> \n<p>After the predictors have been created, we evaluated their quality metrics in the predictors dashboard. You can choose the predictor name to examine <a href=\"https://aws.amazon.com/tw/blogs/machine-learning/measuring-forecast-model-accuracy-to-optimize-your-business-objectives-with-amazon-forecast/\" target=\"_blank\" rel=\"noopener noreferrer\">detailed results</a> such as Weighted Quantile Loss (wQL), Weighted Absolute Percentage Error (WAPE), Mean Absolute Scaled Error (MASE), Root Mean Squared Error (RMSE), and Mean Absolute Percentage Error (MAPE). For customized evaluation and analysis, you can also export the <a href=\"https://docs.aws.amazon.com/forecast/latest/dg/metrics.html#backtest-exports\" target=\"_blank\" rel=\"noopener noreferrer\">forecasted values</a> to evaluate predictor quality metrics. In this case, we used the customer’s original metric—MAPE—to produce a side-by-side comparison with the customer’s legacy model (ARIMA), and ensure that the Forecast model produced better results (a lower MAPE). For future model quality analyses, we recommended that the customer use RMSE, which better accounts for the fact that different items have different sales volumes.</p> \n<p>After our predictor was ready, we generated forecast results for every item (<code>item_id</code>) and dimension (<code>store_id</code>) indicated in our target time series dataset. Forecast places results in an S3 bucket with the S3 prefix as the destination.</p> \n<p>Forecast results are generated in the S3 bucket, triggering a Lambda function and writing the forecast result to <a href=\"https://aws.amazon.com/rds/aurora/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Aurora</a> for the end-user to query. To provide the forecasting result to the client side, we use <a href=\"https://aws.amazon.com/api-gateway\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon API Gateway</a> as the entry point and query Aurora through the Lambda function.</p> \n<p>To automate this process, we used Step Functions, and we also maintain an <a href=\"https://aws.amazon.com/sagemaker/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon SageMaker</a> notebook for data scientists to featurize and test different data variations in the training dataset to find optimal data combinations.</p> \n<h2>Summary and next steps</h2> \n<p>In this post, we showed how to use Forecast to minimize waste through more effective inventory forecasting of food products with a short shelf life. The application of ML-based forecasting helped our retail customer reduce product waste by 37% and costs by 22% across 168 stores and three merchandise categories. Moreover, the reference architecture is able to support scaling to thousands of stores and product categories. These efforts not only improved financial outcomes, but also demonstrated their commitment to more sustainable, enviornmental friendly food practices. Together, these achievements helped our customer progress toward their ESG initiatives.</p> \n<p>Next up for the team is using the <a href=\"https://aws.amazon.com/about-aws/whats-new/2022/08/amazon-forecast-what-if-analyses/\" target=\"_blank\" rel=\"noopener noreferrer\">what-if analysis</a> capabilities of Forecast to further test the impact on demand, add subcategories for daily demand forecasting, and scale to more stores. In addition, the team will keep iterating the model to continue reducing food waste, and optimize processes to deliver more sustainable and environmentally friendly results.</p> \n<p>To use Forecast to improve retail demand forecasting and support better environmental outcomes, you can access the service through the <a href=\"http://aws.amazon.com/console\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Management Console</a>, or through our <a href=\"http://aws.amazon.com/cloudformation\" target=\"_blank\" rel=\"noopener noreferrer\">AWS CloudFormation</a>-based solution guidance on <a href=\"https://github.com/aws-samples/amazon-forecast-samples/tree/main/ml_ops\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub</a>. To learn more about how to use Forecast, check out <a href=\"https://aws.amazon.com/forecast/resources/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Forecast resources</a>.</p> \n<hr> \n<h3>About the Authors</h3> \n<p style=\"clear: both\"><img loading=\"lazy\" class=\"size-full wp-image-44570 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/21/ml-11987-auth-Josie.png\" alt=\"auth-Josie\" width=\"100\" height=\"142\"><strong>Josie Cheng</strong> is a HKT AI/ML Go-To-Market at AWS. Her current focus is on business transformation in retail and CPG through data and ML to fuel tremendous enterprise growth. Before joining AWS, Josie worked for Amazon Retail and other China and US internet companies as a Growth Product Manager.</p> \n<p style=\"clear: both\"><img loading=\"lazy\" class=\"size-medium wp-image-44571 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/21/ml-11987-auth-Ray.png\" alt=\"\" width=\"100\" height=\"133\"> <strong>Ray Wang</strong> is a Solutions Architect at AWS. With 8 years of experience in the IT industry, Ray is dedicated to building modern solutions on the cloud, especially in NoSQL, big data, and machine learning. As a hungry go-getter, he passed all 12 AWS certificates to make his technical field not only deep but wide. He loves to read and watch sci-fi movies in his spare time.</p> \n<p style=\"clear: both\"><img loading=\"lazy\" class=\"size-medium wp-image-44572 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/21/ml-11987-auth-Shanger.png\" alt=\"\" width=\"100\" height=\"98\"><strong>Shanger Lin</strong> is Data Scientist and Consultant at AWS, leveraging machine learning, cloud computing, and data strategy to enable customers with digital transformation and to extract impact from data.</p> \n<p style=\"clear: both\"><img loading=\"lazy\" class=\"size-medium wp-image-44573 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/21/ml-11987-auth-Dan.png\" alt=\"\" width=\"100\" height=\"121\"><strong> Dan Sinnreich</strong> is a Sr. Product Manager for Amazon Forecast. His focus is helping companies drive better business decisions with ML-based forecasting. Outside of work, he can be found playing hockey, reading science fiction, and scuba diving.</p>"
}