{
  "title": "COVID Booster Approved Despite ZERO Human Testing",
  "itunes:title": "COVID Booster Approved Despite ZERO Human Testing",
  "pubDate": "Fri, 02 Sep 2022 05:00:55 +0000",
  "guid": "e90ccc56-806b-4b1f-ba61-9abb9132ea34",
  "link": "https://thejimmydoreshow.libsyn.com/covid-booster-approved-despite-zero-human-testing",
  "itunes:image": "",
  "description": "<p>The FDA has announced emergency use authorization of a booster shot that targets the omicron BA.5 COVID variant. How the current state of the pandemic qualifies as an “emergency” is anyone’s guess. As is the likely effect on anyone given the booster since the authorization process did not involve any actual human testing. In fact, the little information Pfizer has made available to the public involves tests performed on eight mice. And that’s it!<br /> <br /> Jimmy and America’s comedian Kurt Metzger discuss the public’s dwindling interest in boosters and the skepticism from knowledgeable experts over the value of endless COVID boosters<br /> <br /> Plus segments on the FBI's role in Facebook censoring the Hunter Biden laptop story and Dr. Fauci's latest lie about COVID lockdowns.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from Joe Biden and Ozzy Osbourne!</p> <p> </p>",
  "content:encoded": "<p>The FDA has announced emergency use authorization of a booster shot that targets the omicron BA.5 COVID variant. How the current state of the pandemic qualifies as an “emergency” is anyone’s guess. As is the likely effect on anyone given the booster since the authorization process did not involve any actual human testing. In fact, the little information Pfizer has made available to the public involves tests performed on eight mice. And that’s it!  Jimmy and America’s comedian Kurt Metzger discuss the public’s dwindling interest in boosters and the skepticism from knowledgeable experts over the value of endless COVID boosters  Plus segments on the FBI's role in Facebook censoring the Hunter Biden laptop story and Dr. Fauci's latest lie about COVID lockdowns.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from Joe Biden and Ozzy Osbourne!</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "01:07:36",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The FDA has announced emergency use authorization of a booster shot that targets the omicron BA.5 COVID variant. How the current state of the pandemic qualifies as an “emergency” is anyone’s guess. As is the likely effect on anyone given the...",
  "itunes:episodeType": "full",
  "itunes:summary": "The FDA has announced emergency use authorization of a booster shot that targets the omicron BA.5 COVID variant. How the current state of the pandemic qualifies as an “emergency” is anyone’s guess. As is the likely effect on anyone given the booster since the authorization process did not involve any actual human testing. In fact, the little information Pfizer has made available to the public involves tests performed on eight mice. And that’s it! Jimmy and America’s comedian Kurt Metzger discuss the public’s dwindling interest in boosters and the skepticism from knowledgeable experts over the value of endless COVID boosters Plus segments on the FBI's role in Facebook censoring the Hunter Biden laptop story and Dr. Fauci's latest lie about COVID lockdowns. Also featuring Stef Zamorano and Mike MacRae! And phone calls from Joe Biden and Ozzy Osbourne!"
}