{
  "title": "S1E4 - Softball is Back on the Olympic Schedule and so is Cat Osterman",
  "guid": "https://pinecast.com/guid/7424292d-4faa-4cdc-94b2-266ba74582da",
  "pubDate": "Tue, 30 Jun 2020 07:30:58 -0000",
  "itunes:duration": "00:52:51",
  "description": "<p>Laura welcomes three-time National Player of the Year, four-time All-American, and two-time Olympic medalist in softball, Cat Osterman, to the podcast today. Cat is an incredibly successful, multiple record-holding pitcher who is now an Assistant Coach at Texas State, and is coming out of retirement to play for Team USA at the Tokyo Olympics next year now that softball has been reinstated.</p>\n<p>In this episode, Cat describes her start in softball, her journey to becoming a star at the University of Texas, and her experiences at both the 2004 and 2008 Olympics. She also shares her standout collegiate career moment, the difference between pro and college ball, and softball’s fluctuating status with the Olympics. Her coaching career, her return to softball, and how she and her team are handling these unusual times are also explored, and she offers some sage advice for up and coming athletes when dealing with adversity such as this pandemic. Cat Osterman is an elite athlete possessing a vast amount of knowledge, skill, and insight regarding both sport and life in general, and you will be educated, informed, and inspired as you listen in on this conversation today.</p>\n<p>Episode Highlights:</p>\n<p>Cat’s start in softball and her journey to the University of Texas\nCat’s road to the Olympics and her advice for others doing the same\nHer first Olympic Games adventure in 2004\nCat’s standout moment from her collegiate career\nThe difference between pro and college ball\nHer second Olympics in 2008\nSoftball’s changing status with the Olympic Games\nThe coaching/playing relationship\nCat’s situation when the pandemic struck and how she and her team are navigating it\nHer advice to young athletes handling adversity</p>\n<p>Quotes:</p>\n<p>“That 2004 group was a special group, how we kind of gelled and worked together.”</p>\n<p>“When we’re immersed in this sport and it’s what you love to do…you almost do anything to make sure it happens.”</p>\n<p>“Keep your eye on your goal, and remember to do your part towards that goal.”</p>\n<p>“With team…you also love bronze, because you’re winning the bronze, whereas a silver, you’re losing the gold.”</p>\n<p>“Everything we preach to our kids, we have to remember it applies to ourselves as well.”</p>\n<p>“In just being a teammate and communication-wise, I think coaching has helped me be a better player more than playing has helped me be a better coach again.”</p>\n<p>“Control what you can control.”\nLinks:\nThe Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> </p>\n<p>Cat’s homepage:   <a href=\"https://www.catosterman.com/\" rel=\"nofollow\">https://www.catosterman.com/</a></p>\n<p>Cat’s instagram: <a href=\"https://www.instagram.com/catosterman/\" rel=\"nofollow\">https://www.instagram.com/catosterman/</a></p>",
  "itunes:title": "Softball is Back on the Olympic Schedule and so is Cat Osterman",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 4
}