{
  "title": "A Day in the Life of the Wolfram High School Summer Camp",
  "link": "https://blog.wolfram.com/2022/10/05/a-day-in-the-life-of-the-wolfram-high-school-summer-camp/",
  "comments": "https://blog.wolfram.com/2022/10/05/a-day-in-the-life-of-the-wolfram-high-school-summer-camp/#respond",
  "pubDate": "Wed, 05 Oct 2022 16:15:12 +0000",
  "dc:creator": "Anika Patel",
  "category": "Computational Thinking, Education, Events",
  "guid": "https://blog.wolfram.com/?p=85905",
  "description": "In July 2022, we officially began the annual Wolfram High School Summer Camp with a single mission: sharpen the campers’ minds and dive deep into topics for the betterment of the future of the world. All campers can agree that this was a life-changing experience. The first mission of camp? Get to know the Zoom [&#8230;]",
  "content:encoded": "<p><img class=\"aligncenter box-shadow\" title=\"A Day in the Life of the Wolfram High School Summer Camp\" src=\"https://content.wolfram.com/uploads/sites/39/2022/10/summer-camp-hero.png\" alt=\"A Day in the Life of the Wolfram High School Summer Camp\" width=\"620\" height=\"315\" /></p>\n<p>In July 2022, we officially began the annual <a href='https://education.wolfram.com/summer-camp/'>Wolfram High School Summer Camp</a> with a single mission: sharpen the campers’ minds and dive deep into topics for the betterment of the future of the world. All campers can agree that this was a life-changing experience. The first mission of camp? Get to know the Zoom Overlords—the camp directors—who marshaled campers through all the activities. Camp challenges started right away! <span id=\"more-85905\"></span></p>\n<p>My name is Anika and I was the lead teaching assistant and a junior mentor at camp this year. I was a camp student myself in 2020, and in 2021 served as a mentor at the <a href='https://education.wolfram.com/middle-school-camp/'>Wolfram Middle School Summer Camp</a> and a teaching assistant at the High School Summer Camp. I also participated in the <a href='https://education.wolfram.com/emerging-leaders-programs/high-school/'>Wolfram Emerging Leaders Program: High School</a> in 2021, and I’m about to start the <a href='https://education.wolfram.com/emerging-leaders-programs/undergraduate/'>Wolfram Emerging Leaders Program: Undergraduate</a> this fall. </p>\n<h2 id=\"first-thing-in-the-morning-we-are-having-fun\">First Thing in the Morning We Are Having… Fun?</h2>\n</p>\n<p>“I think this may be more effective if we include cellular automata,” one camper pointed out over a heated debate on the best team mascot. No, we don’t just work the whole time at camp. One of the best parts is actually meeting with people! Students come from all over the world—from South Korea to India, California and more—which means that camp “mornings” start anywhere from 6am to 7pm.</p>\n<p>Combining the creativity of campers with completely different global educations and cultural backgrounds is a key part to building the camp community. Incorporating this diversity of ideas allows us to produce both innovative and viable projects.</p>\n<p>This mishmash of ideas came to life not only during academic activities, but also during social activities! These team mascots represented the creativity of each team. The impeccable arrangement of these masterpieces artfully represented the groups and were eternalized in Slack as emojis to be used throughout camp:</p>\n<table >\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img1.png\" alt='Team mascot proposals' title='Team mascot proposals' width='470' height='336' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img1_copy.txt\">\n\t\t\t\t\t<span class='close' id='1_out'>&#10005</span></p>\n<pre class='text' id='1_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<h2 id=\"time-to-learn\">Time to Learn!</h2>\n</p>\n<p>Now, there are a few things famously sacrilegious in <a href='https://www.wolfram.com/language/'>Wolfram Language</a>, two being for loops and return statements. With many campers already having a background in Python, Java or other languages where these are heavily used, this was a major mindset shift.</p>\n<p>“NO FOR LOOPS!!!” was driven home to the point of being memeified throughout camp; everyone knew that using a for loop or return statement in their code would lead to their imminent doom.</p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img2.png\" alt='Memes from Summer Camp students' title='Memes from Summer Camp students' width='470' height='234' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img2_copy.txt\">\n\t\t\t\t\t<span class='close' id='2_out'>&#10005</span></p>\n<pre class='text' id='2_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<p>The camp wasn’t just all Wolfram coding. From <a href='https://www.mpdatascience.com/'>multiparadigm data science</a> to <a href='https://community.wolfram.com/groups/-/m/t/2144165'>political idea blocking</a>, you could say that everybody’s brains were filled to the brim. We were going to make sure that they were going to pack in a lot more in the next few weeks.</p>\n<h2 id=\"lunchtime\">Lunchtime</h2>\n</p>\n<p>As much as we all loved deep frying, reconstructing, refreezing and thoroughly enlightening our brains, we equally loved the social activities during lunch. Although it may have been intimidating at first, many came to realize throughout camp that—whether they were a linguistics lover, chemistry connoisseur or a physics phenom—everyone actually had a lot of similar interests! You might have found yourself defeating someone mapping ocean trajectories with the <a href='https://www.wolframalpha.com/input?i=runge+kutta+method'>Runge–Kutta method</a> in an intense game of <a href='https://skribbl.io/' target=_blank rel=noopener>skribbl.io</a>, or realizing that you love the same TV show as someone on the other side of the globe. </p>\n<h2 id=\"head-smashing-hour-aka-project-time\">Head-Smashing Hour (AKA Project Time)</h2>\n</p>\n<p>One of the main products of camp is the individual projects. Projects ranged from conducting a sentiment analysis on the iconic show <em>The Office</em> to analyzing the multiway graphs of mancala, but there were a lot of universal experiences. “AAAAGH WHY WON’T THIS WORK” was quickly followed by “I forgot to remove the semicolon” and “There was already a function for this?!”, and the taste of defeat was quickly overpowered by a victory against fickle lines of code only a few minutes later. The wide range of emotions caused by coding (and debugging) is a universal experience that all of us who use any programming language go through. The small triumphs—finally getting the Reddit API to work in your favor, or weeding out that one bug in your intricate visualizations, or even creating beautiful representations of complex topics—all contribute to that sweet, sweet victory.</p>\n<p>Handling advanced and uncharted territory is especially difficult, but the satisfaction of overcoming those challenges is immeasurable. This is the best motivator that can often keep you coding very late into the night—or morning for international students. Finally seeing the final result of the projects after hammering at it (and smashing your head against your keyboard) for more than two weeks was a highlight for many; the “I FINALLY GOT IT!!!” moment is priceless.</p>\n<p>Many of the projects have visualizations alongside them to illustrate their complex concepts. Following are a few that campers were particularly proud of. If you want to understand what these specific visualizations are, you should definitely <a href='https://www.wolframcloud.com/obj/microsites/summercamp/projects.html'>check out all the camp projects</a>!</p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img3.png\" alt='Samples from Summer Camp projects' title='Samples from Summer Camp projects' width='470' height='139' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img3_copy.txt\">\n\t\t\t\t\t<span class='close' id='3_out'>&#10005</span></p>\n<pre class='text' id='3_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<h2 id=\"wait-we-get-to-have-more-fun-in-the-evening\">Wait… We Get to Have More Fun in the Evening?</h2>\n</p>\n<p>As much fun as we had doing project work and coding at camp, it was still a summer camp, and we got to do even more awesome activities after the end of the academic day.</p>\n<p>One of my favorite end-of-day social activities was PowerPoint karaoke. That’s when the speaker has to make up a presentation on the spot—but the kicker is that they have never seen their slides before. Students used quick and out-of-the-box thinking to sell products with surprise features and educate us on fantasy facets of marine biology.</p>\n<p>The last, but certainly not the least, part of camp is meeting <a href='https://www.stephenwolfram.com/'>Stephen Wolfram</a>. Initially, the nervousness of meeting a CEO and super-genius stifled the conversation, but as people warmed up, they quickly dove deep into animated conversations. Everything from describing current school life to cellular automata and physics (of course) was on the table. Sometimes, these conversations got intense—like when Stephen somehow ended up being sacrificed to the fire gods during a discussion: </p>\n<table>\n<tbody>\n<tr>\n<td colspan='1' rowspan='1' class='Input'>\n<div>\n\t\t\t\t\t<img class='' src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img4.png\" alt='Zoom session with Stephen Wolfram' title='Zoom session with Stephen Wolfram' width='470' height='350' />\n\t\t\t\t</div>\n<div class='IFL' data-src=\"https://content.wolfram.com/uploads/sites/39/2022/10/ap100422img4_copy.txt\">\n\t\t\t\t\t<span class='close' id='4_out'>&#10005</span></p>\n<pre class='text' id='4_out_text'></pre>\n</p></div>\n</td>\n</tr>\n</tbody>\n</table>\n<p><span></p>\n<h2 id=\"closing-thoughts\">Closing Thoughts</h2>\n</p>\n<p>After camp, some will go on to do internships, others will opt to be part of more Wolfram programs, such as the <a href='https://education.wolfram.com/emerging-leaders-programs/'>Wolfram Emerging Leaders Program</a>, and the vast majority will become billionaires due to their novel thinking (naturally). Although everyone will do different things, many are inspired by the things they learn in camp—especially the skill of applying computational thinking to almost any topic. From coding their own smart mirrors, creating their own programming languages or engineering quality-of-life solutions for their daily routines, everyone from camp consciously (or unconsciously) integrates what they learn into their day-to-day lives. </p>\n<p>Last but not least, I wouldn’t be me if I didn’t shamelessly plug everyone’s projects one last time. <a href='https://www.wolframcloud.com/obj/microsites/summercamp/projects.html'>Go check them out</a>!</p>\n<div class=\"special-offer blue\" style=\"padding-bottom: 20px\">\n<table>\n<tbody>\n<tr>\n<td width=590px>Learn more and stay informed about <a href='https://education.wolfram.com/summer-camp/'>Wolfram High School Summer Camp</a>!</td>\n</tr>\n</tbody>\n</table>\n</div>\n",
  "wfw:commentRss": "https://blog.wolfram.com/2022/10/05/a-day-in-the-life-of-the-wolfram-high-school-summer-camp/feed/",
  "slash:comments": 0
}