{
  "title": "Episode 80: Talking (and not Talking) in Psychotherapy - Part 1",
  "pubDate": "Mon, 08 Dec 2008 21:52:34 +0000",
  "guid": "episode-80-talking-and-not-talking-in-therapy-",
  "link": "http://www.thepsychfiles.com/2008/12/07/episode-80-talking-and-not-talking-in-therapy-part-1/",
  "itunes:image": "",
  "description": "Are you interested in play therapy or therapy with children and adolescents? Do you have a child in therapy and you wonder how playing with toys is going to possibly help you child?  Learn more about therapy with children and adolescents in this episode of The Psych Files.  In part 1 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis.  If you've ever wondered what psychotherapists do and say in therapy then this episode is for you.  We also touch upon evidence based treatment, goals in therapy, and parent expectations of therapists.  Come have a listen to an experienced therapist talk about her work.",
  "content:encoded": "Are you interested in play therapy or therapy with children and adolescents? Do you have a child in therapy and you wonder how playing with toys is going to possibly help you child?  Learn more about therapy with children and adolescents in this episode of The Psych Files.  In part 1 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis.  If you've ever wondered what psychotherapists do and say in therapy then this episode is for you.  We also touch upon evidence based treatment, goals in therapy, and parent expectations of therapists.  Come have a listen to an experienced therapist talk about her work.",
  "enclosure": "",
  "itunes:duration": "34:40",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,play,Psychotherapy,Therapy",
  "itunes:subtitle": "In part 1 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis. Come have a listen to an experienced therapist talk about her work.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Are you interested in play therapy or therapy with children and adolescents? Do you have a child in therapy and you wonder how playing with toys is going to possibly help you child? Learn more about therapy with children and adolescents in this episode of The Psych Files. In part 1 I interview Dr. Martha Strauss - experienced therapist and author of No Talk Therapy and the book Adolescent Girls in Crisis. If you've ever wondered what psychotherapists do and say in therapy then this episode is for you. We also touch upon evidence based treatment, goals in therapy, and parent expectations of therapists. Come have a listen to an experienced therapist talk about her work."
}