{
  "id": "yt:video:0WkXHQSbWWo",
  "yt:videoId": "0WkXHQSbWWo",
  "yt:channelId": "UCL-g3eGJi1omSDSz48AML-g",
  "title": "A Plague Tale: Requiem - Launch Trailer",
  "link": "",
  "author": {
    "name": "NVIDIA GeForce",
    "uri": "https://www.youtube.com/channel/UCL-g3eGJi1omSDSz48AML-g"
  },
  "published": "2022-10-19T13:00:01+00:00",
  "updated": "2022-10-19T13:00:03+00:00",
  "media:group": {
    "media:title": "A Plague Tale: Requiem - Launch Trailer",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A Plague Tale: Requiem, the direct sequel to the critically acclaimed and award-winning A Plague Tale: Innocence, has finally arrived.\n\nPlayers can embark on a breathtaking adventure, reuniting fans of the series with Amicia and Hugo De Rune and welcoming new players into the brutal medieval world of the game. Watch the launch trailer for a glimpse of the emotional and visually stunning journey available now.\n\nThe heartrending story of Amicia and Hugo De Rune continues. Embark on their next journey and venture south of 14th century France before setting sail to a mysterious island out in the Mediterranean Sea. Brave a terrible fate, looking for the cure to heal Hugo’s illness, and discover the cost of saving those you love in a desperate struggle for survival within a dark, plague-ridden medieval world twisted by otherworldly forces.\n\nThis new chapter stays true to the series’ defining sense of history and strong narrative direction and expands gameplay possibilities, granting extra freedom to players within a more open environment. Choose to strike from the shadow or to unleash hell, turning to Amicia’s new resources—including the use of alchemy to manipulate fire and the long-distance power of a crossbow, but also her cunning use of terrain and ability to wrestle out of an enemy’s grasp.\n\nDesigned for long-time fans and newcomers alike, this next-gen exclusive production brings a whole new level of realism and immersion, delivering a sublime visual experience through the bright new Mediterranean setting and the characteristic contrast between light and dark of the series.\n\nA Plague Tale: Requiem is now available on PC and on NVIDIA GeForce Now.\n\nGet the game now:https://www.focus-entmt.com/en/games/a-plague-tale-requiem\n\nSubscribe to GeForce! https://www.youtube.com/channel/UCL-g3eGJi1omSDSz48AML-g\n\nGeForce Twitter: https://twitter.com/NVIDIAGeForce \nGeForce Facebook: https://www.facebook.com/NVIDIAGeForce/ \nGeForce Instagram: https://www.instagram.com/nvidiageforce/ \nGeForce Community Portal: https://www.nvidia.com/en-us/geforce/community-portal/\n\n#aplaguetalerequiem\n#RTXOn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}