{
  "title": "In 1961, the First Robot Arm Punched In",
  "link": "https://spectrum.ieee.org/unimation-robot",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-robot-arm-sitting-on-a-rectangular-base-with-control-panels-at-the-back.jpg?id=31198107&width=1200&height=800&coordinates=0%2C125%2C0%2C125\"/><br/><br/><p><strong>When they met </strong>at a cocktail party in 1956, <a href=\"https://spectrum.ieee.org/george-devol-a-life-devoted-to-invention-and-robots\" target=\"_self\">George Devol</a> and <a href=\"https://www.automate.org/a3-content/joseph-engelberger-about\" target=\"_blank\">Joseph Engelberger</a> instantly bonded over their love of science fiction, happily chatting about Isaac Asimov and his theories on robotics. Then the conversation turned more serious.  </p><p>Two years earlier, Devol had filed a <a href=\"https://patents.google.com/patent/US2988237A\" target=\"_blank\">patent</a> for a general-purpose manipulator for performing repetitive tasks, and he was looking for a financial backer. Engelberger was curious about how to apply flexible machines for factory automation. By the end of the evening, a plan was in motion that would change the world of manufacturing.  </p><hr/><h2>How the first industrial robot got its start </h2><p>Devol and Engelberger seemed an unlikely pair. Devol was an inventor and entrepreneur who had founded several companies to commercialize his <a href=\"https://gizmodo.com/five-little-known-inventions-from-deceased-robot-maker-5831586\" target=\"_blank\">various inventions</a>. After graduating from high school in 1932, he had started United Cinephone, to improve sound quality on the new talking motion pictures. He quickly moved on to other inventions, including the <a href=\"https://pdfpiw.uspto.gov/.piw?PageNum=0&docid=02243310\" target=\"_blank\">Phantom Doorman</a>, an automated door-opening system; a proximity-controlled laundry press, the patent for which was withheld by the U.S. government through World War II; and the <a href=\"https://www.thehenryford.org/collections-and-research/digital-collections/artifact/373945/\" target=\"_blank\">Speedy Weeny</a>, a vending machine that dispensed hot dogs cooked by microwaves.  </p><p>Meanwhile, Engelberger was pursuing a more traditional corporate career. He had earned a bachelor’s degree in physics in 1946 and a master’s in electrical engineering in 1949, both from Columbia University. When he met Devol, he was working as an engineer for Manning, Maxwell, and Moore, a company that specialized in <span></span>safety valves, pressure gauges, and other industrial control equipment. But that soon changed.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Black and white photo of two men at a bar being served drinks by a robotic arm \" class=\"rm-shortcode\" data-rm-shortcode-id=\"fff4b26db63b63e840310e88f44708d2\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"85d44\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/black-and-white-photo-of-two-men-at-a-bar-being-served-drinks-by-a-robotic-arm.jpg?id=31198187&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">A robot serves drinks to Unimation cofounders Joseph Engelberger [left] and George Devol.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">The Henry Ford</small></p><p>Shortly after the cocktail party, the two men founded Unimation, the name a portmanteau of “universal” and “automation,” which Devol had coined when filing his patent. The pair needed funding. A year later, Engelberger founded Consolidated Controls Corp. in an attempt to keep his former team from Manning, Maxwell, and Moore together, after MM&M liquidated the aerospace division that Engelberger had led. Engelberger then convinced Norman Schafler, CEO of Condec Corp. (the parent company of Consolidated Controls), to finance the development of Devol’s invention. Condec eventually purchased Unimation in 1960 and bought Devol’s patent when it was finally issued the next year.</p><p>While Devol’s patent was pending, a team of <span></span>six men set out to turn his idea into a reality. They decided initially to build the mechanical arm with five degrees of freedom. This later evolved into a six-axis machine that emulated the human shoulder, elbow, and wrist. It had a self-contained hydraulic supply operating at 6.9 megapascals (1,000 pounds per square inch). The men had to invent both the programming controls and memory systems, as well as the digital optical encoders for determining shaft positions. Weighing in at about 1,360 kilograms (3,000 pounds), the prototype was a beast, but it could pick up parts of up to 45 kg (100 pounds); later models could handle objects five times as heavy. The Unimate was both squatter and wider than the average worker, measuring 1.6 meters high, 1.2 meters wide, and 1.5 meters deep. </p><p>This video from <a href=\"https://www.thehenryford.org/\" target=\"_blank\">The Henry Ford</a>, in Dearborn, Mich., where the Unimate pictured at top resides, shows the robot in action. </p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"0c0587beb887ea18a70841740e8380a3\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/-Xl2c91pWGc?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">First Industrial Robot Ever Installed on an Assembly Line | Innovation Nation</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=-Xl2c91pWGc\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>Although programmable, the original Unimate <a href=\"https://blog.robotiq.com/the-history-of-robot-programming-languages\" target=\"_blank\">did not have a programming language</a>. Instead, the user would move the machine head to the desired location, and a position detector would record the spot. The user would repeat this process to record a sequence of events that the Unimate could play back. When Unimation acquired <a href=\"https://ethw.org/Oral-History:Victor_Scheinman\" target=\"_blank\">Victor Scheinman</a>’s Vicarm robot, it also acquired the robot’s programming language, <a href=\"https://ieeexplore.ieee.org/abstract/document/762620\" target=\"_blank\">VAL</a>. Beginning in 1973, VAL became a part of Unimation’s industrial robots.<br/></p><h2>How the Unimate fit into GM’s automation plans </h2><p>As Devol and the team worked out the technical details, Engelberger tried to find a market and customers for the new robot. He visited 15 automobile factories and 20 other manufacturers, trying to assess the industrial needs for a robotic arm. General Motors was the first company to bite.  </p><p>On a fateful day in 1961, the Unimate pictured at top took its place on the assembly line of General Motors’ Ternstedt plant, in Trenton, N.J. It took over the dirty, dreary, and dangerous job of unloading the finished castings from a die-cast press. Its debut was not particularly glamorous or impressive, but it earned the Unimate a place in history as the first successful application of an industrial robot. </p><p>According to Johanna Wallén’s “<span></span><a href=\"http://www.diva-portal.org/smash/get/diva2:316930/fulltext01.pdf\" target=\"_blank\">The History of the Industrial Robot</a>,” GM paid US $18,000 (about $180,000 today) for the first Unimate, which was a tremendous discount off the estimated $65,000 it took to produce the machine. Engelberger accepted the price because he recognized the value in being able to point to GM as a client. He also had faith that more orders would come in. By the early 1970s, the list price for a Unimate was $35,000. Unimation <a href=\"https://www.nytimes.com/1982/03/21/business/he-brought-the-robot-to-life.html\" target=\"_blank\">didn’t turn a profit</a> until <span></span>1975, 19 years after its founding. </p><p class=\"pull-quote\">In 1961, GM paid $18,000 for its first Unimate, a tremendous discount off the estimated $65,000 it took to produce the machine.</p><p>While Devol was the technical genius, Engelberger had a flair for marketing. At the time, many workers worried that their jobs would be replaced by robots, so Engelberger took pains to make the Unimate seem personable. The robot killed it on “The Tonight Show With Johnny Carson” by opening a can of beer and conducting the band. Engelberger used a slightly different pitch when addressing executives. A spoof résumé for the Unimate said it could work 24 hours per day and was a fast learner that never forgets (except on command), never demands a wage increase, and remains equable, despite abuse. </p><p>Workers at GM’s Trenton plant didn’t initially object to the Unimate. After all, unloading the die-cast machine was a terrible job that no one wanted to do. In 1967, GM installed the first two spot-welding robots at its Norwood, Ohio, plant, also without much controversy. But when the company launched a spot-welding line of 28 robots in 1970 at its Lordstown, Ohio, plant, workers protested. </p><p>The Lordstown plant is often viewed as a textbook example of factory workers revolting against automation. The new line of robots was just part of a bigger plan to ratchet up productivity. GM had chosen Lordstown to produce its first subcompact car, the Chevrolet Vega. In 1971, the General Motors Assembly Division retooled the plant to increase efficiency, resulting in the layoffs of at least 700 workers, the reassignment of hundreds more, and the elimination of 300 to 500 line jobs considered too easy for human workers. They also increased line speeds by 67 percent, from 60 cars per hour to 101 cars per hour, with the aim of producing nearly 400,000 Vegas in 1972.  </p><p>To meet production quotas, management established mandatory overtime with shifts running 11 to 12 hours including weekends. When employees objected, supervisors reacted by firing or laying off the most militant. Workers filed over 16,000 grievances and began staging strikes, blocking the front gates, and threatening supervisors. In March 1972, a strike completely shut down the plant for 22 days. </p><p>It seems likely that the experience at Lordstown tainted Unimation’s reputation in the United States. In any event, the company was slow to find a market in its home country. </p><h2>Unimation helped spark the industrial robotics revolution in Japan  </h2><p>Unimation had much <a href=\"https://robotics.kawasaki.com/en1/anniversary/history/history_01.html\" target=\"_blank\">better success in Japan</a>. In 1966, Engelberger held a multihour question-and-answer session with hundreds of leaders in Japanese industry, in hopes of finding a technical partner for manufacturing its robots in Japan. Interest was intense, and Kawasaki Aircraft Industries aggressively fought for the deal, eventually winning over Engelberger. In June 1968, Kawasaki Aircraft opened its Office for Promoting Domestic Production of Industrial Robots, and the following October it announced a partnership with Unimation. The first Kawasaki-Unimate 2000 was completed in 1969 and cost 12 million yen per unit. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Black and white photo of a large robotic arm on a massive base that is almost as tall as the 4 men standing behind it.\\u00a0\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b7a3d3d9b0a0865d0b7731ddcd2be8a1\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"522b5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/black-and-white-photo-of-a-large-robotic-arm-on-a-massive-base-that-is-almost-as-tall-as-the-4-men-standing-behind-it-u00a0.jpg?id=31199575&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The Unimate was designed to automate the “dirty, dreary, and dangerous” jobs that human workers didn’t want to do.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">The Henry Ford</small></p><p>Similar to the U.S. manufacturers that first deployed robots for the dirty, dangerous, and dreary jobs, Japanese companies used the Unimate to tackle the “3K” jobs: <em>kitsui</em> (difficult), <em>kitanai</em> (dirty), and <em>kiken</em> (dangerous). They targeted welding positions, which they were struggling to fill. Working day and night, a Kawasaki-Unimate welder did the work of 20 human welders. Still, it took a decade to be widely adopted. </p><p class=\"pull-quote\">By the mid-1980s, Japan had become a robot kingdom, boasting nearly 70 percent of all the robots in the world. </p><p>In the 1970s, Unimation expanded into human-scale robotic arms when it acquired Vicarm, which it rebranded the Programmable Universal Machine for Assembly, or PUMA. The company worked with General Motors to develop the PUMA for light assembly work. In contrast to the hulking Unimate, the PUMA was designed to manipulate small items, such as installing lightbulbs. According to Dick Beecher, director of robotics and artificial intelligence at General Motors during this time, about 95 percent of the parts in an automobile weigh less than 1.5 kg, and GM had thousands of human workers doing “light assembly.” It was a growth market for robots.  </p><p><span></span>In 1983, Condec sold Unimation to Western Electric for $107 million. Engelberger shifted his focus to service robots, seeing an opportunity for automating home and hospital health care. Devol continued to invent but moved away from robotics. Together, the two men are often referred to as the father (Engelberger) and grandfather (Devol) of industrial robots. </p><p>Although the Unimate debuted in the United States, it built its reputation in Japan and helped propel the use of industrial robots there. By the mid-1980s, Japan had become a robot kingdom, boasting nearly 70 percent of all the robots in the world. Robots have since spread across the globe and transformed many industries—but the spark was a chance conversation over cocktails. </p><p><em>Part of a </em><a href=\"https://spectrum.ieee.org/search/?q=past+forward\" target=\"_self\"><em>continuing series</em></a><em> </em><em>looking at photographs of historical artifacts that embrace the boundless potential of technology.</em> </p><p><em>An abridged version of this article appears in the September 2022 print issue as “Unimate Punches In.”</em></p>",
  "pubDate": "Tue, 30 Aug 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/unimation-robot",
  "category": [
    "Joseph engelberger",
    "Past forward",
    "Unimate",
    "George devol",
    "Industrial robot",
    "Type:departments"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}