{
  "title": "126: The Man Who Would Be Polka King",
  "link": "https://audioboom.com/posts/7543867",
  "itunes:episode": 126,
  "itunes:title": "The Man Who Would Be Polka King",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3422,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>UMMMMMM, So we have a lot of questions. We can’t wait for you to meet Jan Lewan, the “Polka God” at the center of this thing. But we also can’t wait for you to meet his wife Rhonda, who definitely didn’t win the Mrs. Pennsylvania 1998 pageant, no matter what she tells you. And look, there’s no getting around it, there’s a lot of polka and super old people in this one. But also fraud and a SUPER PISSED accordion player. Also, The Pope (do you capitalize the The in The Pope? Whatever) makes an appearance, and Patrick gets a new drag name. This one is jam packed with laughs at just the right time, so enjoy and then CALL YOUR MOTHER, she’s wondering how you’re doing.<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 31 Mar 2020 04:01:00 +0000",
  "guid": "tag:audioboom.com,2020-03-31:/posts/7543867",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}