{
  "id": "tag:blogger.com,1999:blog-8913912091036362264.post-5945903701607087985",
  "published": "2020-04-22T10:00:00.000-07:00",
  "updated": "2020-04-22T10:00:04.587-07:00",
  "title": "YouTube Originals announces slate of new content amidst COVID-19 #WithMe initiatives",
  "content": "YouTube Originals today announced a new slate of projects aimed to support, entertain and educate viewers around the world.  Among the announcements, celebrities and educators come together to energize distance learning in “Celebrity Substitute” including Karlie Kloss working through a coding problem and Ken Jeong giving a Biology lesson; a weekly series “Stay Home With: YUNGBLUD,” following the UK recording artist and his band as they adjust to a remote lifestyle while creating music; a short-form family series, “Create Together #WithMe,” hosted by Joseph Gordon-Levitt featuring the creations of everyday people collaborating to make art on HITRECORD and YouTube while being at home; and “The Secret Life of Lele Pons” which gives an intimate look at battling Tourette Syndrome and OCD while juggling life in the spotlight. <br /><br />In addition, engaging new content will come directly from notable YouTube personalities who will be able to leverage the global platform’s quality livestream capabilities from a safe space. Kicking off this new wave of content is a first-of-its-kind global live event, \"The Creator Games Presented by MrBeast,\" hosted by top Creator and philanthropist <a href=\"https://www.youtube.com/channel/UCX6OQ3DkcsbYNE6H8uQQuVA\" target=\"_blank\">MrBeast</a> (34M subscribers) on April 25, where he will challenge some of the platform’s biggest stars to remotely go head-to-head in a battle of stay-at-home games where there can be only one winner.  The proceeds will go to a COVID-19-related charitable organization. <br /><br />\"YouTube’s greatest strength is its ability as a global platform to build community and connection among people from all walks of life,” said Susanne Daniels, Global Head of Original Content for YouTube. \"We’re working to develop exciting new original content that is relevant, useful, and entertaining in order to deepen those connections and give people an outlet to come together.\"  <br /><br />Also, as part of YouTube’s continued commitment to families, beginning in May, several new kids &amp; family Originals will launch and be available on YouTube and <a href=\"https://www.youtube.com/intl/ALL_us/kids/\" target=\"_blank\">YouTube Kids</a>. These new Originals will help inspire kids’ curiosity, creativity, resourcefulness and resiliency during these unusual times.  <br /><br />Below is the current list of planned new Originals rolling out within the next few months:  <br /><br /><h3>\"Money Talks: Taxes\" —&nbsp;<a href=\"https://www.youtube.com/playlist?list=PLJEQBmLpTgd9t_b5Ehq0jKnwwi2kIO_zX\" target=\"_blank\">Streaming now!</a></h3><br />In this new Learning Playlist, a roundtable of leading female financial experts provide answers to the questions surrounding personal finances that we are all desperate to know. Offering a step by step guide for viewers, this first series of videos covers pressing questions about filing taxes and the COVID-19 stimulus check.  “Money Talks” is produced by Refinery29.  <br /><br /><h3>\"The Creator Games Presented by MrBeast\" — Live stream premieres April 25 at 6:00 p.m. ET / 3:00 p.m. PT</h3><br />A global LIVE event where popular YouTube creator, <a href=\"https://www.youtube.com/channel/UCX6OQ3DkcsbYNE6H8uQQuVA\" target=\"_blank\">MrBeast</a> (34M subscribers), challenges the platform’s biggest stars to remotely go head-to-head in a first-of-its-kind battle of stay-at-home games where there can be only one winner. “The Creator Games Presented by MrBeast” will encourage viewers to donate to support COVID-19-related charitable organizations and is produced by Night Media and Fly On the Wall.  <br /><br /><h3>\"Stay Home With: YUNGBLUD\" — Series premieres April 27</h3><br />This weekly episodic series follows UK recording artist, <a href=\"https://www.youtube.com/channel/UCd3Llj2WWJh8ItfYl32eJ4Q\" target=\"_blank\">YUNGBLUD</a>, through a month at a rental apartment in L.A. Along with four friends - his manager, videographer and two bandmates with whom he is quarantined - YUNGBLUD attempts to shoot a music video, write new songs, cook meals and stay connected to his UK-based family and avid global fanbase, all within the disconcerting shelter-at-home restrictions. “Stay Home With: YUNGBLUD” will encourage viewers to donate to support <a href=\"https://www.nokidhungry.org/\" target=\"_blank\">No Kid Hungry</a> and is produced by Stick Figure Entertainment.  <br /><br /><h3>\"#MoveWithMe\" — Global Dance Event premieres April 29</h3><br />In celebration of International Dance Day (April 29), this special will feature acclaimed choreographer <a href=\"https://www.youtube.com/channel/UCczFdwWpVEpoqb-eMm4c4dQ\" target=\"_blank\">Matt Steffanina</a> as host, and talented dancers and choreographers from across the globe as they come together to provide dance-lovers with high octane performances to today’s chart topping songs in a way that can only be done on YouTube. Choreographers and dancers including <a href=\"https://www.instagram.com/boomkack/?hl=en\" target=\"_blank\">LaurieAnn Gibson</a>, <a href=\"https://www.youtube.com/channel/UClQfOYEr5zYoixhg_3_y-8Q\" target=\"_blank\">WilldaBeast Adams</a>, <a href=\"https://www.youtube.com/channel/UCdWiqyd8RMx_qhCadO19k0g\" target=\"_blank\">Chachi Gonzales,</a> <a href=\"https://www.youtube.com/channel/UCFMV_BbD2Bk6SFR7H0NenBQ\" target=\"_blank\">Kasia Jukowska</a>, <a href=\"https://www.youtube.com/watch?v=ke2Tz-R3UmQ\" target=\"_blank\">Vale Merino</a>, <a href=\"https://www.youtube.com/channel/UCrCrHVA0_WTH1vmn_13eGeg\" target=\"_blank\">Sonali Bhadauria</a>, <a href=\"https://www.youtube.com/channel/UCl_AQeO6ynSDRSjclc1e16Q\" target=\"_blank\">FitDance</a>, <a href=\"https://www.youtube.com/channel/UCtonvIbWn0GS8dqkdrU2D0A\" target=\"_blank\">Kaelynn KK Harris</a>, <a href=\"https://www.youtube.com/user/TwistAndPulse\" target=\"_blank\">Twist And Pulse</a>, <a href=\"https://www.youtube.com/user/theDOMINICshow/featured\" target=\"_blank\">D-trix</a> and more will be featured. <a href=\"https://ql.mediasilo.com/#ql/5e9f3514e4b022ecdc364cf7/d8a4f03b-ed04-46fb-84a9-e263e80ffd77\" target=\"_blank\">“#MoveWithMe”</a> will encourage viewers to donate to support the COVID-19 Solidarity Response Fund for WHO during the event and is produced by Den of Thieves. <br /><br /><h3>\"Stream #WithMe (UK)\" — Live stream premieres April 30</h3><br />In “Stream #WithMe”, a star-studded crew of some of the UK’s most loved YouTube creators and stars let us in on how they are coping with the lockdown experience in a livestream celebration of solidarity. The all-star group of creators and celebrities will share tips on how to keep entertained, upbeat, and active as they tag-team their way through four hours of joyful unexpected performances and exciting challenges culminating in an almighty stunt for the nation. “Stream #WithMe\" will encourage viewers to donate to support <a href=\"https://www.nhscharitiestogether.co.uk/\" target=\"_blank\">NHS Charities Together</a> and is made in partnership with Electric Robin (part of EndemolShine UK). <br /><br /><h3>\"Celebrity Substitute\" — Series premieres May 7</h3><br />Around the world, millions of students are joining virtual classrooms as part of the current distance learning initiative and teachers are looking for ways to keep their students engaged and focused to stay on target with their curriculum. In this series, some of the brightest celebrities and educators come together to energize distance learning. In each episode, a celebrity steps in to teach crucial high school lessons with real teachers. Some examples include Karlie Kloss working through a coding problem, or Ken Jeong giving a biology lesson that will be remembered for years to come. Additional celebrity substitutes include: Bill Nye, Camila Mendes, Janelle Monáe, and Terry Crews. “Celebrity Substitute” is produced by B17 Entertainment. <br /><br /><h3>\"The Secret Life of Lele Pons\" — Series premieres May 19</h3><br />In this raw and intimate five-part series, internet personality and music artist <a href=\"https://www.youtube.com/channel/UCi9cDo6239RAzPpBZO9y5SA\" target=\"_blank\">Lele Pons</a> shares a side to her that no one knows about… Her lifelong struggle with Tourette Syndrome and OCD. Viewers will follow along on her journey of building and expanding her music career while battling what was previously hidden. Link to official trailer <a href=\"https://www.youtube.com/watch?v=eNh898LDiNc\" target=\"_blank\">HERE</a>. “The Secret Life of Lele Pons” is a Shots Studios Production. <br /><br /><h3>\"BookTube - Read with Me Special and Mental Health Episode\" — Premieres May 21 and June 2020</h3><br />The critically-acclaimed monthly book club, “BookTube,” is creating a special “Read With Me” episode premiering  May 21.  Now more than ever, people around the world are turning to books to help them feel connected. This special episode will feature several celebrities, booktubers, and authors - including Melinda Gates, John Grisham, James Patterson, Elizabeth Gilbert, Nicholas Sparks, Elaine Welteroth, and many more - sharing their current book recommendations.  Additionally, the June 2020 episode of “BookTube” will feature authors Dr. Vivek Murthy, former U.S. Surgeon General (author of Together: The Healing Power of Human Connection in a Sometimes Lonely World), Lori Gottlieb (author of Maybe You Should Talk to Someone) and Haemin Sunim (author of The Things You Can Only See When You Slow Down) discussing anxiety, mental health, and advice for self care during these uncertain times. “BookTube” is produced by Boardwalk Pictures. <br /><br /><h3>\"Create Together #WithMe\" (working title) — Series premieres May 2020</h3><br />This mini-series, hosted by Joseph Gordon-Levitt, invites friends and families from all over the world who are coping with this unprecedented time of isolation to come together and showcase their creativity and collaboration. Rather than profiling lone artists and showcasing their finished work, each weekly episode will document the creative process as people find each other online and remotely collaborate on a variety of family friendly projects—short films, short documentaries, music videos, and more. Anybody can come be a part of the show on HITRECORD, Gordon-Levitt’s Emmy-winning platform for creative collaboration.  “Create Together #WithMe”  is produced by Brian Graden Media and HITRECORD. <br /><br /><h3>\"Locked Down\" (working title) — Scripted series premieres May 2020</h3><br />A social media mystery in a social distancing era! This scripted event series follows a group of bored teens working together online to solve a mystery involving one of their neighbors. Shot entirely via webcam and smartphone, “Locked Down” is a suspenseful look at how young people stay in touch while having to stay away, as well as what happens when boredom leads to suspicion. The story unfolds almost in real-time as the friend group works together - from a distance - to solve the mystery, while also exploring their own anxieties and frustrations about life during a pandemic. “Locked Down” is created and produced by Toronto-based Sinking Ship Entertainment (Dino Dana, Endlings, Odd Squad).   <br /><br /><h3>\"Untitled Juanpa and Luisito Project\" (LATAM) — Series premieres May 2020</h3><br />Latin America’s top YouTube creators Juanpa Zurita (10.2M subscribers) and Luisito Communica (30.6M subscribers) come together for the first time to document an unprecedented situation (COVID-19 quarantine) in an unprecedented way.  Filmed entirely under quarantine with no physical interaction, viewers will hear first hand personal stories from around the globe, including YouTube creators, health specialists, and everyday people as they reflect on their reality. Their challenges, their hopes, their solutions, their stories of inspiration and most importantly the resilience of human nature.  This limited series will give a voice to individuals around the globe to unify us regardless of region or language. This project is produced by  DW Entertainment &amp; Media. <br /><br />These new projects join a robust slate of learning, music and personality-focused original series and specials including <a href=\"https://www.youtube.com/playlist?list=PLEA9mf3ZJGFwEZuqoYbJGWxIxUux_Gyis\" target=\"_blank\">“Kevin Hart: What the Fit,”</a> (new episodes premiere each Thursday), YouTube Originals’ first beauty competition series, <a href=\"https://www.youtube.com/watch?v=oWjlp7B8DAA\" target=\"_blank\">“Instant Influencer with James Charles”</a> (premiering April 24), <a href=\"https://www.youtube.com/watch?v=q1vg-PRf3hU\" target=\"_blank\">“TWICE: Seize the Light,”</a> an 8-part docu-series on the K-pop girl group (premiering April 29 KST) and <a href=\"https://www.youtube.com/watch?v=jf9Iue_Fwhs\" target=\"_blank\">“Dude Perfect: Backstage Pass”</a> chronicling the YouTube supergroup’s rise to fame (premiering May 11).  Personality-driven projects including third seasons of hit scripted series <a href=\"https://www.youtube.com/channel/UCe9DTWmhhxeKyYHL4mldGcA\" target=\"_blank\">“Cobra Kai”</a> and <a href=\"https://www.youtube.com/watch?v=aDZxEYmcCGo&amp;vl=en\" target=\"_blank\">“Liza on Demand,”</a> “This is Paris” starring Paris Hilton and an unprecedented live event with David Blaine are scheduled to come later this year. <br /><br />As part of YouTube Originals’ programming strategy, YouTube’s audience of two billion logged-in monthly users will continue to have the opportunity to enjoy new, upcoming original series and specials, focused on music, learning, personalities and kids &amp; families, for free with ads. YouTube’s subscription service, YouTube Premium, will continue to offer ad-free access to all YouTube Originals as well as bingeabilty and exclusive content for select programs behind the paywall. <br /><br />This news comes on the heels of YouTube’s recent announcements to release popular legacy and kids &amp; family original content in front of the paywall, and the larger global initiative to encourage the world to stay home and save lives through the platform’s At Home <a href=\"https://www.youtube.com/watch?v=6egQkFx7UkM&amp;feature=emb_logo\" target=\"_blank\">#WithMe </a>campaign. The campaign expands upon #WithMe -- a trend continuing to grow on YouTube over the past 15 years -- showcasing how people all around the world find community and engage with one another, especially during this time of crisis. From <a href=\"https://www.youtube.com/channel/UC78cxCAcp7JfQPgKxYdyGrg\" target=\"_blank\">Emma Chamberlain</a>, <a href=\"https://www.youtube.com/channel/UC7_YxT-KID8kRbqZo7MyscQ\" target=\"_blank\">Markiplier</a> and <a href=\"https://www.youtube.com/channel/UCITqR49EAUY8i1vZtXTwe-A\" target=\"_blank\">The Dolan Twins</a>, to <a href=\"https://www.youtube.com/channel/UCH5Qu8Sd-m-7Zk4xc_J5VzA\" target=\"_blank\">Karlie Kloss</a>, <a href=\"https://www.youtube.com/channel/UCVHoXKRuoRs-5x48sP3MNow\" target=\"_blank\">Venus Williams</a>, <a href=\"https://www.youtube.com/channel/UCvpDeGlR5wLP9Z3Tb6K0Xfg\" target=\"_blank\">Sam Smith</a>, <a href=\"https://www.youtube.com/channel/UCAvCL8hyXjSUHKEGuUPr1BA\" target=\"_blank\">Shawn Mendes</a>, <a href=\"https://www.youtube.com/channel/UCWfytcGFwPSMwvP5HYuXGqw\" target=\"_blank\">Hailee Steinfeld</a>, <a href=\"https://www.youtube.com/user/JbalvinTube\" target=\"_blank\">J Balvin</a> and many more, the campaign features YouTube creators, music artists, athletes and celebrities who have all made a home on YouTube.",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube",
    "uri": "http://www.blogger.com/profile/03369985352764236236",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}