{
  "title": "The Lottery Ticket Hypothesis for Vision Transformers. (arXiv:2211.01484v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01484",
  "description": "<p>The conventional lottery ticket hypothesis (LTH) claims that there exists a\nsparse subnetwork within a dense neural network and a proper random\ninitialization method, called the winning ticket, such that it can be trained\nfrom scratch to almost as good as the dense counterpart. Meanwhile, the\nresearch of LTH in vision transformers (ViTs) is scarcely evaluated. In this\npaper, we first show that the conventional winning ticket is hard to find at\nweight level of ViTs by existing methods. Then, we generalize the LTH for ViTs\nto input images consisting of image patches inspired by the input dependence of\nViTs. That is, there exists a subset of input image patches such that a ViT can\nbe trained from scratch by using only this subset of patches and achieve\nsimilar accuracy to the ViTs trained by using all image patches. We call this\nsubset of input patches the winning tickets, which represent a significant\namount of information in the input. Furthermore, we present a simple yet\neffective method to find the winning tickets in input patches for various types\nof ViT, including DeiT, LV-ViT, and Swin Transformers. More specifically, we\nuse a ticket selector to generate the winning tickets based on the\ninformativeness of patches. Meanwhile, we build another randomly selected\nsubset of patches for comparison, and the experiments show that there is clear\ndifference between the performance of models trained with winning tickets and\nrandomly selected subsets.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Shen_X/0/1/0/all/0/1\">Xuan Shen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kong_Z/0/1/0/all/0/1\">Zhenglun Kong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qin_M/0/1/0/all/0/1\">Minghai Qin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Dong_P/0/1/0/all/0/1\">Peiyan Dong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yuan_G/0/1/0/all/0/1\">Geng Yuan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Meng_X/0/1/0/all/0/1\">Xin Meng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tang_H/0/1/0/all/0/1\">Hao Tang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ma_X/0/1/0/all/0/1\">Xiaolong Ma</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_Y/0/1/0/all/0/1\">Yanzhi Wang</a>"
}