{
  "title": "S15 Ep7: I Kissed a Ghost (and I Liked It)!",
  "link": "https://audioboom.com/posts/8098516",
  "itunes:episode": 7,
  "itunes:title": "I Kissed a Ghost (and I Liked It)!",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5141,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS visits with guest Concetta Bertoldi who declares, I Kissed a Ghost (and I Liked It)!<br>\nListen Free Here--><br>\n<br>\nMany people visit a medium to be reassured that their loved ones are nearby. Your grief is only as deep as your love, and those who have died are in the AIR you breathe?they are always in reach. With her trademark warmth and humor, Concetta shows us how to see evidence of ghosts and spirits in this world, and how to accept their help. PLUS some fun and interesting stories from her life and career.<br>\n<br>\nGet her book here: <a href=\"http://amazon.com\">amazon.com</a><br>\n<br>\nVisit her website: <a href=\"https://www.concettabertoldi.com/\">https://www.concettabertoldi.com/</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "BEYOND the DARKNESS visits with guest Concetta Bertoldi who declares, I Kissed a Ghost (and I Liked It)!\nListen Free Here-->\n\nMany people visit a medium to be reassured that their loved ones are nearby. Your grief is only as deep as...",
  "pubDate": "Sun, 19 Jan 2020 10:00:00 +0000",
  "guid": "5ff7af54-57af-421a-bb50-c4374c7f0e8e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}