{
  "title": "574: What Did 'Good' Harry Potter Characters Do That Got On Our Nerves?",
  "link": "https://audioboom.com/posts/8139655",
  "itunes:episode": 574,
  "itunes:title": "What Did 'Good' Harry Potter Characters Do That Got On Our Nerves?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4477,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Inspired by a popular Reddit thread, this week's episode asks the question: what was something that a 'good' character from the <em>Harry Potter</em> series did which rubbed us the wrong way? Are characters like Molly Weasley or Remus Lupin above reproach? You may find yourself nodding along with Andrew, Eric, Micah and special guest Chloé as they detail just what these supposed 'heroes' of the series did to get on our nerves!<br>\n<br>\n\n</div>\n<ul>\n<li>As we announced last week, Chapter By Chapter will be returning soon with Book One! Now that we are all grown-up. Look for it in September!</li>\n<li>Our hosts have recently appeared on each other's other podcasts, including Eric <a href=\"https://millennialshow.com/episode-8x27-time-to-be-real-who-will-run-for-president-2024/\">appearing on #Millennial</a>, and Micah appearing on <a href=\"https://thankyouforspieling.libsyn.com/\">Thank You for Spieling</a>!</li>\n<li>This week's main discussion was inspired by <a href=\"https://www.reddit.com/r/harrypotter/comments/vqehko/what_did_a_character_that_is_considered_good_do/\">this great Reddit thread</a>. Shout-out to Pamela G.'s brother for suggesting!</li>\n<li>Each host picks a supposedly 'good' <em>Harry Potter</em> character and lists their most heinous offenses.</li>\n<li>Molly Wealsey may be the motherly type, but her love is not evenly spread. What did Hermione or Fleur ever do to receive her ire?</li>\n<li>Albus Dumbledore may be the series' biggest 'good guy' after Harry, but his reckless endangerment of students via his choices for DADA staffers are preposterous.</li>\n<li>Remus Lupin was our <em>very favorite</em> teacher, but when it comes to being a dad or a romantic partner, his skills are somewhat lacking.</li>\n<li>Hermione's activism might win her some points, but she's much colder to anything that is somebody else's idea. Especially if she hasn't read about it in a book!</li>\n<li>Consulting <a href=\"https://www.reddit.com/r/harrypotter/comments/vqehko/what_did_a_character_that_is_considered_good_do/\">the Reddit thread</a>, the MuggleCast hosts pick a few more of their favorite examples.</li>\n<li>Why did EVERY adult let Ron use his broken and unsafe wand? Did Dobby go too far when stopping Harry's mail? Did the Weasley Twins go too far trying their products on students?</li>\n<li>August's Bonus MuggleCast will cover personal secrets from the hosts' early days podcasting and working on the Web. The latest Trelawney Tea Edition will be available exclusively <a href=\"https://www.patreon.com/mugglecast/\">via our Patreon</a>.</li>\n<li>Quizzitch: in book canon, what color hair does Firenze have?</li>\n<li>This week's episode is brought to you by MeUndies (Get 20% off your first order and 100% satisfaction guarantee at <a href=\"https://www.MeUndies.com/mugglecast\">MeUndies.com/mugglecast</a>), <a href=\"https://www.shudder.com\">Shudder</a> (Stream 30 days free by using code mugglecast), and Masterclass (Get 15% off an annual subscription at <a href=\"https://www.Masterclass.com/mugglecast\">Masterclass.com/mugglecast</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 16 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-15:/posts/8139655",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}