{
  "title": "S13 Ep143: Courage the Telepathic Dog",
  "link": "https://audioboom.com/posts/8098632",
  "itunes:episode": 143,
  "itunes:title": "Courage the Telepathic Dog",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3765,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS is going to the dogs today! Courage the telepathic Dog that is and his fantastic companion, Karen Rontowski share stories to amuse & amaze,<br>\n<br>\nKaren Rontowski is a traveler, comedian, tarot reader and paranormal investigator. Today she joins the boys to speak of Pookas, Fairies, Ghosts and Animal Spirit Communication. It is a light and breezy fun fare as we slide into the holiday week!<br>\n<br>\nVisit Karen here: <a href=\"https://www.karenrontowski.com/\">https://www.karenrontowski.com/</a><br>\n<br>\nCreate a free account on <a href=\"http://BetOnline.AG\">BetOnline.AG</a> and use the promocode “PodcastOne” to receive a 50% SIGN UP bonus. •\tGo online or use your Mobile phone to sign up today.   And try in-game live betting where you can participate with all the action with every play.    Use the promocode: PodcastOne for a 50% signup bonus and get your holiday shopping done early with their Refer a Friend Promotion! <a href=\"http://Betonline.AG\">Betonline.AG</a>.<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nGo to <a href=\"http://Eaze.com\">Eaze.com</a> in California for your cannabis needs and <a href=\"http://eazewellness.com\">eazewellness.com</a> elsewhere for your CBD. And make sure to use to use the promocode : DARKNESS for $20 off your first delivery!<br>\n<br>\nRobinhood is an investing app that lets you buy and sell stocks, ETFS, options, and cryptos- all commission-free.  Robinhood is giving listeners a FREE stock like Apple, Ford, or Sprint to help build your portfolio! Sign up at <a href=\"http://darkness.robinhood.com\">darkness.robinhood.com</a>.",
  "itunes:summary": "BEYOND the DARKNESS is going to the dogs today! Courage the telepathic Dog that is and his fantastic companion, Karen Rontowski share stories to amuse & amaze,\n\nKaren Rontowski is a traveler, comedian, tarot reader and paranormal investigator....",
  "pubDate": "Sun, 23 Dec 2018 10:00:00 +0000",
  "guid": "38e58adb-493f-463f-8bea-4a16628c6e5e",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}