{
  "title": "Episode #375:  Sinema Paradiso",
  "link": "https://www.krpoliticaljunkie.com/episode-375-sinema-paradiso/",
  "pubDate": "Sun, 10 Oct 2021 20:49:14 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=20994",
  "description": "<p>Sen. Kyrsten Sinema may be driving progressives nuts by thwarting much of President Biden&#039;s agenda, but her actions may be popular back home.  And we remember the unfortunate 2012 campaign gaffe of Todd Akin, who died last week, and who suggested that \"legitimate rape\" would not result in pregnancy.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-375-sinema-paradiso/\">Episode #375:  Sinema Paradiso</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Sen. Kyrsten Sinema may be driving progressives nuts by thwarting much of President Biden&#039;s agenda, but her actions may be popular back home.  And we remember the unfortunate 2012 campaign gaffe of Todd Akin, who died last week,",
  "itunes:summary": "Progressive Democrats trying to help enact President Biden&#8217;s agenda are constantly butting heads with Sens. Joe Manchin of West Virginia and Kyrsten Sinema of Arizona.  They are especially frustrated with Sinema, who began her political career on the left.  But since she came to the Senate in 2019, she&#8217;s been an outspoken opponent of big spending bills and found herself at odds with much of her Democratic colleagues.  Dan Nowicki of the Arizona Republic says that Sinema&#8217;s approach is popular in the state, a state that long supported another maverick, the late John McCain.<br />\nAnd Jo Mannies, a longtime Missouri political reporter, remembers former Congressman Todd Akin, who died last week.  The anti-abortion Akin is best known for his 2012 campaign gaffe when, while running for the Senate, he suggested that women could not get pregnant if she were the victim of &#8220;legitimate rape.&#8221;<br />\nSongs heard in this episode:<br />\n<a href=\"https://www.youtube.com/watch?v=kxI2g1I9s5Q\">Cinema by Benny Benassi</a><br />\n<a href=\"https://www.youtube.com/watch?v=wB9YIsKIEbA\">I&#8217;m a Believer by the Monkees</a><br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 375,
  "itunes:title": "Sinema Paradiso",
  "itunes:duration": "34:46"
}