{
  "title": "CEO Shakeups",
  "itunes:title": "CEO Shakeups",
  "pubDate": "Wed, 29 Jun 2022 20:00:01 +0000",
  "guid": "61706038-d9a5-4a7e-9441-62308b96aeed",
  "link": "https://fool.libsyn.com/ceo-shakeups",
  "itunes:image": "",
  "description": "<p style=\"font-weight: 400;\">CEOs at Pinterest and Bed, Bath, and Beyond are heading for the exits. And that may be just the beginning.<br /> <br /> (0:31) Deidre Woollard and Tim Beyers discuss:<br /> - Where Pinterest has room to grow.<br /> - How stock investors should react to a CEO change.<br /> - Nike’s move to a direct-to-consumer strategy.<br /> <br /> Rachel Warren interviews Ali Parsa, CEO of Babylon Health, a digital-first health service provider. (17:40) They discuss the company’s journey going public and the exciting frontiers of genetic research.<br /> <br /> Stocks mentioned: PINS, DOCU, BBBY, PYPL, NKE, SAP, BBLN<br /> <br /> Host: Deidre Woollard</p> <p style=\"font-weight: 400;\">Guests: Tim Beyers, Rachel Warren, Ali Parsa<br /> Producer: Ricky Mulvey<br /> Engineers: Rick Engdahl, Brandon Gentry</p>",
  "content:encoded": "<p style=\"font-weight: 400;\">CEOs at Pinterest and Bed, Bath, and Beyond are heading for the exits. And that may be just the beginning.  (0:31) Deidre Woollard and Tim Beyers discuss: - Where Pinterest has room to grow. - How stock investors should react to a CEO change. - Nike’s move to a direct-to-consumer strategy.  Rachel Warren interviews Ali Parsa, CEO of Babylon Health, a digital-first health service provider. (17:40) They discuss the company’s journey going public and the exciting frontiers of genetic research.  Stocks mentioned: PINS, DOCU, BBBY, PYPL, NKE, SAP, BBLN  Host: Deidre Woollard</p> <p style=\"font-weight: 400;\">Guests: Tim Beyers, Rachel Warren, Ali Parsa Producer: Ricky Mulvey Engineers: Rick Engdahl, Brandon Gentry</p>",
  "enclosure": "",
  "itunes:duration": "29:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "CEOs at Pinterest and Bed, Bath, and Beyond are heading for the exits. And that may be just the beginning.  (0:31) Deidre Woollard and Tim Beyers discuss: - Where Pinterest has room to grow. - How stock investors should react to a CEO change. -...",
  "itunes:episodeType": "full"
}