{
  "title": "R&lt;-Slovakia meetup started to build community in Bratislava",
  "description": "<p>On 22. March a first special <strong>R</strong> related meetup called <strong>R&lt;-Slovakia</strong> took place. As the name of the meetup group implies, it is based in Slovakia, in its capital - Bratislava. I am very happy to be the first speaker on this event ever. <strong>R&lt;-Slovakia</strong> has the intention to build a community to share knowledge of people who are dealing with <strong>data science</strong>, <strong>machine learning</strong> or related fields. And, of course, of those, who want to start to learn about <strong>R</strong> and about the world of data.</p>\n\n<h2 id=\"topics-of-the-presentation\">Topics of the presentation</h2>\n\n<p>The work on my <strong>PhD. thesis</strong> was the main topic of my presentation, which is still in progress. So, what kind of challenges did I tackle in the field of “mining” smart meter data? I am focused on <strong>clustering of consumers</strong> to produce more accurate forecasts of aggregated electricity consumption. For this task, it is crucial to choose most suitable forecast methods and representations of time series of electricity consumption, which are inputs to the clustering algorithm. I also spoke about <strong>R</strong> “tips and tricks”, that can help to write more effective scripts for this task. Some ideas from the presentation are already published in scientific papers - you can check them in my <a href=\"https://www.researchgate.net/profile/Peter_Laurinec\">ResearchGate profile</a>.</p>\n\n<p>The headlines of the presentation are as follows:</p>\n<ul>\n  <li>Introduction of R</li>\n  <li>Challenges in smart grids</li>\n  <li>Forecasting electricity consumption</li>\n  <li>Suitable methods for forecasting multiple seasonal time series</li>\n  <li>Cluster analysis of consumers</li>\n  <li>R tips and tricks</li>\n</ul>\n\n<p>Slides are here:</p>\n\n<iframe src=\"//www.slideshare.net/slideshow/embed_code/key/cNyRVN7RX9oe2y\" width=\"595\" height=\"485\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" style=\"border:1px solid #CCC; border-width:1px; margin-bottom:5px; max-width: 100%;\" allowfullscreen=\"\"> </iframe>\n<div style=\"margin-bottom:5px\"> <strong> <a href=\"//www.slideshare.net/PeterLaurinec/r-lt-slovakia-1-meetup\" title=\"RSlovakia #1 meetup\" target=\"_blank\">RSlovakia #1 meetup</a> </strong> from <strong><a target=\"_blank\" href=\"//www.slideshare.net/PeterLaurinec\">Peter Laurinec</a></strong> </div>\n\n<h2 id=\"about-the-organizer\">About the organizer</h2>\n\n<p>The organizer of R&lt;-Slovakia is an NGO <a href=\"https://gapdata.org\">GapData</a>. They also started meetups called <a href=\"https://github.com/GapData/PyDataBratislava\">PyData Bratislava</a>, which is a network of users and developers of data analysis tools who meet on a regular basis to share ideas and learn from each other. The PyData community gathers to discuss how best to apply Python tools, as well as tools using <strong>R</strong> and Julia. R&lt;-Slovakia and <a href=\"https://www.meetup.com/pro/PyData/\">PyData</a> Bratislava are organized with help of a nonprofit organization <a href=\"http://www.numfocus.org/\">NumFocus</a>.</p>\n\n<p>R&lt;-Slovakia is also in the list of <a href=\"https://github.com/jumpingrivers/meetingsR\">R meetups around the world</a>. You can check more specifically for example <a href=\"https://github.com/jumpingrivers/meetingsR/blob/master/02_useR_groups_europe.Rmd\">europian R meetups</a>.</p>\n\n<p>With this large amount of information (see links), you can initiate your meetup (or project) to build a community around data analysts.</p>\n\n<h2 id=\"look-ahead\">Look ahead</h2>\n\n<p>I hope you will benefit some knowledge from my slides, e.g. get a bigger picture of how to use data mining methods on smart meter data. If you don’t get some details, don’t worry, I will explain in more detail, how to implement regression trees, ensemble learning or cluster analysis of consumers in R. Stay tuned and in the meantime check my previous <a href=\"https://petolau.github.io/blog\"><strong>blog posts</strong></a>.</p>\n\n<p>Teaser :sunglasses: :chart_with_upwards_trend: :</p>\n\n<p><img src=\"/images/post_4/lotofseries.png\" alt=\"\" /></p>",
  "pubDate": "Sun, 26 Mar 2017 00:00:00 +0000",
  "link": "https://petolau.github.io/First-R-Slovakia-meetup/",
  "guid": "https://petolau.github.io/First-R-Slovakia-meetup/"
}