{
  "title": "Detection and characterization of wind-blown charged sand grains on Titan with the DraGMet/EFIELD experiment on Dragonfly. (arXiv:2211.01502v1 [astro-ph.EP])",
  "link": "http://arxiv.org/abs/2211.01502",
  "description": "<p>The EFIELD instrument is part of the geophysics and meteorology sensor\npackage DraGMet on the Dragonfly mission, which will explore the surface of\nTitan in the mid-2030s. EFIELD consists of two electrodes designed to passively\nrecord the AC electric field at each landing site.\n</p>\n<p>The exploration zone of Dragonfly will mostly consist of dune fields, covered\nwith sand grains. Little is known on the properties of these grains, although\nCassini-Huygens observations suggest they are mostly made of organic material\nproduced by Titan's atmospheric photochemistry and evolved at the surface.\nLittle is known also about dune formation and in general about the transport of\nsediments by winds. The latter much depends on inter-particle forces and\ntherefore on how grains are charged by friction. We demonstrate here that the\nEFIELD experiment can bring new insights on these questions.\n</p>\n<p>We have developed a hydrodynamic-electrostatic model to simulate the\ntrajectory of a wind-blown charged sand grain in the vicinity of an idealized\nEFIELD probe and to predict how such a grain flying close to the probe would\naffect its potential. We show that, in some conditions, the resulting\nperturbation will be strong enough to be detected by the EFIELD probe. More\nspecifically, we find that the detection of typical charged wind-blown grains\n(200 microns) on Titan requires an instrument standard deviation noise inferior\nto 1mV, though occasional larger grains flying close to one electrode could be\ndetected with a higher noise level.\n</p>\n<p>Furthermore, we propose a method to retrieve information on the charge and\nvelocity of wind-blown charged grains detected by the EFIELD experiment. This\nmethod well applies for cases where the particle trajectory can be regarded as\nquasi-linear. We validate our inversion approach on both synthetic and\nexperimental data obtained with a laboratory prototype of the EFIELD\nexperiment.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Chatain_A/0/1/0/all/0/1\">Audrey Chatain</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Gall_A/0/1/0/all/0/1\">Alice Le Gall</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Berthelier_J/0/1/0/all/0/1\">Jean-Jacques Berthelier</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Lorenz_R/0/1/0/all/0/1\">Ralph D. Lorenz</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Hassen_Khodja_R/0/1/0/all/0/1\">Rafik Hassen-Khodja</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Lebreton_J/0/1/0/all/0/1\">Jean-Pierre Lebreton</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Joly_Jehenne_T/0/1/0/all/0/1\">Tom Joly-Jehenne</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Deprez_G/0/1/0/all/0/1\">Gr&#xe9;goire D&#xe9;prez</a>"
}