{
  "title": "Why Everyone Needs a Blog",
  "link": "https://danielmiessler.com/blog/why-everyone-needs-a-blog/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Mon, 13 Jun 2022 17:44:59 +0000",
  "category": "Culture",
  "guid": "https://danielmiessler.com/?p=137797",
  "description": "In this post I’m going to convince you why everyone needs a blog. Here’s the TL;DR: People used to be defined by where they work, and now they’re defined by their knowledge, capabilities, and opinions. Only authors wrote down their opinions, and they were considered superhuman. Everyone in the 1950s had a resume; it was unthinkable not to&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/blog-center-1-650x480.png\" alt=\"\" width=\"650\" height=\"480\" class=\"aligncenter size-medium wp-image-137799\" /></p>\n\n<p>\n<iframe loading=\"lazy\" src=\"https://omny.fm/shows/unsupervised-learning/why-everyone-needs-a-blog-the-idea-series/embed?style=artwork\" allow=\"autoplay; clipboard-write\" width=\"100%\" height=\"180\" frameborder=\"0\" title=\"Why Everyone Needs a Blog | THE IDEA SERIES\"></iframe>\n</p>\n\n<p>In this post I’m going to convince you why everyone needs a blog. Here’s the TL;DR:</p>\n\n<p><strong>People used to be defined by where they work, and now they’re defined by their knowledge, capabilities, and opinions.</strong></p>\n\n<p class=\"note\">Only authors wrote down their opinions, and they were considered superhuman.</p>\n\n<p>Everyone in the 1950s had a resume; it was unthinkable not to have one. Why is that? The reason is that the primary communication of value and worth was from the person to a company you wanted to work at. Your value was what you could provide to a company, not what you could provide to other humans outside your circle.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/corp-to-humans-1-650x405.png\" alt=\"\" width=\"650\" height=\"405\" class=\"aligncenter size-medium wp-image-137798\" /></p>\n\n<p>That’s different now. Humans are now more important than companies. And because of that, the resume is no longer the main artifact of your public worth. The replacement is the blog. Or, more specifically, having a domain name where you put all your stuff. A digital avatar of yourself.</p>\n\n<p>The easiest way to see how much you need a blog is to do this thought exercise. Imagine going back in time to a 21-year-old in 1952 and asking them what their opinions are, and where you could find a book of those opinions. Here’s what they would say.</p>\n\n<blockquote>\n  <p>(looking behind them before turning back) Um, are you talking to me? I don’t … why … why would anyone care what I have to say?</p><div class=\"inline-auto-newsletter\"><div class=\"inline-subscribe px-2 pb-8 pt-8 mb-8 border-t border-b\">\n<div class=\"text-lg font-bold\">The UL Newsletter: Finding the Patterns in the Noise…</div>\n<div class=\"text-sm text-gray-700 max-w-lg\">Get a weekly analysis of what's happening in security and tech—<em>and why it matters</em>.</div>\n<div class=\"mt-2\"><form action=\"https://danielmiessler.us8.list-manage.com/subscribe/post?u=6a9e465ab1570df8aaecb2292&id=49fdb7d723\" method=\"post\" name=\"mc-embedded-subscribe-form\" class=\"mc-embedded-subscribe-form validate inline\" novalidate > \n            <div>\n            <div class=\"mc-field-group\">\n            <input  placeholder=\"your best email\" type=\"email\" value=\"\" name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n            <input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button text-system\">\n            </div>\n            <div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_6a9e465ab1570df8aaecb2292_49fdb7d723\" tabindex=\"-1\" value=\"\"></div>\n            </div>\n            </form></div>\n</div>\n</div>\n</blockquote>\n\n<p>Many of you are thinking that right now, in 2022. Why would anyone want to know what you have to say?</p>\n\n<p>That right there is why you need a blog. It’s not the 1950’s anymore. You are not your resume. You are a human with preferences, interests, and opinions. And many of those will resonate with others in ways you can’t imagine before you put them out there.</p>\n\n<p>That doesn’t mean live-streaming every peanut butter sandwich you eat. Not everything people do is interesting. But you are interesting. What made you. What you believe. And why. That’s worth capturing, and worth sharing. Even just for yourself.</p>\n\n<p>I can’t even convey to you how challenging it is to create <a href=\"/about\">an about page</a>. Try it. Try to capture what you’re about. Try to capture your beliefs, and why you believe them. Try to capture your interests. Write yourself down.</p>\n\n<p>It’s unbelievably difficult, and tremendously rewarding. It forces you to ask yourself who you are, and it’s frightening when you don’t initially have good answers. But once you do, and once you can articulate yourself, there you are!</p><div data-inline-related-post data-inline-related-post-index=2></div>\n\n<p>Now go put yourself out there. Be yourself. Not for a job. Not for an interview. Not for a company. But because you are a human on this planet. And because you matter, all by yourself.</p>\n\n<p>That’s why everyone needs a blog.</p>\n</p>"
}