{
  "title": "Episode 117: &#8220;Don&#8217;t Worry Baby&#8221; by the Beach Boys",
  "link": "https://500songs.com/podcast/episode-117-dont-worry-baby-by-the-beach-boys/",
  "pubDate": "Sat, 20 Mar 2021 01:01:06 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-117-dont-worry-baby-by-the-beach-boys/",
  "description": "Episode one hundred and seventeen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Don't Worry Baby\" by the Beach Boys, and how the years 1963 and 1964 saw a radical evolution in the sound and subject matter of the Beach Boys' work. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/48968963\">You're No Good\" by the Swinging Blue Jeans.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>ERRATA:</strong>\n\nI say that the <em>Surfin' USA</em> album was released only four months after <em>Surfin' Safari</em>. It was actually over five months. Also, for some reason I pronounce Nik Venet's name as if he were French here. I believe that's incorrect and his name is actually pronounced “Vennit”, though I'm not 100% sure.\n\nMore importantly, I say that \"Sweet Little Sixteen\" wasn't a big hit, when of course it made number two on the charts.\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I've checked for specific things.\n\n<a href=\"https://amzn.to/3i21aaf\"><em>Becoming the Beach Boys</em>&nbsp;by James B. Murphy</a> is an in-depth look at the group's early years, up to the end of 1963.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher. &nbsp;His books can be found at&nbsp;<a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe's&nbsp;<a href=\"http://www.bellagio10452.com/\">Bellagio 10452&nbsp;</a>site is an invaluable resource.\n\nJon Stebbins'&nbsp;<a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ&nbsp;</a>is a good balance between accuracy and readability. Stebbins also co-wrote&nbsp;<a href=\"https://amzn.to/3r4C4Mg\"><em>The Lost Beach Boy</em></a>, David Marks' autobiography.\n\nAnd&nbsp;<a href=\"https://amzn.to/3i22CcH\">Philip Lambert's&nbsp;<em>Inside the Music of Brian Wilson</em></a>&nbsp;is an excellent, though sadly out of print, musicological analysis of Wilson's music from 1962 through 67.\n\nThe Beach Boys' Morgan recordings and all the outtakes from them can be found on&nbsp;<a href=\"https://amzn.to/3cEitNG\">this 2-CD set.</a>\n\nAs a good starting point for the Beach Boys' music, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it.\n\n<strong>Transcript</strong>\n\nToday, we're going to take our second look at the Beach Boys, and we're going to look at their evolution through 1963 and 1964, as they responded to the threat from the Beatles by turning to ever more sophisticated music, even as they went through a variety of personal crises. We're going to look at a period in which they released four albums a year, had three lineup changes, and saw their first number one – and at a song which, despite being a B-side, regularly makes lists of the best singles of all time. We're going to look at “Don't Worry Baby”:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nWhen we left the Beach Boys, they had just secured a contract with Capitol Records, and released their first national hit, \"Surfin' Safari\" backed with \"409\". Since then we've also seen Brian Wilson working with several songwriting collaborators to write hits for Jan and Dean. But now we need to double back and look at what Brian was doing with his main band in that time.\n\nAfter \"Surfin' Safari\" was a hit, in one of the many incomprehensible decisions made in the Beach Boys' career, Capitol decided to follow it up with an album track that Brian and Gary Usher had written, \"Ten Little Indians\". That track, a surf-rock version of the nursery rhyme with the group chanting \"Kemo sabe\" in the backing vocals, made only number forty-nine on the charts, and frankly didn't deserve to do even that well. Some have suggested, in fact that the record was released at the instigation of Murry Wilson, who was both Brian, Carl, and Dennis Wilson's father and the group's manager, as a way of weakening Usher's influence with the group, as Murry didn't want outsiders interfering in what he saw as a family business.\n\nAfter realising the folly of deviating from the formula, the group's next single followed the same pattern as their first hit. The B-side was \"Shut Down\", a car song co-written by Brian and Roger Christian, who you may remember from the episode on \"Surf City\" as having been brought in to help Brian with car lyrics. \"Shut Down\" is most notable for being one of the very small number of Beach Boys records to feature an instrumental contribution from Mike Love, the group's lead singer. His two-note saxophone solo comes in for some mockery from the group's fans, but actually fits the record extremely well:\n\n[Excerpt: The Beach Boys, \"Shut Down\"]\n\n\"Shut Down\" was a top thirty hit, but it was the A-side that was the really big hit. Just as their first hit had had a surf song on the A-side and a car song on the B-side, so did this single. Brian Wilson had been inspired by Chuck Berry's \"Sweet Little Sixteen\", and in particular the opening verse, which had just listed a lot of places:\n\n[Excerpt: Chuck Berry, \"Sweet Little Sixteen\"]\n\nHe might well also have been thinking of Chubby Checker's minor hit, \"Twistin' USA\", which listed places in America where people might be twisting:\n\n[Excerpt: Chubby Checker, \"Twistin' USA\"]\n\nBrian had taken Berry's melody and the place-name recitation, and with the help of his girlfriend's brother, and some input from Mike Love, had turned it into a song listing all the places that people could be surfing -- at least, they could \"if everybody had an ocean\":\n\n[Excerpt: The Beach Boys, \"Surfin' USA\"]\n\n\"Surfin' USA\" became a huge hit, reaching number two on the charts, and later being named by Billboard as the biggest hit of 1963, but unfortunately for Brian that didn't result in a financial windfall for him as the songwriter. As the song was so close to \"Sweet Little Sixteen\", Chuck Berry got the sole songwriting credit -- one of the only times in rock music history where a white artist has ripped off a Black one and the Black artist has actually benefited from it. And Berry definitely did benefit -- \"Sweet Little Sixteen\", while a great record, had never been a particularly big hit, while \"Surfin' USA\" is to this day regularly heard on oldies radio and used in commercials and films.\n\nBut that success meant extra work, and a lot of it. \"Surfin' USA\" was the title song of the group's second album, released in March 1963 only four months after their first, and they would release two more albums before the end of the year -- Surfer Girl in September and Little Deuce Coupe in October. Not only were they having to churn out a quite staggering amount of product -- though Little Deuce Coupe featured four songs recycled from their earlier albums -- but Brian Wilson, as well as writing or co-writing all their original material, started producing the records as well, as he was unhappy with Nik Venet's production on the first album.\n\nNot only that, but as well as making the Beach Boys' records, Wilson was also writing for Jan and Dean, and he had also started making records on the side with Gary Usher, doing things like making a \"Loco-Motion\" knock-off, \"The Revolution\", released under the name Rachel and the Revolvers:\n\n[Excerpt: Rachel and the Revolvers, \"The Revolution\"]\n\nAccording to some sources, Usher and Wilson found the singer for that track by the simple expedient of driving to Watts and asking the first Black teenage girl they saw if she could sing. Other sources say they hired a professional session singer -- some say it was Betty Everett, but given that that's the name of a famous singer from the period who lived in the Mid-West, I think people are confusing her for Betty Willis, another singer who gets named as a possibility, who lived in LA and who certainly sounds like the same person:\n\n[Excerpt: Betty Willis, \"Act Naturally\"]\n\nWilson was also in the process of breaking up with his girlfriend and starting a relationship with a young woman named Marilyn Rovell. Rovell, along with her sister Diane, and their cousin, Ginger Blake, had formed a girl group, and Brian was writing and producing records for them as well:\n\n[Excerpt: The Honeys, \"The One You Can't Have\"]\n\nAs well as making all these records, the Beach Boys were touring intensively, to the point that on one day in June the group were actually booked in for four shows in the same day.\n\nUnsurprisingly, Brian decided that this was too much for one person, and so in April 1963, just after the release of \"Surfin' USA\", he decided to quit touring with the group. Luckily, there was a replacement on hand.\n\nAlan Jardine had been a member of the Beach Boys on their very first single, but had decided to quit the group to go off to university. A year later, that seemed like a bad decision, and when Brian called him up and asked him to rejoin the band, he eagerly agreed. For now, Alan was not going to be a proper member of the group, but he would substitute for Brian on the group's tour of the Midwest that Spring, and on many of the shows they performed over the summer -- he could play the bass, which was the instrument that Brian played on stage, and he could sing Brian's parts, and so while the Beach Boys still officially consisted of Brian, Carl, and Dennis Wilson, Mike Love, and David Marks, the group that was on tour was Carl, Dennis, Mike, David, and Alan, though Brian would sometimes appear for important shows.\n\nJardine also started recording with the group, though he would not get credited on the covers of the first couple of albums on which he appeared. This made a huge change to the sound of the Beach Boys in the studio, as Jardine playing bass allowed Brian Wilson to play keyboards, while Jardine also added to the group's vocal harmonies.\n\nAnd this was a major change. Up to this point, the Beach Boys' records had had only rudimentary harmonies. While Brian was an excellent falsetto singer, and Mike a very good bass, the other three members of the group were less accomplished. Carl would grow to be one of the great vocalists of all time, but at this point was still in his early teens and had a thin voice. Dennis' voice was also a little thin at this point, and he was behind the drum kit, which meant he didn't get to sing live, and David Marks was apparently not allowed to sing on the records at all, other than taking a single joint lead with Carl on the first album.\n\nWith the addition of Jardine, Brian now had another singer as strong as himself and Love, and the Surfer Girl album, the first one on which Jardine appears, sees Brian expanding from the rather rudimentary vocal arrangements of the first two albums to something that incorporates a lot more of the influence of the Four Freshmen.\n\nYou can hear this most startlingly on \"In My Room\". This is one of the first songs on which Jardine took part in the studio, though he's actually not very audible in the vocal arrangement, which instead concentrates on the three brothers. \"In My Room\" is a major, major, step forward in the group's sound, in the themes that would appear in their songwriting for the next few years, and in the juxtaposition of the lyrical theme and the musical arrangement.\n\nThe song's lyrics, written by Gary Usher but inspired by Wilson's experiences, are about solitude, and the song starts out with Brian singing alone, but then Brian moves up to the third note of the scale and Carl comes in under him, singing the note Brian started on. Then they both move up again, Brian to the fifth and Carl to the third, with Dennis joining in on the note that Brian had started on, before Mike and Alan finally also join in. Brian is singing about being alone, but he has his family with him, supporting him:\n\n[Excerpt: The Beach Boys, \"In My Room\"]\n\nThis new lineup of the group, with Alan augmenting the other five, might even have lasted, except for a chain of events that started on David Marks' fifteenth birthday. Murry Wilson, who was still managing the group at this point, had never liked the idea of someone from outside the family being an equal member, and was particularly annoyed at David because Murry had tried to have an affair with David's mother, which hadn't worked out well for him.\n\nBut then on Marks' fifteenth birthday, he and Dennis Wilson both caught a sexually transmitted infection from the same sex worker, and when Murry Wilson found this out -- as he had to, as he needed to pay their doctor's bills -- he became furious and started screaming at the whole group.\n\nAt that point, David had had enough. His mother had been telling him that he was the real talent in the group and he didn't need those Wilsons, and as a fifteen-year-old kid he didn't have the understanding to realise that this might not be entirely true. He said \"OK, I quit\".\n\nAt first, the rest of the group thought that he was joking, and even he wasn't at all sure that he wanted to leave the group altogether. He remained in the band for the next month, but Murry Wilson kept reminding his sons that Marks had quit and that they'd all heard him, and refused to speak directly to him -- anything that Murry wanted to say to David, he said to Carl, who passed the message on.\n\nAnd even though the rest of the group definitely wanted David to stay -- especially Brian, who liked having the freedom not to go out on tour, and Carl, who had been the one who'd lobbied to bring his friend into the group in the first place -- David was still, as the youngest member, the only one who didn't sing, and the only one not part of the family, regarded by the others as somewhat lesser than the rest of the band.\n\nDavid became increasingly frustrated, especially when they were recording the Little Deuce Coupe album. That album was made up entirely of songs about cars, and the group were so short of material that the album ended up being filled out with four songs from earlier albums, including two from the Surfer Girl album released only the previous month. Yet when David tried to persuade Brian to have the group record his song \"Kustom Kar Show\", Brian told David that he wasn't ready to be writing songs for the group.\n\nAll this, plus pressure from David's parents to make him more of a focal point of the group, led to his resignation eventually being accepted, and backdated to the original date he quit. He played his last show with the group on October the fifth 1963, and then formed his own band, the Marksmen, who signed to A&M:\n\n[Excerpt: Dave and the Marksmen, \"Kustom Kar Show\"]\n\nThere have been rumours that Murry Wilson threatened DJs that the Beach Boys wouldn't co-operate with them if they played Marksmen records, but in truth, listening to the records the Marksmen made during their two years of existence, it's quite obvious why they weren't played -- they were fairly shoddy-sounding garage rock records, with little to commend them. Indeed, they actually sound somewhat better now than they would have done at the time -- some of Marks' flatter and more affectless vocals prefigure the sound of some punk singers, but not in a way that would have had any commercial potential in 1963.\n\nMeanwhile, the Beach Boys continued, with Alan Jardine buying a Stratocaster and switching to rhythm guitar, and Brian Wilson resigning himself to having to perform live, at least at the moment, and returning to his old role on the bass. Jardine was now, for publicity purposes, a full member of the group, though he would remain on a salary rather than an equal partner for many years -- Murry Wilson didn't want to make the same mistake with him that he had with Marks.\n\nAnd there was still the constant need for new material, which didn't let up. Brian's songwriting was progressing at a furious pace, and that can be seen nowhere better than on \"The Warmth of the Sun\", a song he wrote, with Love writing the lyrics, around the time of the Kennedy assassination -- the two men have differed over the years over whether it was written the night before or the night after the assassination.\n\n\"The Warmth of the Sun\" is quite staggeringly harmonically sophisticated. We've talked before in this podcast about the standard doo-wop progression -- the one, minor sixth, minor second, fifth progression that you get in about a million songs:\n\n[demonstrates]\n\n\"The Warmth of the Sun\" starts out that way -- its first two chords are C, Am, played in the standard arpeggiated way one expects from that kind of song:\n\n[demonstrates]\n\nYou'd expect from that &nbsp;that the song would go C, Am, Dm, G or C, Am, F, G. But instead of moving to Dm or F, as one normally would, the song moves to E flat, and *starts the progression over*, a minor third up, so you have:\n\n[demonstrates]\n\nIt then stops that progression after two bars, moves back to the Dm one would expect from the original progression, and stays there for twice as long as normal, before moving on to the normal G -- and then throwing in a G augmented at the end, which is a normal G chord but with the D note raised to E flat, so it ties in to that original unexpected chord change.\n\nAnd it does all this *in the opening line of the song*:\n\n[Excerpt: The Beach Boys, \"The Warmth of the Sun\"]\n\nThis is harmonic sophistication on a totally different order from anything else that was being done in teen pop music at the time -- it was far closer to the modern jazz harmonies of the Four Freshmen that Brian loved than to doo-wop.\n\nThe new five-piece lineup of the group recorded that on January the first, 1964, and on the same day they recorded a song that combined two of Brian's other big influences. \"Fun Fun Fun\" had lyrics by Mike Love -- some of his wittiest -- and starts out with an intro taken straight from \"Johnny B. Goode\":\n\n[Excerpt: The Beach Boys, \"Fun Fun Fun\"]\n\nBut while the rest of the track keeps the same feel as the Chuck Berry song, the verse goes in a different harmonic direction, and actually owes a lot to \"Da Doo Ron Ron\". Instead of using a blues progression, as Berry normally would, the verse uses the same I-IV-I-V progression that \"Da Doo Ron Ron\"'s chorus does, but uses it to very different effect:\n\n[Excerpt: The Beach Boys, \"Fun Fun Fun\"]\n\nThat became the group's fourth top ten hit, and made number five on the charts -- but the group suddenly had some real competition. At numbers one, two, and three were the Beatles.\n\nBrian Wilson realised that he needed to up his game if he was going to compete, and he did. In April 1964 he started working on a new single. By this time, while the Beach Boys themselves were still playing most of the instruments, Brian was bringing in additional musicians to augment them, and expanding his instrumental palette. The basic track was the core members of the band -- Carl playing both lead and rhythm guitar, Alan playing bass, and Dennis playing drums, with Brian on keyboards -- but there were two further bass players, Glen Campbell and Ray Pohlman, thickening the sound on six-string bass, plus two saxophones, and Hal Blaine adding percussion.\n\nAnd the main instrument providing chordal support wasn't guitar or organ, as it usually had been, but a harpsichord, an instrument Brian would use a lot over the next few years:\n\n[Excerpt: The Beach Boys, \"I Get Around (backing track)\"]\n\nThe recording session for that backing track was also another breaking point for the band. Murry Wilson, himself a frustrated songwriter and producer, was at the session and kept insisting that there was a problem with the bassline. Eventually, Brian had enough of his father's interference, and fired him as the band's manager. Murry would continue to keep trying to interfere in his children's career, but this was the point at which the Beach Boys finally took control over their own futures.\n\nA few days later, they reconvened in the studio to record the vocals for what would become their first number one hit:\n\n[Excerpt: The Beach Boys, \"I Get Around\"]\n\nIt's fascinating to see that even this early in the group's career, and on one of their biggest, summeriest hits, there's already a tension in the lyrics, a sense of wanting to move on -- \"I'm getting bugged driving up and down the same old strip/I've got to find a new place where the kids are hip\". The lyrics are Love's, but as is so often the case with Brian Wilson's collaborations, Love seems to have been expressing something that Wilson was feeling at the time.\n\nThe Beach Boys had risen to the challenge from the Beatles, in a way that few other American musicians could, and \"I Get Around\" was good enough that it made the top ten in the UK, and became a particular favourite in the Mod subculture in London. The group would only become more popular over the next few years in the UK, a new place where the kids were hip.\n\n\"I Get Around\" is a worthy classic, but the B-side, \"Don't Worry Baby\", is if anything even better. It had been recorded in January, and had already been released on their Shut Down vol 2 album in March. It had originally been intended for the Ronettes, and was inspired by \"Be My Baby\", which had astonished Brian Wilson when it had been released a few months earlier. He would later recall having to pull over to the side of the road when he first heard the drum intro to that record:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nBrian would play that record over and over, on repeat, for days at a time, and would try to absorb every nuance of the record and its production, and he tried to come up with something that could follow it.\n\nWilson took the basic rhythm and chord sequence of the song, plus melodic fragments like the line \"Be my little baby\", and reworked them into a song that clearly owes a lot to its inspiration, but which stands on its own:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nPhil Spector turned the song down, and so the Beach Boys recorded it themselves, and I have to say that this was only a good thing -- Ronnie Spector recorded a solo version of it many decades later, and it's a fine performance, but the lyric misses something when it's sung by a woman rather than a man.\n\nThat lyric was by Roger Christian, and in it we see the tension between the more emotional themes that Wilson wanted to explore and the surf and car lyrics that had made up the majority of their singles to this point. The lyric is ostensibly about a car race, and indeed it seems to be setting up precisely the kind of situation that was common in teen tragedy records of the period. The protagonist sings \"I guess I should have kept my mouth shut when I started to brag about my car, &nbsp;but I can't back down now because I pushed the other guys too far\", and the whole lyric is focused on his terror of an upcoming race.\n\nThis seems intended to lead to the kind of situation that we see in \"Dead Man's Curve\", or “Tell Laura I Love Her”, or in another teen tragedy song we'll be looking at in a couple of weeks, with the protagonist dead in a car crash. But instead, this is short-circuited. The protagonist's fears are allayed by his girlfriend:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nWhat we have here is someone trying to deal with a particular kind of anxiety brought about by what we now refer to as toxic masculinity. The protagonist has been showing off about his driving skills in front of his peers, and has now found himself in a situation that he can't cope with. He's saved by a figure we'll see a lot more of in Brian's songs, whoever the lyricist, the supernaturally good woman who understands the protagonist and loves him despite, or because of, his faults, even though she's too good for him.\n\nObviously, one can point to all sorts of reasons why this figure might be considered problematic -- the idea that the man is unable to deal with his own emotional problems without a woman fixing him -- but there's an emotional truth to it that one doesn't get in much music of the era, and even if it's a somewhat flawed view of gender relations, it speaks to a very particular kind of insecurity at the inability to live up to traditional masculine roles, and is all the more affecting when it's paired with the braggadocio of the A-side. The combination means we see the bragging and posturing on the A-side as just a facade, covering over the real emotional fragility of the narrator. Each side reinforces the other, and the combination is one of the most perfect pairings ever released as a single.\n\n\"Don't Worry Baby\", released as \"I Get Around”'s B-side, made the charts in its own right peaking at number twenty-four. The B-side to the next single further elaborated on the themes of \"Don't Worry Baby\":\n\n[Excerpt: The Beach Boys, \"She Knows Me Too Well\"]\n\nThis repurposing of the emotional and musical style of girl-group songs to deal with the emotional vulnerability that comes from acknowledging and attempting to process toxic masculinity is something that few other songwriters were capable of at this point – only some of John Lennon's work a couple of years later comes close to dealing with this very real area of the emotional landscape, and Lennon, like Wilson, often does so by using the figure of the perfect woman who will save the protagonist.\n\nIn 1964, the group once again released four albums – Shut Down vol.2, All Summer Long, a live album, and a Christmas album – and they also did most of the work on yet another album, The Beach Boys Today!, which would be released in early 1965.\n\nAs these recordings progressed, Brian Wilson was more and more ambitious, both in terms of the emotional effect of the music and his arrangements, increasingly using session musicians to augment the group, and trying for a variant on Phil Spector's production style, but one which emphasised gentle fragility rather than sturm und drang. Possibly the greatest track he created in 1964 ended up not being used by the Beach Boys, though, but was given to Glen Campbell:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb\"]\n\nCampbell got given that track because of an enormous favour he'd done the group. The mental strain of touring had finally got too much for Brian, and in December, on a plane to Texas, he'd had a breakdown, screaming on the plane and refusing to get off. Eventually, they coaxed him off the plane, and he'd managed to get through that night's show, but had flown back to LA straight after. Campbell, who was a session guitarist who had played on a number of the Beach Boys' recordings, and had a minor career as a singer at this point, had flown out at almost no notice and for the next five months he replaced Brian on stage for most of their shows, before the group got a permanent replacement in.\n\nBrian Wilson had retired from the road, and the hope was that by doing so, he would reduce the strain on himself enough that he could keep writing and producing for the group without making his mental health worse. And for a while, at least, that seemed to be how it worked out. We'll take a look at the results in a few weeks' time.",
  "itunes:subtitle": "Episode one hundred and seventeen of A History of Rock Music in Five Hundred Songs looks at Dont Worry Baby by the Beach Boys, and how the years 1963 and 1964 saw a radical evolution in the sound and subject matter of the Beach Boys work. Click the full ",
  "itunes:keywords": "Brian Wilson,Capitol Records,Chuck Berry,death discs,Gary Usher,Murry Wilson,Nik Venet,Roger Christian,surf music,The Beach Boys,The Ronettes,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 117,
  "content:encoded": "Episode one hundred and seventeen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Don't Worry Baby\" by the Beach Boys, and how the years 1963 and 1964 saw a radical evolution in the sound and subject matter of the Beach Boys' work. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/48968963\">You're No Good\" by the Swinging Blue Jeans.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>ERRATA:</strong>\n\nI say that the <em>Surfin' USA</em> album was released only four months after <em>Surfin' Safari</em>. It was actually over five months. Also, for some reason I pronounce Nik Venet's name as if he were French here. I believe that's incorrect and his name is actually pronounced “Vennit”, though I'm not 100% sure.\n\nMore importantly, I say that \"Sweet Little Sixteen\" wasn't a big hit, when of course it made number two on the charts.\n\n<strong>Resources</strong>\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I've checked for specific things.\n\n<a href=\"https://amzn.to/3i21aaf\"><em>Becoming the Beach Boys</em>&nbsp;by James B. Murphy</a> is an in-depth look at the group's early years, up to the end of 1963.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher. &nbsp;His books can be found at&nbsp;<a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nAndrew Doe's&nbsp;<a href=\"http://www.bellagio10452.com/\">Bellagio 10452&nbsp;</a>site is an invaluable resource.\n\nJon Stebbins'&nbsp;<a href=\"https://amzn.to/2S0eQIs\">The Beach Boys FAQ&nbsp;</a>is a good balance between accuracy and readability. Stebbins also co-wrote&nbsp;<a href=\"https://amzn.to/3r4C4Mg\"><em>The Lost Beach Boy</em></a>, David Marks' autobiography.\n\nAnd&nbsp;<a href=\"https://amzn.to/3i22CcH\">Philip Lambert's&nbsp;<em>Inside the Music of Brian Wilson</em></a>&nbsp;is an excellent, though sadly out of print, musicological analysis of Wilson's music from 1962 through 67.\n\nThe Beach Boys' Morgan recordings and all the outtakes from them can be found on&nbsp;<a href=\"https://amzn.to/3cEitNG\">this 2-CD set.</a>\n\nAs a good starting point for the Beach Boys' music, I would recommend <a href=\"https://amzn.to/3i0tsC9\">this budget-priced three-CD set</a>, which has a surprisingly good selection of their material on it.\n\n<strong>Transcript</strong>\n\nToday, we're going to take our second look at the Beach Boys, and we're going to look at their evolution through 1963 and 1964, as they responded to the threat from the Beatles by turning to ever more sophisticated music, even as they went through a variety of personal crises. We're going to look at a period in which they released four albums a year, had three lineup changes, and saw their first number one – and at a song which, despite being a B-side, regularly makes lists of the best singles of all time. We're going to look at “Don't Worry Baby”:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nWhen we left the Beach Boys, they had just secured a contract with Capitol Records, and released their first national hit, \"Surfin' Safari\" backed with \"409\". Since then we've also seen Brian Wilson working with several songwriting collaborators to write hits for Jan and Dean. But now we need to double back and look at what Brian was doing with his main band in that time.\n\nAfter \"Surfin' Safari\" was a hit, in one of the many incomprehensible decisions made in the Beach Boys' career, Capitol decided to follow it up with an album track that Brian and Gary Usher had written, \"Ten Little Indians\". That track, a surf-rock version of the nursery rhyme with the group chanting \"Kemo sabe\" in the backing vocals, made only number forty-nine on the charts, and frankly didn't deserve to do even that well. Some have suggested, in fact that the record was released at the instigation of Murry Wilson, who was both Brian, Carl, and Dennis Wilson's father and the group's manager, as a way of weakening Usher's influence with the group, as Murry didn't want outsiders interfering in what he saw as a family business.\n\nAfter realising the folly of deviating from the formula, the group's next single followed the same pattern as their first hit. The B-side was \"Shut Down\", a car song co-written by Brian and Roger Christian, who you may remember from the episode on \"Surf City\" as having been brought in to help Brian with car lyrics. \"Shut Down\" is most notable for being one of the very small number of Beach Boys records to feature an instrumental contribution from Mike Love, the group's lead singer. His two-note saxophone solo comes in for some mockery from the group's fans, but actually fits the record extremely well:\n\n[Excerpt: The Beach Boys, \"Shut Down\"]\n\n\"Shut Down\" was a top thirty hit, but it was the A-side that was the really big hit. Just as their first hit had had a surf song on the A-side and a car song on the B-side, so did this single. Brian Wilson had been inspired by Chuck Berry's \"Sweet Little Sixteen\", and in particular the opening verse, which had just listed a lot of places:\n\n[Excerpt: Chuck Berry, \"Sweet Little Sixteen\"]\n\nHe might well also have been thinking of Chubby Checker's minor hit, \"Twistin' USA\", which listed places in America where people might be twisting:\n\n[Excerpt: Chubby Checker, \"Twistin' USA\"]\n\nBrian had taken Berry's melody and the place-name recitation, and with the help of his girlfriend's brother, and some input from Mike Love, had turned it into a song listing all the places that people could be surfing -- at least, they could \"if everybody had an ocean\":\n\n[Excerpt: The Beach Boys, \"Surfin' USA\"]\n\n\"Surfin' USA\" became a huge hit, reaching number two on the charts, and later being named by Billboard as the biggest hit of 1963, but unfortunately for Brian that didn't result in a financial windfall for him as the songwriter. As the song was so close to \"Sweet Little Sixteen\", Chuck Berry got the sole songwriting credit -- one of the only times in rock music history where a white artist has ripped off a Black one and the Black artist has actually benefited from it. And Berry definitely did benefit -- \"Sweet Little Sixteen\", while a great record, had never been a particularly big hit, while \"Surfin' USA\" is to this day regularly heard on oldies radio and used in commercials and films.\n\nBut that success meant extra work, and a lot of it. \"Surfin' USA\" was the title song of the group's second album, released in March 1963 only four months after their first, and they would release two more albums before the end of the year -- Surfer Girl in September and Little Deuce Coupe in October. Not only were they having to churn out a quite staggering amount of product -- though Little Deuce Coupe featured four songs recycled from their earlier albums -- but Brian Wilson, as well as writing or co-writing all their original material, started producing the records as well, as he was unhappy with Nik Venet's production on the first album.\n\nNot only that, but as well as making the Beach Boys' records, Wilson was also writing for Jan and Dean, and he had also started making records on the side with Gary Usher, doing things like making a \"Loco-Motion\" knock-off, \"The Revolution\", released under the name Rachel and the Revolvers:\n\n[Excerpt: Rachel and the Revolvers, \"The Revolution\"]\n\nAccording to some sources, Usher and Wilson found the singer for that track by the simple expedient of driving to Watts and asking the first Black teenage girl they saw if she could sing. Other sources say they hired a professional session singer -- some say it was Betty Everett, but given that that's the name of a famous singer from the period who lived in the Mid-West, I think people are confusing her for Betty Willis, another singer who gets named as a possibility, who lived in LA and who certainly sounds like the same person:\n\n[Excerpt: Betty Willis, \"Act Naturally\"]\n\nWilson was also in the process of breaking up with his girlfriend and starting a relationship with a young woman named Marilyn Rovell. Rovell, along with her sister Diane, and their cousin, Ginger Blake, had formed a girl group, and Brian was writing and producing records for them as well:\n\n[Excerpt: The Honeys, \"The One You Can't Have\"]\n\nAs well as making all these records, the Beach Boys were touring intensively, to the point that on one day in June the group were actually booked in for four shows in the same day.\n\nUnsurprisingly, Brian decided that this was too much for one person, and so in April 1963, just after the release of \"Surfin' USA\", he decided to quit touring with the group. Luckily, there was a replacement on hand.\n\nAlan Jardine had been a member of the Beach Boys on their very first single, but had decided to quit the group to go off to university. A year later, that seemed like a bad decision, and when Brian called him up and asked him to rejoin the band, he eagerly agreed. For now, Alan was not going to be a proper member of the group, but he would substitute for Brian on the group's tour of the Midwest that Spring, and on many of the shows they performed over the summer -- he could play the bass, which was the instrument that Brian played on stage, and he could sing Brian's parts, and so while the Beach Boys still officially consisted of Brian, Carl, and Dennis Wilson, Mike Love, and David Marks, the group that was on tour was Carl, Dennis, Mike, David, and Alan, though Brian would sometimes appear for important shows.\n\nJardine also started recording with the group, though he would not get credited on the covers of the first couple of albums on which he appeared. This made a huge change to the sound of the Beach Boys in the studio, as Jardine playing bass allowed Brian Wilson to play keyboards, while Jardine also added to the group's vocal harmonies.\n\nAnd this was a major change. Up to this point, the Beach Boys' records had had only rudimentary harmonies. While Brian was an excellent falsetto singer, and Mike a very good bass, the other three members of the group were less accomplished. Carl would grow to be one of the great vocalists of all time, but at this point was still in his early teens and had a thin voice. Dennis' voice was also a little thin at this point, and he was behind the drum kit, which meant he didn't get to sing live, and David Marks was apparently not allowed to sing on the records at all, other than taking a single joint lead with Carl on the first album.\n\nWith the addition of Jardine, Brian now had another singer as strong as himself and Love, and the Surfer Girl album, the first one on which Jardine appears, sees Brian expanding from the rather rudimentary vocal arrangements of the first two albums to something that incorporates a lot more of the influence of the Four Freshmen.\n\nYou can hear this most startlingly on \"In My Room\". This is one of the first songs on which Jardine took part in the studio, though he's actually not very audible in the vocal arrangement, which instead concentrates on the three brothers. \"In My Room\" is a major, major, step forward in the group's sound, in the themes that would appear in their songwriting for the next few years, and in the juxtaposition of the lyrical theme and the musical arrangement.\n\nThe song's lyrics, written by Gary Usher but inspired by Wilson's experiences, are about solitude, and the song starts out with Brian singing alone, but then Brian moves up to the third note of the scale and Carl comes in under him, singing the note Brian started on. Then they both move up again, Brian to the fifth and Carl to the third, with Dennis joining in on the note that Brian had started on, before Mike and Alan finally also join in. Brian is singing about being alone, but he has his family with him, supporting him:\n\n[Excerpt: The Beach Boys, \"In My Room\"]\n\nThis new lineup of the group, with Alan augmenting the other five, might even have lasted, except for a chain of events that started on David Marks' fifteenth birthday. Murry Wilson, who was still managing the group at this point, had never liked the idea of someone from outside the family being an equal member, and was particularly annoyed at David because Murry had tried to have an affair with David's mother, which hadn't worked out well for him.\n\nBut then on Marks' fifteenth birthday, he and Dennis Wilson both caught a sexually transmitted infection from the same sex worker, and when Murry Wilson found this out -- as he had to, as he needed to pay their doctor's bills -- he became furious and started screaming at the whole group.\n\nAt that point, David had had enough. His mother had been telling him that he was the real talent in the group and he didn't need those Wilsons, and as a fifteen-year-old kid he didn't have the understanding to realise that this might not be entirely true. He said \"OK, I quit\".\n\nAt first, the rest of the group thought that he was joking, and even he wasn't at all sure that he wanted to leave the group altogether. He remained in the band for the next month, but Murry Wilson kept reminding his sons that Marks had quit and that they'd all heard him, and refused to speak directly to him -- anything that Murry wanted to say to David, he said to Carl, who passed the message on.\n\nAnd even though the rest of the group definitely wanted David to stay -- especially Brian, who liked having the freedom not to go out on tour, and Carl, who had been the one who'd lobbied to bring his friend into the group in the first place -- David was still, as the youngest member, the only one who didn't sing, and the only one not part of the family, regarded by the others as somewhat lesser than the rest of the band.\n\nDavid became increasingly frustrated, especially when they were recording the Little Deuce Coupe album. That album was made up entirely of songs about cars, and the group were so short of material that the album ended up being filled out with four songs from earlier albums, including two from the Surfer Girl album released only the previous month. Yet when David tried to persuade Brian to have the group record his song \"Kustom Kar Show\", Brian told David that he wasn't ready to be writing songs for the group.\n\nAll this, plus pressure from David's parents to make him more of a focal point of the group, led to his resignation eventually being accepted, and backdated to the original date he quit. He played his last show with the group on October the fifth 1963, and then formed his own band, the Marksmen, who signed to A&M:\n\n[Excerpt: Dave and the Marksmen, \"Kustom Kar Show\"]\n\nThere have been rumours that Murry Wilson threatened DJs that the Beach Boys wouldn't co-operate with them if they played Marksmen records, but in truth, listening to the records the Marksmen made during their two years of existence, it's quite obvious why they weren't played -- they were fairly shoddy-sounding garage rock records, with little to commend them. Indeed, they actually sound somewhat better now than they would have done at the time -- some of Marks' flatter and more affectless vocals prefigure the sound of some punk singers, but not in a way that would have had any commercial potential in 1963.\n\nMeanwhile, the Beach Boys continued, with Alan Jardine buying a Stratocaster and switching to rhythm guitar, and Brian Wilson resigning himself to having to perform live, at least at the moment, and returning to his old role on the bass. Jardine was now, for publicity purposes, a full member of the group, though he would remain on a salary rather than an equal partner for many years -- Murry Wilson didn't want to make the same mistake with him that he had with Marks.\n\nAnd there was still the constant need for new material, which didn't let up. Brian's songwriting was progressing at a furious pace, and that can be seen nowhere better than on \"The Warmth of the Sun\", a song he wrote, with Love writing the lyrics, around the time of the Kennedy assassination -- the two men have differed over the years over whether it was written the night before or the night after the assassination.\n\n\"The Warmth of the Sun\" is quite staggeringly harmonically sophisticated. We've talked before in this podcast about the standard doo-wop progression -- the one, minor sixth, minor second, fifth progression that you get in about a million songs:\n\n[demonstrates]\n\n\"The Warmth of the Sun\" starts out that way -- its first two chords are C, Am, played in the standard arpeggiated way one expects from that kind of song:\n\n[demonstrates]\n\nYou'd expect from that &nbsp;that the song would go C, Am, Dm, G or C, Am, F, G. But instead of moving to Dm or F, as one normally would, the song moves to E flat, and *starts the progression over*, a minor third up, so you have:\n\n[demonstrates]\n\nIt then stops that progression after two bars, moves back to the Dm one would expect from the original progression, and stays there for twice as long as normal, before moving on to the normal G -- and then throwing in a G augmented at the end, which is a normal G chord but with the D note raised to E flat, so it ties in to that original unexpected chord change.\n\nAnd it does all this *in the opening line of the song*:\n\n[Excerpt: The Beach Boys, \"The Warmth of the Sun\"]\n\nThis is harmonic sophistication on a totally different order from anything else that was being done in teen pop music at the time -- it was far closer to the modern jazz harmonies of the Four Freshmen that Brian loved than to doo-wop.\n\nThe new five-piece lineup of the group recorded that on January the first, 1964, and on the same day they recorded a song that combined two of Brian's other big influences. \"Fun Fun Fun\" had lyrics by Mike Love -- some of his wittiest -- and starts out with an intro taken straight from \"Johnny B. Goode\":\n\n[Excerpt: The Beach Boys, \"Fun Fun Fun\"]\n\nBut while the rest of the track keeps the same feel as the Chuck Berry song, the verse goes in a different harmonic direction, and actually owes a lot to \"Da Doo Ron Ron\". Instead of using a blues progression, as Berry normally would, the verse uses the same I-IV-I-V progression that \"Da Doo Ron Ron\"'s chorus does, but uses it to very different effect:\n\n[Excerpt: The Beach Boys, \"Fun Fun Fun\"]\n\nThat became the group's fourth top ten hit, and made number five on the charts -- but the group suddenly had some real competition. At numbers one, two, and three were the Beatles.\n\nBrian Wilson realised that he needed to up his game if he was going to compete, and he did. In April 1964 he started working on a new single. By this time, while the Beach Boys themselves were still playing most of the instruments, Brian was bringing in additional musicians to augment them, and expanding his instrumental palette. The basic track was the core members of the band -- Carl playing both lead and rhythm guitar, Alan playing bass, and Dennis playing drums, with Brian on keyboards -- but there were two further bass players, Glen Campbell and Ray Pohlman, thickening the sound on six-string bass, plus two saxophones, and Hal Blaine adding percussion.\n\nAnd the main instrument providing chordal support wasn't guitar or organ, as it usually had been, but a harpsichord, an instrument Brian would use a lot over the next few years:\n\n[Excerpt: The Beach Boys, \"I Get Around (backing track)\"]\n\nThe recording session for that backing track was also another breaking point for the band. Murry Wilson, himself a frustrated songwriter and producer, was at the session and kept insisting that there was a problem with the bassline. Eventually, Brian had enough of his father's interference, and fired him as the band's manager. Murry would continue to keep trying to interfere in his children's career, but this was the point at which the Beach Boys finally took control over their own futures.\n\nA few days later, they reconvened in the studio to record the vocals for what would become their first number one hit:\n\n[Excerpt: The Beach Boys, \"I Get Around\"]\n\nIt's fascinating to see that even this early in the group's career, and on one of their biggest, summeriest hits, there's already a tension in the lyrics, a sense of wanting to move on -- \"I'm getting bugged driving up and down the same old strip/I've got to find a new place where the kids are hip\". The lyrics are Love's, but as is so often the case with Brian Wilson's collaborations, Love seems to have been expressing something that Wilson was feeling at the time.\n\nThe Beach Boys had risen to the challenge from the Beatles, in a way that few other American musicians could, and \"I Get Around\" was good enough that it made the top ten in the UK, and became a particular favourite in the Mod subculture in London. The group would only become more popular over the next few years in the UK, a new place where the kids were hip.\n\n\"I Get Around\" is a worthy classic, but the B-side, \"Don't Worry Baby\", is if anything even better. It had been recorded in January, and had already been released on their Shut Down vol 2 album in March. It had originally been intended for the Ronettes, and was inspired by \"Be My Baby\", which had astonished Brian Wilson when it had been released a few months earlier. He would later recall having to pull over to the side of the road when he first heard the drum intro to that record:\n\n[Excerpt: The Ronettes, \"Be My Baby\"]\n\nBrian would play that record over and over, on repeat, for days at a time, and would try to absorb every nuance of the record and its production, and he tried to come up with something that could follow it.\n\nWilson took the basic rhythm and chord sequence of the song, plus melodic fragments like the line \"Be my little baby\", and reworked them into a song that clearly owes a lot to its inspiration, but which stands on its own:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nPhil Spector turned the song down, and so the Beach Boys recorded it themselves, and I have to say that this was only a good thing -- Ronnie Spector recorded a solo version of it many decades later, and it's a fine performance, but the lyric misses something when it's sung by a woman rather than a man.\n\nThat lyric was by Roger Christian, and in it we see the tension between the more emotional themes that Wilson wanted to explore and the surf and car lyrics that had made up the majority of their singles to this point. The lyric is ostensibly about a car race, and indeed it seems to be setting up precisely the kind of situation that was common in teen tragedy records of the period. The protagonist sings \"I guess I should have kept my mouth shut when I started to brag about my car, &nbsp;but I can't back down now because I pushed the other guys too far\", and the whole lyric is focused on his terror of an upcoming race.\n\nThis seems intended to lead to the kind of situation that we see in \"Dead Man's Curve\", or “Tell Laura I Love Her”, or in another teen tragedy song we'll be looking at in a couple of weeks, with the protagonist dead in a car crash. But instead, this is short-circuited. The protagonist's fears are allayed by his girlfriend:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nWhat we have here is someone trying to deal with a particular kind of anxiety brought about by what we now refer to as toxic masculinity. The protagonist has been showing off about his driving skills in front of his peers, and has now found himself in a situation that he can't cope with. He's saved by a figure we'll see a lot more of in Brian's songs, whoever the lyricist, the supernaturally good woman who understands the protagonist and loves him despite, or because of, his faults, even though she's too good for him.\n\nObviously, one can point to all sorts of reasons why this figure might be considered problematic -- the idea that the man is unable to deal with his own emotional problems without a woman fixing him -- but there's an emotional truth to it that one doesn't get in much music of the era, and even if it's a somewhat flawed view of gender relations, it speaks to a very particular kind of insecurity at the inability to live up to traditional masculine roles, and is all the more affecting when it's paired with the braggadocio of the A-side. The combination means we see the bragging and posturing on the A-side as just a facade, covering over the real emotional fragility of the narrator. Each side reinforces the other, and the combination is one of the most perfect pairings ever released as a single.\n\n\"Don't Worry Baby\", released as \"I Get Around”'s B-side, made the charts in its own right peaking at number twenty-four. The B-side to the next single further elaborated on the themes of \"Don't Worry Baby\":\n\n[Excerpt: The Beach Boys, \"She Knows Me Too Well\"]\n\nThis repurposing of the emotional and musical style of girl-group songs to deal with the emotional vulnerability that comes from acknowledging and attempting to process toxic masculinity is something that few other songwriters were capable of at this point – only some of John Lennon's work a couple of years later comes close to dealing with this very real area of the emotional landscape, and Lennon, like Wilson, often does so by using the figure of the perfect woman who will save the protagonist.\n\nIn 1964, the group once again released four albums – Shut Down vol.2, All Summer Long, a live album, and a Christmas album – and they also did most of the work on yet another album, The Beach Boys Today!, which would be released in early 1965.\n\nAs these recordings progressed, Brian Wilson was more and more ambitious, both in terms of the emotional effect of the music and his arrangements, increasingly using session musicians to augment the group, and trying for a variant on Phil Spector's production style, but one which emphasised gentle fragility rather than sturm und drang. Possibly the greatest track he created in 1964 ended up not being used by the Beach Boys, though, but was given to Glen Campbell:\n\n[Excerpt: Glen Campbell, \"Guess I'm Dumb\"]\n\nCampbell got given that track because of an enormous favour he'd done the group. The mental strain of touring had finally got too much for Brian, and in December, on a plane to Texas, he'd had a breakdown, screaming on the plane and refusing to get off. Eventually, they coaxed him off the plane, and he'd managed to get through that night's show, but had flown back to LA straight after. Campbell, who was a session guitarist who had played on a number of the Beach Boys' recordings, and had a minor career as a singer at this point, had flown out at almost no notice and for the next five months he replaced Brian on stage for most of their shows, before the group got a permanent replacement in.\n\nBrian Wilson had retired from the road, and the hope was that by doing so, he would reduce the strain on himself enough that he could keep writing and producing for the group without making his mental health worse. And for a while, at least, that seemed to be how it worked out. We'll take a look at the results in a few weeks' time.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and seventeen of A History of Rock Music in Five Hundred Songs looks at \"Don't Worry Baby\" by the Beach Boys, and how the years 1963 and 1964 saw a radical evolution in the sound and subject matter of the Beach Boys' work. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"You're No Good\" by the Swinging Blue Jeans.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nERRATA:\n\nI say that the Surfin' USA album was released only four months after Surfin' Safari. It was actually over five months. Also, for some reason I pronounce Nik Venet's name as if he were French here. I believe that's incorrect and his name is actually pronounced “Vennit”, though I'm not 100% sure.\n\nMore importantly, I say that \"Sweet Little Sixteen\" wasn't a big hit, when of course it made number two on the charts.\n\nResources\n\nThere is no Mixcloud this week, because there were too many Beach Boys songs in the episode.\n\nI used many resources for this episode, most of which will be used in future Beach Boys episodes too. It's difficult to enumerate everything here, because I have been an active member of the Beach Boys fan community for twenty-four years, and have at times just used my accumulated knowledge for this. But the resources I list here are ones I've checked for specific things.\n\nBecoming the Beach Boys&nbsp;by James B. Murphy is an in-depth look at the group's early years, up to the end of 1963.\n\nStephen McParland has published many, many books on the California surf and hot-rod music scenes, including several on both the Beach Boys and Gary Usher. &nbsp;His books can be found at&nbsp;https://payhip.com/CMusicBooks\n\nAndrew Doe's&nbsp;Bellagio 10452&nbsp;site is an invaluable resource.\n\nJon Stebbins'&nbsp;The Beach Boys FAQ&nbsp;is a good balance between accuracy and readability. Stebbins also co-wrote&nbsp;The Lost Beach Boy, David Marks' autobiography.\n\nAnd&nbsp;Philip Lambert's&nbsp;Inside the Music of Brian Wilson&nbsp;is an excellent, though sadly out of print, musicological analysis of Wilson's music from 1962 through 67.\n\nThe Beach Boys' Morgan recordings and all the outtakes from them can be found on&nbsp;this 2-CD set.\n\nAs a good starting point for the Beach Boys' music, I would recommend this budget-priced three-CD set, which has a surprisingly good selection of their material on it.\n\nTranscript\n\nToday, we're going to take our second look at the Beach Boys, and we're going to look at their evolution through 1963 and 1964, as they responded to the threat from the Beatles by turning to ever more sophisticated music, even as they went through a variety of personal crises. We're going to look at a period in which they released four albums a year, had three lineup changes, and saw their first number one – and at a song which, despite being a B-side, regularly makes lists of the best singles of all time. We're going to look at “Don't Worry Baby”:\n\n[Excerpt: The Beach Boys, \"Don't Worry Baby\"]\n\nWhen we left the Beach Boys, they had just secured a contract with Capitol Records, and released their first national hit, \"Surfin' Safari\" backed with \"409\". Since then we've also seen Brian Wilson working with several songwriting collaborators to write hits for Jan and Dean. But now we need to double back and look at what Brian was doing with his main band in that time.\n\nAfter \"Surfin' Safari\" was a hit, in one of the many incomprehensible decisions made in the Beach Boys' career, Capitol decided to follow it up with an album track that Brian and Gary Usher had written, \"Ten Little Indians\". That track, a surf-rock version of the nursery rhyme with the group chanting \"Kemo sabe\" in the backing vocals, made only number forty-nine on th",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and seventeen of A History of Rock Music in Five Hundred Songs looks at \"Don't Worry Baby\" by the Beach Boys, and how the years 1963 and 1964 saw a radical evolution in the sound and subject matter of the Beach Boys' work. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"You're No Good\" by the Swinging Blue Jeans.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nERRATA:\n\nI say that the Surfin' USA album was released only four months after Surfin' Safari. It was actually over five months. Also, for some reason I pronounce Nik Venet's name as if he were French here. I believe that's incorrect and his name is actually pronounced “Vennit”, though I'm not 100% sure",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}