{
  "title": "#461: Snape's Secrets (OOTP 24, Occlumency)",
  "link": "https://audioboom.com/posts/7555420",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4912,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>\n<a href=\"https://www.youtube.com/watch?v=1A8_xp0IoS8&feature=emb_logo\">Quizzitch Live: The Fandom of Secrets</a> was a huge success! Keep an eye for our next hangout!</li>\n<li>Rupert Grint is going to be a DAD!</li>\n<li>Muggle Mail covers a random Lockhart encounter and when J.K. Rowling actually revealed Dumbledore's sexuality (see <a href=\"https://www.youtube.com/watch?v=Ij97LWo0I7s\">J.K. Rowling: A Year in the Life)</a>\n</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 24: Occlumency</li>\n<li>7-Word Summary: Harry’s journey back into his mind fails </li>\n<li>Snape vs. Sirius</li>\n<li>A grim goodbye! Should we have known then?</li>\n<li>What's the deal with The Knight Bus? Can't they \"magic\" a smoother ride?</li>\n<li>Cho and Harry: he picks up on what's she putting down relatively quickly for a teenage boy! See you on Valentine's Day!</li>\n<li>Nagini and The Department of Mysteries: Snape gives Harry the information Dumbledore and the Order of the Phoenix have refused to!</li>\n<li>What in the world is Dumbledore thinking letting Snape penetrate Harry's mind?</li>\n<li>Why doesn't Harry get the opportunity to remove memories he doesn't want Snape to see?</li>\n<li>Would Harry fair better if he actually listened to Snape's instructions?</li>\n<li>Could Occlumency be considered a form of rape?</li>\n<li>Snape reveals a big truth about himself when describing Legilimency, but it goes over Harry's head!</li>\n<li>What does Voldemort know about Harry at this point in the story? Does he know he's a Horcrux? If so, why the strong desire to kill him?</li>\n<li>Does Dumbledore not consider the vulnerable position mentally and physically these lessons put Harry in? </li>\n<li>Why does Snape not like the use of Voldemort's name?</li>\n<li>The Umbridge Suck Count climbs to 52!</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What does Hagrid instruct Harry to put on the salamanders?</li>\n<li>This week's episode is brought to you by <a href=\"https://wondery.com/shows/imagined-life/\">Wondery's Imagined Life</a>, and OpenFit (Start working out at home! Just text MuggleCast to 50-50-50 to get started)!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week, we discuss the difference between Snape and Queenie and their ability to \"read people's minds\"!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 14 Apr 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-04-13:/posts/7555420",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}