{
  "title": "#467: Stranger Danger (OOTP 30, Grawp)",
  "link": "https://audioboom.com/posts/7596438",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5140,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>There is a <a href=\"https://www.theickabog.com/read-the-story/\">new children's story</a> from JKR, and she's releasing fresh chapters every week day!</li>\n<li>All eight Harry Potter movies have been made available for streaming on HBO MAX. In Bonus MuggleCast, available now on Patreon, the hosts and listeners share their go-to HP films, and Micah tears apart Deathly Hallows, Part 2.</li>\n<li>The MuggleCast 15th Anniversary T-Shirt is here! <a href=\"http://www.patreon.com/mugglecast\">Become a Patron</a> by June 30 at the Dumbledore’s Army level or higher to get yours!</li>\n<li>MuggleMail topics include Sirius' relationship with Harry, bullying at Hogwarts, and Snape's maturation process.</li>\n<li>\n<a href=\"https://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix - Chapter 30: Grawp</li>\n<li>7-Word Summary: Hagrid reveals another giant secret mistake, Grawp</li>\n<li>Hogwarts professors and students are in open rebellion. Who put the Niffler in Umbridge's office?</li>\n<li>Harry comes clean about the Triwizard Winnings</li>\n<li>Can Harry be expected to pick up Occlumency after what happened? The hosts share their meditation tips for Harry.</li>\n<li>Is Hagrid's strategy for grabbing Hermione and Harry a good one?</li>\n<li>Laura reveals the Greek origin of centaurs and the hosts compare book events that line up</li>\n<li>What was Hagrid THINKING bringing Grawp into an inhabited forest?</li>\n<li>Ron's Mirror of Erised moment happens!</li>\n<li>Quizzitch: Who is the head of the Wizarding Examinations Authority?</li>\n<li>This week’s episode is sponsored by MeUndies, underwear that's so good, Dobby would never take it off his head! Get 15% off your first order and free shipping by going to <a href=\"http://www.MeUndies.com/MuggleCast\">MeUndies.com/MuggleCast</a>\n</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 02 Jun 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-06-01:/posts/7596438",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}