{
  "title": "Cloud communications firm Toku nets US$5M Series A+ for APAC expansion",
  "link": "https://e27.co/cloud-communications-firm-toku-nets-us5m-series-a-20221026/",
  "dc:creator": "Manisha Maity",
  "pubDate": "Wed, 26 Oct 2022 07:54:48 +0000",
  "category": [
    "Enterprise Solution & CRM",
    "News",
    "Startups",
    "Betatron Venture Group",
    "Delivery Hero Ventures",
    "OSK Ventures International",
    "Toku"
  ],
  "guid": "https://e27.co/?p=474980",
  "description": "<p>Singapore-headquartered cloud communications provider Toku has announced the completion of its US$5 million Series A extension round, bringing its total funding to US$10 million. The new round was co-led by Delivery Hero Ventures and Malaysia&#8217;s OSK Ventures, with participation from Betatron Venture Group. The startup will use the fresh money for APAC expansion and establish [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/cloud-communications-firm-toku-nets-us5m-series-a-20221026/\">Cloud communications firm Toku nets US$5M Series A+ for APAC expansion</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_474982\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-474982\" loading=\"lazy\" class=\"wp-image-474982 size-full\" src=\"https://e27.co/wp-content/uploads/2022/10/e27-21.png\" alt=\"\" width=\"690\" height=\"390\" /><p id=\"caption-attachment-474982\" class=\"wp-caption-text\">Thomas Laboulle, Founder and CEO of Toku</p></div>\n<p>Singapore-headquartered cloud communications provider Toku has announced the completion of its US$5 million Series A extension round, bringing its total funding to US$10 million.</p>\n<p>The new round was co-led by Delivery Hero Ventures and Malaysia&#8217;s OSK Ventures, with participation from Betatron Venture Group.</p>\n<p>The startup will use the fresh money for APAC expansion and establish a local presence in Malaysia, Indonesia, Hong Kong, Vietnam, South Korea and the Philippines. It also aims to double its total headcount to 200 by 2024.</p>\n<p>Toku creates bespoke cloud communications and customer engagement solutions. It combines local expertise, regional in-country infrastructure and global reach to help businesses overcome the complexity of digital transformation in APAC markets and enhance their CX with mission-critical cloud communications solutions.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/impact-vc-shift4good-fund-i-makes-us98m-first-close-20221020/\">Shift4Good fund I makes US$98M first close to invest in sustainable mobility startups</a></strong></p>\n<p>The company works with leading regional brands, such as foodpanda, Gojek, Lenskart, Decathlon, and JCDecaux.</p>\n<p>Toku claims it recorded a compound annual growth rate (CAGR) of 128 per cent over the past four years. The company is closing in on half a billion customer interactions processed annually across 17 markets in APAC.</p>\n<p>Thomas Laboulle, Founder and CEO, Toku, said: &#8220;As the APAC digital economy continues to mature, customer experience has emerged as a key differentiator and a major driver of value for businesses.</p>\n<p>—</p>\n<p>Echelon 2022 aims to provide intimate and focused discussions on key topics and business matching services to facilitate business-driven connections during the two-day event. <strong>e27 </strong>will curate and invite key stakeholders of startups, investors, corporates, and ecosystem enablers to drive towards fruitful business outcomes at Echelon.</p>\n<p>The 2022 Echelon edition will be co-located with SWITCH at Resorts World Sentosa from 27 to 28 October 2022. <a class=\"c-link\" tabindex=\"-1\" rel=\"follow\" href=\"https://e27.co/echelon/asia/\" target=\"_blank\" rel=\"follow noopener\" data-stringify-link=\"https://e27.co/echelon/asia/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" >Learn more here</a>.<span class=\"c-message__edited_label\" dir=\"ltr\" data-sk=\"tooltip_parent\" > </span></p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/cloud-communications-firm-toku-nets-us5m-series-a-20221026/\">Cloud communications firm Toku nets US$5M Series A+ for APAC expansion</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}