{
  "guid": "fd65ae08-6c41-4c3f-b97e-2fe8533ae0d0",
  "title": "God's Wisdom in the Law - Law E4",
  "description": "<p>In part 1 (0-17:00), The guys quickly recap their conversation so far. Tim then dives into a third perspective on the Hebrew laws in the Old Testament.</p>\n<p>The third perspective is that the laws embody and revolutionize ancient Eastern conceptions of justice. The laws are formulated in the language and categories of ancient Near Eastern law, so that Israel’s law was comprehensible to their neighbors while also representing an irreversible cultural revolution.</p>\n<p>Tim notes that in all the other ancient covenant documents (Hittite, Assyrian) only one is between a king and a people, while dozens of others are between one king and another king. Covenants are agreements between kings. But the Biblical story depicts the laws as stipulations between God and all the Israelites: “I will be their God and they will be my people.” This is the same kind of language we find in the Song of Solomon, “I am my beloved’s and he is mine” (Song of Solomon 6:3). This is marriage covenant language.</p>\n<p>Tim uses some quotes from Joshua Berman to make his points.</p>\n<p>“In the ancient near east, various gods had consorts and goddess wives, while the common man was subject, a slave and servant of the king and the tribute-imposing class. For these cultures to conceive of the marriage between a god and a group of humans, would have been as unthinkable as for us to imagine the marital union of a human and a cat… The Bible’s most revolutionary idea… is the idea of God as a personality who seeks a relationship of mutuality with human agents. In the neighboring cultures of the ancient Near East, humans were merely slaves of the king. In the Bible, they are transformed into a servant king who is married to a generous sovereign, a wife in relation to her benefactor husband. When God seeks “love” from Israel, it involves both the political sense of loyalty between parties to a treaty as well as the kind of intimacy known in a faithful, intimate relationship between a man and woman.” (Berman, Created Equal, 46)</p>\n<p>This concept of a human family married to God is founded on the concept of humanity in Genesis 1-2. All humanity, male and female, is the divine royal image over all creation. And while the Davidic king could be called the “son of God,” it was only as the representative of all Israel who is the “son of God” (Exodus 4:22). The king and all the Israelites are themselves equals under their “divine king” Yahweh. Tim again cites Joshua Berman:</p>\n<p>“While in Egypt and Mesopotamia, the bridge figure between the divine and human was the king, deified (as in Egypt) or more of a demi-god (Mesopotamia). He was the top of the socio-religious structure with the economic elite, and this was mirrored by the hierarchy of the gods. NOT SO in biblical Israel. God’s covenant was with the entirety of Israel, focused on the “common man.” I maintain that it is in the covenant, properly conceived in in ancient Near Eastern setting, that we may discern a radically new understanding of the cosmic role of the common man within the thought systems of the ancient Near East, one that constituted the basis of an egalitarian order.” (Berman, Created Equal, 29)</p>\n<p>In part 2 (17:00-25:15), Tim explains why Israel’s law codes consistently downgrades the role of the king in contrast to their neighbors. The king is not the sole, chief, divine authority; rather, Yahweh is king, and the human king is subservient to the Scriptures (Deuteronomy 17) and to prophets who speak on Yahweh’s behalf. He is a leader in war, but he is not the chief. He can participate in the temple, but he is not the high priest. He is subservient to the law, but he is not the lawgiver. This is all in contrast to Egypt and Babylon.</p>\n<p>Tim also explains that the laws allowed Israel’s economy to be oriented toward landed families, which were called to include the immigrant, poor, and orphans. It is the first ancient example of “welfare society.” You can see examples of laws about not maximizing profit to allow work in the fields in Ruth chapters 2-3.</p>\n<p>Other examples include laws about the seven year debt release, Jubilee land and debt release, not charging interest on loans for the poor, giving a tithe for local loans for failing farmers.</p>\n<p>Tim again cites Berman:</p>\n<p>“The biblical laws about land and assets introduce a reformation of the ancient worldview aimed at achieving a social equality, but of a very specific king. It is not the egalitarianism developed since the French Revolution with its emphasis on the individual and inalienable human rights… Rather, it takes the form of an economic system that seeks equality by granting sacred value to the extended family household, where people assist one another in farming labor and in granting relief to other households in need. Ancient Israel was a tribal association of free farmers and ranchers, living in a single and equal social class with common ownership of the means of production. This system was a rejection of statism (= the nations state owns all land) and feudalism (= military lords own all land), demonstrated by the fact that it was free of tribute to any human king, and their tribute was a shared burden of funding the temple. Israel defined itself in opposition to the empire of oppression embodied by Egyptian slavery, and also in opposition to the centralized monarchies that surrounded and took up residence in Israel.” (Berman, Created Equal, 87)</p>\n<p>Tim points out that a scholar named David Bentley Hart has influenced his thinking on this subject. Tim says that the Judeo-Christian heritage is the most beautiful thing about Western civilization.</p>\n<p>In part 3 (25:15-30:00), Tim teaches through a specific law that is usually very disturbing to modern readers.</p>\n<p>Deuteronomy 21:10-14<br />\n10 When you go to war against your enemies and the Lord your God delivers them into your hands and you take captives, 11 if you notice among the captives a beautiful woman and are attracted to her, you may take her as your wife. 12 Bring her into your home and have her shave her head, trim her nails 13 and put aside the clothes she was wearing when captured. After she has lived in your house and mourned her father and mother for a full month, then you may go to her and be her husband and she shall be your wife. 14 If you are not pleased with her, let her go wherever she wishes. You must not sell her or treat her as a slave, since you have dishonored her.</p>\n<p>Tim points out that this law does not promote the practice it seems to promote. Instead, it creates boundaries for a common cultural practice, which are eventually designed to obliterate the practice all together. This law is in reaction to other ancient cultures that didn’t have any rules or give any thought to how soldiers should treat their captives.</p>\n<p>In part 4 (30:00-43:10), Tim brings up an important point to keep in mind when reading biblical law: The laws play an important but ultimately subordinate role in the plot of the larger biblical storyline that leads to Jesus. Humanity’s failure to obey the divine command is part of the plot conflict that prevents them from being God’s image-partners in ruling creation. The laws illustrate the divine ideal while also intensifying that conflict, creating the need for a new human and a new covenant.</p>\n<p>Tim notes that the first divine command is in the garden of Eden:</p>\n<p>Genesis 2:16-17<br />\n16 The Lord God commanded the man, saying, “From any tree of the garden you may eat freely; 17 but from the tree of knowing good and evil you shall not eat, for in the day that you eat from it you will surely die.”</p>\n<p>Tim says the failure to “listen to the voice of God” (breaking the divine command) results in exile from the Eden-mountain, leading to death.</p>\n<p>Genesis 3:17, 24<br />\n17 Then to Adam He said, “Because you have listened to the voice of your wife, and have eaten from the tree about which I commanded you, saying, ‘You shall not eat from it’;<br />\n24 So He banished the human; and at the east of the garden of Eden He stationed the cherubim and the flaming sword which turned every direction to guard the way to the tree of life.</p>\n<p>In part 5, (43:10-end) Tim notes that this theme of listening or not listening to the divine command continues through the Bible.</p>\n<p>Exodus 19:4-6<br />\n4 ‘You yourselves have seen what I did to the Egyptians, and how I bore you on eagles’ wings, and brought you to Myself. 5 ‘Now then, if you will listen listen to My voice and keep My covenant, then you shall be My own possession among all the peoples, for all the earth is Mine; 6 and you shall be to Me a kingdom of priests and a holy nation.’ These are the words that you shall speak to the sons of Israel.”</p>\n<p>Tim notes that the story immediately after this story is the story of the golden calf, which shows Israel’s obvious failure to listen.</p>\n<p>Tim points out that Israel’s covenant choice is the same as Adam and Eve and all humanity.</p>\n<p>Deuteronomy 30:15-20<br />\n15 “See, I have set before you today life and good, and death and evil; 16 in that I command you today to love the Lord your God, to walk in His ways and to keep His commandments and His statutes and His judgments, that you may have life and multiply, and that the Lord your God may bless you in the land where you are entering to possess it. 17 “But if your heart turns away and you will not obey, but are drawn away and worship other gods and serve them, 18 I declare to you today that you shall surely perish. You will not prolong your days in the land where you are crossing the Jordan to enter and possess it. 19 “I call heaven and earth to witness against you today, that I have set before you life and death, the blessing and the curse. So choose life in order that you may live, you and your descendants, 20 by loving the Lord your God, by listening to His voice, and by holding fast to Him; for this is your life and the length of your days, that you may live in the land which the Lord swore to your fathers, to Abraham, Isaac, and Jacob, to give them.”</p>\n<p>Tim notes that Israel’s inability to “listen to the voice” of God, leading to death and exile, traps humanity in the power of death, which necessitates the messianic age and the new covenant.</p>\n<p>Jeremiah 31:31-34<br />\n31 “Behold, days are coming,” declares the Lord, “when I will make a new covenant with the house of Israel and with the house of Judah, 32 not like the covenant which I made with their fathers in the day I took them by the hand to bring them out of the land of Egypt, My covenant which they broke, although I was a husband to them,” declares the Lord. 33 “But this is the covenant which I will make with the house of Israel after those days,” declares the Lord, “I will put My law within them and on their heart I will write it; and I will be their God, and they shall be My people. 34 “They will not teach again, each man his neighbor and each man his brother, saying, ‘Know the Lord,’ for they will all know Me, from the least of them to the greatest of them,” declares the Lord, “for I will forgive their iniquity, and their sin I will remember no more.”</p>\n<p>Ezekiel 36:26-28<br />\n26 “Moreover, I will give you a new heart and put a new spirit within you; and I will remove the heart of stone from your flesh and give you a heart of flesh. 27 “I will put My Spirit within you and cause you to walk in My statutes, and you will be careful to observe My ordinances. 28 “You will live in the land that I gave to your forefathers; so you will be My people, and I will be your God.</p>\n<p>Tim concludes by sharing that the law isn't about an \"Old Covenant or New Covenant\" question. Instead, the law illuminates and explores the portrait of humanity repeatedly failing to listen to the divine voice.</p>\n<p>Show Produced by:<br />\nDan Gummel, Jon Collins.</p>\n<p>Show Music:<br />\n“Defender Instrumental” by Tents<br />\n“Cartilage” by Moby<br />\n“All Night” by Unwritten Stories<br />\n“Good Morning” by Unwritten Stories<br />\nThe Pilgrim </p>\n<p>Show Resources:</p>\n<p>Our video on the law: https://www.youtube.com/watch?v=Sew1kBIe-W0</p>\n<p>Joshua Berman: Created Equal: How the Bible Broke with Ancient Political Thought </p>\n",
  "pubDate": "Mon, 20 May 2019 07:01:00 +0000",
  "author": "admin@bibleproject.com (Tim Mackie & Jon Collins)",
  "link": "http://www.bibleproject.com",
  "content:encoded": "<p>In part 1 (0-17:00), The guys quickly recap their conversation so far. Tim then dives into a third perspective on the Hebrew laws in the Old Testament.</p>\n<p>The third perspective is that the laws embody and revolutionize ancient Eastern conceptions of justice. The laws are formulated in the language and categories of ancient Near Eastern law, so that Israel’s law was comprehensible to their neighbors while also representing an irreversible cultural revolution.</p>\n<p>Tim notes that in all the other ancient covenant documents (Hittite, Assyrian) only one is between a king and a people, while dozens of others are between one king and another king. Covenants are agreements between kings. But the Biblical story depicts the laws as stipulations between God and all the Israelites: “I will be their God and they will be my people.” This is the same kind of language we find in the Song of Solomon, “I am my beloved’s and he is mine” (Song of Solomon 6:3). This is marriage covenant language.</p>\n<p>Tim uses some quotes from Joshua Berman to make his points.</p>\n<p>“In the ancient near east, various gods had consorts and goddess wives, while the common man was subject, a slave and servant of the king and the tribute-imposing class. For these cultures to conceive of the marriage between a god and a group of humans, would have been as unthinkable as for us to imagine the marital union of a human and a cat… The Bible’s most revolutionary idea… is the idea of God as a personality who seeks a relationship of mutuality with human agents. In the neighboring cultures of the ancient Near East, humans were merely slaves of the king. In the Bible, they are transformed into a servant king who is married to a generous sovereign, a wife in relation to her benefactor husband. When God seeks “love” from Israel, it involves both the political sense of loyalty between parties to a treaty as well as the kind of intimacy known in a faithful, intimate relationship between a man and woman.” (Berman, Created Equal, 46)</p>\n<p>This concept of a human family married to God is founded on the concept of humanity in Genesis 1-2. All humanity, male and female, is the divine royal image over all creation. And while the Davidic king could be called the “son of God,” it was only as the representative of all Israel who is the “son of God” (Exodus 4:22). The king and all the Israelites are themselves equals under their “divine king” Yahweh. Tim again cites Joshua Berman:</p>\n<p>“While in Egypt and Mesopotamia, the bridge figure between the divine and human was the king, deified (as in Egypt) or more of a demi-god (Mesopotamia). He was the top of the socio-religious structure with the economic elite, and this was mirrored by the hierarchy of the gods. NOT SO in biblical Israel. God’s covenant was with the entirety of Israel, focused on the “common man.” I maintain that it is in the covenant, properly conceived in in ancient Near Eastern setting, that we may discern a radically new understanding of the cosmic role of the common man within the thought systems of the ancient Near East, one that constituted the basis of an egalitarian order.” (Berman, Created Equal, 29)</p>\n<p>In part 2 (17:00-25:15), Tim explains why Israel’s law codes consistently downgrades the role of the king in contrast to their neighbors. The king is not the sole, chief, divine authority; rather, Yahweh is king, and the human king is subservient to the Scriptures (Deuteronomy 17) and to prophets who speak on Yahweh’s behalf. He is a leader in war, but he is not the chief. He can participate in the temple, but he is not the high priest. He is subservient to the law, but he is not the lawgiver. This is all in contrast to Egypt and Babylon.</p>\n<p>Tim also explains that the laws allowed Israel’s economy to be oriented toward landed families, which were called to include the immigrant, poor, and orphans. It is the first ancient example of “welfare society.” You can see examples of laws about not maximizing profit to allow work in the fields in Ruth chapters 2-3.</p>\n<p>Other examples include laws about the seven year debt release, Jubilee land and debt release, not charging interest on loans for the poor, giving a tithe for local loans for failing farmers.</p>\n<p>Tim again cites Berman:</p>\n<p>“The biblical laws about land and assets introduce a reformation of the ancient worldview aimed at achieving a social equality, but of a very specific king. It is not the egalitarianism developed since the French Revolution with its emphasis on the individual and inalienable human rights… Rather, it takes the form of an economic system that seeks equality by granting sacred value to the extended family household, where people assist one another in farming labor and in granting relief to other households in need. Ancient Israel was a tribal association of free farmers and ranchers, living in a single and equal social class with common ownership of the means of production. This system was a rejection of statism (= the nations state owns all land) and feudalism (= military lords own all land), demonstrated by the fact that it was free of tribute to any human king, and their tribute was a shared burden of funding the temple. Israel defined itself in opposition to the empire of oppression embodied by Egyptian slavery, and also in opposition to the centralized monarchies that surrounded and took up residence in Israel.” (Berman, Created Equal, 87)</p>\n<p>Tim points out that a scholar named David Bentley Hart has influenced his thinking on this subject. Tim says that the Judeo-Christian heritage is the most beautiful thing about Western civilization.</p>\n<p>In part 3 (25:15-30:00), Tim teaches through a specific law that is usually very disturbing to modern readers.</p>\n<p>Deuteronomy 21:10-14<br />\n10 When you go to war against your enemies and the Lord your God delivers them into your hands and you take captives, 11 if you notice among the captives a beautiful woman and are attracted to her, you may take her as your wife. 12 Bring her into your home and have her shave her head, trim her nails 13 and put aside the clothes she was wearing when captured. After she has lived in your house and mourned her father and mother for a full month, then you may go to her and be her husband and she shall be your wife. 14 If you are not pleased with her, let her go wherever she wishes. You must not sell her or treat her as a slave, since you have dishonored her.</p>\n<p>Tim points out that this law does not promote the practice it seems to promote. Instead, it creates boundaries for a common cultural practice, which are eventually designed to obliterate the practice all together. This law is in reaction to other ancient cultures that didn’t have any rules or give any thought to how soldiers should treat their captives.</p>\n<p>In part 4 (30:00-43:10), Tim brings up an important point to keep in mind when reading biblical law: The laws play an important but ultimately subordinate role in the plot of the larger biblical storyline that leads to Jesus. Humanity’s failure to obey the divine command is part of the plot conflict that prevents them from being God’s image-partners in ruling creation. The laws illustrate the divine ideal while also intensifying that conflict, creating the need for a new human and a new covenant.</p>\n<p>Tim notes that the first divine command is in the garden of Eden:</p>\n<p>Genesis 2:16-17<br />\n16 The Lord God commanded the man, saying, “From any tree of the garden you may eat freely; 17 but from the tree of knowing good and evil you shall not eat, for in the day that you eat from it you will surely die.”</p>\n<p>Tim says the failure to “listen to the voice of God” (breaking the divine command) results in exile from the Eden-mountain, leading to death.</p>\n<p>Genesis 3:17, 24<br />\n17 Then to Adam He said, “Because you have listened to the voice of your wife, and have eaten from the tree about which I commanded you, saying, ‘You shall not eat from it’;<br />\n24 So He banished the human; and at the east of the garden of Eden He stationed the cherubim and the flaming sword which turned every direction to guard the way to the tree of life.</p>\n<p>In part 5, (43:10-end) Tim notes that this theme of listening or not listening to the divine command continues through the Bible.</p>\n<p>Exodus 19:4-6<br />\n4 ‘You yourselves have seen what I did to the Egyptians, and how I bore you on eagles’ wings, and brought you to Myself. 5 ‘Now then, if you will listen listen to My voice and keep My covenant, then you shall be My own possession among all the peoples, for all the earth is Mine; 6 and you shall be to Me a kingdom of priests and a holy nation.’ These are the words that you shall speak to the sons of Israel.”</p>\n<p>Tim notes that the story immediately after this story is the story of the golden calf, which shows Israel’s obvious failure to listen.</p>\n<p>Tim points out that Israel’s covenant choice is the same as Adam and Eve and all humanity.</p>\n<p>Deuteronomy 30:15-20<br />\n15 “See, I have set before you today life and good, and death and evil; 16 in that I command you today to love the Lord your God, to walk in His ways and to keep His commandments and His statutes and His judgments, that you may have life and multiply, and that the Lord your God may bless you in the land where you are entering to possess it. 17 “But if your heart turns away and you will not obey, but are drawn away and worship other gods and serve them, 18 I declare to you today that you shall surely perish. You will not prolong your days in the land where you are crossing the Jordan to enter and possess it. 19 “I call heaven and earth to witness against you today, that I have set before you life and death, the blessing and the curse. So choose life in order that you may live, you and your descendants, 20 by loving the Lord your God, by listening to His voice, and by holding fast to Him; for this is your life and the length of your days, that you may live in the land which the Lord swore to your fathers, to Abraham, Isaac, and Jacob, to give them.”</p>\n<p>Tim notes that Israel’s inability to “listen to the voice” of God, leading to death and exile, traps humanity in the power of death, which necessitates the messianic age and the new covenant.</p>\n<p>Jeremiah 31:31-34<br />\n31 “Behold, days are coming,” declares the Lord, “when I will make a new covenant with the house of Israel and with the house of Judah, 32 not like the covenant which I made with their fathers in the day I took them by the hand to bring them out of the land of Egypt, My covenant which they broke, although I was a husband to them,” declares the Lord. 33 “But this is the covenant which I will make with the house of Israel after those days,” declares the Lord, “I will put My law within them and on their heart I will write it; and I will be their God, and they shall be My people. 34 “They will not teach again, each man his neighbor and each man his brother, saying, ‘Know the Lord,’ for they will all know Me, from the least of them to the greatest of them,” declares the Lord, “for I will forgive their iniquity, and their sin I will remember no more.”</p>\n<p>Ezekiel 36:26-28<br />\n26 “Moreover, I will give you a new heart and put a new spirit within you; and I will remove the heart of stone from your flesh and give you a heart of flesh. 27 “I will put My Spirit within you and cause you to walk in My statutes, and you will be careful to observe My ordinances. 28 “You will live in the land that I gave to your forefathers; so you will be My people, and I will be your God.</p>\n<p>Tim concludes by sharing that the law isn't about an \"Old Covenant or New Covenant\" question. Instead, the law illuminates and explores the portrait of humanity repeatedly failing to listen to the divine voice.</p>\n<p>Show Produced by:<br />\nDan Gummel, Jon Collins.</p>\n<p>Show Music:<br />\n“Defender Instrumental” by Tents<br />\n“Cartilage” by Moby<br />\n“All Night” by Unwritten Stories<br />\n“Good Morning” by Unwritten Stories<br />\nThe Pilgrim </p>\n<p>Show Resources:</p>\n<p>Our video on the law: https://www.youtube.com/watch?v=Sew1kBIe-W0</p>\n<p>Joshua Berman: Created Equal: How the Bible Broke with Ancient Political Thought </p>\n",
  "enclosure": "",
  "itunes:title": "God's Wisdom in the Law - Law E4",
  "itunes:author": "Tim Mackie & Jon Collins",
  "itunes:image": "",
  "itunes:duration": "00:51:45",
  "itunes:summary": "Welcome to our fourth episode on how to read biblical law!",
  "itunes:subtitle": "Welcome to our fourth episode on how to read biblical law!",
  "itunes:keywords": "priests, jon collins, biblical, jesus christ, bible study, law, god, old testament, christianity, torah, bible, theology, tim mackie, spirituality, jesus",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 136
}