{
  "title": "EPISODE 73: The Life of Marcus Aurelius (Part 1): Stoicism, Pandemic and War",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 26 Mar 2021 15:50:57 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2021/3/26/episode-73-the-life-of-marcus-aurelius-part-1-stoicism-pandemic-and-war",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:605e0255e7088f4b98476c24",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773815405-GJD6727SL6XM6Z2M6VHP/HOF-73-MarcusAurelius-I.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-73-MarcusAurelius-I.jpg\" data-load=\"false\" data-image-id=\"605e02b502815d2a26e0639b\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616773815405-GJD6727SL6XM6Z2M6VHP/HOF-73-MarcusAurelius-I.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Rise up and do battle.”</em> — Homer</p><p class=\"\"><em>“Discipline is freedom, and the companion to imagination. Discipline makes it possible for you to become whatever you want to be.”</em> — Deng Ming Dao</p><p class=\"\">Marcus Aurelius would have loved nothing better than studying philosophy for the rest of his days. Instead, destiny chose him to be the head of the Roman Empire. As a philosopher-emperor, Marcus turned to Stoicism to help him deal with more drama than any human being should have to deal with. Most of his children died before reaching adult age. Rome’s old rival, Parthia, engaged the empire in a brutal war for supremacy. Germanic tribes raided the frontier and invaded Italy. Marcus’ adoptive brother and co-emperor died early, leaving to Marcus the burden to lead the empire under dreadful circumstances. And then there was the pandemic… a terrifying plague that would kill large chunks of the population, cripple the economy, disrupt travel, and create a very well justified climate of fear. Marcus’ ability to navigate all this and more thanks to his philosophical practices enshrined his name among those of the best emperors Rome ever had.&nbsp;</p><p class=\"\">In this first episode, we cover: Lost, Marcus’ pep-talks, the power of rituals, the genesis of the empire, Marcus Aurelius’ early life, the impact of Greek culture in Rome, Emperor Hadrian’s murderous ways, Stoicism, Antoninus’ reign, and much more.</p>",
  "media:content": {
    "media:title": "EPISODE 73: The Life of Marcus Aurelius (Part 1): Stoicism, Pandemic and War"
  }
}