{
  "id": "yt:video:63L0yiN3Ix0",
  "yt:videoId": "63L0yiN3Ix0",
  "yt:channelId": "UCQSEAbOs6vsJfy7WN7iYaGQ",
  "title": "Donut County speedruns are incredibly satisfying",
  "link": "",
  "author": {
    "name": "EazySpeezy",
    "uri": "https://www.youtube.com/channel/UCQSEAbOs6vsJfy7WN7iYaGQ"
  },
  "published": "2022-09-22T23:00:01+00:00",
  "updated": "2022-09-30T20:48:08+00:00",
  "media:group": {
    "media:title": "Donut County speedruns are incredibly satisfying",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Today we're speedrunning Donut County, a game where you consume everything and anything. It's probably one of the most satisfying speedruns you'll ever see\n\nMy 2nd channel (WEEKLY UPLOADS): https://www.youtube.com/eaziestspeezy\nWatch live at: https://twitch.tv/EazySpeezy\n\n▶ Twitter: https://twitter.com/EazySpeezy\n▶ Instagram: https://instagram.com/EazySpeezy/\n▶ Merch: https://eazyspeezy.com\n\nEdited by: @The Suited Bird \nWatch the world record speedrun here: https://youtu.be/dPp8EvXCgC8\n\nMy channel generally focuses on a more casual side of speedruns. With these videos I want to show off cool speedruns, explain how they work, and entertain. Hopefully you enjoy the content and maybe even take up speedrunning yourself, because it is truly a lot of fun!\n\nDonut County description (from Steam):\n\nDonut County is a story-based physics puzzle game where you play as an ever-growing hole in the ground. Meet cute characters, steal their trash, and throw them in a hole.\n\nWhere Trash is Treasure\nRaccoons have taken over Donut County with remote-controlled trash-stealing holes. You play as BK, a hole-driving raccoon who swallows up his friends and their homes to earn idiotic prizes.\n\nWhen BK falls into one of his own holes, he’s confronted by his best friend Mira and the residents of Donut County, who are all stuck 999 feet underground… and they demand answers!\n\nThe Hole Keeps Growing\n• EXPLORE every character’s home, each with their own unique environment.\n• MOVE the hole to swallow up their stuff, growing bigger each time.\n• COMBINE objects inside for crazy effects: cook soup, breed bunnies, launch fireworks, and more.\n• CATAPULT things back out of the hole. You can use it to solve puzzles...or just destroy stuff.\n• DEVOUR everything. The hole won’t stop until the whole county is all gone.\n\n#EazySpeezy #DonutCounty #Speedrun",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}