{
  "title": "Exploiting Multiple Machines for Embarrassingly Parallel Applications",
  "link": "http://artem.sobolev.name/posts/2014-08-01-gnu-parallel.html",
  "description": "<p>During work on my machine learning project I was needed to perform some quite computation-heavy calculations several times — each time with a bit different inputs. These calculations were CPU and memory bound, so just spawning them all at once would just slow down overall running time because of increased amount of context switches. Yet running 4 (=number of cores in my CPU) of them at a time (actually, 3 since other applications need CPU, too) should speed it up.</p>\n<p>Fortunately, I have an old laptop with 2 cores as well as an access to somewhat more modern machine with 4 cores. That results in 10 cores spread across 3 machines (all of`em have some version of GNU Linux installed). The question was how to exploit such a treasury.</p>\n<!--more-->\n<p>And the answer is GNU Parallel with some additional bells and whistles. GNU Parallel allows one to execute some commands in parallel and even in a distributed way.</p>\n<p>The command was as following</p>\n<div class=\"sourceCode\"><pre class=\"sourceCode bash\"><code class=\"sourceCode bash\"><span class=\"ex\">parallel</span> -u --wd ... -S :,host1,host2 --trc <span class=\"dt\">{}</span>.emb <span class=\"st\">\"sh {}\"</span></code></pre></div>\nHere we have:\n<ul>\n<li>\n<strong>wd</strong> stands for working directory. Three-dots means <code>parallel</code>’s temporary folder\n</li>\n<li>\n<strong>S</strong> contains list of hosts with : being a localhost\n</li>\n<li>\n<strong>trc</strong> stands for “Transfer, Return, Cleanup” and means that we’d like to transfer an executable file to target host, return specified file and do a cleanup\n</li>\n</ul>\n<p><code>parallel</code> accepts list command arguments (file names) in standard input and executes a command (<code>sh</code> in my case) for each of them.</p>\n<div class=\"sourceCode\"><pre class=\"sourceCode bash\"><code class=\"sourceCode bash\"><span class=\"fu\">ls</span> -1 jobs/* <span class=\"kw\">|</span> <span class=\"ex\">parallel</span> -u --wd ... -S :,host1,host2 --trc <span class=\"dt\">{}</span>.emb <span class=\"st\">\"sh {}\"</span></code></pre></div>\n<p>There’s a problem: we usually need more than one file to do usefull stuff. There are several solutions to that problem</p>\n<ul>\n<li>\n<strong>Bring all files manually</strong><br/> It’s a solution, but somewhat tedious one: setting computing environment on a several machines is dull\n</li>\n<li>\n<strong>tar it and do all the stuff in a command</strong><br/> Looks better, but some shell kung-fu is required\n</li>\n<li>\n<strong>Use <a href=\"http://en.wikipedia.org/wiki/Shar\">shar</a></strong><br/> Basically it’s a tar archive with some shell commands for (self-)extracting. I chose this way and glued in some my code.\n</li>\n</ul>",
  "pubDate": "Fri, 01 Aug 2014 00:00:00 UT",
  "guid": "http://artem.sobolev.name/posts/2014-08-01-gnu-parallel.html",
  "dc:creator": "Artem"
}