{
  "title": "Reliable Malware Analysis and Detection using Topology Data Analysis. (arXiv:2211.01535v1 [cs.CR])",
  "link": "http://arxiv.org/abs/2211.01535",
  "description": "<p>Increasingly, malwares are becoming complex and they are spreading on\nnetworks targeting different infrastructures and personal-end devices to\ncollect, modify, and destroy victim information. Malware behaviors are\npolymorphic, metamorphic, persistent, able to hide to bypass detectors and\nadapt to new environments, and even leverage machine learning techniques to\nbetter damage targets. Thus, it makes them difficult to analyze and detect with\ntraditional endpoint detection and response, intrusion detection and prevention\nsystems. To defend against malwares, recent work has proposed different\ntechniques based on signatures and machine learning. In this paper, we propose\nto use an algebraic topological approach called topological-based data analysis\n(TDA) to efficiently analyze and detect complex malware patterns. Next, we\ncompare the different TDA techniques (i.e., persistence homology, tomato, TDA\nMapper) and existing techniques (i.e., PCA, UMAP, t-SNE) using different\nclassifiers including random forest, decision tree, xgboost, and lightgbm. We\nalso propose some recommendations to deploy the best-identified models for\nmalware detection at scale. Results show that TDA Mapper (combined with PCA) is\nbetter for clustering and for identifying hidden relationships between malware\nclusters compared to PCA. Persistent diagrams are better to identify\noverlapping malware clusters with low execution time compared to UMAP and\nt-SNE. For malware detection, malware analysts can use Random Forest and\nDecision Tree with t-SNE and Persistent Diagram to achieve better performance\nand robustness on noised data.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Tidjon_L/0/1/0/all/0/1\">Lionel Nganyewou Tidjon</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Khomh_F/0/1/0/all/0/1\">Foutse Khomh</a>"
}