{
  "title": "Episode 18: &#8220;Sh-Boom&#8221; by the Chords",
  "link": "https://500songs.com/podcast/sh-boom-by-the-chords/",
  "pubDate": "Mon, 04 Feb 2019 03:36:07 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/sh-boom-by-the-chords/",
  "description": "Welcome to episode eighteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Sh-Boom\" by the Chords. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-18-sh-boom/\">a Mixcloud streaming playlist</a> with full versions of almost all the songs in the episode. In this case, I have missed out one track that's used in the podcast - I use approximately seven seconds of the intro to \"Blurred Lines\" by Robin Thicke, without any of the lyrics, in the podcast. I am not going to share that song anywhere, given its lyrical content.\n\nMy main resources are, as with last week&nbsp; <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, one of the most important books on early 50s rhythm and blues, <a href=\"https://amzn.to/2RVFgxa\"><em>The Sound of the City</em></a> by Charlie Gillett, and <a href=\"http://www.uncamarvy.com/\">Marv Goldberg's website</a>.\n\nThe Chords' music has never been anthologised on CD that I can find out, but almost any good doo-wop compilation should have \"Sh-Boom\".\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nLet's talk about one-hit wonders for a while. One-hit wonders have an unusual place in the realm of music history, and one which it's never easy to decide whether to envy or to pity. After all, a one-hit wonder has had a hit, which is more than the vast majority of musicians ever do. And depending on how big the hit is and how good it is, that one hit might be enough to keep them going through a whole career. There are musicians to this day who can go out and perform in front of a crowd of a few thousand people, every night, who've come there just to hear that one song they recorded nearly sixty years ago -- and if the musician is good enough they can get that crowd enjoying their other songs as well.\n\nBut there are other musicians who can never capitalise on that one record, and who never get another shot. And for those people, as the song goes, \"a taste of honey's worse than none at all\". What initially looked like it might be a massive career turns into a fluke. Sometimes they take it well and it just becomes a story to tell the grandkids, but other times it messes up everyone's life.\n\nThere are people out there who've spent thirty or forty years of their life chasing a second hit, who will never be truly happy because they expected more from their brief success than it brought them.\n\nThere are a lot of one-hit wonders in the world of rock and roll, and a lot of people who end up unlucky, but few have been as unlucky as the Chords, who wrote and recorded one of the biggest hits of all time, but who through a combination of bad luck in choosing a name, and more than a little racism, never managed to have a follow-up. Amazingly, they seem to have handled it far better than most.\n\n\"Sh-Boom\", the Chords' only hit, was the first rhythm and blues record by a black artist or group to make the top ten in the Billboard pop charts, so I suppose this is as good a time as any to talk about how the Billboard charts work, and how they differ from charts in the UK and some other countries.\n\nWhile the UK's singles charts are based only on record sales (and, these days, streams, but that doesn't really apply to this pre-digital era), the Billboard charts have always been an industry-specific thing rather than aimed at the public, and so they were based on many different metrics. As well as charts for record sales, they had (or have) charts for jukebox plays, for radio plays, and various other things. These would be combined into different genre-specific charts first, and those genres would be based on what the radio stations were playing. This means that the country charts would include all the songs played by country stations, the R&B charts all those played by R&B stations, and so on, rather than Billboard deciding themselves what counted as what genre. Then all of these charts would be combined to make the \"Hot 100\", which is sort of a chart of charts.\n\nThis would sometimes lead to anomalous results, when more than one type of station started playing a song, and some songs would end up on the country chart *and* the rhythm and blues chart *and* the pop chart.\n\nPop is here a separate type of music in itself, and in the early 1950s what got played on \"pop\" radio was, essentially, the music that was made by white people in the suburbs *for* white people in the suburbs. In 1954, the year we're talking about, the big hits were \"O Mein Papa\" by Eddie Fisher...\n\n[very short excerpt]\n\n\"Secret Love\" by Doris Day\n\n[very short excerpt]\n\nand records by Perry Como, Rosemary Clooney, Jo Stafford, and Tony Bennett. Polite, white, middle-class music for polite white middle-class people. None of that hillbilly nonsense, and *certainly* nothing by any black people. Some of it, like the Tony Bennett tracks, was pretty good, but much of it was the kind of horrible pap which made rock and roll, when it finally broke on to the pop charts, seem like such a breath of fresh air. And even the Tony Bennett records weren't in any way exciting -- they were good, but they'd relax you after a hard day, not make you want to get up and dance.\n\nWhat's noticeable here is that the pop music charts were dominated by music aimed at adults. There was no music for teenagers or younger adults hitting the pop charts, and no music for dancing. During the height of the swing era, the big bands had of course been making dance music, but now every last bit of black or lower-class influence was being eradicated, in order to appeal to the \"return to normalcy\".\n\nYou see, by the end of the Second World War, America had been through a lot -- so much so that the first call for a \"return to normalcy\" had been from Warren G. Harding in the 1920 election, nearly thirty years earlier. In the previous forty-five years, the country had been involved in two world wars, suffered through the depression and the dustbowl, and simultaneously seen an unprecedented growth in technology which had brought the car, the plane and now the jet, the cinema and then the talkies, the radio and the TV, and now the atomic bomb, into people's lives. People had undergone the greatest disruption in history, and several generations had now grown up with an idea of what was \"normal\" that didn't match their reality at all.\n\nAnd so the white, semi-prosperous, middle and upper-working class in America made a collective decision around 1946 that they were going to reconstruct that normality for themselves, and to try to pretend as much as possible that nothing had really changed. And that meant pretending that all the black people who'd moved to the Northern cities from the south in that time, and all the poor white people from Oklahoma and Texas who'd moved west to avoid the dustbowl, simply didn't exist.\n\nObviously those other people had some ideas of their own about that, and about how they fit into the world. And those people had a little more of a voice now than they'd had previously. The black people living in the cities had enjoyed something of a war boom -- there had been so much work in the factories that many black people had pulled themselves up into something approaching affluence. That was quickly snatched away when the war ended and those jobs were quote needed by the returning heroes unquote, but a small number of them had managed to get themselves into economically secure positions, and a larger number now knew that it was *possible* for them to make money, and were more motivated than ever for social change that would let them return to their previous status.\n\n(This is a recurring pattern in the American economy, incidentally. Every time there's an economic boom, black people are the last to benefit from it and then the first to be damaged in the downturn that follows. White America is like Lucy, putting the football of the American Dream in front of black people and then taking it away again, over and over.)\n\nAnd so the pop chart was for the people who were working in advertising, having three-martini lunches, and driving home to their new suburban picket-fence houses. And the other charts were for everyone else.\n\nAnd this is why it was the music on the other charts that was so interesting. There's an argument that what made rock and roll something new and interesting wasn't any one feature of the genre, but an attitude towards creation. Early rock and roll was very much what we would now think of as \"mash ups\" -- collages or montages of wildly different elements being brought together -- and this is what really distinguishes between the innovative musicians and the copycats. If you were bringing together half a dozen elements from different styles, then you were doing rock and roll. But if you were just copying one other record -- even if that other record was itself a rock and roll record -- and not bringing anything new to it, then you weren't doing rock and roll, you were doing pop. And it was the people at the margins who would do rock and roll. Because they were the ones who weren't sealing themselves off and trying to deny reality.\n\nWe talked a little bit about doo-wop last week, but the songs we talked about there probably wouldn't be called doo-wop by most listeners, though there are clear stylistic similarities. It's probably time for me to explain what doo-wop actually is, musically. It's a style you don't get now, except in conscious pastiches, but it was basically an extension of the Ink Spots' style. You have at least four singers, one of whom is a very prominent bass vocalist who sings nonsense words like \"doo wop\" or \"bom bom ba dom\", another of whom is a high tenor who takes most of the leads, and the rest sing harmonies in the middle.\n\nWhile the jump bands and western swing were both music that dominated on the West Coast -- the early jump bands were often based in New York, but LA was really the base of the music -- doo wop was a music of the North-East. It sometimes got as far west as Detroit, but it was mostly New York, Washington DC, and a bit later New Jersey, that produced doo-wop singers.\n\nAnd it was doo-wop that would really take off as a musical style. While the jump bands remained mildly successful, the early fifties saw them decline in popularity as far as the R&B charts went, because the new vocal groups were becoming the dominant form in R&B -- and this was especially true of the \"bird groups\".\n\nThe first \"bird group\" was the Ravens, and they might be considered the first doo-wop group full stop. They took the Ink Spots' \"top and bottom\" format and extended it, so that on their ballads there'd be more interplay between the high and low vocals. Listening to \"You Foolish Thing\" you can clearly hear the Ink Spots influence:\n\n[excerpt \"you Foolish Thing\"]\n\nOn their uptempo music, on the other hand, they just had the bass singer sing the lead:\n\n[excerpt: the Ravens “Rock Me All Night Long”]\n\nAnd the Ravens became massively influential. They'd found a way to get the catchiest parts of the Ink Spots sound, but without having to stick so closely to the formula. It could work for all kinds of songs, and soon there were a whole host of bands named after birds and singing in the Ravens' style -- the Orioles, the Flamingoes, the Penguins, the Wrens, and many more. We've already heard one of the bands they influenced when we listened to the Robins.\n\nThe other major influential bird group was the Orioles, whose \"It's Too Soon To Know\" is another record that's often considered by some to be \"the first rock and roll record\" -- though to my ears it just sounds like a derivative of the Ink Spots rather than anything new:\n\n[excerpt \"It's Too Soon to Know\" by the Orioles]\n\nSo there's a clear stylistic progression there, but we're not looking at anything radically different from what came before.\n\nThe first real doo-wop record to really have a major impact was \"Gee\", by the Crows, another bird group, which was recorded and released in 1953, but became a hit in 1954, charting a month after \"Sh-Boom\" was recorded, but before Sh-Boom itself became a hit:\n\n[excerpt: \"Gee\", the Crows]\n\n\"Gee\" is doo-wop absolutely fully formed, and it's a record which had a massive influence, particularly on young California teenagers who were growing up listening to Johnny Otis' radio show -- both Frank Zappa and the Beach Boys would later record their own strange takes on the song, emphasising how odd the record actually sounded. It's also widely credited as the first R&B record to become a hit with a large part of its audience being white teenagers. More than any other form of R&B, doo-wop traded in the concerns of the adolescent, and so it was the first subgenre to become accessible to that huge demographic of white kids who wanted something new they could appropriate and call their own.\n\n\"Gee\" is a record that deserves an episode to itself, frankly, in terms of importance, but there's not much to say about it -- the Crows had one hit, never had another, split up soon after, and there's no real biographical information out there about them. The record just stands on its own.\n\nThat's also true for \"Sh-Boom\", and the Chords were another one-hit wonder, but there's a difference there. While \"Gee\" was the first doo-wop record to make money from white people, \"Sh-Boom\" was the first doo-wop record to lose money to white people.\n\n[excerpt: “Sh-Boom”, the Chords]\n\nThe Chords were, at least, not actually a bird group -- they were too individual for that -- but in other respects they're very much in the typical mould of the early doo-wop bands, and \"Sh-Boom\" is, in many ways, an absolutely typical doo-wop song.\n\n\"Sh-Boom\" was not meant to be a hit. It was released on Cat records, a subsidiary of Atlantic Records, but apparently everyone at Atlantic hated the song -- it was only recorded at the Chords' insistence, and it was originally only a B-side until the song started to hit with the DJs.\n\nSh-Boom was arranged by Jesse Stone, but presumably his contribution was the instrumental, rather than the vocal arrangement, as the song was written by the Chords themselves, originally while sitting together in a car. At the time, according to Buddy McCrea of the band, \"When they talked to each other, they'd say 'boom.' They'd say 'Hey, man, boom, how ya doin'.\" Jimmy Keyes, also of the band, said \"'Boom' was the slang word. If you were standing on this block for five minutes, you'd hear that slang word fifteen times or more. We would take the 'boom' and make it sound like a bomb: 'shhhhhh-BOOM'.\"\n\nEven the nonsense words in the background were, according to Keyes, meaningful to the band -- \"'A langala langala lang.' Well, you could hear the church bells over there,\" while other parts were references to someone called \"Bip\", the uncle of band members Carl and Claude Feaster. Bip was homeless, and apparently stank, and when Bip would come to visit, according to Keyes, \"We could smell Bip as soon as he opened the door.\" They would cover their noses and sing \"here comes Bip, a flip a dooba dip.\"\n\nAnd one suspects that this played a big part in the song's success -- while the lyrics are genial gibberish, they're genial gibberish that had meaning to the singers, if not to the audience.\n\nThat wasn't necessarily appreciated by older people though. The great satirist Stan Freberg recorded a rather mean-spirited parody of the song, combining it with a parody of Marlon Brando who was similarly popular at the time and who Freberg thought comparable in unintelligibility:\n\n[excerpt: Stan Freberg \"Sh-Boom\"]\n\nBut there's an element of racism in the popular reaction to the success of \"Sh-Boom\". There was a belief among many people that since they couldn't understand the lyrics, they were hiding some secret code. And any secret code sung by black men must, obviously, have to do with sex. We'll see a lot of this kind of thing as the story goes on, unfortunately.\n\nBut of course, meaningless lyrics have a long, long, history in popular music -- much longer than is usually appreciated. Most people, when they're talking about nonsense lyrics, trace scat singing back as far as Louis Armstrong imitating his own trumpet. But there's a good argument that they go back as far as we have records of songs existing, or almost.\n\nIf you look at traditional folk music you'll often find a common pattern, of people singing \"As I walked out one bright summer's day/sing too ra la loo ra la loo ra la lay\" or similar. That kind of nonsense singing dates back as far as we have records, and no-one knows how it started, but one hypothesis I've seen which makes sense to me is that it comes from Gregorian chant and similar religious forms.\n\nNo, seriously. It makes sense when you think about it. One of the places that people in the Middle Ages were most likely to hear music was in church, and many early motets contained Latin texts -- usually sung by the tenors -- while other people would sing commentary or explanation of the lyrics in the vernacular -- English or French or whatever language.\n\nNow, for a peasant hearing this, what do you hear? You hear some of the people singing words that make sense to you, in your own language, but it's mixed in with this other gibberish that you don't understand. If the people you're listening to are singing something that makes sense and they drop into Latin, they might as well be singing \"Sh-Boom Sh-Boom sha la la la la la la la la la la la\" for all the sense it'll make to you. So you come to the conclusion that that's just how songs *are*. They have bits that make sense and then bits of nonsense that sounds good.\n\nIndeed, one of the bits of lyric of “Sh-Boom” as it's commonly transcribed is \"hey nonny\", which if that's the lyric would tie directly back into that old folk tradition -- that is, sadly, the one bit of nonsense syllabics that the band weren't asked about, and so we can't know if they were thinking of minstrels singing \"hey nonny nonny\", or if it had some other inspiration as personal as Uncle Bip.\n\nBut either way, after “Sh-Boom” doo-wop, and R&B in general, became obsessed with nonsense syllabics. We'll be hearing a lot of examples of this in the next few years, and it became so prevalent that by 1961 Barry Mann was asking this musical question:\n\n[excerpt: “Who Put the Bomp”, Barry Mann]\n\nDoo-wop started as a musical style among black teenagers in East Coast cities, but within a few years it became dominated by Italian-American teenagers from the same areas, and we'll see that progression happen over the next eighty or ninety episodes of this podcast. But we can also see it happening in miniature in the Chords' career.\n\nBecause while they had a big hit with \"Sh-Boom\", they didn't have the biggest hit with it.\n\nIf you vaguely know \"Sh-Boom\", maybe from hearing it in a film soundtrack, you might have been surprised when you heard a snatch of it earlier in this episode. It might have sounded very subtly wrong. It will have sounded *more or less* like the record you know, but... different.\n\nThat's because the record you know isn't \"Sh-Boom\" by the Chords, but \"Sh-Boom\" by the Crew Cuts.\n\nTo explain why, we're first going to have to talk about \"A Little Bird Told Me\":\n\n\"A Little Bird Told Me\" was a song originally recorded by Paula Watson on Supreme Records. Watson, and all the musicians on the record, and the record label's owner, were all black. Watson's record went to number two on the R&B charts and number fourteen on the bestseller charts:\n\n[excerpt \"A Little Bird Told Me\", Paula Watson]\n\nAnd then Decca put out a record -- \"A Little Bird Told Me\", sung by Evelyn Knight:\n\n[excerpt: \"A Little Bird Told Me\", Evelyn Knight]\n\nThat record went to number one on the pop charts. And everyone involved in *that* record -- the singer, the backing band, the record label owners -- was white.\n\nNow, to just show you how ridiculously similar the two are, I'm going to try something -- I'm going to play both records together, simultaneously.\n\n[excerpt: both versions of \"A Little Bird Told Me\" played together]\n\nAs you can imagine, the owners of Supreme Records were more than a little put out by this. This kind of direct copying was *not* the norm in the late 1940s -- as we've talked about before, it was perfectly normal for people to rework songs into their own style, and to do different versions for different markets, but just to make a record sounding as close as possible to someone else's hit record of the song, that was unusual.\n\nSo Supreme Records took Decca to court, and said that Decca's record was copyright infringement. It was a direct copy of their record and should be treated as such.\n\nBefore we go any further, you have to know that there are roughly three different concepts that many people confuse when they're talking about the music industry, all of which are important. There's the song, the recording, and the arrangement.\n\nThe song is, to put it simply, just what the singer sings. It's the words and the melody line, and maybe the chord sequence if the chord sequence is sufficiently original. But basically, if you can sing it to yourself unaccompanied, that bit's the song. And the copyright in that is owned by the songwriter or her publisher.\n\nNow, once a song has been published, either as a record or as sheet music, *anyone* at all can make a recording of it or perform it live. There are certain conditions to that -- you can change the song in minor ways, to put it into your own style, or for example to give the protagonist's love interest a different gender if that's something that concerns you, but you can't make major changes to the song's melody or lyrics without the writer or publisher's permission. You also can't use the song in a film or TV show without jumping through some other hoops, just on a record or live performance. But I could, right now, make and release an album of \"Andrew Hickey Sings the Lennon and McCartney Songbook in the Bath\" and I wouldn't need anyone's permission to do so, so long as I paid Lennon and McCartney's publishers the legal minimum amount for every copy I sold. I need a songwriter's permission to make the *first* record of their song, but anyone can legally make the second.\n\nThe next thing is the recording itself -- the specific recording of a specific performance. These days, that too is under copyright -- I can put out my *own* recording of me singing Beatles songs, but I can't just release a CD of one of the Beatles' albums, at least if I don't want to go to prison. A lot of people get confused by this because we talk, for example, about \"She Loves You\" being \"a Beatles song\" -- in fact, it's a Lennon and McCartney *song* performed on a Beatles *recording*. These days, each individual recording has its own copyright, but at the time we're talking about, in the US, there was no federal legislation giving copyright to sound recordings -- that didn't end up happening, in fact, until the 1970s. Up to that point, the copyright law around sound recordings was based on case law and odd rulings (for example it was ruled that it was illegal to play a record on the radio without permission, not because of copyright, but because of the right to privacy -- playing a record which had only been licensed for individual use to a group was considered like opening someone's mail).\n\nBut still, there was usually at least state-level copyright law around recordings, and so record labels were fairly safe.\n\nBut there's a third aspect, one somewhere between the song and the recording, and that's the arrangement. The arrangement is all the decisions made about how to perform a song -- things like how much of a groove you want it to have, whether you're going to back it with guitar or harpsichord or accordion, whether the backing instruments are going to play countermelodies or riffs or just strum the chords, whether you're going to play it as a slow ballad or an uptempo boogie. All that stuff.\n\nUntil the \"A Little Bird Told Me\" case, everyone had assumed that arrangements were copyrightable. It makes sense that they would be -- you can write them down in sheet music form, they make a massive difference to how the performance sounds, they're often what we remember most, and they require a huge amount of creative effort. By every basic principle of copyright law, arrangements should be copyrightable.\n\nBut the court ruled otherwise, and set a precedent that held until very recently -- until, in fact, a case that only went through its final appeal in December 2018, the \"Blurred Lines\" case, which ruled on whether Robin Thicke's \"Blurred Lines\" plagiarised Marvin Gaye's \"Got To Give It Up\".\n\n[excerpts: “Blurred Lines” and “Got To Give It Up”]\n\nBetween \"A Little Bird Told Me\" and \"Blurred Lines\", copyright law in the US held that you could copyright an actual recording, and you could copyright a song, but you couldn't copyright an arrangement or groove.\n\nAnd this had two major effects on the music industry, both of them hugely detrimental to black people.\n\nThe first was simply that people could steal a groove -- a riff or rhythm or feel -- and make a new record with new lyrics and melody but the same groove, without giving credit. As the genres favoured by black musicians were mostly groove-based, while those favoured by white musicians were mostly melody-based, white musicians were more protected from theft than black musicians were. Bo Diddley, for example, invented the \"Bo Diddley beat\", but didn't receive royalties from Buddy Holly, the Rolling Stones, or George Michael when they used that rhythm.\n\nAnd secondly, it opened the floodgates to white musicians remaking black musicians' hits in the same style as the black musicians. Up to this point, if a white singer had covered a black musician, or vice versa, it would have been with a different feel and a different arrangement.\n\nBut now, all of a sudden, whenever a black musician put out an interesting-sounding record, a white person would put out an identical copy, and the white version would get the radio play and record sales. As the black musicians tended to record for tiny labels while the white ones would be on major labels that wouldn't sign black musicians, the result was that a whole generation of black innovators saw their work stolen from them. And we'll be seeing the results of that play out in a lot of the records we talk about in the future.\n\nBut for most of the records we're going to look at, the one that's stood the test of time will be the original -- very few people nowadays listen to, say, Pat Boone's versions of \"Tutti Frutti\" or \"Ain't That A Shame\", because no-one would do so when the Little Richard or Fats Domino versions are available. But with \"Sh-Boom\", the version that still has most traction is by The Crew Cuts.\n\n[excerpt: “Sh-Boom” – the Crew Cuts]\n\nThe Crew Cuts were a white, Canadian, vocal group, who specialised in rerecording songs originally performed by black groups, in near-identical arrangements, and scoring bigger hits with them than the black people had. In the case of \"Sh-Boom\", sadly, the characterless white copy has dominated in popular culture over the version that actually has some life in it.\n\nThe Chords never had another hit, although \"Sh-Boom\" was successful enough that at one point in 1955 there was even a Sh-Boom shampoo on the market, made by a company owned by the Chords themselves. Lawsuits over the band's name which made them have to be known for a time as the Chordcats contributed to their decline, and while there were several reunions over the years, they never replicated the magic of \"Sh-Boom\".\n\nThe Crew Cuts, on the other hand, had many more hits, successfully leeching off sales of records of black artists like the Penguins, Gene and Eunice, Nappy Brown, and Otis Williams and the Charms, and getting more airplay and sales from identical copies. They even had the gall to say that those artists should be grateful to the Crew Cuts, for giving their songs exposure. We'll be talking about several of those songs in the next few weeks. It seems it's not as hard to follow up your first hit if you don't have to have any ideas yourself, just be white.",
  "itunes:subtitle": "Welcome to episode eighteen of A History of Rock Music in Five Hundred Songs. Today were looking at Sh-Boom by the Chords. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, Ive c",
  "itunes:keywords": "Atlantic Records,bird groups,copyright law,doo wop,Ink Spots,Jesse Stone,lawsuits,plagiarism,racism,The Chords,The Crew Cuts,The Crows,vocal groups,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 18,
  "content:encoded": "Welcome to episode eighteen of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Sh-Boom\" by the Chords. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-18-sh-boom/\">a Mixcloud streaming playlist</a> with full versions of almost all the songs in the episode. In this case, I have missed out one track that's used in the podcast - I use approximately seven seconds of the intro to \"Blurred Lines\" by Robin Thicke, without any of the lyrics, in the podcast. I am not going to share that song anywhere, given its lyrical content.\n\nMy main resources are, as with last week&nbsp; <a href=\"https://amzn.to/2B30b6c\"><em>Honkers & Shouters: The Golden Years of Rhythm and Blues</em> by Arnold Shaw</a>, one of the most important books on early 50s rhythm and blues, <a href=\"https://amzn.to/2RVFgxa\"><em>The Sound of the City</em></a> by Charlie Gillett, and <a href=\"http://www.uncamarvy.com/\">Marv Goldberg's website</a>.\n\nThe Chords' music has never been anthologised on CD that I can find out, but almost any good doo-wop compilation should have \"Sh-Boom\".\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nLet's talk about one-hit wonders for a while. One-hit wonders have an unusual place in the realm of music history, and one which it's never easy to decide whether to envy or to pity. After all, a one-hit wonder has had a hit, which is more than the vast majority of musicians ever do. And depending on how big the hit is and how good it is, that one hit might be enough to keep them going through a whole career. There are musicians to this day who can go out and perform in front of a crowd of a few thousand people, every night, who've come there just to hear that one song they recorded nearly sixty years ago -- and if the musician is good enough they can get that crowd enjoying their other songs as well.\n\nBut there are other musicians who can never capitalise on that one record, and who never get another shot. And for those people, as the song goes, \"a taste of honey's worse than none at all\". What initially looked like it might be a massive career turns into a fluke. Sometimes they take it well and it just becomes a story to tell the grandkids, but other times it messes up everyone's life.\n\nThere are people out there who've spent thirty or forty years of their life chasing a second hit, who will never be truly happy because they expected more from their brief success than it brought them.\n\nThere are a lot of one-hit wonders in the world of rock and roll, and a lot of people who end up unlucky, but few have been as unlucky as the Chords, who wrote and recorded one of the biggest hits of all time, but who through a combination of bad luck in choosing a name, and more than a little racism, never managed to have a follow-up. Amazingly, they seem to have handled it far better than most.\n\n\"Sh-Boom\", the Chords' only hit, was the first rhythm and blues record by a black artist or group to make the top ten in the Billboard pop charts, so I suppose this is as good a time as any to talk about how the Billboard charts work, and how they differ from charts in the UK and some other countries.\n\nWhile the UK's singles charts are based only on record sales (and, these days, streams, but that doesn't really apply to this pre-digital era), the Billboard charts have always been an industry-specific thing rather than aimed at the public, and so they were based on many different metrics. As well as charts for record sales, they had (or have) charts for jukebox plays, for radio plays, and various other things. These would be combined into different genre-specific charts first, and those genres would be based on what the radio stations were playing. This means that the country charts would include all the songs played by country stations, the R&B charts all those played by R&B stations, and so on, rather than Billboard deciding themselves what counted as what genre. Then all of these charts would be combined to make the \"Hot 100\", which is sort of a chart of charts.\n\nThis would sometimes lead to anomalous results, when more than one type of station started playing a song, and some songs would end up on the country chart *and* the rhythm and blues chart *and* the pop chart.\n\nPop is here a separate type of music in itself, and in the early 1950s what got played on \"pop\" radio was, essentially, the music that was made by white people in the suburbs *for* white people in the suburbs. In 1954, the year we're talking about, the big hits were \"O Mein Papa\" by Eddie Fisher...\n\n[very short excerpt]\n\n\"Secret Love\" by Doris Day\n\n[very short excerpt]\n\nand records by Perry Como, Rosemary Clooney, Jo Stafford, and Tony Bennett. Polite, white, middle-class music for polite white middle-class people. None of that hillbilly nonsense, and *certainly* nothing by any black people. Some of it, like the Tony Bennett tracks, was pretty good, but much of it was the kind of horrible pap which made rock and roll, when it finally broke on to the pop charts, seem like such a breath of fresh air. And even the Tony Bennett records weren't in any way exciting -- they were good, but they'd relax you after a hard day, not make you want to get up and dance.\n\nWhat's noticeable here is that the pop music charts were dominated by music aimed at adults. There was no music for teenagers or younger adults hitting the pop charts, and no music for dancing. During the height of the swing era, the big bands had of course been making dance music, but now every last bit of black or lower-class influence was being eradicated, in order to appeal to the \"return to normalcy\".\n\nYou see, by the end of the Second World War, America had been through a lot -- so much so that the first call for a \"return to normalcy\" had been from Warren G. Harding in the 1920 election, nearly thirty years earlier. In the previous forty-five years, the country had been involved in two world wars, suffered through the depression and the dustbowl, and simultaneously seen an unprecedented growth in technology which had brought the car, the plane and now the jet, the cinema and then the talkies, the radio and the TV, and now the atomic bomb, into people's lives. People had undergone the greatest disruption in history, and several generations had now grown up with an idea of what was \"normal\" that didn't match their reality at all.\n\nAnd so the white, semi-prosperous, middle and upper-working class in America made a collective decision around 1946 that they were going to reconstruct that normality for themselves, and to try to pretend as much as possible that nothing had really changed. And that meant pretending that all the black people who'd moved to the Northern cities from the south in that time, and all the poor white people from Oklahoma and Texas who'd moved west to avoid the dustbowl, simply didn't exist.\n\nObviously those other people had some ideas of their own about that, and about how they fit into the world. And those people had a little more of a voice now than they'd had previously. The black people living in the cities had enjoyed something of a war boom -- there had been so much work in the factories that many black people had pulled themselves up into something approaching affluence. That was quickly snatched away when the war ended and those jobs were quote needed by the returning heroes unquote, but a small number of them had managed to get themselves into economically secure positions, and a larger number now knew that it was *possible* for them to make money, and were more motivated than ever for social change that would let them return to their previous status.\n\n(This is a recurring pattern in the American economy, incidentally. Every time there's an economic boom, black people are the last to benefit from it and then the first to be damaged in the downturn that follows. White America is like Lucy, putting the football of the American Dream in front of black people and then taking it away again, over and over.)\n\nAnd so the pop chart was for the people who were working in advertising, having three-martini lunches, and driving home to their new suburban picket-fence houses. And the other charts were for everyone else.\n\nAnd this is why it was the music on the other charts that was so interesting. There's an argument that what made rock and roll something new and interesting wasn't any one feature of the genre, but an attitude towards creation. Early rock and roll was very much what we would now think of as \"mash ups\" -- collages or montages of wildly different elements being brought together -- and this is what really distinguishes between the innovative musicians and the copycats. If you were bringing together half a dozen elements from different styles, then you were doing rock and roll. But if you were just copying one other record -- even if that other record was itself a rock and roll record -- and not bringing anything new to it, then you weren't doing rock and roll, you were doing pop. And it was the people at the margins who would do rock and roll. Because they were the ones who weren't sealing themselves off and trying to deny reality.\n\nWe talked a little bit about doo-wop last week, but the songs we talked about there probably wouldn't be called doo-wop by most listeners, though there are clear stylistic similarities. It's probably time for me to explain what doo-wop actually is, musically. It's a style you don't get now, except in conscious pastiches, but it was basically an extension of the Ink Spots' style. You have at least four singers, one of whom is a very prominent bass vocalist who sings nonsense words like \"doo wop\" or \"bom bom ba dom\", another of whom is a high tenor who takes most of the leads, and the rest sing harmonies in the middle.\n\nWhile the jump bands and western swing were both music that dominated on the West Coast -- the early jump bands were often based in New York, but LA was really the base of the music -- doo wop was a music of the North-East. It sometimes got as far west as Detroit, but it was mostly New York, Washington DC, and a bit later New Jersey, that produced doo-wop singers.\n\nAnd it was doo-wop that would really take off as a musical style. While the jump bands remained mildly successful, the early fifties saw them decline in popularity as far as the R&B charts went, because the new vocal groups were becoming the dominant form in R&B -- and this was especially true of the \"bird groups\".\n\nThe first \"bird group\" was the Ravens, and they might be considered the first doo-wop group full stop. They took the Ink Spots' \"top and bottom\" format and extended it, so that on their ballads there'd be more interplay between the high and low vocals. Listening to \"You Foolish Thing\" you can clearly hear the Ink Spots influence:\n\n[excerpt \"you Foolish Thing\"]\n\nOn their uptempo music, on the other hand, they just had the bass singer sing the lead:\n\n[excerpt: the Ravens “Rock Me All Night Long”]\n\nAnd the Ravens became massively influential. They'd found a way to get the catchiest parts of the Ink Spots sound, but without having to stick so closely to the formula. It could work for all kinds of songs, and soon there were a whole host of bands named after birds and singing in the Ravens' style -- the Orioles, the Flamingoes, the Penguins, the Wrens, and many more. We've already heard one of the bands they influenced when we listened to the Robins.\n\nThe other major influential bird group was the Orioles, whose \"It's Too Soon To Know\" is another record that's often considered by some to be \"the first rock and roll record\" -- though to my ears it just sounds like a derivative of the Ink Spots rather than anything new:\n\n[excerpt \"It's Too Soon to Know\" by the Orioles]\n\nSo there's a clear stylistic progression there, but we're not looking at anything radically different from what came before.\n\nThe first real doo-wop record to really have a major impact was \"Gee\", by the Crows, another bird group, which was recorded and released in 1953, but became a hit in 1954, charting a month after \"Sh-Boom\" was recorded, but before Sh-Boom itself became a hit:\n\n[excerpt: \"Gee\", the Crows]\n\n\"Gee\" is doo-wop absolutely fully formed, and it's a record which had a massive influence, particularly on young California teenagers who were growing up listening to Johnny Otis' radio show -- both Frank Zappa and the Beach Boys would later record their own strange takes on the song, emphasising how odd the record actually sounded. It's also widely credited as the first R&B record to become a hit with a large part of its audience being white teenagers. More than any other form of R&B, doo-wop traded in the concerns of the adolescent, and so it was the first subgenre to become accessible to that huge demographic of white kids who wanted something new they could appropriate and call their own.\n\n\"Gee\" is a record that deserves an episode to itself, frankly, in terms of importance, but there's not much to say about it -- the Crows had one hit, never had another, split up soon after, and there's no real biographical information out there about them. The record just stands on its own.\n\nThat's also true for \"Sh-Boom\", and the Chords were another one-hit wonder, but there's a difference there. While \"Gee\" was the first doo-wop record to make money from white people, \"Sh-Boom\" was the first doo-wop record to lose money to white people.\n\n[excerpt: “Sh-Boom”, the Chords]\n\nThe Chords were, at least, not actually a bird group -- they were too individual for that -- but in other respects they're very much in the typical mould of the early doo-wop bands, and \"Sh-Boom\" is, in many ways, an absolutely typical doo-wop song.\n\n\"Sh-Boom\" was not meant to be a hit. It was released on Cat records, a subsidiary of Atlantic Records, but apparently everyone at Atlantic hated the song -- it was only recorded at the Chords' insistence, and it was originally only a B-side until the song started to hit with the DJs.\n\nSh-Boom was arranged by Jesse Stone, but presumably his contribution was the instrumental, rather than the vocal arrangement, as the song was written by the Chords themselves, originally while sitting together in a car. At the time, according to Buddy McCrea of the band, \"When they talked to each other, they'd say 'boom.' They'd say 'Hey, man, boom, how ya doin'.\" Jimmy Keyes, also of the band, said \"'Boom' was the slang word. If you were standing on this block for five minutes, you'd hear that slang word fifteen times or more. We would take the 'boom' and make it sound like a bomb: 'shhhhhh-BOOM'.\"\n\nEven the nonsense words in the background were, according to Keyes, meaningful to the band -- \"'A langala langala lang.' Well, you could hear the church bells over there,\" while other parts were references to someone called \"Bip\", the uncle of band members Carl and Claude Feaster. Bip was homeless, and apparently stank, and when Bip would come to visit, according to Keyes, \"We could smell Bip as soon as he opened the door.\" They would cover their noses and sing \"here comes Bip, a flip a dooba dip.\"\n\nAnd one suspects that this played a big part in the song's success -- while the lyrics are genial gibberish, they're genial gibberish that had meaning to the singers, if not to the audience.\n\nThat wasn't necessarily appreciated by older people though. The great satirist Stan Freberg recorded a rather mean-spirited parody of the song, combining it with a parody of Marlon Brando who was similarly popular at the time and who Freberg thought comparable in unintelligibility:\n\n[excerpt: Stan Freberg \"Sh-Boom\"]\n\nBut there's an element of racism in the popular reaction to the success of \"Sh-Boom\". There was a belief among many people that since they couldn't understand the lyrics, they were hiding some secret code. And any secret code sung by black men must, obviously, have to do with sex. We'll see a lot of this kind of thing as the story goes on, unfortunately.\n\nBut of course, meaningless lyrics have a long, long, history in popular music -- much longer than is usually appreciated. Most people, when they're talking about nonsense lyrics, trace scat singing back as far as Louis Armstrong imitating his own trumpet. But there's a good argument that they go back as far as we have records of songs existing, or almost.\n\nIf you look at traditional folk music you'll often find a common pattern, of people singing \"As I walked out one bright summer's day/sing too ra la loo ra la loo ra la lay\" or similar. That kind of nonsense singing dates back as far as we have records, and no-one knows how it started, but one hypothesis I've seen which makes sense to me is that it comes from Gregorian chant and similar religious forms.\n\nNo, seriously. It makes sense when you think about it. One of the places that people in the Middle Ages were most likely to hear music was in church, and many early motets contained Latin texts -- usually sung by the tenors -- while other people would sing commentary or explanation of the lyrics in the vernacular -- English or French or whatever language.\n\nNow, for a peasant hearing this, what do you hear? You hear some of the people singing words that make sense to you, in your own language, but it's mixed in with this other gibberish that you don't understand. If the people you're listening to are singing something that makes sense and they drop into Latin, they might as well be singing \"Sh-Boom Sh-Boom sha la la la la la la la la la la la\" for all the sense it'll make to you. So you come to the conclusion that that's just how songs *are*. They have bits that make sense and then bits of nonsense that sounds good.\n\nIndeed, one of the bits of lyric of “Sh-Boom” as it's commonly transcribed is \"hey nonny\", which if that's the lyric would tie directly back into that old folk tradition -- that is, sadly, the one bit of nonsense syllabics that the band weren't asked about, and so we can't know if they were thinking of minstrels singing \"hey nonny nonny\", or if it had some other inspiration as personal as Uncle Bip.\n\nBut either way, after “Sh-Boom” doo-wop, and R&B in general, became obsessed with nonsense syllabics. We'll be hearing a lot of examples of this in the next few years, and it became so prevalent that by 1961 Barry Mann was asking this musical question:\n\n[excerpt: “Who Put the Bomp”, Barry Mann]\n\nDoo-wop started as a musical style among black teenagers in East Coast cities, but within a few years it became dominated by Italian-American teenagers from the same areas, and we'll see that progression happen over the next eighty or ninety episodes of this podcast. But we can also see it happening in miniature in the Chords' career.\n\nBecause while they had a big hit with \"Sh-Boom\", they didn't have the biggest hit with it.\n\nIf you vaguely know \"Sh-Boom\", maybe from hearing it in a film soundtrack, you might have been surprised when you heard a snatch of it earlier in this episode. It might have sounded very subtly wrong. It will have sounded *more or less* like the record you know, but... different.\n\nThat's because the record you know isn't \"Sh-Boom\" by the Chords, but \"Sh-Boom\" by the Crew Cuts.\n\nTo explain why, we're first going to have to talk about \"A Little Bird Told Me\":\n\n\"A Little Bird Told Me\" was a song originally recorded by Paula Watson on Supreme Records. Watson, and all the musicians on the record, and the record label's owner, were all black. Watson's record went to number two on the R&B charts and number fourteen on the bestseller charts:\n\n[excerpt \"A Little Bird Told Me\", Paula Watson]\n\nAnd then Decca put out a record -- \"A Little Bird Told Me\", sung by Evelyn Knight:\n\n[excerpt: \"A Little Bird Told Me\", Evelyn Knight]\n\nThat record went to number one on the pop charts. And everyone involved in *that* record -- the singer, the backing band, the record label owners -- was white.\n\nNow, to just show you how ridiculously similar the two are, I'm going to try something -- I'm going to play both records together, simultaneously.\n\n[excerpt: both versions of \"A Little Bird Told Me\" played together]\n\nAs you can imagine, the owners of Supreme Records were more than a little put out by this. This kind of direct copying was *not* the norm in the late 1940s -- as we've talked about before, it was perfectly normal for people to rework songs into their own style, and to do different versions for different markets, but just to make a record sounding as close as possible to someone else's hit record of the song, that was unusual.\n\nSo Supreme Records took Decca to court, and said that Decca's record was copyright infringement. It was a direct copy of their record and should be treated as such.\n\nBefore we go any further, you have to know that there are roughly three different concepts that many people confuse when they're talking about the music industry, all of which are important. There's the song, the recording, and the arrangement.\n\nThe song is, to put it simply, just what the singer sings. It's the words and the melody line, and maybe the chord sequence if the chord sequence is sufficiently original. But basically, if you can sing it to yourself unaccompanied, that bit's the song. And the copyright in that is owned by the songwriter or her publisher.\n\nNow, once a song has been published, either as a record or as sheet music, *anyone* at all can make a recording of it or perform it live. There are certain conditions to that -- you can change the song in minor ways, to put it into your own style, or for example to give the protagonist's love interest a different gender if that's something that concerns you, but you can't make major changes to the song's melody or lyrics without the writer or publisher's permission. You also can't use the song in a film or TV show without jumping through some other hoops, just on a record or live performance. But I could, right now, make and release an album of \"Andrew Hickey Sings the Lennon and McCartney Songbook in the Bath\" and I wouldn't need anyone's permission to do so, so long as I paid Lennon and McCartney's publishers the legal minimum amount for every copy I sold. I need a songwriter's permission to make the *first* record of their song, but anyone can legally make the second.\n\nThe next thing is the recording itself -- the specific recording of a specific performance. These days, that too is under copyright -- I can put out my *own* recording of me singing Beatles songs, but I can't just release a CD of one of the Beatles' albums, at least if I don't want to go to prison. A lot of people get confused by this because we talk, for example, about \"She Loves You\" being \"a Beatles song\" -- in fact, it's a Lennon and McCartney *song* performed on a Beatles *recording*. These days, each individual recording has its own copyright, but at the time we're talking about, in the US, there was no federal legislation giving copyright to sound recordings -- that didn't end up happening, in fact, until the 1970s. Up to that point, the copyright law around sound recordings was based on case law and odd rulings (for example it was ruled that it was illegal to play a record on the radio without permission, not because of copyright, but because of the right to privacy -- playing a record which had only been licensed for individual use to a group was considered like opening someone's mail).\n\nBut still, there was usually at least state-level copyright law around recordings, and so record labels were fairly safe.\n\nBut there's a third aspect, one somewhere between the song and the recording, and that's the arrangement. The arrangement is all the decisions made about how to perform a song -- things like how much of a groove you want it to have, whether you're going to back it with guitar or harpsichord or accordion, whether the backing instruments are going to play countermelodies or riffs or just strum the chords, whether you're going to play it as a slow ballad or an uptempo boogie. All that stuff.\n\nUntil the \"A Little Bird Told Me\" case, everyone had assumed that arrangements were copyrightable. It makes sense that they would be -- you can write them down in sheet music form, they make a massive difference to how the performance sounds, they're often what we remember most, and they require a huge amount of creative effort. By every basic principle of copyright law, arrangements should be copyrightable.\n\nBut the court ruled otherwise, and set a precedent that held until very recently -- until, in fact, a case that only went through its final appeal in December 2018, the \"Blurred Lines\" case, which ruled on whether Robin Thicke's \"Blurred Lines\" plagiarised Marvin Gaye's \"Got To Give It Up\".\n\n[excerpts: “Blurred Lines” and “Got To Give It Up”]\n\nBetween \"A Little Bird Told Me\" and \"Blurred Lines\", copyright law in the US held that you could copyright an actual recording, and you could copyright a song, but you couldn't copyright an arrangement or groove.\n\nAnd this had two major effects on the music industry, both of them hugely detrimental to black people.\n\nThe first was simply that people could steal a groove -- a riff or rhythm or feel -- and make a new record with new lyrics and melody but the same groove, without giving credit. As the genres favoured by black musicians were mostly groove-based, while those favoured by white musicians were mostly melody-based, white musicians were more protected from theft than black musicians were. Bo Diddley, for example, invented the \"Bo Diddley beat\", but didn't receive royalties from Buddy Holly, the Rolling Stones, or George Michael when they used that rhythm.\n\nAnd secondly, it opened the floodgates to white musicians remaking black musicians' hits in the same style as the black musicians. Up to this point, if a white singer had covered a black musician, or vice versa, it would have been with a different feel and a different arrangement.\n\nBut now, all of a sudden, whenever a black musician put out an interesting-sounding record, a white person would put out an identical copy, and the white version would get the radio play and record sales. As the black musicians tended to record for tiny labels while the white ones would be on major labels that wouldn't sign black musicians, the result was that a whole generation of black innovators saw their work stolen from them. And we'll be seeing the results of that play out in a lot of the records we talk about in the future.\n\nBut for most of the records we're going to look at, the one that's stood the test of time will be the original -- very few people nowadays listen to, say, Pat Boone's versions of \"Tutti Frutti\" or \"Ain't That A Shame\", because no-one would do so when the Little Richard or Fats Domino versions are available. But with \"Sh-Boom\", the version that still has most traction is by The Crew Cuts.\n\n[excerpt: “Sh-Boom” – the Crew Cuts]\n\nThe Crew Cuts were a white, Canadian, vocal group, who specialised in rerecording songs originally performed by black groups, in near-identical arrangements, and scoring bigger hits with them than the black people had. In the case of \"Sh-Boom\", sadly, the characterless white copy has dominated in popular culture over the version that actually has some life in it.\n\nThe Chords never had another hit, although \"Sh-Boom\" was successful enough that at one point in 1955 there was even a Sh-Boom shampoo on the market, made by a company owned by the Chords themselves. Lawsuits over the band's name which made them have to be known for a time as the Chordcats contributed to their decline, and while there were several reunions over the years, they never replicated the magic of \"Sh-Boom\".\n\nThe Crew Cuts, on the other hand, had many more hits, successfully leeching off sales of records of black artists like the Penguins, Gene and Eunice, Nappy Brown, and Otis Williams and the Charms, and getting more airplay and sales from identical copies. They even had the gall to say that those artists should be grateful to the Crew Cuts, for giving their songs exposure. We'll be talking about several of those songs in the next few weeks. It seems it's not as hard to follow up your first hit if you don't have to have any ideas yourself, just be white.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode eighteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Sh-Boom\" by the Chords. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of almost all the songs in the episode. In this case, I have missed out one track that's used in the podcast - I use approximately seven seconds of the intro to \"Blurred Lines\" by Robin Thicke, without any of the lyrics, in the podcast. I am not going to share that song anywhere, given its lyrical content.\n\nMy main resources are, as with last week&nbsp; Honkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, one of the most important books on early 50s rhythm and blues, The Sound of the City by Charlie Gillett, and Marv Goldberg's website.\n\nThe Chords' music has never been anthologised on CD that I can find out, but almost any good doo-wop compilation should have \"Sh-Boom\".\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nLet's talk about one-hit wonders for a while. One-hit wonders have an unusual place in the realm of music history, and one which it's never easy to decide whether to envy or to pity. After all, a one-hit wonder has had a hit, which is more than the vast majority of musicians ever do. And depending on how big the hit is and how good it is, that one hit might be enough to keep them going through a whole career. There are musicians to this day who can go out and perform in front of a crowd of a few thousand people, every night, who've come there just to hear that one song they recorded nearly sixty years ago -- and if the musician is good enough they can get that crowd enjoying their other songs as well.\n\nBut there are other musicians who can never capitalise on that one record, and who never get another shot. And for those people, as the song goes, \"a taste of honey's worse than none at all\". What initially looked like it might be a massive career turns into a fluke. Sometimes they take it well and it just becomes a story to tell the grandkids, but other times it messes up everyone's life.\n\nThere are people out there who've spent thirty or forty years of their life chasing a second hit, who will never be truly happy because they expected more from their brief success than it brought them.\n\nThere are a lot of one-hit wonders in the world of rock and roll, and a lot of people who end up unlucky, but few have been as unlucky as the Chords, who wrote and recorded one of the biggest hits of all time, but who through a combination of bad luck in choosing a name, and more than a little racism, never managed to have a follow-up. Amazingly, they seem to have handled it far better than most.\n\n\"Sh-Boom\", the Chords' only hit, was the first rhythm and blues record by a black artist or group to make the top ten in the Billboard pop charts, so I suppose this is as good a time as any to talk about how the Billboard charts work, and how they differ from charts in the UK and some other countries.\n\nWhile the UK's singles charts are based only on record sales (and, these days, streams, but that doesn't really apply to this pre-digital era), the Billboard charts have always been an industry-specific thing rather than aimed at the public, and so they were based on many different metrics. As well as charts for record sales, they had (or have) charts for jukebox plays, for radio plays, and various other things. These would be combined into different genre-specific charts first, and those genres would be based on what the radio stations were playing. This means that the country charts would include all the songs played by country stations, the R&B charts all those played by R&B stations, and so on, rather than Billboard deciding themselves what counted as what genre. Then all of these charts would be combined to make the \"Hot 100\"",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode eighteen of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Sh-Boom\" by the Chords. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of almost all the songs in the episode. In this case, I have missed out one track that's used in the podcast - I use approximately seven seconds of the intro to \"Blurred Lines\" by Robin Thicke, without any of the lyrics, in the podcast. I am not going to share that song anywhere, given its lyrical content.\n\nMy main resources are, as with last week&nbsp; Honkers & Shouters: The Golden Years of Rhythm and Blues by Arnold Shaw, one of the most important books on early 50s rhythm and blues, The Sound of the City by Charlie Gillett, and Marv Goldberg's website.\n\nThe Chords' music has never been anthologised on CD that I can find out, but almost any good doo-wop compilation shou",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}