{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-1649604217690395350",
  "published": "2022-10-14T09:00:00.003-05:00",
  "updated": "2022-10-14T09:50:08.889-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Nobels and financial crises",
  "content": "<p>&nbsp;(At <a href=\"https://www.nationalreview.com/2022/10/what-this-years-nobel-economists-can-teach-us-about-financial-crises/\" target=\"_blank\">National Review</a>)</p><p>What This Year’s Nobel Economists Can Teach Us about Financial Crises</p><p>This week, economists are celebrating the Nobel Prize given to Ben Bernanke, Doug Diamond and Phil Dybvig for their work on banking.</p><p>Bernanke pointed out that banks matter. In the Great Depression, banks failed, and there was nobody left who knew how to make new loans. The economy contracted, not just for lack of money or for animal spirits of investors, but for lack of credit. Diamond and Dybvig wrote the classic economic model of bank runs, which shows how banks can fail even when they are “illiquid” rather than “insolvent.” The logic works like this: The bank has invested our money in illiquid projects, so if I suspect others are going to run to get their money out, I run to get mine out first before it’s all gone.&nbsp;</p><p>But it is no insult to say that these are not eternal verities. The papers were written about 40 years ago. Each was the launching pad for a vast and important investigation. Indeed, Nobel Prizes largely recognize that sort of lasting influence on subsequent work. But that subsequent investigation opens new possibilities. Newton is no less profound for having been followed by Einstein. Each also sought to understand the world as it was, which is how one should start. But there are other possibilities for how the world might be — and how it might be better.&nbsp;</p><p><span></span></p><a name='more'></a>Economics might seem obvious. George Bailey and Michael Banks understood bank runs, didn’t they? Economic analysis lets us see all the ingredients that a banking crisis needs, and therefore how they might be avoided. Bank failure and bank runs are actually fragile phenomena. A lot has to go wrong. There are lots of ways to fix them [i.e. not just bailouts and deposit insurance].&nbsp;<p></p><p>Bankruptcy does not mean a giant crater where there once was a bank. It means reorganization. Stockholders and creditors lose money, and valuable operations continue under new management. Why, if the Farmers and Mechanics bank of Nowhere Nebraska failed in the Great Depression, did Chase or Citi not swoop in, buy the assets at a discount, and keep employed the people that Bernanke pointed out had unique and detailed knowledge of how to make profitable loans? Because interstate and branch banking was illegal. Banks could not list stock on exchanges, and had to find new capital from local businesspeople, whose businesses were failing. But all that has changed.</p><p>Diamond and Dybvig’s 1983 article, being a beautiful essay in economic theory, is even more stark. As you read the article, you will be struck by the number of assumptions needed to get a bank run going. Each is necessary. If people are lining up to get money out, why does the bank not borrow against its valuable illiquid assets? Before the Fed, clearinghouses were set up just for this purpose. Why does the bank not issue additional equity? Why can’t the bank sell loans, rather than accept half-built houses that it does not know how to finish? Why doesn’t the bank get money to invest by issuing floating-value securities instead of first-come-first-serve deposits? Why not &nbsp;suspend payments? All of these channels and more must be turned off to get a bank run going. Showing clearly just what it takes to get a run going is Diamond and Dybvig’s masterful insight.&nbsp;</p><p>Diamond and Dybvig showed how deposit insurance, the expedient implemented in the 1930s, could stop bank runs. If the government stands behind deposits, there is no need to run, One concludes more generally that government as a lender of last resort, creditor bailouts, and government recapitalization can stop crises, as Bernanke showed personally in 2008.&nbsp;</p><p>But do not conclude that these are the only, or best ways to stop financial crises. [They didn't say that.] Moreover, deposit insurance and bailouts stop a crisis once it is happening. But they lead to too much risk-taking by financial institutions, and by depositors who know they don’t have to worry about the bank’s investments. We need a better system.&nbsp;</p><p>The current patch is to have regulators try to keep banks from taking too many risks. But we have seen that mechanism fail over and over again. Regulators failed to see mortgages build up; they failed to see that Greek debt might not be so hot for banks to hold; they failed to “stress test” a pandemic, leading to a second massive bailout; they failed to see the possibility of an energy price increase. They didn’t even fix money-market funds, bailed out again in 2020, and the simplest to fix. Last week, we saw that U.K. regulators failed to see plain-vanilla leverage in pension funds. We shall soon see who else is exposed to sharp interest-rate rises in ways that the regulators have not foreseen.&nbsp;</p><p>The model — allow lots of run-prone assets, stop runs with deposit insurance and bailouts, stop risk-taking with regulation — has run its course. The next bailout will be so big, it is questionable that our governments can do it without major inflation or sovereign-credit stress.&nbsp;</p><p>It’s time for another idea from the 1930s, and analyzed in the 2000s with the kinds of contemporary tools our Nobelists brought forth: Banks should fund risky investments by issuing equity, now extremely liquid. Run-prone securities like deposits should be backed 100 percent by reserves or short-term Treasury securities. (Details in \"<a href=\"https://www.johnhcochrane.com/research-all/toward-a-run-free-financial-systemnbsp\" target=\"_blank\">Toward a Run-Free Financial System</a>.\")</p><p>It’s a simple model; it requires next to no regulation; and we can end private financial crises forever. (“Private” because sovereign debt is another matter, and another sort of crisis.) Bernanke, Diamond, and Dybvig’s work paved the way for this current insight. We can appreciate their analysis without setting in stone the solutions that they analyzed, which were largely just the ones that had already been settled on by previous political decisions.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 14
}