{
  "title": "&#8220;Graphs do not lead people to infer causation from correlation&#8221;",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/28/graphs-do-not-lead-people-to-infer-causation-from-correlation/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/28/graphs-do-not-lead-people-to-infer-causation-from-correlation/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Fri, 28 Oct 2022 13:04:31 +0000",
  "category": "Statistical graphics",
  "guid": "https://statmodeling.stat.columbia.edu/?p=47282",
  "description": "Madison Fansher, Tyler Adkins, and Priti Shah write: Media articles often communicate the latest scientific findings, and readers must evaluate the evidence and consider its potential implications. Prior work has found that the inclusion of graphs makes messages about scientific &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/28/graphs-do-not-lead-people-to-infer-causation-from-correlation/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Madison Fansher, Tyler Adkins, and Priti Shah <a href=\"https://psycnet.apa.org/record/2022-36700-001\">write</a>:</p>\n<blockquote><p>Media articles often communicate the latest scientific findings, and readers must evaluate the evidence and consider its potential implications. Prior work has found that the inclusion of graphs makes messages about scientific data more persuasive (Tal &#038; Wansink, 2016). One explanation for this finding is that such visualizations evoke the notion of “science”; however, results are mixed. In the current investigation we extend this work by examining whether graphs lead people to erroneously infer causation from correlational data. In two experiments we gave participants realistic online news articles in which they were asked to evaluate the research and apply the work’s findings to a real-life hypothetical scenario. Participants were assigned to read the text of the article alone or with an accompanying line or bar graph. We found no evidence that the presence of graphs affected participants’ evaluations of correlational data as causal. Given that these findings were unexpected, we attempted to directly replicate a well-cited article making the claim that graphs are persuasive (Tal &#038; Wansink, 2016), but we were unsuccessful. Overall, our results suggest that the mere presence of graphs does not necessarily increase the likelihood that one infers incorrect causal claims.</p></blockquote>\n<p>A paper by Wansink didn&#8217;t replicate???  Color me gobsmacked.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/28/graphs-do-not-lead-people-to-infer-causation-from-correlation/feed/",
  "slash:comments": 13
}