{
  "title": "Onetime Colony’s Offspring Produce New UK Leaders",
  "description": "Britain hopes he is the strong ethical and efficient leader it needs",
  "link": "https://www.asiasentinel.com/p/uk-first-non-white-premier-rishi-sunak",
  "guid": "https://www.asiasentinel.com/p/uk-first-non-white-premier-rishi-sunak",
  "pubDate": "Tue, 25 Oct 2022 11:31:02 GMT",
  "enclosure": "",
  "content:encoded": "<h5>By: John Elliott</h5><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg\" width=\"1024\" height=\"682\" data-attrs=\"{\"src\":\"https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg\",\"fullscreen\":null,\"imageSize\":null,\"height\":682,\"width\":1024,\"resizeWidth\":null,\"bytes\":130331,\"alt\":null,\"title\":null,\"type\":\"image/jpeg\",\"href\":null,\"belowTheFold\":false,\"internalRedirect\":null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F35e38e95-fadc-4ebb-b59c-4c56e3265d82_1024x682.jpeg 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>&#8220;Let&#8217;s see what an intelligent, young, multi-cultural, economics-fluent leader can do for us,&#8221; said a source who is in his 40s, when it was clear that Rishi Sunak, 42, would become Britain&#8217;s third prime minister this year, the youngest for decades, and the first non-white occupant of 10 Downing Street.</p><p>Of Indian descent with a Punjabi family that emigrated first to Kenya and then the UK, Sunak is also the first Hindu prime minister &#8211; and the first to have worked for Goldman Sachs and have an MBA.</p><p>The news that he had won was officially announced at 2 pm London time yesterday &#8211; 6.30 pm in India where it added to the celebrations as colored lights were lit and firecrackers noisily let off across the country to mark the big annual festival of Diwali. As happened when Kamala Harris became America&#8217;s vice president, Sunak&#8217;s rise is seen as proof of India&#8217;s growing importance internationally.</p><p>Narendra&nbsp;<a href=\"https://www.ndtv.com/india-news/in-congratulatory-message-to-rishi-sunak-pm-modi-talks-roadmap-2030-3459460\">Modi, India&#8217;s prime minister, tweeted&nbsp;</a>&#8220;Warmest congratulations @RishiSunak!&#8221; and looked forward to strengthening India- UK relations.</p><p>Sunak became party leader last night and this morning he has met formally with King Charles III, who is inviting him to form a government as prime minister. He will then go to 10 Downing Street, one door away from No 11 where he lived as Chancellor of the Exchequer for just over two years till he resigned in July, and will begin to appoint his cabinet.</p><p><strong>Urgent issues</strong></p><p>Sunak has a massive&nbsp;<a href=\"https://www.theguardian.com/politics/2022/oct/23/most-pressing-issues-next-tory-pm-rishi-sunak-penny-mordaunt-boris-johnson-conservative?\">list of urgent issues to tackle&nbsp;</a>and has pledged &#8220;there will be integrity, professionalism and accountability at every level of the government I lead.&#8221;</p><p>Financial and economic problems include a fiscal gap of some &#163;40 billion, an approaching recession and a cost-of-living crisis with inflation of around 10 percent, the highest for 40 years. That stems from Brexit and the Ukraine war&#8217;s rising energy costs, escalated by the right-wing economic agenda of Liz Truss, the outgoing prime minister. The national health service is failing to cope with demand and the public sector is facing shortages and a spate of wage-related strikes led by railway workers that could escalate into a confrontation between the government and trade unions.</p><p>Foreign policy issues include Ukraine where Johnson and Truss (as foreign secretary) led one of the toughest responses to the Russian invasion, plus confrontations with China. Unresolved Brexit problems include legislation challenging trade barriers that threaten stability in Northern Ireland, and there is also the looming question of Scotland&#8217;s independence.</p><p>All recent prime ministers have failed the &#8220;do for us&#8221; test mentioned at the top of this article. Both Boris Johnson and David Cameron in different ways failed because they believed too much in their (Eton-educated) leadership gifts, while Theresa May could not handle the cut and thrust of politics and diplomacy. Truss, who defeated Sunak for the prime minister&#8217;s job last month, thought she could buck the markets and public opinion with right-wing tax and borrowing dreams that Sunak had correctly warned would cause economic chaos.</p><p>Those prime ministers had spent years in politics before entering 10 Downing Street, whereas Sunak only began in 2015 when he became a member of parliament &#8211; though he was quickly spotted as a future prime minister by Cameron and others. He is therefore bringing a fresh approach, but he has much to learn about how to get the government machine to deliver on policies, and he also needs to learn how to project himself and his family.</p><p>As prime minister,&nbsp;<a href=\"https://www.ndtv.com/world-news/rishi-sunak-uk-pm-favourite-no-stranger-to-controversies-here-are-some-3458228\">he has to overcome the negative publicity&nbsp;</a>burden of the wealth and privileges that he has enjoyed for years. He and his fashion designer wife Akshata are worth some &#163;730 million, thanks mostly to the wealth of her father, Narayana Murthy, co-founder of Infosys, one of India&#8217;s three leading IT companies.</p><p>If he had been more adept at politics, Sunak would have in 2015, or soon after, canceled the US green card that he obtained when he worked at Goldman Sachs and as a hedge fund analyst. He would also have canceled&nbsp;<a href=\"https://www.theguardian.com/politics/2022/apr/07/rishi-sunaks-wife-says-its-not-relevant-to-say-where-she-pays-tax-overseas\">his wife&#8217;s UK non-domicile&nbsp;</a>status as an Indian citizen which saved her paying taxes totaling as much as &#163;20m.</p><p><strong>Personal embarrassments</strong></p><p>Both the green card and tax became personal embarrassments earlier this year, as did a &#163;3,500 suit he wore at a leadership meeting along with his &#163;500 Prada shoes on a construction site. He talked on television about how many types of bread his family enjoyed when many voters could not even afford one loaf, and he was building a large swimming pool in the garden of his elegant north Yorkshire country house when the plight of the poor was spreading across the country.</p><p>It looks as if he has learned from those mistakes. But he has critics among MPs and a larger proportion in the party membership, not least because he arguably triggered the mass cabinet resignations that led to Johnson&#8217;s downfall in July when he quit as chancellor of the exchequer.</p><p>His right-wing credentials are also not as firm as some on the right would like, prompting a slanted&nbsp;Daily Telegraph&nbsp;headline last night that&nbsp;<a href=\"https://www.telegraph.co.uk/politics/2022/10/23/rishi-sunak-man-riddled-contradictions-trying-slippery-image/?\">described him rather unfairly</a>&nbsp;as &#8220;A man riddled with contradictions trying to shed his &#8216;slippery&#8217; image.&#8221;</p><p>The article said that &#8220;not everyone knows what he truly stands for&#8221; on issues such as Brexit, which he supported, and the free market, which he moved away from with state intervention and increased corporation tax as a result of the covid pandemic.</p><p>On policy, Sunak is strong on the economy and financial markets because of his professional background and his experience as chancellor under Johnson. He will continue with the abandonment of Truss&#8217;s policies that was started by Jeremy Hunt, who became chancellor a week ago and is expected to stay in the job. Sunak believes in low taxes and has said he would reduce the bottom rate of income tax from 20 percent to 16 percent, but only when prudent without fueling inflation, perhaps in seven years&#8217; time.</p><p>But he has absolutely no experience in foreign policy, international relations, or national security, nor on vast swaths of domestic policy ranging from the national health service and home care, to the police, and transport.</p><p>When he appeared in public debates during his contest with Truss, however, he appeared as a fast-learning and efficient policy manager who was prepared to devise positive answers to problems without resorting to Truss-style popular tax cuts.</p><p>The hope now must be that he has not had to make too many promises to would-be cabinet ministers in order to obtain their support for his candidature &#8211; he eventually received nominations from 185 MPs. That success prompted his main rival Boris Johnson to withdraw two days ago followed by Penny Mordaunt, current leader of the commons, who gave up just before the 2 pm deadline yesterday.</p><p><strong>United cabinet</strong></p><p>Sunak has to balance different needs as he tries to form a united cabinet that has talent in the top jobs as well as representing different wings of the party and rewarding friends and allies who supported his bid to become PM.</p><p>On&nbsp;<a href=\"https://www.telegraph.co.uk/politics/2022/10/24/rishi-sunak-policies-net-zero-taxes-cost-living/\">climate change, Sunak i</a>s likely to follow the trend set by Johnson and a pledge to bring all greenhouse gas emissions to net zero by 2050, a target Truss might have weakened. He has said he would make the UK energy-independent by 2045 with increased power from offshore wind, rooftop solar, and nuclear sources and improved home insulation &#8211; a key detail many politicians forget. It remains to be seen if he lifts the blockage put by Truss on King Charles, a devoted climate change activist, attending the Cop27 summit in Egypt next month.</p><p>He could face problems with the Conservative Party&#8217;s right wing on strikes and law and order. Suella Braverman, who has been a strident home secretary and backed Sunak, would want an uncompromising tough line if she kept her job. Labor unrest however will not be solved with new laws that could escalate unrest and exacerbate economic problems.</p><p>There could also be a clash over a pending India-UK trade deal where Braverman opposed easing access to the UK for Indian students and key workers.&nbsp;<a href=\"https://www.telegraphindia.com/world/rishi-sunak-wants-to-change-united-kingdom-india-relationship-to-make-it-more-two-way/cid/1893979\">Sunak is likely to back easier&nbsp;</a>access because he has said he wants to make it easier for British students to travel and for companies to work together &#8220;because it&#8217;s not just a one-way relationship, it&#8217;s a two-way relationship, and that&#8217;s the type of change I want to bring&#8221;.</p><p>Sunak&#8217;s most pressing problem is to unite the party which is riven by personal rivalries and policy differences. That will not be easy, but it is essential if it is to have any chance of winning the next general election due in 2024. There will be calls from opposition parties for an immediate general election, but Sunak can probably ignore them if he can hold the party together to tackle what he described in his&nbsp;<a href=\"https://www.telegraph.co.uk/politics/2022/10/24/rishi-sunak-speech-new-prime-minister/\">84-second victory statement</a>&nbsp;last night as &#8220;a profound economic challenge.&#8221;</p><p><em><strong>John Elliott</strong> is Asia Sentinel&#8217;s South Asia correspondent. He blogs at <a href=\"http://ridingtheelephant.wordpress.com\">Riding the Elephant</a>.</em></p>"
}