{
  "title": "514: Revisiting Harry Potter Fansites During Summer 2007",
  "link": "https://audioboom.com/posts/7867182",
  "itunes:episode": 514,
  "itunes:title": "Revisiting Harry Potter Fansites During Summer 2007",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5241,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>The Cursed Child will not reopen with other Broadway shows this Fall as it rethinks its length and structure, targeting a 2022 return</li>\n<li>What's at the heart of this decision? We discuss a few ways The Cursed Child could accomplish a cutdown version of the show.</li>\n<li>Main Discussion: Revisiting The Best of <a href=\"http://www.mugglenet.com\">MuggleNet</a> and other Potter Fan Sites, particularly during the biggest year for Harry Potter</li>\n<li>The hosts revisit their roles and how they got their start in the Potter fandom</li>\n<li>The layouts, the countdowns, the breaking news: what were some of our favorite parts of  MuggleNet?</li>\n<li>The Wall of Shame, Editorials, MuggleSpace and more!</li>\n<li>Be sure to check out older versions of MuggleNet using <a href=\"https://web.archive.org/web/20070724184037/http://www.mugglenet.com/aboutus.shtml\">The Wayback Machine</a>!</li>\n<li>What was the rivalry like with other Harry Potter fansites?</li>\n<li>The hosts read their old staff profiles from 2007 - laughter... and cringing ensue!</li>\n<li>Our patrons share their favorite parts and memories of MuggleNet</li>\n<li>Quizzitch: Some of the earliest Harry Potter fan conventions were run by a group called HPEF. What does HPEF stand for? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by MasterClass (Get 15% off an annual subscription at <a href=\"https://www.masterclass.com/mugglecast\">MasterClass.com/mugglecast</a>) and BetterHelp (Get 10% off your first month at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>).</li>\n<li>Next week: We'll be releasing a brand-new movie commentary on Prisoner of Azkaban. The following week we'll be off for the Memorial Day holiday. So, we'll see you on June 7! In the meantime, <a href=\"https://www.mugglecast.com/wall-of-fame/\">check out some of our past episodes</a> on the Wall of Fame!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! This week, on Bonus MuggleCast, the hosts reflect on what the party scene was like at Potter conferences.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 18 May 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-05-17:/posts/7867182",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}