{
  "id": "tag:blogger.com,1999:blog-24784288.post-7301520456350162368",
  "published": "2022-10-19T17:00:00.002-04:00",
  "updated": "2022-10-22T04:54:16.750-04:00",
  "title": "Why I fear the Fed may be overdoing it",
  "content": "<p>I thought I might explain <a href=\"http://gregmankiw.blogspot.com/2022/10/paul-krugman-may-be-right.html\" target=\"_blank\">my fear</a> that the Fed is in the process of tightening too much. Let me begin, however, with two points of agreement with the monetary hawks.</p><p>First, I agree that monetary and fiscal policymakers are partly to blame for the recent inflation surge. In fact, I warned about overheating in <a href=\"https://www.nytimes.com/2021/02/26/business/biden-stimulus-overheat-economy.html\" target=\"_blank\">a February 2021 column</a> in the New York Times.</p><p>Second, I agree that some significant amount of monetary tightening is in order. That is especially true because fiscal policymakers are doing little to help contract aggregate demand. Instead, actions like student loan forgiveness are doing the opposite. The so-called Inflation Reduction Act is a <a href=\"http://gregmankiw.blogspot.com/2022/08/the-inflation-impact-of-inflation.html\">feckless political smokescreen</a>.</p><p>The question is, how much monetary tightening is in order? This question is hard, and anyone who claims to know the answer for sure is not being honest either with you or with themselves. The reason it is hard is that monetary policy works with a <a href=\"http://gregmankiw.blogspot.com/2022/10/monetary-wisdom-from-milton-friedman.html\" target=\"_blank\">substantial lag</a>. It is no surprise that the recent Fed tightening hasn't had much impact on inflation yet. That is no reason to think the Fed needs to tighten a lot more. The Fed made the mistake of waiting for inflation to appear before starting to tighten. It would be a similar mistake to wait for inflation to return to target before stopping the tightening cycle.</p><p>The Taylor rule suggests one way to calibrate the problem. This rule of thumb says that the real interest rate needs to rise by 0.5 percentage points for each percentage point increase in inflation. The yield on the <a href=\"https://fred.stlouisfed.org/series/DFII5\" target=\"_blank\">5-year TIPs</a>, which incorporates recent and near-term expected changes in monetary policy, has risen by 330 basis points over the past year. According to the Taylor rule, that would be appropriate if inflation had risen by 6.6 percentage points. Has it?</p><p>The answer depends on what measure of inflation one looks at. If you look at the CPI, then yes, the inflation surge could justify such a large tightening. But some of that inflation surge was due to temporary supply-side events. (Team Transitory was wrong, but not entirely wrong.)&nbsp;<a href=\"https://www.atlantafed.org/chcs/wage-growth-tracker\" target=\"_blank\">Wage inflation</a>&nbsp;has increased only about 3 percentage points. By this metric, which can be viewed as a gauge of ongoing inflation pressures, a smaller monetary tightening would be appropriate.</p><p>A related issue is whether the normal real interest rate, sometimes called r*, is higher than the Fed previously thought. It might be. But I am inclined to think that there are long-run structural changes that explain the decline in real interest rates, as I explained in a <a href=\"https://scholar.harvard.edu/files/mankiw/files/government_debt_and_capital_accumulation_may2022_updated.pdf\" target=\"_blank\">recent Brookings paper</a>. Those forces are likely to keep r* low in the years to come.</p><p>Another data series that I keep an eye on--though it is out of fashion these days--is the <a href=\"https://fred.stlouisfed.org/series/WM2NS\" target=\"_blank\">money supply</a>. M2 surged before the large increase in inflation. Economists who watch the money supply, like Jeremy Siegel, were among the first to call the inflation surge. Yet over the past year, M2 has grown a mere 3.1 percent.</p><p>Finally, another factor is that the monetary tightening is occurring worldwide. Standard monetary rules like the Taylor rule do not explicitly incorporate the international linkages. But perhaps they should. Some of upcoming contraction of the U.S. economy will be attributable to the policies of foreign central banks. It is hard to say how much.</p><p>So, if I were one of the Fed governors, I would recommend slowly easing their foot off the brake. That means when the next decision comes and they debate an increase of, say, 50 or 75 basis points, choose the smaller number.</p><p>At this point, a recession seems a near certainty due, in part, to the Fed's previous miscalculations that led monetary policy to be too easy for too long. There is nothing to be gained from making the recession deeper than necessary. The second mistake would compound, not cancel, the first one.</p>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Greg Mankiw",
    "uri": "http://www.blogger.com/profile/18161221774770492266",
    "email": "noreply@blogger.com",
    "gd:image": ""
  }
}