{
  "title": "Quite Possibly the Most Flattering E-Mail Ever",
  "link": "https://freakonomics.com/2015/10/quite-possibly-the-most-flattering-e-mail-ever/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Wed, 28 Oct 2015 15:30:05 +0000",
  "category": [
    "Freakonomics Blog",
    "Email"
  ],
  "guid": "http://freakonomics.com/?p=111120",
  "description": "<p>Many people have written many nice things to us over the years. (Of course some people have written some not-so-nice things too.) But the following is my favorite, or at least my new favorite:</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/10/quite-possibly-the-most-flattering-e-mail-ever/\">Quite Possibly the Most Flattering E-Mail Ever</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>Many people have written many nice things to us over the years. (Of course some people have written some not-so-nice things too.) But the following is my favorite, or at least my new favorite:</p>\n<blockquote>\n<p style=\"text-align: left;\"><em>Good afternoon Stephen,</em></p>\n<p><em>I am a psychologist by education and spend my professional life as a consultant in the field of higher education and an executive coach.&nbsp; I spend my personal life as a mother, wife, sister, daughter, and friend.&nbsp; In all these roles I: (1) have many opportunities to improve and (2) try to express my gratitude to those who help me.&nbsp; It is for these two reasons that I send this email.</em></p>\n<p><em>I started listening to your podcasts because I liked your book, Freakonomics, and appreciate the opportunity to learn about things that I don&#8217;t have the time to study myself.&nbsp; For the work that you and your collaborators do researching and telling interesting and informative stories, I am grateful, as I had expected to be.&nbsp; This email, though, is about something else.</em></p>\n<p><em>Because many people are quick to stop listening to anybody who holds a differing perspective, I have been taken by the curious and open-minded way in which you discuss topics with others.&nbsp; Sometimes I am good at this, while other times my mannerisms and my tone give me away — exposing the fact that I&#8217;m not doing a great job of learning about an opposing view.&nbsp; This is a skill that I would like to improve and one that I hope my children (11 and 9-years-old) develop.&nbsp; So, using your podcasts as a model, our family is working on asking questions and constructing responses in a curious and open-minded way.&nbsp; And, we have turned your last name into a verb&#8230;</em></p>\n<p>dubner (verb): to engage in a curious and open-minded conversation​.</p>\n<p><em>It is for this reason that I write to express my unexpected gratitude.​</em></p>\n<p><em>With kind regards and sincere appreciation,</em></p>\n<p><em>Kara E. Penfield, Ph.D.</em><br />\n<em> President, Penfield Consulting Group</em></p></blockquote>\n<p>Thanks, Kara.&nbsp;I am truly flattered! The only problem is that I don&#8217;t feel I really live up to the definition as well as I&#8217;d like —&nbsp;i.e., while I of course try to be as curious and open-minded as possible, I often find, on listening back to interviews, that my priors and biases are stronger than I realized in the moment. So I am constantly looking for ways to dislodge them. Maybe having my name attached to this pursuit will be just the incentive I need!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/10/quite-possibly-the-most-flattering-e-mail-ever/\">Quite Possibly the Most Flattering E-Mail Ever</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}