{
  "title": "Masks and mouth mist: What we know about the coronavirus now",
  "guid": "01EEB9Q2JVSN6HXPQS3FG5A8GX",
  "itunes:author": "American Public Media",
  "description": "<p>Since the world first learned about this new coronavirus at the end of 2019, we’ve been watching science happen in real time. Scientists all over the world are studying this virus and learning how to protect us from it. As they learn new things, we learn new things too.</p>\n<p><br>One thing they’ve learned is how this virus spreads. The primary culprit is droplets from our noses and mouths. That’s why masking up is so important to protect our communities.</p>\n<p><br>We’ve also been hearing from a lot of listeners wanting to know about the future: when will the vaccine be ready? what will it be like at school? when will things go back to normal? We're going to do our best to answer some of these questions in our next coronavirus episode. But they don’t have concrete answers right now.</p>\n<p><br>Right now, trying to look a month, or a year into the future is hard. We call this feeling of not knowing what will happen -- uncertainty. And it’s hard to deal with.</p>\n<p><br>Our brains likes being able to predict what’s going to happen because it makes us feel safe. When we feel unsafe, that’s when anxiety kicks in. </p>\n<p><br>One way to deal with this anxiety is to focus on the present -- what’s happening right now. </p>\n<p></p>\n<p>It’s also important to let yourself feel your feelings and know you’re not alone in them. It’s normal right now to feel frustrated, or angry, or sad, or all of them at the same time. But also try to think about the moments you have that are fun, and the times you feel contentment and happiness.</p>\n<p></p>\n<p>If you’re having trouble staying focused on the present there are some tricks you can try:</p>\n<p></p>\n<ul>\n<li><p>Look around you and make a list in your head of everything you see that is green.</p></li>\n<li><p>Try to think of all the character’s names in your favorite book or tv show</p></li>\n<li><p>Take deep breaths -- inhale for four counts, hold that breath for four, and then exhale for four</p></li>\n<li><p>Distract yourself by going outside, or watching a movie or reading a book. </p></li>\n\n</ul>\n\n<p></p>\n<p>If you’re still having trouble keeping your mind off the “what ifs” it’s great to talk to your parents or another adult you trust.</p>\n<p></p>\n<p>There are always people who want to help you. If you need help and aren’t sure who to talk to, you can call 800 273-8255. It's a free phone call, and people are there all the time, ready to listen and help.</p>\n<p>MORE: <a href=\"https://childmind.org/coping-during-covid-19-resources-for-parents/\">The Child Mind Institute has a lot of resources </a>for families about how to deal with this uncertain time. (https://childmind.org/coping-during-covid-19-resources-for-parents/)</p>\n<p></p>\n<p>This episode is sponsored by KiwiCo (<a href=\"https://www.kiwico.com/mlp/brainson\" class=\"default\">kiwico.com/brainson</a>) and Native  (<a href=\"http://nativedeo.com/brainson\" class=\"default\">nativedeo.com/brainson</a>) - use promo code: BRAINSON at checkout.</p>\n",
  "enclosure": "",
  "pubDate": "Tue, 28 Jul 2020 18:07:23 +0000",
  "itunes:duration": "00:34:47",
  "itunes:explicit": "no"
}