{
  "title": "“Is There a U.S.-China Cold War” Is the Wrong Question",
  "link": "https://www.heritage.org/asia/commentary/there-us-china-cold-war-the-wrong-question",
  "description": "<p>Let’s not call the U.S.-China competition a “cold war.” This ongoing conflict ought to have a name all its own.</p>\n\n<p>Using the term “Cold War” encourages oldthink. It suggests that we’ve been here before and therefore can manage this challenge in the same way we managed—and won—the decadeslong standoff with the Soviet Union.</p>\n\n<p>That is a dangerous idea. Today’s standoff with Beijing is as different as World War II was from World War I. </p>\n\n<p>The Soviet Union was a monstrous military machine and a struggling economic power. China is a massive economic competitor and a rising military challenge. The threats have to be seen differently.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/asia/commentary/americas-dependence-china-crisis-the-making\">America’s Dependence on China Is a Crisis in the Making</a></strong></p>\n\n<p>The U.S. is simply not going to “contain” China. Indeed, Beijing already poses a global threat far beyond the scope of what Moscow ever achieved.</p>\n\n<p>That said, what the two competitions share is that we want to “win without fighting.” Of course, that doesn’t mean that force has no place.</p>\n\n<p>During the Cold War, for instance, Moscow underwrote wars with the U.S. in Korea and Vietnam, as well as global terrorism and insurgencies in Africa and Latin America. </p>\n\n<p>Similarly, China has been happy to greenlight Russia’s invasion of Ukraine. Still, Beijing and Washington don’t want a direct war with each because neither wants to risk the horrific consequences. </p>\n\n<p>In this sense, then, the Cold War comparison is apt. Both sides act like they are in a marathon and their goal is to finish far ahead. In the 1940s, George Kennan labeled this kind of competition as “measures short of war,” meaning a competitive, adversarial relationship that pulls up shy of a shooting war.</p>\n\n<p>Now, I don’t really care what we call this kind of war, as long as we acknowledge that it is a kind of war. And thus far, the Biden administration has not done that. It continues to act as if China is just a foreign-policy problem that can be managed by “competing where we must and cooperating where we can.”</p>\n\n<p>That is a complete misread of what must be done. Washington must understand that we are now in an existential struggle with China. Our interests do not and will not align.</p>\n\n<p>To survive and thrive, the U.S. must conduct and win an economic war against China. Why? Because China is already waging economic warfare against us. The designs of the Chinese Communist Party are serious and dangerous. Beijing’s goal is a world without America. Uncontested, China has the vision and resources to achieve that objective.</p>\n\n<p><strong>>>> <a href=\"https://www.heritage.org/asia/commentary/the-china-challenge-xi-prepares-his-third-term-and-beyond\">The China Challenge: Xi Prepares for His Third Term and Beyond</a></strong></p>\n\n<p>Protecting the U.S. economy from Beijing’s debilitating exploitation and consequent malicious actions requires an offensive-defensive mix. Washington must vouchsafe Americans and their interests from Chinese actions that undermine U.S. competitiveness and prosperity. It must also take active deterrence measures to significantly reduce Beijing’s ability to threaten America and our allies. The U.S. must have a plan that will make economic aggression unaffordable for Beijing, while allowing the American economy to grow and thrive.</p>\n\n<p>To win this kind of war, the U.S. must have a decade or more of unprecedented growth. That means removing needless Washington-imposed restraints on growth, re-establishing American energy dominance (including fossil fuels and nuclear energy), and curbing federal spending and the burgeoning national debt.</p>\n\n<p>It means also strengthening the U.S. military so China is deterred from thinking it could survive—let alone win—a military conflict. Washington has allowed our military to shrink and hollow out to the point that, for the first time ever, the annual “Index of U.S. Military Strength” now rates our hard power as “weak,” compared to mounting global threats. This trend must be reversed.</p>\n\n<p>This is a new kind of war. Neither hot nor cold, but deadly serious. It’s time for Washington to acknowledge the danger and get serious about fighting back and winning. </p>",
  "pubDate": "Fri, 04 Nov 2022 10:14:36 -0400",
  "dc:creator": "James Carafano",
  "guid": "https://www.heritage.org/asia/commentary/there-us-china-cold-war-the-wrong-question"
}