{
  "title": "Industrial Policy, Shortages, and Supply",
  "description": "<p>Heading into the winter, Europe is facing an energy shortage. This is a true shortage, not a <a href=\"https://www.econlib.org/dont-confuse-shortage-and-smurfage/\">Smurfage</a> – it is characterized by artificial restrictions on both <a href=\"https://www.econlib.org/library/Enc/Supply.html\">supply</a> and price. In a <a href=\"https://foreignpolicy.com/2022/09/29/europe-energy-crisis-russia-policies-gas-nuclear-renewable-electricity-prices/\">recent</a> Foreign Policy Magazine article, Brenda Shaffer illustrates many different ways this shortage was created by European policymakers. I want to call attention to a few worthwhile points she makes and, being incurably pedantic, I also have a small nit to pick.</p>\n<p>She points out how European policymakers have an incentive to attribute all their energy problems to Putin and his recent invasion of Ukraine, even though Europe’s energy troubles are far from a new occurrence:</p>\n<div class=\"block-quote-brown\">\n<div class=\"pull-quote-brown\">Russian President Vladimir Putin’s throttling of the gas taps has undoubtedly made things worse, but this will already be the third winter of Europe’s energy crisis. In the winters 2020-2021 and 2021-2022, Europe already experienced significant spikes in the prices of electricity and natural gas, as well as gas shortages that led to increased use of coal and fuel oil. European policymakers either did not take notice or preferred not to change course.</div>\n</div>\n<p>What caused the shortages in the previous years? In short, <a href=\"https://www.econlib.org/library/Enc/IndustrialPolicy.html\">industrial policy</a> and central planning. European policymakers decided they could divine the “correct” mix of energy sources needed to provide energy to an entire continent, and passed laws and regulations attempting to shape the market according to their plan:</p>\n<div class=\"block-quote-brown\">\n<div class=\"pull-quote-brown\">Europe’s crisis has been two decades in the making. Aiming to engineer a fast transition from fossil fuels and nuclear energy to renewable sources, European policymakers forced profound changes in the energy supply. At the same time, they ignored projections for continued demand for oil and natural gas, as well as the need for a reliable baseload fuel source to back up intermittent solar and wind. Many EU member states cut back domestic production of fossil fuels and constrained imports, with the notable exception of gas from Russia.</div>\n</div>\n<p>Shaffer also points out that it’s not as though Russia is the only available option for natural gas. There are many other sources of natural gas available to Europe, but policymakers have blocked or otherwise hobbled imports from these sources, even today:</p>\n<div class=\"block-quote-brown\">\n<div class=\"pull-quote-brown\">Europe’s policy of blocking gas supplies created shortages that started causing price spikes two winters ago. Believing it will soon be able to do without gas, Europe has also blocked long-term contracts for imports, with the result that Europe is starving for gas even though it is surrounded by some the world’s largest gas reserves—not just in Russia, but also in North Africa, Central Asia, and other regions. The EU could have easily ensured access to reliable gas supplies at affordable prices but is now dependent on the costly spot market instead. Even today, while European officials trot the globe for new gas volumes, they are refusing to sign long-term contracts with the courted producers.</div>\n</div>\n<p>Despite all of this, European policymakers continue to push forward in the same mode of central planning that created this mess in the first place:</p>\n<div class=\"block-quote-brown\">\n<div class=\"pull-quote-brown\">European leaders are aware that their energy market designs are not working. National governments are bailing out or outright nationalizing collapsing utilities. Most are now setting electricity and gas prices for customers. Moreover, Europe’s high cost of carbon has not deterred utilities from firing up mothballed coal plants and switching from gas to fuel oil for electricity and heat…Instead of focusing with urgency and laser sharpness on these issues—and reversing mistaken decisions such as various countries’ nuclear phaseouts—European leaders continue to push new projects that are untested and far from commercially viable.</div>\n</div>\n<p>My main nitpick is Shaffer’s use of the term “shortage.” In economics, shortages mean something more precise than a low supply, or high prices. It’s not quite true that a “policy of blocking gas supplies” will by itself create shortages, although it would certainly contribute to price spikes. To truly create shortages, prices would have to be prevented from rising to their market clearing level. And, to her credit, she does mention both the use of price controls and how they have this effect:</p>\n<p>Today, Europe’s proposed caps on gas and electricity prices, along with new levies on energy producers, will further restrict supplies while seeking to protect consumers from the high prices that could induce them to lower the thermostat and turn down the lights.</p>\n<p>Here she points out one of the great virtues of prices. Prices don’t merely convey information about the relative supply and demand of goods; they also provide an incentive to act on that information. I would have liked it if Shaffer made the connection between price caps and shortages more explicit throughout her piece. To an economist, the connection between them may seem so obvious as to go without saying, but when communicating with the public, it&#8217;s important to make that connection as clearly and forcefully as possible. Nonetheless, Shaffer has done well to point out both how European policymakers have engineered this crisis, and how they have every incentive to put the blame entirely on Putin rather than publicly admit their error or reverse course.</p>\n<p>&nbsp;</p>\n<hr />\n<p><em><strong>Kevin Corcoran is a Marine Corps veteran and a consultant in healthcare economics and analytics and holds a Bachelor of Science in Economics from George Mason University.</strong> </em></p>\n(0 COMMENTS)",
  "link": "https://www.econlib.org/industrial-policy-shortages-and-supply/",
  "guid": "https://www.econlib.org/industrial-policy-shortages-and-supply/",
  "category": [
    "Central Planning",
    "Brenda Shaffer",
    "natural gas",
    "Pierre Lemieux",
    "Russian gas",
    "Vladimir Putin"
  ],
  "pubDate": "Fri, 04 Nov 2022 16:43:22 +0000"
}