{
  "id": "https://bibleinoneyear.org/en/youth/297",
  "title": "Day 297: How God Speaks to You",
  "description": "Psalm 119:89–96, Jeremiah 50:18-45, 2 Timothy 3:1–17.  It actually has God’s breath, his Spirit, in it  Through the Bible, God speaks to you",
  "pubDate": "Sun, 24 Oct 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/297/?ignore",
  "itunes:duration": "14:16",
  "guid": "enyouth24102021-297",
  "length": 856.45,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 297: How God Speaks to You",
  "itunes:subtitle": "Psalm 119:89–96, Jeremiah 50:18-45, 2 Timothy 3:1–17.  It actually has God’s breath, his Spirit, in it  Through the Bible, God speaks to you",
  "itunes:summary": "Fyodor was a wild young man. His life revolved around eating, drinking, talking, music, theatre and the company of women. He dreamt of fame. He was caught up in a movement for political and social reform in Russia during the repressive reign of Tsar Nicholas I. He was arrested, tried and condemned to be executed.\nOn a bitterly cold morning, the prisoners were taken out to be shot. The prison guards raised their muskets to their shoulders and took aim. At the last moment, a white flag was raised to announce that the Tsar had commuted their sentence to life imprisonment in Siberia.\nOn his arrival in Siberia on Christmas Eve 1849, at the age of twenty-eight, two women slipped him a New Testament. When the guard turned away momentarily, they suggested he should search the pages thoroughly. He did.\nWhile in prison, Fyodor Dostoyevsky, the great Russian novelist, read the New Testament from cover to cover and learnt much of it by heart. He wrote, ‘I believe that there is no one lovelier, deeper, more sympathetic and more perfect than Jesus. I say to myself with jealous love not only is there no one else like him, but there never could be anyone like him.’ It was through the Bible that he had encountered Jesus Christ.\nThe apostle Paul describes all Scripture as ‘God-breathed’ (2 Timothy 3:16). The Bible is not just inspired in the way that artists, poets, composers and musical performers can be said to be inspired. It actually has God’s breath, his Spirit, in it. Through the Bible, God speaks to you.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 297
}