{
  "title": "ZBT #251: Career Day featuring Mark Hertling",
  "description": "<p>a list of resources on our website: https://getheadstrong.org/covid19/\n\nAdditionally, Headstrong has gone to full tele-health with clinicians in Colorado, so cadets can reach out: https://getheadstrong.org/get-help/\n\nVets4Warriors, which 247 peer support that can link the cadets to other resources: https://www.vets4warriors.com/author/vets4warr/\n\n---- Career Day 1 \n\nROUND 1: Over the weekend President Trump issued an order permitting the Pentagon to bring some veterans & reservists back to active duty to assist with the Coronavirus pandemic and we got the details for ya. \n\nROUND 2: In the first of our career day interview series, we are gonna hear from a pilot who flies the refueling planes. \n\nROUND 3: A Colonel had a meltdown over ice cream so you won’t be finding much of it around Afghanistan chow halls anymore. Looks like those troops are in for a rocky road regarding their dessert section. \n\nROUND 4: Lt General Mark Hertling joins the show to talk about his career, shooting with a chicken wing in a viral CNN clip, how he was injured in tank battle during Desert storm and much much more. \n\nRound 5: Sacre Blu! The last people on earth to know about coronavirus are some french submariners who are deep in the sea and have zero idea about what is happening up here on dry land. \n\nROUND 6: Kate has another game for us and this time it’s all about acronyms. Let’s hope it’s not SNAFU!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "eb96f87c-ba81-4399-a771-ad6ada9db029",
  "pubDate": "Tue, 31 Mar 2020 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:45:49",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}