{
  "title": "S13 Ep135: Theater of the Mind",
  "link": "https://audioboom.com/posts/8098640",
  "itunes:episode": 135,
  "itunes:title": "Theater of the Mind",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6735,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "You Asked for IT, YOU got it! A Very Special episode of BEYOND the DARKNESS <br>\nStill trying to get through your food coma? Dave & Tim deliver up a heaping helping of pure entertainment value today with a Theater of the Mind cornucopia of creepy fun!<br>\n<br>\nListeners have been asking for an easier way to hear our Theater of the Mind segments so as a way of showing Thanks for all of you, here are some of the most popular and most requested episodes over the past 2 years.<br>\nSit back, relax, turn down the lights and turn up the show and enjoy these frightening, fun and fascinating real tales from listeners.<br>\n<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nPLUTO TV is the leading FREE  streaming television service. NO Credit Card or Sign Up needed! Just visit <a href=\"http://www.PLUTOTV.com\">www.PLUTOTV.com</a> and stream on your devices FREE<br>\n<br>\nRobinhood is giving listeners of BEYOND the DARKNESS a FREE stock like Apple, Ford or Sprint to begin your potfolio!<br>\nGet the Commission Free Trading & Investing Ap Robinhood and make investing easy and fun again.<br>\nVisit <a href=\"http://Darkness.Robinhood.com\">Darkness.Robinhood.com</a> to get started!",
  "itunes:summary": "You Asked for IT, YOU got it! A Very Special episode of BEYOND the DARKNESS \nStill trying to get through your food coma? Dave & Tim deliver up a heaping helping of pure entertainment value today with a Theater of the Mind cornucopia...",
  "pubDate": "Sun, 25 Nov 2018 10:00:00 +0000",
  "guid": "326dc378-271d-4cbf-8bcb-645136ad61de",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}