{
  "title": "S14 Ep103: Memoirs of a Future Ghost",
  "link": "https://audioboom.com/posts/8098527",
  "itunes:episode": 103,
  "itunes:title": "Memoirs of a Future Ghost",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3932,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS dips into Memoirs of a Future Ghost with guest Heather Scarbro Dobson.<br>\n<br>\nDave & Tim are joined by Heather Scarbro Dobson and together they probe her fears while seeking out the paranormal, sharing the true, often freaky and/or funny, sometimes sad tales of over a decade investigating ghosts and the people haunted by them.<br>\n<br>\nGet the book here: <a href=\"https://amazon.com\">https://amazon.com</a><br>\n<br>\nFor more cool gift items, books & more visit: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !",
  "itunes:summary": "BEYOND the DARKNESS dips into Memoirs of a Future Ghost with guest Heather Scarbro Dobson.\n\nDave & Tim are joined by Heather Scarbro Dobson and together they probe her fears while seeking out the paranormal, sharing the true, often...",
  "pubDate": "Sun, 15 Dec 2019 10:00:00 +0000",
  "guid": "e0402d9c-3187-453f-a110-7c4efb0d39cb",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}