{
  "title": "Open-Vocabulary Argument Role Prediction for Event Extraction. (arXiv:2211.01577v1 [cs.CL])",
  "link": "http://arxiv.org/abs/2211.01577",
  "description": "<p>The argument role in event extraction refers to the relation between an event\nand an argument participating in it. Despite the great progress in event\nextraction, existing studies still depend on roles pre-defined by domain\nexperts. These studies expose obvious weakness when extending to emerging event\ntypes or new domains without available roles. Therefore, more attention and\neffort needs to be devoted to automatically customizing argument roles. In this\npaper, we define this essential but under-explored task: open-vocabulary\nargument role prediction. The goal of this task is to infer a set of argument\nroles for a given event type. We propose a novel unsupervised framework,\nRolePred for this task. Specifically, we formulate the role prediction problem\nas an in-filling task and construct prompts for a pre-trained language model to\ngenerate candidate roles. By extracting and analyzing the candidate arguments,\nthe event-specific roles are further merged and selected. To standardize the\nresearch of this task, we collect a new event extraction dataset from\nWikiPpedia including 142 customized argument roles with rich semantics. On this\ndataset, RolePred outperforms the existing methods by a large margin. Source\ncode and dataset are available on our GitHub repository:\nhttps://github.com/yzjiao/RolePred\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Jiao_Y/0/1/0/all/0/1\">Yizhu Jiao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_S/0/1/0/all/0/1\">Sha Li</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xie_Y/0/1/0/all/0/1\">Yiqing Xie</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhong_M/0/1/0/all/0/1\">Ming Zhong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ji_H/0/1/0/all/0/1\">Heng Ji</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Han_J/0/1/0/all/0/1\">Jiawei Han</a>"
}