{
  "guid": "331ab0de-2121-4505-b106-8e136cb43a22",
  "title": "Beyond the Bubble",
  "description": "<p>Five months after the high-stakes local election in Southlake, the city is gearing up for yet another contentious vote. One of the school board members who supported the diversity plan, retired Air Force Col. Dave Almand, is stepping down, and the battle over diversity programs is at the center of the fight to replace him. But he’s far from the only leader to leave a role in public schools this year following attacks from parents opposed to what they see as the quiet creep critical race theory. For this special bonus episode, we sit down with a panel of four educators from across the country who’ve come under fire, including James Whitfield, the first Black principal at a high school a town over from Southlake, whose school board has begun a formal process that could lead to his termination. The educators discuss how the anti-CRT movement is driving them out of their careers—and away from their students.</p>\n",
  "pubDate": "Mon, 4 Oct 2021 08:00:00 +0000",
  "author": "news.podcasts@nbcuni.com (Brittany Hogan, Matthew Hawn, Antonia Hylton, David Almand, James Whitfield, Mike Hixenbaugh, Terry Harris)",
  "link": "https://www.nbcnews.com/southlake-podcast",
  "content:encoded": "<p>Five months after the high-stakes local election in Southlake, the city is gearing up for yet another contentious vote. One of the school board members who supported the diversity plan, retired Air Force Col. Dave Almand, is stepping down, and the battle over diversity programs is at the center of the fight to replace him. But he’s far from the only leader to leave a role in public schools this year following attacks from parents opposed to what they see as the quiet creep critical race theory. For this special bonus episode, we sit down with a panel of four educators from across the country who’ve come under fire, including James Whitfield, the first Black principal at a high school a town over from Southlake, whose school board has begun a formal process that could lead to his termination. The educators discuss how the anti-CRT movement is driving them out of their careers—and away from their students.</p>\n",
  "enclosure": "",
  "itunes:title": "Beyond the Bubble",
  "itunes:author": "Brittany Hogan, Matthew Hawn, Antonia Hylton, David Almand, James Whitfield, Mike Hixenbaugh, Terry Harris",
  "itunes:duration": "00:36:57",
  "itunes:summary": "Four educators -- and one former school board member -- on how the anti-CRT movement is separating them from their careers and their students.",
  "itunes:subtitle": "Four educators -- and one former school board member -- on how the anti-CRT movement is separating them from their careers and their students.",
  "itunes:keywords": "councilman, education, high school, carroll, racist, council, attack, educator, southlake, blm, principal, texas gop, diversity training, termination, football, racism, left-wing ideology, administrator, crt, public school, gop, carroll senior high school, student, south, antiracist, diversity and inclusion training, nbc, fort worth, segregation, donations, school district, lake, allen west, suspension, nbc news, conservative, political action committee, critical race theory, pac, texas, dallas, resignation, school board, reverse racism, inclusion, suburb, cisd, marine, classroom, culture war, teacher, teacher, cancel culture, diversity plan, carroll high school, school board member, dana loesch, politics, learning, high school football, healing, dei, anti-racist, race, black lives matter, trump",
  "itunes:explicit": "no",
  "itunes:episodeType": "bonus",
  "itunes:season": 1
}