{
  "id": "https://bibleinoneyear.org/en/youth/311",
  "title": "Day 311: The Answer to Loneliness",
  "description": "Psalm 120:1-7, Ezekiel 13: 1-21,14:6-11, Hebrews 8:1-13.  Loneliness has been described as ‘a homesickness for God’  God created you for community – calling you into a loving relationship with him and with other human beings",
  "pubDate": "Sun, 07 Nov 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/311/?ignore",
  "itunes:duration": "13:58",
  "guid": "enyouth07112021-311",
  "length": 838.37,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 311: The Answer to Loneliness",
  "itunes:subtitle": "Psalm 120:1-7, Ezekiel 13: 1-21,14:6-11, Hebrews 8:1-13.  Loneliness has been described as ‘a homesickness for God’  God created you for community – calling you into a loving relationship with him and with other human beings",
  "itunes:summary": "I remember reading an article in The Big Issue (the magazine sold by, and in aid of, the homeless) called ‘Single Lives’. It pointed out that most people’s image of loneliness in London is of a frail old lady stuck on the twenty-fourth floor of a block of flats. In reality, it could equally be a young, fashionably dressed guy trying desperately to make conversation with a girl standing next to him in a crowded bar. Being surrounded by so many people only compounds the feeling of isolation.\nMother Teresa said, ‘Loneliness and the feeling of being uncared for and unwanted are the greatest poverty.’ Loneliness is one of the greatest problems facing humanity today.\n‘The solitary human being is a contradiction in terms,’ writes Desmond Tutu. He continues, ‘We are made for complementarity. We are created for a delicate network of relationships, of interdependence with our fellow human beings... We belong in one family – God’s family, the human family... the greatest good is communal harmony.’\nGod does not intend for you to be lonely and isolated. Loneliness has been described as ‘a homesickness for God’. God created you for community – calling you into a loving relationship with him and with other human beings.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 311
}