{
  "title": "Episode 39: &#8220;Please Please Please&#8221; by James Brown and the Famous Flames",
  "link": "https://500songs.com/podcast/episode-39-please-please-please-by-james-brown-and-the-famous-flames/",
  "pubDate": "Mon, 01 Jul 2019 04:25:44 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-39-please-please-please-by-james-brown-and-the-famous-flames/",
  "description": "Episode thirty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Please Please Please\" by James Brown, and at the early rock and roll career of the Godfather of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28037573\">on \"Come Go With Me\" by the Del Vikings.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-39-please-please-please/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI relied mostly on two books for this episode. <a href=\"https://amzn.to/2YqB2ga\">James Brown: The Godfather of Soul</a>, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\n<a href=\"https://amzn.to/2Jm29D4\">Kill 'Em and Leave: Searching for the Real James Brown</a>, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\nAnd <a href=\"https://amzn.to/2FJJpvX\">this two-CD compilation</a> has all Brown's singles from 1956 through 61.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\nJust as the other week we talked about a country musician who had a massive impact on rock and roll, one who was originally marketed as a rock and roller, so today we're going to talk about a funk and soul musician who got his first hits playing to the rock and roll audience.\n\nThere is a type of musician we will come across a lot as our story progresses. He is almost always a man, and he is usually regarded as a musical genius. He will be focused only on two things -- his music and his money -- and will have basically no friends, except maybe one from his childhood. He has employees, not friends. And he only hires the best -- his employees do staggering work while being treated appallingly by him, and he takes all the credit while they do most of the work. Yet at the same time, the work those employees do ends up sounding like that genius, and when they go on to do their own stuff without him, it never sounds quite as good. That one percent he's adding does make the difference. He's never really liked as a person by his employees, but he's grudgingly respected, and he's loved by his audience.\n\nThere are people like that in every creative field -- one thinks of Stan Lee in comics, or Walt Disney in film -- but there are a *lot* of them in music, and they are responsible for an outsized portion of the most influential music ever made. And James Brown is almost the archetypal example of this kind of musician.\n\nJames Brown had a hard, hard childhood. His mother left his father when James was four -- stories say that Brown's father pulled a gun on her, so her wanting to get away seems entirely reasonable, but she left her son with him, and James felt abandoned and betrayed for much of his life. A few years later his father realised that he didn't have the ability to look after a child by himself, and dumped James on a relative he always called an aunt, though she was some form of cousin, to raise. His aunt ran a brothel, and it's safe to say that that was not the best possible environment in which to raise a young child. He later said that he was in his teens before he had any underwear that was bought from a shop rather than made out of old sacks. In later life, when other people would talk about having come from broken homes and having been abandoned by their fathers, he would say \"How do you think I feel? My father *and my mother* left me!\"\n\nBut he had ambition. Young James had entered -- and won -- talent shows from a very young age -- his first one was in 1944, when he was eleven, and he performed \"So Long\", the song that would a few years later become Ruth Brown's first big hit, but was then best known in a version by the Charioteers:\n\n[Excerpt: The Charioteers, \"So Long\"]\n\nHe loved music, especially jazz and gospel, and he was eager to learn anything he could about it. The one form of music he could never get into was the blues -- his father played a little blues, but it wasn't young James' musical interest at all -- but even there, when Tampa Red started dating one of the sex workers who worked at his aunt's house, young James Brown learned what he could from the blues legend.\n\nHe learned to sing from the holiness churches, and his music would always have a gospel flavour to it. But the music he liked more than anything was that style of jazz and swing music that was blending into what was becoming R&B. He loved Count Basie, and used to try to teach himself to play \"One O'Clock Jump\", Count Basie's biggest hit, on the piano:\n\n[Excerpt: Count Basie, \"One O'Clock Jump\"]\n\nThat style of music wouldn't show up in his earlier records, which were mostly fairly standard vocal group R&B, but if you listen to his much later funk recordings, they owe a *lot* to Basie and Lionel Hampton. The music that Brown became most famous for is the logical conclusion to the style that those musicians developed -- though we'll talk more about the invention of funk, and how funk is a form of jazz, in a future episode.\nBut his real favourite, the one he tried to emulate more than any other, was Louis Jordan. Brown didn't get to see Jordan live as a child, but he would listen to his records on the radio and see him in film shorts, and he decided that more than anything else he wanted to be like Jordan. As soon as he started performing with small groups around town, he started singing Jordan's songs, especially \"Caldonia\", which years later he would record as a tribute to his idol:\n\n[Excerpt: James Brown, \"Caldonia\"]\n\nBut as you might imagine, life for young James Brown wasn't the easiest, and he eventually fell into robbery. This started when he was disciplined at school for not being dressed appropriately -- so he went out and stole himself some better clothes. He started to do the same for his friends, and then moved on to more serious types of theft, including cars, and he ended up getting caught breaking into one.\n\nAt the age of sixteen, Brown was sent to a juvenile detention centre, on a sentence of eight to sixteen years, and this inadvertently led to the biggest piece of luck in his life, when he met the man who would be his mentor and principal creative partner for the next twenty years. There was a baseball game between inmates of the detention centre and a team of outsiders, one of whom was named Bobby Byrd, and Byrd got talking to Brown and discovered that he could sing. In fact Brown had put together a little band in the detention centre, using improvised instruments, and would often play the piano in the gym. He'd got enough of a reputation for being able to play that he'd acquired the nickname \"Music Box\" -- and Byrd had heard about him even outside the prison.\n\nAt the time, Byrd was leading a gospel vocal group, and needed a new singer, and he was impressed enough with Brown that he put in a word for him at a parole hearing and helped him get released early. James Brown was going to devote his life to singing for the Lord, and he wasn't going to sin any more.\nHe got out of the detention centre after serving only three years of his sentence, though you can imagine that to a teen there was not much \"only\" about spending three years of your life locked up, especially in Georgia in the 1940s, a time and place when the white guards were free to be racially abusive to an even greater extent than they are today. And for the next ten years, throughout his early musical career, Brown would be on parole and in danger of being recalled to prison at any time.\n\nBrown ended up joining Byrd's *sister's* gospel group, at least for a while, before moving over to Byrd's own group, which had originally been a gospel group called the Gospel Starlighters, but by now was an R&B group called the Avons. They soon renamed themselves again, to the Flames, and later to the *Famous* Flames, the name they would stick with from then on (and a name which would cause a lot of confusion, as we've already talked about the Hollywood Flames, who featured a different Bobby Byrd). Brown's friend Johnny Terry, who he had performed with in the detention centre, also joined the group. There would be many lineups of the Famous Flames, but Brown, Byrd, and Terry would be the nucleus of most of them.\n\nBrown was massively influenced by Little Richard, to the extent that he was essentially a Little Richard tribute act early on. Brown felt an immediate kinship with Richard's music because both of them were from Georgia, both were massively influenced by Louis Jordan, and both were inspired by church music. Brown would later go off in his own direction, of course, but in those early years he sounded more like Little Richard than like anyone else.\n\nIn fact, around this time, Little Richard's career was doing so well that he could suddenly be booked into much bigger halls than he had been playing. He still had a few months' worth of contracts in those old halls, though, and so his agent had a brainwave. No-one knew what Richard looked like, so the agent got Brown and the Flames to pretend to be Little Richard and the Upsetters and tour playing the gigs that Richard had been booked into. Every night Brown would go out on stage to the introduction, \"Please welcome the hardest working man in showbusiness today, Little Richard!\", and when he finished ghosting for Little Richard, he liked the introduction enough that he would keep it for himself, changing it only to his own name rather than Richard's.\nBrown would perform a mixture of Richard's material, his own originals, and the R&B songs that the Flames had been performing around Georgia. They'd already been cutting some records for tiny labels, at least according to Brown's autobiography, mostly cover versions of R&B hits. I haven't been able to track down any of these, but one that Brown mentions in his autobiography is \"So Long\", which he later rerecorded in 1961, and that version might give you some idea of what Brown sounded like at the period when he was trying to be Little Richard:\n\n[Excerpt: James Brown, \"So Long\"]\n\nBrown's imitation of Richard went down well enough that Richard's agent, Clint Brantley, decided to get the group to record a demo of themselves doing their own material.\n\nThey chose to do a song called \"Please, Please, Please\", written by Brown and Johnny Terry. The song was based on something that Little Richard had scribbled on a napkin, which Brown decided would make a good title for a song. The song fits neatly into a particular genre of R&B ballad, typified by for example, Richard's \"Directly From My Heart to You\":\n\n[Excerpt: Little Richard, \"Directly From My Heart to You\"]\n\nThough both \"Directly From My Heart\" and \"Please Please Please\" owe more than a little to \"Shake A Hand\" by Faye Adams, the song that inspired almost all slow-burn blues ballads in this period:\n\n[Excerpt: Faye Adams, \"Shake a Hand\"]\n\nHowever, the real key to the song came when Brown heard the Orioles' version of Big Joe Williams' \"Baby Please Don't Go\", and used their backing vocal arrangement:\n\n[Excerpt: The Orioles, \"Baby Please Don't Go\"]\n\nThe Famous Flames were patterning themselves more and more on two groups -- Billy Ward and the Dominoes, whose records with Clyde McPhatter as lead singer had paved the way for vocal group R&B as a genre, and Hank Ballard and the Midnighters, whose \"Work With Me Annie\" had had, for the time, a blatant sexuality that was unusual in successful records. They were going for energy, and for pure expression of visceral emotion, rather than the smooth sophisticated sounds of the Platters or Penguins.\n\nThey were signed to Federal Records, a subsidiary of King, by Ralph Bass, the visionary A&R man we've dealt with in many other episodes. Bass was absolutely convinced that \"Please Please Please\" would be a hit, and championed the Flames in the face of opposition from his boss, Syd Nathan. Nathan thought that the song just consisted of Brown screaming one word over and over again, and that there was no way on earth that it could be a hit. In Brown's autobiography (not the most reliable of sources) he even claims that Bass was sacked for putting out the record against Nathan's will, but then rehired when the record became a hit. I'm not sure if that's literally true, but it's a story that shows the emotional truth of the period -- Bass was the only person at the record company with any faith in the Famous Flames.\n\nBut the song became hugely popular. The emotion in Brown's singing was particularly effective on a particular type of woman, who would feel intensely sorry for Brown, and who would want to make that poor man feel better. Some woman had obviously hurt him terribly, and he needed the right woman to fix his hurt. It was a powerful, heartbreaking, song, and an even more powerful performance:\n\n[Excerpt: James Brown and the Famous Flames, \"Please Please Please\"]\n\nThe song would eventually become one of the staples in the group's live repertoire, and they would develop an elaborate routine about it. Brown would drop to his knees, sobbing, and the other band members would drape him in a cape -- something that was inspired by a caped wrestler, Gorgeous George -- and try to lead him off stage, concerned for him. Brown would pull away from them, feigning distress, and try to continue singing the song while his bandmates tried to get him off the stage.\n\nSometimes it would go even further -- Brown talks in his autobiography about one show, supporting Little Richard, where he climbed into the rafters of the ceiling, hung from the ceiling while singing, and dropped into the waiting arms of the band members at the climax of the show.\n\nBut there was trouble in store. The record reached number six on the R&B chart and supposedly sold between one and three million copies, though record companies routinely inflated sales by orders of magnitude at this point. But it was credited to James Brown and the Famous Flames, not just to the Famous Flames as a group. When they started to be billed that way on stage shows, too, the rest of the band decided that enough was enough, and quit en masse.\n\nBobby Byrd and Johnny Terry would rejoin fairly shortly afterwards, and both would stay with Brown for many more years, but the rest of the group never came back, and Brown had to put together a new set of Famous Flames, starting out almost from scratch. He had that one hit, which was enough to get his new group gigs, but everything after that flopped, for three long years.\n\nRecords like \"Chonnie On Chon\" tried to jump on various bandwagons -- you can hear that there was still a belief among R&B singers that if they namechecked \"Annie\" from \"Work With Me Annie\" by the Midnighters, they would have a hit -- but despite him singing about having a rock and roll party, the record tanked:\n\n[Excerpt: James Brown, \"Chonnie On Chon\"]\n\nBrown and his new group of Flames had to build up an audience more or less from nothing. And it's at this point -- when Brown was the undisputed leader of the band -- that he started his tactic of insisting on absolute discipline in his bands. Brown took on the title \"the hardest working man in showbusiness\", but his band members had to work equally hard, if not harder. Any band member whose shoes weren't shined, or who missed a dance step, or hit a wrong note on stage, would be fined. Brown took to issuing these fines on stage -- he'd point at a band member and then flash five fingers in time to the music. Each time he made his hand flash, that was another five dollar fine for that musician. Audiences would assume it was part of the dance routine, but the musician would know that he was losing that money.\n\nBut while Brown's perfectionism verged on the tyrannical (and indeed sometimes surpassed the tyrannical), it had results.\n\nBrown knew, from a very early age, that he would have to make his success on pure hard work and determination. He didn't have an especially good voice (though he would always defend himself as a singer -- when someone said to him \"all you do is grunt\", he'd respond, \"Yes, but I grunt *in tune*”). And he wasn't the physical type that was in fashion with black audiences at the time. While I am *absolutely* not the person to talk about colourism in the black community, there is a general consensus that in that time and place, black people were more likely to admire a black man if he was light-skinned, had features that didn't fit the stereotype of black people, and was tall and thin. Brown was *very* dark, had extremely African features, and was short and stocky.\n\nSo he and his group just had to work harder than everyone else. They spent three years putting out unsuccessful singles and touring the chitlin' circuit. We've mentioned the chitlin' circuit in passing before, but now is probably the time to explain this in more detail.\n\nThe chitlin' circuit was an informal network of clubs and theatres that stretched across the USA, catering almost exclusively to black audiences. Any black act -- with the exception of a handful of acts who were aiming at white audiences, like Harry Belafonte or Nat \"King\" Cole -- would play the chitlin' circuit, and those audiences would be hard to impress. As with poor audiences everywhere, the audiences wanted value for their entertainment dollar, and were not prepared to tolerate anything less than the best.\n\nThe worst of these audiences was at the amateur nights at the Apollo Theatre in Harlem. The audiences there would come prepared with baskets full of rotten fruit and eggs to throw at the stage. But all of the audiences would be quick to show their disapproval.\n\nBut at the same time, that kind of audience will also, if you give them anything *more* than their money's worth, be loyal to you forever. And Brown made sure that the Famous Flames would inspire that kind of loyalty, by making sure they worked harder than any other group on the circuit. And after three years of work, he finally had a second hit.\n\nThe new song was inspired by \"For Your Precious Love\" by Jerry Butler, another slow-burn ballad, though this time more obviously in the soul genre:\n\n[Excerpt: Jerry Butler, \"For Your Precious Love\"]\n\nAs Brown told the story, he wrote his new song and took it to Syd Nathan at Federal, who said that he wasn't going to waste his money putting out anything like that, and that in fact he was dropping Brown from the label. Brown was so convinced it was a hit that he recorded a demo with his own money, and took it directly to the radio stations, where it quickly became the most requested song on the stations that played it.\n\nAccording to Brown, Nathan wouldn't budge on putting the song out until he discovered that Federal had received orders for twenty-five thousand copies of the single.\n\nNathan then asked Brown for the tape, saying he was going to give Brown one more chance. But Brown told Nathan that if he was going to put out the new song, it was going to be done properly, in a studio paid for by Nathan. Nathan reluctantly agreed, and Brown went into the studio and cut \"Try Me\":\n\n[Excerpt: James Brown and the Famous Flames, \"Try Me\"]\n\n\"Try Me\" became an even bigger hit than \"Please Please Please\" had, and went to number one on the R&B charts and number forty-eight on the pop charts.\n\nBut once again, Brown lost his group, and this time just before a big residency at the Apollo -- the most prestigious, and also the most demanding, venue on the chitlin' circuit. He still had Johnny Terry, and this was the point when Bobby Byrd rejoined the group after a couple of years away, but he was still worried about his new group and how they would fare on this residency, which also featured Little Richard's old group the Upsetters, and was headlined by the blues star Little Willie John.\n\nBrown needn't have worried. The new lineup of Famous Flames went down well enough that the audiences were more impressed by them than by any of the other acts on the bill, and they were soon promoted to co-headline status, much to Little Willie John's annoyance.\n\nThat was the first time James Brown ever played at the Apollo, a venue which in later years would become synonymous with him, and we'll pick up in later episodes on the ways in which Brown and the Apollo were crucial in building each other's reputation.\n\nBut for Brown himself, probably the most important thing about that residency at the Apollo came at the end of the run. And I'll finish this episode with Brown's own words, from his autobiography, talking about that last night:\n\n\"The day after we finished at the Apollo I was in my room at the Theresa, fixing to leave for Washington, when somebody knocked on the door.\n\n“Come in,” I said. I was gathering up my belongings, not really watching the door. I heard it open, real slow, but that was all. After a minute, when I realized how quiet it was, I turned around. There was a small woman standing there, not young, not old. I hadn’t seen her since I was four years old, but when I looked at her I knew right away it was my mother.\n\nI had no idea she was coming to see me that day or any day.\n\n“I’ve been looking for you for a long time,” I said. “I’m glad to see you.”\n\nShe started to smile, and when she did I could see she’d lost all her teeth.\n\nAll I could think to say was, “I’m going to get your mouth fixed for you.”\n\nShe didn’t say anything. She just walked toward me. We hugged, and then I kissed my mother for the first time in more than twenty years.\"",
  "itunes:subtitle": "Episode thirty-nine of A History of Rock Music in Five Hundred Songs looks at Please Please Please by James Brown, and at the early rock and roll career of the Godfather of Soul. Click the full post to read liner notes, links to more information, and a t",
  "itunes:keywords": "Bobby Byrd,doo wop,Federal Records,funk,gospel,James Brown,King Records,Little Richard,Louis Jordan,racism,Ralph Bass,soul,Syd Nathan",
  "itunes:episodeType": "full",
  "itunes:episode": 39,
  "content:encoded": "Episode thirty-nine of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Please Please Please\" by James Brown, and at the early rock and roll career of the Godfather of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28037573\">on \"Come Go With Me\" by the Del Vikings.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-39-please-please-please/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI relied mostly on two books for this episode. <a href=\"https://amzn.to/2YqB2ga\">James Brown: The Godfather of Soul</a>, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\n<a href=\"https://amzn.to/2Jm29D4\">Kill 'Em and Leave: Searching for the Real James Brown</a>, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\nAnd <a href=\"https://amzn.to/2FJJpvX\">this two-CD compilation</a> has all Brown's singles from 1956 through 61.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\nJust as the other week we talked about a country musician who had a massive impact on rock and roll, one who was originally marketed as a rock and roller, so today we're going to talk about a funk and soul musician who got his first hits playing to the rock and roll audience.\n\nThere is a type of musician we will come across a lot as our story progresses. He is almost always a man, and he is usually regarded as a musical genius. He will be focused only on two things -- his music and his money -- and will have basically no friends, except maybe one from his childhood. He has employees, not friends. And he only hires the best -- his employees do staggering work while being treated appallingly by him, and he takes all the credit while they do most of the work. Yet at the same time, the work those employees do ends up sounding like that genius, and when they go on to do their own stuff without him, it never sounds quite as good. That one percent he's adding does make the difference. He's never really liked as a person by his employees, but he's grudgingly respected, and he's loved by his audience.\n\nThere are people like that in every creative field -- one thinks of Stan Lee in comics, or Walt Disney in film -- but there are a *lot* of them in music, and they are responsible for an outsized portion of the most influential music ever made. And James Brown is almost the archetypal example of this kind of musician.\n\nJames Brown had a hard, hard childhood. His mother left his father when James was four -- stories say that Brown's father pulled a gun on her, so her wanting to get away seems entirely reasonable, but she left her son with him, and James felt abandoned and betrayed for much of his life. A few years later his father realised that he didn't have the ability to look after a child by himself, and dumped James on a relative he always called an aunt, though she was some form of cousin, to raise. His aunt ran a brothel, and it's safe to say that that was not the best possible environment in which to raise a young child. He later said that he was in his teens before he had any underwear that was bought from a shop rather than made out of old sacks. In later life, when other people would talk about having come from broken homes and having been abandoned by their fathers, he would say \"How do you think I feel? My father *and my mother* left me!\"\n\nBut he had ambition. Young James had entered -- and won -- talent shows from a very young age -- his first one was in 1944, when he was eleven, and he performed \"So Long\", the song that would a few years later become Ruth Brown's first big hit, but was then best known in a version by the Charioteers:\n\n[Excerpt: The Charioteers, \"So Long\"]\n\nHe loved music, especially jazz and gospel, and he was eager to learn anything he could about it. The one form of music he could never get into was the blues -- his father played a little blues, but it wasn't young James' musical interest at all -- but even there, when Tampa Red started dating one of the sex workers who worked at his aunt's house, young James Brown learned what he could from the blues legend.\n\nHe learned to sing from the holiness churches, and his music would always have a gospel flavour to it. But the music he liked more than anything was that style of jazz and swing music that was blending into what was becoming R&B. He loved Count Basie, and used to try to teach himself to play \"One O'Clock Jump\", Count Basie's biggest hit, on the piano:\n\n[Excerpt: Count Basie, \"One O'Clock Jump\"]\n\nThat style of music wouldn't show up in his earlier records, which were mostly fairly standard vocal group R&B, but if you listen to his much later funk recordings, they owe a *lot* to Basie and Lionel Hampton. The music that Brown became most famous for is the logical conclusion to the style that those musicians developed -- though we'll talk more about the invention of funk, and how funk is a form of jazz, in a future episode.\nBut his real favourite, the one he tried to emulate more than any other, was Louis Jordan. Brown didn't get to see Jordan live as a child, but he would listen to his records on the radio and see him in film shorts, and he decided that more than anything else he wanted to be like Jordan. As soon as he started performing with small groups around town, he started singing Jordan's songs, especially \"Caldonia\", which years later he would record as a tribute to his idol:\n\n[Excerpt: James Brown, \"Caldonia\"]\n\nBut as you might imagine, life for young James Brown wasn't the easiest, and he eventually fell into robbery. This started when he was disciplined at school for not being dressed appropriately -- so he went out and stole himself some better clothes. He started to do the same for his friends, and then moved on to more serious types of theft, including cars, and he ended up getting caught breaking into one.\n\nAt the age of sixteen, Brown was sent to a juvenile detention centre, on a sentence of eight to sixteen years, and this inadvertently led to the biggest piece of luck in his life, when he met the man who would be his mentor and principal creative partner for the next twenty years. There was a baseball game between inmates of the detention centre and a team of outsiders, one of whom was named Bobby Byrd, and Byrd got talking to Brown and discovered that he could sing. In fact Brown had put together a little band in the detention centre, using improvised instruments, and would often play the piano in the gym. He'd got enough of a reputation for being able to play that he'd acquired the nickname \"Music Box\" -- and Byrd had heard about him even outside the prison.\n\nAt the time, Byrd was leading a gospel vocal group, and needed a new singer, and he was impressed enough with Brown that he put in a word for him at a parole hearing and helped him get released early. James Brown was going to devote his life to singing for the Lord, and he wasn't going to sin any more.\nHe got out of the detention centre after serving only three years of his sentence, though you can imagine that to a teen there was not much \"only\" about spending three years of your life locked up, especially in Georgia in the 1940s, a time and place when the white guards were free to be racially abusive to an even greater extent than they are today. And for the next ten years, throughout his early musical career, Brown would be on parole and in danger of being recalled to prison at any time.\n\nBrown ended up joining Byrd's *sister's* gospel group, at least for a while, before moving over to Byrd's own group, which had originally been a gospel group called the Gospel Starlighters, but by now was an R&B group called the Avons. They soon renamed themselves again, to the Flames, and later to the *Famous* Flames, the name they would stick with from then on (and a name which would cause a lot of confusion, as we've already talked about the Hollywood Flames, who featured a different Bobby Byrd). Brown's friend Johnny Terry, who he had performed with in the detention centre, also joined the group. There would be many lineups of the Famous Flames, but Brown, Byrd, and Terry would be the nucleus of most of them.\n\nBrown was massively influenced by Little Richard, to the extent that he was essentially a Little Richard tribute act early on. Brown felt an immediate kinship with Richard's music because both of them were from Georgia, both were massively influenced by Louis Jordan, and both were inspired by church music. Brown would later go off in his own direction, of course, but in those early years he sounded more like Little Richard than like anyone else.\n\nIn fact, around this time, Little Richard's career was doing so well that he could suddenly be booked into much bigger halls than he had been playing. He still had a few months' worth of contracts in those old halls, though, and so his agent had a brainwave. No-one knew what Richard looked like, so the agent got Brown and the Flames to pretend to be Little Richard and the Upsetters and tour playing the gigs that Richard had been booked into. Every night Brown would go out on stage to the introduction, \"Please welcome the hardest working man in showbusiness today, Little Richard!\", and when he finished ghosting for Little Richard, he liked the introduction enough that he would keep it for himself, changing it only to his own name rather than Richard's.\nBrown would perform a mixture of Richard's material, his own originals, and the R&B songs that the Flames had been performing around Georgia. They'd already been cutting some records for tiny labels, at least according to Brown's autobiography, mostly cover versions of R&B hits. I haven't been able to track down any of these, but one that Brown mentions in his autobiography is \"So Long\", which he later rerecorded in 1961, and that version might give you some idea of what Brown sounded like at the period when he was trying to be Little Richard:\n\n[Excerpt: James Brown, \"So Long\"]\n\nBrown's imitation of Richard went down well enough that Richard's agent, Clint Brantley, decided to get the group to record a demo of themselves doing their own material.\n\nThey chose to do a song called \"Please, Please, Please\", written by Brown and Johnny Terry. The song was based on something that Little Richard had scribbled on a napkin, which Brown decided would make a good title for a song. The song fits neatly into a particular genre of R&B ballad, typified by for example, Richard's \"Directly From My Heart to You\":\n\n[Excerpt: Little Richard, \"Directly From My Heart to You\"]\n\nThough both \"Directly From My Heart\" and \"Please Please Please\" owe more than a little to \"Shake A Hand\" by Faye Adams, the song that inspired almost all slow-burn blues ballads in this period:\n\n[Excerpt: Faye Adams, \"Shake a Hand\"]\n\nHowever, the real key to the song came when Brown heard the Orioles' version of Big Joe Williams' \"Baby Please Don't Go\", and used their backing vocal arrangement:\n\n[Excerpt: The Orioles, \"Baby Please Don't Go\"]\n\nThe Famous Flames were patterning themselves more and more on two groups -- Billy Ward and the Dominoes, whose records with Clyde McPhatter as lead singer had paved the way for vocal group R&B as a genre, and Hank Ballard and the Midnighters, whose \"Work With Me Annie\" had had, for the time, a blatant sexuality that was unusual in successful records. They were going for energy, and for pure expression of visceral emotion, rather than the smooth sophisticated sounds of the Platters or Penguins.\n\nThey were signed to Federal Records, a subsidiary of King, by Ralph Bass, the visionary A&R man we've dealt with in many other episodes. Bass was absolutely convinced that \"Please Please Please\" would be a hit, and championed the Flames in the face of opposition from his boss, Syd Nathan. Nathan thought that the song just consisted of Brown screaming one word over and over again, and that there was no way on earth that it could be a hit. In Brown's autobiography (not the most reliable of sources) he even claims that Bass was sacked for putting out the record against Nathan's will, but then rehired when the record became a hit. I'm not sure if that's literally true, but it's a story that shows the emotional truth of the period -- Bass was the only person at the record company with any faith in the Famous Flames.\n\nBut the song became hugely popular. The emotion in Brown's singing was particularly effective on a particular type of woman, who would feel intensely sorry for Brown, and who would want to make that poor man feel better. Some woman had obviously hurt him terribly, and he needed the right woman to fix his hurt. It was a powerful, heartbreaking, song, and an even more powerful performance:\n\n[Excerpt: James Brown and the Famous Flames, \"Please Please Please\"]\n\nThe song would eventually become one of the staples in the group's live repertoire, and they would develop an elaborate routine about it. Brown would drop to his knees, sobbing, and the other band members would drape him in a cape -- something that was inspired by a caped wrestler, Gorgeous George -- and try to lead him off stage, concerned for him. Brown would pull away from them, feigning distress, and try to continue singing the song while his bandmates tried to get him off the stage.\n\nSometimes it would go even further -- Brown talks in his autobiography about one show, supporting Little Richard, where he climbed into the rafters of the ceiling, hung from the ceiling while singing, and dropped into the waiting arms of the band members at the climax of the show.\n\nBut there was trouble in store. The record reached number six on the R&B chart and supposedly sold between one and three million copies, though record companies routinely inflated sales by orders of magnitude at this point. But it was credited to James Brown and the Famous Flames, not just to the Famous Flames as a group. When they started to be billed that way on stage shows, too, the rest of the band decided that enough was enough, and quit en masse.\n\nBobby Byrd and Johnny Terry would rejoin fairly shortly afterwards, and both would stay with Brown for many more years, but the rest of the group never came back, and Brown had to put together a new set of Famous Flames, starting out almost from scratch. He had that one hit, which was enough to get his new group gigs, but everything after that flopped, for three long years.\n\nRecords like \"Chonnie On Chon\" tried to jump on various bandwagons -- you can hear that there was still a belief among R&B singers that if they namechecked \"Annie\" from \"Work With Me Annie\" by the Midnighters, they would have a hit -- but despite him singing about having a rock and roll party, the record tanked:\n\n[Excerpt: James Brown, \"Chonnie On Chon\"]\n\nBrown and his new group of Flames had to build up an audience more or less from nothing. And it's at this point -- when Brown was the undisputed leader of the band -- that he started his tactic of insisting on absolute discipline in his bands. Brown took on the title \"the hardest working man in showbusiness\", but his band members had to work equally hard, if not harder. Any band member whose shoes weren't shined, or who missed a dance step, or hit a wrong note on stage, would be fined. Brown took to issuing these fines on stage -- he'd point at a band member and then flash five fingers in time to the music. Each time he made his hand flash, that was another five dollar fine for that musician. Audiences would assume it was part of the dance routine, but the musician would know that he was losing that money.\n\nBut while Brown's perfectionism verged on the tyrannical (and indeed sometimes surpassed the tyrannical), it had results.\n\nBrown knew, from a very early age, that he would have to make his success on pure hard work and determination. He didn't have an especially good voice (though he would always defend himself as a singer -- when someone said to him \"all you do is grunt\", he'd respond, \"Yes, but I grunt *in tune*”). And he wasn't the physical type that was in fashion with black audiences at the time. While I am *absolutely* not the person to talk about colourism in the black community, there is a general consensus that in that time and place, black people were more likely to admire a black man if he was light-skinned, had features that didn't fit the stereotype of black people, and was tall and thin. Brown was *very* dark, had extremely African features, and was short and stocky.\n\nSo he and his group just had to work harder than everyone else. They spent three years putting out unsuccessful singles and touring the chitlin' circuit. We've mentioned the chitlin' circuit in passing before, but now is probably the time to explain this in more detail.\n\nThe chitlin' circuit was an informal network of clubs and theatres that stretched across the USA, catering almost exclusively to black audiences. Any black act -- with the exception of a handful of acts who were aiming at white audiences, like Harry Belafonte or Nat \"King\" Cole -- would play the chitlin' circuit, and those audiences would be hard to impress. As with poor audiences everywhere, the audiences wanted value for their entertainment dollar, and were not prepared to tolerate anything less than the best.\n\nThe worst of these audiences was at the amateur nights at the Apollo Theatre in Harlem. The audiences there would come prepared with baskets full of rotten fruit and eggs to throw at the stage. But all of the audiences would be quick to show their disapproval.\n\nBut at the same time, that kind of audience will also, if you give them anything *more* than their money's worth, be loyal to you forever. And Brown made sure that the Famous Flames would inspire that kind of loyalty, by making sure they worked harder than any other group on the circuit. And after three years of work, he finally had a second hit.\n\nThe new song was inspired by \"For Your Precious Love\" by Jerry Butler, another slow-burn ballad, though this time more obviously in the soul genre:\n\n[Excerpt: Jerry Butler, \"For Your Precious Love\"]\n\nAs Brown told the story, he wrote his new song and took it to Syd Nathan at Federal, who said that he wasn't going to waste his money putting out anything like that, and that in fact he was dropping Brown from the label. Brown was so convinced it was a hit that he recorded a demo with his own money, and took it directly to the radio stations, where it quickly became the most requested song on the stations that played it.\n\nAccording to Brown, Nathan wouldn't budge on putting the song out until he discovered that Federal had received orders for twenty-five thousand copies of the single.\n\nNathan then asked Brown for the tape, saying he was going to give Brown one more chance. But Brown told Nathan that if he was going to put out the new song, it was going to be done properly, in a studio paid for by Nathan. Nathan reluctantly agreed, and Brown went into the studio and cut \"Try Me\":\n\n[Excerpt: James Brown and the Famous Flames, \"Try Me\"]\n\n\"Try Me\" became an even bigger hit than \"Please Please Please\" had, and went to number one on the R&B charts and number forty-eight on the pop charts.\n\nBut once again, Brown lost his group, and this time just before a big residency at the Apollo -- the most prestigious, and also the most demanding, venue on the chitlin' circuit. He still had Johnny Terry, and this was the point when Bobby Byrd rejoined the group after a couple of years away, but he was still worried about his new group and how they would fare on this residency, which also featured Little Richard's old group the Upsetters, and was headlined by the blues star Little Willie John.\n\nBrown needn't have worried. The new lineup of Famous Flames went down well enough that the audiences were more impressed by them than by any of the other acts on the bill, and they were soon promoted to co-headline status, much to Little Willie John's annoyance.\n\nThat was the first time James Brown ever played at the Apollo, a venue which in later years would become synonymous with him, and we'll pick up in later episodes on the ways in which Brown and the Apollo were crucial in building each other's reputation.\n\nBut for Brown himself, probably the most important thing about that residency at the Apollo came at the end of the run. And I'll finish this episode with Brown's own words, from his autobiography, talking about that last night:\n\n\"The day after we finished at the Apollo I was in my room at the Theresa, fixing to leave for Washington, when somebody knocked on the door.\n\n“Come in,” I said. I was gathering up my belongings, not really watching the door. I heard it open, real slow, but that was all. After a minute, when I realized how quiet it was, I turned around. There was a small woman standing there, not young, not old. I hadn’t seen her since I was four years old, but when I looked at her I knew right away it was my mother.\n\nI had no idea she was coming to see me that day or any day.\n\n“I’ve been looking for you for a long time,” I said. “I’m glad to see you.”\n\nShe started to smile, and when she did I could see she’d lost all her teeth.\n\nAll I could think to say was, “I’m going to get your mouth fixed for you.”\n\nShe didn’t say anything. She just walked toward me. We hugged, and then I kissed my mother for the first time in more than twenty years.\"",
  "enclosure": "",
  "itunes:summary": "Episode thirty-nine of A History of Rock Music in Five Hundred Songs looks at \"Please Please Please\" by James Brown, and at the early rock and roll career of the Godfather of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Come Go With Me\" by the Del Vikings.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI relied mostly on two books for this episode. James Brown: The Godfather of Soul, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\nKill 'Em and Leave: Searching for the Real James Brown, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\nAnd this two-CD compilation has all Brown's singles from 1956 through 61.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nJust as the other week we talked about a country musician who had a massive impact on rock and roll, one who was originally marketed as a rock and roller, so today we're going to talk about a funk and soul musician who got his first hits playing to the rock and roll audience.\n\nThere is a type of musician we will come across a lot as our story progresses. He is almost always a man, and he is usually regarded as a musical genius. He will be focused only on two things -- his music and his money -- and will have basically no friends, except maybe one from his childhood. He has employees, not friends. And he only hires the best -- his employees do staggering work while being treated appallingly by him, and he takes all the credit while they do most of the work. Yet at the same time, the work those employees do ends up sounding like that genius, and when they go on to do their own stuff without him, it never sounds quite as good. That one percent he's adding does make the difference. He's never really liked as a person by his employees, but he's grudgingly respected, and he's loved by his audience.\n\nThere are people like that in every creative field -- one thinks of Stan Lee in comics, or Walt Disney in film -- but there are a *lot* of them in music, and they are responsible for an outsized portion of the most influential music ever made. And James Brown is almost the archetypal example of this kind of musician.\n\nJames Brown had a hard, hard childhood. His mother left his father when James was four -- stories say that Brown's father pulled a gun on her, so her wanting to get away seems entirely reasonable, but she left her son with him, and James felt abandoned and betrayed for much of his life. A few years later his father realised that he didn't have the ability to look after a child by himself, and dumped James on a relative he always called an aunt, though she was some form of cousin, to raise. His aunt ran a brothel, and it's safe to say that that was not the best possible environment in which to raise a young child. He later said that he was in his teens before he had any underwear that was bought from a shop rather than made out of old sacks. In later life, when other people would talk about having come from broken homes and having been abandoned by their fathers, he would say \"How do you think I feel? My father *and my mother* left me!\"\n\nBut he had ambition. Young James had entered -- and won -- talent shows from a very young age -- his first one was in 1944, when he was eleven, and he performed \"So Long\", the song that would a few years later become Ruth Brown's first big hit, but was then best known in a version by the Charioteers:\n\n[Excerpt: The Charioteers, \"So Long\"]\n\nHe loved music, especially jazz and gospel, and he was eager to learn anything he could about it. The one form of music he could never get into was the blues -- his father played a little blues, but it wasn't young Jam",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode thirty-nine of A History of Rock Music in Five Hundred Songs looks at \"Please Please Please\" by James Brown, and at the early rock and roll career of the Godfather of Soul. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Come Go With Me\" by the Del Vikings.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI relied mostly on two books for this episode. James Brown: The Godfather of Soul, by James Brown with Bruce Tucker, is a celebrity autobiography with all that that entails, but a more interesting read than many.\n\nKill 'Em and Leave: Searching for the Real James Brown, by James McBride is a more discursive, gonzo journalism piece, and well worth a read.\n\nAnd this two-CD compilation has all Brown's singles from 1956 through 61.\n\nPatreon\n\nThis podcast is brought to you by the generosity ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}