{
  "title": "The Edition: Cross to bear",
  "link": "https://audioboom.com/posts/8067077",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2392,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: How are the people of both Russia and Ukraine processing the war?</div>\n<div><br>\n</div>\n<div>Our Russia correspondent Owen Matthews writes in this week’s <em>Spectator </em>that he has been stunned at how easily some of his Russian friends have accepted the Kremlin’s propaganda. He joins the podcast to explain why he thinks this is, followed by journalist and author of <em>This Is Not Propaganda</em>, Peter Pomerantsev, who has travelled to Kyiv to celebrate the festival of Passover. (00:48)</div>\n<div><br>\n</div>\n<div>Also this week: Is Rishi Sunak politically incompetent? </div>\n<div><br>\n</div>\n<div>Until recently Rishi Sunak was once a favourite to succeed Boris Johnson, but this week his popularity plummeted to new lows. Our Deputy Political Editor Katy Balls writes about the Chancellor’s challenges in this week’s <em>Spectator</em> and she joins the podcast along with Chris Curtis from <em>Opinium Research</em> to talk about Rishi’s nightmare week. (20:20)</div>\n<div><br>\n</div>\n<div>And finally: Why do so many of Africa’s leaders support Putin?</div>\n<div><br>\n</div>\n<div>Our wildlife correspondent, Aidan Hartley argues in this week’s <em>Spectator </em>that this is because many previously colonised nations still see the West as their old enemy and that the enemy of their enemy is their friend. Aidan joins us now. (31:40)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to The Spectator today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast Table Talk: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 14 Apr 2022 14:24:06 +0000",
  "guid": "tag:audioboom.com,2022-04-14:/posts/8067077",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}