{
  "title": "A Helicopter Will Try to Catch a Rocket Booster in Midair",
  "link": "https://spectrum.ieee.org/rocket-booster-rocket-lab",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-digital-rendering-of-a-spacecraft-booster-falling-back-into-earth-s-atmosphere.jpg?id=29693520&width=1500&height=2000&coordinates=555%2C0%2C555%2C0\"/><br/><br/><p>\n\tThe longest journey begins with a single step, and that step gets expensive when you’re in the space business. Take, for example, the Electron booster made by \n\t<a href=\"https://www.rocketlabusa.com/\" target=\"_blank\">Rocket Lab</a>, a company with two launch pads on the New Zealand coast and another awaiting use in Virginia. Earth’s gravity is so stubborn that, by necessity, two-thirds of the rocket is its first stage—and it has historically ended up as trash on the ocean floor after less than 3 minutes of flight.<br/>\n</p><p>\n\tMaking those boosters reusable—saving them from a saltwater grave, and therefore saving a lot of money—has been a goal of aerospace engineers since the early space age. Elon Musk’s \n\t<a href=\"https://spectrum.ieee.org/tag/spacex\" target=\"_self\">SpaceX</a> has famously been landing its Falcon 9 boosters on drone ships off the Florida coast—<a href=\"https://www.youtube.com/watch?v=KDK5TF2BOhQ\" target=\"_blank\">mind-bending to watch</a> but very hard to pull off.\n</p><p>\n\tRocket Lab says it has another way. Iits next flight will carry 34 commercial satellites—and instead of being dropped in the Pacific, the spent first stage will be snared in midair by a helicopter as it descends by parachute. It will then be brought back to base, seared by the heat of reentry but inwardly intact, for possible refurbishment and reuse. The team, in its determination to minimize its odds of dropping the ball, so to speak, has pushed back the launch several times in order to wait out inclement weather. They reason that because this isn’t a game of horseshoes, close is not good enough.\n</p><p>\n\t“It’s a very complex thing to do,” says \n\t<a href=\"https://www.rocketlabusa.com/about/team/\" target=\"_blank\">Morgan Bailey</a> of Rocket Lab. “You have to position the helicopter in exactly the right spot, you have to know exactly where the stage is going to be coming down, you have to be able to slow it enough,” she says. “We’ve practiced and practiced all of the individual puzzle pieces, and now it’s putting them together. It’s not a foregone conclusion that the first capture attempt will be a success.”\n</p><p>\n\tStill, people in the space business will be watching, since Rocket Lab has established a niche for itself as a viable space company. This will be its 26th Electron launch. The company says it has launched 112 satellites so far, many of them \n\t<a data-linked-post=\"2650275029\" href=\"https://spectrum.ieee.org/the-tricks-to-launching-many-satellites-on-one-rocket\" target=\"_blank\">so-called smallsats</a> that are relatively inexpensive to fly. “Right now, there are two companies taking payloads to orbit: SpaceX and Rocket Lab,” says <a href=\"https://www.spacecapital.com/team\" rel=\"noopener noreferrer\" target=\"_blank\">Chad Anderson</a>, CEO of Space Capital, a firm that funds space startups.\n</p><blockquote class=\"rm-embed twitter-tweet\" data-partner=\"rebelmouse\" data-twitter-tweet-id=\"1511331067629760513\">\n<div style=\"margin:1em 0\">It\\u2019s time\\u2026\\u2026.Launch - Catch - Launchhttps://twitter.com/RocketLab/status/1511314645138567169\\u00a0\\u2026</div> — Peter Beck (@Peter Beck)\n        <a href=\"https://twitter.com/Peter_J_Beck/statuses/1511331067629760513\">1649164380</a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\"></script><p>\n\tHere's the flight profile. The Electron is 18 meters tall; the bottom 12 meters are the first stage. For this mission it will lift off from New Zealand on its way to a sun-synchronous orbit 520 kilometers high. The first stage burns out after the first 70 km. Two minutes and 32 seconds into the flight, it drops off, following a long arc that in the past would have sent it crashing into the ocean, about 280 km downrange.\n</p><p>\n\tBut Rocket Lab has now equipped its booster with heat shielding, protecting it as it falls tail-first at up to 8,300 kilometers per hour. Temperatures should reach 2,400 °C as the booster is slowed by the air around it.\n</p><p>\n\tAt an altitude of 13 km, a small \n\t<a href=\"https://en.wikipedia.org/wiki/Drogue_parachute\" target=\"_blank\">drogue parachute </a>is deployed from the top end of the rocket stage, followed by a main chute at about 6 km, less than a minute later. The parachute slows the rocket substantially, so that it is soon descending at only about 36 km/h.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Rendering of helicopter after catching the spent Electron rocket first stage in midair.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"c59981ae92bdc9ad2a889721f5296e59\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"9196e\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/rendering-of-helicopter-after-catching-the-spent-electron-rocket-first-stage-in-midair.jpg?id=29693535&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">An artist’s conception shows the helicopter after catching the spent Electron rocket’s first stage in midair.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Rocket Lab</small>\n</p><p>\n\tBut even that would make for a hard splashdown—which is why a Sikorsky S-92 helicopter hovers over the landing zone, trailing a grappling hook on a long cable. The plan is for the helicopter to fly over the descending rocket and snag the parachute cables. The rocket never gets wet; the chopper secures it and either lowers it onto a ship or carries it back to land. Meanwhile—let’s not lose sight of the prime mission—the second stage of the rocket should reach orbit about 10 minutes after launch.\n</p><p>\n\t“You have to keep the booster out of the water,” says Anderson. “If they can do that, it’s a big deal.” Many space people will recall NASA’s \n\t<a href=\"https://www.nasa.gov/exploration/systems/sls/fs/solid-rocket-booster.html\" target=\"_blank\">solid rocket boosters</a>, which helped launch the space shuttles and then parachuted into the Atlantic; towing them back to port and cleaning them up for reuse was slow and expensive. NASA’s giant <a href=\"https://spectrum.ieee.org/nasas-space-launch-system-will-lift-off\" target=\"_self\">SLS rocket</a> uses the same boosters, but there are no plans to recover them.\n</p><p>\n\tSo midair recovery is far better, though it’s not new. As long ago as 1960, the U.S. Air Force snagged a returning capsule from a mission called \n\t<a href=\"https://airandspace.si.edu/explore-and-learn/multimedia/detail.cfm?id=4281\" rel=\"noopener noreferrer\" target=\"_blank\">Discoverer 14</a>. But that had nothing to do with economy; the Discoverers were actually <a href=\"https://airandspace.si.edu/events/techquest/past-missions/eye-in-the-sky/corona.cfm\" rel=\"noopener noreferrer\" target=\"_blank\">Corona</a> reconnaissance satellites, and they were sending back film of the Soviet Union—priceless for Cold War intelligence.\n</p><p>\n\tRocket Lab tries to sound more playful about its missions: It gives them names like “A Data With Destiny” or “Without Mission a Beat.” This newest flight, with its booster-recovery attempt, is called “There and Back Again.”\n</p><p>\n\tA teenager \n\t<a href=\"https://twitter.com/EmmettReis/status/1512205706342055946\" target=\"_blank\">tweeted</a> to CEO Peter Beck: “It would have been cool if the mission was called ‘Catch Me If You Can.’”\n</p><p>\n\t“Oh…that’s good!” Beck \n\t<a href=\"https://twitter.com/Peter_J_Beck/status/1512207819986022429\" target=\"_blank\">replied</a>. “Congratulations, you have just named the very next recovery mission.”<br/>\n</p><p>\n<em>Update 22 April 2022: </em>In a tweet, Rocket Lab announced that due to weather, the planned launch and recovery would be rescheduled <a href=\"https://twitter.com/RocketLab/status/1517328086345281536\" target=\"_blank\">for 27 April at the earliest</a>.<br/>\n</p><p>\n<em>This article appears in the July 2022 print issue as “Rocket Lab Catches Rocket Booster in Midair.”</em>\n</p>",
  "pubDate": "Mon, 18 Apr 2022 18:28:03 +0000",
  "guid": "https://spectrum.ieee.org/rocket-booster-rocket-lab",
  "category": [
    "Rocket launch",
    "Space flight",
    "Rockets"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}