{
  "title": "Episode #361:  Sexual Harassment, As Seen By The Two Parties",
  "link": "https://www.krpoliticaljunkie.com/episode-361-sexual-harassment-as-seen-by-the-two-parties/",
  "pubDate": "Sat, 06 Mar 2021 00:04:09 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=19650",
  "description": "<p>Two politicians, New York Gov. Andrew Cuomo (D) and Rep. Madison Cawthorn (R-NC) have been hit with allegations of sexual harassment.  In addition to the two cases, we ask why the two parties seem to treat sexual harassment differently, at least when it comes to their own party members.  And we recap some of the nuttiness at last weekend&#039;s CPAC event.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-361-sexual-harassment-as-seen-by-the-two-parties/\">Episode #361:  Sexual Harassment, As Seen By The Two Parties</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Two politicians, New York Gov. Andrew Cuomo (D) and Rep. Madison Cawthorn (R-NC) have been hit with allegations of sexual harassment.  In addition to the two cases, we ask why the two parties seem to treat sexual harassment differently,",
  "itunes:summary": "We all agree that sexual harassment is bad, regardless of who is the accused.  The allegations against New York Gov. Andrew Cuomo, a Democrat, look bad.  The allegations against North Carolina congressman Madison Cawthorn, a Republican, look bad.  We have reports on the two by Chris Churchill, a political columnist at the Albany Times-Union, and Tom Fiedler, a journalist from Asheville, N.C.  Neither politician comes out looking especially good.  But a sidebar to these stories is that such allegations leveled against a Democrat will result in far more severe punishment by his own party than they would if the allegations were made against a Republican.  Some Dems are calling for Cuomo&#8217;s resignation; Cawthorn is continually heralded as a rising star.  In addition to the two situations, we ponder why the two parties see it differently.<br />\nWe also have a report on the goings on last weekend at CPAC by Tim Denevi, who retells some of the craziness at the event, sizes up potential 2024 presidential hopefuls and, most significantly, assesses Donald Trump&#8217;s first major appearance since he left the White House.<br />\nMusic in this episode<br />\n<a href=\"https://www.youtube.com/watch?v=bwkltb0qbsA\">It Wasn&#8217;t Me by Chuck Berry</a><br />\n<a href=\"https://www.youtube.com/watch?v=YAbYsxd3ADg\">Hero Takes a Fall by the Bangles</a><br />\n<a href=\"https://www.youtube.com/watch?v=JUbMWtUyIIE\">Somebody to Love by Jefferson Airplane</a><br />\n<a href=\"https://www.youtube.com/watch?v=3Fn36l_z3WY\">They&#8217;re Coming to Take Me Away by Napolean XIV</a><br />\n&nbsp;<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 361,
  "itunes:title": "Sexual Harassment, As Seen By The Two Parties",
  "itunes:duration": "1:07:22"
}