{
  "title": "IEEE President’s Note: A Promise Is a Promise",
  "link": "https://spectrum.ieee.org/ieee-presidents-note-a-promise-is-a-promise",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/photo-of-k-j-ray-liu.jpg?id=25535937&width=1200&height=800&coordinates=0%2C52%2C0%2C52\"/><br/><br/><p>\n\tMy great-grandfather was the kindest man I ever met. A self-taught accountant without formal education, he lived in the impoverished countryside of southern Taiwan. Legend has it that because members of the community viewed him as trustworthy, humble, and hardworking, they hired him to do their bookkeeping. He escaped a future of being a struggling farmer and was able to build a successful business.\n</p><p>\n\tHe was also a vegetarian. While there were many special occasions and festivals in his sleepy village where meat was served, he always chose to eat his simple vegetarian meals away from others. I always wondered why. I came to learn that it was because my great-grandfather made a promise to Buddha.\n</p><hr/><p>\n\tMany years ago, my grandfather was a medical student studying in Japan. After a vacation home to Taiwan with my grandmother, they returned to Japan by boat, during which time he became very ill. World War II was raging, and medical supplies were limited. Unfortunately, by the time the necessary supplies reached my grandfather, it was too late. Later, my great-uncle went to Japan to study medicine and he also became quite sick. That was when my great-grandfather made a promise to Buddha: If you let my second son live, I will forever be a vegetarian to honor you. My great-uncle survived. My great-grandfather’s wish came true and until he passed away in his nineties, he never broke his promise, a simple vow between him and Buddha. A promise is a promise.\n</p><p>\n\tI strongly believe that integrity is the essence of everything successful, and character is what you do when no one is watching. Ethics serves as my ultimate guide for how I conduct myself both personally and professionally.\n</p><p>\n\tBecause we are in a profession that often deals with innovation and safety, all members of our community—engineers, technologists, scientists, practitioners, and entrepreneurs—should have the highest ethical standards.\n</p><p>\n\tIEEE has recently revised its<a href=\"https://www.ieee.org/about/corporate/governance/p7-8.html\" rel=\"noopener noreferrer\" target=\"_blank\"> Code of Ethics</a>, which encourages our members to strive to comply with ethical design and sustainable development practices. This is crucial given the global scale of the environmental, social, and political challenges that threaten to rapidly and critically impact the living conditions of current and future generations.\n</p><h2>Fair opportunity for participation</h2><p>\n\tAt the time of my grandfather’s death, my grandmother was pregnant with my mother. Because of this, she dropped out of medical school. During this era, a widow was expected to remain as such, even though my grandmother was only in her twenties. She chose to get remarried, an act that was unforgivable then. Thus, my mother was raised by my great-grandfather.\n</p><p>\n\tMy grandmother was ahead of her time and dared to defy tradition. She was an outstanding athlete and an excellent student, with both ambition and potential. However, she lived during an era when women seldom received an education, not to mention the opportunity to attend medical school. In the end, tradition won. After remarrying, she had more children and became a housewife, not a doctor as she had planned. How many women in the world still face such obstacles?\n</p><p>\n\tMaking progress in engineering, technology, and science is a global endeavor with worldwide implications. This progress is guided best by having an open, diverse, and inclusive mindset with the goal of developing and sharing innovative solutions for the benefit of all.\n</p><h3></h3><br/><h4>Follow me on social media for updates and information from across IEEE</h4><p>Twitter: <a href=\"https://twitter.com/IeeePresident\" rel=\"noopener noreferrer\" target=\"_blank\">@IeeePresident</a></p><p>Facebook: <a href=\"https://www.facebook.com/ieeepresident?mkt_tok=NzU2LUdQSC04OTkAAAGCeNwHEWZBLFy1g36wZLj_Atd0EE8vojc0ydzmvdnnj7n6r32HBI7DVEGCpJeut0Ls0YYFntr1NbdFBysSNjvhyMWszhtbGTD2a9xPWvop91bf\" rel=\"noopener noreferrer\" target=\"_blank\">@ieeepresident</a></p><p>Instagram: <a href=\"https://www.instagram.com/ieeepresident/?mkt_tok=NzU2LUdQSC04OTkAAAGCeNwHESmM8yErBuymrVXbp1Eq6FXR51Ra3wpY6QPbMT_ftQ7JEVz9flfdImXxEp3FwzD4cPh1tdNA6PVSPyO4ZDdHzA4LlU2cJ3Kplgd8_U_d\" rel=\"noopener noreferrer\" target=\"_blank\">@ieeepresident</a></p><p>LinkedIn: <a href=\"https://www.linkedin.com/showcase/ieeepresident\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.linkedin.com/showcase/ieeepresident</a></p><p>\n\tThroughout my lifelong relationship with IEEE—my professional home—what I have treasured most is having the opportunity to befriend colleagues from around the world, from different cultures, with different beliefs, ways of life, and languages. My work, with IEEE and professionally, has taken me to several continents to collaborate and work with others. Through this global network I have been able to learn from the best and brightest minds in the world, and have come to greatly appreciate the diversity of cultures of IEEE members. Everyone has their own unique wisdom to offer.\n</p><p>\n\tIEEE continues its efforts to strengthen <a href=\"https://www.ieee.org/about/diversity-index.html\" rel=\"noopener noreferrer\" target=\"_blank\">diversity and inclusivity across the organization</a> and in the broader technological community. The establishment of the <a href=\"https://www.ieee.org/content/dam/ieee-org/ieee/web/org/about/corporate/ieee-diversity-and-inclusion-committee-charter.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Diversity and Inclusion Committee</a> as a standing committee of the IEEE Board of Directors follows the organization’s long-standing commitment to maintaining an environment in which all are welcome to collaborate and contribute to the community, to support the growth of the profession and colleagues, and to advance technology for the benefit of humanity.\n</p><p>\n\tAdditionally, IEEE has devoted considerable effort in the past few years revising policies, procedures, and bylaws to ensure that members have a safe, inclusive place where all feel welcome. These activities help ensure all our members have full access to the benefits of membership, including opportunities for professional development and recognition.\n</p><p>\n\tAs president, I made a commitment to help shape the IEEE of the future by examining ways in which the organization can evolve to best meet the needs of all technical professionals. And I made a promise to every member from all of our diverse groups and regions, especially women and others from underrepresented communities, that they will have a fair opportunity for participation and leadership in our professional home.<br/>\n\t And a promise is a promise.</p><p>\n\tPlease share your thoughts with me at <a href=\"mailto:mailto:president@ieee.org\">president@ieee.org</a>.\n</p><p><em>This article appears in the September 2022 print issue as “A Promise Is a Promise.”</em></p>",
  "pubDate": "Thu, 01 Sep 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ieee-presidents-note-a-promise-is-a-promise",
  "category": [
    "Ieee member news",
    "President's column",
    "Ieee president",
    "Diversity",
    "Type:ti"
  ],
  "dc:creator": "K.J. Ray Liu",
  "media:content": ""
}