{
  "title": "Chicago Officials Withhold Key Financial Information as City Hands Public Housing Land Over to Wealthy Ally of the Mayor",
  "link": "https://www.propublica.org/article/chicago-fire-lightfoot-public-housing-abla",
  "pubDate": "Fri, 04 Nov 2022 05:00:00 -0400",
  "guid": "https://www.propublica.org/article/chicago-fire-lightfoot-public-housing-abla",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/mick-dumke\">Mick Dumke</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. <a href=\"https://www.propublica.org/newsletters/dispatches?source=54G&placement=top-note&region=local\">Sign up for Dispatches</a>, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">For months, Chicago Mayor Lori Lightfoot has pushed <a href=\"https://www.propublica.org/article/chicago-housing-abla-fire-soccer-cha\">a plan to turn valuable public housing land over to a soccer team owned by a billionaire</a>. But as the deal awaits approval from the federal government, Lightfoot and the Chicago Housing Authority have kept key details hidden from the public and even other government officials.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">The CHA has told city aldermen that the Chicago Fire soccer team will likely pay up to $40 million to lease the 23-acre site for 40 or more years, with the proceeds used to benefit low-income families. But CHA officials have been secretive about specifics of the deal, including how they arrived at that price for prime land in a gentrifying neighborhood.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\"><a href=\"https://www.propublica.org/article/chicago-housing-abla-land-deal\">The CHA already received City Council approval</a> for a zoning change needed for the deal, and it has formally asked the U.S. Department of Housing and Urban Development <a href=\"https://www.propublica.org/article/chicago-public-housing-cha-hud\">to back the plan as well</a>. But agency officials have not shared a lease agreement with the council or HUD.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">And they’ve been evasive about whether they have an agreement in writing at all. When ProPublica asked for a copy of the lease, the CHA’s freedom of information officer said the agency didn’t have one. “There is no responsive record, in draft form or otherwise,” he wrote in an email.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">The CHA also refused to disclose records showing the appraisal and analysis used to determine the value of the land it plans to lease. The agency cited an exemption in the Illinois Freedom of Information Act that allows it to keep documents secret if they are considered “preliminary” or “draft” proposals. A CHA spokesperson said the agency will release the appraisal once the deal is finalized.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">But by that point the public won’t be able to do anything about it.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">“It really raises a fundamental question about whether they’re proceeding in this way to avoid anyone knowing [the details] until it’s been done,” said Joe Ferguson, the city’s former inspector general. Ferguson recently launched Re-Imagine Chicago, a nonprofit aimed at addressing flaws in the city’s governing structure.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">By keeping information secret until the deal is complete, Ferguson said, the CHA is at odds with a key tenet of good government: transparency. “This is the Chicago way in its most dark form,” he said.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">In response to questions, a CHA spokesperson wrote in a statement that the agreement with the Fire has not been finalized, but that the general terms of the “partnership” have the support of resident leaders.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">“CHA has been negotiating with the Fire to get the best possible deal for the agency and our residents and at this point we have agreed with them on the broad terms,” the statement said. “Publicly releasing appraisal documents or the terms under discussion during the negotiations would place CHA at a competitive disadvantage.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">The CHA has not sought any other bids or alternate deals for the land. It did not respond to a question from ProPublica asking why. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">And while elected resident leaders have backed the Fire proposal, other residents are opposed, including a group that has been meeting regularly near the site.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\"><a href=\"https://news.wttw.com/2022/06/09/land-was-promised-housing-instead-it-s-going-pro-soccer-team-owned-billionaire\">The CHA land, just west of downtown, was once part of the ABLA Homes development.</a> But most of the buildings at ABLA were leveled after the CHA launched its citywide Plan for Transformation two decades ago. Despite plans for replacement housing on the 23-acre site, it remained vacant as the agency struggled to fulfill its commitments. The CHA has finished less than a third of the new homes it promised at ABLA.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">Land in the Near West Side neighborhood has grown valuable. In 2017, a one-acre parcel two blocks away from the site designated for the Fire was appraised at $2.7 million, though the CHA ended up leasing that to a nonprofit organization for just $1 a year for 99 years.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">As in that case, the CHA didn’t undertake a competitive bidding process to determine the best use or price of the land offered to the Fire, which are owned by billionaire business leader Joe Mansueto, an ally of Lightfoot’s. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">Instead, team officials sent word to the city that they were looking for land to build a new practice facility. Mayoral aides worked with them for months on a plan to take over a Northwest Side park tucked between three public schools, and school officials even drafted a lease agreement, which they later released to ProPublica. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">But when those talks stalled, Lightfoot aides offered the CHA land to the Fire. The team has previously said that when the city offered the site, the Fire saw it as an “opportunity” to invest in the Near West Side and its residents while building a “world-class performance center.” (Originally their plan called for using nearly 26 acres of CHA property, though they subsequently altered it to fit on 23 acres.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">In December, weeks before Lightfoot said anything publicly about the Fire deal, CHA officials launched an environmental review of the property, one of the first steps it has to take before disposing of the land. By spring, the CHA had commissioned an appraisal of the land’s value that cost the agency a little more than $35,000, records show.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">On May 2, officials from the CHA and the Fire held a meeting with public housing residents. They promised that as part of the agreement, the Fire would pay money that the CHA could use to renovate sections of the ABLA development that were not dismantled in the Plan for Transformation. The officials also said the Fire would provide job opportunities and fund other neighborhood investments, including new parking and recreational space.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.19\">ABLA’s elected leaders and some other residents welcomed the deal with the Fire, according to the CHA’s records of the meeting. But others noted that they had heard promises from the CHA before. They pointed out that the CHA had failed to deliver hundreds of units of replacement housing at ABLA.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.20\">“CHA needs to build the property back that they tore down,” Mary Rush, one of the skeptical residents, said at the meeting.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.21\">More than five months later, Rush told ProPublica that she still hadn’t learned any specifics about the terms of the Fire deal and still objects to it. “That soccer field is not going to do anything for us,” she said, “and we’re going to look over there and wonder what happened to the housing.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.22\">Later in May, the CHA board voted unanimously to seek HUD’s approval for the deal without any public discussion of lease specifics. When a board member asked how many appraisals the CHA would use to determine the deal terms, Ann McKenzie, the CHA’s director of development, said, “We are considering two and maybe a third will be necessary.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.23\">The board’s resolution then granted agency CEO Tracey Scott the authority to “negotiate and enter into a long-term lease with the Chicago Fire Football Club” and to “perform such actions as may be necessary or appropriate” to carry out the deal once HUD signs off.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.24\">It was June before any details of the CHA’s deal with the Fire were released to the public, and even then they weren’t easy to find: They were summarized in just a few lines of a 461-page environmental report posted deep within the city’s website. The report stated that the Fire would lease the property for at least 40 years, paying an $8 million “lump sum” plus “approximately” $1 million a year in rent, adding up to $48 million total.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.25\">Over the next few months, behind closed doors, the terms apparently shifted so that the CHA would get less money.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.26\">In September, a number of aldermen had questions when a City Council committee considered a zoning change needed for the proposed soccer facility. The aldermen had not received any information about the terms of the lease, according to several who attended.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.27\">McKenzie told them that the agency had commissioned an appraisal and analysis to determine the value of the lease. None of the aldermen asked to see it, and McKenzie didn’t offer to share it.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.28\">She told aldermen the lease would be for 40 or more years and the Fire would pay $8 million upfront — just as the environmental report had stated. But McKenzie said the team’s annual payments would be as much as $800,000 a year — compared with the $1 million a year outlined before. That adds up to at least $8 million less over 40 years.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.29\">McKenzie indicated that the “reduction” was due to the costs of environmental cleanup, which were estimated to be $4 million.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.30\">A number of aldermen weren’t convinced that the deal was good for the CHA or its residents. The committee voted 7-5 against the zoning change for the facility. The next morning, though, Lightfoot’s allies called for another vote and were able to advance the measure.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.31\">When the full council took it up a few hours later, two aldermen moved to delay the vote at least a month so they could have more time to review the deal. Lightfoot, wielding the gavel, declared them out of order. <a href=\"https://news.wttw.com/2022/09/21/chicago-fire-soccer-facility-planned-26-acres-housing-authority-land-clears-city-council\">The zoning change was approved.</a></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.32\">That afternoon, the CHA submitted an application asking for HUD’s formal approval of the Fire deal. The materials included illustrations of the Fire’s proposed facility, records of meetings with residents and a copy of a letter of support from Lightfoot. It did not include details about the proposed lease agreement.</p>\n        \n    \n                            \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.0\">The application to HUD did include a copy of the appraisal the CHA said it is using to determine the lease terms. But in the records provided to ProPublica, the pages with the financial analysis are missing because the CHA considers the information “preliminary.” The public will be able to see the full appraisal, the agency said, but only after the Fire deal is finalized.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.1\">It was the only appraisal the CHA commissioned for the property. The CHA says the Fire also conducted an appraisal, which produced results similar to the agency’s own.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.2\">Alderman Byron Sigcho Lopez, who represents part of ABLA, said it’s outrageous that the CHA hasn’t disclosed the details of the deal with residents or elected officials.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"3.3\">“Imagine such a big deal, such a big agreement like this, and they don’t have all the documents available,” he said. “There has to be a cost-benefit analysis. Is this in the best interest of the ABLA residents? Is this in the best interest of the city of Chicago? How can you answer that when you don’t even know what the agreement is?”</p>\n        \n                                   ",
  "dc:subject": "",
  "dc:date": "2022-11-04T05:00:00-04:00",
  "dc:creator": "by Mick Dumke"
}