{
  "id": "yt:video:aosxdmhXQ-Q",
  "yt:videoId": "aosxdmhXQ-Q",
  "yt:channelId": "UCJZ94qp4dtCw0Q5UQqAkg7w",
  "title": "World's Most Difficult Trick Shot!",
  "link": "",
  "author": {
    "name": "larsandersen23",
    "uri": "https://www.youtube.com/channel/UCJZ94qp4dtCw0Q5UQqAkg7w"
  },
  "published": "2021-02-01T20:10:10+00:00",
  "updated": "2022-06-09T17:24:17+00:00",
  "media:group": {
    "media:title": "World's Most Difficult Trick Shot!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Trying the impossible year of training and luck!\n\nMy channel reached 500,000 subscribers yesterday.\nSo I thought I would do something exceptionally wild\nI tried myself out, and tried different things and then it became more and more complicated and more and more difficult:\nI jump up in the air\nSwinging bow from my back\nShoots through keyhole\nShoots through a string\nAnd blindfolded\nBy the way, to shoot through keyhole it is an arrow without feathers which also makes it harder.\n\nBow in video is a very small (about 85 cm.)\nspecial edition of Şimşek Azaraks model,\nBased on the historical Babur Mughal flight bow\n40 # but at 26 \"\n\nI was actually myself quite surprised it was actually possible even with many attempts\nAfterwards I begin to consider how difficult this trick-shot really was\n\nI'm seriously considering if this is the hardest trick ever done ???????\n(of course no one can know this for sure)\nI asked Dr. Murat Özveri expert in historical archery.\nHe knows an incredible amount and is himself a good archer who also experiments with historical tricks  Dr. Murat Özveri agreed that this may be the most difficult shot ever.\n\nHistoric super archer was amazing\nbut their archery was for practical use and even though they did trick shooting it was only secondary.\n\nMy advantage is that I live in modern times where the purpose of archery is only fun, so for years I have almost only trained to learn wild things and busting my limits.\n\nI also do live archery trick  but this is a video trick (which requires a lot of attempts)\nSo I wanted to do something that was only possible because I could try many times, so this is my limit of ability and luck.\n\n\n\nAre you an archer and are in doubt about how difficult this is,  try yourself\nit's a fun experiment.\n\nSincerely\nLars Andersen",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}