{
  "title": "TU99: Food, The Body, Trauma, &#038; Attachment With Guests Paula Scatoloni &#038; Rachel Lewis-Marlow",
  "link": "https://therapistuncensored.com/episodes/tu99-food-the-body-trauma-attachment-with-guests-paula-scatoloni-rachel-lewis-marlow/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu99-food-the-body-trauma-attachment-with-guests-paula-scatoloni-rachel-lewis-marlow",
  "pubDate": "Thu, 27 Jun 2019 15:41:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7258",
  "description": "What if we flipped the script and learned to see our body as a messenger that needs to be heard rather than an obstacle to be conquered when it comes to our relationship with food? When we take physiological perspective, we learn that the body has much to say not only about food but also emotional regulation and our basic human needs for attachment and defense.\n\nUsing the sensory information, attachment system and working with defenses.\n\nWho are our guests on this episode, you ask? Well here ya go, they are pretty bad-ass and they were interviewed by Dr. Ann Kelley:\n\nPaula Scatoloni, LCSW, CEDS, SEP\n\nPaula is a somatic-based psychotherapist, Certified Eating Disorders Specialist, and Somatic Experiencing™ practitioner in Chapel Hill, NC. She has worked in the field of eating disorders for over two decades. Paula served as the Eating Disorder Coordinator at Duke University CAPS for nine years and has taught extensively on the etiology and treatment of eating disorders through workshops, professional trainings, and conferences. She co-developed the first intensive outpatient program for eating disorders in the U.S with Dr. Anita Johnston. She is the co-founder of the Embodied Recovery model and the Embodied Recovery Institute in Durham, NC.\n\nRachel Lewis-Marlow, MS, EdS, LPC, LMBT\n\nRachel is a somatically integrative psychotherapist, dually licensed in counseling and therapeutic massage and bodywork. She is a Certified Advanced Practitioner in Sensorimotor Psychotherapy and has advanced training and 25+ years of experience in diverse somatic therapies including Craniosacral Therapy, Energetic Osteopathy, Oncology massage and Aromatherapy. Rachel She is the co-founder of the Embodied Recovery model and the Embodied Recovery Institute in Durham, NC. provides ongoing training and supervision to clinical and support staff in the programmatic implementation of the Embodied Recovery model. In her private practice in Chapel Hill, NC, Rachel works with trauma, eating disorders, and dissociative disorders.\n\n \nTU99 Shownotes (are these not awesome or what? Patrons help us be able to do this, thank you you know who you are.)\nTypical Treatment Model\nBio-Psychosocial model\n\n \tBio: has been usage of pharmacology, re-feeding, nutritional rehabilitation, and yoga\n \tPsycho part has been education about emotion and emotional tolerance, dialectical behavioral therapy, supportive therapies to support emotional processing and cognitive distortions, cognitive behavioral treatment to address the distortions, and then try to change the behaviors by changing the cognitions,\n \tSocial part: family and dynamics around having a place of belonging and one’s sense of belonging in the world, the culture, & the family\n \tUsually a treatment team: dietician, a therapist, family therapist, a psychiatrist, a physician\n\nTypical View of Recovery\n\n \tGoal: to get somebody to eat a prescribed amount of nutritional food in order to achieve a range of BMI or body size or shape\n \teat it in what we call a normative style, which is a very relative term\n \tFocus is on how behaviors are a response to an attitude towards the body itself\n\nWhat’s Missing?\n\n \tBeing curious about what the body is saying and expressing through the eating disorder behaviors\n\nShifting the Perspective: The Embodied Recovery Model\nThe Embodied Recovery Model is Somato–Psycho-Social. It expands the role of the body to include anatomy, physiology, kinesiology, movement, and posture.\nThe 5 Core Principles of the Embodied Recovery Model\nThe 5 Core Principles facilitate the intersection between somatic organization, subjective experience of self, and basic human needs for attachment and defense.\nShifting from bio-psycho-social model to somato-psycho-social model.\nDirectly resourcing the body so that it becomes a resource in recovery rather than an obstacle to recovery.\nCollaborate with the body at the physiological level to support the infrastructures that govern emo...",
  "enclosure": "",
  "itunes:subtitle": "What if we flipped the script and learned to see our body as a messenger that needs to be heard rather than an obstacle to be conquered when it comes to our relationship with food? When we take physiological perspective,",
  "itunes:summary": "What if we flipped the script and learned to see our body as a messenger that needs to be heard rather than an obstacle to be conquered when it comes to our relationship with food?  Using a somato-psychosocial model, we learn that the body has much to say not only about food but also emotional regulation and our basic human needs for attachment and defense.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "1:01:18"
}