{
  "title": "Asia: Supply Chain Woes, and Opportunities",
  "description": "<p>Stress on supply chains has driven a slowdown in globalization, but there are also investment opportunities emerging, particularly in Asia. Head of Public Policy Research and Municipal Strategy Michael Zezas and Asia and Emerging Markets Equity Strategist Daniel Blake discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Michael Zezas:</strong> Welcome to Thoughts on the Market. I'm Michael Zezas, Head of Public Policy Research and Municipal Strategy for Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> And I'm Daniel Blake from Morgan Stanley's Asia and Emerging Markets Equity Strategy Team.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And on this episode of Thoughts on the Market, we'll continue our discussion of a theme that's been rightfully getting a lot of attention - \"slowbalization\", slowing globalization within an ever more multipolar world. It's Wednesday, May 25th, at 8 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So Daniel, over the last few years, Morgan Stanley Research has published a lot of collaborative work across regions and sectors on the increasingly important themes of slowbalization and the multipolar world. But while in the past we focused more on the costs and challenges of this transition, today we want to put a greater emphasis on the opportunities from this theme, particularly in Asia. Investors are acutely aware that one of the key drivers behind this slowbalization trend is the tremendous disruption to the supply chain. You've been publishing a supply chain choke point tracker tool, so maybe let's start there with an update on the current state of supply chains in Asia and what your most recent tracker is indicating.&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> Thanks, Mike. In short, this is showing that the supply chain in general remains very stressed. And in aggregate, we have not seen any material improvement over the last six weeks. Now, when we look at the aggregate measure put together by our economists, the Morgan Stanley Supply Chain Conditions Index, we are seeing that conditions are still slightly better than the peak of the disruptions and backlogs that occurred in late 2021, particularly around the delta wave in South East Asia. But we haven't seen much further improvement beyond that. Our checkpoint tracker does go down to the individual component or service level, and it shows that supply of certain auto and industrial semis and advanced packaging remains a constraint on downstream production. And we are seeing that show up in corporate results in the tech sector as well as the broader impact on margins that we're seeing into the consumer space.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And one of the pressing issues that investors have been paying attention to is the new shocks to supply chains from China's COVID containment policy. Can you give us an update on the current impact of this policy?</p><p><br></p><p><strong>Daniel Blake:</strong> Now, so far, this is having a more noticeable impact on the domestic Chinese economy rather than on export markets, with policymakers trying to prioritize industrial output through systems such as closed loop management, which sees workers living on site for extended periods to maintain as much production as possible. The challenge has been most acute where mobility is needed, including in the transportation of raw materials and industrial production within China. Geographically, we've seen the impact on the Pearl River Delta around Shenzhen, the Yangtze River Delta around Shanghai and neighboring provinces, and more recently the capital, Beijing, is seeing an outbreak. So progress has been made on reopening from full lockdowns in Shenzhen and Shanghai gradually, but our China economics team still estimate that about 25% of national GDP is being subject to some additional COVID restrictions. And again, we need to watch out for the progression of the outbreak closely.</p><p><br></p><p><strong>Michael Zezas:</strong> When do you expect to see an easing of supply chain choke points and what factors could drive that easing?&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> One of the points in the blue paper from late 2021 was the role on the demand side, the generous stimulus and acute shifts in spending patterns from COVID had in driving demand well above the world's productive capacity, even before you consider the supply disruptions we're seeing. So heading into summer 2022, we get the flip side, which is what our consumer analysts call the great reversion. Stimulus rolls off, fiscal spending does taper, and we see spending returning to categories like travel and tourism and leisure, as opposed to demand for goods and electronics. That may mean we get an outright contraction in some product segments. Now, this downturn may not be the best way, but it's the probably quickest way to get to an easing of supply chain choke points. And we are getting more evidence of this in order cuts across PC and smartphone in Asia. On the more constructive side, we're also seeing CapEx coming into areas like driving edge semiconductor foundry. But we'll also need to watch commodity markets, particularly as we've got agricultural trade channels into the European summer looking highly stressed. And we're seeing policy responses in some markets that are looking to prioritize domestic demand for industrial output and for agricultural output over export markets. So we don't think we're through the worst of this just yet. So we really need to watch for conditions to improve potentially later in 2022.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Now let's zero in for a moment on some sector level observations. Semiconductors, for example, has been one of the sectors most in focus in the context of slowbalization. Can you talk about some of the particular challenges semis are facing in East Asia?&nbsp;</p><p><br></p><p><strong>Daniel Blake: </strong>There really are two dimensions, I think to this. One is the centrality of semiconductor companies at the leading edge and the concentration of global production in several key markets, and in particular in Taiwan and Korea. Now, when we look at the challenges here we can see policymakers in major capitals, in D.C. and Beijing, looking to try to encourage more localization, more internalization of supply chains. And that's putting some pressure, but also creating incentives for companies to add new capacity into the U.S., and we're seeing capacity coming into the Japanese market as well. So the challenge and opportunity I think for these leading companies is to try to manage those pressure points and protect return on invested capital as much as possible in the face of the need to strengthen and secure additional capacity in supply chains. The other element, which is important in terms of the challenges for semis, is more cyclical and we have seen a surge in demand, we've seen a build up of margins in the industry as it has benefited from this pull forward, from the work from home spending. And on the other side of that, we are going to see a downturn which is potentially exacerbated by the inventory buildup that has happened across the board in semis. Some semiconductor components are still in acute supply, but there are many that are not so disrupted, and when we look at the outlook we have seen inventory build up across the board. The risk is in the downturn, we start to see deeper order cuts because the inventory in aggregate is actually higher than what we've seen historically.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Now shifting towards some macro level takeaways. The dynamic between the U.S. and China could be challenging, but is also creating potential opportunities for other countries such as Vietnam, India and Indonesia. Can you walk us through the tailwinds as well as the headwinds for these countries and what they're doing to take advantage of the situation?&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> Yes, in Asia-Pacific, we have seen Vietnam already playing an important role for corporates as a complement to Chinese supply chains. It's smaller, but it's a natural extension of existing production facilities in China. But we've also seen policy and corporate momentum, the reform story, improving most notably in India, but also improving in Indonesia. And both markets have enacted quite deep and broad reform programs to lower corporate tax rates, to liberalize foreign direct investment rules, to invest in infrastructure and generally to make their market more attractive for multinational corporates as they're reassessing their supply chain strategy and looking to diversify. In terms of our preferences we are currently overweight Indonesia right now in our Asia Pacific, ex-Japan and Emerging Markets rankings. It benefits from strong commodity export dynamics and we also see long term opportunities coming through in terms of supply chain investments in Indonesia. But India has a very attractive long run story. If we can see continued execution, this market will present both domestic and export opportunities, and the production linked incentives being offered have been taken up by corporates and are helping to drive this foreign direct investment cycle.&nbsp;</p><p><br></p><p><strong>Michael Zezas: </strong>Daniel, thanks for taking the time to talk. It was great to have you here in person.&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> Great speaking with you, Michael.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And thanks for listening. For a look inside some of the human impacts of the recent supply chain disruptions, and how people are trying to resolve them, check out the latest season of Morgan Stanley's podcast \"Now, What's Next?\" on your podcast app of choice. If you enjoyed this show, please share Thoughts on the Market with a friend or colleague, or leave us a review on Apple Podcasts. It helps more people find the show.&nbsp;</p>",
  "itunes:title": "Asia: Supply Chain Woes, and Opportunities",
  "itunes:episodeType": "full",
  "itunes:episode": 624,
  "itunes:summary": "Stress on supply chains has driven a slowdown in globalization, but there are also investment opportunities emerging, particularly in Asia. Head of Public Policy Research and Municipal Strategy Michael Zezas and Asia and Emerging Markets Equity Strategist Daniel Blake discuss.",
  "content:encoded": "<p>Stress on supply chains has driven a slowdown in globalization, but there are also investment opportunities emerging, particularly in Asia. Head of Public Policy Research and Municipal Strategy Michael Zezas and Asia and Emerging Markets Equity Strategist Daniel Blake discuss.</p><p><br></p><p>-----Transcript-----</p><p><br></p><p><strong>Michael Zezas:</strong> Welcome to Thoughts on the Market. I'm Michael Zezas, Head of Public Policy Research and Municipal Strategy for Morgan Stanley.&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> And I'm Daniel Blake from Morgan Stanley's Asia and Emerging Markets Equity Strategy Team.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And on this episode of Thoughts on the Market, we'll continue our discussion of a theme that's been rightfully getting a lot of attention - \"slowbalization\", slowing globalization within an ever more multipolar world. It's Wednesday, May 25th, at 8 a.m. in New York.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> So Daniel, over the last few years, Morgan Stanley Research has published a lot of collaborative work across regions and sectors on the increasingly important themes of slowbalization and the multipolar world. But while in the past we focused more on the costs and challenges of this transition, today we want to put a greater emphasis on the opportunities from this theme, particularly in Asia. Investors are acutely aware that one of the key drivers behind this slowbalization trend is the tremendous disruption to the supply chain. You've been publishing a supply chain choke point tracker tool, so maybe let's start there with an update on the current state of supply chains in Asia and what your most recent tracker is indicating.&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> Thanks, Mike. In short, this is showing that the supply chain in general remains very stressed. And in aggregate, we have not seen any material improvement over the last six weeks. Now, when we look at the aggregate measure put together by our economists, the Morgan Stanley Supply Chain Conditions Index, we are seeing that conditions are still slightly better than the peak of the disruptions and backlogs that occurred in late 2021, particularly around the delta wave in South East Asia. But we haven't seen much further improvement beyond that. Our checkpoint tracker does go down to the individual component or service level, and it shows that supply of certain auto and industrial semis and advanced packaging remains a constraint on downstream production. And we are seeing that show up in corporate results in the tech sector as well as the broader impact on margins that we're seeing into the consumer space.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And one of the pressing issues that investors have been paying attention to is the new shocks to supply chains from China's COVID containment policy. Can you give us an update on the current impact of this policy?</p><p><br></p><p><strong>Daniel Blake:</strong> Now, so far, this is having a more noticeable impact on the domestic Chinese economy rather than on export markets, with policymakers trying to prioritize industrial output through systems such as closed loop management, which sees workers living on site for extended periods to maintain as much production as possible. The challenge has been most acute where mobility is needed, including in the transportation of raw materials and industrial production within China. Geographically, we've seen the impact on the Pearl River Delta around Shenzhen, the Yangtze River Delta around Shanghai and neighboring provinces, and more recently the capital, Beijing, is seeing an outbreak. So progress has been made on reopening from full lockdowns in Shenzhen and Shanghai gradually, but our China economics team still estimate that about 25% of national GDP is being subject to some additional COVID restrictions. And again, we need to watch out for the progression of the outbreak closely.</p><p><br></p><p><strong>Michael Zezas:</strong> When do you expect to see an easing of supply chain choke points and what factors could drive that easing?&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> One of the points in the blue paper from late 2021 was the role on the demand side, the generous stimulus and acute shifts in spending patterns from COVID had in driving demand well above the world's productive capacity, even before you consider the supply disruptions we're seeing. So heading into summer 2022, we get the flip side, which is what our consumer analysts call the great reversion. Stimulus rolls off, fiscal spending does taper, and we see spending returning to categories like travel and tourism and leisure, as opposed to demand for goods and electronics. That may mean we get an outright contraction in some product segments. Now, this downturn may not be the best way, but it's the probably quickest way to get to an easing of supply chain choke points. And we are getting more evidence of this in order cuts across PC and smartphone in Asia. On the more constructive side, we're also seeing CapEx coming into areas like driving edge semiconductor foundry. But we'll also need to watch commodity markets, particularly as we've got agricultural trade channels into the European summer looking highly stressed. And we're seeing policy responses in some markets that are looking to prioritize domestic demand for industrial output and for agricultural output over export markets. So we don't think we're through the worst of this just yet. So we really need to watch for conditions to improve potentially later in 2022.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Now let's zero in for a moment on some sector level observations. Semiconductors, for example, has been one of the sectors most in focus in the context of slowbalization. Can you talk about some of the particular challenges semis are facing in East Asia?&nbsp;</p><p><br></p><p><strong>Daniel Blake: </strong>There really are two dimensions, I think to this. One is the centrality of semiconductor companies at the leading edge and the concentration of global production in several key markets, and in particular in Taiwan and Korea. Now, when we look at the challenges here we can see policymakers in major capitals, in D.C. and Beijing, looking to try to encourage more localization, more internalization of supply chains. And that's putting some pressure, but also creating incentives for companies to add new capacity into the U.S., and we're seeing capacity coming into the Japanese market as well. So the challenge and opportunity I think for these leading companies is to try to manage those pressure points and protect return on invested capital as much as possible in the face of the need to strengthen and secure additional capacity in supply chains. The other element, which is important in terms of the challenges for semis, is more cyclical and we have seen a surge in demand, we've seen a build up of margins in the industry as it has benefited from this pull forward, from the work from home spending. And on the other side of that, we are going to see a downturn which is potentially exacerbated by the inventory buildup that has happened across the board in semis. Some semiconductor components are still in acute supply, but there are many that are not so disrupted, and when we look at the outlook we have seen inventory build up across the board. The risk is in the downturn, we start to see deeper order cuts because the inventory in aggregate is actually higher than what we've seen historically.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> Now shifting towards some macro level takeaways. The dynamic between the U.S. and China could be challenging, but is also creating potential opportunities for other countries such as Vietnam, India and Indonesia. Can you walk us through the tailwinds as well as the headwinds for these countries and what they're doing to take advantage of the situation?&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> Yes, in Asia-Pacific, we have seen Vietnam already playing an important role for corporates as a complement to Chinese supply chains. It's smaller, but it's a natural extension of existing production facilities in China. But we've also seen policy and corporate momentum, the reform story, improving most notably in India, but also improving in Indonesia. And both markets have enacted quite deep and broad reform programs to lower corporate tax rates, to liberalize foreign direct investment rules, to invest in infrastructure and generally to make their market more attractive for multinational corporates as they're reassessing their supply chain strategy and looking to diversify. In terms of our preferences we are currently overweight Indonesia right now in our Asia Pacific, ex-Japan and Emerging Markets rankings. It benefits from strong commodity export dynamics and we also see long term opportunities coming through in terms of supply chain investments in Indonesia. But India has a very attractive long run story. If we can see continued execution, this market will present both domestic and export opportunities, and the production linked incentives being offered have been taken up by corporates and are helping to drive this foreign direct investment cycle.&nbsp;</p><p><br></p><p><strong>Michael Zezas: </strong>Daniel, thanks for taking the time to talk. It was great to have you here in person.&nbsp;</p><p><br></p><p><strong>Daniel Blake:</strong> Great speaking with you, Michael.&nbsp;</p><p><br></p><p><strong>Michael Zezas:</strong> And thanks for listening. For a look inside some of the human impacts of the recent supply chain disruptions, and how people are trying to resolve them, check out the latest season of Morgan Stanley's podcast \"Now, What's Next?\" on your podcast app of choice. If you enjoyed this show, please share Thoughts on the Market with a friend or colleague, or leave us a review on Apple Podcasts. It helps more people find the show.&nbsp;</p>",
  "guid": "gid://art19-episode-locator/V0/l3xVWe1q8z4k52-nFrJgo0LfpUVSLlwlimY1KmwrCM0",
  "pubDate": "Wed, 25 May 2022 21:46:25 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "supply-chain,market-trends",
  "itunes:duration": "00:07:52",
  "enclosure": ""
}