{
  "title": "493 - Development Impact Bonds—An Innovative Approach to Financing Global Public Health Projects",
  "itunes:title": "493 - Development Impact Bonds—An Innovative Approach to Financing Global Public Health Projects",
  "pubDate": "Mon, 18 Jul 2022 10:00:00 +0000",
  "guid": "b1d828f7-f023-4fdf-a62c-0697768783ba",
  "link": "https://johnshopkinssph.libsyn.com/493-development-impact-bondsan-innovative-approach-to-financing-global-public-health-projects",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Nonprofits or NGOs often find themselves limited by the terms of available grants, which may be insufficient or too short-term to meet certain needs. Enter development impact bonds, or investments made by a little-known government agency.</span> <strong>Dia Martin</strong><span style= \"font-weight: 400;\">, a managing director on the social enterprise finance team of the US International Development Finance Corporation talks with</span> <strong>Dr. Josh Sharfstein</strong> <span style=\"font-weight: 400;\">about these bonds, and two initial projects: a cataract clinic in Cameroon and micro-enterprises for Syrian refugees in Jordan and Lebanon.</span></p>",
  "content:encoded": "<p>Nonprofits or NGOs often find themselves limited by the terms of available grants, which may be insufficient or too short-term to meet certain needs. Enter development impact bonds, or investments made by a little-known government agency. Dia Martin, a managing director on the social enterprise finance team of the US International Development Finance Corporation talks with Dr. Josh Sharfstein about these bonds, and two initial projects: a cataract clinic in Cameroon and micro-enterprises for Syrian refugees in Jordan and Lebanon.</p>",
  "enclosure": "",
  "itunes:duration": "15:33",
  "itunes:explicit": false,
  "itunes:keywords": "lebanon,enterprise,Government,finance,Nonprofit,syria,bonds,NGO,joran",
  "itunes:subtitle": "Nonprofits or NGOs often find themselves limited by the terms of available grants, which may be insufficient or too short-term to meet certain needs. Enter development impact bonds, or investments made by a little-known government agency. Dia Martin,...",
  "itunes:season": 6,
  "itunes:episode": 493,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}