{
  "title": "Best letter-to-the-editor ever (Tocqueville and Algeria)",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/25/best-letter-to-the-editor-ever-tocqueville-and-algeria/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/25/best-letter-to-the-editor-ever-tocqueville-and-algeria/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Tue, 25 Oct 2022 13:01:53 +0000",
  "category": "Sociology",
  "guid": "https://statmodeling.stat.columbia.edu/?p=47957",
  "description": "From the London Review of Books, 7 July 2022: William Davies writes that Alexis de Tocqueville ‘paid little attention to the French colonisation of Algeria’. In fact, Tocqueville was regarded as the National Assembly’s leading expert on Algeria and made &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/25/best-letter-to-the-editor-ever-tocqueville-and-algeria/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>From the <a href=\"https://www.lrb.co.uk/the-paper/v44/n11/william-davies/destination-unknown\">London Review of Books</a>, 7 July 2022:</p>\n<blockquote><p>William Davies writes that Alexis de Tocqueville ‘paid little attention to the French colonisation of Algeria’. In fact, Tocqueville was regarded as the National Assembly’s leading expert on Algeria and made two visits to the country in 1841 and 1846, during the army’s counterinsurgency against a rebellion led by the Emir Abdel-Kader. He was also an impassioned advocate for Algeria’s violent colonisation. In his 1841 report on Algeria, he wrote: ‘I believe that the right of war authorises us to ravage the country and that we must do it, either by destroying harvests during the harvest season, or year-round by making those rapid incursions called razzias, whose purpose is to seize men or herds.’ While many of his fellow liberals ‘find it wrong that we burn harvests, that we empty silos, and finally that we seize unarmed men, women and children’, he felt that ‘these, in my view, are unfortunate necessities, but ones to which any people who want to wage war on the Arabs are obliged to submit.’ He advocated total war to defeat the insurrection, followed by the creation of a settler-colony, because ‘until we have a European population in Algeria, we shall never establish ourselves there [in Africa] but shall remain camped on the African coast. Colonisation and war, therefore, must proceed together.’ His brazen imperialism went hand in hand with his liberalism.</p>\n<p>Adam Shatz</p></blockquote>\n<p>Wow.  Davies really got that one wrong!</p>\n<p>History is full of twists of turns, and we shouldn&#8217;t be too harsh on Davies for making that one mistake in this long review&#8212;he was writing about a topic he knew nothing about, and he didn&#8217;t think to google *Tocqueville Algeria*.  Understandable:  you can&#8217;t get around to googling everything.</p>\n<p>I do think, though, that it would be gracious of him to respond to that letter with a brief, &#8220;Sorry, my bad,&#8221; and for the LRB to publish this response.  Just publishing the letter without an acknowledgment . . . that&#8217;s the kind of thing you&#8217;d do when there&#8217;s a difference of opinion, not a blatant factual error.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/25/best-letter-to-the-editor-ever-tocqueville-and-algeria/feed/",
  "slash:comments": 3
}