{
  "title": "#473: Dumbledore v Voldemort (OOTP 36, The Only One He Ever Feared)",
  "link": "https://audioboom.com/posts/7631177",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4440,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Our next Quizzitch Live will be Tuesday, July 21 - An installment themed around the Deathly Hallows book!</li>\n<li>Muggle Mail covers Kreacher, the Department of Mysteries, The Veil, Lupin and more!</li>\n<li>Which came first, the Ministry or The Veil? Listeners weigh in with their thoughts!</li>\n<li>We debut a new game... Guess. That. Book!</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix – Chapter 36: The Only One He Ever Feared</li>\n<li>7-Word Summary: Voldemort is trying to kill Harry Potter</li>\n<li>Neville consoles Harry following Sirius' death</li>\n<li>The Cruciatus Curse: can Harry actually perform it?</li>\n<li>What factors into one's ability to cast an Unforgivable Curse? Intent? Age? Character?</li>\n<li>Bella, Bella, Bella!</li>\n<li>Dumbledore vs. Voldemort... and the entrances fans have always wanted!</li>\n<li>What does Dumbledore mean by \"we both know there are other ways of destroying a man?\" Is it a hint towards Horcruxes or his own personal life struggles?</li>\n<li>The Symbolism of the Fountain of Magical Brethren</li>\n<li>How does Dumbledore’s magic work both in the Death Chamber and in the Atrium?</li>\n<li>Fudge's downfall</li>\n<li>The hosts make some fun comparisons between the book and the movie!</li>\n<li>MVP of the Week and Rename The Chapter</li>\n<li>Quizzitch: What does Phineas Nigellus Black call Sirius when Dumbledore tells him he's dead?</li>\n<li>This week's episode is brought to you by BeachBody On Demand (text 'mugglecast' to 30-30-30 for a free trial!), <a href=\"http://www.hellofresh.com/muggle80\">HelloFresh</a> (get $80 off your first box by using code 'muggle80') and <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (get 15% off your first order by using the link!). Support MuggleCast by supporting our sponsors!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week we discuss whether or not Fantastic Beasts is the <a href=\"https://ew.com/movies/fantastic-beasts-franchise-future-jk-rowling/?utm_source=twitter.com&utm_medium=social&utm_campaign=social-share-article\">world's most problematic film franchise</a>!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 14 Jul 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-07-13:/posts/7631177",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}