{
  "title": "Russia Annexes Nuclear Station, Invites Sanctions",
  "link": "https://spectrum.ieee.org/zaporizhzhia-nuclear-power-plant-putin",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-person-holding-a-gun-in-foreground-with-a-building-in-the-background.jpg?id=31886862&width=1245&height=700&coordinates=0%2C4%2C0%2C5\"/><br/><br/><p>A few hours after polls closed for “referenda” in Ukraine’s occupied oblasts last month, Russia-installed officials in Ukraine’s Zaporizhzhia <a href=\"https://en.wikipedia.org/wiki/Oblasts_of_Ukraine\" target=\"_blank\">oblast</a> reported that <a href=\"https://web.archive.org/web/20220927194634/https://www.pbs.org/newshour/world/pro-moscow-officials-say-one-occupied-area-of-ukraine-has-voted-to-join-russia\" target=\"_blank\">93.11 percent of votes cast there favored annexation</a>. Within days Moscow had officially absorbed Zaporizhzhia into the Russian Federation and Russian president Vladimir Putin had declared the region’s embattled nuclear power plant—Europe’s largest—to be Russian property.<br/></p><p>Never mind that a recent telephone survey of adults in Energodar, the city built to house Zaporizhzhia’s nuclear power staff, found only 6 percent support for joining Russia, <a href=\"http://xn--ukrainian%20nuclear%20power%20firm%20energoatoms%20claim%20that%20only%206%25%20of-3d26c/\" target=\"_blank\">according to Ukrainian nuclear power firm Energoatom</a>. Or that Ukrainian forces control over a quarter of the region, including its capital. Or the referendum’s hasty organization, and reports of voter intimidation and other elections irregularities. </p><p class=\"pull-quote\">Ukrainian president Volodymyr Zelenskyy insists that both Ukraine and Europe need the huge plant’s 6-gigawatt generating capacity to stay warm this winter. </p><p>In the three other oblasts that held referenda last month, subsequent gains by Ukrainian forces contradict Russia’s claims to tighter control. Not so in Zaporizhzhia. Battle lines there are static, thanks to the vulnerable nuclear reactors and spent nuclear fuel standing in the way of any Ukrainian counteroffensive. And actions implementing Putin’s orders have intensified the quandaries facing the several thousand employees still there working to prevent a catastrophic accident:</p><hr/><ul><li>Immediately after last month’s vote, Russian forces detained plant director Ihor Murashov, released video of him saying he worked for Ukraine’s state security service, and then <a href=\"https://ua.interfax.com.ua/news/general/862921.html\" target=\"_blank\">expelled him from Russian-held territory</a>.</li><li>Rosatom, Russia’s state-owned nuclear energy conglomerate, created a subsidiary to absorb the plant and named its own plant director—even as Energoatom CEO Petro Kotin declared himself the new director and said workers should continue following orders from Kyiv.</li><li>Reports emerged of Rosatom officials <a href=\"https://infoatom.news/2022/10/01/011020221101\" target=\"_blank\">pressuring plant personnel</a>, hitherto paid by Energoatom, to sign on as Rosatom employees or face military conscription. </li></ul><p>Energoatom, meanwhile, complicated the situation last week by ordering the plant to restart power generation, three-and-a-half weeks after Energoatom put Zaporizhzhia’s last operating reactors into cold shutdown <a href=\"https://spectrum.ieee.org/nuclear-energy-brinkmanship-in-ukraine\" target=\"_self\">at the insistence of Ukrainian nuclear safety experts</a>. Missile strikes had repeatedly knocked out transmission lines powering safety systems until the plant shut down.</p><p class=\"pull-quote\">“Rosatom [Russia’s state-owned nuclear energy conglomerate] has basically been exempt from the sanctions because Rosatom has cornered the market. They’re one of the few companies worldwide that control the entire nuclear fuel cycle.”<br/>—Sonja Schmid, Virginia Tech</p><p>“Ambiguity about the command-and-control chain” makes the embattled facility’s security even more precarious according to <a href=\"https://www.iaea.org/newscenter/pressreleases/iaea-director-general-grossi-and-ukrainian-president-zelensky-meet-in-kyiv-discuss-situation-at-znpp\" target=\"_blank\">a statement last week by Rafael Grossi</a>, director general of the International Atomic Energy Agency (IAEA). Grossi noted the “enormous pressure” on staff, who face “extremely difficult” decisions for themselves and their families in the face of Rosatom’s and Energoatom’s conflicting demands. </p><p>In a highly unusual move, Grossi also took a side in the conflict for the first time since Russian forces seized Zaporizhzhia in March. Grossi <a href=\"https://www.reuters.com/world/europe/iaea-chief-zaporizhzhia-nuclear-power-plant-is-ukrainian-facility-2022-10-06/\" target=\"_blank\">told reporters in Kyiv</a> that “the position of the IAEA is that this facility is a Ukrainian facility.”</p><p>Putin’s land and facility grabs may also force the United States, the European Union, and other nations to do something new: extend their regime of sanctions against Russian citizens and businesses to include Rosatom. Russia’s nuclear giant dominates the global uranium supply chain and is building more than a dozen nuclear power plants, including reactors in Turkey, Hungary, India, and Bangladesh. </p><p>Olga Kosharna, a nuclear-safety expert and former advisor to Ukraine’s nuclear regulator, said Rosatom’s international projects are a crucial pressure point to force Russia to demilitarize Europe’s largest nuclear power plant. As she put it during a public briefing last week, “only sanctions and only the collapse of Rosatom’s projects to build nuclear power plants abroad can somehow stop this madness.”</p><h2>Who’s in Command in Zaporizhzhia? </h2><p>The heightened tensions at Zaporizhzhia shattered a month of relative calm there. While detonation of Russian landmines <a href=\"http://by%20wild%20boars,%20dogs%20or%20foxes.\" target=\"_blank\">attributed to wild boars, dogs, and foxes</a> still rattled the plant, missile and mortar attacks ceased when the last reactors were turned off on 11 September. Nuclear threats to Ukraine did not stop, but shifted elsewhere. On 19 September missiles <a href=\"https://www.cbc.ca/news/world/ukraine-russia-missile-nuclear-plant-1.6587546\" target=\"_blank\">exploded 300 meters from Energoatom’s South Ukraine Nuclear Power Plant</a>. And Russian officials ratcheted up talk of using nuclear weapons in Ukraine.</p><p>Ukrainian experts have argued that restarting fission reactions and power generation at Zaporizhzhia would once again inspire Russian forces to use it for blackmail and intimidation. That prediction was affirmed early Saturday when a missile strike knocked the entire plant off the grid, forcing it to rely yet again on diesel generators to cool its reactors and spent fuel for almost 48 hours.</p><p>Still, Ukrainian president Volodymyr Zelenskyy insists that both Ukraine and Europe need the huge plant’s 6-gigawatt generating capacity to stay warm this winter. Energoatom’s Kotin added further justification last week, <a href=\"https://apnews.com/article/russia-ukraine-kyiv-science-climate-and-environment-cb13338afce133cd9fc39f78200393a6\" target=\"_blank\">telling the Associated Press</a> that Zaporizhzhia needed to restart to keep safety-critical equipment from freezing. </p><p class=\"pull-quote\">France’s opposition to sanctions may be the hardest to overcome, according to one source <em>Spectrum </em>consulted, since its nuclear industry is most tightly entwined with Rosatom.</p><p>A Ukrainian nuclear-safety expert, speaking anonymously because they are not authorized to discuss the topic on the record, told <em>IEEE Spectrum </em>that weather predictions did not support Kotin’s argument, and said operating reactors in a war zone was a far greater risk. Reactors in “cold” shutdown are roughly 70 °C, versus 320 °C in operation.</p><p><em>IEEE Spectrum</em> asked Rosatom whether restarting the plant was safe, but did not receive a reply by press time. Calls to a number attributed to the plant’s Rosatom-appointed director, Oleg Romanenko, did not go through. </p><p>Romanenko was previously the chief engineer at <a href=\"https://www.rosenergoatom.ru/en/npp/balakovo-npp/\" target=\"_blank\">Rosatom’s Balakovo power station</a>, roughly 900 kilometers southeast of Moscow. It has four Soviet-designed VVER-1000 nuclear-power units similar to the six at Zaporizhzhia. He was one of 11 Rosatom employees sent to Zaporizhzhia in March. </p><p>The <a href=\"https://myrotvorets.center/\" target=\"_blank\">Myrotvorets Center</a>, a civil-society group based in Langley, Va., and Warsaw that tracks alleged Russian militants, war criminals and collaborators in Ukraine, <a href=\"https://myrotvorets.center/criminal/romanenko-oleg-evgenevich/\" rel=\"noopener noreferrer\" target=\"_blank\">lists Romanenko</a> as a “Russian war criminal” and a “nuclear terrorist.”</p><h2>Nuclear Sanctions</h2><p>Russian officials show no sign of concern about accusations of war crimes committed in Ukraine. However, they have shown sensitivity about accusations that Rosatom—one of the Kremlin’s corporate crown jewels—is directly involved in the war in Ukraine, according to Mykhailo Gonchar, president of the Kyiv-based Centre for Global Studies Strategy XXI. The Ukrainian national-security expert argues that Russia fears imposition of Western sanctions on Rosatom. </p><p>In a brief to <em>IEEE Spectrum</em> last week, Gonchar notes repeated denials in past months that Rosatom was involved in running the Zaporizhzhia power plant, such as <a href=\"https://euobserver.com/opinion/155819\" target=\"_blank\">a 19 August 2022 statement</a>: “We categorically deny any involvement of Rosatom or any of its employees in the management or operations of the plant at any level.” </p><p>So far Western sanctions have broadly hit Russia’s economy, and they have ratcheted up eight times since February, as seen in <a href=\"https://www.consilium.europa.eu/en/policies/sanctions/restrictive-measures-against-russia-over-ukraine/history-restrictive-measures-against-russia-over-ukraine/\" rel=\"noopener noreferrer\" target=\"_blank\">this timeline of European sanctions since 2014</a>. But they’ve spared Rosatom. “Rosatom has basically been exempt from the sanctions because Rosatom has cornered the market. They’re one of the few companies worldwide that controls the entire nuclear fuel cycle,” says Sonja Schmid, an associate professor in Virginia Tech’s department of science, technology, and society and author of a <a href=\"https://direct.mit.edu/books/book/3404/Producing-PowerThe-Pre-Chernobyl-History-of-the\" target=\"_blank\">2015 book on the Soviet nuclear-energy industry</a>. </p><p>Gonchar, however, says Putin’s moves last week implicating Rosatom in Zaporizhzhia increase pressure on Western governments to override concerns from nuclear-energy-industry lobbyists.</p><p>France may be the hardest to win over, says Gonchar, since its nuclear industry is most tightly entwined with Rosatom. All of the country’s major nuclear equipment and services firms—including EDF, Framatome, Alstom, and Orano—have partnerships with Rosatom. And just before Russia’s February 2022 invasion, EDF agreed to buy General Electric’s French turbine business (known by the French acronym GEAST) in collaboration with Rosatom, which is the operation’s biggest customer.</p><p>Gonchar says blocking Rosatom’s access to GEAST would hit Russia hard, since only GEAST and Ukrainian state-owned Turboatom manufacture the steam turbines Rosatom needs for its international nuclear projects.</p><p>U.S. nuclear lobbyists such as <a href=\"https://www.eenews.net/articles/how-russias-invasion-is-affecting-u-s-nuclear/\" rel=\"noopener noreferrer\" target=\"_blank\">the Washington, D.C.-based Nuclear Energy Institute</a> have opposed sanctions on the grounds that they would boost nuclear fuel costs and thus raise power rates. In the United States alone, Rosatom subsidiaries have contracts to supply US $6.5 billion of uranium and its derivatives through 2028. </p><p>However, Gonchar says the impact on consumers is easily overstated. Nuclear power plants refuel only every 18 or 24 months, and then only to replace one-third of their reactors’ fuel. He notes that projections by independent experts in the United States suggest that even a doubling of fuel prices would increase nuclear power costs less than 3 percent.</p><p>And the industry is making moves to shift away from Russian fuel supplies. Industry news source <a href=\"https://www.spglobal.com/commodityinsights/en/market-insights/blogs/electric-power/070722-global-nuclear-fuel-supply-chain-uranium-russia-ukraine-war\" target=\"_blank\">Platts</a> reported that by nuclear industry standards, change was already “exceedingly fast” by July.</p>",
  "pubDate": "Mon, 10 Oct 2022 16:36:14 +0000",
  "guid": "https://spectrum.ieee.org/zaporizhzhia-nuclear-power-plant-putin",
  "category": [
    "Ukraine conflict",
    "Ukraine",
    "Russia",
    "Nuclear power",
    "Nuclear energy"
  ],
  "dc:creator": "Peter Fairley",
  "media:content": ""
}