{
  "title": "Yemen and Its Neighbors, with Annelle Sheline",
  "description": "<p>This week I’m very pleased to welcome back Annelle Sheline, research fellow at the Quincy Institute and scholar of the Arab world. She’s written a <a target=\"_blank\" href=\"https://foreignpolicy.com/2021/06/03/houthis-saudi-arabia-biden-yemen-policy-backward/\">new piece</a> for <em>Foreign Policy</em> titled “Washington Has Yemen Policy Backwards,” in which she discusses the need for a new framework for peace talks that recognizes the reality of the Houthi victory. We’ll talk about the flaws in the old framework, based on UN Security Council Resolution 2216, and what she makes of the Biden administration’s handling of the Yemen war thus far. We’ll also get into some regional issues, in particular efforts by the UAE and Saudi Arabia to carve off chunks of Yemen for their own aims and the recent economic turmoil in Oman.</p><p>Annelle is a Research Fellow in the Middle East program at the Quincy Institute and an expert on religious and political authority in the Middle East and North Africa. She was previously the Zwan Postdoctoral Fellow at Rice University’s Baker Institute for Public Policy and has worked as a journalist in Egypt and Yemen. In addition to academic writing, she was written for <em>The Washington Post</em>, <em>The Nation</em>, <em>Foreign Policy</em>, <em>Politico</em>, <em>The National Interest</em>, and <em>The Globe Post, </em>and her analysis has been published by the Carnegie Endowment for International Peace, The Arab Gulf States Institute of Washington, Georgetown University’s Berkley Center for Religion, Peace & World Affairs, and the Baker Institute.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/yemen-and-its-neighbors-with-annelle",
  "guid": "substack:post:37400699",
  "dc:creator": "Derek Davison",
  "pubDate": "Wed, 09 Jun 2021 17:46:56 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 5040,
  "itunes:image": ""
}