{
  "id": "yt:video:ECP9Qq8M9Yk",
  "yt:videoId": "ECP9Qq8M9Yk",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "20% Of Screenwriters Have The Talent To Write In Hollywood - Kelly Edwards",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-31T00:00:05+00:00",
  "updated": "2022-10-31T00:00:08+00:00",
  "media:group": {
    "media:title": "20% Of Screenwriters Have The Talent To Write In Hollywood - Kelly Edwards",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "BUY THE BOOK - THE EXECUTIVE CHAIR: A Writer’s Guide to TV Series Development \nhttps://amzn.to/3JZSNKw\n\nAs HBO and WarnerMedia’s SVP of Talent Development for seven years, Kelly Edwards oversaw all of the emerging artists programs for HBO, HBOMax, and Turner, both domestic and abroad. Edwards’s career spans both television and film, having served as a key corporate diversity executive at Comcast/NBCUniversal and a creative executive for both film director Garry Marshall and producer Laura Ziskin. After moving to television, she spent six years as a senior executive at Fox, where she developed Living Single, Clueless, and The Wild Thornberrys. As SVP of Comedy Development at UPN, she developed Girlfriends, The Parkers, and Malcolm in the Middle. Edwards also produced the movie of the week A Christmas Detour for Hallmark, and the one-hour drama series Sex, Love, and Secrets. She holds a BA in Theater from Vassar and an MFA in Screenwriting from Emerson. Edwards has served on the Annenberg Inclusion Board, the UNCF Leadership Council, the ATAS Diversity committee, as a Trustee for NALIP, and is a 2019 Sundance Episodic Lab fellow. Kelly's book The Executive Chair: A Writer’s Guide to TV Series Development is now available (via Michael Wiese Productions).\n\nCONNECT WITH KELLY EDWARDS\nhttps://kellyedwards.co\nhttps://www.imdb.com/name/nm5561410\nhttps://www.linkedin.com/in/kellyedwardsco\nhttps://www.facebook.com/kellyedwardsco\nhttps://www.instagram.com/kellyedwards_co\nhttps://twitter.com/kellyedwards_co\n\nMORE MICHAEL WIESE PRODUCTIONS AUTHORS\nhttps://mwp.com\n\nRELATED VIDEOS\nHollywood Executive's Advice To Beginning Screenwriters - https://youtu.be/OdyIXr2Bf_s\nTalent Without Marketing Won't Get You Far - https://youtu.be/LWGV0Jka2bI\nThis Is Why The Most Talented Artists Aren't The Most Successful - https://youtu.be/mT0BEGIUXgQ\nWhat Do Executives Want To See In A Television Series Pitch? - https://youtu.be/JXcXo1zD54s\nHow Does A Screenwriter Get A Meeting With An Executive? - https://youtu.be/LXcF-HSQ5Zw\nMovie Pitch Meetings From An Executive's Point Of View - https://youtu.be/fjLebIfvyfQ\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#writing #screenwriting #film",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}