{
  "title": "61: Dr. Tiffany Stewart- Shift Your Mindset and Create The Life You Want",
  "pubDate": "Thu, 10 Nov 2016 19:28:40 +0000",
  "guid": "205ea6a9fa12802d6ad4f1b82302fa83",
  "link": "https://lifeonpurpose.libsyn.com/61-dr-tiffany-stewart-shift-your-mindset-and-create-the-life-you-want",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #61</strong>, my guest is speaker, professional coach and mentor, trained licensed therapist and tenured associate professor of counseling <strong>Dr. Tiffany Stewart</strong>.<br /> <br /> <strong>Dr. Tiffany</strong> joined me for an inspirational chat about her L.E.A.P. Success System and how it helps others shift their mindset and create the lives they want. We also discussed her own life story — how she went from being a single parent who had been fired from four jobs in two years with very little money (\"failing at life\") to building a successful business and life lived on her own terms in just a few short years.<br /> <br /> <em>“Failure is a part of the process. You can ALWAYS recover from it. And the transformation that I have been through in a few short years is not because I am a lucky person. You do not need lady luck on your side to create the life you want. I went from literally losing everything I had to creating the life I want.”</em><br /> <br /> About: <strong>Dr. Tiffany</strong> is national speaker, professional coach and mentor, trained licensed therapist and tenured associate professor of counseling. She works with individuals teaching step-by-step how to actually create the very life they want and desire.<br /> <br /> <strong>Dr. Tiffany</strong> is a trained licensed therapist with years of training in the counseling profession and as a tenured associate professor of counseling. Soon after entering the world of academia, <strong>Dr. Tiffany</strong> recognized it fostered an environment of constant criticism, people telling you what you could not do and how good you were not. She then made it her mission to do the opposite by empowering people, helping realize their gifts and showing them how to obtain them.<br /> <br /> Through working with a mentor and learning the best methods to use, Dr. Tiffany created a formula to teach others who feed into the belief of not being good enough or not knowing the next steps to take to create a life they love.<br /> <br /> Her passion is to help individuals who may be stuck in some area of life, tap into their power and give themselves permission to step into their purpose and create the create life they want to live. She is the creator of the L.E.A.P. Success System.<br /> <br /> To learn more about <strong>Dr. Tiffany</strong> and her work, visit: <a href=\"http://www.tiffanystewartphd.com/\" target= \"_blank\">http://www.tiffanystewartphd.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #61, my guest is speaker, professional coach and mentor, trained licensed therapist and tenured associate professor of counseling Dr. Tiffany Stewart.  Dr. Tiffany joined me for an inspirational chat about her L.E.A.P. Success System and how it helps others shift their mindset and create the lives they want. We also discussed her own life story — how she went from being a single parent who had been fired from four jobs in two years with very little money (\"failing at life\") to building a successful business and life lived on her own terms in just a few short years.  <em>“Failure is a part of the process. You can ALWAYS recover from it. And the transformation that I have been through in a few short years is not because I am a lucky person. You do not need lady luck on your side to create the life you want. I went from literally losing everything I had to creating the life I want.”</em>  About: Dr. Tiffany is national speaker, professional coach and mentor, trained licensed therapist and tenured associate professor of counseling. She works with individuals teaching step-by-step how to actually create the very life they want and desire.  Dr. Tiffany is a trained licensed therapist with years of training in the counseling profession and as a tenured associate professor of counseling. Soon after entering the world of academia, Dr. Tiffany recognized it fostered an environment of constant criticism, people telling you what you could not do and how good you were not. She then made it her mission to do the opposite by empowering people, helping realize their gifts and showing them how to obtain them.  Through working with a mentor and learning the best methods to use, Dr. Tiffany created a formula to teach others who feed into the belief of not being good enough or not knowing the next steps to take to create a life they love.  Her passion is to help individuals who may be stuck in some area of life, tap into their power and give themselves permission to step into their purpose and create the create life they want to live. She is the creator of the L.E.A.P. Success System.  To learn more about Dr. Tiffany and her work, visit: <a href=\"http://www.tiffanystewartphd.com/\" target= \"_blank\">http://www.tiffanystewartphd.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "57:03",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #61, my guest is speaker, professional coach and mentor, trained licensed therapist and tenured associate professor of counseling Dr. Tiffany Stewart.  Dr. Tiffany joined me for an inspirational chat about her L.E.A.P...."
}