{
  "title": "How to write a great Stack Overflow question",
  "description": "Need help with your code? Learn my step-by-step process for asking great Stack Overflow questions that will get answered quickly!",
  "link": "https://www.dataschool.io/how-to-ask-for-coding-help-online/",
  "guid": "611e79678c4c9e003bbfda78",
  "category": [
    "Python",
    "tutorial"
  ],
  "dc:creator": "Kevin Markham",
  "pubDate": "Mon, 23 Aug 2021 15:12:30 GMT",
  "media:content": "",
  "content:encoded": "<!--kg-card-begin: markdown--><img src=\"https://www.dataschool.io/content/images/2021/08/512px-Stack_Overflow_icon.png\" alt=\"How to write a great Stack Overflow question\"><p>In my 7 years of teaching data science, <strong>I've answered thousands of questions online.</strong> I know what makes a great question, because those are the questions that get my attention!</p>\n<p>When you have a code question, <a href=\"https://stackoverflow.com/\">Stack Overflow</a> is an excellent place to ask. There are tons of skilled developers hungry for questions to answer so that they can earn points and build their reputation.</p>\n<p>If you write a great question, it may be answered quickly! If you don't, it will probably be ignored.</p>\n<p><strong>So how do you write a great Stack Overflow question?</strong> Jake VanderPlas summarizes my thinking nicely:</p>\n<blockquote class=\"twitter-tweet\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">The single best thing you can do when asking for coding help online is provide a short, complete example script that others can copy, paste, and run **without any modification** to reproduce your problem.<br><br>This applies to StackOverflow, mailing lists, github issues... everything.</p>&#x2014; Jake VanderPlas (@jakevdp) <a href=\"https://twitter.com/jakevdp/status/1027676724484427777?ref_src=twsrc%5Etfw\">August 9, 2018</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Below, I'll demonstrate my <strong>step-by-step process for writing a great question</strong> which you can use any time you need to ask for coding help online!</p>\n<h2 id=\"herestheinitialquestion\">Here's the initial question:</h2>\n<p>I'll use this <strong>pandas question</strong> as an example, which I received from one of my students:</p>\n<blockquote>\n<p>I'm trying to tackle a dataset where each row represents a home transaction with a unique listing id. I know fillna is a column-based function that applies to all nans, but can we apply per row instead?</p>\n<p>This dataset has town and architectural style columns, and I want to replace a nan value in architectural style with a groupby town of that row's town, and then apply the most common (highest value count) architectural style. I was going to use <code>df.groupby('town')['architectural style'].value_counts()</code>.</p>\n<p>I have a feeling I can do this with transform and a lambda function on the whole dataset, but how do I interact with the row, to get its town within the fillna function?</p>\n</blockquote>\n<p>Conceptually, this is an excellent question, but it needs some work in order to be successful on Stack Overflow!</p>\n<h2 id=\"heresmyprocessforrewritingthatquestion\">Here's my process for rewriting that question:</h2>\n<ol>\n<li>Write a brief introduction</li>\n<li>Provide a self-contained code example</li>\n<li>Detail the expected results and why I expect those results</li>\n<li>Add any important notes</li>\n<li>Link to any relevant questions</li>\n<li>Write a title that summarizes the question</li>\n</ol>\n<p>Below I'll rewrite my student's pandas question, and then I'll explain <strong>9 lessons</strong> you can take away from this example!</p>\n<h2 id=\"heresmyrewrittenquestion\">Here's my rewritten question:</h2>\n<p><strong>Title:</strong> <a href=\"https://stackoverflow.com/q/68849100/1636598\">How to fill missing values in a DataFrame with the most frequent value of each group?</a></p>\n<p>I have a pandas DataFrame with two columns: <code>toy</code> and <code>color</code>. The <code>color</code> column includes missing values.</p>\n<p>How do I fill the missing <code>color</code> values with the most frequent <code>color</code> for that particular <code>toy</code>?</p>\n<p>Here's the code to create a sample dataset:</p>\n<pre><code class=\"language-python\">import pandas as pd\nimport numpy as np\ndf = pd.DataFrame({\n    'toy':['car'] * 4 + ['train'] * 5 + ['ball'] * 3 + ['truck'],\n    'color':['red', 'blue', 'blue', np.nan, 'green', np.nan,\n             'red', 'red', np.nan, 'blue', 'red', np.nan, 'green']\n    })\n</code></pre>\n<p>Here's the sample dataset:</p>\n<pre><code class=\"language-python\">      toy  color\n0     car    red\n1     car   blue\n2     car   blue\n3     car    NaN\n4   train  green\n5   train    NaN\n6   train    red\n7   train    red\n8   train    NaN\n9    ball   blue\n10   ball    red\n11   ball    NaN\n12  truck  green\n</code></pre>\n<p>Here's the desired result:</p>\n<ul>\n<li>Replace the <strong>first NaN</strong> with <strong>blue</strong>, since that is the most frequent <code>color</code> for a car.</li>\n<li>Replace the <strong>second and third NaNs</strong> with <strong>red</strong>, since that is the most frequent <code>color</code> for a train.</li>\n<li>Replace the <strong>fourth NaN</strong> with either <strong>blue or red</strong>, since they are tied for the most frequent <code>color</code> for a ball.</li>\n</ul>\n<p>Notes about the real dataset:</p>\n<ul>\n<li>There are many different <code>toy</code> types (not just four).</li>\n<li>There are no <code>toy</code> types that only have missing values for <code>color</code>, so the answer does not need to handle that case.</li>\n</ul>\n<p><a href=\"https://stackoverflow.com/questions/15222754/groupby-pandas-dataframe-and-select-most-common-value\">This question</a> is related, but it doesn't answer my question of how to use the most frequent value to fill in missing values.</p>\n<h2 id=\"hereswhatmakesthisagoodquestion\">Here's what makes this a good question:</h2>\n<ol>\n<li>\n<p><strong>I summarized the entire question at the top.</strong> If someone might know the answer, I want to give them the question right away in order to motivate them to keep reading. If the question was instead buried at the bottom, the reader might just give up and move on to another question.</p>\n</li>\n<li>\n<p><strong>I wrote code that can be copied, pasted, and run.</strong> Coding questions can be hard to solve in your head, and so I want to make it as easy as possible for the reader to work on this problem on their own machine. I even included the imports so that they can run the code from a new environment.</p>\n</li>\n<li>\n<p><strong>I printed out the dataset.</strong> Even though the reader may end up running my code on their machine, I don't want to require them to do so in order to start thinking through a solution. This is also important because they will need something to look at when I explain the expected results. (In case you're wondering, I generated this output by running the sample code in IPython.)</p>\n</li>\n<li>\n<p><strong>I used short and simple object names.</strong> This makes it easier for the reader to read the code, interact with it on their own machine, and write out an answer.</p>\n</li>\n<li>\n<p><strong>I added proper formatting.</strong> This makes it easier for the reader to understand your question quickly.</p>\n</li>\n<li>\n<p><strong>I provided the expected results and why I expect those results.</strong> Detailing what you expect is important because it's unlikely that your question alone will be crystal clear to every reader. Detailing why you expect it is equally important because you don't want to receive solutions that arrive at the right result but for the wrong reason.</p>\n</li>\n<li>\n<p><strong>I covered many different cases with the example dataset.</strong> My dataset included a toy with one missing value, a toy with two missing values, a toy for which there was a \"tie\" in terms of most frequent color, and a toy with no missing values. This is important for ensuring that the solution you receive will work for all of the cases present in your real dataset.</p>\n</li>\n<li>\n<p><strong>I added any special notes that wouldn't be obvious from the example dataset.</strong> In this case, I wanted to ensure that the solution \"scaled\" to more than four toy types, and I didn't want the reader to worry about handling an edge case that doesn't exist in the real dataset. Thus, I'm trying to increase the likelihood that I get a useful answer as well as eliminate any questions that may have come up in the reader's mind.</p>\n</li>\n<li>\n<p><strong>I linked to a related question.</strong> This demonstrates that you have already searched for an answer, and it gives you a chance to make the case for why your question is not a duplicate (in which case it may be closed by a moderator). It also gives the reader a \"head start\" by linking to a resource that might help them to come up with an answer to your question.</p>\n</li>\n</ol>\n<h2 id=\"herearesomeadditionalthingsyoumightwanttoinclude\">Here are some additional things you might want to include:</h2>\n<p>My guiding principle is to <strong>make it easy for the reader</strong> by telling them everything they need to know and nothing else. Here are a few things that I didn't include in my question, but may be worth including in some cases:</p>\n<ul>\n<li><strong>An error message</strong>, if your question is about how to fix a specific error.</li>\n<li><strong>A diagram</strong>, if you think that might help to clarify your question.</li>\n<li><strong>Which software versions you are using</strong>, if you think that might be relevant.</li>\n<li><strong>Code you tried that didn't work</strong>, if you think that might help to clarify your goal.</li>\n</ul>\n<p><strong>Note:</strong> Including code that didn't work is often recommended as a way to \"prove\" that you have put in enough effort solving your own problem, but I don't universally recommend this since it makes your question longer without necessarily adding useful information.</p>\n<h2 id=\"hereareafewmoretips\">Here are a few more tips:</h2>\n<ul>\n<li><strong>Ask questions that have a correct answer.</strong> The site is not designed for opinion-based questions.</li>\n<li><strong>Focus on a single issue in your question.</strong> The site is optimized for discrete questions with discrete answers, and so questions that contain multiple issues aren't as well-received.</li>\n<li><strong>Keep revising your question until it is as clear and concise as possible.</strong> You're asking people to help you for free, so writing a high-quality question is one way of honoring the time that they are giving you.</li>\n<li><strong>If you find the answer on your own, you should post both the question and the answer.</strong> This is a great way to share your knowledge with the community, and you may even receive an answer that is better than your own!</li>\n</ul>\n<h2 id=\"relatedresources\">Related resources:</h2>\n<ul>\n<li><strong>Stack Overflow Help:</strong> <a href=\"https://stackoverflow.com/help/how-to-ask\">How do I ask a good question?</a></li>\n<li><strong>Stack Overflow Help:</strong> <a href=\"https://stackoverflow.com/help/minimal-reproducible-example\">How to create a Minimal, Reproducible Example</a></li>\n<li><strong>Jon Skeet:</strong> <a href=\"https://codeblog.jonskeet.uk/2012/11/24/stack-overflow-question-checklist/\">Stack Overflow Question Checklist</a></li>\n<li><strong>Jon Skeet:</strong> <a href=\"https://codeblog.jonskeet.uk/2010/08/29/writing-the-perfect-question/\">Writing the Perfect Question</a></li>\n<li><strong>Matthew Rocklin:</strong> <a href=\"https://matthewrocklin.com/blog/work/2018/02/28/minimal-bug-reports\">Craft Minimal Bug Reports</a></li>\n</ul>\n<h2 id=\"goodluck\">Good luck!</h2>\n<p>If you used this guide to help you write a great Stack Overflow question, feel free to <strong>share a link in the comments below</strong> and I'll take a look! &#x1F447;</p>\n<p><strong>P.S.</strong> I posted my <a href=\"https://stackoverflow.com/q/68849100/1636598\">pandas question</a> on Stack Overflow and received a helpful answer within 5 minutes! &#x1F64C; This is by no means guaranteed, but by writing a high-quality question, you will greatly increase the likelihood of a useful response!</p>\n<script async data-uid=\"d6d0f53c0f\" src=\"https://dataschool.ck.page/d6d0f53c0f/index.js\"></script><!--kg-card-end: markdown-->"
}