{
  "id": "https://bibleinoneyear.org/en/youth/37",
  "title": "Day 37: The Secret Things",
  "description": "Psalm 18:39, Job 38:1–5, Matthew 25:1–10. In today’s passages, we see three examples of big questions that are frequently asked  In answer to each of these questions there are some things we know (‘the things revealed’) and some things we don’t know (‘the secret things’)",
  "pubDate": "Sat, 06 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/37/?ignore",
  "itunes:duration": "12:20",
  "guid": "enyouth06022021-37",
  "length": 740.75,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 37: The Secret Things",
  "itunes:subtitle": "Psalm 18:39, Job 38:1–5, Matthew 25:1–10. In today’s passages, we see three examples of big questions that are frequently asked  In answer to each of these questions there are some things we know (‘the things revealed’) and some things we don’t know (‘the secret things’)",
  "itunes:summary": "When I first encountered Jesus, I thought I had to know the answer to every question about faith. However, the more I have studied the Bible, the more I have realised that we do not need to know the answer to everything. There is such a thing as healthy agnosticism, or what might be described as biblical agnosticism.\nThere are some questions to which we do know the answer. But there are other questions to which the best answer we can give is, ‘I don’t know.’ ‘The secret things belong to the Lord our God, but the things revealed belong to us’ (Deuteronomy 29:29a).\nWe need to be clear about what the Bible is clear about. Don’t be agnostic about what you can know. Equally, don’t be dogmatic about the things that the Bible is agnostic about.\nIn today’s passages, we see three examples of big questions that are frequently asked. In answer to each of these questions there are some things we know (‘the things revealed’) and some things we don’t know (‘the secret things’).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 37
}