{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-4804335291590277037",
  "published": "2019-02-05T12:00:00.000-08:00",
  "updated": "2019-02-05T12:00:02.391-08:00",
  "title": "YouTube in 2019: Looking back and moving forward",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Dear Creators,<br /><br /><br /><br />I’m excited to share some thoughts about 2019 and the year ahead, but first wanted to take a moment and reflect on what was an unprecedented 2018. While we experienced tremendous growth across the platform, it was also a time of some tough growing up.<br /><br /><br /><br />First, some milestones that we hit: the channels with over one million subscribers nearly doubled in the last year, and the number of creators earning five or six figures in the last year grew more than 40%. You’re creating the next generation of media companies and we’re thrilled to see how much the YouTube creator economy is thriving.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://2.bp.blogspot.com/-NIz-yHTkioE/XFix1AzuIdI/AAAAAAAACIs/8axVrMxq8X0KN-5Hxfu2aOSe5J1NgwfwQCLcBGAs/s1600/2_colour.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://2.bp.blogspot.com/-NIz-yHTkioE/XFix1AzuIdI/AAAAAAAACIs/8axVrMxq8X0KN-5Hxfu2aOSe5J1NgwfwQCLcBGAs/s1600/2_colour.jpg\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Illustrations by Martina Paukova</td></tr></tbody></table><br /><br />But one record we definitely didn’t set out to break was the most disliked video on the Internet. Even at home, my kids told me our 2018 Rewind was “cringey.” We hear you that it didn’t accurately show the year’s key moments, nor did it reflect the YouTube you know. We’ll do better to tell our story in 2019. <br /><br /><br /><br />Last year, we also saw how the bad actions of a few individuals can negatively impact the entire creator ecosystem, and that’s why we put even more focus on responsible growth. We implemented a number of product and policy changes, from information cards on common conspiracies and breaking news shelves from authoritative sources, to consequences for creators who bring harm to that crucial trust you’ve built up with users and advertisers.<br /><br /><br /><br />This year, I have three priorities: 1) Supporting creator and artist success; 2) Improving communication and engagement; and 3) Living up to our responsibility. Read on for an update on each.<br /><br /><iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/C1gTRlAF74Q\" width=\"560\"></iframe><br /><br /><h3 style=\"text-align: left;\">1. Supporting creator and artist success</h3><br /><br /><br />We know how vital monetization is to creators, and recognize it remains a pain point for many of you. Just as a reminder, we started last year with many of our largest advertisers paused because of brand safety concerns. We worked incredibly hard to build the right systems and tools to make sure advertisers feel confident investing in YouTube, and most are now back. On the creator side, we’ve been improving our classifiers so that we make the right monetization decision for each video. We’ve increased the accuracy of the monetization icon by 40% and are also making it easier for creators to appeal when we make the wrong call. But there’s still more work to do on both of these fronts and we’re committed to getting it right for everyone. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-DaBM9MFQC8w/XFiyo3vpFaI/AAAAAAAACI4/DRthPWof1Ac4SOn37mZHYgJCBlksOZvZQCLcBGAs/s1600/5_colour.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://4.bp.blogspot.com/-DaBM9MFQC8w/XFiyo3vpFaI/AAAAAAAACI4/DRthPWof1Ac4SOn37mZHYgJCBlksOZvZQCLcBGAs/s1600/5_colour.jpg\" /></a></div><br /><br />We’ve also been building new ways for you to make money beyond advertising. We expanded YouTube Music and YouTube Premium and made both available in 29 countries, up from just five at the beginning of 2018. We’ve also added other solutions to help you diversify revenue, including Super Chat, Channel Memberships, Merchandise, and Ticketing. Last quarter, we opened up Merch shelf access to all <a href=\"https://support.google.com/youtube/answer/9158148?hl=en\" target=\"_blank\">eligible</a>&nbsp;creators globally. We also continued to make channel memberships more broadly available, lowering the subscriber threshold from 100,000 to 30,000. <br /><br /><br /><br />On the issue of Article 13: A big thank you to all the creators who helped bring attention to the unintended consequences of the proposal—one that threatens the livelihoods of so many creators in Europe and around the world— through your videos, stories, op-eds and shared ideas. You’ve proven to be an influential voice in the debate. Your videos were viewed hundreds of millions of times and a near-record 4.6 million people signed the <a href=\"https://www.change.org/p/european-parliament-stop-the-censorship-machinery-save-the-internet\" target=\"_blank\">petition</a> at Change.org. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-mwdkEHTvox0/XFiy_pUye5I/AAAAAAAACJA/yAO1E5Yo0HU9yQj6b1TY-wC668DMIW-GACLcBGAs/s1600/7_colour.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://2.bp.blogspot.com/-mwdkEHTvox0/XFiy_pUye5I/AAAAAAAACJA/yAO1E5Yo0HU9yQj6b1TY-wC668DMIW-GACLcBGAs/s1600/7_colour.jpg\" /></a></div><br /><br />That awareness you created was critical, since it was clear to me last year when meeting with policymakers in Strasbourg that many of them had heard from large companies, but lacked an understanding of the European creator economy’s impact and size. I shared with legislators the huge economic benefit you all bring to your home countries. In France alone, we have more than 190 channels with more than 1 million subscriptions, with the number of E.U. channels reaching that milestone up 70% year over year. <br /><br /><br /><br />The debate around Article 13 remains ongoing. This could be decided in the next few weeks, so please keep speaking out on this critical issue for all YouTube creators.<br /><br /><br /><br /><h3 style=\"text-align: left;\">2. Improving communication and engagement </h3><br /><br /><br />In 2018, we took steps to communicate better with you. We introduced YouTube Studio, a new home base which will be available to all creators this year, and are constantly adding new features to it. Some of the latest include Known Issues, News widgets, and new metrics like thumbnail click-through rates and Merch options. <br /><br /><br /><br />Many of you told us you prefer hearing from us through social posts, so we set a goal to be more responsive through those channels. In the last year, we’ve increased our number of responses by 150% and made our response times 50% faster. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-ZcQZAfkzJXE/XFi0REWbvTI/AAAAAAAACJM/gX8Sv2GhRHILIa95VgrQIQwu6wzvFGNpgCLcBGAs/s1600/9_colour.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://4.bp.blogspot.com/-ZcQZAfkzJXE/XFi0REWbvTI/AAAAAAAACJM/gX8Sv2GhRHILIa95VgrQIQwu6wzvFGNpgCLcBGAs/s1600/9_colour.jpg\" /></a></div><br /><br /><br />But we also love meeting you in person. In 2018, we held more than 480 events with over 18,000 creators—from Fanfests, to Creator Summits, to workshops. We even had the opportunity to sit down with some of you for your channels. If you haven’t already seen it, I highly recommend Luisito’s <a href=\"https://www.youtube.com/watch?v=sGBr0Bl8y2U\" target=\"_blank\">chat</a> with our chief product officer Neal Mohan. Watch this space, as we will invest even more in communication this year.<br /><br /><br /><br />And it’s the engagement between creators and viewers that truly sets YouTube apart  from traditional media like TV.  Our goal is to grow this in new ways. One addition last year was the Premieres feature that allows creators to generate a shared experience with fans around new videos. Creators like <a href=\"https://www.youtube.com/channel/UCi9cDo6239RAzPpBZO9y5SA\" target=\"_blank\">Lele Pons</a> and <a href=\"https://www.youtube.com/channel/UC78cxCAcp7JfQPgKxYdyGrg\" target=\"_blank\">Emma Chamberlain</a> used Premieres on their way to racking up millions of views. At its peak, Ariana Grande’s <a href=\"https://www.youtube.com/watch?v=gl1aHhXnN1k\" target=\"_blank\">“thank u, next”</a> had 829,000 unique viewers watching and interacting simultaneously, making this video the biggest Premiere ever on YouTube. I’m sure we’ll see even more of these moments in 2019.<br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-TRcLJEkEPTQ/XFi0kOA-TbI/AAAAAAAACJU/paFZ33CHgmY7-k432RYN4z-7UrpGHI9wQCLcBGAs/s1600/1_emma.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://1.bp.blogspot.com/-TRcLJEkEPTQ/XFi0kOA-TbI/AAAAAAAACJU/paFZ33CHgmY7-k432RYN4z-7UrpGHI9wQCLcBGAs/s1600/1_emma.jpg\" /></a></div><br /><br /><br />We also recently made Stories available to all eligible creators with more than 10,000 subscribers, and opened up Community posts to all channels with more than 1,000 subscribers. Billions of comments were made on YouTube in 2018, and for a better experience, we improved comment ranking, added @mentions in comments and introduced a feature where creators can hold inappropriate comments for review in 10 languages. <br /><br /><br /><br /><h3 style=\"text-align: left;\">3. Living up to our responsibility</h3><br /><br /><br />It is my personal mission to ensure that we're living up to our responsibilities to our users, as well as to you, the creator community. We made a lot of improvements here in 2018 but recognize there’s still much more to do. <br /><br /><br /><br />First, more and more people are coming to YouTube for news. Not only have we made changes to ensure they’re having a good experience when they visit, but we’ve prioritized supporting the journalism community. One key effort is the Google News Initiative YouTube innovation funding program, <a href=\"https://youtube.googleblog.com/2018/07/building-better-news-experience-on.html\" target=\"_blank\">announced</a> last summer.  Hundreds of organizations submitted proposals and we awarded grants to <a href=\"https://youtube.googleblog.com/2018/12/gni-youtube-innovation-funding.html\" target=\"_blank\">87 recipients</a> to help them build up their video capabilities. We also expanded our breaking news shelf and top news shelves to 31 countries and look forward to expanding them even further this year. <br /><br /><br /><br />Another focus was on more quickly and effectively removing the content that violates our Community Guidelines, as shown in our <a href=\"https://transparencyreport.google.com/youtube-policy/removals\" target=\"_blank\">report</a>. But we know we need to more clearly communicate about the policies that impact you. Most recently we <a href=\"https://support.google.com/youtube/thread/1063345?hl=en\" target=\"_blank\">updated guidance</a> to creators about our policies on custom thumbnails, external links, and pranks and challenges. And our <a href=\"https://www.youtube.com/channel/UCGg-UqjRgzhYDPJMr-9HXCg\" target=\"_blank\">Creator Insider</a>&nbsp;channel covered how we address <a href=\"https://www.youtube.com/watch?v=VWAdzMmNLy0\" target=\"_blank\">profanity</a>. Look for more of these types of updates in the months to come. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-hckoWczLnO4/XFi01lbEyvI/AAAAAAAACJc/YlSwtM5w8-Q5NIcQLQoknt5LbiTHElPuACLcBGAs/s1600/13_colour.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://2.bp.blogspot.com/-hckoWczLnO4/XFi01lbEyvI/AAAAAAAACJc/YlSwtM5w8-Q5NIcQLQoknt5LbiTHElPuACLcBGAs/s1600/13_colour.jpg\" /></a></div><br /><br />A major highlight for me in 2018 was watching how creators used YouTube as a way to give back. More than 40 creators worked together last year to benefit eight charities with <a href=\"https://youtube-creators.googleblog.com/2018/08/introducing-youtube-giving-new-tools.html\" target=\"_blank\">YouTube Giving</a>, which included our first annual <a href=\"https://youtube.googleblog.com/2018/11/the-giving-season-is-upon-us.html\" target=\"_blank\">#YouTubeGiving Week</a> program in November. YouTuber Matpat and Stephanie of <a href=\"https://www.youtube.com/user/MatthewPatrick13\" target=\"_blank\">The Game Theorists</a> helped us kick it off with a special livestream and Matpat said it was “one of the highlights of [his] seven years YouTubing.” <br /><br /><br /><br />Finally, we’ve seen the incredible momentum around learning and education on YouTube and we’re investing to support its growth. Last year, we introduced the Learning Fund and awarded grants to 65 creators chosen from more than 1,000 submissions. Recipients will be developing multi-session learning content for YouTube, so stay tuned for more details on when that will roll out. <br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-wJBB4AZTSII/XFi1C1ivMJI/AAAAAAAACJg/X4hBZsyrMTs9I6RDgaARbKPK9pvA9XsHACLcBGAs/s1600/14_colour.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"563\" data-original-width=\"1000\" src=\"https://4.bp.blogspot.com/-wJBB4AZTSII/XFi1C1ivMJI/AAAAAAAACJg/X4hBZsyrMTs9I6RDgaARbKPK9pvA9XsHACLcBGAs/s1600/14_colour.jpg\" /></a></div><br /><br />Also, keep an eye out for our first EduCon of 2019, which is coming up in the U.K. in February. We hosted four EduCon conferences around the world in 2018, engaging with nearly 450 creators in the U.S., Mexico, Brazil and India.<br /><br /><br /><br />Personally, I depended on the learning content more times than I can count. With YouTube’s incredibly busy year, I turned to the platform for some of my workouts and have a lot of appreciation for the yoga YouTubers. The work of all educational creators has brought incredible enrichment to so many lives in so many ways.<br /><br /><br /><br />All in all, 2018 was a year of change, challenges, and opportunity. This year will undoubtedly be more of the same. Keep the feedback coming—even though sometimes it’s hard to read—it’s your questions and comments that help make YouTube the very best video community for all of us. The creator community is what inspires me daily and makes this platform so special...so thank you again.<br /><br /><br /><br /><i>Susan Wojcicki, CEO of YouTube<br /></i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 21
}