{
  "guid": "urn:uuid:995e8b29-193f-4b19-9721-20aad52ce59e",
  "link": "https://www.who.int/news/item/28-10-2022-act-accelerator-launches-six-month-plan-as-world-transitions-to-long-term-covid-19-control",
  "a10:author": {
    "a10:name": ""
  },
  "title": "ACT-Accelerator launches six month plan as world transitions to long-term COVID-19 control",
  "description": "<p><ul><li>Plan sets out the partnership&rsquo;s key priorities and ways of working, as countries transition to managing COVID-19 as a long-term public health issue</li><li>The plan&rsquo;s focus is on vaccinating high-risk populations, introducing new treatments, boosting testing and securing sustained access to COVID-19 tools</li><li>The Access to COVID-19 Tools Accelerator is a global collaboration to accelerate development, production, and equitable access to COVID-19 tests, treatments, and vaccines.</li></ul><p>The Access to COVID-19 Tools (ACT) Accelerator today launches its plan for the next six months, setting out how, as a partnership of global health agencies working alongside government, civil society and other partners, it will support countries as the world transitions to long-term COVID-19 control.&nbsp;&nbsp;<br /></p><p>Recognizing the evolving nature of the COVID-19 virus and pandemic, the plan outlines changes to ACT-A&rsquo;s set-up and ways of working, to ensure countries continue to have access to COVID-19 tools in the longer term, while maintaining the coalition&rsquo;s readiness to help address future disease surges.<br /></p><p>Developed through a consultative process with ACT-A agencies, donors, industry partners, civil society organizations (CSOs) and Facilitation Council members, the plan summarizes priority areas of focus for the partnership&rsquo;s pillars, coordination mechanisms and other core functions, and highlights the work to be maintained, transitioned, sunset, or kept on standby. The transition plan supports the work of ACT-A agencies as they evolve the financing, implementation and mainstreaming of their COVID-19 efforts.<br /></p><p>The next phase of ACT-A partners&rsquo; work will centre on three overarching areas:</p><ul><li><strong>Focusing research and development (R&amp;D) and market shaping activities </strong>to ensure a pipeline for new and enhanced COVID-19 tools</li><li><strong>Securing institutional arrangements </strong>for sustained access for all countries to COVID-19 vaccines, tests and treatments, including oxygen</li><li><strong>Concentrating in-country </strong>work on new product introduction (e.g., new oral antivirals for those at highest risk) and protection of priority populations (e.g., full vaccination of health care workers and older populations), in support of national and international targets</li></ul><p><br /></p><p>&ldquo;As the world moves towards managing COVID-19 over the long-term, ACT-A will continue to support countries by providing access to vaccines, tests, and treatments,\" said WHO Director-General Dr Tedros Adhanom Ghebreyesus. \"But as this plan lays out, we still have a lot of work to do to achieve equitable access to these life-saving tools, with health workers and at-risk populations as our top priority.&rdquo; <br /></p><p>Other changes outlined in the plan include the transition to a new ACT-A Tracking and Monitoring Taskforce, co-chaired by senior officials of India and the US, with the political-level Facilitation Council going into &lsquo;standby&rsquo; mode, with the capacity to reactivate if needed due to a surge in severe disease.</p><p>ACT-A agencies have driven resource mobilization efforts and this plan sets out the shift to mainstream partnership-level financing and resource mobilization into the regular work of each agency going forward. Based on the three over-arching areas of work outlined above, existing financial commitments and country demand for tools, the ACT-A agencies require an estimated US$400 million for their transition work over the next six months. &nbsp;The ACT-A hub will continue to provide a transparent view of ACT-A agencies&rsquo; financing situation during this period.</p><p>The ACT-Accelerator is the world&rsquo;s only end-to-end solution for accelerating the development of, and equitable access to, COVID-19 vaccines, tests and treatments. This partnership has played a key role in facilitating access to COVID-19 countermeasures for low- and lower-middle-income countries throughout the pandemic, most notably:</p><ul><li>Providing more than 1.8 billion doses of vaccine to 146 countries and territories &ndash; including 75% of the vaccines deployed in low-income countries and the majority of doses supplied to Africa &ndash; through COVAX, the vaccines pillar led by CEPI, Gavi, WHO and UNICEF.</li><li>Delivering over 161 million tests, more than halving the cost of rapid tests to under $1 per test, and supplying around 80% of tests used in Africa in the first year of the pandemic through the Diagnostics Pillar led by FIND and the Global Fund. </li><li>Delivering over 40 million COVID-19 treatment courses, investing an unprecedented US$ 1 billion in expanding sustainable oxygen access in LMICs, and initiating the delivery of new antivirals, through the Therapeutics Pillar, led by the Global Fund, Unitaid and Wellcome.</li><li>Delivering over 2 billion items of personal protective equipment (PPE), supporting health systems to deliver COVID-19 tools, and boosting their laboratory, waste management and treatment capacities, through the Health Systems and Response Connector, led by the Global Fund, WHO and the World Bank. </li></ul><p>The Transition Plan can be accessed <a href=\"https://www.who.int/publications/m/item/act-accelerator-transition-plan-(1-oct-2022-to-31-mar-2023)\">here.</a></p><p><strong style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">&nbsp;------------------------------------------------------------------------------------------------------</strong><strong style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">&nbsp;</strong></p><p><strong>QUOTE SHEET</strong><strong></strong><br /></p><p><strong>Seth Berkley, CEO of Gavi, the Vaccine Alliance: </strong>&ldquo;As the lead agencies of COVAX, our goal is to continually evolve to meet the needs of the communities we serve. This ability to adapt to the changing pandemic environment and its challenges has helped COVAX enable a historic global rollout at scale in the face of an unprecedented emergency. Through 2023, COVAX will continue to support lower-income countries to protect their populations. In parallel, we will be supporting countries to integrate COVID-19 vaccination into routine national immunization programs, while also preparing for surges and other worst-case scenarios.&rdquo;</p><p><strong>Ted Chaiban, Global Lead Coordinator for COVID Vaccine Country Readiness and Delivery, said: &ldquo;</strong>COVID-19 vaccine delivery is most successful when it is country-driven and partners align to support government ownership by accelerating funding disbursement, leveraging political engagement, and providing technical advice and assistance. Looking to the future, it's important to have a mechanism in place grounded in the multilateral system that ensures equity in all phases of future pandemics (prevention, preparation, and response) and strengthens essential health systems.&rdquo;</p><p><strong>Dr Philippe Duneton, Executive Director of Unitaid, said: </strong>&ldquo;As part of the global response to COVID-19, Unitaid, co-leader of the ACT-Accelerator's therapeutics pillar, and partners have improved access to critical oxygen supplies and facilitated adoption of life-saving therapeutics alongside vital diagnostic tests. But this is not the end of it, much work remains to be done. Despite uncertainties on how the pandemic will evolve, we must focus on building resilience at market and country level in light of unpredictable and fast evolving scenarios. COVID-19 has shown us that reaching equitable global access to medical countermeasures requires a continuum between pandemic preparedness and response efforts.&rdquo;</p><p><strong>Sir Jeremy Farrar, Director of Wellcome, said: </strong>&ldquo;It&rsquo;s now almost three years since Covid-19 was first discovered and no one can say for certain what will happen next. What we do know is that we can&rsquo;t afford to be complacent. This pandemic is not over. We still need to improve access to vaccines, treatments and tests globally, which means fully funding the ACT-Accelerator. The Accelerator has played a pivotal, and at times lonely, role in pushing for global equity and access to be at the heart of the pandemic response, despite many of the world&rsquo;s advanced economies taking a very nationalistic approach to the sharing of these lifesaving tools.<em></em></p><p>It&rsquo;s vital we maintain an integrated and equitable approach to this phase of the pandemic through ACT-A, invest in developing new vaccines &ndash; ones that can block infection and transmission &ndash; and better treatments, and continue testing and sequencing the virus globally. Only then can we stop Covid-19 circulating and avoid a new variant emerging that overcomes our hard-won defences.&rdquo;&nbsp; </p><p><strong>Dr Richard Hatchett, CEO of CEPI, said: </strong>&ldquo;Much of the world has moved into a phase of coexisting with COVID-19, but we must remain vigilant against the persistent and evolving threat that the virus represents and continue to strive for equity in terms of access to vaccines and other countermeasures. In parallel, we must continue to evolve new and better countermeasures, which provide broader immunity and can be more easily produced, while building sustainable platforms to manufacture them. For that reason global leaders must sustain their support for COVAX, ACT-A and their constituent agencies.&rdquo;</p><p><strong>Dr Bill Rodriguez, CEO of FIND, said:</strong> &ldquo;Diagnostics are a critical enabler of health for all and were among the first tools deployed via ACT-A in collaboration with in-country partners. We are now entering a new phase of managing COVID-19 and stand ready to work alongside countries to integrate testing into routine health programmes, ensuring that those in need can be linked to timely treatment, while maintaining vigilance and readiness for potential new waves.&rdquo;</p><p><strong>Catherine Russell, Executive Director of UNICEF, said: </strong>&ldquo;The impact of the pandemic continues to threaten decades of progress for children, so the work of the ACT-A partnership is as important as ever. UNICEF will continue working with our ACT-A partners to ensure that every country and community has equitable access to the vaccines and tools they need to combat the COVID-19 virus &ndash; and to strengthen primary health systems and other vital services like routine immunization that can save children&rsquo;s lives and help them fulfil their potential.&rdquo;<strong></strong></p><p><strong>Peter Sands, Executive Director of the Global Fund, said: </strong>\"As the world transitions towards managing COVID-19 in the longer term and preparing for the next pandemics, the Global Fund will continue working with its ACT-Accelerator partners towards building stronger health systems and ensuring equitable and efficient procurement of life-saving products.&rdquo;<br /></p></p>",
  "pubDate": "Fri, 28 Oct 2022 09:51:29 Z"
}