{
  "title": "Can an app improve your health? With Gary Bennett, PhD",
  "itunes:title": "Can an app improve your health? With Gary Bennett, PhD",
  "pubDate": "Wed, 01 Jun 2022 10:30:00 +0000",
  "guid": "7d94188e-9d63-4239-aee0-2f92e362b623",
  "link": "http://sopapa.libsyn.com/can-an-app-improve-your-health-with-gary-bennett-phd",
  "itunes:image": "",
  "description": "<p>Digital interventions that promise to help you achieve your health and fitness goals are everywhere. But do these apps work and are they a useful public health tool? Gary Bennett, PhD, director of the Duke University Global Digital Health Science Center, discusses how digital interventions can help address obesity and other public health challenges, how to find apps that are effective and backed by research, the challenge of weight stigma, and more.<br /> <br /> <strong>Links</strong><br /> <br /> <a href=\"https://globalhealth.duke.edu/people/bennett-gary\">Gary Bennett, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a></p> <p><strong>Sponsors</strong><br /> <br /> <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "content:encoded": "<p>Digital interventions that promise to help you achieve your health and fitness goals are everywhere. But do these apps work and are they a useful public health tool? Gary Bennett, PhD, director of the Duke University Global Digital Health Science Center, discusses how digital interventions can help address obesity and other public health challenges, how to find apps that are effective and backed by research, the challenge of weight stigma, and more.  Links  <a href=\"https://globalhealth.duke.edu/people/bennett-gary\">Gary Bennett, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Homepage</a></p> <p>Sponsors  <a href=\"https://www.newporthealthcare.com\">Newport Healthcare</a></p>",
  "enclosure": "",
  "itunes:duration": "38:46",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Digital interventions that promise to help you achieve your health and fitness goals are everywhere. But do these apps work and are they a useful public health tool? Gary Bennett, PhD, director of the Duke University Global Digital Health Science...",
  "itunes:episode": 193,
  "itunes:episodeType": "full",
  "itunes:author": "American Psychological Association"
}