{
  "title": "Cosmopolitans (with Bruce Robbins)",
  "itunes:title": "Cosmopolitans (with Bruce Robbins)",
  "pubDate": "Wed, 25 Sep 2019 23:02:24 +0000",
  "guid": "c78b98a5839740dd843a753fc84cbe64",
  "link": "https://jessacrispin.libsyn.com/cosmopolitans-with-bruce-robbins",
  "itunes:image": "",
  "description": "<div><!--block-->What does it mean to be a global citizen? What does it mean to be a global citizen as a Westerner, when so much of the world has been molded to work for you, not with you? Writer and professor Bruce Robbins joins Jessa to answer some of these questions. Together, they discuss the ethics of cosmopolitanism, American cosmopolitanism from the viewpoint of violence and inequality, consumerism, and the disappearing role of religion in creating practical cosmopolitanism and an ethical framework.<br /> <br /></div> <div><!--block--></div> <div><!--block-->SUBSCRIBE to the #PublicIntellectual #Patreon page to access bonus content, merch, and more:<br /> <br /></div> <div><!--block--><a href= \"https://www.patreon.com/publicintellectual\">https://www.patreon.com/publicintellectual</a></div>",
  "content:encoded": "What does it mean to be a global citizen? What does it mean to be a global citizen as a Westerner, when so much of the world has been molded to work for you, not with you? Writer and professor Bruce Robbins joins Jessa to answer some of these questions. Together, they discuss the ethics of cosmopolitanism, American cosmopolitanism from the viewpoint of violence and inequality, consumerism, and the disappearing role of religion in creating practical cosmopolitanism and an ethical framework.   SUBSCRIBE to the #PublicIntellectual #Patreon page to access bonus content, merch, and more:  <a href= \"https://www.patreon.com/publicintellectual\">https://www.patreon.com/publicintellectual</a>",
  "enclosure": "",
  "itunes:duration": "45:56",
  "itunes:explicit": false,
  "itunes:keywords": "war,philosophy,Endless",
  "itunes:subtitle": "What does it mean to be a global citizen? What does it mean to be a global citizen as a Westerner, when so much of the world has been molded to work for you, not with you? Writer and professor Bruce Robbins joins Jessa to answer some of these...",
  "itunes:season": 1,
  "itunes:episode": 19,
  "itunes:episodeType": "full",
  "itunes:author": "Jessa Crispin"
}