{
  "id": "yt:video:xbES1armuJY",
  "yt:videoId": "xbES1armuJY",
  "yt:channelId": "UCBa5G_ESCn8Yd4vw5U-gIcg",
  "title": "Stanford Seminar - Ethics Governance-in-the-Making: Bridging Ethics Work & Governance Menlo Report",
  "link": "",
  "author": {
    "name": "Stanford Online",
    "uri": "https://www.youtube.com/channel/UCBa5G_ESCn8Yd4vw5U-gIcg"
  },
  "published": "2022-11-01T21:45:51+00:00",
  "updated": "2022-11-02T09:19:35+00:00",
  "media:group": {
    "media:title": "Stanford Seminar - Ethics Governance-in-the-Making: Bridging Ethics Work & Governance Menlo Report",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Ethics Governance-in-the-Making: Bridging Ethics Work and Governance in the Menlo Report\nMegan Finn of University of Washington\nKatie Shilton of University of Maryland, College Park\n\nOctober 21, 2022\n\nThe 2012 Menlo Report was an effort in which a group of computer scientists, US government funders, and lawyers produced ethics guidelines for research in information and communications technology. Using Menlo as a case study, we find that ethics governance-in-the-making is composed of processes that combine controversies of ethics and justice in the co-production of technoscience and society, the everyday ethics work of actors engaged in scientific and technical practice, and ethics as a form of governance in scientific and technical communities. Interviews with authors and analysis of the Menlo Report documents reveal a story of marshalling human and financial resources from a particular subfield within ICT research    network measurement and network security research    to close controversies worrying both researchers and funders. To create the Menlo Report, authors and funders relied on bricolage work with existing, available resources, significantly shaping both the report  s contents and impacts. Report authors were motivated by both forward- and backward-looking goals: enabling new data sharing as well as addressing the status of a research record thrown into ethical question by controversial studies. Authors also grappled with uncertainty about when ethical frameworks were appropriate and made the decision to classify much network data as human subjects data. Finally, the Menlo Report authors attempted to enroll multiple networks in governance through appeals to local research communities as well as taking steps towards federal rulemaking. This analysis of the Menlo Report suggests analytical lenses for study of current and future ethics governance in computer science. The Menlo Report serves as a case study in how to study ethics governance-in-the-making: with attention to resources, adaptation and bricolage, and with a focus on both the uncertainties the process tries to repair, as well as the new uncertainties the process uncovers, which will become the site of future ethics work.\n\nAbout the speakers: \nMegan Finn is an Associate Professor at the Information School at University of Washington where she teaches about information policy and ethics. For this academic year Finn is a Visiting Scholar in the Department of Communication at the School of Humanities and Sciences at Stanford University. She is the author of Documenting Aftermath: Information Infrastructures in the Wake of Disasters and a co-author of a new report from the National Academies called \"Fostering Responsible Computing Research: Foundations and Practices.\"\n\nKatie Shilton is an associate professor in the College of Information Studies at the University of Maryland, College Park. Her research focuses on technology and data ethics. She is the PI of the PERVADE project, a multi-campus collaboration focused on big data research ethics. Other projects include improving online content moderation with human-in-the-loop machine learning techniques; analyzing values in audiology technologies and treatment models; and designing experiential data ethics education. She is the founding co-director of the University of Maryland  s undergraduate major in social data science.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}