{
  "title": "Episode 54: Math Anxiety - Causes and Cures",
  "pubDate": "Sun, 13 Apr 2008 18:32:59 +0000",
  "guid": "psychology-in-everyday-life-the-psych-files-podca",
  "link": "http://www.thepsychfiles.com/2008/04/13/episode-54-math-anxiety-causes-and-cures/",
  "itunes:image": "",
  "description": "Could it be that the roots of this anxiety lie not with the topic itself but with the way math is taught?  In this episode I am extremely fortunate to speak with Dr. Eugene Geist, Associate Professor at Ohio University - Athens, Ohio and specialist in early childhood education.  We talk about math anxiety - how it develops and what can be done to help kids overcome it.  So if you have math anxiety, are a parent of a child with math anxiety or are a teacher of math you'll want to hear what Dr. Geist has to say about this topic.  Don't let your kids say \"I hate math!\" Children are, as Dr. Geist will point out, natural born mathematicians and you can help them with their math homework and in the process help them overcome math anxiety.",
  "content:encoded": "Could it be that the roots of this anxiety lie not with the topic itself but with the way math is taught?  In this episode I am extremely fortunate to speak with Dr. Eugene Geist, Associate Professor at Ohio University - Athens, Ohio and specialist in early childhood education.  We talk about math anxiety - how it develops and what can be done to help kids overcome it.  So if you have math anxiety, are a parent of a child with math anxiety or are a teacher of math you'll want to hear what Dr. Geist has to say about this topic.  Don't let your kids say \"I hate math!\" Children are, as Dr. Geist will point out, natural born mathematicians and you can help them with their math homework and in the process help them overcome math anxiety.",
  "enclosure": "",
  "itunes:duration": "44:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Could it be that the roots of this anxiety lie not in math itself but with the way math is taught? In this episode I speak with Dr. Eugene Geist. Math anxiety - how it develops and what can be done to help kids overcome it.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Could it be that the roots of this anxiety lie not with the topic itself but with the way math is taught? In this episode I am extremely fortunate to speak with Dr. Eugene Geist, Associate Professor at Ohio University - Athens, Ohio and specialist in early childhood education. We talk about math anxiety - how it develops and what can be done to help kids overcome it. So if you have math anxiety, are a parent of a child with math anxiety or are a teacher of math you'll want to hear what Dr. Geist has to say about this topic. Don't let your kids say \"I hate math!\" Children are, as Dr. Geist will point out, natural born mathematicians and you can help them with their math homework and in the process help them overcome math anxiety."
}