{
  "title": "Latest Recession Alarm: Money-Supply Growth Fell in September to a 37-Month Low",
  "link": "https://mises.org/node/60802",
  "description": "<p>Money supply growth fell again in September, dropping to a 37-month low. August's drop continues a steep downward trend from the unprecedented highs experienced during much of the past two years. During the thirteen months between April 2020 and April 2021, money supply growth in the United States often climbed above 35 percent year over year, well above even the \"high\" levels experienced from 2009 to 2013. </p>\n<p>During September 2022, year-over-year (YOY) growth in the money supply was at 3.92 percent. That's down from August's rate of 4.54 percent, and down from September 2021's rate of 7.02 percent. </p>\n<p>The growth rates during most of 2020, and through April 2021, were much higher than anything we'd seen during previous cycles, with the 1970s being the only period that came close. Since then, however, we have seen a fast fall from previous highs and such rapid declines generally point to economic contraction in following months. </p>\n<div class=\"media media-element-container media-image_no_caption\" style=\"position: relative;\"><div class=\"media media-element-container media-image_no_caption\" style=\"position: relative;\"><div class=\"media media-element-container media-image_no_caption\" style=\"position: relative;\"><div class=\"media media-element-container media-image_no_caption\" style=\"position: relative;\"><div class=\"media media-element-container media-image_no_caption\" style=\"position: relative;\"><div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/tms1_12.jpg\" title=\"tms\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-DOm64sM79Gs\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"tms\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"1\" alt=\"tms\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/tms1_12.jpg?itok=gXCMjUww\" width=\"1160\" height=\"752\" title=\"\" /></a></div></div></div></div></div></div>\n<p>The money supply metric used here—<a href=\"https://mises.org/library/austrian-definitions-supply-money\">the \"true\" or Rothbard-Salerno money supply measure</a> (TMS)—is the metric developed by Murray Rothbard and Joseph Salerno, and is designed to provide a better measure of money supply fluctuations than M2. The Mises Institute now offers <a href=\"https://mises.org/austrian-school/money-supply\">regular updates</a> on this metric and its growth. This measure of the money supply differs from M2 in that it includes Treasury deposits at the Fed (and excludes short-time deposits and retail money funds).</p>\n<p>In recent months, M2 growth rates have followed a similar course to TMS growth rates. In September 2022, the M2 growth rate was 2.52 percent. That's down from August's growth rate of 3.78 percent. September's rate was also well down from September 2021's rate of 12.88 percent. </p>\n<p>Money supply growth can often be a helpful measure of economic activity, and an indicator of coming recessions. During periods of economic boom, money supply tends to grow quickly as commercial banks make more loans. Recessions, on the other hand, tend to be preceded by slowing rates of money supply growth. However, money supply growth tends to begin growing again <em>before </em>the onset of recession. </p>\n<p>Another indicator of recession appears in the form of the gap between M2 and TMS. The TMS growth rate typically climbs and becomes larger than the M2 growth rate in the early months of a recession. This occurred in the early months of the 2001 and the 2007–09 recession. A similar pattern appeared before the 2020 recession. </p>\n<p>Notably, this has happened again beginning in May this year as the M2 growth rate in fell below the TMS growth rate for the first time since 2020. Put another way, when the difference between M2 and TMS moves from a positive number to a negative number, that's a fairly reliable indicator the economy has entered into recession. We can see this in this graph: </p>\n<div class=\"media media-element-container media-image_no_caption\" style=\"position: relative;\"><div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/gap_m2_tms.jpg\" title=\"tms\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-DOm64sM79Gs\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"tms\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"2\" alt=\"tms\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/gap_m2_tms.jpg?itok=9TIjj482\" width=\"1160\" height=\"611\" title=\"\" /></a></div></div>\n<p> </p>\n<p>In the two \"false alarms\" over the past 30 years, the M2-TMS gap reverted to positive territory fairly quickly. However, when this gap firmly enters negative territory, that is an indicator that the economy<em> is already in recession.</em> The gap has now been negative for 5 of the past 6 months. Moreover, the gap in September was -1.4, and there is only one case—1998—in more than 30 years during which the gap was greater than -1 and the US not in recession.</p>\n<p>Interestingly, this indicator also appears to follow the pattern of yield curve inversion. For example, <a href=\"https://fred.stlouisfed.org/series/T10Y2Y#0\">the 2s/10s yield inversion</a> went negative in all the same periods where the M2-TMS gap pointed to a recession. Moreover, the 2s/10s inversion was very briefly negative in 1998, and then almost went negative in 2018.  This is not surprising because trends in money supply growth <a href=\"https://mises.org/wire/why-yield-curve-just-inverted-signaling-coming-recession\">have long appeared to be connected to the shape of the yield curve</a>. As Bob Murphy notes in his book <a href=\"https://mises.org/library/understanding-money-mechanics-3/html\"><em>Understanding Money Mechanics</em></a>, a sustained decline in TMS growth often reflects spikes in short-term yields, which can fuel a flattening or inverting yield curve. </p>\n<p>It's not especially a mystery as to why short-term interest rates are headed up fast, and why the money supply is decelerating. Since January of this year, the Fed has raised the target federal funds rate from .25 percent up to 3.25 percent. </p>\n<div class=\"media media-element-container media-image_no_caption\"><a href=\"https://cdn.mises.org/ffr_5.jpg\" title=\"ffr\" class=\"colorbox\" data-colorbox-gallery=\"gallery-all-DOm64sM79Gs\" data-cbox-img-attrs=\"{\"title\": \"\", \"alt\": \"ffr\"}\"><img class=\"media-element file-image-no-caption\" data-delta=\"4\" alt=\"ffr\" typeof=\"foaf:Image\" src=\"https://cdn.mises.org/styles/max_1160/s3/ffr_5.jpg?itok=oTNkQ4C2\" width=\"1160\" height=\"496\" title=\"\" /></a></div>\n<p>This means fewer injections of Fed money into the market through open market operations. Moreover, although it has done very little to actually reduce the size of its portfolio, the Fed has nonetheless stopped adding to its portfolio through Quantitative Easing, and allowed a small amount ($240 billion out of $8.9 trillion) to roll off. Consequently, market interest rates have headed upward and money-supply growth has decelerated. Economic pain is likely to follow. </p>\n\n",
  "author": "Ryan McMaken",
  "enclosure": "",
  "guid": 60802,
  "pubDate": "Fri, 28 Oct 2022 09:30:00 -0500",
  "source": "Mises Wire"
}