{
  "id": "yt:video:2PD48xgHvjs",
  "yt:videoId": "2PD48xgHvjs",
  "yt:channelId": "UC5Jz6SBlu2Sv61kfssv4DOw",
  "title": "Can LIGHT pick stuff up and assemble it? – #VeritasiumContest",
  "link": "",
  "author": {
    "name": "The FACTs of Mechanical Design",
    "uri": "https://www.youtube.com/channel/UC5Jz6SBlu2Sv61kfssv4DOw"
  },
  "published": "2021-07-03T09:37:55+00:00",
  "updated": "2022-07-21T14:28:33+00:00",
  "media:group": {
    "media:title": "Can LIGHT pick stuff up and assemble it? – #VeritasiumContest",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "#VeritasiumContest \n\nI am posting this video in response to a contest announced by Veritasium challenging educators to explain a counter intuitive concept in one minute or less (https://www.veritasium.com/contest). \n\nSince the prize money is coming from a UCLA professor who lost a physics bet to Derek from Veritasium, this is my attempt as a fellow UCLA professor to redeem my university’s reputation. \n\nThis video is about how laser beams, called optical tweezers, can be used to assemble tiny spheres within microgranular crystals of any packing tessellation. My group at UCLA built our own custom machine to build these crystals using purely automated algorithms. A Nobel prize was recently award to Arthur Ashkin for inventing the concept of optical tweezers and using them to manipulate DNA.\n\nIf you'd like to learn more about this topic, be sure to see this invited conference talk: \n\nhttps://www.youtube.com/watch?v=v5OvogF0neE \n\nMy work pertaining to this topic is previously published in the following journal listed here:\n\n-Chizari, S., Lim, M.P., Shaw, L.A., Austin, S.P., Hopkins, J.B., 2020, “Automated Optical-tweezers Assembly of Engineered Microgranular Crystals,” Small, 16(25): 2000314 (6 pages)\n\n-Porter, M.D., Giera, B., Panas, R.M., Shaw, L.A., Shusteff, M., Hopkins, J.B., 2018, “Experimental Characterization and Modeling of Optical Tweezer Particle Handling Dynamics,” Applied Optics, 57(22): pp. 6565-6571\n\n-Shaw, L.A., Chizari, S., Hopkins, J.B., 2018, “Improving the Throughput of Automated Holographic Optical Tweezers,” Applied Optics, 57(22): pp. 6396-6402\n\n-Shaw, L.A., Panas, R.M., Spadaccini, C.M., Hopkins, J.B., 2017, “Scanning Holographic Optical Tweezers,” Optics Letters, 42(15): pp. 2862-2865\n\nIf you are interested in learning more about this work, check out my YouTube Channel, “The FACTs of Mechanical Design”\n\nwww.youtube.com/TheFACTsofMechanicalDesign\n\nAcknowledge: This work would not have been possible without the help of my students, Luke Shaw, Samira Chizari, Michael Porter, Miles Lim, and Amin Farzaneh!  Also special thanks to Carlos Portela and Julia Greer for helping to make the mechanical testing video.\n\nDisclaimer: Responsibility for the content of this video is my own. The University of California, Los Angeles is not involved with this channel nor does it endorse its content.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}