{
  "id": "yt:video:_toEMhMyXzc",
  "yt:videoId": "_toEMhMyXzc",
  "yt:channelId": "UCKy1dAqELo0zrOtPkf0eTMw",
  "title": "Black Panther: Wakanda Forever and Tragedy in the MCU | The Story So Far",
  "link": "",
  "author": {
    "name": "IGN",
    "uri": "https://www.youtube.com/channel/UCKy1dAqELo0zrOtPkf0eTMw"
  },
  "published": "2022-11-05T21:15:01+00:00",
  "updated": "2022-11-05T22:09:36+00:00",
  "media:group": {
    "media:title": "Black Panther: Wakanda Forever and Tragedy in the MCU | The Story So Far",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Black Panther returns! With Black Panther 2, we’ll be seeing a change for the entire franchise going forward officially from Black Panther: Wakanda Forever from Marvel. We mourn the tragic passing of actor Chadwick Boseman, who lit up every Black Panther scene he was in. Without Chadwick Boseman, Black Panther as a whole has a huge problem the Black Panther sequel will have no choice but to try and resolve. \n\nBefore we all watch Wakanda Forever, let’s go back in Marvel Studios history, to Michael B Jordan as Killmonger, to all the parts of the Marvel Cinematic Universe that took us on T’Challa’s journey, including Director Ryan Coogler’s iconic entry. To see what is next, first we visit the story so far. Shuri will play an important role moving forward, past Princess Shuri, Black Panther as a legacy must push on. \n\nWith the world asking, “Who is Black Panther now?” we look to characters like M’Baku, Nakia, and Shuri. Black Panther suit examination became the internet’s new hobby as we figure out who will follow Chadwick Boseman’s footsteps, with many looking toward Shuri. Black Panther 2 looks like it will be very moving, with images of a weeping Ramonda and Shuri. Black Panther: Wakanda Forever marks an important point for the MCU, with many of the Marvel Comics no longer a story option, but many new options opening for the new Black Panther.   The legacy and importance can’t be overstated for the Black Panther. Shuri has played an important role as technologist and advisor, but now her role may be changing well past the end of Avengers Endgame. Who can lead Wakanda? Is the right person Letitia Wright’s Shuri? Have we seen the end of Killmonger? \n\nAnd will the comic story come true, where Shuri becomes the Black Panther? Black Panther, Marvel, and the entire team have a major task, says this girl. Black Panther looms heavy, and the path they take sees to be honoring T’Challa and Boseman, separate from the original Marvel comics, explained simply. Whether we have a female Black Panther, or Michael B Jordan, or any other familiar figure donning the suit, “who is the new Black Panther?” isn’t a question with an easy answer. Let’s see how we got to where we are now, regardless of who is Black Panther in Wakanda Forever, and examine who T’Challa is, who Nakia, Okoye, Shuri, and M’Baku are, and what it means to be the Black Panther. \n\nSubscribe to IGN for more!&#13;\nhttp://www.youtube.com/user/IGNentertainment?sub_confirmation=1&#13;\n&#13;\n#ign#blackpanther#blackpantherwakandaforever#mcu#marvel",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}