{
  "title": "Predecessor’s Sudden Ejection Spotlights Xi’s Power",
  "description": "China&#8217;s new leadership are all loyalists",
  "link": "https://www.asiasentinel.com/p/hu-jintao-ejection-highlights-xi-jinping-power",
  "guid": "https://www.asiasentinel.com/p/hu-jintao-ejection-highlights-xi-jinping-power",
  "dc:creator": "Our Correspondent",
  "pubDate": "Sun, 23 Oct 2022 12:48:32 GMT",
  "enclosure": "",
  "content:encoded": "<div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg\" width=\"1379\" height=\"919\" data-attrs=\"{\"src\":\"https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg\",\"fullscreen\":null,\"imageSize\":null,\"height\":919,\"width\":1379,\"resizeWidth\":null,\"bytes\":223021,\"alt\":null,\"title\":null,\"type\":\"image/jpeg\",\"href\":null,\"belowTheFold\":false,\"internalRedirect\":null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F59a48779-a5c6-42f1-867d-521877829abb_1379x919.jpeg 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>There is no question that Xi Jinping has greatly expanded his power after the closing of the 20th Party Congress, gaining an unprecedented third term as China&#8217;s supreme leader with the new Politburo Standing Committee filled entirely with his people.</p><p>The increase in Xi&#8217;s power was dramatically highlighted with the removal of his predecessor Hu Jintao during the closing ceremony of the congress on October 22, although the Chinese state media attributed the 79-year-old Hu&#8217;s sudden departure as due to health issues.</p><p>&#8220;You just witnessed an unprecedented and seismic shift in Chinese political customs,&#8221; said a political analyst who declined to be named.</p><p>As widely expected, Xi gained a third term as general secretary, or president as popularly described in international media, on October 23. That broke the two-term limit for Chinese presidents laid down by the late Chinese leader Deng Xiaoping. The two presidents before Xi, Hu Jintao and Jiang Zemin, served two terms.</p><p>Xi&#8217;s expanded power with the breaking of the two-term limit was symbolized by what happened with Jiang and Xi at the 20th Party congress which took place from October 16 to 22. The 96-year-old Jiang was absent, either due to ill health or because he was not invited or because he boycotted the congress to express his disapproval of Xi getting a third term. Hu attended the congress, but his removal from the closing ceremony graphically depicts Xi&#8217;s ascendancy over his predecessor, as widely broadcast by international media.</p><p>In a <a href=\"https://twitter.com/nytimes/status/1583872847977381889?s=20&t=YGNBx8nlEM5uk16hp9-Qeg\">video</a> carried by international media, Hu, who wore an unhappy expression, argued for a long time with the two men who escorted him out of the venue, indicating he was reluctant to leave. On his way out, Hu exchanged a few words with Xi and patted the shoulder of outgoing Chinese Premier Li Keqiang, who appeared to ignore Hu. Li is a prot&#233;g&#233; of Hu, as both belonged to the Communist Youth League. As Hu was escorted out, most of the senior delegates sitting behind him ignored him and stared ahead impassively.</p><p>One exception was Li Zhanshu, the outgoing chairman of the standing committee of the National People&#8217;s Congress (China&#8217;s parliament). As shown in this <a href=\"https://twitter.com/dansoncj/status/1583663702896967680?s=20&t=YGNBx8nlEM5uk16hp9-Qeg\">video</a>, Li Zhanshu, who was seated next to Hu, nervously wiped his brow with his handkerchief and stood up to try to help Hu, but was restrained by Wang Huning, a member of the new Politburo Standing Committee, the team of China&#8217;s seven most powerful officials.</p><p>&#8220;Li Zhanshu wanted to help Hu, but Wang Huning stopped Li. That tells you it was premeditated,&#8221; an analyst told Asia Sentinel.</p><p>AFP filmed the removal of Hu and broadcast the video, which was widely disseminated by other foreign media, but the incident was censored by Chinese state broadcaster CCTV, <a href=\"https://www.reuters.com/world/china/former-chinese-president-hu-jintao-escorted-out-party-congress-2022-10-22/\">reported</a> Reuters.</p><p>&#8220;CCTV did not broadcast live the closing ceremony. So there is no reason to doubt that the immediate impact was not for domestic consumption,&#8221; said the analyst who declined to be named.</p><p>&#8220;It is a message for the world, telling them Xi is totally in control. This is a message of strength in a time of geopolitical uncertainty,&#8221; the analyst added.</p><p>A Singaporean executive who declined to be named told Asia Sentinel, &#8220;Xi purposely let the world see Hu Jintao escorted out of the congress. This tells the world that Xi means business, don&#8217;t mess around with Xi.&#8221;</p><p>&#8220;This is really telling the world that all the speculation about his leadership being under threat, had no real substance,&#8221; said Andre Wheeler, chief executive officer of Asia Pacific Connex, an Australian business consultancy.</p><p>State news agency Xinhua <a href=\"https://twitter.com/XHNews/status/1583829797297598465?s=20&t=iauEvEk-HsStR5UMJQvdUg\">said</a> Hu was taken to a room next to the congress hall for a rest and is feeling better. Others are skeptical that ill health was the reason for Hu&#8217;s removal.</p><p>Jamil Anderlini, chief editor of Politico Europe, <a href=\"https://twitter.com/JamilAnderlini/status/1584078024294551555?s=20&t=YGNBx8nlEM5uk16hp9-Qeg\">tweeted</a> on October 23, &#8220;With very few exceptions, the foreign reporters left in mainland China are either very junior and inexperienced or so scared of being expelled that they start to spout state propaganda. Thus, the literal removal of Hu Jintao from the political stage is reported as a &#8216;health issue.&#8217;&#8221;</p><p>A professor told Asia Sentinel, &#8220;I think most people think correctly that Hu&#8217;s strange behavior does not have to do with his health. After all, he already sat through the first half of the closing ceremony. The only conclusion or almost certain conclusion is that Hu wanted to express his dissatisfaction over some issues in the congress. We presume it is over the fact that his own Youth League has been totally wiped out.&#8221;</p><p>Peter Humphrey, a British analyst, wrote on Linkedin today, &#8220;What did Mr. Hu do wrong? If you review all the footage from the seven days, you will see that he failed to applaud Xi's speeches throughout the weeklong 'congress'.&#8221;</p><p>Humphrey previously ran a risk consultancy in Shanghai, was jailed in China and now lives in the UK.</p><p>This action of a former senior leader leaving in such dramatic fashion has never happened before in past congresses.</p><p>&#8220;Of course, Xi doesn&#8217;t want to see this happen; dictators abhor surprises, everything has to be choreographed perfectly,&#8221; said the unnamed academic. &#8220;The fact that Hu sitting next to Xi did a very unusual thing has spoiled the ambiance of perfection of the congress, thus making Xi lose face.&#8221;</p><p>&#8220;Since the age of reform in 1978, nothing like this has happened, a former general secretary walking out of a pivotal party congress. It shows the world something is not right with the way the congress was being handled, or there was objection to the division of the spoils,&#8221; the professor added.&nbsp;</p><p>Xi wants to minimize or remove any future challenges, hence he is neutering the Communist Youth League faction now, the analyst explained. &#8220;The message to Hu is, &#8216;Your time is over.&#8217; It&#8217;s a pretty resolute message from Xi: &#8216;I&#8217;m in charge, any would-be contenders take note, I don&#8217;t take prisoners.&#8217; He&#8217;s thrown the old playbook in the bin.&#8221;</p><p><strong>New Politburo Standing Committee</strong></p><p>At a <a href=\"http://en.people.cn/n3/2022/1023/c90000-10162351.html\">press conference</a> in Beijing on October 23, Xi presented the new Politburo Standing Committee comprising China&#8217;s seven most powerful officials including Xi. Not a single member of the committee belongs to the factions of Hu and Jiang. All the other six members of the committee are believed to be Xi loyalists. They are Wang Huning, Li Qiang, Zhao Leji, Cai Qi, Ding Xuexiang, and Li Xi.</p><p>Cai Qi was an official in Zhejiang province while Xi was the province party secretary. He is known to have publicly called Xi &#8220;Xi Dada&#8221; (Xi Daddy) and &#8220;Boss Xi.&#8221; Li Xi will replace Zhao Leji as the head of the Central Commission for Discipline Inspection (CCDI), the anti-graft agency, <a href=\"http://en.people.cn/n3/2022/1023/c90000-10162385.html\">according to </a>People&#8217;s Daily. Thus, a Xi loyalist will lead Xi&#8217;s ongoing anti-corruption campaign, which some see as his tool to eliminate political rivals.</p><p>Xi has thus cleared the politburo standing committee of members of other factions. Deputy Prime Minister Han Zheng, Li Zhanshu, Wang Yang, and Li Keqiang are due to resign. Wang Yang, chairman of the national committee of the People&#8217;s Political Consultative Conference, is currently the fourth most senior Chinese leader and belongs to Hu&#8217;s faction. Han Zheng is the most senior Chinese official in charge of Hong Kong and is believed to be part of Jiang&#8217;s faction.</p><p>The new Politburo Standing Committee reinforces the move away from Deng Xiaoping&#8217;s &#8220;committee style&#8221; politburo management to one of a singular, cult-style leader, said Wheeler. &#8220;This does not bode well for China, as the country is essentially at the mercy of one personality with no safety mechanism to evaluate their current economic trajectory.&#8221;</p><p>The test will be whether there will be some backlash as China&#8217;s economy flounders and Xi&#8217;s zero-covid policy will reinforce the sentiment developing within the middle class that increasingly sees Xi as having broken his social contract with them, Wheeler added.</p>"
}