{
  "id": "yt:video:mdUxpZKJJXM",
  "yt:videoId": "mdUxpZKJJXM",
  "yt:channelId": "UCbu2SsF-Or3Rsn3NxqODImw",
  "title": "PSVR 2 Is More Expensive Than A PS5 | GameSpot News",
  "link": "",
  "author": {
    "name": "GameSpot",
    "uri": "https://www.youtube.com/channel/UCbu2SsF-Or3Rsn3NxqODImw"
  },
  "published": "2022-11-02T21:30:04+00:00",
  "updated": "2022-11-04T21:14:29+00:00",
  "media:group": {
    "media:title": "PSVR 2 Is More Expensive Than A PS5 | GameSpot News",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "PSVR 2 gets a massive price tag, Modern Warfare 2 runs into more issues, and It Takes Two developer teases the team’s next game. All this on today’s GameSpot News.\n#Gaming #PlayStation #PS5 #ModernWarfare2 \n\nPSVR 2 gets a massive price tag, Modern Warfare 2 runs into more issues, and It Takes Two developer teases the team’s next game. All this on today’s GameSpot News.\n\nSony has revealed the launch date and price of the upcoming PSVR 2. The good news is the device is releasing very soon. The bad news is that it will cost you more than a PS5.\n\nOn February 22 2023, the PSVR 2 will release for $550, which is $50 more than the PS5 with a disk drive and $150 more than the digital only PS5. Sony will also sell a Horizon Call of the Mountain bundle that comes with the system and the game for $600, while the PSVR 2 Sense controller charging station will be offered on its own for $50.\n\nPSVR 2 will be available to preorder starting November 15 from Sony's online store at direct.playstation.com for shoppers in the US, UK, France, Germany, Belgium, Netherlands, and Luxembourg. Preorder registration opens today, November 2.\n\nIn addition to the release date and pricing announcement, Sony revealed a bunch more games you’ll be able to play on the system at launch.\n\nIn the vein of its previous VR title Until Dawn: Rush of Blood that came out for the first PS VR, developer Supermassive will be releasing a similar experience under its more recent Dark Pictures banner; a horror game subtitled Switchback VR that, like Rush of Blood, is a first person shooter on a rollercoaster.\n\nIn addition, shooter franchise Crossfire is coming to the device with Sierra Squad, the popular VR title Pistol Whip is being ported over, and the Cities series is getting a VR installment. For more info on all the titles announced, head to the link in the description.\n\nOn the PC side of gaming life, a Steam feature that was available at Modern Warfare 2’s launch has since been disabled. \n\nFor the unfamiliar, family sharing is a Steam feature that lets family and friends have access to games on your account. Any account can share a game with up to five other accounts, but there are some restrictions. The digital copy is essentially shared between accounts, so two players cannot play at the same time on different PCs. The feature is activated at the discretion of the game publisher and there is an option to turn it off or on in the Steam backend.\n\nWhile the game launched with this enabled, a listing on SteamDB states the feature was turned off on Halloween, preventing some players who had access to the game from playing further.\n\nActivision has yet to make an official comment, but users have speculated that family sharing can enable cheaters to avoid bans. Regardless, members of the Call of Duty community are generally unhappy with the change, citing the high price tag of the game and the desire to let other members of their household or family play without buying a second copy.\n\nTIMESTAMPS:\n00:12 - PSVR 2 https://www.gamespot.com/articles/sony-reveals-a-bunch-of-new-psvr-2-games/1100-6508821/\n01:42 - Modern Warfare 2 Steam family sharing disabled\n02:51 - Josef Fares talks Hazelight's next game",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}