{
  "title": "Galaxy and Mass Assembly (GAMA): Mid-infrared properties as tracers of galaxy environment. (arXiv:2201.10480v2 [astro-ph.GA] UPDATED)",
  "link": "http://arxiv.org/abs/2201.10480",
  "description": "<p>We investigate how different mid-infrared (mid-IR) properties of galaxies\ntrace the environment in which the galaxies are located. For this purpose, we\nfirst study the dependence of galaxy clustering on the absolute magnitude at\n3.4 $\\mu$m and redshift. Then, we look into the environmental dependence of\nmid-IR luminosities and the galaxy properties derived from these luminosities.\nWe also explore how various infrared galaxy luminosity selections influence the\ngalaxy clustering measurements. We use a set of W1 (3.4 $\\mu$m) absolute\nmagnitude ($M_\\text{W1}$) selected samples from the Galaxy and Mass Assembly\n(GAMA) survey matched with mid-IR properties from the Wide-field Infrared\nSurvey Explorer (WISE) in the redshift range $0.07 \\leq z &lt; 0.43$. We compute\nthe galaxy two-point correlation function (2pCF) and compare the clustering\nlengths between subsamples binned in $M_\\text{W1}$ and in redshift. We also\nmeasure the marked correlation functions (MCFs) using the luminosities in the\nWISE W1 to W4 (3.4 to 22 $\\mu$m) bands as marks. Additionally, we compare the\nmeasurements of MCFs with different estimates of stellar mass and star\nformation rate used as marks. Finally, we check how different selections\napplied to the sample affect the clustering measurements. We show strong\nclustering dependence on the W1 absolute magnitude: galaxies brighter in the W1\nband are more strongly clustered than their fainter counterparts. We also\nobserve a lack of significant redshift dependence of clustering in the redshift\nrange $0.07 \\leq z &lt; 0.43$. We show that although W1 and W2 bands are direct\nindicators of stellar mass, a galaxy sample selected based on W1 or W2 bands\ndoes not perfectly show the clustering behaviour of a stellar mass selected\nsample. Similar is the case with the proxy relation between W3 and W4 bands and\nstar formation rate.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Sureshkumar_U/0/1/0/all/0/1\">U. Sureshkumar</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Durkalec_A/0/1/0/all/0/1\">A. Durkalec</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Pollo_A/0/1/0/all/0/1\">A. Pollo</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bilicki_M/0/1/0/all/0/1\">M. Bilicki</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Cluver_M/0/1/0/all/0/1\">M. E. Cluver</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bellstedt_S/0/1/0/all/0/1\">S. Bellstedt</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Farrow_D/0/1/0/all/0/1\">D. J. Farrow</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Loveday_J/0/1/0/all/0/1\">J. Loveday</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Taylor_E/0/1/0/all/0/1\">E. N. Taylor</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bland_Hawthorn_J/0/1/0/all/0/1\">J. Bland-Hawthorn</a>"
}