{
  "guid": "urn:uuid:f36d9e42-ff7f-420b-9984-143353c79ce1",
  "link": "https://www.who.int/news/item/17-03-2022-france-and-who-working-together-for-effective-united-and-inclusive-global-health-governance",
  "a10:author": {
    "a10:name": ""
  },
  "title": "France and WHO: Working together for effective, united and inclusive global health governance",
  "description": "<p>On 11 March 2022 the Government of France and WHO convened for their annual strategic dialogue in Geneva, Switzerland. The meeting was opened by H.E. Mr J&eacute;r&ocirc;me Bonnafont, Ambassador, Permanent Representative, Professor J&eacute;r&ocirc;me Salomon, Director General of Health, Ministry of Solidarities and Health, and Dr Tedros Adhanom Ghebreyesus, WHO Director-General, Dr Hans Kluge, Regional Director for Europe and Dr Matshidiso Moeti, Regional Director for Africa. The discussions focused on how to strengthen the global architecture, including accelerating equitable access to health technologies within the COVID-19 response via <a href=\"https://www.who.int/initiatives/act-accelerator/about\">ACT-A</a>; health emergency preparedness and response; the &ldquo;One-health approach&rdquo;; the WHO Academy; &nbsp;Universal health coverage; non-communicable diseases; and mental health. The two partners also discussed concrete measures to enhance cooperation given the development of a new French Global Health Strategy.<br /></p><p>Her Excellency, Ms St&eacute;phanie Seydoux, French Ambassador for Global Health and Dr Tedros both agreed that the strategic dialogue had a particular resonance this year given the increasingly alarming situation in Ukraine. &ldquo;As we face an increasingly unstable world, the strategic partnership between France and WHO is ever more important,&rdquo; said Dr Tedros. &ldquo;I thank the Government of France for its longstanding commitment to safe, equitable and accessible healthcare for the most vulnerable.&rdquo;<br /></p><p>France is a key player in the global health arena and has a long and productive partnership with WHO. In order to support WHO&rsquo;s key leadership role since the beginning of the COVID-19 pandemic, France&rsquo;s contributions to WHO doubled from US$ 73 million in 2018-2019, to US$ 141 million in 2020-2021. Moreover, in the last biennium, France became one of the top five contributors of thematic funding and remains one of the donors who continue to support the core voluntary contributions account, providing valuable flexible funding to the Organization. In addition, France has now joined the Contingency Fund for Emergencies, that enables WHO to rapidly respond and disburse supplies and funds anywhere in the world in the event of a health emergency. </p><p>A leader in supporting innovative initiatives, &nbsp;in February 2022 France signed a <a href=\"https://www.who.int/news/item/09-02-2022-france-who-sign-new-agreement-to-reinforce-health-systems-to-combat-covid-19\">new &euro;50 million contribution agreement</a> with WHO supporting the ACT-Accelerator Health Systems and Response Connector to strengthen health systems to combat the COVID-19 pandemic. </p><p>&ldquo;Through our strategic partnership, we are working together to consolidate effective, united and inclusive global health governance&rdquo; said H.E. Mr Bonnafont. &ldquo;We were glad to attend this year&rsquo;s bilateral meeting, that was very fruitful, in person in Geneva,&rdquo; added H.E. Ms Seydoux. &ldquo;We covered many concrete areas of discussion and cooperation, in the acutely worrying context, and as we continue to deal with the unprecedented pandemic crisis.&rdquo; <br /></p><p>Read more about <a href=\"https://www.who.int/about/funding/contributors/fra\">France&rsquo;s strategic support to WHO</a></p><p>&nbsp;</p>",
  "pubDate": "Wed, 23 Mar 2022 11:44:20 Z"
}