{
  "title": "Man Delivers Message After Cremation! | Best of RGSO",
  "link": "https://audioboom.com/posts/8075274",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1970,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Did the spirit of a loved one return after their body had been turned to ash through cremation?<br>\nHere is a preview of the story.<br>\n“Well, I did have him cremated as he wanted but didn't throw him in the lake. I wanted to wait until my son was ready. Well - that took 7 years. I had him in a beautiful urn that suited him well. Finally, it was ok, and we decided to do this. A man that had been friends since 2nd grade wanted to give us the boat ride to the spot, we had in mind so my son, his family and I all loaded into the boat - it was a long boat ride, but the day was beautiful, and it was perfect. We revisited a few places that we had spent YEARS going to, and then got to the place. My son and I held the urn together and released it on the count of 3; it vanished in the blink of an eye, and we all started crying; his friend said, \"one last beer, buddy.\" He and my son each took one drink from hubby's favorite beer and then poured the beer into the lake, and then I placed a bunch of flowers in the water as well. (At this point I need to say that this spot is VERY deep and there is no way that anyone would ever run into it or find it or net it)<br>\n<br>\n\n</div>\n<div>The day after this happened, my son and his family had to go home. I was sitting in my favorite spot outside after they left; it was a beautiful sunny day with no wind - and I'd only been sitting there alone for a few minutes when I saw movement out of the corner of my eye - a beautiful white feather was descending to the ground in a circular movement as in a straight down coil, about 3 feet from me - I looked up - there were no birds. There was no breeze. there were no trees over me. But I saw that feather and I felt good. In my head, I felt the words \"thank you.\"”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sat, 30 Apr 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-04-29:/posts/8075274",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}