{
  "title": "Finally, a Stock Market Crash!",
  "link": "https://www.mrmoneymustache.com/2022/05/20/2022-stock-market-crash/",
  "comments": "https://www.mrmoneymustache.com/2022/05/20/2022-stock-market-crash/#comments",
  "dc:creator": "Mr. Money Mustache",
  "pubDate": "Fri, 20 May 2022 21:13:33 +0000",
  "category": [
    "The MMM Blog",
    "investing",
    "stock market"
  ],
  "guid": "https://www.mrmoneymustache.com/?p=18141",
  "description": "Well, that was kinda sudden! In the three months or so since we last spoke, the world has become an entirely different place &#8211; at least for those of us who keep up with any sort of international, financial or stock market news.&#160; The headlines are new, and the problems are of course very real. [&#8230;]",
  "content:encoded": "<a class=\"featured_image_link\" href=\"https://www.mrmoneymustache.com/2022/05/20/2022-stock-market-crash/\"><img style=\"max-width:100%;height:auto\" width=\"800\" height=\"600\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art.jpg\" class=\"attachment-full size-full wp-post-image\" alt=\"\" loading=\"lazy\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-300x225.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-200x150.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-768x576.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-150x113.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-320x240.jpg 320w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></a>\n\n<p></p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art.jpg\" alt=\"\" class=\"wp-image-18153\" width=\"352\" height=\"264\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art.jpg 800w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-300x225.jpg 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-200x150.jpg 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-768x576.jpg 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-150x113.jpg 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/traintrack-art-320x240.jpg 320w\" sizes=\"(max-width: 352px) 100vw, 352px\" /><figcaption>Boom!</figcaption></figure></div>\n\n\n\n<p>Well, that was kinda sudden!</p>\n\n\n\n<p>In the three months or so since we last spoke, the world has become an entirely different place &#8211; at least for those of us who keep up with any sort of international, financial or stock market news.&nbsp;</p>\n\n\n\n<p>The headlines are new, and the problems are of course very real. Russia has started one of the biggest, shittiest wars in a generation &#8211; killing untold thousands of people, displacing millions, and halting trillions of dollars of production and trade. This has compounded the “everything shortage” of broken supply chains that we have all been feeling for the past two years, creating even more <strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/2022/01/11/inflation-should-we-be-worried/\" target=\"_blank\">inflation</a></span></strong> especially in oil prices. And just to amplify everything even further, China has launched a batshit crazy (and medically impossible) “zero covid” policy, locking down hundreds of millions of its own people who can no longer produce or export the things that the rest of the world’s economy had grown to rely upon.</p>\n\n\n\n<p>The resulting shortage of goods and workers has created rising prices (inflation), which has triggered our central bankers to finally rise from their slumber and start jacking up interest rates.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021.png\" alt=\"\" class=\"wp-image-18142\" width=\"642\" height=\"292\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021.png 972w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021-300x137.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021-200x91.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021-768x350.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021-150x68.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/mortgage-rates-2021-900x410.png 900w\" sizes=\"(max-width: 642px) 100vw, 642px\" /><figcaption>Slamming on the Brakes: Mortgage rates have almost doubled in just nine months.</figcaption></figure></div>\n\n\n\n<p>Which has in turn triggered the more skittish stock investors to run for the exits and completely change their view of our economic future, flooding the financial news with red ink and scary headlines.</p>\n\n\n\n<p>The bottom line is that the overall US stock market is down about 20% over the past three months. Which means that if you add up your net worth as I do occasionally, you may find that almost a fifth of it has suddenly gone up in smoke.&nbsp;</p>\n\n\n\n<p>Fortunately, this is just an illusion. While the human side of every war is awful and you should help out if you can, the financial side of this panic is very normal and we were overdue for something like this to happen.</p>\n\n\n\n<p>A 20% drop in stock prices is called a “bear market” and they <em>traditionally </em>happen every few years, lasting just 9 months or so from top to bottom. But in the Mustachian Era (the years since 2011 when I <span style=\"text-decoration: underline;\"><a href=\"https://www.mrmoneymustache.com/all-the-posts-since-the-beginning-of-time/\" target=\"_blank\" rel=\"noreferrer noopener\">started writing this blog</a></span>), there has only been one: the 2020 Covid Crash which only lasted about a month. Heck, even in my 25 year investing lifetime (roughly 1997 to present), there have only been a handful:</p>\n\n\n\n<figure class=\"wp-block-table aligncenter is-style-stripes\"><table><tbody><tr><td>Bear market date</td><td>Decline (peak to trough)</td><td>Duration (months)</td></tr><tr><td>March 2000 &#8211; Sept 2001 (dotcom bust)</td><td>-36%</td><td>18</td></tr><tr><td>Jan &#8211; October 2002 (more dotcom+housing)</td><td>-34%</td><td>9</td></tr><tr><td>Oct 2007-Nov 2008 (great financial crisis)</td><td>-52%</td><td>14</td></tr><tr><td>Jan &#8211; Mar 2009 (more GFC)</td><td>-28%</td><td>2</td></tr><tr><td>Feb-March 2020 (covid crash)</td><td>-34%</td><td>1</td></tr><tr><td>April 2022 &#8211; ??? (the current blowup)</td><td>-20% so far</td><td>What&#8217;s your guess?</td></tr></tbody></table><figcaption>Data source: S&P market data</figcaption></figure>\n\n\n\n<p>.</p>\n\n\n\n<p>So if you’re under 40, some of this may feel unfamiliar.</p>\n\n\n\n<p>Now that we’ve covered the background, we can get into some better news:</p>\n\n\n\n<ul><li>This is all a normal, healthy part of the economic cycle. In fact, our central bankers have deliberately created this situation for your own good and they probably should have done it a year ago.</li><li>If you are still buying or holding shares (as opposed to actively selling them), this stock market crash is actually <em>making you richer</em></li><li>Even if you are retired and living entirely off of your investments, stock market declines are to be expected and should not derail your life of leisure &#8211; as long as you are following a rough approximation of <span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/2012/05/29/how-much-do-i-need-for-retirement/\" target=\"_blank\">the 4% rule</a></span> and remain flexible and understand the concept of a <a rel=\"noreferrer noopener\" href=\"https://www.mrmoneymustache.com/2011/10/17/its-all-about-the-safety-margin/\" target=\"_blank\">Safety Margin</a>.</li></ul>\n\n\n\n<p>If you really understand the points above and really feel <em>excited </em>about them, you can drop the fear and stress out of your investing life, which means you will live a life that is both wealthier, and more fun. So let’s cover each point properly, so you can be excited about all this as I am.</p>\n\n\n\n<p><strong>1) Why is this healthy again?</strong></p>\n\n\n\n<p>First, the part about the Federal Reserve and why a central banking system is so useful (despite the claims of financial anarchists like Bitcoin lovers):</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/image.png\" alt=\"\" class=\"wp-image-18151\" width=\"279\" height=\"124\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/image.png 685w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/image-300x134.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/image-200x89.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/image-150x67.png 150w\" sizes=\"(max-width: 279px) 100vw, 279px\" /></figure>\n\n\n\n<p> When something bad happens (like the sudden deliberate recession we caused due to our own 2020 Covid shutdowns), the Fed can drop interest rates and &#8220;print money&#8221; in other ways to boost investment and demand in the economy. And it works &#8211; this is why our economy bounced back so quickly from the largest slowdown in history. </p>\n\n\n\n<p>Some might say it worked too well &#8211; while we have benefited from record low unemployment, we have also seen prices of houses, stocks, and everything else rise with alarming speed. So eventually, they had to turn off the booster.</p>\n\n\n\n<p>By raising interest rates, the central bankers  put a slight drag on business spending, consumer borrowing and stock market exuberance. This lowers demand for <em>everything</em>, which pours some cold water on inflation. The deflating of the most overpriced stocks shows that the policy is working. And over the next year, higher mortgage rates should also end the crazy bidding war of a housing market we&#8217;ve been seeing in most cities.</p>\n\n\n\n<p>But stock market crashes and even brief recessions are good for more than just fighting inflation. They&#8217;re good for fighting a persistent flaw in human nature itself.</p>\n\n\n\n<p>Humans are lazy creatures at heart. When things get too easy, we lose our edge and our motivation to learn, innovate and make changes. It happens at the individual level, as I notice when I waste certain evenings on the couch accomplishing nothing. And it happens even more in the collective sense, if a group of people secures a nice stream of power and profit that remains unchallenged.</p>\n\n\n\n<p>Imagine that you’re running a company. Your customers keep buying your stuff no matter what you do, investors bid your stock price up to the moon regardless of your financial performance, and there is no competition on the horizon. What do you think will happen to your monopoly?</p>\n\n\n\n<p>There’s no need to speculate on this, because it has happened to varying degrees since the beginning of economic time. The answer is that <strong>you start to suck. </strong>Your product innovation stagnates, your customers grow less and less happy, and your investors grow nervous. Eventually, something comes along to poke at this bubble of complacency &#8211; in this case war and covid and inflation &#8211; and then POP! &#8211; your sales dry up, your stock price crashes, and your cozy corporate desk has turned into a tattered lawn chair in the parking lot and your business is done.</p>\n\n\n\n<p>But wait! While you were adding that final layer of lipstick to your obsolete film camera or manual typewriter or gasoline-powered line of cars and trucks, there actually <em>were </em>competitors out there, inventing better products and offering better customer service and keeping their balance sheets lean, because they had to, because things for them were <em>hard</em>.&nbsp;</p>\n\n\n\n<p>Your inefficient company goes out of business, and your more nimble competitors welcome your former customers. They may even suck up the best of your former employees and buy your old factory to start making new, better products.</p>\n\n\n\n<p>This happens all the time, and while it can be painful for those who weren’t prepared, it’s a healthy thing for business overall. And a healthy thing for overpriced housing markets, and the speculatively inflated prices of oil, lumber, copper and everything else. </p>\n\n\n\n<p>To a certain extent, the high prices were useful in sending a signal that we need to produce <em>more </em>of these things.&nbsp;But beyond that limit, people started buying overpriced stocks, houses, cryptocoins and commodities simply because they hoped to make a quick buck by flipping them to someone else at a higher price. Instead of investing in a productive asset, these speculators were just assuming the recent momentum would continue. This type of gambling is a waste of everyone’s time, and a good price crash is the way we flush the financial toilet.</p>\n\n\n\n<p><strong>2) My net worth has just cratered by 20%. How exactly does this mean I am getting richer?</strong></p>\n\n\n\n<p></p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><a href=\"https://twitter.com/mrmoneymustache\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-1024x426.png\" alt=\"\" class=\"wp-image-18157\" width=\"442\" height=\"184\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-1024x426.png 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-300x125.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-200x83.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-768x319.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-150x62.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey-900x374.png 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/MMM-twitter-survey.png 1188w\" sizes=\"(max-width: 442px) 100vw, 442px\" /></a><figcaption>Results of a recent Twitter poll &#8211; Mustachians are well ahead of average Americans, of whom only about 18% consider this a buying opportunity (!)</figcaption></figure></div>\n\n\n\n<p>The first thing to ask yourself is, “20% of <em>what?</em>”&nbsp;</p>\n\n\n\n<p>Sure, stock prices are down from a recent peak, but that peak itself was just an arbitrary fleeting moment of investor enthusiasm. Was that previous price really the “right” value for stocks, or did you just grow attached to it because of our known human weakness of Loss Aversion?</p>\n\n\n\n<p>To put it another way, what if instead of looking at our investments as the financial media likes to portray them, which is like this:</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/stock-market-crash.png\" alt=\"\" class=\"wp-image-18144\" width=\"491\" height=\"337\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/stock-market-crash.png 657w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/stock-market-crash-300x205.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/stock-market-crash-200x137.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/stock-market-crash-150x103.png 150w\" sizes=\"(max-width: 491px) 100vw, 491px\" /><figcaption>Financial media: &#8220;Aaack, scary red line just dropped to ZERO!!!&#8221;</figcaption></figure></div>\n\n\n\n<p>What if we decided to be more sensible, <strong>start the damned Y axis at zero</strong> as every graph should do, and zoom out to a reasonable time horizon,such as the Age of Mustachianism which happened to begin in 2011. And ignore the wiggly blue line and follow the more meaningful red line.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-1024x450.png\" alt=\"\" class=\"wp-image-18145\" width=\"562\" height=\"247\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-1024x450.png 1024w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-300x132.png 300w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-200x88.png 200w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-768x337.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-150x66.png 150w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index-900x395.png 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/US-stock-index.png 1250w\" sizes=\"(max-width: 562px) 100vw, 562px\" /><figcaption>More accurate representation: &#8220;Whoa, stocks are a great long-term investment!&#8221;</figcaption></figure></div>\n\n\n\n<p>Well, how interesting. Not only has this crash returned us to a roughly straight line of longer term stock market growth, but that line itself is <em>very </em>generous, representing a 12.8% annual compound gain if you factor in a quarterly reinvestment of dividends (which typically add about 2% to your annual returns but aren’t shown in these charts). Over longer periods like 50 years, stock returns have been closer to 10% after dividends, which means we’ve still had more than our share of good times.&nbsp;</p>\n\n\n\n<p>In the long return, stock prices are determined by this formula:</p>\n\n\n\n<p><strong>Stock price = company earnings x BRM*</strong></p>\n\n\n\n<p>*(Bullshit Random Multiplier)</p>\n\n\n\n<p>The BRM, more formally known as the Price-to-Earnings ratio or P/E, is supposed to be based on a mathematical estimate of the present value of all future dividends you will receive if you hold a stock for the entire life of the company.</p>\n\n\n\n<p>&nbsp;When we expect higher interest rates or inflation over the next 20 years, the P/E should fall because those distant future earnings become worth less in today’s dollars. Meanwhile, if we somehow realize that the long-term future of the business world is even more rosy than we thought, the P/E should rise because investors can accurately predict a larger stream of future earnings. </p>\n\n\n\n<p>But the “bullshit” factor comes in due to things like the “He Said She Said” nature of whatever Elon posted on Twitter today, momentum trading algorithms, meme stock traders banding together to drive up random stocks regardless of underlying value, and more. In short, the short term BRM is just a measure of the present moment’s balance of greed and fear.</p>\n\n\n\n<p>As an investor, however, you don’t care about the BRM. In fact, you don’t even really care about the share prices of your investments, because the price of an individual share only matters twice in your lifetime:</p>\n\n\n\n<ul><li>The moment you buy it,&nbsp;</li><li>And the moment you sell it.&nbsp;</li></ul>\n\n\n\n<p>Everything else is just silly noise.</p>\n\n\n\n<p>Right now, most of us are still earning money and accumulating more shares. Even Mr. Money Mustache, as a person who retired 17 years ago, is still in this boat for the simple reason that my retirement income from dividends and hobby businesses is still greater than my annual living expenses (which still hover around $20,000 per year).</p>\n\n\n\n<p>On top of this, if you are holding mostly index funds as you should be, your stocks deliver a nice helping of dividends every three months, which you have set to automatically reinvest into still more shares of those same index funds. In today’s market, you are getting about <strong>25% more shares </strong>for each dollar that you invest. Which translates to a full 25% more wealth from those shares in your future. </p>\n\n\n\n<p>(It&#8217;s fun math &#8211; a 20% drop in prices means you get 25% more shares for your dollar, and a 50% drop means <em>twice as many</em>, or<em> </em>100% more shares per dollar invested.)</p>\n\n\n\n<p><strong>3) Okay, but I really am retired and trying to live off my investments now. How is this not a disaster for me?</strong></p>\n\n\n\n<p>First of all, you’re still getting the dividends that we celebrated in point 2) above. When the stock market crashes, dividend payments usually remain far more stable because the big, established companies in your index funds continue to make money.&nbsp;</p>\n\n\n\n<p>It’s quite similar to owning a portfolio of rental houses spread throughout the world: while house prices fluctuate all the time in different cities, the total rent paid by a group of thousands of tenants will tend to remain pretty stable and just rise at the rate of inflation.</p>\n\n\n\n<p>So this stream of money will keep coming in and covering a substantial portion of your living expenses (between 30% and 50% for most retirees in today’s market conditions if you retired using the 4% rule).&nbsp;</p>\n\n\n\n<p>Even if you don’t adjust your spending or income during this bear market, the end result is that you simply need to sell a tiny percentage of your shares at a discount during the bear market &#8211; which means your portfolio shrinks a bit faster.&nbsp;</p>\n\n\n\n<p>But the 4% rule already takes this into account: if there were no such thing as bear markets, the safe withdrawal rate would actually be equal to the long-term average of stock market growth, which is closer to 7% after inflation. By sticking to 4% or slightly less, you are giving yourself a high chance of weathering the storm.</p>\n\n\n\n<p><strong>cFireSim: Economic History to the Rescue!</strong></p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large is-resized\"><a href=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation.png\" target=\"_blank\" rel=\"noopener\"><img loading=\"lazy\" src=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-843x1024.png\" alt=\"\" class=\"wp-image-18147\" width=\"329\" height=\"400\" srcset=\"https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-843x1024.png 843w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-247x300.png 247w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-148x180.png 148w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-768x933.png 768w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-124x150.png 124w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation-900x1093.png 900w, https://www.mrmoneymustache.com/wp-content/uploads/2022/05/cfire-simulation.png 1031w\" sizes=\"(max-width: 329px) 100vw, 329px\" /></a><figcaption>What if I &#8220;retired&#8221; at age 47 on $1 million, hoping to spend $40k (rising with inflation) for the next 50 years? <br>Assuming a small $1k boost from social security in my 60s, I&#8217;d have a 95% historical success rate. Only the Great Depression and the 1960s slump would have foiled this plan, and even then just barely.</figcaption></figure></div>\n\n\n\n<p>To really understand what this means I reached out to Lauren Boland, the financial calculations wizard behind the amazing <strong><span style=\"text-decoration: underline;\"><a rel=\"noreferrer noopener\" href=\"https://cfiresim.com/\" target=\"_blank\">cFireSim retirement simulator</a></span></strong>. Her long-running site gives you the best shot at answering the question: “If I retire with a fixed chunk of money, what are my chances of success?”&nbsp;</p>\n\n\n\n<p>I asked her what it really means when the stock market drops: does a 20% drop really make you 20% less &#8220;retired&#8221; or is actual outcome more subtle? True to form, she got back to me within just a few minutes with these thoughts:</p>\n\n\n\n<p><strong>MMM: <em>How should potential retirees think of the recent crash in valuation &#8211; has it really pushed out their retirement date, or not?&nbsp;</em></strong></p>\n\n\n\n<p><strong>Lauren: </strong></p>\n\n\n\n<p><em>It depends on how flexible you are willing to be with your spending. As stocks get more expensive (a higher price-to-earnings ratio), it can be a perfect time to spend more (take those gains), and when they drop in value (like right now), you may want to spend less to preserve your capital.&nbsp;</em></p>\n\n\n\n<p><em>We have a name for the this idea of stock crashes that come at just the wrong time: the <strong>Sequence of Returns Risk</strong>. If you retire just BEFORE a big stock market crash, your first few months or years will drain your portfolio a bit more than you expected, until stock prices recover. So, recent retirees are living this right now if they retired without much safety margin. </em></p>\n\n\n\n<p><em>On the other hand, If you HAVEN&#8217;T retired yet, and your numbers still look good even now, I think it may actually be a better time to retire, since you can hope that history repeats itself and there is a recovery.&nbsp; It&#8217;d be like retiring at the bottom of 2009 with still-decent numbers.&nbsp;</em></p>\n\n\n\n<p>&#8212; (thanks Lauren!) &#8212;</p>\n\n\n\n<p>Okay, so we&#8217;re probably not screwed either way. But still, as a Mustachian this seems like a <em>great </em>excuse to refer to point #1 above: use the chaos and disruption as an excuse to make yourself <em>stronger. </em>Become more efficient with your spending, find enjoyable ways to create value for others that happen to produce money for you as well, and improve your exercise, eating and personal growth programs as well. Because hey, why not?</p>\n\n\n\n<p><strong>Epilogue: How does all this Misery end?</strong></p>\n\n\n\n<p>Although you now understand that even the current situation is normal and healthy, there is even better news at the core of it: It’s a self-correcting problem, and the solution is already in the works.</p>\n\n\n\n<p>A shortage of goods, a sloshing overflow of the money supply and inappropriately low interest rates led to everything getting more expensive. But meanwhile, companies have built more factories and hired more workers to increase production <em>and </em>now the central banks have cranked up interest rates and reversed their other support programs as well.&nbsp; </p>\n\n\n\n<p>The result: mortgages cost more so housing sales have slowed. Consumers and businesses are both pissed off by recent price increases and more cautious about the future so they are buying less stuff, which reduces the Everything-Shortage that we mentioned earlier. Suddenly, supply catches up to demand and prices stop rising.</p>\n\n\n\n<p>Or to summarize all of this in a much pithier way: <strong>the solution to high prices, is high prices.</strong></p>\n\n\n\n<p>The world is scary and the stock market has plunged, but the fundamental picture hasn’t changed at all: billions of humans are working hard and applying their ingenuity every day to get ahead. It’s a messy process, but on average we continue to succeed at this task over time.&nbsp; People who understand this unchanging mechanism will look at this year’s sale on productive asset and say, “Cool &#8211; sign me up for another helping of future wealth, and thanks for the deal!”</p>\n\n\n\n<p>In the comments &#8211; what are YOU doing in response to this bear market? Are you scared, or doubling down on investing?</p>\n",
  "wfw:commentRss": "https://www.mrmoneymustache.com/2022/05/20/2022-stock-market-crash/feed/",
  "slash:comments": 167,
  "post-id": 18141
}