{
  "title": "S02.11: Romance Recommendations: Stump Jen and Sarah",
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 20 Nov 2019 09:10:58 +0000",
  "link": "https://fatedmates.net/episodes/2019/11/18/s0211-romance-recommendations-stump-jen-and-sarah",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5dd2e2b18bb1200489577b53",
  "description": "<p class=\"\">Stay tuned for the second half of the episode in December! Next week, just in time for your tryptophan induced coma, we’re talking Loretta Chase’s <em>Lord of Scoundrels</em>, which was on both Jen & Sarah’s list, and is on the lions’ share of Best Romance Novels Ever lists. We’ll get into why. Read <em>Lord of Scoundrels</em> at <a href=\"https://amzn.to/2oQXq61\">Amazon</a>, <a href=\"https://www.barnesandnoble.com/w/lord-of-scoundrels-loretta-chase/1100616009?ean=9780061753817\">Barnes & Noble</a>, <a href=\"https://books.apple.com/us/book/lord-of-scoundrels/id360602857?app=itunes&at=1l3vpAR&mt=11\">Apple Books</a>, <a href=\"https://www.kobo.com/us/en/ebook/lord-of-scoundrels\">Kobo</a> or <a href=\"https://www.indiebound.org/book/9780380776160\">your local indie</a>.</p><p class=\"\"><strong>Show Notes</strong></p><p class=\"\"><strong>Question 1</strong>: Ennis from New York asked, \"is like <a href=\"https://amzn.to/2OrcOi9\">Lothaire</a> by Kresley Cole or <a href=\"https://amzn.to/2O4UHQh\">Cold Cole Heart</a>by K Webster, where the hero is someone who would be a villain in any other book. A megalomaniac, horribly damaged, murderous, whatever- and a heroine who takes NONE of his shit and brings him to his knees.\"</p><p class=\"\"><strong>Our Recommendations</strong>: The name of <a href=\"https://tvtropes.org/pmwiki/pmwiki.php/Main/MoralityChain\">this trope is \"morality chain\"</a> which might help you on your search for books like this. <a href=\"https://ew.com/books/2019/10/24/sarah-maclean-bareknuckle-bastards-daring-and-the-duke-cover/\">Sarah's Summer 2020 release Daring and the Duke</a> is perfect for this question, but since it's not out yet, try The Masterpiece Duet by Skye Warren. The first is <a href=\"https://amzn.to/2QInjR9\">The King</a>.</p><p class=\"\"><strong>Question 2:</strong> Lesley from Washington DC asked for books \"with Jewish heroes and heroines, does not have to be holiday themed.\"</p><p class=\"\"><strong>Our recommendations: </strong>: Jen suggests <a href=\"https://amzn.to/2pB19oE\">Knit One, Girl Two</a> and <a href=\"https://amzn.to/2OvKKtU\">Cinnamon Blade</a> by Shira Glassman. In fact, <a href=\"http://heavingbosoms.libsyn.com/ep-91-cinnamon-blade-knife-in-shining-armor-by-shira-glassman-with-jenreadsromance\">Jen was a special guest on the Heaving Bosoms podcast</a> taking about Cinnamon Blade. Sarah recommends <a href=\"https://amzn.to/2r2TNe3\">Craving Flight</a> by Tamsen Parker and <a href=\"https://amzn.to/2Ox3Cci\">Dalliances and Devotion</a> by Felicia Grossman. <a href=\"https://twitter.com/nystacey\">Stacey Agdern</a> also writes about <a href=\"https://www.heyalma.com/were-obsessed-with-these-jewish-romance-novels/\">Jewish representation in romance</a> and has written some novellas in the Rogue Anthologies. We also mentioned a <a href=\"https://twitter.com/HFeliciaG/status/1187765935257640961\">great point</a> that inspired a <a href=\"https://twitter.com/HFeliciaG/status/1187810638384504832\">great thread</a> by <a href=\"https://twitter.com/HFeliciaG\">Felicia Grossman</a> about Jewish characters in literature.</p><p class=\"\"><strong>Question 3:</strong> Daniela from Winnipeg had this AMA question: If there was a battle royale between all the IAD heroes, who would win? Does the answer change if they can't use weapons?</p><p class=\"\"><strong>Our Answer:</strong> The Wroth brothers would band togehter, Declan Chase has a real shot, and Lothaire wouldn't care. No matter who wins, Thronos goes down first. Jen mentioned someone who wrote about <a href=\"https://faceintheblue.wordpress.com/2012/08/22/in-a-mass-knife-fight-to-the-death-between-every-american-president-who-would-win-and-why/\">what would happen if all the US Presidents were in a knife fight</a>. Enjoy.</p><p class=\"\">FWIW, Daniela also asked a question we skipped because we couldn't think of anything: <em>A historical that has a silver fox duke and a spitfire heroine who exhausts the hell out of him</em>. IDEAS? Let us know on twitter.</p><p class=\"\"><strong>Question 4:</strong> Kristen from DC! asked, \"LGBTQ romance easily available in PRINT for my book club???? We do it through a local indie bookshop, and are having a hard time finding things other than Cat Sebastian/Olivia Waite from Avon.\"</p><p class=\"\"><strong>Our Recommendations:</strong> Adriana Herrera's <a href=\"https://amzn.to/2QywELd\">American Dreamer</a> series! <a href=\"https://amzn.to/37lAuxd\">Red, White, and Royal Blue</a> by Casey McQuiston. We think <a href=\"https://www.amazon.com/Vanessa-North/e/B008HIQXI0?qid=1574177757&ref=sr_ntt_srch_lnk_1&sr=1-1\">Vanessa North</a> and <a href=\"https://www.amazon.com/s?i=stripbooks&k=KJ%20charles&ref=nb_sb_noss\">KJ Charles</a> might be <a href=\"https://www.ingramspark.com/blog/print-on-demand-for-indie-publishers\">print on demand</a>, which many indie bookstores won't carry. Dreamspinner is a mess right now, but many great authors are there, including LaQuette's latest, <a href=\"https://amzn.to/2CZKxKl\">Under His Protection</a>, which Jen bought a copy of at <a href=\"http://lovessweetarrow.com/index.html\">Love's Sweet Arrow</a>. Carina titles might be more easily available, so try <a href=\"https://amzn.to/2Kz68xa\">Syncopation</a> and the rest of the <a href=\"https://amzn.to/35b4fyG\">Twisted Wishes</a> series by Anna Zabo. Jen mentioned <a href=\"https://amzn.to/2QtZT1H\">Being Hospitable by Meka James</a>, but it's just in E. But you should still read it for fun.</p><p class=\"\"><strong>Question 5:</strong> Courtney from the <a href=\"http://www.bodicetipplers.com/\">Bodice Tipplers Podcast</a> wants to know what books made us fall in love with the genre.</p><p class=\"\"><strong>Our answer:</strong> Well, just listen to all of season 2 of Fated Mates! But Sarah mentioned <a href=\"https://amzn.to/2QywdjL\">Nobody's Baby but Mine</a> by Susan Elizabeth Phillips. Jen mentioned a new book that has made her feel that way is <a href=\"https://amzn.to/35izqbv\">The Bride Test</a> by Helen Hoang. Julie Garwood and Jude Deveraux were old-school authors we both loved back in the day.</p><p class=\"\"><strong>Question 6</strong>: Ali in NYC had an AMA and a question: How is Eric Mortensen so good at podcast editing?</p><p class=\"\"><strong>Our answer</strong>: Well, he just is and you should <a href=\"mailto:eric@ericmortensen.net\">contact him</a> if you need podcast editing help.</p><p class=\"\">Ali also wanted recommendations about historicals with witches/magic. Our recommendations: So many of these are old school, because this is not a very popular trope right now, so please proceed with caution. Sarah recommended <a href=\"https://amzn.to/37deog6\">Bewitching by Jill Barnett</a> and Jen recommended a pair of books by Teresa Medeiros, <a href=\"https://amzn.to/343WFpl\">Breath of Magic</a> and <a href=\"https://amzn.to/2rccxrh\">Touch of Enchantment</a>. In fact, Jen reviewed <a href=\"https://www.tbqsbookpalace.com/2017/09/throwback-review-touch-of-enchantment.html\">Touch of Enchantment for The Book Queen</a>. Post-recording, we thought of <a href=\"https://amzn.to/2Qz4D6b\">Sex and the Psychic Witch</a> by Annette Blair, which is the first of a series where three sisters use their \"magic powers for good and their good looks for seduction.\"</p><p class=\"\"><strong>Question 7</strong>: Hannah from Texas asked for a romance that \"has a Lucy Liu in \"Set It Up\" type heroine getting her actual HEA. I need ball-busting energy falling in love with a guy/gal/whoever that deserves her.\"</p><p class=\"\"><strong>Our Recommendations:</strong> Sarah recommended <a href=\"https://amzn.to/2CZ74Xy\">The Takeover Effect</a> by Nisha Sharma which has a corporate espionage plot. Jen was maybe thinking of <a href=\"https://en.wikipedia.org/wiki/Set_It_Off_(film)\">Set it Off</a> and recommeded Elle Kennedy's Out of Uniform series. Jen mentioned <a href=\"https://amzn.to/2CZ7b5q\">Getting Hotter</a> by Elle Kennedy, but upon further reflection, also thinks The Heat is On (in an anthology called <a href=\"https://amzn.to/2KB2G58\">Hot & Heavy</a>) might work. But since Hannah was actually talking about <a href=\"https://en.wikipedia.org/wiki/Set_It_Up\">Set it Up</a>, which is about assistants and bosses, maybe try <a href=\"https://amzn.to/2OqTzoP\">The Assistant</a> by Ramona Gray or check out this extensive <a href=\"https://www.goodreads.com/shelf/show/boss-employee-romance\">goodreads list of boss/employee romance novels</a>.</p><p class=\"\"><strong>Question 8: </strong>Jenica from New York asked for a book that has \"Childhood friends to enemies to lovers, preferably contemporary.\"</p><p class=\"\"><strong>Our recommendations: </strong>: We don't say it here, but one strategy Sarah and Jen use all the time with more popular tropes is searching for a Goodreads list. If you can find a book with a title or two you like on it, you might like others! Jen recommended <a href=\"https://amzn.to/2OsMVhP\">His Until Midnight</a> by Reese Ryan, and also noted that Sarah's book <a href=\"https://amzn.to/2XtABlw\">A Rogue by Any Other Name</a> has this trope. Sarah recommended <a href=\"https://amzn.to/2XutsBt\">Punk 57</a> by Penelope Douglas. And a trailing suggestion was trying <a href=\"https://amzn.to/2pBE70W\">Christina Lauren</a>, who has written many great enemies to lovers books and maybe one also has childhood friends. We didn't mention it on the podcast, but if you like YA, Jen loved <a href=\"https://amzn.to/346ntW8\">Not if I Save You First</a> by Allie Carter. That one would definitely work!</p><p class=\"\"><strong>Question 9:</strong> Holly from Chapel Hill asked for a book that \"Has all the mutual pining. Friends to lovers, enemies to lovers, doesn't matter. Give me every last drop of pining.\"</p><p class=\"\"><strong>Our recommendations</strong>: Sarah suggests <a href=\"https://amzn.to/37hzw4W\">Waking Up with the Duke</a> by Lorraine Heath. Jen recommends <a href=\"https://amzn.to/35eAyNe\">On Broken Wings</a> by Chanel Cleeton. After we realized that there is lots of pining in Lisa Kleypas, but we think Again the Magic might be best.</p><p class=\"\">Holly had a follow up AMA, \"What would your ideal book-centered vacation be?\" Sarah said a beach, Jen has always wanted to stay at <a href=\"https://libraryhotel.com/\">The Library Hotel</a>, and that led to a discussion of Nora Robert's <a href=\"https://innboonsboro.com/\">Boonsboro Inn</a>, in Boonsboro, Maryland. But Jen also loves to read locally, which means reading books set in the places you are traveling.</p><p class=\"\"><strong>Question 10:</strong> Kara asked for a recommendation that \"Has some sort of adventure or quest but is also slow burn.\"</p><p class=\"\"><strong>Our recommendations: </strong>Slow burns aren't our speciality. Jen joked she likes a \"fast, incendiary burn.\" Please check out the Hidden Legacy series by Ilona Andrews, and the second one where they finally do it is called <a href=\"https://amzn.to/35fW18p\">White Hot</a>. The first one is called <a href=\"https://amzn.to/2QF4ON4\">Burn For Me</a>, it's right in the title! If you like fantasy, try <a href=\"https://amzn.to/2D0e4nb\">Bound to the Battle God</a> by Ruby Dixon. Sarah mentioned <a href=\"https://amzn.to/32ZSMAz\">A Promise of Fire</a> by Amanda Bouchet. And <a href=\"https://amzn.to/2OwAWjk\">Aurora Blazing</a> by Jessie Mihalik could count for this category and for pining!</p><p class=\"\"><strong>Question 11</strong>: Chase from Germany wants \"Has m/m with a happy ending and the trope enemies to lovers?\"</p><p class=\"\"><strong>Our recommendations</strong>: Sarah recommends <a href=\"https://amzn.to/332sLAH\">Goalie Interference</a>, which has enemy hockey players. Annika Martin has a good series, the first is called <a href=\"https://amzn.to/35eOdE7\">Enemies Like You</a>, and Jen also likes a series by Layla Rayne called <a href=\"https://amzn.to/2QA0UFy\">Agents Irish and Whiskey</a>. <a href=\"https://amzn.to/2OlODl2\">Cask Strength</a> also appeared in Jen's list of <a href=\"https://www.tbqsbookpalace.com/2019/06/who-did-it-better-on-pool-table.html\">Who Did It Better on a Pool Table</a>. You're welcome.</p><p class=\"\"><strong>Question 12</strong>: Caitlin from Wisconsin wants a book that \"Has a plus size heroine, emphasis on fashion...vampires would also be nice.\"</p><p class=\"\"><strong>Our recommendations</strong>: We had to handle these two separately. For a curvy heroine with fasion, we recommended <a href=\"https://amzn.to/346FSC4\">Take Me</a> by Bella Andre and <a href=\"https://amzn.to/2KB48Vt\">The King of Bourbon Street</a> by Thea De Salle. For vampires, try <a href=\"https://amzn.to/2OtwnX5\">Tall Dark and Hungry</a> by Lynsay Sands. It's about a vampire who writes vampire novels. The Sherrilyn Kenyon book Sarah was thinking about is called <a href=\"https://amzn.to/2CXC22a\">Night Play</a>, but it's actually about a werewolf. Oh well.</p><p class=\"\"><strong>Question 13:</strong> Jess asked, \"Has an alpha submissive (I’ve tasked Sarah with this before and want more!)\"</p><p class=\"\"><strong>Our recommendations: </strong>Jen doesn't think this exists, but Sarah recommends <a href=\"https://amzn.to/2XwLO4N\">The Duke I Tempted</a>, <a href=\"https://amzn.to/32XzWKo\">Giving It Up</a>, <a href=\"https://amzn.to/2CZOdvA\">The Devil's Submission</a> and Sierra Simone's <a href=\"https://amzn.to/37m8U2N\">New Camelot series</a>. If you can roll with Kristen Ashley's prose style, try <a href=\"https://amzn.to/2O25VVo\">Deacon</a>. There is no pony play involved.</p><p class=\"\">Jess had a follow up AMA: \"I would love to hear more about audiobook production. How much say authors have. Do they get to check in during production to make sure jokes are being delivered properly, etc?\" Sarah replied that the answer is ... authors don't have much say at all, except maybe a choice of narrators. Sarah loves her narrator, Justine Eyre.</p><p class=\"\"><strong>Question 14</strong>: Lesley from San Francisco asked for a book that \"Has a heroine over 50 who is single (not divorced or widowed).\"</p><p class=\"\"><strong>Our recommendations:</strong> This was a hard one, and we are hoping that listeners will chime in with answers. We don't think any of these heroines are single--all widowed or divorced. But try <a href=\"https://amzn.to/334MnUC\">Apples Are Red</a>, <a href=\"https://amzn.to/2CWKIpG\">Driving in Neutral</a>, <a href=\"https://amzn.to/2CWDqSQ\">Bound with Love,</a> or <a href=\"https://amzn.to/2OwpcgM\">Mrs. Martin's Incomparable Adventure</a>. But, you can check out this <a href=\"https:///groupwww.facebook.coms/958318970951705/\">facebook group for seasoned romance</a>, and <a href=\"https://twitter.com/tarheelmom1\">Donna</a>posts a weekly Frolic column of seasoned romances. Finally, Sarah recommended London Hale's <a href=\"https://amzn.to/330SlWH\">Talk Dirty To Me.</a></p><p class=\"\"><strong>Question 15:</strong> Carly from Atlanta is looking for “there’s only one bed,” historical edition (bonus points if they don’t have sex that time, but do later).</p><p class=\"\"><strong>Our recommendations:</strong> There are so many of these that we had a hard time answering. Yikes! But <a href=\"https://amzn.to/2XwyqxW\">A Christmas Gone Perfectly Wrong</a> is amazing. Later in Season 2 of Fated Mates, we'll read <a href=\"https://amzn.to/2O1eCzm\">Devil's Bride</a> by Stephanie Laurens, but the ohter one Sarah was thinking of was <a href=\"https://amzn.to/37m5aOH\">The Capture of the Earl of Glencrae</a> Afterwards, we thought of <a href=\"https://amzn.to/2pxJXAf\">The Duke Buys a Bride </a>and <a href=\"https://amzn.to/2s19Vx1\">Tycoon</a>.</p><p class=\"\"><strong>Question 16</strong>: Shannon in Atlanta said, \"Ghosts. I need all the ghosts. I’m regrading Lynn Kurland’s Stardust of Yesterday to see if I am still madly in love with Kendrick like 14 yr old me was. But I need more ghosts. For spooky season and for always.\"</p><p class=\"\"><strong>Our recommendations:</strong> So obvioulsy the best IAD book is <a href=\"https://amzn.to/2qsf54A\">Dark Needs at Night's Edge</a>. But <a href=\"https://amzn.to/2CZztNq\">Halloween Boo</a> and <a href=\"https://amzn.to/2KC63ZD\">Hot Ghost</a> might also be of interest. After recording, Jen thought of <a href=\"https://amzn.to/2XyXtAb\">The Headmaster</a> by Tiffany Reisz and Sarah thought of <a href=\"https://amzn.to/2r7RBll\">For the Earl's Pleasure</a> by Anne Mallory.</p><p class=\"\"><strong>Question 17:</strong> Natali from Tampa asked for romances with \"a sexy but serious body guard- saves heroine from her evil husband OR serious sexy body guard that is hired by father to care for wild heroine. And/Or sexy but consensual teacher-student relationship.\"</p><p class=\"\"><strong>Our recommendations: </strong>Sarah and Jen both liked <a href=\"https://amzn.to/2O6suZn\">The Professor</a> by Charlotte Stein. Sarah also recommended <a href=\"https://amzn.to/343HpZF\">The Unrequited</a> by Saffron Kent. Bodyguards for some reason we didn't have specifics, but check out <a href=\"https://amzn.to/2OyZEjo\">Sexy/Dangerous</a> by Beverly Jenkins, which has a female bodyguard. <a href=\"https://amzn.to/2QG3pG2\">Fallen </a>by Rebecca Zanetti will work. But also, Jen is convinced that something in Lexi Blake's <a href=\"https://amzn.to/345evIC\">Masters and Mercenaries</a> series will work.</p><p class=\"\"><strong>Question 18:</strong> Nisha wants books that are \"bananas sexy.\"</p><p class=\"\"><strong>Our recommendations: </strong><a href=\"https://amzn.to/34fs8F6\">Ice Planet Barbarians</a> forever. But Brill Harper anything will work, and Jen especially recommends <a href=\"https://amzn.to/35jZyml\">Altogether</a>. Everyone on twitter thinks <a href=\"https://amzn.to/37nUDT0\">White Whiskey Bargain</a> is super hot, and <a href=\"https://amzn.to/35jfeGi\">The Red</a> is amazingly sexy. Grace Goodwin's <a href=\"https://amzn.to/2Xw44LR\">Interstellar Brides series</a> is also pretty hot.</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Jen and Sarah answer questions and make recommendations",
  "itunes:summary": "It’s the first half of our recommendation podcast! We asked you to ask us for recommendations, and thought it would be fun to recommend on the fly—absolutely no preparation! Instead, we met up at Sarah’s apartment and read your questions sight-unseen (thanks to @bestfriendkelly for collecting them!). What ensued is a killer list of romances that you should all read!",
  "itunes:explicit": "yes",
  "itunes:duration": "01:12:21",
  "itunes:image": "",
  "itunes:season": 2,
  "itunes:episode": 11,
  "itunes:title": "S02.11: Romance Recommendations - Stump Jen and Sarah",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S02.11: Romance Recommendations - Stump Jen and Sarah"
  }
}