{
  "title": "523: What If Neville Longbottom Was 'The Chosen One'?",
  "link": "https://audioboom.com/posts/7911712",
  "itunes:episode": 523,
  "itunes:title": "What If Neville Longbottom Was 'The Chosen One'?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4903,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Our character discussions return as we celebrate the birthday of Neville Longbottom!</li>\n<li>Professor Trelawney drops in to give us a refresher on the Lost Prophecy</li>\n<li>Had Voldemort marked Neville as his equal, would a similar situation have played out with Alice sacrificing herself to save her son? </li>\n<li>Neville & Hannah Abbott: was the plan all along that she and Neville end up together, or did the idea evolve as the series neared its end?</li>\n<li>The hosts give their reactions to the movies pairing Neville and Luna together.</li>\n<li>It's not fair! Augusta constantly compares Neville to her own son, Frank!</li>\n<li>Both orphaned in their own way, we discuss the similarities of Harry and Neville's upbringings.</li>\n<li>Was Neville always doomed to feeling “second best” even if  he had a more supportive parental figure?</li>\n<li>Why did Neville want to be sorted in Hufflepuff? Did it further diminish the house's reputation for readers early on in the series?</li>\n<li>The hosts share moments from their own lives where they felt like they didn't belong.</li>\n<li>Neville's Notable Moments of Development: we discuss him standing up to Harry, Ron and Hermione in Sorcerer's Stone, his actions inside the Ministry of Magic in Order of the Phoenix and his confrontation with Voldemort in Deathly Hallows</li>\n<li>Matt Lewis: how was Neville portrayed in the films and what were some notable movie differences for the character?</li>\n<li>What if... Neville was The Chosen One? What would his upbringing have looked like? Who would be his Ron and Hermione at Hogwarts? What would his relationship with Dumbledore be like?</li>\n<li>Quizzitch: Right after impersonating Neville Longbottom during his ride on the Knight Bus in Year 3, Harry bumps into the real Neville outside Flourish and Blotts. What is Neville looking for, in this moment? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by <a href=\"http://www.warbyparker.com/mugglecast\">Warby Parker</a> (order 5 pairs of glasses to try at home for free for 5 days – with no obligation to buy) and <a href=\"http://www.ue.com/fits\">Logitech UE Fits</a> ( get 15% off your pair of Ultimate Ears FITS True Wireless Earbuds using code MUGGLECAST).</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast, a personalized thank you video from one of the hosts and more! On this month's Bonus MuggleCast, we talk about our favorite Jude Law Dumbledore moments from Crimes of Grindelwald!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 27 Jul 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-07-26:/posts/7911712",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}