{
  "title": "552: 'Fantastic Beasts: Secrets of Dumbledore' Trailer 2 Deep Dive!",
  "link": "https://audioboom.com/posts/8039923",
  "itunes:episode": 552,
  "itunes:title": "'Fantastic Beasts: Secrets of Dumbledore' Trailer 2 Deep Dive!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5547,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The latest (and final?) trailer for <em>Fantastic Beasts: the Secrets of Dumbledore</em> is here! Overall the trailer is very Dumbledore-and Grindelwald-focused and we are here to pick it apart, scene by scene! Join Andrew, Eric, Micah and Laura as they discuss that interesting Michael Gambon cameo, long-haired Credence, Jacob's wand, Dark Queenie, and more. Plus, is Theseus in trouble? Do we know some of the \"new\" beasts? And did Bunty get a promotion? Listen now!<br>\n<br>\n\n</div>\n<ul>\n<li>First, we stand with the people of Ukraine and encourage everyone to keep an eye on the news coming out of the country.</li>\n<li>It's time to talk about the new Fantastic Beasts: The Secrets of Dumbledore trailer! This time the hosts will all be on the same page... YouTube page, that is! <a href=\"https://www.youtube.com/watch?v=DaM_wL1ZOM4&ab_channel=WarnerBros.Pictures\">We use this video</a> when referencing all timestamps during our discussion.</li>\n<li>Laura is optimistic that the Michael Gambon Pensieve appearance foreshadows memory being a crucial part of the plot for this film...</li>\n<li>...and Eric thinks it's another desperate attempt to market the film to old-school Potter fans. Fan-service, if you will!</li>\n<li>The Blood Pact is shown prominently and the hosts discuss similarities with the Unbreakable Vow in visual style.</li>\n<li>Is that McGonagall visiting Dumbledore at the Hog's Head?!</li>\n<li>Grindelwald declares war, Credence has longer hair, and Eulally Hicks apparates around Jacob's shop -- and we love it.</li>\n<li>An important title card which has been missing from some marketing materials is back in the trailer, and the hosts discuss.</li>\n<li>What is with this mysterious message on the back of Aberforth's bar? We use our Wordle experience to try and figure it out.</li>\n<li>Are Albus and Gellert meeting in person? Is this an Applebees? Or merely a memory?</li>\n<li>Micah thinks he can identify several of the beasts shown throughout the trailer, and Theseus does some interesting magic.</li>\n<li>Is Theseus doomed? Some sleuthing reveals it may be his tie and wand that are shown with Teddy and Pickett.</li>\n<li>Is Tina Polyjuiced into someone else, like Bunty? Does that explain why Katherine Waterston is missing from all promotional material in this film?</li>\n<li>The Deluminator is back! And who's that group resting on the stairs at the theorized end of the movie?</li>\n<li>Next week, we'll be reading YOUR submissions on theories and trailer thoughts. Be sure to send us an e-mail or voicemail using our regular channels for inclusion on the show!</li>\n<li>This week's episode is sponsored by BetterHelp online therapy. Get 10% off your first month at <a href=\"http://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>\n</li>\n</ul>\n",
  "pubDate": "Tue, 01 Mar 2022 17:59:04 +0000",
  "guid": "tag:audioboom.com,2022-03-01:/posts/8039923",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}