{
  "title": "What is AI? And what does it mean for me and the world?",
  "link": "https://kavita-ganesan.com/what-is-ai-and-what-does-it-mean-for-me-and-the-world/",
  "comments": "https://kavita-ganesan.com/what-is-ai-and-what-does-it-mean-for-me-and-the-world/#respond",
  "dc:creator": "Kavita Ganesan",
  "pubDate": "Tue, 24 May 2022 14:20:43 +0000",
  "category": "Podcast Interview",
  "guid": "https://kavita-ganesan.com/?p=7453",
  "description": "What is AI? And what does it mean for me and the world? A Podcast Interview: Kavita Ganesan &#038; David Gee. ",
  "content:encoded": "\n<p><em>Listen to my interview with the  <strong><a href=\"https://www.audible.com/pd/Insatiably-Curious-Podcast-Podcast/B08JJN4W7Z\">Insatiably Curious Podcast</a> </strong>host, David Gee.</em> <em>Transcript of the podcast is as below.</em></p>\n\n\n\n<p>00:07</p>\n\n\n\n<p>Welcome to the <strong>Insatiably Curious Podcast</strong>, where we invite lifelong learners to join us on a personal and professional journey. Now here to inform, entertain and enlighten, while always keeping it interesting from our nation&#8217;s capital. It&#8217;s your host, David Gee.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>00:26</p>\n\n\n\n<p>Joining us today so glad to have her, Kavita Ganesan&#8230; She is the author of <strong><em>&#8220;The Business Case for AI: A Leader&#8217;s Guide to AI Strategies, Best Practices & Real-World Applications.&#8221;</em></strong> Welcome to the show, Kavita.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>00:40</p>\n\n\n\n<p>Yes, thank you for having me, David.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>00:41</p>\n\n\n\n<p>So one of the things when we have broad complicated topics, and I certainly think this qualifies&#8230; I like to kind of set the landscape or the ground rules a little bit to make sure we&#8217;re talking about the same thing or that we even know, in some cases, what we are talking about it.</p>\n\n\n\n<p>So we&#8217;re talking about Artificial Intelligence, AI, how it informs the kinds of decisions we can make it work. But why don&#8217;t you give us the layman&#8217;s definition of what it is we&#8217;re talking about, and maybe second to that the difference between how you might use it in your computer science lab in an academic or research setting and how I might use it at my office or IBM or something like that.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>01:33</p>\n\n\n\n<p>Yes, so AI is all about trying to mimic human decision making, within a computer. And using software programs. And the way AI systems today work is by learning from data. So let&#8217;s take a credit card. Let&#8217;s say you&#8217;re trying to detect fraudulent transactions, credit card transactions. So the way that AI systems today learn is by looking at 1000s of different examples of what makes a transaction fraudulent, or non-fraudulent. And then it mines the patterns [phonetic 02:09] from that. And then the next time it sees a new transaction, it then decides, hey, this seems suspicious. So it might be fraudulent. So that&#8217;s how systems today learn. But historically, they have been very rules based. And in the future, it may not even be data dependent anymore.</p>\n\n\n\n<p>So right now it&#8217;s highly data dependent. And from a business perspective, AI systems are very good in improving efficiency of workflows. So let&#8217;s say, right now, your customer service agent is manually routing tickets to the appropriate teams to get things resolved. So if you put an AI system there, it can do that very efficiently, 24 hours a day, and maybe even more accurately than your human agent.</p>\n\n\n\n<p>But from a research perspective, in a research lab, that&#8217;s not how we look at things, we are not looking at what benefits that can be to a business. So we are thinking about how can we get better? How can technique-2 become better than technique-1. So we are always looking at incremental improvements, either through better data or better techniques. So we&#8217;re always trying to beat the state of the art. So it&#8217;s kind of different, what happens in the research world versus what&#8217;s happening in the business world. And the business we have to be completely focused on the applications of it, how it&#8217;s going to help us.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>03:40</p>\n\n\n\n<p>There&#8217;s probably not a day that goes by that I don&#8217;t come across AI and in Washington Post, New York Times, Wall Street Journal, you know, whatever your source of news is. It&#8217;s certainly on the minds of business leaders today, is it currently in the state that we use it today as it is a kind of the purview of large corporations, IBM&#8217;s and Googles and in Tesla&#8217;s, or are you seeing the use of AI filtered down to more medium sized businesses or even in some cases, small businesses?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>04:24</p>\n\n\n\n<p>So there are two groups that I see, that have really embraced AI, and that&#8217;s the large corporations. And that&#8217;s specifically on the tech sector, not in other industries, and startups&#8230;. This AI startup are very good using AI and they&#8217;re very efficient because they&#8217;re small, they&#8217;re nimble, they know how to adopt new technologies and just run with it. And then the large corporations on the tech side, they are already very AI driven. Their infrastructure is set up for AI. So these two groups are running fast with AI but I think that&#8217;s the group in between the midsize businesses, they are thinking about AI, but they just don&#8217;t know how to get started. Because there&#8217;s so much of confusion in the media, like what&#8217;s happening in research gets overstated as the current capabilities.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>05:16</p>\n\n\n\n<p>In your book, you talk about some of the myths, conceptions and the myths around AI that we should all be aware of&#8230; Why don&#8217;t you specifically outline a couple of them or predominant ones?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>05:30</p>\n\n\n\n<p>Yes, sure. So the first myth that people think is that they need to use the latest and greatest technique that the media is talking about. But really, the latest and greatest techniques are very still in the r&d phase. And they may not fit in within your infrastructure, you may have an old infrastructure that can maybe take in basic computer algorithms, not something sophisticated that needs GPUs, and TPUs. And you have to keep in mind that AI has been there since the 1940s. So the techniques are already very old, it&#8217;s only become popular now because of the computation power that we have. So using any one of those techniques that can benefit your business, is a good technique. So not to worry about what&#8217;s being discussed in the media.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>06:20</p>\n\n\n\n<p>I don&#8217;t necessarily want to make this a history lesson, but you just told me something I absolutely was not aware of. And that is 7 decades give or take of AI. So without supercomputers and the computational power that we have today, how was AI used in the 1940s, the 1950s, I&#8217;m fascinated by that.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>06:44</p>\n\n\n\n<p>Yes, so back in the days, it was like heavily rules base, you have to encode human knowledge in the form of specific rules. And they also had started neural networks research long ago, but that research stopped because insufficient computation power. And then he picked up again, I think, around 2011, when big data became a thing, then we had lots of faster computation power, and then it just accelerated from that. And neural networks now has become deep learning. And that&#8217;s a big field of study now.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>07:19</p>\n\n\n\n<p>You talk again, in your book about the 5 basic pillars of AI preparation and AI landscape, why don&#8217;t you go into a little bit of those, if you would, please.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>07:32</p>\n\n\n\n<p>Yes, so given how AI systems today learn, like they heavily dependent on data. So if you&#8217;re not already collecting data, or if your processes are still paper based, then data infrastructure is a big pillar in your AI preparation. And you don&#8217;t have to start off fancy, you just have to make sure that you&#8217;re doing the basics to start with, like, if you&#8217;re using paper processes, why not shift to Excel. If you&#8217;re not collecting data, think about where, which are the areas that AI could benefit, and start collecting data in those areas. So that&#8217;s one huge pillar, the data infrastructure pillar, then there is the cultural pillar. That&#8217;s like addressing some of the fears around AI, because a good percentage of Americans are fearful of AI, and&nbsp; a research has actually shown that [unintelligible 08:36] that in my book. So you want to put this fears to rest so that companies can actually start looking into the benefits of AI, as opposed to fearing AI. Then there&#8217;s also understanding what&#8217;s development around AI? Like, that&#8217;s also a cultural element. It&#8217;s very experimental. It&#8217;s very iterative. So you need to establish those cultural elements. So those are the two big pillars:</p>\n\n\n\n<ol type=\"1\"><li>Data</li></ol>\n\n\n\n<p>and</p>\n\n\n\n<ul><li>Culture.</li></ul>\n\n\n\n<p><strong>David Gee&nbsp; </strong>09:09</p>\n\n\n\n<p>Follow up on that fear angle, oftentimes just kind of the way that humans are wired, we fear the unknown, whatever that is. Is this what&#8217;s it at play here? Is it simply that most people don&#8217;t know enough about AI to feel comfortable with it? Or is it something kind of spookier where they envision giant super computers and robots and everybody or things like that, you know, kind of taking over the world with information and you know, brains mimicking my brain and so on. And so, you know, what, what is it that that, you know, I know you&#8217;re not a psychologist, but in your take, what is it that people fear about the subject of AI?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>10:00</p>\n\n\n\n<p>So, there are some celebrities out there that are spreading this type of information that it will take of our jobs and later humanity, it can be used for bad things. And some of it is true, like AI can be used unethically. But taking over humans, that&#8217;s untrue. Because AI systems today don&#8217;t have the common sense reasoning as humans do, they can&#8217;t read body language, they don&#8217;t natively understand emotions, they can&#8217;t read between the lines, and just connect the dots like humans can. But on very specific tasks, AI systems can be very effective, and can even surpass human accuracy.</p>\n\n\n\n<p>So the misunderstanding is that these AI systems can become conscious like humans, and then start making decisions that can overpower humans, I&#8217;ve seen that is a real fear, really. And that actually even came up and I was trying to hire one of my narrators for my book. And she said, Hey, I was afraid to audition for this book, because there&#8217;s so much fear about AI in our community. So, it&#8217;s widespread.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>11:14</p>\n\n\n\n<p>Interesting. Yeah, I can think of a couple of Hollywood movies where the machines are plotting&#8230; Ex Machina is actually one of the [unintelligible 11:23] a machine plots to take over the mind and world of the founder or the inventor of the machine. So yeah, Hollywood has definitely taken that theme. And I&#8217;m sure some media outlets as well. You talk about back to the book, you talk about what you call vanity AI, you know, anything that&#8217;s kind of in the zeitgeist or that becomes a kind of a thing will be social media or anything else. There are companies that will just kind of glom on to that not in a real authentic sense, but just to say, hey, yes, guess what, yes, we do AI too&#8230; You talk about vanity AI?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>12:11</p>\n\n\n\n<p>Yes, Vanity AI happens a lot. And a lot within large corporations, especially, because there&#8217;s a rush to adopt AI. And as that trickles down the ladder, people think that they just need to use AI, and the way companies start using AI today is just by looking at data, seeing what data is available, and then coming up with problems based on data. But the problem with that approach is that it tells you nothing about the inefficiencies within the company, like what problem really, is it solving? What pain point is it addressing? So because of that the AI projects don&#8217;t necessarily solve real business challenges. And then executives don&#8217;t see the value from it. And then they start distrusting AI as a whole, that it&#8217;s useless. It&#8217;s just hype. But really, there&#8217;s not enough planning around it for what problems are we applying AI.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>13:12</p>\n\n\n\n<p>So, I&#8217;m in the content creation, marketing messaging business, and I use data all the time to inform my content, whether it be page views, or how long people engage with content, you know, downloads, you know, all those kinds of things. We have lots of ways to measure the way that people interact with our marketing with our messaging, is there do you draw a distinct line between what I would call data driven decision making and AI? Am I using AI a little bit when I make those content decisions? Or is it just something completely different?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>13:57</p>\n\n\n\n<p>Yes, that&#8217;s a great question. So AI can serve two grand purposes.</p>\n\n\n\n<ol type=\"1\"><li>One is to improve efficiency within businesses.</li></ol>\n\n\n\n<ul><li>And one is to help make better decisions.</li></ul>\n\n\n\n<p>And if you look at our data, we have a lot of structured data, things that fit neatly in an Excel spreadsheet. And then we have lots of unstructured data, like all the Twitter comments, all the documents within your company, your customer support conversations, all of that is completely unstructured. So when you&#8217;re trying to extract data-driven insights, you can&#8217;t just use your structured data, which I refer to as simple data analytics, but to make deeper decisions, like what are your customers complaining about? What&#8217;s your top wish list? You need that unstructured data and you can&#8217;t really aggregate unstructured data like you do structured data, you need some form of AI on that, and specifically, a branch of AI called natural language processing that tries to make sense of all that text data, and then extract key elements that you can later make sense of and inform decisions like, what are my customers&#8217; top points, wishlist and so on. So there&#8217;s a lot of opportunity there.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>15:16</p>\n\n\n\n<p>Well, certainly that&#8230; I mean, regardless of how you achieve, it was certainly from a customer service perspective, a marketing perspective, the more we know about our audience, our prospects, our consumers, the better we&#8217;re going to be and the bigger competitive advantage we have, right? And it&#8217;s not just,</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>15:38</p>\n\n\n\n<p>Yes, that&#8217;s right.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>15:38</p>\n\n\n\n<p>Yes. So when you first came to University of Southern California to get a master&#8217;s in computer science, were you hearing about AI from your first day in school was AI, a big thing in the halls of computer science classes a long&#8230; a while ago.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>16:00</p>\n\n\n\n<p>So USC is a special breed, they were so much into AI, even when I joined. So, that&#8217;s how I got exposed to this whole field. I took one natural language processing class and the professor. And I was hooked. I liked it. So then I went on to doing my PhD in the field, and then became a data scientist. But within USC, AI was a big thing. Within academic institutions, AI has been a big thing since I guess long ago.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>16:32</p>\n\n\n\n<p>And you&#8217;ve been at the consulting game for 15 years, give or take and working with Fortune 500 companies, as well as some smaller organizations, when you first you know&#8230; When you got your freshly minted degrees and kind of went out in the business world, were people conversing about AI? Did you have to do a lot of educating. Tell me about the landscape when you first started.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>17:00</p>\n\n\n\n<p>So when I first started, AI was not known in the industry. So I had to become a software engineer, because there was no prospect for AI right after I graduated with my master&#8217;s. So I did my PhD thinking that I&#8217;ll go into a research lab to maybe use some AI. But around 2013 is where data science started to really become a thing. So then I jumped on to the whole data science field where I could apply AI. So it&#8217;s only around 2013, 2011, where AI became a thing in the industry.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>17:46</p>\n\n\n\n<p>We spent a little bit of time today talking about both the past and the future, as you look into to the future and to your crystal ball. What do you think is and conversely, is not appropriate to expect from Ai?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>18:04</p>\n\n\n\n<p>I think what we can expect is as the understanding around AI improves, I think all the midsize businesses are going to start using AI the right way. And also the non tech companies are going to start embracing AI and start seeing value from it. But in the next few years, don&#8217;t expect a conscious bot to be walking around. That&#8217;s not going to happen in the next few years. And maybe not even this whole decade. So these are the two things that are going to happen. Business are going to pick up on AI a lot more. And research is going to improve around trying to mimic like human reasoning within an AI system, but not to the point of it becoming conscious, really.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>18:51</p>\n\n\n\n<p>So you do see it filtering down into the mainstream and into smaller companies, though, is that correct?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>18:57</p>\n\n\n\n<p>Definitely. Yes.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>18:59</p>\n\n\n\n<p>Anything that you&#8217;re concerned about as a data scientist, as a software engineer, as someone who&#8217;s spent so much time around AI? Is there a potential? I mean, we don&#8217;t know, you know, the capacity for human beings sometimes. But is there something that you&#8217;re even as knowledgeable as you are that you&#8217;re a little fearful of?</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>19:22</p>\n\n\n\n<p>So my biggest fear is one bias in data. So that can propagate through AI systems because AI systems, learn from data and bias has been shown to be very prevalent, like in facial recognition systems. So in fact, some of the big tech companies stop using facial recognition systems for law enforcement, I think?</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>19:47</p>\n\n\n\n<p>Right.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>19:48</p>\n\n\n\n<p>Yes. So that&#8217;s one big problem, the bias in data and the second problem is how people are using AI like we saw with Deep fakes. The recent news about Deep fakes on how people can make you say things that you didn&#8217;t really say. And then make that to be reality. So the applications of AI really needs to be regulated. Otherwise, it&#8217;s going to be used in unethical ways.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>20:15</p>\n\n\n\n<p>Wow. Yes. I mean, talking about big tech and regulation. I live in Washington, DC. And that&#8217;s obviously, you know&#8211; the pages of The Washington Post all the time about how we regulate these companies and social media and that could be a whole another conversation. So thank you so much for joining us. I&#8217;ve really enjoyed it.</p>\n\n\n\n<p><strong>Kavita Ganesan&nbsp; </strong>20:36</p>\n\n\n\n<p>Yeah, thank you for having me, David.</p>\n\n\n\n<p><strong>David Gee&nbsp; </strong>20:38</p>\n\n\n\n<p>Kavita Ganesan, author of <strong><em>&#8220;<a href=\"https://www.amazon.com/Business-Case-Strategies-Real-World-Applications-ebook/dp/B09TRS55K8?crid=1UX93S9MHCFXF&keywords=the+business+case+for+ai&qid=1649883890&sprefix=the+business+case+for+ai,aps,136&sr=8-1&linkCode=sl1&tag=kavganbook-20&linkId=ce9c7b637e704bd00a06f421c7a17016&language=en_US&ref_=as_li_ss_tl\">The Business Case for AI: A Leader&#8217;s Guide to AI Strategies, Best Practices & Real-World Applications.</a>&#8221; </em></strong>Thanks again to her and thanks to you for joining us as well. I&#8217;m David Gee. We&#8217;ll see you next time. So long, everyone.</p>\n",
  "wfw:commentRss": "https://kavita-ganesan.com/what-is-ai-and-what-does-it-mean-for-me-and-the-world/feed/",
  "slash:comments": 0,
  "post-id": 7453
}