{
  "title": "The Edition: Toil and trouble",
  "link": "https://audioboom.com/posts/7981903",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2251,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Are migrants the new munitions? </div>\n<div><br>\n</div>\n<div>In our cover story this week, our political editor James Forsyth looks at the growing troubles in Eastern Europe and how this small part of the world stage could end up splintering the scaffolding of global peace. He is joined on the podcast by Mary Dejevsky, a columnist for <em>the Independent.</em> (00:42)</div>\n<div>\n<br>\n<br>\n\n</div>\n<div><br>\n</div>\n<div>Also this week: Will the monarchy survive past Elizabeth II?</div>\n<div><br>\n</div>\n<div>The royal family is not in a good way, with the Queen missing multiple appearances due to ill health, a prince under investigation, and the continuing cold war between William and Harry, will the monarchy survive past Elizabeth II? That’s the question Freddy Gray asks in this week’s <em>Spectator</em>. He joins the podcast along with Patrick Jephson a former private secretary to Princess Diana, who also covers the royals in this week’s issue. (17:21)</div>\n<div>  </div>\n<div>\n<br>\n<br>\n\n</div>\n<div>And finally: Why is the mullet making a comeback? </div>\n<div><br>\n</div>\n<div>Mullets. A hairstyle made popular in the 70s, but more recently the butt of many a joke is making something of a fashionable comeback. Hannah Moore writes about the return of the mullet in this week’s <em>Spectator</em>. She joins talks on the podcast with Mike Lawson of <em>Beardbrand</em> who has also noticed this retro <a href=\"https://www.beardbrand.com/blogs/urbanbeardsman/mullets\">return</a>. (29:09)</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator </em>today and get a £20 Amazon gift voucher:</div>\n<div>\n<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a> </div>\n<div><br>\n</div>\n<div>Listen to Lara’s food-based interview show, <em>Table Talk</em>:</div>\n<div>\n<a href=\"https://www.spectator.co.uk/tabletalk\">https://www.spectator.co.uk/tabletalk</a> </div>\n",
  "pubDate": "Thu, 18 Nov 2021 14:00:00 +0000",
  "guid": "tag:audioboom.com,2021-11-17:/posts/7981903",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}