{
  "title": "Before Ships Used GPS, There Was the Fresnel Lens",
  "link": "https://spectrum.ieee.org/fresnel-lens-milestone",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-fresnel-lens-at-the-seguin-island-light-station-in-maine.jpg?id=29808783&width=1200&height=800&coordinates=0%2C104%2C0%2C104\"/><br/><br/><p>Ships today use satellite-based radio navigation, GPS, and other tools to prevent accidents. But back at the beginning of the 19th century, lighthouses guided ships away from rocky shores using an oil lamp placed between a concave mirror and a glass lens to produce a beam of light.</p><p>The mirrors were not very effective, though, and the lenses were murky. The light was difficult to see from a distance on a clear night, <a href=\"https://www.aps.org/publications/apsnews/201607/physicshistory.cfm\" rel=\"noopener noreferrer\" target=\"_blank\">let alone in heavy fog or a storm</a>.</p><hr/><p>In 1822 French civil engineer <a href=\"https://en.wikipedia.org/wiki/Augustin-Jean_Fresnel\" rel=\"noopener noreferrer\" target=\"_blank\">Augustin-Jean Fresnel</a> (pronounced “Frey Nel”) invented a new type of lens that produced a much stronger beam of light. The Fresnel lens is still used today in active lighthouses around the world. It also can be found in movie projectors, magnifying glasses, spacecraft, and other applications.</p><p>Fresnel’s technical achievement is worthy of being named an <a href=\"http://ieeemilestones.ethw.org/Milestones_Status_Report\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Milestone</a>, according to the <a href=\"https://www.ieee.org/about/history-center/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE History Center</a>, but no one has proposed it yet. Any IEEE member can <a href=\"http://ieeemilestones.ethw.org/Milestone_Guidelines_and_How_to_Propose_a_Milestone\" rel=\"noopener noreferrer\" target=\"_blank\">submit a milestone proposal</a> to the IEEE History Center. The Milestone program honors significant accomplishments in the history of electrical and electronics engineering.</p><p><strong>PREVENTING SHIPWRECKS</strong></p><p>Because of increasing complaints from French fishermen and ship captains about the poor quality of the light emanating from lighthouses, in 1811 the French Commission on Lighthouses established a committee under the authority of the <a href=\"https://simple.wikipedia.org/wiki/Corps_of_Bridges_and_Roads_(France)\" rel=\"noopener noreferrer\" target=\"_blank\">Corps of Bridges and Roads</a> to investigate how lighthouse illumination could be improved. </p><p>One member of that committee was Fresnel, who worked for the French civil service corps as an engineer. He had considerable expertise in optics and light waves. In fact, in 1817 he proved that his wave theory—which stated the wave motion of light is <a href=\"https://www.generationgenius.com/learn-different-types-of-waves-for-kids/\" rel=\"noopener noreferrer\" target=\"_blank\">transverse rather than longitudinal</a>—was correct. In transverse waves, a wave oscillates perpendicular to the direction of its travel. Longitudinal waves, like sound, oscillate in the same direction that the wave travels.</p><p>Fresnel’s analysis of contemporary lighthouse technology found the lenses were so thick that <a href=\"https://www.ponceinlet.org/Understanding-how-Lighthouse-Lenses-Work-1-6297.html\" rel=\"noopener noreferrer\" target=\"_blank\">only half the light produced shined through</a>.</p><p>He decided he could do better using his wave theory. His design consisted of 24 glass prisms of varying shapes and sizes arranged in concentric circles within a wire cage. The prisms, placed both in front of and behind four oil lamps, replaced both the mirror and the glass lens of the previous method. Prisms at the edge of the circle refract light slightly more than those closer to the center, so the light rays all emerge in parallel. The design could focus nearly 98 percent of the rays generated by the lamps, producing a beam that could be seen more than 32 kilometers away.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\" Looking up into a Fresnel lens used in the lamp of a Norwegian lighthouse\" class=\"rm-shortcode\" data-rm-shortcode-id=\"e51308410a253da84a7cb8a4bdf09023\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"7b3ad\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/looking-up-into-a-fresnel-lens-used-in-the-lamp-of-a-norwegian-lighthouse.jpg?id=29808786&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Inside the Lindesnes Lighthouse's Fresnel lens in southern Norway.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">DeAgostini/Getty Images</small></p><p>A clock mechanism, which had to be wound by hand every few hours, was used to revolve the metal frame around the lamps to produce unique light patterns for specific lighthouses. A lighthouse could send out a flash regularly every 5 seconds, for example, or it could have a 10-second period of darkness and a 3-second period of brightness. Captains counted the number of flashes sent out by a lighthouse to calculate their ships’ location. </p><p>The lenses came in several sizes, known as orders. The largest order, the Hyper-Radial, had a 1,330-millimeter diameter. The smallest, the eighth order, had a 75-mm diameter and could be found in lighthouses on bays and rivers. </p><p>In 1823 the French Commission on Lighthouses committee approved the use of the Fresnel lens in all lighthouses in France. That same year, the first one was installed in the <a href=\"https://www.cordouan.culture.fr/en\" rel=\"noopener noreferrer\" target=\"_blank\">Cordouan Lighthouse</a>, in southwestern France. The lens eventually was adopted in other countries. By the 1860s, all the lighthouses in the United States had been fitted with a Fresnel lens, according to the<a href=\"https://www.si.edu/object/fresnel-lighthouse-lens%3Anmah_844143\" rel=\"noopener noreferrer\" target=\"_blank\"> Smithsonian Institution</a>.</p><p>Fresnel continued to modify the lens for several years. His final design, which he completed in 1825, could spin 360 degrees and was the first so-called fixed/flashing lens. It produced a fixed light followed by a brilliant flash followed by another fixed light.</p><p>With the invention of modern navigational tools, the lighthouse has become largely obsolete for maritime safety. But the lens invented for it lives on in side mirrors used on trucks, solar panels, and photographic lighting equipment.</p><p>If you are interested in submitting a proposal, <a href=\"http://ieeemilestones.ethw.org/Milestone_Guidelines_and_How_to_Propose_a_Milestone\" rel=\"noopener noreferrer\" target=\"_blank\">do so here</a>.The History Center is funded by donations to the <a href=\"https://www.ieeefoundation.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Foundation</a>. For more on the history of lighthouse technology, visit the U.S. <a href=\"https://www.nps.gov/articles/fresnel-lens.htm\" rel=\"noopener noreferrer\" target=\"_blank\">National Park Service</a>, <a href=\"https://www.ponceinlet.org/Understanding-how-Lighthouse-Lenses-Work-1-6297.html\" rel=\"noopener noreferrer\" target=\"_blank\">Ponce Inlet Lighthouse and Museum</a>, and <a href=\"https://www.aps.org/publications/apsnews/201607/physicshistory.cfm\" rel=\"noopener noreferrer\" target=\"_blank\">American Physical Society</a> websites.</p>",
  "pubDate": "Mon, 16 May 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/fresnel-lens-milestone",
  "category": [
    "Ieee history",
    "Ieee news",
    "Ieee milestone",
    "Fresnel lens",
    "Optics",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}