{
  "guid": "https://podcasts.nationalreview.com/?p=2818",
  "title": "Episode 30: Matt Murray / Talking Heads",
  "description": "<p>Scot and Jeff talk to the<em> WSJ</em>‘s Matt Murray about Talking Heads.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Matt Murray, executive editor of the <i>Wall Street Journal</i><i></i>and author of <i>The Father and the Son: My Father’s Journey into the Monastic Life</i>. Follow Matt on Twitter at <a href=\"https://twitter.com/murraymatt\">@murraymatt</a>.</p>\n<p><span><b>Matt’s Music Pick: Talking Heads<br />\n</b></span>This week the gang stops making sense as they tackle Talking Heads, a band that resolutely defies easy classification. Beginning as the most self-consciously quirky (yet appealingly melodic) band on the New York CBGB punk/new-wave scene of the mid-1970s, they gradually transformed into pioneers of complex polyrhythmic Afrobeat fusion under the auspices of producer Brian Eno until suddenly remaking themselves once again as a pop band. All throughout, they were guided by the singular muse of lead singer (and guitarist) David Byrne, whose lyrical concerns ranged from quotidian to the profound and frequently encompassed both simultaneously. Matt tells the story of his exposure to Talking Heads, first as a child with <i>’77</i>, and then how they were ubiquitous on the college scene in 1983 with <i>Speaking In Tongues</i>. Jeff remembers to this day the moment he first became aware of the group: having his senses assaulted as a 10-year-old by the famous music video for “Once In A Lifetime” and barely being able to believe it wasn’t some sort of elaborate practical joke VH-1 was playing on him.</p>\n<p><span><b>From CBGB to <i>’77</i>: The Formative Years<br />\n</b></span>Scot and Jeff run through the brief history of Talking Heads’ formation: songwriter and guitarist David Byrne was in a band with drummer Chris Frantz while the pair were students at Rhode Island School of Design. After moving to New York City along with Frantz’s girlfriend (and later wife) Tina Weymouth, she is cajoled into learning to play the bass from scratch. She was a quick study and completed them as a trio just in time for them to be present at ground zero for the birth of the American punk/new-wave scene in New York City, centered around the Manhattan club CBGB and featuring such legendary artists as the Ramones, Television, Patti Smith, the Voidoids, and an odd-duck group that never quite fit in: Talking Heads. While the other groups in the scene were deeply confrontational, either playing loud and aggressively or adopting transgressive lyrical poses, Talking Heads were…downright nice. David Byrne’s terse, naively childlike quasi-Aspergers approach to lyrical themes immediately set him apart from the snarling contemptuousness of the rest of the American punk scene, while the band’s herky-jerky compact melodicism and clean crisp rhythms were miles away from the snarl of, say, Johnny Thunders and the Heartbreakers.</p>\n<p>Little wonder, then, that they were very quickly given a major-label record deal and immediately began to make good on it. Their only officially-released recording as a trio was their debut single “Love -> Building On Fire” (the title alone gives fair indication of how Byrne wrote), at which point they expanded to a quartet with the addition of keyboardist/guitarist Jerry Harrison (formerly of the ahead-of-their-time Modern Lovers), who rounded out their sound. This is the group that would record their debut album <i>Talking Heads: ’77</i> (no prizes for guessing which year it was released). Jeff thinks this is their most underrated album, unfairly neglected because it falls outside the upcoming “Eno trilogy,” and chockablock full of wonderful, weird tunes. Matt and Jeff spend a lot of time discussing why David Byrne is so compelling as a lyricist. Matt says that he is an artist in the truest sense of the word: trying to take the familiar things in this world and see them with fresh eyes. Jeff agrees and compares the seeming lack of artifice in Byrne’s vocals and lyrics to outsider art. He also adds that Talking Heads’ lyrics during this era make sense the moment you realize that they are meant wholly unironically: “New Feeling” is about a new feeling, “The Book I Read” is about a book David Byrne read, and “Don’t Worry About The Government” is a song that suggests that you shouldn’t worry about the government. Matt and Scot also note that “Pulled Up” is exactly what it purports itself to be: an earnestly cheerful song of thanks from Byrne to his parents for pulling him up from the doldrums of depression.</p>\n<p><span><b>The Brian Eno Era: <i>More Songs About Buildings and Food</i>, <i>Fear of Music</i>, and <i>Remain in Light<br />\n</i></b></span>Enter Brian Eno. Fascinated by the rhythmic and lyrical approach he heard on <i>Talking Heads: ’77</i> (so much so that he wrote an anagrammatic tribute to them on his own <i>Before And After Science</i> called “King’s Lead Hat”), Brian Eno came to the band and offered to produce their next album, beginning one of the most well-known artist/producer collaborations of the rock era. <i>More Songs About Buildings And Food</i> (1978) draws primarily from the same first batch of songs the group had written as far back as 1975, so structurally these songs sound the same as those on <i>’77</i>. Sonically, however, Eno brought them a quiet revolution: without attempting to remake the band in his own image (at least not yet), he lends them a sheen and in particular a percussive attack — most obviously on the hit single “Take Me To The River” — that was entirely absent from their previous work. Scot is a bit skeptical of <i>More Songs</i> but Matt and Jeff are both agreed that this is actually the band’s best album: unwaveringly consistent, still written in that disarmingly weird early Byrne lyrical style, and brilliantly sequenced. Jeff in particular singles out the joy of listening to “The Girls Want To Be With The Girls” tumble directly into “Found A Job” and realizing just how in command Talking Heads are over their artistic self-presentation. Scot considers TH’s version of “Take Me To The River” to be one of the greatest cover songs of all time (something that comes as no surprise to anyone who has heard our “Covers” episode), marveling at how the band and Eno slow the song down to an absolute crawl and yet retain its essential funk. Matt emphasizes that it is here where you can first begin to hear the ensemble sound that would fully bloom years later on <i>Remain In Light</i>: so many of the great moments on <i>More Songs</i> (“Artists Only,” “I’m Not In Love,” “Warning Sign,” “Found A Job,” “Stay Hungry”) are built around lengthy passages where the band just cuts loose and <i>plays</i>, hypnotically.</p>\n<p><i>Fear Of Music</i> (1979) is a departure for Talking Heads in many ways; the second record of their Eno trilogy finds Byrne working up a new batch of lyrics for the first time since the 1975-76 era, and his response was to create a concept album that most people never even realize is a concept album. This is “fear of”-music: songs each written about specific topics of potential neurosis. (Literally just add the words “(fear of)” as a parenthetical to every single song on the record outside the instrumental opener and you’ll get the point.) It’s hard to know whether Byrne is channeling his own feelings on songs like “Air” or “Memories Can’t Wait” or “Animals,” or speaking in an imaginative voice as on “Psycho Killer”, but the result is a glorious catalogue of modern paranoia. One that feels like it comes from a more personal place is “Heaven,” Byrne’s meditation on the afterlife. Jeff raves over the brilliance of the conceit — heaven as an eternity of boredom and ennui as you are spoonfed your “favorite things” over and over again without variety until you loathe them — and thrills to the way the ice of the click-clock metronomic arrangement finally cracks when Chris Frantz roars in frustration heading into the final chorus. Scot proclaims this their greatest album, citing Byrne’s vocal performance on “Mind” especially. Matt gets an enormous laugh out of “Life During Wartime” and “Air,” a song where (as he points out) Tina Weymouth’s backing vocals feel for all the world like they’re mocking David Byrne’s neurotic fear of very environment around him.</p>\n<p>As it turned out, the one song on <i>Fear Of Music</i> that pointed toward the band’s future was the mostly instrumental opening track “I Zimbra.” Without it, nothing would have prepared anyone for the landmark <i>Remain In Light</i> (1980), where the band as previously known nearly disappears, to be replaced by a polyrhythmic hydra. This album (inspired in large part by the recordings of Nigerian music legend Fela Kuti) basically invented the subgenre of rock/world-beat fusion, and yet has never itself been equalled in critical esteem. Which makes it all the more interesting that all three of the gang argue that this record, for all its universal critical adulation, is significantly flawed: the back end of the album is glutted with forgettable music and failed experiments. (“The Overload” = interesting in theory, pointless in practice.) But who cares, as Jeff says, when the first half of it is so perfect? The gang spends time discussing every song on <i>Remain In Light</i> (except for “Born Under Punches,” a fantastic song that we sadly could only spare a lone “TAKE A LOOK AT THESE HANDS!” for), but it’s “Once In A Lifetime” and the epochal “The Great Curve” that naturally come in for the most praise. If Scot is right that <i>Remain In Light</i> is not the place for neophytes to begin with Talking Heads because of its density and weirdness (and he is), this is nevertheless an album that all serious music lovers owe it to themselves to hear. But then the same could be said for all four of Talking Heads’ early albums.</p>\n<p><span><b>Hiatus and Return: <i>The Name of This Band Is Talking Heads</i>, <i>Speaking in Tongues</i> and <i>Stop Making Sense<br />\n</i></b></span>At the peak of their artistic powers, at the moment of their greatest critical praise . . . Talking Heads disbanded and took a hiatus from the studio for three years. This was telling as to the state of interpersonal affairs within the group (the developing bad blood between Byrne and Weymouth would eventually become the stuff of legend), but the upside of it is that the band took this time to release the live retrospective <i>The Name Of This Band Is Talking Heads</i> (1982). Matt and Jeff both urgently importune you: buy this album in its 2CD expanded reissue, as it is literally the single greatest record Talking Heads ever released. Yes, that’s right, a live album is your proper one-stop introduction to Talking Heads, as this is is a brilliant, copiously thorough (141 minutes in its reissued form) survey of Talking Heads at every stage of their live career, from 1977 all the way to the expanded ensemble heard on the 1980/81 <i>Remain In Light</i> tour. One of those secrets that only Talking Heads fans fully understand is that they were one of the great live acts of their era (or any era for that matter), and that, as well produced as their early records were, they came across even more vigorously and joyfully onstage. Jeff considers <i>The Name Of This Band</i> to be one of the four or five greatest live albums ever released, and he’s not alone in that sentiment. Check it out.</p>\n<p>In 1983, the Heads finally returned with <i>Speaking In Tongues</i>. Shorn of Eno and now self-producing, this represented their commercial and critical peak, although in retrospect all three of the gang agree it hasn’t aged as well. Still, this is Talking Heads working in a deep art-funk mode, with songs like “Making Flippy-Floppy” and “Girlfriend Is Better” rolling through oceanic grooves (“Burning Down The House” was inspired by Parliament Funkadelic and sounds like it). The gang is also less effusive in its praise of the critically beloved “live” album <i>Stop Making Sense</i> (1984) than most others: the word live is in scare quotes back there for a reason (everything was re-recorded in the studio except for the drums, pretty much) and all agree that it works far better as a visual experience (you really need to SEE David Byrne in his “big suit”) than as a purely auditory one.</p>\n<p><b><span>What Happened? <i>Little Creatures, True Stories</i> and </span><i><span>Naked</span><br />\n</i></b>The last seven years of Talking Heads’ career span three albums and, if you believe Jeff, only four truly great songs. You may disagree with assessment, but what is beyond dispute, as all in the gang agree, is that the tail-end of the band’s career is for the most part a curiously astringent affair, as David Byrne retreats from the funk and afro-beat stylistics of <i>Remain In Light</i> and <i>Speaking In Tongues</i> for more direct ‘pop’ song structures that are largely uncompelling. <i>Little Creatures</i> (1985) is perhaps the best of these records, if for no other reason than that it begins and ends with two of Talking Heads’ all-time classics: “And She Was” (a subversively cheery hit single about a pedestrian suburban acid trip) and the fearless ode to nihilism of “Road To Nowhere.” <i>True Stories</i> (1986) is even worse, a nadir for the band — who were tasked with recording a series of songs that Byrne wrote for his vanity film of the same name, which ironically is far better than the album itself — unrelieved by a single good track outside of the musically splendid “Wild Wild Life.” Finally, <i>Naked</i> (1988) ends the band’s album career with a misbegotten attempt at returning to a more groove-based approach, but the feeling is gone…with one exception. And that sole exception is actually one of Talking Heads’ greatest achievements (and Byrne’s finest lyrics), the delightfully funny anti-ecofetishist anthem “(Nothing But) Flowers.”</p>\n<p><span><b>Finale<br />\n</b></span>Matt, Scot and Jeff each name their two key albums and five key songs by Talking Heads.</p>\n",
  "pubDate": "Mon, 9 Apr 2018 12:08:23 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to the<em> WSJ</em>‘s Matt Murray about Talking Heads.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Matt Murray, executive editor of the <i>Wall Street Journal</i><i></i>and author of <i>The Father and the Son: My Father’s Journey into the Monastic Life</i>. Follow Matt on Twitter at <a href=\"https://twitter.com/murraymatt\">@murraymatt</a>.</p>\n<p><span><b>Matt’s Music Pick: Talking Heads<br />\n</b></span>This week the gang stops making sense as they tackle Talking Heads, a band that resolutely defies easy classification. Beginning as the most self-consciously quirky (yet appealingly melodic) band on the New York CBGB punk/new-wave scene of the mid-1970s, they gradually transformed into pioneers of complex polyrhythmic Afrobeat fusion under the auspices of producer Brian Eno until suddenly remaking themselves once again as a pop band. All throughout, they were guided by the singular muse of lead singer (and guitarist) David Byrne, whose lyrical concerns ranged from quotidian to the profound and frequently encompassed both simultaneously. Matt tells the story of his exposure to Talking Heads, first as a child with <i>’77</i>, and then how they were ubiquitous on the college scene in 1983 with <i>Speaking In Tongues</i>. Jeff remembers to this day the moment he first became aware of the group: having his senses assaulted as a 10-year-old by the famous music video for “Once In A Lifetime” and barely being able to believe it wasn’t some sort of elaborate practical joke VH-1 was playing on him.</p>\n<p><span><b>From CBGB to <i>’77</i>: The Formative Years<br />\n</b></span>Scot and Jeff run through the brief history of Talking Heads’ formation: songwriter and guitarist David Byrne was in a band with drummer Chris Frantz while the pair were students at Rhode Island School of Design. After moving to New York City along with Frantz’s girlfriend (and later wife) Tina Weymouth, she is cajoled into learning to play the bass from scratch. She was a quick study and completed them as a trio just in time for them to be present at ground zero for the birth of the American punk/new-wave scene in New York City, centered around the Manhattan club CBGB and featuring such legendary artists as the Ramones, Television, Patti Smith, the Voidoids, and an odd-duck group that never quite fit in: Talking Heads. While the other groups in the scene were deeply confrontational, either playing loud and aggressively or adopting transgressive lyrical poses, Talking Heads were…downright nice. David Byrne’s terse, naively childlike quasi-Aspergers approach to lyrical themes immediately set him apart from the snarling contemptuousness of the rest of the American punk scene, while the band’s herky-jerky compact melodicism and clean crisp rhythms were miles away from the snarl of, say, Johnny Thunders and the Heartbreakers.</p>\n<p>Little wonder, then, that they were very quickly given a major-label record deal and immediately began to make good on it. Their only officially-released recording as a trio was their debut single “Love -> Building On Fire” (the title alone gives fair indication of how Byrne wrote), at which point they expanded to a quartet with the addition of keyboardist/guitarist Jerry Harrison (formerly of the ahead-of-their-time Modern Lovers), who rounded out their sound. This is the group that would record their debut album <i>Talking Heads: ’77</i> (no prizes for guessing which year it was released). Jeff thinks this is their most underrated album, unfairly neglected because it falls outside the upcoming “Eno trilogy,” and chockablock full of wonderful, weird tunes. Matt and Jeff spend a lot of time discussing why David Byrne is so compelling as a lyricist. Matt says that he is an artist in the truest sense of the word: trying to take the familiar things in this world and see them with fresh eyes. Jeff agrees and compares the seeming lack of artifice in Byrne’s vocals and lyrics to outsider art. He also adds that Talking Heads’ lyrics during this era make sense the moment you realize that they are meant wholly unironically: “New Feeling” is about a new feeling, “The Book I Read” is about a book David Byrne read, and “Don’t Worry About The Government” is a song that suggests that you shouldn’t worry about the government. Matt and Scot also note that “Pulled Up” is exactly what it purports itself to be: an earnestly cheerful song of thanks from Byrne to his parents for pulling him up from the doldrums of depression.</p>\n<p><span><b>The Brian Eno Era: <i>More Songs About Buildings and Food</i>, <i>Fear of Music</i>, and <i>Remain in Light<br />\n</i></b></span>Enter Brian Eno. Fascinated by the rhythmic and lyrical approach he heard on <i>Talking Heads: ’77</i> (so much so that he wrote an anagrammatic tribute to them on his own <i>Before And After Science</i> called “King’s Lead Hat”), Brian Eno came to the band and offered to produce their next album, beginning one of the most well-known artist/producer collaborations of the rock era. <i>More Songs About Buildings And Food</i> (1978) draws primarily from the same first batch of songs the group had written as far back as 1975, so structurally these songs sound the same as those on <i>’77</i>. Sonically, however, Eno brought them a quiet revolution: without attempting to remake the band in his own image (at least not yet), he lends them a sheen and in particular a percussive attack — most obviously on the hit single “Take Me To The River” — that was entirely absent from their previous work. Scot is a bit skeptical of <i>More Songs</i> but Matt and Jeff are both agreed that this is actually the band’s best album: unwaveringly consistent, still written in that disarmingly weird early Byrne lyrical style, and brilliantly sequenced. Jeff in particular singles out the joy of listening to “The Girls Want To Be With The Girls” tumble directly into “Found A Job” and realizing just how in command Talking Heads are over their artistic self-presentation. Scot considers TH’s version of “Take Me To The River” to be one of the greatest cover songs of all time (something that comes as no surprise to anyone who has heard our “Covers” episode), marveling at how the band and Eno slow the song down to an absolute crawl and yet retain its essential funk. Matt emphasizes that it is here where you can first begin to hear the ensemble sound that would fully bloom years later on <i>Remain In Light</i>: so many of the great moments on <i>More Songs</i> (“Artists Only,” “I’m Not In Love,” “Warning Sign,” “Found A Job,” “Stay Hungry”) are built around lengthy passages where the band just cuts loose and <i>plays</i>, hypnotically.</p>\n<p><i>Fear Of Music</i> (1979) is a departure for Talking Heads in many ways; the second record of their Eno trilogy finds Byrne working up a new batch of lyrics for the first time since the 1975-76 era, and his response was to create a concept album that most people never even realize is a concept album. This is “fear of”-music: songs each written about specific topics of potential neurosis. (Literally just add the words “(fear of)” as a parenthetical to every single song on the record outside the instrumental opener and you’ll get the point.) It’s hard to know whether Byrne is channeling his own feelings on songs like “Air” or “Memories Can’t Wait” or “Animals,” or speaking in an imaginative voice as on “Psycho Killer”, but the result is a glorious catalogue of modern paranoia. One that feels like it comes from a more personal place is “Heaven,” Byrne’s meditation on the afterlife. Jeff raves over the brilliance of the conceit — heaven as an eternity of boredom and ennui as you are spoonfed your “favorite things” over and over again without variety until you loathe them — and thrills to the way the ice of the click-clock metronomic arrangement finally cracks when Chris Frantz roars in frustration heading into the final chorus. Scot proclaims this their greatest album, citing Byrne’s vocal performance on “Mind” especially. Matt gets an enormous laugh out of “Life During Wartime” and “Air,” a song where (as he points out) Tina Weymouth’s backing vocals feel for all the world like they’re mocking David Byrne’s neurotic fear of very environment around him.</p>\n<p>As it turned out, the one song on <i>Fear Of Music</i> that pointed toward the band’s future was the mostly instrumental opening track “I Zimbra.” Without it, nothing would have prepared anyone for the landmark <i>Remain In Light</i> (1980), where the band as previously known nearly disappears, to be replaced by a polyrhythmic hydra. This album (inspired in large part by the recordings of Nigerian music legend Fela Kuti) basically invented the subgenre of rock/world-beat fusion, and yet has never itself been equalled in critical esteem. Which makes it all the more interesting that all three of the gang argue that this record, for all its universal critical adulation, is significantly flawed: the back end of the album is glutted with forgettable music and failed experiments. (“The Overload” = interesting in theory, pointless in practice.) But who cares, as Jeff says, when the first half of it is so perfect? The gang spends time discussing every song on <i>Remain In Light</i> (except for “Born Under Punches,” a fantastic song that we sadly could only spare a lone “TAKE A LOOK AT THESE HANDS!” for), but it’s “Once In A Lifetime” and the epochal “The Great Curve” that naturally come in for the most praise. If Scot is right that <i>Remain In Light</i> is not the place for neophytes to begin with Talking Heads because of its density and weirdness (and he is), this is nevertheless an album that all serious music lovers owe it to themselves to hear. But then the same could be said for all four of Talking Heads’ early albums.</p>\n<p><span><b>Hiatus and Return: <i>The Name of This Band Is Talking Heads</i>, <i>Speaking in Tongues</i> and <i>Stop Making Sense<br />\n</i></b></span>At the peak of their artistic powers, at the moment of their greatest critical praise . . . Talking Heads disbanded and took a hiatus from the studio for three years. This was telling as to the state of interpersonal affairs within the group (the developing bad blood between Byrne and Weymouth would eventually become the stuff of legend), but the upside of it is that the band took this time to release the live retrospective <i>The Name Of This Band Is Talking Heads</i> (1982). Matt and Jeff both urgently importune you: buy this album in its 2CD expanded reissue, as it is literally the single greatest record Talking Heads ever released. Yes, that’s right, a live album is your proper one-stop introduction to Talking Heads, as this is is a brilliant, copiously thorough (141 minutes in its reissued form) survey of Talking Heads at every stage of their live career, from 1977 all the way to the expanded ensemble heard on the 1980/81 <i>Remain In Light</i> tour. One of those secrets that only Talking Heads fans fully understand is that they were one of the great live acts of their era (or any era for that matter), and that, as well produced as their early records were, they came across even more vigorously and joyfully onstage. Jeff considers <i>The Name Of This Band</i> to be one of the four or five greatest live albums ever released, and he’s not alone in that sentiment. Check it out.</p>\n<p>In 1983, the Heads finally returned with <i>Speaking In Tongues</i>. Shorn of Eno and now self-producing, this represented their commercial and critical peak, although in retrospect all three of the gang agree it hasn’t aged as well. Still, this is Talking Heads working in a deep art-funk mode, with songs like “Making Flippy-Floppy” and “Girlfriend Is Better” rolling through oceanic grooves (“Burning Down The House” was inspired by Parliament Funkadelic and sounds like it). The gang is also less effusive in its praise of the critically beloved “live” album <i>Stop Making Sense</i> (1984) than most others: the word live is in scare quotes back there for a reason (everything was re-recorded in the studio except for the drums, pretty much) and all agree that it works far better as a visual experience (you really need to SEE David Byrne in his “big suit”) than as a purely auditory one.</p>\n<p><b><span>What Happened? <i>Little Creatures, True Stories</i> and </span><i><span>Naked</span><br />\n</i></b>The last seven years of Talking Heads’ career span three albums and, if you believe Jeff, only four truly great songs. You may disagree with assessment, but what is beyond dispute, as all in the gang agree, is that the tail-end of the band’s career is for the most part a curiously astringent affair, as David Byrne retreats from the funk and afro-beat stylistics of <i>Remain In Light</i> and <i>Speaking In Tongues</i> for more direct ‘pop’ song structures that are largely uncompelling. <i>Little Creatures</i> (1985) is perhaps the best of these records, if for no other reason than that it begins and ends with two of Talking Heads’ all-time classics: “And She Was” (a subversively cheery hit single about a pedestrian suburban acid trip) and the fearless ode to nihilism of “Road To Nowhere.” <i>True Stories</i> (1986) is even worse, a nadir for the band — who were tasked with recording a series of songs that Byrne wrote for his vanity film of the same name, which ironically is far better than the album itself — unrelieved by a single good track outside of the musically splendid “Wild Wild Life.” Finally, <i>Naked</i> (1988) ends the band’s album career with a misbegotten attempt at returning to a more groove-based approach, but the feeling is gone…with one exception. And that sole exception is actually one of Talking Heads’ greatest achievements (and Byrne’s finest lyrics), the delightfully funny anti-ecofetishist anthem “(Nothing But) Flowers.”</p>\n<p><span><b>Finale<br />\n</b></span>Matt, Scot and Jeff each name their two key albums and five key songs by Talking Heads.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 30: Matt Murray / Talking Heads",
  "itunes:author": "National Review",
  "itunes:duration": "02:37:13",
  "itunes:summary": "Scot and Jeff talk to the WSJ's Matt Murray about Talking Heads.",
  "itunes:subtitle": "Scot and Jeff talk to the WSJ's Matt Murray about Talking Heads.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 30
}