{
  "title": "Temporal evolutions and quasi-periodic variations present in the sunspot number and group sunspot area data measured at Kodaikanal Observatory for solar cycles 14 to 24. (arXiv:2211.01651v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01651",
  "description": "<p>The Kodaikanal Observatory has made synoptic observations of the Sun in white\nlight since 1904, and these images are sketched on the Stonyhurst grids called\nsun charts. These continuous hand-drawn data sets are used for long-term\nstudies of the Sun. This article investigates temporal and periodic variations\nof the monthly hemispheric sunspot number and sunspot group area for\n1905--2016, covering solar cycles 14 to 24. We find that the temporal\nvariations of the sunspot number and group area are different in each\nhemisphere and peak at different times of the solar cycle in the opposite\nhemisphere. For both the data sets, Cycle 19 shows maximum amplitude. For the\nsunspot number time series, Cycle 24 was the weakest, and Cycle 15 for the\ngroup area. The existence of double peaks and violation of the ``odd-even\nrule'' was found in both data sets. We have studied the periodic and\nquasi-periodic variations in both the time series by wavelet technique. We\nnoticed that along with the fundamental mode of the $\\sim$ 11~year cycle and\npolarity reversal period of 22~years, the sunspot activity data also exhibited\nseveral mid-term periodicities in the opposite hemispheres, specifically the\nRiger group and quasi-biennial periodicities. The temporal evolution of these\ndetected quasi-periodicities also differs in the northern and southern\nhemispheres. We analyzed the data set statistically to understand the bulk\nproperties and coupling between the opposite hemispheres. The study indicates\nthat the two hemispheric data sets differ, but some dependency could be\npresent.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Ravindra_B/0/1/0/all/0/1\">Belur Ravindra</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chowdhury_P/0/1/0/all/0/1\">Partha Chowdhury</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ray_P/0/1/0/all/0/1\">Pratap Chandra Ray</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Pichamani_K/0/1/0/all/0/1\">Kumaravel Pichamani</a>"
}