{
  "id": "yt:video:TrsMElDF89g",
  "yt:videoId": "TrsMElDF89g",
  "yt:channelId": "UCHAtzWEoegu7Z5zEVzjOM_Q",
  "title": "Smooth Spaces 2: Axioms Of Synthetic Differential Geometry",
  "link": "",
  "author": {
    "name": "Richard Southwell",
    "uri": "https://www.youtube.com/channel/UCHAtzWEoegu7Z5zEVzjOM_Q"
  },
  "published": "2021-07-21T05:00:19+00:00",
  "updated": "2022-01-13T23:15:27+00:00",
  "media:group": {
    "media:title": "Smooth Spaces 2: Axioms Of Synthetic Differential Geometry",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In this video we describe the axioms of synthetic differential geometry. We begin by a discussion of how the continuum is set up, and about the basic concepts of spaces, functions and products. We also describe how diagrams can be used to represent relationships between functions. In addition to covering the basic axioms about the behavior of the smooth line, we discuss nilsquare infinitesimals, and the central `principle of microaffineness' and we explain how it can be used to describe the derivative of a function. We also explain why our axioms require the underlying logic to be intuitionistic, and force the maps we consider to correspond to continuous functions.\n\nA rigorous approach to this subject, emphasizing the category theoretic foundations, can be found here:\n\nCategory Theory For Beginners: Synthetic Differential Geometry\nhttps://youtu.be/y9ieJ1Gpl6Y\n\n\nMore videos about various things to do with synthetic differential geometry can be found within my playlist:\n\nhttps://youtube.com/playlist?list=PLCTMeyjMKRkqy3NUHnMeY-PGgsZ963F58\n\nA video about intuitionistic logic and type theory can be found here:\nhttps://www.youtube.com/watch?v=h6rTlirbfRI&list=PLCTMeyjMKRkqTM2-9HXH81tvpdROs-nz3&index=5\n\nA video about the internal language of a topos (the Mitchell-Benabou language) can be found here:\nhttps://youtu.be/66glvnHX-a8",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}