{
  "title": "14: The Devil Watches Me Sleep | RGSO Classic",
  "link": "https://audioboom.com/posts/8179015",
  "itunes:episode": 14,
  "itunes:title": "The Devil Watches Me Sleep | RGSO Classic",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2125,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>A child tells his grandmother that the “devil watches him sleep at night”. <br>\nWho was the spirit lingering in the doorway late one night?<br>\nHere is a preview of the story. <br>\n“My mom was lying in her bed facing me and I was facing her with my back directly to the doorway. While we were talking, we did touch on our great aunt that had passed as well as my mom's dad who had passed as well a couple of months apart that year. Maybe a few minutes after we had gone on to a new subject, I suddenly got this weird tight feeling on my back as if I could sense that someone had just walked in, but the only other person that could have been at the time was my brother who was not home. It also was not our dog because she was on the bed as well with my mom. I did not really give it much thought until a moment later when I got the feeling again and this time with a sense to turn around. I finally gave into the urge and gave a quick glance towards the door and happened to see the last little bit of a shadow walk past the doorway. It did not really register in my brain what happened until about a minute later when my mom suddenly asked, \"Did you see it too?\" I replied and told her that I got a weird feeling to turn around and that is when she told me that at the same time I turned around, not only did she get a sense to turn her head and look out to the hallway, but the dog also perked up and looked at the doorway too.”<br>\n<br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a>\n</div>\n",
  "pubDate": "Sat, 22 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-21:/posts/8179015",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}