{
  "title": "Automating the Data Scientist",
  "category": [
    "Business",
    "Machine Learning"
  ],
  "dc:creator": "Louis Dorard",
  "pubDate": "Thu, 15 May 2014 14:41:42 +0000",
  "link": "https://www.ownml.co/blog/automating-the-data-scientist",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:5374d233e4b02004337721c0",
  "description": "What is a Data Scientist? What is it that they do that is now being \nautomated? What are the new solutions out there that are bringing Data \nScience directly to domain experts? What is it changing?",
  "content:encoded": "<p>Talking about automating one's job is a difficult exercise. People who need to have the job done but don't know how (or don't have enough resources) are bound to like the message. People who work on this automation can only approve. But many of those who do that job for a living will disagree. As I said in a <a href=\"http://www.louisdorard.com/blog/building-a-business-around-machine-learning-apis\">previous post</a>, my GigaOM piece on <a href=\"http://gigaom.com/2014/05/07/the-goal-of-data-scientists-is-to-put-themselves-out-of-business/\">Data Scientists putting themselves out of business</a> received mixed reactions. This is a complex topic, so let me add some more details to explain the perspective and context.</p>\n\n<h2 id=\"whatisadatascientist\">What is a Data Scientist?</h2>\n\n<p>The role of a Data Scientist hasn't been standardized, so everyone has their own definition. Also, the duties vary across companies of different sizes operating in different industries and structured in different ways. When I read about what people who have a \"Data Scientist\" title do, I often have to revisit my own conception of what a DS is.</p>\n\n<p>So instead of giving a definition of the role, let me try to characterize the abilities of the people behind the title. To me, a Data Scientist is someone who has business acumen, technical skills, and who knows Machine Learning. The last point is key. Those who do not have Machine Learning expertise are Data Engineers, Data Analysts, <a href=\"http://www.fastcompany.com/3020211/dialed/why-data-artisans-are-the-new-data-scientists\">Data Artisans</a>, Data <em>Somethingelse</em>. Therefore, this discussion is focused on the Machine Learning component of the Data Scientist's role.</p>\n\n<p>Apparently, people were shocked to hear me say that \"most of a Data Scientist’s time is spent creating predictive models.\" Based on what I just said, applying Machine Learning technology to data should be an important part of the job. The fact that you're combining this with technical skills and business acumen implies that you're working on that data and that you're creating value from the model. \"Creating predictive models\" encompasses collecting, cleaning, wrangling data that is used to build the model, and putting the model to good use. </p>\n\n<p>I <a href=\"http://www.john-foreman.com/1/post/2014/05/the-forgotten-job-of-a-data-scientist-editing.html\">totally agree with John Foreman when he says that predictive modeling is a means, not an end</a>. This is something that I emphasize in <a href=\"http://www.louisdorard.com/machine-learning-book\">my book</a> (<em>Chapter 5. Applying ML to your domain > Specifying the right problem > Making predictions... so what?</em>): don't build a model before you have an idea of how it will be of value and before you know how to measure its impact. Another very good point that Foreman makes is that \"complexity must be justified\". Actually, I like simplicity so much that I'm talking about it in my <a href=\"http://www.louisdorard.com/about\">bio</a>. As a side note, one of the things that's cool with tools like <a href=\"http://www.bigml.com/\">BigML</a> is that they allow you to automate the creation of predictive models but also to choose the degree of complexity of your model.</p>\n\n<h2 id=\"wherewearetoday\">Where we are today</h2>\n\n<p>There are three points I want to make about automating the Data Scientist:</p>\n\n<ul>\n<li>When you're in the business of making computer programs, for data-related things or anything else, it's your job to try to automate yourself. Succeeding at this is a different thing. When I did my ML thesis for instance, I wasn't able to fully automate the selection of hyperparameters of my <a href=\"http://discovery.ucl.ac.uk/1348319/\">Gaussian Process bandit algorithm</a>, but I still tried and experimented.</li>\n<li>People in the fields of Data Science and Machine Learning are actively working on automating parts of their jobs and they've come up with new predictive modeling solutions that are being used directly by domain experts: <a href=\"http://www.ayasdi.com/product/\">Ayasdi</a>, <a href=\"https://www.youtube.com/watch?v=R2EQ3Gg8r6s\">BeyondCore</a>, <a href=\"http://www.baynote.com/products-solutions/\">Baynote</a>, <a href=\"http://apigee.com/about/products/big-data\">Apigee</a>, <a href=\"http://www.emeraldlogic.com/\">Emerald Logic</a>, <a href=\"http://emcien.com/solutions/uses/predictive-analytics/\">Emcien</a>, <a href=\"http://www.bigml.com\">BigML</a>, <a href=\"http://www.predictivedb.com/\">PredictiveDB</a>, <a href=\"https://developers.google.com/prediction/\">Google</a>, <a href=\"http://www.wise.io\">Wise.io</a>, <a href=\"http://www.ersatzlabs.com/\">Ersatz Labs</a>, <a href=\"http://www.xyggy.com/\">Xyggy</a>, <a href=\"http://predicsis.com/\">PredicSis</a> and many others. Besides, a couple of days ago I came across a research project at Cambridge University led by Zoubin Ghahramani and entitled <a href=\"http://mlg.eng.cam.ac.uk/?p=1578\">\"The Automatic Statistician\", which has won a $750,000 Google Focused Research Award</a>.</li>\n<li>Some of these solutions are actually being used in production. There aren't many public benchmarks to assess their performance, but for now, you can check out <a href=\"http://blog.bigml.com/2012/08/27/machine-learning-throwdown-part-4-predictions/\">how BigML compares to popular algorithms in Weka</a>, <a href=\"http://www.wise.io/blog/benchmarking-random-forest-part-1\">how Wise.io compares to various random forest implementations</a>, and <a href=\"http://www.prnewswire.com/news-releases/emerald-logic-announces-collaboration-with-kings-college-london-on-quantitative-biomarker-discovery-189970381.html\">how Emerald Logic's FACET advances medical research</a>.</li>\n</ul>\n\n<p>A post on automating the Data Scientist wouldn't have made much sense three years ago because the solutions I mention didn't exist or weren't used then, and there wasn't a trend yet. If you are sceptic about what they do, I urge you to set up a free account with <a href=\"http://www.bigml.com/\">BigML</a> (which today is the most accessible of these solutions) and to give it a try — if only for intellectual curiosity. Then, take a minute to consider the benefits that a service like this can bring.</p>\n\n<h2 id=\"plentyofcompaniesproblemsanddata\">Plenty of companies, problems and data</h2>\n\n<p>As for any technology-related activity, people's outlook on Data Science can vary quite much depending on the type of company they work for. In large companies that have been doing Data Science for a while and where people use state-of-the-art solutions that they spent countless hours to set up, you don't see things changing anytime soon. </p>\n\n<p>Then there are businesses who need to stay at the forefront or even to advance the state of the art if they want to stay ahead of the competition. Netflix or Spotify are not going to use automatic solutions like <a href=\"http://www.directededge.com/\">DirectedEdge</a>'s to power their movie or music recommendations. They are, and will likely always be, building their own recommender systems. Right now, they are tackling the next big challenge in this area: looking at and understanding the actual content of items before making recommendations to users.</p>\n\n<p>But state-of-the-art doesn't concern everyone. There are businesses that can shine with the simplest application of Machine Learning / predictive analytics, because they use it in a domain where no one else knows about it, or in a way that no one has thought of.</p>\n\n<blockquote>\n  <p>“You don’t need to predict accurately to get great value. Organizations, by making predictions per person that are a good bit better than guessing, actually play the numbers game better.” — Eric Siegel</p>\n</blockquote>\n\n<p>In a startup or in a small business, you can now do the same thing a Data Scientist would, without knowing ML algorithms. All you need is business acumen, technical skills, and Prediction APIs to remove Machine Learning's barrier to entry. <a href=\"http://www.fastcompany.com/3020211/dialed/why-data-artisans-are-the-new-data-scientists\">As Dan Putler of Alteryx puts it</a>: \"Data artisans allow businesses to do deeper, more predictive analytics than they would otherwise be able to do.\" He is also one to predict that Data Artisans will partially take over the functions of Data Scientists in the near future.</p>\n\n<p>Is that a threat to Data Scientists? Not necessarily. According to Josh Wills, Senior Director of Data Science at Cloudera, there's no reason to worry about their future: \"There is plenty of data and plenty of problems for everybody to work on.\"</p>\n\n<h2 id=\"stillhardwork\">Still hard work</h2>\n\n<p>Remember that, even though some of the learning techniques are automated, you still have to prepare the data to learn from (feature engineering, data extraction, cleaning, etc.) and to deliver value with whatever predictive model you come up with. If it was that easy, I wouldn't have written a <a href=\"http://www.louisdorard.com/machine-learning-book\">book</a> on the topic!</p>\n\n<p>Here is a workflow for applying Machine Learning in your business (or in your application):</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  \n  \n    \n\n      \n\n      \n        <figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5206b718e4b0bdc26006bae2/1400347749122-5M0VUMOCBW5PH3YSER69/image-asset.png\" data-image-dimensions=\"317x473\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"53779c65e4b0f1679c09f391\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5206b718e4b0bdc26006bae2/1400347749122-5M0VUMOCBW5PH3YSER69/image-asset.png?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n\n<p>Only three of these things are being automated (those in black). This means that it still takes lots of efforts to transform data into value, but that Data Scientists can now focus on more meaningful activities. If revenue is on the line, they can later work at making fancier models that improve accuracy, but only after all the rest has been done.</p>\n\n<p>For those who work in smaller companies, you can now \"bootstrap\" Machine Learning to improve your business. Even though there's hard work ahead of you, it's manageable and it's considerably less than if you'd also had to learn how to use Machine Learning algorithms to create predictive models. Most often, these algorithms are the barrier to entry to Data Science, but they are not what represents most of the work: it's rather in what happens before and after the algorithms are used, and you're likely to already have the right competencies in your team to work on that.</p>\n<iframe scrolling=\"yes\" src=\"https://dl.dropboxusercontent.com/u/685335/optin.html\" allowtransparency=\"true\" width=\"100%\" frameborder=\"0\" id=\"mailchimp\" height=\"400px\"></iframe><p>Enjoyed this article? <a href=\"https://news.ycombinator.com/submit\" class=\"hn-button\" data-title=\"Automating the data scientist\" data-url=\"http://www.louisdorard.com/blog/automating-the-data-scientist\">Vote on Hacker News</a> and <a href=\"http://www.twitter.com/louisdorard\">follow me!</a></p>",
  "media:content": {
    "media:title": "Automating the Data Scientist"
  }
}