{
  "title": "Dude Who Filed Ridiculous Lawsuit Over Title Of Mariah Carey&#8217;s Most Famous Song Drops Case After Pretending They Sound The Same",
  "link": "https://www.techdirt.com/2022/11/03/dude-who-filed-ridiculous-lawsuit-over-title-of-mariah-careys-most-famous-song-drops-case-after-pretending-they-sound-the-same/",
  "comments": "https://www.techdirt.com/2022/11/03/dude-who-filed-ridiculous-lawsuit-over-title-of-mariah-careys-most-famous-song-drops-case-after-pretending-they-sound-the-same/#comments",
  "dc:creator": "Mike Masnick",
  "pubDate": "Thu, 03 Nov 2022 22:33:50 +0000",
  "category": [
    "sony music",
    "all i want for christmas is you",
    "andy stone",
    "copyright",
    "louisiana",
    "sanctions",
    "song titles",
    "vince vance"
  ],
  "guid": "https://www.techdirt.com/?p=381464",
  "description": "Back in June we wrote about an absolutely ridiculous lawsuit filed by a guy named Andy Stone, but who performs as Vince Vance and the Valiants, against Mariah Carey, claiming copyright infringement from her song &#8220;All I Want for Christmas is You.&#8221; As we noted at the time, the only similarity between the two songs [&#8230;]",
  "content:encoded": "<p>Back in June we wrote about <a href=\"https://www.techdirt.com/2022/06/06/not-how-any-of-this-works-mariah-carey-sued-over-title-of-song/\">an absolutely ridiculous lawsuit</a> filed by a guy named Andy Stone, but who performs as Vince Vance and the Valiants, against Mariah Carey, claiming copyright infringement from her song &#8220;All I Want for Christmas is You.&#8221; As we noted at the time, the <em>only</em> similarity between the two songs is the title and the theme, and neither of those are covered by copyright. Indeed, there are other songs that predated Stone&#8217;s song that also have the same title.  The <a href=\"https://www.youtube.com/watch?v=aAkMkVFwAoo\">Carey song</a> and the <a href=\"https://www.youtube.com/watch?v=w8HWHd0EYJA\">Vance song</a> (released five years earlier) sound nothing alike.</p>\n<p>The original complaint didn&#8217;t even try to claim that they sounded alike. It just complained that Carey didn&#8217;t seek permission from Stone. But she doesn&#8217;t need to, because she didn&#8217;t copy anything.</p>\n<p>Incredibly, Stone filed an <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.laed.254179/gov.uscourts.laed.254179.6.0.pdf\">amended complaint</a> that made things even worse. As we noted, the original didn&#8217;t even claim the music was similar. The amended complaint argues that they <em>are</em> musically similar. But not in ways that are copyrightable:</p>\n<blockquote>\n<p><em>\nAnalyzing the melody of each song, the overall contour of the same is substantially similar.\nIn both songs, the notes of the singer’s melody ascend and descend in identically. While Defendants\nis more disjunct and includes more melisma, that is characteristic of Carey’s R&B style, which is\nvocally different from Vance’s country style. However, these differences are more of a matter of\nperformance than composition. </p>\n<p></em></p>\n</blockquote>\n<p>This is&#8230; garbage. The songs are totally different.  And then they make it worse, claiming lyrically they are similar as well. Again, they are not:</p>\n<blockquote>\n<p><em>\nFurther, the overall period of the melodic phrasing is comparable. Specifically, both songs\nuse an antecedent-consequent phrase structure, where the initial phrase (a) ascends melodically, and\nthe response phrase (b) then descends. (e.g., the beginning of each verse: (a) “If I wrote a letter to\nSanta Claus,” (b) “I would ask for just one thing” is comparable to (a) “I don’t want a lot for\nChristmas,” (b) There is just one thing I need.”)</p>\n<p></em></p>\n</blockquote>\n<p>There are a few other attempts at this. They&#8217;re all so ridiculous that I would have been surprised if Carey&#8217;s lawyers didn&#8217;t seek to have Stone pay their legal fees and/or seek sanctions against the lawyers who filed such a garbage lawsuit.</p>\n<p>Of course, for now we won&#8217;t know, because, without Carey&#8217;s lawyers filing anything in response, Stone has <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.laed.254179/gov.uscourts.laed.254179.16.0.pdf\">now dropped the suit</a>, though without prejudice, so in theory he could refile it again (or somewhere else). I have no idea why he dropped the lawsuit, but (again) if Carey&#8217;s lawyers pointed out that he was likely to lose badly and have to pay the other side, and that the lawyers could get sanctioned, they might have realized that dropping the suit before Carey filed a reply and could seek all of those things&#8230; might be the more prudent course of action.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/03/dude-who-filed-ridiculous-lawsuit-over-title-of-mariah-careys-most-famous-song-drops-case-after-pretending-they-sound-the-same/comments/feed/",
  "slash:comments": 13
}