{
  "title": "S15 Ep6: Supernatural News/Parashare: Fly Me To The Moon Edition",
  "link": "https://audioboom.com/posts/8098517",
  "itunes:episode": 6,
  "itunes:title": "Supernatural News/Parashare: Fly Me To The Moon Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 7098,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS is back with a BRAND NEW Supernatural News & ParaShare, Fly Me To The Moon Edition!<br>\n<br>\nToday we invite you to join the 238,857 Mile High Club, The Gov't is still hiding things from us, a break in the missing Malaysian Flight MH370 Case, Dave sings some songs and invites you all to sing along, PLUS new ParaShare stories from listeners!<br>\n<br>\nCall and share your story 651-300-4977<br>\n<br>\nVisit our shop for books and great gift items: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "BEYOND the DARKNESS is back with a BRAND NEW Supernatural News & ParaShare, Fly Me To The Moon Edition!\n\nToday we invite you to join the 238,857 Mile High Club, The Gov't is still hiding things from us, a break in the missing Malaysian...",
  "pubDate": "Sat, 18 Jan 2020 10:00:00 +0000",
  "guid": "a49261c3-e584-458f-8949-9fe6b1dbaad6",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}