{
  "title": "#32: Hollywood Director (Neal Brennan)",
  "itunes:title": "Hollywood Director with Neal Brennan",
  "pubDate": "Mon, 21 Nov 2011 09:25:00 +0000",
  "guid": "5cca2727c9fc1cf9275baf91cde572ae",
  "link": "https://shaffir1.libsyn.com/32-hollywood-director-neal-brennan-",
  "itunes:image": "",
  "description": "<p><a href=\"http://nealbrennan.com/\" target=\"_blank\" style=\"font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">Neal Brennan</a><span class=\"Apple-style-span\" style=\"font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">invited me over to his place to talk about his experiences being a film director. He's the only guy I know, know who's gotten to direct an actual Hollywood movie. It's pretty cool. We covered that and our meanderings (that's a word now) took us to standup, Occupy Wall Street, and a bunch of other places. There was a little chunk in the middle that I had to cut out because I ended up mentioning some private information about one of my buddies that I realized I shouldn't have mentioned. It wasn't even anything funny or interesting so I didn't mind dropping it out anyway</span></p>",
  "content:encoded": "<p><a href=\"http://nealbrennan.com/\" target=\"_blank\" style=\"font-family: Georgia, 'Times New Roman', 'Bitstream Charter', Times, serif; font-size: 13px; line-height: 19px;\">Neal Brennan</a>invited me over to his place to talk about his experiences being a film director. He's the only guy I know, know who's gotten to direct an actual Hollywood movie. It's pretty cool. We covered that and our meanderings (that's a word now) took us to standup, Occupy Wall Street, and a bunch of other places. There was a little chunk in the middle that I had to cut out because I ended up mentioning some private information about one of my buddies that I realized I shouldn't have mentioned. It wasn't even anything funny or interesting so I didn't mind dropping it out anyway</p>",
  "enclosure": "",
  "itunes:duration": "01:53:04",
  "itunes:explicit": true,
  "itunes:keywords": "the,Show,joe,half,skeptic,street,neil,tank,wall,ari,Neal,baked,brennan,rogan,goods,chappelle,shaffir,sceptic,deathsquad,occupy,shafir,brenan",
  "itunes:subtitle": "invited me over to his place to talk about his experiences being a film director. He's the only guy I know, know who's gotten to direct an actual Hollywood movie. It's pretty cool. We covered that and our meanderings (that's a word now) took us to...",
  "itunes:episode": 32,
  "itunes:episodeType": "full",
  "itunes:author": "Ari Shaffir"
}