{
  "title": "Special Episode: The Podcasting Industry Comes Into Its Own",
  "description": "<p>Moves toward scale and consolidation show promise for&nbsp;what is already a burgeoning content industry.&nbsp;</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>And I'm Ben Swinburne, Equity Analyst covering Media, Entertainment, Advertising and the cable/satellite industries.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>And today on the podcast will be going a bit meta, as the kids say, as we talk about some interesting upside for podcasting and advertising. It's Tuesday, October 19th at 2pm in London.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>[00:00:25] And 9am in New York.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So, Ben, you recently wrote a research report titled, a bit surprisingly, “Mic'd Up. Is Podcasting the Next Big Thing?” I say surprisingly, because podcasting has been around for quite a while now. So why do you think that it's now where it's actually going to be it's time to shine?</p><p>&nbsp;</p><p><strong>Ben Swinburne</strong> You're right. Podcasting has been around probably for at least 15 years, but what we're really seeing is a significant increase in engagement by consumers, investment by platforms and content creators jumping into this space. We think we're at a point now where the business model, at least from an advertiser ROI point of view, has been proven out. You know, advertisers are paying $20-$25 CPMs, or cost per thousand listeners, to access a podcast audience, particularly through host-read ads, that's as high as linear television. And that just shows you that advertising on podcasting works for advertisers. So, what the&nbsp;&nbsp;&nbsp;industry needs from here is significant growth in adoption, which we believe is going to come given the investment we're seeing in content. Wrapping it all up, we think the industry can grow at a 30% CAGR through 2025 and become a $6-7 billion market globally, which is meaningful for the companies that are in this space.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So to kind of put those numbers in context, if I have a podcast that has 4,000 regular listeners, you know, if I'm getting paid by an advertiser $25 per thousand, that'd be about $100 for that $4,000 advertising block. Is that a good way to kind of think about those numbers.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Per spot, yes. And then obviously, it's a question for you on your podcast, how many ads you want to run per hour.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Podcasting is now charging, was it similar advertising rates as local television? Did I hear that correctly?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>You did. You did.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Would you say though, investors believe in that? Because you cover a wide range of media companies in your equity coverage here at Morgan Stanley, how is the market pricing that advertising opportunity? And do you think the market believes that podcasting can be this major advertising vehicle?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>I think the market's skeptical, frankly. Part of that is because as we talked about earlier, podcasting is not new as a media. But also because even at 15-years-old with a lot of excitement around it, it's a very small market. You know, estimates range from a billion dollars to maybe $2 billion in 2020 of global ad revenue on podcasting. That is a low single digit percentage of the global ad market.&nbsp;it's just been a very slow rise in monetization. And I think the market is skeptical that it can really break out from here.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So I imagine another area where the market might be skeptical is a lot of people have been stuck inside as a result of the pandemic. They've been listening to more podcasts. But as things normalize, maybe that listening trend will shift. Can you just kind of give us some numbers around, what percentage of the U.S. population listens to podcasts and do you think that that engagement will decline or rise as we look ahead over the next couple of years?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>In 2020, the reach of podcasting in the U.S. accelerated to 25% of the population. If we think about that level of adoption, in a lot of other instances, Andrew, that's a part of the S curve where we start to really see the adoption rate accelerate. In other words, you're going from sort of early adopter to mass market. So that's our expectation here. We actually saw that in streaming music years ago. So, we're optimistic that we're going to see that from here. And frankly, when I look at the investment, the amount of money companies are pouring into content and monetization technology, I'd be really surprised if we don't see it accelerate. The other thing I would add is that even though podcasts consumption held up well in 2020, it was still negatively impacted by the pandemic. People were not commuting, not going to the gym, not going to work. All of that reduced the amount of time people were consuming audio content on their phones. So that is still the primary use case for all audio consumption but including podcasts. So we have started to see already improving data in the last several months on audio consumption as people have started to go back to work and go to school and hit the gym again.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So then, Ben, can you talk a little bit more about what's been happening on the merger and acquisition front in podcasting? And how this media is getting reshaped by some of the changes that we've seen?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Absolutely. Yeah, it's a very active market. You can sort of break down the M&A into two broad areas: content and sort of advertising technology. If you think about the media business, in the sort of the pre-internet days, you had media producers and media distributors, it's a pretty simple value chain. The internet, by its nature, but also because it's much less regulated, has created an environment for more vertical integration. Podcasting is rapidly moving in that direction, with distributors buying up podcast IP and creators rapidly. Now, that can probably only go so far because, like music, podcasting is a business built on ubiquitous distribution. So, where we've seen exclusives, they just haven't really worked, and that makes sense from an advertising monetization point of view. On the monetization front, there is a lot of work left to do. I mean, we're still looking at a very, while attractive media for advertisers, pretty old school in the way the ad products actually work. Now this is starting to change. We're seeing more things like advanced measurement, attribution, programmatic buying-- all wonky things us media people like to talk about. But the most popular ad format in podcasting is host-read ads. It's Bill Simmons reading a promo code to go to a website and buy a product. You know, this is like Howard Stern 25 years ago. So, from that point of view, it's still early days.</p><p>&nbsp;</p><p><strong>Andrew Sheets</strong> So, to kind of put some numbers around that, I mean, could you give us a sense of how much is currently being spent on podcast advertising versus other types of advertising that are out there?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Oh, yeah, absolutely. I mean, the video market is $100 billion in the United States. Between linear television and streaming video, the radio, traditional radio market in the United States is sort of $15 to $18 billion. And as I mentioned before, podcasting, we think will probably be around 2 billion this year.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Got it. So, it's still even as ubiquitous as it's starting to seem. It's still very small, still very nascent relative to some of these much bigger areas where companies are already spending a whole lot of money.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>That's right.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So, Ben, you cover a large number of the largest entertainment and media companies. What do you think is going to be their strategy for podcasting going forward? And do you see this as more of a US opportunity, a global opportunity or something in the middle?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>We think the strategy going forward is primarily one that monetizes podcasting through advertising. And to be successful in that, you're going to need a significant content offering. But also, importantly, a scaled and advanced technology platform. And so, we're seeing companies that are going after this opportunity really invest aggressively in both. In terms of U.S. versus global, we definitely see it as a global opportunity. However, if we think about the TAM for podcast advertising, radio is the obvious one. Radio is very much a U.S. marketplace. A lot of radio outside the U.S., think of BBC One in the U.K., is in fact ad free. So, the global radio advertising opportunity skews very much U.S. That's why it's so important that podcasting can attract digital advertisers or buyers of digital advertising - those that might buy search or display ads - that opens up podcasting to a much larger opportunity and global.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>And Ben, I was hoping you could also talk a little bit about what are the demographics of podcast listeners and how does that impact the advertising landscape?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>So as you can probably guess, particularly since we're in the early adopter phase of podcasting, it does skew, sort of technology savvy, educated and often higher income from an audience point of view. That's part of why advertisers are so attracted to the space and why the ad rates are so high. Clearly, the long-term bull case is widespread adoption now as reach goes from 25% of the population to hopefully 50% and 75%, by definition the audience is going to look much more representative of the overall population, which will bring with it, you know, lower income or advertising targets that have lower propensity to spend. So that will get reflected in ad rates and probably different kinds of ad products. But ultimately, even if that puts some downward pressure on ad rates, we think the growth in engagement will more than offset that, creating a nice growth story over time.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Ben, I thought you made a really interesting point about just the types of advertising that are most effective here, you know, often, host read, often funny are very engaging. I mean, is there a good precedent in advertising for something that feels that personal? And, is there any other, implications for that just about how advertising feels and sounds, more broadly going forward?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>It's a great point, and it's a good news, bad news situation, I think, for the industry. The good news is that host read ads are incredibly effective. The demand outstrips supply, frankly, and the more widespread, highly popular podcasts that can be developed, the more opportunities there will be for monetization. The bad news is that to really scale the business host read ads are just it's hard to scale them. You can only have so many in an hour. And if you want to start really doing sophisticated, digitally driven ad buys and ad provisioning, you've got to automate all that. And doing host read ads in an automated fashion across the long tail of millions of podcasts really can't be done. The industry now is working on lots of technology and ad products to try to create an ad product or an ad unit that is hopefully not as effective as host read, but more effective than traditional radio.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So, Ben as somebody whose father back in the day used to sell advertising for a radio station. What do you think are the questions that companies who want to advertise in a podcast should be asking to try to maximize that effectiveness?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Well, a lot of the measurement in attribution technology today remains pretty early stage, frankly. Most of the podcast business historically has been measured by downloads. But just because you download a podcast doesn't mean you listen to it. And frankly, nobody really downloads podcasts anymore because they're all streamed. That just gives you an example of a key area like measurement that needs to evolve. You can go even beyond that when you think about multichannel attribution. For example, let's say I listen to a podcast ad and then I go online and I buy that product. How does the advertiser know that I went to buy that product because I heard that ad? Those things are all happening at a pretty sophisticated level online in general today. But podcasting is not plugged into that ecosystem in a real way yet.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>And finally, Ben, you know, based on your work and your forecasts, what do you think the next five years hold for the podcasting industry?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>We expect to see continued substantial investment in podcasting content, monetization technology and also personalization and curation. I think one of the challenges that consumers have, as I mentioned earlier is there's well over two million podcasts in a lot of these major platforms, so figuring out what to listen to is challenging. Sampling a song which might be 3 or 4 minutes long is a commitment. Sampling a 30/45 minute podcast is a whole different situation. And so those companies that can help consumers find what they want to listen to, that could be a huge advantage in the marketplace. And I'd say, much like we've seen in streaming video, we think we'll see an explosion of compelling podcast content across genres and across countries. There is so much talent out there which, when combined with the global growth and connectivity and connected devices, means we will all be plugged in all of the time, hopefully feeding our minds and hearts with information and stories from around the world.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Fantastic. I think that's a great place to leave it. Ben, great chatting with you.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Great speaking with you, Andrew.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "itunes:title": "Special Episode: The Podcasting Industry Comes Into Its Own",
  "itunes:episodeType": "full",
  "itunes:episode": 475,
  "itunes:summary": "Moves toward scale and consolidation show promise for what is already a burgeoning content industry.",
  "content:encoded": "<p>Moves toward scale and consolidation show promise for&nbsp;what is already a burgeoning content industry.&nbsp;</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Chief Cross Asset Strategist for Morgan Stanley Research.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>And I'm Ben Swinburne, Equity Analyst covering Media, Entertainment, Advertising and the cable/satellite industries.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>And today on the podcast will be going a bit meta, as the kids say, as we talk about some interesting upside for podcasting and advertising. It's Tuesday, October 19th at 2pm in London.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>[00:00:25] And 9am in New York.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So, Ben, you recently wrote a research report titled, a bit surprisingly, “Mic'd Up. Is Podcasting the Next Big Thing?” I say surprisingly, because podcasting has been around for quite a while now. So why do you think that it's now where it's actually going to be it's time to shine?</p><p>&nbsp;</p><p><strong>Ben Swinburne</strong> You're right. Podcasting has been around probably for at least 15 years, but what we're really seeing is a significant increase in engagement by consumers, investment by platforms and content creators jumping into this space. We think we're at a point now where the business model, at least from an advertiser ROI point of view, has been proven out. You know, advertisers are paying $20-$25 CPMs, or cost per thousand listeners, to access a podcast audience, particularly through host-read ads, that's as high as linear television. And that just shows you that advertising on podcasting works for advertisers. So, what the&nbsp;&nbsp;&nbsp;industry needs from here is significant growth in adoption, which we believe is going to come given the investment we're seeing in content. Wrapping it all up, we think the industry can grow at a 30% CAGR through 2025 and become a $6-7 billion market globally, which is meaningful for the companies that are in this space.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So to kind of put those numbers in context, if I have a podcast that has 4,000 regular listeners, you know, if I'm getting paid by an advertiser $25 per thousand, that'd be about $100 for that $4,000 advertising block. Is that a good way to kind of think about those numbers.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Per spot, yes. And then obviously, it's a question for you on your podcast, how many ads you want to run per hour.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Podcasting is now charging, was it similar advertising rates as local television? Did I hear that correctly?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>You did. You did.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Would you say though, investors believe in that? Because you cover a wide range of media companies in your equity coverage here at Morgan Stanley, how is the market pricing that advertising opportunity? And do you think the market believes that podcasting can be this major advertising vehicle?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>I think the market's skeptical, frankly. Part of that is because as we talked about earlier, podcasting is not new as a media. But also because even at 15-years-old with a lot of excitement around it, it's a very small market. You know, estimates range from a billion dollars to maybe $2 billion in 2020 of global ad revenue on podcasting. That is a low single digit percentage of the global ad market.&nbsp;it's just been a very slow rise in monetization. And I think the market is skeptical that it can really break out from here.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So I imagine another area where the market might be skeptical is a lot of people have been stuck inside as a result of the pandemic. They've been listening to more podcasts. But as things normalize, maybe that listening trend will shift. Can you just kind of give us some numbers around, what percentage of the U.S. population listens to podcasts and do you think that that engagement will decline or rise as we look ahead over the next couple of years?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>In 2020, the reach of podcasting in the U.S. accelerated to 25% of the population. If we think about that level of adoption, in a lot of other instances, Andrew, that's a part of the S curve where we start to really see the adoption rate accelerate. In other words, you're going from sort of early adopter to mass market. So that's our expectation here. We actually saw that in streaming music years ago. So, we're optimistic that we're going to see that from here. And frankly, when I look at the investment, the amount of money companies are pouring into content and monetization technology, I'd be really surprised if we don't see it accelerate. The other thing I would add is that even though podcasts consumption held up well in 2020, it was still negatively impacted by the pandemic. People were not commuting, not going to the gym, not going to work. All of that reduced the amount of time people were consuming audio content on their phones. So that is still the primary use case for all audio consumption but including podcasts. So we have started to see already improving data in the last several months on audio consumption as people have started to go back to work and go to school and hit the gym again.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So then, Ben, can you talk a little bit more about what's been happening on the merger and acquisition front in podcasting? And how this media is getting reshaped by some of the changes that we've seen?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Absolutely. Yeah, it's a very active market. You can sort of break down the M&A into two broad areas: content and sort of advertising technology. If you think about the media business, in the sort of the pre-internet days, you had media producers and media distributors, it's a pretty simple value chain. The internet, by its nature, but also because it's much less regulated, has created an environment for more vertical integration. Podcasting is rapidly moving in that direction, with distributors buying up podcast IP and creators rapidly. Now, that can probably only go so far because, like music, podcasting is a business built on ubiquitous distribution. So, where we've seen exclusives, they just haven't really worked, and that makes sense from an advertising monetization point of view. On the monetization front, there is a lot of work left to do. I mean, we're still looking at a very, while attractive media for advertisers, pretty old school in the way the ad products actually work. Now this is starting to change. We're seeing more things like advanced measurement, attribution, programmatic buying-- all wonky things us media people like to talk about. But the most popular ad format in podcasting is host-read ads. It's Bill Simmons reading a promo code to go to a website and buy a product. You know, this is like Howard Stern 25 years ago. So, from that point of view, it's still early days.</p><p>&nbsp;</p><p><strong>Andrew Sheets</strong> So, to kind of put some numbers around that, I mean, could you give us a sense of how much is currently being spent on podcast advertising versus other types of advertising that are out there?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Oh, yeah, absolutely. I mean, the video market is $100 billion in the United States. Between linear television and streaming video, the radio, traditional radio market in the United States is sort of $15 to $18 billion. And as I mentioned before, podcasting, we think will probably be around 2 billion this year.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Got it. So, it's still even as ubiquitous as it's starting to seem. It's still very small, still very nascent relative to some of these much bigger areas where companies are already spending a whole lot of money.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>That's right.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So, Ben, you cover a large number of the largest entertainment and media companies. What do you think is going to be their strategy for podcasting going forward? And do you see this as more of a US opportunity, a global opportunity or something in the middle?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>We think the strategy going forward is primarily one that monetizes podcasting through advertising. And to be successful in that, you're going to need a significant content offering. But also, importantly, a scaled and advanced technology platform. And so, we're seeing companies that are going after this opportunity really invest aggressively in both. In terms of U.S. versus global, we definitely see it as a global opportunity. However, if we think about the TAM for podcast advertising, radio is the obvious one. Radio is very much a U.S. marketplace. A lot of radio outside the U.S., think of BBC One in the U.K., is in fact ad free. So, the global radio advertising opportunity skews very much U.S. That's why it's so important that podcasting can attract digital advertisers or buyers of digital advertising - those that might buy search or display ads - that opens up podcasting to a much larger opportunity and global.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>And Ben, I was hoping you could also talk a little bit about what are the demographics of podcast listeners and how does that impact the advertising landscape?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>So as you can probably guess, particularly since we're in the early adopter phase of podcasting, it does skew, sort of technology savvy, educated and often higher income from an audience point of view. That's part of why advertisers are so attracted to the space and why the ad rates are so high. Clearly, the long-term bull case is widespread adoption now as reach goes from 25% of the population to hopefully 50% and 75%, by definition the audience is going to look much more representative of the overall population, which will bring with it, you know, lower income or advertising targets that have lower propensity to spend. So that will get reflected in ad rates and probably different kinds of ad products. But ultimately, even if that puts some downward pressure on ad rates, we think the growth in engagement will more than offset that, creating a nice growth story over time.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Ben, I thought you made a really interesting point about just the types of advertising that are most effective here, you know, often, host read, often funny are very engaging. I mean, is there a good precedent in advertising for something that feels that personal? And, is there any other, implications for that just about how advertising feels and sounds, more broadly going forward?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>It's a great point, and it's a good news, bad news situation, I think, for the industry. The good news is that host read ads are incredibly effective. The demand outstrips supply, frankly, and the more widespread, highly popular podcasts that can be developed, the more opportunities there will be for monetization. The bad news is that to really scale the business host read ads are just it's hard to scale them. You can only have so many in an hour. And if you want to start really doing sophisticated, digitally driven ad buys and ad provisioning, you've got to automate all that. And doing host read ads in an automated fashion across the long tail of millions of podcasts really can't be done. The industry now is working on lots of technology and ad products to try to create an ad product or an ad unit that is hopefully not as effective as host read, but more effective than traditional radio.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>So, Ben as somebody whose father back in the day used to sell advertising for a radio station. What do you think are the questions that companies who want to advertise in a podcast should be asking to try to maximize that effectiveness?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Well, a lot of the measurement in attribution technology today remains pretty early stage, frankly. Most of the podcast business historically has been measured by downloads. But just because you download a podcast doesn't mean you listen to it. And frankly, nobody really downloads podcasts anymore because they're all streamed. That just gives you an example of a key area like measurement that needs to evolve. You can go even beyond that when you think about multichannel attribution. For example, let's say I listen to a podcast ad and then I go online and I buy that product. How does the advertiser know that I went to buy that product because I heard that ad? Those things are all happening at a pretty sophisticated level online in general today. But podcasting is not plugged into that ecosystem in a real way yet.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>And finally, Ben, you know, based on your work and your forecasts, what do you think the next five years hold for the podcasting industry?</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>We expect to see continued substantial investment in podcasting content, monetization technology and also personalization and curation. I think one of the challenges that consumers have, as I mentioned earlier is there's well over two million podcasts in a lot of these major platforms, so figuring out what to listen to is challenging. Sampling a song which might be 3 or 4 minutes long is a commitment. Sampling a 30/45 minute podcast is a whole different situation. And so those companies that can help consumers find what they want to listen to, that could be a huge advantage in the marketplace. And I'd say, much like we've seen in streaming video, we think we'll see an explosion of compelling podcast content across genres and across countries. There is so much talent out there which, when combined with the global growth and connectivity and connected devices, means we will all be plugged in all of the time, hopefully feeding our minds and hearts with information and stories from around the world.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>Fantastic. I think that's a great place to leave it. Ben, great chatting with you.</p><p>&nbsp;</p><p><strong>Ben Swinburne </strong>Great speaking with you, Andrew.</p><p>&nbsp;</p><p><strong>Andrew Sheets </strong>As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/77To0p9yhiSqJysRaafIQWGUqp2ahc9O8JHaAYgactU",
  "pubDate": "Wed, 20 Oct 2021 02:27:17 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:12:48",
  "enclosure": ""
}