{
  "guid": "urn:uuid:927ea549-8eba-4008-b5f2-e17a8fa08fd1",
  "link": "https://www.who.int/news/item/27-09-2022-joint-statement-of-the-united-states-of-america-and-the-world-health-organization-on-the-u.s.-who-strategic-dialogue",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Joint statement of the United States of America and the World Health Organization on the U.S.-WHO strategic dialogue",
  "description": "U.S. Department of Health and Human Services Secretary Xavier Becerra and World Health Organization (WHO) Director-General Dr Tedros Adhanom Ghebreyesus held the first U.S.-WHO Strategic Dialogue.",
  "pubDate": "Tue, 27 Sep 2022 20:28:43 Z",
  "a10:content": "<p>U.S. Department of Health and Human Services Secretary Xavier Becerra and World Health Organization (WHO) Director-General Dr Tedros Adhanom Ghebreyesus held the first U.S.-WHO Strategic Dialogue. Convened under the Biden-Harris Administration, the U.S.-WHO Strategic Dialogue provides a platform to maximize the longstanding U.S. government-WHO partnership, and to protect and promote the health of all people around the globe, including the American people.</p><p>Representatives from across the United States Government and WHO leadership discussed several priority global public health issues and areas of collaboration and partnership, including ongoing WHO strengthening efforts. The U.S. and WHO welcomed the creation of the historic new financial intermediary fund for pandemic prevention, preparedness, and response, and called on countries to help ensure it is sustainably financed and supported.</p><p>As the world looks to emerge stronger from the COVID-19 pandemic, it is clear that we must be better prepared going forward, something highlighted by recent outbreaks of monkeypox, ebola, and polio. The global health architecture comprises important entities, policies, and legal tools that assist countries to improve national, regional, and global health. An essential aspect of this architecture is the ability to prevent, detect, and respond to pandemics and other health security threats. Secretary Becerra and Director-General Tedros agreed that national and global capacities must be strong, agile, ever improving, and always fit-for-purpose. They discussed efforts underway to improve the global health architecture, to support resilient health systems, and to advance health equity.&nbsp; </p><p>The discussion also addressed efforts to develop a new pandemic instrument, strengthening the International Health Regulations (IHR), including through targeted amendments, as well as scaling-up of Universal Health Preparedness Review, including the Joint External Evaluation and other relevant tools, and updating global, regional, and national epidemic and One Health surveillance capabilities. It is also vital to take forward opportunities for advancing health security and primary health care, including by leveraging the extensive global health data infrastructure supported by a number of U.S. Government programs. In promoting rapid and transparent data sharing, and coordination, strengthened IHRs, and a new pandemic instrument can provide important tools to WHO Member States, including the United States, to prevent, detect, and rapidly respond to new events with pandemic potential and monitor disease control measures. This reinforcing of global health security is essential to protect the health of the world and the American people.<br /></p>  <p>In addition to strengthening health emergency preparedness and response, the United States and WHO recommitted to strengthening our partnership in key areas for the world to reach the Sustainable Development Goals by 2030, progress towards is a quarter of the pace needed. Accelerated progress will require resilient health systems capable of handling future health emergencies, reorienting towards <w:sdt sdttag=\"goog_rdk_29\" id=\"572397206\">integrated</w:sdt> primary health care as a means to achieve universal health coverage, investing in comprehensive health and care workforce development and community engagement, and promoting policies that recognize the links between the environment and health to improve quality of life. Accelerating progress towards the SDGs also requires leveraging progress made in addressing HIV, TB, polio, and malaria, advancing sexual and reproductive health and rights, and empowering marginalized and vulnerable communities in global health.&nbsp; Furthermore, U.S. and WHO leadership also discussed progress made on budgetary and governance reform as well as WHO&rsquo;s work to prevent and respond to sexual exploitation and abuse and sexual harassment.&nbsp; </p><p>Recognizing there is much more to do together to improve and promote global public health, the United States and the WHO decided to task technical experts with further development of their collaboration in 2023, including a joint work plan with a focus on activities in support of these shared leadership objectives.&nbsp; Secretary Becerra and Director-General Tedros will continue their positive engagement and guide the work of the technical teams with an expected update and reassessment by the next U.S.-WHO Strategic Dialogue to be held in late 2023.</p>"
}