{
  "title": "Rickson Goh shows how you deal with a pandemic",
  "link": "https://www.digitalnewsasia.com/startups/rickson-goh-shows-how-you-deal-pandemic",
  "description": "<!-- START FIELD TEMPLATE -->\n\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"body\">\n      <ul>\n<li><strong><em>Tourplus CEO embodies founder hustle, with keen eye for opportunity</em></strong></li>\n<li><strong><em>Founders have the highest responsibility, must exude optimism &amp; hope</em></strong></li>\n</ul>\n<p><img alt=\"The partnership with Tourism Selangor will earn Rickson Goh revenue, expand his supply of products and give him market inroad.\" class=\"caption\" src=\"https://www.digitalnewsasia.com/sites/default/files/images/TourPlus-Selangor-Tourism(1).jpg\" style=\"width: 100%;\" /></p>\n<p>If you want to look at how well startup founders in Malaysia have coped with the Covid-19 pandemic, few have acquitted themselves as well as Rickson Goh, the soft spoken founder of travel tech startup, Tourplus Technology Sdn Bhd.</p>\n<p>Not only did he manage to raise eyebrows in the ecosystem with a successful US$1 million seed capital fund raise last October, in the midst of a brutal standstill of the tourism market in Malaysia, but he has gone on to build some partnerships that will position his travel tech startup quite nicely when the tourism rebound happens. Plus, he has also started talking to investors on raising his next round as he projects revenue for 2021 to hit US$1.65 million (RM7 million) – almost none of it coming from travel.</p>\n<p>So, what is he smoking and what is he spiking in his teh tarik? Turns out it is nothing more than founder hustle and a keen eye for opportunity.  </p>\n<p> </p>\n<p><strong>Cuts win-win deal with Tourism Selangor</strong></p>\n<p>Last week, Tourplus issued a straightforward press release announcing that it had partnered with Tourism Selangor to build a mobile app for the state agency, which had no mobile app before this.</p>\n<p>But the real story here is that Tourplus has entered into a 50:50 profit share agreement with Tourism Selangor for any sales that come through the app, called Go Selangor. Even better, the state agency will be encouraging all travel related suppliers in its database to start digitalising their operations, introducing Tourplus to those who are interested (although this is not an exclusive arrangement).</p>\n<p>As Rickson notes, most of these travel players are small companies and would have been near impossible for Tourplus to get into. Instead, now it gets a credible state agency to make the introduction.</p>\n<p>“We expect the app will go live in Oct 2021,” says Rickson. “Tourism Selangor will endorse and recommend the operators to us, Tourplus will discuss commercial arrangements and setup in the app, operate and do the payout, etc,” he explains.</p>\n<p>Go Selangor will be the official travel app for the state government as Selangor doubles efforts to help the travel ecosystem to be ready for the post-pandemic travel rebound.</p>\n<p>A key part of the efforts to get ecosystem players, most of whom are SMEs, ready, is to encourage them to digitalise so that their travel packages, services and inventory can be added to Go Selangor.</p>\n<p>Rickson, who mooted the idea in March with endorsement by the Selangor Information Technology and Digital Economy Corp in July, believes this collaboration will help more rural operators or “hidden gem providers” that are not in the main stream platforms like Klook.</p>\n<p>It is also a sweet deal for Rickson who gets to add new inventory to his database while gearing himself for the post-pandemic rebound. The collaboration is the latest in a series of deals he has cut since his October fundraising last year.</p>\n<p><img alt=\"\" src=\"https://www.digitalnewsasia.com/sites/default/files/images/Rickson-Goh-Digerati50(1).jpg\" style=\"margin: 15px; float: left; width: 320px; height: 373px;\" />The timing could not have been better as his back was against the wall by then. It was not an easy time, he admits. Hardly any revenue was coming in and, “We were running out of money then.”</p>\n<p>The team had lost hope and even Rickson <em><strong>(pic)</strong></em> struggled to see any ray of light. “It was very hard for me. I was spending day and night trying to figure out a way to survive. We founders have the highest responsibility. No matter how we feel inside, and sometimes I felt helpless, but we have to exude hope and optimism for the team,” he says.</p>\n<p>A brief foray into delivering frozen food to consumers failed to take off. But the key moment was when he decided that there was not going to be any international travel for at least 24-months. It was a chilling realisation for a startup that had positioned its future on the back of inbound travel into Malaysia.</p>\n<p> </p>\n<p><strong>Hanging out in Parliament, getting TSP status, convincing investors</strong></p>\n<p>Rickson swung into action. As the early months of the pandemic lockdowns saw webinars soar in popularity, Rickson started attending quite a few to learn from other entrepreneurs. He also paid attention to and learned about the various government initiatives to help businesses cope and realised that there was opportunity to help local players go digital. For Rickson, this was going to be the lifeline while waiting for domestic tourism to spring back to life.</p>\n<p>“I managed to convince my investors that domestic tourism was the way forward and that there was short-term opportunity in the various government Covid aid recovery programs.”</p>\n<p>One key advantage he had was the strong government relations he built up over a short period of time. “It was not from getting any projects but helping government to digitise brick and mortar companies, specifically those in the travel sector,” he says. This involved him going to the Malaysian Parliament to meet relevant ministers to make his pitch which helped Tourplus get recognised as a TSP (Technology Service Provider).</p>\n<p>This recognition allowed Tourplus to help companies apply for the Digital Marketing Grant which is part of the Malaysian Government’s efforts to help businesses recover from the pandemic impact. “They were eligible to receive up to a RM5,00 grant and we managed to get 200 companies approved thus far from a total of 800 that we submitted for the grant.”</p>\n<p>This work not only keeps his 20-strong team (30% are part-time) busy but has helped with cash flow as well.</p>\n<p><img alt=\"Rickson Goh\" class=\"CAPTION\" src=\"https://www.digitalnewsasia.com/sites/default/files/images/Rickson-Goh-Tourplus-MoU_700x394.jpeg\" style=\"width: 100%;\" /></p>\n<p><strong>Key collaborations in China, instant access to 200k hotel rooms globally</strong></p>\n<p>One key collaboration from April this year was between Chinese travel agency ChongQing China Youth Travel Service with Rickson still aiming to capture some of the 3 million annual Chinese tourists to Malaysia.</p>\n<p>“Travel is still our primary business and even though we raised funds, it won’t last us forever if the travel restrictions stay in place,” Rickson says, adding that income and cash flow need to be watched very carefully.</p>\n<p>“We need to keep innovating as well and I need to hire tech people, UI/UX designers, product people which will also help us scale.”</p>\n<p>Another exciting development, one that he has kept under wraps is a partnership he has struck with China’s largest OTA (Online Travel Agency), the Nasdaq listed Ctrip. Thanks to an API integration, users of the Tourplus app can now also directly book 200,000 hotel rooms from all over the world where Ctrip has hotel partners.</p>\n<p>“It is a very exclusive priviledge to be given the trust of API integration with a company like Ctrip, says Rickson. That likely cuts both ways as Ctrip, which was founded in 1999, probably sees a little bit of itself in the feisty startup from Kuala Lumpur and its gritty founder.</p>\n    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD RELATED STORIES TEMPLATE -->\n\n  <p class=\"field-label font-weight-bold text-dark\">Related Stories :</p>\n<div class=\"field-item even\">\n  <ul class=\"related-stories\">\n      <li class=\"field_related_stories\">\n      <a href=\"/startups/tourplus-raises-us1mil-seed-round-despite-brutal-market-travel-sector\">Tourplus raises US$1mil seed round despite brutal market for travel sector</a>    </li>\n      <li class=\"field_related_stories\">\n      <a href=\"/business/tourplus-signs-mou-chongqing-china-youth-travel-services\">Tourplus signs MoU with ChongQing China Youth Travel Services</a>    </li>\n    </ul>\n</div>\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD RELATED STORIES TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_social_media_links\">\n      <p><em><strong>For more technology news and the latest updates, follow us on </strong></em><a href=\"https://www.facebook.com/DNewsAsia/\" target=\"_blank\"><em><strong>Facebook,</strong></em></a><a href=\"https://twitter.com/DNewsAsia\" target=\"_blank\"><em><strong> Twitter</strong></em></a><em><strong> or </strong></em><a href=\"http://www.linkedin.com/company/digital-news-asia\" target=\"_blank\"><em><strong>LinkedIn</strong></em></a></p>\n    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Keyword(s) :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/rickson-goh\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Rickson Goh</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/travel-tech\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Travel Tech</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/startup\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Startup</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/tourplus-technology\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Tourplus Technology</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/entrepreneur\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">entrepreneur</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/tourism-selangor\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Tourism Selangor</a>    </div>\n      <div class=\"field_article_keyword\">\n      <a href=\"/tags/grit\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Grit</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE -->\n<!-- START FIELD TEMPLATE -->\n\n  <h6 class=\"field-label font-weight-bold text-dark\">Author Name :</h6>\n\n<div class=\"d-flex justify-content-start flex-wrap\">\n      <div class=\"field_article_author_name\">\n      <a href=\"/author/karamjit-singh\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Karamjit Singh</a>    </div>\n  </div>\n\n<div class=\"clearfix\">&nbsp;</div>\n<!-- END FIELD TEMPLATE --><span class=\"a2a_kit a2a_kit_size_24 a2a_target addtoany_list\" id=\"da2a_2\">\n      <a class=\"a2a_button_facebook a2a_counter\"></a>\n<a class=\"a2a_button_twitter a2a_counter\"></a>\n<a class=\"a2a_button_linkedin a2a_counter\"></a>\n<a class=\"a2a_button_email  a2a_counter\"></a>\n<a class=\"a2a_button_whatsapp  a2a_counter\"></a>\n<a class=\"a2a_button_telegram  a2a_counter\"></a\n      <a class=\"a2a_dd addtoany_share_save\" href=\"https://www.addtoany.com/share#url=https%3A%2F%2Fwww.digitalnewsasia.com%2Fstartups%2Frickson-goh-shows-how-you-deal-pandemic&amp;title=Rickson%20Goh%20shows%20how%20you%20deal%20with%20a%20pandemic\"></a>\n      \n    </span>",
  "pubDate": "Thu, 19 Aug 2021 22:58:13 +0000",
  "dc:creator": "karamjit",
  "guid": "73378 at https://www.digitalnewsasia.com"
}