{
  "title": "Why Is It Difficult to Give Away $1 Million — and Make It Count?",
  "description": "<p>When businessman Ron Harrington turned his attention and considerable fortune toward philanthropy he, like many others, confronted the issue of how to make the biggest impact. In this episode we explore the challenges of effective philanthropy, hear stories from Bill and Melinda Gates,&nbsp;talk about the importance of failure, discuss the solution the Harrington project is putting in place and get some tips from Melanie Schnoll-Begun of Morgan Stanley Philanthropy Management.</p><p>For further information, visit <a href=\"http://www.morganstanley.com/what-we-do/wealth-management/private-wealth-management\" target=\"_blank\">Morgan Stanley Private Wealth Management</a>.&nbsp;</p><p><em>The examples presented in this podcast are provided for illustrative purposes only.&nbsp;It represents general ways that philanthropy management can help philanthropists with similar circumstances. Each philanthropist's specific situation, goals, and results will differ.</em></p><p><em>The host Ashley Milne-Tyte is a contractor of Pineapple Street Media.&nbsp;The guest speaker is&nbsp;neither an employee nor affiliated with Morgan Stanley Smith Barney LLC. (“Morgan Stanley”). The views and opinions expressed herein do not necessarily reflect those of Morgan Stanley. The information and figures contained herein has been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast.&nbsp;</em></p><p><em>This podcast does not provide individually tailored investment advice. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it. The strategies and/or investments discussed in this material may not be suitable for all investors. Morgan Stanley Wealth Management recommends that investors independently evaluate particular investments and strategies, and encourages investors to seek the advice of a Financial Advisor. The appropriateness of a particular investment or strategy will depend on an investor's individual circumstances and objectives.&nbsp;Morgan Stanley Wealth Management is a business of Morgan Stanley Smith Barney LLC.</em></p><p><em>© 2017 Morgan Stanley Smith Barney LLC.&nbsp;Member SIPC.&nbsp;CRC 1922879 10/2017</em></p>",
  "itunes:title": "Why Is It Difficult to Give Away $1 Million — and Make It Count?",
  "itunes:episodeType": "full",
  "itunes:episode": 3,
  "itunes:summary": "When businessman Ron Harrington turned his attention and considerable fortune toward philanthropy he, like many others, confronted the issue of how to make the biggest impact. In this episode we explore the challenges of effective philanthropy, hear stories from Bill and Melinda Gates, talk about the importance of failure, discuss the solution the Harrington project is putting in place and get some tips from Melanie Schnoll-Begun of Morgan Stanley Philanthropy Management.\n\nFor further information, visit Morgan Stanley Private Wealth Management. \n\nThe examples presented in this podcast are provided for illustrative purposes only. It represents general ways that philanthropy management can help philanthropists with similar circumstances. Each philanthropist's specific situation, goals, and results will differ.\n\nThe host Ashley Milne-Tyte is a contractor of Pineapple Street Media. The guest speaker is neither an employee nor affiliated with Morgan Stanley Smith Barney LLC. (“Morgan Stanley”). The views and opinions expressed herein do not necessarily reflect those of Morgan Stanley. The information and figures contained herein has been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast. \n\nThis podcast does not provide individually tailored investment advice. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it. The strategies and/or investments discussed in this material may not be suitable for all investors. Morgan Stanley Wealth Management recommends that investors independently evaluate particular investments and strategies, and encourages investors to seek the advice of a Financial Advisor. The appropriateness of a particular investment or strategy will depend on an investor's individual circumstances and objectives. Morgan Stanley Wealth Management is a business of Morgan Stanley Smith Barney LLC.\n\n© 2017 Morgan Stanley Smith Barney LLC. Member SIPC. CRC 1922879 10/2017",
  "content:encoded": "<p>When businessman Ron Harrington turned his attention and considerable fortune toward philanthropy he, like many others, confronted the issue of how to make the biggest impact. In this episode we explore the challenges of effective philanthropy, hear stories from Bill and Melinda Gates,&nbsp;talk about the importance of failure, discuss the solution the Harrington project is putting in place and get some tips from Melanie Schnoll-Begun of Morgan Stanley Philanthropy Management.</p><p>For further information, visit <a href=\"http://www.morganstanley.com/what-we-do/wealth-management/private-wealth-management\" target=\"_blank\">Morgan Stanley Private Wealth Management</a>.&nbsp;</p><p><em>The examples presented in this podcast are provided for illustrative purposes only.&nbsp;It represents general ways that philanthropy management can help philanthropists with similar circumstances. Each philanthropist's specific situation, goals, and results will differ.</em></p><p><em>The host Ashley Milne-Tyte is a contractor of Pineapple Street Media.&nbsp;The guest speaker is&nbsp;neither an employee nor affiliated with Morgan Stanley Smith Barney LLC. (“Morgan Stanley”). The views and opinions expressed herein do not necessarily reflect those of Morgan Stanley. The information and figures contained herein has been obtained from sources outside of Morgan Stanley and Morgan Stanley makes no representations or guarantees as to the accuracy or completeness of information or data from sources outside of Morgan Stanley. Morgan Stanley is not responsible for the information or data contained in this podcast.&nbsp;</em></p><p><em>This podcast does not provide individually tailored investment advice. It has been prepared without regard to the individual financial circumstances and objectives of persons who receive it. The strategies and/or investments discussed in this material may not be suitable for all investors. Morgan Stanley Wealth Management recommends that investors independently evaluate particular investments and strategies, and encourages investors to seek the advice of a Financial Advisor. The appropriateness of a particular investment or strategy will depend on an investor's individual circumstances and objectives.&nbsp;Morgan Stanley Wealth Management is a business of Morgan Stanley Smith Barney LLC.</em></p><p><em>© 2017 Morgan Stanley Smith Barney LLC.&nbsp;Member SIPC.&nbsp;CRC 1922879 10/2017</em></p>",
  "itunes:season": 2,
  "guid": "gid://art19-episode-locator/V0/nI6Ua9wkfzSFbtwhXMFG_1dWbIh7gLYGNg1ezChi5Rs",
  "pubDate": "Sat, 14 Oct 2017 00:09:23 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "morganstanley,Finance,personalstories",
  "itunes:duration": "00:15:40",
  "enclosure": ""
}