{
  "title": "#163/The Architect's Daughter: Elizabeth Garber, Author of Implosion",
  "pubDate": "Mon, 28 Sep 2020 07:00:00 +0000",
  "guid": "4c5e72f8-7f54-4915-a9bd-1259edadbe68",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_163_Garber.mp3",
  "itunes:image": "",
  "description": "<p><strong>Woodward “Woodie” Garber</strong> was a Modernist architect whose name you would know if you lived in Cincinnati. Garber was called “a controversial visionary whose advocacy of an uncluttered openness in design grows more influential every year.” He was a brilliant independent Modernist who wanted things his own way, daring even to refer to <a href= \"http://www.usmodernist.org/wright.htm\"><strong>Frank Lloyd Wright</strong></a> as Frank Lloyd Wrong.  Architecture was not the only controversy in his life. Being married to him, or being his child, was to experience the fury of bipolar disorder coupled with a desire to control everything – and everyone – in his path. There was a lot to process, on so many levels. He died in 1994, and it took 24 years for our guest, daughter <strong>Elizabeth Garber</strong>, to write <em>Implosion: A Memoir of an Architect’s Daughter.</em>  Later on, a few minutes with Frank Harmon, author of Native Places. </p>",
  "content:encoded": "<p>Woodward “Woodie” Garber was a Modernist architect whose name you would know if you lived in Cincinnati. Garber was called “a controversial visionary whose advocacy of an uncluttered openness in design grows more influential every year.” He was a brilliant independent Modernist who wanted things his own way, daring even to refer to <a href= \"http://www.usmodernist.org/wright.htm\">Frank Lloyd Wright</a> as Frank Lloyd Wrong.  Architecture was not the only controversy in his life. Being married to him, or being his child, was to experience the fury of bipolar disorder coupled with a desire to control everything – and everyone – in his path. There was a lot to process, on so many levels. He died in 1994, and it took 24 years for our guest, daughter Elizabeth Garber, to write <em>Implosion: A Memoir of an Architect’s Daughter.</em>  Later on, a few minutes with Frank Harmon, author of Native Places. </p>",
  "enclosure": "",
  "itunes:duration": "48:19",
  "itunes:explicit": false,
  "itunes:keywords": "Art,design,garber,modernism",
  "itunes:subtitle": "Woodward “Woodie” Garber was a Modernist architect whose name you would know if you lived in Cincinnati. Garber was called “a controversial visionary whose advocacy of an uncluttered openness in design grows more influential every year.” He...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}