{
  "title": "Toyota’s Skunkworks Chief  “Incredibly Optimistic” on Climate",
  "link": "https://spectrum.ieee.org/gill-pratt-toyota-climate-change",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-giving-a-presentation-in-front-of-a-projection-of-a-car.jpg?id=29928955&width=1200&height=800&coordinates=0%2C0%2C0%2C160\"/><br/><br/><p>It can often seem like an inevitability that humans will completely and utterly fail to keep our carbon emissions in check over the next decade, which is the most important step we can take to minimize the potentially disastrous impacts of climate change. As Gill Pratt wrote in a recent article he authored on Medium, “<a href=\"https://medium.com/toyotaresearch/carbon-is-our-enemy-lets-use-everything-we-ve-got-to-fight-it-b38bfbc1f16\" target=\"_blank\">carbon is our enemy</a>.” </p><p>Gill Pratt is the CEO of <a href=\"https://spectrum.ieee.org/toyota-to-invest-1-billion-in-ai-and-robotics-rd\" target=\"_self\">Toyota Research Institute</a>, which was founded in 2015 to develop practical solutions in autonomous vehicles, robotics, and basically whatever else Toyota thinks might be important to its future, including climate change. Toyota is one of the largest vehicle manufacturers in the world, and as such, provides the means by which millions of people will emit tons of carbon every year. It’s easy to say that Toyota is therefore part of the problem, but for the foreseeable future, our global society simply can’t function without the vehicles that Toyota (and other auto manufacturers) produce. However, this doesn’t absolve Toyota of the responsibility that it should have for taking action, and the company is working toward complete carbon neutrality by 2050.</p><p>With 2050 being a while from now, these kinds of pledges are easy for a company like Toyota to make. But for a company that makes vehicles primarily powered by fossil fuels, a transition to carbon neutrality seems like an enormous challenge. When we spoke with Gill Pratt recently, he talked about his optimism that Toyota will be able to achieve its goals through a careful shift to renewables that emphasizes practicality, and that if we work hard enough, global carbon neutrality is still within reach.</p><hr/><p><strong>IEEE Spectrum: Can you describe Toyota’s approach to minimizing carbon emissions over the life cycle of its vehicles?</strong></p><p><strong>Gill Pratt:</strong> My thinking, and the consensus within the company, is that there’s not a silver bullet answer to achieving <a href=\"https://www.toyota.com/usa/environmentreport/challenge-2050-education\" target=\"_blank\">our climate goal, which is zero net carbon by 2050</a>. The reasons are as follows. Certainly, geographically, CO<sub>2</sub> emitted anywhere is going to end up having an impact on the whole world. And CO<sub>2</sub>  stays in the atmosphere for a really long time—many, many centuries. So, the CO<sub>2</sub> we emit now, we’re going to have to deal with for up to a thousand years. We look at CO<sub>2</sub> emissions integrated over space and over time to understand the budget of CO<sub>2</sub> that we can put out, while still keeping within a one and a half degrees target over pre-industrial levels. It’s really, really hard to do, and we are quickly running out of that budget. </p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"close up photograph of a smiling man\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"837fcb62048ac14c579916f4601acf74\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"dc73c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/close-up-photograph-of-a-smiling-man.jpg?id=29929000&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Gill Pratt</small></p><p>The question for us is, How do we do our part with the cars that we sell? And we think that without a doubt, it’s not just one answer. If the world was all renewable power which had zero CO<sub>2</sub> output, and if the world was full of charging points where people could charge up with that type of power, then, of course, BEVs [battery electric vehicles] would be a great answer.</p><p>We’d still have to solve the CO<sub>2</sub> that’s emitted during their manufacturing, which is not small. But still, that would be a very good answer. </p><p>But it’s not true that the world is all renewable power, and we know that it’s going to take time for that infrastructure to get rolled out. So the question is, what’s the way to eliminate the most carbon integrated over both space and time, given the diversity of the circumstances that exist in the world? Our answer is that a huge part of it is BEVs and that there are other parts, too. </p><p>For Toyota, we’ve announced that 35 percent of our production is going to be BEVs within the next eight years—by 2030. This is incredibly fast and a very, very high percentage of our production, but it’s not 100 percent. So what’s the other 65 percent going to be? When we look at the actual impact in terms of lifetime emissions for the entire life cycle of a car, there are other alternatives which are almost as good, but are actually practical sooner. And that includes PHEVs [plug-in hybrid electric vehicles], which have both a battery and an engine in them. They act like a BEV over shorter distances, roughly 40 miles or so for the models we have now. And that means that you get most of the advantages of a BEV, but you’re not as dependent on the charging network for longer trips. Even HEVs [hybrid electric vehicles] have substantial carbon reductions. And then, of course, there are fuel-cell vehicles, too.</p><p><strong>There has been some criticism of Toyota’s approach here—specifically, that Toyota should focus more on BEVs rather than continuing to produce a substantial amount of cars that use internal combustion in some form. How would you respond to that?</strong></p><p><strong>Pratt: </strong>In general, I think it’s important to not oversimplify the solution space, and to not make assumptions. We think the important thing is to be results-based, and we have made a very honest pledge to get to net-zero by 2050. The models that we’ve seen show that if everybody did that, we would be fine, so we believe that means we’re doing our part. And I think what is important, not just for us but for everybody, is to not try to prescribe the answer, and to not assume that there’s a single easy answer. The one thing that I’ve learned in all of the scientific work that I’ve done is that when you have a diversity of situations, one size does not fit all. </p><p>I don’t know what the best technological solution for addressing climate change is going to be. I’m hugely optimistic because there are so many technologies that are being explored and the people who are working on them are really, really sharp. But I think it’s important not to restrict our options too soon and to think that we can predict the technological advancements that are going to happen.</p><p>Toyota is very strongly in favor of BEVs when it makes sense. There’s no foot dragging, there’s no wistful nostalgia for pistons or anything like that. But we also know that there’s going to be different amounts of preparedness and practicality in different parts of the world at different times. And so we think that by offering a diversity of drivetrains, each of which tries to reduce carbon as much as possible, the total net carbon that we will reduce will actually be larger. Diverse solutions for diverse circumstances.</p><p><strong>Going forward, what do you think will be the right combination of better use of current technology, innovating new technology, and improving infrastructure to allow both existing and future technologies to be used most efficiently?</strong></p><p><strong>Pratt: </strong>I’m sorry to give the standard answer, which is that we need all of these things! </p><p>But to be more specific, let’s talk about the infrastructure side. For level two charging of BEVs and PHEVs, which is roughly the amount of power that a clothes dryer uses, I think that we’re in good shape. The cost per household is pretty low, and the amount of electric power generation that we would need throughout the U.S. is practical. And having an electric vehicle that travels around 35 miles per day, which is average, would only add a relatively small fraction of net electrical energy use to a household each year. Our present grid at the present generation capacity could do it, so that’s good.</p><p>DC fast charging is another matter. There, whether it’s at 150 kilowatts or 250 kilowatts or maybe even more, our grid wasn’t set up to do that. And it’s not a question of the total energy that we need, but rather what the peak power is that we need at any given time. Many people—and Toyota is a part of it—are working on solid-state batteries to try to increase the ability of the car to be charged even faster to get closer to what happens when you’re at the gas pump. But that’s not the only part of the problem. Many people don’t remember that chemical fuels store energy while the electrical grid transmits power: One is the time derivative of the other. And so you need a method of somehow storing the energy that you’ll need to suddenly transfer into a car battery the same way we transfer gasoline into a tank. I think there’s a lot of work to be done to figure that out.</p><p>As a separate issue, I think the grid is going to need to change as power generation becomes greener, because power plants tend to be in places where the power’s actually going to be used. But places where there’s lots of sun or lots of wind and where the costs of renewable power are coming down also tend not to be places where people live. The grid is going to have to get better in order to transfer that power from one part of the country to the other in ways that we’re not doing now.</p><p><strong>How much of what Toyota hopes to be able to accomplish depends on things like power generation and grid improvements that are completely out of your control?</strong></p><p><strong>Pratt: </strong>You’re right, this is out of our control. And the situation is quite different in different parts of the world. So in Norway, for example, things are excellent. Here in the United States, it’s kind of in the middle. And in other parts of the world, it’s going to take a long, long time for things to change. This is another reason that we’re trying to be adaptive with our solutions—we can’t really predict what’s going to happen there. But what we can do, is to do our part, and to say that no matter what form of energy is used to power our cars, we will try to make sure they have as low carbon emissions as possible. And then as the power sources change, we will also change.</p><p><strong>As the CEO of Toyota Research, you are in a position where you likely have more influence over the path toward global carbon neutrality than most people. Are you hopeful about the future?</strong></p><strong>Pratt: </strong>I am incredibly optimistic. And the reason is that I see all sorts of possibilities for solving this. It’s not going to be easy, but I think that we are going to do it—that’s not a reason to relax, certainly we have to work very hard. But I’m quite hopeful.",
  "pubDate": "Tue, 07 Jun 2022 16:26:42 +0000",
  "guid": "https://spectrum.ieee.org/gill-pratt-toyota-climate-change",
  "category": [
    "Gill pratt",
    "Toyota",
    "Carbon emissions",
    "Climate change"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}