{
  "title": "Week 1: It’s not about the data, it’s about the problems you’re solving.",
  "link": "",
  "updated": "2014-06-08T00:00:00-07:00",
  "id": "http://carlshan.com/2014/06/08/dssg-week1",
  "content": "<h1 id=\"week-1-its-not-about-the-data-its-about-the-problems-youre-solving\">Week 1: It’s not about the data, it’s about the problems you’re solving.</h1>\n\n<p class=\"meta\">8 June 2014 - Chicago</p>\n\n<p><em>This is the first in a series of posts chronicling my reflections on participating in the 2014 Data Science for Social Good Fellowship at the University of Chicago.</em></p>\n\n<p><em>To get automatically notified about new posts, you can subscribe by <a href=\"https://carlshan.wufoo.com/forms/join-other-readers/\">clicking here</a>. You can also subscribe via <a href=\"http://feeds.feedburner.com/carlshan\">RSS</a> to this blog to get updates.</em></p>\n\n<hr />\n\n<p>This summer I am participating in the 2014 Data Science for Social Good Fellowship at the University of Chicago.</p>\n\n<p>The <a href=\"dssg.io\">Data Science for Social Good Fellowship</a> is a summer fellowship sponsored by the Eric and Wendy Schmidt Foundation. It selects a cohort of individuals typically with quantitative or social science backgrounds to work in teams to tackle problems brought to them by non-profits, governments and NGOs.</p>\n\n<p>The inaugural program was conceived of and put together by former Chief Scientist for the Obama 2012 campaign, <a href=\"https://twitter.com/rayidghani\">Rayid Ghani</a>. DSSG launched in the summer of 2013, bringing 36 Fellows together to spend three months working in Chicago.</p>\n\n<p>The 2014 Fellowship, which I participated in, expanded its class to <a href=\"dssg.io/people/\">48 Fellows</a>, drawing a diverse set of graduate students, recent college graduates and working professionals coming from both the hard and social sciences.</p>\n\n<p>In the 2014 Fellowship, there were a total of 12 projects sponsored by a varied set of partners. The projects ranged from detecting collusion, to evaluating how to best allocate city funds.</p>\n\n<p>I’ll be able to provide more background and context on my own project as the fellowship progresses.</p>\n\n<h2 id=\"my-background\">My Background</h2>\n<p>How I ended up as a Fellow is a combination of my academic and personal experience.</p>\n\n<p>I graduated with a bachelors in statistics from UC Berkeley in 2013 while also taking a smattering of coursework in computer and information science.</p>\n\n<p>While developing my knowledge of statistical and computational techniques, I also developed a desire to do socially meaningful work.</p>\n\n<p>During my first semester in college, I volunteered serving as a mentor to fifth graders from a local elementary school. What I encountered when I first began volunteering shocked me: I had attended a high-achieving math and science powerhouse high school with a 99% graduation rate; however the students I mentored came from circumstances made it immensely difficult for them to enjoy the same type opportunities that had fallen into my lap as a student. Over 40% of the students in the school were on free or reduced lunch.</p>\n\n<p>Throughout the course of my volunteering, it became more and more clear to me that the zip code you were born into could more or less determine whether you were able to live a full and rich life.</p>\n\n<p>This led me to ponder the role of education as the mechanism for both increasing social mobility, as well as providing life-altering opportunities.</p>\n\n<p>As a result, through college I worked in a variety of different educational organizations, hoping to increase my exposure to the field such that I could eventually improve life outcomes for students who, through the lottery of birth, did not receive the same lucky breaks I did.</p>\n\n<p>During this time, I recognized that my technical background provided a unique advantage to create social change: many individuals drawn to the education or non-profit fields typically do not come from statistics or computer science. This fact, combined with the simultaneous rise of the importance of data in augmenting human decisions gave me a glimpse that by perhaps mastering the techniques and tools of a data wrangler, I could increase my individual leverage in impacting the progress of human civilization.</p>\n\n<p>This all sounds rather high-minded, lofty, and abstract. Writing it makes me feel mildly embarrassed in the same way that I imagine self-aware salespeople feel when they use phrases like “synergistic partnership” or “paradigm shifting” – the phrases are so ambiguous and overused that they become self-mocking caricatures rather than signifying meaningful ideas.</p>\n\n<p>Yet it would be disingenuous of me to omit my motivations simply because they sound cheesy. It also seems imprudent to be unwilling to discuss beliefs that sound naive, yet are nevertheless ones I hold to be true.</p>\n\n<p>Coming into the Chicago Fellowship I hope to develop these skills in a hyper-applied context by working the exact problems I would want to be working on even post-Fellowship.</p>\n\n<h2 id=\"the-first-week\">The First Week</h2>\n<p>I landed in Chicago the weekend before the Fellowship began. Flying in, I was slightly apprehensive – I did not feel like I had received an adequate amount of communication regarding program logistics such as what type of project I was assigned to, who my team members were, and an outline of the summer.</p>\n\n<p>In fact, I had only been emailed details regarding these things the day before my flight.</p>\n\n<p>However, once I began my first day as a Fellow I was happily surprised at the level of thought and organization that had been put into the summer.</p>\n\n<p>In the morning of the first day, all the Fellows wrote down different things they were hoping to get out of the summer on sticky notes and arranged them on an empty wall.  Examples included swimming in Lake Michigan, learning how to use cloud computing, and sampling Chicago city cuisine.</p>\n\n<p>One particularly eye-catching sticky read “Learn what the hell data science is!”</p>\n\n<h2 id=\"values-and-culture\">Values and Culture</h2>\n<p>Afterwards, the program staff explained to us the key values of the Fellowship, which I’ve listed belong along with my own personal interpretation of each:</p>\n\n<ul>\n  <li><strong>Open</strong>: We share what we are learning and doing to help more people learn to do what we’re doing.\nThis value of openness shows up in the platforms used (like public Github repos) as well as within the interpersonal interaction amongst the Fellows.</li>\n  <li><strong>Curious</strong>: We keep asking questions because that’s the only way to progress towards meaningful answers.</li>\n  <li><strong>Applied</strong>: Everything that we do should drive towards some form of action that changes someone’s life. As we ask questions, something to always prompt ourselves with is: “Is the thing I’ve just learned something that ties back to the real world?”</li>\n  <li><strong>Rigorous</strong>: We will emphasize meaningful results and specific outcomes, while documenting our methods and techniques.</li>\n  <li><strong>Collaborative, not competitive</strong>: Achieving our collective goals matters more than assigning who gets the credit.</li>\n</ul>\n\n<p>I was very happy to see these cultural tenets explicitly stated. These values lined very much up with my own.</p>\n\n<h2 id=\"goals\">Goals</h2>\n<p>On the first day, it was explained to us that while we were expected to work hard and produce useful output on our projects, it was not the goal of the program to actually build the most robust piece of software that solves our partners’ problem.</p>\n\n<p>Rather, the goal of the program was focused more around (a) helping Fellows learn how to use various techniques and tools and (b) developing each Fellow’s personal interests working towards social good, open government and open science.</p>\n\n<p>This surprised me, as one of my personal goals is to actually build and deploy a maintainable system for the partners I’m working with. Although I can see the sense in moderating my goal to being simply one of learning and growing, I’m reluctant to dial down my ambitions simply due to sake of feasibility.</p>\n\n<p>Not only do I think that it’s reasonable to build out some usable and maintainable software or tool in the summer, I also personally think gunning hard for this goal would be the most productive way to learn.</p>\n\n<p>The Fellows then got a chance to introduce themselves and intermingle. I learned that of the 48 Fellows, 33 were PhD or Masters students, 12 were recent undergraduates and 3 were working professionals.</p>\n\n<p>Although the majority of Fellows seemed to come from quantitative or technical backgrounds, there were also Fellows with backgrounds in architecture, psychology and public health.</p>\n\n<p>This was nice to see, as I subscribe to the belief that impact is produced through a combination of valuable skills and domain expertise. The Fellows with math, statistics or computer science backgrounds are the arsenal with which the social scientists could aim at the correct targets.</p>\n\n<p>We also had a variety of social events, including a picnic near the beach, a kickoff party on the rooftop of the Civic Opera Building and a boat tour of the city of Chicago. I was very glad to see these social events planned; I believe that great work can only be done within a strong scaffold of tightly-formed relationships, and all of these activities gave me a glimpse into the personal lives and thoughts of each of the Fellows and mentors.</p>\n\n<p>Overall, I ended the first week feeling fairly optimistic about the trajectory of the coming weeks.</p>\n\n<h2 id=\"reflections\">Reflections</h2>\n\n<p><em>The Good</em></p>\n\n<p><strong>Impact-oriented fellows</strong>: I’ve been involved a variety of different internships and programs and at many of them, I’ve felt out of place. At these organizations, my co-workers were not interested in the same set of ideas I was hoping to discuss, and didn’t share many common values or worldviews.</p>\n\n<p>I was very happy to see that this was not true with the Fellowship. Many of the Fellows I spoke with shared common passions for social issues, and were interested in discussing ideas ranging from how to best optimize for making social impact to how to accelerate one’s rate of growth.</p>\n\n<p><strong>Openness to growth and feedback</strong>: The program directors seemed very open and receptive to feedback, creating a Hackpad document where Fellows could contribute ideas for how to improve the experience as well as holding a formal feedback session. This contributed towards building a culture of open transparency.</p>\n\n<p><strong>Collaborative work setting</strong>: The workspace is spacious, open (encouraging collaboration and conversation) and there’s a culture of casual collegiality between everyone.</p>\n\n<p><em>The Bad</em></p>\n\n<p><strong>Direction-less events</strong>: There was a planned event that did not seem to directly serve a purpose: a series of non-profits that were not partners came in and gave lengthy talks.</p>\n\n<p>I wasn’t sure as to whether these problems were ones I should be invested in helping solve, and with a single exception, the speakers didn’t share any useful mental models or suggestions for how to tackle our own projects.</p>\n\n<p>I admit that this issue may be the fact that the purpose of this event was simply not communicated well to the Fellows, giving an impression of aimlessness.</p>\n\n<p><em>The Ugly</em></p>\n\n<p><strong>No wifi</strong>: The wifi had not been installed when the Fellows arrived. As a result, we had to connect to DePaul university’s network (the building we worked in is owned by DePaul), causing traffic overload and nearly unusable connection speeds. This proved to be quite a bottleneck for teams looking to get set up quickly.</p>\n\n<p><strong>No data</strong>: A variety of different partners still had not yet shared data with their respective teams by the end of the week. Legal agreements were still in review, and processes were still being navigated. This had also happened in the previous year, although I was told that it was much worse then. However, this is a pretty serious showstopper. After all, it’s hard to do data science without data.</p>\n\n<p><strong>Untargeted workshops</strong>: The workshops should have been more segmented based on background – some workshops had students coming in from both the high and low end of the experience spectrum. Workshops also ran overtime, resulting in some Fellows being unable to attend a few due to an instructor having to leave to catch a flight.</p>\n\n<p>In the future, I think it would be useful to plan multiple workshops for Fellows of different experience levels, and to enforce time constraints.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>It’s important to balance everything I’ve said within the perspective that DSSG is still only in its second year of existence. Growing pains are still being massaged, and the level of thought and dedication that I’ve already seen being put forth by the Fellowship organizers assure me that my criticisms are ones that will not be true next year.</p>\n\n<hr />\n\n<p><em>I write posts about data science applied to social causes. If you want to be notified when my next reflection is published, subscribe by <a href=\"https://carlshan.wufoo.com/forms/join-other-readers/\">clicking here</a>.</em></p>"
}