{
  "title": "Episode 122: &#8220;A Change is Gonna Come&#8221; by Sam Cooke",
  "link": "https://500songs.com/podcast/episode-122-a-change-is-gonna-come-by-sam-cooke/",
  "pubDate": "Tue, 18 May 2021 01:31:54 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=755",
  "description": "<p>Episode 122 of <em>A History of Rock Music in Five Hundred Songs</em> is a double-length (over an hour) look at “A Change is Gonna Come” by Sam Cooke, at Cooke's political and artistic growth, and at the circumstances around his death. This one has a long list of content warnings at the beginning of the episode, for good reason...</p>\n<p>Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/51383597\">on \"My Guy\" by Mary Wells</a>.</p>\n<p> </p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. For this episode, he also did the re-edit of the closing theme. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/ </a></p>\n\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week due to the number of songs by one artist.</p>\n<p>My main source for this episode is <a href=\"https://amzn.to/2s7UCmk\"><em>Dream Boogie: The Triumph of Sam Cooke</em></a> by Peter Guralnick. Like all Guralnick’s work, it’s an essential book if you’re even slightly interested in the subject. Information on Allen Klein comes from<a href=\"https://amzn.to/3wh37XI\"> Fred Goodman's book on Klein</a>.</p>\n<p>The Netflix documentary I mention can be found <a href=\"https://www.netflix.com/gb/title/80191045\">here</a>.</p>\n<p><a href=\"https://amzn.to/36eZZic\">This</a> is the best compilation of Sam Cooke’s music for the beginner, and the only one to contain recordings from all four labels (Specialty, Keen, RCA, and Tracey) he recorded for.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>Before I start this episode, a brief acknowledgement --  Lloyd Price plays a minor role in this story, and I heard as I was in the middle of writing it that he had died on May the third, aged eighty-eight. Price was one of the great pioneers of rock and roll -- I first looked at him more than a hundred episodes ago, back in episode twelve -- and he continued performing live right up until the start of the coronavirus outbreak in March last year. He'll be missed.</p>\n<p>Today we're going to look at one of the great soul protest records of all time, a record that was the high point in the career of its singer and songwriter, and which became a great anthem of the Civil Rights movement. But we're also going to look at the dark side of its creator, and the events that led to his untimely death. More than most episodes of the podcast, this requires a content warning. Indeed, it requires more than just content warnings.</p>\n<p>Those warnings are necessary -- this episode will deal with not only a murder, but also sexual violence, racialised violence, spousal abuse, child sexual abuse, drug use and the death of a child, as well as being about a song which is in itself about the racism that pervaded American society in the 1960s as it does today. This is a story from which absolutely nobody comes out well, which features very few decent human beings, and which I find truly unpleasant to write about.</p>\n<p>But there is something else that I want to say, before getting into the episode -- more than any other episode I have done, and I think more than any other episode that I am *going* to do, this is an episode where my position as a white British man born fourteen years after Sam Cooke's death might mean that my perspective is flawed in ways that might actually make it impossible for me to tell the story properly, and in ways that might mean that my telling of the story is doing a grave, racialised, injustice. Were this song and this story not so important to the ongoing narrative, I would simply avoid telling it altogether, but there is simply no way for me to avoid it and tell the rest of the story without doing equally grave injustices.</p>\n<p>So I will say this upfront. There are two narratives about Sam Cooke's death -- the official one, and a more conspiratorial one. Everything I know about the case tells me that the official account is the one that is actually correct, and *as far as I can tell*, I have good reason for thinking that way. But here's the thing. The other narrative is one that is held by a lot of people who knew Cooke, and they claim that the reason their narrative is not the officially-accepted one is because of racism.</p>\n<p>I do not think that is the case myself. In fact, all the facts I have seen about the case lead to the conclusion that the official narrative is correct. But I am deeply, deeply, uncomfortable with saying that. Because I have an obligation to be honest, but I also have an obligation not to talk over Black people about their experiences of racism. So what I want to say now, before even starting the episode, is this. Listen to what I have to say, by all means, but then watch the Netflix documentary Remastered: The Two Killings of Sam Cooke, and *listen* to what the people saying otherwise have to say. I can only give my own perspective, and my perspective is far more likely to be flawed here than in any other episode of this podcast. I am truly uncomfortable writing and recording this episode, and were this any other record at all, I would have just skipped it. But that was not an option.</p>\n<p>Anyway, all that said, let's get on with the episode proper, which is on one of the most important records of the sixties -- \"A Change is Gonna Come\":</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>It's been almost eighteen months since we last looked properly at Sam Cooke, way back in episode sixty, and a lot has happened in the story since then, so a brief recap -- Sam Cooke started out as a gospel singer, first with a group called the Highway QCs, and then joining the Soul Stirrers, the most popular gospel group on the circuit, replacing their lead singer.  The Soul Stirrers had signed to Specialty Records, and released records like \"Touch the Hem of His Garment\", written by Cooke in the studio:</p>\n<p>[Excerpt: The Soul Stirrers, \"Touch the Hem of His Garment\"]</p>\n<p>Cooke had eventually moved away from gospel music to secular, starting with a rewrite of a gospel song he'd written, changing \"My God is so wonderful\" to \"My girl is so lovable\", but he'd released that under the name Dale Cook, rather than his own name, in case of a backlash from gospel fans:</p>\n<p>[Excerpt: Dale Cook, \"Lovable\"]</p>\n<p>No-one was fooled, and he started recording under his own name. Shortly after this, Cooke had written his big breakthrough hit, \"You Send Me\", and when Art Rupe at Specialty Records was unimpressed with it, Cooke and his producer Bumps Blackwell had both moved from Specialty to a new label, Keen Records.</p>\n<p>Cooke's first appearance on the Ed Sullivan Show was a disaster -- cutting him off half way through the song -- but his second was a triumph, and \"You Send Me\" went to number one on both the pop and R&B charts, and sold over a million copies, while Specialty put out unreleased earlier recordings and sold over half a million copies of some of those. Sam Cooke was now one of the biggest things in the music business.</p>\n<p>And he had the potential to become even bigger. He had the looks of a teen idol, and was easily among the two or three best-looking male singing stars of the period. He had a huge amount of personal charm, he was fiercely intelligent, and had an arrogant selfishness that came over as self-confidence -- he believed he deserved everything the world could offer to him, and he was charming enough that everyone he met believed it too. He had an astonishing singing voice, and he was also prodigiously talented as a songwriter -- he'd written \"Touch the Hem of His Garment\" on the spot in the studio after coming in with no material prepared for the session.</p>\n<p>Not everything was going entirely smoothly for him, though -- he was in the middle of getting divorced from his first wife, and he was arrested backstage after a gig for non-payment of child support for a child he'd fathered with another woman he'd abandoned. This was a regular occurrence – he was as self-centred in his relationships with women as in other aspects of his life -- though as in those other aspects, the women in question were generally so smitten with him that they forgave him everything.</p>\n<p>Cooke wanted more than to be a pop star. He had his sights set on being another Harry Belafonte. At this point Belafonte was probably the most popular Black all-round entertainer in the world, with his performances of pop arrangements of calypso and folk songs:</p>\n<p>[Excerpt: Harry Belafonte, \"Jamaica Farewell\"]</p>\n<p>Belafonte had nothing like Cooke's chart success, but he was playing prestigious dates in Las Vegas and at high-class clubs, and Cooke wanted to follow his example. Most notably, at a time when almost all notable Black performers straightened their hair, Belafonte left his hair natural and cut it short. Cooke thought that this was very, very shrewd on Belafonte's part, copying him and saying to his brother L.C. that this would make him less threatening to the white public -- he believed that if a Black man slicked his hair back and processed it, he would come across as slick and dishonest, white people wouldn't trust him around their daughters. But if he just kept his natural hair but cut it short, then he'd come across as more honest and trustworthy, just an all-American boy.</p>\n<p>Oddly, the biggest effect of this decision wasn't on white audiences, but on Black people watching his appearances on TV. People like Smokey Robinson have often talked about how seeing Cooke perform on TV with his natural hair made a huge impression on them -- showing them that it was possible to be a Black man and not be ashamed of it. It was a move to appeal to the white audience that also had the effect of encouraging Black pride.</p>\n<p>But Cooke's first attempt at appealing to the mainstream white audience that loved Belafonte didn't go down well. He was booked in for a three-week appearance at the Copacabana, one of the most prestigious nightclubs in the country, and right from the start it was a failure. Bumps Blackwell had written the arrangements for the show on the basis that there would be a small band, and when they discovered Cooke would be backed by a sixteen-piece orchestra he and his assistant Lou Adler had to frantically spend a couple of days copying out sheet music for a bigger group. And Cooke's repertoire for those shows stuck mostly to old standards like \"Begin the Beguine\", \"Ol' Man River\", and \"I Love You For Sentimental Reasons\", with the only new song being \"Mary, Mary Lou\", a song written by a Catholic priest which had recently been a flop single for Bill Haley:</p>\n<p>[Excerpt: Bill Haley and the Comets, \"Mary, Mary Lou\"]</p>\n<p>Cooke didn't put over those old standards with anything like the passion he had dedicated to his gospel and rock and roll recordings, and audiences were largely unimpressed. Cooke gave up for the moment on trying to win over the supper-club audiences and returned to touring on rock and roll package tours, becoming so close with Clyde McPhatter and LaVern Baker on one tour that they seriously considered trying to get their record labels to agree to allow them to record an album of gospel songs together as a trio, although that never worked out.</p>\n<p>Cooke looked up immensely to McPhatter in particular, and listened attentively as McPhatter explained his views of the world -- ones that were very different to the ones Cooke had grown up with. McPhatter was an outspoken atheist who saw religion as a con, and who also had been a lifelong member of the NAACP and was a vocal supporter of civil rights. Cooke listened closely to what McPhatter had to say, and thought long and hard about it.</p>\n<p>Cooke was also dealing with lawsuits from Art Rupe at Specialty Records. When Cooke had left Specialty, he'd agreed that Rupe would own the publishing on any future songs he'd written, but he had got round this by crediting \"You Send Me\" to his brother, L.C. </p>\n<p>Rupe was incensed, and obviously sued, but he had no hard evidence that Cooke had himself written the song. Indeed, Rupe at one point even tried to turn the tables on Cooke, by getting Lloyd Price's brother Leo, a songwriter himself who had written \"Send Me Some Lovin'\", to claim that *he* had written \"You Send Me\", but Leo Price quickly backed down from the claim, and Rupe was left unable to prove anything.</p>\n<p>It didn't hurt Cooke's case that L.C., while not a talent of his brother's stature, was at least a professional singer and songwriter himself, who was releasing records on Checker Records that sounded very like Sam's work:</p>\n<p>[Excerpt: L.C. Cooke, \"Do You Remember?\"]</p>\n<p>For much of the late 1950s, Sam Cooke seemed to be trying to fit into two worlds simultaneously. He was insistent  that he wanted to move into the type of showbusiness that was represented by the Rat Pack -- he cut an album of Billie Holiday songs, and he got rid of Bumps Blackwell as his manager, replacing him with a white man who had previously been Sammy Davis Jr.'s publicist. But on the other hand, he was hanging out with the Central Avenue music scene in LA, with Johnny \"Guitar\" Watson, Eugene Church, Jesse Belvin, and Alex and Gaynel Hodge.</p>\n<p>While his aspirations towards Rat Packdom faltered, he carried on having hits -- his own \"Only Sixteen\" and \"Everybody Loves to Cha-Cha-Cha\", and he recorded, but didn't release yet, a song that Lou Adler had written with his friend Herb Alpert, and whose lyrics Sam revised, \"Wonderful World\".</p>\n<p>Cooke was also starting a relationship with the woman who would become his second wife, Barbara. He'd actually had an affair with her some years earlier, and they'd had a daughter, Linda, who Cooke had initially not acknowledged as his own -- he had many children with other women -- but they got together in 1958, around the time of Cooke's divorce from his first wife. Tragically, that first wife then died in a car crash in 1959 -- Cooke paid her funeral expenses.</p>\n<p>He was also getting dissatisfied with Keen Records, which had been growing too fast to keep up with its expenses -- Bumps Blackwell, Lou Adler, and Herb Alpert, who had all started at the label with him, all started to move away from it to do other things, and Cooke was sure that Keen weren't paying him the money they owed as fast as they should. </p>\n<p>He also wanted to help some of his old friends out -- while Cooke was an incredibly selfish man, he was also someone who believed in not leaving anyone behind, so long as they paid him what he thought was the proper respect, and so he started his own record label, with his friends J.W. Alexander and Roy Crain, called SAR Records (standing for Sam, Alex, and Roy), to put out records by his old group The Soul Stirrers, for whom he wrote \"Stand By Me, Father\", a song inspired by an old gospel song by Charles Tindley, and with a lead sung by Johnnie Taylor, the Sam Cooke soundalike who had replaced Cooke as the group's lead singer:</p>\n<p>[Excerpt: The Soul Stirrers, \"Stand By Me, Father\"]</p>\n<p>Of course, that became, as we heard a few months back, the basis for Ben E. King's big hit \"Stand By Me\".</p>\n<p>Cooke and Alexander had already started up their own publishing company, and were collaborating on songs for other artists, too. They wrote \"I Know I'll Always Be In Love With You\", which was recorded first by the Hollywood Flames and then by Jackie Wilson:</p>\n<p>[Excerpt: Jackie Wilson, \"I Know I'll Always Be in Love With You\"]</p>\n<p>And \"I'm Alright\", which Little Anthony and the Imperials released as a single:</p>\n<p>[Excerpt: Little Anthony and the Imperials, \"I'm Alright\"]</p>\n<p>But while he was working on rock and roll and gospel records, he was also learning to tap-dance for his performances at the exclusive white nightclubs he wanted to play -- though when he played Black venues he didn't include those bits in the act. He did, though, perform seated on a stool in imitation of Perry Como, having decided that if he couldn't match the energetic performances of people like Jackie Wilson (who had been his support act at a run of shows where Wilson had gone down better than Cooke) he would go in a more casual direction. </p>\n<p>He was also looking to move into the pop market when it came to his records, and he eventually signed up with RCA Records, and specifically with Hugo and Luigi. We've talked about Hugo and Luigi before, a couple of times -- they were the people who had produced Georgia Gibbs' soundalike records that had ripped off Black performers, and we talked about their production of \"The Lion Sleeps Tonight\", though at this point they hadn't yet made that record. They had occasionally produced records that were more R&B flavoured -- they produced \"Shout!\" for the Isley Brothers, for example -- but they were in general about as bland and middle-of-the-road a duo as one could imagine working in the music industry.</p>\n<p>The first record that Hugo and Luigi produced for Cooke was a song that the then-unknown Jeff Barry had written, \"Teenage Sonata\". That record did nothing, and the label were especially annoyed when a recording Cooke had done while he was still at Keen, \"Wonderful World\", was released on his old label and made the top twenty:</p>\n<p>[Excerpt: Sam Cooke, \"Wonderful World\"]</p>\n<p>Cooke's collaboration with Hugo and Luigi would soon turn into one that bore a strong resemblance to their collaboration with the Isley Brothers -- they would release great singles, but albums that fundamentally misunderstood Cooke's artistry; though some of that misunderstanding may have come from Cooke himself, who never seemed to be sure which direction to go in. Many of the album tracks they released have Cooke sounding unsure of himself, and hesitant, but that's not something that you can say about the first real success that Cooke came out with on RCA, a song he wrote after driving past a group of prisoners working on a chain gang. He'd originally intended that song to be performed by his brother Charles, but he'd half-heartedly played it for Hugo and Luigi when they'd not seen much potential in any of his other recent originals, and they'd decided that that was the hit:</p>\n<p>[Excerpt: Sam Cooke, \"Chain Gang\"]</p>\n<p>That made number two on the charts, becoming his biggest hit since \"You Send Me\".</p>\n<p>Meanwhile Cooke was also still recording other artists for SAR -- though by this point Roy Crain had been eased out and SAR now stood for Sam and Alex Records. He got a group of Central Avenue singers including Alex and Gaynel Hodge to sing backing vocals on a song he gave to a friend of his named Johnny Morisette, who was known professionally as \"Johnny Two-Voice\" because of the way he could sound totally different in his different ranges, but who was known to his acquaintances as \"the singing pimp\", because of his other occupation:</p>\n<p>[Excerpt: Johnny Morisette, \"I'll Never Come Running Back to You\"]</p>\n<p>They also thought seriously about signing up a young gospel singer they knew called Aretha Franklin, who was such an admirer of Sam's that she would try to copy him -- she changed her brand of cigarettes to match the ones he smoked, and when she saw him on tour reading William Shirer's The Rise and Fall of the Third Reich -- Cooke was an obsessive reader, especially of history -- she bought her own copy. She never read it, but she thought she should have a copy if Cooke had one. </p>\n<p>But they decided that Franklin's father, the civil rights leader Rev. C.L. Franklin, was too intimidating, and so it would probably not be a good idea to get involved.</p>\n<p>The tour on which Franklin saw Cooke read Shirer's book was also the one on which Cooke made his first public stance in favour of civil rights -- that tour, which was one of the big package tours of the time, was meant to play a segregated venue, but the artists hadn't been informed just how segregated it was. While obviously none of them supported segregation, they would mostly accept playing to segregated crowds, because there was no alternative, if at least Black people were allowed in in roughly equal numbers. But in this case, Black people were confined to a tiny proportion of the seats, in areas with extremely restricted views, and both Cooke and Clyde McPhatter refused to go on stage, though the rest of the acts didn't join in their boycott.</p>\n<p>Cooke's collaboration with Hugo and Luigi remained hit and miss, and produced a few more flop singles, but then Cooke persuaded them to allow him to work in California, with the musicians he'd worked with at Keen, and with René Hall arranging rather than the arrangers they'd employed previously. While the production on Cooke's California sessions was still credited to Hugo and Luigi, Luigi was the only one actually attending those sessions -- Hugo was afraid of flying and wouldn't come out to the West Coast.</p>\n<p>The first record that came out under this new arrangement was another big hit, \"Cupid\", which had vocal sound effects supplied by a gospel act Cooke knew, the Sims twins -- Kenneth Sims made the sound of an arrow flying through the air, and Bobbie Sims made the thwacking noise of it hitting a target:</p>\n<p>[Excerpt: Sam Cooke, \"Cupid\"]</p>\n<p>Cooke became RCA's second-biggest artist, at least in terms of singles sales, and had a string of hits like \"Twistin' the Night Away\", \"Another Saturday Night\", and \"Bring it On Home to Me\", though he was finding it difficult to break the album market. He was frustrated that he wasn't having number one records, but Luigi reassured him that that was actually the best position to be in: “We’re getting number four, number six on the Billboard charts, and as long as we get that, nobody’s gonna bother you. But if you get two or three number ones in a row, then you got no place to go but down. Then you’re competition, and they’re just going to do everything they can to knock you off.”</p>\n<p>But Cooke's personal life had started to unravel. After having two daughters, his wife gave birth to a son. Cooke had desperately wanted a male heir, but he didn't bond with his son, Vincent, who he insisted didn't look like him. He became emotionally and physically abusive towards his wife, beating her up on more than one occasion, and while she had been a regular drug user already, her use increased to try to dull the pain of being married to someone who she loved but who was abusing her so appallingly.</p>\n<p>Things became much, much worse, when the most tragic thing imaginable happened. Cooke had a swim in his private pool and then went out, leaving the cover off. His wife, Barbara, then let the children play outside, thinking that their three-year-old daughter Tracey would be able to look after the baby for a few minutes. Baby Vincent fell into the pool and drowned. Both parents blamed the other, and Sam was devastated at the death of the child he only truly accepted as his son once the child was dead. You can hear some of that devastation in a recording he made a few months later of an old Appalachian folk song:</p>\n<p>[Excerpt: Sam Cooke, \"The Riddle Song\"]</p>\n<p>Friends worried that Cooke was suicidal, but Cooke held it together, in part because of the intervention of his new manager, Allen Klein. Klein had had a hard life growing up -- his mother had died when he was young, and his father had sent him to an orphanage for a while. Eventually, his father remarried, and young Allen came back to the family home, but his father was still always distant. He grew close to his stepmother, but then she died as well. </p>\n<p>Klein turned up at Cooke's house two days after the baby's funeral with his own daughter, and insisted on taking Cooke and his surviving children to Disneyland, telling him \"You always had your mother and father, but I lost my mother when I was nine months old. You’ve got two other children. Those two girls need you even more now. You’re their only father, and you’ve got to take care of them.\"</p>\n<p>Klein was very similar to Cooke in many ways. He had decided from a very early age that he couldn't trust anyone but himself, and that he had to make his own way in the world. He became hugely ambitious, and wanted to reach the very top. Klein had become an accountant, and gone to work for Joe Fenton, an accountant who specialised in the entertainment industry. </p>\n<p>One of the first jobs Klein did in his role with Fenton was to assist him with an audit of Dot Records in 1957, called for by the Harry Fox Agency. We've not talked about Harry Fox before, but they're one of the most important organisations in the American music industry -- they're a collection agency like ASCAP or BMI, who collect songwriting royalties for publishing companies and songwriters. But while ASCAP and BMI collect performance royalties -- they collect payments for music played on the radio or TV, or in live performance -- Harry Fox collect the money for mechanical reproduction, the use of songs on records. It's a gigantic organisation, and it has the backing of all the major music publishers.</p>\n<p>To do this audit, Klein and Fenton had to travel from New York to LA, and as they were being paid by a major entertainment industry organisation, they were put up in the Roosevelt Hotel, where at the time the other guests included Elvis, Claude Rains, and Sidney Poitier. Klein, who had grown up in comparative poverty, couldn't help but be impressed at the money that you could make by working in entertainment.</p>\n<p>The audit of Dot Records found some serious discrepancies -- they were severely underpaying publishers and songwriters. While they were in LA, Klein and Fenton also audited several other labels, like Liberty, and they found the same thing at all of them. The record labels were systematically conning publishing companies out of money they were owed.</p>\n<p>Klein immediately realised that if they were doing this to the major publishing companies that Harry Fox represented, they must be doing the same kind of thing to small songwriters and artists, the kind of people who didn't have a huge organisation to back them up. </p>\n<p>Unfortunately for Klein, soon after he started working for Fenton, he was fired -- he was someone who was chronically unable to get to work on time in the morning, and while he didn't mind working ridiculously long hours, he could not, no matter how hard he tried, get himself into the office for nine in the morning. He was fired after only four months, and Fenton even recommended to the State of New Jersey that they not allow Klein to become a Certified Public Accountant -- a qualification which, as a result, Klein never ended up getting.</p>\n<p>He set up his own company to perform audits of record companies for performers, and he got lucky by bumping in to someone he'd been at school with -- Don Kirshner. Kirshner agreed to start passing clients Klein's way, and his first client was Ersel Hickey (no relation), the rockabilly singer we briefly discussed in the episode on \"Twist and Shout\", who had a hit with \"Bluebirds Over the Mountain\":</p>\n<p>[Excerpt: Ersel Hickey, \"Bluebirds Over the Mountain\"]</p>\n<p>Klein audited Hickey's record label, but was rather surprised to find out that they didn't actually owe Hickey a penny. It turned out that record contracts were written so much in the company's favour that they didn't have to use any dodgy accounting to get out of paying the artists anything. </p>\n<p>But sometimes, the companies would rip the artists off anyway, if they were particularly unscrupulous. Kirshner had also referred the rockabilly singer/songwriter duo Buddy Knox and Jimmy Bowen to Klein. Their big hit, \"Party Doll\", had come out on Roulette Records:</p>\n<p>[Excerpt: Buddy Knox, \"Party Doll\"]</p>\n<p>Klein found out that in the case of Roulette, the label *were* actually not paying the artists what they were contractually owed, largely because Morris Levy didn't like paying people money. After the audit, Levy did actually agree to pay Knox and Bowen what they were owed, but he insisted that he would only pay it over four years, at a rate of seventy dollars a week -- if Klein wanted it any sooner, he'd have to sue, and the money would all be eaten up in lawyers' fees. That was still better than nothing, and Klein made enough from his cut that he was able to buy himself a car. </p>\n<p>Klein and Levy actually became friends -- the two men were very similar in many ways -- and Klein learned a big lesson from negotiating with him. That lesson was that you take what you can get, because something is better than nothing. If you discover a company owes your client a hundred thousand dollars that your client didn't know about, and they offer you fifty thousand to settle, you take the fifty thousand. Your client still ends up much better off than they would have been, you've not burned any bridges with the company, and you get your cut.</p>\n<p>And Klein's cut was substantial -- his standard was to take fifty percent of any extra money he got for the artist. And he prided himself on always finding something -- though rarely as much as he would suggest to his clients before getting together with them. One particularly telling anecdote about Klein's attitude is that when he was at Don Kirshner's wedding he went up to Kirshner's friend Bobby Darin and told him he could get him a hundred thousand dollars. Darin signed, but according to Darin's manager, Klein only actually found one underpayment, for ten thousand copies of Darin's hit \"Splish Splash\" which Atlantic hadn't paid for:</p>\n<p>[Excerpt: Bobby Darin, \"Splish Splash\"]</p>\n<p>However, at the time singles sold for a dollar, Darin was on a five percent royalty, and he only got paid for ninety percent of the records sold (because of a standard clause in contracts at that time to allow for breakages). The result was that Klein found an underpayment of just four hundred and fifty dollars, a little less than the hundred thousand he'd promised the unimpressed Darin.</p>\n<p>But Klein used the connection to Darin to get a lot more clients, and he did significantly better for some of them. For Lloyd Price, for example, he managed to get an extra sixty thousand dollars from ABC/Paramount, and Price and Klein became lifelong friends.</p>\n<p>And Price sang Klein's praises to Sam Cooke, who became eager to meet him.  He got the chance when Klein started up a new business with a DJ named Jocko Henderson. Henderson was one of the most prominent DJs in Philadelphia, and was very involved in all aspects of the music industry. He had much the same kind of relationship with Scepter Records that Alan Freed had with Chess, and was cut in on most of the label's publishing on its big hits -- rights he would later sell to Klein in order to avoid the kind of investigation that destroyed Freed's career.</p>\n<p>Henderson had also been the DJ who had first promoted \"You Send Me\" on the radio, and Cooke owed him a favour. Cooke was also at the time being courted by Scepter Records, who had offered him a job as the Shirelles' writer and producer once Florence Greenberg had split up with Luther Dixon. He'd written them one song, which referenced many of their earlier hits:</p>\n<p>[Excerpt: The Shirelles, \"Only Time Will Tell\"]</p>\n<p>However, Cooke didn't stick with Scepter -- he figured out that Greenberg wasn't interested in him as a writer/producer, but as a singer, and he wasn't going to record for an indie like them when he could work with RCA.</p>\n<p>But when Henderson and Klein started running a theatre together, putting on R&B shows, those shows obviously featured a lot of Scepter acts like the Shirelles and Dionne Warwick, but they also featured Sam Cooke on the top of the bill, and towards the bottom of the bill were the Valentinos, a band featuring Cooke's touring guitarist, Bobby Womack, who were signed to SAR Records:</p>\n<p>[Excerpt: The Valentinos, \"It's All Over Now\"]</p>\n<p>Klein was absolutely overawed with Cooke's talent when he first saw him on stage, realising straight away that this was one of the major artists of his generation. Whereas most of the time, Klein would push himself forward straight away and try to dominate artists, here he didn't even approach Cooke at all, just chatted to Cooke's road manager and found out what Cooke was like as a person. This is something one sees time and again when it comes to Cooke -- otherwise unflappable people just being absolutely blown away by his charisma, talent, and personality, and behaving towards him in ways that they behaved to nobody else.</p>\n<p>At the end of the residency, Cooke had approached Klein, having heard good things about him from Price, Henderson, and his road manager. The two had several meetings over the next few months, so Klein could get an idea of what it was that was bothering Cooke about his business arrangements. Eventually, after a few months, Cooke asked Klein for his honest opinion.</p>\n<p>Klein was blunt. \"I think they're treating you like a \" -- and here he used the single most offensive anti-Black slur there is -- \"and you shouldn't let them.\"</p>\n<p>Cooke agreed, and said he wanted Klein to take control of his business arrangements. The first thing Klein did was to get Cooke a big advance from BMI against his future royalties as a songwriter and publisher, giving him seventy-nine thousand dollars up front to ease his immediate cash problems. He then started working on getting Cooke a better recording contract.</p>\n<p>The first thing he did was go to Columbia records, who he thought would be a better fit for Cooke than RCA were, and with whom Cooke already had a relationship, as he was at that time working with his friend, the boxer Muhammad Ali, on an album that Ali was recording for Columbia:</p>\n<p>[Excerpt: Muhammad Ali, \"The Gang's All Here\"]</p>\n<p>Cooke was very friendly with Ali, and also with Ali's spiritual mentor, the activist Malcolm X, and both men tried to get him to convert to the Nation of Islam. Cooke declined -- while he respected both men, he had less respect for Elijah Mohammed, who he saw as a con artist, and he was becoming increasingly suspicious of religion in general. He did, though, share the Nation of Islam's commitment to Black people pulling themselves up by their bootstraps and presenting themselves in a clean-cut way, having the same vision of Black capitalism that many of his contemporaries like James Brown shared.</p>\n<p>Unfortunately, negotiations with Columbia quickly failed. Klein believed, probably correctly, that record labels didn't have to do anything to sell Sam Cooke's records, and that Cooke was in a unique position as one of the very few artists at that time who could write, perform, and produce hit records without any outside assistance. Klein therefore thought that Cooke deserved a higher royalty rate than the five percent industry standard, and said that Cooke wouldn't sign with anyone for that rate.</p>\n<p>The problem was that Columbia had most-favoured-nations clauses written into many other artists' contracts. These clauses meant that if any artist signed with Columbia for a higher royalty rate, those other artists would also have to get that royalty rate, so if Cooke got the ten percent that Klein was demanding, a bunch of other performers like Tony Bennett would also have to get the ten percent, and Columbia were simply not willing to do that.</p>\n<p>So Klein decided that Cooke was going to stay with RCA, but he found a way to make sure that Cooke would get a much better deal from RCA, and in a way which didn't affect any of RCA's own favoured-nations contracts. </p>\n<p>Klein had had some involvement in filmmaking, and knew that independent production companies were making films without the studios, and just letting the studios distribute them. He also knew that in the music business plenty of songwriters and producers like Leiber and Stoller and Phil Spector owned their own record labels. But up to that point, no performers did, that Klein was aware of, because it was the producers who generally made the records, and the contracts were set up with the assumption that the performer would just do what the producer said. That didn't apply to Sam Cooke, and so Klein didn't see why Cooke couldn't have his own label.</p>\n<p>Klein set up a new company, called Tracey Records, which was named after Cooke's daughter, and whose president was Cooke's old friend J.W. Alexander. Tracey Records would, supposedly to reduce Cooke's tax burden, be totally owned by Klein, but it would be Cooke's company, and Cooke would be paid in preferred stock in the company, though Cooke would get the bulk of the money -- it would be a mere formality that the company was owned by Klein. While this did indeed have the effect of limiting the amount of tax Cooke had to pay, it also fulfilled a rule that Klein would later state -- \"never take twenty percent of an artist's earnings. Instead give them eighty percent of yours\". What mattered wasn't the short-term income, but the long-term ownership. And that's what Klein worked out with RCA.</p>\n<p>Tracey Records would record and manufacture all Cooke's records from that point on, but RCA would have exclusive distribution rights for thirty years, and would pay Tracey a dollar per album. After thirty years, Tracey records would get all the rights to Cooke's recordings back, and in the meantime, Cooke would effectively be on a much higher royalty rate than he'd received before, in return for taking a much larger share of the risk.</p>\n<p>There were also changes at SAR. Zelda Sands, who basically ran the company for Sam and J.W., was shocked to receive a phone call from Sam and Barbara, telling her to immediately come to Chicago, where Sam was staying while he was on tour. She went up to their hotel room, where Barbara angrily confronted her, saying that she knew that Sam had always been attracted to Zelda -- despite Zelda apparently being one of the few women Cooke met who he never slept with -- and heavily implied that the best way to sort this would be for them to have a threesome. Zelda left and immediately flew back to LA. A few days later, Barbara turned up at the SAR records offices and marched Zelda out at gunpoint.</p>\n<p>Through all of this turmoil, though, Cooke managed to somehow keep creating music. And indeed he soon came up with the song that would be his most important legacy. J.W. Alexander had given Cooke a copy of The Freewheelin' Bob Dylan, and Cooke had been amazed at \"Blowin' in the Wind\":</p>\n<p>[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]</p>\n<p>But more than being amazed at the song, Cooke was feeling challenged. This was a song that should have been written by a Black man. More than that, it was a song that should have been written by *him*. Black performers needed to be making music about their own situation. He added \"Blowin' in the Wind\" to his own live set, but he also started thinking about how he could write a song like that himself.</p>\n<p>As is often the case with Cooke's writing, he took inspiration from another song, this time \"Ol' Man River\", the song from the musical Showboat that had been made famous by the actor, singer, and most importantly civil rights activist Paul Robeson:</p>\n<p>[Excerpt: Paul Robeson, \"Ol' Man River\"]</p>\n<p>Cooke had recorded his own version of that in 1958, but now in early 1964 he took the general pace, some melodic touches, the mention of the river, and particularly the lines \"I'm tired of livin' and scared of dyin'\", and used them to create something new. Oddly for a song that would inspire a civil rights anthem -- or possibly just appropriately, in the circumstances, \"Ol' Man River\" in its original form featured several racial slurs included by the white lyricist, Oscar Hammerstein, and indeed Robeson himself in later live performances changed the very lines that Cooke would later appropriate, changing them as he thought they were too defeatist for a Black activist to sing:</p>\n<p>[Excerpt: Paul Robeson, \"Ol' Man River (alternative lyrics)\"]</p>\n<p>Cooke's song would keep the original sense, in his lines \"It's been too hard livin' but I'm afraid to die\", but the most important thing was the message -- \"a change is gonna come\".</p>\n<p>The session at which he recorded it was to be his last with Luigi, whose contract with RCA was coming to an end, and Cooke knew it had to be something special. Rene Hall came up with an arrangement for a full orchestra, which so overawed Cooke's regular musicians that his drummer found himself too nervous to play on the session. Luckily, Earl Palmer was recording next door, and was persuaded to come and fill in for him. </p>\n<p>Hall's arrangement starts with an overture played by the whole orchestra:</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>And then each verse features different instrumentation, with the instruments changing at the last line of each verse -- \"a change is gonna come\". The first verse is dominated by the rhythm section:</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>Then for the second verse, the strings come in, for the third the strings back down and are replaced by horns, and then at the end the whole orchestra swells up behind Cooke:</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>Cooke was surprised when Luigi, at the end of the session, told him how much he liked the song, which Cooke thought wouldn't have been to Luigi's taste, as Luigi made simple pop confections, not protest songs. But as Luigi later explained, \"But I did like it. It was a serious piece, but still it was him. Some of the other stuff was throwaway, but this was very deep. He was really digging into himself for this one.\"</p>\n<p>Cooke was proud of his new record, but also had something of a bad feeling about it, something that was confirmed when he played the record for Bobby Womack, who told him \"it sounds like death\". Cooke agreed, there was something premonitory about the record, something ominous.</p>\n<p>Allen Klein, on the other hand, was absolutely ecstatic. The track was intended to be used only as an album track -- they were going in a more R&B direction with Cooke's singles at this point. His previous single was a cover version of Howlin' Wolf's \"Little Red Rooster”:</p>\n<p>[Excerpt: Sam Cooke, \"Little Red Rooster\"]</p>\n<p>And his next two singles were already recorded -- a secularised version of the old spiritual \"Ain't That Good News\", and a rewrite of an old Louis Jordan song. Cooke was booked on to the Johnny Carson show, where he was meant to perform both sides of his new single, but Allen Klein was so overwhelmed by \"A Change is Gonna Come\" that he insisted that Cooke drop \"Ain't That Good News\" and perform his new song instead. Cooke said that he was meant to be on there to promote his new record. Klein insisted that he was meant to be promoting *himself*, and that the best promotion for himself would be this great song. Cooke then said that the Tonight Show band didn't have all the instruments needed to reproduce the orchestration. Klein said that if RCA wouldn't pay for the additional eighteen musicians, he would pay for them out of his own pocket. Cooke eventually agreed.</p>\n<p>Unfortunately, there seems to exist no recording of that performance, the only time Cooke would ever perform \"A Change is Gonna Come\" live, but reports from people who watched it at the time suggest that it made as much of an impact on Black people watching as the Beatles' appearance on the Ed Sullivan Show two days later made on white America. \"A Change is Gonna Come\" became a standard of the soul repertoire, recorded by Aretha Franklin:</p>\n<p>[Excerpt: Aretha Franklin, \"A Change is Gonna Come\"]</p>\n<p>Otis Redding:</p>\n<p>[Excerpt: Otis Redding, \"A Change is Gonna Come\"]</p>\n<p>The Supremes and more. Cooke licensed it to a compilation album released as a fundraiser for Martin Luther King's campaigning, and when King was shot in 1968, Rosa Parks spent the night crying in her mother's arms, and they listened to \"A Change is Gonna Come\". She said ”Sam’s smooth voice was like medicine to the soul. It was as if Dr. King was speaking directly to me.”</p>\n<p>After his Tonight Show appearance, Cooke was in the perfect position to move into the real big time. Allen Klein had visited Brian Epstein on RCA's behalf to see if Epstein would sign the Beatles to RCA for a million-dollar advance. Epstein wasn't interested, but he did suggest to Klein that possibly Cooke could open for the Beatles when they toured the US in 1965. </p>\n<p>And Cooke was genuinely excited about the British Invasion and the possibilities it offered for the younger musicians he was mentoring. When Bobby Womack complained that the Rolling Stones had covered his song \"It's All Over Now\" and deprived his band of a hit, Cooke explained to Womack first that he'd be making a ton of money from the songwriting royalties, but also that Womack and his brothers were in a perfect position -- they were young men with long hair who played guitars and drums. If the Valentinos jumped on the bandwagon they could make a lot of money from this new style.</p>\n<p>But Cooke was going to make a lot of money from older styles. He'd been booked into the Copacabana again, and this time he was going to be a smash hit, not the failure he had been the first time. His residency at the club was advertised with a billboard in Times Square, and he came on stage every night to a taped introduction from Sammy Davis Jr.:</p>\n<p>[Excerpt: Sammy Davis Jr. introducing Sam Cooke]</p>\n<p>Listening to the live album from that residency and comparing it to the live recordings in front of a Black audience from a year earlier is astonishing proof of Cooke's flexibility as a performer. The live album from the Harlem Square Club in Florida is gritty and gospel-fuelled, while the Copacabana show has Cooke as a smooth crooner in the style of Nat \"King\" Cole -- still with a soulful edge to his vocals, but completely controlled and relaxed. The repertoire is almost entirely different as well -- other than \"Twistin' the Night Away\" and a ballad medley that included \"You Send Me\", the material was a mixture of old standards like \"Bill Bailey\" and \"When I Fall In Love\" and new folk protest songs like \"If I Had a Hammer\" and \"Blowin' in the Wind\", the song that had inspired \"A Change is Gonna Come\":</p>\n<p>[Excerpt: Sam Cooke, \"Blowin' in the Wind\"]</p>\n<p>What's astonishing is that both live albums, as different as they are, are equally good performances. Cooke by this point was an artist who could perform in any style, and for any audience, and do it well.</p>\n<p>In November 1964, Cooke recorded a dance song, “Shake”, and he prepared a shortened edit of “A Change is Gonna Come” to release as its B-side. The single was scheduled for release on December 22nd. Both sides charted, but by the time the single came out, Sam Cooke was dead. And from this point on, the story gets even more depressing and upsetting than it has been.</p>\n<p>On December the eleventh, 1964, Sam Cooke drove a woman he'd picked up to an out-of the-way motel. According to the woman, he tore off most of her clothes against her will, as well as getting undressed himself, and she was afraid he was going to rape her. When he went to the toilet, she gathered up all of her clothes and ran out, and in her hurry she gathered up his clothes as well. Some of Cooke's friends have suggested that she was in fact known for doing this and stealing men's money, and that Cooke had been carrying a large sum of money which disappeared, but this seems unlikely on the face of it, given that she ran to a phone box and called the police, telling them that she had been kidnapped and didn't know where she was, and could they please help her?</p>\n<p>Someone else was on the phone at the same time. Bertha Lee Franklin, the motel's manager, was on the phone to the owner of the motel when Sam Cooke found out that his clothes were gone, and the owner heard everything that followed. Cooke turned up at the manager's office naked except for a sports jacket and shoes, drunk, and furious. He demanded to know where the girl was. Franklin told him she didn't know anything about any girl. Cooke broke down the door to the manager's office, believing that she must be hiding in there with his clothes. Franklin grabbed the gun she had to protect herself. Cooke struggled with her, trying to get the gun off her. The gun went off three times. The first bullet went into the ceiling, the next two into Cooke. Cooke's last words were a shocked \"Lady, you shot me\".</p>\n<p> Cooke's death shocked everyone, and immediately many of his family and friends started questioning the accepted version of the story. And it has to be said that they had good reason to question it. Several people stood to benefit from Cooke's death -- he was talking about getting a divorce from his wife, who would inherit his money; he was apparently questioning his relationship with Klein, who gained complete ownership of his catalogue after his death, and Klein after all had mob connections in the person of Morris Levy;  he had remained friendly with Malcolm X after X's split from the Nation of Islam and it was conceivable that Elijah Muhammad saw Cooke as a threat; while both Elvis and James Brown thought that Cooke setting up his own label had been seen as a threat by RCA, and that *they* had had something to do with it.</p>\n<p>And you have to understand that while false rape accusations basically never happen -- and I have to emphasise that here, women just *do not* make false rape accusations in any real numbers -- false rape accusations *had* historically been weaponised against Black men in large numbers in the early and mid twentieth century. Almost all lynchings followed a pattern -- a Black man owned a bit of land a white man wanted, a white woman connected to the white man accused the Black man of rape, the Black man was lynched, and his property was sold off at far less than cost to the white man who wanted it. The few lynchings that didn't follow that precise pattern still usually involved an element of sexualising the murdered Black men, as when only a few years earlier Emmett Till, a teenager, had been beaten to death, supposedly for whistling at a white woman.</p>\n<p>So Cooke's death very much followed the pattern of a lynching. Not exactly -- for a start, the woman he attacked was Black, and so was the woman who shot him -- but it was close enough that it rang alarm bells, completely understandably. But I think we have to set against that Cooke's history of arrogant entitlement to women's bodies, and his history of violence, both against his wife and, more rarely, against strangers who caught him in the wrong mood. Fundamentally, if you read enough about his life and behaviour, the official story just rings absolutely true. He seems like someone who would behave exactly in the way described.</p>\n<p>Or at least, he seems that way to me. But of course, I didn't know him, and I have never had to live with the threat of murder because of my race. And many people who did know him and have had to live with that threat have a different opinion, and that needs to be respected.</p>\n<p>The story of Cooke's family after his death is not one from which anyone comes out looking very good. His brother, L.C., pretty much immediately recorded a memorial album and went out on a tribute tour, performing his brother's hits:</p>\n<p>[Excerpt: L.C. Cooke, \"Wonderful World\"]</p>\n<p>Cooke's best friend, J.W. Alexander, also recorded a tribute album.</p>\n<p>Bertha Franklin sued the family of the man she had killed, because her own life had been ruined and she'd had to go into hiding, thanks to threats from his fans.</p>\n<p>Cooke's widow, Barbara, married Bobby Womack less than three months after Cooke's death -- and the only reason it wasn't sooner was that Womack had not yet turned twenty-one, and so they were not able to get married without Womack's parents' permission. They married the day after Womack's twenty-first birthday, and Womack was wearing one of Sam's suits at the ceremony. Womack was heard regularly talking about how much he looked like Sam. Two of Cooke's brothers were so incensed at the way that they thought Womack was stepping into their brother's life that they broke Womack's jaw -- and Barbara Cooke pulled a gun on them and tried to shoot them. Luckily for them, Womack had guessed that a confrontation was coming, and had removed the bullets from Barbara's gun, so there would be no more deaths in his mentor's family. Within a few months, Barbara was pregnant, and the baby, when he was born, was named Vincent, the same name as Sam and Barbara's dead son.</p>\n<p> Five years later, Barbara discovered that Womack had for some time been sexually abusing Linda, her and Sam's oldest child, who was seventeen at the time Barbara discovered this. She kicked Womack out, but Linda sided with Womack and never spoke to her mother again. Linda carried on a consensual relationship with Bobby Womack for some time, and then married Bobby's brother Cecil (or maybe it's pronounced Cee-cil in his case? I've never heard him spoken about), who also became her performing and songwriting partner. They wrote many songs for other artists, as well as having hits themselves as Womack and Womack:</p>\n<p>[Excerpt: Womack and Womack, \"Teardrops\"]</p>\n<p>The duo later changed their names to Zek and Zeriiya Zekkariyas, in recognition of their African heritage.</p>\n<p>Sam Cooke left behind a complicated legacy. He hurt almost everyone who was ever involved in his life, and yet all of them seem not only to have forgiven him but to have loved him in part because of the things he did that hurt them the most. What effect that has on one's view of his art must in the end be a matter for individual judgement, and I never, ever, want to suggest that great art in any way mitigates appalling personal behaviour. But at the same time, \"A Change is Gonna Come\" stands as perhaps the most important single record we'll look at in this history, one that marked the entry into the pop mainstream of Black artists making political statements on their own behalf, rather than being spoken for and spoken over by well-meaning white liberals like me. There's no neat conclusion I can come to here,  no great lesson that can be learned and no pat answer that will make everything make sense. There's just some transcendent, inspiring, music, a bunch of horribly hurt people, and a young man dying, almost naked, in the most squalid circumstances imaginable.</p>",
  "itunes:subtitle": "Episode 122 of A History of Rock Music in Five Hundred Songs is a double-length (over an hour) look at “A Change is Gonna Come” by Sam Cooke, at Cookes political and artistic growth, and at the circumstances around his death. This one has a long list of ",
  "itunes:keywords": "Allen Klein,Aretha Franklin,Art Rupe,Bobby Darin,Bobby Womack,Bumps Blackwell,civil rights,Clyde McPhatter,Don Kirshner,Ersel Hickey,Gaynel Hodge,Herb Alpert,Hugo and Luigi,Jackie Wilson,Keen Records,Lloyd Price,Lou Adler,Malcolm X,Morris Levy,Muhammad Ali,Sam Cooke,SAR Records,Specialty Records,The Shirelles,the Soul Stirrers,The Valentinos",
  "content:encoded": "<p>Episode 122 of <em>A History of Rock Music in Five Hundred Songs</em> is a double-length (over an hour) look at “A Change is Gonna Come” by Sam Cooke, at Cooke's political and artistic growth, and at the circumstances around his death. This one has a long list of content warnings at the beginning of the episode, for good reason...</p>\n<p>Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/51383597\">on \"My Guy\" by Mary Wells</a>.</p>\n<p> </p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. For this episode, he also did the re-edit of the closing theme. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/ </a></p>\n\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week due to the number of songs by one artist.</p>\n<p>My main source for this episode is <a href=\"https://amzn.to/2s7UCmk\"><em>Dream Boogie: The Triumph of Sam Cooke</em></a> by Peter Guralnick. Like all Guralnick’s work, it’s an essential book if you’re even slightly interested in the subject. Information on Allen Klein comes from<a href=\"https://amzn.to/3wh37XI\"> Fred Goodman's book on Klein</a>.</p>\n<p>The Netflix documentary I mention can be found <a href=\"https://www.netflix.com/gb/title/80191045\">here</a>.</p>\n<p><a href=\"https://amzn.to/36eZZic\">This</a> is the best compilation of Sam Cooke’s music for the beginner, and the only one to contain recordings from all four labels (Specialty, Keen, RCA, and Tracey) he recorded for.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/andrewhickey\">Why not join them?</a></p>\n<p><strong>Transcript</strong></p>\n<p>Before I start this episode, a brief acknowledgement --  Lloyd Price plays a minor role in this story, and I heard as I was in the middle of writing it that he had died on May the third, aged eighty-eight. Price was one of the great pioneers of rock and roll -- I first looked at him more than a hundred episodes ago, back in episode twelve -- and he continued performing live right up until the start of the coronavirus outbreak in March last year. He'll be missed.</p>\n<p>Today we're going to look at one of the great soul protest records of all time, a record that was the high point in the career of its singer and songwriter, and which became a great anthem of the Civil Rights movement. But we're also going to look at the dark side of its creator, and the events that led to his untimely death. More than most episodes of the podcast, this requires a content warning. Indeed, it requires more than just content warnings.</p>\n<p>Those warnings are necessary -- this episode will deal with not only a murder, but also sexual violence, racialised violence, spousal abuse, child sexual abuse, drug use and the death of a child, as well as being about a song which is in itself about the racism that pervaded American society in the 1960s as it does today. This is a story from which absolutely nobody comes out well, which features very few decent human beings, and which I find truly unpleasant to write about.</p>\n<p>But there is something else that I want to say, before getting into the episode -- more than any other episode I have done, and I think more than any other episode that I am *going* to do, this is an episode where my position as a white British man born fourteen years after Sam Cooke's death might mean that my perspective is flawed in ways that might actually make it impossible for me to tell the story properly, and in ways that might mean that my telling of the story is doing a grave, racialised, injustice. Were this song and this story not so important to the ongoing narrative, I would simply avoid telling it altogether, but there is simply no way for me to avoid it and tell the rest of the story without doing equally grave injustices.</p>\n<p>So I will say this upfront. There are two narratives about Sam Cooke's death -- the official one, and a more conspiratorial one. Everything I know about the case tells me that the official account is the one that is actually correct, and *as far as I can tell*, I have good reason for thinking that way. But here's the thing. The other narrative is one that is held by a lot of people who knew Cooke, and they claim that the reason their narrative is not the officially-accepted one is because of racism.</p>\n<p>I do not think that is the case myself. In fact, all the facts I have seen about the case lead to the conclusion that the official narrative is correct. But I am deeply, deeply, uncomfortable with saying that. Because I have an obligation to be honest, but I also have an obligation not to talk over Black people about their experiences of racism. So what I want to say now, before even starting the episode, is this. Listen to what I have to say, by all means, but then watch the Netflix documentary Remastered: The Two Killings of Sam Cooke, and *listen* to what the people saying otherwise have to say. I can only give my own perspective, and my perspective is far more likely to be flawed here than in any other episode of this podcast. I am truly uncomfortable writing and recording this episode, and were this any other record at all, I would have just skipped it. But that was not an option.</p>\n<p>Anyway, all that said, let's get on with the episode proper, which is on one of the most important records of the sixties -- \"A Change is Gonna Come\":</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>It's been almost eighteen months since we last looked properly at Sam Cooke, way back in episode sixty, and a lot has happened in the story since then, so a brief recap -- Sam Cooke started out as a gospel singer, first with a group called the Highway QCs, and then joining the Soul Stirrers, the most popular gospel group on the circuit, replacing their lead singer.  The Soul Stirrers had signed to Specialty Records, and released records like \"Touch the Hem of His Garment\", written by Cooke in the studio:</p>\n<p>[Excerpt: The Soul Stirrers, \"Touch the Hem of His Garment\"]</p>\n<p>Cooke had eventually moved away from gospel music to secular, starting with a rewrite of a gospel song he'd written, changing \"My God is so wonderful\" to \"My girl is so lovable\", but he'd released that under the name Dale Cook, rather than his own name, in case of a backlash from gospel fans:</p>\n<p>[Excerpt: Dale Cook, \"Lovable\"]</p>\n<p>No-one was fooled, and he started recording under his own name. Shortly after this, Cooke had written his big breakthrough hit, \"You Send Me\", and when Art Rupe at Specialty Records was unimpressed with it, Cooke and his producer Bumps Blackwell had both moved from Specialty to a new label, Keen Records.</p>\n<p>Cooke's first appearance on the Ed Sullivan Show was a disaster -- cutting him off half way through the song -- but his second was a triumph, and \"You Send Me\" went to number one on both the pop and R&B charts, and sold over a million copies, while Specialty put out unreleased earlier recordings and sold over half a million copies of some of those. Sam Cooke was now one of the biggest things in the music business.</p>\n<p>And he had the potential to become even bigger. He had the looks of a teen idol, and was easily among the two or three best-looking male singing stars of the period. He had a huge amount of personal charm, he was fiercely intelligent, and had an arrogant selfishness that came over as self-confidence -- he believed he deserved everything the world could offer to him, and he was charming enough that everyone he met believed it too. He had an astonishing singing voice, and he was also prodigiously talented as a songwriter -- he'd written \"Touch the Hem of His Garment\" on the spot in the studio after coming in with no material prepared for the session.</p>\n<p>Not everything was going entirely smoothly for him, though -- he was in the middle of getting divorced from his first wife, and he was arrested backstage after a gig for non-payment of child support for a child he'd fathered with another woman he'd abandoned. This was a regular occurrence – he was as self-centred in his relationships with women as in other aspects of his life -- though as in those other aspects, the women in question were generally so smitten with him that they forgave him everything.</p>\n<p>Cooke wanted more than to be a pop star. He had his sights set on being another Harry Belafonte. At this point Belafonte was probably the most popular Black all-round entertainer in the world, with his performances of pop arrangements of calypso and folk songs:</p>\n<p>[Excerpt: Harry Belafonte, \"Jamaica Farewell\"]</p>\n<p>Belafonte had nothing like Cooke's chart success, but he was playing prestigious dates in Las Vegas and at high-class clubs, and Cooke wanted to follow his example. Most notably, at a time when almost all notable Black performers straightened their hair, Belafonte left his hair natural and cut it short. Cooke thought that this was very, very shrewd on Belafonte's part, copying him and saying to his brother L.C. that this would make him less threatening to the white public -- he believed that if a Black man slicked his hair back and processed it, he would come across as slick and dishonest, white people wouldn't trust him around their daughters. But if he just kept his natural hair but cut it short, then he'd come across as more honest and trustworthy, just an all-American boy.</p>\n<p>Oddly, the biggest effect of this decision wasn't on white audiences, but on Black people watching his appearances on TV. People like Smokey Robinson have often talked about how seeing Cooke perform on TV with his natural hair made a huge impression on them -- showing them that it was possible to be a Black man and not be ashamed of it. It was a move to appeal to the white audience that also had the effect of encouraging Black pride.</p>\n<p>But Cooke's first attempt at appealing to the mainstream white audience that loved Belafonte didn't go down well. He was booked in for a three-week appearance at the Copacabana, one of the most prestigious nightclubs in the country, and right from the start it was a failure. Bumps Blackwell had written the arrangements for the show on the basis that there would be a small band, and when they discovered Cooke would be backed by a sixteen-piece orchestra he and his assistant Lou Adler had to frantically spend a couple of days copying out sheet music for a bigger group. And Cooke's repertoire for those shows stuck mostly to old standards like \"Begin the Beguine\", \"Ol' Man River\", and \"I Love You For Sentimental Reasons\", with the only new song being \"Mary, Mary Lou\", a song written by a Catholic priest which had recently been a flop single for Bill Haley:</p>\n<p>[Excerpt: Bill Haley and the Comets, \"Mary, Mary Lou\"]</p>\n<p>Cooke didn't put over those old standards with anything like the passion he had dedicated to his gospel and rock and roll recordings, and audiences were largely unimpressed. Cooke gave up for the moment on trying to win over the supper-club audiences and returned to touring on rock and roll package tours, becoming so close with Clyde McPhatter and LaVern Baker on one tour that they seriously considered trying to get their record labels to agree to allow them to record an album of gospel songs together as a trio, although that never worked out.</p>\n<p>Cooke looked up immensely to McPhatter in particular, and listened attentively as McPhatter explained his views of the world -- ones that were very different to the ones Cooke had grown up with. McPhatter was an outspoken atheist who saw religion as a con, and who also had been a lifelong member of the NAACP and was a vocal supporter of civil rights. Cooke listened closely to what McPhatter had to say, and thought long and hard about it.</p>\n<p>Cooke was also dealing with lawsuits from Art Rupe at Specialty Records. When Cooke had left Specialty, he'd agreed that Rupe would own the publishing on any future songs he'd written, but he had got round this by crediting \"You Send Me\" to his brother, L.C. </p>\n<p>Rupe was incensed, and obviously sued, but he had no hard evidence that Cooke had himself written the song. Indeed, Rupe at one point even tried to turn the tables on Cooke, by getting Lloyd Price's brother Leo, a songwriter himself who had written \"Send Me Some Lovin'\", to claim that *he* had written \"You Send Me\", but Leo Price quickly backed down from the claim, and Rupe was left unable to prove anything.</p>\n<p>It didn't hurt Cooke's case that L.C., while not a talent of his brother's stature, was at least a professional singer and songwriter himself, who was releasing records on Checker Records that sounded very like Sam's work:</p>\n<p>[Excerpt: L.C. Cooke, \"Do You Remember?\"]</p>\n<p>For much of the late 1950s, Sam Cooke seemed to be trying to fit into two worlds simultaneously. He was insistent  that he wanted to move into the type of showbusiness that was represented by the Rat Pack -- he cut an album of Billie Holiday songs, and he got rid of Bumps Blackwell as his manager, replacing him with a white man who had previously been Sammy Davis Jr.'s publicist. But on the other hand, he was hanging out with the Central Avenue music scene in LA, with Johnny \"Guitar\" Watson, Eugene Church, Jesse Belvin, and Alex and Gaynel Hodge.</p>\n<p>While his aspirations towards Rat Packdom faltered, he carried on having hits -- his own \"Only Sixteen\" and \"Everybody Loves to Cha-Cha-Cha\", and he recorded, but didn't release yet, a song that Lou Adler had written with his friend Herb Alpert, and whose lyrics Sam revised, \"Wonderful World\".</p>\n<p>Cooke was also starting a relationship with the woman who would become his second wife, Barbara. He'd actually had an affair with her some years earlier, and they'd had a daughter, Linda, who Cooke had initially not acknowledged as his own -- he had many children with other women -- but they got together in 1958, around the time of Cooke's divorce from his first wife. Tragically, that first wife then died in a car crash in 1959 -- Cooke paid her funeral expenses.</p>\n<p>He was also getting dissatisfied with Keen Records, which had been growing too fast to keep up with its expenses -- Bumps Blackwell, Lou Adler, and Herb Alpert, who had all started at the label with him, all started to move away from it to do other things, and Cooke was sure that Keen weren't paying him the money they owed as fast as they should. </p>\n<p>He also wanted to help some of his old friends out -- while Cooke was an incredibly selfish man, he was also someone who believed in not leaving anyone behind, so long as they paid him what he thought was the proper respect, and so he started his own record label, with his friends J.W. Alexander and Roy Crain, called SAR Records (standing for Sam, Alex, and Roy), to put out records by his old group The Soul Stirrers, for whom he wrote \"Stand By Me, Father\", a song inspired by an old gospel song by Charles Tindley, and with a lead sung by Johnnie Taylor, the Sam Cooke soundalike who had replaced Cooke as the group's lead singer:</p>\n<p>[Excerpt: The Soul Stirrers, \"Stand By Me, Father\"]</p>\n<p>Of course, that became, as we heard a few months back, the basis for Ben E. King's big hit \"Stand By Me\".</p>\n<p>Cooke and Alexander had already started up their own publishing company, and were collaborating on songs for other artists, too. They wrote \"I Know I'll Always Be In Love With You\", which was recorded first by the Hollywood Flames and then by Jackie Wilson:</p>\n<p>[Excerpt: Jackie Wilson, \"I Know I'll Always Be in Love With You\"]</p>\n<p>And \"I'm Alright\", which Little Anthony and the Imperials released as a single:</p>\n<p>[Excerpt: Little Anthony and the Imperials, \"I'm Alright\"]</p>\n<p>But while he was working on rock and roll and gospel records, he was also learning to tap-dance for his performances at the exclusive white nightclubs he wanted to play -- though when he played Black venues he didn't include those bits in the act. He did, though, perform seated on a stool in imitation of Perry Como, having decided that if he couldn't match the energetic performances of people like Jackie Wilson (who had been his support act at a run of shows where Wilson had gone down better than Cooke) he would go in a more casual direction. </p>\n<p>He was also looking to move into the pop market when it came to his records, and he eventually signed up with RCA Records, and specifically with Hugo and Luigi. We've talked about Hugo and Luigi before, a couple of times -- they were the people who had produced Georgia Gibbs' soundalike records that had ripped off Black performers, and we talked about their production of \"The Lion Sleeps Tonight\", though at this point they hadn't yet made that record. They had occasionally produced records that were more R&B flavoured -- they produced \"Shout!\" for the Isley Brothers, for example -- but they were in general about as bland and middle-of-the-road a duo as one could imagine working in the music industry.</p>\n<p>The first record that Hugo and Luigi produced for Cooke was a song that the then-unknown Jeff Barry had written, \"Teenage Sonata\". That record did nothing, and the label were especially annoyed when a recording Cooke had done while he was still at Keen, \"Wonderful World\", was released on his old label and made the top twenty:</p>\n<p>[Excerpt: Sam Cooke, \"Wonderful World\"]</p>\n<p>Cooke's collaboration with Hugo and Luigi would soon turn into one that bore a strong resemblance to their collaboration with the Isley Brothers -- they would release great singles, but albums that fundamentally misunderstood Cooke's artistry; though some of that misunderstanding may have come from Cooke himself, who never seemed to be sure which direction to go in. Many of the album tracks they released have Cooke sounding unsure of himself, and hesitant, but that's not something that you can say about the first real success that Cooke came out with on RCA, a song he wrote after driving past a group of prisoners working on a chain gang. He'd originally intended that song to be performed by his brother Charles, but he'd half-heartedly played it for Hugo and Luigi when they'd not seen much potential in any of his other recent originals, and they'd decided that that was the hit:</p>\n<p>[Excerpt: Sam Cooke, \"Chain Gang\"]</p>\n<p>That made number two on the charts, becoming his biggest hit since \"You Send Me\".</p>\n<p>Meanwhile Cooke was also still recording other artists for SAR -- though by this point Roy Crain had been eased out and SAR now stood for Sam and Alex Records. He got a group of Central Avenue singers including Alex and Gaynel Hodge to sing backing vocals on a song he gave to a friend of his named Johnny Morisette, who was known professionally as \"Johnny Two-Voice\" because of the way he could sound totally different in his different ranges, but who was known to his acquaintances as \"the singing pimp\", because of his other occupation:</p>\n<p>[Excerpt: Johnny Morisette, \"I'll Never Come Running Back to You\"]</p>\n<p>They also thought seriously about signing up a young gospel singer they knew called Aretha Franklin, who was such an admirer of Sam's that she would try to copy him -- she changed her brand of cigarettes to match the ones he smoked, and when she saw him on tour reading William Shirer's The Rise and Fall of the Third Reich -- Cooke was an obsessive reader, especially of history -- she bought her own copy. She never read it, but she thought she should have a copy if Cooke had one. </p>\n<p>But they decided that Franklin's father, the civil rights leader Rev. C.L. Franklin, was too intimidating, and so it would probably not be a good idea to get involved.</p>\n<p>The tour on which Franklin saw Cooke read Shirer's book was also the one on which Cooke made his first public stance in favour of civil rights -- that tour, which was one of the big package tours of the time, was meant to play a segregated venue, but the artists hadn't been informed just how segregated it was. While obviously none of them supported segregation, they would mostly accept playing to segregated crowds, because there was no alternative, if at least Black people were allowed in in roughly equal numbers. But in this case, Black people were confined to a tiny proportion of the seats, in areas with extremely restricted views, and both Cooke and Clyde McPhatter refused to go on stage, though the rest of the acts didn't join in their boycott.</p>\n<p>Cooke's collaboration with Hugo and Luigi remained hit and miss, and produced a few more flop singles, but then Cooke persuaded them to allow him to work in California, with the musicians he'd worked with at Keen, and with René Hall arranging rather than the arrangers they'd employed previously. While the production on Cooke's California sessions was still credited to Hugo and Luigi, Luigi was the only one actually attending those sessions -- Hugo was afraid of flying and wouldn't come out to the West Coast.</p>\n<p>The first record that came out under this new arrangement was another big hit, \"Cupid\", which had vocal sound effects supplied by a gospel act Cooke knew, the Sims twins -- Kenneth Sims made the sound of an arrow flying through the air, and Bobbie Sims made the thwacking noise of it hitting a target:</p>\n<p>[Excerpt: Sam Cooke, \"Cupid\"]</p>\n<p>Cooke became RCA's second-biggest artist, at least in terms of singles sales, and had a string of hits like \"Twistin' the Night Away\", \"Another Saturday Night\", and \"Bring it On Home to Me\", though he was finding it difficult to break the album market. He was frustrated that he wasn't having number one records, but Luigi reassured him that that was actually the best position to be in: “We’re getting number four, number six on the Billboard charts, and as long as we get that, nobody’s gonna bother you. But if you get two or three number ones in a row, then you got no place to go but down. Then you’re competition, and they’re just going to do everything they can to knock you off.”</p>\n<p>But Cooke's personal life had started to unravel. After having two daughters, his wife gave birth to a son. Cooke had desperately wanted a male heir, but he didn't bond with his son, Vincent, who he insisted didn't look like him. He became emotionally and physically abusive towards his wife, beating her up on more than one occasion, and while she had been a regular drug user already, her use increased to try to dull the pain of being married to someone who she loved but who was abusing her so appallingly.</p>\n<p>Things became much, much worse, when the most tragic thing imaginable happened. Cooke had a swim in his private pool and then went out, leaving the cover off. His wife, Barbara, then let the children play outside, thinking that their three-year-old daughter Tracey would be able to look after the baby for a few minutes. Baby Vincent fell into the pool and drowned. Both parents blamed the other, and Sam was devastated at the death of the child he only truly accepted as his son once the child was dead. You can hear some of that devastation in a recording he made a few months later of an old Appalachian folk song:</p>\n<p>[Excerpt: Sam Cooke, \"The Riddle Song\"]</p>\n<p>Friends worried that Cooke was suicidal, but Cooke held it together, in part because of the intervention of his new manager, Allen Klein. Klein had had a hard life growing up -- his mother had died when he was young, and his father had sent him to an orphanage for a while. Eventually, his father remarried, and young Allen came back to the family home, but his father was still always distant. He grew close to his stepmother, but then she died as well. </p>\n<p>Klein turned up at Cooke's house two days after the baby's funeral with his own daughter, and insisted on taking Cooke and his surviving children to Disneyland, telling him \"You always had your mother and father, but I lost my mother when I was nine months old. You’ve got two other children. Those two girls need you even more now. You’re their only father, and you’ve got to take care of them.\"</p>\n<p>Klein was very similar to Cooke in many ways. He had decided from a very early age that he couldn't trust anyone but himself, and that he had to make his own way in the world. He became hugely ambitious, and wanted to reach the very top. Klein had become an accountant, and gone to work for Joe Fenton, an accountant who specialised in the entertainment industry. </p>\n<p>One of the first jobs Klein did in his role with Fenton was to assist him with an audit of Dot Records in 1957, called for by the Harry Fox Agency. We've not talked about Harry Fox before, but they're one of the most important organisations in the American music industry -- they're a collection agency like ASCAP or BMI, who collect songwriting royalties for publishing companies and songwriters. But while ASCAP and BMI collect performance royalties -- they collect payments for music played on the radio or TV, or in live performance -- Harry Fox collect the money for mechanical reproduction, the use of songs on records. It's a gigantic organisation, and it has the backing of all the major music publishers.</p>\n<p>To do this audit, Klein and Fenton had to travel from New York to LA, and as they were being paid by a major entertainment industry organisation, they were put up in the Roosevelt Hotel, where at the time the other guests included Elvis, Claude Rains, and Sidney Poitier. Klein, who had grown up in comparative poverty, couldn't help but be impressed at the money that you could make by working in entertainment.</p>\n<p>The audit of Dot Records found some serious discrepancies -- they were severely underpaying publishers and songwriters. While they were in LA, Klein and Fenton also audited several other labels, like Liberty, and they found the same thing at all of them. The record labels were systematically conning publishing companies out of money they were owed.</p>\n<p>Klein immediately realised that if they were doing this to the major publishing companies that Harry Fox represented, they must be doing the same kind of thing to small songwriters and artists, the kind of people who didn't have a huge organisation to back them up. </p>\n<p>Unfortunately for Klein, soon after he started working for Fenton, he was fired -- he was someone who was chronically unable to get to work on time in the morning, and while he didn't mind working ridiculously long hours, he could not, no matter how hard he tried, get himself into the office for nine in the morning. He was fired after only four months, and Fenton even recommended to the State of New Jersey that they not allow Klein to become a Certified Public Accountant -- a qualification which, as a result, Klein never ended up getting.</p>\n<p>He set up his own company to perform audits of record companies for performers, and he got lucky by bumping in to someone he'd been at school with -- Don Kirshner. Kirshner agreed to start passing clients Klein's way, and his first client was Ersel Hickey (no relation), the rockabilly singer we briefly discussed in the episode on \"Twist and Shout\", who had a hit with \"Bluebirds Over the Mountain\":</p>\n<p>[Excerpt: Ersel Hickey, \"Bluebirds Over the Mountain\"]</p>\n<p>Klein audited Hickey's record label, but was rather surprised to find out that they didn't actually owe Hickey a penny. It turned out that record contracts were written so much in the company's favour that they didn't have to use any dodgy accounting to get out of paying the artists anything. </p>\n<p>But sometimes, the companies would rip the artists off anyway, if they were particularly unscrupulous. Kirshner had also referred the rockabilly singer/songwriter duo Buddy Knox and Jimmy Bowen to Klein. Their big hit, \"Party Doll\", had come out on Roulette Records:</p>\n<p>[Excerpt: Buddy Knox, \"Party Doll\"]</p>\n<p>Klein found out that in the case of Roulette, the label *were* actually not paying the artists what they were contractually owed, largely because Morris Levy didn't like paying people money. After the audit, Levy did actually agree to pay Knox and Bowen what they were owed, but he insisted that he would only pay it over four years, at a rate of seventy dollars a week -- if Klein wanted it any sooner, he'd have to sue, and the money would all be eaten up in lawyers' fees. That was still better than nothing, and Klein made enough from his cut that he was able to buy himself a car. </p>\n<p>Klein and Levy actually became friends -- the two men were very similar in many ways -- and Klein learned a big lesson from negotiating with him. That lesson was that you take what you can get, because something is better than nothing. If you discover a company owes your client a hundred thousand dollars that your client didn't know about, and they offer you fifty thousand to settle, you take the fifty thousand. Your client still ends up much better off than they would have been, you've not burned any bridges with the company, and you get your cut.</p>\n<p>And Klein's cut was substantial -- his standard was to take fifty percent of any extra money he got for the artist. And he prided himself on always finding something -- though rarely as much as he would suggest to his clients before getting together with them. One particularly telling anecdote about Klein's attitude is that when he was at Don Kirshner's wedding he went up to Kirshner's friend Bobby Darin and told him he could get him a hundred thousand dollars. Darin signed, but according to Darin's manager, Klein only actually found one underpayment, for ten thousand copies of Darin's hit \"Splish Splash\" which Atlantic hadn't paid for:</p>\n<p>[Excerpt: Bobby Darin, \"Splish Splash\"]</p>\n<p>However, at the time singles sold for a dollar, Darin was on a five percent royalty, and he only got paid for ninety percent of the records sold (because of a standard clause in contracts at that time to allow for breakages). The result was that Klein found an underpayment of just four hundred and fifty dollars, a little less than the hundred thousand he'd promised the unimpressed Darin.</p>\n<p>But Klein used the connection to Darin to get a lot more clients, and he did significantly better for some of them. For Lloyd Price, for example, he managed to get an extra sixty thousand dollars from ABC/Paramount, and Price and Klein became lifelong friends.</p>\n<p>And Price sang Klein's praises to Sam Cooke, who became eager to meet him.  He got the chance when Klein started up a new business with a DJ named Jocko Henderson. Henderson was one of the most prominent DJs in Philadelphia, and was very involved in all aspects of the music industry. He had much the same kind of relationship with Scepter Records that Alan Freed had with Chess, and was cut in on most of the label's publishing on its big hits -- rights he would later sell to Klein in order to avoid the kind of investigation that destroyed Freed's career.</p>\n<p>Henderson had also been the DJ who had first promoted \"You Send Me\" on the radio, and Cooke owed him a favour. Cooke was also at the time being courted by Scepter Records, who had offered him a job as the Shirelles' writer and producer once Florence Greenberg had split up with Luther Dixon. He'd written them one song, which referenced many of their earlier hits:</p>\n<p>[Excerpt: The Shirelles, \"Only Time Will Tell\"]</p>\n<p>However, Cooke didn't stick with Scepter -- he figured out that Greenberg wasn't interested in him as a writer/producer, but as a singer, and he wasn't going to record for an indie like them when he could work with RCA.</p>\n<p>But when Henderson and Klein started running a theatre together, putting on R&B shows, those shows obviously featured a lot of Scepter acts like the Shirelles and Dionne Warwick, but they also featured Sam Cooke on the top of the bill, and towards the bottom of the bill were the Valentinos, a band featuring Cooke's touring guitarist, Bobby Womack, who were signed to SAR Records:</p>\n<p>[Excerpt: The Valentinos, \"It's All Over Now\"]</p>\n<p>Klein was absolutely overawed with Cooke's talent when he first saw him on stage, realising straight away that this was one of the major artists of his generation. Whereas most of the time, Klein would push himself forward straight away and try to dominate artists, here he didn't even approach Cooke at all, just chatted to Cooke's road manager and found out what Cooke was like as a person. This is something one sees time and again when it comes to Cooke -- otherwise unflappable people just being absolutely blown away by his charisma, talent, and personality, and behaving towards him in ways that they behaved to nobody else.</p>\n<p>At the end of the residency, Cooke had approached Klein, having heard good things about him from Price, Henderson, and his road manager. The two had several meetings over the next few months, so Klein could get an idea of what it was that was bothering Cooke about his business arrangements. Eventually, after a few months, Cooke asked Klein for his honest opinion.</p>\n<p>Klein was blunt. \"I think they're treating you like a \" -- and here he used the single most offensive anti-Black slur there is -- \"and you shouldn't let them.\"</p>\n<p>Cooke agreed, and said he wanted Klein to take control of his business arrangements. The first thing Klein did was to get Cooke a big advance from BMI against his future royalties as a songwriter and publisher, giving him seventy-nine thousand dollars up front to ease his immediate cash problems. He then started working on getting Cooke a better recording contract.</p>\n<p>The first thing he did was go to Columbia records, who he thought would be a better fit for Cooke than RCA were, and with whom Cooke already had a relationship, as he was at that time working with his friend, the boxer Muhammad Ali, on an album that Ali was recording for Columbia:</p>\n<p>[Excerpt: Muhammad Ali, \"The Gang's All Here\"]</p>\n<p>Cooke was very friendly with Ali, and also with Ali's spiritual mentor, the activist Malcolm X, and both men tried to get him to convert to the Nation of Islam. Cooke declined -- while he respected both men, he had less respect for Elijah Mohammed, who he saw as a con artist, and he was becoming increasingly suspicious of religion in general. He did, though, share the Nation of Islam's commitment to Black people pulling themselves up by their bootstraps and presenting themselves in a clean-cut way, having the same vision of Black capitalism that many of his contemporaries like James Brown shared.</p>\n<p>Unfortunately, negotiations with Columbia quickly failed. Klein believed, probably correctly, that record labels didn't have to do anything to sell Sam Cooke's records, and that Cooke was in a unique position as one of the very few artists at that time who could write, perform, and produce hit records without any outside assistance. Klein therefore thought that Cooke deserved a higher royalty rate than the five percent industry standard, and said that Cooke wouldn't sign with anyone for that rate.</p>\n<p>The problem was that Columbia had most-favoured-nations clauses written into many other artists' contracts. These clauses meant that if any artist signed with Columbia for a higher royalty rate, those other artists would also have to get that royalty rate, so if Cooke got the ten percent that Klein was demanding, a bunch of other performers like Tony Bennett would also have to get the ten percent, and Columbia were simply not willing to do that.</p>\n<p>So Klein decided that Cooke was going to stay with RCA, but he found a way to make sure that Cooke would get a much better deal from RCA, and in a way which didn't affect any of RCA's own favoured-nations contracts. </p>\n<p>Klein had had some involvement in filmmaking, and knew that independent production companies were making films without the studios, and just letting the studios distribute them. He also knew that in the music business plenty of songwriters and producers like Leiber and Stoller and Phil Spector owned their own record labels. But up to that point, no performers did, that Klein was aware of, because it was the producers who generally made the records, and the contracts were set up with the assumption that the performer would just do what the producer said. That didn't apply to Sam Cooke, and so Klein didn't see why Cooke couldn't have his own label.</p>\n<p>Klein set up a new company, called Tracey Records, which was named after Cooke's daughter, and whose president was Cooke's old friend J.W. Alexander. Tracey Records would, supposedly to reduce Cooke's tax burden, be totally owned by Klein, but it would be Cooke's company, and Cooke would be paid in preferred stock in the company, though Cooke would get the bulk of the money -- it would be a mere formality that the company was owned by Klein. While this did indeed have the effect of limiting the amount of tax Cooke had to pay, it also fulfilled a rule that Klein would later state -- \"never take twenty percent of an artist's earnings. Instead give them eighty percent of yours\". What mattered wasn't the short-term income, but the long-term ownership. And that's what Klein worked out with RCA.</p>\n<p>Tracey Records would record and manufacture all Cooke's records from that point on, but RCA would have exclusive distribution rights for thirty years, and would pay Tracey a dollar per album. After thirty years, Tracey records would get all the rights to Cooke's recordings back, and in the meantime, Cooke would effectively be on a much higher royalty rate than he'd received before, in return for taking a much larger share of the risk.</p>\n<p>There were also changes at SAR. Zelda Sands, who basically ran the company for Sam and J.W., was shocked to receive a phone call from Sam and Barbara, telling her to immediately come to Chicago, where Sam was staying while he was on tour. She went up to their hotel room, where Barbara angrily confronted her, saying that she knew that Sam had always been attracted to Zelda -- despite Zelda apparently being one of the few women Cooke met who he never slept with -- and heavily implied that the best way to sort this would be for them to have a threesome. Zelda left and immediately flew back to LA. A few days later, Barbara turned up at the SAR records offices and marched Zelda out at gunpoint.</p>\n<p>Through all of this turmoil, though, Cooke managed to somehow keep creating music. And indeed he soon came up with the song that would be his most important legacy. J.W. Alexander had given Cooke a copy of The Freewheelin' Bob Dylan, and Cooke had been amazed at \"Blowin' in the Wind\":</p>\n<p>[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]</p>\n<p>But more than being amazed at the song, Cooke was feeling challenged. This was a song that should have been written by a Black man. More than that, it was a song that should have been written by *him*. Black performers needed to be making music about their own situation. He added \"Blowin' in the Wind\" to his own live set, but he also started thinking about how he could write a song like that himself.</p>\n<p>As is often the case with Cooke's writing, he took inspiration from another song, this time \"Ol' Man River\", the song from the musical Showboat that had been made famous by the actor, singer, and most importantly civil rights activist Paul Robeson:</p>\n<p>[Excerpt: Paul Robeson, \"Ol' Man River\"]</p>\n<p>Cooke had recorded his own version of that in 1958, but now in early 1964 he took the general pace, some melodic touches, the mention of the river, and particularly the lines \"I'm tired of livin' and scared of dyin'\", and used them to create something new. Oddly for a song that would inspire a civil rights anthem -- or possibly just appropriately, in the circumstances, \"Ol' Man River\" in its original form featured several racial slurs included by the white lyricist, Oscar Hammerstein, and indeed Robeson himself in later live performances changed the very lines that Cooke would later appropriate, changing them as he thought they were too defeatist for a Black activist to sing:</p>\n<p>[Excerpt: Paul Robeson, \"Ol' Man River (alternative lyrics)\"]</p>\n<p>Cooke's song would keep the original sense, in his lines \"It's been too hard livin' but I'm afraid to die\", but the most important thing was the message -- \"a change is gonna come\".</p>\n<p>The session at which he recorded it was to be his last with Luigi, whose contract with RCA was coming to an end, and Cooke knew it had to be something special. Rene Hall came up with an arrangement for a full orchestra, which so overawed Cooke's regular musicians that his drummer found himself too nervous to play on the session. Luckily, Earl Palmer was recording next door, and was persuaded to come and fill in for him. </p>\n<p>Hall's arrangement starts with an overture played by the whole orchestra:</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>And then each verse features different instrumentation, with the instruments changing at the last line of each verse -- \"a change is gonna come\". The first verse is dominated by the rhythm section:</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>Then for the second verse, the strings come in, for the third the strings back down and are replaced by horns, and then at the end the whole orchestra swells up behind Cooke:</p>\n<p>[Excerpt: Sam Cooke, \"A Change is Gonna Come\"]</p>\n<p>Cooke was surprised when Luigi, at the end of the session, told him how much he liked the song, which Cooke thought wouldn't have been to Luigi's taste, as Luigi made simple pop confections, not protest songs. But as Luigi later explained, \"But I did like it. It was a serious piece, but still it was him. Some of the other stuff was throwaway, but this was very deep. He was really digging into himself for this one.\"</p>\n<p>Cooke was proud of his new record, but also had something of a bad feeling about it, something that was confirmed when he played the record for Bobby Womack, who told him \"it sounds like death\". Cooke agreed, there was something premonitory about the record, something ominous.</p>\n<p>Allen Klein, on the other hand, was absolutely ecstatic. The track was intended to be used only as an album track -- they were going in a more R&B direction with Cooke's singles at this point. His previous single was a cover version of Howlin' Wolf's \"Little Red Rooster”:</p>\n<p>[Excerpt: Sam Cooke, \"Little Red Rooster\"]</p>\n<p>And his next two singles were already recorded -- a secularised version of the old spiritual \"Ain't That Good News\", and a rewrite of an old Louis Jordan song. Cooke was booked on to the Johnny Carson show, where he was meant to perform both sides of his new single, but Allen Klein was so overwhelmed by \"A Change is Gonna Come\" that he insisted that Cooke drop \"Ain't That Good News\" and perform his new song instead. Cooke said that he was meant to be on there to promote his new record. Klein insisted that he was meant to be promoting *himself*, and that the best promotion for himself would be this great song. Cooke then said that the Tonight Show band didn't have all the instruments needed to reproduce the orchestration. Klein said that if RCA wouldn't pay for the additional eighteen musicians, he would pay for them out of his own pocket. Cooke eventually agreed.</p>\n<p>Unfortunately, there seems to exist no recording of that performance, the only time Cooke would ever perform \"A Change is Gonna Come\" live, but reports from people who watched it at the time suggest that it made as much of an impact on Black people watching as the Beatles' appearance on the Ed Sullivan Show two days later made on white America. \"A Change is Gonna Come\" became a standard of the soul repertoire, recorded by Aretha Franklin:</p>\n<p>[Excerpt: Aretha Franklin, \"A Change is Gonna Come\"]</p>\n<p>Otis Redding:</p>\n<p>[Excerpt: Otis Redding, \"A Change is Gonna Come\"]</p>\n<p>The Supremes and more. Cooke licensed it to a compilation album released as a fundraiser for Martin Luther King's campaigning, and when King was shot in 1968, Rosa Parks spent the night crying in her mother's arms, and they listened to \"A Change is Gonna Come\". She said ”Sam’s smooth voice was like medicine to the soul. It was as if Dr. King was speaking directly to me.”</p>\n<p>After his Tonight Show appearance, Cooke was in the perfect position to move into the real big time. Allen Klein had visited Brian Epstein on RCA's behalf to see if Epstein would sign the Beatles to RCA for a million-dollar advance. Epstein wasn't interested, but he did suggest to Klein that possibly Cooke could open for the Beatles when they toured the US in 1965. </p>\n<p>And Cooke was genuinely excited about the British Invasion and the possibilities it offered for the younger musicians he was mentoring. When Bobby Womack complained that the Rolling Stones had covered his song \"It's All Over Now\" and deprived his band of a hit, Cooke explained to Womack first that he'd be making a ton of money from the songwriting royalties, but also that Womack and his brothers were in a perfect position -- they were young men with long hair who played guitars and drums. If the Valentinos jumped on the bandwagon they could make a lot of money from this new style.</p>\n<p>But Cooke was going to make a lot of money from older styles. He'd been booked into the Copacabana again, and this time he was going to be a smash hit, not the failure he had been the first time. His residency at the club was advertised with a billboard in Times Square, and he came on stage every night to a taped introduction from Sammy Davis Jr.:</p>\n<p>[Excerpt: Sammy Davis Jr. introducing Sam Cooke]</p>\n<p>Listening to the live album from that residency and comparing it to the live recordings in front of a Black audience from a year earlier is astonishing proof of Cooke's flexibility as a performer. The live album from the Harlem Square Club in Florida is gritty and gospel-fuelled, while the Copacabana show has Cooke as a smooth crooner in the style of Nat \"King\" Cole -- still with a soulful edge to his vocals, but completely controlled and relaxed. The repertoire is almost entirely different as well -- other than \"Twistin' the Night Away\" and a ballad medley that included \"You Send Me\", the material was a mixture of old standards like \"Bill Bailey\" and \"When I Fall In Love\" and new folk protest songs like \"If I Had a Hammer\" and \"Blowin' in the Wind\", the song that had inspired \"A Change is Gonna Come\":</p>\n<p>[Excerpt: Sam Cooke, \"Blowin' in the Wind\"]</p>\n<p>What's astonishing is that both live albums, as different as they are, are equally good performances. Cooke by this point was an artist who could perform in any style, and for any audience, and do it well.</p>\n<p>In November 1964, Cooke recorded a dance song, “Shake”, and he prepared a shortened edit of “A Change is Gonna Come” to release as its B-side. The single was scheduled for release on December 22nd. Both sides charted, but by the time the single came out, Sam Cooke was dead. And from this point on, the story gets even more depressing and upsetting than it has been.</p>\n<p>On December the eleventh, 1964, Sam Cooke drove a woman he'd picked up to an out-of the-way motel. According to the woman, he tore off most of her clothes against her will, as well as getting undressed himself, and she was afraid he was going to rape her. When he went to the toilet, she gathered up all of her clothes and ran out, and in her hurry she gathered up his clothes as well. Some of Cooke's friends have suggested that she was in fact known for doing this and stealing men's money, and that Cooke had been carrying a large sum of money which disappeared, but this seems unlikely on the face of it, given that she ran to a phone box and called the police, telling them that she had been kidnapped and didn't know where she was, and could they please help her?</p>\n<p>Someone else was on the phone at the same time. Bertha Lee Franklin, the motel's manager, was on the phone to the owner of the motel when Sam Cooke found out that his clothes were gone, and the owner heard everything that followed. Cooke turned up at the manager's office naked except for a sports jacket and shoes, drunk, and furious. He demanded to know where the girl was. Franklin told him she didn't know anything about any girl. Cooke broke down the door to the manager's office, believing that she must be hiding in there with his clothes. Franklin grabbed the gun she had to protect herself. Cooke struggled with her, trying to get the gun off her. The gun went off three times. The first bullet went into the ceiling, the next two into Cooke. Cooke's last words were a shocked \"Lady, you shot me\".</p>\n<p> Cooke's death shocked everyone, and immediately many of his family and friends started questioning the accepted version of the story. And it has to be said that they had good reason to question it. Several people stood to benefit from Cooke's death -- he was talking about getting a divorce from his wife, who would inherit his money; he was apparently questioning his relationship with Klein, who gained complete ownership of his catalogue after his death, and Klein after all had mob connections in the person of Morris Levy;  he had remained friendly with Malcolm X after X's split from the Nation of Islam and it was conceivable that Elijah Muhammad saw Cooke as a threat; while both Elvis and James Brown thought that Cooke setting up his own label had been seen as a threat by RCA, and that *they* had had something to do with it.</p>\n<p>And you have to understand that while false rape accusations basically never happen -- and I have to emphasise that here, women just *do not* make false rape accusations in any real numbers -- false rape accusations *had* historically been weaponised against Black men in large numbers in the early and mid twentieth century. Almost all lynchings followed a pattern -- a Black man owned a bit of land a white man wanted, a white woman connected to the white man accused the Black man of rape, the Black man was lynched, and his property was sold off at far less than cost to the white man who wanted it. The few lynchings that didn't follow that precise pattern still usually involved an element of sexualising the murdered Black men, as when only a few years earlier Emmett Till, a teenager, had been beaten to death, supposedly for whistling at a white woman.</p>\n<p>So Cooke's death very much followed the pattern of a lynching. Not exactly -- for a start, the woman he attacked was Black, and so was the woman who shot him -- but it was close enough that it rang alarm bells, completely understandably. But I think we have to set against that Cooke's history of arrogant entitlement to women's bodies, and his history of violence, both against his wife and, more rarely, against strangers who caught him in the wrong mood. Fundamentally, if you read enough about his life and behaviour, the official story just rings absolutely true. He seems like someone who would behave exactly in the way described.</p>\n<p>Or at least, he seems that way to me. But of course, I didn't know him, and I have never had to live with the threat of murder because of my race. And many people who did know him and have had to live with that threat have a different opinion, and that needs to be respected.</p>\n<p>The story of Cooke's family after his death is not one from which anyone comes out looking very good. His brother, L.C., pretty much immediately recorded a memorial album and went out on a tribute tour, performing his brother's hits:</p>\n<p>[Excerpt: L.C. Cooke, \"Wonderful World\"]</p>\n<p>Cooke's best friend, J.W. Alexander, also recorded a tribute album.</p>\n<p>Bertha Franklin sued the family of the man she had killed, because her own life had been ruined and she'd had to go into hiding, thanks to threats from his fans.</p>\n<p>Cooke's widow, Barbara, married Bobby Womack less than three months after Cooke's death -- and the only reason it wasn't sooner was that Womack had not yet turned twenty-one, and so they were not able to get married without Womack's parents' permission. They married the day after Womack's twenty-first birthday, and Womack was wearing one of Sam's suits at the ceremony. Womack was heard regularly talking about how much he looked like Sam. Two of Cooke's brothers were so incensed at the way that they thought Womack was stepping into their brother's life that they broke Womack's jaw -- and Barbara Cooke pulled a gun on them and tried to shoot them. Luckily for them, Womack had guessed that a confrontation was coming, and had removed the bullets from Barbara's gun, so there would be no more deaths in his mentor's family. Within a few months, Barbara was pregnant, and the baby, when he was born, was named Vincent, the same name as Sam and Barbara's dead son.</p>\n<p> Five years later, Barbara discovered that Womack had for some time been sexually abusing Linda, her and Sam's oldest child, who was seventeen at the time Barbara discovered this. She kicked Womack out, but Linda sided with Womack and never spoke to her mother again. Linda carried on a consensual relationship with Bobby Womack for some time, and then married Bobby's brother Cecil (or maybe it's pronounced Cee-cil in his case? I've never heard him spoken about), who also became her performing and songwriting partner. They wrote many songs for other artists, as well as having hits themselves as Womack and Womack:</p>\n<p>[Excerpt: Womack and Womack, \"Teardrops\"]</p>\n<p>The duo later changed their names to Zek and Zeriiya Zekkariyas, in recognition of their African heritage.</p>\n<p>Sam Cooke left behind a complicated legacy. He hurt almost everyone who was ever involved in his life, and yet all of them seem not only to have forgiven him but to have loved him in part because of the things he did that hurt them the most. What effect that has on one's view of his art must in the end be a matter for individual judgement, and I never, ever, want to suggest that great art in any way mitigates appalling personal behaviour. But at the same time, \"A Change is Gonna Come\" stands as perhaps the most important single record we'll look at in this history, one that marked the entry into the pop mainstream of Black artists making political statements on their own behalf, rather than being spoken for and spoken over by well-meaning white liberals like me. There's no neat conclusion I can come to here,  no great lesson that can be learned and no pat answer that will make everything make sense. There's just some transcendent, inspiring, music, a bunch of horribly hurt people, and a young man dying, almost naked, in the most squalid circumstances imaginable.</p>",
  "enclosure": "",
  "itunes:summary": "Episode 122 of A History of Rock Music in Five Hundred Songs is a double-length (over an hour) look at “A Change is Gonna Come” by Sam Cooke, at Cooke's political and artistic growth, and at the circumstances around his death. This one has a long list of content warnings at the beginning of the episode, for good reason...\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"My Guy\" by Mary Wells.\n \nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. For this episode, he also did the re-edit of the closing theme. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/ \n\nResources\nNo Mixcloud this week due to the number of songs by one artist.\nMy main source for this episode is Dream Boogie: The Triumph of Sam Cooke by Peter Guralnick. Like all Guralnick’s work, it’s an essential book if you’re even slightly interested in the subject. Information on Allen Klein comes from Fred Goodman's book on Klein.\nThe Netflix documentary I mention can be found here.\nThis is the best compilation of Sam Cooke’s music for the beginner, and the only one to contain recordings from all four labels (Specialty, Keen, RCA, and Tracey) he recorded for.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nBefore I start this episode, a brief acknowledgement --  Lloyd Price plays a minor role in this story, and I heard as I was in the middle of writing it that he had died on May the third, aged eighty-eight. Price was one of the great pioneers of rock and roll -- I first looked at him more than a hundred episodes ago, back in episode twelve -- and he continued performing live right up until the start of the coronavirus outbreak in March last year. He'll be missed.\nToday we're going to look at one of the great soul protest records of all time, a record that was the high point in the career of its singer and songwriter, and which became a great anthem of the Civil Rights movement. But we're also going to look at the dark side of its creator, and the events that led to his untimely death. More than most episodes of the podcast, this requires a content warning. Indeed, it requires more than just content warnings.\nThose warnings are necessary -- this episode will deal with not only a murder, but also sexual violence, racialised violence, spousal abuse, child sexual abuse, drug use and the death of a child, as well as being about a song which is in itself about the racism that pervaded American society in the 1960s as it does today. This is a story from which absolutely nobody comes out well, which features very few decent human beings, and which I find truly unpleasant to write about.\nBut there is something else that I want to say, before getting into the episode -- more than any other episode I have done, and I think more than any other episode that I am *going* to do, this is an episode where my position as a white British man born fourteen years after Sam Cooke's death might mean that my perspective is flawed in ways that might actually make it impossible for me to tell the story properly, and in ways that might mean that my telling of the story is doing a grave, racialised, injustice. Were this song and this story not so important to the ongoing narrative, I would simply avoid telling it altogether, but there is simply no way for me to avoid it and tell the rest of the story without doing equally grave injustices.\nSo I will say this upfront. There are two narratives about Sam Cooke's death -- the official one, and a more conspiratorial one. Everything I know about the case tells me that the official account is the one that is actually correct, and *as far as I can tell*, I have good reason for thinking that way. But here's the thing. The other narrative is one that is he",
  "itunes:image": "",
  "image": {
    "url": "https://i0.wp.com/500songs.com/wp-content/uploads/2021/05/Sam-Cooke.jpg?fit=781%2C781&#038;ssl=1",
    "title": "Episode 122: &#8220;A Change is Gonna Come&#8221; by Sam Cooke"
  },
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 122 of A History of Rock Music in Five Hundred Songs is a double-length (over an hour) look at “A Change is Gonna Come” by Sam Cooke, at Cooke's political and artistic growth, and at the circumstances around his death. This one has a long list of content warnings at the beginning of the episode, for good reason...\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"My Guy\" by Mary Wells.\n \nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. For this episode, he also did the re-edit of the closing theme. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/ \n\nResources\nNo Mixcloud this week due to the number of songs by one artist.\nMy main source for this episode is Dream Boogie: The Triumph of Sam Cooke by Peter Guralnick. Like all Guralnick’s work, ",
  "googleplay:image": "",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}