{
  "title": "SC EP:627 I Put My Gun Up And Fired",
  "itunes:title": "SC EP:627 I Put My Gun Up And Fired",
  "pubDate": "Fri, 21 Feb 2020 20:13:27 +0000",
  "guid": "gid://art19-episode-locator/V0/paZYw-XUCLfKpl7A9rvTIP9buFTNkiAheIwwpznWbnQ",
  "link": "https://traffic.libsyn.com/secure/sasquatchchronicles/62720final_VERSIONZ.mp3",
  "itunes:image": "",
  "description": "<p>Dustin from Colorado writes, \"Two years ago my oldest daughter of 9 at the time keep begging me to take her bear hunting so I did and all we did is drive the side by side around because taking a 9 year old out and blowing on a call hoping to have a bear come at you at a dead run and hope your gun shoots true and the shot is effective and the dam thing don't get pissed and kill you is stupid with a 9 year old girl in tow.</p> <p> </p> <p>Well fast forward to last fall I had a big bear coming into the water hole I had sat at for a few days, but the timing never was right to fill my tag. My kid keep begging to go and being the mean dad I am I said no. so one day my kids where at my fokes house while I was working and my oldest went to my dad and told him she wanted to go out hunting tomorrow with me but I wouldn't let her and why is that papa. Well he told her it's not safe to take your kids at a younger age out predator hunting. Deer and elk hunting is safer but not bear and he told her this story that I had never heard until that evening but the strange thing is I have memories about some of it even before dad relayed it to me that day but we will find out why. When I was 5 years old it was still legal to bait in bear with bait barrels in Colorado so one afternoon dad was babysitting me his only kid at the time and mom was running late from work to relieve him so he could go hunting so he scooped me up and out we went now I can't tell you where he was hunting at the time due to me not asking. so anyways we get there, and he was just going to put the few pig heads in the barrel and head home and hit it first thing in the morning on his own. Well he walks me into the area, and he had a few of the pig heads with him he places them in the barrel, and he placed me down and said stay. so, he turned around to walk the 30 ish yards to the Honda 3-wheeler for the other pig heads. He only went 10 to 15 yards and I started screaming for him and he flipped around to find me hauling ass down to him. He scooped me up and walk back to the bait station to see what he told my daughter at the time was a bear running of in the timber. But later that night when I asked him about that story, he said I'm not going to lie to you son it was a f&%$#$% bigfoot walking off with the pig heads. It came up took the heads out of the barrel with you sitting 5 yards away. All I remember is seeing the pig heads and riding on the gas tank of the 3-wheeler and seeing a barrel not much before are after but he said the barrel was in a tree about 3 feet when we arrived and he had to pull it out of there and reset it. So there's my first experience with them. My dad has a few more very hair raising story's that he had years prier but they are his story's not mine and I will talk with him about sharing them with you over the phone. I have returned to those areas and had my own experiences also.</p> <p> </p> <p>My second one was in around spring of 2007 I was upriver ridding my four-wheeler and I was in this area where I could see down 300 to 400 yards below me into this meadow and there's a tree line and above the tree line is a road. Well I stopped and was sitting, and I looked down to that meadow with my binoculars to see a dark figure walking across the meadow towards the road. My first thought was holy shit moose but after further monitoring it. It was on two legs swinging its arms in a kind of way I've heard a few people on your show say crazy bag lady kind way only this thing looked like it was frolicking through the meadow like something on the little house on the prairie. So I'm not sure what I'm looking at then 2 dirt bikes come screaming down the road above the tree line and this critter turns towards my direction and starts running still on two legs then dropped to all four and it runs right to the timber line then does this barrel roll looking deal into the timber and was gone no smell no noise.</p> <p> </p> <p>I later ran into something else. I'll be honest with you Wes this was no bigfoot, but I don't want to say dog man I'm still on the fence with that critter. So its 2013 and myself and my wife are out shed hunting in one of my favorite places out in mule deer country north of my land in this place that I called slaughter gulch due to the unreal amount of dead deer you would find everywhere back then. Yes, the place is packed full of coyotes and mountain lions but you did find a lot of dead coyotes also at that time so anyways my wife and I where out. It was a beautiful day we had been walking all day with lots of luck well we got back to the four wheeler and she wasn't done so she took off walking up the draw nearby and I stayed at my machine I busted open a cold one and was sitting looking at our trophy's for the day so far and trying to think about where to head to next. Then straight Infront of me to the west I saw movement about 200 yards out in between two huge boulders so I put up my binoculars and could see a dark figure with points on top of its head that well looked like ears on a dog. I could kind of make out eyes and a noise so I pulled the binoculars down and look at it with my naked eye then put the binoculars back up and once I found it again with the binoculars its ear twitched and it turned its head to reveal and canine nose then looked back at me for a second and ran towards me on all fours a few feet then dropped into this huge wash in between it and me and that was the first and last I saw of it but to this day my wife will even tell you my attitude that day change bad for a few hours. I have never been as scared as the day I saw that. I mean one month later I got hurt at work and literally was staring death in the face for a few weeks and I was not as scared as that day not even with the encounters I have wrote so far. Going to continue to wright to you. There was no smell or sound to this one. I'm pretty sure its to blame for most the dead deer and dead coyotes. Because I have noticed a huge drop in the dead deer, I found out there and I continue to shed hunt out there never seen it again but have had other issues after that with my dog out there. But even to this day I avoid that area ill ride two miles out of my way up to the top and glass the bottom but I wont walk in there anymore.</p> <p> </p> <p>So fast forward to 2016 I have heard whoops out in the timber. I have smelt bad smells worse than a 3-week-old dead elk in July, kind of smells while bow hunting and bear hunting for years. So, I made buds with a coworker. I have never really felt like I could talk about the fury one's to anyone that would take me serious besides my dad and uncles and with them it was taboo to talk about the fury ones and there other native monsters. so, my new buddy and I worked the same shift's 7 on 7 off day's and night's and we got to talking one day when he saw one of my bigfoot book's laying on the seat of my company truck. So, he jumps in, He says to me, \"dude you believe in bigfoot,\" and I said ya if you laugh, I'll beat you into the gravel. He said no he believes to. So, after many weeks of talking about bigfoot with him, and him turning me on to your Facebook page. He goes out and buys a side by side and asked me to build it up for him, so I put some light bars on it a lift kit and a few other things. Once I was done with it, I called him to come get it. So, he came out and said lets ride tonight and hang out. So I took my four wheeler and he brought out this so called bad ass military guy who turned out to be fake he never served or even signed up to serve so anyway. We headed out upriver I think we put 25 miles on the machine's and stopped cooked some burgers and just BS for a few hours. Around 10 pm we headed to the pickups. There was a set of pond's that we stopped at on the way up and looked for bear track's earlier that day. when we started to approach the pond heading back I caught eye shine in my light bar then my machine dropped down a water bar in the road and once it came back up the eyes stood up and stayed. So my first thought was it must be a bear drinking then stood up, On his back legs to look at us. then it started running and the eyes stayed at around 6 plus ft high. and Wes bear cant run like that so boom its him!! The fury guy so I flipped around backwards on my four wheeler with it still rolling and started digging into my bag for my big spotlight once I get ahold of it the machine has come to a stop and my buddy rolls up next to me and said what's the deal bud. I look at him and said eye shine he said \"so\" I looked him dead in the face and said \"f#$%^& tall eye shine running\". he goes \"oh crap\" jumps out I have always carried my H&K USP 45 and that guy has way to many gun's to list I think he had a 40 on him that night so any way we go walking across the field and his tag along guy stayed at the side by side per my command. I didn't like nor trust him so me and my buddy keep walking spotlighting the trees and BOOM eyes peaking from behind a tree. You could see the hand's holding the tree, and this thing peaking around the tree. so, we are staring at it and it's staring at us then I hear the rack of a hand gun and I turn back and look at my buddy with his gun loaded and in position for action. I calmly but in a loud sort of way I say put it away and he says \"it's for protection,\" and I said his \"name\" PUT IT AWAY NOW!! so he does we look back in time to see a tall figure run deeper into the timber. We back up slow and get back onto the machines and head out my buddy claims that once he gets back to his machine his friend said what's the deal? He told him we just saw a bigfoot! and that dude melted down freaking out!! I went back up a few days later in the day light there's cattle tracks everywhere, so ground evidence was gone but I think I found the tree. If it was the right tree it would have had to of stood 8ft tall. I have a picture of a footprint in that location from a few years later. My dad told me that back in the mid 90's there was some small logging in that area and he had heard that there equipment was always getting messed with at night and strange noises could be heard in the later part of the day .There is a huge pile of logs that showed up in the middle of the meadow out of no where one day and some of the logs I cant even get my arms around them. I have pictures of the various log piles.</p> <p> </p> <p>My fifth, Is with my same coworker. We had been out multiple time's ridding with nothing to report so later that fall myself and my wife went camping in a different area up river and my coworker planed to show up later and stay for two nights. So, after 2 days and 2 nights of ridding and fishing and multiple nap's my buddy shows up later in the evening and talk's me and my wife to go for a night ride. So, we go out my wife him and I. I tell you what I about left the guy because every puddle/creek any kind of dirt we came to he had to find a way to avoided it he says he must keep his buggy clean. The only reason I bring it up is because it will be used later in this trip, so after hours of laying my coat in puddles for him to keep his shoes clean we get up to where I had my experience in 2007 my wife is the first to notice! The smell the worst I have ever smelled. So, we stop and sit a while and we hear a few tree knocks and very strange noses that left me very confused. I kind of wonder if it wasn't a hunting party there where grunts and some strange chines jibber talk. We headed back to camp about an hour after that I had a very uneasy felling in my gut that night. The next morning, we load up my four-wheeler and his side by side and head back up just to ride and after avoiding any kind of dirt/mud/bird poop, we get to the same location as the night before. I take them down into where it is. It's really nice country its full of elk and bear there's a huge creek that splits into 2 creek crossing's one after another. We cross that and sit in a spot that I use to camp years ago all the time. We eat lunch have a beer or two and right before we leave my buddy said hay can I shoot my shotgun here? I said do it! So, he kill's a tree reloads kills it again. We head out back to camp. After dinner and its dark. he pipes off and said, \"let's go back up and see if we can hear them noises.\" So, against by better judgment I load up my wife and we head up and as we are leap frogging mud puddles I'm getting this bad feeling just chewing at me and the further we get up there the harder the feeling chews at me. So yes, I want to hear them noises again I want answers but dangit I had my wife in tow, and even native Americans would say you keep girl's away from these big guys. In mid ride I stop my machine get off tell my buddy if we are doing this she goes back first. Something's bad and it has had a mouth full of me this whole ride so far. I'm not doing this, so we turn around and get to camp well he's not giving up so against my better judgment I leave my wife behind at the camper 20 miles away she's safe there. We load up in his side by side and after a hour of a bad feeling chewing on me and the pure boredom of riding with this guy who will not get dirt on his machine we get to the double creek crossing and right before we cross. A owl comes and lands in front of us on a branch across the first creek crossing and if you follow native American folk lore that could be good or bad sign. The one I follow that's a bad sign. We cross making sure we don't get any of that clean water on that machine. Right across the creek is where we stopped that day and he shot his gun, so we pull in turn around and parked on the road shut the buggy off and get out. I put a lantern on the toolbox in the bed of his machine he kind of wanders around for a minute. a few minutes go by and he said we should record just sitting here and I told him he's pissing in the wind. That creek is to loud and that's all it will pick up. so behind us the road come's down towards us at a angle and just to freak him out and get a laugh I told him to look up the road and he did, at the same time I said picture a monster running down that, at you! He responds with a \"F you pal.\" so I go to the front of the machine to relieve myself, he stayed at the opposite side of the machine at the back, talking to me so for the shits of it. I let out the best whoop I have ever done! and he cheered me on for it. So, all done I come back to my side of the rear of the machine to continue talking with him. A few minutes later in the conversation he lights up a cigarette and with that pause in the conversation comes this huge crack of a limb getting busted right behind us, about 30 yards both of our eyes get big. We sit for a bit and once we start talking again there is this huge thud right behind my buddy and he starts yelling, \"f this lets go.\" so we both jump into his machine and right before he takes off I shine my spotlight through the back of his buggy to see this huge dark figure with its arm's down. He punched the gas as we came to the creek crossing he never slowed down it was a wall of water on the buggy with both crossings and as we flew up the switch backs I had to tell him to calm down before he wrecks and send us back down the mountain to that things feet. The whole time out of there that goofy basterd was screaming there not supposed to be real and if they are real, they don't live here in Colorado. So, after that wild hairy ride hitting every puddle and lighting him 3 smokes he asked for another. I told him to stop and light one himself we are in the clear now! So, he stops and we are both really shook up. He lights a smoke and we head back to camp. The next day after he leaves I leave my wife back at camp so she can sun bathe and I fly up to that location for answers what I find is a big limb that both my hands couldn't reach around that was broke off at least 12ft up on the tree and a rock right next to the peal out marks of his buggy that I could barely roll let alone pick up there was no smell with this big guy. I'm willing to bet he was in there earlier that day when he was shooting and realized it was the same dumb rednecks that came back and that was his polite way of saying get the heck out.</p> <p> </p> <p>In the fall of 2018 I was with my same buddy and my youngest brother in-law and we headed up to where me and my buddy had are first experience together. well the forest service had done a lot of work up there on the ponds and one pond in particular had a lot going on there. Their was tracks witch I have pictures, there was a log thrown in the middle of the pond right after they finished digging it and my buddy is a big guy and him and my brother in-law couldn't pick it up we found the other end of the log and there was no drag marks just foot prints. so we get to a good look out and for a few hours its silent then around 8 pm the coyotes start going off all around then out of nowhere there's tree knocks and the worst deepest howling that completely shut the coyotes up. All I could say is it sounded like a wolf imitation but to me it sounded like a damn hell hound and the whole place goes silent and the same change happens to my brother in law he was almost brain washed quiet and he stayed that way even a few days later when he arrived home he just wouldn't talk but he's fine now.</p> <p> </p> <p>Last spring of 2019, Wes I'm not sure what this is but I will tell the Division Of Wildlife was even looking for this thing. There were dogs killed, goats and chickens this thing was seen in daylight just moseying around by multiple people even a D.O.W agent saw it so I was told. So I have a very nice flock of chickens and ducks well when one of my mallard hens took to hatching her second batch of chicks the first batch a weasel got to them days before they where to hatch well I think it was a weasel anyway she made a nest up in the oak brush in my back yard and she hid herself good so after a few weeks her and the eggs just up and disappeared no egg shells like before on the first attempt her and the eggs gone. A month after that my daughter, my same brother in law from the prev encounter and myself where heading out to shed horn hunt. My wife calls me to say there is a huge bobcat in our yard, so I told her to shoot it. So she runs out in the front of my house 22 mag in hand and my mom behind her on the phone talking to me. So when my mom and wife get to the front of the yard after locking up the livestock they see this thing disappear behind the rimrock wall that borders my land and my mom still on the phone says \"Dustin this isn't a bobcat or mountain lion \".My father is a taxidermist so mom knows what them critters look like. Once myself and my kid and brother in-law get home my wife tells me what she saw it was a tan cat thing with very long legs, no tail, very tall pointy ears but the strangest of them all it had a canine muzzle. I have security cameras around the house but of course it didn't catch that critter. So I set up a trail camera right at the horse water trough that my wife seen it at. So after three days of it being set up we took it down and the images where very hard to explain. It took video of me setting it up of course and my brother in-law testing it out and one of the ducks in the water trough but after that the only thing it videoed was me anytime I walked by it, it had me but not the ducks that swim in there all day long, I saw my kids dancing in front of it and the many deer and elk that we know drink from there hell we got them on my security camera drinking there but not on the game camera. Two days later myself and my brother in law where on my back wraparound porch talking about the next days shed hunting plans when just over his head on top of the rimrock wall under a cedar tree I could see this thing looking at us. So told him I would be right back and went inside grabbed my 223 rifle and stepped out to find it still in the same spot I put the gun up found it in the scope and oh god the face on it ugh I touched my gun off and we heard it hit and it jumped back but once we got up there to where I saw it all I found was blood I never found a body and there has not been anymore animal killings after that.\"</p>",
  "content:encoded": "<p>Dustin from Colorado writes, \"Two years ago my oldest daughter of 9 at the time keep begging me to take her bear hunting so I did and all we did is drive the side by side around because taking a 9 year old out and blowing on a call hoping to have a bear come at you at a dead run and hope your gun shoots true and the shot is effective and the dam thing don't get pissed and kill you is stupid with a 9 year old girl in tow.</p> <p> </p> <p>Well fast forward to last fall I had a big bear coming into the water hole I had sat at for a few days, but the timing never was right to fill my tag. My kid keep begging to go and being the mean dad I am I said no. so one day my kids where at my fokes house while I was working and my oldest went to my dad and told him she wanted to go out hunting tomorrow with me but I wouldn't let her and why is that papa. Well he told her it's not safe to take your kids at a younger age out predator hunting. Deer and elk hunting is safer but not bear and he told her this story that I had never heard until that evening but the strange thing is I have memories about some of it even before dad relayed it to me that day but we will find out why. When I was 5 years old it was still legal to bait in bear with bait barrels in Colorado so one afternoon dad was babysitting me his only kid at the time and mom was running late from work to relieve him so he could go hunting so he scooped me up and out we went now I can't tell you where he was hunting at the time due to me not asking. so anyways we get there, and he was just going to put the few pig heads in the barrel and head home and hit it first thing in the morning on his own. Well he walks me into the area, and he had a few of the pig heads with him he places them in the barrel, and he placed me down and said stay. so, he turned around to walk the 30 ish yards to the Honda 3-wheeler for the other pig heads. He only went 10 to 15 yards and I started screaming for him and he flipped around to find me hauling ass down to him. He scooped me up and walk back to the bait station to see what he told my daughter at the time was a bear running of in the timber. But later that night when I asked him about that story, he said I'm not going to lie to you son it was a f&%$#$% bigfoot walking off with the pig heads. It came up took the heads out of the barrel with you sitting 5 yards away. All I remember is seeing the pig heads and riding on the gas tank of the 3-wheeler and seeing a barrel not much before are after but he said the barrel was in a tree about 3 feet when we arrived and he had to pull it out of there and reset it. So there's my first experience with them. My dad has a few more very hair raising story's that he had years prier but they are his story's not mine and I will talk with him about sharing them with you over the phone. I have returned to those areas and had my own experiences also.</p> <p> </p> <p>My second one was in around spring of 2007 I was upriver ridding my four-wheeler and I was in this area where I could see down 300 to 400 yards below me into this meadow and there's a tree line and above the tree line is a road. Well I stopped and was sitting, and I looked down to that meadow with my binoculars to see a dark figure walking across the meadow towards the road. My first thought was holy shit moose but after further monitoring it. It was on two legs swinging its arms in a kind of way I've heard a few people on your show say crazy bag lady kind way only this thing looked like it was frolicking through the meadow like something on the little house on the prairie. So I'm not sure what I'm looking at then 2 dirt bikes come screaming down the road above the tree line and this critter turns towards my direction and starts running still on two legs then dropped to all four and it runs right to the timber line then does this barrel roll looking deal into the timber and was gone no smell no noise.</p> <p> </p> <p>I later ran into something else. I'll be honest with you Wes this was no bigfoot, but I don't want to say dog man I'm still on the fence with that critter. So its 2013 and myself and my wife are out shed hunting in one of my favorite places out in mule deer country north of my land in this place that I called slaughter gulch due to the unreal amount of dead deer you would find everywhere back then. Yes, the place is packed full of coyotes and mountain lions but you did find a lot of dead coyotes also at that time so anyways my wife and I where out. It was a beautiful day we had been walking all day with lots of luck well we got back to the four wheeler and she wasn't done so she took off walking up the draw nearby and I stayed at my machine I busted open a cold one and was sitting looking at our trophy's for the day so far and trying to think about where to head to next. Then straight Infront of me to the west I saw movement about 200 yards out in between two huge boulders so I put up my binoculars and could see a dark figure with points on top of its head that well looked like ears on a dog. I could kind of make out eyes and a noise so I pulled the binoculars down and look at it with my naked eye then put the binoculars back up and once I found it again with the binoculars its ear twitched and it turned its head to reveal and canine nose then looked back at me for a second and ran towards me on all fours a few feet then dropped into this huge wash in between it and me and that was the first and last I saw of it but to this day my wife will even tell you my attitude that day change bad for a few hours. I have never been as scared as the day I saw that. I mean one month later I got hurt at work and literally was staring death in the face for a few weeks and I was not as scared as that day not even with the encounters I have wrote so far. Going to continue to wright to you. There was no smell or sound to this one. I'm pretty sure its to blame for most the dead deer and dead coyotes. Because I have noticed a huge drop in the dead deer, I found out there and I continue to shed hunt out there never seen it again but have had other issues after that with my dog out there. But even to this day I avoid that area ill ride two miles out of my way up to the top and glass the bottom but I wont walk in there anymore.</p> <p> </p> <p>So fast forward to 2016 I have heard whoops out in the timber. I have smelt bad smells worse than a 3-week-old dead elk in July, kind of smells while bow hunting and bear hunting for years. So, I made buds with a coworker. I have never really felt like I could talk about the fury one's to anyone that would take me serious besides my dad and uncles and with them it was taboo to talk about the fury ones and there other native monsters. so, my new buddy and I worked the same shift's 7 on 7 off day's and night's and we got to talking one day when he saw one of my bigfoot book's laying on the seat of my company truck. So, he jumps in, He says to me, \"dude you believe in bigfoot,\" and I said ya if you laugh, I'll beat you into the gravel. He said no he believes to. So, after many weeks of talking about bigfoot with him, and him turning me on to your Facebook page. He goes out and buys a side by side and asked me to build it up for him, so I put some light bars on it a lift kit and a few other things. Once I was done with it, I called him to come get it. So, he came out and said lets ride tonight and hang out. So I took my four wheeler and he brought out this so called bad ass military guy who turned out to be fake he never served or even signed up to serve so anyway. We headed out upriver I think we put 25 miles on the machine's and stopped cooked some burgers and just BS for a few hours. Around 10 pm we headed to the pickups. There was a set of pond's that we stopped at on the way up and looked for bear track's earlier that day. when we started to approach the pond heading back I caught eye shine in my light bar then my machine dropped down a water bar in the road and once it came back up the eyes stood up and stayed. So my first thought was it must be a bear drinking then stood up, On his back legs to look at us. then it started running and the eyes stayed at around 6 plus ft high. and Wes bear cant run like that so boom its him!! The fury guy so I flipped around backwards on my four wheeler with it still rolling and started digging into my bag for my big spotlight once I get ahold of it the machine has come to a stop and my buddy rolls up next to me and said what's the deal bud. I look at him and said eye shine he said \"so\" I looked him dead in the face and said \"f#$%^& tall eye shine running\". he goes \"oh crap\" jumps out I have always carried my H&K USP 45 and that guy has way to many gun's to list I think he had a 40 on him that night so any way we go walking across the field and his tag along guy stayed at the side by side per my command. I didn't like nor trust him so me and my buddy keep walking spotlighting the trees and BOOM eyes peaking from behind a tree. You could see the hand's holding the tree, and this thing peaking around the tree. so, we are staring at it and it's staring at us then I hear the rack of a hand gun and I turn back and look at my buddy with his gun loaded and in position for action. I calmly but in a loud sort of way I say put it away and he says \"it's for protection,\" and I said his \"name\" PUT IT AWAY NOW!! so he does we look back in time to see a tall figure run deeper into the timber. We back up slow and get back onto the machines and head out my buddy claims that once he gets back to his machine his friend said what's the deal? He told him we just saw a bigfoot! and that dude melted down freaking out!! I went back up a few days later in the day light there's cattle tracks everywhere, so ground evidence was gone but I think I found the tree. If it was the right tree it would have had to of stood 8ft tall. I have a picture of a footprint in that location from a few years later. My dad told me that back in the mid 90's there was some small logging in that area and he had heard that there equipment was always getting messed with at night and strange noises could be heard in the later part of the day .There is a huge pile of logs that showed up in the middle of the meadow out of no where one day and some of the logs I cant even get my arms around them. I have pictures of the various log piles.</p> <p> </p> <p>My fifth, Is with my same coworker. We had been out multiple time's ridding with nothing to report so later that fall myself and my wife went camping in a different area up river and my coworker planed to show up later and stay for two nights. So, after 2 days and 2 nights of ridding and fishing and multiple nap's my buddy shows up later in the evening and talk's me and my wife to go for a night ride. So, we go out my wife him and I. I tell you what I about left the guy because every puddle/creek any kind of dirt we came to he had to find a way to avoided it he says he must keep his buggy clean. The only reason I bring it up is because it will be used later in this trip, so after hours of laying my coat in puddles for him to keep his shoes clean we get up to where I had my experience in 2007 my wife is the first to notice! The smell the worst I have ever smelled. So, we stop and sit a while and we hear a few tree knocks and very strange noses that left me very confused. I kind of wonder if it wasn't a hunting party there where grunts and some strange chines jibber talk. We headed back to camp about an hour after that I had a very uneasy felling in my gut that night. The next morning, we load up my four-wheeler and his side by side and head back up just to ride and after avoiding any kind of dirt/mud/bird poop, we get to the same location as the night before. I take them down into where it is. It's really nice country its full of elk and bear there's a huge creek that splits into 2 creek crossing's one after another. We cross that and sit in a spot that I use to camp years ago all the time. We eat lunch have a beer or two and right before we leave my buddy said hay can I shoot my shotgun here? I said do it! So, he kill's a tree reloads kills it again. We head out back to camp. After dinner and its dark. he pipes off and said, \"let's go back up and see if we can hear them noises.\" So, against by better judgment I load up my wife and we head up and as we are leap frogging mud puddles I'm getting this bad feeling just chewing at me and the further we get up there the harder the feeling chews at me. So yes, I want to hear them noises again I want answers but dangit I had my wife in tow, and even native Americans would say you keep girl's away from these big guys. In mid ride I stop my machine get off tell my buddy if we are doing this she goes back first. Something's bad and it has had a mouth full of me this whole ride so far. I'm not doing this, so we turn around and get to camp well he's not giving up so against my better judgment I leave my wife behind at the camper 20 miles away she's safe there. We load up in his side by side and after a hour of a bad feeling chewing on me and the pure boredom of riding with this guy who will not get dirt on his machine we get to the double creek crossing and right before we cross. A owl comes and lands in front of us on a branch across the first creek crossing and if you follow native American folk lore that could be good or bad sign. The one I follow that's a bad sign. We cross making sure we don't get any of that clean water on that machine. Right across the creek is where we stopped that day and he shot his gun, so we pull in turn around and parked on the road shut the buggy off and get out. I put a lantern on the toolbox in the bed of his machine he kind of wanders around for a minute. a few minutes go by and he said we should record just sitting here and I told him he's pissing in the wind. That creek is to loud and that's all it will pick up. so behind us the road come's down towards us at a angle and just to freak him out and get a laugh I told him to look up the road and he did, at the same time I said picture a monster running down that, at you! He responds with a \"F you pal.\" so I go to the front of the machine to relieve myself, he stayed at the opposite side of the machine at the back, talking to me so for the shits of it. I let out the best whoop I have ever done! and he cheered me on for it. So, all done I come back to my side of the rear of the machine to continue talking with him. A few minutes later in the conversation he lights up a cigarette and with that pause in the conversation comes this huge crack of a limb getting busted right behind us, about 30 yards both of our eyes get big. We sit for a bit and once we start talking again there is this huge thud right behind my buddy and he starts yelling, \"f this lets go.\" so we both jump into his machine and right before he takes off I shine my spotlight through the back of his buggy to see this huge dark figure with its arm's down. He punched the gas as we came to the creek crossing he never slowed down it was a wall of water on the buggy with both crossings and as we flew up the switch backs I had to tell him to calm down before he wrecks and send us back down the mountain to that things feet. The whole time out of there that goofy basterd was screaming there not supposed to be real and if they are real, they don't live here in Colorado. So, after that wild hairy ride hitting every puddle and lighting him 3 smokes he asked for another. I told him to stop and light one himself we are in the clear now! So, he stops and we are both really shook up. He lights a smoke and we head back to camp. The next day after he leaves I leave my wife back at camp so she can sun bathe and I fly up to that location for answers what I find is a big limb that both my hands couldn't reach around that was broke off at least 12ft up on the tree and a rock right next to the peal out marks of his buggy that I could barely roll let alone pick up there was no smell with this big guy. I'm willing to bet he was in there earlier that day when he was shooting and realized it was the same dumb rednecks that came back and that was his polite way of saying get the heck out.</p> <p> </p> <p>In the fall of 2018 I was with my same buddy and my youngest brother in-law and we headed up to where me and my buddy had are first experience together. well the forest service had done a lot of work up there on the ponds and one pond in particular had a lot going on there. Their was tracks witch I have pictures, there was a log thrown in the middle of the pond right after they finished digging it and my buddy is a big guy and him and my brother in-law couldn't pick it up we found the other end of the log and there was no drag marks just foot prints. so we get to a good look out and for a few hours its silent then around 8 pm the coyotes start going off all around then out of nowhere there's tree knocks and the worst deepest howling that completely shut the coyotes up. All I could say is it sounded like a wolf imitation but to me it sounded like a damn hell hound and the whole place goes silent and the same change happens to my brother in law he was almost brain washed quiet and he stayed that way even a few days later when he arrived home he just wouldn't talk but he's fine now.</p> <p> </p> <p>Last spring of 2019, Wes I'm not sure what this is but I will tell the Division Of Wildlife was even looking for this thing. There were dogs killed, goats and chickens this thing was seen in daylight just moseying around by multiple people even a D.O.W agent saw it so I was told. So I have a very nice flock of chickens and ducks well when one of my mallard hens took to hatching her second batch of chicks the first batch a weasel got to them days before they where to hatch well I think it was a weasel anyway she made a nest up in the oak brush in my back yard and she hid herself good so after a few weeks her and the eggs just up and disappeared no egg shells like before on the first attempt her and the eggs gone. A month after that my daughter, my same brother in law from the prev encounter and myself where heading out to shed horn hunt. My wife calls me to say there is a huge bobcat in our yard, so I told her to shoot it. So she runs out in the front of my house 22 mag in hand and my mom behind her on the phone talking to me. So when my mom and wife get to the front of the yard after locking up the livestock they see this thing disappear behind the rimrock wall that borders my land and my mom still on the phone says \"Dustin this isn't a bobcat or mountain lion \".My father is a taxidermist so mom knows what them critters look like. Once myself and my kid and brother in-law get home my wife tells me what she saw it was a tan cat thing with very long legs, no tail, very tall pointy ears but the strangest of them all it had a canine muzzle. I have security cameras around the house but of course it didn't catch that critter. So I set up a trail camera right at the horse water trough that my wife seen it at. So after three days of it being set up we took it down and the images where very hard to explain. It took video of me setting it up of course and my brother in-law testing it out and one of the ducks in the water trough but after that the only thing it videoed was me anytime I walked by it, it had me but not the ducks that swim in there all day long, I saw my kids dancing in front of it and the many deer and elk that we know drink from there hell we got them on my security camera drinking there but not on the game camera. Two days later myself and my brother in law where on my back wraparound porch talking about the next days shed hunting plans when just over his head on top of the rimrock wall under a cedar tree I could see this thing looking at us. So told him I would be right back and went inside grabbed my 223 rifle and stepped out to find it still in the same spot I put the gun up found it in the scope and oh god the face on it ugh I touched my gun off and we heard it hit and it jumped back but once we got up there to where I saw it all I found was blood I never found a body and there has not been anymore animal killings after that.\"</p>",
  "enclosure": "",
  "itunes:duration": "01:03:38",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "Dustin from Colorado writes, \"Two years ago my oldest daughter of 9 at the time keep begging me to take her bear hunting so I did and all we did is drive the side by side around because taking a 9 year old out and blowing on a call hoping to have a...",
  "itunes:episode": 627,
  "itunes:episodeType": "full"
}