{
  "title": "Do the FBI’s Crime Statistics Add Up?",
  "link": "https://www.aei.org/society-and-culture/do-the-fbis-crime-statistics-add-up/",
  "dc:creator": "George Pierson",
  "pubDate": "Thu, 03 Nov 2022 20:10:29 +0000",
  "category": [
    "Society and Culture",
    "Crime",
    "Department of Justice (DOJ)",
    "FBI",
    "Midterm elections"
  ],
  "guid": "https://www.aei.org/?p=1008664739",
  "description": "<p>Not-ready-for-prime-time national crime stats, of obviously dubious quality, released a month before a national election, will do little to enhance policing in our country.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/society-and-culture/do-the-fbis-crime-statistics-add-up/\">Do the FBI’s Crime Statistics Add Up?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Believe it or not, someone on the internet is now claiming that violent crime in America <em>fell</em> last year. Unfortunately, that “someone” happens to be the FBI—brandishing a new crime-count methodology, and telling the public, in effect, to ignore the evidence of its own senses.</p>\n\n\n\n<p>As more or less everyone in the United States today knows, crime is a hot button issue this election cycle—and for a reason. Next week a “red wave” stands to punish Democratic candidates across the country, not least because so many voters blame the Democrats for a nationwide decline in public safety since Team Blue took the White House and the Congress in 2020.</p>\n\n\n\n<p>Yet you would have no inkling of this—neither the problem itself, nor the public’s anxiety, much less the coming electoral backlash—from perusing Washington’s new official numbers on national crime trends. These data were released last month by the FBI and the Bureau of Justice Statistics (BJS) under their new “<a href=\"https://www.justice.gov/opa/blog/new-and-better-crime-data-nation\" target=\"_blank\" rel=\"noreferrer noopener\">National Incident Based Reporting System</a>” (NIBRS), which formally displaced their previous “Summary Reporting System” (SRS) at the beginning of 2021. According to these numbers, America did not suffer a crime wave in 2021. Quite the contrary: the FBI maintains that violent crime actually <em>fell</em> last year.</p>\n\n\n\n<p>True: the FBI’s NIBRS does acknowledge that murders rose in 2021—some 4 percent above 2020 levels, it says. Nevertheless, according to the purportedly improved methodology about which Justice Department officials boast, the US enjoyed a 1 percent overall decline in violent crime between 2020 and 2021.</p>\n\n\n\n<p>How did the Feds manage to get their crime assessment for America—even the direction of the arrow—so laugh-out-loud wrong? A closer look reveals some of the awkward details.</p>\n\n\n\n<p>Transition to exclusive NIBRS collection as of January 1, 2021 was <a href=\"https://ucr.fbi.gov/nibrs/2015\" target=\"_blank\" rel=\"noreferrer noopener\">announced</a> in 2015. But unsurprisingly, more detailed data collection is time consuming and expensive. Many jurisdictions have thus far declined to join in the NIBRS. Consequently, despite <a href=\"https://www.axios.com/2022/06/14/fbi-crime-data-2021-police-reporting-failures#:~:text=Worth%20noting%3A%20Law%20enforcement%20agencies%20nationwide%20have%20received%20over%20%24160%20million%20in%20federal%20funding%20to%20help%20with%20the%20transition%20since%20the%20switch%20to%20NIBRS%20was%20announced%20in%202015.\" target=\"_blank\" rel=\"noreferrer noopener\">significant funding</a> of transition efforts and FBI <a href=\"https://www.fbi.gov/news/stories/five-things-to-know-about-nibrs-112520#:~:text=In%202021%2C%20the%20FBI%20expects%2075%25%20of%20law%20enforcement%20agencies%20to%20have%20moved%20to%20NIBRS.%20Those%20departments%20serve%20more%20than%2080%25%20of%20the%20U.S.%20population.\" target=\"_blank\" rel=\"noreferrer noopener\">expectations</a> of 80+ percent population coverage for the 2021 NIBRS data, as late as June 2022, <a href=\"https://bjs.ojp.gov/national-incident-based-reporting-system-nibrs#:~:text=66%25%20of%20the%20U.S.%20population%20is%20covered%20by%20NIBRS%2Dreporting%20law%20enforcement%20agencies\" target=\"_blank\" rel=\"noreferrer noopener\">only 66 percent</a> of the population was covered.</p>\n\n\n\n<p>For 2021, almost half of the country’s 18,000 law enforcement agencies <a href=\"https://edition.cnn.com/2022/10/05/us/fbi-national-crime-report-2021-data\" target=\"_blank\" rel=\"noreferrer noopener\">reportedly failed</a> to provide data for the entire calendar year. But the Feds, who seemed to feel duty bound to use an instrument that was clearly incapable of offering a comprehensive picture of national crime for that year, stubbornly went ahead and used it anyway.</p>\n\n\n\n<p>To do so they had to fill in big gaps: including almost all of California and New York State. They had to “approximate” missing data with so-called “<a href=\"https://www.fbi.gov/news/stories/five-things-to-know-about-nibrs-112520#:~:text=advanced%20methodologies%20to%20estimate%20national%20crime%20statistics%20when%20a%20particular%20state%20or%20locality%20doesn%E2%80%99t%20provide%20data\" target=\"_blank\" rel=\"noreferrer noopener\">advanced methodologies</a>”: in a manner that was not only opaque, but at times bizarre.</p>\n\n\n\n<p>Somehow, for example, NIBRS came up with <a href=\"https://crime-data-explorer.app.cloud.gov/pages/explorer/crime/nibrs-estimation\" target=\"_blank\" rel=\"noreferrer noopener\">violent crime estimates</a> for New York State that implied 2021 levels were less than a third of what the SRS <a href=\"https://crime-data-explorer.app.cloud.gov/pages/downloads#additionalDownloads\" target=\"_blank\" rel=\"noreferrer noopener\">reported for 2020</a> (and barely a quarter of <a href=\"https://www.criminaljustice.ny.gov/crimnet/ojsa/stats.htm\" target=\"_blank\" rel=\"noreferrer noopener\">NY State’s own numbers</a> for 2021).</p>\n\n\n\n<p>Really? If the NIBRS’ New York 2021 “advanced methodology” crime numbers were correct, Governor Kathy Hochul would not be fighting for her political life at this writing.</p>\n\n\n\n<p>We cannot tell from NIBRS what the true crime trend has been in America since the Biden administration came to office. But we can get some sense of how far off their numbers may be by comparing state-level figures for the old SRS in 2020 and the new NIBRS in 2021. [SEE FIGURE 1]</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"1191\" height=\"746\" src=\"https://www.aei.org/wp-content/uploads/2022/11/Eberstadt-11-3-chart.jpg?x91208\" alt=\"\" class=\"wp-image-1008664783\"/></figure>\n\n\n\n<p>Holding other states’ NIBRS levels constant, if New York’s violent crime were at the level estimated by the state, that alone would indicate a national <strong><u>3 percent increase</u></strong> over the FBI’s NIBRS 2020 estimates of violent crime and a <strong><u>4 percent increase</u></strong> over the 2020 SRS estimates. If Illinois numbers (derived from the NIBRS estimates for the Midwest and its component states) were in line with the past five years of SRS data, that would add another percentage point to the 2021 violent crime growth rate versus the national SRS 2020 numbers.</p>\n\n\n\n<p>Other soundings likewise point to a 2021 NIBRS underestimate of violent crime in America.</p>\n\n\n\n<p>A few weeks ago, a CDC team, relying upon National Vital Statistics System mortality data, <a href=\"https://www.cdc.gov/mmwr/volumes/71/wr/mm7140a4.htm\" target=\"_blank\" rel=\"noreferrer noopener\">estimated</a> that US 2021 firearm homicides were over 8 percent higher in 2021 than in 2020—a magnitude that cannot be reconciled with NIBRS’ estimate of a 4 percent increase in murders by all weapons. And an inconvenient <a href=\"https://bjs.ojp.gov/sites/g/files/xyckuh236/files/media/document/ncvsnibrscpc21.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">BJS study</a>, also released last month, shows that the National Crime Victimization Survey registered an <em>increase</em> in the rate of violent crime of almost 5 percent in 2021.</p>\n\n\n\n<p>National crime stats of obviously dubious quality, released a month before a national election, will do little to enhance policing in our country. Nor are they likely to raise public confidence in an FBI whose reputation for political impartiality has come increasingly into question recently.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/articles/a-nation-of-quitters/\">A Nation of Quitters</a> | <a href=\"https://www.aei.org/articles/americas-education-crisis-as-a-national-security-threat/\">America’s Education Crisis as a National Security Threat</a> | <a href=\"https://www.aei.org/articles/americas-education-crisis-is-a-national-security-threat/\">America’s Education Crisis Is a National Security Threat</a> | <a href=\"https://www.aei.org/op-eds/whats-behind-the-flight-from-work-in-post-pandemic-america/\">What’s Behind the Flight from Work in Post-Pandemic America</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/society-and-culture/do-the-fbis-crime-statistics-add-up/\">Do the FBI’s Crime Statistics Add Up?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}