{
  "title": "Drinking Through the Unfree World with Ben Powell",
  "pubDate": "Sat, 27 Jul 2019 16:54:06 +0000",
  "guid": "48c7229bc4fa468eb20f30754e303c18",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP128Powell_EDR.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Socialism-Sucks-Economists-Through-Unfree/dp/162157945X/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=f57f4adf768057ef3cd79b76adf3561a&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=162157945X&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=162157945X\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Ben Powell joins the podcast today to discuss his new book, <a href=\"https://amzn.to/2SJhp0K\" target=\"_blank\" rel= \"noopener\">Socialism Sucks: Two Economists Drink Their Way Through the Unfree World</a>, coauthored with Robert Lawson.</p> <p>The book is a combination of economic analysis and Anthony-Bourdain-style travel diary.</p> <blockquote>Do We Have to Say It Again? Socialism Sucks!<br /> <br /> Apparently we do. Because today millions of Americans—young and old—are flocking to the socialist banner and chanting, “What do we want? Socialism—the economic system that has impoverished people everywhere and resulted in the deaths of tens of millions! And when do we want it? Now!”<br /> <br /> Really?<br /> <br /> Most people seem somehow to have missed Economics 101 and don’t understand that socialism isn’t nice, cuddly government that takes care of everything for you so that you can remain an adolescent forever. No, we’ve seen it tried over and over again with catastrophic consequences.<br /> <br /> Luckily, two semi-sober economists have toured the socialist world so you don’t have to. And they’ve come back with this stunning report: Socialism Sucks!</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/Socialism-Sucks-Economists-Through-Unfree/dp/162157945X/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=f57f4adf768057ef3cd79b76adf3561a&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Ben Powell joins the podcast today to discuss his new book, <a href=\"https://amzn.to/2SJhp0K\" target=\"_blank\" rel= \"noopener\">Socialism Sucks: Two Economists Drink Their Way Through the Unfree World</a>, coauthored with Robert Lawson.</p> <p>The book is a combination of economic analysis and Anthony-Bourdain-style travel diary.</p> Do We Have to Say It Again? Socialism Sucks!  Apparently we do. Because today millions of Americans—young and old—are flocking to the socialist banner and chanting, “What do we want? Socialism—the economic system that has impoverished people everywhere and resulted in the deaths of tens of millions! And when do we want it? Now!”  Really?  Most people seem somehow to have missed Economics 101 and don’t understand that socialism isn’t nice, cuddly government that takes care of everything for you so that you can remain an adolescent forever. No, we’ve seen it tried over and over again with catastrophic consequences.  Luckily, two semi-sober economists have toured the socialist world so you don’t have to. And they’ve come back with this stunning report: Socialism Sucks! ",
  "enclosure": "",
  "itunes:duration": "57:41",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Ben Powell joins the podcast today to discuss his new book, , coauthored with Robert Lawson. The book is a combination of economic analysis and Anthony-Bourdain-style travel diary. Do We Have to Say It Again? Socialism Sucks!  Apparently we do....",
  "itunes:episode": 128,
  "itunes:episodeType": "full"
}