{
  "title": "Six easy ways to run your Jupyter Notebook in the cloud",
  "description": "Comparing free services for running an interactive Jupyter Notebook in the cloud: Binder, Kaggle Kernels, Google Colab, Azure Notebooks, CoCalc, Datalore.",
  "link": "https://www.dataschool.io/cloud-services-for-jupyter-notebook/",
  "guid": "5c9a46e56d982f00c0ce994c",
  "category": "Python",
  "dc:creator": "Kevin Markham",
  "pubDate": "Thu, 28 Mar 2019 14:09:00 GMT",
  "media:content": "",
  "content:encoded": "<!--kg-card-begin: markdown--><img src=\"https://www.dataschool.io/content/images/2019/03/binder-50-1.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\"><p>There are many ways to share a <strong>static Jupyter notebook</strong> with others, such as posting it on GitHub or sharing an nbviewer link. However, the recipient can only interact with the notebook file if they already have the Jupyter Notebook environment installed.</p>\n<p>But what if you want to share a <strong>fully interactive Jupyter notebook</strong> that doesn't require any installation? Or, you want to create your own Jupyter notebooks without installing anything on your local machine?</p>\n<p>In this post, I'm going to review six services you can use to <strong>easily run your Jupyter notebook in the cloud</strong>. All of them have the following characteristics:</p>\n<ul>\n<li>They don't require you to install anything on your local machine.</li>\n<li>They are completely free (or they have a free plan).</li>\n<li>They give you access to the Jupyter Notebook environment (or a Jupyter-like environment).</li>\n<li>They allow you to import and export notebooks using the standard .ipynb file format.</li>\n<li>They support the Python language (and most support other languages as well).</li>\n</ul>\n<p>Since all of these are cloud-based services, none of them will work for you if you are restricted to working with your data on-premise.</p>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"tableofcontents\">Table of Contents</h2>\n<ul>\n<li><a href=\"#criteriaforcomparison\">Criteria for comparison</a></li>\n<li><strong>In-depth reviews:</strong>\n<ol>\n<li><a href=\"#1binder\">Binder</a></li>\n<li><a href=\"#2kagglekernels\">Kaggle Kernels</a></li>\n<li><a href=\"#3googlecolaboratorycolab\">Google Colaboratory (Colab)</a></li>\n<li><a href=\"#4microsoftazurenotebooks\">Microsoft Azure Notebooks</a></li>\n<li><a href=\"#5cocalc\">CoCalc</a></li>\n<li><a href=\"#6datalore\">Datalore</a></li>\n</ol>\n</li>\n<li><a href=\"#howtochoosetherightserviceforyou\">How to choose the right service for you</a></li>\n<li><a href=\"#similarserviceswhichwerenotreviewed\">Similar services which were not reviewed</a></li>\n<li><a href=\"#myfactcheckingprocess\">My fact-checking process</a></li>\n</ul>\n<p><strong>Note:</strong> If you just want a quick summary, check out the <a href=\"https://docs.google.com/spreadsheets/d/12thaaXg1Idr3iWST8QyASNDs08sjdPd6m9mbCGtHFn0/edit?usp=sharing\">comparison table</a>.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"criteriaforcomparison\">Criteria for comparison</h2>\n<p>Here are the criteria on which I compared each of the six services:</p>\n<p><strong>Supported languages:</strong> Does this service support any programming languages other than Python?</p>\n<p><strong>Ability to install packages:</strong> Does this service allow you to install additional packages (or a particular version of a package), beyond the ones that are already installed?</p>\n<p><strong>Interface similarity:</strong> If the service provides a \"Jupyter-like\" interface (rather than the native Jupyter interface), how similar is its interface to Jupyter? (This makes it easier for existing Jupyter users to transition to this service.)</p>\n<p><strong>Keyboard shortcuts:</strong> Does this service use the same keyboard shortcuts as the Jupyter Notebook?</p>\n<p><strong>Missing features:</strong> Is there anything that the Jupyter Notebook can do that this service does not support?</p>\n<p><strong>Added features:</strong> Is there anything this service can do that the Jupyter Notebook does not support?</p>\n<p><strong>Ease of working with datasets:</strong> How easy does this service make it to work with your own datasets?</p>\n<p><strong>Internet access:</strong> Does this service give you Internet access from within the Notebook, so that you can read data from URLs when necessary?</p>\n<p><strong>Ability to work privately:</strong> Does this service allow you to keep your work private?</p>\n<p><strong>Ability to share publicly:</strong> Does this service provide a way for you to share your work publicly?</p>\n<p><strong>Ability to collaborate:</strong> Does this service allow you to invite someone to collaborate on a notebook, and can the collaboration occur in real-time?</p>\n<p><strong>Performance of the free plan:</strong> What computational resources (RAM and CPU) does this service provide? Does it give you access to a GPU (which is useful for deep learning)? How much disk space is included? How long can a session run?</p>\n<p><strong>Ability to upgrade for better performance:</strong> Can you pay for this service in order to access more computational resources?</p>\n<p><strong>Documentation and technical support:</strong> Is the service well-documented? Can you get in touch with someone if you run into a problem?</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"1binder\">1. Binder</h2>\n<div align=\"center\">\n<p><img src=\"https://www.dataschool.io/content/images/2019/03/binder-50.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\" loading=\"lazy\"></p>\n</div>\n<p><a href=\"https://mybinder.org/\">Binder</a> is a service provided by the Binder Project, which is a member of the Project Jupyter open source ecosystem. It allows you to input the URL of any public Git repository, and it will open that repository within the native Jupyter Notebook interface. You can run any notebooks in the repository, though any changes you make will not be saved back to the repository. You don't have to create an account with Binder and you don't need to be the owner of the repository, though the repository must include a configuration file that specifies its package requirements.</p>\n<p><strong>Supported languages:</strong> Python (2 and 3), R, Julia, and any other languages <a href=\"https://github.com/jupyter/jupyter/wiki/Jupyter-kernels\">supported by Jupyter</a>.</p>\n<p><strong>Ability to install packages:</strong> You can specify your exact package requirements using a <a href=\"https://mybinder.readthedocs.io/en/latest/using/config_files.html\">configuration file</a> (such as <code>environment.yml</code> or <code>requirements.txt</code>).</p>\n<p><strong>Interface similarity:</strong> Binder uses the native Jupyter Notebook interface.</p>\n<p><strong>Keyboard shortcuts:</strong> Binder uses all of the same keyboard shortcuts as Jupyter.</p>\n<p><strong>Missing features:</strong> None.</p>\n<p><strong>Added features:</strong> None.</p>\n<p><strong>Ease of working with datasets:</strong> If your dataset is in the same Git repository, then it will automatically be available within Binder. If your dataset is not in that repository but is available at any public URL, then you can add a <a href=\"https://github.com/binder-examples/getting-data\">special file</a> to the repository telling Binder to download your dataset. However, Binder does not support accessing private datasets.</p>\n<p><strong>Internet access:</strong> Yes.</p>\n<p><strong>Ability to work privately:</strong> No, since it only works with public Git repositories.</p>\n<p><strong>Ability to share publicly:</strong> Yes. You can share a URL that goes directly to <a href=\"https://mybinder.org/v2/gh/justmarkham/pycon-2018-tutorial/master?filepath=tutorial.ipynb\">your Binder</a>, or someone can run your notebooks using the Binder website (as long as they know the URL of your Git repository).</p>\n<p><strong>Ability to collaborate:</strong> No. If you want to work with someone on the same notebook and your repository is hosted on GitHub, then you can instead use the normal pull request workflow.</p>\n<p><strong>Performance of the free plan:</strong> You will have access to up to 2 GB of RAM. There is no specific limit to the amount of disk space, though they ask you not to include \"very large files\" (more than a few hundred megabytes). Binder can be <a href=\"https://mybinder.readthedocs.io/en/latest/about/user-guidelines.html#what-factors-influence-how-long-it-takes-a-binder-session-to-start\">slow to launch</a>, especially when it's run on a newly updated repository. Sessions will shut down after 20 minutes of inactivity, though they can run for 12 hours or longer. Binder has other <a href=\"https://mybinder.readthedocs.io/en/latest/about/user-guidelines.html\">usage guidelines</a>, including a limit of 100 simultaneous users for any given repository.</p>\n<p><strong>Ability to upgrade for better performance:</strong> No. However, you do have the option of setting up your own <a href=\"https://binderhub.readthedocs.io/en/latest/\">BinderHub</a> deployment, which can provide the same functionality as Binder while allowing you to customize the environment (such as increasing the computational resources or allowing private files).</p>\n<p><strong>Documentation and technical support:</strong> Binder has extensive <a href=\"https://mybinder.readthedocs.io/en/latest/\">documentation</a>. Community support is available via <a href=\"https://gitter.im/jupyterhub/binder\">Gitter chat</a> and a <a href=\"https://discourse.jupyter.org/\">Discourse forum</a>, and product issues are tracked on <a href=\"https://github.com/jupyterhub/binderhub/issues\">GitHub</a>.</p>\n<p><strong>Conclusion:</strong> If your notebooks are already stored in a public GitHub repository, Binder is the easiest way to enable others to interact with them. Users don't have to create an account, and they'll feel right at home if they already know how to use the Jupyter Notebook. However, you'll want to keep the performance limitations and user limits in mind!</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"2kagglekernels\">2. Kaggle Kernels</h2>\n<div align=\"center\">\n<p><img src=\"https://www.dataschool.io/content/images/2019/03/kaggle-kernels-50.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\" loading=\"lazy\"></p>\n</div>\n<p><a href=\"https://www.kaggle.com/\">Kaggle</a> is best known as a platform for data science competitions. However, they also provide a free service called <a href=\"https://www.kaggle.com/kernels\">Kernels</a> that can be used independently of their competitions. After creating a Kaggle account (or logging in with Google or Facebook), you can create a Kernel that uses either a notebook or scripting interface, though I'm focusing on the notebook interface below.</p>\n<p><strong>Supported languages:</strong> Python (3 only) and R.</p>\n<p><strong>Ability to install packages:</strong> <a href=\"https://github.com/Kaggle/docker-python\">Hundreds of packages</a> come pre-installed, and you can <a href=\"https://www.kaggle.com/docs/notebooks#modifying-a-notebook-specific-environment\">install additional packages</a> using pip or by specifying the GitHub repository of a package. However, any additional packages you install will need to be reinstalled at the start of every session. Alternatively, you can ask Kaggle to include additional packages in their default installation.</p>\n<p><strong>Interface similarity:</strong> Visually, the Kernels interface looks quite different from the Jupyter interface. There's no menu bar or toolbar at the top of the screen, there's a collapsible sidebar on the right for adjusting settings, and there's a console docked below the notebook. However, working in the Kernels notebook actually feels very similar to working in the Jupyter Notebook, especially if you're comfortable with Jupyter's keyboard shortcuts. Also, note that a <a href=\"https://www.kaggle.com/product-feedback/83336\">redesigned interface</a> (shown in the screenshot above) will soon be released, which is more similar to the Jupyter interface and includes a simple menu bar.</p>\n<p><strong>Keyboard shortcuts:</strong> Kernels uses all of the same keyboard shortcuts as Jupyter.</p>\n<p><strong>Missing features:</strong></p>\n<ul>\n<li>Because Kernels doesn't (yet) include a menu bar or a toolbar, many actions can only be done using keyboard shortcuts or the command palette.</li>\n<li>You can't download your notebook into other useful formats such as a Python script, HTML webpage, or Markdown file.</li>\n</ul>\n<p><strong>Added features:</strong></p>\n<ul>\n<li>Kernels includes a lightweight version control system. Every time you want to save your work, there's a \"commit\" button which runs the entire notebook from top to bottom and adds a new version to the history. (You can keep working while this process takes place, which is essential for long-running notebooks.) Although you can't name the versions, you can display the \"diff\" between any two versions.</li>\n<li>Kernels allows you to selectively hide the input and/or output of any code cell, which makes it easy to customize the presentation of your notebook.</li>\n</ul>\n<p><strong>Ease of working with datasets:</strong> You can upload a dataset to Kaggle from your local computer, a URL, or a <a href=\"https://www.kaggle.com/product-feedback/77211\">GitHub repository</a>, and it will be hosted for free by another Kaggle service called <a href=\"https://www.kaggle.com/datasets\">Datasets</a>. You can make the dataset private or public. Any dataset you upload, as well as any public dataset uploaded by a Kaggle user, can be accessed by any of your Kernels. The maximum size of each dataset is 20 GB, and a single Kernel can access multiple datasets.</p>\n<p><strong>Internet access:</strong> Yes.</p>\n<p><strong>Ability to work privately:</strong> Yes.</p>\n<p><strong>Ability to share publicly:</strong> Yes. If you choose to make your Kernel <a href=\"https://www.kaggle.com/justmarkham/tutorial\">public</a>, anyone can access it without creating a Kaggle account, and anyone with a Kaggle account can comment on your Kernel or copy it to their own account. Additionally, Kaggle also provides you with a <a href=\"https://www.kaggle.com/justmarkham\">public profile page</a>, which displays all of your public Kernels and datasets.</p>\n<p><strong>Ability to collaborate:</strong> Yes. You can keep your Kernel private but invite specific Kaggle users to view or edit it. There's no real-time collaboration: It's more like working on separate copies of the Kernel, except that all commits are added to the same version history.</p>\n<p><strong>Performance of the free plan:</strong> You can access either a 4-core CPU with 17 GB of RAM, or a 2-core CPU with 14 GB of RAM plus a <a href=\"https://www.kaggle.com/dansbecker/running-kaggle-kernels-with-a-gpu\">GPU</a>. You will have 5 GB of \"saved\" disk space and 17 GB of \"temporary\" disk space, though any disk space used by your dataset does not count towards these figures. Sessions will shut down after 60 minutes of inactivity, though they can run for up to 9 hours.</p>\n<p><strong>Ability to upgrade for better performance:</strong> No.</p>\n<p><strong>Documentation and technical support:</strong> Kernels has adequate <a href=\"https://www.kaggle.com/docs/notebooks\">documentation</a>. Support is available via a <a href=\"https://www.kaggle.com/contact\">contact form</a> and a <a href=\"https://www.kaggle.com/product-feedback\">forum</a>.</p>\n<p><strong>Conclusion:</strong> As long as you're comfortable with a slightly cluttered interface (which has already been improved in the <a href=\"https://www.kaggle.com/product-feedback/83336\">redesign</a>), you'll have access to a high-performance environment in which it's easy to work with your datasets and share your work publicly (or keep it private). The included version control and collaboration features are also nice additions, though neither are fully-featured.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"3googlecolaboratorycolab\">3. Google Colaboratory (Colab)</h2>\n<div align=\"center\">\n<p><img src=\"https://www.dataschool.io/content/images/2019/03/google-colab-50.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\" loading=\"lazy\"></p>\n</div>\n<p><a href=\"https://colab.research.google.com/\">Google Colaboratory</a>, usually referred to as \"Google Colab,\" is available to anyone with a Google account. As long as you are signed into Google, you can quickly get started by creating an empty notebook, uploading an existing notebook, or importing a notebook from any public GitHub repository. Your Colab notebooks are automatically saved in a special folder in your Google Drive, and you can even create new notebooks directly from Drive.</p>\n<p><strong>Supported languages:</strong> Python (2 and 3) and <a href=\"https://github.com/tensorflow/swift/blob/master/Usage.md\">Swift</a> (which was added in January 2019). Kernels can also be installed for other languages, though the installation process varies by language and is not well-documented.</p>\n<p><strong>Ability to install packages:</strong> Hundreds of packages come pre-installed, and you can <a href=\"https://colab.research.google.com/notebooks/snippets/importing_libraries.ipynb\">install additional packages</a> using pip. However, any additional packages you install will need to be reinstalled at the start of every session.</p>\n<p><strong>Interface similarity:</strong> Visually, the Colab interface looks quite similar to the Jupyter interface. However, working in Colab actually feels very dissimilar to working in the Jupyter Notebook:</p>\n<ul>\n<li>Most of the menu items are different.</li>\n<li>Colab has changed some of the standard terminology (\"runtime\" instead of \"kernel\", \"text cell\" instead of \"markdown cell\", etc.)</li>\n<li>Colab has invented new concepts that you have to understand, such as \"playground mode.\"</li>\n<li>Command mode and Edit mode in Colab work differently than they do in Jupyter.</li>\n</ul>\n<p><strong>Keyboard shortcuts:</strong> In Colab, most of the single letter keyboard shortcuts used by Jupyter (such as \"a\" to \"insert cell above\") have been changed to a multi-step process (\"Ctrl+m\" followed by \"a\"), though Colab does allow you to customize the shortcuts.</p>\n<p><strong>Missing features:</strong></p>\n<ul>\n<li>Because the Colab menu bar is missing some items and the toolbar is kept very simple, some actions can only be done using keyboard shortcuts.</li>\n<li>You can't download your notebook into other useful formats such as an HTML webpage or Markdown file (though you can download it as a Python script).</li>\n</ul>\n<p><strong>Added features:</strong></p>\n<ul>\n<li>Colab includes a lightweight version control system. It frequently saves the current state of your notebook, and you can browse through the revision history. However, you can't display the \"diff\" between versions, which means that you would have to do any comparisons manually.</li>\n<li>Colab allows you to add <a href=\"https://colab.research.google.com/notebooks/forms.ipynb\">form fields</a> to your notebook, which enables you to parameterize your code in an interactive way. However, these fields only work within Colab.</li>\n<li>When you create a section heading in your notebook, Colab makes every section collapsible and automatically creates a \"table of contents\" in the sidebar, which makes large notebooks easier to navigate.</li>\n</ul>\n<p><strong>Ease of working with datasets:</strong> You can upload a dataset to use within a Colab notebook, but it will automatically be deleted once you end your session. Alternatively, you can allow Colab to read files from your Google Drive, though it's <a href=\"https://colab.research.google.com/notebooks/snippets/drive.ipynb\">more complicated</a> than it should be. Colab also includes <a href=\"https://colab.research.google.com/notebooks/io.ipynb\">connectors</a> to other Google services, such as Google Sheets and Google Cloud Storage.</p>\n<p><strong>Internet access:</strong> Yes.</p>\n<p><strong>Ability to work privately:</strong> Yes.</p>\n<p><strong>Ability to share publicly:</strong> Yes. If you choose to make your notebook <a href=\"https://colab.research.google.com/drive/1CLkPLk_nkGXxBnAXEPi26g19wjOCYoLg\">public</a> and you share the link, anyone can access it without creating a Google account, and anyone with a Google account can copy it to their own account. Additionally, you can authorize Colab to save a copy of your notebook to GitHub or Gist and then share it from there.</p>\n<p><strong>Ability to collaborate:</strong> Yes. You can keep your notebook private but invite specific people to view or edit it (using Google's familiar sharing interface). You and your collaborator(s) can edit the notebook and see each other's changes, as well as add comments for each other (similar to Google Docs). However, your edits are not visible to your collaborators in real-time (there's a delay of up to 30 seconds), and there's a potential for your edits to get lost if multiple people are editing the notebook at the same time. Also, you are not actually sharing your environment with your collaborators (meaning there is no syncing of what code has been run), which significantly limits the usefulness of the collaboration functionality.</p>\n<p><strong>Performance of the free plan:</strong> Colab does give you access to a <a href=\"https://colab.research.google.com/notebooks/gpu.ipynb\">GPU</a> or a <a href=\"https://colab.research.google.com/notebooks/tpu.ipynb\">TPU</a>. Otherwise, Google does not provide any specifications for their environments. If you connect Colab to Google Drive, that will give you up to 15 GB of disk space for storing your datasets. Sessions will shut down after 60 minutes of inactivity, though they can run for up to 12 hours.</p>\n<p><strong>Ability to upgrade for better performance:</strong> No. However, you do have the option of <a href=\"https://research.google.com/colaboratory/local-runtimes.html\">connecting to a local runtime</a>, which allows you to execute code on your local hardware and access your local file system.</p>\n<p><strong>Documentation and technical support:</strong> Colab has minimal documentation, which is contained within an <a href=\"https://research.google.com/colaboratory/faq.html\">FAQ page</a> and a variety of <a href=\"https://colab.research.google.com/notebooks/welcome.ipynb\">sample notebooks</a>. Support is available via <a href=\"https://github.com/googlecolab/colabtools/issues\">GitHub issues</a>, and community support is available via <a href=\"https://stackoverflow.com/questions/tagged/google-colaboratory\">Stack Overflow</a>.</p>\n<p><strong>Conclusion:</strong> The greatest strength of Colab is that it's easy to get started, since most people already have a Google account, and it's easy to share notebooks, since the sharing functionality works the same as Google Docs. However, the cumbersome keyboard shortcuts and the difficulty of working with datasets are significant drawbacks. The ability to collaborate on the same notebook is useful, but less useful than it could be since you're not sharing an environment and you can't collaborate in real-time.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"4microsoftazurenotebooks\">4. Microsoft Azure Notebooks</h2>\n<div align=\"center\">\n<p><img src=\"https://www.dataschool.io/content/images/2019/03/azure-notebooks-50.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\" loading=\"lazy\"></p>\n</div>\n<p>To get started with <a href=\"https://notebooks.azure.com/\">Azure Notebooks</a>, you first sign in with a Microsoft or Outlook account (or create one). The next step is to create a \"project\", which is structured identically to a GitHub repository: it can contain one or more notebooks, Markdown files, datasets, and any other file you want to create or upload, and all of these can be organized into folders. Also like GitHub, you can initialize a project with a README file, which will automatically be displayed on the project page. If your work is already stored on GitHub, you can import the entire repository directly into a project.</p>\n<p><strong>Supported languages:</strong> Python (2 and 3), R, and F#.</p>\n<p><strong>Ability to install packages:</strong> Hundreds of packages come pre-installed, you can <a href=\"https://docs.microsoft.com/en-us/azure/notebooks/install-packages-jupyter-notebook\">install additional packages</a> using pip or conda, and you can specify your exact package requirements using a <a href=\"https://docs.microsoft.com/en-us/azure/notebooks/quickstart-create-jupyter-notebook-project-environment\">configuration file</a> (such as <code>environment.yml</code> or <code>requirements.txt</code>).</p>\n<p><strong>Interface similarity:</strong> Azure uses the native Jupyter Notebook interface.</p>\n<p><strong>Keyboard shortcuts:</strong> Azure uses all of the same keyboard shortcuts as Jupyter.</p>\n<p><strong>Missing features:</strong> None.</p>\n<p><strong>Added features:</strong></p>\n<ul>\n<li>The <a href=\"https://rise.readthedocs.io/\">RISE</a> extension comes pre-installed, which allows you to instantly <a href=\"https://docs.microsoft.com/en-us/azure/notebooks/present-jupyter-notebooks-slideshow\">present your notebook</a> as a live reveal.js-based slideshow.</li>\n<li>The <a href=\"https://jupyter-contrib-nbextensions.readthedocs.io/\">jupyter_contrib_nbextensions</a> package comes pre-installed, which gives you easy access to a collection of 50+ Jupyter Notebook extensions for enhancing the notebook interface.</li>\n</ul>\n<p><strong>Ease of working with datasets:</strong> You can upload a dataset to your project from your local computer or a URL, and it can be accessed by any notebook within your project. Azure also includes <a href=\"https://docs.microsoft.com/en-us/azure/notebooks/access-data-resources-jupyter-notebooks\">connectors</a> to other Azure services, such as Azure Storage and various Azure databases.</p>\n<p><strong>Internet access:</strong> Yes.</p>\n<p><strong>Ability to work privately:</strong> Yes.</p>\n<p><strong>Ability to share publicly:</strong> Yes. If you choose to make your project public, anyone can access it without creating a Microsoft account, and anyone with a Microsoft account can copy it to their own account. Additionally, Azure also provides you with a public profile page (very similar to a GitHub profile), which displays all of your public projects.</p>\n<p><strong>Ability to collaborate:</strong> No, though this is a planned feature.</p>\n<p><strong>Performance of the free plan:</strong> You will have access to 4 GB of RAM and 1 GB of disk space (per project). Sessions will shut down after 60 minutes of inactivity, though they can run for 8 hours or longer.</p>\n<p><strong>Ability to upgrade for better performance:</strong> Yes. You can pay for an <a href=\"https://azure.microsoft.com/en-us/free/\">Azure subscription</a>, though the <a href=\"https://docs.microsoft.com/en-us/azure/notebooks/configure-manage-azure-notebooks-projects\">setup process</a> is non-trivial and the <a href=\"https://azure.microsoft.com/en-us/pricing/details/virtual-machines/linux/\">pricing</a> is complicated.</p>\n<p><strong>Documentation and technical support:</strong> Azure has extensive <a href=\"https://docs.microsoft.com/en-us/azure/notebooks/\">documentation</a>. Support is available via GitHub issues.</p>\n<p><strong>Conclusion:</strong> The greatest strength of Azure Notebooks is its ease of use: the project structure (borrowed from GitHub) makes it simple to work with multiple notebooks and datasets, and the use of the native Jupyter interface means that existing Jupyter users will have an easy transition. However, the RAM and disk space are not particularly generous, and the lack of collaboration is a big gap in the functionality.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"5cocalc\">5. CoCalc</h2>\n<div align=\"center\">\n<p><img src=\"https://www.dataschool.io/content/images/2019/03/cocalc-50.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\" loading=\"lazy\"></p>\n</div>\n<p><a href=\"https://cocalc.com/\">CoCalc</a>, short for \"collaborative calculation\", is an online workspace for computation in Python, R, Julia, and many other languages. It allows you to create and edit Jupyter Notebooks, Sage worksheets, and LaTeX documents. After creating a CoCalc account, the first step is to create a \"project\", which can contain one or more notebooks, Markdown files, datasets, and any other file you want to create or upload, and all of these can be organized into folders. The project interface is a bit overwhelming at first, but it looks much more familiar once you create or open a notebook.</p>\n<p><strong>Supported languages:</strong> Python (2 and 3), R, Julia, and many other languages.</p>\n<p><strong>Ability to install packages:</strong> <a href=\"https://cocalc.com/doc/software-python.html\">Hundreds of packages</a> come pre-installed. You can <a href=\"https://doc.cocalc.com/howto/install-python-lib.html\">install additional packages</a> using pip, but this is not available when using a free plan. Alternatively, you can ask CoCalc to include additional packages in their default installation.</p>\n<p><strong>Interface similarity:</strong> Although CoCalc does not use the native Jupyter Notebook interface (they rewrote it using React.js), the interface is very similar to Jupyter, with only a few minor modifications. You can actually <a href=\"https://doc.cocalc.com/jupyter.html#classical-versus-cocalc\">switch</a> to using the native Jupyter Notebook from within CoCalc, though it's not recommended since you would lose access to the most valuable CoCalc features (\"time travel\" and real-time collaboration, which are discussed below).</p>\n<p><strong>Keyboard shortcuts:</strong> CoCalc uses almost all of the same keyboard shortcuts as Jupyter.</p>\n<p><strong>Missing features:</strong> None.</p>\n<p><strong>Added features:</strong></p>\n<ul>\n<li>CoCalc includes a powerful version control feature called <a href=\"https://cocalc.com/doc/jupyter-notebook.html#a-timetravel\">time travel</a>, which records all of your changes to the notebook in fine detail, and allows you to browse those changes using an intuitive slider control.</li>\n<li>CoCalc saves a backup of all of your project files every few minutes, which means you can recover older versions of your files if needed.</li>\n<li>CoCalc includes <a href=\"https://doc.cocalc.com/teaching-instructors.html\">additional features for instructors</a>, such as the ability to distribute and grade assignments, and the ability to watch students while they work and chat with them about the assignment.</li>\n</ul>\n<p><strong>Ease of working with datasets:</strong> You can upload a dataset to your project from your local computer, and it can be accessed by any notebook within your project.</p>\n<p><strong>Internet access:</strong> No, this is not available when using a free plan.</p>\n<p><strong>Ability to work privately:</strong> Yes.</p>\n<p><strong>Ability to share publicly:</strong> Yes. If you choose to make your notebook public and you share the link, anyone can access it without creating a CoCalc account, and anyone with a CoCalc account can copy it to their own account.</p>\n<p><strong>Ability to collaborate:</strong> Yes. You can keep your notebook private but invite specific people to edit it. You and your collaborator(s) can edit the notebook at the same time and see each other's changes (and cursors) in real-time, as well as chat (using text or video) in a window next to the notebook. The status and the results of all computations are also synchronized, which means that everyone involved will experience the notebook in the same way.</p>\n<p><strong>Performance of the free plan:</strong> You will have access to a 1-core shared CPU with 1 GB of shared RAM, and 3 GB of disk space (per project). Sessions will shut down after 30 minutes of inactivity, though they can run for up to 24 hours.</p>\n<p><strong>Ability to upgrade for better performance:</strong> Yes. You can pay for a <a href=\"https://cocalc.com/policies/pricing.html\">CoCalc subscription</a>, which starts at $14/month. Alternatively, you can install the <a href=\"https://github.com/sagemathinc/cocalc-docker\">CoCalc Docker image</a> on your own computer, which allows you to run a private multi-user CoCalc server for free.</p>\n<p><strong>Documentation and technical support:</strong> CoCalc has extensive <a href=\"https://doc.cocalc.com/\">documentation</a>. Support is available via email and a contact form, and product issues are tracked on <a href=\"https://github.com/sagemathinc/cocalc/issues?q=is%3Aopen+is%3Aissue+label%3AA-jupyter\">GitHub</a>.</p>\n<p><strong>Conclusion:</strong> The most compelling reasons to use CoCalc are the real-time collaboration and the \"time travel\" version control features, as well as the course management features (if you're an instructor). Although the interface is a bit cluttered, existing Jupyter users would have a relatively easy time transitioning to CoCalc. However, the free plan does have some important limitations (inability to install additional packages or access the Internet), and the performance of the free plan is modest.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"6datalore\">6. Datalore</h2>\n<div align=\"center\">\n<p><img src=\"https://www.dataschool.io/content/images/2019/03/datalore-50.png\" alt=\"Six easy ways to run your Jupyter Notebook in the cloud\" loading=\"lazy\"></p>\n</div>\n<p><a href=\"https://datalore.io/\">Datalore</a> was created by JetBrains, the same company who makes PyCharm (a popular Python IDE). Getting started is as easy as creating an account, or logging in with a Google or JetBrains account. You can either create a new Datalore \"workbook\" or upload an existing Jupyter Notebook. Datalore workbooks are stored in a proprietary format, though it does support importing and exporting the standard .ipynb file format.</p>\n<p><strong>Supported languages:</strong> Python 3 only.</p>\n<p><strong>Ability to install packages:</strong> Hundreds of packages come pre-installed, and you can install additional packages using pip or conda, or by specifying the GitHub repository of a package.</p>\n<p><strong>Interface similarity:</strong> When you open Datalore, the interface does resemble a Jupyter Notebook in the sense that there are code and Markdown cells as well as output below those cells. However, there are some important differences between the Datalore and Jupyter interfaces:</p>\n<ul>\n<li>Cells (which Datalore calls \"blocks\") are not numbered, because the ordering of cells is enforced. In other words, all of your code must be written in the order in which you ultimately want it to run.</li>\n<li>The notebook (which Datalore calls a \"workbook\") can have multiple worksheets, similar to Google Sheets, which is a convenient way to break long workbooks into logical sections. If you create multiple worksheets in a workbook, all of the worksheets share the same environment. Because cell order is important in Datalore, the cells in the second worksheet are treated as coming after the cells in the first worksheet, the third worksheet comes after the second worksheet, and so on.</li>\n<li>There are many other interface differences, which are explained in the \"added features\" section.</li>\n</ul>\n<p><strong>Keyboard shortcuts:</strong> Keyboard shortcuts are available for most actions in Datalore, but the shortcuts are wildly different from those used by Jupyter.</p>\n<p><strong>Missing features:</strong></p>\n<ul>\n<li>Datalore does not use the IPython kernel, and thus IPython magic functions and shell commands are not available. (However, optional access to the IPython kernel is a planned feature.)</li>\n<li>Because the Datalore menu bar is kept very simple and there's no toolbar, many actions can only be done using keyboard shortcuts.</li>\n<li>You can't download your workbook into other useful formats such as a Python script, HTML webpage, or Markdown file.</li>\n<li>Datalore does not support all of the commonly supported Markdown features in its Markdown cells. (However, improved Markdown support is a planned feature.)</li>\n<li>Datalore does not support interactive widgets.</li>\n<li>Datalore does not include multicursor support.</li>\n</ul>\n<p><strong>Added features:</strong></p>\n<ul>\n<li>Cells are automatically run as you write them, which Datalore calls \"live computation\". This actually makes it easier to debug code as you write it, since you can see the results of your code immediately. (Live computation can be disabled, in which case you can manually trigger cells to run.)</li>\n<li>Because cells will always run in the order in which they are arranged, Datalore can track cell dependencies. This means that when a given cell is edited, Datalore will determine which cells below it are potentially affected and will immediately re-run those cells (assuming live computation is enabled). If the edit causes an error in a dependent cell, those errors will immediately be flagged.</li>\n<li>Datalore allows you to display cell inputs and outputs sequentially (like in Jupyter) or in \"split view\", in which case the inputs and outputs are in two separate panes. When using sequential view, Datalore also makes it easy to hide all inputs or hide all outputs.</li>\n<li>Datalore includes more \"intelligence\" than Jupyter in its code completion.</li>\n<li>As you write code, Datalore provides context-aware suggestions (called \"intentions\") for which actions you might want to take. For example, after typing the name of a DataFrame, the intentions might include \"drop string columns\", \"histogram\", and \"train test split\". When you click an intention, Datalore actually generates the code for you, which can be a useful way to learn the code behind certain tasks.</li>\n<li>Datalore includes a well-designed version control system. It frequently saves the current state of your workbook, and you can quickly browse the diffs between the current version and any past versions. You can also choose to add a message when saving the workbook, and then filter the list of versions to only include those versions with a message.</li>\n<li>Datalore gives you access to a plotting library called datalore.plot, which is very similar to R's ggplot2, though you can only use it inside of Datalore.</li>\n</ul>\n<p><strong>Ease of working with datasets:</strong> You can upload a dataset to your workbook from your local computer or a URL, but it can only be accessed by that particular workbook. This would be a significant annoyance if you work with the same dataset(s) across many workbooks. (However, sharing datasets between workbooks is a planned feature.)</p>\n<p><strong>Internet access:</strong> Yes.</p>\n<p><strong>Ability to work privately:</strong> Yes.</p>\n<p><strong>Ability to share publicly:</strong> No.</p>\n<p><strong>Ability to collaborate:</strong> Yes. You can keep your workbook private but invite specific people to view or edit it. You and your collaborator(s) can edit the notebook at the same time and see each other's changes (and cursors) in real-time. The status and the results of all computations are also synchronized, which means that everyone involved will experience the notebook in the same way.</p>\n<p><strong>Performance of the free plan:</strong> You will have access to a 2-core CPU with 4 GB of RAM, and 10 GB of disk space. Sessions will shut down after 60 minutes of inactivity, though there is no specific limit on the length of individual sessions. You can use the service for up to 120 hours per month.</p>\n<p><strong>Ability to upgrade for better performance:</strong> No, though there will soon be a paid plan which offers more disk space and a more powerful CPU (or GPU).</p>\n<p><strong>Documentation and technical support:</strong> Datalore has minimal documentation, which is contained within sample workbooks. Support is available via a <a href=\"https://forum.datalore.io/\">Discourse forum</a>.</p>\n<p><strong>Conclusion:</strong> Rather than being an adaptation of the Jupyter Notebook, Datalore is more like a reinvention of the Notebook. It includes an innovative feature set, including live computation, dependency tracking, real-time collaboration, and built-in version control. However, existing Jupyter users may have a challenging time transitioning to Datalore, especially since cell ordering is enforced and all of the keyboard shortcuts are quite different. As well, Datalore currently includes some notable limitations, namely that workbooks can't be shared publicly and uploaded datasets can't be shared between workbooks.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"howtochoosetherightserviceforyou\">How to choose the right service for you</h2>\n<p>Out of the six options presented, there's not one clear \"winner\". Instead, the right choice for you will depend on your priorities. Below are my suggestions for what you should choose, based on your particular needs. (Note: You can also view this as a <a href=\"https://docs.google.com/spreadsheets/d/12thaaXg1Idr3iWST8QyASNDs08sjdPd6m9mbCGtHFn0/edit?usp=sharing\">comparison table</a>.)</p>\n<p><strong>You use a language other than Python:</strong> Binder and CoCalc support tons of languages. Azure supports Python, R and F#, Kernels supports Python and R, Colab supports Python and Swift, and Datalore only supports Python.</p>\n<p><strong>You need to use Python 2:</strong> Binder, Colab, Azure, and CoCalc all support Python 2 and 3, whereas Kernels and Datalore only support Python 3.</p>\n<p><strong>You work with non-standard packages:</strong> Binder and Azure allow you to specify your exact package requirements using a configuration file. CoCalc and Datalore allow you to install additional packages, which will persist across sessions, though this is not available with CoCalc's free plan. Kernels and Colab also allow you to install additional packages, though they do not persist across sessions. Kernels and CoCalc accept user requests for which packages should be included in their default installation.</p>\n<p><strong>You love the existing Jupyter Notebook interface:</strong> Binder and Azure use the native Jupyter Notebook interface, and CoCalc uses a nearly identical interface. Kernels is visually different from Jupyter but works like it, whereas Colab is visually similar to Jupyter but does not work like it. Datalore is the furthest from the existing Jupyter Notebook.</p>\n<p><strong>You are a heavy user of keyboard shortcuts:</strong> Binder, Kernels, and Azure use the same keyboard shortcuts as Jupyter, and CoCalc uses almost all of the same shortcuts. Datalore uses completely different keyboard shortcuts, and Colab uses cumbersome multi-step keyboard shortcuts (though they can be customized).</p>\n<p><strong>You prefer a point-and-click interface:</strong> Binder, Azure, and CoCalc allow you to perform all actions by pointing and clicking, whereas Kernels, Colab, and Datalore require you to use keyboard shortcuts for certain actions.</p>\n<p><strong>You want an integrated version control system:</strong> CoCalc and Datalore provide the best interfaces for version control. Kaggle's version control system is more limited, and Colab's system is even more limited. Binder and Azure do not provide a version control system.</p>\n<p><strong>You work with a lot of datasets:</strong> Kernels works seamlessly with Kaggle Datasets, a full-featured (and free) service for hosting datasets of up to 20 GB each. CoCalc offers 3 GB of disk space per project, and any dataset you upload can be accessed by any notebook in your project. Azure has similar functionality, except it offers 1 GB of disk space per project. Datalore offers 10 GB of total disk space, though every dataset you upload has to be linked to a particular workbook. Colab will discard any datasets you upload when your session ends, unless you link Colab to your Google Drive. Binder is best for small datasets that are either stored in your Git repository or located at a public URL.</p>\n<p><strong>Your project is already hosted on GitHub:</strong> Binder can run your notebooks directly from GitHub, Azure will allow you to import an entire GitHub repository, and Colab can import a single notebook from GitHub. Kernels, CoCalc, and Datalore don't provide any similar functionality.</p>\n<p><strong>You need to keep your work private:</strong> All of the options except for Binder support working in private.</p>\n<p><strong>You need to keep your data on-premise:</strong> None of these cloud-based services allow you to keep your data on-premise. However, you can set up Binder or CoCalc on your own server, since BinderHub and the CoCalc Docker image are both open source, which would allow you to keep your data on-premise.</p>\n<p><strong>You want to share your work publicly:</strong> Binder creates the least friction possible when sharing, since people can view and run your notebook without creating an account. Kernels, Colab, Azure, and CoCalc allow you to share a URL for read-only access, while requiring users to create an account if they want to run your notebook. Kernels and Azure make sharing even easier by providing you with a public profile page. Datalore does not allow for public sharing.</p>\n<p><strong>You need to collaborate with others:</strong> CoCalc and Datalore support real-time collaboration. Colab supports collaborating on the same document, though it's not in real-time and you're not sharing the same environment. Kernels supports a form of collaboration in which you're sharing a version history. Binder and Azure don't include any collaboration functionality, though with Binder it could easily occur through the normal GitHub pull request workflow.</p>\n<p><strong>You want a high performance environment:</strong> Kernels provides the most powerful environment (4-core CPU and 17 GB RAM), followed by Datalore (2-core CPU and 4 GB RAM), Azure (4 GB RAM), Binder (up to 2 GB RAM), and CoCalc (1-core CPU and 1 GB RAM). Colab does not provide specifications for its environment.</p>\n<p><strong>You need access to a GPU:</strong> Kernels and Colab both provide free access to a GPU. GPU access is available to paying customers of Azure and (soon) Datalore. GPU access is not available through Binder or CoCalc.</p>\n<p><strong>You prefer to use a non-commercial tool:</strong> Binder is the only option that is managed by a non-commercial entity.</p>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"similarserviceswhichwerenotreviewed\">Similar services which were not reviewed</h2>\n<p>The following services are similar to the six options above, but were not included in my comparison:</p>\n<ul>\n<li>I didn't include any service that only provides access to JupyterLab, such as <a href=\"https://notebooks.ai/\">Notebooks AI</a>, <a href=\"http://kyso.io/\">Kyso</a>, and <a href=\"https://learning.cyverse.org/what_is_cyverse/\">CyVerse</a>. (Note that Binder, Azure, and CoCalc all allow you to use JupyterLab instead of Jupyter Notebook if you prefer.)</li>\n<li>I didn't include <a href=\"https://www.ibm.com/cloud/watson-studio\">IBM Watson Studio Cloud</a> because the process of getting started is cumbersome, the interface is overly complicated, the free plan has lots of limitations, and there were lots of error messages during my testing.</li>\n<li>I didn't include <a href=\"https://codeocean.com/\">Code Ocean</a> because the free plan is severely limited without an academic email address.</li>\n<li>I didn't include <a href=\"https://www.zepl.com/\">ZEPL</a> because it doesn't allow you to export notebooks using the standard .ipynb format.</li>\n<li>I didn't include any paid services, such as <a href=\"https://www.saturncloud.io/\">Saturn Cloud</a>, <a href=\"https://www.crestle.ai/\">Crestle.ai</a>, and <a href=\"https://www.paperspace.com/\">Paperspace</a>.</li>\n</ul>\n<hr>\n<!--kg-card-end: markdown--><!--kg-card-begin: markdown--><h2 id=\"myfactcheckingprocess\">My fact-checking process</h2>\n<p>This article is the result of 50+ hours of research, testing, and writing. In addition, I shared drafts of this article with the relevant teams from Binder, Kaggle, Google, Microsoft, CoCalc, and Datalore in March 2019. I received detailed feedback from all six companies/organizations (thank you!), which I incorporated into the article before publishing.</p>\n<p>That being said, these services are constantly changing, and it's likely that some of this information will become outdated in the future. If you believe that something in this article is no longer correct, please leave a comment below, and I'd be happy to consider updating the article.</p>\n<p><strong>Updated 5/17/2019:</strong> CoCalc now supports interactive widgets. Clarified the limitations of Google Colab's collaboration functionality.</p>\n<script async data-uid=\"d6d0f53c0f\" src=\"https://dataschool.ck.page/d6d0f53c0f/index.js\"></script>\n<!--\n\n**P.S.** Want to master the Jupyter Notebook? [Subscribe to the Data School newsletter](https://www.dataschool.io/subscribe/) to find out when my new course launches!\n\n<blockquote class=\"twitter-tweet\" data-cards=\"hidden\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">NEW POST: Six easy ways to run your Jupyter Notebook in the cloud <br><br> <a href=\"https://t.co/mCq6gYlIPl\">https://t.co/mCq6gYlIPl</a> <br><br>In-depth comparison of <a href=\"https://twitter.com/mybinderteam?ref_src=twsrc%5Etfw\">@mybinderteam</a>, <a href=\"https://twitter.com/kaggle?ref_src=twsrc%5Etfw\">@kaggle</a> Kernels, <a href=\"https://twitter.com/GoogleColab?ref_src=twsrc%5Etfw\">@GoogleColab</a>, <a href=\"https://twitter.com/AzureNotebooks?ref_src=twsrc%5Etfw\">@AzureNotebooks</a>, <a href=\"https://twitter.com/cocalc_com?ref_src=twsrc%5Etfw\">@cocalc_com</a>, <a href=\"https://twitter.com/DataloreJB?ref_src=twsrc%5Etfw\">@DataloreJB</a><br><br>Comparison table: <a href=\"https://t.co/oToRsYCfQD\">https://t.co/oToRsYCfQD</a><a href=\"https://twitter.com/hashtag/Python?src=hash&ref_src=twsrc%5Etfw\">#Python</a> <a href=\"https://twitter.com/hashtag/DataScience?src=hash&ref_src=twsrc%5Etfw\">#DataScience</a> <a href=\"https://t.co/oC4JqFuPCk\">pic.twitter.com/oC4JqFuPCk</a></p>&mdash; Kevin Markham (@justmarkham) <a href=\"https://twitter.com/justmarkham/status/1111293316895789056?ref_src=twsrc%5Etfw\">March 28, 2019</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n--><!--kg-card-end: markdown-->"
}