{
  "title": "The Haunted Ma Barker House | Grave Talks Preview",
  "link": "https://audioboom.com/posts/8103694",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 957,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The Ma Barker House is a product of the criminal dark times of the depression and prohibition. It’s storied history links it back to the Barker criminal family of the time. Criminal activity including bank robberies, kidnapping, and other traumatic events was inflicted on those who crossed the Barker family's path the wrong way. Eventually, the FBI would catch up to the gang, ending in the carnage. It would be known as the largest FBI shoot out in history, holding that title to this day. What exactly happened after the dramatic shoot-out? What is the full story of the Ma Barker House, and do the Barkers still reside there today? Today we talk with Kristy Summer of <a href=\"http://soulsistersparanormal.com/\">SoulSistersParanormal.com</a> to find out.<br>\n<br>\n\n</div>\n<div>In part two of our interview on the Ma Barker House, we ask Kristy of Soul Sisters Paranormal:  <br>\n<br>\n\n</div>\n<div>Is the land where the house once stood haunted? <br>\n<br>\n\n</div>\n<div>What went through Kristy and her fellow investigator's mind when they heard the voices of the Bakers begin to talk about the shoot out that happened more than 80 years ago. <br>\n<br>\n\n</div>\n<div>Is the house haunted by the residual energy of a tragic night? Or, do the intelligent spirits of this crime family still live in the Ma Maker House to this day? <br>\n<br>\n\n</div>\n<div>Does anyone besides the spirits of the Barkers reside in the house today? <br>\n<br>\n\n</div>\n<div>Is there anything that seems to bring the spirits of the Barkers out of the shadows? <br>\n<br>\n\n</div>\n<div>Do you think the Barkers have a message they want to get across to people today? <br>\n<br>\n\n</div>\n<div>To listen to part 2 of our interview, become a Grave Keeper at <a href=\"http://www.patreon.com/thegravetalks\">http://www.patreon.com/thegravetalks</a> </div>\n",
  "pubDate": "Thu, 30 Jun 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-06-16:/posts/8103694",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}