{
  "title": "How Ulta Beauty manages holiday surges and supports year-round innovation",
  "link": "https://cloud.google.com/blog/topics/partners/how-ulta-beauty-uses-google-cloud-and-mongodb-atlas-to-power-innovation/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>As we enter the holiday season, retailers are working behind the scenes to ensure they can provide the best experiences for customers, in store and online. Challenges in retail do not begin or end during the holiday season as sudden shifts in customer preferences, supply chain nuances, and overall demand ebbs and flows take place year round and retailers must be prepared to adapt swiftly. </p><p>Google Cloud’s retail customers globally, in total, saw <a href=\"https://cloud.google.com/blog/transform/2022-holiday-shopping-season-technology-tips\">more online traffic in the first six months of 2022 than all of 2019</a>. This year, retailers can expect an early launch to holiday shopping activities, as <a href=\"https://www.thinkwithgoogle.com/consumer-insights/consumer-journey/prepare-for-seasonal-marketing-and-shopping/\" target=\"_blank\">50% of consumers</a> plan to start purchasing goods before the traditional Black Friday kick-off.  </p><p>The very same improvements made to automate and improve retail infrastructure can prepare it for holiday surges and support year-round innovation. Let’s take a look at how Ulta Beauty, the largest beauty retailer in the U.S., is partnering with Google Cloud, MongoDB Atlas, commercetools, and HCLTech to cover these two areas and more. </p><h3>Architecting for innovation</h3><p>Creating personalized shopping experiences in stores and online is key to Ulta Beauty’s success. This commitment is best demonstrated through Ulta Beauty’s <a href=\"https://www.ulta.com/innovation/experiences.html\" target=\"_blank\">Virtual Beauty Advisor.</a> Built on Google Cloud, this tool enhances shoppers’ experiences with personalized recommendations in addition to the ability to try on makeup virtually with GLAMLab.</p></div></div><div class=\"block-video\"><div class=\"article-module article-video \"><figure><a class=\"h-c-video h-c-video--marquee\" data-glue-modal-disabled-on-mobile=\"true\" data-glue-modal-trigger=\"uni-modal-4AF1VBlC0zI-\" href=\"https://youtube.com/watch?v=4AF1VBlC0zI\"><img alt=\"Ulta Beauty, the largest beauty products retailer in the United States, is using Google Cloud products to capture data and insights faster to meet customer expectations. Dive into the video to learn more on their story.\" src=\"//img.youtube.com/vi/4AF1VBlC0zI/maxresdefault.jpg\"/><svg class=\"h-c-video__play h-c-icon h-c-icon--color-white\" role=\"img\"><use xlink:href=\"#mi-youtube-icon\"></use></svg></a></figure></div><div class=\"h-c-modal--video\" data-glue-modal=\"uni-modal-4AF1VBlC0zI-\" data-glue-modal-close-label=\"Close Dialog\"><a class=\"glue-yt-video\" data-glue-yt-video-autoplay=\"true\" data-glue-yt-video-height=\"99%\" data-glue-yt-video-vid=\"4AF1VBlC0zI\" data-glue-yt-video-width=\"100%\" href=\"https://youtube.com/watch?v=4AF1VBlC0zI\" ng-cloak=\"\"></a></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>As innovators in support of the best possible guest experience, Ulta Beauty needed to re-architect its infrastructure for greater agility and stability. </p><p>To start, Ulta Beauty chose to use <a href=\"https://cloud.google.com/kubernetes-engine\">Google Kubernetes Engine (GKE)</a> as the backbone and orchestrator to build and deploy cloud-native applications. The Google Cloud deployments coincided with an organizational move from end-to-end application development to one that focuses on individual features, specific modules, and micro-applications.</p><p>This strategic change allowed Ulta Beauty to fix bugs, experiment with new offerings, and drive customer experiences faster and more efficiently. Thanks to the transformation and GKE, Ulta Beauty’s developer team now accelerates time to market for new products and services, and delivers new ways to engage with customers more quickly. These efforts all ladder to create ‘WOW’ experiences for the retailers’ guests who have emotional and personal connections to beauty and wellness. They can now discover and experience products that are served to them based on individual preferences. </p><p>Adapting to the new environment comes with its own set of challenges. “Microservices are not a silver bullet,” says Sethu Madhav Vure, IT Architect, Ulta Beauty. “For Ulta Beauty, the biggest challenge was how to break up a monolithic environment into multiple applications. We had to evolve our core systems—without impacting today’s services—and address what was needed for the future.”</p><p>Google Cloud partner HCLTech provided expert guidance throughout the re-architecting process, defining the solution blueprint and cloud-native deployment architecture through cross-functional workshops. HCLTech then assisted with the actual migration and platform setup, paving the way for fully automated, continuous integration and continuous delivery (CI/CD) pipelines to support faster rollouts and deployment architecture to drive higher availability and scalability.</p></div></div><div class=\"block-aside\"><dl><dt>aside_block</dt><dd>[StructValue([(u'title', u'Omnichannel never looked so good'), (u'body', &lt;wagtail.wagtailcore.rich_text.RichText object at 0x3e1b1d4684d0&gt;), (u'btn_text', u'Read more on Transform with Google Cloud'), (u'href', u'https://cloud.google.com/blog/transform/ulta-beauty-reinventing-omnichannel-retail-with-cloud-ai'), (u'image', None)])]</dd></dl></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Ulta Beauty took a domain-driven design approach to identify operations that could be grouped together to reduce complexity and improve scalability. Now, the applications are based on multiple domains, such as Commerce, Promotions, Catalog, Order, Customer, and Inventory. The new architecture prompted a fresh look at storage requirements to scale dynamically alongside its modernized applications.</p><p>For Ulta Beauty, MongoDB Atlas proved to be the best database solution for dynamic scaling, ease-of-use, and integrations with Google Cloud. The company also leveraged an entry-level plan to prove the value of MongoDB Atlas before investing in the technology. </p><p>“MongoDB Atlas offers a free tier that gave us an opportunity to quickly demonstrate tangible benefits of a proof of concept,” says Vure. “Once we proved the value of MongoDB Atlas, we benefited from the straightforward resource allocation supported by Google Cloud and MongoDB.”</p><p>Integrations between MongoDB Atlas and Google Cloud allow Ulta Beauty to take an iterative approach to new projects. The company creates new clusters in an existing project, then piggybacks them onto an existing <a href=\"https://cloud.google.com/vpc/docs/private-service-connect\">Private Service Connect</a> setup between a MongoDB project and Google Cloud project.</p><p>By removing complexities within infrastructure management, Ulta Beauty can manage its incredible amount of data, such as member preferences and purchases,  that fuels its event-driven architecture. The much more agile infrastructure enables Ulta Beauty to deploy and scale offerings faster than ever.</p><p>“We recently had an unplanned traffic surge that impacted our domain services. It took less than an hour for MongoDB Atlas to scale up to the next level of the cluster and manage that traffic,” says Vure. “The on-demand, dynamic scaling, plus GKE, has saved the day more than once.”</p><h3>Preparing for a happy holiday season</h3><p>This holiday season, Ulta Beauty has a stronger technical foundation to manage demand surges and provide customers seamless shopping experiences. Previously, the company used 50 pods in a cluster, each with 6 GB of RAM without domain stores, to handle about 100 transactions each second. With domain stores, the same 6 GB of RAM with just 20 GKE pods was able to scale up to 2,400 transactions per second. </p><p>With Google Cloud as its technology foundation, Ulta Beauty partnered with Google Cloud partner commercetools to evolve its application APIs as products and properly separate interfaces and capabilities.</p><p>Ulta Beauty uses event-based integrations within commercetools to identify how best to leverage Cloud Pub/Sub middleware on top of MongoDB Atlas integrations. Patterns established here were extended into MongoDB change streams and in turn improved business processes.</p><p>“Working with the right technology partners has helped us to avoid analysis paralysis that can happen when developer teams spend a lot of time trying to understand and manage every detail,” says Vure. “Instead, we convert a proof of concept into a working solution, and quickly bring it to market. It’s been a major shift in our IT culture as we try out new things weekly and see incredible support from leadership.”</p><p>The improvements enable Ulta Beauty to maintain a high level of innovation, performance, and customer service year-round. Now, when the holiday shopping season begins, Ulta Beauty is prepared to handle surges in traffic through auto-scaling with Google Cloud and MongoDB Atlas. Customers get what they want, when they want, free from the frustrations of outages. </p><p>“With these changes, we are ready for a holiday season that everyone–even those of us in IT—gets to enjoy. We’re positioned to continuously focus on new, better ways to serve our guests,” says Vure.</p><p>Check out <a href=\"https://console.cloud.google.com/marketplace/product/mongodb/mdb-atlas-self-service\">MongoDB</a> and <a href=\"https://pantheon.corp.google.com/marketplace/product/commercetools-public/commercetools-platform?q=search&amp;referrer=search\" target=\"_blank\">commercetools</a> on <a href=\"https://cloud.google.com/marketplace\">Google Cloud Marketplace</a> to learn more about what these partners can do for your business. </p><hr/><p><i><sup>The content of this blog was taken from a Google Cloud interview with Ulta Beauty.</sup></i></p></div></div></body></html>",
  "pubDate": "Fri, 04 Nov 2022 16:00:00 -0000",
  "guid": "https://cloud.google.com/blog/topics/partners/how-ulta-beauty-uses-google-cloud-and-mongodb-atlas-to-power-innovation/",
  "category": [
    "Customers",
    "Retail",
    "Partners"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "How Ulta Beauty manages holiday surges and supports year-round innovation",
    "description": "Ulta Beauty enjoys stability amid holiday season surges in demand, as well as flexibility to innovate, thanks to Google Cloud and MongoDB Atlas.",
    "image": "https://storage.googleapis.com/gweb-cloudblog-publish/images/retail_2022_Kg3nwu0.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://cloud.google.com/blog/topics/partners/how-ulta-beauty-uses-google-cloud-and-mongodb-atlas-to-power-innovation/"
  },
  "author": {
    "name": "Kandice Carlson",
    "title": "Senior Industry Marketing Manager, Retail, Google Cloud",
    "department": "",
    "company": ""
  }
}