{
  "title": "Linear regression can be understood in many ways (optimization, probabilistic, bayesian)",
  "link": "https://mlopezm.wordpress.com/2016/07/20/linear-regression-can-be-understood-in-many-ways-optimization-probabilistic-bayesian/",
  "comments": "https://mlopezm.wordpress.com/2016/07/20/linear-regression-can-be-understood-in-many-ways-optimization-probabilistic-bayesian/#comments",
  "dc:creator": "mlopezm",
  "pubDate": "Wed, 20 Jul 2016 09:29:14 +0000",
  "category": "Sin categoría",
  "guid": "http://mlopezm.wordpress.com/?p=858",
  "description": "It is very interesting to see the connection between the different approaches to solve the linear regression problem. Optimization Optimization of deterministic cost function The firs point of view is simply as an optimization problem. The normal approach is to try to minimize the residual (errors) sum of squares (RSS). In that way we arrive [&#8230;]",
  "content:encoded": "<p>It is very interesting to see the connection between the different approaches to solve the linear regression problem.</p>\n<h1><strong>Optimization</strong></h1>\n<h3><em>Optimization of deterministic cost function</em></h3>\n<p>The firs point of view is simply as an optimization problem. The normal approach is to try to minimize the residual (errors) sum of squares (RSS). In that way we arrive to the normal equations that solve the problem (<a href=\"https://en.wikipedia.org/wiki/Linear_least_squares_(mathematics)\">least squares</a>)(<a href=\"https://en.wikipedia.org/wiki/Linear_regression\">linear regression</a>)(<a href=\"https://en.wikipedia.org/wiki/Ordinary_least_squares\">OLS</a>). To minimize the expression we equal the gradient of the RSS to zero and solve it to obtain the parameters that achieves the minimum. If instead of the RSS we use the absolute value of the residuals we arrive to the <a href=\"https://en.wikipedia.org/wiki/Least_absolute_deviations\">LAD</a> (least absolute deviation) solution. For this solution there is not a close form solution, instead you have to use a linear programming apprach to solve it. Both LAD or RSS use the minimization of a cost function.</p>\n<p>When using a cost functions you can be lucky and have a close form solution (RSS case) or, more often, you arrive to a solution that involves an iterative process, either using gradient descent, stochastic gradient descent (using the gradient of the cost function) or some other method that uses both the gradient and the hessian of the cost fucntion (Newton method, quasi-Newton, &#8230;) (<a href=\"http://gradient descent\">gradient descent</a>)(<a href=\"http://www.scipy-lectures.org/advanced/mathematical_optimization/\">finding minima</a>)(<a href=\"http://www.analyzemath.com/calculus/Differentiation/absolute_value.html\">gradient LAD</a>)</p>\n<p>&nbsp;</p>\n<h1>Probabilistic</h1>\n<h3><em>Maximum likelihood of posterior distribution</em></h3>\n<p>Same results obtained by the optimization approach can be produced by other different means.</p>\n<p>The predictor variable can be seen as a random variable produced by a function of the independent variables (deterministic) plus an error term (another random variable).</p>\n<p>The pdf (probability density function) of the predictor random variable (the posterior distribution) will be similar to the pdf of the error term, except by a difference in the expected value that is provided by the linear relationship established on the independent variables.</p>\n<p>If we assume that the error term has a gaussian pdf with zero mean and we try to determine the parameters of the linear function that maximize the log likelihood (MLE, maximum likelihood estimator) of the predicted values, conditioned on the independent data, we arrive to exactly the same solution that when optimizing the RSS cost function (<strong>see chapter 3 of the book: The Elements of Statistical Analysis, Hastie, Tibshirani</strong>)</p>\n<p>The interesting point is that changing the pdf of the error term we arrive to different solutions.</p>\n<p>If the error term has a Laplacian pdf and we use the same MLE strategy to estimate the parameters, we arrive to the same solution as when optimizing the least absolute value as a cost function.</p>\n<p>When using different pdf distributions for the error term we arrive to different solutions.</p>\n<p>To use a Laplacian pdf or any other long tail distribution provides a robust linear regression. The reason for that is that the error term distributon is able to incorporate outliers whithout having to change drastically its location (mean) parameters. When using a gaussian pdf this is not possible as the gaussian tolerates outliers badly (<strong>see chapter 7 of K.P. Murphy book: Machine Learning a probabilistic perspective</strong>).</p>\n<h3><em>Optimization of stochastic cost function</em></h3>\n<p>When using the probabilistic perspective to the cost function minimization approach we have to minimize the expected value of the cost function as now both X and Y (independent and dependent variables) are random variables. Following this path we obtain that the best solution, in case of the square loss function,  is the expected value of Y conditioned on X [<img src=\"https://s0.wp.com/latex.php?latex=%5Clarge+E%28Y%2FX%29&#038;bg=ffffff&#038;fg=404040&#038;s=0&#038;c=20201002\" alt=\"&#92;large E(Y/X)\" class=\"latex\" />], and, in the case of the LAD cost function,  is the median of Y conditioned on X [<img src=\"https://s0.wp.com/latex.php?latex=%5Clarge+Median%28Y%2FX%29&#038;bg=ffffff&#038;fg=404040&#038;s=0&#038;c=20201002\" alt=\"&#92;large Median(Y/X)\" class=\"latex\" />]. A nice generalization of the latter is <a href=\"https://en.wikipedia.org/wiki/Quantile_regression\">Quantile Regression</a> where we extend the median results (quantile 0.5) to any other quantile of the <img src=\"https://s0.wp.com/latex.php?latex=%5Clarge+Prob%28Y%2FX%29&#038;bg=ffffff&#038;fg=404040&#038;s=0&#038;c=20201002\" alt=\"&#92;large Prob(Y/X)\" class=\"latex\" /> distribution.</p>\n<p>&nbsp;</p>\n<h1>Bayesian</h1>\n<p>The bayesian solution gives the most insigth to the different elements that can take part in a linear regression.</p>\n<p>To tell it shortly, the bayesian&#8217;s <strong>prior distribution</strong>  takes care of the regularization term and the bayesian&#8217;s <strong>likelihood distribution</strong> handles the errors and outliers.</p>\n<p>Regularization is a term used in machine learning for different techniques to manage the overfitting problem. This is done, for example,  adding a additional (regularization) term to a cost function in such a way that increasing the values of the parameters of the model gives a penalty to the cost function.</p>\n<p>Why reducing the values of the parameters of a model is good to control overfitting?</p>\n<p>Consider a model with a lot of parameters (so, prone to overfit) but with all the parameters equal to zero (regularization term dissapears!). Well, this model is complex (lots of parameters) but as all the parameters are zero it is actually not complex anymore, that is actually as not having any model at all.</p>\n<p>This is the way that the regularization term controls overfitting of a complex model.</p>\n<p>How the prior of a bayesian model is related to regularization? Well, if we assume that our parameters prior is a gaussian with zero means and a very small variance, we are telling that we are pretty sure that the parameters will be close to zero. So, we are actually adding a regularization term.</p>\n<p>Otherwise, if we impose the prior of the parameters distribution to be a uniform distribution, we don&#8217;t add any regularization term.  A uniform prior on a bayesian model will arrive to the same OLS results obtained by the Normal Equations, without regularization (<strong>Table 7.1 of Murphy&#8217;s book)</strong> .</p>\n<p>If we do the maths (<strong>chapter 7.5.1 of Murphy&#8217;s book)</strong> the result of adding a gaussian prior is equivalent to adding a ridge regression term to our linear regression model. If, instead we add a laplacian prior we have a different kind of regularization that is called <a href=\"https://en.wikipedia.org/wiki/Lasso_(statistics)\">lasso</a>.</p>\n<p>The likelihood distribution in the bayesian model has the same effect that the error term pdf in the probabilistic approach. Using diferent likelihoods distributions we can control our model robustness to outliers.</p>\n<p>&nbsp;</p>\n<h1>R code sources</h1>\n<p>Great R code repository for statistical modeling, with code for all the linear models variants: <a href=\"http://www.uni-kiel.de/psychologie/rexrepos/posts/regression.html\" rel=\"nofollow\">http://www.uni-kiel.de/psychologie/rexrepos/posts/regression.html</a></p>\n<p>&nbsp;</p>\n",
  "wfw:commentRss": "https://mlopezm.wordpress.com/2016/07/20/linear-regression-can-be-understood-in-many-ways-optimization-probabilistic-bayesian/feed/",
  "slash:comments": 1,
  "media:content": {
    "media:title": "mlopezm"
  }
}