{
  "title": "Episode 27: &#8220;Tweedle Dee&#8221; by LaVern Baker",
  "link": "https://500songs.com/podcast/episode-27-tweedle-dee-by-lavern-baker/",
  "pubDate": "Sun, 07 Apr 2019 22:34:43 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-27-tweedle-dee-by-lavern-baker/",
  "description": "Welcome to episode twenty-seven of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at LaVern Baker and \"Tweedle Dee\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-27-tweedle-dee/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe Patreon-only episode on Johnnie Ray I mention is <a href=\"https://www.patreon.com/posts/bonus-podcast-24781268\">here</a>.\n\nThere are no full biographies of LaVern Baker that I know of, but <a href=\"https://amzn.to/2WPSnOr\"><em>Blue Rhythms: Six Lives in Rhythm and Blues</em> by Chip Deffaa</a> devotes forty-three pages to her, and also has similar-length essays on five more important R&B pioneers.\n\nThere are many compilations of Baker's early work available. <a href=\"https://amzn.to/2WPSnOr\">This set</a> contains her first four albums in full, and is probably your best bet.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe talked a while back about how the copyright law in the 1950s didn't protect arrangements, and how that disproportionately affected black artists. But that doesn't mean that the black artists didn't fight back. Today we're going to talk about LaVern Baker, who led the fight for black artists' rights in the 1950s, But she was also one of the most successful female R&B artists of the fifties, and would deserve recognition even had she never been a campaigner.\n\nLaVern Baker was born Delores Evans, but she took her father's surname, Baker, as a stage name -- although she took on many different names in the early stages of her career.\n\nMusic ran in her family. Her aunt, for example, was Merline Johnson, the \"Yas Yas Girl\", who had been a mildly successful blues singer in the thirties and forties, and had performed with musicians such as Big Bill Broonzy and Blind John Davis:\n\n[excerpt: \"Sold it to the Devil\", Merline Johnson]\n\nYoung Delores idolised her aunt, as well as her more distant relative, the blues singer Memphis Minnie, and by the time she was twelve she was recording with Lester Melrose, the producer at RCA who also worked with Baker's relatives. However, those early recordings only produced one single, under another name, which sold so poorly that when she was interviewed in the 1990s Baker would say that she only knew of one person who owned a copy, and that person wouldn't even make a cassette copy for Baker.\n\nWhen Baker became a full time singer in her late teens, she wasn't performing as LaVern Baker, but as \"Little Miss Sharecropper\". She was, in fact, basically a tribute act to \"Little Miss Cornshucks\", a novelty blues singer whose act had her dressed as an innocent, unsophisticated, farm-girl:\n\n[excerpt: Little Miss Cornshucks \"Waiting In Vain\"]\n\nLittle Miss Cornshucks seems to have had personal problems that limited her success -- she was an alcoholic and married to a drug dealer -- but she was hugely influential on a lot of the rhythm and blues artists who recorded for Atlantic in the early 1950s, as she was a favourite of the label's owner, Ahmet Ertegun. In particular, Ruth Brown's first hit single on Atlantic, \"So Long\", was a cover version of Cornshucks' local hit version of the song from the forties.\n\nLittle Miss Cornshucks never did particularly well on the national scene, but she was popular enough in Chicago that the club owners wanted to put on an act who could capitalise on that popularity. And so, like Little Miss Cornshucks, Little Miss Sharecropper would go on stage carrying a straw basket, barefoot, in ragged clothes and a straw hat. She was not exactly happy about this act, but she still gave her all in her performances, and quickly established a reputation as an excellent blues singer around the midwest -- first in Chicago and later in Detroit. She also recorded at least a few singles as Little Miss Sharecropper, including this early attempt at jumping on the rock bandwagon:\n\n[Excerpt: Little Miss Sharecropper, \"I Want To Rock\"]\n\nWhile in Detroit, she also played a big part in teaching a young singer named Johnnie Ray how to sing the blues. Ray went on to be the biggest teen idol of the early 1950s, and most of the gimmicks the young singer used to make his audience of teenage girls swoon for him were things that Lavern Baker had taught him how to do. Those of you who have heard the Patreon-only bonus episode on Johnnie Ray will know all about her connection with him already, of course, but for those who haven't, the main thing she did for Ray was get him copying Al Jolson.\n\nRay was a singer who many listeners thought at first was himself a black woman, and so there are a *lot* of racial dynamics at play there, in a black woman who had to perform as a caricature of ignorant black femininity teaching a white man who sang like a black woman how to perform by getting him to copy the stage presence of a blackface minstrel act.\n\nBoth Ray and Baker were hugely influenced by another singer, Dinah Washington, as almost all R&B singers, especially women, were at this time. Washington is one of those people we need to discuss in this series, but who was only an indirect influence on rock and roll. She worked on the borders of jazz and R&B, but slightly over to the jazz side rather than to the R&B one, and so while she didn't make rock and roll music herself, or even proto-rock and roll, without her we would have no Ray Charles or Aretha Franklin, no Etta James or Lavern Baker.\n\nWashington was the consummate blues stylist, but the music she sang was a combination of traditional pop, jazz, blues, R&B, and torch songs. Like so many of the early stars of R&B, she started out as a member of Lionel Hampton's band, singing with him for a couple of years in the late 1940s, before she went solo and started performing her own music.\n\nWashington didn't hit the pop charts with any regularity until 1959, but she was a regular at the top of the R&B charts right from the beginning of her career, and one thing you'll notice if you read the biographies of any singer at all from this time period is them saying how much they wanted to sound like Washington specifically. Washington's commercial peak came rather later than her peak in influence, and she only played a very indirect part in the history of rock and roll, but it was a very *large* indirect part.\n\nYou can hear the influence that Washington had on Baker by comparing their performances of the song \"Harbor Lights\". Here's Washington:\n\n[excerpt: Dinah Washington, \"Harbor Lights\"]\n\nAnd here's Baker:\n\n[Excerpt: LaVern Baker, \"Harbor Lights\"]\n\nWhile Baker was performing as Little Miss Sharecropper, she also recorded for a lot of different labels, under a variety of different names. But none of these records sold outside the cities Baker was playing in, and she remained unknown elsewhere until 1953, when she signed with Atlantic Records.\n\nHer first single for Atlantic had a song credited to Baker plus one of Ahmet Ertegun's pseudonyms. \"Soul on Fire\" was, for the time, a remarkably intense record.\n\n[Excerpt: LaVern Baker, \"Soul on Fire\"]\n\nBefore \"Soul on Fire\" was released, she got the chance to go overseas for the first time. She joined a touring show called The Harlem Melody in late 1953, and travelled to Europe with that tour. The rest of the acts eventually moved on, and moved back to the USA, but Baker decided to stay on performing in Milan, and occasionally also performing in France. She didn't learn to speak the language, but was successful there until she got a telegram from her agent telling her to get back home because she had a hit record.\n\n\"Soul On Fire\" wasn't actually a hit, but it *was* a successful enough single that Atlantic were convinced that Baker was someone worth investing in, and so they had called her back for another session. This time it was for a bit of pop fluff called \"Tweedle Dee\":\n\n[Excerpt: LaVern Baker, \"Tweedle Dee\"]\n\n\"Tweedle Dee\" was a clear attempt at another \"Ko Ko Mo\" -- an R&B record with a vaguely Latin beat, and with lyrics consisting of platitudes about love and gibberish nonsense syllables. And early 1955 was the very best possible time to release something like that. Baker turned in a great vocal on a song that didn't really deserve it, but her conviction alone gave the record enough power that it rose to number fourteen on the pop charts.\n\nBut Baker's hit was another one to fall foul of Georgia Gibbs.\n\nWe talked about Gibbs previously, in the episode on \"The Wallflower\", when we heard about her remaking that song as \"Dance With Me Henry\". But that wasn't the only time she profited off a song originally performed by a black woman. Indeed, Gibbs' version of \"the Wallflower\" came after the events we're talking about.\n\nGibbs was a popular singer from the big band era, who'd had hit records with things like \"If I Knew You Were Coming I'd Have Baked A Cake\":\n\n[Excerpt: \"If I Knew You Were Coming I'd Have Baked a Cake\", Georgia Gibbs]\n\nWhen musical fashions changed, Gibbs took to recording hits by black artists in soundalike versions.\n\nIn the case of \"Tweedle Dee\", Gibbs and her producers hired the same arranger and musicians who'd played on Baker's record, and even tried to hire the same engineer, (Tom Dowd, of Atlantic Records, who turned them down) just in case they had a single scrap of originality left in their sound somewhere. They were attempting, as far as possible, to make the exact same record, just with a white woman as the credited artist.\n\nIt's a distinction I've made before, but it's one that continues to need to be made -- there is a continuum of cover versions, and not all are created equal. In the case of white artists in the fifties covering black artists, there is always a power imbalance there -- there are always opportunities the white artist can take that the black artist can't -- but there is a huge, clear, distinction between on the one hand a transformative cover like Elvis Presley doing \"That's All Right Mama\", where the artist totally recasts it into his own style, and on the other hand... well, on the other hand hiring the same arranger and musicians to rerecord a track note-for-note.\n\n[Excerpt: “Tweedle Dee”, Georgia Gibbs]\n\nAnd Baker certainly thought there was a difference. She had nothing against white singers performing in black idioms or singing other people's songs – again, she had helped make Johnnie Ray into the star that he became – but someone just straight out copying every single element of one of her records and having a bigger hit with it was a step too far. And unlike many of the other artists of the time, Baker decided she was going to do something about it.\n\nThe thing you need to understand here is that while Baker later estimated that she had lost as much as fifteen thousand dollars -- in 1955 dollars -- on lost sales because of Gibbs, she was not particularly interested in the money. What she was interested in was the exposure that radio play, in particular, would bring her. And it was the radio play, more than anything else, that was the big problem for her, and for other black artists.\n\nAudiences weren't finding out about Baker's record as much as they should have, because the radio was playing Gibbs' record and not Baker's. Without that radio exposure, Baker lost out on sales, and lost out on new fans who might like her other records.\n\nBaker decided that she had to fight back against this.\n\nOne thing she did was a simple publicity stunt -- Baker had to travel on a long-distance flight, and before she did so, she took out a life insurance policy, putting Gibbs down as the beneficiary, because if Baker died then Gibbs would no longer have a career without having anyone to copy. But she did more than that.\n\nShe also lobbied Congressman Charles Diggs Jr, for help. Diggs was the first black Congressman from Michigan, and he was a pioneer in civil rights in US electoral politics. He had only just been elected when Baker contacted him, but he would soon rise to national attention with his publicising of the case of Emmett Till, a fourteen-year-old black child who had been brutally murdered because he had been accused of whistling at a white woman.\n\nIn her open letter to Diggs, Baker said \"After an investigation of the facts, you might see some wisdom in introducing a law to make it illegal to duplicate another's work. It's not that I mind someone singing a song that I wrote or have written for me by someone, but I bitterly resent their arrogance in thefting my music note-for-note\".\n\nNow, I have to admit that here I've hit a bit of a wall in my researches, because I have found three different, contradictory, stories about what resulted from this, and I can't find any evidence to distinguish between them in any of the books I've consulted or on the Internet.\n\nOne version is that nothing followed from this as far as legislation goes, and that Diggs did nothing.\n\nAnother, which I've only been able to find in the book \"Blue Rhythms\", was that Congress passed a bill which stated that on any record released, sixteen to twenty-four bars of the arrangement had to be different from any other version. Now, frankly, I find this rather difficult to believe -- it doesn't fit with anything else I know about the history of the record industry and copyright law, and I can't find any evidence of it anywhere else, but the article in that book quotes Baker as saying this, and as also saying that she kept a copy of the bill in her house for a long time after it passed.\n\nAnd the third story, which seems the most plausible, but which again I've been unable to confirm, is that Diggs set up a Congressional committee to look into changes to the copyright law, that it investigated what changes could be made, but that it ultimately didn't lead to any laws being passed.\n\nBut what definitely happened, largely as a result of the publicity campaign by Baker and the unwelcome attention it drew to the racism of the music industry, is that the practice of making white note-for-note cover versions began to fall out of favour.\n\nGeorgia Gibbs' record label announced that after \"Dance With Me Henry\" she wasn't going to cover any more R&B songs (they claimed that this was because R&B was falling out of favour with the public and nobody liked it anyway, and anyway those grapes were sour), while WINS radio in New York decided it was going to ban copy records altogether. They said that they were going to continue to play cover versions – where an artist recorded someone else's song in their own style, changing the arrangement – but that they weren't going to play straight copies any more. Other stations followed suit.\n\nWhile Georgia Gibbs' label had said after the \"Tweedle-Dee\" controversy that Gibbs would not be cutting any more material from this R&B fad, two years on things had changed, and they tried the same trick again, taking Baker's new single \"Tra La La\" and having Gibbs record a cover version of that.\n\n\"Tra La La\" was a success, but Gibbs' producers had rather missed the point. \"Tra La La\" wasn't the side of Baker's record that people were listening to. Instead, everyone was listening to \"Jim Dandy\" on the other side. While \"Tra La La\" was another song in the style of \"Tweedle Dee\", Jim Dandy was something altogether rawer, and more... rock and roll:\n\n[excerpt: Lavern Baker, \"Jim Dandy\"]\n\nAnd this is, I think, the ultimate reason that the white copycats of black music stopped, at least in this form. They could see that people were buying the black musicians' records, but they couldn't see *why* they were buying them. None of the people who were making what amounted to photocopies of the black musicians' records could actually understand the music that they were parasites on. They had no creativity themselves, and relied merely on being able to duplicate someone else's work without understanding it. That's no basis on which to build a career.\n\n\"Tra La La\" went to number twenty-four on the pop charts for Gibbs, but \"Jim Dandy\" went to number seventeen for Baker. Gibbs would never have another top thirty hit again.\n\nAnd so, as this story goes on, we will occasionally have reason to note a white cover version of a black record, but they will become less and less relevant. The dominance of acts like the Crew Cuts and Georgia Gibbs was a brief one, and while they were able to hold back the careers of people like LaVern Baker, they weren't able to be anything themselves other than dead ends, both artistically and commercially.\n\nGibbs' version wasn't the only cover version of Tweedle-Dee by a white person. Elvis Presley was regularly performing the song live as he started his touring career. He never cut the song in the studio, but he would perform it on the radio on occasion:\n\n[Excerpt: Elvis Presley, \"Tweedle Dee\"]\n\nIndeed, Baker's influence on Presley seems to be rather underrated -- as well as performing \"Tweedle Dee\" live in 1955, he also recorded two other songs that year which Baker also recorded -- \"Tomorrow Night\" and \"Harbor Lights\". While neither of those songs were original to Baker, it's probably more than just coincidence that he would record so many songs that she sang.\n\nLaVern Baker had a whole run of hits in the late fifties, but she became dissatisfied herself with the material she was given by Atlantic. While she gave great performances on \"Tweedle Dee\", \"Tra La La\", \"Ting A Ling\", \"Humpty Dumpty Heart\" and the rest of the songs she was ordered to sing, they were not really the kind of songs that she'd always wanted to perform. She'd wanted to be a torch song singer, and while some of the material she was given, like \"Whipper Snapper\" by Leiber and Stoller, was superior early rock and roll, a lot of it was novelty gibberish.\n\nYou can hear what she could do with something a bit more substantial on \"I Cried A Tear\", which went to number two on the R&B charts and number twenty-one on the pop charts. \"I Cried A Tear\" is still ultra-simplistic in its conception, but it's structured more like the songs that Baker had grown up on, and she gives a performance that is more suited to a torch song than to fifties rock and roll:\n\n[Excerpt, LaVern Baker: \"I Cried A Tear\"]\n\nHaving a hit with a track like that -- a waltz ballad -- gave Baker and her producers the confidence to branch out with her material. In 1958 she would record an entire album of old Bessie Smith tracks, which doesn't quite match up perhaps to the quality of Smith's recordings of the songs, but isn't an embarrassment in comparison with them, which says something.\n\nBaker would have ten years of moderate chart success, never hitting the heights but making the hot one hundred with everything from the Leiber and Stoller gospel song \"Saved\" (another song which Elvis later covered) to \"Fly Me to the Moon\" to this great soul duet with Jackie Wilson, her last R&B top forty hit, from 1965:\n\n[Excerpt: LaVern Baker and Jackie Wilson, \"Think Twice\"]\n\nThe hits dried up after 1965, and even a novelty song about Batman in 1966 couldn't get her back into the charts, and even before that she had moved more into performing jazz and blues rather than her old rock and roll hits. After her second marriage, to the comedian Slappy White, broke up, she went on a USO tour to perform for troops in Vietnam, where she fell ill. A doctor advised her to stay in a warm climate for her health, and so she got a permanent position as a troop entertainer in the Philippines, where she stayed for twenty-two years. After the revolution which brought democracy to the Philippines and the subsequent closure of the base where she was working, Baker returned to the US.\n\nMuch as she'd taken over from Ruth Brown as Atlantic Records' biggest female star of the 1950s, now she took over from Brown in her role in the Broadway revue \"Black and Blue\", singing blues songs from the twenties and thirties, and had something of a career renaissance.\n\nHer health problems got worse, and by the mid nineties she was performing from a wheelchair -- both her legs had been amputated due to complications from diabetes. She never made as much money as she should have, but she was one of the first recipients of a lifetime achievement award from the Rhythm and Blues Foundation (which she had helped Ruth Brown set up, though Baker was never as antagonistic towards the record companies as Brown), and she was the second female solo artist to be inducted into the Rock and Roll Hall of Fame, after Aretha Franklin. For someone who prized recognition over money, maybe that was enough. She died in 1997, aged 67.",
  "itunes:subtitle": "Welcome to episode twenty-seven of A History of Rock Music in Five Hundred Songs. Today were looking at LaVern Baker and Tweedle Dee. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs al",
  "itunes:keywords": "Ahmet Ertegun,Atlantic Records,copyright law,Dinah Washington,Elvis Presley,Georgia Gibbs,Johnnie Ray,LaVern Baker,Leiber and Stoller,racism,Ruth Brown,Tom Dowd,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 27,
  "content:encoded": "Welcome to episode twenty-seven of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at LaVern Baker and \"Tweedle Dee\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-27-tweedle-dee/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe Patreon-only episode on Johnnie Ray I mention is <a href=\"https://www.patreon.com/posts/bonus-podcast-24781268\">here</a>.\n\nThere are no full biographies of LaVern Baker that I know of, but <a href=\"https://amzn.to/2WPSnOr\"><em>Blue Rhythms: Six Lives in Rhythm and Blues</em> by Chip Deffaa</a> devotes forty-three pages to her, and also has similar-length essays on five more important R&B pioneers.\n\nThere are many compilations of Baker's early work available. <a href=\"https://amzn.to/2WPSnOr\">This set</a> contains her first four albums in full, and is probably your best bet.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWe talked a while back about how the copyright law in the 1950s didn't protect arrangements, and how that disproportionately affected black artists. But that doesn't mean that the black artists didn't fight back. Today we're going to talk about LaVern Baker, who led the fight for black artists' rights in the 1950s, But she was also one of the most successful female R&B artists of the fifties, and would deserve recognition even had she never been a campaigner.\n\nLaVern Baker was born Delores Evans, but she took her father's surname, Baker, as a stage name -- although she took on many different names in the early stages of her career.\n\nMusic ran in her family. Her aunt, for example, was Merline Johnson, the \"Yas Yas Girl\", who had been a mildly successful blues singer in the thirties and forties, and had performed with musicians such as Big Bill Broonzy and Blind John Davis:\n\n[excerpt: \"Sold it to the Devil\", Merline Johnson]\n\nYoung Delores idolised her aunt, as well as her more distant relative, the blues singer Memphis Minnie, and by the time she was twelve she was recording with Lester Melrose, the producer at RCA who also worked with Baker's relatives. However, those early recordings only produced one single, under another name, which sold so poorly that when she was interviewed in the 1990s Baker would say that she only knew of one person who owned a copy, and that person wouldn't even make a cassette copy for Baker.\n\nWhen Baker became a full time singer in her late teens, she wasn't performing as LaVern Baker, but as \"Little Miss Sharecropper\". She was, in fact, basically a tribute act to \"Little Miss Cornshucks\", a novelty blues singer whose act had her dressed as an innocent, unsophisticated, farm-girl:\n\n[excerpt: Little Miss Cornshucks \"Waiting In Vain\"]\n\nLittle Miss Cornshucks seems to have had personal problems that limited her success -- she was an alcoholic and married to a drug dealer -- but she was hugely influential on a lot of the rhythm and blues artists who recorded for Atlantic in the early 1950s, as she was a favourite of the label's owner, Ahmet Ertegun. In particular, Ruth Brown's first hit single on Atlantic, \"So Long\", was a cover version of Cornshucks' local hit version of the song from the forties.\n\nLittle Miss Cornshucks never did particularly well on the national scene, but she was popular enough in Chicago that the club owners wanted to put on an act who could capitalise on that popularity. And so, like Little Miss Cornshucks, Little Miss Sharecropper would go on stage carrying a straw basket, barefoot, in ragged clothes and a straw hat. She was not exactly happy about this act, but she still gave her all in her performances, and quickly established a reputation as an excellent blues singer around the midwest -- first in Chicago and later in Detroit. She also recorded at least a few singles as Little Miss Sharecropper, including this early attempt at jumping on the rock bandwagon:\n\n[Excerpt: Little Miss Sharecropper, \"I Want To Rock\"]\n\nWhile in Detroit, she also played a big part in teaching a young singer named Johnnie Ray how to sing the blues. Ray went on to be the biggest teen idol of the early 1950s, and most of the gimmicks the young singer used to make his audience of teenage girls swoon for him were things that Lavern Baker had taught him how to do. Those of you who have heard the Patreon-only bonus episode on Johnnie Ray will know all about her connection with him already, of course, but for those who haven't, the main thing she did for Ray was get him copying Al Jolson.\n\nRay was a singer who many listeners thought at first was himself a black woman, and so there are a *lot* of racial dynamics at play there, in a black woman who had to perform as a caricature of ignorant black femininity teaching a white man who sang like a black woman how to perform by getting him to copy the stage presence of a blackface minstrel act.\n\nBoth Ray and Baker were hugely influenced by another singer, Dinah Washington, as almost all R&B singers, especially women, were at this time. Washington is one of those people we need to discuss in this series, but who was only an indirect influence on rock and roll. She worked on the borders of jazz and R&B, but slightly over to the jazz side rather than to the R&B one, and so while she didn't make rock and roll music herself, or even proto-rock and roll, without her we would have no Ray Charles or Aretha Franklin, no Etta James or Lavern Baker.\n\nWashington was the consummate blues stylist, but the music she sang was a combination of traditional pop, jazz, blues, R&B, and torch songs. Like so many of the early stars of R&B, she started out as a member of Lionel Hampton's band, singing with him for a couple of years in the late 1940s, before she went solo and started performing her own music.\n\nWashington didn't hit the pop charts with any regularity until 1959, but she was a regular at the top of the R&B charts right from the beginning of her career, and one thing you'll notice if you read the biographies of any singer at all from this time period is them saying how much they wanted to sound like Washington specifically. Washington's commercial peak came rather later than her peak in influence, and she only played a very indirect part in the history of rock and roll, but it was a very *large* indirect part.\n\nYou can hear the influence that Washington had on Baker by comparing their performances of the song \"Harbor Lights\". Here's Washington:\n\n[excerpt: Dinah Washington, \"Harbor Lights\"]\n\nAnd here's Baker:\n\n[Excerpt: LaVern Baker, \"Harbor Lights\"]\n\nWhile Baker was performing as Little Miss Sharecropper, she also recorded for a lot of different labels, under a variety of different names. But none of these records sold outside the cities Baker was playing in, and she remained unknown elsewhere until 1953, when she signed with Atlantic Records.\n\nHer first single for Atlantic had a song credited to Baker plus one of Ahmet Ertegun's pseudonyms. \"Soul on Fire\" was, for the time, a remarkably intense record.\n\n[Excerpt: LaVern Baker, \"Soul on Fire\"]\n\nBefore \"Soul on Fire\" was released, she got the chance to go overseas for the first time. She joined a touring show called The Harlem Melody in late 1953, and travelled to Europe with that tour. The rest of the acts eventually moved on, and moved back to the USA, but Baker decided to stay on performing in Milan, and occasionally also performing in France. She didn't learn to speak the language, but was successful there until she got a telegram from her agent telling her to get back home because she had a hit record.\n\n\"Soul On Fire\" wasn't actually a hit, but it *was* a successful enough single that Atlantic were convinced that Baker was someone worth investing in, and so they had called her back for another session. This time it was for a bit of pop fluff called \"Tweedle Dee\":\n\n[Excerpt: LaVern Baker, \"Tweedle Dee\"]\n\n\"Tweedle Dee\" was a clear attempt at another \"Ko Ko Mo\" -- an R&B record with a vaguely Latin beat, and with lyrics consisting of platitudes about love and gibberish nonsense syllables. And early 1955 was the very best possible time to release something like that. Baker turned in a great vocal on a song that didn't really deserve it, but her conviction alone gave the record enough power that it rose to number fourteen on the pop charts.\n\nBut Baker's hit was another one to fall foul of Georgia Gibbs.\n\nWe talked about Gibbs previously, in the episode on \"The Wallflower\", when we heard about her remaking that song as \"Dance With Me Henry\". But that wasn't the only time she profited off a song originally performed by a black woman. Indeed, Gibbs' version of \"the Wallflower\" came after the events we're talking about.\n\nGibbs was a popular singer from the big band era, who'd had hit records with things like \"If I Knew You Were Coming I'd Have Baked A Cake\":\n\n[Excerpt: \"If I Knew You Were Coming I'd Have Baked a Cake\", Georgia Gibbs]\n\nWhen musical fashions changed, Gibbs took to recording hits by black artists in soundalike versions.\n\nIn the case of \"Tweedle Dee\", Gibbs and her producers hired the same arranger and musicians who'd played on Baker's record, and even tried to hire the same engineer, (Tom Dowd, of Atlantic Records, who turned them down) just in case they had a single scrap of originality left in their sound somewhere. They were attempting, as far as possible, to make the exact same record, just with a white woman as the credited artist.\n\nIt's a distinction I've made before, but it's one that continues to need to be made -- there is a continuum of cover versions, and not all are created equal. In the case of white artists in the fifties covering black artists, there is always a power imbalance there -- there are always opportunities the white artist can take that the black artist can't -- but there is a huge, clear, distinction between on the one hand a transformative cover like Elvis Presley doing \"That's All Right Mama\", where the artist totally recasts it into his own style, and on the other hand... well, on the other hand hiring the same arranger and musicians to rerecord a track note-for-note.\n\n[Excerpt: “Tweedle Dee”, Georgia Gibbs]\n\nAnd Baker certainly thought there was a difference. She had nothing against white singers performing in black idioms or singing other people's songs – again, she had helped make Johnnie Ray into the star that he became – but someone just straight out copying every single element of one of her records and having a bigger hit with it was a step too far. And unlike many of the other artists of the time, Baker decided she was going to do something about it.\n\nThe thing you need to understand here is that while Baker later estimated that she had lost as much as fifteen thousand dollars -- in 1955 dollars -- on lost sales because of Gibbs, she was not particularly interested in the money. What she was interested in was the exposure that radio play, in particular, would bring her. And it was the radio play, more than anything else, that was the big problem for her, and for other black artists.\n\nAudiences weren't finding out about Baker's record as much as they should have, because the radio was playing Gibbs' record and not Baker's. Without that radio exposure, Baker lost out on sales, and lost out on new fans who might like her other records.\n\nBaker decided that she had to fight back against this.\n\nOne thing she did was a simple publicity stunt -- Baker had to travel on a long-distance flight, and before she did so, she took out a life insurance policy, putting Gibbs down as the beneficiary, because if Baker died then Gibbs would no longer have a career without having anyone to copy. But she did more than that.\n\nShe also lobbied Congressman Charles Diggs Jr, for help. Diggs was the first black Congressman from Michigan, and he was a pioneer in civil rights in US electoral politics. He had only just been elected when Baker contacted him, but he would soon rise to national attention with his publicising of the case of Emmett Till, a fourteen-year-old black child who had been brutally murdered because he had been accused of whistling at a white woman.\n\nIn her open letter to Diggs, Baker said \"After an investigation of the facts, you might see some wisdom in introducing a law to make it illegal to duplicate another's work. It's not that I mind someone singing a song that I wrote or have written for me by someone, but I bitterly resent their arrogance in thefting my music note-for-note\".\n\nNow, I have to admit that here I've hit a bit of a wall in my researches, because I have found three different, contradictory, stories about what resulted from this, and I can't find any evidence to distinguish between them in any of the books I've consulted or on the Internet.\n\nOne version is that nothing followed from this as far as legislation goes, and that Diggs did nothing.\n\nAnother, which I've only been able to find in the book \"Blue Rhythms\", was that Congress passed a bill which stated that on any record released, sixteen to twenty-four bars of the arrangement had to be different from any other version. Now, frankly, I find this rather difficult to believe -- it doesn't fit with anything else I know about the history of the record industry and copyright law, and I can't find any evidence of it anywhere else, but the article in that book quotes Baker as saying this, and as also saying that she kept a copy of the bill in her house for a long time after it passed.\n\nAnd the third story, which seems the most plausible, but which again I've been unable to confirm, is that Diggs set up a Congressional committee to look into changes to the copyright law, that it investigated what changes could be made, but that it ultimately didn't lead to any laws being passed.\n\nBut what definitely happened, largely as a result of the publicity campaign by Baker and the unwelcome attention it drew to the racism of the music industry, is that the practice of making white note-for-note cover versions began to fall out of favour.\n\nGeorgia Gibbs' record label announced that after \"Dance With Me Henry\" she wasn't going to cover any more R&B songs (they claimed that this was because R&B was falling out of favour with the public and nobody liked it anyway, and anyway those grapes were sour), while WINS radio in New York decided it was going to ban copy records altogether. They said that they were going to continue to play cover versions – where an artist recorded someone else's song in their own style, changing the arrangement – but that they weren't going to play straight copies any more. Other stations followed suit.\n\nWhile Georgia Gibbs' label had said after the \"Tweedle-Dee\" controversy that Gibbs would not be cutting any more material from this R&B fad, two years on things had changed, and they tried the same trick again, taking Baker's new single \"Tra La La\" and having Gibbs record a cover version of that.\n\n\"Tra La La\" was a success, but Gibbs' producers had rather missed the point. \"Tra La La\" wasn't the side of Baker's record that people were listening to. Instead, everyone was listening to \"Jim Dandy\" on the other side. While \"Tra La La\" was another song in the style of \"Tweedle Dee\", Jim Dandy was something altogether rawer, and more... rock and roll:\n\n[excerpt: Lavern Baker, \"Jim Dandy\"]\n\nAnd this is, I think, the ultimate reason that the white copycats of black music stopped, at least in this form. They could see that people were buying the black musicians' records, but they couldn't see *why* they were buying them. None of the people who were making what amounted to photocopies of the black musicians' records could actually understand the music that they were parasites on. They had no creativity themselves, and relied merely on being able to duplicate someone else's work without understanding it. That's no basis on which to build a career.\n\n\"Tra La La\" went to number twenty-four on the pop charts for Gibbs, but \"Jim Dandy\" went to number seventeen for Baker. Gibbs would never have another top thirty hit again.\n\nAnd so, as this story goes on, we will occasionally have reason to note a white cover version of a black record, but they will become less and less relevant. The dominance of acts like the Crew Cuts and Georgia Gibbs was a brief one, and while they were able to hold back the careers of people like LaVern Baker, they weren't able to be anything themselves other than dead ends, both artistically and commercially.\n\nGibbs' version wasn't the only cover version of Tweedle-Dee by a white person. Elvis Presley was regularly performing the song live as he started his touring career. He never cut the song in the studio, but he would perform it on the radio on occasion:\n\n[Excerpt: Elvis Presley, \"Tweedle Dee\"]\n\nIndeed, Baker's influence on Presley seems to be rather underrated -- as well as performing \"Tweedle Dee\" live in 1955, he also recorded two other songs that year which Baker also recorded -- \"Tomorrow Night\" and \"Harbor Lights\". While neither of those songs were original to Baker, it's probably more than just coincidence that he would record so many songs that she sang.\n\nLaVern Baker had a whole run of hits in the late fifties, but she became dissatisfied herself with the material she was given by Atlantic. While she gave great performances on \"Tweedle Dee\", \"Tra La La\", \"Ting A Ling\", \"Humpty Dumpty Heart\" and the rest of the songs she was ordered to sing, they were not really the kind of songs that she'd always wanted to perform. She'd wanted to be a torch song singer, and while some of the material she was given, like \"Whipper Snapper\" by Leiber and Stoller, was superior early rock and roll, a lot of it was novelty gibberish.\n\nYou can hear what she could do with something a bit more substantial on \"I Cried A Tear\", which went to number two on the R&B charts and number twenty-one on the pop charts. \"I Cried A Tear\" is still ultra-simplistic in its conception, but it's structured more like the songs that Baker had grown up on, and she gives a performance that is more suited to a torch song than to fifties rock and roll:\n\n[Excerpt, LaVern Baker: \"I Cried A Tear\"]\n\nHaving a hit with a track like that -- a waltz ballad -- gave Baker and her producers the confidence to branch out with her material. In 1958 she would record an entire album of old Bessie Smith tracks, which doesn't quite match up perhaps to the quality of Smith's recordings of the songs, but isn't an embarrassment in comparison with them, which says something.\n\nBaker would have ten years of moderate chart success, never hitting the heights but making the hot one hundred with everything from the Leiber and Stoller gospel song \"Saved\" (another song which Elvis later covered) to \"Fly Me to the Moon\" to this great soul duet with Jackie Wilson, her last R&B top forty hit, from 1965:\n\n[Excerpt: LaVern Baker and Jackie Wilson, \"Think Twice\"]\n\nThe hits dried up after 1965, and even a novelty song about Batman in 1966 couldn't get her back into the charts, and even before that she had moved more into performing jazz and blues rather than her old rock and roll hits. After her second marriage, to the comedian Slappy White, broke up, she went on a USO tour to perform for troops in Vietnam, where she fell ill. A doctor advised her to stay in a warm climate for her health, and so she got a permanent position as a troop entertainer in the Philippines, where she stayed for twenty-two years. After the revolution which brought democracy to the Philippines and the subsequent closure of the base where she was working, Baker returned to the US.\n\nMuch as she'd taken over from Ruth Brown as Atlantic Records' biggest female star of the 1950s, now she took over from Brown in her role in the Broadway revue \"Black and Blue\", singing blues songs from the twenties and thirties, and had something of a career renaissance.\n\nHer health problems got worse, and by the mid nineties she was performing from a wheelchair -- both her legs had been amputated due to complications from diabetes. She never made as much money as she should have, but she was one of the first recipients of a lifetime achievement award from the Rhythm and Blues Foundation (which she had helped Ruth Brown set up, though Baker was never as antagonistic towards the record companies as Brown), and she was the second female solo artist to be inducted into the Rock and Roll Hall of Fame, after Aretha Franklin. For someone who prized recognition over money, maybe that was enough. She died in 1997, aged 67.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-seven of A History of Rock Music in Five Hundred Songs. Today we're looking at LaVern Baker and \"Tweedle Dee\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe Patreon-only episode on Johnnie Ray I mention is here.\n\nThere are no full biographies of LaVern Baker that I know of, but Blue Rhythms: Six Lives in Rhythm and Blues by Chip Deffaa devotes forty-three pages to her, and also has similar-length essays on five more important R&B pioneers.\n\nThere are many compilations of Baker's early work available. This set contains her first four albums in full, and is probably your best bet.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe talked a while back about how the copyright law in the 1950s didn't protect arrangements, and how that disproportionately affected black artists. But that doesn't mean that the black artists didn't fight back. Today we're going to talk about LaVern Baker, who led the fight for black artists' rights in the 1950s, But she was also one of the most successful female R&B artists of the fifties, and would deserve recognition even had she never been a campaigner.\n\nLaVern Baker was born Delores Evans, but she took her father's surname, Baker, as a stage name -- although she took on many different names in the early stages of her career.\n\nMusic ran in her family. Her aunt, for example, was Merline Johnson, the \"Yas Yas Girl\", who had been a mildly successful blues singer in the thirties and forties, and had performed with musicians such as Big Bill Broonzy and Blind John Davis:\n\n[excerpt: \"Sold it to the Devil\", Merline Johnson]\n\nYoung Delores idolised her aunt, as well as her more distant relative, the blues singer Memphis Minnie, and by the time she was twelve she was recording with Lester Melrose, the producer at RCA who also worked with Baker's relatives. However, those early recordings only produced one single, under another name, which sold so poorly that when she was interviewed in the 1990s Baker would say that she only knew of one person who owned a copy, and that person wouldn't even make a cassette copy for Baker.\n\nWhen Baker became a full time singer in her late teens, she wasn't performing as LaVern Baker, but as \"Little Miss Sharecropper\". She was, in fact, basically a tribute act to \"Little Miss Cornshucks\", a novelty blues singer whose act had her dressed as an innocent, unsophisticated, farm-girl:\n\n[excerpt: Little Miss Cornshucks \"Waiting In Vain\"]\n\nLittle Miss Cornshucks seems to have had personal problems that limited her success -- she was an alcoholic and married to a drug dealer -- but she was hugely influential on a lot of the rhythm and blues artists who recorded for Atlantic in the early 1950s, as she was a favourite of the label's owner, Ahmet Ertegun. In particular, Ruth Brown's first hit single on Atlantic, \"So Long\", was a cover version of Cornshucks' local hit version of the song from the forties.\n\nLittle Miss Cornshucks never did particularly well on the national scene, but she was popular enough in Chicago that the club owners wanted to put on an act who could capitalise on that popularity. And so, like Little Miss Cornshucks, Little Miss Sharecropper would go on stage carrying a straw basket, barefoot, in ragged clothes and a straw hat. She was not exactly happy about this act, but she still gave her all in her performances, and quickly established a reputation as an excellent blues singer around the midwest -- first in Chicago and later in Detroit. She also recorded at least a few singles as Little Miss Sharecropper, including this early attempt at jumping on the rock bandwagon:\n\n[Excerpt: Little Miss Sharecropper, \"I Want To Rock\"]\n\nWhile in Detroit, she also played a big part in teaching a young ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-seven of A History of Rock Music in Five Hundred Songs. Today we're looking at LaVern Baker and \"Tweedle Dee\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe Patreon-only episode on Johnnie Ray I mention is here.\n\nThere are no full biographies of LaVern Baker that I know of, but Blue Rhythms: Six Lives in Rhythm and Blues by Chip Deffaa devotes forty-three pages to her, and also has similar-length essays on five more important R&B pioneers.\n\nThere are many compilations of Baker's early work available. This set contains her first four albums in full, and is probably your best bet.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe talked a while back about how the copyright law in the 1950s didn't protect arrange",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}