{
  "guid": "urn:uuid:ef31e75b-d2e7-4013-a17a-1bd7e207c544",
  "link": "https://www.who.int/news/item/16-10-2022-international-association-of-national-public-health-institutes-partners-with-who",
  "a10:author": {
    "a10:name": ""
  },
  "title": "International Association of National Public Health Institutes partners with WHO",
  "description": "<p><p>At the World Health Summit today in Berlin, WHO and the International Association of National Public Health Institutes (IANPHI) signed a Memorandum of Understanding outlining their joint efforts to achieve their common objectives to strengthen public health functions and health emergency preparedness.</p><p>WHO and IANPHI share the same vision that essential public health functions are a comprehensive and cost-effective approach to advance universal health coverage, health security and healthier populations. </p><p>The COVID-19 pandemic underlined the key role of national public health institutes. These institutes are at the forefront of preparedness, detection and response efforts in their respective countries. Through this new agreement, WHO and IANPHI will work together to establish or strengthen the role of national institutes, particularly in emergency preparedness and response.<br /></p>&ldquo;Today&rsquo;s agreement is an historic moment for both organizations,\" said&nbsp;Professor Duncan Selbie, President of the IANPHI. \"Formalizing this aims to&nbsp;strengthen national public health capacity and capability to deliver health gains through prevention and promotion measures, and emergency preparedness and response. IANPHI with its member national public health institutes look forward to this agreement making a real difference to the public&rsquo;s health.\"<p>The strengthened alliance between WHO and IANPHI is critical to ensure that global and regional structures are designed to support national and local capacities and provide the right avenues for collaboration and coordination. Together WHO and IANPHI can leverage each other&rsquo;s capacities to strengthen essential public health functions and emergency preparedness at national level and ultimately promote and protect the health and well-being of people. </p><p>The IANPHI is a network of 111 members in 94 countries and regions. It links and strengthens the government agencies responsible for public health. IANPHI leverages its members&rsquo; expertise to build robust public health systems, promote universal health coverage, address communicable and non-communicable diseases, and strengthen preparedness and response. IANPHI supports strengthening existing national public health institutes and development of new ones in every country.</p></p>",
  "pubDate": "Sun, 16 Oct 2022 09:31:03 Z"
}