{
  "id": "https://bibleinoneyear.org/en/youth/193",
  "title": "Day 193: How to Restore Your Relationships",
  "description": "Psalm 84:1–5, 2 Kings 23:3, Romans 1:1–17. * It is a gift made possible through the life, death and resurrection of Jesus  Here lies the secret of restored relationships – first of restored relationship with God and then all other relationships",
  "pubDate": "Mon, 12 Jul 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/193/?ignore",
  "itunes:duration": "14:19",
  "guid": "enyouth12072021-193",
  "length": 859.48,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 193: How to Restore Your Relationships",
  "itunes:subtitle": "Psalm 84:1–5, 2 Kings 23:3, Romans 1:1–17. * It is a gift made possible through the life, death and resurrection of Jesus  Here lies the secret of restored relationships – first of restored relationship with God and then all other relationships",
  "itunes:summary": "Hans worked his way up from being a miner to owning a number of mines. His eldest son, Martin, was very intelligent and went to university at the age of seventeen. A respectable career as a lawyer lay ahead of him. Suddenly, to his father’s dismay, he cancelled his registration for the law course and became a monk and then a priest.\nMartin wanted to live a righteous life. He fasted for days and spent sleepless nights in prayer, but he was still plagued by his own unrighteousness before a righteous God. Around the age of thirty, as he was studying Romans 1:17, the penny dropped. He later wrote:\n‘I began to understand that in this verse the righteousness of God is that by which the righteous man lives by the gift of God, in other words by faith; and that this sentence, “the righteousness of God is revealed”, refers to a passive righteousness, ie, that by which the merciful God justifies us by faith, as it is written, “The righteous person lives by faith.” This immediately made me feel as if I had been born again and entered through open gates to paradise itself.’\nThis experience occurred 500 years ago. It not only changed his life, it altered the course of human history. He became one of the pivotal figures of western civilisation, the founder of the Reformation – the seedbed for social, economic and political thought. His name, of course, was Martin Luther.\nIn essence, righteousness means a right relationship with God, which leads to right relationships with others. It is a gift made possible through the life, death and resurrection of Jesus. Here lies the secret of restored relationships – first of restored relationship with God and then all other relationships.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 193
}