{
  "id": "https://bibleinoneyear.org/en/youth/75",
  "title": "Day 75: What God Has in Store for You",
  "description": "Psalm 34:17–19, Numbers 4:46,49, 5:5–8, Luke 1:57–79. ’ Salvation means freedom  Sam had an experience of how Jesus Christ sets us free",
  "pubDate": "Wed, 16 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/75/",
  "itunes:duration": "13:08",
  "guid": "enyouth16032022-75",
  "length": 788.11,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 75: What God Has in Store for You",
  "itunes:subtitle": "Psalm 34:17–19, Numbers 4:46,49, 5:5–8, Luke 1:57–79. ’ Salvation means freedom  Sam had an experience of how Jesus Christ sets us free",
  "itunes:summary": "Sam, aged twenty-three, was a militant atheist. He associated himself with the teachings of fervent opponents of faith and religion. One evening, he went online and discovered that Alpha was about to start within easy access of his home. He turned up to our church thinking, ‘I’m going to take down a few irrational Christians here.’\nBut his encounter with the teachings and person of Jesus Christ was not what he expected.\nOn his questionnaire at the end of the course, he wrote, ‘I found the draw of Jesus irresistible and have gone from [being] someone with no faith to someone with an immense hope. To live in a state of non-truth to living in truth is, to me, the difference between being bound to complete freedom.’\nThree months later, he was baptised. He told me, ‘I’m free of my previous life. I was a slave to a lot of things. I was a slave to society, a slave to my peers... But now I’m free to live my life. I’m excited to see what God’s got in store for me.’ Salvation means freedom. Sam had an experience of how Jesus Christ sets us free.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 440
}