{
  "title": "What Happens When Poor Pregnant Women Are Given Medicaid Coverage?",
  "link": "https://freakonomics.com/2015/03/what-happens-when-poor-pregnant-women-are-given-medicaid-coverage/",
  "dc:creator": "Stephen J. Dubner",
  "pubDate": "Mon, 30 Mar 2015 16:09:06 +0000",
  "category": "Freakonomics Blog",
  "guid": "http://freakonomics.com/?p=109910",
  "description": "<p>We&#8217;ll be putting out a new Freakonomics Radio episode later this week on the use of RCTs (randomized controlled trials) in healthcare delivery. It features the work of the MIT economist Amy Finkelstein and her colleagues at J-PAL, and it includes their analysis of what happened when Oregon expanded its Medicaid coverage. If you want to get a head start . . .</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/what-happens-when-poor-pregnant-women-are-given-medicaid-coverage/\">What Happens When Poor Pregnant Women Are Given Medicaid Coverage?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n",
  "content:encoded": "<p>We&#8217;ll be putting out a new <a href=\"https://freakonomics.com/radio/freakonomics-radio-podcast-archive/\">Freakonomics Radio episode</a> later this week on the use of RCTs (randomized controlled trials) in healthcare delivery. It features the work of the MIT economist <a href=\"http://economics.mit.edu/faculty/afink\" target=\"_blank\" rel=\"noopener\"><strong>Amy Finkelstein</strong></a> and her colleagues at <a href=\"http://www.povertyactionlab.org/north-america\" target=\"_blank\" rel=\"noopener\">J-PAL</a>, and it includes their analysis of what happened <a href=\"http://www.nber.org/oregon/publications.html\" target=\"_blank\" rel=\"noopener\">when Oregon expanded its Medicaid coverage</a>.</p>\n<p>If you want to get a head start on this topic, consider a new working paper (<a href=\"http://www.nber.org/papers/w21049?utm_campaign=ntw&utm_medium=email&utm_source=ntw\" target=\"_blank\" rel=\"noopener\">gated</a>) called &#8220;Does Medicaid Coverage for Pregnant Women Affect Prenatal Health Behaviors?&#8221; The authors are <strong>Dhaval M. Dave</strong>, <strong>Robert Kaestner</strong>, and <strong>George L. Wehby</strong>. They didn&#8217;t use an RCT, but they did work hard to answer a tough and worthwhile question in the realm of healthcare delivery. Their conclusion, bolded in the abstract below, is quite counterintuitive (and surely, to some at least, depressing):</p>\n<blockquote><p>Despite plausible mechanisms, little research has evaluated potential changes in health behaviors as a result of the Medicaid expansions of the 1980s and 1990s for pregnant women. Accordingly, we provide the first national study of the effects of Medicaid on health behaviors for pregnant women. We exploit exogenous variation from the Medicaid income eligibility expansions for pregnant women and children during late-1980s through mid-1990s to examine effects on several prenatal health behaviors and health outcomes using U.S. vital statistics data. We find that increases in Medicaid eligibility were associated with increases in smoking and decreases in weight gain during pregnancy. <strong>Raising Medicaid eligibility by 12 percentage-points increased rates of any prenatal smoking and smoking more than five cigarettes daily by 0.7-0.8 percentage point. Medicaid expansions were associated with a reduction in pregnancy weight-gain by about 0.6%.</strong> These effects diminish at higher levels of eligibility, which is consistent with crowd-out from private to public insurance. Importantly, our evidence is consistent with ex-ante moral hazard although income effects are also at play. The worsening of health behaviors may partly explain why Medicaid expansions have not been associated with substantial improvement in infant health.</p></blockquote>\n<p>Just to be clear, weight gain is a good thing when you&#8217;re pregnant; and smoking 5 more cigarettes a day is not. Here&#8217;s how the authors attempt to explain their finding:</p>\n<blockquote><p>One possible explanation for this somewhat counterintuitive finding is that health insurance creates incentives to change health behaviors along with lowering the price of medical care. Insurance lowers the price of treating an illness, for example, an adverse medical outcome for either the mother or child, which may cause a reduction in maternal efforts to prevent the occurrence of such events (ex-ante moral hazard).</p>\n<p>In addition, Medicaid coverage entails an income effect from the saved out-of-pocket expenditures and from spending on health insurance premiums (in the case of substitution of private for public insurance). This income effect may be used to purchase goods that improve infant health, but also goods that may harm infant health (e.g., cigarettes).</p></blockquote>\n<p>Incentives, incentives, incentives.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://freakonomics.com/2015/03/what-happens-when-poor-pregnant-women-are-given-medicaid-coverage/\">What Happens When Poor Pregnant Women Are Given Medicaid Coverage?</a> appeared first on <a rel=\"nofollow\" href=\"https://freakonomics.com\">Freakonomics</a>.</p>\n"
}