{
  "title": "Kenya: ICC Defendant Found Dead",
  "link": "https://www.hrw.org/news/2022/11/02/kenya-icc-defendant-found-dead",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Exterior view of the International Criminal Court in The Hague, Netherlands.\n                    © 2021 AP Photo/Peter Dejong\n          \n\n  \n<p>(Nairobi) – A Kenyan lawyer awaiting a verdict in a witness tampering case before the International Criminal Court (ICC) was found dead in his home in Nairobi on September 26, 2022, Human Rights Watch said today. The Kenyan authorities, with the assistance of the ICC, as appropriate, should promptly, thoroughly, and transparently investigate his death.<br /><br />\nPaul Gicheru, the defendant, had been awaiting a verdict in his trial on witness tampering charges connected to the long-dropped case against Kenyan President William Ruto. Media reported that initial results of a postmortem were inconclusive as to the cause of his death, and Kenyan police continue an investigation. The International Criminal Court terminated the proceedings against Gicheru on October 14, after receiving confirmation of his death.<br /><br />\n“With Paul Gicheru’s death, and the end of the ICC case against him, Kenyans will again be denied a measure of truth, this time about efforts to interfere with getting to the bottom of responsibility for ethnic-based killings and reprisals during Kenya’s 2007-2008 post-election violence,” said Elizabeth Evenson, international justice director at Human Rights Watch. “The Kenyan police should thoroughly and transparently investigate his death.”<br /><br />Claims of witness interference dogged ICC efforts to get to the truth of who was responsible for alleged crimes against humanity during Kenya’s post-2007 elections violence. Gicheru was one of three people who had been sought by the court on witness tampering charges. He surrendered to the court in November 2020; following pre-trial proceedings, his trial began in February 2022 and concluded in July 2022. Two other people remain subject to outstanding arrest warrants.<br /><br />\nDecisions in the case against Ruto and a co-defendant, in which charges were vacated in 2016, suggested that there had been systematic efforts to corrupt witnesses, including through bribery. In late 2014, a defense witness, Meshack Yebei, disappeared and was later found dead; ICC prosecutors in the Gicheru case had named Yebei as an intermediary in what they alleged was a scheme to corrupt witnesses. </p>",
  "pubDate": "Wed, 02 Nov 2022 12:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/02/kenya-icc-defendant-found-dead"
}