{
  "feedburner:origLink": "https://www.brookings.edu/blog/fixgov/2022/11/04/the-independent-state-legislature-theory-will-not-empower-state-legislatures-to-override-presidential-election-results/",
  "title": "The &#8220;independent state legislature theory&#8221; will not empower state legislatures to override presidential election results",
  "link": "http://webfeeds.brookings.edu/~/718517894/0/brookingsrss/topfeeds/latestfrombrookings~The-independent-state-legislature-theory-will-not-empower-state-legislatures-to-override-presidential-election-results/",
  "dc:creator": "Fred Wertheimer",
  "pubDate": "Fri, 04 Nov 2022 15:00:22 +0000",
  "guid": "https://www.brookings.edu/?p=1646515",
  "description": "There is a misconception that needs to be clarified about the potential impact of an upcoming Supreme Court case. That misconception is this—if the “independent state legislature theory” is adopted by the Supreme Court in the case of Moore v. Harper, state legislatures will be empowered to override the choice of voters on Election Day&hellip;<div class=\"fbz_enclosure\" style=\"clear:left\"><a href=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-10-31T133401Z_2143731288_RC2ATW9MRSTK_RTRMADP_3_USA-COURT-TURKEY-PROTESTS.jpg?w=270\" title=\"View image\"><img border=\"0\" style=\"max-width:100%\" src=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-10-31T133401Z_2143731288_RC2ATW9MRSTK_RTRMADP_3_USA-COURT-TURKEY-PROTESTS.jpg?w=270\"/></a></div>\n<div style=\"clear:both;padding-top:0.2em;\"><a title=\"Like on Facebook\" href=\"http://webfeeds.brookings.edu/_/28/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Pin it!\" href=\"http://webfeeds.brookings.edu/_/29/718517894/BrookingsRSS/topfeeds/LatestFromBrookings,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Tweet This\" href=\"http://webfeeds.brookings.edu/_/24/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by email\" href=\"http://webfeeds.brookings.edu/_/19/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by RSS\" href=\"http://webfeeds.brookings.edu/_/20/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" style=\"border:0;margin:0;padding:0;\"></a>&nbsp;&#160;</div>",
  "content:encoded": "<p>By Fred Wertheimer</p>\n<p>There is a misconception that needs to be clarified about the potential impact of an upcoming Supreme Court case.</p>\n<p>That misconception is this—if the “independent state legislature theory” is adopted by the Supreme Court in the case of <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.scotusblog.com/case-files/cases/moore-v-harper-2/\"><em>Moore v. Harper</em></a>, state legislatures will be empowered to override the choice of voters on Election Day in a presidential election.</p>\n<p>That’s not correct.</p>\n<p>Make no mistake, the Court’s decision in <em>Moore v. Harper</em> could dramatically and dangerously rewrite American democracy. <em>Moore v. Harper</em> will be argued before the Supreme Court on December 7. The case involves a gerrymandered North Carolina congressional map that was rejected by the state’s Supreme Court and is being defended by North Carolina legislators. They claim the state court’s decision violates the independent state legislature theory.</p>\n<p>The independent state legislature theory has long been considered by many to be a radical, fringe idea. Simply put, it would prevent state courts from reviewing laws passed by state legislatures to redistrict congressional seats, or to establish voting rules or other laws applicable to federal elections.</p>\n<p>In other words, a state Supreme Court would no longer have the right to decide whether state laws dealing with federal elections comply with the state’s own constitution.</p>\n<p>The federal Constitution gives states the authority to regulate the “manner” of conducting federal elections in the state. When states exercise that authority, their laws have to comply with both federal constitutional requirements and laws (such as the federal Voting Rights Act) as well as state constitutional requirements (like anti-gerrymandering provisions that may be in a state’s constitution). But under the independent state legislature theory, the state legislature would be free to enact state laws to regulate federal elections in the state that would not be subject to review by state courts. In other words, the state legislature would be able to pass laws that are contrary to the state’s own constitution.</p>\n<p>Just three years ago, the Supreme Court in <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.supremecourt.gov/opinions/18pdf/18-422_9ol1.pdf\"><em>Rucho v. Common Cause</em></a>, rejected a request that the Court find another North Carolina redistricting plan to be an unconstitutional partisan gerrymander under the federal Constitution.</p>\n<p>The Court majority rejected that request because it found that the federal Constitution does not set forth judicially manageable standards on what constitutes partisan gerrymandering. But some state Supreme Courts have said that their state constitutions or state laws do bar partisan gerrymandering. And in <em>Rucho</em>, the Supreme Court expressly said that while it would not strike down a redistricting plan on grounds of gerrymandering, there were other remedies that could be pursued, including state courts reviewing the actions taken by state legislatures.</p>\n<p>The majority opinion, written by Chief Justice John Roberts, stated: “Provisions in state statutes and state constitutions can provide standards and guidance for state courts to apply.”</p>\n<p>That position by the Supreme Court in 2019 directly contradicts the independent state legislature theory being advocated in the <em>Moore v. Harper</em> case.</p>\n<p>Furthermore, Chief Justice Roberts was joined in the <em>Rucho</em> opinion by conservative Justices Clarence Thomas, Samuel Alito, Neil Gorsuch, and Brett Kavanaugh, the very Justices who supporters of the fringe independent state legislature theory are relying on to win the case.</p>\n<p>But, given the radical path the Supreme Court majority has been taking, there are no guarantees that this Court will practice what it preached just a few years ago.</p>\n<p>It is, however, important to correct one key misconception regarding the state legislature theory—that if it is accepted by the Supreme Court, it could allow state legislatures to override the choice of voters in presidential elections.</p>\n<p>To understand the independent state legislature theory with regard to presidential elections, we need to understand that in presidential elections, the U.S. Constitution and federal law control when presidential electors are chosen in a state.</p>\n<p>Under <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.law.cornell.edu/constitution/articleii\">Article II of the Constitution</a>, Congress is empowered to choose the “time” when presidential electors will be chosen. Federal law implementing the Article has established that electors are chosen on Election Day, the first Tuesday after the first Monday in November.</p>\n<p>Furthermore, while the Constitution gives state legislatures the power to choose electors, every state legislature has delegated to the voters the power to choose the President by voting for the presidential electors of the candidate they choose. While a state legislature in theory could take this power away from voters prior to Election Day, it is politically unfeasible and would lead to a national firestorm.</p>\n<p>Once electors are chosen on Election Day, state legislatures, under the U.S. Constitution and under implementing federal law, have no authority to replace the choice for electors made by the voters with electors chosen by the state legislature—apart from one loophole contained as part of the 19th-century Electoral Count Act.</p>\n<p>Under that loophole in current law, if a state legislature decides, for whatever reason, that voters have “failed” to make a choice on Election Day, the state legislature can name its own electors after Election Day. This dangerous loophole was brought into sharp focus by former President Donald Trump’s effort to use state legislatures to help overturn the 2020 election.</p>\n<p>Congress, however, is well on its way to closing that loophole.</p>\n<p>Legislation that closes the “failed choice” loophole along with other important reforms has <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://democracy21.org/news-press/press-releases/democracy-21-applauds-house-passage-of-the-presidential-election-reform-act\">passed the House</a> and similar legislation was <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://democracy21.org/news-press/press-releases/electoral-count-reform-act-reported-today-by-senate-rules-committee-in-14-1-vote-is-essential-legislation-to-protect-against-another-presidential-coup-attempt\">reported out of the Senate Rules Committee</a> in September. The Senate legislation, the Electoral Count Reform Act (ECRA), has strong bipartisan support, including 15 Republican sponsors—enough to overcome a filibuster. The bill is expected to be voted on by the full Senate in the lame-duck session following the midterm elections.</p>\n<p>If the ECRA passes and the loophole is closed, state legislatures will then have no authority to override the presidential choice of the voters. Federal law, not state legislatures, will continue to control here, regardless of how the Supreme Court decides the <em>Moore </em>case and the independent state legislature theory. Because federal law would require electors to be chosen only on Election Day if the ECRA passes, state legislatures would have no power to choose different electors after Election Day even if they do not like the choice the voters made on Election Day.</p>\n<Img align=\"left\" border=\"0\" height=\"1\" width=\"1\" alt=\"\" style=\"border:0;float:left;margin:0;padding:0;width:1px!important;height:1px!important;\" hspace=\"0\" src=\"http://webfeeds.brookings.edu/~/i/718517894/0/brookingsrss/topfeeds/latestfrombrookings\">\n<div class=\"fbz_enclosure\" style=\"clear:left\"><a href=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-10-31T133401Z_2143731288_RC2ATW9MRSTK_RTRMADP_3_USA-COURT-TURKEY-PROTESTS.jpg?w=270\" title=\"View image\"><img border=\"0\" style=\"max-width:100%\" src=\"https://www.brookings.edu/wp-content/uploads/2022/11/2022-10-31T133401Z_2143731288_RC2ATW9MRSTK_RTRMADP_3_USA-COURT-TURKEY-PROTESTS.jpg?w=270\"/></a></div>\n<div style=\"clear:both;padding-top:0.2em;\"><a title=\"Like on Facebook\" href=\"http://webfeeds.brookings.edu/_/28/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Pin it!\" href=\"http://webfeeds.brookings.edu/_/29/718517894/BrookingsRSS/topfeeds/LatestFromBrookings,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Tweet This\" href=\"http://webfeeds.brookings.edu/_/24/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by email\" href=\"http://webfeeds.brookings.edu/_/19/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by RSS\" href=\"http://webfeeds.brookings.edu/_/20/718517894/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" style=\"border:0;margin:0;padding:0;\"></a>&nbsp;&#160;</div>",
  "enclosure": "",
  "atom:category": ""
}