{
  "title": "Episode #359:  From &#8220;Beat The Press&#8221; To The Governorship?",
  "link": "https://www.krpoliticaljunkie.com/episode-359-from-beat-the-press-to-the-governorship/",
  "pubDate": "Sat, 06 Feb 2021 03:05:32 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=19527",
  "description": "<p>Sarah Huckabee Sanders hopes her service on behalf of Donald Trump will help her win the governorship in Arkansas.  Meanwhile, while Democrats are unlikely to prevail in next week&#039;s Senate trial of the former president, Republicans are split over what Marjorie Taylor Greene is doing to the party.  Similar intra-GOP struggles are visible in Arizona, which now has two Democratic senators for the first time in nearly 70 years.  And a retirement of a popular senator in Ohio guarantees a dogfight for the seat in 2022.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-359-from-beat-the-press-to-the-governorship/\">Episode #359:  From “Beat The Press” To The Governorship?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Sarah Huckabee Sanders hopes her service on behalf of Donald Trump will help her win the governorship in Arkansas.  Meanwhile, while Democrats are unlikely to prevail in next week&#039;s Senate trial of the former president,",
  "itunes:summary": "Sarah Huckabee Sanders has declared her candidacy for governor of Arkansas, hoping to follow in the footsteps of her father, Mike Huckabee, who also served in that office. Janine Parry of the University of Arkansas says that with a famous name and the likely backing of a former president, she may well be on her way to victory.<br />\nThe impeachment trial of Donald Trump begins on Tuesday and by all indications there is little chance that the Senate will come up with 17 Republicans ready to vote to convict.  The New York Times&#8217; Carl Hulse explores what&#8217;s at stake for now-Minority Leader Mitch McConnell as well as for a party that seems to be torn over Liz Cheney and Marjorie Taylor Greene.<br />\nThe rightwing shift of the GOP is felt not only in Washington but in Arizona, where the party recently censured the widow of John McCain, the current Republican governor, and a former Republican senator.  Ron Hansen of the Arizona Republic reflects on a party that has lost both Senate seats in the past two years and watched a Democrat, Joe Biden, carry the state for the first time since 1996.<br />\nAnd Howard Wilkinson of Cincinnati&#8217;s WVXU reports on the retirement of Ohio Republican Sen. Rob Portman and the fight to win his seat in 2022.<br />\nMusic in this week&#8217;s program<br />\n<a href=\"https://www.youtube.com/watch?v=RiqgTPmkfek\">Daughter by Pearl Jam</a><br />\n<a href=\"https://www.youtube.com/watch?v=wqbEsS5kFb8\">Impeach the President by The Honey Drippers</a><br />\nThe Logical Song by Supertramp<br />\n<a href=\"https://www.youtube.com/watch?v=hbe3CQamF8k\">Massive Attack by Angel</a><br />\n<a href=\"https://www.youtube.com/watch?v=pXP1MSFwMnc\">Out of Time by The Rolling Stones</a><br />\n<a href=\"https://www.youtube.com/watch?v=nOFCTFXn6xE\">Sara Smile by Hall and Oates</a><br />\n&nbsp;<br />\n&nbsp;<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 359,
  "itunes:title": "From \"Beat the Press\" to the Governorship?",
  "itunes:duration": "1:04:19"
}