{
  "title": "Principals vs. Agents &#124; Sam Harris and Marc Andreessen",
  "link": "https://danielmiessler.com/blog/principals-vs-agents/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Sun, 24 Jul 2022 23:09:20 +0000",
  "category": "Politics",
  "guid": "https://danielmiessler.com/?p=138093",
  "description": "Sam Harris just had Marc Andreessen on his show and I heard a concept in the episode that intrigued me. They were talking about their current politics and Marc said he&#8217;s now seeing things according to James Burnham&#8217;s model of Managerial Capitalism, which is an instance of the Principal-Agent problem. The Principal-Agent problem is where owners (Principals) put&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/principals-vs-agents.png\" alt=\"principals-vs-agents\" width=\"650\" height=\"650\" class=\"aligncenter size-full wp-image-138094\" /></p>\n\n<p>Sam Harris just had Marc Andreessen <a href=\"https://www.youtube.com/watch?v=ppgKMz-pqLM\">on his show</a> and I heard a concept in the episode that intrigued me.</p>\n\n<p>They were talking about their current politics and Marc said he&#8217;s now seeing things according to James Burnham&#8217;s model of <a href=\"https://www.amazon.com/Managerial-Revolution-What-Happening-World/dp/0837156785\">Managerial Capitalism</a>, which is an instance of the Principal-Agent problem.</p>\n\n<p>The Principal-Agent problem is where owners (Principals) put managers (Agents) in charge of their businesses or assets, and there are misaligned incentives between the agent and the principal.</p>\n\n<p>Burnham argued in his books in the 1940&#8217;s that there&#8217;s a new type of Capitalism on the rise, powered by managers rather than owners, and that this was a bad thing. Andreesen uses that model to say that our current systems are all horribly broken due to this effect. Basically, government, media, education, etc.&#8212;they&#8217;re all impotent and stagnant because nobody wants to take any risks. Why? Because they&#8217;re all agents, or managers, instead of being owners.</p>\n\n<p>This rhymes strongly with things like <em>Atlas Shrugged</em>, and other Ayn Rand books, where the creators and builders were seen as the heroes while the rest of the world was wasting away in mediocrity and bureaucracy.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p class=\"callout\">I&#8217;m not with you in abandoning current systems until you have a plan for replacing them.</p>\n\n<p>The model resonates with me, which I hope means it has some truth to it. But lots of models have truth to them. And one of the biggest problems I think smart people have is taking a nice model and dialing it from a 6 to a 17&#8212;which turns it from a model to an ideology.</p>\n\n<p>At that point it goes from being a tool to being a lens. Which would be fine if the lens were swapped out with other lenses, but those that tend to fall into this trap want to use that one model for everything, and they reject other models or data that would indicate their model is imperfect.</p>\n\n<p>Sam pushed back on this. He mentioned the danger of worshiping all-powerful &#8220;principals&#8221;, or creators, or owners&#8212;which gets us to a North Korea type situation. Marc pushed back by saying that&#8217;s an extreme, and you can have middle ground where someone decides to create a city, for example, like happened with LA.</p>\n\n<p>Sam&#8217;s other example was Trump being banned by Twitter. He exposed Marc&#8217;s (or at least many Libertarians&#8217;) cognitive dissonance that they usually argue private companies should be allowed to do anything they want, because it&#8217;s their company. Marc responded to this very poorly, basically saying,</p><div class=\"inline-auto-newsletter\"><div class=\"inline-subscribe px-2 pb-8 pt-8 mb-8 border-t border-b\">\n<div class=\"text-lg font-bold\">The UL Newsletter: Finding the Patterns in the Noise…</div>\n<div class=\"text-sm text-gray-700 max-w-lg\">Get a weekly analysis of what's happening in security and tech—<em>and why it matters</em>.</div>\n<div class=\"mt-2\"><form action=\"https://danielmiessler.us8.list-manage.com/subscribe/post?u=6a9e465ab1570df8aaecb2292&id=49fdb7d723\" method=\"post\" name=\"mc-embedded-subscribe-form\" class=\"mc-embedded-subscribe-form validate inline\" novalidate > \n            <div>\n            <div class=\"mc-field-group\">\n            <input  placeholder=\"your best email\" type=\"email\" value=\"\" name=\"EMAIL\" class=\"required email\" id=\"mce-EMAIL\">\n            <input type=\"submit\" value=\"Subscribe\" name=\"subscribe\" id=\"mc-embedded-subscribe\" class=\"button text-system\">\n            </div>\n            <div style=\"position: absolute; left: -5000px;\" aria-hidden=\"true\"><input type=\"text\" name=\"b_6a9e465ab1570df8aaecb2292_49fdb7d723\" tabindex=\"-1\" value=\"\"></div>\n            </div>\n            </form></div>\n</div>\n</div>\n\n<blockquote>\n  <p>It&#8217;s funny when liberals suddenly find libertarianism when it&#8217;s convenient.</p>\n</blockquote>\n\n<p>To be fair, he did say he couldn&#8217;t fully respond because of ongoing litigation, but it definitely felt like a defensive response to Sam uncovering inconsistency in his argument.</p>\n\n<h2>Libertarian nihilism</h2>\n\n<p>As for me, I found the Principals vs. Agents model, and the idea of Managerial vs. Bourgeois Capitalism, to be very interesting. I like the model, and I think it has explanatory power. But I feel like I was exposed to a serious dose of Libertarian Nihilism.</p>\n\n<p>One of Marc&#8217;s main lines in the discussion was having virtually no trust in institutions, and thinking that any trust people do have is undeserved. His solution was new institutions.</p>\n\n<p>That&#8217;s a super opinion to have when you&#8217;re a billionaire. I&#8217;m not anti-billionaire, or anti-wealth. And I agree with his main model for how things are failing. I&#8217;m just saying abandoning trust in our government and media and other core institutions isn&#8217;t a great idea unless there&#8217;s a plan for a replacement.</p><div data-inline-related-post data-inline-related-post-index=2></div>\n\n<p>Rich people with startups in those spaces is not the same thing as a plan.</p>\n\n<p>Anyway, I really enjoyed the conversation. And I especially enjoyed seeing this Thielian type of libertarianism (at least I think this is the same breed) come face to face with someone like Sam. Sam tried to tell him multiple times he wasn&#8217;t some raving Leftist&#8212;that he was just asking logical questions.</p>\n\n<p>If you have any other thoughts on how the discussion went, feel free to reach out.</p>\n</p>"
}