{
  "id": "https://bibleinoneyear.org/en/youth/91",
  "title": "Day 91: Follow Jesus",
  "description": "Psalm 40:1-2,4,8, Numbers 32:11–12, Luke 8:42b–48, 9:1–2,6.  Jesus’ followers are called ‘disciples’  They want to be with him, to know him, to be like him and to do everything that Jesus asks them to do",
  "pubDate": "Thu, 01 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/91/?ignore",
  "itunes:duration": "14:12",
  "guid": "enyouth01042021-91",
  "length": 852.79,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 91: Follow Jesus",
  "itunes:subtitle": "Psalm 40:1-2,4,8, Numbers 32:11–12, Luke 8:42b–48, 9:1–2,6.  Jesus’ followers are called ‘disciples’  They want to be with him, to know him, to be like him and to do everything that Jesus asks them to do",
  "itunes:summary": "Curious to know what all the fuss was about Pippa and I eventually entered the world of Twitter and now Instagram. It is a world where you ‘follow’ other people and are yourselves ‘followed’.\nMany celebrities have huge followings. People become avid spectators of their lives, relationships and lifestyle, diets and fashion choices. They want to know all about them, interact with them and be like them. There is nothing inherently wrong with this. It is natural to want to follow those we admire. Following celebrities on social media can be fun and even enlightening.\nHowever, following people on Instagram or Twitter is one thing; being a true follower of someone is quite another. It means fully devoting yourself to their cause, living by their example and even doing what they tell you to do. Choose the right people to follow. It really does matter who you follow. Millions, for example, followed Hitler, Stalin and Pol Pot. Still today, millions follow evil dictators, terrorists and gang leaders.\nSome people are sceptical about tradition and institutions and do not know whom to follow. The traditional models, which often came from or were championed by our families, institutions and political leaders, have, to some extent, broken down. This leaves many people unsure of who to follow.\nJesus said many times, ‘Follow me.’ Of all the people who have ever lived, Jesus has the largest number of followers. Over 2.4 billion people in the world today profess to follow Jesus. Jesus’ followers are called ‘disciples’. They want to be with him, to know him, to be like him and to do everything that Jesus asks them to do.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 91
}