{
  "title": "Raja Kirik (Ritual Community Music)",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Ritual Community Music",
  "itunes:summary": "Folk, Noise, Electronics, Improvisation – how can radical music help us manifest new possibilities for thinking and imagine new ways of organising community through ritual behaviours, actions and languages?\n\nToday on the podcast Raja Kirik talks through the origins of their collaboration, the practice of bringing traditional Jaranan trance dance into a modern context, and their way of embodying music.\n\nRaja Kirik is a venture through trance dances from east and central Java, Indonesia. Hand built instruments fuse with high energy programmed sounds, producing hammering, transcendental walls of rhythm and texture. With frantic, seemingly endless forward momentum, the music of Raja Kirik inhabits a wide emotional breadth, cycling from disappointment to anger to loneliness.\n\nOn Friday the 10th of June, Raja Kirik will play live at The Toff alongside Rama Parwata, Female Wizard and special guests for Liquid Architecture's Ritual Community Music series.\n\nhttps://liquidarchitecture.org.au/events/raja-kirik-female-wizard-rama-parwata-and-special-guests\n\nRitual Community Music\n10 June 2022\nThe Toff, Melbourne\nPresented by Liquid Architecture\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month.\n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/raja-kirik-ritual-community-music",
  "pubDate": "Tue, 07 Jun 2022 08:00:00 +1000",
  "itunes:duration": "",
  "itunes:explicit": "no"
}