{
  "id": "yt:video:2n2XGNHsKjA",
  "yt:videoId": "2n2XGNHsKjA",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "Can Oxford professor solve Cambridge math interview questions? (ft. @Tom Rocks Maths)",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2022-11-04T15:00:03+00:00",
  "updated": "2022-11-05T13:34:29+00:00",
  "media:group": {
    "media:title": "Can Oxford professor solve Cambridge math interview questions? (ft. @Tom Rocks Maths)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "To prove once and for all that Cambridge is better than O*ford 😤 (just kidding)\n\n** Tom uses \"Oxford professor\" in his videos, so I am just following that. **\n\nTom's channel: https://www.youtube.com/c/TomRocksMaths/featured\n100k Q and A Google form: https://forms.gle/WtpM3HqhkdPuwsbP9\n\nYou might recognize Tom from his Navier-Stokes equations on the Numberphile channel, and he is a tutor at Oxford teaching students at St. Edmund Hall college in Oxford. I just thought it was funny to have a Cambridge student to interview a teacher at Oxford.\n\n**I HAVE TO EMPHASISE THAT THIS IS ON A MUCH MORE DIFFICULT LEVEL THAN THE OTHER QUESTIONS I HAVE HEARD FROM MY FRIENDS. THIS IS AGREED BY MY FRIENDS, SO IT'S NOT JUST ME SAYING MINE ARE HARDER.**\n\nI am a fourth-year Cambridge math student, and so I thought I would share with you the interview questions that I have gone through! I have signed a sort of NDA for not disclosing the exact interview questions, but it has now been 4 years since my last interview, so it is fine!\n\nActually, my interviewer knows about this channel, but I am not sure whether he watches it or not. I hope I don't get into trouble, because in the spirit of the confidentiality agreement I signed, I should be able to disclose the details of the interview questions now. It has been 4 years since my interview, so unless they are so uncreative to come up with new interview questions, I think this should be fine.\n\nA bit of notes:\n\n(1) Sorry for a lot of the technical glitches - we were very unlucky, because Tom has also used the same setup in his exam series without any problems.\n\n(2) There is an organ playing in the background - they are practising for the evening service at the college! If you don’t like it, I’m sorry; if you like it, consider it background music.\n\n(3) For Cambridge applicants: the interview format differs from college to college. If you are interviewing for St John’s, there are separate pure and applied interviews; for Trinity (which I strongly discourage any potential applicants to apply to, simply due to the competitive nature), your interview will be based on some questions you’ve attempted in a test prior to the interview. However, because of COVID, I am not sure if all these have changed.\n\n(4) For the people who are here for the maths: for the second question, what I meant to say was that because there are 999 consecutive integers, when you shift by one place, then you are either (a) adding an even number and deleting an odd number, or (b) adding an odd number and deleting an even number.\n\nIn the case of (a), adding an even number does not change the number of primes, but deleting an odd number might or might not decrease the number of primes by 1, so the number of primes in the interval either changes by 0 or -1.\n\nIn the case of (b), deleting an even number again does not change the number of primes, but adding an odd number might or might not increase the number of primes by 1, so the number of primes in the interval either changes by 0 or +1.\n\nActually, even if it is 1000 integers, a similar argument applies, though I would say this parity argument is slightly more complicated. Anyway, the idea is that initially you have more than 10 primes, and then you have also constructed an interval with exactly 0 prime, so somewhere in between, there must be an interval with exactly 10 primes, because every time you are only either changing the number of primes by +1,0, or -1.\n\nVideo chapters:\n00:00 Introduction\n01:24 First question: graph sketching\n08:54 Second question (Part I): 0 prime\n19:59 Second question (Part II): 10 primes\n29:47 Third question: physics\n50:04 Final point: SAQ (now called My Cambridge)\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\nMerch: https://mathemaniac.myspreadshop.co.uk\nKo-fi: https://ko-fi.com/mathemaniac [for one-time support]\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}