{
  "id": "yt:video:ZJ2MbOB4LMI",
  "yt:videoId": "ZJ2MbOB4LMI",
  "yt:channelId": "UCccafaIN6dwBwyl1cwNH90w",
  "title": "Is the psychedelic experience necessary for therapeutic benefits? | Psychedelics without the trip?",
  "link": "",
  "author": {
    "name": "The Psychedelic Scientist",
    "uri": "https://www.youtube.com/channel/UCccafaIN6dwBwyl1cwNH90w"
  },
  "published": "2021-01-02T19:56:17+00:00",
  "updated": "2022-06-28T22:27:34+00:00",
  "media:group": {
    "media:title": "Is the psychedelic experience necessary for therapeutic benefits? | Psychedelics without the trip?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This is a question that might surprise some. \n\nYou might think, 'What? Of course it's necessary. How could it not be?\"\n\nBut this is a question that is earnestly being investigated and contemplated, both in the academic world and in industry.\n\nIt has great relevance - some people simply aren't ready for a psychedelic experience, or are not in a physical condition to risk a trip (for example think of older adults who have ongoing health concerns regarding their heart, etc.). If we were able to somehow create psychedelics that activated similar responses in the brain and produced positive benefits without the trip, that would be very useful in clinical settings.\n\nIn this video I dive into the main arguments on both sides of this question and come to what I think is a reasonable answer.\n\nDrop a comment with any opinions on the matter, happy to hear them!\n\n---\nThe amazing editing in this video was done by Anthony Liscio of http://havencreative.studio/, and sponsored by Mindleap Health (https://mindleap.health/)\n\nMindleap Health is a mental health platform for psychedelic integration. They provide easy access to mental health specialists (via your smartphone) to help you get the most out of your psychedelic trip. Check them out! \n\n---\n\nMy t-shirt is from The Flying Sage - go check them out as well for some awesome psychedelic apparel! https://theflyingsage.ca/\n\n---\n\nDon't forget to follow me on social media for all the latest updates. Especially Instagram where I post the most!\n\nInstagram\nhttps://www.instagram.com/thepsychede... \n\nTwitter\nhttps://twitter.com/ThePsychedSci\n\nFacebook\nhttps://www.facebook.com/The-Psychede... \n\nMore info about me:\n\nManesh Girn is a Neuroscience PhD student at McGill University and has been lead or co-author on over a dozen scientific publications and book chapters on topics including psychedelics, meditation, daydreaming, and brain networks. \n\nManesh currently has ongoing collaborations with Robin Carhart-Harris and others at the Imperial College Center for Psychedelic Research and is investigating the brain changes underlying psilocybin, LSD, and DMT.\n\nhttps://twitter.com/MGirnNeuro\nhttps://www.researchgate.net/profile/...",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}