{
  "title": "#445: Less Than Prefect (OOTP Chapter 10, Luna Lovegood)",
  "link": "https://audioboom.com/posts/7446704",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5220,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Vanessa from <a href=\"http://www.harrypottersacredtext.com/\">Harry Potter and The Sacred Text</a> joins us!</li>\n<li>MuggleMail covers feedback from our recent holiday gift suggestion episode!</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix - Chapter 10: Luna Lovegood</li>\n<li>7-Word Summary: Chaos reigns during the journey to Hogwarts</li>\n<li>James and Lily, Molly and Kreacher, Ron and Hermione: what's up with Harry's dreams?</li>\n<li>On your own head be it - did Sirius' trip to King's Cross cost him his life?</li>\n<li>Shouldn't Mad-Eye Moody have been more concerned about Sturgis Podmore's recent absences?</li>\n<li>Harry's isolation continues aboard the Hogwarts Express</li>\n<li>Welcome to the Potter series, Luna Lovegood! Why do so many fans identify with Luna?</li>\n<li>Luna's clearly an outcast, just like Harry, Ron, Hermione and Neville, so why do they treat her differently?</li>\n<li>We tell the story of how Evanna Lynch found out about the role of Luna Lovegood</li>\n<li>Harry gets caught in a compromising situation by Cho. We've all been there with our crush, right?</li>\n<li>What do we make of the new prefects from Slytherin, Ravenclaw and Hufflepuff?</li>\n<li>Is there any truth to the stories in The Quibbler?</li>\n<li>We discuss how J.K. Rowling laid the foundation for Dumbledore's Army in this chapter!</li>\n<li>\"Dogging your steps!\" Does Draco really know the truth about Sirius?</li>\n<li>Continued Isolation: Why is Harry the only one who can see Thestrals?</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: Who is the first Gryffindor selected at this year's Sorting Ceremony?</li>\n<li>Join our community at <a href=\"http://www.Patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! In the latest bonus episode we discuss theories surrounding Draco's promotion to Prefect.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 09 Dec 2019 17:32:38 +0000",
  "guid": "tag:audioboom.com,2019-12-09:/posts/7446704",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}