{
  "title": "Automated segmentation of microvessels in intravascular OCT images using deep learning. (arXiv:2210.00166v2 [eess.IV] UPDATED)",
  "link": "http://arxiv.org/abs/2210.00166",
  "description": "<p>To analyze this characteristic of vulnerability, we developed an automated\ndeep learning method for detecting microvessels in intravascular optical\ncoherence tomography (IVOCT) images. A total of 8,403 IVOCT image frames from\n85 lesions and 37 normal segments were analyzed. Manual annotation was done\nusing a dedicated software (OCTOPUS) previously developed by our group. Data\naugmentation in the polar (r,{\\theta}) domain was applied to raw IVOCT images\nto ensure that microvessels appear at all possible angles. Pre-processing\nmethods included guidewire/shadow detection, lumen segmentation, pixel\nshifting, and noise reduction. DeepLab v3+ was used to segment microvessel\ncandidates. A bounding box on each candidate was classified as either\nmicrovessel or non-microvessel using a shallow convolutional neural network.\nFor better classification, we used data augmentation (i.e., angle rotation) on\nbounding boxes with a microvessel during network training. Data augmentation\nand pre-processing steps improved microvessel segmentation performance\nsignificantly, yielding a method with Dice of 0.71+/-0.10 and pixel-wise\nsensitivity/specificity of 87.7+/-6.6%/99.8+/-0.1%. The network for classifying\nmicrovessels from candidates performed exceptionally well, with sensitivity of\n99.5+/-0.3%, specificity of 98.8+/-1.0%, and accuracy of 99.1+/-0.5%. The\nclassification step eliminated the majority of residual false positives, and\nthe Dice coefficient increased from 0.71 to 0.73. In addition, our method\nproduced 698 image frames with microvessels present, compared to 730 from\nmanual analysis, representing a 4.4% difference. When compared to the manual\nmethod, the automated method improved microvessel continuity, implying improved\nsegmentation performance. The method will be useful for research purposes as\nwell as potential future treatment planning.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Lee_J/0/1/0/all/0/1\">Juhwan Lee</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Kim_J/0/1/0/all/0/1\">Justin N. Kim</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Gomez_Perez_L/0/1/0/all/0/1\">Lia Gomez-Perez</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Gharaibeh_Y/0/1/0/all/0/1\">Yazan Gharaibeh</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Motairek_I/0/1/0/all/0/1\">Issam Motairek</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Pereira_G/0/1/0/all/0/1\">Ga-briel T. R. Pereira</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Zimin_V/0/1/0/all/0/1\">Vladislav N. Zimin</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Dallan_L/0/1/0/all/0/1\">Luis A. P. Dallan</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Hoori_A/0/1/0/all/0/1\">Ammar Hoori</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Al_Kindi_S/0/1/0/all/0/1\">Sadeer Al-Kindi</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Guagliumi_G/0/1/0/all/0/1\">Giulio Guagliumi</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Bezerra_H/0/1/0/all/0/1\">Hiram G. Bezerra</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Wilson_D/0/1/0/all/0/1\">David L. Wilson</a>"
}