{
  "title": "S02.15: Romance Recommendations: Stump Jen & Sarah Part 2",
  "category": [
    "AMA",
    "interstitial",
    "romance recommendations",
    "S02 - Interstitials"
  ],
  "dc:creator": "Jennifer Prokop",
  "pubDate": "Wed, 18 Dec 2019 05:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2019/12/14/s0215-romance-recommendations-stump-jen-amp-sarah-part-2",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5df58d801bd90e41f93aa08f",
  "description": "<p class=\"\">Don’t forget to subscribe to the podcast in your favorite podcasting platform — and while you’re there, please leave us a like or a review!</p><p class=\"\">Next week, we’re releasing a little stocking stuffer for our Christmas Day episode, but we’re back in business on January 1, with the seasonally appropriate (at least in title) <em>Born in Ice</em>, by none other than the queen herself, Nora Roberts. Read <em>Born in Ice </em>at <a href=\"https://amzn.to/2Pw5gLI\">Amazon</a>, <a href=\"https://www.barnesandnoble.com/w/born-in-ice-nora-roberts/1100316778#/\">Barnes & Noble</a>, <a href=\"https://books.apple.com/us/book/born-in-ice/id357914515?app=itunes&at=1l3vpAR&mt=11\">Apple Books</a>, <a href=\"https://www.kobo.com/us/en/ebook/born-in-ice-1\">Kobo</a> or <a href=\"https://www.indiebound.org/book/9780515116755\">your local indie</a>.</p><p class=\"\"><strong>Question 1:</strong> Beth from Milwaukee asked, \"I'm going to Iceland in December for my 10th wedding anniversary! I obviously need a book that has snow/cold and using body heat and -ahem- other activities for warmth. Bonus points if a volcano or other geological feature is a part of the story! Sub genre is not important, and yes I'm aware of the <a href=\"https://amzn.to/36BBA6K\">Ice Planet Barbarians</a>.\"</p><p class=\"\"><strong>Our recommendations:</strong> From the deep recesses of Jen's brain, the only romance she can think of with a volcano, <a href=\"https://amzn.to/2sEk4zO\">Eden Burning by Elizabeth Lowell</a>. And that's from the 80s, so fair warning that it's likely to have problematic elements. When it comes to snuggly, warm, only one bed romances, you just need to use the internet! But <a href=\"https://www.kirkusreviews.com/features/one-bed-romance-close-quarters/\">Jen did write a piece about Only One Bed for Kirkus</a>, which you should read. In the meantime, go watch <a href=\"https://youtu.be/cmQDIne3CLo\">Joe versus the Volcano</a>, and then talking about Hawaii reminded Sarah of some bananas sounding book by Anne Stuart called <a href=\"https://amzn.to/2Pv2NSQ\">Tangled Lies</a>. But a few snowy romances: <a href=\"https://amzn.to/2EswEoI\">Beary Christmas Baby</a> by Sasha Devlin or <a href=\"https://amzn.to/2Epgxbr\">How the Dukes Stole Christmas</a>.</p><p class=\"\"><strong>Question 2:</strong> Emily from Washington D.C. want our opinion aobut \"the BEST star crossed lovers trope (it always gets me so good).\"</p><p class=\"\"><strong>Our Recommendations: </strong>The reason Sarah thinks that star-crossed lovers have to end up unhappy is Romeo and Juliet, of course. But Jen thinks you should try <a href=\"https://amzn.to/36GYutm\">Luck of the Draw by Kate Clayborn</a> and Sarah recommends <a href=\"https://amzn.to/2YUXEXa\">Long Shot by Kennedy Ryan</a>, but comes with a whole suitcase of content warnings for domestic violence. In the interim, Jen read and recommends <a href=\"https://amzn.to/2sElMRK\">Forbidden Promises by Synithia Williams</a>, the heroine falls in love with her sister's ex-husband! And of course, coming in the summer of 2020 comes <a href=\"https://amzn.to/2YWiaqx\">Daring and the Duke</a> by Sarah, which will also work. But you have to wait!</p><p class=\"\"><strong>Question 3:</strong> Megumi from San Antonio, TX is looking for \"a contemporary of someone not Scottish going to Scotland and finding love. (Maybe England but mostly Scotland)\"</p><p class=\"\"><strong>Our Recommendations:</strong> Jen lost her mind and said <a href=\"https://amzn.to/2rLUYPN\">Unfixable by Tessa Bailey</a>, but Willa is a heroine who goes to Ireland. She thinks it still counts. Sarah recommends a novella by Sophie Jordan called \"In a Stranger's Bed\" which was a Goldilocks retelling published in <a href=\"https://www.amazon.com/Glamour-AL-Jackson/dp/1973722364\">the Glamour anthology</a> but which is currently unavailable so come on Sophie, get it together and put your stories up because they are ON FIRE. A few others you can try: <a href=\"https://amzn.to/2S1uJ2d\">A Duke by Default by Alyssa Cole</a>, the <a href=\"https://amzn.to/2PSiJO8\">Under the Kilt series by Melissa Blue</a>, <a href=\"https://amzn.to/35xheLA\">Getting Hot with the Scot by Melonie Johnson</a>, and <a href=\"https://amzn.to/2rWN99R\">Ten Days With the Highlander by Hayson Manning</a>. Also, we didn't know what Adriana Herrera had up her sleeve when we recorded, but <a href=\"https://amzn.to/36I0n9c\">Mangos & Misteltoe</a> is ADORABLE, and features to delicious Dominican heroines falling in love on a Scottish Baking Show. It's also a perfect holiday romance!</p><p class=\"\"><strong>Question 4:</strong> Becca wants \"a funny contemporary, a true romcom, minimal trauma.\"</p><p class=\"\"><strong>Our recommendations</strong>: Jen thinks it doesn't exist. Sarah recommends going old school to Jennifer Crusie or Susan Elizabeth Phillips. If it helps, you should know that later this season, we'll be talking about Bet Me and Nobody's Baby But Mine. After we recorded, Sarah realized she should have recommended Christina Lauren, who she adores, and who she believes is one of the few authors writing real RomCom. If you haven't read <a href=\"https://amzn.to/35wv4xZ\">Josh & Hazel's Guide to Not Dating</a>, it's a very funny, very romantic friends-to-lovers romance! \"What happened to romantic comedy\" is an existential question for our time.</p><p class=\"\"><strong>Question 5:</strong> Laurel from NC wants a book that \"Has marriage of convenience, preferably historical.\"</p><p class=\"\"><strong>Our recommendations:</strong> Sarah says Sherry Thomas better than everyone and recommends <a href=\"https://amzn.to/36MUqro\">Ravishing the Heiress</a>. Jen thinks <a href=\"https://amzn.to/36IZsp2\">The Duke Buys a Bride</a> by Sophie Jordan might work. Sarah points out that in order to qualify, the marriage has to happen pretty early in the story. The marriage has to be part of the plot the whole time. Once again, there are so many of these we had trouble thinking of them on the spot, but in hindsight, Sarah would like you not to miss Amalie Howard's <a href=\"https://amzn.to/2Epxpig\">The Beast of Beswick</a> or Scarlet Peckham's <a href=\"https://amzn.to/35zfj9E\">The Duke I Tempted</a>. Bonus story from Jen about a Sherry Thomas YA book about Mulan called The Magnolia Sword.</p><p class=\"\"><strong>Question 6:</strong> Cara from Finland wants a book that \"Has chosen families strongly included in the plot. Extra points if it's enemies-to-lovers with the heroine's family ready to kick the pining-but-unfortunately-dumbass hero's butt.\"</p><p class=\"\"><strong>Our recommendations:</strong> Whoa! That's a lot of asks all at once. Just reread IAD, Cara! This is the plot of Sarah's book <a href=\"https://amzn.to/36HHBPg\">A Scot in the Dark,</a> so that's a good place to start. Lots of rock star romances have chosen family, try Kristen Callihan's series, and <a href=\"https://amzn.to/2M4mkHs\">Managed</a> will be a book that blooded Jen later this season. It's not linked via heroines, but Elle Kennedy's <a href=\"https://amzn.to/2YXwsqQ\">Hotter than Ever</a> is bonkers sexy, a MMF menage, and has lots of found Navy SEAL family. In historicals, there are lots of sisterhood/brotherhood books. Try the Wallflowers series by Lisa Kleypas, or Lorraine Heath's <a href=\"https://amzn.to/2S3PTNg\">Scoundrels of St. James</a>!</p><p class=\"\"><strong>Question 7:</strong> Krystal from New Jersey is looking for \"Childhood friends to lovers - historical! Where the Male is titled and the woman is not!\"</p><p class=\"\"><strong>Our recommendations:</strong> There are so many that will work here. Sarah recommends Tessa Dare's first series, the Wanton Dairymaids (!!!) should work, try <a href=\"https://amzn.to/2YX9kJ2\">Godess of the Hunt</a>. After recording, of course, a bunch of books came to mind! Try Kelly Bowen's <a href=\"https://amzn.to/2RZmhRf\">You're the Earl That I Want</a>, Vanessa Riley's <a href=\"https://amzn.to/35rXxF7\">The Butterfly Bride</a>, and Loretta Chase's <a href=\"https://amzn.to/2EqFYtb\">Last Night's Scandal</a>.</p><p class=\"\"><strong>Question 8:</strong> Rosalie from the Chicago suburbs wants books she \"can recommend to my 15 year old son. Have thought about Sarina Bowen’s Ivy Years. Although LJ Shen “Sinner of Saints” series is high school, seems too dark/gritty and I think he would not be able to suspend reality for some of the story lines given he is the same age.\"</p><p class=\"\"><strong>Our Recommendations: </strong>Sarah thinks the Sarina Bowen series you mentioned should work just fine. Adult romances that are adventure stories might work are the <a href=\"https://amzn.to/2r13ABv\">Hidden Legacy series</a>by Ilona Andrews and <a href=\"https://amzn.to/2rVORZ8\">Polaris Rising by Jessie Mihalik</a>. Some actual YA Romance that Jen likes are <a href=\"https://amzn.to/2rMye27\">The Way You Make me Feel</a> and <a href=\"https://amzn.to/2S1eZwj\">I Believe in a Thing Called Love</a>, which are both by Maurene Goo. One of Jen's favorite YA books of all time is called <a href=\"https://amzn.to/2r0z1Mi\">The Disreputable History of Frankie Landau-Banks</a>. She also recommneds <a href=\"https://amzn.to/2M3eLB9\">Not if I Save You First by Ally Carter</a>. Some sports romances we recommend are the WAGS series by Naima Simone, especially <a href=\"https://amzn.to/38KnLoh\">Scoring Off the Field</a>. Finally, <a href=\"https://amzn.to/2PToQ4G\">The Deal by Elle Kennedy</a> might be a good choice.</p><p class=\"\"><strong>Question 9:</strong> Jemma from Texas is looking for \"Found family. Also with lots of good food descriptions. Not necessarily a chef romance though (they stress me out because chefs stay up so late at night; ugh, who does that?)\"</p><p class=\"\"><strong>Our recommendations:</strong> This is such a perfect question for Sarah. She recommends the <a href=\"https://amzn.to/2EsZy84\">Recipe for Love series by Louisa Edwards</a>. Another series by the same author is called the <a href=\"https://amzn.to/2YWfgC8\">Rising Star Chefs</a>. <a href=\"https://amzn.to/2qXG6gy\">The Opposite of You by Rachel Higginson</a> will work. Finally, <a href=\"https://amzn.to/38Sve51\">American Dreamer by Adriana Herrera</a>, and a series by <a href=\"https://amzn.to/35seOxU\">Sabrina Sol</a>. In hindsight, Sarah basically only recommended books with chefs in them. She's sorry. She has a problem.</p><p class=\"\"><strong>Question 10:</strong> Sara from Albuquerque wants a \"Bodyguard trope where the person being guarded does NOT spend the whole book trying to escape the bodyguard because he/she doesn't think there is any danger even though it's incredibly obvious to everyone else. Bonus if the bodyguard character is female.\"</p><p class=\"\"><strong>Our recommendations: </strong>Jen recommends <a href=\"https://amzn.to/35wQmvq\">Sexy/Dangerous</a> (female bodyguard) by Beverly Jenkins, which is fabulous. Nana Malone has a few, one in her royals seris, and another is <a href=\"https://amzn.to/35wQmvq\">Bodyguard to the Billionaire</a> (female bodyguard) -- also, <a href=\"https://fatedmates.net/episodes/2019/6/27/165-royals-interstitial\">listen to Nana talk about Royal Romance on an interstitial last season!</a>. And! Try HelenKay Dimon's <a href=\"https://amzn.to/35wqAYh\">Leave Me Breathless</a>(female bodyguard), Katee Robert's <a href=\"https://amzn.to/36LYaK0\">Thalanian Dynasty series</a> (male bodyguard/MMF menage) and Anna Zabo's <a href=\"https://amzn.to/2M2Rm2M\">Reverb</a> (trans male bodyguard).</p><p class=\"\"><strong>Question 11:</strong> Molly from Washington has an AMA question about how to organize her Kindle books. She is also looking for a book that \"Features a Grumpy/terse older brother’s friend (or older brother of friend) with smart mouth heroine, bonus points for SUPER HOT, some sort of road trip, or problem they have to solve much to their reluctance (trapped on a desert island?) basically Bowen and Mari 😂\"</p><p class=\"\"><strong>Our answer: </strong>: <a href=\"https://twitter.com/JenReadsRomance/status/1080139561739661312\">Jen wrote a long thread about how she organizes her Kindle</a>, which you should just read on Twitter. But it takes a lot of time, so clear a day to do it! For the grumpy road trip question, Sarah recommends <a href=\"https://amzn.to/2Py7GL4\">Right by Jana Aston</a>. This is the second book in a series, the first one is called Wrong and you don't have to read them in order. Also, don't miss Tessa Bailey's <a href=\"https://amzn.to/34uCWPk\">Staking His Claim</a> or <a href=\"https://amzn.to/2PT4QPy\">Fix Her Up</a>! Maybe try Mister McHottie by Pippa Grant. And...have you listened to our <a href=\"https://fatedmates.net/episodes/2019/1/18/55-road-trip-interstitial\">Road Trip interstitial</a>?</p><p class=\"\"><strong>Question 12: </strong>Hero from Paris, France (not Texas!) wants to know what trope would be, and then some books that take you on a \"yellow brick road of emotions.\"</p><p class=\"\"><strong>Our Recommendations: </strong>We ended up talking about the last books that made us cry. The last book Sarah read that made her cry was <a href=\"https://amzn.to/36LaDNQ\">Sinner by Sierra Simone</a>. For Jen, it was <a href=\"https://amzn.to/2PUcGbR\">The Bride Test by Helen Hoang</a>. Jen also thinks Sarah's books are pretty emotional, so start off with her first, <a href=\"https://amzn.to/2PWb2pT\">Nine Rules to Break When Romancing the Rake.</a> Finally, <a href=\"https://amzn.to/2to04BX\">The Madness of Lord Ian MacKenzie by Jennifer Ashley</a> or <a href=\"https://amzn.to/38NSMba\">Escorted by Claire Kent</a>. Also, we're going to read Alexis Hall's <a href=\"https://amzn.to/2Pvz10b\">For Real</a> as a book that blooded Sarah, so stay tuned for that!</p><p class=\"\"><strong>Question 13: </strong>Chris from Seattle wants to know how we keep track of all these books! Also, a book that \"starts with the main character in jail.\"</p><p class=\"\"><strong>Our recommendations:</strong> Jen recommends the book <a href=\"https://amzn.to/2YZ693F\">Hard Time by Cara McKenna</a>. The entire Devil's Rock series by Sophie Jordan is fantastic, and the first one is actually called <a href=\"https://amzn.to/35rEniF\">All Chained Up</a>, but you're going to want to read them all. Sarah recommends <a href=\"https://amzn.to/38SDr9l\">My One and Only Duke by Grace Burrowes</a>, which starts with the hero in Newgate. Another historical with the hero in jail is <a href=\"https://amzn.to/34u6o7V\">The Highwayman by Kerrigan Byrne</a>. <a href=\"https://amzn.to/2PYBNKz\">Hold by Claire Kent</a> starts with both characters on a prison planet, and there is also an <a href=\"https://amzn.to/2PZdImI\">entire series of prison planet books by Emmy Chandler</a>.</p><p class=\"\"><strong>Question 14:</strong> Emily wants to know \"How do you find time to read as much as you do? I’m a fast reader but can never seem to carve out enough time to read as much as I want.\" And also is looking for recommendations for books that are \"deeply, utterly romantic and swoony and leaves you with a PROFOUND book hangover. Great, sexy banter is a plus!\"</p><p class=\"\"><strong>Our recommendations:</strong> Jen doesn't watch TV and Sarah starts a book every day. <a href=\"https://twitter.com/JenReadsRomance/status/1150220499840098305\">Don't be afraid to DNF!</a> Book wise, Jen knows a book is a real winner if she rereads it, and some of her favorites are <a href=\"https://amzn.to/2YWeTHE\">Everything I Left Unsaid</a> and <a href=\"https://amzn.to/2Z8pRKx\">The Truth About Him</a> by Molly O'Keefe (famously, this is the only duology/book with a cliffhanger that Jen has ever finished!), <a href=\"https://amzn.to/36GG6AI\">Thirsty by Mia Hopkins</a>, <a href=\"https://amzn.to/35wZ5xF\">Never Sweeter by Charlotte Stein</a>, and she also rereads <a href=\"https://amzn.to/36Ksdl9\">a lot of Kresley Cole</a>. Sarah recommends <a href=\"https://amzn.to/2PTDhpu\">Three Little Mistakes by Nikki Sloane</a>.</p><p class=\"\"><strong>Question 15: </strong>Rosa, Daughter of Mexican immigrants living in Oakland, CA wants to know \"Is a historical romance where both main characters are people of color. Does this exist?\"</p><p class=\"\"><strong>Our recommendations: </strong>Some #OwnVoices historical authors you should check out are <a href=\"https://amzn.to/2EtPUC8\">Beverly Jenkins</a>, <a href=\"https://amzn.to/2RZYbFQ\">Alyssa Cole</a>, <a href=\"https://www.goodreads.com/author/show/14248946.Rebel_Carter\">Rebel Carter</a>, <a href=\"https://vanessariley.com/\">Vanessa Riley</a>, and <a href=\"https://amzn.to/2PUhlKS\">Piper Huguley</a>. Lydia San Andres has several historicals with Latinx characters, start with <a href=\"https://amzn.to/2M5f1zs\">A Summer for Scandal</a>. Also, check out <a href=\"https://amzn.to/38OxDh2\">the Decades series, which are African-American historicals that focus on each decade of American history.</a> Each book has a different author, so you can check out lots of new writers. <a href=\"https://amzn.to/2M5fHF0\">Jeannie Lin</a> writes luscious historicals set in China. Forthcoming in 2020, Diana Quincy is coming out with books that feature Middle Eastern characters.</p><p class=\"\"><strong>Question 16: </strong>Rachel from Kansas asks for a book that \"Features a heroine who had breast cancer. Your podcast has helped me through my recovery.\"</p><p class=\"\"><strong>Our recommendations:</strong> Jen recommends <a href=\"https://amzn.to/2PvPTE3\">Hooked on You by Kate Meader</a> which has a heroine had a double mastectomy. She is in recovery and does have a cancer scare after finding a lump in her armpit, but it is not cancer. Sarah recommends <a href=\"https://amzn.to/2PXFlfY\">a contemporary by Brenna Aubrey called At Any Moment</a>, and then <a href=\"https://amzn.to/2S1WzeX\">When the Duke was Wicked,</a> which is a historical by Lorraine Heath which is based on extensive medical research that is accurate to the time period. Although it's not breast cancer, Sarah references a Nikki Sloane book where the hero is recovering from cancer in another question on today's episode, and that one was Three Little Mistakes.</p><p class=\"\"><strong>Question 17:</strong> Katrin from London would \"like a book where the hero has a smaller 🍆 (penis).\"</p><p class=\"\"><strong>Our recommendation: </strong>Jen has one that she could think of, which is <a href=\"https://amzn.to/36ID92I\">A Matter of Disagreement by E.E. Ottoman</a>. But that is a difficult request! We are going to keep thinking about it.</p><p class=\"\"><strong>Our last AMA</strong> was from Rosa, who also asked about historical romance with people of color, and she wants to know about the process of cover design.</p><p class=\"\"><strong>Our answer:</strong> Sarah talked about the process and <a href=\"https://www.kirkusreviews.com/features/reese-ryan/\">Jen described what she learned in her conversation with Reese Ryan</a>. Sarah talked about how she does give some advice on colors and why the people in the art department needs visual information for making the best cover. For <a href=\"https://amzn.to/2S2YkIT\">The Day of the Duchess</a>, Sarah sent a photo of Cate Blanchette as guidance. Inspired by this quesiton, Jen did contact Harlequin and is interviewing someone at Harlequin about their cover design process, and that will be published at Kirkus in January 2020.</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Listeners attempt to stump Jen and Sarah.",
  "itunes:summary": "It’s the second half of our recommendation podcast! We asked you to ask us for recommendations, and thought it would be fun to recommend on the fly—absolutely no preparation! Instead, we met up at Sarah’s apartment and read your questions sight-unseen (thanks to @bestfriendkelly for collecting them!). What ensued is a killer list of romances that you should all read! And if you missed the first half — head back and listen! \n\nDo not miss the show notes this week, y’all. Really.",
  "itunes:explicit": "yes",
  "itunes:duration": "01:04:45",
  "itunes:image": "",
  "itunes:season": 2,
  "itunes:episode": 15,
  "itunes:title": "S02.15: Romance Recommendations: Stump Jen & Sarah Part 2",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S02.15: Romance Recommendations: Stump Jen & Sarah Part 2"
  }
}