{
  "title": "89: Matt Shepard Is a Friend of Mine",
  "link": "https://audioboom.com/posts/7291795",
  "itunes:episode": 89,
  "itunes:title": "Matt Shepard Is a Friend of Mine",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3388,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On October 7, 1998, University of Wyoming student Matthew Shepard was brutally beaten, tied to a fence and left to die because he was gay. It was one of the most notorious hate crimes in US history. Years later, Michele Josue, a close friend of Matt's, revisits the shocking case with never-before-seen photos and rare video footage as Matt's all-too-brief life is remembered through the vivid testimonies of his family and closest friends.  Through the film, new revelations about the murder are revealed and the notions of forgiveness, loss, and redemption are explored by those who were there. <br>\n<br>\n<strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon famand</a> instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!<br>\n<br>\n</a><a href=\"https://www.patreon.com/TrueCrimeObsessed/posts\">Check our our TCO After Party to hear our recap of our recap!</a> We go DEEP on Patrick's connection to the Matthew Shepard case, the book he helped write about it and the SUPER FANCY DIRECTOR he worked with on a production of The Laramie Project!<br>\n<br>\n\n</div>\n<div>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong></a><strong> </strong>Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <strong>All ticket holders are welcome to join Patrick on a FREE walking tour of the West Village on the morning of the show!</strong> He'll show you all the spots from the gay liberation movement, old New York movies, and even Sex and the City--all within a few blocks! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets to the Pride Show here!<br>\n</a><br>\n\n</div>\n<div>\n<strong>To learn about our sponsors AND GET THOSE PROMO CODES,</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click her</a>\n</div>\n",
  "pubDate": "Tue, 18 Jun 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-06-18:/posts/7291795",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}