{
  "title": "Biden: U.S. chip subsidies are key for national security",
  "description": "Chinese reaction to new policies may follow U.S. midterm elections and Biden-Xi meeting at G-20, experts say.",
  "link": "https://www.rfa.org/english/news/china/biden-chips-act-11042022165531.html",
  "guid": "https://www.rfa.org/english/news/china/biden-chips-act-11042022165531.html",
  "author": "Alex Willemyns for RFA",
  "media:content": {
    "media:description": "Employees make microchips at a factory of Jiejie Semiconductor Company in Nantong, in eastern China's Jiangsu province on March 17, 2021",
    "media:credit": "AFP"
  },
  "content:encoded": "\n        <p><span style=\"font-weight: 400;\">The $52 billion in recent subsidies for America’s microchip sector are necessary for U.S. national security, President Joe Biden said on Friday, recalling a visit he made to a Lockheed Martin facility that he said could not source the chips it needed to make key weapons.</span></p>\n<p><span style=\"font-weight: 400;\">The speech came as industry leaders told a trade event that American and Chinese chipmakers were both still assessing the likely impacts of the spate of recent U.S. policies impacting the chip industry, with Beijing likely weighing retaliatory measures.</span></p>\n<p><span style=\"font-weight: 400;\">Speaking in San Diego, California, Biden said the subsidies, part of the </span><a href=\"https://www.rfa.org/english/news/china/usa-chips-10142022154807.html\"><span style=\"font-weight: 400;\">$280-billion CHIPS Act</span></a><span style=\"font-weight: 400;\"> signed into law Aug. 9, were needed to restore U.S. capacity to fabricate chips that he said “power more and more of what we need,” including smartphones, cars and hospital equipment.</span></p>\n<p><span style=\"font-weight: 400;\">“America invented the computer chip, and led the industry for decades. Then something happened,” Biden said. “American companies went overseas for cheaper labor; American manufacturing got hollowed out.”</span></p>\n<p><span style=\"font-weight: 400;\">The United States couldn’t afford to rely on foreign supply chains, he said, due to the risks posed by pandemics or by “political decisions made in China, Taiwan or other places.” Such a reliance was already being exposed by U.S. efforts to arm Ukraine in its fight against Russian President Vladimir Putin’s invasion of the country, Biden added.</span></p>\n<p><span style=\"font-weight: 400;\">“This is also a national security issue,” he said. </span></p>\n<p><span style=\"font-weight: 400;\">\"Earlier this year, I went down to a Lockheed factory in Alabama. They make Javelin missiles. Guess what? </span><span style=\"font-weight: 400;\">They were having trouble supplying Javelin missiles to Ukraine, because they didn't have the chips. We didn’t have the chips to help [Ukrainians] defend themselves against Putin.”</span></p>\n<p><strong>Changing industry</strong></p>\n<p><span style=\"font-weight: 400;\">The $52 billion in subsidies under the CHIPS Act have been paired with a series of export controls meant to cut China off from U.S. technologies.</span></p>\n<p><span style=\"font-weight: 400;\">Announced Oct. 13 by the Department of Commerce’s Bureau of Industry and Security, the rules require licenses to export chip-making technology to 28 listed Chinese entities. They target Beijing’s ability “to obtain advanced computing chips, develop and maintain supercomputers, and manufacture advanced semiconductors,” </span><a href=\"https://www.federalregister.gov/documents/2022/10/13/2022-21658/implementation-of-additional-export-controls-certain-advanced-computing-and-semiconductor\"><span style=\"font-weight: 400;\">the new rules</span></a><span style=\"font-weight: 400;\"> say.</span></p>\n<p><span style=\"font-weight: 400;\">The slow drip of new rules against a backdrop of massive subsidies has upended a global industry that is now worth more than $600 billion a year, according to World Semiconductor Trade Statistics.</span></p>\n<p><span style=\"font-weight: 400;\">At an event hosted by the Washington International Trade Association earlier on Friday, Jimmy Goodrich, vice president of global policy at the Semiconductor Industry Association, said the U.S. chip industry was still taking stock of the likely impact of all the new rules and subsidies.</span></p>\n<p><span style=\"font-weight: 400;\">“It’s really been a very busy, chaotic few weeks for the private sector to try to understand the scope of the rules, but also to understand how they’re going to move forward in the short, medium and long term,” Goodrich said, noting the policies arrived amid a cyclical industry downturn.</span></p>\n<p><span style=\"font-weight: 400;\">“Some private sector firms have announced forecasts next year where they might see a decline in revenue by $1 billion to $2.5 billion per company, so this is a significant set of rules in terms of commercial impact,” he said. “And of course, firms in China are struggling.”</span></p>\n<p><span style=\"font-weight: 400;\">Exacerbating concerns among American chipmakers has been the unilateral nature of the export controls, with some firms worried about a vacuum forming in the Chinese market that could be filled by producers in Europe and Asia. </span></p>\n<p><span style=\"font-weight: 400;\">A U.S. official said last month that </span><a href=\"https://www.rfa.org/english/news/china/china-chips-10272022151919.html\"><span style=\"font-weight: 400;\">he is confident</span></a><span style=\"font-weight: 400;\"> a multilateral deal will soon be struck, but Commerce Secretary Gina Raimondo told firms on Thursday that it could take <a href=\"https://www.bloomberg.com/news/articles/2022-11-03/us-chipmaking-gear-makers-told-to-wait-for-relief-on-china-curbs\">nine months</a></span><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Melissa Duffy, a partner for trade and national security at the Silicon Valley law firm Fenwick & West, said while many expect the United States to bring major chip makers like the Netherlands and Japan into an export control deal, the U.S. can act unilaterally in the meantime.</span></p>\n<p><span style=\"font-weight: 400;\">“The Commerce Department has expanded its jurisdiction with this rule to capture more things that are made outside the United States,” Duffy said at the Washington International Trade Association event, adding that many European and Asian chip firms rely on U.S. technology.</span></p>\n<p><span style=\"font-weight: 400;\">“So something that could be made in Europe – for instance, in the Netherlands – or made in Japan or South Korea that may not have any U.S. content in it … could still be subject to these rules if the products are based on U.S.-origin technology or software,” she said.</span></p>\n<p><strong>Threat of blowback</strong></p>\n<p><span style=\"font-weight: 400;\">The question of China’s response also remains. So far, Beijing has slammed the U.S. export controls as being part of a “Cold War” mentality, but has otherwise refrained from introducing retaliatory measures.</span></p>\n<p><span style=\"font-weight: 400;\">Paul Trio, the director of international standards at SEMI, a global industry association representing electronics makers, told the event that Beijing was likely weighing its response until after next week, with key elections in the United States in Biden and Chinese President Xi Jinping expected to meet on the sidelines of the G-20 meeting in Bali.</span></p>\n<p><span style=\"font-weight: 400;\">“The Chinese response is going to wait until after the U.S. midterms, and then after the Biden-Xi summit, before we can see something a little more public and maybe a little stronger,” Trio said, suggesting Beijing could limit exports of rare earths, magnets or electric vehicle components. </span></p>\n<p><span style=\"font-weight: 400;\">“Any action there would have a lot of downside for Chinese companies and for China, too,” he said. “They’re considering all these things, but there’s a whole host of other things they can do, like regulatory changes or investigating U.S. companies, to send a clear message on this.”</span></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 16:57:00 -0400"
}