{
  "title": "Unlocking the mysteries of how neurons learn",
  "link": "https://news.mit.edu/2022/raul-mojica-neurons-learn-1018",
  "description": "PhD candidate Raúl Mojica Soto-Albors seeks to understand the rules of plasticity that underlie neuronal behavior.",
  "pubDate": "Tue, 18 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/raul-mojica-neurons-learn-1018",
  "dc:creator": "Olivia Young | Office of Graduate Education",
  "content:encoded": "<p>When he matriculated in 2019 as a graduate student, Raúl Mojica Soto-Albors was no stranger to MIT. He’d spent time here on multiple occasions as an undergraduate at the University of Puerto Rico at Mayagüez, including eight months in 2018 as a displaced student after Hurricane Maria in 2017. Those experiences — including participating in the <a href=\"https://cbmm.mit.edu/diversity/undergraduate-summer-research-internships-neuroscience\" target=\"_blank\">MIT Summer Research Bio Program</a> (MSRP-Bio), which offers a funded summer research experience to underrepresented minorities and other underserved students — not only changed his course of study; they also empowered him to pursue a PhD.</p>\n\n<p></p>\n\n<p>“The summer program eased a lot of my worries about what science would be like, because I had never been immersed in an environment like MIT’s,” he says. “I thought it would be too intense and I wouldn’t be able to make it. But, in reality, it is just a bunch of people following their passions. And so, as long as you are following your passion, you are going to be pretty happy and productive.”</p>\n\n<p></p>\n\n<p>Mojica is now following his passion as a doctoral student in the MIT Department of Brain and Cognitive Sciences, using a complex electrophysiology method termed “patch clamp” to investigate neuronal activity in vivo. “It has all the stuff which we historically have not paid much attention to,” he explains. “Neuroscientists have been very focused on the spiking of the neuron. But I am concentrating instead on patterns in the subthreshold activity of neurons.”</p>\n\n<p></p>\n\n<p><strong>Opening a door to neuroscience</strong></p>\n\n<p></p>\n\n<p>Mojica’s affinity for science blossomed in childhood. Even though his parents encouraged him, he says, “It was a bit difficult as I did not have someone in science in my family. There was no one [like that] who I could go to for guidance.” In college, he became interested in the parameters of human behavior and decided to major in psychology. At the same time, he was curious about biology. “As I was learning about psychology,” he says. “I kept wondering how we, as human beings, emerge from such a mess of interacting neurons.”</p>\n\n<p></p>\n\n<p>His journey at MIT began in January 2017, when he was invited to attend the Center for Brains, Minds and Machines <a href=\"https://biology.mit.edu/outreach/quantitative-methods-workshop/\">Quantitative Biology Methods Program</a>, an intensive, weeklong program offered to underrepresented students of color to prepare them for scientific careers. Even though he had taken a Python class at the University of Puerto Rico and completed some online courses, he says, “This was the first instance where I had to develop my own tools and learn how to use a programming language to my advantage.”</p>\n\n<p></p>\n\n<p>The program also dramatically changed the course of his undergraduate career, thanks to conversations with Mandana Sassanfar, a biology lecturer and the program’s coordinator, about his future goals. “She advised me to change to majors to biology, as the psychology component is a little bit easier to read up on than missing the foundational biology classes,” he says. She also recommended that he apply to MSRP.&nbsp;</p>\n\n<p></p>\n\n<p>Mojica promptly took her advice, and he returned to MIT in the summer of 2017 as an MSRP student working in the <a href=\"https://www.markharnett.org/\" target=\"_blank\">lab of Associate Professor Mark Harnett</a> in the Department of Brain and Cognitive Sciences and the McGovern Institute. There, he focused on performing calcium imaging on the retro splenial cortex to understand the role of neurons in navigating a complex spatial environment. The experience was eye-opening; there are very few specialized programs at UPRM, notes Mojica, which limited his exposure to interdisciplinary subjects. “That was my door into neuroscience, which I otherwise would have never been able to get into.”&nbsp;</p>\n\n<p></p>\n\n<p><strong>Weathering the storm</strong></p>\n\n<p></p>\n\n<p>Mojica returned home to begin his senior year, but shortly thereafter, in September 2017, Hurricane Maria hit Puerto Rico and devastated the community. “The island was dealing with blackouts almost a year after the hurricane, and they are still dealing with them today. It makes it really difficult, for example, for people who rely on electricity for oxygen or to refrigerate their diabetes medicine,” he says. “[My family] was lucky to have electricity reliably four months after the hurricane. But I had a lot of people around me who spent eight, nine, 10 months without electricity,” he says.</p>\n\n<p></p>\n\n<p>The hurricane’s destruction disrupted every aspect of life, including education. MIT offered its educational resources by <a href=\"https://news.mit.edu/2018/hosting-university-puerto-rico-students-at-mit-post-hurricane-maria-0611\" target=\"_blank\">hosting several 2017 MSRP students</a> from Puerto Rico for the spring semester, including Mojica. He moved back to campus in February 2018, finished up his fall term university exams, and took classes and did research throughout the spring and summer of that year.</p>\n\n<p></p>\n\n<p>“That was when I first got some culture shock and felt homesick,” he notes. Thankfully, he was not alone. He befriended another student from Puerto Rico who helped him through that tough time. They understood and supported each other, as both of their families were navigating the challenges of a post-hurricane island. Mojica says, “We had just come out of this mess of the hurricane, and we came [to MIT] and everything was perfect. … It was jarring.”</p>\n\n<p></p>\n\n<p>Despite the immense upheaval in his life, Mojica was determined to pursue a PhD. “I didn’t want to just consume knowledge for the rest of my life,” he says. “I wanted to produce knowledge. I wanted to be on the cutting-edge of something.”</p>\n\n<p></p>\n\n<p><strong>Paying it forward</strong></p>\n\n<p></p>\n\n<p>Now a fourth-year PhD candidate in the Harnett Lab, he’s doing just that, utilizing a classical method termed “patch clamp electrophysiology” in novel ways to investigate neuronal learning. The patch clamp technique allows him to observe activity below the threshold of neuronal firing in mice, something that no other method can do.</p>\n\n<p></p>\n\n<p>“I am studying how single neurons learn and adapt, or plasticize,” Mojica explains. “If I present something new and unexpected to the animal, how does a cell respond? And if I stimulate the cell, can I make it learn something that it didn’t respond to before?” This research could have implications for patient recovery after severe brain injuries. Plasticity is a crucial aspect of brain function. If we could figure out how neurons learn, or even how to plasticize them, we could speed up recovery from life-threatening loss of brain tissue, for example,\" he says.</p>\n\n<p></p>\n\n<p>In addition to research, Mojica’s passion for mentorship shines through. His voice lifts as he describes one of his undergraduate mentees, Gabriella, who is now a full-time graduate student in the Harnett lab. He currently mentors MSRP students and advises prospective PhD students on their applications. “When I was navigating the PhD process, I did not have people like me serving as my own mentors,” he notes.</p>\n\n<p></p>\n\n<p>Mojica knows firsthand the impact of mentoring. Even though he never had anyone who could provide guidance about science, his childhood music teacher played an extremely influential role in his early career and always encouraged him to pursue his passions. “He had a lot of knowledge in how to navigate the complicated mess of being 17 or 18 and figuring out what you want to devote the rest of your life to,” he recalls fondly.</p>\n\n<p></p>\n\n<p>Although he’s not sure about his future professional plans, one thing is clear for Mojica: “A big part of it will be mentoring the people who come from similar backgrounds to mine who have less access to opportunities. I want to keep that front and center.”</p>",
  "media:content": {
    "media:description": "Raúl Mojica Soto-Albors, a doctoral student in the Department of Brain and Cognitive Sciences, uses a complex electrophysiology method termed “patch clamp” to investigate neuronal activity in vivo.",
    "media:credit": "Photo: Gretchen Ertl"
  },
  "category": [
    "Students",
    "Graduate, postdoctoral",
    "Brain and cognitive sciences",
    "Neuroscience",
    "Diversity and inclusion",
    "Mentoring",
    "Latin America",
    "Profile",
    "Global",
    "School of Science",
    "McGovern Institute"
  ]
}