{
  "id": "https://bibleinoneyear.org/en/youth/273",
  "title": "Day 273: Bounce It Back Up",
  "description": "Psalm 115:1, Jeremiah 1:4–19, Philippians 1:27–28, 2:1-11. The theme of ‘*glory*’ runs through each of today’s readings (Psalm 115:1; Philippians 2:11; Jeremiah 2:11)  We see why, how and when to *bounce the glory back up to God*",
  "pubDate": "Thu, 30 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/273/?ignore",
  "itunes:duration": "14:54",
  "guid": "enyouth30092021-273",
  "length": 894.25,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 273: Bounce It Back Up",
  "itunes:subtitle": "Psalm 115:1, Jeremiah 1:4–19, Philippians 1:27–28, 2:1-11. The theme of ‘*glory*’ runs through each of today’s readings (Psalm 115:1; Philippians 2:11; Jeremiah 2:11)  We see why, how and when to *bounce the glory back up to God*",
  "itunes:summary": "It was one of the most moving and powerful testimonies I have ever encountered. A former sex worker, drug addict and dealer described how she had reached a point at which, in her own words, she was ‘dead’. She said her ‘blood was black’ and her ‘heart was black’. She described how she came on Alpha and heard that Jesus loved her so much that he died for her. She described how this had broken ‘the concrete’ of her heart. She experienced God’s love for her for the first time. Remarkably she has even been able to forgive those who did her harm and is now radiating the love of Christ.\nAfter she had given her testimony to a stunned congregation, I went up to thank her and said how extraordinarily powerful it had been. She replied, ‘I need to bounce it back up!’ I didn’t understand what she meant. I asked her to explain. She said, ‘It’s all his grace. I need to bounce the glory back to him.’ She has a profound understanding of grace, glory and what it means to be Christ-like.\nThe theme of ‘glory’ runs through each of today’s readings (Psalm 115:1; Philippians 2:11; Jeremiah 2:11). We see why, how and when to bounce the glory back up to God.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 273
}