{
  "title": "REOPENING EUROPE - Reopening Borders?",
  "link": "https://audioboom.com/posts/7643962",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2084,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In June 2020, as Europe reopened after lockdown, we crossed ten national borders. We listened to diverse citizens, from passers-by to politicians, business people to artists, recording, documenting, and publishing stories. </div>\n<div><br>\n</div>\n<div>In this second episode of Reopening Europe, we unpack some reflections about borders and the pandemic which we have collected along our journey. </div>\n<div><br>\n</div>\n<div>Giuseppe Porcaro is joined in by Martina Tazzioli, Lecturer in Politics and Technology at Goldsmith University, London. Her work is characterised by an interdisciplinary approach to political theory, migration and border studies and political geography. Recently, she has investigated the technologisation of the borders and how technologies constitute a battlefield for migrants, states and non-state actors.<br>\n<br>\nThey hear contributions from-<br>\n<br>\n\n</div>\n<ul>\n<li>Felies Zomerplaag, a high school student in Meerssen, a few kilometres from the Belgian/Dutch Border;</li>\n<li>Djuna Bernard, Member of the Luxembourgish Parliament;</li>\n<li>Stephan Halbach, the CEO and owner of Klenke, a printing workshop in Dortmund, Germany;</li>\n<li>Klemen Miklavič, mayor of Nova Gorica, on the Slovene/Italian border;</li>\n<li>Jean Baptiste Couzin, the head of cross-border cooperation, in the Grand-est Region;</li>\n<li>Michael Leigh, senior fellow Bruegel;</li>\n<li>Ugo Rossi, Associate professor<strong> </strong>of Economic and Political Geography, Gran Sasso Science Institute;</li>\n<li>Jeannette Neumann, Bloomberg correspondent, Madrid</li>\n</ul>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Wed, 29 Jul 2020 14:18:12 +0000",
  "guid": "tag:audioboom.com,2020-07-29:/posts/7643962",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}