{
  "title": "Taiwan scrambles jets after detecting Chinese forces nearby",
  "link": "https://www.rt.com/news/566022-taiwan-scrambles-jets/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566022-taiwan-scrambles-jets/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366e81185f5403525744aa2.jpg\" /> Taiwan scrambles jets, missile systems after detecting Chinese aircraft and naval vessels nearby <br/><a href=\"https://www.rt.com/news/566022-taiwan-scrambles-jets/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Taipei’s defenses have been activated in response to Beijing’s latest military activity near the self-governing island</strong></p>\n            \n                        \n            <p>Taiwan&rsquo;s military forces have sprung into action to warn away Chinese aircraft and naval vessels that were detected near the self-governing island, including one plane that allegedly crossed into Taipei&rsquo;s Air Defense Identification Zone (ADIZ).</p>\n<p>Jets, missile systems and naval forces were scrambled after nine Chinese aircraft and two navy ships were detected in and near the Taiwan Strait on Saturday, the Taiwanese defense ministry said. The aircraft that breached the ADIZ was at the southwest corner of the zone, in the same area where a record 56 Chinese jets flew on October 4.</p>\n<p>However, contrary to an allegation by US Senator Robert Menendez, who visited Taiwan last April, the Chinese jets didn&rsquo;t cross into Taiwanese airspace. The ADIZ extends far beyond Taipei&rsquo;s territory, covering the region where Taiwan monitors aircraft for security purposes.</p>\n<p>China has ramped up military exercises in the region around Taiwan since August, when US House Speaker Nancy Pelosi defied Beijing&rsquo;s warnings against visiting Taipei. In response to the row, China cut off military and climate ties with the US and conducted wargames in the Taiwan Strait.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">9 PLA aircraft and 2 PLAN vessels around our surrounding region were detected today (Nov. 5, 2022) until 1700(GMT+8). <a href=\"https://twitter.com/hashtag/ROCArmedForces?src=hash&ref_src=twsrc%5Etfw\">#ROCArmedForces</a> have monitored the situation and responded to these activities with aircraft in CAP, naval vessels, and land-based missile systems. <a href=\"https://t.co/LbB1M57N6D\">pic.twitter.com/LbB1M57N6D</a></p>&mdash; 國防部 Ministry of National Defense, R.O.C. 🇹🇼 (@MoNDefense) <a href=\"https://twitter.com/MoNDefense/status/1588863854863605760?ref_src=twsrc%5Etfw\">November 5, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>China has vowed to reunify with Taiwan, by force if necessary, and considers the island to be part of its sovereign territory. The US and the United Nations recognize Beijing as the <em>&ldquo;sole legal government of China&rdquo;</em> under the <em>&ldquo;One China&rdquo;</em> policy. Washington officially acknowledges, without endorsing, China&rsquo;s claim to sovereignty over Taiwan.&nbsp;</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565474-putin-pelosi-taiwan-china/\">\n            <span>READ MORE: </span>Putin comments on ‘grandma’ Pelosi visiting Taiwan\n        </a>\n    </p>\n\n    \n\n<p><strong></strong>Speaking at last month&rsquo;s Communist Party congress, President Xi Jinping called on the People&rsquo;s Liberation Army to <em>&ldquo;fully enhance training and preparation for war,&rdquo;</em> the South China Morning Post reported on Saturday. PLA officers have said the Chinese military is now on <em><a href=\"https://www.scmp.com/news/china/military/article/3198395/chinese-top-brass-say-pla-must-be-full-time-standby-war-taiwan-strait\" target=\"_blank\" rel=\"noopener noreferrer\">&ldquo;full-time standby&rdquo;</a></em>&nbsp;for war in the Taiwan Strait.</p>\n<p></p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 23:08:23 +0000",
  "dc:creator": "RT"
}