{
  "title": "2019 StockX Data Contest Entry",
  "description": "<!--kg-card-begin: markdown--><p>Ever since I was a kid I have loved sneakers and been interested in the impact they have on everything from sports to popular culture. So a few months ago when I saw that StockX was holding a data contest I was very excited to participate. If you are not</p>",
  "link": "https://www.danielforsyth.me/2019-stockx-data-contest-entry/",
  "guid": "5d263c31f2e666003856dafb",
  "dc:creator": "Daniel Forsyth",
  "pubDate": "Wed, 10 Jul 2019 20:58:15 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>Ever since I was a kid I have loved sneakers and been interested in the impact they have on everything from sports to popular culture. So a few months ago when I saw that StockX was holding a data contest I was very excited to participate. If you are not familiar with <a href=\"https://stockx.com/how-it-works\">StockX</a> they label themselves as 'The Stock Market of Things' and feature a live &#x2018;bid/ask&#x2019; marketplace for sneakers, clothes, bags, and watches. They are mostly known for their sneakers and have emerged as one of the premier players in the secondary sneaker market among competitors such as <a href=\"https://www.goat.com/\">GOAT</a>, <a href=\"https://www.grailed.com/\">Grailed</a>, and <a href=\"https://www.stadiumgoods.com/\">Stadium Goods</a>.</p>\n<p>The data given for the <a href=\"https://stockx.com/news/the-2019-data-contest/\">contest</a> consisted of:</p>\n<blockquote>\n<p>A random sample of all Off-White x Nike and Yeezy 350 sales from between 9/1/2017 (the month that Off-White first debuted &#x201C;The Ten&#x201D; collection) and the present. There are 99,956 total sales in the data set; 27,794 Off-White sales, and 72,162 Yeezy sales. The sample consists of U.S. sales only. To create this sample, we took a random, fixed percentage of StockX sales (X%) for each colorway, on each day, since September 2017. So, for each day the Off-White Jordan 1 was on the market, we randomly selected X% of its sale from each day. (It&#x2019;s not important to know what X is; all that matters is that it&#x2019;s a random sample, and that the same fixed X% of sales was selected from every day, for every sneaker). We&#x2019;ve included 8 variables for you to work with: Order Date, Brand, Sneaker Name, Sale Price ($), Retail Price ($), Release Date, Shoe Size, and Buyer State (the U.S. state the buyer shipped to).</p>\n</blockquote>\n<p>with the entry rules being wide open:</p>\n<blockquote>\n<p>We give you a bunch of original StockX sneaker data, then you crunch the numbers and come up with the coolest, smartest, most compelling story you can tell. It can be literally anything you want. A theory, an insight, even just a really original data visualization. It could be a novel hypothesis about resale prices you&#x2019;ve always wanted to test. Or maybe it&#x2019;s just a beautiful chart to visualize the data. It can be on any subject &#x2013; sneakers, brands, buyers, or even StockX itself. Whatever you find interesting, just follow your bliss.</p>\n</blockquote>\n<p>When trying to think of interesting ideas for a submission I recalled a class I had taken a few years ago called \"Machine Learning for Trading\" and thought it would be the perfect fit to combine some techniques I learned  in the class to the data contest, it is StockX afterall.</p>\n<p>When analyzing securities (stocks, bonds, derivatives, <em>sneakers</em>) there are two primary methods used. The first is fundamental analysis where you are attempting to determine the intrinsic value of the company by looking at key numbers and economic indicators from things like financial statements and industry conditions. The second is technical analysis where you attempt to forecast the direction of prices by looking at historical data. I wanted to apply technical analysis to sneaker data for my entry.</p>\n<p>I used a tool from technical analysis called Bollinger Bands to develop optimal buy and sell signals for a particular sneaker, in this case the Jordan 1 Retro High Off-White Chicago. A new take on Michael Jordan's first signature shoe and one of the most sought after sneakers in the past few years (Currently selling for $3650 in my size on StockX).</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2019/07/801781_01.jpg\" alt=\"801781_01\" loading=\"lazy\"></p>\n<p>Bollinger Bands are a form of technical analysis used to evaluate price action and volatility of a stock. To create Bollinger Bands you first plot the 20-day moving average of the stock price. Next you create two &#x201C;Bands&#x201D; that are two standard deviations above and below the moving average respectively. These bands are measures of volatility, when the movement of the price is volatile the bands will expand, and when the price becomes less volatile they contract. When the price crosses down, from outside the upper Band, to inside towards the moving average we use this as a trigger to sell. Conversely, when the price crosses up through the bottom Band towards the moving average this signals a buy. Bollinger Bands are effective because when the price exits either of the Bands that means it is outside 2 standard deviations of the moving average. Therefore we would expect that the price will eventually return back in the direction of the moving average. This method attempts to follow the classic mantra &#x201C;buy low and sell high&#x201D; but using Bollinger Bands instead of intuition.</p>\n<p>Below are my plotted Bollinger Bands for the Jordan 1 Retro High Off-White Chicago sales data. You can see early on the price dropped pretty steadily and there are several sell signals. Then as time goes on and the price slowly rises the buy signals begin to come in. Around August 2018 the prices start to become more volatile, the sales less frequent, and the bands widen which probably signals the number of sneakers available is beginning to dry up which will slowly drive the price even higher.</p>\n<p><img src=\"https://www.danielforsyth.me/content/images/2019/07/Screen-Shot-2019-02-26-at-3.09.34-PM.png\" alt=\"Screen-Shot-2019-02-26-at-3.09.34-PM\" loading=\"lazy\"></p>\n<p>I think something like this would be a cool feature to implement as a 'Good Time to Buy' banner on a particular sneakers sale page - <a href=\"https://stockx.com/air-jordan-1-retro-high-off-white-chicago\">here</a> is the page for the Jordan 1.</p>\n<p>I did not win the contest but I had a lot of fun exploring the dataset and look forward to next years. There were a ton of excellent submissions - you can see the winners <a href=\"https://stockx.com/news/2019-data-contest-winner/\">here</a>.</p>\n<!--kg-card-end: markdown-->"
}