{
  "title": "New Online University of Wisconsin Data Science Certificate Now Available",
  "link": "https://datasciencedegree.wisconsin.edu/blog/new-online-data-science-certificate/",
  "comments": "https://datasciencedegree.wisconsin.edu/blog/new-online-data-science-certificate/#respond",
  "dc:creator": "Peggy Rynearson",
  "pubDate": "Mon, 24 May 2021 14:37:54 +0000",
  "category": "News",
  "guid": "https://datasciencedegree.wisconsin.edu/?p=7399",
  "description": "<p>UW Extended Campus, in partnership with several University of Wisconsin System campuses, will offer an online Graduate Certificate in Data Science in September 2021. The certificate is a 5-course, 15-credit program designed for adult students interested in learning current data science skills to keep pace in today’s data-driven world.  UW System campuses participating in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu/blog/new-online-data-science-certificate/\">New Online University of Wisconsin Data Science Certificate Now Available</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu\">University of Wisconsin Data Science Degree</a>.</p>\n",
  "content:encoded": "<p><span style=\"font-weight: 400;\">UW Extended Campus, in partnership with several University of Wisconsin System campuses, will offer an </span><a href=\"https://datasciencedegree.wisconsin.edu/data-science-program/data-science-certificate/\"><span style=\"font-weight: 400;\">online Graduate Certificate in Data Science</span></a><span style=\"font-weight: 400;\"> in September 2021. The certificate is a 5-course, 15-credit program designed for adult students interested in learning current data science skills to keep pace in today’s data-driven world. </span></p>\n<p><span style=\"font-weight: 400;\">UW System campuses participating in the online data science certificate program are UW-Eau Claire, UW-Green Bay, UW-La Crosse, UW-Oshkosh, UW-Stevens Point, and UW-Superior. </span><a href=\"https://datasciencedegree.wisconsin.edu/data-science-program/about-uw-extended-campus/\"><span style=\"font-weight: 400;\">UW Extended Campus</span></a><span style=\"font-weight: 400;\">, in collaboration with UW System campuses, makes advanced education possible through flexible, online programs that combine the diverse expertise and resources of UW campuses and faculty.</span><span style=\"font-weight: 400;\"></span></p>\n<p><span style=\"font-weight: 400;\">“We are so pleased to introduce the Graduate Certificate in Data Science,” said</span><a href=\"https://datasciencedegree.wisconsin.edu/blog/women-in-data-science-meet-program-manager-jennifer-cox/\"><span style=\"font-weight: 400;\"> Jennifer Cox,</span></a><span style=\"font-weight: 400;\"> Program Manager of the online UW Master of Science in Data Science. “This certificate is designed for current or potential data professionals who might not have the time or need to complete a full degree program but have a desire to enhance their data skills. A certificate can give you that edge you need to do your job better or even advance your career.”</span></p>\n<h2>Data Science Certificate Offers Skills Training to Meet Demand</h2>\n<p><span style=\"font-weight: 400;\">The graduate-level Data Science certificate offers students an opportunity to learn the basic principles of data science and gain proficiency in statistics, machine learning, data visualization, programming, and other techniques. It is possible to earn the data science certificate within one year; however, students may decide to take longer based on work and life commitments. Coursework completed in the data science certificate program offers an optional pathway to the online UW Data Science master&#8217;s degree offered through UW Extended Campus. Similar to other UW Extended Campus programs, students pay the same tuition whether they live in Wisconsin or out of state.</span></p>\n<p><span style=\"font-weight: 400;\">The certificate, which provides skills training for individuals seeking career advancement in data-related occupations, was created to meet the growing demand for data proficient and data literate professionals across industries. According to the U.S. Bureau of Labor Statistics, employment of </span><span style=\"font-weight: 400;\">computer and information research scientists is projected to grow 15 percent from 2019 to 2029,</span><span style=\"font-weight: 400;\"> much faster than the average for all occupations. </span></p>\n<div class=\"perfect-pullquote vcard pullquote-align-full pullquote-border-placement-left\"><blockquote><p>&#8220;<strong>A certificate can give you that edge you need to do your job better or even advance your career.&#8221; </strong></p></blockquote></div>\n<p><span style=\"font-weight: 400;\">The new certificate joins a growing catalog of </span><a href=\"https://uwex.wisconsin.edu/degrees-programs/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">flexible, online degree and certificate programs</span></a><span style=\"font-weight: 400;\"> designed for adult learners offered in collaboration with UW Extended Campus and UW System campus partners. </span><span style=\"font-weight: 400;\">Students with a variety of work, education, and life experience have found success in UW Extended Campus programs and are making a difference in the world today.</span></p>\n<p><span style=\"font-weight: 400;\">Prospective students seeking more information about the online UW Graduate Certificate in Data Science are encouraged to download a program guide, call 1-608-262-2011, or 608-262-2011, or email learn@uwex.wisconsin.edu.</span></p>\n<h3><b>About UW Extended Campus</b></h3>\n<p><span style=\"font-weight: 400;\">The University of Wisconsin is one of the largest and most widely respected public higher education systems in the country. <a href=\"https://uwex.wisconsin.edu/\">UW Extended Campus</a> partners with all UW System campuses to offer online degrees and certificates, as well as continuing education and lifelong learning opportunities. Through UW Extended Campus, people of Wisconsin and beyond can access university resources and engage in online learning, wherever they live and work—fulfilling the promise of the “Wisconsin Idea”.</span></p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu/blog/new-online-data-science-certificate/\">New Online University of Wisconsin Data Science Certificate Now Available</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu\">University of Wisconsin Data Science Degree</a>.</p>\n",
  "wfw:commentRss": "https://datasciencedegree.wisconsin.edu/blog/new-online-data-science-certificate/feed/",
  "slash:comments": 0
}