{
  "id": "yt:video:G5FmFuPPvdE",
  "yt:videoId": "G5FmFuPPvdE",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "Why Europe is now a heatwave hotspot",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-07-29T10:00:59+00:00",
  "updated": "2022-08-19T15:40:05+00:00",
  "media:group": {
    "media:title": "Why Europe is now a heatwave hotspot",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The atmosphere runs on fluid mechanics! As explained on https://www.brilliant.org/simonclark\n\nIn July 2022 the UK shattered its temperature record, observing a temperature of over 40°C for the first time. This was part of a devastating heatwave that spanned the UK, France, Germany, Spain, and Portugal and saw evacuations, wildfires, and thousands of premature deaths. This forms part of a grim trend: Europe has become a heatwave hotspot, seeing an increase in heatwaves three to four times greater than elsewhere in the midlatitudes. This video examines why, and discusses the future of heatwaves in Europe.\n\nMy book, Firmament: https://geni.us/firmament\n\nREFERENCES\n(1) http://earth.nullschool.net/\n(2) https://www.nature.com/articles/s41467-020-16834-0\n(3) https://www.nature.com/articles/s41467-022-31432-y\n(4) https://www.telegraph.co.uk/business/2022/07/18/why-railways-buckling-britains-40c-heatwave/\nThe thumbnail uses an image created by u/rasta4eye on reddit.\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty.\n\nEuropean heatwaves recently broke temperature records due to climate change, climate change made the heatwaves in the UK and France and Germany and Spain and Portugal hotter, the jet stream brought heatwave conditions in 2022 to Europe which was caused by the climate crisis. This video is about the science of how the jet stream is changing temperatures across Europe and how climate change is making heatwaves hotter. If you like videos from SciShow, Crash Course, Smarter Every Day, or Veritasium you will enjoy this science video about the climate crisis.\n\nHuge thanks to my supporters on Patreon: Conor Safbom, William Pettersson, Paul H and Linda L, InDefenseOfToucans, Savannah, Jimmy Lee, Simon Stelling, Gabriele Siino, Bjorn Bakker, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Shab Kumar, Brady Johnston, Liat Khitman, Jesper Norsted, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Farsight101, K.L, poundedjam, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, Robert Connell, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}