{
  "title": "379: How The Light Affects Your Mood with Andy Mant",
  "itunes:title": "379: How The Light Affects Your Mood with Andy Matt",
  "pubDate": "Tue, 20 Jul 2021 22:02:44 +0000",
  "guid": "78cfc55e-e618-43e3-88c7-9be6adf827eb",
  "link": "https://highestself.libsyn.com/379-how-the-light-affects-your-mood-with-andy-matt",
  "itunes:image": "",
  "description": "<p>I had heard of blue light before but I never realized how serious of an issue it was until this interview! I was amazed to learn how much light affects everything, from our mood to our sleep to our digestion and so much more. In this conversation, we dive deep into all things light and how it impacts us from a physical to an emotional to a spiritual level. We are all light-beings and it’s important for us to realize the impact the light around us is having on our cognitive state.<br /> <br /> Get 15% off your BluBlox pair at www.blublox.com/sahara<br /> <br /> Get $15 off your first order with Publicgoods by visiting publicgoods.com/SAHARA or use code SAHARA<br /> at checkout.</p> <p>Receive your FREE gifts worth up to $40 and $20 off at Thrive Market at <a class=\"c-link\" href= \"http://thrivemarket.com/sahara\" target=\"_blank\" rel= \"noopener noreferrer\" data-stringify-link= \"http://thrivemarket.com/sahara\" data-sk= \"tooltip_parent\">thrivemarket.com/sahara</a></p> <p>Enjoy your own delicious Organifi Gold and their other incredible products at organifi.com/sahara for 20% off<br /> <br /> Try Betterhelp for 10% off at www.betterhelp.com/sahara<br /> <br /> Join the waitlist for Rose Gold Goddesses and be notified when doors open in August at rosegoldgoddesses.com</p> <div> </div> <p>Intro + Outro Music: Silent Ganges by Maneesh de Moor<br /> <br /> Connect with me for daily Ayurvedic and modern spiritual wisdom at:<br /> Instagram.com/iamsahararose<br /> Facebook.com/iamsahararose<br /> Twitter.com/iamsahararose<br /> <br /> Order My Books: www.iamsahararose.com/books<br /> <br /> By accessing this Podcast, I acknowledge that the entire contents are the property of Sahara Rose, or used by Sahara Rose with permission, and are protected under U.S. and international copyright and trademark laws. Except as otherwise provided herein, users of this Podcast may save and use information contained in the Podcast only for personal or other non-commercial, educational purposes. No other use, including, without limitation, reproduction, retransmission or editing, of this Podcast may be made without the prior written permission of the Sahara Rose, which may be requested by contacting pr@iamsahararose.com.<br /> <br /></p> <div>This podcast is for educational purposes only. The host claims no responsibility to any person or entity for any liability, loss, or damage caused or alleged to be caused directly or indirectly as a result of the use, application, or interpretation of the information presented herein. </div>",
  "content:encoded": "<p>I had heard of blue light before but I never realized how serious of an issue it was until this interview! I was amazed to learn how much light affects everything, from our mood to our sleep to our digestion and so much more. In this conversation, we dive deep into all things light and how it impacts us from a physical to an emotional to a spiritual level. We are all light-beings and it’s important for us to realize the impact the light around us is having on our cognitive state.  Get 15% off your BluBlox pair at www.blublox.com/sahara  Get $15 off your first order with Publicgoods by visiting publicgoods.com/SAHARA or use code SAHARA at checkout.</p> <p>Receive your FREE gifts worth up to $40 and $20 off at Thrive Market at <a class=\"c-link\" href= \"http://thrivemarket.com/sahara\" target=\"_blank\" rel= \"noopener noreferrer\" data-stringify-link= \"http://thrivemarket.com/sahara\" data-sk= \"tooltip_parent\">thrivemarket.com/sahara</a></p> <p>Enjoy your own delicious Organifi Gold and their other incredible products at organifi.com/sahara for 20% off  Try Betterhelp for 10% off at www.betterhelp.com/sahara  Join the waitlist for Rose Gold Goddesses and be notified when doors open in August at rosegoldgoddesses.com</p>   <p>Intro + Outro Music: Silent Ganges by Maneesh de Moor  Connect with me for daily Ayurvedic and modern spiritual wisdom at: Instagram.com/iamsahararose Facebook.com/iamsahararose Twitter.com/iamsahararose  Order My Books: www.iamsahararose.com/books  By accessing this Podcast, I acknowledge that the entire contents are the property of Sahara Rose, or used by Sahara Rose with permission, and are protected under U.S. and international copyright and trademark laws. Except as otherwise provided herein, users of this Podcast may save and use information contained in the Podcast only for personal or other non-commercial, educational purposes. No other use, including, without limitation, reproduction, retransmission or editing, of this Podcast may be made without the prior written permission of the Sahara Rose, which may be requested by contacting pr@iamsahararose.com. </p> This podcast is for educational purposes only. The host claims no responsibility to any person or entity for any liability, loss, or damage caused or alleged to be caused directly or indirectly as a result of the use, application, or interpretation of the information presented herein. ",
  "enclosure": "",
  "itunes:duration": "57:28",
  "itunes:explicit": true,
  "itunes:keywords": "Ayurveda,wellness,consciousness,dharma,mindfulness,balance,purpose,higherself,highestself,sahararose,mindbodybalancemmindbody",
  "itunes:subtitle": "I had heard of blue light before but I never realized how serious of an issue it was until this interview! I was amazed to learn how much light affects everything, from our mood to our sleep to our digestion and so much more. In this conversation, we...",
  "itunes:episodeType": "full",
  "itunes:author": "Sahara Rose"
}