{
  "id": "https://bibleinoneyear.org/en/youth/3",
  "title": "Day 3: Talk as You Walk",
  "description": "Psalm 3:3, Genesis 5:23–24, 6:9, Matthew 3:16–17.  This is what Jesus has made possible – for you to *walk as Jesus did* (1 John 2:6)  You may stumble from time to time, but one day you will *walk with him* ‘dressed in white’ (Revelation 3:4)",
  "pubDate": "Mon, 03 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/3/",
  "itunes:duration": "11:35",
  "guid": "enyouth03012022-3",
  "length": 695.28,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 3: Talk as You Walk",
  "itunes:subtitle": "Psalm 3:3, Genesis 5:23–24, 6:9, Matthew 3:16–17.  This is what Jesus has made possible – for you to *walk as Jesus did* (1 John 2:6)  You may stumble from time to time, but one day you will *walk with him* ‘dressed in white’ (Revelation 3:4)",
  "itunes:summary": "I love walking. Apparently, it is one of the best forms of physical exercise. Of course, walking is also a means, and for some people their only means, of transport.\nWalking for whatever reason is more enjoyable with someone else. Walking and talking is a great way to communicate with family, friends, and also with God.\nThe point is that we are doing two things at the same time. We are not just taking exercise or travelling. As we walk together we are in communion with one another. Both Enoch and Noah ‘walked with God’ (Genesis 5:24; 6:9). They didn’t just sit, kneel or stand with God (the kind of actions we would often associate with spending time with God), but they were also in communion with God when doing something else. While you are doing other things – working, eating, exercising or relaxing – you can be in communion with God at the same time.\nPersonally, I also find it the best way to pray. This has been my pattern for the last few years. After reading the Bible each day, I go out and walk around our local park – which is almost deserted early in the morning. I note down anything I sense the Holy Spirit saying as I pray. You can pray as you walk to the bus stop or walk from one activity to the next. Talk as you walk.\nThe Bible has a great deal to say about walking with God. It is how you were intended to live. God’s desire for you is that you walk humbly in a relationship with him (Micah 6:8). This is what Jesus has made possible – for you to walk as Jesus did (1 John 2:6). You may stumble from time to time, but one day you will walk with him ‘dressed in white’ (Revelation 3:4).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 368
}