{
  "title": "S1E25 - Breaking barriers with World Champion weightlifter Kristi Brewer",
  "guid": "https://pinecast.com/guid/b5bfc891-16de-4d71-afb7-3043814e65c1",
  "pubDate": "Tue, 24 Nov 2020 07:30:11 -0000",
  "itunes:duration": "00:45:48",
  "description": "<p>Joining Laura on the podcast this week is elite Olympic weightlifter, Kristi Brewer.\nK Mighty, as she is known, didn’t even start weightlifting until her mid-30’s, and in her relatively short career so far, she has earned the title of Master World Champion and Master Worlds Best Lifter, and in the process broken 12 world records. She competes for the USA on a national and international platform, and is the oldest national ranked weightlifter on the senior circuit. Kristi is also a CPA, a mom to two wonderful girls, and, not surprisingly, a scheduling genius, all of which you will learn more about here today.\n \nIn this episode, Kristi shares the story of her rather non-traditional journey to weightlifting through her steady progress in the sport to the current day, and her plans for the future. Along the way, she touches upon her training history, being a ‘remote athlete’, her competitions and the pressure associated with them, the insignificance of ‘weight on the scale’ in the bigger picture, and the impact her training has upon her daughters. She also offers a glimpse of her stellar organizational and scheduling abilities, what it’s like to compete for Team USA, and how we can help cheer her on. Unmistakable throughout is Kristi’s love of the sport and what it has done for her, her pride in being an example for others especially her children, and, above all, the fact that her story clearly demonstrates that ‘life is not over when we become a mom or when we hit a certain age’. Truly, new beginnings are possible at any point in our lives, so listen in today and be inspired by the mighty Kristi Brewer.\n \nEpisode Highlights:\n \n·   Kristi’s non-traditional journey to weightlifting\n·   Her training history\n·   Being a ‘remote athlete’\n·   Her competition history\n·   The source of the pressure and expectations on Kristi\n·   The story of winning her first Master World Championship title\n·   Competing internationally in the Open Division\n·   The insignificance of ‘weight on the scale’ in the bigger picture\n·   The benefits of weight training\n·   Cutting weight during the holiday season\n·   Kristi’s daughters’ perspectives on her weightlifting\n·   Kristi’s scheduling expertise including visual schedules\n·   Competing for Team USA\n·   Her current goals\n·   How we can cheer Kristi on\n \nQuotes:\n \n“I didn’t find weightlifting actually until my second child when I was 35.”\n \n“I love the intensity of it, and also the monotonousness of the training.”\n \n“Weightlifting also just fit my personality as well as my body type.”\n \n“I didn’t have time to be good at both, and I didn’t want to just be mediocre, I wanted to be really good at one, and so…it morphed into weightlifting.”\n \n“I was so terrified of being a remote athlete.”\n \n“I do train alone in my garage, and I’ve been doing that for 4 of the 5 years that I’ve been an athlete.”\n \n“Ultimately, I had to trust myself that I could make these lifts without someone there telling me what to do and when to do it.”\n \n“You don’t actually know what you don’t know until you just do it.”\n \n“I love that women are, like, breaking all kinds of barriers…showing the world that, like, just because you’re in your 30’s or your 40’s doesn’t mean life is over. You can start something new then, and be awesome at it.”\n \n“Through the variety of my different competitions and experiences, the ones…that I’ve done the best at are the ones that I went in with to have fun.”\n \n“The biggest pressures are definitely self-inflicted.”\n \n“Most people aren’t as concerned with us as we are, but that’s something really easy to say but hard to, like, take to heart.”\n \n“Just because it hasn’t been done doesn’t mean that I can’t do it.”\n \n“I hate BMI.”\n \n“Weightlifting has been this huge, huge, huge mind shift of just how powerful a woman’s body can be and how awesome muscle is.”\n \n“If I don’t stick to the plan, I won’t compete.”\n \n“I love being that living example…we can relate on a totally different level.”\n \n“I am way more for experiences over money.”\n \n“Every day is blocked out into work, training, family, and then basically just fitting that all in.”\n \n“Our days are pretty structured, but that structure creates freedom.”\n \n“We do believe that I did get COVID.”\n \n“Tokyo 2021 is out – that’s not something that I’m qualified for.”\n \n“I am a firm believer that you need to make time for yourself.”\n \n“Every time I see your stuff I just smile and I’m encouraged.”\n \nLinks:\nThe Pursuit of Gold homepage: <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">  http://thepursuitofgold.com/</a> \nMental Training: <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">  https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver</a>  \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a> \n \nConnect with Kristi:\n \nKristi’s homepage:   <a href=\"https://www.kmighty.com/\" rel=\"nofollow\">https://www.kmighty.com/</a>\n \nInstagram:  <a href=\"https://www.instagram.com/k_mighty/\" rel=\"nofollow\"> https://www.instagram.com/k_mighty/</a></p>",
  "itunes:title": "Breaking barriers with World Champion weightlifter Kristi Brewer",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 25
}