{
  "title": "22: Episode 22",
  "link": "https://audioboom.com/posts/7336359",
  "itunes:episode": 22,
  "itunes:title": "Episode 22",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4992,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our January 01st, 2006 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div>\n<strong>Note:</strong> If interested in being one of the first to be a part of “Advice from MuggleCast,” call us (1-218-20-MAGIC) on Monday, January 2nd anytime between 1-3 PM EST with your HP dilemma!<br>\n<br>\n\n</div>\n<div>While the crew debates whether Harry can finish the job in the final book, just what were James and Lily’s occupations? How is it that Harry can fight the Imperius Curse so easily – does it depend on the power of the wizard? And look out! We got a real cat fight on our hands as McGonagall takes on Umbridge, and a battle of Ministers as Fudge battles Scrimgeour in the Dueling Club. Plus, are the Marauders dying in reverse order? Advice is even offered for those in need.<br>\n<br>\n\n</div>\n<div>From a look back on the year that was to New Year’s resolutions and anticipation of things to come…all that and more ahead with Andrew, Ben, Eric, Kevin, Laura, and Micah on this week’s edition of MuggleCast. Happy New Year!<br>\n<br>\n\n</div>\n<ul>\n<li>The Boss was gracious enough to open and close our show this week</li>\n<li>We reminisce about 2005 and revisit all of the year’s top stories</li>\n<li>New Year’s resolutions: 100,000 listeners, a clean Transcript Dungeon, and a desire to take over the world</li>\n<li>The crew looks ahead and offers what they expect to see in 2006</li>\n<li>Andrew welcomes all the new iPod listeners</li>\n<li>Snape’s Top 10 New Year’s Resolutions</li>\n<li>Will Harry be able to finish off the enemies that stand in his way of Voldemort?</li>\n<li>Is there a pattern to the Marauders’ deaths?</li>\n<li>Harry and Mad-Eye: why is one able to fight off the Imperius Curse more easily?</li>\n<li>Just what did James and Lily do for a living?</li>\n<li>What ‘ships did we support earlier in the series?</li>\n<li>Our new segment – Advice from MuggleCast: where we answer your HP problems</li>\n<li>How to get a friend into reading Harry Potter</li>\n<li>How to get our show to play on your MP3 player</li>\n<li>Dueling Club: McGonagall vs. Umbridge and Fudge vs. Scrimgeour</li>\n<li>\n<em>Goblet of Fire</em> Soundtrack Winners</li>\n<li>Andrew and Ben do their own rendition of U2’s “City of Blinding Lights”</li>\n<li>Next week’s topic: Albus Dumbledore</li>\n<li>Listener Comments and Bloopers</li>\n<li>Happy New Year!</li>\n</ul>\n",
  "pubDate": "Sun, 01 Jan 2006 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-08-08:/posts/7336359",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}