{
  "title": "Training, interview and books to win with HumanCoders",
  "dc:creator": "Louis Dorard",
  "pubDate": "Sat, 05 Jul 2014 10:13:40 +0000",
  "link": "https://www.ownml.co/blog/humancoders",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:53ad88d1e4b075a251473169",
  "description": "I am proud to announce that I have teamed up with HumanCoders to set up a \ngroundbreaking Machine Learning training program which is based on \nPrediction APIs and brings you up to speed in 3 days. At this occasion, \nthey interviewed me and I gave them 3 copies of my book, Bootstrapping \nMachine Learning, to give away — here's your chance to snatch one of them!",
  "content:encoded": "<h2 id=\"3copiesofbootstrappingmachinelearningtowin\">3 copies of Bootstrapping Machine Learning to win</h2>\n\n<p><a href=\"https://www.ownml.co/machine-learning-book\">Bootstrapping Machine Learning</a> is the first book that teaches Machine Learning through the use of Prediction APIs. This makes it much quicker to get started and it allows to focus more on practical aspects. You can read reviews on <a href=\"http://machinelearningmastery.com/bootstrapping-machine-learning-book-review/\">Machine Learning Mastery</a> and on <a href=\"https://www.goodreads.com/book/show/22515367-bootstrapping-machine-learning\">Goodreads</a>.</p>\n\n<p>Are you intrigued by what the book has to offer, but haven't decided to get it yet? There are three copies to win in PDF / ePub / Mobi formats! <a href=\"http://contest.humancoders.com/contests/26-machine-learning-book\">Sign up here before 7 July 2014</a> (the page is in French  but anyone can sign up).</p>\n\n<h2 id=\"goingfurthertrainingsessions\">Going further: training sessions</h2>\n\n<p>You'll learn a lot with the book, but what should you do if you wanted to learn even more? I've been thinking about this for some time now, and I've been chatting with various people about setting up in-person training sessions. In particular, I've been talking with <a href=\"http://humancoders.com\">HumanCoders</a> who are based in France and who provide a variety of top-quality training to IT, software engineering and web professionals.</p>\n\n<p>Their feedback has been extremely useful when designing a training program. They have a lot of experience in this domain and they have perfected the art of creating engaging learning experiences. We have recently advertized dates for a first training session in Paris. It will span 3 days and half of the time will be dedicated to hands-on work. You can <a href=\"http://formations.humancoders.com/formations/machine-learning\">check out the program here</a> (in French, again).</p>\n\n<p>In the near future I'll be looking to propose the same training in other cities worldwide. Stay tuned!</p>\n\n<h2 id=\"aninterview\">An interview</h2>\n\n<p>If you read French (or if you're happy with Google Translate), you may also be interested in having a look at <a href=\"http://blog.humancoders.com/interview-louis-dorard-formateur-machine-learning-1239/\">this interview</a> I did for the HumanCoders blog in which I explain what brought me to the field of Machine Learning, then to write a book and finally to give training sessions.</p>",
  "media:content": {
    "media:title": "Training, interview and books to win with HumanCoders"
  }
}