{
  "title": "The NVIDIA GeForce Project Beyond and GTC Fall 2022 Keynote Live Blog (Starts at 8am PT/15:00 UTC)",
  "dc:creator": "Ryan Smith & Gavin Bonshor",
  "description": " <p>Kicking off a bit later this morning will be NVIDIA&rsquo;s GTC 2022 fall keynote, which should prove to be a very interesting event.</p>\n\n<p>Besides NVIDIA&rsquo;s usual run-through of business announcements, the first part of this GTC&rsquo;s keynote will be focused on NVIDIA&rsquo;s GeForce products, making for a very rare appearance at NVIDIA&rsquo;s increasingly enterprise-focused event. NVIDIA has been teasing the GeForce portion of the event as &ldquo;Project Beyond&rdquo; for about the past month, and in traditional secretive NVIDIA fashion, that&rsquo;s all we officially know ahead of the show.</p>\n\n<p>Given the timing of this event, the announcement of NVIDIA&rsquo;s next-generation of consumer video cards (GeForce RTX 40 series?) and associated GPUs is a very safe bet. The GeForce RTX 30 series premiered just over two years ago, which is right in line with NVIDIA&rsquo;s usual bi-yearly architecture cadence.</p>\n\n<p>Significant performance improvements are (hopefully) in the cards, but it will be interesting to see what NVIDIA does in light of the current cypto hangover, which hit a fevered pitch last week with the long-awaited completion of the Ethereum Merge &ndash; eliminating the need for video cards to mine the popular cryptocoin. The market for video cards is almost certain to be saturated for the next several months, especially as the performance levels covered by the current RTX 30 series cards. Which means it&rsquo;s cards that would be faster than the RTX 3090 and its ilk that are the most likely to succeed in the current climate.</p>\n\n<p>At the same time, from a graphics feature standpoint NVIDIA has been relatively stagnant since the release of the Turing architecture (RTX 20 series) in 2018, when NVIDIA first added DirectX 12 Ultimate (FL 12_2) support. As a result, a more feature-focused release would not be unusual for NVIDIA, but at the same time we&rsquo;re not immediately aware of any new features under development for DirectX.</p>\n\n<p>Following CEO Jensen Huang&rsquo;s GeForce presentation, we&rsquo;re expecting the GTC keynote to then dovetail into a more traditional enterprise presentation. NVIDIA&rsquo;s H100 Hopper accelerator will no doubt be a big focus, as it&rsquo;s slated to ship soon. As well, NVIDIA has been ever-increasingly focused on robotics, medical, automotive, and of course their omniverse simulation environment. So there should be no shortage of other things to talk about &ndash; even if we&rsquo;re here first and foremost for the gaming cards.</p>\n\n<p>NVIDIA's keynote starts at 8am Pacific (15:00 UTC), so please join us for our live blog coverage of the green machine&rsquo;s latest announcements.</p>\n",
  "link": "https://www.anandtech.com/show/17583/the-nvidia-geforce-project-beyond-and-gtc-fall-2022-keynote-live-blog-starts-at-8am-pt1500-utc",
  "pubDate": "Tue, 20 Sep 2022 08:00:00 EDT",
  "guid": "tag:www.anandtech.com,17583:news",
  "category": " GPUs"
}