{
  "id": "yt:video:MdExxcRrC9g",
  "yt:videoId": "MdExxcRrC9g",
  "yt:channelId": "UCVpankR4HtoAVtYnFDUieYA",
  "title": "True Facts: Trap Jaw Ants",
  "link": "",
  "author": {
    "name": "zefrank1",
    "uri": "https://www.youtube.com/channel/UCVpankR4HtoAVtYnFDUieYA"
  },
  "published": "2021-04-14T18:58:02+00:00",
  "updated": "2022-03-05T20:52:45+00:00",
  "media:group": {
    "media:title": "True Facts: Trap Jaw Ants",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "SUBSCRIBE TO ANTLAB: http://www.youtube.com/antlab\nTrue Facts Poster! https://ze-true-store.myshopify.com/\nCREDITS:\n\nThank you to Dr. Adrian Smith! Most of the footage in this video is from Dr. Smith's YouTube channel. He has all sorts of wonderful content there, and does a much more thorough job in explaining all of the science behind his work.\n\nThank you to Dr. Alex Wild! Please look at Dr. Wild's incredible collection of photos: http://www.alexanderwild.com\n\nThank you Dr. Fred Larabee,  Josh C. Gibson &#13;and DR. Eduardo Fox for their amazing footage.\n\nResearch:\n\nBooher DB, Gibson JC, Liu C, Longino JT, Fisher BL, Janda M, et al. 2021. Functional innovation promotes diversification of form in the evolution of an ultrafast trap-jaw mechanism in ants. PLoS Biol 19(3): e3001031. https://doi.org/10.1371/journal.pbio.3001031\n\nFOX, E.G.P., SMITH, A.A., GIBSON, J.C. & SOLIS, D.R. 2017: Larvae of trap-jaw ants, Odontomachus LATREILLE, 1804 (Hymenoptera: Formicidae): morphology and biological notes. – Myrmecological News 25: 17-28.\n\nLarabee, Fredrick J. and Suarez, Andrew V. 2014. \"The evolution and functional morphology of trap-jaw ants (Hymenoptera: Formicidae).\" Myrmecological News 20: 25– 36.\n\nLarabee FJ, Suarez AV 2015. Mandible-Powered Escape Jumps in Trap-Jaw Ants Increase Survival Rates during Predator-Prey Encounters. PLOS ONE 10(5): e0124871.\n\nLarabee, Fredrick J., Smith, Adrian A. and Suarez, Andrew V. 2018. Snap-jaw morphology is specialized for high-speed power amplification in the Dracula ant, Mystrium camillae R. Soc. Open Sci 5: 181447\n\nSmith, A.A. 2019.  Prey specialization and chemical mimicry between Formica archboldi and Odontomachus ants. Insect. Soc. 66, 211–222.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}