{
  "title": "The Treasonous Oath Keepers and Proud Boys",
  "description": "<p>On today's ZBT we've got 5 Rounds in the magazine ...\n\nROUND 1: A little bad ass was born in Brazil. We gotta get a few recruiters down there right away because the next big super weapon should not be a soccer player. \n\nROUND 2: We have an update on the Sarah Cavanaugh case. If you recall, she was the fake Marine who got hundreds of thousands of dollars pretending to have cancer and a shit ton of other things. Justice was served like a plate of spagetti at Newark International Airport. \n\nROUND 3: Do the Oath Keepers militia & military veterans go together like peas & carrots? Peanut butter & jelly? Warm mayonnaise & cheese in tin foil at the beach? According to the Jan 6th hearings they just might. Also, Kate reveals their bizarre initiation ritual.\n\nROUND 4: The NASA news was revealed after our last show and even I gotta admit, it’s wildly more complicated and incredible than my little pea brain can comprehend. \n\nROUND 5: The wild story of how an American POW who was captured by the Germans ended up escaping, fighting alongside the Soviets in WWII, and probably having the biggest dong in an era of big ole dongs. \n\nSUPPORT THE SHOW!\n\nWhistlePig Whiskey\t\n- Get your bottle at https://barstool.link/WPZBT or at a local retailer.\n\nFreedom Grooming\t\n- Go to https://barstool.link/FreedomgroomingZBT for 20% off\n\nRoman\t\n- Go to https://barstool.link/RomanZBT to get your first month of Swipes for just $5 when you choose a monthly plan.\n\nSiriusXM\t\n- Subscribe now and get your first 3 months for free of the Sirius XM App, visit https://barstool.link/SXMZBT to sign up.\n\nCheck out Barstool Sports for more: http://www.barstoolsports.com\n\nFollow Zero Blog Thirty here:\nFacebook: https://facebook.com/zeroblog30/\nTwitter: https://twitter.com/zeroblog30\nInstagram: http://instagram.com/zeroblog30</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/ZeroBlog30\">barstool.link/ZeroBlog30</a></p>",
  "guid": "e2056ba8-2218-441e-88bb-2f4abe4ce18b",
  "pubDate": "Fri, 15 Jul 2022 07:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/zero-blog-thirty",
  "itunes:explicit": "yes",
  "itunes:duration": "01:23:11",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}