{
  "title": "88: Eating for Your Brain with Dr. Lisa Mosconi",
  "pubDate": "Thu, 13 Dec 2018 14:00:00 +0000",
  "guid": "837ba7bbe57e4db8b73a07dd2f79deff",
  "link": "https://sites.libsyn.com/94610/88-eating-for-your-brain-with-dr-lisa-mosconi",
  "itunes:image": "",
  "description": "<p class=\"p1\">How do you have better focus? How do you improve your memory? How do you improve your thinking ability? What are the best foods for your brain?<br /> <br /> What you eat matters, especially for your gray matter.<br /> <br /> And who better to have this discussion with than Dr. Lisa Mosconi? She’s the author of an incredible book called, Brain Food, a must-read for anyone interested in having a healthy and powerful brain.<br /> <br /> Dr. Mosconi holds a Ph.D. degree in Neuroscience and Nuclear Medicine and is a certified Integrative Nutritionist and holistic healthcare practitioner.<br /> <br /> Her research is well known regarding the early detection of Alzheimer’s disease in at-risk individuals using brain imaging techniques such as positron emission tomography (PET) and magnetic resonance imaging (MRI). She is passionately interested in how the risk of memory loss and Alzheimer’s disease can be mitigated, if not prevented through the combination of appropriate medical care and lifestyle modifications involving diet, nutrition, physical and intellectual fitness.<br /> <br /> In this episode, we’re taking you to the kitchen and share with you foods you can eat right now to boost your brain health and the foods you should avoid. <br /> <br /></p> <p class=\"p1\">** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "content:encoded": "<p class=\"p1\">How do you have better focus? How do you improve your memory? How do you improve your thinking ability? What are the best foods for your brain?  What you eat matters, especially for your gray matter.  And who better to have this discussion with than Dr. Lisa Mosconi? She’s the author of an incredible book called, Brain Food, a must-read for anyone interested in having a healthy and powerful brain.  Dr. Mosconi holds a Ph.D. degree in Neuroscience and Nuclear Medicine and is a certified Integrative Nutritionist and holistic healthcare practitioner.  Her research is well known regarding the early detection of Alzheimer’s disease in at-risk individuals using brain imaging techniques such as positron emission tomography (PET) and magnetic resonance imaging (MRI). She is passionately interested in how the risk of memory loss and Alzheimer’s disease can be mitigated, if not prevented through the combination of appropriate medical care and lifestyle modifications involving diet, nutrition, physical and intellectual fitness.  In this episode, we’re taking you to the kitchen and share with you foods you can eat right now to boost your brain health and the foods you should avoid.  </p> <p class=\"p1\">** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "enclosure": "",
  "itunes:duration": "19:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you have better focus? How do you improve your memory? How do you improve your thinking ability? What are the best foods for your brain?  What you eat matters, especially for your gray matter.  And who better to have this discussion with than...",
  "itunes:episodeType": "full"
}