{
  "title": "China’s Moon Missions Shadow NASA Artemis’s Pace",
  "link": "https://spectrum.ieee.org/china-moon-mission-artemis",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/an-image-showing-the-long-march-5-y5-rocket-at-the-wenchang-spacecraft-launch-site-in-south-china-s-hainan-province.jpg?id=31360306&width=1200&height=800&coordinates=0%2C6%2C0%2C6\"/><br/><br/><p>This past weekend, NASA scrubbed the Artemis I uncrewed mission to the moon and back. <a href=\"https://www.bloomberg.com/news/articles/2022-09-03/nasa-delays-artemis-launch-due-to-hydrogen-leak\" target=\"_blank\">Reportedly</a>, the space agency will try again to launch the inaugural moon mission featuring the gargantuan Space Launch System (SLS) at the end of this month or sometime in October. Meanwhile, half a world away, China is progressing on its own step-by-step program to put both robotic and, eventually, crewed spacecraft on the lunar surface and keep pace with NASA-led achievements.</p><p>Asia’s rapidly growing space power has already made a number of impressive lunar leaps but will need to build on these in the coming years. Ambitious sample-return missions, landings at the lunar south pole, testing the ability to 3D print using materials from regolith, and finally sending astronauts on a short-term visit to our celestial neighbor are in the cards before the end of the decade.</p><p>The next step, expected around 2024, is <a href=\"https://en.wikipedia.org/wiki/Chang%27e_6\" target=\"_blank\">Chang’e-6</a>: an unprecedented attempt to collect rock samples from the far side of the moon.</p><p>The mission will build on two recent major space achievements. In 2019, China became the first country to safely land a spacecraft on the <a href=\"https://spectrum.ieee.org/china-gears-up-for-ambitious-landing-on-the-moons-far-side\" target=\"_self\">far side of the moon</a>, a hemisphere which cannot be seen from Earth—as the moon is <a href=\"https://www.sciencefocus.com/space/what-is-tidal-locking/\" target=\"_blank\">tidally locked</a>. The mission was made possible by a <a href=\"https://spectrum.ieee.org/pioneering-astronomy-experiment-begins-beyond-the-moon\" target=\"_self\">relay satellite</a> out beyond the moon at Earth-moon Lagrange point 2, where it can bounce signals between <a href=\"https://en.wikipedia.org/wiki/Chang%27e_4\" target=\"_blank\">Chang’e-4</a> and ground stations in China.</p><p><a href=\"https://en.wikipedia.org/wiki/Chang%27e_5\" target=\"_blank\">Chang’e-5</a> in 2020 performed the first sampling of lunar material in over four decades. The complex, four-spacecraft mission used an orbiter, lander, ascent vehicle, and return capsule to successfully deliver 1.731 grams of lunar rocks to Earth. The automated rendezvous and docking in lunar orbit of the orbiter and ascent spacecraft was also seen as a test of the technology for getting astronauts off the moon and back to Earth.</p><p>Chang’e-6 will again attempt to collect new samples, this time from the <a href=\"https://en.wikipedia.org/wiki/South_Pole%E2%80%93Aitken_basin\" target=\"_blank\">South pole-Aitken basin</a>, a massive and ancient impact crater on the far side of the moon. The science return of such a mission could likewise be huge as its rocks have the potential to answer some significant questions about the moon’s geological past, says planetary scientist <a href=\"http://directory.manchester.ac.uk/advanced.php?dn=cn%3DKatherine+Joy%2Bumanroleid%3D306901%2Cou%3DDepartment+of+Earth+and+Environmental+Sciences%2Cou%3DSchool+of+Natural+Sciences%2Cou%3DFaculty+of+Science+and+Engineering%2Cou%3DPeople%2Co%3DUniversity+of+Manchester%2Cc%3DGB&employeeType=STAFF&action=read&form_input=Submit\" rel=\"noopener noreferrer\" target=\"_blank\">Katherine Joy</a> of the <a href=\"https://www.manchester.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Manchester</a>, in England.</p><p>“We think that the basin-formation event was so large that the moon’s mantle could have been excavated from tens of kilometers deep,” says Joy. Fragments of this mantle material originating from deep in the moon would help us to understand how the Moon differentiated early in its history, the nature of its interior, and how volcanism on the far side of the moon is different or similar to that on the nearside.</p><p><a href=\"http://www.cnsa.gov.cn/english/n6465652/n6465653/c6813273/content.html\" rel=\"noopener noreferrer\" target=\"_blank\">Chang’e-7</a>, also scheduled for 2024, will look at a different set of questions geared toward lunar resources. It will target the lunar south pole, a region where NASA’s Artemis 3 crewed mission is also <a href=\"https://www.scientificamerican.com/article/nasa-unveils-candidate-landing-sites-for-artemis-astronauts/\" rel=\"noopener noreferrer\" target=\"_blank\">looking to land</a>.</p><p>The mission will involve a flotilla of spacecraft, including a new relay satellite, an orbiter, lander, rover and a small “hopping” spacecraft designed to<a href=\"https://spacenews.com/china-targets-permanently-shadowed-regions-at-lunar-south-pole/\" rel=\"noopener noreferrer\" target=\"_blank\"> inspect permanently shadowed craters</a> which are thought to <a href=\"https://spectrum.ieee.org/rocket-mining-system-could-blast-ice-from-lunar-craters\" target=\"_self\">contain water ice</a> which could be used in the future to provide breathable oxygen, rocket fuel, or drinking water to lunar explorers.</p><p>Following this <a href=\"https://nssdc.gsfc.nasa.gov/planetary/lunar/cnsa_moon_future.html\" rel=\"noopener noreferrer\" target=\"_blank\">Chang’e-8</a> is expected to launch around 2027 to test in situ resource utilization and conduct other experiments and technology tests such as oxygen extraction and 3D printing related to building a permanent lunar base—for both robots and crew—in the 2030s, named the <a href=\"https://spectrum.ieee.org/china-aims-for-a-permanent-moon-base-in-the-2030s\" target=\"_self\">International Lunar Research Station</a> (ILRS).</p><p>The upcoming Chang’e-6, 7 and 8 missions are expected to launch on China’s largest current rocket, the <a href=\"https://en.wikipedia.org/wiki/Long_March_5\" target=\"_blank\">Long March 5</a>. But, as with NASA and Artemis, China will need its own megarockets to make human lunar exploration and ultimately, perhaps, crewed lunar bases a reality.</p><p>In part in reaction to the achievements of SpaceX, the China Aerospace Science and Technology Corporation (CASC), the country’s main space contractor, is developing a <a href=\"https://www.globaltimes.cn/page/202208/1273481.shtml\" rel=\"noopener noreferrer\" target=\"_blank\">new rocket </a>specifically for launching astronauts beyond low Earth orbit.</p><p>The “new generation crew launch vehicle” will essentially bundle three Long March 5 core stages together (which will be no mean feat of engineering) while also improving the performance of its kerosene engines. The result will be a roughly 90-meter-tall rocket resembling a Long March version of SpaceX’s <a href=\"https://spectrum.ieee.org/tag/falcon-heavy\" target=\"_self\">Falcon Heavy</a>, capable of sending 27 tonnes of payload into translunar injection.</p><p>Two launches of the rocket will by 2030, according to leading <a href=\"https://spacenews.com/chinese-crewed-moon-landing-possible-by-2030-says-senior-space-figure/\" rel=\"noopener noreferrer\" target=\"_blank\">Chinese space officials</a>, be able to put a pair of astronauts on the moon for a 6-hour stay. Such a mission also requires developing a <a href=\"https://spacenews.com/china-is-working-on-a-lander-for-human-moon-missions/\" rel=\"noopener noreferrer\" target=\"_blank\">lunar lander</a> and a <a href=\"https://www.space.com/china-displays-next-generation-spaceship\" rel=\"noopener noreferrer\" target=\"_blank\">new spacecraft</a> capable of keeping astronauts safe in deep space.</p><p>For building infrastructure on the moon, China is looking to the future <a href=\"https://en.wikipedia.org/wiki/Long_March_9\" target=\"_blank\">Long March 9</a>, an SLS-class rocket capable of sending 50 tonnes into translunar injection. The project will require CASC to make breakthroughs in a number of areas, including manufacturing new, <a href=\"https://mp.weixin.qq.com/s/cy6N-3JCHE_HFaxG4nXA1Q\" rel=\"noopener noreferrer\" target=\"_blank\">wider rocket bodies</a> of up to 10 meters in diameter, mastering massive, <a href=\"http://www.spacechina.com/n25/n2014789/n2014804/c3150470/content.html\" rel=\"noopener noreferrer\" target=\"_blank\">higher-thrust rocket engines,</a> and building a new launch complex at Wenchang, Hainan island, to handle the monster.</p><p>Once again NASA is leading humanity’s journey to the moon, but China’s steady accumulation of capabilities and long-term ambitions means it will likely not be far behind.</p>",
  "pubDate": "Wed, 07 Sep 2022 16:56:57 +0000",
  "guid": "https://spectrum.ieee.org/china-moon-mission-artemis",
  "category": [
    "China space exploration",
    "Lunar exploration",
    "Lunar landing",
    "Lunar base"
  ],
  "dc:creator": "Andrew Jones",
  "media:content": ""
}