{
  "title": "Tigray Update, with Terje Østebø",
  "description": "<p>I’m very grateful that the University of Florida’s Terje Østebø was able to make his third <em>Foreign Exchanges</em> appearance this week to talk about the rapidly changing situation in Ethiopia’s Tigray region. When Terje and I <a target=\"_blank\" href=\"https://fx.substack.com/p/ethiopias-tigray-conflict-with-terje\">last spoke</a> the Ethiopian military, alongside elements of the Eritrean military and Amhara regional security forces, had driven the Tigray People’s Liberation Front out of Mekelle and seemed to be in control of most of the region. In the past couple of weeks that situation has been completely upended, with the TPLF now back in control of nearly all but the western portion of Tigray, currently held by the Amhara. Terje and I discuss the shocking speed of the TPLF’s turnaround, the dire humanitarian situation in Tigray, and the likelihood of further conflict.</p><p>Terje Østebø received his PhD in the History of Religion from Stockholm University, and is currently the chair of the Department of Religion and associate professor at the Center for African Studies and the Department of Religion, University of Florida. He is also the founding director of the UF Center for Global Islamic Studies. His research interests are Islam in contemporary Ethiopia, Islam, politics, and Islamic reformism in Ethiopia and the Horn of Africa, ethnicity and religion, as well as Salafism in Africa. He has lived in Ethiopia for 6 years, and has extensive field-research experience.</p><p>Terje’s major publications include “African Salafism: Religious Purity and the Politicization of Purity” in <em>Islamic Africa, </em>6, 1-2, 2015; <em>Muslim Ethiopia: The Christian Legacy, Identity Politics, and Islamic Reformism</em> (co-edited with Patrick Desplat), (Palgrave-Macmillan 2013); <em>Localising Salafism: Religious Change among Oromo Muslims in Bale, Ethiopia </em>(Brill 2012); <em>Islamism in the Horn of Africa: Assessing Ideology, Actors, and Objectives</em>,International Law and Policy Institute (2010). His latest book, <em>Islam, Ethnicity, and Conflict in Ethiopia: The Bale Insurgency (1963-1970)</em>, is now <a target=\"_blank\" href=\"https://www.cambridge.org/us/academic/subjects/history/african-history/islam-ethnicity-and-conflict-ethiopia-bale-insurgency-1963-1970?format=HB\">available for purchase</a>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/tigray-update-with-terje-steb",
  "guid": "substack:post:38577338",
  "dc:creator": "Derek Davison",
  "pubDate": "Fri, 09 Jul 2021 17:55:02 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 3395,
  "itunes:image": ""
}