{
  "title": "Grain Growth in the Dust Ring with Crescent around Very Low Mass Star ZZ Tau IRS with JVLA. (arXiv:2211.01570v1 [astro-ph.EP])",
  "link": "http://arxiv.org/abs/2211.01570",
  "description": "<p>The azimuthal asymmetries of dust rings in protoplanetary disks such as a\ncrescent around young stars are often interpreted as dust traps, and thus as\nideal locations for planetesimal and planet formations. Whether such dust traps\neffectively promote planetesimal formation in disks around very-low-mass stars\n(VLM; a mass of $\\lesssim$0.2~$M_\\odot$) is debatable, as the dynamical and\ngrain growth timescales in such systems are long. To investigate grain growth\nin such systems, we studied the dust ring with crescent around the VLM star\nZZ~Tau~IRS using the Karl G. Jansky Very Large Array (JVLA) at centimeter\nwavelengths. Significant signals were detected around ZZ~Tau~IRS. To estimate\nthe maximum grain size ($a_{\\rm max}$) in the crescent, we compared the\nobserved spectral energy distribution (SED) with SEDs for various $a_{\\rm max}$\nvalues predicted by radiative transfer calculations. We found $a_{\\rm max}\n\\gtrsim$~1~mm and $\\lesssim$~60~$\\mu$m in the crescent and ring, respectively,\nthough our modeling efforts rely on uncertain dust properties. Our results\nsuggest that grain growth occurred in the ZZ~Tau~IRS disk, relative to\nsub-micron-sized interstellar medium. Planet formation in crescent with\nmm-sized pebbles might proceed more efficiently than in other regions with\nsub-millimeter-sized pebbles via pebble accretion scenarios.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Hashimoto_J/0/1/0/all/0/1\">Jun Hashimoto</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Liu_H/0/1/0/all/0/1\">Hauyu Baobab Liu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Dong_R/0/1/0/all/0/1\">Ruobing Dong</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Liu_B/0/1/0/all/0/1\">Beibei Liu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Muto_T/0/1/0/all/0/1\">Takayuki Muto</a>"
}