{
  "title": "S17 Ep85: The Colony: Faith and Blood in a Promised Land w/Sally Denton",
  "link": "https://audioboom.com/posts/8123130",
  "itunes:episode": 85,
  "itunes:title": "The Colony: Faith and Blood in a Promised Land w/Sally Denton",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 8406,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>True Crime Tuesday presents The Colony: Faith and Blood in a Promised Land w/Sally Denton!<br>\n<br>\nOn the morning of November 4, 2019, an unassuming caravan of women and children was ambushed by masked gunmen on a desolate stretch of road in northern Mexico controlled by the Sinaloa drug cartel. Firing semi-automatic weapons, the attackers killed nine people and gravely injured five more. The victims were members of the LeBaron and La Mora communities—fundamentalist Mormons whose forebears broke from the LDS Church and settled in Mexico when their religion outlawed polygamy in the late nineteenth century. The massacre produced international headlines for weeks, and prompted President Donald Trump to threaten to send in the US Army.<br>\n<br>\nIn <em>The Colony</em>, bestselling investigative journalist Sally Denton picks up where the initial, incomplete reporting on the attacks ended, and delves into the complex story of the LeBaron clan. Everything from it's migration to Mexico to it's unusual fight for water rights, to surviving the formation of Mexico's drug cartels and their recent  alliance with the NXIVM sex cult, whose now-imprisoned leader, Keith Raniere, may have based his practices on the society he witnessed in Colonia LeBaron.<br>\n<br>\nPLUS: An all new Dumb Crimes/Stupid Criminals with Beer City Bruiser!!<br>\n<br>\nGet your copy of \"The Colony...\" here:  <a href=\"https://amzn.to/3yPbpt0\">https://amzn.to/3yPbpt0</a><br>\n<br>\nCheck out all of Sally Denton's books here:  <a href=\"https://sallydenton.com/\">https://sallydenton.com/</a><br>\n<br>\n#crime #truecrime #truecrimeppodcasts #truecrimeradio #truecrimetuesday #timdennis #beercitybruiser #ringofhonorwrestiling #dumbcrimesstupidcriminals <br>\n#sallydenton #Thecolony #thecolonyfaithandblood #thecolonyfathandbloodinapromised land #latterdaysaints #mormons #polygamy #polygamists #LDSchurch #colonialebaron #elchapo #murder #lamora #NXIVM #KeithRaniere</div>\n",
  "pubDate": "Tue, 19 Jul 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-18:/posts/8123130",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}