{
  "title": "503: The Best and Worst of Ron Weasley",
  "link": "https://audioboom.com/posts/7812981",
  "itunes:episode": 503,
  "itunes:title": "The Best and Worst of Ron Weasley",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4001,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Happy Birthday, Ronald Bilius Weasley! Today we're kicking off a new monthly feature, where we’ll be hosting a main character discussion timed around their birthday. We start with Ron!</li>\n<li>One of the most underrated characters in the Wizarding World, let's get Ron's Fandom ID!</li>\n<li>We discuss our first impressions of Harry's best friend and Ron's complex about his family's socioeconomic status</li>\n<li>What were our favorite Ron moments in the books? What was his defining chapter?</li>\n<li>What were some of Ron's worst character moments? We discuss The Yule Ball Dating Lavender, and more. </li>\n<li>In celebration of Rupert Grint, we share our favorite Ron scenes from the movies!</li>\n<li>... But we can't forget <a href=\"https://www.mugglenet.com/2015/09/7-times-hermione-granger-took-ron-weasleys-lines-in-the-movies/\">all the great Ron moments</a> that were given to Hermione in the films!</li>\n<li>What would each of the hosts get Ron for his birthday?</li>\n<li>We play two Ron-themed games: Snog, Marry, Avada Kedavra and Two Truths, One Lie!</li>\n<li>Quizzitch: What did Fred turn into a spider when Ron was three? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by MDAcne (Visit <a href=\"http://www.MDAcne.com/mugglecast\">MDAcne.com/mugglecast</a> to get your first month supply free!) and HelloFresh (Visit <a href=\"http://www.HelloFresh.com/12muggle\">HelloFresh.com/12muggle</a> and use code 12 muggle for 12 FREE meals!)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 02 Mar 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-01:/posts/7812981",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}