{
  "title": "#107/New York's Josh Ramus",
  "pubDate": "Mon, 15 Jul 2019 07:00:00 +0000",
  "guid": "48e00ac1523344a3b463360295e9b577",
  "link": "https://traffic.libsyn.com/secure/usmodernist/USM_107_-_Joshua_Ramus1a.mp3",
  "itunes:image": "",
  "description": "<p>In an interview recorded at REX in Brooklyn, New York, <strong>George Smart</strong> sat down with architect <strong>Josh Ramus</strong>. The Huffington Post named him one of the five greatest architects under 50. Wallpaper Magazine described him as one of the world's most influential young architects. Esquire Magazine dubbed him the young saviour of American architecture. Icon Magazine called him one of the 20 Essential Young Architects. And Popular Mechanics said “Josh who? Is he that cold fusion guy?”<br /> <br /> Graduating from Harvard in Architecture in 1996, Ramus worked for <strong><a href=\"http://www.usmodernist.org/koolhaas.htm\">Rem Koolhaas</a></strong> before forming his own practice, REX, in 2006. Like many famous architects, <a href= \"http://www.usmodernist.org/gwathmey.htm\">Charles Gwathmey</a> and <a href=\"http://www.usmodernist.org/meier.htm\">Richard Meier</a> come to mind, his mom helped him get the project that rocket-launched his career. He has been a Visiting Professor at Yale, Rice, Columbia, Harvard, MIT, and Syracuse. And in his spare time, he trained for the Olympics!</p>",
  "content:encoded": "<p>In an interview recorded at REX in Brooklyn, New York, George Smart sat down with architect Josh Ramus. The Huffington Post named him one of the five greatest architects under 50. Wallpaper Magazine described him as one of the world's most influential young architects. Esquire Magazine dubbed him the young saviour of American architecture. Icon Magazine called him one of the 20 Essential Young Architects. And Popular Mechanics said “Josh who? Is he that cold fusion guy?”  Graduating from Harvard in Architecture in 1996, Ramus worked for <a href=\"http://www.usmodernist.org/koolhaas.htm\">Rem Koolhaas</a> before forming his own practice, REX, in 2006. Like many famous architects, <a href= \"http://www.usmodernist.org/gwathmey.htm\">Charles Gwathmey</a> and <a href=\"http://www.usmodernist.org/meier.htm\">Richard Meier</a> come to mind, his mom helped him get the project that rocket-launched his career. He has been a Visiting Professor at Yale, Rice, Columbia, Harvard, MIT, and Syracuse. And in his spare time, he trained for the Olympics!</p>",
  "enclosure": "",
  "itunes:duration": "49:09",
  "itunes:explicit": false,
  "itunes:keywords": "design,josh,modern,architecture,modernist,ramus",
  "itunes:subtitle": "In an interview recorded at REX in Brooklyn, New York, George Smart sat down with architect Josh Ramus. The Huffington Post named him one of the five greatest architects under 50. Wallpaper Magazine described him as one of the world's most influential...",
  "itunes:episodeType": "full",
  "itunes:author": "george smart"
}