{
  "title": "DARPA Wants a Better, Badder Caspian Sea Monster",
  "link": "https://spectrum.ieee.org/darpa-liberty-lifter",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-rendering-of-a-grey-seaplane-with-twin-fuselages-and-backwards-facing-propellers.png?id=29824204&width=1500&height=2000&coordinates=191%2C0%2C191%2C0\"/><br/><br/><p>\n\tArguably, the primary job of any military organization is moving enormous amounts of stuff from one place to another as quickly and efficiently as possible. Some of that stuff is weaponry, but the vast majority are things that support that weaponry—fuel, spare parts, personnel, and so on. At the moment, the U.S. military has two options when it comes to transporting large amounts of payload. Option one is boats (a sealift), which are efficient, but also slow and require ports. Option two is planes (an airlift), which are faster by a couple of orders of magnitude, but also expensive and require runways.\n</p><p>\n\tTo solve this, the Defense Advanced Research Projects Agency (DARPA) wants to combine traditional sealift and airlift with the \n\t<a href=\"https://www.darpa.mil/program/liberty-lifter\" rel=\"noopener noreferrer\" target=\"_blank\">Liberty Lifter program</a><a href=\"https://www.darpa.mil/program/liberty-lifter\" target=\"_blank\"></a>, which aims to “design, build, and flight test an affordable, innovative, and disruptive seaplane” that “enables efficient theater-range transport of large payloads at speeds far exceeding existing sea lift platforms.”\n</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"df229103923a683aec7b2c6e33175770\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/IOnLpXVkkTU?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">DARPA</small>\n</p><p>\n\tDARPA is asking for a design like this to take advantage of ground effect, which occurs when an aircraft’s wing deflects air downward and proximity to the ground generates a cushioning effect due to the compression of air between the bottom of the wing and the ground. This boosts lift and lowers drag to yield a substantial overall improvement in efficiency. Ground effect works on both water and land, but you can take advantage of it for only so long on land before your aircraft runs into something. Which is why oceans are the ideal place for these aircraft—or ships, depending on your perspective.\n</p><p>\n\tDuring the late 1980s, the Soviets (and later the Russians) leveraged ground effect in the design of a handful of awesomely bizarre ships and aircraft. There’s the \n\t<a href=\"https://www.youtube.com/watch?v=H6GE1ZdQTqg\" rel=\"noopener noreferrer\" target=\"_blank\">VVA-14</a>, which was also an airplane, along with the vehicle shown in DARPA’s video above, the <a href=\"https://en.wikipedia.org/wiki/Lun-class_ekranoplan\" target=\"_blank\"><em>Lun</em>-class ekranoplan</a>, which operated until the late 1990s. The video clip really does not do this thing justice, so here’s a better picture, taken a couple of years ago:\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Oblique overhead view of a huge grey seaplane on the water\" class=\"rm-shortcode\" data-rm-shortcode-id=\"d59abc71824006ab63a4c5806614c412\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5d206\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/oblique-overhead-view-of-a-huge-grey-seaplane-on-the-water.jpg?id=29824197&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\"><a href=\"https://www.instagram.com/p/CDlqdzpgnpp/\" rel=\"noopener noreferrer\" target=\"_blank\">Instagram</a></small>\n</p><p>\n\tThe \n\t<em>Lun</em> (only one was ever made) had a wingspan of 44 meters and was powered by eight turbojet engines. It flew about 4 meters above the water at speeds of up to 550 kilometers per hour, and could transport almost 100,000 kilograms of cargo for 2,000 km. It was based on an earlier, even larger prototype (the largest aircraft in the world at the time) that the CIA spotted in satellite images in 1967 and which seems to have seriously freaked them out. It was nicknamed the Caspian Sea Monster, and it wasn’t until the 1980s that the West understood what it was and how it worked.\n</p><p>\n\tIn the mid 1990s, DARPA itself took a serious look at a stupendously large ground-effect vehicle of its own, the \n\t<a href=\"https://en.wikipedia.org/wiki/Aerocon_Dash_1.6_wingship\" target=\"_blank\">Aerocon Dash 1.6 wingship</a>. The concept image below is of a 4.5-million-kg vehicle, 175 meters long with a 100-meter wingspan, powered by 20 (!) jet engines:\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A black and white wireframe drawing of a huge streamlined aircraft\" class=\"rm-shortcode\" data-rm-shortcode-id=\"5a2629b227e4874ba22c0e2355f5b37b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ff2ed\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-black-and-white-wireframe-drawing-of-a-huge-streamlined-aircraft.jpg?id=29824198&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Wikipedia</small>\n</p><p>\n\tWith a range of almost 20,000 km at over 700 km/h, the wingship could have carried 3,000 passengers or 1.4 million kg of cargo. By 1994, though, DARPA had decided that the potential billion-dollar project to build a wingship like this was too risky, and canceled the whole thing.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A concept image of a massive grey seaplane skimming over the ocean\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"b945a1b129f13d09db19e9620082a45b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"96f42\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-concept-image-of-a-massive-grey-seaplane-skimming-over-the-ocean.jpg?id=29824201&width=980\" style=\"max-width: 100%\"/>\n</p><p>\n\tLess than 10 years later, Boeing’s Phantom Works started exploring an enormous ground-effect aircraft, the \n\t<a href=\"https://en.wikipedia.org/wiki/Boeing_Pelican\" target=\"_blank\">Pelican Ultra Large Transport Aircraft</a>. The Pelican would have been even larger than the Aerocon wingship, with a wingspan of 152 meters and a payload of 1.2 million kg—that’s about 178 shipping containers’ worth. Unlike the wingship, the Pelican would take advantage of ground effect to boost efficiency only in transit above water, but would otherwise use runways like a normal aircraft and be able to reach flight altitudes of 7,500 meters. Operating as a traditional aircraft and with an optimal payload, the Pelican would have a range of about 12,000 km. In ground effect, however, the range would have increased to 18,500 km, illustrating the appeal of designs like these. But Boeing dropped the project in 2005 to focus on lower cost, less risky options.\n</p><p>\n\tWe’d be remiss if we didn’t at least briefly mention two other massive aircraft: the \n\t<a href=\"https://www.boeing.com/history/products/h-4-flying-boat.page\" target=\"_blank\">H-4 Hercules</a>, the cargo seaplane built by Hughes Aircraft Co. in the 1940s, and the <a href=\"https://www.stratolaunch.com/vehicles/carrier\" target=\"_blank\">Stratolaunch carrier aircraft</a>, which features a twin-fuselage configuration that DARPA seems to be favoring in its concept video for some reason.\n</p><p>\n\tFrom the sound of DARPA’s announcement, they’re looking for something a bit more like the Pelican than the Aerocon Dash or the \n\t<em>Lun</em>. DARPA wants the Liberty Lifter to be able to sustain flight out of ground effect if necessary, although it’s expected to spend most of its time over water for efficiency. It won’t use runways on land at all, though, and should be able to stay out on the water for 4 to 6 weeks at a time, operating even in rough seas—a significant challenge for ground-effect aircraft.\n</p><p>\n\tDARPA is looking for an operational range of 7,500 km, with a maximum payload of at least 90,000 kg, including the ability to launch and recover amphibious vehicles. The hardest thing DARPA is asking for could be that, unlike most other X-planes, the Liberty Lifter should incorporate a “low cost design and construction philosophy” inspired by the mass-produced Liberty ships of World War II.\n</p><p>\n\tWith US $15 million to be awarded to up to two Liberty Lifter concepts, DARPA is hoping that at least one of those concepts will pass a system-level critical design review in 2025. If everything goes well after that, the first flight of a full-scale prototype vehicle could happen as early as 2027.\n</p><p>\n<em>This article appears in the September 2022 print issue as “DARPA Reincarnates Soviet-Era Sea Monster.”</em>\n</p>",
  "pubDate": "Thu, 19 May 2022 19:31:02 +0000",
  "guid": "https://spectrum.ieee.org/darpa-liberty-lifter",
  "category": [
    "Darpa",
    "X-plane",
    "Aircraft"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}