{
  "title": "Chinese Whispers: the power of Weibo",
  "link": "https://audioboom.com/posts/7996155",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2364,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>When the tennis star Peng Shuai had a row with her former lover, the retired Party cadre Zhang Gaoli, she took to Weibo, the Chinese social media platform, where she had half a million followers. It was in that statement that she accused Zhang of starting their affair with sexual assault.<br>\n<br>\nThe statement was taken down within minutes, demonstrating the power, speed – and, arguably, the manual nature – of China’s online censors. On this podcast, we’ve previously talked about the nature of journalism in China – but what about social media, that inherently decentralised medium? What role does the digital space play in Chinese lives, how reliable is it as a source of Chinese public opinion, and how do people feel about being monitored and, potentially, censored?<br>\n<br>\nOn the podcast, Cindy Yu speaks to Manya Koetse, the founder of <a href=\"http://whatsonweibo.com\">whatsonweibo.com</a>, which collates and translates the latest trends and topics from the platform into English; as well as Shen Lu, a reporter for <em>Protocol</em> who covers China and tech.<br>\n<br>\n\n</div>\n<div>With Manya, they muse about what censorship does to a nation's online discussion: the focus turns to policy issues like health and safety standards, or more superficial discussions like pets and travel. Yet during the early days of the pandemic last year, we both witnessed an incredible night where, on Weibo, WeChat, and other platforms, Dr Li Wenliang's death prompted a universal outpouring of grief. Manya tells Cindy that:  ‘Dr Li was a story that was too big to censor... censoring all of those discussions would have actually caused more unrest’.<br>\n<br>\n\n</div>\n<div>Since the pandemic, the digital sphere has also become more nationalistic: <br>\n<br>\n\n</div>\n<blockquote>'The Hong Kong protests definitely was the moment when I saw this new wave of nationalism online, which you’ve always had, but especially the last two years it’s been so clear. Covid-19 has only strengthened the wave that started back then’</blockquote><div>Cindy also speaks to Shen Lu, who tells her about her experience being censored on Weibo when reporting on China's MeToo movement. Censorship has only become worse in recent years – she says: ' I can no longer tell which friend is which, because we started to self-censor'. More optimistically though, Lu tells Cindy that all the same political conversations among liberal minded young Chinese are still happening – simply offline, these days.</div>\n",
  "pubDate": "Mon, 13 Dec 2021 18:05:48 +0000",
  "guid": "tag:audioboom.com,2021-12-13:/posts/7996155",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}