{
  "title": "S14 Ep93: Deja Vu and Timeless Encounters of the Supernatural",
  "link": "https://audioboom.com/posts/8098537",
  "itunes:episode": 93,
  "itunes:title": "Deja Vu and Timeless Encounters of the Supernatural",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5247,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS encounters Deja Vu & Timeless Encounters of the Supernatural with Prof. Bruce Olav Solheim PHD <br>\n<br>\nToday we go along on the paranormal travels of an everyday guy, seen and told through his eyes. From childhood through adolescence to adulthood, Prof. Bruce Olav Solheim PHD. tells the story of one man's travels through the paranormal universe and out the other side. Engrossing and highly entertaining, join us with guest Prof. Bruce Solheim as we share his journey.<br>\n<br>\nFollow our guest here: <a href=\"http://www.bruceolavsolheim.com\">www.bruceolavsolheim.com</a><br>\n<br>\nOrder his books Timeless and De Ja Vu here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL games and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nLooking for a suitcase that is thoughtfully designed, Very durable, and keeps everything organized? Away has a bag in your size that is lightweight and has wheels that won't stick!  Plus, you can get $20 off of a suitcase right now by going to <a href=\"http://awaytravel.com/darkness\">awaytravel.com/darkness</a> and using the code DARKNESS during checkout!!",
  "itunes:summary": "BEYOND the DARKNESS encounters Deja Vu & Timeless Encounters of the Supernatural with Prof. Bruce Olav Solheim PHD \n\nToday we go along on the paranormal travels of an everyday guy, seen and told through his eyes. From childhood through...",
  "pubDate": "Sun, 10 Nov 2019 10:00:00 +0000",
  "guid": "dd161823-9b92-4865-9509-d201aee4fddd",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}