{
  "title": "511: Listeners Share Funny Harry Potter Plot Holes, and more MuggleMail",
  "link": "https://audioboom.com/posts/7853018",
  "itunes:episode": 511,
  "itunes:title": "Listeners Share Funny Harry Potter Plot Holes, and more MuggleMail",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3905,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>News: Harry Potter flagship store <a href=\"https://ew.com/movies/first-look-harry-potter-new-york-store/\">opening</a> on June 3 in New York City, but not everyone on the panel is into the news.</li>\n<li>This week’s episode is all MuggleMail!</li>\n<li>Did Harry's \"I am The Chosen One\" line miss its mark with some fans?</li>\n<li>Listeners share lots of feedback on our Fred and George episode! We even hear from several twins!</li>\n<li>Should you omit \"problematic\" parts of the books when reading Harry Potter to your children?</li>\n<li>Seline from South Australia sparks a spirited discussion about teaching basic reading, writing and arithmetic at Hogwarts!</li>\n<li>Do the hosts enjoy the books more because the movies omit so much?</li>\n<li>We examine a secret deleted scene from the Goblet of Fire movie</li>\n<li>Night Crawler: Wasn't Harry old enough to crawl or even walk away from the Dursley's doorstep at the beginning of Sorcerer's Stone?</li>\n<li>Everyone seems to want a Harry Potter TV show. Well, what if it's <em>really</em> bad?</li>\n<li>Is Ron the glue that holds the trio together?</li>\n<li>What was Hermione doing on the train ride to Hogwarts while Harry and Ron were in the flying Ford Anglia?</li>\n<li>Why weren't students told Voldemort's real name?</li>\n<li>We answer a vintage email from August 2007! Did Ron use Helga Hufflepuff's Cup to gain entrance to the Chamber of Secrets?</li>\n<li>Quizzitch: What is the mathematical formula for determining the circumference of a circle? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by BetterHelp (Get 10% off your first month at <a href=\"https://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>) and <a href=\"http://www.usualwines.com/\">Usual Wines</a> (get your first glass on us by using code ‘mugglecast’ at checkout)!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like access to our recording studio, Bonus MuggleCast a personalized thank you video from one of the hosts and more!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 27 Apr 2021 11:00:00 +0000",
  "guid": "tag:audioboom.com,2021-04-26:/posts/7853018",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}