{
  "title": "Episode 48: &#8220;Rock With the Caveman&#8221; by Tommy Steele",
  "link": "https://500songs.com/podcast/episode-48-rock-with-the-caveman-by-tommy-steele/",
  "pubDate": "Mon, 02 Sep 2019 07:18:35 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-48-rock-with-the-caveman-by-tommy-steele/",
  "description": "<p>Welcome to episode forty-eight of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Rock With the Caveman\" by Tommy Steele, and the birth of the British rock and roll industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have <a href=\"https://www.patreon.com/posts/29641954\">a bonus episode available</a>. This one's on \"The Death of Rock and Roll\" by the Maddox Brothers and Rose, in which we look at a country group some say invented rock & roll, and how they reacted badly to it</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-48-rock-with-the-caveman/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p><a href=\"https://amzn.to/2lT5kKg\">This double-CD set</a> contains all Steele's rock and roll material, plus a selection of songs from the musicals he appeared in later.</p>\n<p><a href=\"https://amzn.to/2lT8tty\">This MP3 compilation,</a> meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll, including Steele's. Much of the music is not very good, but I can't imagine a better way of getting an understanding of the roots of British rock.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective.</p>\n<p><a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and covers Steele from the skiffle perspective.</p>\n<p><a href=\"https://amzn.to/2lTTS11\">Fings Ain't What They Used T'Be: The Life of Lionel Bart by David & Caroline Stafford</a> gave me a lot of information on Steel's songwriting partner.</p>\n<p><a href=\"https://amzn.to/2lvHyUA\">Steele's autobiography, Bermondsey Boy, c</a>overs his childhood and early stardom. I am not 100% convinced of its accuracy, but it's an entertaining book, and if nothing else probably gives a good idea of the mental atmosphere in the poor parts of South London in the war and immediate post-war years.</p>\n<p><a href=\"https://amzn.to/2kcZq6n\">And George Melly's Revolt Into Style</a> was one of the first books to take British pop culture seriously, and puts Steele into a wider context of British pop, both music and art.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Let's talk a little bit about the Piltdown Man.</p>\n<p>Piltdown Man was an early example of a hominid -- a missing link between the apes and humans. Its skull was discovered in 1912 in Piltdown, East Sussex, by the eminent archaeologist Charles Dawson, and for years was considered one of the most important pieces of evidence in the story of human evolution.</p>\n<p>And then, in 1953, it was discovered that the whole thing was a hoax, and not even a particularly good one. Someone had just taken the jaw of an orang-utan and the top part of a human skull, and filed down the orang-utan teeth, and then stained the bones to make them look old. It was almost certainly the work of Dawson himself, who seems to have spent his entire life making fraudulent discoveries. Dawson had died decades earlier, and the full extent of his fraud wasn't even confirmed until 2003.</p>\n<p>Sometimes researching the history of rock and roll can be a lot like that. You can find a story repeated in numerous apparently reliable books, and then find out that it's all based on the inaccurate testimony of a single individual. The story never happened. It was just something someone made up.</p>\n<p>[Excerpt: \"Rock With the Caveman\", Tommy Steele and the Steelmen]</p>\n<p>We talked a little while ago about the skiffle movement, and the first British guitar-based pop music. Today, we're going to look at the dawn of British rock and roll.</p>\n<p>Now, there's an important thing to note about the first wave of British rock and roll, and that is that it was, essentially, a music that had no roots in the culture. It was an imitation of American music, without any of the ties to social issues that made the American music so interesting.</p>\n<p>Britain in the 1950s was a very different place to the one it is today, or to America. It was ethnically extremely homogeneous, as the waves of immigration that have so improved the country had only just started. And while few people travelled much outside their own immediate areas, it was culturally more homogeneous as well, as Britain, unlike America, had a national media rather than a local one. In Britain, someone could become known throughout the country before they'd played their second gig, if they got the right media exposure.</p>\n<p>And so British rock and roll started out at the point that American rock and roll was only just starting to get to -- a clean-cut version of the music, with little black influence or sexuality left in it, designed from the outset to be a part of mainstream showbusiness aimed at teenagers, not music for an underclass or a racial or sexual minority.</p>\n<p>Britain's first rock and roll star put out his first record in November 1956, and by November 1957 he was appearing on the Royal Variety Show, with Mario Lanza, Bob Monkhouse, and Vera Lynn. That is, fundamentally, what early British rock and roll was. Keep that in mind for the rest of the story, as we look at how a young sailor from a dirt-poor family became Britain's first teen idol.</p>\n<p>To tell that story, we first have to discuss the career of the Vipers Skiffle Group. That was the group's full name, and they were just about the most important British group of the mid-fifties, even though they were never as commercially successful as some of the acts we've looked at.</p>\n<p>The name of the Vipers Skiffle Group was actually the first drug reference in British pop music. They took the name from the autobiography of the American jazz clarinettist Mezz Mezzrow -- a man who was better known in the jazz community as a dope dealer than as a musician; so much so that \"Mezz\" itself became slang for marijuana, while \"viper\" became the name for dope smokers, as you can hear in this recording by Stuff Smith, in which he sings that he \"dreamed about a reefer five foot long/Mighty Mezz but not too strong\".</p>\n<p>[Excerpt: Stuff Smith, \"You'se a Viper\"]</p>\n<p>So when Wally Whyton, Johnny Booker, and Jean Van Den Bosch formed a guitar trio, they chose that name, even though as it turned out none of them actually smoked dope. They just thought it sounded cool.</p>\n<p>They started performing at a cafe called the 2is (two as in the numeral, I as in the letter), and started to build up something of a reputation -- to the point that Lonnie Donegan started nicking their material. Whyton had taken an old sea shanty, \"Sail Away Ladies\", popularised by the country banjo player Uncle Dave Macon, and rewritten it substantially, turning it into \"Don't You Rock Me Daddy-O\". Donegan copyrighted Whyton's song as soon as he heard it, and rushed out his version of it, but the Vipers put out their own version too, and the two chased each other up the charts. Donegan's charted higher, but the Vipers ended up at a respectable number ten:</p>\n<p>[Excerpt: The Vipers, \"Don't You Rock Me, Daddy-O\"]</p>\n<p>That recording was on Parlophone records, and was produced by a young producer who normally did comedy and novelty records, named George Martin. We'll be hearing more about him later on.</p>\n<p>But at the time we're talking about, the Vipers had not yet gained a recording contract, and they were still playing the 2is. Occasionally, they would be joined on stage by a young acquaintance named Thomas Hicks. Hicks was a merchant seaman, and was away at sea most of the time, and so was never a full part of the group, but even though he didn't care much for skiffle -- he was a country and western fan first and foremost -- he played guitar, and in Britain in 1955 and 56, if you played guitar, you played skiffle.</p>\n<p>Hicks had come from an absolutely dirt-poor background. Three of his siblings had died at cruelly young ages, and young Thomas himself had had several brushes with ill health, which meant that while he was a voracious reader he had lacked formal education.</p>\n<p>He had wanted to be a performer from a very early age, and had developed a routine that he used to do around the pubs in his early teens, in which he would mime to a record by Danny Kaye, \"Knock on Wood\":</p>\n<p>[Excerpt: Danny Kaye, \"Knock on Wood\"]</p>\n<p>But at age fifteen he had joined the Merchant Navy. This isn't the same thing as the Royal Navy, but rather is the group of commercial shipping companies that provide non-military shipping, and Hicks worked as wait staff on a cruise ship making regular trips to America. On an early trip, he fell in love with the music of Hank Williams, who would remain a favourite of his for the rest of his life, and he particularly loved the song \"Kaw-Liga\":</p>\n<p>[Excerpt: Hank Williams, \"Kaw-Liga\"]</p>\n<p>Hicks replaced his old party piece of miming to Danny Kaye with a new one of singing \"Kaw-Liga\", with accompaniment from anyone he could persuade to play guitar for him. Eventually one of his crewmates taught him how to play the song himself, and he started performing with pick-up groups, singing Hank Williams songs, whenever he was on shore leave in the UK. And when he couldn't get a paid gig he'd head to the 2is and sing with the Vipers.</p>\n<p>But then came the event that changed his life. Young Tommy Hicks, with his love of country music, was delighted when on shore leave in 1955 to see an advert for a touring show based on the Grand Ole Opry, in Norfolk Virginia, where he happened to be. Of course he went along, and there he saw something that made a huge impression. One of the acts in the middle of the bill was a young man who wore horn-rimmed glasses. Tommy still remembers the details to this day. The young man came out and did a three-song set. The first song was a standard country song, but the second one was something else; something that hit like a bolt of lightning:</p>\n<p>[Excerpt: Buddy Holly, \"Peggy Sue\"]</p>\n<p>That song was young Thomas Hicks' introduction to the new music called rock and roll, and nothing would ever be the same for him ever again after seeing Buddy Holly sing \"Peggy Sue\". By February 1956 he had finished working on the cruise ships, and was performing rock and roll in London, the very first British rock and roller.</p>\n<p>Except...</p>\n<p>There's a reason why we're covering Tommy Steele *before* Buddy Holly, the man who he claims as his inspiration.</p>\n<p>Buddy Holly *did* perform with a Grand Ole Opry tour. But it didn't tour until May 1956, three months after Thomas Hicks quit his job on the cruise ships, and about a year after the time Tommy claims to have seen him. That tour only hit Oklahoma, which is landlocked, and didn't visit Norfolk Virginia. According to various timelines put together by people like the Buddy Holly Centre in Lubbock Texas, Holly didn't perform outside Lubbock until that tour, and that's the only time he did perform outside West Texas until 1957.</p>\n<p>Also, Buddy Holly didn't meet Peggy Sue Gerron, the woman who gave the song its name, until 1956, and the song doesn't seem to have been written until 1957.</p>\n<p>So whatever it was that introduced young Tommy Hicks to the wonders of rock and roll, it wasn't seeing Buddy Holly sing \"Peggy Sue\" in Norfolk Virginia in 1955. But that's the story that's in his autobiography, and that's the story that's in every other source I've seen on the subject, because they're all just repeating what he said, on the assumption that he'd remember something like that, something which was so important in his life and future career.</p>\n<p>Remember what I said at the beginning, about rock and roll history being like dealing with Piltdown Man? Yeah.</p>\n<p>There are a lot of inaccuracies in the life story of Thomas Hicks, who became famous under the name Tommy Steele. Anything I tell you about him is based on information he put out, and that information is not always the truth, so be warned. For example, when he started his career, he claimed he'd worked his way up on the cruise ships to being a gymnastics instructor -- something that the shipping federation denied to the press. You find a lot of that kind of thing when you dig into Steele's stories.</p>\n<p>In fact, by the time Hicks started performing, there had already been at least one British rock and roll record made. He wasn't bringing something new that he'd discovered in America at all. \"Rock Around the Clock\", the Bill Haley film, had played in UK cinemas at around the time of Hicks' supposed epiphany, and it had inspired a modern jazz drummer, Tony Crombie, to form Tony Crombie and the Rockets and record a Bill Haley soundalike called \"Teach You To Rock\":</p>\n<p>[Excerpt: Tony Crombie and the Rockets, \"Teach You To Rock\"]</p>\n<p>However, Crombie was not teen idol material -- a serious jazz drummer in his thirties, he soon went back to playing bebop, and has largely been written out of British rock history since, in favour of Tommy Steele as the first British rock and roller.</p>\n<p>Thomas Hicks the merchant seaman became Tommy Steele the pop idol as a result of a chance meeting. Hicks went to a party with a friend, and the host was a man called Lionel Bart, who was celebrating because he'd just sold his first song, to the bandleader Bill Cotton.</p>\n<p>No recording of that song seems to exist, but the lyrics to the song -- a lament about the way that old-style cafes were being replaced by upscale coffee bars -- are quoted in a biography of Bart:</p>\n<p>\"Oh for a cup of tea, instead of a cuppuchini/What would it mean to me, just one little cup so teeny!/You ask for some char and they reckon you're barmy/Ask for a banger, they'll give you salami/Oh for the liquid they served in the Army/Just a cup of tea!\"</p>\n<p>Heartrending stuff, I'm sure you'll agree. But Bart was proud of the twenty-five guineas the song had earned him, and so he was having a party.</p>\n<p>Bart was at the centre of a Bohemian crowd in Soho, and the party was held at a squat where Bart, a card-carrying member of the Communist Party, spent most of his time. At that squat at various times around this period lived, among others, the playwright John Antrobus, the actor Shirley Eaton, who would later become famous as the woman painted gold in the beginning of Goldfinger, and the great folk guitarist Davey Graham, who would later become famous for his instrumental, “Angi”:</p>\n<p>[Excerpt: Davey Graham, “Angi”]</p>\n<p>We'll hear more about Graham in future episodes.</p>\n<p>Another inhabitant of the squat was Mike Pratt, a guitarist and pianist who would later turn to acting and become famous as Jeff Randall in the fantasy detective series Randall and Hopkirk (Deceased). Hicks, Bart, and Pratt started collaborating on songs together -- Hicks would bring in a basic idea, and then Bart would write the lyrics and Pratt the music. They also performed as The Cavemen, though Bart soon tired of playing washboard and stuck to writing. The Cavemen became a floating group of musicians, centred around Hicks and Pratt, and with various Vipers and other skifflers pulled in as and when they were available.</p>\n<p>The various skiffle musicians looked down on Hicks, because of his tendency to want to play \"Heartbreak Hotel\" or \"Blue Suede Shoes\" rather than \"Bring a Little Water Sylvie\" or \"Rock Island Line\", but a gig was a gig, and they had to admit that Hicks seemed to go down well with the young women in the audience.</p>\n<p>Two minor music industry people, Bill Varley and Roy Tuvey, agreed to manage Hicks, but they decided that they needed someone involved who would be able to publicise Hicks, so they invited John Kennedy, a PR man from New Zealand, to come to the 2is to see him. Hicks wasn't actually playing the 2is the night in question – it was the Vipers, who were just on the verge of getting signed and recording their first single:</p>\n<p>[Excerpt: The Vipers Skiffle Group, “Ain't You Glad?”]</p>\n<p>While Hicks wasn't scheduled to play, at the request of Varley and Tuvey he jumped on stage when the Vipers took a break, and sang a song that he, Bart, and Pratt had written, called \"Rock With the Caveman\".</p>\n<p>Kennedy was impressed. He was impressed enough, in fact, that he brought in a friend, Larry Parnes, who would go on to become the most important manager in British rock and roll in the fifties and early sixties. Kennedy, Parnes, and Hicks cut Varley and Tuvey out altogether -- to the extent that neither of them are even mentioned in the version of this story in Tommy Steele's autobiography.</p>\n<p>Hicks was renamed Tommy Steele, in a nod to his paternal grandfather Thomas Stil-Hicks (the Stil in that name is spelled either Stil or Stijl, depending on which source you believe) and Parnes would go on to name a whole host of further rock stars in a similar manner -- Duffy Power, Johnny Gentle, Billy Fury, Marty Wilde. They had everything except a record contract, but that was why Kennedy was there.</p>\n<p>Kennedy rented a big house, and hired a load of showgirls, models, and sex workers to turn up for a party and bring their boyfriends. They were to dress nicely, talk in fake posh accents, and if anyone asked who they were they were to give fake double-barrelled names. He then called the press and said it was \"the first high society rock and roll show\" and that the girls were all debutantes. The story made the newspapers, and got Steele national attention.</p>\n<p>Steele was signed by Decca records, where Hugh Mendl, the producer of \"Rock Island Line\", was so eager to sign him that he didn't check if any studios were free for his audition, and so Britain's first homegrown rock idol auditioned for his record contract in the gents' toilets.</p>\n<p>A bunch of slumming jazz musicians, including Dave Lee, the pianist with the Dankworth band, and the legendary saxophone player Ronnie Scott, were brought in to record \"Rock With the Caveman\":</p>\n<p>[Excerpt: Tommy Steele, \"Rock With the Caveman\"]</p>\n<p>The single went to number thirteen. Tommy Steele was now a bona fide rock and roll star, at least in the UK. The next record, \"Elevator Rock\", didn't do so well, however:</p>\n<p>[Excerpt: Tommy Steele, \"Elevator Rock\"]</p>\n<p>That failed to chart, so Steele's producers went for the well-worn trick in British record making of simply copying a US hit. Guy Mitchell had just released \"Singing the Blues\":</p>\n<p>[Excerpt: Guy Mitchell, \"Singing the Blues\"]</p>\n<p>That was actually a cover version of a recording by Marty Robbins from earlier in the year, but Mitchell's version was the one that became the big hit. And Steele was brought into the studio to record a soundalike version, and hopefully get it out before Mitchell's version hit the charts.</p>\n<p>Steele's version has an identical arrangement and sound to Mitchell's, except that Steele sings it in an incredibly mannered Elvis impression:</p>\n<p>[Excerpt: Tommy Steele, \"Singing the Blues\"]</p>\n<p>Now, to twenty-first century ears, Steele's version is clearly inferior. But here was the birth of something particularly English -- and indeed something particularly London -- in rock and roll music. The overly mannered, music-hall inspired, Cockneyfied impression of an American singing style. On Steele's subsequent tour, a nine-year old kid called David Jones, who would later change his name to Bowie, went to see him and came away inspired to become a rock and roll star. And we can hear in this performance the roots of Bowie's own London take on Elvis, as we can also hear a style that would be taken up by Anthony Newley, Ray Davies, and many more masters of Cockney archness.</p>\n<p>I don't think \"Singing the Blues\" is a particularly good record compared to Mitchell's, but it is a prototype for something that would become good, and it deserves recognition for that.</p>\n<p>Mitchell's version got out first, and went to the top of the charts, with Steele's following close behind, but then for one week Mitchell's record label had a minor distribution problem, and Steele took over the top spot, before Mitchell's record returned to number one the next week.</p>\n<p>Tommy Steele had become the first British rock and roll singer to get to number one in the UK charts. It would be the only time he would do so, but it was enough. He was a bona fide teen idol.</p>\n<p>He was so big, in fact, that even his brother, Colin Hicks, became a minor rock and roll star himself off the back of his brother's success:</p>\n<p>[Excerpt: Colin Hicks and the Cabin Boys, \"Hollering and Screaming\"]</p>\n<p>The drummer on that record, Jimmy Nicol, later had his fifteen minutes of fame when Ringo Starr got tonsilitis just before a tour of Australia, and for a few shows Nicol got to be a substitute Beatle.</p>\n<p>Very soon, Tommy Steele moved on into light entertainment. First he moved into films -- starting with \"The Tommy Steele Story\", a film based on his life, for which he, Bart, and Pratt wrote all twelve of the songs in a week to meet the deadline, and then he went into stage musicals. Within a year, he had given up on rock and roll altogether.</p>\n<p>But rock and roll hadn't *quite* given up on him. While Steele was appearing in stage musicals, one was also written about him -- a hurtful parody of his life, which he claimed later he'd wanted to sue over. In Expresso Bongo, a satire of the British music industry, Steele was parodied as \"Bongo Herbert\", who rises to fame with no talent whatsoever.</p>\n<p>That stage musical was then rewritten for a film version, with the satire taken out of it, so it was a straight rags-to-riches story. It was made into a vehicle for another singer who had been a regular at the 2is, and whose backing band was made up of former members of the Vipers Skiffle Group:</p>\n<p>[Excerpt: Cliff Richard, \"Love\" (from Expresso Bongo)]</p>\n<p>We'll talk about both Cliff Richard and the Shadows in future episodes though...</p>\n<p>Tommy Steele would go on to become something of a national treasure, working on stage with Gene Kelly and on screen with Fred Astaire, writing several books, having a minor artistic career as a sculptor, and touring constantly in pantomimes and musicals. At age eighty-two he still tours every year, performing as Scrooge in a stage musical version of A Christmas Carol. His 1950s hits remain popular enough in the UK that a compilation of them went to number twenty-two in the charts in 2009.</p>\n<p>He may not leave a large body of rock and roll work, but without him, there would be no British rock and roll industry as we know it, and the rest of this history would be very different.</p>",
  "itunes:subtitle": "Welcome to episode forty-eight of A History of Rock Music in Five Hundred Songs. This one looks at Rock With the Caveman by Tommy Steele, and the birth of the British rock and roll industry. Click the full post to read liner notes, links to more informat",
  "itunes:keywords": "2is,British rock,Buddy Holly,country and western,Davey Graham,David Bowie,Decca Records,George Martin,Grand Ole Opry,Jimmy Nicol,Larry Parnes,Lionel Bart,Lonnie Donegan,skiffle,The Vipers Skiffle Group,Tommy Steele,Tony Crombie and the Rockets",
  "itunes:episodeType": "full",
  "itunes:episode": 48,
  "content:encoded": "<p>Welcome to episode forty-eight of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Rock With the Caveman\" by Tommy Steele, and the birth of the British rock and roll industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have <a href=\"https://www.patreon.com/posts/29641954\">a bonus episode available</a>. This one's on \"The Death of Rock and Roll\" by the Maddox Brothers and Rose, in which we look at a country group some say invented rock & roll, and how they reacted badly to it</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-48-rock-with-the-caveman/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p><a href=\"https://amzn.to/2lT5kKg\">This double-CD set</a> contains all Steele's rock and roll material, plus a selection of songs from the musicals he appeared in later.</p>\n<p><a href=\"https://amzn.to/2lT8tty\">This MP3 compilation,</a> meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll, including Steele's. Much of the music is not very good, but I can't imagine a better way of getting an understanding of the roots of British rock.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective.</p>\n<p><a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and covers Steele from the skiffle perspective.</p>\n<p><a href=\"https://amzn.to/2lTTS11\">Fings Ain't What They Used T'Be: The Life of Lionel Bart by David & Caroline Stafford</a> gave me a lot of information on Steel's songwriting partner.</p>\n<p><a href=\"https://amzn.to/2lvHyUA\">Steele's autobiography, Bermondsey Boy, c</a>overs his childhood and early stardom. I am not 100% convinced of its accuracy, but it's an entertaining book, and if nothing else probably gives a good idea of the mental atmosphere in the poor parts of South London in the war and immediate post-war years.</p>\n<p><a href=\"https://amzn.to/2kcZq6n\">And George Melly's Revolt Into Style</a> was one of the first books to take British pop culture seriously, and puts Steele into a wider context of British pop, both music and art.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Let's talk a little bit about the Piltdown Man.</p>\n<p>Piltdown Man was an early example of a hominid -- a missing link between the apes and humans. Its skull was discovered in 1912 in Piltdown, East Sussex, by the eminent archaeologist Charles Dawson, and for years was considered one of the most important pieces of evidence in the story of human evolution.</p>\n<p>And then, in 1953, it was discovered that the whole thing was a hoax, and not even a particularly good one. Someone had just taken the jaw of an orang-utan and the top part of a human skull, and filed down the orang-utan teeth, and then stained the bones to make them look old. It was almost certainly the work of Dawson himself, who seems to have spent his entire life making fraudulent discoveries. Dawson had died decades earlier, and the full extent of his fraud wasn't even confirmed until 2003.</p>\n<p>Sometimes researching the history of rock and roll can be a lot like that. You can find a story repeated in numerous apparently reliable books, and then find out that it's all based on the inaccurate testimony of a single individual. The story never happened. It was just something someone made up.</p>\n<p>[Excerpt: \"Rock With the Caveman\", Tommy Steele and the Steelmen]</p>\n<p>We talked a little while ago about the skiffle movement, and the first British guitar-based pop music. Today, we're going to look at the dawn of British rock and roll.</p>\n<p>Now, there's an important thing to note about the first wave of British rock and roll, and that is that it was, essentially, a music that had no roots in the culture. It was an imitation of American music, without any of the ties to social issues that made the American music so interesting.</p>\n<p>Britain in the 1950s was a very different place to the one it is today, or to America. It was ethnically extremely homogeneous, as the waves of immigration that have so improved the country had only just started. And while few people travelled much outside their own immediate areas, it was culturally more homogeneous as well, as Britain, unlike America, had a national media rather than a local one. In Britain, someone could become known throughout the country before they'd played their second gig, if they got the right media exposure.</p>\n<p>And so British rock and roll started out at the point that American rock and roll was only just starting to get to -- a clean-cut version of the music, with little black influence or sexuality left in it, designed from the outset to be a part of mainstream showbusiness aimed at teenagers, not music for an underclass or a racial or sexual minority.</p>\n<p>Britain's first rock and roll star put out his first record in November 1956, and by November 1957 he was appearing on the Royal Variety Show, with Mario Lanza, Bob Monkhouse, and Vera Lynn. That is, fundamentally, what early British rock and roll was. Keep that in mind for the rest of the story, as we look at how a young sailor from a dirt-poor family became Britain's first teen idol.</p>\n<p>To tell that story, we first have to discuss the career of the Vipers Skiffle Group. That was the group's full name, and they were just about the most important British group of the mid-fifties, even though they were never as commercially successful as some of the acts we've looked at.</p>\n<p>The name of the Vipers Skiffle Group was actually the first drug reference in British pop music. They took the name from the autobiography of the American jazz clarinettist Mezz Mezzrow -- a man who was better known in the jazz community as a dope dealer than as a musician; so much so that \"Mezz\" itself became slang for marijuana, while \"viper\" became the name for dope smokers, as you can hear in this recording by Stuff Smith, in which he sings that he \"dreamed about a reefer five foot long/Mighty Mezz but not too strong\".</p>\n<p>[Excerpt: Stuff Smith, \"You'se a Viper\"]</p>\n<p>So when Wally Whyton, Johnny Booker, and Jean Van Den Bosch formed a guitar trio, they chose that name, even though as it turned out none of them actually smoked dope. They just thought it sounded cool.</p>\n<p>They started performing at a cafe called the 2is (two as in the numeral, I as in the letter), and started to build up something of a reputation -- to the point that Lonnie Donegan started nicking their material. Whyton had taken an old sea shanty, \"Sail Away Ladies\", popularised by the country banjo player Uncle Dave Macon, and rewritten it substantially, turning it into \"Don't You Rock Me Daddy-O\". Donegan copyrighted Whyton's song as soon as he heard it, and rushed out his version of it, but the Vipers put out their own version too, and the two chased each other up the charts. Donegan's charted higher, but the Vipers ended up at a respectable number ten:</p>\n<p>[Excerpt: The Vipers, \"Don't You Rock Me, Daddy-O\"]</p>\n<p>That recording was on Parlophone records, and was produced by a young producer who normally did comedy and novelty records, named George Martin. We'll be hearing more about him later on.</p>\n<p>But at the time we're talking about, the Vipers had not yet gained a recording contract, and they were still playing the 2is. Occasionally, they would be joined on stage by a young acquaintance named Thomas Hicks. Hicks was a merchant seaman, and was away at sea most of the time, and so was never a full part of the group, but even though he didn't care much for skiffle -- he was a country and western fan first and foremost -- he played guitar, and in Britain in 1955 and 56, if you played guitar, you played skiffle.</p>\n<p>Hicks had come from an absolutely dirt-poor background. Three of his siblings had died at cruelly young ages, and young Thomas himself had had several brushes with ill health, which meant that while he was a voracious reader he had lacked formal education.</p>\n<p>He had wanted to be a performer from a very early age, and had developed a routine that he used to do around the pubs in his early teens, in which he would mime to a record by Danny Kaye, \"Knock on Wood\":</p>\n<p>[Excerpt: Danny Kaye, \"Knock on Wood\"]</p>\n<p>But at age fifteen he had joined the Merchant Navy. This isn't the same thing as the Royal Navy, but rather is the group of commercial shipping companies that provide non-military shipping, and Hicks worked as wait staff on a cruise ship making regular trips to America. On an early trip, he fell in love with the music of Hank Williams, who would remain a favourite of his for the rest of his life, and he particularly loved the song \"Kaw-Liga\":</p>\n<p>[Excerpt: Hank Williams, \"Kaw-Liga\"]</p>\n<p>Hicks replaced his old party piece of miming to Danny Kaye with a new one of singing \"Kaw-Liga\", with accompaniment from anyone he could persuade to play guitar for him. Eventually one of his crewmates taught him how to play the song himself, and he started performing with pick-up groups, singing Hank Williams songs, whenever he was on shore leave in the UK. And when he couldn't get a paid gig he'd head to the 2is and sing with the Vipers.</p>\n<p>But then came the event that changed his life. Young Tommy Hicks, with his love of country music, was delighted when on shore leave in 1955 to see an advert for a touring show based on the Grand Ole Opry, in Norfolk Virginia, where he happened to be. Of course he went along, and there he saw something that made a huge impression. One of the acts in the middle of the bill was a young man who wore horn-rimmed glasses. Tommy still remembers the details to this day. The young man came out and did a three-song set. The first song was a standard country song, but the second one was something else; something that hit like a bolt of lightning:</p>\n<p>[Excerpt: Buddy Holly, \"Peggy Sue\"]</p>\n<p>That song was young Thomas Hicks' introduction to the new music called rock and roll, and nothing would ever be the same for him ever again after seeing Buddy Holly sing \"Peggy Sue\". By February 1956 he had finished working on the cruise ships, and was performing rock and roll in London, the very first British rock and roller.</p>\n<p>Except...</p>\n<p>There's a reason why we're covering Tommy Steele *before* Buddy Holly, the man who he claims as his inspiration.</p>\n<p>Buddy Holly *did* perform with a Grand Ole Opry tour. But it didn't tour until May 1956, three months after Thomas Hicks quit his job on the cruise ships, and about a year after the time Tommy claims to have seen him. That tour only hit Oklahoma, which is landlocked, and didn't visit Norfolk Virginia. According to various timelines put together by people like the Buddy Holly Centre in Lubbock Texas, Holly didn't perform outside Lubbock until that tour, and that's the only time he did perform outside West Texas until 1957.</p>\n<p>Also, Buddy Holly didn't meet Peggy Sue Gerron, the woman who gave the song its name, until 1956, and the song doesn't seem to have been written until 1957.</p>\n<p>So whatever it was that introduced young Tommy Hicks to the wonders of rock and roll, it wasn't seeing Buddy Holly sing \"Peggy Sue\" in Norfolk Virginia in 1955. But that's the story that's in his autobiography, and that's the story that's in every other source I've seen on the subject, because they're all just repeating what he said, on the assumption that he'd remember something like that, something which was so important in his life and future career.</p>\n<p>Remember what I said at the beginning, about rock and roll history being like dealing with Piltdown Man? Yeah.</p>\n<p>There are a lot of inaccuracies in the life story of Thomas Hicks, who became famous under the name Tommy Steele. Anything I tell you about him is based on information he put out, and that information is not always the truth, so be warned. For example, when he started his career, he claimed he'd worked his way up on the cruise ships to being a gymnastics instructor -- something that the shipping federation denied to the press. You find a lot of that kind of thing when you dig into Steele's stories.</p>\n<p>In fact, by the time Hicks started performing, there had already been at least one British rock and roll record made. He wasn't bringing something new that he'd discovered in America at all. \"Rock Around the Clock\", the Bill Haley film, had played in UK cinemas at around the time of Hicks' supposed epiphany, and it had inspired a modern jazz drummer, Tony Crombie, to form Tony Crombie and the Rockets and record a Bill Haley soundalike called \"Teach You To Rock\":</p>\n<p>[Excerpt: Tony Crombie and the Rockets, \"Teach You To Rock\"]</p>\n<p>However, Crombie was not teen idol material -- a serious jazz drummer in his thirties, he soon went back to playing bebop, and has largely been written out of British rock history since, in favour of Tommy Steele as the first British rock and roller.</p>\n<p>Thomas Hicks the merchant seaman became Tommy Steele the pop idol as a result of a chance meeting. Hicks went to a party with a friend, and the host was a man called Lionel Bart, who was celebrating because he'd just sold his first song, to the bandleader Bill Cotton.</p>\n<p>No recording of that song seems to exist, but the lyrics to the song -- a lament about the way that old-style cafes were being replaced by upscale coffee bars -- are quoted in a biography of Bart:</p>\n<p>\"Oh for a cup of tea, instead of a cuppuchini/What would it mean to me, just one little cup so teeny!/You ask for some char and they reckon you're barmy/Ask for a banger, they'll give you salami/Oh for the liquid they served in the Army/Just a cup of tea!\"</p>\n<p>Heartrending stuff, I'm sure you'll agree. But Bart was proud of the twenty-five guineas the song had earned him, and so he was having a party.</p>\n<p>Bart was at the centre of a Bohemian crowd in Soho, and the party was held at a squat where Bart, a card-carrying member of the Communist Party, spent most of his time. At that squat at various times around this period lived, among others, the playwright John Antrobus, the actor Shirley Eaton, who would later become famous as the woman painted gold in the beginning of Goldfinger, and the great folk guitarist Davey Graham, who would later become famous for his instrumental, “Angi”:</p>\n<p>[Excerpt: Davey Graham, “Angi”]</p>\n<p>We'll hear more about Graham in future episodes.</p>\n<p>Another inhabitant of the squat was Mike Pratt, a guitarist and pianist who would later turn to acting and become famous as Jeff Randall in the fantasy detective series Randall and Hopkirk (Deceased). Hicks, Bart, and Pratt started collaborating on songs together -- Hicks would bring in a basic idea, and then Bart would write the lyrics and Pratt the music. They also performed as The Cavemen, though Bart soon tired of playing washboard and stuck to writing. The Cavemen became a floating group of musicians, centred around Hicks and Pratt, and with various Vipers and other skifflers pulled in as and when they were available.</p>\n<p>The various skiffle musicians looked down on Hicks, because of his tendency to want to play \"Heartbreak Hotel\" or \"Blue Suede Shoes\" rather than \"Bring a Little Water Sylvie\" or \"Rock Island Line\", but a gig was a gig, and they had to admit that Hicks seemed to go down well with the young women in the audience.</p>\n<p>Two minor music industry people, Bill Varley and Roy Tuvey, agreed to manage Hicks, but they decided that they needed someone involved who would be able to publicise Hicks, so they invited John Kennedy, a PR man from New Zealand, to come to the 2is to see him. Hicks wasn't actually playing the 2is the night in question – it was the Vipers, who were just on the verge of getting signed and recording their first single:</p>\n<p>[Excerpt: The Vipers Skiffle Group, “Ain't You Glad?”]</p>\n<p>While Hicks wasn't scheduled to play, at the request of Varley and Tuvey he jumped on stage when the Vipers took a break, and sang a song that he, Bart, and Pratt had written, called \"Rock With the Caveman\".</p>\n<p>Kennedy was impressed. He was impressed enough, in fact, that he brought in a friend, Larry Parnes, who would go on to become the most important manager in British rock and roll in the fifties and early sixties. Kennedy, Parnes, and Hicks cut Varley and Tuvey out altogether -- to the extent that neither of them are even mentioned in the version of this story in Tommy Steele's autobiography.</p>\n<p>Hicks was renamed Tommy Steele, in a nod to his paternal grandfather Thomas Stil-Hicks (the Stil in that name is spelled either Stil or Stijl, depending on which source you believe) and Parnes would go on to name a whole host of further rock stars in a similar manner -- Duffy Power, Johnny Gentle, Billy Fury, Marty Wilde. They had everything except a record contract, but that was why Kennedy was there.</p>\n<p>Kennedy rented a big house, and hired a load of showgirls, models, and sex workers to turn up for a party and bring their boyfriends. They were to dress nicely, talk in fake posh accents, and if anyone asked who they were they were to give fake double-barrelled names. He then called the press and said it was \"the first high society rock and roll show\" and that the girls were all debutantes. The story made the newspapers, and got Steele national attention.</p>\n<p>Steele was signed by Decca records, where Hugh Mendl, the producer of \"Rock Island Line\", was so eager to sign him that he didn't check if any studios were free for his audition, and so Britain's first homegrown rock idol auditioned for his record contract in the gents' toilets.</p>\n<p>A bunch of slumming jazz musicians, including Dave Lee, the pianist with the Dankworth band, and the legendary saxophone player Ronnie Scott, were brought in to record \"Rock With the Caveman\":</p>\n<p>[Excerpt: Tommy Steele, \"Rock With the Caveman\"]</p>\n<p>The single went to number thirteen. Tommy Steele was now a bona fide rock and roll star, at least in the UK. The next record, \"Elevator Rock\", didn't do so well, however:</p>\n<p>[Excerpt: Tommy Steele, \"Elevator Rock\"]</p>\n<p>That failed to chart, so Steele's producers went for the well-worn trick in British record making of simply copying a US hit. Guy Mitchell had just released \"Singing the Blues\":</p>\n<p>[Excerpt: Guy Mitchell, \"Singing the Blues\"]</p>\n<p>That was actually a cover version of a recording by Marty Robbins from earlier in the year, but Mitchell's version was the one that became the big hit. And Steele was brought into the studio to record a soundalike version, and hopefully get it out before Mitchell's version hit the charts.</p>\n<p>Steele's version has an identical arrangement and sound to Mitchell's, except that Steele sings it in an incredibly mannered Elvis impression:</p>\n<p>[Excerpt: Tommy Steele, \"Singing the Blues\"]</p>\n<p>Now, to twenty-first century ears, Steele's version is clearly inferior. But here was the birth of something particularly English -- and indeed something particularly London -- in rock and roll music. The overly mannered, music-hall inspired, Cockneyfied impression of an American singing style. On Steele's subsequent tour, a nine-year old kid called David Jones, who would later change his name to Bowie, went to see him and came away inspired to become a rock and roll star. And we can hear in this performance the roots of Bowie's own London take on Elvis, as we can also hear a style that would be taken up by Anthony Newley, Ray Davies, and many more masters of Cockney archness.</p>\n<p>I don't think \"Singing the Blues\" is a particularly good record compared to Mitchell's, but it is a prototype for something that would become good, and it deserves recognition for that.</p>\n<p>Mitchell's version got out first, and went to the top of the charts, with Steele's following close behind, but then for one week Mitchell's record label had a minor distribution problem, and Steele took over the top spot, before Mitchell's record returned to number one the next week.</p>\n<p>Tommy Steele had become the first British rock and roll singer to get to number one in the UK charts. It would be the only time he would do so, but it was enough. He was a bona fide teen idol.</p>\n<p>He was so big, in fact, that even his brother, Colin Hicks, became a minor rock and roll star himself off the back of his brother's success:</p>\n<p>[Excerpt: Colin Hicks and the Cabin Boys, \"Hollering and Screaming\"]</p>\n<p>The drummer on that record, Jimmy Nicol, later had his fifteen minutes of fame when Ringo Starr got tonsilitis just before a tour of Australia, and for a few shows Nicol got to be a substitute Beatle.</p>\n<p>Very soon, Tommy Steele moved on into light entertainment. First he moved into films -- starting with \"The Tommy Steele Story\", a film based on his life, for which he, Bart, and Pratt wrote all twelve of the songs in a week to meet the deadline, and then he went into stage musicals. Within a year, he had given up on rock and roll altogether.</p>\n<p>But rock and roll hadn't *quite* given up on him. While Steele was appearing in stage musicals, one was also written about him -- a hurtful parody of his life, which he claimed later he'd wanted to sue over. In Expresso Bongo, a satire of the British music industry, Steele was parodied as \"Bongo Herbert\", who rises to fame with no talent whatsoever.</p>\n<p>That stage musical was then rewritten for a film version, with the satire taken out of it, so it was a straight rags-to-riches story. It was made into a vehicle for another singer who had been a regular at the 2is, and whose backing band was made up of former members of the Vipers Skiffle Group:</p>\n<p>[Excerpt: Cliff Richard, \"Love\" (from Expresso Bongo)]</p>\n<p>We'll talk about both Cliff Richard and the Shadows in future episodes though...</p>\n<p>Tommy Steele would go on to become something of a national treasure, working on stage with Gene Kelly and on screen with Fred Astaire, writing several books, having a minor artistic career as a sculptor, and touring constantly in pantomimes and musicals. At age eighty-two he still tours every year, performing as Scrooge in a stage musical version of A Christmas Carol. His 1950s hits remain popular enough in the UK that a compilation of them went to number twenty-two in the charts in 2009.</p>\n<p>He may not leave a large body of rock and roll work, but without him, there would be no British rock and roll industry as we know it, and the rest of this history would be very different.</p>",
  "enclosure": "",
  "itunes:summary": "Welcome to episode forty-eight of A History of Rock Music in Five Hundred Songs. This one looks at \"Rock With the Caveman\" by Tommy Steele, and the birth of the British rock and roll industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a bonus episode available. This one's on \"The Death of Rock and Roll\" by the Maddox Brothers and Rose, in which we look at a country group some say invented rock & roll, and how they reacted badly to it\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nThis double-CD set contains all Steele's rock and roll material, plus a selection of songs from the musicals he appeared in later.\nThis MP3 compilation, meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll, including Steele's. Much of the music is not very good, but I can't imagine a better way of getting an understanding of the roots of British rock.\nPete Frame's The Restless Generation is the best book available looking at British 50s rock and roll from a historical perspective.\nBilly Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World is one of the best books I've read on music at all, and covers Steele from the skiffle perspective.\nFings Ain't What They Used T'Be: The Life of Lionel Bart by David & Caroline Stafford gave me a lot of information on Steel's songwriting partner.\nSteele's autobiography, Bermondsey Boy, covers his childhood and early stardom. I am not 100% convinced of its accuracy, but it's an entertaining book, and if nothing else probably gives a good idea of the mental atmosphere in the poor parts of South London in the war and immediate post-war years.\nAnd George Melly's Revolt Into Style was one of the first books to take British pop culture seriously, and puts Steele into a wider context of British pop, both music and art.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nLet's talk a little bit about the Piltdown Man.\nPiltdown Man was an early example of a hominid -- a missing link between the apes and humans. Its skull was discovered in 1912 in Piltdown, East Sussex, by the eminent archaeologist Charles Dawson, and for years was considered one of the most important pieces of evidence in the story of human evolution.\nAnd then, in 1953, it was discovered that the whole thing was a hoax, and not even a particularly good one. Someone had just taken the jaw of an orang-utan and the top part of a human skull, and filed down the orang-utan teeth, and then stained the bones to make them look old. It was almost certainly the work of Dawson himself, who seems to have spent his entire life making fraudulent discoveries. Dawson had died decades earlier, and the full extent of his fraud wasn't even confirmed until 2003.\nSometimes researching the history of rock and roll can be a lot like that. You can find a story repeated in numerous apparently reliable books, and then find out that it's all based on the inaccurate testimony of a single individual. The story never happened. It was just something someone made up.\n[Excerpt: \"Rock With the Caveman\", Tommy Steele and the Steelmen]\nWe talked a little while ago about the skiffle movement, and the first British guitar-based pop music. Today, we're going to look at the dawn of British rock and roll.\nNow, there's an important thing to note about the first wave of British rock and roll, and that is that it was, essentially, a music that had no roots in the culture. It was an imitation of American music, without any of the ties to social issues that made the American music so interesting.\nBritain in the 1950s was a very different place to the one it is today, or to America. It was ethnically extremely homogeneous, as the waves of immigration that have so improved the country had only just started. And while few people",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode forty-eight of A History of Rock Music in Five Hundred Songs. This one looks at \"Rock With the Caveman\" by Tommy Steele, and the birth of the British rock and roll industry. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a bonus episode available. This one's on \"The Death of Rock and Roll\" by the Maddox Brothers and Rose, in which we look at a country group some say invented rock & roll, and how they reacted badly to it\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nThis double-CD set contains all Steele's rock and roll material, plus a selection of songs from the musicals he appeared in later.\nThis MP3 compilation, meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll, including Steele's. Much of the music is not very good, but I can't imagine a better way of getting an u",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}