{
  "title": "Why I&#8217;m Appreciating FI More Than Ever Now",
  "link": "https://www.madfientist.com/mad-fientist-jr/",
  "comments": "https://www.madfientist.com/mad-fientist-jr/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Fri, 02 Sep 2022 10:02:25 +0000",
  "category": "FIRE (Financial Independence / Retire Early)",
  "guid": "https://www.madfientist.com/?p=7478",
  "description": "<p class=\"lead\">Thanks to a huge life event, I'm appreciating the benefits of financial independence and early retirement more than ever!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/mad-fientist-jr/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/mad-fientist-jr/\">Why I&#8217;m Appreciating FI More Than Ever Now</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "<p>I didn&#8217;t think I&#8217;d ever want kids.</p>\n<p>There was so much I wanted to do/see during my life and I felt like having kids would get in the way.</p>\n<p>Two things changed when I got to my late 30s though.</p>\n<p>First, my wife&#8217;s sisters started having kids and I got to see how fun/crazy they are.</p>\n<p>Second, I started accomplishing a lot of the things I had wanted to do&#8230;</p>\n<ul>\n<li>I went back to school and <a href=\"https://www.madfientist.com/free-ivy-league-degree/\" rel=\"noopener\" target=\"_blank\">got a graduate degree</a></li>\n<li>We got to travel the world and <a href=\"https://www.madfientist.com/early-retirement-preview/\" rel=\"noopener\" target=\"_blank\">visit 50+ countries</a></li>\n<li>I <a href=\"https://www.madfientist.com/start-a-business/\" rel=\"noopener\" target=\"_blank\">built a successful business</a></li>\n<li>I <a href=\"https://www.madfientist.com/time-has-finally-come/\" rel=\"noopener\" target=\"_blank\">achieved financial independence</a> and was able to stop working</li>\n<li>I finally fulfilled my childhood dream of <a href=\"https://www.madfientist.com/ultralearning-experiment-results/\" rel=\"noopener\" target=\"_blank\">writing and releasing an album</a></li>\n</ul>\n<p>I don&#8217;t think I would have been able to achieve a lot of those things without the 5+ years of complete freedom that FI provided.  So thanks to FI and my neices/nephews, I finally came around to the idea of having kids.</p>\n<p>But the prospect of being a parent is scary (especially to someone like me who is a big planner and a bit of control freak).</p>\n<p>Thankfully, FI helped quell some of those concerns as well&#8230;</p>\n<ul>\n<li>Thoughts of sleepless nights were less worrying knowing that we didn&#8217;t have to wake up to go to work</li>\n<li>Caring for a new person is less intimidating knowing there&#8217;s enough savings in the bank to handle any unplanned expenses</li>\n<li>Parenting with both parents at home is a lot less scary than imagining doing it solo while one person&#8217;s off working</li>\n</ul>\n<p>So not only did FI allow me to get into a state where I actually wanted to have kids, it also made the prospect of kids a lot less intimidating.</p>\n<p>Anyway, enough beating around the bush&#8230;</p>\n<p>I&#8217;m ridiculously pleased to tell you that there is now a Mad Fientist Jr. :)</p>\n<p>He arrived on July 14th and Jill and I are both over the moon!</p>\n<h2>A Brand New Appreciation for FI</h2>\n<p>I wanted to write this post because I feel like lately, I&#8217;ve been mainly focused on the downsides of FI whenever I talk about it.</p>\n<p>Since the FIRE world exploded in 2018, most FI content feels like this -> &#8220;FI IS THE BEST THING EVER AND IT WILL SOLVE ALL YOUR PROBLEMS AND WILL INSTANTLY MAKE YOU HAPPY!!&#8221;</p>\n<p>That&#8217;s obviously not the case but it&#8217;s unsurpising most of the online content seems to suggest that.  Here&#8217;s why&#8230;</p>\n<p>When a new blog/podcast starts or when a newspaper is trying to get as much traffic as possible, which do you think will get the most clicks:</p>\n<ul>\n<li>The 10 Ways FI Improved my Life and How It Can Change Yours!</li>\n<li>Money is Not the Reason You&#8217;re Not Pursuing Your Dreams :/</li>\n</ul>\n<p>Obviously the first heading would, so that&#8217;s why most FI content tends to focus on the positives.</p>\n<p>But since I&#8217;ve been doing this for over a decade and don&#8217;t need to get more readers/listeners/clicks, I feel it&#8217;s my duty to share the full story.  And since the positives are so well covered by other sites, I tend to dwell on the negative aspects whenever I&#8217;m interviewed, so that you get a more-balanced picture.</p>\n<p>I wanted to write this post though because since having our son, I don&#8217;t think I&#8217;ve ever appreciated what FI provides more than I do now.</p>\n<p>Jill and I can focus fully on our new addition and we can watch him grow without any distractions.  My mom and stepdad came to visit for 18 days and we got to enjoy time with them and didn&#8217;t have to share our attention with work.  We can nap in the middle of the day and stay up all night if we need to.</p>\n<p>I can honestly say I haven&#8217;t felt this level of contentment, happiness, and gratitude since I left my job in 2016, and I&#8217;m so happy we worked hard and made the sacrifices we did to get to this position.</p>\n<h2>Fully Realizing the Benefits</h2>\n<p>Over the last two years, I feel like I&#8217;m entering a new stage of life where I am finally reaping the benefits of my past investments (rather than just accumulating more investments).</p>\n<p>I&#8217;m learning how to enjoy spending money (more on this soon) and man, is it fun :)</p>\n<p>As we celebrate 20 years of being together in December, investing in my relationship with Jill has yielded a beautiful son and a partnership that&#8217;s never been as strong and loving as it is now.</p>\n<p>My focus on health and nutrition over the past decade means that even though I&#8217;m an older dad, I&#8217;ll hopefully feel just as young as the other dads that I&#8217;ll be interacting with soon.</p>\n<p>And achieving FI has helped me get mentally and financially prepared to have the cutest little kid I could imagine.</p>\n<h2>Your Investments Will Be Worth It</h2>\n<p>Apologies for all this self-reflection today but I wanted you to know that your hard work and sacrifices will likely pay off in a bigger way than you ever even imagined (because that&#8217;s how I feel now).</p>\n<p>Your investments will only be worth it if you actually start cashing them in though so that&#8217;s what my future posts/podcasts will be focusing on.  </p>\n<p>Since my publishing schedule will be even more sporadic now that we have a newborn, <a href=\"https://pages.madfientist.com/podcast-advice\" rel=\"noopener\" target=\"_blank\">click here</a> to join the 100,000+ others on the email list and get updated when new posts get published.</p>\n<h2>6+ Years of FI</h2>\n<p>My FI anniversary (Aug 1st) came and went without me even noticing this year.</p>\n<p>I can say that this is the best that post-FI life has been though so I&#8217;m even more excited for the future.  </p>\n<p>I didn&#8217;t know this is where I wanted to be but now that I&#8217;m here, I can&#8217;t imagine being anywhere else.  And I&#8217;m thankful that FI helped me get here.</p>\n<p><em>P.S. Big thanks to Paul H. for the amazing Mad Fientist baby onesie!  I promise he likes it a lot more than the picture indicates :)</em></p>\n<p><em>P.P.S. I released a short podcast episode about this so <a href=\"https://open.spotify.com/episode/0iKNxbI8u9qy3pjnifuTw9?si=5ca52a65ad244ec3\">click here</a> to check it out!</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/mad-fientist-jr/\">Why I&#8217;m Appreciating FI More Than Ever Now</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/mad-fientist-jr/feed/",
  "slash:comments": 120
}