{
  "id": "yt:video:AiLiCWXExOA",
  "yt:videoId": "AiLiCWXExOA",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Judson Brewer | Unwinding Anxiety | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-07T16:00:14+00:00",
  "updated": "2022-11-04T07:16:34+00:00",
  "media:group": {
    "media:title": "Judson Brewer | Unwinding Anxiety | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Judson Brewer discusses his book \"Unwinding Anxiety: New Science Shows How to Break the Cycles of Worry and Fear to Heal Your Mind,\" which shows us a step-by-step plan that is clinically proven to break the cycles that drive anxiety and addictive habits. We are living through one of the most anxious periods any of us can remember. Whether facing issues as public as a pandemic or as personal as having kids at home and fighting the urge to reach for the wine bottle every night, many of us are feeling overwhelmed and out of control. In this timely book, Dr. Brewer explains how to uproot anxiety at its source using brain-based techniques and small hacks accessible to anyone.\n\nWe think of anxiety as everything from mild unease to full-blown panic. But it's also what drives the addictive behaviors and bad habits we use to cope (e.g. stress eating, procrastination, doom scrolling and social media). Anxiety lives in a part of the brain that resists rational thought, so we get stuck in anxiety habit loops that we can't think our way out of or use willpower to overcome. Dr. Brewer teaches us to map our brains to discover our triggers, defuse them with the simple but powerful practice of curiosity, and to train our brains using mindfulness and other practices that his lab has proven can work.\n\nGet the book here: https://goo.gle/3RmH3WD.\n\nJud Brewer MD PhD (“Dr. Jud”) is a New York Times best-selling author and thought leader in the field of habit change and the “science of self-mastery,” having combined over 25 years of experience with mindfulness training with his scientific research. He is the Director of Research and Innovation at the Mindfulness Center and associate professor in Behavioral and Social Sciences and Psychiatry at the Schools of Public Health & Medicine at Brown University. He is also the executive medical director of behavioral health at Sharecare Inc. A psychiatrist and internationally known expert in mindfulness training for addictions, Dr. Brewer has developed and tested novel mindfulness programs for habit change, including both in-person and app-based treatments for smoking, emotional eating, and anxiety. \n\nJud Brewer MD PhD (“Dr. Jud”) is a New York Times best-selling author and thought leader in the field of habit change and the “science of self-mastery,” having combined over 25 years of experience with mindfulness training with his scientific research. He is the Director of Research and Innovation at the Mindfulness Center and associate professor in Behavioral and Social Sciences and Psychiatry at the Schools of Public Health & Medicine at Brown University. He is also Chief Medical Officer at Sharecare. A psychiatrist and internationally known expert in mindfulness training for addictions, Dr. Brewer has developed and tested novel mindfulness programs for habit change, including both in-person and app-based treatments for smoking, emotional eating, and anxiety.\n\nModerated by Kristin Maczko.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}