{
  "title": "A quick summary of CVPR 2015",
  "link": "",
  "published": "2015-06-11T22:00:00+01:00",
  "updated": "2015-06-11T22:00:00+01:00",
  "author": {
    "name": "Sebastian Nowozin"
  },
  "id": "tag:www.nowozin.net,2015-06-11:/sebastian/blog/a-quick-summary-of-cvpr-2015.html",
  "summary": "<p><a href=\"http://www.pamitc.org/cvpr15/\">CVPR 2015</a>, \"Computer Vision and Pattern\nRecognition\" is the main conference of the computer vision community and just\nfinished.\nI unfortunately was only able to stay for the three main conference days, but\nhere is my short subjective summary.</p>\n<p>For …</p>",
  "content": "<p><a href=\"http://www.pamitc.org/cvpr15/\">CVPR 2015</a>, \"Computer Vision and Pattern\nRecognition\" is the main conference of the computer vision community and just\nfinished.\nI unfortunately was only able to stay for the three main conference days, but\nhere is my short subjective summary.</p>\n<p>For an overview of individual research papers, see <a href=\"http://cs.stanford.edu/people/karpathy/cvpr2015papers/\">this excellent summary\npage</a> by <a href=\"http://cs.stanford.edu/people/karpathy/\">Andrej\nKarpathy</a>.</p>\n<p>From the papers I have seen at the conference my personal favorite is Barron\net al., \"Fast Bilateral-Space Stereo for Synthetic Defocus\",\n<a href=\"http://www.cv-foundation.org/openaccess/content_cvpr_2015/papers/Barron_Fast_Bilateral-Space_Stereo_2015_CVPR_paper.pdf\">PDF here</a>.\nI liked it for a number of reasons.  First, this research is already\nsuccessfully productized in a high-profile product and the presentation of the\nwork was excellent.  Second, the flavour of this work is to take a data\nstructure (the permutohedral lattice) which has been used for one problem\nsuccessfully (bilateral filtering), and use it to solve a more difficult\nproblem (disparity from stereo) within the domain of the data structure.  This\ngeneral idea may be useful in other contexts.  To admit the truth, I never\nliked pixels as a representation of image data, and many statistical models\nare just awkward to specify on the pixel level; for this reason we as a\ncommunity often use higher representations such as superpixels or region\nproposals.  This paper provides an alternative method on how a regular\nrepresentation that is more aligned with the semantic content of the image\ncould be used to solve problems in such a way that one can reconstruct a\nsolution on the pixel level.</p>\n<h2>Research Trends</h2>\n<ul>\n<li><strong>Deep Learning and Convolutional Neural Networks</strong>.  Since the seminal ECCV\n  2012 workshop presentation by <a href=\"http://www.cs.toronto.edu/~kriz/\">Alex\n  Krizhevsky</a> that announced the ImageNet\n  results and was <a href=\"http://books.nips.cc/papers/files/nips25/NIPS2012_0534.pdf\">published as a NIPS paper the same\n  year</a> the\n  computer vision community has rapidly adopted convolutional networks and\n  some of the largest vision labs developed toolkits that democratized this\n  technology, such as <a href=\"http://caffe.berkeleyvision.org/\">Caffe</a>, and existing\n  toolkits such as <a href=\"http://torch.ch/\">Torch</a>, and\n  <a href=\"http://deeplearning.net/software/theano/\">Theano</a> are also used.\n  In effect, I estimate that around 30 percent of all papers used\n  convolutional networks or features derived from them in their work, often\n  substantially increasing predictive performance on the given task.\n  Significant research directions remain open to everyone, but it is fair to\n  say that standard convnets are now a mature vision technology regularly used\n  by large parts of the community.</li>\n<li><strong>Rich Linguistic Outputs</strong>.  Automatic image captioning is now feasible.\n  There is an <a href=\"https://pdollar.wordpress.com/2015/01/21/image-captioning/\">excellent\n  summary</a> of the\n  may works at <a href=\"https://pdollar.wordpress.com\">Piotr Dollar's blog</a> and also\n  in another <a href=\"http://blogs.technet.com/b/machinelearning/archive/2014/11/18/rapid-progress-in-automatic-image-captioning.aspx\">summary by John\n  Platt</a>.\n  Many of these works are enabled by the recent\n  <a href=\"http://mscoco.org/\">Microsoft COCO dataset</a> and by <a href=\"http://karpathy.github.io/2015/05/21/rnn-effectiveness/\">recurrent neural\n  networks</a>.</li>\n</ul>\n<h2>Non-Research Trends and the IEEE Controversy</h2>\n<ul>\n<li><strong>Growth in attendance</strong>.  Attendance was at more than 2,400 persons,\n  continuing the rapid growth of the computer vision community.</li>\n<li><strong>More code published</strong>.  On almost every second poster there was a\n  <a href=\"http://github.com/\">github</a> URL and the licenses are generally very liberal\n  (MIT, BSD, etc.) so as to permit wide distribution; this is great as it\n  further accelerates the speed at which efforts can be redirected towards\n  promising approaches.</li>\n<li><strong>IEEE splits from CVPR</strong>.  The conference has always been organized in part\n  by <a href=\"http://www.ieee.org/\">IEEE</a> in various capacities as an insurer,\n  organizer, and publisher.  However, with traditional publishing models being\n  obsoleted, and with examples of independent conferences and journals in the\n  machine learning community (<a href=\"http://nips.cc/\">NIPS</a>,\n  <a href=\"http://icml.cc/\">ICML</a>, and <a href=\"http://jmlr.org/\">JMLR</a>), and considering that\n  CVPR as one of the premier conferences in all of computer science, the power\n  balance has shifted away from IEEE towards the computer vision community; as\n  a result, over the last few years the ties with IEEE have been weakened and\n  now seem to be lost.  To be fair, following CVPR 2011, IEEE has moved and\n  negotiated a fairer deal, with CVPR papers made available\n  <a href=\"http://www.cv-foundation.org/openaccess/\">open-access</a> since\n  CVPR 2013, and allowing co-sponsoring arrangements with the\n  <a href=\"http://www.cv-foundation.org/\">Computer Vision Foundation</a>.\n  But now, after threats made by IEEE, it has been voted at the PAMI-TC\n  meeting that future CVPR conferences (starting with CVPR 2016) that the\n  computer vision foundation will take over the functions previously carried\n  out by the IEEE.  More details will be announced shortly, I am sure.\n  Whether this has any repercussions for the\n  <a href=\"http://www.computer.org/web/tpami\">TPAMI journal</a> is unclear at the current\n  point, but before making threats and actions that would serve as a catalyst\n  for community action, IEEE would be wise to consider what has happened to Springer's\n  <em>Machine Learning</em> journal in 2001 and the events that led to the founding\n  of the <a href=\"http://en.wikipedia.org/wiki/Journal_of_Machine_Learning_Research\"><em>Journal of Machine Learning\n  Research</em></a>,\n  a <a href=\"http://blogs.law.harvard.edu/pamphlet/2012/03/06/an-efficient-journal/\">very successful\n  experiment</a>.</li>\n</ul>",
  "category": ""
}