{
  "title": "S16 Ep29: Holzer's Ghosts - Don't Send Them to Heaven: The Haunting of The Bell House",
  "link": "https://audioboom.com/posts/8098382",
  "itunes:episode": 29,
  "itunes:title": "Holzer's Ghosts - Don't Send Them to Heaven: The Haunting of The Bell House",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 4577,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts - Don't Send Them to Heaven: The Haunting of The Bell House with guest Aaron Sagers</p>\n\n<p>Paranormal Pop Culture maverick, Aaron Sagers joins Dave Schrader of #HolzerFiles to discuss the most recent episode, Don't Send Them to Heaven the Haunting of the Bell House.</p>\n\n<p>When legendary ghost hunter Hans Holzer first approached the unassuming farmhouse in Waterford, Maine, in 1968, he was in awe of the pastoral beauty of the home's dense seclusion. However, once inside, he soon found that the supernatural allure of the home may have a more malevolent source.</p>\n\n<p>Within an hour's time, he grew concerned for his psychic medium's safety and withdrew her from the home, fearing the terrifying presence was attempting to possess her, as it had done to the previous homeowner before her untimely death only years before. Hans fled the from the home and pled with the homeowner to reconsider living in what Holzer believed to be a soul trap for any that reside there.</p>\n\n<p>He left that day and refused to return for the rest of his long career.<br>\nNow, more than half a century after Hans Holzer first fled from the horrors of the Waterford home, his hidden case file is reopened, as paranormal investigator Dave Schrader, psychic medium Cindy Kaza, equipment expert Shane Pittman along with new insights from researcher Gabe Roth and Holzer's own daughter, Alexandra return to the unassuming Maine farmhouse to research the paranormal encounters of the current homeowner.</p>\n\n<p>Together they reveal the hidden secrets of the historic home, and soon find that the spirits that Holzer believed would not leave, perhaps cannot leave, and the living may be the next targets for the possessive property's powerful presence. All this PLUS a look at next weeks episode, Dead Calm: The Haunting of The Queen Mary.</p>\n\n<p>Visit Aaron's site here: <a href=\"http://www.paranormalpopculture.com/\">www.ParanormalPopCulture.com</a></p>\n\n<p>Watch New Episodes of Holzer Files every Saturday only on Discovery+</p>\n",
  "itunes:summary": "Darkness Radio presents Holzer's Ghosts - Don't Send Them to Heaven: The Haunting of The Bell House with guest Aaron Sagers\n\nParanormal Pop Culture maverick, Aaron Sagers joins Dave Schrader of #HolzerFiles to discuss the most recent episode, Don't Send Them to Heaven the Haunting of the Bell House.\n\nWhen legendary ghost hunter Hans Holzer first approached the unassuming farmhouse in Waterford, Maine, in 1968, he was in awe of the pastoral beauty of the home's dense seclusion. However, once inside, he soon found that the supernatural allure of the home may have a more malevolent source.\n\nWithin an hour's time, he grew concerned for his psychic medium's safety and withdrew her from the home, fearing the terrifying presence was attempting to possess her, as it had done to the previous homeowner before her untimely death only years before. Hans fled the from the home and pled with the homeowner to reconsider living in what Holzer believed to be a soul trap for any that reside there.\n\nH...",
  "pubDate": "Fri, 12 Mar 2021 09:00:00 +0000",
  "guid": "af865414-fbf7-42d8-9ca2-ace90073b447",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}