{
  "itunes:episode": 60,
  "title": "Backerkit to the Future with Maxwell Salzberg",
  "pubDate": "Thu, 30 Jan 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/1/30/backerkit-to-the-future-with-maxwell-salzberg-episode-60",
  "description": "<p>Maxwell Salzberg of <a href=\"https://backerkit.com/\">BackerKit</a> knows what it's like to have a lot of people giving him money who want something in return: he and three colleagues credited <a href=\"http://www.kickstarter.com/projects/mbs348/diaspora-the-personally-controlled-do-it-all-distr\">the Diaspora project</a>, one of Kickstarter's early blockbusters. He co-founded BackerKit with Rosanna Yau to help people with the problem of managing crowdfunding backers' responses and expectations.</p>\n\n<p>This episode is sponsored by <a href=\"http://mediatemple.net/?utm_source=thenewdisruptors&utm_medium=banner&utm_content=jan_podcast&utm_campaign=general\">Media Temple</a>: Web hosting for artists, designers, and Web developers since 1998. Media Temple hosts beautiful websites and great ideas. <a href=\"http://mediatemple.net/?utm_source=thenewdisruptors&utm_medium=banner&utm_content=jan_podcast&utm_campaign=general\">Sign up</a> with coupon code \"tnd\" to get 25% off your first month of hosting.</p>\n\n<p>We're also sponsored by <a href=\"https://bornsql.ca/nd/\">Born SQL</a>, who can help small- and medium-sized businesses who use Microsoft SQL Server without a dedicated database administrator. New Disruptors' listeners can <a href=\"https://bornsql.ca/nd/\">get a Cdn$750 discount</a> on Born SQL's analysis report, which examines your instances and provides extensive, implementable recommendations about making improvements.</p>\n",
  "guid": "tag:soundcloud,2010:tracks/132112613",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:11:11",
  "itunes:subtitle": "Maxwell Salzberg of Backerkit knows what it's like to have a lot of people giving him money who want something in return: he and three colleagues credited the Diaspora project, one of Kickstarter's early blockbusters.",
  "itunes:summary": "Maxwell Salzberg of Backerkit knows what it's like to have a lot of people giving him money who want something in return: he and three colleagues credited the Diaspora project, one of Kickstarter's early blockbusters. He co-founded BackerKit with Rosanna Yau to help people with the problem of managing crowdfunding backers' responses and expectations.\n\nThis episode is sponsored by Media Temple: Web hosting for artists, designers, and Web developers since 1998. Media Temple hosts beautiful websites and great ideas. Sign up with coupon code \"tnd\" to get 25% off your first month of hosting. http://bit.ly/1d3kEq8\n\nWe're also sponsored by Born SQL, who can help small- and medium-sized businesses who use Microsoft SQL Server without a dedicated database administrator. New Disruptors' listeners can get a Cdn$750 discount on Born SQL's analysis report, which examines your instances and provides extensive, implementable recommendations about making improvements. https://bornsql.ca/nd/"
}