{
  "title": "Design of a Modified Coupled Resonators Optical Waveguide Supporting a Frozen Mode. (arXiv:2211.01408v1 [physics.optics])",
  "link": "http://arxiv.org/abs/2211.01408",
  "description": "<p>We design a three-way silicon optical waveguide with the Bloch dispersion\nrelation supporting a stationary inflection point (SIP). The SIP is a third\norder exceptional point of degeneracy (EPD) where three Bloch modes coalesce\nforming the frozen mode with greatly enhanced amplitude. The proposed design\nconsists of a coupled resonators optical waveguide (CROW) coupled to a parallel\nstraight waveguide. At any given frequency, this structure supports three pairs\nof reciprocal Bloch eigenmodes, propagating and/or evanescent. In addition to\nfull-wave simulations, we also employ a so-called ''hybrid model'' that uses\ntransfer matrices obtained from full-wave simulations of sub-blocks of the unit\ncell. This allows us to account for radiation losses and enables a design\nprocedure based on minimizing the eigenmodes' coalescence parameter. The\nproposed finite-length CROW displays almost unitary transfer function at the\nSIP frequency, implying a nearly perfect conversion of the input light into the\nfrozen mode. The group delay and the effective quality factor at the SIP\nfrequency show an $N^{3}$ scaling, where $N$ is the number of unit cells in the\ncavity. The frozen mode in the CROW can be utilized in various applications\nlike sensors, lasers and optical delay lines.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Nada_M/0/1/0/all/0/1\">Mohamed Y. Nada</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Mealy_T/0/1/0/all/0/1\">Tarek Mealy</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Islam_M/0/1/0/all/0/1\">Md Shafiqul Islam</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Vitebskiy_I/0/1/0/all/0/1\">Ilya Vitebskiy</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gibson_R/0/1/0/all/0/1\">Ricky Gibson</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Bedford_R/0/1/0/all/0/1\">Robert Bedford</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Boyraz_O/0/1/0/all/0/1\">Ozdal Boyraz</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Capolino_F/0/1/0/all/0/1\">Filippo Capolino</a>"
}