{
  "title": "233: FIVE Keys to Limitless Creativity",
  "pubDate": "Mon, 31 May 2021 14:00:00 +0000",
  "guid": "8b49dd4c-ba0a-49ba-a206-48b4a6fbaca9",
  "link": "https://sites.libsyn.com/94610/233-five-keys-to-limitless-creativity",
  "itunes:image": "",
  "description": "<p>How do you unlock your creative magic?<br /> <br /> You’ve heard me say this before, but I believe the future belongs to the creatives. We live in a world where things are being automated, and technology like artificial intelligence is being turned to more and more. What isn’t going to be outsourced as often are the truly limitless things.</p> <p>In this session, I’m going to share with you FIVE ‘Kwik Tips’ to be able to tap into your truly limitless power of creativity. To use creativity to solve problems, innovate, and do more of the creative endeavors you’ve always wanted to pursue.</p> <p>Creativity is magic. It is a real-life superpower, and you have it inside you. Regardless of where you are in life, whatever age or stage you’re in, all of us can tap into our creative superpower and increase it.</p> <p>If you’ve ever wanted to feel more creative, this episode is for you. There is no limit to your creativity or imagination. And there’s no limit to your ability to use creativity to solve problems. Listen is, as I share the secrets to unlocking your limitless creativity.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "content:encoded": "<p>How do you unlock your creative magic?  You’ve heard me say this before, but I believe the future belongs to the creatives. We live in a world where things are being automated, and technology like artificial intelligence is being turned to more and more. What isn’t going to be outsourced as often are the truly limitless things.</p> <p>In this session, I’m going to share with you FIVE ‘Kwik Tips’ to be able to tap into your truly limitless power of creativity. To use creativity to solve problems, innovate, and do more of the creative endeavors you’ve always wanted to pursue.</p> <p>Creativity is magic. It is a real-life superpower, and you have it inside you. Regardless of where you are in life, whatever age or stage you’re in, all of us can tap into our creative superpower and increase it.</p> <p>If you’ve ever wanted to feel more creative, this episode is for you. There is no limit to your creativity or imagination. And there’s no limit to your ability to use creativity to solve problems. Listen is, as I share the secrets to unlocking your limitless creativity.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "enclosure": "",
  "itunes:duration": "19:39",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you unlock your creative magic?  You’ve heard me say this before, but I believe the future belongs to the creatives. We live in a world where things are being automated, and technology like artificial intelligence is being turned to more and...",
  "itunes:episodeType": "full"
}