{
  "title": "Lázló Nemes, Director",
  "pubDate": "Sun, 09 May 2021 09:00:00 +0000",
  "guid": "b2a194e4-2881-446f-81a7-67cde1489c4f",
  "link": "https://teamdeakins.libsyn.com/lazlo-nemes-director",
  "itunes:image": "",
  "description": "<p>EPISODE 113 - LÁSZLÓ NEMES - Director</p> <p>Team Deakins speaks with László Nemes, director of SON OF SAUL and SUNSET, in this episode. He speaks of what he learned from the Hungarian film director Béla Tarr and why he doesn’t believe in film schools, feeling it doesn’t create curiosity among students. He shares the difficulty of setting up the film, Son of Saul, and how it finally was financed. He speaks of the value of state sponsorship of movies and being able to make films that have to compromise greatly. We learn about his relationship with his DP, Mátyás Erdély, and how they work together. It’s a fascinating discussion with a passionate filmmaker!<br /> <br /> RECOMMENDED EPISODE VIEWING: Son of Saul</p>",
  "content:encoded": "<p>EPISODE 113 - LÁSZLÓ NEMES - Director</p> <p>Team Deakins speaks with László Nemes, director of SON OF SAUL and SUNSET, in this episode. He speaks of what he learned from the Hungarian film director Béla Tarr and why he doesn’t believe in film schools, feeling it doesn’t create curiosity among students. He shares the difficulty of setting up the film, Son of Saul, and how it finally was financed. He speaks of the value of state sponsorship of movies and being able to make films that have to compromise greatly. We learn about his relationship with his DP, Mátyás Erdély, and how they work together. It’s a fascinating discussion with a passionate filmmaker!  RECOMMENDED EPISODE VIEWING: Son of Saul</p>",
  "enclosure": "",
  "itunes:duration": "01:14:56",
  "itunes:explicit": false,
  "itunes:keywords": "director,collaboration,deakins,visualarts,sonofsaul,lazlonemes,hungarianfilmmaking",
  "itunes:subtitle": "EPISODE 113 - LÁSZLÓ NEMES - Director Team Deakins speaks with László Nemes, director of SON OF SAUL and SUNSET, in this episode. He speaks of what he learned from the Hungarian film director Béla Tarr and why he doesn’t believe in film...",
  "itunes:episode": 113,
  "itunes:episodeType": "full"
}