{
  "title": "Episode 41: &#8220;Be-Bop-A-Lula&#8221; by Gene Vincent and the Bluecaps",
  "link": "https://500songs.com/podcast/episode-41-be-bop-a-lula-by-gene-vincent-and-the-bluecaps/",
  "pubDate": "Mon, 15 Jul 2019 04:02:33 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-41-be-bop-a-lula-by-gene-vincent-and-the-bluecaps/",
  "description": "Episode forty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Be-Bop-A-Lula\" by Gene Vincent and the Blue Caps, and how Vincent defined for many what a rock and roll star was. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28385174\">on \"Smokestack Lightning\" by Howlin' Wolf</a>.\n\n\n\n<strong>Resources</strong>\n\nThere are far, far more books on Gene Vincent than one would expect from his short chart history -- a testament to how much he influenced a generation. The two that I used most are <a href=\"https://amzn.to/2jVvriU\"><em>Race With the Devil</em> by Susan VanHecke</a>, and <a href=\"https://amzn.to/2losisr\"><em>Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries</em> by John Collis.</a> Of the two, I'd recommend the latter more.\n\nThere are many compilations of Gene Vincent's early rock and roll work. <a href=\"https://amzn.to/2SlIxmA\">This one</a> contains everything he recorded up until 1962.\n\nAnd as always there's <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-41-be-bop-a-lula/\">a Mixcloud</a> with the full versions of all the songs featured in today's episode.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n[Excerpt: Ian Dury and the Blockheads, \"Sweet Gene Vincent\"]\n\nSo sang Ian Dury, one of the greats of the rock and roll generation that came up in the seventies, a generation that grew up on listening to Gene Vincent. In the USA, Vincent was more or less regarded as a one-hit wonder, though that one hit was one of the most memorable of the 1950s, but in the UK, he was to become one of the biggest influences on everyone who sang or played a guitar.\n\nGene Vincent was born Vincent Eugene Craddock, and he would have been perfectly happy in his original career as a sailor, until 1955. Then, something happened that changed his life forever. He re-enlisted in the Navy, and got a nine-hundred dollar bonus – a huge sum of money for a sailor in those days – which he used to buy himself a new Triumph racing motorbike.\n\nThe bike didn't last long, and nor did Gene's Navy career. There are two stories about the accident. The one which he told most often, and which was the official story, was that he was not at fault – a woman driving a Chrysler ran a red light and ran into him, and the only reason he didn't get compensation was that he signed some papers while he was sedated in hospital.\n\nThe other story, which he told at least one friend, was that he'd been out drinking and was late getting back to the Naval base. There was a security barrier at the base, and he tried to ride under the barrier. He'd failed, and the bike had come down hard on his left leg, crushing it.\n\nWhatever the truth, his left leg was smashed up, and looked for a long time like it was going to be amputated, but he refused to allow this. He had it put into a cast for more than a year, after which it was put into a metal brace instead. His leg never really properly healed, and it would leave him in pain for the rest of his life. His leg developed chronic osteomyelitis, he had a permanent open sore on his shin, his leg muscles withered, and his bones would break regularly.\n\nThen in September 1955, finally discharged from the naval hospital, Gene Vincent went to see a country music show. The headliner was Hank Snow, and the Louvin Brothers were also on the bill, but the act that changed Gene's life was lower down the bill – a young singer named Elvis Presley.\n\n[Excerpt: Elvis Presley, “Mystery Train”]\n\nThe story seems to be the same for almost every one of the early rockabilly artists, but this is the first time we've seen it happen with someone who didn't go on to sign with Sun – a young man in the Southern US has been playing his guitar for a while, making music that's a little bit country, a little bit blues, and then one day he goes to see a show featuring Elvis Presley, and he immediately decides that he wants to do that, that Elvis is doing something that's like what the young man has already started doing, but he's proved that you can do it on stage, for people.\n\nIt's as if at every single show Elvis played in 1954 and 1955 there was a future rockabilly star in the audience -- and by playing those shows, Elvis permanently defined what we mean when we say \"rock and roll star\".\nThe first thing Gene did was to get himself noticed by the radio station that had promoted the show, and in particular by Sheriff Tex Davis, who was actually a DJ from Connecticut whose birth name was William Doucette, but had changed his name to sound more country. Davis was a DJ and show promoter, and he was the one who had promoted the gig that Elvis had appeared at. Gene Craddock came into his office a few days after that show, and told him that he was a singer. Davis listened to him sing a couple of songs, and thought that he would do a decent job as a regular on his <em>Country Showtime</em> radio show.\n\nSoon afterwards, Carl Perkins came to town to do a show with Craddock as the opening act. It would, in fact, be his last show for a while – it was right after this show, as he travelled to get to New York for the TV appearance he was booked on, that he got into the car crash that derailed his career. But Tex Davis asked Carl to watch the opening act and tell him what he thought. Carl watched, and he said that the boy had potential, especially one particular song, \"Be-Bop-A-Lula\", which sounded to Carl quite like some of his own stuff.\n\nThat was good enough for Tex Davis, who signed Craddock up to a management contract, and who almost immediately recorded some of his performances to send to Ken Nelson at Capitol Records.\n\nCapitol at the time was the home of crooners like Frank Sinatra and Nat \"King\" Cole, and other than its small country music division had little connection to the new forms of music that were starting to dominate the culture. Capitol had been founded in the early 1940s by the songwriter Johnny Mercer, who wrote many standards for Sinatra, Bing Crosby, Tony Bennett and others, and also recorded his own material, like this:\n\n[Excerpt: Johnny Mercer, \"Ac-Cent-Tchu-Ate the Positive\"]\n\nMercer was a great songwriter, but you can imagine that a record label headed up by Mercer might not have been one that was most attuned to rock and roll. However, in 1955 Capitol had been bought up by the big conglomerate EMI, and things were changing at the label.\n\nKen Nelson was the head of country music for Capitol Records, and is someone who has a very mixed reputation among lovers of both country music and rockabilly, as someone who had impeccable taste in artists – he also signed Buck Owens and the Louvin Brothers among many other classic country artists – but also as someone who would impose a style on those artists that didn't necessarily suit them.\n\nNelson didn't really understand rockabilly at all, but he knew that Capitol needed its own equivalent of Elvis Presley. So he put a call out for people to recommend him country singers who could sound a bit like Elvis. On hearing the tape that Tex Davis sent him of Gene Craddock, he decided to call in this kid for a session in Nashville.\n\nBy this point, Craddock had formed his own backing band, who became known as the Blue Caps. This consisted of guitarist Cliff Gallup, the oldest of the group and a plumber by trade, drummer Dickie Harrell, a teenager who was enthusiastic but a good decade younger than Gallup, rhythm guitarist Willie Williams, and bass player Jack Neal. They took the name \"Blue Caps\" from the hats they all wore on stage, which were allegedly inspired by the golf caps that President Eisenhower used to wear while playing golf. Not the most rebellious of inspirations for the group that would, more than any other rock and roll group of the fifties, inspire juvenile delinquency and youthful rebelliousness.\n\nThe session was at a studio run by Owen Bradley, who had just recently recorded some early tracks by a singer from Texas named Buddy Holly. The song chosen for the first single was a track called \"Woman Love\", which everyone was convinced could be a hit. They were convinced, that is, until they heard Gene singing it in the studio, at which point they wondered if perhaps some of what he was singing was not quite as wholesome as they had initially been led to believe:\n\n[Excerpt: Gene Vincent and the Blue Caps, \"Woman Love\"]\n\nKen Nelson asked to look at the lyric sheet, and satisfied that Gene *could* have been singing \"hugging\" rather than what Nelson had worried he had been singing, agreed that the song should go out on the A-side of Gene's first single, which was to be released under the name Gene Vincent – a name Nelson created from Gene's forenames.\n\nIt turned out that the lyric sheet didn't completely convince everyone. Most radio stations refused to play “Woman Love” at all, saying that even if the lyrics weren't obscene – and plenty of people were convinced that they were – the record itself still was.\n\nOr, at least, the A-side was.\n\nThe B-side, a song called \"Be-Bop-A-Lula\", was a different matter:\n\n[Excerpt: Gene Vincent and the Blue Caps: \"Be-Bop-A-Lula\"]\n\nThere are three stories about how the song came to have the title \"Be-Bop-A-Lula\". Donald Graves, a fellow patient in the naval hospital who was widely considered to have co-written the song with Gene, always claimed the song was inspired by the 1920s vaudeville song \"Don't Bring Lulu\".\n\n[Excerpt: \"Don't Bring Lulu\", Billy Murray]\n\nAs Tex Davis told the story, it was inspired by a Little Lulu comic book Davis showed Vincent, to which Vincent said, \"Hey, it's be-bop a lulu!\"\n\nDavis is credited as co-writer of the song along with Gene, but it's fairly widely acknowledged that he had no part in the song's writing. Almost every source now says that Davis paid Donald Graves twenty-five dollars for his half of the songwriting rights.\n\nFar more likely is that it was inspired by the Helen Humes song \"Be Baba Leba\":\n\n[Excerpt: Helen Humes, \"Be Baba Leba\"]\n\nThat song had been rerecorded by Lionel Hampton as \"Hey Baba Reba!\", which had been a massive R&B hit, and the song is also generally considered one of the inspirations behind the term \"be bop\" being applied to the style of music.\n\nAnd that's something we should probably at least talk about briefly here, because it shows how much culture changes, and how fast we lose context for things that seemed obvious at the time. The term \"bebop\", as it was originally used, was used in the same way we use it now -- for a type of jazz music that originated in New York in the mid-1940s, which prized harmonic complexity, instrumental virtuosity, and individual self-expression. The music made by people like Charlie Parker, Oscar Peterson, Dexter Gordon, Dizzy Gillespie, and so on, and which pretty much defined what was thought of as jazz in the postwar era.\n\nBut while that was what the term originally meant, and is what the term means now, it wasn't what the term meant in 1956, at least to most of the people who used the term. Colloquially, bebop meant \"that noisy music I don't understand that the young people like, and most of the people making it are black\". So it covered bebop itself, but it was also used for rhythm and blues, rock and roll, even rockabilly -- you would often find interviewers talking with Elvis in his early years referring to his music as \"Hillbilly Bop\" or \"a mixture of country music and bebop\".\n\nSo even though “Be-Bop-A-Lula” had about as much to do with bebop as it did with Stravinsky, the name still fit.\n\nAt that initial session, Ken Nelson brought in a few of the top session players in Nashville, but when he heard the Blue Caps play, he was satisfied that they were good enough to play on the records, and sent the session musicians home. In truth, the Blue Caps were probably best described as a mixed-ability group. Some of them were rudimentary musicians at best -- though as we've seen, rockabilly, more than most genres, was comfortable with enthusiastic amateurs anyway.\n\nBut Cliff Gallup, the lead guitarist, was quite probably the most technically accomplished guitarist in the world of rockabilly. Gallup's guitar style, which involved fast-picked triplets and the use of multiple steel fingerpicks, was an inspiration for almost every rock and roll guitarist of the 1960s, and any group which had him in would sound at least decent.\n\nDuring the recording of “Be-Bop-A-Lula”, the young drummer Dickie Harrell decided to let out a giant scream right in the middle of the song -- he later said that this was so that his mother would know he was on the record. Cliff Gallup was not impressed, and wanted to do a second take, but the first take was what was used.\n\n[Excerpt: Gene Vincent, “Be Bop A Lula”, scream section]\n\n\"Be-Bop-A-Lula\" is by any standards a quite astonishing record. The lyric is, of course, absolute nonsense -- it's a gibberish song with no real lyrical content at all -- but that doesn't matter at all. What matters is the *sound*. What we have here, fundamentally, is the sound of \"Heartbreak Hotel\" applied to a much, much, less depressive lyric. It still has that strange morbidity that the Elvis track had, but combined with carefree gibberish lyrics in the style of Little Richard. It's the precise midpoint between \"Heartbreak Hotel\" and \"Tutti Frutti\", and is probably the record which, more than any other, epitomises 1956.\n\nA lot of people commented on the similarity between Vincent's record and the music of Elvis Presley. There are various stories that went round at the time, including that Scotty and Bill got annoyed at Elvis for recording it without them, that Elvis' mother had told him she liked that new single of his, \"Be-Bop-A-Lula\", and even that Elvis himself, on hearing it, had been confused and wondered if he'd forgotten recording it.\nIn truth, none of these stories seem likely. The record is, sonically and stylistically, like an Elvis one, but Vincent's voice has none of the same qualities as Elvis'. While Elvis is fully in control at all times, playful and exuberant, Gene Vincent is tense and twitchy. Vincent's voice is thinner than Elvis', and his performance is more mannered than Elvis' singing at that time was.\n\nBut none of this stopped Vincent from worrying the one time he did meet Elvis, who came over and asked him if he was the one who'd recorded \"Be-Bop-A-Lula\". Vincent was apologetic, and explained that he'd not been intending to copy Elvis, the record had just come out like that. But Elvis reassured him that he understood, and that that was just how Gene sang.\n\nWhat fewer people commented on was the song's similarity to “Money Honey”:\n\n[Excerpt: The Drifters, “Money Honey”]\n\nThe two songs have near-identical melodies. The only real difference is that in “Be-Bop-A-Lula” Vincent bookends the song with a slight variation, turning the opening and closing choruses into twelve-bar blueses, rather than the eight-bar blues used in the rest of the song and in “Money Honey”. Luckily for Vincent, at this time the culture in R&B was relaxed enough about borrowings that Jesse Stone seems not to have even considered suing.\n\nThe follow-up to \"Be-Bop-A-Lula\" did much less well. \"Race With the Devil\" -- not the same song as the one later made famous by Judas Priest -- was one of the all-time great rockabilly records, but the lyrics, about a hot-rod race with the actual Devil, were, like \"Woman Love\", considered unbroadcastable, and this time there was no massive hit record hidden away on the B-side to salvage things:\n\n[Excerpt: Gene Vincent and the Blue Caps, \"Race With The Devil\"]\n\nThe single after that, \"Blue Jean Bop\", did a little better, reaching the lower reaches of the top fifty, rather than the lower reaches of the top hundred as \"Race With the Devil\" had, and making the top twenty in the UK:\n\n[Excerpt: Gene Vincent, \"Blue Jean Bop\"]\n\nBut there were three major problems that were preventing Vincent and the Blue Caps from having the success that it seemed they deserved.\n\nThe first was Ken Nelson. He was in charge of the material that the group were recording, and he would suggest songs like \"Up a Lazy River\", \"Ain't She Sweet\", and \"Those Wedding Bells are Breaking up That Old Gang of Mine\". Vincent enjoyed those old standards as much as anyone, but they weren't actually suited to the rockabilly treatment – especially not to the kind of rough and ready performances that the original lineup of the Blue Caps were suited to.\n\nAnd that brings us to the second problem. There was a huge age gap, as well as disparity in ability, in the band, and Cliff Gallup, in particular, felt that he was too old to be touring in a rock and roll band, and quit the group. Gallup was actually offered a regular gig as a session guitarist by Ken Nelson, which would have meant that he didn't have to travel, but he turned it down and got a job as a high school janitor and maintenance man, just playing the occasional extra gig for pin money. When he was contacted by fans, he would get embarrassed, and he didn't like to talk about his brief time as a rock and roll star. He never signed a single autograph, and when he died in 1989 his widow made sure the obituaries never mentioned his time with Gene Vincent.\n\nBut Gallup was just the first to leave. In the first two and a half years of the Blue Caps' existence, twenty different people were members of the band. Vincent could never keep a stable lineup of the band together for more than a few weeks or months at a time.\n\nAnd the third major problem... that was Vincent himself. Even before his accident, he had been an impetuous, hot-headed man, who didn't think very carefully about the possible consequences of his actions. Now he was in chronic pain from the accident, he was a rock and roll star, and he was drinking heavily to deal with the pain. This is not a combination that makes people less inclined to rash behaviour.\n\nSo, for example, he'd started breaking contracts. Vincent and the Blue Caps were booked to play a residency in Las Vegas, where they were making three thousand dollars a week – for 1956 a staggering sum of money.\nBut Tex Davis told Vincent that the owner of the casino wanted him to tone down some aspects of his act, and he didn't like that at all. It wasn't even enough to convince him when it was pointed out that the man doing the asking was big in the Mafia. Instead, Gene went on stage, sang one song, found Tex Davis in the crowd, caught his eye, flipped him off, and walked off stage, leaving the band to do the rest of the show without him.\nUnsurprisingly, the residency didn't last very long. Equally unsurprisingly, Tex Davis decided he was no longer going to manage Gene Vincent. Legal problems around the fallout from losing his management caused Vincent to be unable to work for several months.\n\nWhile both \"Race With the Devil\" and \"Blue Jean Bop\" were big hits in the UK, the closest they came to having another hit in the USA was a song called \"Lotta Lovin'\":\n\n[Excerpt: Gene Vincent, \"Lotta Lovin'\"]\n\nThat was written by a songwriter named Bernice Bedwell, who is otherwise unknown -- she wrote a handful of other rockabilly songs, including another song that Vincent would record, but nothing else that was particularly successful, and there seems to be no biographical information about her anywhere. She sold the publishing rights to the song to a Texas oilman, Tom Fleeger, who does seem to have had a fairly colourful life -- he wrote a memoir called \"Fidel and the Fleeg\", which I sadly haven't read, but in which he claims that Fidel Castro tried to frame him for murder in the 1940s after a dispute over a beautiful woman.\n\nFleeger was soon to start his own record label, Jan Records, but for now he thought that the song would be suitable for Gene Vincent, and got in touch with him. \"Lotta Lovin'\" was quickly recorded at Gene's first session at Capitol's new studio at the Capitol Tower in Hollywood.\n\nThe B-side was a ballad called \"Wear My Ring\" by Warren Cassoto, the future Bobby Darin, and Don Kirshner.\n\n[Excerpt: Gene Vincent, \"Wear My Ring\"]\n\n\"Lotta Lovin'\" went to number thirteen on the pop charts, and number seven on the R&B charts, and it looked like it would revitalise Gene's career. But it was not to be. Vincent's increasingly erratic behaviour -- including pulling a gun on band members on multiple occasions -- and Capitol and Ken Nelson's lack of understanding of rock and roll music, meant that he quickly became a forgotten figure in the US.\n\nBut he had a huge impact on the UK, thanks to a TV producer named Jack Good.\n\nJack Good was the person who, more than anyone else, had brought rock and roll to British TV. He'd been the producer of Six-Five Special, a BBC TV show that was devoted to rock and roll and skiffle, before moving to ITV, producing its first two rock and roll shows, \"Oh Boy\", and \"Boy Meets Girls\". And it was Good who suggested that Vincent switch from his normal polite-looking stagewear into black leather, and that he accentuate the postural problems his disability caused him.\n\nVincent's appearances on “Boy Meets Girls”, dressed in black leather, hunched over, in pain because of his leg, defined for British teenagers of the 1950s what a rock and roller was meant to look like. At a time when few American rock and roll stars were visiting the UK, and even fewer were getting any exposure on the very small number of TV shows that were actually broadcast -- this was when there were only two TV channels in the UK, and they broadcast for only a few hours -- Gene Vincent being *here*, and on British TV, meant the world. And on a show like Boy Meets Girls, where the rest of the acts were people like Cliff RIchard or Adam Faith, having a mean, moody, leather-clad rock and roller on screen was instantly captivating. For a generation of British rockers, Gene Vincent epitomised American rock and roll.\n\nUntil in 1960 he was on a tour of the UK that ended in tragedy. But that's a story for another time...",
  "itunes:subtitle": "Episode forty-one of A History of Rock Music in Five Hundred Songs looks at Be-Bop-A-Lula by Gene Vincent and the Blue Caps, and how Vincent defined for many what a rock and roll star was. Click the full post to read liner notes, links to more informatio",
  "itunes:keywords": "Capitol Records,country and western,Don Kirshner,Elvis Presley,Gene Vincent,Ian Dury,Jack Good,Ken Nelson,Lionel Hampton,Owen Bradley,rockabilly",
  "itunes:episodeType": "full",
  "itunes:episode": 41,
  "content:encoded": "Episode forty-one of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Be-Bop-A-Lula\" by Gene Vincent and the Blue Caps, and how Vincent defined for many what a rock and roll star was. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28385174\">on \"Smokestack Lightning\" by Howlin' Wolf</a>.\n\n\n\n<strong>Resources</strong>\n\nThere are far, far more books on Gene Vincent than one would expect from his short chart history -- a testament to how much he influenced a generation. The two that I used most are <a href=\"https://amzn.to/2jVvriU\"><em>Race With the Devil</em> by Susan VanHecke</a>, and <a href=\"https://amzn.to/2losisr\"><em>Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries</em> by John Collis.</a> Of the two, I'd recommend the latter more.\n\nThere are many compilations of Gene Vincent's early rock and roll work. <a href=\"https://amzn.to/2SlIxmA\">This one</a> contains everything he recorded up until 1962.\n\nAnd as always there's <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-41-be-bop-a-lula/\">a Mixcloud</a> with the full versions of all the songs featured in today's episode.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\n[Excerpt: Ian Dury and the Blockheads, \"Sweet Gene Vincent\"]\n\nSo sang Ian Dury, one of the greats of the rock and roll generation that came up in the seventies, a generation that grew up on listening to Gene Vincent. In the USA, Vincent was more or less regarded as a one-hit wonder, though that one hit was one of the most memorable of the 1950s, but in the UK, he was to become one of the biggest influences on everyone who sang or played a guitar.\n\nGene Vincent was born Vincent Eugene Craddock, and he would have been perfectly happy in his original career as a sailor, until 1955. Then, something happened that changed his life forever. He re-enlisted in the Navy, and got a nine-hundred dollar bonus – a huge sum of money for a sailor in those days – which he used to buy himself a new Triumph racing motorbike.\n\nThe bike didn't last long, and nor did Gene's Navy career. There are two stories about the accident. The one which he told most often, and which was the official story, was that he was not at fault – a woman driving a Chrysler ran a red light and ran into him, and the only reason he didn't get compensation was that he signed some papers while he was sedated in hospital.\n\nThe other story, which he told at least one friend, was that he'd been out drinking and was late getting back to the Naval base. There was a security barrier at the base, and he tried to ride under the barrier. He'd failed, and the bike had come down hard on his left leg, crushing it.\n\nWhatever the truth, his left leg was smashed up, and looked for a long time like it was going to be amputated, but he refused to allow this. He had it put into a cast for more than a year, after which it was put into a metal brace instead. His leg never really properly healed, and it would leave him in pain for the rest of his life. His leg developed chronic osteomyelitis, he had a permanent open sore on his shin, his leg muscles withered, and his bones would break regularly.\n\nThen in September 1955, finally discharged from the naval hospital, Gene Vincent went to see a country music show. The headliner was Hank Snow, and the Louvin Brothers were also on the bill, but the act that changed Gene's life was lower down the bill – a young singer named Elvis Presley.\n\n[Excerpt: Elvis Presley, “Mystery Train”]\n\nThe story seems to be the same for almost every one of the early rockabilly artists, but this is the first time we've seen it happen with someone who didn't go on to sign with Sun – a young man in the Southern US has been playing his guitar for a while, making music that's a little bit country, a little bit blues, and then one day he goes to see a show featuring Elvis Presley, and he immediately decides that he wants to do that, that Elvis is doing something that's like what the young man has already started doing, but he's proved that you can do it on stage, for people.\n\nIt's as if at every single show Elvis played in 1954 and 1955 there was a future rockabilly star in the audience -- and by playing those shows, Elvis permanently defined what we mean when we say \"rock and roll star\".\nThe first thing Gene did was to get himself noticed by the radio station that had promoted the show, and in particular by Sheriff Tex Davis, who was actually a DJ from Connecticut whose birth name was William Doucette, but had changed his name to sound more country. Davis was a DJ and show promoter, and he was the one who had promoted the gig that Elvis had appeared at. Gene Craddock came into his office a few days after that show, and told him that he was a singer. Davis listened to him sing a couple of songs, and thought that he would do a decent job as a regular on his <em>Country Showtime</em> radio show.\n\nSoon afterwards, Carl Perkins came to town to do a show with Craddock as the opening act. It would, in fact, be his last show for a while – it was right after this show, as he travelled to get to New York for the TV appearance he was booked on, that he got into the car crash that derailed his career. But Tex Davis asked Carl to watch the opening act and tell him what he thought. Carl watched, and he said that the boy had potential, especially one particular song, \"Be-Bop-A-Lula\", which sounded to Carl quite like some of his own stuff.\n\nThat was good enough for Tex Davis, who signed Craddock up to a management contract, and who almost immediately recorded some of his performances to send to Ken Nelson at Capitol Records.\n\nCapitol at the time was the home of crooners like Frank Sinatra and Nat \"King\" Cole, and other than its small country music division had little connection to the new forms of music that were starting to dominate the culture. Capitol had been founded in the early 1940s by the songwriter Johnny Mercer, who wrote many standards for Sinatra, Bing Crosby, Tony Bennett and others, and also recorded his own material, like this:\n\n[Excerpt: Johnny Mercer, \"Ac-Cent-Tchu-Ate the Positive\"]\n\nMercer was a great songwriter, but you can imagine that a record label headed up by Mercer might not have been one that was most attuned to rock and roll. However, in 1955 Capitol had been bought up by the big conglomerate EMI, and things were changing at the label.\n\nKen Nelson was the head of country music for Capitol Records, and is someone who has a very mixed reputation among lovers of both country music and rockabilly, as someone who had impeccable taste in artists – he also signed Buck Owens and the Louvin Brothers among many other classic country artists – but also as someone who would impose a style on those artists that didn't necessarily suit them.\n\nNelson didn't really understand rockabilly at all, but he knew that Capitol needed its own equivalent of Elvis Presley. So he put a call out for people to recommend him country singers who could sound a bit like Elvis. On hearing the tape that Tex Davis sent him of Gene Craddock, he decided to call in this kid for a session in Nashville.\n\nBy this point, Craddock had formed his own backing band, who became known as the Blue Caps. This consisted of guitarist Cliff Gallup, the oldest of the group and a plumber by trade, drummer Dickie Harrell, a teenager who was enthusiastic but a good decade younger than Gallup, rhythm guitarist Willie Williams, and bass player Jack Neal. They took the name \"Blue Caps\" from the hats they all wore on stage, which were allegedly inspired by the golf caps that President Eisenhower used to wear while playing golf. Not the most rebellious of inspirations for the group that would, more than any other rock and roll group of the fifties, inspire juvenile delinquency and youthful rebelliousness.\n\nThe session was at a studio run by Owen Bradley, who had just recently recorded some early tracks by a singer from Texas named Buddy Holly. The song chosen for the first single was a track called \"Woman Love\", which everyone was convinced could be a hit. They were convinced, that is, until they heard Gene singing it in the studio, at which point they wondered if perhaps some of what he was singing was not quite as wholesome as they had initially been led to believe:\n\n[Excerpt: Gene Vincent and the Blue Caps, \"Woman Love\"]\n\nKen Nelson asked to look at the lyric sheet, and satisfied that Gene *could* have been singing \"hugging\" rather than what Nelson had worried he had been singing, agreed that the song should go out on the A-side of Gene's first single, which was to be released under the name Gene Vincent – a name Nelson created from Gene's forenames.\n\nIt turned out that the lyric sheet didn't completely convince everyone. Most radio stations refused to play “Woman Love” at all, saying that even if the lyrics weren't obscene – and plenty of people were convinced that they were – the record itself still was.\n\nOr, at least, the A-side was.\n\nThe B-side, a song called \"Be-Bop-A-Lula\", was a different matter:\n\n[Excerpt: Gene Vincent and the Blue Caps: \"Be-Bop-A-Lula\"]\n\nThere are three stories about how the song came to have the title \"Be-Bop-A-Lula\". Donald Graves, a fellow patient in the naval hospital who was widely considered to have co-written the song with Gene, always claimed the song was inspired by the 1920s vaudeville song \"Don't Bring Lulu\".\n\n[Excerpt: \"Don't Bring Lulu\", Billy Murray]\n\nAs Tex Davis told the story, it was inspired by a Little Lulu comic book Davis showed Vincent, to which Vincent said, \"Hey, it's be-bop a lulu!\"\n\nDavis is credited as co-writer of the song along with Gene, but it's fairly widely acknowledged that he had no part in the song's writing. Almost every source now says that Davis paid Donald Graves twenty-five dollars for his half of the songwriting rights.\n\nFar more likely is that it was inspired by the Helen Humes song \"Be Baba Leba\":\n\n[Excerpt: Helen Humes, \"Be Baba Leba\"]\n\nThat song had been rerecorded by Lionel Hampton as \"Hey Baba Reba!\", which had been a massive R&B hit, and the song is also generally considered one of the inspirations behind the term \"be bop\" being applied to the style of music.\n\nAnd that's something we should probably at least talk about briefly here, because it shows how much culture changes, and how fast we lose context for things that seemed obvious at the time. The term \"bebop\", as it was originally used, was used in the same way we use it now -- for a type of jazz music that originated in New York in the mid-1940s, which prized harmonic complexity, instrumental virtuosity, and individual self-expression. The music made by people like Charlie Parker, Oscar Peterson, Dexter Gordon, Dizzy Gillespie, and so on, and which pretty much defined what was thought of as jazz in the postwar era.\n\nBut while that was what the term originally meant, and is what the term means now, it wasn't what the term meant in 1956, at least to most of the people who used the term. Colloquially, bebop meant \"that noisy music I don't understand that the young people like, and most of the people making it are black\". So it covered bebop itself, but it was also used for rhythm and blues, rock and roll, even rockabilly -- you would often find interviewers talking with Elvis in his early years referring to his music as \"Hillbilly Bop\" or \"a mixture of country music and bebop\".\n\nSo even though “Be-Bop-A-Lula” had about as much to do with bebop as it did with Stravinsky, the name still fit.\n\nAt that initial session, Ken Nelson brought in a few of the top session players in Nashville, but when he heard the Blue Caps play, he was satisfied that they were good enough to play on the records, and sent the session musicians home. In truth, the Blue Caps were probably best described as a mixed-ability group. Some of them were rudimentary musicians at best -- though as we've seen, rockabilly, more than most genres, was comfortable with enthusiastic amateurs anyway.\n\nBut Cliff Gallup, the lead guitarist, was quite probably the most technically accomplished guitarist in the world of rockabilly. Gallup's guitar style, which involved fast-picked triplets and the use of multiple steel fingerpicks, was an inspiration for almost every rock and roll guitarist of the 1960s, and any group which had him in would sound at least decent.\n\nDuring the recording of “Be-Bop-A-Lula”, the young drummer Dickie Harrell decided to let out a giant scream right in the middle of the song -- he later said that this was so that his mother would know he was on the record. Cliff Gallup was not impressed, and wanted to do a second take, but the first take was what was used.\n\n[Excerpt: Gene Vincent, “Be Bop A Lula”, scream section]\n\n\"Be-Bop-A-Lula\" is by any standards a quite astonishing record. The lyric is, of course, absolute nonsense -- it's a gibberish song with no real lyrical content at all -- but that doesn't matter at all. What matters is the *sound*. What we have here, fundamentally, is the sound of \"Heartbreak Hotel\" applied to a much, much, less depressive lyric. It still has that strange morbidity that the Elvis track had, but combined with carefree gibberish lyrics in the style of Little Richard. It's the precise midpoint between \"Heartbreak Hotel\" and \"Tutti Frutti\", and is probably the record which, more than any other, epitomises 1956.\n\nA lot of people commented on the similarity between Vincent's record and the music of Elvis Presley. There are various stories that went round at the time, including that Scotty and Bill got annoyed at Elvis for recording it without them, that Elvis' mother had told him she liked that new single of his, \"Be-Bop-A-Lula\", and even that Elvis himself, on hearing it, had been confused and wondered if he'd forgotten recording it.\nIn truth, none of these stories seem likely. The record is, sonically and stylistically, like an Elvis one, but Vincent's voice has none of the same qualities as Elvis'. While Elvis is fully in control at all times, playful and exuberant, Gene Vincent is tense and twitchy. Vincent's voice is thinner than Elvis', and his performance is more mannered than Elvis' singing at that time was.\n\nBut none of this stopped Vincent from worrying the one time he did meet Elvis, who came over and asked him if he was the one who'd recorded \"Be-Bop-A-Lula\". Vincent was apologetic, and explained that he'd not been intending to copy Elvis, the record had just come out like that. But Elvis reassured him that he understood, and that that was just how Gene sang.\n\nWhat fewer people commented on was the song's similarity to “Money Honey”:\n\n[Excerpt: The Drifters, “Money Honey”]\n\nThe two songs have near-identical melodies. The only real difference is that in “Be-Bop-A-Lula” Vincent bookends the song with a slight variation, turning the opening and closing choruses into twelve-bar blueses, rather than the eight-bar blues used in the rest of the song and in “Money Honey”. Luckily for Vincent, at this time the culture in R&B was relaxed enough about borrowings that Jesse Stone seems not to have even considered suing.\n\nThe follow-up to \"Be-Bop-A-Lula\" did much less well. \"Race With the Devil\" -- not the same song as the one later made famous by Judas Priest -- was one of the all-time great rockabilly records, but the lyrics, about a hot-rod race with the actual Devil, were, like \"Woman Love\", considered unbroadcastable, and this time there was no massive hit record hidden away on the B-side to salvage things:\n\n[Excerpt: Gene Vincent and the Blue Caps, \"Race With The Devil\"]\n\nThe single after that, \"Blue Jean Bop\", did a little better, reaching the lower reaches of the top fifty, rather than the lower reaches of the top hundred as \"Race With the Devil\" had, and making the top twenty in the UK:\n\n[Excerpt: Gene Vincent, \"Blue Jean Bop\"]\n\nBut there were three major problems that were preventing Vincent and the Blue Caps from having the success that it seemed they deserved.\n\nThe first was Ken Nelson. He was in charge of the material that the group were recording, and he would suggest songs like \"Up a Lazy River\", \"Ain't She Sweet\", and \"Those Wedding Bells are Breaking up That Old Gang of Mine\". Vincent enjoyed those old standards as much as anyone, but they weren't actually suited to the rockabilly treatment – especially not to the kind of rough and ready performances that the original lineup of the Blue Caps were suited to.\n\nAnd that brings us to the second problem. There was a huge age gap, as well as disparity in ability, in the band, and Cliff Gallup, in particular, felt that he was too old to be touring in a rock and roll band, and quit the group. Gallup was actually offered a regular gig as a session guitarist by Ken Nelson, which would have meant that he didn't have to travel, but he turned it down and got a job as a high school janitor and maintenance man, just playing the occasional extra gig for pin money. When he was contacted by fans, he would get embarrassed, and he didn't like to talk about his brief time as a rock and roll star. He never signed a single autograph, and when he died in 1989 his widow made sure the obituaries never mentioned his time with Gene Vincent.\n\nBut Gallup was just the first to leave. In the first two and a half years of the Blue Caps' existence, twenty different people were members of the band. Vincent could never keep a stable lineup of the band together for more than a few weeks or months at a time.\n\nAnd the third major problem... that was Vincent himself. Even before his accident, he had been an impetuous, hot-headed man, who didn't think very carefully about the possible consequences of his actions. Now he was in chronic pain from the accident, he was a rock and roll star, and he was drinking heavily to deal with the pain. This is not a combination that makes people less inclined to rash behaviour.\n\nSo, for example, he'd started breaking contracts. Vincent and the Blue Caps were booked to play a residency in Las Vegas, where they were making three thousand dollars a week – for 1956 a staggering sum of money.\nBut Tex Davis told Vincent that the owner of the casino wanted him to tone down some aspects of his act, and he didn't like that at all. It wasn't even enough to convince him when it was pointed out that the man doing the asking was big in the Mafia. Instead, Gene went on stage, sang one song, found Tex Davis in the crowd, caught his eye, flipped him off, and walked off stage, leaving the band to do the rest of the show without him.\nUnsurprisingly, the residency didn't last very long. Equally unsurprisingly, Tex Davis decided he was no longer going to manage Gene Vincent. Legal problems around the fallout from losing his management caused Vincent to be unable to work for several months.\n\nWhile both \"Race With the Devil\" and \"Blue Jean Bop\" were big hits in the UK, the closest they came to having another hit in the USA was a song called \"Lotta Lovin'\":\n\n[Excerpt: Gene Vincent, \"Lotta Lovin'\"]\n\nThat was written by a songwriter named Bernice Bedwell, who is otherwise unknown -- she wrote a handful of other rockabilly songs, including another song that Vincent would record, but nothing else that was particularly successful, and there seems to be no biographical information about her anywhere. She sold the publishing rights to the song to a Texas oilman, Tom Fleeger, who does seem to have had a fairly colourful life -- he wrote a memoir called \"Fidel and the Fleeg\", which I sadly haven't read, but in which he claims that Fidel Castro tried to frame him for murder in the 1940s after a dispute over a beautiful woman.\n\nFleeger was soon to start his own record label, Jan Records, but for now he thought that the song would be suitable for Gene Vincent, and got in touch with him. \"Lotta Lovin'\" was quickly recorded at Gene's first session at Capitol's new studio at the Capitol Tower in Hollywood.\n\nThe B-side was a ballad called \"Wear My Ring\" by Warren Cassoto, the future Bobby Darin, and Don Kirshner.\n\n[Excerpt: Gene Vincent, \"Wear My Ring\"]\n\n\"Lotta Lovin'\" went to number thirteen on the pop charts, and number seven on the R&B charts, and it looked like it would revitalise Gene's career. But it was not to be. Vincent's increasingly erratic behaviour -- including pulling a gun on band members on multiple occasions -- and Capitol and Ken Nelson's lack of understanding of rock and roll music, meant that he quickly became a forgotten figure in the US.\n\nBut he had a huge impact on the UK, thanks to a TV producer named Jack Good.\n\nJack Good was the person who, more than anyone else, had brought rock and roll to British TV. He'd been the producer of Six-Five Special, a BBC TV show that was devoted to rock and roll and skiffle, before moving to ITV, producing its first two rock and roll shows, \"Oh Boy\", and \"Boy Meets Girls\". And it was Good who suggested that Vincent switch from his normal polite-looking stagewear into black leather, and that he accentuate the postural problems his disability caused him.\n\nVincent's appearances on “Boy Meets Girls”, dressed in black leather, hunched over, in pain because of his leg, defined for British teenagers of the 1950s what a rock and roller was meant to look like. At a time when few American rock and roll stars were visiting the UK, and even fewer were getting any exposure on the very small number of TV shows that were actually broadcast -- this was when there were only two TV channels in the UK, and they broadcast for only a few hours -- Gene Vincent being *here*, and on British TV, meant the world. And on a show like Boy Meets Girls, where the rest of the acts were people like Cliff RIchard or Adam Faith, having a mean, moody, leather-clad rock and roller on screen was instantly captivating. For a generation of British rockers, Gene Vincent epitomised American rock and roll.\n\nUntil in 1960 he was on a tour of the UK that ended in tragedy. But that's a story for another time...",
  "enclosure": "",
  "itunes:summary": "Episode forty-one of A History of Rock Music in Five Hundred Songs looks at \"Be-Bop-A-Lula\" by Gene Vincent and the Blue Caps, and how Vincent defined for many what a rock and roll star was. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Smokestack Lightning\" by Howlin' Wolf.\n\n\n\nResources\n\nThere are far, far more books on Gene Vincent than one would expect from his short chart history -- a testament to how much he influenced a generation. The two that I used most are Race With the Devil by Susan VanHecke, and Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries by John Collis. Of the two, I'd recommend the latter more.\n\nThere are many compilations of Gene Vincent's early rock and roll work. This one contains everything he recorded up until 1962.\n\nAnd as always there's a Mixcloud with the full versions of all the songs featured in today's episode.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\n[Excerpt: Ian Dury and the Blockheads, \"Sweet Gene Vincent\"]\n\nSo sang Ian Dury, one of the greats of the rock and roll generation that came up in the seventies, a generation that grew up on listening to Gene Vincent. In the USA, Vincent was more or less regarded as a one-hit wonder, though that one hit was one of the most memorable of the 1950s, but in the UK, he was to become one of the biggest influences on everyone who sang or played a guitar.\n\nGene Vincent was born Vincent Eugene Craddock, and he would have been perfectly happy in his original career as a sailor, until 1955. Then, something happened that changed his life forever. He re-enlisted in the Navy, and got a nine-hundred dollar bonus – a huge sum of money for a sailor in those days – which he used to buy himself a new Triumph racing motorbike.\n\nThe bike didn't last long, and nor did Gene's Navy career. There are two stories about the accident. The one which he told most often, and which was the official story, was that he was not at fault – a woman driving a Chrysler ran a red light and ran into him, and the only reason he didn't get compensation was that he signed some papers while he was sedated in hospital.\n\nThe other story, which he told at least one friend, was that he'd been out drinking and was late getting back to the Naval base. There was a security barrier at the base, and he tried to ride under the barrier. He'd failed, and the bike had come down hard on his left leg, crushing it.\n\nWhatever the truth, his left leg was smashed up, and looked for a long time like it was going to be amputated, but he refused to allow this. He had it put into a cast for more than a year, after which it was put into a metal brace instead. His leg never really properly healed, and it would leave him in pain for the rest of his life. His leg developed chronic osteomyelitis, he had a permanent open sore on his shin, his leg muscles withered, and his bones would break regularly.\n\nThen in September 1955, finally discharged from the naval hospital, Gene Vincent went to see a country music show. The headliner was Hank Snow, and the Louvin Brothers were also on the bill, but the act that changed Gene's life was lower down the bill – a young singer named Elvis Presley.\n\n[Excerpt: Elvis Presley, “Mystery Train”]\n\nThe story seems to be the same for almost every one of the early rockabilly artists, but this is the first time we've seen it happen with someone who didn't go on to sign with Sun – a young man in the Southern US has been playing his guitar for a while, making music that's a little bit country, a little bit blues, and then one day he goes to see a show featuring Elvis Presley, and he immediately decides that he wants to do that, that Elvis is doing something that's like what the young man has already started doing, but he's proved that you can do it on stage, for people.\n\nIt's as if at ev",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty-one of A History of Rock Music in Five Hundred Songs looks at \"Be-Bop-A-Lula\" by Gene Vincent and the Blue Caps, and how Vincent defined for many what a rock and roll star was. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Smokestack Lightning\" by Howlin' Wolf.\n\n\n\nResources\n\nThere are far, far more books on Gene Vincent than one would expect from his short chart history -- a testament to how much he influenced a generation. The two that I used most are Race With the Devil by Susan VanHecke, and Gene Vincent and Eddie Cochran: Rock and Roll Revolutionaries by John Collis. Of the two, I'd recommend the latter more.\n\nThere are many compilations of Gene Vincent's early rock and roll work. This one contains everything he recorded up until 1962.\n\nAnd as always there's a Mixcloud with the full versions of all the songs featured in today's episode.\n\nPatreon",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}