{
  "title": "A Rich Harvest in the Desert",
  "link": "https://spectrum.ieee.org/lithium-mining",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/image.jpg?id=31994788&width=980\"/><br/><br/><p>The Big Picture features technology through the lens of photographers.</p><p>Every month, <em>IEEE Spectrum</em> selects the most stunning technology images recently captured by photographers around the world. We choose images that reflect an important advance, or a trend, or that are just mesmerizing to look at. We feature all images on our site, and one also appears on our monthly print edition.</p><p>Enjoy the latest images, and if you have suggestions, leave a comment below.</p><h3>Lithium Mining: A Harvest in the Desert</h3><br/><img alt=\"Giant evaporation pools in the Atacama Desert yield lithium and salt.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b1f26c7fc61483bcf25e3c4b201b429c\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"f47d9\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/giant-evaporation-pools-in-the-atacama-desert-yield-lithium-and-salt.jpg?id=31959150&width=980\"/><p>\n\tThe rise in global demand for lithium—spurred mainly by the manufacturing of lithium-ion batteries for electric vehicles—has triggered expanded mining of the world’s known major caches of lithium. One of the richest deposits of lithium ore is in Chile’s Atacama Desert. The area, said to be the driest region on earth, has long been a premier source of sodium nitrate, or saltpeter. To extract lithium, miners pump a naturally occurring brine from beneath Atacama’s salt flats into giant evaporation pools on the surface. Initially, the liquid is a dark blue color. But over the course of 18 months, the sun and the arid desert air strip away a great deal of the brine’s moisture. Left behind are pools of a bright yellow slurry that has a roughly 6-percent lithium content. A nearby chemical plant processes the slurry into lithium carbonate powder suitable for making batteries for automotive propulsion.\n</p><p class=\"caption\">\nJohn Moore/Getty Images\n</p><h3>James Webb's Far-Fetched Scenerey</h3><br/><img alt=\"James Webb\\u2019s view into deep space has yielded a view of a distant constellation that is reminiscent of a mountain range under a starry night sky.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"3749d32dc9f8904f48d90ab87856371e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"c282b\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/james-webb-u2019s-view-into-deep-space-has-yielded-a-view-of-a-distant-constellation-that-is-reminiscent-of-a-mountain-range-und.jpg?id=31959187&width=980\"/><p>\n\tObjects in the James Webb Space Telescope’s imager are farther away than they appear. The level of detail in this image is startling, considering that it would take 9,100 years of travel at the speed of light to reach this gas cloud from Earth. That’s a long commute. Captured in the picture are the so-called Cosmic Cliffs. What appears at first glance to be a mountain range is actually a sprawling pocket of gas inside a star cluster known as NGC 3324. The Hubble Telescope has already captured images of the constellation, so it was only natural to produce an updated set of glamour shots using James Webb’s more sensitive imaging equipment.\n</p><p class=\"caption\">\n\tESA/CSA/STSCI/NASA\n</p><h3>Alternative Fuel From Artificial Leaf</h3><br/><img alt=\"A green-and-blue device laminated in clear plastic floats on a river, with Cambridge University\\u2019s Kings College in the background.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"68a00ac546c8a6048416ad6c2324f6c2\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"ff495\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-green-and-blue-device-laminated-in-clear-plastic-floats-on-a-river-with-cambridge-university-u2019s-kings-college-in-the-back.jpg?id=31959214&width=980\"/><p>For eons, leaves have been creating the fuel that plants run on virtually out of thin air. A little sun, plus some oxygen and water, is enough to keep a plant going strong. Now, scientists are making strides in the ongoing effort to reverse engineer the leaf. The aim is to pull the carbon dioxide from the air and, using a catalyst, generate a cleaner alternative to the fossil fuels on which we so greatly depend. Researchers will continue trying to improve the yield and efficiency of photovoltaic devices designed to produce hydrogen fuel by splitting the water covering about three-fourths of the Earth’s surface. But a team at the University of Cambridge has demonstrated an artificial leaf that sits on the surface of a body of water and does a fairly good job of producing syngas from carbon dioxide and water. The version shown here (floating on the River Cam near the Cambridge campus) has a surface area of only 100 square centimeters. The Cambridge team already has its sights set on bigger models that would each be capable of powering dozens of homes in carbon-neutral fashion.<br/></p><p class=\"caption\">\n\tVIRGIL ANDREI\n</p><h3>Better Bot Battles</h3><br><img alt=\"Sparks fly in the BattleBots arena as a green robot attempts to saw open its red-and-black opponent like a can of tuna.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"245dcffa7b23c43b5901f4b684719188\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"32d71\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/sparks-fly-in-the-battlebots-arena-as-a-green-robot-attempts-to-saw-open-its-red-and-black-opponent-like-a-can-of-tuna.jpg?id=31959216&width=980\"/><p>For 22 years, roboticists have been dreaming up automaton warriors and sending their mechanical creations into battle. Sparks fly when these mean machines try to smash, saw, or burn their opponents into submission. The BattleBots competition is so thrilling that it continues to be televised despite a surfeit of viewing options competing for eyeballs. The latest season of the show began filming this month. When it airs, expect to see bots that have better batteries, more-refined control systems, and real-time telemetry that lets the human operators know when to, say, power down a weapon to keep it from being destroyed by overheating.<br/></p><p class=\"caption\">\n\tDISCOVERY CHANNEL\n</p></br>",
  "pubDate": "Mon, 24 Oct 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/lithium-mining",
  "category": [
    "The big picture",
    "James webb space telescope",
    "Photosynthesis",
    "Battlebots",
    "Automatons",
    "Renewable energy",
    "Astronomy"
  ],
  "dc:creator": "Willie Jones",
  "media:content": ""
}