{
  "title": "PODCAST 6-21-2019: The Car Wash Scandal Scandal, with Andrew Fishman",
  "description": "<p>I’m very pleased to welcome Andrew Fishman (<a target=\"_blank\" href=\"https://twitter.com/AndrewDFish\">@AndrewDFish</a>), managing editor for the <a target=\"_blank\" href=\"https://theintercept.com/brasil/\">Intercept Brasil</a>. He’s here to guide us through the bombshell reporting the Intercept is currently doing on the scandal involving the Operation Car Wash scandal (yes, it’s a scandal over a scandal) and what seems to have been the very politically motivated corruption prosecution of former Brazilian President Luiz Inácio Lula da Silva. That prosecution prevented Lula from running for president again in 2018 and paved the way for the election of far-right demagogue Jair Bolsonaro. We’ll talk about Lula, Operation Car Wash, and the timeline of events that brought them together, and then Andrew will take us into what the Intercept has learned about Lula’s case and the actions of its presiding judge (now Bolsonaro’s justice minister), Sérgio Moro. Enjoy!</p><p>For English readers, you can find the Intercept’s series on the Lula prosecution <a target=\"_blank\" href=\"https://theintercept.com/2019/06/17/brazil-sergio-moro-lula-operation-car-wash/\">here</a> (that’s part four but there are links to the previous three pieces). If you know Portuguese, you can go <a target=\"_blank\" href=\"https://theintercept.com/2019/06/18/lava-jato-fingiu-investigar-fhc-apenas-para-criar-percepcao-publica-de-imparcialidade-mas-moro-repreendeu-melindra-alguem-cujo-apoio-e-importante/\">here</a> and check out all seven parts published to date (the English series is a little behind).</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/podcast-6-21-2019-the-car-wash-scandal",
  "guid": "substack:post:76105",
  "dc:creator": "Derek Davison",
  "pubDate": "Fri, 21 Jun 2019 21:24:51 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 5317,
  "itunes:image": ""
}