{
  "title": "DOES BTS LIP SYNC THEIR SONGS? — BFFs EP. 102",
  "description": "<p>We are joined by O’Malley for an in house crew to do headlines to talk about whether Noah Beck and Dixie D’Amelio actually broke up, Nessa Barrett releasing her first album and subsequent appearance on Call Her Daddy, Selena Gomez and Hailey Bieber breaking the internet with their picture together, Kanye West saying Kris Jenner and Drake hooked up, the sexiest bald men rankings, Jason Sudeikis and Olivia Wilde’s going crazy when Harry Styles got involved, and Jaime Foxx getting denied from Cardi B’s birthday party, James Corden getting banned (and unbanned) from a NYC restaurant, Hot Tub Twitch streamer getting threatened by her husband, and BTS going to serve in the military (leading into an investigation about their songs and whether or not they actually perform them live). \n\nWe then get into BFFs corner where Dave ran into Alex Cooper over the weekend and talked about the Nessa Barrett interview, Bri together with Josh and Bryce leading to their marriage, Bri not wanting to live with her boyfriend anymore, and Dave’s insane take on Haunted houses. \n\nWe finish the show with a new game of “BFFs Jeopardy” which tests everyone's knowledge of past episodes, and answer some video questions from fans. \n\nSupport Our Sponsors!\nRaising Canes: Get your Cane’s fix fast by ordering through their app or online at https://barstool.link/RaisingCanesBSS\nTakis: Try Takis and face the intensity!\nBetterhelp: Go to http://betterhelp.com/bff for 10% off your first month</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "5d0b80ea-ba0b-441f-bba2-4e3b8100065e",
  "pubDate": "Thu, 20 Oct 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:00:31",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}