{
  "id": "yt:video:zXaFARzFG3c",
  "yt:videoId": "zXaFARzFG3c",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "The ABC Trials",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2019-12-07T17:00:26+00:00",
  "updated": "2022-05-24T08:30:25+00:00",
  "media:group": {
    "media:title": "The ABC Trials",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Update: The competition is now over. The winner is jongyon7192p, as he submitted a 0 A press entry. Consequently, all restrictions around collaboration and discussion about the trials are lifted. So you may stream the trials, make videos about the trials, discuss the trials, share m64s of the trials, etc. I will now start working on a video about the trials, explaining the intended solutions and how the competitors did. Please be patient as I do this, as it will take quite some time to do.\n\nI showcase The ABC Trials (a ROM hack that Kaze and I created) and offer a $1000 prize to whoever can submit a TAS of it using the fewest A presses by January 20th, 2021. This ROM hack tests your ABC TASing skills and knowledge, so I hope you’ve been paying attention all these years! In case it wasn't clear, this is a *TAS* competition, which normally doesn't allow people to share their strats, since then other TASers would see their strats and copy them.\n\nFind all rules and resources in the discord: https://discord.gg/VNZcr4C\n\nBig thanks to Kaze (https://www.youtube.com/channel/UCuvSqzfO_LV_QzHdmEj84SQ) for all his help. You see, Kaze has a Patreon (https://www.patreon.com/Kazestuff) where you can pay him to make ROM hacks for you, and so I took him up on this offer. Specifically, I told Kaze all the details of how I wanted the ROM hack to be (e.g. what platforms/objects there should be and where, what the HUD should look like, what the music should be, etc.) and he made it exactly as I envisioned. So this hack is the brainchild of my level design and Kaze’s hacking skills.\n\nAlso, thanks to JoshDuMan (https://www.youtube.com/channel/UCKd0W028Csk7WhEPjeLN5pg) for making a ROM hack for me that made it easier to test pieces of my level design.\n\nMusic\n(1) Erased from Atom Music Audio\n(2) Near Holli Jolli Village Theme from Mario and Luigi: Partners in Time\n(3) Astral Observatory Theme from The Legend of Zelda: Majora's Mask\n\nNote that as part of the licensing agreement with Atom Music Audio, I’m required to put the following links to their services:\nBandcamp - https://bit.ly/34yYkTH\niTunes - https://apple.co/2PV4IAH\nAmazon - https://amzn.to/32lojg3\nGoogle Play - http://tiny.cc/3lctfz\nSpotify - https://spoti.fi/2JUhlrP\nDeezer - https://bit.ly/33hzN5v\nTidal - https://bit.ly/2Ceq2Jw",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}