{
  "title": "George W. Bush To Teach “MasterClass” In Leadership?",
  "itunes:title": "George W. Bush To Teach “MasterClass” In Leadership?",
  "pubDate": "Fri, 26 Aug 2022 05:00:15 +0000",
  "guid": "f17e5ce4-6107-48dd-8811-2401aac4d72a",
  "link": "https://thejimmydoreshow.libsyn.com/george-w-bush-to-teach-masterclass-in-leadership",
  "itunes:image": "",
  "description": "<p>If you can believe it, ex-President George W. Bush has announced that he will be teaching a “MasterClass” in leadership that you and anyone else willing to pony up the money can take to learn what Bush has to say on the topic. Whether students will learn the ins and outs of committing war crimes, ignoring the suffering of hurricane victims and overseeing a torture program that continues to this day remains unclear.<br /> <br /> Jimmy and America’s comedian Kurt Metzger discuss the curious choice of a colossal f*ckup like George W. Bush to teach a class in leadership<br /> <br /> Plus segments on bringing MAGA and communism together and Joe Biden's meager student debt assistance program.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And phone calls from Vince Vaughn and Jake Tapper!</p>",
  "content:encoded": "<p>If you can believe it, ex-President George W. Bush has announced that he will be teaching a “MasterClass” in leadership that you and anyone else willing to pony up the money can take to learn what Bush has to say on the topic. Whether students will learn the ins and outs of committing war crimes, ignoring the suffering of hurricane victims and overseeing a torture program that continues to this day remains unclear.  Jimmy and America’s comedian Kurt Metzger discuss the curious choice of a colossal f*ckup like George W. Bush to teach a class in leadership  Plus segments on bringing MAGA and communism together and Joe Biden's meager student debt assistance program.  Also featuring Stef Zamorano and Mike MacRae! And phone calls from Vince Vaughn and Jake Tapper!</p>",
  "enclosure": "",
  "itunes:duration": "58:51",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "If you can believe it, ex-President George W. Bush has announced that he will be teaching a “MasterClass” in leadership that you and anyone else willing to pony up the money can take to learn what Bush has to say on the topic. Whether students...",
  "itunes:episodeType": "full",
  "itunes:summary": "If you can believe it, ex-President George W. Bush has announced that he will be teaching a “MasterClass” in leadership that you and anyone else willing to pony up the money can take to learn what Bush has to say on the topic. Whether students will learn the ins and outs of committing war crimes, ignoring the suffering of hurricane victims and overseeing a torture program that continues to this day remains unclear. Jimmy and America’s comedian Kurt Metzger discuss the curious choice of a colossal f*ckup like George W. Bush to teach a class in leadership Plus segments on bringing MAGA and communism together and Joe Biden's meager student debt assistance program. Also featuring Stef Zamorano and Mike MacRae! And phone calls from Vince Vaughn and Jake Tapper!"
}