{
  "guid": "urn:uuid:fc73d007-6639-42a8-a108-5b6788bd435f",
  "link": "https://www.who.int/news/item/18-10-2022-global-leaders-commit-usd-2.6-billion-at-world-health-summit-to-end-polio",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Global leaders commit US$ 2.6 billion at World Health Summit to end polio",
  "description": "The funding will support global efforts to overcome the final hurdles to polio eradication, vaccinate 370 million children annually over the next five years and continue disease surveillance across 50 countries.",
  "pubDate": "Tue, 18 Oct 2022 10:12:07 Z",
  "a10:content": "<p>Today, global leaders confirmed US$&nbsp;2.6 billion in funding toward the Global Polio Eradication Initiative&rsquo;s (GPEI) <a href=\"https://polioeradication.org/gpei-strategy-2022-2026/\" target=\"_blank\">2022-2026 Strategy</a> to end polio at a pledging moment co-hosted by Germany&rsquo;s Federal Ministry for Economic Cooperation and Development (BMZ) at the World Health Summit in Berlin.</p><p>The funding will support global efforts to overcome the final hurdles to polio eradication, vaccinate 370&nbsp;million children annually over the next five years and continue disease surveillance across 50 countries. </p><p>&ldquo;No place is safe until polio has been eradicated everywhere. As long as the virus still exists somewhere in the world, it can spread &ndash; including in our own country. We now have a realistic chance to eradicate polio completely, and we want\n    to jointly seize that chance,&rdquo; said Svenja Schulze, Federal Minister for Economic Cooperation and Development, Germany. &ldquo;Germany will remain a strong and committed partner in the global fight against polio. This year, it is providing EUR&nbsp;35\n    million for this cause. And next year we plan to further strengthen our efforts and support GPEI with EUR&nbsp;37 million &ndash; pending parliamentary approval. By supporting the GPEI, we are also strengthening national health systems. That leads\n    to healthier societies, far beyond the polio response.&rdquo;</p><p>Wild poliovirus is endemic in just two countries &ndash; Pakistan and Afghanistan. However, after just six cases were recorded in 2021, 29 cases have been recorded so far this year, including a small number of new detections in southeast Africa linked\n    to a strain originating in Pakistan. Additionally, outbreaks of <a href=\"https://polioeradication.org/polio-today/polio-now/this-week/circulating-vaccine-derived-poliovirus/\" target=\"_blank\">cVDPV</a>, variants of the poliovirus\n    that can emerge in places where not enough people have been immunized, continue to spread across parts of Africa, Asia and Europe, with new outbreaks detected in the United States, Israel and the United Kingdom in recent months. </p><p>&ldquo;The new detections of polio this year in previously polio-free countries are a stark reminder that if we do not deliver our goal of ending polio everywhere, it may resurge globally,&rdquo; said Dr. Tedros Adhanom Ghebreyesus, WHO Director-General.\n    &ldquo;We are grateful for donors&rsquo; new and continued support for eradication, but there is further work to do to fully fund the 2022-2026 Strategy. We must remember the significant challenges we have overcome to get this far against polio, stay\n    the course and finish the job once and for all.&rdquo;</p><p>At a challenging time for countries around the world, governments and partners have stepped forward to demonstrate their collective resolve to eradicate the second human disease ever. In addition to existing pledges, new commitments to the 2022-2026 Strategy\n    this fall include: </p><ul><li><strong>Australia </strong>pledged AU$ 43.55 million </li><li><strong>France</strong> pledged EUR 50&nbsp;million</li><li><strong>Germany</strong> pledged EUR&nbsp;72 million</li><li><strong>Japan</strong> pledged US$&nbsp;11 million</li><li><strong>Republic of Korea </strong>pledged<strong> </strong>KRW&nbsp;4.5 billion</li><li><strong>Luxembourg </strong>pledged EUR&nbsp;1.7 million</li><li><strong>Malta </strong>pledged EUR&nbsp;30&nbsp;000</li><li><strong>Monaco </strong>pledged EUR&nbsp;450&nbsp;000</li><li><strong>Spain </strong>pledged EUR&nbsp;100&nbsp;000</li><li><strong>Turkey </strong>pledged US$&nbsp;20&nbsp;000</li><li><strong>United States </strong>pledged US$&nbsp;114 million</li><li><strong>Bill &amp; Melinda Gates Foundation</strong> pledged US$S&nbsp;1.2 billion</li><li><strong>Bloomberg Philanthropies</strong> pledged US$&nbsp;50&nbsp;million</li><li><strong>Islamic Food and Nutrition Council of America</strong> pledged US$&nbsp;1.8 million</li><li><strong>Latter-day Saint Charities</strong> pledged US$&nbsp;400&nbsp;000</li><li><strong>Rotary International </strong>pledged US$&nbsp;150 million</li><li><strong>UNICEF </strong>pledged US$&nbsp;5 million</li></ul><p>&nbsp;</p><p>The pledging moment in Berlin marked the first major opportunity to pledge support toward the US$&nbsp;4.8 billion needed to fully implement the 2022-2026 Strategy. If the Strategy is fully funded and eradication achieved, it is estimated that it would\n    result in <a href=\"https://polioeradication.org/financing/financial-needs/investment-case-2022-2026/\" target=\"_blank\">US$&nbsp;33.1 billion in health cost savings</a> this century compared\n    to the price of controlling outbreaks. Further, continued support for GPEI will enable it to deliver additional health services and immunizations alongside polio vaccines to underserved communities. </p><p>\"Children deserve to live in a polio-free world, but as we have seen this year with painful clarity, until we reach every community and vaccinate every child, the threat of polio will persist,\" said UNICEF Executive Director Catherine Russell. \"UNICEF\n    is grateful for the generosity of our donors and the pledges made today, which will help us finish the job of eradicating polio.&nbsp; When we invest in immunization and health systems, we are investing in a safer, healthier future for everyone, everywhere.&rdquo;</p><p>In addition to the funding for GPEI announced today, a group of more than 3&nbsp;000 influential scientists, physicians, and public health experts from around the world <a href=\"https://www.poliodeclaration.org/\" target=\"_blank\">released a declaration</a> endorsing the 2022-2026 Strategy and calling on donors to stay committed to eradication and ensure GPEI is fully funded. The group points to new tactics contained in the program&rsquo;s strategy, like the continued roll-out of the novel oral polio\n    vaccine type 2 (nOPV2), that make them confident in GPEI&rsquo;s ability to end polio. Five hundred million doses of nOPV2 have already been administered across 23 countries, and field data continue to show its promise as a tool to more sustainably\n    stop outbreaks of type 2 cVDPV. The group further asserts that support for eradication significantly strengthens immunization systems and pandemic preparedness around the world&mdash;pointing to GPEI&rsquo;s support for the COVID-19 response&mdash;and\n    urges endemic and polio-affected country leadership to stay committed to expanded vaccination and disease surveillance activities.</p><p>&ldquo;Pakistan has made incredible progress against polio, but recent challenges have allowed the virus to persist,&rdquo; says Dr. Zulfi Bhutta (Chair of Child Global Health, Hospital for Sick Children, Canada, and Distinguished University Professor,\n    Aga Khan University, Pakistan). &ldquo;Polio, like any virus, knows no borders; its continued transmission threatens children everywhere. Stopping this disease is not just urgently needed now, it&rsquo;s within our grasp. That&rsquo;s why I&rsquo;ve\n    joined more than three thousand health experts from around the world to launch the 2022 Scientific Declaration on Polio Eradication. With strong financial and political commitments, our long-awaited vision of a polio-free world can become a reality.&rdquo;<br /><br /></p><h3>Additional quotes from the pledging moment</h3><p><strong>Mark Suzman, CEO, Bill &amp; Melinda Gates Foundation, said: </strong>&ldquo;The question is not whether it&rsquo;s possible to eradicate polio&mdash;it&rsquo;s whether we can summon the will and the resources to finish the job. The Bill &amp;\n    Melinda Gates Foundation is grateful to Germany, Rotarians, donors, countries, scientists, and partners who stood together today to show that we are united in this goal. We look forward to working together to create a polio-free future and build more\n    equitable and resilient health systems for all.\"</p><p><strong>Seth Berkley, CEO, Gavi, the Vaccine Alliance, said: </strong>&ldquo;As we work together to stop the transmission of all polioviruses globally, we are more grateful than ever for the generosity of our donors, the leadership of governments and\n    the mobilization of communities. Today&rsquo;s pledges will support GPEI&rsquo;s new strategy which correctly focuses on mass vaccination campaigns, concerted efforts by partners to strengthen essential immunization and integration with other critical\n    health interventions and a further roll out of next-generation oral polio vaccines. These three measures combined are essential if we are to eradicate polio once and for all.&rdquo;<strong></strong><strong></strong></p><p><strong>Franz Fayot, Minister for Development Cooperation and Humanitarian Affairs, Luxembourg, said: </strong>&ldquo;Luxembourg is proud to be a longstanding supporter of global efforts to eradicate polio. Building on the remarkable progress achieved\n    so far, Luxembourg will continue to support the fight against polio until we ensure the protection of every child.&rdquo;</p><p><strong>Ian Riseley, Chair, Rotary Foundation, said: </strong>&ldquo;While polio exists anywhere, it is a threat everywhere. This is an opportune moment for the global community to recommit to the goal and ensure the resources and political will are fully\n    available to protect children from polio paralysis while building stronger health systems. That is why today, Rotary is reaffirming its commitment of an additional USD 150 million to the global effort to eradicate&nbsp;polio.&rdquo;</p><p><strong>His Excellency Abdul Rahman Al Owais, Minister of Health and Prevention, United Arab Emirates, said:</strong>&nbsp;&ldquo;Polio outbreaks this year have emphasized that polio anywhere is a threat to communities everywhere. While we are encouraged\n    by steady progress in Pakistan and Afghanistan in the drive towards polio eradication, we know that there is a ways to go to finish the job. We also know that this progress would not have been possible without the courageous contributions of frontline\n    health workers, who have remained steadfast in their commitment to protecting their communities from polio in the face of the pandemic, natural disasters and threats to their physical safety. Under the leadership of His Highness Sheikh Mohamed bin\n    Zayed Al Nahyan, President of the UAE, we join our international partners in reiterating our commitment to a polio free world.\"<br /><br /></p><h3>Notes for editors</h3><p>The Global Polio Eradication Initiative is a public-private partnership led by national governments with six core partners &ndash; Rotary International, the World Health Organization (WHO), the US Centers for Disease Control and Prevention (CDC), UNICEF,\n    the Bill &amp; Melinda Gates Foundation and Gavi, the Vaccine Alliance. For more information on the global effort to end polio, visit <a href=\"http://polioeradication.org\" target=\"_blank\">polioeradication.org</a>.&nbsp;</p><p><strong>&nbsp;</strong></p>"
}