{
  "title": "Lessons from the pandemic: collaboration in healthcare",
  "link": "https://audioboom.com/posts/7972702",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1599,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Over the past months, under the weight of a global pandemic, scientists and medical professionals have had to rethink the way they do things. We found not one - but numerous - vaccines within the space of a year; new treatments have been discovered, some repurposed from existing drugs; and manufacturers and politicians alike have had to think creatively to plug the gaps of the pandemic.<br>\n<br>\n\n</div>\n<div>There must be lessons we can learn from this experience - things that big pharma and scientists can do better in the future, having this time round done so in emergency circumstances. That’s the topic of this special episode of <em>The Spectator</em>’s podcast, sponsored by the pharmaceutical company Novartis.<br>\n<br>\n\n</div>\n<div>I’m delighted to be joined by a panel of expert guests. Chinmay Bhatt, Managing Director in the UK for Novartis, who we pressed on the importance of data science in pharmaceuticals. Professor Paul Martin, a sociologist tasked with finding better ways to collaborate between the medical sector and other sectors, who enlightened us on the un-mined potential of repurposing existing drugs. And Dr Nicole Mather, the Life Sciences Lead at the technology company IBM, who has been crucial to the UK’s pandemic response and working with regulators. She nicely summed up - through the lens of regulation - the kind of corners that can be cut, without compromising on healthcare quality:<br>\n<br>\n\n</div>\n<div>'What Covid has been really helpful in, is helping us think about what's really essential. So a lot of the regulatory process has been pared back, or been able to run in parallel. So regulators are not doing away with any steps - just addressing them in a more thoughtful fashion'.</div>\n",
  "pubDate": "Wed, 03 Nov 2021 14:45:00 +0000",
  "guid": "tag:audioboom.com,2021-11-03:/posts/7972702",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}