{
  "title": "A new way to help students turn in their best work",
  "link": "https://blog.google/outreach-initiatives/education/originality-reports/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Today’s students face a tricky challenge: In an age when they can explore every idea imaginable on the internet, how do they balance outside inspiration with authenticity in their own work? Students have to learn to navigate the line between other people’s ideas and their own, and how and when to properly cite sources.</p><p>We've heard from instructors that they copy and paste passages into Google Search to check if student work is authentic, which can be repetitive, inefficient and biased. They also often spend a lot of time giving feedback about missed citations and improper paraphrasing. By integrating the power of Search into our assignment and grading tools, we can make this quicker and easier. </p><p>That’s why Google is introducing <a href=\"http://edu.google.com/products/originality\">originality reports</a>. This new feature—with several reports included free in every course—will be part of <a href=\"https://edu.google.com/products/classroom/?modal_active=none\">Classroom</a> and <a href=\"https://blog.google/outreach-initiatives/education/introducing-assignments\">Assignments</a>, which was also announced today. We create originality reports by scanning student work for matched phrases across hundreds of billions of web pages and tens of millions of books. </p><p>When assigning work in Classroom and Assignments, instructors will have the option to enable originality reports. Students will then be able to run up to three originality reports on documents they attach to the assignment before submitting their work. This heads-up gives students an opportunity to proactively improve their work, and also saves time for instructors. </p><p>After submission, a fresh originality report will automatically be available to instructors when grading the assignment. These reports will flag text that has missed citations and has high similarity with text on the web or in books.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Analyze student work with originality reports in Google Assignments\" class=\"article-image--large\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Analyze_social_1.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>But comparing work to search results isn’t the only way to ensure authentic work. Coming soon, schools can choose to have their own private repository of past student submissions, so instructors can receive originality reports that include student-to-student matches within the same school. </p><p>Once the feature is generally available, instructors will be able to access originality reports at no charge for up to three assignments in each course they teach. Schools that would like unlimited access can upgrade their instructors to <a href=\"https://edu.google.com/products/gsuite-for-education/enterprise/?modal_active=none\">G Suite Enterprise for Education</a>.  During the initial, limited testing period, all instructors can use originality reports as much as they would like to, at no charge. We’ll continue to add features at no additional cost to G Suite for Education. <br/></p><p>To use originality reports with Classroom, sign up to apply to be part of the testing program by <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSflQoXEBjFx9WMglISWJMY8FS0Ml41kFTmDrfvBs9eqF4kxnQ/viewform\">filling out our form</a>. To try Assignments, which includes originality reports automatically, <a href=\"http://edu.google.com/assignments\">sign up through our website</a>.</p><p>We’re looking forward to seeing how teachers and students alike use the tool to create work that’s both authentic and original. </p></div></div></body></html>",
  "pubDate": "Wed, 14 Aug 2019 16:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/education/originality-reports/",
  "category": [
    "Education",
    "Google Workspace",
    "Docs",
    "Drive"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "A new way to help students turn in their best work",
    "description": "Originality reports scan student work for matched phrases across hundreds of billions of web pages and tens of billions of books.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/B2S-BlogHeader-ap_v05-2880x1200.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/education/originality-reports/"
  },
  "author": {
    "name": "Brian Hendricks",
    "title": "Product Manager",
    "department": "Assignments",
    "company": ""
  }
}