{
  "title": "87: Protecting Your Brain from 4 Invisible Super-Villains with Ben Greenfield",
  "pubDate": "Thu, 06 Dec 2018 15:19:09 +0000",
  "guid": "2ab3cd90eaed4fe7b8e45d2464ffef3f",
  "link": "https://sites.libsyn.com/94610/87-protecting-your-brain-from-3-invisible-super-villains-with-ben-greenfield",
  "itunes:image": "",
  "description": "<p>What are the invisible super-villains that are wreaking havoc on your brain?<br /> <br /> This topic is near and dear to my heart. Through this podcast series, I love sharing with you the things we can do to level up our brains, and while it’s important to talk about what to do, it’s also important to cover the obstacles, the invisible forces that are taking you away and holding you back.<br /> <br /> To discuss this topic, we have Ben Greenfield, NYT Bestselling Author of “Beyond Training.” Ben is a professional obstacle course racer, completing the coveted Spartan Delta, training with the Navy SEALs, competing across the globe in open water swims, mountain runs, and adventure races, and winning multiple USA bowhunting competitions.<br /> <br /> In this episode, we talk about 4 invisible super-villains and what you can do to protect yourself from them.<br /> <br /> ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **<br /></p>",
  "content:encoded": "<p>What are the invisible super-villains that are wreaking havoc on your brain?  This topic is near and dear to my heart. Through this podcast series, I love sharing with you the things we can do to level up our brains, and while it’s important to talk about what to do, it’s also important to cover the obstacles, the invisible forces that are taking you away and holding you back.  To discuss this topic, we have Ben Greenfield, NYT Bestselling Author of “Beyond Training.” Ben is a professional obstacle course racer, completing the coveted Spartan Delta, training with the Navy SEALs, competing across the globe in open water swims, mountain runs, and adventure races, and winning multiple USA bowhunting competitions.  In this episode, we talk about 4 invisible super-villains and what you can do to protect yourself from them.  ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "enclosure": "",
  "itunes:duration": "19:54",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What are the invisible super-villains that are wreaking havoc on your brain?  This topic is near and dear to my heart. Through this podcast series, I love sharing with you the things we can do to level up our brains, and while it’s important to talk...",
  "itunes:episodeType": "full"
}