{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-2886339920488994153",
  "published": "2021-12-15T06:00:00.001-05:00",
  "updated": "2021-12-15T06:00:00.157-05:00",
  "title": "Our $600,000 commitment to reskill Indigenous job seekers for new careers in technology",
  "content": "<div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEh8S878RoTCU7nGyQ5hzg7LmQf6Bip_L5WL229ofBYQQHZcW2nRd9NFGq3dvCkBDEVfsEx4qCnDpmW709AwKAtFP2kv11Sy6gkd_ZIOjh-V75gj_10bmx26COZ2o-CDaZjVM9mL3q89RzWmdng7QmHTlVnSDsuRreuo8Ohd9ovCcVrFLRaQSsLtQfl1=s1000\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"562\" data-original-width=\"1000\" height=\"360\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh8S878RoTCU7nGyQ5hzg7LmQf6Bip_L5WL229ofBYQQHZcW2nRd9NFGq3dvCkBDEVfsEx4qCnDpmW709AwKAtFP2kv11Sy6gkd_ZIOjh-V75gj_10bmx26COZ2o-CDaZjVM9mL3q89RzWmdng7QmHTlVnSDsuRreuo8Ohd9ovCcVrFLRaQSsLtQfl1=w640-h360\" width=\"640\" /></a></div><br /><div><br /></div><div><br /></div><a href=\"https://thoughtleadership.rbc.com/building-bandwidth-preparing-indigenous-youth-for-a-digital-future/\">Research shows</a> there’s a significant skills and education gap between Indigenous and non-Indigenous populations in Canada, particularly when it comes to connectivity, graduation rates and digital literacy. And the economic impact of the pandemic has increased this divide, disproportionately impacting the employment rates of Indigenous populations. As Canada rebuilds post COVID-19, we have an opportunity to build back a more inclusive and resilient economy.&nbsp;<div><br /></div><div><br /><div><br /></div><div>That’s why today, Google Canada announced a $600,000 commitment to provide free digital skills training to Indigenous job seekers across Canada. The support includes a $500,000 Google.org grant towards <a href=\"https://www.comit.org/\" target=\"_blank\">ComIT’s Recoding Futures</a> IT training program, an additional $100,000 in funding to support <a href=\"https://indspire.ca/\">Indspire</a> with their education and job training programs and an allocation of Google Career Certificate scholarships for Indigenous job seekers.&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div>ComIT’s Recoding Futures program was created last year with the support of Google.org to provide IT training to Indigenous learners across Canada. In the first year of the Recoding Futures program, we saw overwhelming interest, with over 800 applicants, double than what was expected. Our additional support of the program moving forwards will allow ComIT to expand the program and accommodate as many applicants as possible. The program runs virtually and covers topics like Design Thinking, HTML, CSS, Javascript .NET, Python, React and Node.&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div>Google Canada’s $100,000 commitment to Indspire will support their existing job training programs, and we will also provide an allocation of dedicated Google Career Certificate scholarships for Indigenous job seekers. The scholarships can be used towards Google Career Certificate courses, which are delivered through NPower Canada and equips learners with theoretical and practical knowledge to be successful in an entry-level technology job.&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div>Applications are now open for ComIT’s Recoding Futures program. Interested applicants can visit <a href=\"http://ComIT.org\">ComIT.org</a> to register.&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div>For more information on Google Career Certificates visit <a href=\"https://grow.google/intl/ALL_ca/programs/certificates/\">g.co/certificates-canada</a>. To find out more on scholarships available, visit Indspire’s <a href=\"https://indspire.ca/\" target=\"_blank\">website</a>.&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div>Today’s support is in addition to Google Canada’s <a href=\"https://www.newswire.ca/news-releases/google-canada-commits-2-million-to-reskill-job-seekers-for-new-careers-in-technology-in-under-six-months-858585059.html\" target=\"_blank\">$2 million commitment</a> to reskill job seekers for new careers in technology in under six months, announced earlier this year. We look forward to working alongside ComIT and Indspire to help bridge the longstanding digital divide between Indigenous and non-Indigenous communities, increase free access to digital skills education and support economic growth within Indigenous communities.&nbsp;</div><div><br /></div><div><br /></div><div><span class=\"post-author\"><br /></span></div><div><span class=\"post-author\">Posted by Sabrina Geremia, VP and Country Manager, Google Canada</span></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}