{
  "itunes:episode": 103,
  "title": "Otherworldly Artistic Creation with Shing Yin Khor",
  "pubDate": "Tue, 20 Nov 2018 23:28:00 +0000",
  "link": "https://newdisrupt.org/blog/2018/11/20/otherworldly-artistic-creation-with-shing-yin-khor",
  "guid": "tag:soundcloud,2010:tracks/533142972",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:55:42",
  "description": "<p><a href=\"http://shingkhor.com\">Shing Yin Khor</a> is a multi-dimensional artist, almost literally. She’s a cartoonist, illustrator, sculptor, and installation and experimental artist. She works across many media, technology, and ideas. She says she’s entered a new phase of her career over the last five years, and we talk about her work, empathy, and how she got here.</p>\n<h2>Sponsors</h2>\n<p>This episode is brought to you in part by Disruptor-level patrons Chris Higgins, Marcin Wichary, Kim Ahlberg, Pete Burtis, and Jon Mitchell. You can <a rel=\"payment\" href=\"https://newdisrupt.org/support/\">become a patron of the show</a> on a one-time or recurring basis, and get rewards like an exclusive enamel pin and being thanked in this fashion!</p>\n<p>The New Disruptors is also back on the virtual air thanks to Glowforge, a “3D laser printer” that can cut wood, paper, acrylic, leather, and more, and engrave metal, glass, and other materials. It’s a laser printer for depth. Listeners to New Disruptors can <a href=\"http://glowforge.com/newdisruptors\">get a discount from $100 to $500</a> on a new Glowforge.</p>\n<h2>Show notes</h2>\n<ul>\n<li>You should definitely <a href=\"https://www.instagram.com/sawdustbear/\">follow Shing on Instagram</a>, <a href=\"https://www.patreon.com/shing\">visit her Patreon</a>, and read her on Twitter</li>\n<li><a href=\"http://www.jimwoodring.com\">Jim Woodring</a>, a cartoonist with a comprehensively different world, <a href=\"https://www.flickr.com/photos/glennf/sets/72157625663478045/with/5341913150/\">also created a 7-foot-pen</a></li>\n<li>Does it require 10,000 hours to master something? <a href=\"http://www.bbc.com/future/story/20121114-gladwells-10000-hour-rule-myth\">Not really</a>.</li>\n<li><a href=\"http://otherworldscience.com/page/98\">The Center for Otherworld Science</a></li>\n<li>Portal's <a href=\"https://mediamindwaves.wordpress.com/2014/08/04/women-chell-glados-portal-and-how-to-do-it-right/\">protagonist is a woman</a></li>\n<li><a href=\"https://twitter.com/sawdustbear/status/1037538319226134529\">The Blue Ox Bar</a> at the XOXO Festival</li>\n<li>The <em>Popeye</em> movie was filmed in Malta, and the former sets <a href=\"https://twitter.com/sawdustbear/status/1003997191847854081?lang=en\">were turned into a peculiar theme park</a></li>\n<li>The <a href=\"https://www.wbstudiotour.co.uk\">Harry Potter “Warner Brothers Studio Tour”</a> outside London is actually a celebration and explanation of all the beautiful craftwork that goes into making those films</li>\n<li>Resistance Cranes <a href=\"https://resistancecranes.com\">raised $10,000 in October 2018</a> to aid refugees and immigrants</li>\n</ul>      ",
  "itunes:subtitle": "Shing Yin Khor creates art across many forms: cartoons, installations, sculpture, and more.",
  "itunes:summary": "Shing Yin Khor is a multi-dimensional artist, almost literally. She's a cartoonist, illustrator, sculptor, and installation and experimental artist. She works across many media, technology, and ideas. She says she's entered a new phase of her career over the last five years, and we talk about her work, empathy, and how she got here.\n\nThis episode sponsored by Glowforge. Get a $100 to $500 discount off the company’s unique “3D laser printers” that cut and engrave a huge range of materials from stone to wood to leather to acrylic by visiting this special link: https://glowforge.com/newdisruptors\n\nSupport the podcast!\n\nThe crowdfunding campaign brought back The New Disruptors, but I could produce more episodes and keep the show running after July 2019 with your help! You can contribute monthly via Patreon or become a yearly subscriber directly on this site—and get nifty bonuses and rewards. https://newdisrupt.org/support"
}