{
  "title": "How to predict abstention rates with open data",
  "dc:creator": "Louis Dorard",
  "pubDate": "Tue, 29 Jul 2014 08:46:00 +0000",
  "link": "https://www.ownml.co/blog/predict-abstention-rates-open-data",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:53ac25e1e4b01cbc3292f0f7",
  "description": "Open data is a way to increase transparency into what happens in our \nsociety. When coupled with predictive modelling, it becomes a way to \ninterpret why things happened. Even though it sounds complex, these \ntechniques have become accessible to the masses. Let's see how this works \nwith elections data.\n\nCo-authored with Alexandre Vallette",
  "content:encoded": "<p><em>This post was written in collaboration with <a href=\"http://twitter.com/vallettea\">Alexandre Vallette</a> who's my co-author on an upcoming guide to hacking with open data (scroll down to find out more).</em></p>\n\n\n<p>Open data is a way to increase transparency into what happens in our society. When coupled with predictive modelling, it becomes a way to interpret <em>why</em> things happened. Even though it sounds complex, these techniques have become accessible to the masses. Let's see how this works with elections data.</p>\n\n<h2 id=\"itsallaboutthecontext\">It's all about the context</h2>\n\n<p>Let's say you're given abstention rates for every township in an election. You can create a heat map to visually identify regions of high/low rates.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  \n  \n    \n\n      \n\n      \n        <figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5206b718e4b0bdc26006bae2/1405878157278-4C5AT6FUCEGV2DFPGLHX/image-asset.jpeg\" data-image-dimensions=\"1757x1767\" data-image-focal-point=\"0.5,0.5\" alt=\"Heat map of the abstention rate for the 2008 mayoral elections in France, courtesy of Snips / Alexandre Vallette\" data-load=\"false\" data-image-id=\"53cbff8ce4b02c6d14ac032e\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5206b718e4b0bdc26006bae2/1405878157278-4C5AT6FUCEGV2DFPGLHX/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n          \n          <figcaption class=\"image-caption-wrapper\">\n            <p>Heat map of the abstention rate for the 2008 mayoral elections in France, courtesy of <a href=\"http://snips.net/blog/posts/2014/02-18-predicting-abstention-rate-from-open-data.html\">Snips / Alexandre Vallette</a></p>\n          </figcaption>\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n\n<p>On election night, everyone has their own interpretation of why rates were higher or lower than average in certain places. But these are only speculations — they are not based on facts that have been measured. What if you could use machines to crunch all the open data that's available in order to find patterns across the townships where abstention rates are high/low?</p>\n\n<p>As a first step to do that, <a href=\"https://twitter.com/vallettea\">Alexandre Vallette</a> showed <a href=\"http://snips.net/blog/posts/2014/02-18-predicting-abstention-rate-from-open-data.html\">how you could enrich elections data</a> by merging different sources of open data into a representation of the \"context\" of each township, with information such as population, hourly salary, number of people living in social housings, etc. Alexandre then applies machine learning to create a model of the relationship between <em>context</em> and <em>abstention rate</em>. This model can be used to make predictions for future elections, or to estimate how slight changes in a given context could impact the outcome (the abstention rate). He implemented this idea on French mayoral elections, but his method can be adapted to any other election anywhere else. The data he used for the 37586 French communes can be downloaded <a href=\"https://bml-data.s3.amazonaws.com/communes.csv.gz\">here</a> (35.2 MB, gzipped CSV file).</p>\n\n<h2 id=\"predictivemodelsmadeeasy\">Predictive models made easy</h2>\n\n<p>In this post, I want to show you two more things:</p>\n\n<ol>\n<li>If you use <em>descriptive</em> predictive models such as <em>decision trees</em>, you can see how predictions are made as sequences of rules. For instance: <strong>IF</strong> (hourly salary > 9.78) <strong>AND</strong>  (number of people in social housings > 1118) <strong>AND</strong> (region = ile-de-france) <strong>THEN</strong> (abstention = 65.61%).</li>\n<li>Anyone can create such models with services like BigML that abstract away the technical complexities of predictive modelling. All it takes is to upload data to the service and to select the target to predict (here, the abstention rate).</li>\n</ol>\n\n<p>Below is a \"SunBurst\" visualization of the model I built with BigML, using the same data as Alexandre (click on ‘View on BigML’ to see a bigger version).</p>\n<iframe allowfullscreen=\"allowfullscreen\" src=\"https://bigml.com/embedded/model/oMTcOM4PWyomwBY8DiidBY6dflv\" allowtransparency=\"true\" width=\"100%\" frameborder=\"0\" height=\"400px\"></iframe><p><strong>How to read the SunBurst visualization:</strong></p>\n\n<ul>\n<li>Each arc corresponds to a set of townships that satisfy certain conditions — hover your mouse over a few of these arcs to see examples.</li>\n<li>The color of the arc reflects the average predicted abstention rate for the corresponding set of townships.</li>\n<li>Arcs are split into sub-arcs, representing subsets, as you move away from the center.</li>\n<li>The number of degrees spanned by an arc is proportional to the number of townships found in the data that belong to the corresponding set.</li>\n</ul>\n\n<p>Note that this model is just one way to interpret the data and to present the correlations that were found. Even though we are dealing with a rule-based model, bear in mind that the \"features\" used in the rules to characterize townships are not necessarily causes of abstention. <a href=\"http://en.wikipedia.org/wiki/Correlation_does_not_imply_causation\">Correlation does not imply causation</a> — if you take the example of sunglasses and ice-cream, their sales are correlated but one does not cause the other.</p>\n\n<h2 id=\"somemoredetails\">Some more details</h2>\n\n<p>Actually, I did something a tiny bit more sophisticated than just uploading the data to BigML. I uploaded the data to create a first model, and BigML showed me the 10 most important context features to predict abstention. To make the data smaller and the model simpler, I then removed the other features (there were 930 of them originally) and I built a new model based on this selection of 10 features ('hourly salary', 'population', 'latitude', 'people in social housings', 'region', 'registered', 'people age 0-14', 'households w. people in intermediate occupations', 'farmers', 'households with individual electrical heating'). The data shrunk from 176.5 MB to 2.5 MB (download it <a href=\"https://bml-data.s3.amazonaws.com/communes-selected-columns.csv\">here</a>). As a comparison, <a href=\"https://github.com/jseabold/538model\">when you replicate Nate Silver's 538 Election Forecasting Model</a> (US 2012 presidential elections), you get a dataset of only 188 KB.</p>\n\n<h3 id=\"howaccurateisthemodel\">How accurate is the model?</h3>\n\n<p>To evaluate the accuracy of the model, I did an 80-20% split of the data. The first part was used to build a model, the second one was used to make predictions and to compare them to the true — withheld — abstention values. On average, there was a difference of 7.52 points between predicted and actual abstention rates. With an R-squared value of 0.5 (the maximum being 1 and the baseline 0), the model works reasonably well.</p>\n\n<p>If you're interested in finding out more about how the data was assembled, check out Alex's <a href=\"https://github.com/vallettea/politics-open-data\">source code on Github</a>.</p>\n\n\n\n\n\n\n  <form method=\"POST\" novalidate data-form-id=\"53cd349ee4b0a11d417f7e4a\" autocomplete=\"on\" onsubmit=\"return (function (form) {\n    Y.use('squarespace-form-submit', 'node', function usingFormSubmit(Y) {\n      (new Y.Squarespace.FormSubmit(form)).submit({\n        formId: '53cd349ee4b0a11d417f7e4a',\n        collectionId: '5206b959e4b0bdc26006be4a',\n        objectName: 'item-53ac25e1e4b01cbc3292f0f7'\n      });\n    });\n    return false;\n  })(this);\" class=\"newsletter-form\">\n    <header class=\"newsletter-form-header\">\n      <h2 class=\"newsletter-form-header-title\">Coming soon: \"Hacking with Open Data\"</h2>\n      <p>Alexandre Vallette and me are writing a sponsored guide to innovation with open data that will feature this case study. Sign up here to be notified!</p>\n    </header>\n    \n      \n        \n        \n          \n            \n              <label for=\"email-yui_3_17_2_1_1405951496514_38554-field\" class=\"newsletter-form-field-label title\">Email Address</label>\n              <input autocomplete=\"email\" spellcheck=\"false\" name=\"email\" id=\"email-yui_3_17_2_1_1405951496514_38554-field\" placeholder=\"Email Address\" type=\"email\" class=\"newsletter-form-field-element field-element\" x-autocompletetype=\"email\" />\n            \n          \n        \n          \n        \n      \n      \n        <button\n          class=\"\n            newsletter-form-button\n            sqs-system-button\n            sqs-editable-button-layout\n            sqs-editable-button-style\n            sqs-editable-button-shape\n            sqs-button-element--primary\n          \"\n          type=\"submit\"\n          value=\"Sign Up\"\n        >\n          <span class=\"newsletter-form-spinner sqs-spin light large\"></span>\n          <span class=\"newsletter-form-button-label\">Sign Up</span>\n          <span class=\"newsletter-form-button-icon\"></span>\n        </button>\n      \n      \n        \n      \n    \n    <p>We won't send spam. You can unsubscribe at any time.</p>\n    Thank you!\n    \n  </form>\n\n<p>Enjoyed this article? <a href=\"https://news.ycombinator.com/submit\" class=\"hn-button\" data-title=\"How to predict abstention rates with open data\" data-url=\"http://www.louisdorard.com/blog/predict-abstention-rates-open-data\">Vote on Hacker News</a> and <a href=\"http://www.twitter.com/louisdorard\">follow me!</a></p>",
  "media:content": {
    "media:title": "How to predict abstention rates with open data"
  }
}