{
  "id": "yt:video:rU0vxgjBNBU",
  "yt:videoId": "rU0vxgjBNBU",
  "yt:channelId": "UCJZ94qp4dtCw0Q5UQqAkg7w",
  "title": "Lars Andersen has trained new Robin Hood star",
  "link": "",
  "author": {
    "name": "larsandersen23",
    "uri": "https://www.youtube.com/channel/UCJZ94qp4dtCw0Q5UQqAkg7w"
  },
  "published": "2018-10-22T17:39:39+00:00",
  "updated": "2022-05-31T23:10:40+00:00",
  "media:group": {
    "media:title": "Lars Andersen has trained new Robin Hood star",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Taron Egerton learned amazing archery, not computer animation. Several historical archery experts was involved in the creation of the new Robin Hood movie.\n\nUsually movie archery is a combination of computer animation and limited knowledge about historical archery, the new Robin Hood movie is different!!\nThe upcoming Robin Hood movie starring Taron Egerton has been underway for some years now. For me, the journey started in 2015, when Otto Bathurst, the director of the movie, traveled to Denmark to get instruction in the art of historical archery.\nI’ve since trained several of the actors in the film, and a couple of them became very good with the bow and arrow. Taron, who plays Robin Hood, might not be able to shoot as well as the legendary archer, but he’s not too far behind.\nDuring the process, I was fortunate enough to be allowed to develop some of the archery tricks that are seen in the movie - something which I’m both proud of, and humbled by.\nTogether with the researcher Bede Dwyer (the person I know with the most comprehensive knowledge about archery) and Nick “Bigbowbrum” Birmingham, I got the opportunity to influence how archery was portrayed in the film.\nIn order to train the actors, I needed a whole new training system. Taron Egerton especially proved to be a challenge here, since I needed to train him to be able to do amazing shots himself right from the start. The saying was “The less CGI arrows the better”.\nTaron worked hard over the course of 2016-2017 to be able to play the part of this “historic super archer”. From the very beginning I had hoped it would be possible to teach him how to shoot incredibly fast, since speed is an essential component of several of the historic archery “expert” systems.\n\nI have made a page about the three historical texts, that allow us to do calculations on speed here: http://23.dk/9historiskehastighed.html\nAs I wanted to document this process, I’ve put together two videos - one that’s fast and dirty and to the point, and the other (much longer!), where we get to geek out and get technical and nerdy about historical archery.\nObviously, even a Hollywood movie has its limitations on budget and what’s possible, but in the end, a lot of what we wanted to do, ended up in the final film.\nI hope you’ll enjoy watching this behind-the-scenes footage as much as I enjoyed being there for the making of it.\n\nFINAL WORDS\nThank you for watching my videos and for reading.\nI will remove rude and dumb comments.\nI will also remove dumb “archery experts” comments.\n\nLars Andersen 2018",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}