{
  "title": "Episode #25 - Featuring Danny Garcia",
  "description": "<p><p>On today’s installment of Million Dollaz Worth Of Game Gillie, Wallo & Dev share the table with special guest Boxing Superstar Danny “Swift” Garcia. Danny gives his very blunt thoughts on possible future opponents Manny Pacquiao, Errol Spence Jr & Terrence Crawford.&nbsp;<br><br>Also, Gillie poses the question: “Is Responding to a sexual Advance from another woman considered cheating?”<br><br>Wins & Losses (4:07)<br>Wallo Vs. DeadEye Lou (8:30)<br>Swimming With Losers (22:09)<br>Six Toes (26:50)<br>Future Opponents (29:06)<br>Is it cheating? (35:10)<br>Double Standards (42:29)<br>Child Support & Jody (49:29)<br>Stories From The Cell: Self Inflicted Parole (54:38)<br>Vision & Discipline (59:35)<br>Million Dollaz Worth Of Game: “CUT IT OUT”<br>(1:03:38)<br><br><br>••••••••••••••••••••••••••••••••••••••••<br><br>The Million Dollaz Worth of Game show, a weekly podcast with rapper Gillie Da King and social media influencer and disruptor Wallo267 (who are also first-cousins) targeting their combined social media presence of over 1.3 million followers.<br><br><br>Gillie and Wallo’s audiences have been demanding a podcast and this is the delivery.&nbsp; For their audience, the Million Dollaz Worth of Game show bridges the gap between social media and reality tv, satiating the hunger for original and authentic content.<br><br>Follow Us On Instagram:<br>@mworthofgame<br>@wallo267<br>@gillie_da_king<br>@DevinWade<br><br>Website for Merch:<br>https://www.mworthofgame.com&nbsp;</p><br><br></p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/mworthofgame\">barstool.link/mworthofgame</a></p>",
  "guid": "Buzzsprout-1756963",
  "pubDate": "Tue, 24 Sep 2019 01:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/million-dollaz-worth-of-game",
  "itunes:explicit": "yes",
  "itunes:duration": "01:11:15",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}